{
  "url": "https://voxday.net/2024/04/07/a-man-of-sound-opinion/",
  "scraped_at": "2026-01-08T14:29:15.082787",
  "title": "A Man of Sound Opinion",
  "date_display": "April 7, 2024",
  "date_iso": "2024-04-07T14:46:39+00:00",
  "date_from_url": "2024-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the greatest science fiction grandmasters of his generation <a href=\"https://www.scifiwright.com/2024/04/books-i-could-not-finish/\">shares his very sound opinion</a> of some popular works of genre fiction, including two of his fellow grandmasters.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I was crushed on the Wheel of Time like a hindoo sacrifice being crushed by the great god Juggernaut.</p><p>Why could I not finish? This one is also hard to explain. The characters theoretically should have been a lovable as the picked-upon orphan-boy in HARRY POTTER, or the smart-but-shy Hermione. I mean, come on, a farm boy with a dread destiny, his honest blacksmith friend, and their friend who is good with dice. Not to mention Aes Sedai and way-cool ninja swordfighting moves and magical gateways and Dark Lords galore. But it never clicked with me: I was slogging halfway through the fifth or sixth book (yes, I stayed with it that long) when I realized that I wanted the main character to die because he was out of his mind, I wanted the gambler fellow to die because he was turning all dark and crooked, and I did not care of the blacksmith fellow lived or died, because he was spinning his wheels not doing much of anything. Somewhere along the way, I had lost all sympathy for all the heroes and all their goals–if they had goals. I mean, I had clambered up a mountain of thousands of gray pages, and I was still waiting for that “Council of Elrond” moment when Some Wise Mage tells Frodo-lite what the quest is. No one seemed to be doing anything and no one had a plan. And I wanted all of them to die.</p><p>Now, in all fairness, this last might not have been a fault of the author. I am a cruel and sadistic man, like many readers, and I only read when I am a foul mood, either right before a gladiatorial game or an afternoon of kitten-stomping. So maybe it is just me.</p><p>But Rand-al’Thor really did get on my nerves after a while. He seemed a character simply too small for the role. If Ranma Soatome has been the Dragon of that world, the Dark Lord Bumbershoot (or whatever his name was) would have at least been booted in the head before five books ground wearily by. If Paul Mu’ad-Dib had been the dragon, by then would have at least disrupted the spice production. SOMETHING would have happened.</p></blockquote><p>I, too, hated <em>THE WHEEL OF TIME.</em> Hated, hated, hated it, and finally gave up partway through book seven. To this day, I still harbor a perfectly rational and well-merited hatred for Rand al-Thor, who is arguably the very worst protagonist in all of fantasy fiction, and the question is only arguable because I have not read, and will not read, anything by SuperMegaGamma Patrick Rothfuss, although based on the descriptions and reviews of others, it is possible that, as difficult as it is to imagine, the protagonist of Rothfuss’s work is even worse than Robert Jordan’s loathsome lead character.</p><p>I will say that while Wright’s distaste for China Mieville’s <em>PERDIDO STREET STATION</em> is perfectly understandable and justifiable, I do not share it, and I consider Mieville to be one of Wright’s very few peers in the field. Very different, very much darker, and very much not on the side of the angels much less Our Lord and Savior Jesus Christ, but a first-rate fantasy author nevertheless.</p><p><em><a href=\"https://social.infogalactic.com/micropost/37859a0c-8d47-4025-a1b8-3a9043bed24d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One of the greatest science fiction grandmasters of his generation\nshares his very sound opinion\nof some popular works of genre fiction, including two of his fellow grandmasters.\nI was crushed on the Wheel of Time like a hindoo sacrifice being crushed by the great god Juggernaut.\nWhy could I not finish? This one is also hard to explain. The characters theoretically should have been a lovable as the picked-upon orphan-boy in HARRY POTTER, or the smart-but-shy Hermione. I mean, come on, a farm boy with a dread destiny, his honest blacksmith friend, and their friend who is good with dice. Not to mention Aes Sedai and way-cool ninja swordfighting moves and magical gateways and Dark Lords galore. But it never clicked with me: I was slogging halfway through the fifth or sixth book (yes, I stayed with it that long) when I realized that I wanted the main character to die because he was out of his mind, I wanted the gambler fellow to die because he was turning all dark and crooked, and I did not care of the blacksmith fellow lived or died, because he was spinning his wheels not doing much of anything. Somewhere along the way, I had lost all sympathy for all the heroes and all their goals–if they had goals. I mean, I had clambered up a mountain of thousands of gray pages, and I was still waiting for that “Council of Elrond” moment when Some Wise Mage tells Frodo-lite what the quest is. No one seemed to be doing anything and no one had a plan. And I wanted all of them to die.\nNow, in all fairness, this last might not have been a fault of the author. I am a cruel and sadistic man, like many readers, and I only read when I am a foul mood, either right before a gladiatorial game or an afternoon of kitten-stomping. So maybe it is just me.\nBut Rand-al’Thor really did get on my nerves after a while. He seemed a character simply too small for the role. If Ranma Soatome has been the Dragon of that world, the Dark Lord Bumbershoot (or whatever his name was) would have at least been booted in the head before five books ground wearily by. If Paul Mu’ad-Dib had been the dragon, by then would have at least disrupted the spice production. SOMETHING would have happened.\nI, too, hated\nTHE WHEEL OF TIME.\nHated, hated, hated it, and finally gave up partway through book seven. To this day, I still harbor a perfectly rational and well-merited hatred for Rand al-Thor, who is arguably the very worst protagonist in all of fantasy fiction, and the question is only arguable because I have not read, and will not read, anything by SuperMegaGamma Patrick Rothfuss, although based on the descriptions and reviews of others, it is possible that, as difficult as it is to imagine, the protagonist of Rothfuss’s work is even worse than Robert Jordan’s loathsome lead character.\nI will say that while Wright’s distaste for China Mieville’s\nPERDIDO STREET STATION\nis perfectly understandable and justifiable, I do not share it, and I consider Mieville to be one of Wright’s very few peers in the field. Very different, very much darker, and very much not on the side of the angels much less Our Lord and Savior Jesus Christ, but a first-rate fantasy author nevertheless.\nDISCUSS ON SG",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-07T14:46:41+00:00"
}