{
  "url": "https://voxday.net/2024/04/13/brics-justice/",
  "scraped_at": "2026-01-08T14:29:43.828006",
  "title": "BRICS Justice",
  "date_display": "April 13, 2024",
  "date_iso": "2024-04-13T08:32:05+00:00",
  "date_from_url": "2024-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Brazil has fallen. They are freezing the assets and bank accounts of journalists and confiscating their bank accounts. Pay attention. Coming to a Western nation near you.</em></p><p>I doubt it because I don’t think this is the conventional Clown World deplatforming and demonetization of the sort we so often see in the USA, Europe, and the antipodean colonies. It may, to the contrary, be more akin to BRICS’s ongoing war against Clown World’s soft power, <a href=\"https://reutersinstitute.politics.ox.ac.uk/news/under-attack-so-many-quarters-press-freedom-brazil-now-threatened-some-judges-too\">as this article suggests</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Schirlei Alves gave up local journalism after being sentenced to one year in prison by a judge in the southern Brazilian state of Santa Catarina. It happened in September 2023. Alves had published a news story about a businessman accused of rape and then cleared from it. Another judge filed civil and criminal lawsuits against her, and she decided that she could no longer do her job in her hometown.</p><p>In January 2024, it emerged that the same judge who sued Alves is also suing news organisations, artists and politicians for their use of a simple hashtag. Two months before, the Brazilian Supreme Court ruled that news organisations can be held legally responsible for any interviews in which sources attribute crimes to third parties…</p><p>During the trial, the prosecutor said that the Brazilian laws do not cover the unintentional rape of a person in a vulnerable position. As this was not included in the law, he argued, this constituted “an atypical case.”</p><p>As she summarised the trial to readers, Alves used the term “reckless rape” in the heading of her piece and suggested that the victim had been humiliated by the businessman’s defence lawyers during the hearings. After the piece was published, the hashtag #estruproculposo (reckless rape, in Portuguese) spread across social networks in a movement of solidarity.</p></blockquote><p>In other words, the reporter falsely and knowingly chose to publicly defame a man cleared of a rape charge at trial, and her defamation was spread nationwide via social media. This doesn’t strike me as a pernicious attack on journalism, but rather, an admirable willingness to hold journalists accountable to the same standards that everyone else is held.</p><p>This isn’t an exaggeration. An exemption from the libel and defamation laws is exactly what the media clowns are demanding. Their words, not mine: “<em>From a conceptual point of view, we are fighting to ensure that international standards of insult, slander and defamation are not applied to journalistic activities.</em>“</p><p>Since Clown World is literally built on a foundation of lies, since The Empire That Never Ended is also known by its foremost opponents as The Empire of Lies, it should come as no surprise that any attempt to hold liars accountable for the damage caused by their lies is portrayed in its deceitful media as an attack on the satanic freedoms for which it stands.</p><p>I’m still waiting for justice in one of the more recent cases of my own defamation and insult at the hands of certain journalists. But if justice won’t be done under a Clown World regime, we may hope for it after BRICS wins WWIII.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e9a2d39f-8709-4d3b-8811-96cbed616400\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Brazil has fallen. They are freezing the assets and bank accounts of journalists and confiscating their bank accounts. Pay attention. Coming to a Western nation near you.\nI doubt it because I don’t think this is the conventional Clown World deplatforming and demonetization of the sort we so often see in the USA, Europe, and the antipodean colonies. It may, to the contrary, be more akin to BRICS’s ongoing war against Clown World’s soft power,\nas this article suggests\n:\nSchirlei Alves gave up local journalism after being sentenced to one year in prison by a judge in the southern Brazilian state of Santa Catarina. It happened in September 2023. Alves had published a news story about a businessman accused of rape and then cleared from it. Another judge filed civil and criminal lawsuits against her, and she decided that she could no longer do her job in her hometown.\nIn January 2024, it emerged that the same judge who sued Alves is also suing news organisations, artists and politicians for their use of a simple hashtag. Two months before, the Brazilian Supreme Court ruled that news organisations can be held legally responsible for any interviews in which sources attribute crimes to third parties…\nDuring the trial, the prosecutor said that the Brazilian laws do not cover the unintentional rape of a person in a vulnerable position. As this was not included in the law, he argued, this constituted “an atypical case.”\nAs she summarised the trial to readers, Alves used the term “reckless rape” in the heading of her piece and suggested that the victim had been humiliated by the businessman’s defence lawyers during the hearings. After the piece was published, the hashtag #estruproculposo (reckless rape, in Portuguese) spread across social networks in a movement of solidarity.\nIn other words, the reporter falsely and knowingly chose to publicly defame a man cleared of a rape charge at trial, and her defamation was spread nationwide via social media. This doesn’t strike me as a pernicious attack on journalism, but rather, an admirable willingness to hold journalists accountable to the same standards that everyone else is held.\nThis isn’t an exaggeration. An exemption from the libel and defamation laws is exactly what the media clowns are demanding. Their words, not mine: “\nFrom a conceptual point of view, we are fighting to ensure that international standards of insult, slander and defamation are not applied to journalistic activities.\n“\nSince Clown World is literally built on a foundation of lies, since The Empire That Never Ended is also known by its foremost opponents as The Empire of Lies, it should come as no surprise that any attempt to hold liars accountable for the damage caused by their lies is portrayed in its deceitful media as an attack on the satanic freedoms for which it stands.\nI’m still waiting for justice in one of the more recent cases of my own defamation and insult at the hands of certain journalists. But if justice won’t be done under a Clown World regime, we may hope for it after BRICS wins WWIII.\nDISCUSS ON SG",
  "tags": [
    "law",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-13T08:32:07+00:00"
}