{
  "url": "https://voxday.net/2024/04/08/signs-of-impending-demise/",
  "scraped_at": "2026-01-08T14:29:16.917669",
  "title": "Signs of Impending Demise",
  "date_display": "April 8, 2024",
  "date_iso": "2024-04-08T05:09:13+00:00",
  "date_from_url": "2024-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neither the Chinese nor other Asians appear to be much impressed with NATO’s attempt to transform itself into the Global Atlantic-Pacific Treaty Organization <a href=\"https://www.globaltimes.cn/page/202404/1310122.shtml\">in this interview of John Pang</a>, a former Malaysian government official and a senior research fellow at Perak Academy, Malaysia, by <em>Global Times</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>GT: Western politicians like to say that NATO is “stronger than ever.” How would you describe the 75-year-old NATO?</strong></p><p><strong>Pang: </strong>I think NATO sounds more threatening and incoherent than ever. If that’s what they mean by “strong,” I guess they’re right in that respect. But it is also showing real signs of impending demise.</p><p>It is well past its shelf date. It was formed in the 1940s in response to the Soviet bloc, before the Warsaw Pact. The Warsaw Pact was created as a defense treaty against NATO. With the dissolution of the Soviet Union and the Warsaw Pact, NATO should have disbanded too. Instead it took on a new, expansionary role in securing US global supremacy. It is an aggressive, overextended organization adrift from its founding aims and attached now to the fantastical aim of “making the world safe for democracy,” that is to say, to attacking whoever the US deems the enemy of the day.</p><p>Devoid of its charter purpose, it’s been an organization in search of enemies and increased defense procurement. It’s made Russia, once again, the enemy. It has overextended itself on this venture in a way that has blighted Europe’s future and threatens its own survival. It now frames China, on the other side of the planet, as the security challenge. That’s where it is after 75 years.</p><p><strong>GT: Reports say that the US government is making arrangements for trilateral talks with the leaders of Japan and South Korea in July at the NATO summit in Washington. What do you think that means? <br/><br/>Pang:</strong> This will complete the consolidation of the worldwide set of US vassals, outposts and 800 military bases under NATO, Quad, AUKUS and this trilateral pact into a streamlined global threat posture also known as the West. There have even been moves to make Israel part of a Quad Plus, along with New Zealand. </p><p>Meanwhile, we have Europe as an example of what “Natofied’ Japan and South Korea can look forward to: further loss vassalization not just in foreign policy but also in trade and industrial policy, technology, media and, crucially, culture, since post 1991 NATO is motivated by an expansionary liberalism that thrives on the destruction of cultural boundaries as much as national borders.</p><p><strong>GT: What do you think of the prospect of “NATO’s Asia-Pacificization” or the establishment of an “Asian NATO”?</strong></p><p><strong>Pang: </strong>This is another one of those announcements that will go down in history like President Joe Biden’s Build Back Better World, the Indo-Pacific Economic Framework for Prosperity, and other grand ideas for bifurcating the world that lead nowhere.</p><p>The biggest of them is, of course, the Rules-Based Order, whose moral, legal and political legitimacy is now absolutely collapsed. It will go down in history identified with its signature achievement, the genocidal destruction of Gaza.</p><p>Its purpose is to threaten, but it’s also empty. What is NATO anymore, as an aggressive pact, far from Europe? What is the military capability of this set of countries beyond the US? What is brought to the existing issues in East Asia, around the South China Sea, for example, by having this set of 32 nations participate, who are collectively outclassed by Russian military industrial capability in Ukraine? Having set Europe on fire with its aggressive enlargement, they propose to bring their formula to Asia, against a far more powerful opponent. It’s an imbecile proposition.</p><p>Wherever possible, Asian NATO should be ignored or bypassed by the countries in the region. Their presence in the region would be so incoherent that it’s not clear what there is to engage with. NATO is a treaty organization for the North Atlantic, a noticeable distance away. They are militarily irrelevant here. We get the spectacle of the German and Dutch navies sailing into the region to sabre-rattle, and have symbolic exercises with the Japanese, for example, and perhaps next with the Philippines.</p><p>This entertains the Western elite for a couple days with an appearance of a grand alliance of the “democracies” against China, at a time when, as their citizens will tell you, actual democracy has been hollowed out by oligarchic rule at home. They aim to encircle and divide but have nothing to encircle or divide with. They will add nothing but a layer of live action Euro role playing on top of the existing, and material, US threat posture.</p><p>Instead, NATO in Asia is really about what the US and its military industrial complex will do to its own members. In its expanded form, it will tighten the US’ extractive grip on Europe and Japan and South Korea more than it threatens China. It will mandate purchases of US military equipment and more money from member states, especially that standby piggy bank, Japan. It will de-industrialize Japan as it has Germany, in favor of the US. It will demand more political and cultural conformity, further militarize Japan and South Korea, and alienate them from the economic and cultural vitality of their home region.</p><p>Europe, Japan and South Korea can say goodbye to any notion of strategic, political, economic or cultural autonomy. Remember that this is happening while actual freedom is breaking out among sovereign nations in the multipolar world of an expanding BRICS.</p></blockquote><p>It’s hard to believe that either the Europeans, the Japanese, or the Koreans genuinely want to be a part of a rapidly declining and increasingly impoverished Clown World, but it’s not as if they’re being offered a genuine choice by what has been transformed into the military arm of the imperial USA.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b6c1f25e-3887-4e6c-9437-03bcd8b47485\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Neither the Chinese nor other Asians appear to be much impressed with NATO’s attempt to transform itself into the Global Atlantic-Pacific Treaty Organization\nin this interview of John Pang\n, a former Malaysian government official and a senior research fellow at Perak Academy, Malaysia, by\nGlobal Times\n.\nGT: Western politicians like to say that NATO is “stronger than ever.” How would you describe the 75-year-old NATO?\nPang:\nI think NATO sounds more threatening and incoherent than ever. If that’s what they mean by “strong,” I guess they’re right in that respect. But it is also showing real signs of impending demise.\nIt is well past its shelf date. It was formed in the 1940s in response to the Soviet bloc, before the Warsaw Pact. The Warsaw Pact was created as a defense treaty against NATO. With the dissolution of the Soviet Union and the Warsaw Pact, NATO should have disbanded too. Instead it took on a new, expansionary role in securing US global supremacy. It is an aggressive, overextended organization adrift from its founding aims and attached now to the fantastical aim of “making the world safe for democracy,” that is to say, to attacking whoever the US deems the enemy of the day.\nDevoid of its charter purpose, it’s been an organization in search of enemies and increased defense procurement. It’s made Russia, once again, the enemy. It has overextended itself on this venture in a way that has blighted Europe’s future and threatens its own survival. It now frames China, on the other side of the planet, as the security challenge. That’s where it is after 75 years.\nGT: Reports say that the US government is making arrangements for trilateral talks with the leaders of Japan and South Korea in July at the NATO summit in Washington. What do you think that means?\nPang:\nThis will complete the consolidation of the worldwide set of US vassals, outposts and 800 military bases under NATO, Quad, AUKUS and this trilateral pact into a streamlined global threat posture also known as the West. There have even been moves to make Israel part of a Quad Plus, along with New Zealand.\nMeanwhile, we have Europe as an example of what “Natofied’ Japan and South Korea can look forward to: further loss vassalization not just in foreign policy but also in trade and industrial policy, technology, media and, crucially, culture, since post 1991 NATO is motivated by an expansionary liberalism that thrives on the destruction of cultural boundaries as much as national borders.\nGT: What do you think of the prospect of “NATO’s Asia-Pacificization” or the establishment of an “Asian NATO”?\nPang:\nThis is another one of those announcements that will go down in history like President Joe Biden’s Build Back Better World, the Indo-Pacific Economic Framework for Prosperity, and other grand ideas for bifurcating the world that lead nowhere.\nThe biggest of them is, of course, the Rules-Based Order, whose moral, legal and political legitimacy is now absolutely collapsed. It will go down in history identified with its signature achievement, the genocidal destruction of Gaza.\nIts purpose is to threaten, but it’s also empty. What is NATO anymore, as an aggressive pact, far from Europe? What is the military capability of this set of countries beyond the US? What is brought to the existing issues in East Asia, around the South China Sea, for example, by having this set of 32 nations participate, who are collectively outclassed by Russian military industrial capability in Ukraine? Having set Europe on fire with its aggressive enlargement, they propose to bring their formula to Asia, against a far more powerful opponent. It’s an imbecile proposition.\nWherever possible, Asian NATO should be ignored or bypassed by the countries in the region. Their presence in the region would be so incoherent that it’s not clear what there is to engage with. NATO is a treaty organization for the North Atlantic, a noticeable distance away. They are militarily irrelevant here. We get the spectacle of the German and Dutch navies sailing into the region to sabre-rattle, and have symbolic exercises with the Japanese, for example, and perhaps next with the Philippines.\nThis entertains the Western elite for a couple days with an appearance of a grand alliance of the “democracies” against China, at a time when, as their citizens will tell you, actual democracy has been hollowed out by oligarchic rule at home. They aim to encircle and divide but have nothing to encircle or divide with. They will add nothing but a layer of live action Euro role playing on top of the existing, and material, US threat posture.\nInstead, NATO in Asia is really about what the US and its military industrial complex will do to its own members. In its expanded form, it will tighten the US’ extractive grip on Europe and Japan and South Korea more than it threatens China. It will mandate purchases of US military equipment and more money from member states, especially that standby piggy bank, Japan. It will de-industrialize Japan as it has Germany, in favor of the US. It will demand more political and cultural conformity, further militarize Japan and South Korea, and alienate them from the economic and cultural vitality of their home region.\nEurope, Japan and South Korea can say goodbye to any notion of strategic, political, economic or cultural autonomy. Remember that this is happening while actual freedom is breaking out among sovereign nations in the multipolar world of an expanding BRICS.\nIt’s hard to believe that either the Europeans, the Japanese, or the Koreans genuinely want to be a part of a rapidly declining and increasingly impoverished Clown World, but it’s not as if they’re being offered a genuine choice by what has been transformed into the military arm of the imperial USA.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-08T05:09:16+00:00"
}