{
  "url": "https://voxday.net/2024/04/17/the-answer-is-no/",
  "scraped_at": "2026-01-08T14:30:05.714991",
  "title": "The Answer is “No”",
  "date_display": "April 17, 2024",
  "date_iso": "2024-04-17T19:35:59+00:00",
  "date_from_url": "2024-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s mildly amusing how the global media keeps trying to push the “conference on peace” that will be missing the only party whose opinion matters if peace is going to be obtained. But <a href=\"http://belfast.china-consulate.gov.cn/eng/wjbfyrth_3/202404/t20240417_11283249.htm\">China isn’t having any of it</a>, if you understand Chinese diplomacy-speak:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>AFP: </strong>Yesterday German Chancellor Olaf Scholz and President Xi Jinping discussed the high-level conference on peace to be hosted by Switzerland in June, which will not be attended by Russia. Chancellor Scholz noted that China’s word carries weight in Russia. Can you elaborate on China’s expectation for the high-level conference in Switzerland? Is China urging Russia to attend the conference?</p><p><strong>Lin Jian: </strong>During his meeting with German Chancellor Olaf Scholz yesterday, President Xi Jinping said China encourages and supports all efforts that are conducive to the peaceful resolution of the crisis, and supports the holding in due course of an international peace conference that is recognized by both Russia and Ukraine and ensures the equal participation of all parties and fair discussions on all peace plans. China will maintain close communication with all parties concerned, including Germany, on this matter. China believes that ultimately, any conflict will have to be resolved through diplomatic channels and political negotiation. On Ukraine, the only way out is to go back to the negotiation table. We’ve learned that the relevant conference is still under preparation and a lot of work remains to be done. China is ready to maintain communication with relevant parties. </p></blockquote><p>In other words, China will not support a one-sided conference being hosted by a non-neutral party, but it will support one that is genuinely neutral and acceptable to the two primary belligerents. If Switzerland still wants to play a role in peacemaking in the future, it has no choice but to stop taking sides and refrain from sanctioning anyone for anything.</p><p>This really isn’t that hard. Because it’s perfectly clear that none of the major powers are going to accept self-serving word games and contorted rationalizations as a substitute for genuine neutrality.</p><p><em><a href=\"https://social.infogalactic.com/micropost/445124da-a04e-4c10-9d43-442ee73bd395\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s mildly amusing how the global media keeps trying to push the “conference on peace” that will be missing the only party whose opinion matters if peace is going to be obtained. But\nChina isn’t having any of it\n, if you understand Chinese diplomacy-speak:\nAFP:\nYesterday German Chancellor Olaf Scholz and President Xi Jinping discussed the high-level conference on peace to be hosted by Switzerland in June, which will not be attended by Russia. Chancellor Scholz noted that China’s word carries weight in Russia. Can you elaborate on China’s expectation for the high-level conference in Switzerland? Is China urging Russia to attend the conference?\nLin Jian:\nDuring his meeting with German Chancellor Olaf Scholz yesterday, President Xi Jinping said China encourages and supports all efforts that are conducive to the peaceful resolution of the crisis, and supports the holding in due course of an international peace conference that is recognized by both Russia and Ukraine and ensures the equal participation of all parties and fair discussions on all peace plans. China will maintain close communication with all parties concerned, including Germany, on this matter. China believes that ultimately, any conflict will have to be resolved through diplomatic channels and political negotiation. On Ukraine, the only way out is to go back to the negotiation table. We’ve learned that the relevant conference is still under preparation and a lot of work remains to be done. China is ready to maintain communication with relevant parties.\nIn other words, China will not support a one-sided conference being hosted by a non-neutral party, but it will support one that is genuinely neutral and acceptable to the two primary belligerents. If Switzerland still wants to play a role in peacemaking in the future, it has no choice but to stop taking sides and refrain from sanctioning anyone for anything.\nThis really isn’t that hard. Because it’s perfectly clear that none of the major powers are going to accept self-serving word games and contorted rationalizations as a substitute for genuine neutrality.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Switzerland"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-17T19:36:00+00:00"
}