{
  "url": "https://voxday.net/2024/04/15/the-boomtardery-never-ends/",
  "scraped_at": "2026-01-08T14:29:54.563682",
  "title": "The Boomtardery Never Ends",
  "date_display": "April 15, 2024",
  "date_iso": "2024-04-15T13:50:59+00:00",
  "date_from_url": "2024-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Boomer Jews <a href=\"https://www.jpost.com/israel-hamas-war/article-796936\">are fantasizing about a rehash</a> of the 1981 bombing raid on Iraq’s nuclear reactor.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Iran took its best shot (or a very significant one) at Israel with over 100 ballistic missiles, cruise missiles, and over 100 drones, totaling over 300 forms of aerial attack from many different sides and vectors.</p><p>What if Israel finally decides to strike back? What if it decides to take this opportunity to finally bomb Iran’s prized nuclear weapons program?</p><p>Such a scenario has been gamed out for years, but here is one version of what it could look like.</p><p>Several quartets of F-35 stealth combat jets could fly by separate routes to hit sites across the massive Islamic Republic, some as far as 1,200 miles from the Jewish state.</p><p>Some of the aircraft might fly along the border between Syria and Turkey (despite those countries’ opposition) and then race across Iraq (who would also oppose). Other aircraft might fly through Saudi airspace (unclear if this would be with quiet agreement or opposition) and the Persian Gulf.</p><p>They might arrive simultaneously or in waves (as Iran did overnight between Saturday and Sunday) to first eliminate the ayatollahs’ air defenses at dozens of Iranian nuclear sites, carefully hand-picked by the Mossad and IDF intelligence.</p></blockquote><p>First, Iran obviously did not take its best shot. It used less than one-tenth of one percent of its drones and missiles to send a strong message to the USA. Second, keep in mind that Israel used 14 planes, 8 F-16s and 6 F-15s, in 1981’s Operation Opera. It now possesses 614 aircraft, among which are 50 F-35s. Given the fact that only 20 percent of the USAF’s F-35s are currently operational, it would be very surprising if the IDF had more than 25 available for this sort of long-distance action.</p><p>Now consider that Iran acquired <a href=\"https://www.reuters.com/article/us-russia-iran-missiles-idUSKCN12D0Z2/\">the S-300 missile defense system from Russia in 2016</a>. With only 100 legacy S-300 systems inherited from the Soviet Union, the Ukrainian Armed Forces managed to prevent the Russian Air Force, which is five times larger than the Israeli Air Force and has much better fighters and bombers, from making use of its air superiority until very recently. Iran may also have S-400 and S-500 systems by now, as Russian leaders have spoken openly about supplying the Iranians with them, and Russian troops in Syria are known to have both S-400 and S-500 systems deployed with them.</p><p>In other words, attempting to repeat what was a surprise attack 43 years ago would be far more likely to lead to the literal decimation of the Israeli air forces than to harm Iran in any serious way. One of the consequences of the end of the fighter jet-era is the elimination of what has been, for the last fifty years, Israel’s advantage of regional air supremacy.</p><p>Even Hollywood knows this, as evidenced by the recent Top Gun sequel, so it’s a little surprising to see how many Boomers in the US and Israeli medias alike do not.</p><p><em><a href=\"https://social.infogalactic.com/micropost/33d71e69-2142-4a16-8a9d-1c529050c3bc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Boomer Jews\nare fantasizing about a rehash\nof the 1981 bombing raid on Iraq’s nuclear reactor.\nIran took its best shot (or a very significant one) at Israel with over 100 ballistic missiles, cruise missiles, and over 100 drones, totaling over 300 forms of aerial attack from many different sides and vectors.\nWhat if Israel finally decides to strike back? What if it decides to take this opportunity to finally bomb Iran’s prized nuclear weapons program?\nSuch a scenario has been gamed out for years, but here is one version of what it could look like.\nSeveral quartets of F-35 stealth combat jets could fly by separate routes to hit sites across the massive Islamic Republic, some as far as 1,200 miles from the Jewish state.\nSome of the aircraft might fly along the border between Syria and Turkey (despite those countries’ opposition) and then race across Iraq (who would also oppose). Other aircraft might fly through Saudi airspace (unclear if this would be with quiet agreement or opposition) and the Persian Gulf.\nThey might arrive simultaneously or in waves (as Iran did overnight between Saturday and Sunday) to first eliminate the ayatollahs’ air defenses at dozens of Iranian nuclear sites, carefully hand-picked by the Mossad and IDF intelligence.\nFirst, Iran obviously did not take its best shot. It used less than one-tenth of one percent of its drones and missiles to send a strong message to the USA. Second, keep in mind that Israel used 14 planes, 8 F-16s and 6 F-15s, in 1981’s Operation Opera. It now possesses 614 aircraft, among which are 50 F-35s. Given the fact that only 20 percent of the USAF’s F-35s are currently operational, it would be very surprising if the IDF had more than 25 available for this sort of long-distance action.\nNow consider that Iran acquired\nthe S-300 missile defense system from Russia in 2016\n. With only 100 legacy S-300 systems inherited from the Soviet Union, the Ukrainian Armed Forces managed to prevent the Russian Air Force, which is five times larger than the Israeli Air Force and has much better fighters and bombers, from making use of its air superiority until very recently. Iran may also have S-400 and S-500 systems by now, as Russian leaders have spoken openly about supplying the Iranians with them, and Russian troops in Syria are known to have both S-400 and S-500 systems deployed with them.\nIn other words, attempting to repeat what was a surprise attack 43 years ago would be far more likely to lead to the literal decimation of the Israeli air forces than to harm Iran in any serious way. One of the consequences of the end of the fighter jet-era is the elimination of what has been, for the last fifty years, Israel’s advantage of regional air supremacy.\nEven Hollywood knows this, as evidenced by the recent Top Gun sequel, so it’s a little surprising to see how many Boomers in the US and Israeli medias alike do not.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-15T19:39:39+00:00"
}