{
  "url": "https://voxday.net/2024/04/12/the-return-of-national-economics/",
  "scraped_at": "2026-01-08T14:29:40.154069",
  "title": "The Return of National Economics",
  "date_display": "April 12, 2024",
  "date_iso": "2024-04-12T11:00:36+00:00",
  "date_from_url": "2024-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the Chinese have lower per capita income than US citizens do, the lack of debt and their median household wealth combined with their lower degree of income inequality means that the Chinese economy is much more economically stable than its US counterpart.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img alt=\"\" class=\"wp-image-62524\" decoding=\"async\" fetchpriority=\"high\" height=\"976\" sizes=\"(max-width: 1024px) 100vw, 1024px\" src=\"https://voxday.net/wp-content/uploads/2024/04/image-7-1024x976.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/04/image-7-1024x976.png 1024w, https://voxday.net/wp-content/uploads/2024/04/image-7-300x286.png 300w, https://voxday.net/wp-content/uploads/2024/04/image-7-768x732.png 768w, https://voxday.net/wp-content/uploads/2024/04/image-7.png 1080w\" style=\"width:512px\" width=\"1024\"/></figure></div><p>I’ll post more about this next week, but one of the reasons Western macroeconomic metrics don’t work to analyze the Chinese economy is because the Chinese are observably following the principles described by Richard Werner in his excellent <em>Princes of the Yen</em>, which chronicles the way Japan successfully maintained its centralized wartime economy to develop its economy and literally buy a significant percentage of the global assets from 1945 through 1990.</p><p>That relentless period of economic advancement came to an end in 1998 with the final triumph of the private Bank of Japan, which served as Clown World’s proxy, over the <em>Okurasho</em>, Japan’s Ministry of Finance, and the subsequent shift to the same sort of financialized unproductive economy featuring private credit creation that has systematically weakened the West for the last century.</p><p>As part of its policy of unrestricted warfare, China has methodically applied the lessons of Japan’s post-WWII economy and maintained control of its own credit creation, thereby boosting its productive capacity to historically unprecedented levels and providing it with the monetary resources to buy up foreign assets everywhere from Angola to the USA. By publicly breaking with Clown World in 2015, and setting up BRICS as an alternative to the various Clown World institutions, China is offering the rest of the world an observably viable and historically superior economic model to the corrupt and deceptive one that was holding the elites of the various nations enthralled.</p><p>This is why Janet Yellen, the US Secretary of the Treasury, was in China this week begging the Chinese to “reduce their overcapacity”. And it’s not an accident that China has applied Japan’s historical policies of a) government credit creation to fund b) productive industrial exports while minimizing the use of credit to fund domestic consumption. This is a proven means of enhancing national power and prestige at the expense of global competitors.</p><p>The economic assumptions of the Smith-Keynesian era have gradually been proven over time to be entirely false. This is a difficult lesson for even economic iconoclasts like me to accept, but it is inarguable at this point. From David Ricardo to Paul Samuelson, from free trade to the rational actor, everything about neoclassical economics is intrinsically and observably incorrect, which is why those nations whose economic policies are based on traditional neoclassical economics will inevitably fall behind, both in terms of societal wealth and military power.</p><p><a href=\"https://social.infogalactic.com/micropost/ab5fb890-1629-46bb-87f3-904b9b0aedbe\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "While the Chinese have lower per capita income than US citizens do, the lack of debt and their median household wealth combined with their lower degree of income inequality means that the Chinese economy is much more economically stable than its US counterpart.\nI’ll post more about this next week, but one of the reasons Western macroeconomic metrics don’t work to analyze the Chinese economy is because the Chinese are observably following the principles described by Richard Werner in his excellent\nPrinces of the Yen\n, which chronicles the way Japan successfully maintained its centralized wartime economy to develop its economy and literally buy a significant percentage of the global assets from 1945 through 1990.\nThat relentless period of economic advancement came to an end in 1998 with the final triumph of the private Bank of Japan, which served as Clown World’s proxy, over the\nOkurasho\n, Japan’s Ministry of Finance, and the subsequent shift to the same sort of financialized unproductive economy featuring private credit creation that has systematically weakened the West for the last century.\nAs part of its policy of unrestricted warfare, China has methodically applied the lessons of Japan’s post-WWII economy and maintained control of its own credit creation, thereby boosting its productive capacity to historically unprecedented levels and providing it with the monetary resources to buy up foreign assets everywhere from Angola to the USA. By publicly breaking with Clown World in 2015, and setting up BRICS as an alternative to the various Clown World institutions, China is offering the rest of the world an observably viable and historically superior economic model to the corrupt and deceptive one that was holding the elites of the various nations enthralled.\nThis is why Janet Yellen, the US Secretary of the Treasury, was in China this week begging the Chinese to “reduce their overcapacity”. And it’s not an accident that China has applied Japan’s historical policies of a) government credit creation to fund b) productive industrial exports while minimizing the use of credit to fund domestic consumption. This is a proven means of enhancing national power and prestige at the expense of global competitors.\nThe economic assumptions of the Smith-Keynesian era have gradually been proven over time to be entirely false. This is a difficult lesson for even economic iconoclasts like me to accept, but it is inarguable at this point. From David Ricardo to Paul Samuelson, from free trade to the rational actor, everything about neoclassical economics is intrinsically and observably incorrect, which is why those nations whose economic policies are based on traditional neoclassical economics will inevitably fall behind, both in terms of societal wealth and military power.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-12T12:22:31+00:00"
}