{
  "url": "https://voxday.net/2024/04/04/the-history-of-the-byzantine-empire/",
  "scraped_at": "2026-01-08T14:28:56.941334",
  "title": "The History of the Byzantine Empire",
  "date_display": "April 4, 2024",
  "date_iso": "2024-04-04T15:46:49+00:00",
  "date_from_url": "2024-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re a Castalia History subscriber, you just might want to visit the Castalia Library substack today, as <a href=\"https://castalialibrary.substack.com/p/the-cambridge-history-of-the-byzantine\">there is an announcement there</a> concerning the fifth book in the Castalia History series, the April-May-June subscription book.</p><p>Also for Castalia History subscribers: there are about 20 Annual subscribers who still need to renew their subscriptions manually since we are not permitted to do so automatically in this particular situation. If your subscription has not been renewed, or if you need to make a catchup payment, you will receive an email shortly informing you of the need to do so.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62453\" decoding=\"async\" fetchpriority=\"high\" height=\"321\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/04/image-4.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/04/image-4.png 512w, https://voxday.net/wp-content/uploads/2024/04/image-4-300x188.png 300w\" width=\"512\"/></figure></div><p>And since we’re talking about Castalia History, I strongly recommend the daily excerpt from STUDIES IN THE NAPOLEONIC WARS, as the chapters on the tales of the secret services feature stories worthy of an action-adventure movie. The recently completed chapter on Brother James, who travelled through the enemy empire searching for a missing Spanish army that found itself surrounded by allies turned enemies in the aftermath of Napoleon’s decision to replace the Bourbon King of Spain with his brother Joseph, <a href=\"https://castalialibrary.substack.com/p/studies-in-the-napoleonic-wars-045\">really has to be read</a> to be believed.</p><p><em>In April La Romana had begun to be perturbed at the way in which the stream of dispatches and private letters from Spain, which had hitherto arrived regularly, had suddenly dried up. An officer who got through from Madrid with details of the accession of Ferdinand VII brought a complaint that the Home Government had got no dispatch from the expeditionary force for many weeks. Napoleon had stopped the post at both ends. This caused much alarm and evil surmises. They were more than fulfilled when on June 24th there was delivered to the Marquis a dispatch from Bayonne, announcing that the Bourbons had abdicated, that Joseph Bonaparte had been proclaimed King of Spain, that he had been acknowledged by the whole realm, and that he was to transmit the news to his army, and order the regiments to swear allegiance to their new sovereign.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/62a4e821-495c-4a93-945c-3a25d28d4412\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If you’re a Castalia History subscriber, you just might want to visit the Castalia Library substack today, as\nthere is an announcement there\nconcerning the fifth book in the Castalia History series, the April-May-June subscription book.\nAlso for Castalia History subscribers: there are about 20 Annual subscribers who still need to renew their subscriptions manually since we are not permitted to do so automatically in this particular situation. If your subscription has not been renewed, or if you need to make a catchup payment, you will receive an email shortly informing you of the need to do so.\nAnd since we’re talking about Castalia History, I strongly recommend the daily excerpt from STUDIES IN THE NAPOLEONIC WARS, as the chapters on the tales of the secret services feature stories worthy of an action-adventure movie. The recently completed chapter on Brother James, who travelled through the enemy empire searching for a missing Spanish army that found itself surrounded by allies turned enemies in the aftermath of Napoleon’s decision to replace the Bourbon King of Spain with his brother Joseph,\nreally has to be read\nto be believed.\nIn April La Romana had begun to be perturbed at the way in which the stream of dispatches and private letters from Spain, which had hitherto arrived regularly, had suddenly dried up. An officer who got through from Madrid with details of the accession of Ferdinand VII brought a complaint that the Home Government had got no dispatch from the expeditionary force for many weeks. Napoleon had stopped the post at both ends. This caused much alarm and evil surmises. They were more than fulfilled when on June 24th there was delivered to the Marquis a dispatch from Bayonne, announcing that the Bourbons had abdicated, that Joseph Bonaparte had been proclaimed King of Spain, that he had been acknowledged by the whole realm, and that he was to transmit the news to his army, and order the regiments to swear allegiance to their new sovereign.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-04T15:55:04+00:00"
}