{
  "url": "https://voxday.net/2024/04/30/the-carlson-dugin-interview/",
  "scraped_at": "2026-01-08T14:31:14.193620",
  "title": "The Carlson-Dugin Interview",
  "date_display": "April 30, 2024",
  "date_iso": "2024-04-30T23:11:50+00:00",
  "date_from_url": "2024-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A selection from <a href=\"https://f001.backblazeb2.com/file/mwdiers-sharing/Documents/TC-Dugin%20interview.docx\">the complete transcript</a> of the interview:</p><p><strong>Tucker Carlson: </strong><em>So what you’re describing is clearly happening and it’s horrifying. But it’s not the definition of liberalism I have in mind when I describe myself, as what we say the United States is a classical liberal. So you think of liberalism as individual freedom and choice from slavery. Right? So the options as we conceive them, as I was growing up, were the individual who can follow his conscience, say what he thinks, defend himself against the state versus the statism, the totalitarianism embodied in the government that you fought against: the Soviet government. And I think most Americans think of it that way. What’s the difference?</em></p><p><strong>Aleksandr Dugin:</strong> Very interesting question. I think that the problem is in two definitions of liberalism. There is old liberalism, classical liberalism. And new liberalism. So classical liberalism was in favor of democracy. Democracy understood as the power of majority of consensus, of individual freedom. That should be combined somehow with the freedom of other. And now we have totally the next station already. Next phase: new liberalism. Now it is not about the rule of majority, but it is about the rule of minorities. It is not about individual freedom, but it is about wokism. So you should be so individualistic that you should criticize not only the state, but individual, the old understanding of individual. So you need now – you are invited to liberate yourself from individuality to go further in that direction. I have spoken once with Fukuyama, Francis Fukuyama on TV. And he has said, before, democracy has meant the rule of majority. And now it is about the rule of minorities against majority, because majority could choose Hitler or Putin. So we need to be very careful with majority, and majority should be taken under control and minorities should rule over majority. It is not democracy, it is already totalitarianism. And now we are not about defense of the individual of freedom, but about prescription to be woke, to be modern, to be progressive. It is not your right to be or not to be progressive. It is your duty to be progressive, to follow this agenda. So you are free to be a left liberal. You are no more free enough to be a right liberal. You should be a left liberal. And that is a kind of duty. It is prescription. So liberalism fought during its history against any kind of prescription. And now it at its turn became totalitarian, prescriptive, not free as it was.</p><p><strong>Tucker Carlson:</strong> <em>And do you believe that was inevitable, that process? That was always going to happen?</em></p><p><strong>Aleksandr Dugin: </strong>I perceive here a kind of logic. So a kind of logic that is not just a reversion or deviation. You start with one thing. You want to liberate individual. When you arrive at the point when it is possible, it is realized. So you need to go further. And you start to liberate ourselves from this time from old understanding of individual in favor of more progressive concepts. So you could not stop here. That is my vision. So if you say “Oh, I prefer old liberalism,” they would say, the progressives, they would say, it is not about old liberalism. It is about fascism. You are defender of traditionalism, conservatism, fascism. So stop here. Either be progressive liberal or you are done, or we will cancel you. That is what we observe, I would say.</p><p><em><a href=\"https://social.infogalactic.com/micropost/856bd874-01eb-4e4b-b45e-8ec6c8418799\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A selection from\nthe complete transcript\nof the interview:\nTucker Carlson:\nSo what you’re describing is clearly happening and it’s horrifying. But it’s not the definition of liberalism I have in mind when I describe myself, as what we say the United States is a classical liberal. So you think of liberalism as individual freedom and choice from slavery. Right? So the options as we conceive them, as I was growing up, were the individual who can follow his conscience, say what he thinks, defend himself against the state versus the statism, the totalitarianism embodied in the government that you fought against: the Soviet government. And I think most Americans think of it that way. What’s the difference?\nAleksandr Dugin:\nVery interesting question. I think that the problem is in two definitions of liberalism. There is old liberalism, classical liberalism. And new liberalism. So classical liberalism was in favor of democracy. Democracy understood as the power of majority of consensus, of individual freedom. That should be combined somehow with the freedom of other. And now we have totally the next station already. Next phase: new liberalism. Now it is not about the rule of majority, but it is about the rule of minorities. It is not about individual freedom, but it is about wokism. So you should be so individualistic that you should criticize not only the state, but individual, the old understanding of individual. So you need now – you are invited to liberate yourself from individuality to go further in that direction. I have spoken once with Fukuyama, Francis Fukuyama on TV. And he has said, before, democracy has meant the rule of majority. And now it is about the rule of minorities against majority, because majority could choose Hitler or Putin. So we need to be very careful with majority, and majority should be taken under control and minorities should rule over majority. It is not democracy, it is already totalitarianism. And now we are not about defense of the individual of freedom, but about prescription to be woke, to be modern, to be progressive. It is not your right to be or not to be progressive. It is your duty to be progressive, to follow this agenda. So you are free to be a left liberal. You are no more free enough to be a right liberal. You should be a left liberal. And that is a kind of duty. It is prescription. So liberalism fought during its history against any kind of prescription. And now it at its turn became totalitarian, prescriptive, not free as it was.\nTucker Carlson:\nAnd do you believe that was inevitable, that process? That was always going to happen?\nAleksandr Dugin:\nI perceive here a kind of logic. So a kind of logic that is not just a reversion or deviation. You start with one thing. You want to liberate individual. When you arrive at the point when it is possible, it is realized. So you need to go further. And you start to liberate ourselves from this time from old understanding of individual in favor of more progressive concepts. So you could not stop here. That is my vision. So if you say “Oh, I prefer old liberalism,” they would say, the progressives, they would say, it is not about old liberalism. It is about fascism. You are defender of traditionalism, conservatism, fascism. So stop here. Either be progressive liberal or you are done, or we will cancel you. That is what we observe, I would say.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "interviews",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-30T23:11:52+00:00"
}