{
  "url": "https://voxday.net/2024/04/17/the-unholy-trinity-of-evils/",
  "scraped_at": "2026-01-08T14:30:03.863854",
  "title": "The Unholy Trinity of Evils",
  "date_display": "April 17, 2024",
  "date_iso": "2024-04-17T17:11:30+00:00",
  "date_from_url": "2024-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Tree of Woe contemplates <a href=\"https://treeofwoe.substack.com/p/the-strategy-of-evil\">the three observable types of evils</a> at work in the world today, and how the transformation from one form to another has distinct consequences for the situations in which we find ourselves today.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>According to the Traditionalists, the culture war between tradition and modernity is actually an occult war between the forces of cosmos and the forces of chaos. This occult war has been ongoing since ancient or Biblical times and throughout that time, the forces of chaos have been the cause of every ideology and influence that disintegrates, subverts, and degrades traditional society. Those forces have worked indirectly, to subtly influence human hearts and minds in ways that lead them to degeneration. The forces of chaos had, until the early 20th century, worked primarily to negate tradition, but that project of anti-tradition was effectively completed by the mid-20th century. Thereafter, the forces of chaos began to focus on the creation of a counter-tradition, openly predicated on a debased, infrahuman, and inverted spirituality. The ultimate goal of this counter-tradition, the Traditionalists believed, would be to establish a global totalitarian empire and church that parodies and inverts the true empire and true church of Tradition.</p><p>But what establishing a global totalitarian empire isn’t the final objective of the spiritual enemy? What if the objective is actually far more diabolical?</p><p>Professor Bruce Charlton, on his blog Charlton Teaching, has written extensively about the nature of evil. According to Charlton, there are three types of evil. Luciferic, Ahrimanic, and Sorathic…</p><p>Luciferic evil is named for, and symbolized by, Lucifer’s rejection of God’s sovereignty: “I will not serve.” It represents the first stage of evil, in its anti-authoritarian, individualist, and rebellious aspect which seeks to overthrow cosmos (natural order) to maximize freedom of action. Luciferian evil is often attractive, in the lustful blood-and-song manner of ancient pagan heroes, pirates, and rebels. Charlton argues that Luciferic evil dominated the Sexual Revolution of the 1960s as well as certain aspects of the Libertarian movement…</p><p>Per Charlton: <em>The Ahrimanic evil is more modern; it is the despair-inducing, soul-destroying, utterly-demotivating Iron Cage of totalitarian bureaucracy – where all is a single system and all Men are merely cogs to serve it. This is the evil of late Soviet communism, of The Borg, of the overpromoted-middle-manager, Head Girl Type (e.g. the-3-Ms – Merkel, May, Macron) that increasingly runs large organizations, corporations and Western nations.</em></p><p><em>If Lucifer seeks pleasure, Ahriman seeks control. Note that this is not necessarily the same thing as seeking power. Those who serve Ahriman may seek to be in control themselves, but more often their goal may simply be that everything be under control. Hierarchy is of Ahriman, because even those who are far from the top have no objection to it. Even an Ahrimanist who has the ability to control things personally will generally defer these personal decisions to a system or algorithm, personal responsibility being unpleasantly risky. A near-perfect example of Ahrimanic man is the 2020s birdemicist, happy to submit to house arrest, universal surveillance and censorship, and forced medical procedures — rather than take a chance of catching the flu. “Non serviam” is Lucifer’s motto, not Ahriman’s; if Ahrimanism were condensed into a two-word motto, it would be, “Safety first” — or, if more than two words are needed, “None are safe until all are safe.</em></p><p><em>If Luciferic evil is motivated by short-termist pleasure; while Ahrimanic evil is motivated by God-denial, spiritual blindness and reductionism towards a meaningless world of mechanical procedures; then the Sorathic impulse is driven by negative impulses – primarily fear, resentment and hatred.</em></p><p><em>Sorathic evil will therefore tend to destroy both the lustful pleasures of Luciferic evil, and the complex functional bureaucracies of Ahrimanic evil. Sorath’s ultimate goal is that nothing at all exist, including Sorath himself.</em></p></blockquote><p><a href=\"https://treeofwoe.substack.com/p/the-strategy-of-evil\">Read the whole thing there</a>. It’s extremely perceptive, and it’s a model I use in my own attempt to understand the way in which the world operates, because there is an observable distinction between the various factions of the wicked that are not only at war with God and His Creation, but with one another as well.</p><p>The model may also account for what we have observed as the “Black Rider model”, since neither an Ahrimanic nor a Sorathic evil has any regard whatsoever for a Luciferic figure, no matter how useful or wicked it may be, and would not hesitate to dispose of it once it ceased to be useful.</p><p><em><a href=\"https://social.infogalactic.com/micropost/781409fc-d928-4f9a-b490-214ac86ebd29\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Tree of Woe contemplates\nthe three observable types of evils\nat work in the world today, and how the transformation from one form to another has distinct consequences for the situations in which we find ourselves today.\nAccording to the Traditionalists, the culture war between tradition and modernity is actually an occult war between the forces of cosmos and the forces of chaos. This occult war has been ongoing since ancient or Biblical times and throughout that time, the forces of chaos have been the cause of every ideology and influence that disintegrates, subverts, and degrades traditional society. Those forces have worked indirectly, to subtly influence human hearts and minds in ways that lead them to degeneration. The forces of chaos had, until the early 20th century, worked primarily to negate tradition, but that project of anti-tradition was effectively completed by the mid-20th century. Thereafter, the forces of chaos began to focus on the creation of a counter-tradition, openly predicated on a debased, infrahuman, and inverted spirituality. The ultimate goal of this counter-tradition, the Traditionalists believed, would be to establish a global totalitarian empire and church that parodies and inverts the true empire and true church of Tradition.\nBut what establishing a global totalitarian empire isn’t the final objective of the spiritual enemy? What if the objective is actually far more diabolical?\nProfessor Bruce Charlton, on his blog Charlton Teaching, has written extensively about the nature of evil. According to Charlton, there are three types of evil. Luciferic, Ahrimanic, and Sorathic…\nLuciferic evil is named for, and symbolized by, Lucifer’s rejection of God’s sovereignty: “I will not serve.” It represents the first stage of evil, in its anti-authoritarian, individualist, and rebellious aspect which seeks to overthrow cosmos (natural order) to maximize freedom of action. Luciferian evil is often attractive, in the lustful blood-and-song manner of ancient pagan heroes, pirates, and rebels. Charlton argues that Luciferic evil dominated the Sexual Revolution of the 1960s as well as certain aspects of the Libertarian movement…\nPer Charlton:\nThe Ahrimanic evil is more modern; it is the despair-inducing, soul-destroying, utterly-demotivating Iron Cage of totalitarian bureaucracy – where all is a single system and all Men are merely cogs to serve it. This is the evil of late Soviet communism, of The Borg, of the overpromoted-middle-manager, Head Girl Type (e.g. the-3-Ms – Merkel, May, Macron) that increasingly runs large organizations, corporations and Western nations.\nIf Lucifer seeks pleasure, Ahriman seeks control. Note that this is not necessarily the same thing as seeking power. Those who serve Ahriman may seek to be in control themselves, but more often their goal may simply be that everything be under control. Hierarchy is of Ahriman, because even those who are far from the top have no objection to it. Even an Ahrimanist who has the ability to control things personally will generally defer these personal decisions to a system or algorithm, personal responsibility being unpleasantly risky. A near-perfect example of Ahrimanic man is the 2020s birdemicist, happy to submit to house arrest, universal surveillance and censorship, and forced medical procedures — rather than take a chance of catching the flu. “Non serviam” is Lucifer’s motto, not Ahriman’s; if Ahrimanism were condensed into a two-word motto, it would be, “Safety first” — or, if more than two words are needed, “None are safe until all are safe.\nIf Luciferic evil is motivated by short-termist pleasure; while Ahrimanic evil is motivated by God-denial, spiritual blindness and reductionism towards a meaningless world of mechanical procedures; then the Sorathic impulse is driven by negative impulses – primarily fear, resentment and hatred.\nSorathic evil will therefore tend to destroy both the lustful pleasures of Luciferic evil, and the complex functional bureaucracies of Ahrimanic evil. Sorath’s ultimate goal is that nothing at all exist, including Sorath himself.\nRead the whole thing there\n. It’s extremely perceptive, and it’s a model I use in my own attempt to understand the way in which the world operates, because there is an observable distinction between the various factions of the wicked that are not only at war with God and His Creation, but with one another as well.\nThe model may also account for what we have observed as the “Black Rider model”, since neither an Ahrimanic nor a Sorathic evil has any regard whatsoever for a Luciferic figure, no matter how useful or wicked it may be, and would not hesitate to dispose of it once it ceased to be useful.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-17T17:11:32+00:00"
}