{
  "url": "https://voxday.net/2024/04/16/the-swiss-demand-neutrality/",
  "scraped_at": "2026-01-08T14:30:00.114337",
  "title": "The Swiss Demand Neutrality",
  "date_display": "April 16, 2024",
  "date_iso": "2024-04-16T18:56:15+00:00",
  "date_from_url": "2024-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clown World is going to face an uphill battle trying to convince the Swiss <a href=\"https://www.swissinfo.ch/eng/swiss-head-for-neutrality-vote-after-adopting-russia-sanctions/75588902\">to abandon their historic neutrality</a> now that they’re already seeing how abandoning some of their other historical traditions has worked out for them. Given that giving into US demands has already cost them both Credit Suisse and their postal savings system, one shudders to think what the price of choosing the wrong side in WWIII will be for nations such as Japan, South Korea, and Switzerland.</p><p>Switzerland is heading for a popular vote on its long-standing neutrality amid a debate ignited by the the country’s decision to sanction Russia over its invasion of Ukraine.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Activists and the country’s right-wing People’s Party, the largest in parliament, want to enshrine the position of permanent, armed neutrality in the constitution. In addition to preventing Switzerland taking part in any military alliance, the initiative also wants to block participation in non-military coercive measures, which would include sanctions.</p><p>The group behind the proposal submitted its petition, backed by more than 130,000 signatures, this week, though the actual vote won’t take place for some time.</p><p>Switzerland has traditionally refused to take sides in European conflicts, but decided to adopt European Union sanctions against Russia in 2022. According to critics, that was a departure from neutrality and jeopardized the country’s role as an international mediator.</p><p>On the other hand, corporate leaders have been increasingly warning that neutrality is harming the country’s business prospects. Switzerland has been blocking weapon shipments from Germany and elsewhere to Ukraine, drawing international ire.</p><p>The People’s Party said this week that there have been “targeted attempts to undermine neutrality,” citing the country’s adoption of EU sanctions against Russia. It said this has undermined the international view of Switzerland as neutral.</p><p>The government says sanctions are compatible with neutrality and is trying to revive Switzerland’s relevance by hosting on a conference on peace in Ukraine in June. Russia has already said it won’t attend the meeting.</p></blockquote><p>Both Spain and Switzerland did very well to stay out of WWII. No doubt it will be even more beneficial to stay out of the unrestricted warfare of WWIII.</p><p>Considering that Clown World will almost certainly be comprehensively defeated and in full retreat by the time the referendum takes place, the usual arguments about the economic benefits and inevitability of neo-liberal progress toward <em>eine Rasse, eine Welt, ein Reich</em> should appear almost comically outdated by then. The fact that Switzerland has already lost its ability to play host to major international peace talks, to say nothing have having been named a hostile state by the foremost military power in Europe is also going to provide rocket fuel for the referendum.</p><p>I expect the government to do its best to pretend to fiddle with the laws, declare the problem solved, and argue that the people putting constitutional limits on its ability to take sides are now unnecessary, but given the way they’ve already played that card with regards to other issues, no one buys it anymore.</p><p><em><a href=\"https://social.infogalactic.com/micropost/952af9b9-8f47-4030-af9c-a79825fca430\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Clown World is going to face an uphill battle trying to convince the Swiss\nto abandon their historic neutrality\nnow that they’re already seeing how abandoning some of their other historical traditions has worked out for them. Given that giving into US demands has already cost them both Credit Suisse and their postal savings system, one shudders to think what the price of choosing the wrong side in WWIII will be for nations such as Japan, South Korea, and Switzerland.\nSwitzerland is heading for a popular vote on its long-standing neutrality amid a debate ignited by the the country’s decision to sanction Russia over its invasion of Ukraine.\nActivists and the country’s right-wing People’s Party, the largest in parliament, want to enshrine the position of permanent, armed neutrality in the constitution. In addition to preventing Switzerland taking part in any military alliance, the initiative also wants to block participation in non-military coercive measures, which would include sanctions.\nThe group behind the proposal submitted its petition, backed by more than 130,000 signatures, this week, though the actual vote won’t take place for some time.\nSwitzerland has traditionally refused to take sides in European conflicts, but decided to adopt European Union sanctions against Russia in 2022. According to critics, that was a departure from neutrality and jeopardized the country’s role as an international mediator.\nOn the other hand, corporate leaders have been increasingly warning that neutrality is harming the country’s business prospects. Switzerland has been blocking weapon shipments from Germany and elsewhere to Ukraine, drawing international ire.\nThe People’s Party said this week that there have been “targeted attempts to undermine neutrality,” citing the country’s adoption of EU sanctions against Russia. It said this has undermined the international view of Switzerland as neutral.\nThe government says sanctions are compatible with neutrality and is trying to revive Switzerland’s relevance by hosting on a conference on peace in Ukraine in June. Russia has already said it won’t attend the meeting.\nBoth Spain and Switzerland did very well to stay out of WWII. No doubt it will be even more beneficial to stay out of the unrestricted warfare of WWIII.\nConsidering that Clown World will almost certainly be comprehensively defeated and in full retreat by the time the referendum takes place, the usual arguments about the economic benefits and inevitability of neo-liberal progress toward\neine Rasse, eine Welt, ein Reich\nshould appear almost comically outdated by then. The fact that Switzerland has already lost its ability to play host to major international peace talks, to say nothing have having been named a hostile state by the foremost military power in Europe is also going to provide rocket fuel for the referendum.\nI expect the government to do its best to pretend to fiddle with the laws, declare the problem solved, and argue that the people putting constitutional limits on its ability to take sides are now unnecessary, but given the way they’ve already played that card with regards to other issues, no one buys it anymore.\nDISCUSS ON SG",
  "tags": [
    "law",
    "politics",
    "Switzerland"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-16T18:56:17+00:00"
}