{
  "url": "https://voxday.net/2024/04/19/the-literal-thought-police/",
  "scraped_at": "2026-01-08T14:30:17.265563",
  "title": "The Literal Thought Police",
  "date_display": "April 19, 2024",
  "date_iso": "2024-04-19T10:19:21+00:00",
  "date_from_url": "2024-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clown World’s thought police are getting <a href=\"https://www.dailymail.co.uk/sport/football/article-13327237/Joey-Barton-reveals-visited-police-four-times-three-days-controversial-tweets-one-visit-coming-9-30pm-night-ex-footballer-suggests-UK-turning-North-Korea.html\">increasingly heavy-handed</a> in England:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’ve been visited 4 times in 3 days by Cheshire Police. Asking for a Voluntary interview about something I’ve tweeted. Including a couple of women police officers knocking at 9.30pm last night when my kids were in bed. I’ve given them my solicitors information and number. He then called to arrange an interview. No answer, so he left a voice message for the Sergeant who’d visited on the 1st occasion. The last two women didn’t know there had been 3 visits in 3 days, apparently! Either it’s a shambles or an attempt to intimidate me and my family. Welcome to North Korea.</p></blockquote><p>Remember, hypocrisy is always a virtue in the inversion that is Clown World. The servants of Clown World genuinely believe they are upholding freedom as they oppress you, believe they are defending basic human rights as they threaten violent force to silence speech, and believe they are defending people while they murder innocent civilians.</p><p>And the more trivial the thought crime, the more popular the opinion expressed, the more overt the attempts to intimidate.</p><p>But don’t think that they’ll be mustered in your defense when you are openly slandered, libeled, defamed, and insulted, even when you have an iron-clad case against those who have clearly violated the law more egregiously than the thought criminals they are pursuing. Then, it’s suddenly “well, no actual harm done” and “freedom of speech” and “freedom of the press” and every other subjective excuse they think will somehow conceal the obvious fact of their shameless hypocrisy and double standard.</p><p>Which is why it is best, if you are at all active on social media or even a minor public figure, to stick relentlessly to telling the truth, using rhetoric that is soundly based in proper dialectic, and preferably, utilizes terms that are defined as positive by the Clown Worlders themselves. This doesn’t mean that they won’t try to prosecute you for directly quoting someone stating an uncomfortable truth, but it does significantly complicate their ability to do so successfully.</p><p><em>Rolling Stone</em> journalist Amanda Robb once complained in an article that she interviewed me for three hours without me ever giving her anything “useful”. What she was looking for was a kill-quote and I knew it. Her problem was that I expressed my opinions very clearly, without hiding anything, but in an entirely non-pejorative manner, with no vulgarities, obscenities, or emotionally-charged terms that have been defined as offensive. Of course, her confession confirming her intentions is why I no longer give interviews to anyone with any associations with the mainstream media.</p><p>That’s why, 11 years later, they’re <em>still </em>using the same half-sentence quote taken completely out of context to try to discredit and deplatform me. They just don’t have anything else; they have to invent totally false positions I’ve never, ever, held or expressed just to take a shot even though there are 27,000 blog posts, 512 columns, and 15 books to comb through if they need material. <a href=\"https://voxday.net/2013/06/13/a-black-female-fantasis/\">Here is the entire quote</a>, which you will note never appears in its entirety on Wikipedia or anywhere else beside this blog, because it shows that I was not only responding to an series of outrageous lies and accusations made, completely unprovoked, by Jemisin, but that my response to her absurd and dishonest “call for reconciliation” in Australia was not only reasonable, but prescient.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Jemisin has it wrong; it is not that I, and others, do not view her as human, (although genetic science presently suggests that we are not equally homo sapiens sapiens), it is that we simply do not view her as being fully civilized for the obvious historical reason that she is not.</p><p>She is lying about the laws in Texas and Florida too. The laws are not there to let whites ” just shoot people like me, without consequence, as long as they feel threatened by my presence”, those self-defense laws have been put in place to let whites defend their lives and their property from people, like her, who are half-savages engaged in attacking them.</p><p>Being an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by “a bunch of beardy old middle-class middle-American guys” than an illiterate Igbotu tribesman has of how to build a jet engine, Jemisin clearly does not understand that her dishonest call for “reconciliation” and even more diversity within SF/F is tantamount to a call for its decline into irrelevance. Nor do the back-patting Samuel Johnsons wiping their eyes and congratulating her for her ever-so-touching speech understand that.</p><p>There can be no reconciliation between the observant and the delusional.</p></blockquote><p>I have never retracted, apologized, or backed down from what I said, why it’s still all right there on the blog for everyone to see, and why they had to give her no less than three successive Best Novel Hugo Awards in order to elevate her imaginary standing in the science fiction world to distract attention from the observable truth about one of their leading poster diversities.</p><p>Eleven years later, events have proven my assessment was absolutely correct. Thanks to the convergence of the various industries involved, Jemisin got the “even more diversity within SF/F” for which she was calling and SF/F is now observably in marked decline in every single format, from comics to film. And it never ceases to be amusing how the midwits in the media showed themselves to be incapable of understanding the science in the genetic science reference, although word must have eventually gotten around because they all suddenly dropped that one about six years ago.</p><p>In any event, never give them the ammo with which to shoot you. Force them to manufacture it without ever stepping back one inch from that which is true and True. For we will continue to observe while they continue to delude themselves, and there will never be any reconciliation until the day Reality comes for them and shatters their delusions.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62598\" decoding=\"async\" fetchpriority=\"high\" height=\"530\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/04/image-16.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/04/image-16.png 512w, https://voxday.net/wp-content/uploads/2024/04/image-16-290x300.png 290w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>Oi! We ‘eard you been thinking some criminal thoughts!</em></figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/551c5794-4b3b-496d-a857-3c312eee35f7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Clown World’s thought police are getting\nincreasingly heavy-handed\nin England:\nI’ve been visited 4 times in 3 days by Cheshire Police. Asking for a Voluntary interview about something I’ve tweeted. Including a couple of women police officers knocking at 9.30pm last night when my kids were in bed. I’ve given them my solicitors information and number. He then called to arrange an interview. No answer, so he left a voice message for the Sergeant who’d visited on the 1st occasion. The last two women didn’t know there had been 3 visits in 3 days, apparently! Either it’s a shambles or an attempt to intimidate me and my family. Welcome to North Korea.\nRemember, hypocrisy is always a virtue in the inversion that is Clown World. The servants of Clown World genuinely believe they are upholding freedom as they oppress you, believe they are defending basic human rights as they threaten violent force to silence speech, and believe they are defending people while they murder innocent civilians.\nAnd the more trivial the thought crime, the more popular the opinion expressed, the more overt the attempts to intimidate.\nBut don’t think that they’ll be mustered in your defense when you are openly slandered, libeled, defamed, and insulted, even when you have an iron-clad case against those who have clearly violated the law more egregiously than the thought criminals they are pursuing. Then, it’s suddenly “well, no actual harm done” and “freedom of speech” and “freedom of the press” and every other subjective excuse they think will somehow conceal the obvious fact of their shameless hypocrisy and double standard.\nWhich is why it is best, if you are at all active on social media or even a minor public figure, to stick relentlessly to telling the truth, using rhetoric that is soundly based in proper dialectic, and preferably, utilizes terms that are defined as positive by the Clown Worlders themselves. This doesn’t mean that they won’t try to prosecute you for directly quoting someone stating an uncomfortable truth, but it does significantly complicate their ability to do so successfully.\nRolling Stone\njournalist Amanda Robb once complained in an article that she interviewed me for three hours without me ever giving her anything “useful”. What she was looking for was a kill-quote and I knew it. Her problem was that I expressed my opinions very clearly, without hiding anything, but in an entirely non-pejorative manner, with no vulgarities, obscenities, or emotionally-charged terms that have been defined as offensive. Of course, her confession confirming her intentions is why I no longer give interviews to anyone with any associations with the mainstream media.\nThat’s why, 11 years later, they’re\nstill\nusing the same half-sentence quote taken completely out of context to try to discredit and deplatform me. They just don’t have anything else; they have to invent totally false positions I’ve never, ever, held or expressed just to take a shot even though there are 27,000 blog posts, 512 columns, and 15 books to comb through if they need material.\nHere is the entire quote\n, which you will note never appears in its entirety on Wikipedia or anywhere else beside this blog, because it shows that I was not only responding to an series of outrageous lies and accusations made, completely unprovoked, by Jemisin, but that my response to her absurd and dishonest “call for reconciliation” in Australia was not only reasonable, but prescient.\nJemisin has it wrong; it is not that I, and others, do not view her as human, (although genetic science presently suggests that we are not equally homo sapiens sapiens), it is that we simply do not view her as being fully civilized for the obvious historical reason that she is not.\nShe is lying about the laws in Texas and Florida too. The laws are not there to let whites ” just shoot people like me, without consequence, as long as they feel threatened by my presence”, those self-defense laws have been put in place to let whites defend their lives and their property from people, like her, who are half-savages engaged in attacking them.\nBeing an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by “a bunch of beardy old middle-class middle-American guys” than an illiterate Igbotu tribesman has of how to build a jet engine, Jemisin clearly does not understand that her dishonest call for “reconciliation” and even more diversity within SF/F is tantamount to a call for its decline into irrelevance. Nor do the back-patting Samuel Johnsons wiping their eyes and congratulating her for her ever-so-touching speech understand that.\nThere can be no reconciliation between the observant and the delusional.\nI have never retracted, apologized, or backed down from what I said, why it’s still all right there on the blog for everyone to see, and why they had to give her no less than three successive Best Novel Hugo Awards in order to elevate her imaginary standing in the science fiction world to distract attention from the observable truth about one of their leading poster diversities.\nEleven years later, events have proven my assessment was absolutely correct. Thanks to the convergence of the various industries involved, Jemisin got the “even more diversity within SF/F” for which she was calling and SF/F is now observably in marked decline in every single format, from comics to film. And it never ceases to be amusing how the midwits in the media showed themselves to be incapable of understanding the science in the genetic science reference, although word must have eventually gotten around because they all suddenly dropped that one about six years ago.\nIn any event, never give them the ammo with which to shoot you. Force them to manufacture it without ever stepping back one inch from that which is true and True. For we will continue to observe while they continue to delude themselves, and there will never be any reconciliation until the day Reality comes for them and shatters their delusions.\nOi! We ‘eard you been thinking some criminal thoughts!\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "media",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-19T10:33:01+00:00"
}