{
  "url": "https://voxday.net/2024/04/01/they-know-they-will-lose/",
  "scraped_at": "2026-01-08T14:28:37.378295",
  "title": "They Know They Will Lose",
  "date_display": "April 1, 2024",
  "date_iso": "2024-04-01T01:38:19+00:00",
  "date_from_url": "2024-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although many of their pet politicians, corporate executives, and talking heads in the media don’t realize it yet, the top globalists already know that they have already lost WWIII, as Col Douglas Macgregor <a href=\"https://twitter.com/ivan_8848/status/1773336445173829641\">points out</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>This war has become financial as well as military. And the globalists understand that they’re going to lose this war. And what will come of this is that the BRICS, Brazil, Russia, India, China, South Africa, are going to be increased by 81 additional members. And all of these people are going to go to a currency that is backed by gold.</p><p>And once they go to that currency backed by gold, whether it is one currency or a basket of currencies, it doesn’t make any difference. Yes, we are in a lot of trouble. The globalists know that, and it is why they are so desperate right now. And the greatest fear that I have is that when the Russians do attack and it becomes abundantly clear that Ukraine is finished, I mean, it’s already obvious to anybody who visits the place for any length of time. It’s in ruins.</p><p>But once that occurs, I fear that there will be pressure to commit US forces in Poland and Romania, along with Polish forces and potentially Romanian ones, to western Ukraine. And if that occurs, the gloves will come off, because truthfully, thus far, Putin has exercised tremendous restraint, tremendous patience. He does not want a war with the West. If he wanted that, we’d already have it. But if we intervene in western Ukraine, it’s over. We’ll be in a full-fledged war.</p><p>You know, I think we grossly miscalculated. Putin had made several speeches over the last 20 years, repeatedly saying, please do not advance the border to Russia. Do not try to transform Ukraine into a hostile actor, an actor with hostile intentions towards Russia. What happens in Ukraine is of existential strategic interest to us, just as theoretically, what happens in Mexico is of existential strategic interest to us. Although this administration has decided to ignore it. He expected that we would negotiate, that he would demonstrate that this was serious, and that Russia wanted its population in eastern Ukraine, which is really Russian, to have equal rights before the law. He wanted to end the oppression of the Russians that lived there, and he wasn’t going to surrender Crimea.</p><p>The reason he went into Crimea is he was afraid it was going to be turned into a US naval base. Biden said. <em>“Our goal is regime change. Our goal is to get rid of Putin, and our goal is ultimately to divide Russia into constituent parts, then exploit it.”</em> All of his supporters, his staffers, everyone in the globalist camp knows this is the truth. The so-called oligarchs Kolomoisky, Soros and others were all part of this. None of this is news.</p><p>Finally, he said, enough’s enough. He stopped. They set up a strategic defense. They ran an economy-of-force mission, and now they have a force in place that can go as far as it needs to go, which includes to the Polish border. They have a plan for 31-month war against us if we insist on fighting it and we are in no shape to fight a war.</p><p>We can’t even recruit for the United States Army or the Marines. The Marines are running around trying to recruit illegals and are being encouraged to do so by the administration. Is that what you want in the ground force, to fight for this country? Forget it. It’s not going to work.</p></blockquote><p>The difference between the coming war that concerns Col Macgregor and the special military operation of the last two years is that Russia has been keeping most of its primary military forces in reserve from the start. The reason we haven’t been seeing any of the vast and sweeping combined-arms offensives that were utilized in Ukraine, Eastern Europe, and Manchuria in the 20th century is because the air force, the navy, and 600,000 army regulars have been preparing for a successful war against NATO that would probably end with the Russian occupation of the entire continent of Europe.</p><p>Which, as Macgregor, Martynov, and every competent observer of the last two years very well knows, is something that neither Putin nor any of the Russian generals want. Both the Russians and their Chinese counterparts have witnessed how empire and the foreign occupations it requires destroyed both British and American societies within decades. Even Israel’s micro-empire in Palestine is now causing tremendous rifts in Israeli society due to the current expansionary efforts.</p><p>Fortunately, the US is not very unlikely to intervene directly, because its primary concern is now the Southeast Asian front it is desperately trying to shore up in Japan, South Korea, the Philippines, and Vietnam. And while it may try to use the Poles, the French, the Finns, and the Germans as a second proxy force in Ukraine, I expect all of the various attempts in this regard to fail as soon as it becomes impossible for the European media to hide the true state of affairs and the complete imbalance of power that currently prevails on the continent from the voters of the European nations. Fear of the Russians might sway the Poles, the Baltics, and the Finns, but the possibility of war won’t increase support for the current governments anywhere else, most of which are already unpopular due to the migrant invasions.</p><p>If there is one thing I have learned while living in Europe for nearly 30 years, it is that Europeans are very nearly as clueless about the USA as Americans are about Europe. Much like the US Boomers, even the Millennial Europeans believe that the USA of today is essentially the same as the USA of the 1950s. That’s why the average Finn and the average Swede are genuinely naive enough to believe that the US military can protect them from the Russians when they might as reasonably rely upon Japan or Botswana to do so.</p><p>But it’s pretty clear that Putin and his generals have already concluded that only an actual demonstration of sufficient force will serve to impose a more realistic perspective on the delusional leaders of the erstwhile West, which is why I anticipate more unexpected fireworks and major infrastructural collapses this summer.</p><p><em><a href=\"https://social.infogalactic.com/micropost/bd2b0a8d-def8-47a8-b937-d8d0bf026c67\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Although many of their pet politicians, corporate executives, and talking heads in the media don’t realize it yet, the top globalists already know that they have already lost WWIII, as Col Douglas Macgregor\npoints out\n:\nThis war has become financial as well as military. And the globalists understand that they’re going to lose this war. And what will come of this is that the BRICS, Brazil, Russia, India, China, South Africa, are going to be increased by 81 additional members. And all of these people are going to go to a currency that is backed by gold.\nAnd once they go to that currency backed by gold, whether it is one currency or a basket of currencies, it doesn’t make any difference. Yes, we are in a lot of trouble. The globalists know that, and it is why they are so desperate right now. And the greatest fear that I have is that when the Russians do attack and it becomes abundantly clear that Ukraine is finished, I mean, it’s already obvious to anybody who visits the place for any length of time. It’s in ruins.\nBut once that occurs, I fear that there will be pressure to commit US forces in Poland and Romania, along with Polish forces and potentially Romanian ones, to western Ukraine. And if that occurs, the gloves will come off, because truthfully, thus far, Putin has exercised tremendous restraint, tremendous patience. He does not want a war with the West. If he wanted that, we’d already have it. But if we intervene in western Ukraine, it’s over. We’ll be in a full-fledged war.\nYou know, I think we grossly miscalculated. Putin had made several speeches over the last 20 years, repeatedly saying, please do not advance the border to Russia. Do not try to transform Ukraine into a hostile actor, an actor with hostile intentions towards Russia. What happens in Ukraine is of existential strategic interest to us, just as theoretically, what happens in Mexico is of existential strategic interest to us. Although this administration has decided to ignore it. He expected that we would negotiate, that he would demonstrate that this was serious, and that Russia wanted its population in eastern Ukraine, which is really Russian, to have equal rights before the law. He wanted to end the oppression of the Russians that lived there, and he wasn’t going to surrender Crimea.\nThe reason he went into Crimea is he was afraid it was going to be turned into a US naval base. Biden said.\n“Our goal is regime change. Our goal is to get rid of Putin, and our goal is ultimately to divide Russia into constituent parts, then exploit it.”\nAll of his supporters, his staffers, everyone in the globalist camp knows this is the truth. The so-called oligarchs Kolomoisky, Soros and others were all part of this. None of this is news.\nFinally, he said, enough’s enough. He stopped. They set up a strategic defense. They ran an economy-of-force mission, and now they have a force in place that can go as far as it needs to go, which includes to the Polish border. They have a plan for 31-month war against us if we insist on fighting it and we are in no shape to fight a war.\nWe can’t even recruit for the United States Army or the Marines. The Marines are running around trying to recruit illegals and are being encouraged to do so by the administration. Is that what you want in the ground force, to fight for this country? Forget it. It’s not going to work.\nThe difference between the coming war that concerns Col Macgregor and the special military operation of the last two years is that Russia has been keeping most of its primary military forces in reserve from the start. The reason we haven’t been seeing any of the vast and sweeping combined-arms offensives that were utilized in Ukraine, Eastern Europe, and Manchuria in the 20th century is because the air force, the navy, and 600,000 army regulars have been preparing for a successful war against NATO that would probably end with the Russian occupation of the entire continent of Europe.\nWhich, as Macgregor, Martynov, and every competent observer of the last two years very well knows, is something that neither Putin nor any of the Russian generals want. Both the Russians and their Chinese counterparts have witnessed how empire and the foreign occupations it requires destroyed both British and American societies within decades. Even Israel’s micro-empire in Palestine is now causing tremendous rifts in Israeli society due to the current expansionary efforts.\nFortunately, the US is not very unlikely to intervene directly, because its primary concern is now the Southeast Asian front it is desperately trying to shore up in Japan, South Korea, the Philippines, and Vietnam. And while it may try to use the Poles, the French, the Finns, and the Germans as a second proxy force in Ukraine, I expect all of the various attempts in this regard to fail as soon as it becomes impossible for the European media to hide the true state of affairs and the complete imbalance of power that currently prevails on the continent from the voters of the European nations. Fear of the Russians might sway the Poles, the Baltics, and the Finns, but the possibility of war won’t increase support for the current governments anywhere else, most of which are already unpopular due to the migrant invasions.\nIf there is one thing I have learned while living in Europe for nearly 30 years, it is that Europeans are very nearly as clueless about the USA as Americans are about Europe. Much like the US Boomers, even the Millennial Europeans believe that the USA of today is essentially the same as the USA of the 1950s. That’s why the average Finn and the average Swede are genuinely naive enough to believe that the US military can protect them from the Russians when they might as reasonably rely upon Japan or Botswana to do so.\nBut it’s pretty clear that Putin and his generals have already concluded that only an actual demonstration of sufficient force will serve to impose a more realistic perspective on the delusional leaders of the erstwhile West, which is why I anticipate more unexpected fireworks and major infrastructural collapses this summer.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-01T01:43:50+00:00"
}