{
  "url": "https://voxday.net/2024/04/12/what-leverage-is-that/",
  "scraped_at": "2026-01-08T14:29:41.968136",
  "title": "What Leverage is That?",
  "date_display": "April 12, 2024",
  "date_iso": "2024-04-12T20:54:59+00:00",
  "date_from_url": "2024-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clown World’s strategists appear to be increasingly deluded concerning <a href=\"https://quincyinst.org/research/the-diplomatic-path-to-a-secure-ukraine/#h-executive-summary\">the arts of the possible</a> with regards to the NATO-Russian war:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The war is not trending toward a stable stalemate, but toward Ukraine’s eventual collapse.  Russia has corrected many of the problems that plagued its forces during the first year of fighting and adopted an attrition strategy that is gradually exhausting Ukraine’s forces, draining American military stocks, and sapping the West’s political resolve. Sanctions have not crippled Russia’s war effort, and the West cannot fix Ukraine’s acute manpower problems absent direct intervention in the war.  Ukraine’s best hope lies in a negotiated settlement that protects its security, minimizes the risks of renewed attacks or escalation, and promotes broader stability in Europe and the world.   </p><p>Skeptics counter that Russia has no incentive to make meaningful concessions in a war it is increasingly winning.  But this belief underestimates the gap between what Russia can accomplish through its own military efforts and what it needs to ensure its broader security and economic prosperity over the longer term.  Russia can probably achieve some of its war aims by force, including blocking Ukraine’s membership in NATO and capturing much of the territory it regards as historically and culturally Russian.  But Russia cannot conquer, let alone govern, the majority of Ukraine, nor can Russia secure itself against the ongoing threats of Ukrainian sabotage or potential NATO strikes absent a costly permanent military buildup that would undermine its civilian economy. Reducing the deep dependence on China created by the invasion will also sooner or later require Russia to seek some form of détente with the West.  </p><p>As a result, the United States has significant leverage for bringing Russia to the table and forging verifiable agreements to end the fighting.  </p></blockquote><p>As Andrei Martyanov <a href=\"https://smoothiex12.blogspot.com/2024/04/anatol-lieven-continues-to-parade.html\">points out</a>, this particular analyst is talking out of both sides of his mouth. If, as he correctly says, Ukraine is on an inevitable path toward collapse, then Russia obviously can conquer, and if it chooses, occupy the entirety of the terrain over which the Kremlin ruled for eight decades. It’s obvious that Putin has no desire to do so, but it’s equally obvious that he will do so if Clown World continues to use the poor Ukrainians as an increasingly battered sword against a resurgent Russia.</p><p>And while the Chinese alliance is important to Russia, it is not why Russia has survived the economic attack on it nor have the Chinese provided any substantial material military support to Russia. Russia is serving as China’s proxy on the military front, except that unlike NATO’s Ukrainian proxy, Russia doesn’t need any assistance because when it comes to military technology and expertise, it is the Russians who are the senior partner.</p><p>In fact, it is the alliance of Russian military technology and expertise with Chinese economic power and industrial capacity that indicates the high probability of Clown World’s eventual defeat. Throw in the massive quantities of natural resources in Russia and the other BRICS nations, and one would be tempted to declare the conflict as over before it even starts, were it not for the vagaries of history that render any such preliminary verdict foolish.</p><p>After all, who foresaw the withdrawal of the Turks from the gates of Vienna, or the sudden retreat of the Mongol hordes from Europe and Russia upon the unexpected death of the Khan? We don’t know if either Putin or Xi have competent successors selected and prepared to step up and complete their national missions, just as we don’t know how much longer the USA and the European nations can withstand the centrifugal demographics that have been inserted into their rapidly degenerating societies.</p><p>But it is clear that the current phase is quickly approaching its endgame. Whether that will be via a reasonable surrender and settlement or by a classic Zhukovian Manchurian mega-offensive cannot be known, except that to say that the longer the former is delayed, the more likely the latter becomes. Either way, the war will not end in Ukraine.</p><p>We are not approaching the end, only the end of the beginning.</p><p><em><a href=\"https://social.infogalactic.com/micropost/17e71d2d-5a11-4622-b235-cf5cc61fa226\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Clown World’s strategists appear to be increasingly deluded concerning\nthe arts of the possible\nwith regards to the NATO-Russian war:\nThe war is not trending toward a stable stalemate, but toward Ukraine’s eventual collapse.  Russia has corrected many of the problems that plagued its forces during the first year of fighting and adopted an attrition strategy that is gradually exhausting Ukraine’s forces, draining American military stocks, and sapping the West’s political resolve. Sanctions have not crippled Russia’s war effort, and the West cannot fix Ukraine’s acute manpower problems absent direct intervention in the war.  Ukraine’s best hope lies in a negotiated settlement that protects its security, minimizes the risks of renewed attacks or escalation, and promotes broader stability in Europe and the world.\nSkeptics counter that Russia has no incentive to make meaningful concessions in a war it is increasingly winning.  But this belief underestimates the gap between what Russia can accomplish through its own military efforts and what it needs to ensure its broader security and economic prosperity over the longer term.  Russia can probably achieve some of its war aims by force, including blocking Ukraine’s membership in NATO and capturing much of the territory it regards as historically and culturally Russian.  But Russia cannot conquer, let alone govern, the majority of Ukraine, nor can Russia secure itself against the ongoing threats of Ukrainian sabotage or potential NATO strikes absent a costly permanent military buildup that would undermine its civilian economy. Reducing the deep dependence on China created by the invasion will also sooner or later require Russia to seek some form of détente with the West.\nAs a result, the United States has significant leverage for bringing Russia to the table and forging verifiable agreements to end the fighting.\nAs Andrei Martyanov\npoints out\n, this particular analyst is talking out of both sides of his mouth. If, as he correctly says, Ukraine is on an inevitable path toward collapse, then Russia obviously can conquer, and if it chooses, occupy the entirety of the terrain over which the Kremlin ruled for eight decades. It’s obvious that Putin has no desire to do so, but it’s equally obvious that he will do so if Clown World continues to use the poor Ukrainians as an increasingly battered sword against a resurgent Russia.\nAnd while the Chinese alliance is important to Russia, it is not why Russia has survived the economic attack on it nor have the Chinese provided any substantial material military support to Russia. Russia is serving as China’s proxy on the military front, except that unlike NATO’s Ukrainian proxy, Russia doesn’t need any assistance because when it comes to military technology and expertise, it is the Russians who are the senior partner.\nIn fact, it is the alliance of Russian military technology and expertise with Chinese economic power and industrial capacity that indicates the high probability of Clown World’s eventual defeat. Throw in the massive quantities of natural resources in Russia and the other BRICS nations, and one would be tempted to declare the conflict as over before it even starts, were it not for the vagaries of history that render any such preliminary verdict foolish.\nAfter all, who foresaw the withdrawal of the Turks from the gates of Vienna, or the sudden retreat of the Mongol hordes from Europe and Russia upon the unexpected death of the Khan? We don’t know if either Putin or Xi have competent successors selected and prepared to step up and complete their national missions, just as we don’t know how much longer the USA and the European nations can withstand the centrifugal demographics that have been inserted into their rapidly degenerating societies.\nBut it is clear that the current phase is quickly approaching its endgame. Whether that will be via a reasonable surrender and settlement or by a classic Zhukovian Manchurian mega-offensive cannot be known, except that to say that the longer the former is delayed, the more likely the latter becomes. Either way, the war will not end in Ukraine.\nWe are not approaching the end, only the end of the beginning.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-04-12T20:55:01+00:00"
}