{
  "url": "https://voxday.net/2017/04/10/alt-hero-in-action/",
  "scraped_at": "2025-12-18T07:09:42.673152",
  "title": "Alt-Hero in action",
  "date_display": "April 10, 2017",
  "date_iso": "2017-04-10T12:00:00+00:00",
  "date_from_url": "2017-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As there has been a tremendous amount of interest expressed in supporting the launch of a Castalia Comics line, and because the Brainstorm almost unanimously decided it was a project that merited pursuing, I’ve done some preliminary work in developing storylines, creating characters, finding good artists, and sorting out what sort of formats we should utilize. This is a mostly new area for me – writing the text for three <i>Archangels </i>comics is the full extent of my previous experience – so there is a bit of a learning curve involved, but I’m leaning towards a combination of smaller digital products combined with larger softcover print books and the occasional hardcover book for the hard core supporters and comics aficionados.</p><p>We also have to deal with the fact that Kickstarter is not a serious option. I contacted them and was open about what we intend to do with <i>Alt-Hero</i>, but instead of simply telling us that there was no chance in Hell they would permit such an egregious offense to their SJW principles, they said that we should put the entire campaign together, launch it, and then at that point they would let us know if it was acceptable or not.</p><p>Right. Fortunately, there are other options, as needless to say, even this small glimpse of the world of Prophet, Captain Euro, Michael Martel, and the UN-sponsored Global Justice Initiative will suffice to trigger outrage in the average SJW. Assuming that support for the project continues to remain strong, I expect we’ll launch the <i>Alt-Hero</i> kickstarter in 2-3 months.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2017/04/AH_01-01_512-Copy.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/04/AH_01-01_512-Copy.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2017/04/AH_01-01_512-Copy.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2017/04/AH_01-02_512.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/04/AH_01-02_512.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2017/04/AH_01-02_512.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "As there has been a tremendous amount of interest expressed in supporting the launch of a Castalia Comics line, and because the Brainstorm almost unanimously decided it was a project that merited pursuing, I’ve done some preliminary work in developing storylines, creating characters, finding good artists, and sorting out what sort of formats we should utilize. This is a mostly new area for me – writing the text for three\nArchangels\ncomics is the full extent of my previous experience – so there is a bit of a learning curve involved, but I’m leaning towards a combination of smaller digital products combined with larger softcover print books and the occasional hardcover book for the hard core supporters and comics aficionados.\nWe also have to deal with the fact that Kickstarter is not a serious option. I contacted them and was open about what we intend to do with\nAlt-Hero\n, but instead of simply telling us that there was no chance in Hell they would permit such an egregious offense to their SJW principles, they said that we should put the entire campaign together, launch it, and then at that point they would let us know if it was acceptable or not.\nRight. Fortunately, there are other options, as needless to say, even this small glimpse of the world of Prophet, Captain Euro, Michael Martel, and the UN-sponsored Global Justice Initiative will suffice to trigger outrage in the average SJW. Assuming that support for the project continues to remain strong, I expect we’ll launch the\nAlt-Hero\nkickstarter in 2-3 months.",
  "tags": [
    "Alt-Hero",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-10T11:00:00+00:00"
}