{
  "url": "https://voxday.net/2017/04/07/blunder-or-complete-debacle/",
  "scraped_at": "2025-12-18T07:09:17.512894",
  "title": "Blunder or complete debacle?",
  "date_display": "April 7, 2017",
  "date_iso": "2017-04-07T08:26:00+00:00",
  "date_from_url": "2017-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The God-Emperor <a href=\"http://www.reuters.com/article/us-mideast-crisis-syria-idUSKBN1782S0\">pulls a Clinton</a> and lobs 59 missiles at Syria:</p><blockquote><p> The United States on Friday fired dozens of cruise missiles at a Syrian airbase from which it said a deadly chemical weapons attack was launched this week, an escalation of the U.S. military role in Syria that immediately raised tension with Russia.</p><p>Just hours after U.S. President Donald Trump announced he had ordered the attack, a spokesman for Russian President Vladimir Putin said the strike had seriously damaged ties between Washington and Moscow.</p><p>Two U.S. warships fired 59 cruise missiles from the eastern Mediterranean Sea at the Syrian airbase controlled by the forces of President Bashar al-Assad in response to a poison gas attack in a rebel-held area on Tuesday, U.S. officials said.</p><p>Putin, a staunch ally of Assad, regarded the U.S. action as “aggression against a sovereign nation” on a “made-up pretext” and a cynical attempt to distract the world from civilian deaths in Iraq, his spokesman, Dmitry Peskov, was cited as saying by agencies.</p><p>It was the toughest direct U.S. action yet in Syria’s six-year-old civil war and leaves Trump facing his biggest foreign policy crisis since his Jan. 20 inauguration, raising the risk of confrontation with Russia and Iran, Assad’s two main military backers.</p></blockquote><p>Without question, this looks both stupid and disappointing. Following the lead of the neocons inevitably leads to disaster, sooner or later, for both the US President and the American people. And why now, when Assad and the various allied forces have ISIS on the run?</p><p>Perhaps it is because ISIS is an American creation? Perhaps because Israel prefers Daesh to Assad? Who knows?</p><p>Regardless, it’s important to keep in mind that the God-Emperor always makes mistakes. He always bumbles around like a bull in a china shop in any new or complicated situation. But usually, he learns from them. Usually, when one horn of his A/B testing fails, he abandons that strategy.</p><p>The problem, of course, is that “send American troops to fight and die in the Middle East” is an obvious failure that shouldn’t require any testing. And with tensions on the rise in North Korea, it seems a spectacularly stupid thing to attempt to heat up a second front, particularly <a href=\"http://www.dailymail.co.uk/news/article-4389332/Russia-calls-airstrikes-Syria-act-aggression.html\">at the price of losing Russian cooperation</a>.</p><blockquote class=\"tr_bq\"><p> Furious Vladimir Putin has called the US airstrikes on Syria an ‘illegal act of aggression’ and suspended a deal to avoid mid-air clashes with American fighter jets over the war-torn country. The Russian President warned of grave damage to relations between Washington and Moscow which are already ‘in tatters’… Syrian Army officials described the attack as an act of ‘blatant aggression’, saying it had made the US ‘a partner’ of ISIS, the ex-Nusra Front and other ‘terrorist organisations’. </p></blockquote><p>So, we’ll see. But we can still hope, not unreasonably, that Trump is merely giving Mattis or one of his military advisors his head, and that he will step in and make replacements once it becomes obvious that the “let’s pick a fight with Iran and Russia over Syria while rattling sabres at North Korea and China” is not a viable grand strategy. Never forget, Trump is a delegator, and this would appear to have been Mattis’s call.</p><blockquote><p> The Pentagon’s plan, delivered by Defense Secretary (and former Central Command commander) James Mattis, at Wednesday’s NSC meeting: a hellfire of Tomahawk missiles on the airfield where Assad’s regime had launched the attack. If there was dissent among any on Trump’s national security team, nobody spoke up. “Everybody agreed that this was the option that they liked,” said an administration official with knowledge of the meeting.</p><p>So on Thursday morning, a number of national security officials went to work at the White House believing the strike was imminent. But only a small number of principals—President Trump, Mattis, Secretary of State Rex Tillerson, and national security advisor H.R. McMaster among them—had knowledge the strike would happen Thursday night.</p></blockquote><p>I’m not giving up on the God-Emperor yet. It is the mark of a good leader to permit his subordinates to make decisions, to act upon those decisions, and then hold them accountable for the subsequent consequences. But this is a very good reminder that he wasn’t ever anything more than a long shot. And, it must be said, at least we’re not already at war with Russia over Ukraine, as would have almost certainly been the case had Hillary or one of the other Republicans been elected. In any event, Trump is going to have to learn to stop reacting like an emotionally incontinent woman trained by Pavlov whenever he sees children on television. He was elected to build a wall, send them back, and keep Americans out of war, not play Middle East kingmaker.</p><p>We don’t know yet that this is a complete debacle. But does appear to be, at minimum, a blunder, though possibly a necessary one. Trump will learn, as all U.S. Presidents eventually do, that foreign policy is a lot harder than domestic policy. War is a very serious business; would that U.S. politicians and generals would learn to treat it that way.</p><p> UPDATE: Or neither? After further discussion offline, I believe one of two scenarios are in play. One is the obvious “give the neocons their head” scenario I mentioned. The other is a much bigger one which I will not discuss in public, but would be very surprising and significant indeed. I’ve already written it out for the record; if events proceed accordingly, I’ll post it after the fact.</p><p>In the meantime, I would suggest trusting the God-Emperor until there is <i>considerably </i>more evidence that he is actually going to send ground troops to Syria to fight Syrian, Iranian, and Russian troops there. There is almost certainly much more going on here than meets the mainstream media’s eye.</p></div>",
  "content_text": "The God-Emperor\npulls a Clinton\nand lobs 59 missiles at Syria:\nThe United States on Friday fired dozens of cruise missiles at a Syrian airbase from which it said a deadly chemical weapons attack was launched this week, an escalation of the U.S. military role in Syria that immediately raised tension with Russia.\nJust hours after U.S. President Donald Trump announced he had ordered the attack, a spokesman for Russian President Vladimir Putin said the strike had seriously damaged ties between Washington and Moscow.\nTwo U.S. warships fired 59 cruise missiles from the eastern Mediterranean Sea at the Syrian airbase controlled by the forces of President Bashar al-Assad in response to a poison gas attack in a rebel-held area on Tuesday, U.S. officials said.\nPutin, a staunch ally of Assad, regarded the U.S. action as “aggression against a sovereign nation” on a “made-up pretext” and a cynical attempt to distract the world from civilian deaths in Iraq, his spokesman, Dmitry Peskov, was cited as saying by agencies.\nIt was the toughest direct U.S. action yet in Syria’s six-year-old civil war and leaves Trump facing his biggest foreign policy crisis since his Jan. 20 inauguration, raising the risk of confrontation with Russia and Iran, Assad’s two main military backers.\nWithout question, this looks both stupid and disappointing. Following the lead of the neocons inevitably leads to disaster, sooner or later, for both the US President and the American people. And why now, when Assad and the various allied forces have ISIS on the run?\nPerhaps it is because ISIS is an American creation? Perhaps because Israel prefers Daesh to Assad? Who knows?\nRegardless, it’s important to keep in mind that the God-Emperor always makes mistakes. He always bumbles around like a bull in a china shop in any new or complicated situation. But usually, he learns from them. Usually, when one horn of his A/B testing fails, he abandons that strategy.\nThe problem, of course, is that “send American troops to fight and die in the Middle East” is an obvious failure that shouldn’t require any testing. And with tensions on the rise in North Korea, it seems a spectacularly stupid thing to attempt to heat up a second front, particularly\nat the price of losing Russian cooperation\n.\nFurious Vladimir Putin has called the US airstrikes on Syria an ‘illegal act of aggression’ and suspended a deal to avoid mid-air clashes with American fighter jets over the war-torn country. The Russian President warned of grave damage to relations between Washington and Moscow which are already ‘in tatters’… Syrian Army officials described the attack as an act of ‘blatant aggression’, saying it had made the US ‘a partner’ of ISIS, the ex-Nusra Front and other ‘terrorist organisations’.\nSo, we’ll see. But we can still hope, not unreasonably, that Trump is merely giving Mattis or one of his military advisors his head, and that he will step in and make replacements once it becomes obvious that the “let’s pick a fight with Iran and Russia over Syria while rattling sabres at North Korea and China” is not a viable grand strategy. Never forget, Trump is a delegator, and this would appear to have been Mattis’s call.\nThe Pentagon’s plan, delivered by Defense Secretary (and former Central Command commander) James Mattis, at Wednesday’s NSC meeting: a hellfire of Tomahawk missiles on the airfield where Assad’s regime had launched the attack. If there was dissent among any on Trump’s national security team, nobody spoke up. “Everybody agreed that this was the option that they liked,” said an administration official with knowledge of the meeting.\nSo on Thursday morning, a number of national security officials went to work at the White House believing the strike was imminent. But only a small number of principals—President Trump, Mattis, Secretary of State Rex Tillerson, and national security advisor H.R. McMaster among them—had knowledge the strike would happen Thursday night.\nI’m not giving up on the God-Emperor yet. It is the mark of a good leader to permit his subordinates to make decisions, to act upon those decisions, and then hold them accountable for the subsequent consequences. But this is a very good reminder that he wasn’t ever anything more than a long shot. And, it must be said, at least we’re not already at war with Russia over Ukraine, as would have almost certainly been the case had Hillary or one of the other Republicans been elected. In any event, Trump is going to have to learn to stop reacting like an emotionally incontinent woman trained by Pavlov whenever he sees children on television. He was elected to build a wall, send them back, and keep Americans out of war, not play Middle East kingmaker.\nWe don’t know yet that this is a complete debacle. But does appear to be, at minimum, a blunder, though possibly a necessary one. Trump will learn, as all U.S. Presidents eventually do, that foreign policy is a lot harder than domestic policy. War is a very serious business; would that U.S. politicians and generals would learn to treat it that way.\nUPDATE: Or neither? After further discussion offline, I believe one of two scenarios are in play. One is the obvious “give the neocons their head” scenario I mentioned. The other is a much bigger one which I will not discuss in public, but would be very surprising and significant indeed. I’ve already written it out for the record; if events proceed accordingly, I’ll post it after the fact.\nIn the meantime, I would suggest trusting the God-Emperor until there is\nconsiderably\nmore evidence that he is actually going to send ground troops to Syria to fight Syrian, Iranian, and Russian troops there. There is almost certainly much more going on here than meets the mainstream media’s eye.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-07T07:26:00+00:00"
}