{
  "url": "https://voxday.net/2017/04/01/book-review-collapsing-empire/",
  "scraped_at": "2025-12-18T07:08:36.199265",
  "title": "BOOK REVIEW: The Collapsing Empire",
  "date_display": "April 1, 2017",
  "date_iso": "2017-04-01T22:43:00+00:00",
  "date_from_url": "2017-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>An established author who wishes to remain anonymous became interested in Scalzi’s latest as a result of the various shenanigans surrounding it and sent me his review of the book for posting here. His opinion of it is modestly more positive than mine, but I post it here, unedited, for the record. I also sent him a copy of <b><a href=\"http://amzn.to/2mdtblw\">Corrosion</a></b>, so it will be interesting to see his perspective on that if he happens to read and review it.</i></p><p><i>The Collapsing Empire</i> started its career as a published book with a major disadvantage – it had a great deal of hype.  Depending on who you believe, <i>The Collapsing Empire</i> is either the greatest space opera since <i>Dune </i>and <i>Foundation</i> or a millstone around Tor Books’ collective neck.  John Scalzi, known for <i>Old Man’s War</i> and <i>Redshirts</i>, has the problem that his latest novel will be judged against the hype, instead of being judged on its own merits.  In writing this review, I have done my best to ignore both sides of the ongoing culture wars and judge the book by its own merits.  You can judge for yourself if I have succeeded.</p><p>In the far future, interstellar travel is only possible through the Flow – an alternate dimension that allows FTL travel between colonised star systems.  (The science explanation is highly dubious, but I wouldn’t hold that against anyone.)  Humanity is united by the Interdependency, a network of colonies that are (mostly) dependent on each other to survive, and ruled by the Houses, led by the ‘Emperox.’  Unfortunately for the inhabitants of this universe, the Flow is actually changing – it’s either shifting routes (what the bad guys believe) or collapsing completely (what the good guys fear).  Either way, humanity is going to be in for some pretty rough times.  The Interdependency is so interdependent that only one world is habitable without massive tech support.</p><p>This sounds like the basis for a great space opera.  Humanity can – humanity must – find a way to survive when the Flow vanishes and all of its scattered star systems suddenly find themselves on their own.  (The tech base described in the book should certainly be up to the task.)  A lone star system can work to survive when the Interdependency vanishes.  Or humanity can find a way to travel FTL without using the Flow, or find a way to bend the Flow to humanity’s will.  Or …</p><p>These don’t happen.  Maybe they will in the sequel (the book ends on a cliff-hanger) but they don’t in <i>The Collapsing Empire</i>.  Instead, we get a mixture of local politics, interstellar shipping concerns and interstellar politics.  Some of these blend seamlessly into the story line, others don’t quite make sense.  I think it’s fairly safe to say that the most exciting part of the story is the mutiny in the prologue, which honestly doesn’t make sense (the mutineers are taking a terrible risk) and is completely unnecessary.  I’m happy to enjoy a <i>Game of Thrones</i>-style story about mighty aristocracies battling for supremacy, but that wasn’t what I was promised when I downloaded this book.</p><p>The book flows well – I read it in an hour – but it was oddly choppy.  There are aspects that really needed an editor’s touch – the mutiny in the prologue stops long enough for the author to lecture us on his universe, which isn’t necessary as all the main points are covered in CH4 – and others that needed more consideration.  I had problems following the flow – hah – of time within the universe; we are told, on one hand, that it takes months to move from Hub to end, yet Marce leaves Hub (after a largely pointless escape sequence) and in the very next section he’s on Hub.</p><p>Cardenia Wu-Patrick is probably the most likable character in the story, although she takes pointless risks and is generally ill-prepared to assume the post of ‘Emperox.’  (Her aide quips that nice people don’t get power, which misses the point that Cardenia inherited her power – she didn’t earn it.)  Marce Claremont is young and overshadowed by his sister, who I felt would have made a more interesting POV character.  And Kiva Lagos is – put bluntly – a potty-mouthed bully and a sexual predator.  Her good aspects are overshadowed by her bad points.</p><p>I admit it – I cringed when I read the first section, where it is clear that Kiva has pulled a very junior member of her ship’s crew into sexual congress.  Consent is dubious at the very least – there isn’t even a sense that he’s using her as she’s using him.  And then, she comes on to Marce later in the book in a manner that, if she were a man, would be considered borderline rape.  To call her ‘problematic’ is to understate the case.  This might not be a problem if she was the villain – or the text even acknowledged the issues – but it does not.</p><p>There are other issues, deeper issues, that offend my inner critic.  On one hand, Count Claremont – the physicist who first realised that something was wrong with the Flow – makes snarky remarks about the lack of peer review, yet his own work has the same problem.  While this is acknowledged, it makes no sense.  Modern-day governments have no problem finding qualified scientists and putting them to work on secret government projects.  Why can’t the Interdependency do the same?  And on the other, the bad guys – who have also realised that there is something wrong with the Flow – have a plan to take advantage of the crisis, but don’t seem to realise the potential of their own technology.  It suggests, very strongly, that no one takes the crisis completely seriously.</p><p>And yet, it is made clear that the Flow has shifted before.  Humanity has lost contact with Earth – in the distant past – and a relatively small colony world in the more recent past – but this does not appear to alarm anyone.  Is Earth really that insignificant?  One may draw a comparison between the Flow’s slow collapse and global warming, but the loss of two entire worlds is a little more significant than anything we’ve seen on Earth.  I would have expected a serious effort to reduce the degree of interdependency since that disaster.  If nothing else, shipping foodstuffs and suchlike between star systems must be an economic nightmare.  (And the ‘lie’ that binds the Interdependency together is obvious from the setting.)</p><p>To be honest, the text tries to balance humour with story and fails.  The fact that there is a legal way to mutiny – which no one bothers to follow – make me smile and roll my eyes at the mixture of humour and absurdity.  There are moments of banter that are oddly misplaced or unintentionally ironic.  The ship names sound as though they have come out of Iain M. Banks – Kiva’s ship is called the ‘Yes, Sir, That’s My Baby’ – but they have a very definite air of absurdity.  Banks made it work because the names suited the Culture – they don’t work so well in <i>The Collapsing Empire</i>.  And the very first line in the book is stolen directly from <i>Scooby Doo</i>.</p><p>In the end, <i>The Collapsing Empire</i> left me feeling oddly disappointed.  It’s shorter than I expected, given the price, and very little is resolved in the first book – the bad guys have taken a few blows, but the good guys haven’t even started to come to grips with the real problem.  I know that most books are set up as either trilogies or open-ended series these days, but there should be at least some resolution.  (If only because the second book might be delayed, increasing reader frustration.)  <i>Off Armageddon Reef </i>and <i>The Final Empire</i>, both also published by Tor, show how this can be done.</p><p><i>The Collapsing Empire</i> is not the best SF novel of the decade, nor is it the worst.  It has high ideals and grand ambitions, but it doesn’t live up to them (nor the hype).  I probably won’t be picking up the sequel.</p></div>",
  "content_text": "An established author who wishes to remain anonymous became interested in Scalzi’s latest as a result of the various shenanigans surrounding it and sent me his review of the book for posting here. His opinion of it is modestly more positive than mine, but I post it here, unedited, for the record. I also sent him a copy of\nCorrosion\n, so it will be interesting to see his perspective on that if he happens to read and review it.\nThe Collapsing Empire\nstarted its career as a published book with a major disadvantage – it had a great deal of hype.  Depending on who you believe,\nThe Collapsing Empire\nis either the greatest space opera since\nDune\nand\nFoundation\nor a millstone around Tor Books’ collective neck.  John Scalzi, known for\nOld Man’s War\nand\nRedshirts\n, has the problem that his latest novel will be judged against the hype, instead of being judged on its own merits.  In writing this review, I have done my best to ignore both sides of the ongoing culture wars and judge the book by its own merits.  You can judge for yourself if I have succeeded.\nIn the far future, interstellar travel is only possible through the Flow – an alternate dimension that allows FTL travel between colonised star systems.  (The science explanation is highly dubious, but I wouldn’t hold that against anyone.)  Humanity is united by the Interdependency, a network of colonies that are (mostly) dependent on each other to survive, and ruled by the Houses, led by the ‘Emperox.’  Unfortunately for the inhabitants of this universe, the Flow is actually changing – it’s either shifting routes (what the bad guys believe) or collapsing completely (what the good guys fear).  Either way, humanity is going to be in for some pretty rough times.  The Interdependency is so interdependent that only one world is habitable without massive tech support.\nThis sounds like the basis for a great space opera.  Humanity can – humanity must – find a way to survive when the Flow vanishes and all of its scattered star systems suddenly find themselves on their own.  (The tech base described in the book should certainly be up to the task.)  A lone star system can work to survive when the Interdependency vanishes.  Or humanity can find a way to travel FTL without using the Flow, or find a way to bend the Flow to humanity’s will.  Or …\nThese don’t happen.  Maybe they will in the sequel (the book ends on a cliff-hanger) but they don’t in\nThe Collapsing Empire\n.  Instead, we get a mixture of local politics, interstellar shipping concerns and interstellar politics.  Some of these blend seamlessly into the story line, others don’t quite make sense.  I think it’s fairly safe to say that the most exciting part of the story is the mutiny in the prologue, which honestly doesn’t make sense (the mutineers are taking a terrible risk) and is completely unnecessary.  I’m happy to enjoy a\nGame of Thrones\n-style story about mighty aristocracies battling for supremacy, but that wasn’t what I was promised when I downloaded this book.\nThe book flows well – I read it in an hour – but it was oddly choppy.  There are aspects that really needed an editor’s touch – the mutiny in the prologue stops long enough for the author to lecture us on his universe, which isn’t necessary as all the main points are covered in CH4 – and others that needed more consideration.  I had problems following the flow – hah – of time within the universe; we are told, on one hand, that it takes months to move from Hub to end, yet Marce leaves Hub (after a largely pointless escape sequence) and in the very next section he’s on Hub.\nCardenia Wu-Patrick is probably the most likable character in the story, although she takes pointless risks and is generally ill-prepared to assume the post of ‘Emperox.’  (Her aide quips that nice people don’t get power, which misses the point that Cardenia inherited her power – she didn’t earn it.)  Marce Claremont is young and overshadowed by his sister, who I felt would have made a more interesting POV character.  And Kiva Lagos is – put bluntly – a potty-mouthed bully and a sexual predator.  Her good aspects are overshadowed by her bad points.\nI admit it – I cringed when I read the first section, where it is clear that Kiva has pulled a very junior member of her ship’s crew into sexual congress.  Consent is dubious at the very least – there isn’t even a sense that he’s using her as she’s using him.  And then, she comes on to Marce later in the book in a manner that, if she were a man, would be considered borderline rape.  To call her ‘problematic’ is to understate the case.  This might not be a problem if she was the villain – or the text even acknowledged the issues – but it does not.\nThere are other issues, deeper issues, that offend my inner critic.  On one hand, Count Claremont – the physicist who first realised that something was wrong with the Flow – makes snarky remarks about the lack of peer review, yet his own work has the same problem.  While this is acknowledged, it makes no sense.  Modern-day governments have no problem finding qualified scientists and putting them to work on secret government projects.  Why can’t the Interdependency do the same?  And on the other, the bad guys – who have also realised that there is something wrong with the Flow – have a plan to take advantage of the crisis, but don’t seem to realise the potential of their own technology.  It suggests, very strongly, that no one takes the crisis completely seriously.\nAnd yet, it is made clear that the Flow has shifted before.  Humanity has lost contact with Earth – in the distant past – and a relatively small colony world in the more recent past – but this does not appear to alarm anyone.  Is Earth really that insignificant?  One may draw a comparison between the Flow’s slow collapse and global warming, but the loss of two entire worlds is a little more significant than anything we’ve seen on Earth.  I would have expected a serious effort to reduce the degree of interdependency since that disaster.  If nothing else, shipping foodstuffs and suchlike between star systems must be an economic nightmare.  (And the ‘lie’ that binds the Interdependency together is obvious from the setting.)\nTo be honest, the text tries to balance humour with story and fails.  The fact that there is a legal way to mutiny – which no one bothers to follow – make me smile and roll my eyes at the mixture of humour and absurdity.  There are moments of banter that are oddly misplaced or unintentionally ironic.  The ship names sound as though they have come out of Iain M. Banks – Kiva’s ship is called the ‘Yes, Sir, That’s My Baby’ – but they have a very definite air of absurdity.  Banks made it work because the names suited the Culture – they don’t work so well in\nThe Collapsing Empire\n.  And the very first line in the book is stolen directly from\nScooby Doo\n.\nIn the end,\nThe Collapsing Empire\nleft me feeling oddly disappointed.  It’s shorter than I expected, given the price, and very little is resolved in the first book – the bad guys have taken a few blows, but the good guys haven’t even started to come to grips with the real problem.  I know that most books are set up as either trilogies or open-ended series these days, but there should be at least some resolution.  (If only because the second book might be delayed, increasing reader frustration.)\nOff Armageddon Reef\nand\nThe Final Empire\n, both also published by Tor, show how this can be done.\nThe Collapsing Empire\nis not the best SF novel of the decade, nor is it the worst.  It has high ideals and grand ambitions, but it doesn’t live up to them (nor the hype).  I probably won’t be picking up the sequel.",
  "tags": [
    "Book Review",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-01T21:43:00+00:00"
}