{
  "url": "https://voxday.net/2017/04/04/fool-me-once/",
  "scraped_at": "2025-12-18T07:08:58.039242",
  "title": "Fool me once",
  "date_display": "April 4, 2017",
  "date_iso": "2017-04-04T22:31:00+00:00",
  "date_from_url": "2017-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently <i>Wired </i>thinks I can’t remember two whole years ago.</p><blockquote class=\"tr_bq\"><p> I’m a writer at WIRED magazine. I saw the Hugo noms this morning, and I have to ask about Stix Hiscock. What can you tell me about him? How did you discover him, and why was he a Rabid Puppies candidate this year?</p></blockquote><p>My response:<br> <i><br/></i><br> <i>That’s hilarious. I made the mistake of talking to you jokers once before. No thanks. You’ll have to sustain your Narrative without my help. </i></br></br></p><p>The amusing thing is that I even received two emails from <i>Wired </i>editors trying, and failing, to defend their writer’s little off-topic hit piece after I wrote about it here. They know they’re full of shit, they just want to hide that uncomfortable little fact from their readership.</p><p>As Andrew Torba says, I don’t talk to Fake News.</p></div>",
  "content_text": "Apparently\nWired\nthinks I can’t remember two whole years ago.\nI’m a writer at WIRED magazine. I saw the Hugo noms this morning, and I have to ask about Stix Hiscock. What can you tell me about him? How did you discover him, and why was he a Rabid Puppies candidate this year?\nMy response:\nThat’s hilarious. I made the mistake of talking to you jokers once before. No thanks. You’ll have to sustain your Narrative without my help.\nThe amusing thing is that I even received two emails from\nWired\neditors trying, and failing, to defend their writer’s little off-topic hit piece after I wrote about it here. They know they’re full of shit, they just want to hide that uncomfortable little fact from their readership.\nAs Andrew Torba says, I don’t talk to Fake News.",
  "tags": [
    "mailvox",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-04T21:31:00+00:00"
}