{
  "url": "https://voxday.net/2017/04/22/its-not-just-french-coming-apar/",
  "scraped_at": "2025-12-18T07:11:07.468915",
  "title": "It’s not just the French coming apart",
  "date_display": "April 22, 2017",
  "date_iso": "2017-04-22T12:00:00+00:00",
  "date_from_url": "2017-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A French intellectual observes <a href=\"https://www.city-journal.org/html/french-coming-apart-15125.html\">the demise of the Left-Right political spectrum</a> in France:</p><blockquote><p> The laid-off, the less educated, the mistrained—all must rebuild their lives in what Guilluy calls (in the title of his second book) La France périphérique. This is the key term in Guilluy’s sociological vocabulary, and much misunderstood in France, so it is worth clarifying: it is neither a synonym for the boondocks nor a measure of distance from the city center. (Most of France’s small cities, in fact, are in la France périphérique.) Rather, the term measures distance from the functioning parts of the global economy. France’s best-performing urban nodes have arguably never been richer or better-stocked with cultural and retail amenities. But too few such places exist to carry a national economy. When France’s was a national economy, its median workers were well compensated and well protected from illness, age, and other vicissitudes. In a knowledge economy, these workers have largely been exiled from the places where the economy still functions. They have been replaced by immigrants.</p><p>While rich Parisians may not miss the presence of the middle class, they do need people to bus tables, trim shrubbery, watch babies, and change bedpans. Immigrants—not native French workers—do most of these jobs. Why this should be so is an economic controversy. Perhaps migrants will do certain tasks that French people will not—at least not at the prevailing wage. Perhaps employers don’t relish paying €10 an hour to a native Frenchman who, ten years earlier, was making €20 in his old position and has resentments to match. Perhaps the current situation is an example of the economic law named after the eighteenth-century French economist Jean-Baptiste Say: a huge supply of menial labor from the developing world has created its own demand.<br> “The young men living in the northern Paris suburbs feel a burning solidarity with their Muslim brethren in the Middle East.”</br></p><p>This is not Guilluy’s subject, though. He aims only to show that, even if French people were willing to do the work that gets offered in these prosperous urban centers, there’d be no way for them to do it, because there is no longer any place for them to live. As a new bourgeoisie has taken over the private housing stock, poor foreigners have taken over the public—which thus serves the metropolitan rich as a kind of taxpayer-subsidized servants’ quarters. Public-housing inhabitants are almost never ethnically French; the prevailing culture there nowadays is often heavily, intimidatingly Muslim.</p></blockquote><p>One thing that is readily apparent about multiculturalism is how frighteningly fragile it is. It is completely dependent upon government funding being provided to the invading minorities. Which means, of course, it can be rapidly weakened by combining aggressive repatriation measures combined with a radical modification of the welfare system to provide only for those ethnically eligible.</p><p>Imagine how few foreigners would enter the United States if they were provided with no public services and no public dollars. There may not be sufficient support for that yet, but if the Alt-Right were to promise to take all of that money and provide two-thirds of it to pre-1965 Americans, I expect the measure would find majority support among those who would benefit greatly from it. And for the fiscally sane, it would represent about a forty percent cut in transfer payments.</p><p>Yes, it would certainly be better to altogether destroy the welfare system, but that’s not presently politically viable because female voters will never permit that. So, the winning strategy is to play the identity game, and play it to win.</p></div>",
  "content_text": "A French intellectual observes\nthe demise of the Left-Right political spectrum\nin France:\nThe laid-off, the less educated, the mistrained—all must rebuild their lives in what Guilluy calls (in the title of his second book) La France périphérique. This is the key term in Guilluy’s sociological vocabulary, and much misunderstood in France, so it is worth clarifying: it is neither a synonym for the boondocks nor a measure of distance from the city center. (Most of France’s small cities, in fact, are in la France périphérique.) Rather, the term measures distance from the functioning parts of the global economy. France’s best-performing urban nodes have arguably never been richer or better-stocked with cultural and retail amenities. But too few such places exist to carry a national economy. When France’s was a national economy, its median workers were well compensated and well protected from illness, age, and other vicissitudes. In a knowledge economy, these workers have largely been exiled from the places where the economy still functions. They have been replaced by immigrants.\nWhile rich Parisians may not miss the presence of the middle class, they do need people to bus tables, trim shrubbery, watch babies, and change bedpans. Immigrants—not native French workers—do most of these jobs. Why this should be so is an economic controversy. Perhaps migrants will do certain tasks that French people will not—at least not at the prevailing wage. Perhaps employers don’t relish paying €10 an hour to a native Frenchman who, ten years earlier, was making €20 in his old position and has resentments to match. Perhaps the current situation is an example of the economic law named after the eighteenth-century French economist Jean-Baptiste Say: a huge supply of menial labor from the developing world has created its own demand.\n“The young men living in the northern Paris suburbs feel a burning solidarity with their Muslim brethren in the Middle East.”\nThis is not Guilluy’s subject, though. He aims only to show that, even if French people were willing to do the work that gets offered in these prosperous urban centers, there’d be no way for them to do it, because there is no longer any place for them to live. As a new bourgeoisie has taken over the private housing stock, poor foreigners have taken over the public—which thus serves the metropolitan rich as a kind of taxpayer-subsidized servants’ quarters. Public-housing inhabitants are almost never ethnically French; the prevailing culture there nowadays is often heavily, intimidatingly Muslim.\nOne thing that is readily apparent about multiculturalism is how frighteningly fragile it is. It is completely dependent upon government funding being provided to the invading minorities. Which means, of course, it can be rapidly weakened by combining aggressive repatriation measures combined with a radical modification of the welfare system to provide only for those ethnically eligible.\nImagine how few foreigners would enter the United States if they were provided with no public services and no public dollars. There may not be sufficient support for that yet, but if the Alt-Right were to promise to take all of that money and provide two-thirds of it to pre-1965 Americans, I expect the measure would find majority support among those who would benefit greatly from it. And for the fiscally sane, it would represent about a forty percent cut in transfer payments.\nYes, it would certainly be better to altogether destroy the welfare system, but that’s not presently politically viable because female voters will never permit that. So, the winning strategy is to play the identity game, and play it to win.",
  "tags": [
    "#AltRight",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-22T11:00:00+00:00"
}