{
  "url": "https://voxday.net/2017/04/29/mailvox-moderates-never-learn/",
  "scraped_at": "2025-12-18T07:11:58.440563",
  "title": "Mailvox: moderates never learn",
  "date_display": "April 29, 2017",
  "date_iso": "2017-04-29T09:48:00+00:00",
  "date_from_url": "2017-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You don’t win by running from your extremists and stabbing them in the back in order to try to win the approval of the center. See: Sinn Fein. And yet, it appears elements of the Alt-Lite intend to make exactly the same mistake that Bill Buckley and his followers did when they banished dissidents from the conservative movement and created the Alt-Right in the first place. A report from Berkeley from someone who has been active there since the start:</p><blockquote><p> Antifa’s tactics rely heavily on police non-involvement. In this case, police arrested Antifa wearing masks and also patrolled the nearest parking garage, allegedly catching a truck of Antifa with explosives as a result. They also did NOT disarm our side nearly as much and allowed us to wear masks since they weren’t for identity concealment.</p><p>While Antifa’s tactics are somewhat sophisticated, they don’t appear to be flexible or adaptive. 2/1, 3/4, 4/15, and 4/27 were all the same. There were more Antifa present than a first glance suggests, as many of them came in quietly to check out our supplies and our numbers. They must have decided we were too well prepared to attack, at least without their explosives.</p><p>One big question of the day was who would the 2 PM start time hurt more: us or them? There are various factors, so can’t say for sure, but it would appear to have hurt them more. The numbers we got were key, but that may not be repeatable as the urgency will fade the longer we go without violent confrontation.</p><p>I see a disconnect between the rank and file and the leadership, particularly the Oath Keepers and Kyle Chapman. The rally attendees are mostly there to push back and to support free speech. They either don’t mind or LOVE Nathan Damigo and the TRS/IE/TDS guys, who literally saved lives on 4/15. Kyle and the OK, on the other hand, actively conspire to prevent any white nationalists from speaking on the open mic and don’t want them at the events.</p><p>For now, no question, everyone is following Kyle, which makes perfect sense. So far we have the fighters, the medics, and the lawyers working under Kyle’s banner.</p><p>There’s a delegation issue on our side, likely the result of not yet knowing who can be trusted to get things done. I do my own thing with my own group but found it was very difficult to make use of volunteers who didn’t have an extraordinary amount of personal initiative bc every decision had to be run by Kyle and Kyle never had time to respond.</p><p>The Oath Keepers are a pain in the ass to work with. There was some confusion in the morning bc they were telling people that “the neo-nazis” had been arrested, giving the impression it was Nathan’s group. Turns out they use neo-nazi as an all-purpose slur and it was actually Antifa who were arrested. In general the OK have survived by being extremely decorous when it comes to the law, so they are basically the nagging mom on the scene, “I don’t like this group, I don’t like that group. You can’t do X, can’t do Y [when actually X and Y are perfectly legal].” Understandable but annoying.</p><p>I didn’t see this “Millennials vs Boomers” thing at all at this event. The Boomers who showed up are much further right than the youngins. I’m curious to see what comes out of the ghetto going forward. After both events, I ended up talking with young black men from Oakland who consume a ton of YouTube and were hella woke, perfectly happy to embrace TDS guys bc they said people in the hood are sick of the discivic antics of Antifa and BLM.</p></blockquote><p>They aren’t the only Alt-Lite group about which I’ve heard the same failed strategy of running to the center being embraced. The thing that is so stupid about the strategy is that it is bound to fail because it is based on a false assumption that people want to be chased rather than led. The moderate conceptual model can’t explain why Ronald Reagan got more votes, and was more popular, than the more moderate George Bush. They can’t understand why people will respond so much more positively to those whose nationalism is outside the framework that the mainstream media deems to be reasonable. They can’t understand what Osama bin Laden meant by “the strong horse”.</p><p>And they’ll never see it coming when, like the Tea Party, they suddenly find that the parade they think they are leading has abruptly gone in another direction. If it didn’t work for the mainstream media, if it didn’t work for the American political establishment, if it didn’t work for the British political establishment, or for the European political establishments, it certainly isn’t going to work for them. These massive waves of social mood cannot be managed, muzzled, or controlled.</p><p>I appreciate what the moderates of the Alt-Lite are trying to accomplish, but the current trend is very clear. Nationalism is rising. Not civic nationalism, not paperwork nationalism, not state patriotism, not any other facsimile, but real, genuine, linguistic-religious-genetic nationalism. And the post-It’s a Small World Happy Time Credit Boom pendulum has barely even <i>begun </i>swinging back. Anyone and anything that stands in the way of that is going to find itself going by the wayside sooner or later.</p><p>Omni-nationalism, not civic nationalism or imperialism, much less multiculturalism or globalism, is the future. The world will be a confederation of nations, not a global federation of denationalized, deracinated, demoralized states. Which, of course, is why the Alt-Right is going to subsume the Alt-Lite, at least, those elements which don’t wind up drifting to the Left like the Never Trumpers did.</p><p>It is, of course, more than a bit ironic that self-appointed “free speech advocates” are themselves attempting to prevent others from speaking. You’d think people so obsessed with optics would be capable of grasping that they are creating a serious credibility problem for themselves.</p><p> UPDATE: <i>To quote Cernovich, few understand this. Almost all the rank and file and 100% of those vying for leadership positions believe appealing to the center is the key. Long run, it won’t matter.</i><br> <i><br/></i>Ye cats. To think some still can’t understand why I have zero interest in leading anyone anywhere. MPAI. If you learn nothing else here, remember that.</br></p></div>",
  "content_text": "You don’t win by running from your extremists and stabbing them in the back in order to try to win the approval of the center. See: Sinn Fein. And yet, it appears elements of the Alt-Lite intend to make exactly the same mistake that Bill Buckley and his followers did when they banished dissidents from the conservative movement and created the Alt-Right in the first place. A report from Berkeley from someone who has been active there since the start:\nAntifa’s tactics rely heavily on police non-involvement. In this case, police arrested Antifa wearing masks and also patrolled the nearest parking garage, allegedly catching a truck of Antifa with explosives as a result. They also did NOT disarm our side nearly as much and allowed us to wear masks since they weren’t for identity concealment.\nWhile Antifa’s tactics are somewhat sophisticated, they don’t appear to be flexible or adaptive. 2/1, 3/4, 4/15, and 4/27 were all the same. There were more Antifa present than a first glance suggests, as many of them came in quietly to check out our supplies and our numbers. They must have decided we were too well prepared to attack, at least without their explosives.\nOne big question of the day was who would the 2 PM start time hurt more: us or them? There are various factors, so can’t say for sure, but it would appear to have hurt them more. The numbers we got were key, but that may not be repeatable as the urgency will fade the longer we go without violent confrontation.\nI see a disconnect between the rank and file and the leadership, particularly the Oath Keepers and Kyle Chapman. The rally attendees are mostly there to push back and to support free speech. They either don’t mind or LOVE Nathan Damigo and the TRS/IE/TDS guys, who literally saved lives on 4/15. Kyle and the OK, on the other hand, actively conspire to prevent any white nationalists from speaking on the open mic and don’t want them at the events.\nFor now, no question, everyone is following Kyle, which makes perfect sense. So far we have the fighters, the medics, and the lawyers working under Kyle’s banner.\nThere’s a delegation issue on our side, likely the result of not yet knowing who can be trusted to get things done. I do my own thing with my own group but found it was very difficult to make use of volunteers who didn’t have an extraordinary amount of personal initiative bc every decision had to be run by Kyle and Kyle never had time to respond.\nThe Oath Keepers are a pain in the ass to work with. There was some confusion in the morning bc they were telling people that “the neo-nazis” had been arrested, giving the impression it was Nathan’s group. Turns out they use neo-nazi as an all-purpose slur and it was actually Antifa who were arrested. In general the OK have survived by being extremely decorous when it comes to the law, so they are basically the nagging mom on the scene, “I don’t like this group, I don’t like that group. You can’t do X, can’t do Y [when actually X and Y are perfectly legal].” Understandable but annoying.\nI didn’t see this “Millennials vs Boomers” thing at all at this event. The Boomers who showed up are much further right than the youngins. I’m curious to see what comes out of the ghetto going forward. After both events, I ended up talking with young black men from Oakland who consume a ton of YouTube and were hella woke, perfectly happy to embrace TDS guys bc they said people in the hood are sick of the discivic antics of Antifa and BLM.\nThey aren’t the only Alt-Lite group about which I’ve heard the same failed strategy of running to the center being embraced. The thing that is so stupid about the strategy is that it is bound to fail because it is based on a false assumption that people want to be chased rather than led. The moderate conceptual model can’t explain why Ronald Reagan got more votes, and was more popular, than the more moderate George Bush. They can’t understand why people will respond so much more positively to those whose nationalism is outside the framework that the mainstream media deems to be reasonable. They can’t understand what Osama bin Laden meant by “the strong horse”.\nAnd they’ll never see it coming when, like the Tea Party, they suddenly find that the parade they think they are leading has abruptly gone in another direction. If it didn’t work for the mainstream media, if it didn’t work for the American political establishment, if it didn’t work for the British political establishment, or for the European political establishments, it certainly isn’t going to work for them. These massive waves of social mood cannot be managed, muzzled, or controlled.\nI appreciate what the moderates of the Alt-Lite are trying to accomplish, but the current trend is very clear. Nationalism is rising. Not civic nationalism, not paperwork nationalism, not state patriotism, not any other facsimile, but real, genuine, linguistic-religious-genetic nationalism. And the post-It’s a Small World Happy Time Credit Boom pendulum has barely even\nbegun\nswinging back. Anyone and anything that stands in the way of that is going to find itself going by the wayside sooner or later.\nOmni-nationalism, not civic nationalism or imperialism, much less multiculturalism or globalism, is the future. The world will be a confederation of nations, not a global federation of denationalized, deracinated, demoralized states. Which, of course, is why the Alt-Right is going to subsume the Alt-Lite, at least, those elements which don’t wind up drifting to the Left like the Never Trumpers did.\nIt is, of course, more than a bit ironic that self-appointed “free speech advocates” are themselves attempting to prevent others from speaking. You’d think people so obsessed with optics would be capable of grasping that they are creating a serious credibility problem for themselves.\nUPDATE:\nTo quote Cernovich, few understand this. Almost all the rank and file and 100% of those vying for leadership positions believe appealing to the center is the key. Long run, it won’t matter.\nYe cats. To think some still can’t understand why I have zero interest in leading anyone anywhere. MPAI. If you learn nothing else here, remember that.",
  "tags": [
    "#AltRight",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-29T08:48:00+00:00"
}