{
  "url": "https://voxday.net/2017/04/08/mailvox-dont-read-earthsea/",
  "scraped_at": "2025-12-18T07:09:29.907488",
  "title": "Mailvox: don’t read Earthsea",
  "date_display": "April 8, 2017",
  "date_iso": "2017-04-08T17:00:00+00:00",
  "date_from_url": "2017-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At the very least, avoid reading anything beyond Book Two:</p><blockquote><p> Imagine that Tolkien embraced communism in the 1950s and was inspired to write a sequel to <i>The Return of the King</i> that embodied his new values of class oppression and false consciousness. The sequel, called simply <i>Elanor</i>, is thus about how Sam’s daughter Elanor discovery that “all along” the Hobbits were the real natives of Middle Earth, and rightful owners of the Rings of Power, and could bear them safely; that the Rings had been taken from them to use to exploit their rightful land of Middle Earth, while the hobbits were entrapped within the prison of the Shire under the watch of their jailers, the Rangers, who convinced them they were weak and needed shelter; and that this lasted for centuries until the truth was revealed when the hobbits had to be enlisted because the owners of the hobbit’s Rings were so corrupt that the only practical option was to destroy them. Armed with this knowledge, Elanor sets things to right by creating the first new Ring of Power in millennia so she can liberate all of Middle Earth with it.</p><p>And that’s why you should never read books 3, 4, or 5 of Earthsea.</p></blockquote><p>Drat! I think the emailer just gave McRapey his next big idea….</p></div>",
  "content_text": "At the very least, avoid reading anything beyond Book Two:\nImagine that Tolkien embraced communism in the 1950s and was inspired to write a sequel to\nThe Return of the King\nthat embodied his new values of class oppression and false consciousness. The sequel, called simply\nElanor\n, is thus about how Sam’s daughter Elanor discovery that “all along” the Hobbits were the real natives of Middle Earth, and rightful owners of the Rings of Power, and could bear them safely; that the Rings had been taken from them to use to exploit their rightful land of Middle Earth, while the hobbits were entrapped within the prison of the Shire under the watch of their jailers, the Rangers, who convinced them they were weak and needed shelter; and that this lasted for centuries until the truth was revealed when the hobbits had to be enlisted because the owners of the hobbit’s Rings were so corrupt that the only practical option was to destroy them. Armed with this knowledge, Elanor sets things to right by creating the first new Ring of Power in millennia so she can liberate all of Middle Earth with it.\nAnd that’s why you should never read books 3, 4, or 5 of Earthsea.\nDrat! I think the emailer just gave McRapey his next big idea….",
  "tags": [
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-08T16:00:00+00:00"
}