{
  "url": "https://voxday.net/2017/04/10/mailvox-but-what-about-fill-in-blanks/",
  "scraped_at": "2025-12-18T07:09:44.479540",
  "title": "Mailvox: but what about [fill-in-the-blank]s",
  "date_display": "April 10, 2017",
  "date_iso": "2017-04-10T15:51:00+00:00",
  "date_from_url": "2017-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Huggums asks about the likely fate of US Africans in the coming period of ethnic strife:</p><blockquote class=\"tr_bq\"><p> VD, in your ideal world, what would become of American black people in the coming years? I think you already told me what you think will happen: black people will be forcibly moved or killed at some point in the future based on the “diversity + proximity = war” principle. I’m asking because I want to continue offering my support to your cause because I believe it is actually based in truth, but I no longer see how I can. Where could a black person possibly fit in to this?</p></blockquote><p>My cause is a) the truth, b) Christianity, and c) Western civilization. If anyone can’t support those things, well, I can’t honestly say that have any more concern for their opinion or support than I do for anyone else who is devoted to a) falsehood, b) Satan, or c) barbarism. I don’t have an “ideal world”. I have never constructed my version of utopia. I don’t even believe in the concept of an “ideal world”, and as my novels tend to demonstrate I do not spend any time whatsoever dreaming up a flawless version of the real world. I have certainly never once given any thought to where American black people might fit in such a Panglossian conception.</p><p>In fairness, I have likewise never given any thought to the ideal fate of Venezuelans, Esquimaux, kangaroos, dandelions, or praying mantises either. I simply don’t think about such things. I never have. They are not of interest to me.</p><p>Huggums is, in my opinion, making two very common mistakes. First is to view everything from the “what about me?” perspective. This is a literal category error; one cannot meaningfully consider macrosocietal trends and issues from an individual perspective. It is ridiculous to say “X would be wrong because it would have negative consequences for me” and it is even worse to say “X is impossible because I wouldn’t want that to happen.”</p><p>History doesn’t care about you or your kind. The great waves of social mood don’t care about you or your nation. Even the great men of history, the Gaius Juliuses and the Wellingtons, were caught up and tossed about by the uncaring tides of events. The arrogance of the globalists who think they control the direction of history is entirely misplaced; they are no less utopian dreamers than the communists with their inevitable worker’s paradise or the Christian rapturists who recalculate the date of Christ’s return every other decade.</p><p>His second mistake is to confuse what I expect to happen on the basis of past historical patterns with what I want. I cannot stress this enough:<i> what I want is totally irrelevant. </i>What all of us want is irrelevant. What is going to happen is going to happen according to the usual patterns of history.  Yes, blacks will be forcibly moved and killed. As will whites, Koreans, Chinese, Mexicans, mixed-race people, and pretty much everyone else. How does anyone imagine homogeneous nations are created in the first place? They don’t spring ex nihilo out of the rocks.<br> <i><br/></i><br> That being said, my preference is for all association to be voluntary, since it is one of the basic Rights of Englishmen secured for the Posterity of the Founders by the U.S. Constitution. If white people don’t want to live around black people, they should not be forced to do so. Each community should have the right to decide who is, and who is not, permitted to reside in it.</br></br></p><p>Some communities would prefer to be entirely homogenous. Others would value diversity. And there is absolutely nothing wrong with <i>either </i>preference. I suggest that Huggums try considering the question from the other perspective: how can blacks NOT support the Alt-Right cause when Mexicans are displacing them from historically black communities in the United States and the Chinese are beginning to move into Africa in increasing numbers?</p><p>It’s one thing to worry that white people might not want you around. It’s another to realize that your people are liable to be entirely deprived of <i>anywhere </i>they can call home. But if white people don’t have a basic right to their own inviolate homelands, neither does anyone else. In this age of genetic testing, I cannot be certain that I would be welcome in a white community, but that does not lead me to conclude that, therefore, the people of that community should be deprived of their right of free association.</p><p>Because neither I, nor Huggums, nor anyone else, possess the intrinsic right to impose ourselves, wanted or not, on literally the entire human race as we happen to see fit at the moment.</p></div>",
  "content_text": "Huggums asks about the likely fate of US Africans in the coming period of ethnic strife:\nVD, in your ideal world, what would become of American black people in the coming years? I think you already told me what you think will happen: black people will be forcibly moved or killed at some point in the future based on the “diversity + proximity = war” principle. I’m asking because I want to continue offering my support to your cause because I believe it is actually based in truth, but I no longer see how I can. Where could a black person possibly fit in to this?\nMy cause is a) the truth, b) Christianity, and c) Western civilization. If anyone can’t support those things, well, I can’t honestly say that have any more concern for their opinion or support than I do for anyone else who is devoted to a) falsehood, b) Satan, or c) barbarism. I don’t have an “ideal world”. I have never constructed my version of utopia. I don’t even believe in the concept of an “ideal world”, and as my novels tend to demonstrate I do not spend any time whatsoever dreaming up a flawless version of the real world. I have certainly never once given any thought to where American black people might fit in such a Panglossian conception.\nIn fairness, I have likewise never given any thought to the ideal fate of Venezuelans, Esquimaux, kangaroos, dandelions, or praying mantises either. I simply don’t think about such things. I never have. They are not of interest to me.\nHuggums is, in my opinion, making two very common mistakes. First is to view everything from the “what about me?” perspective. This is a literal category error; one cannot meaningfully consider macrosocietal trends and issues from an individual perspective. It is ridiculous to say “X would be wrong because it would have negative consequences for me” and it is even worse to say “X is impossible because I wouldn’t want that to happen.”\nHistory doesn’t care about you or your kind. The great waves of social mood don’t care about you or your nation. Even the great men of history, the Gaius Juliuses and the Wellingtons, were caught up and tossed about by the uncaring tides of events. The arrogance of the globalists who think they control the direction of history is entirely misplaced; they are no less utopian dreamers than the communists with their inevitable worker’s paradise or the Christian rapturists who recalculate the date of Christ’s return every other decade.\nHis second mistake is to confuse what I expect to happen on the basis of past historical patterns with what I want. I cannot stress this enough:\nwhat I want is totally irrelevant.\nWhat all of us want is irrelevant. What is going to happen is going to happen according to the usual patterns of history.  Yes, blacks will be forcibly moved and killed. As will whites, Koreans, Chinese, Mexicans, mixed-race people, and pretty much everyone else. How does anyone imagine homogeneous nations are created in the first place? They don’t spring ex nihilo out of the rocks.\nThat being said, my preference is for all association to be voluntary, since it is one of the basic Rights of Englishmen secured for the Posterity of the Founders by the U.S. Constitution. If white people don’t want to live around black people, they should not be forced to do so. Each community should have the right to decide who is, and who is not, permitted to reside in it.\nSome communities would prefer to be entirely homogenous. Others would value diversity. And there is absolutely nothing wrong with\neither\npreference. I suggest that Huggums try considering the question from the other perspective: how can blacks NOT support the Alt-Right cause when Mexicans are displacing them from historically black communities in the United States and the Chinese are beginning to move into Africa in increasing numbers?\nIt’s one thing to worry that white people might not want you around. It’s another to realize that your people are liable to be entirely deprived of\nanywhere\nthey can call home. But if white people don’t have a basic right to their own inviolate homelands, neither does anyone else. In this age of genetic testing, I cannot be certain that I would be welcome in a white community, but that does not lead me to conclude that, therefore, the people of that community should be deprived of their right of free association.\nBecause neither I, nor Huggums, nor anyone else, possess the intrinsic right to impose ourselves, wanted or not, on literally the entire human race as we happen to see fit at the moment.",
  "tags": [
    "#AltRight",
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-10T14:51:00+00:00"
}