{
  "url": "https://voxday.net/2017/04/14/nationalism-intensifies/",
  "scraped_at": "2025-12-18T07:10:11.826153",
  "title": "Nationalism intensifies",
  "date_display": "April 14, 2017",
  "date_iso": "2017-04-14T08:04:00+00:00",
  "date_from_url": "2017-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As if yet another indicator were necessary, <a href=\"https://www.nytimes.com/2017/04/13/us/overseas-adoptions-decline.html\">overseas adoptions are at a 35-year low</a>:</p><blockquote class=\"tr_bq\"><p> Overseas adoptions by Americans have dipped to the lowest level in 35 years, data released on Wednesday showed. The State Department reported that it issued 5,372 visas to children who were adopted abroad or were coming to the United States to be adopted by American parents in 2016, down from 5,648 in 2015 — and a fraction of the 22,884 overseas adoptions in 2004, the peak.</p></blockquote><p>There are, of course, a variety of factors involved. The economy is bad, fewer people are getting married, and married women who are not inclined to bear and raise their own children are even less inclined to raise someone else’s children.</p><p>That being said, the decline of international adoption in America is interesting in light of the celebrity fad for virtue signaling by adopting Africans; those religiously reading <i>People </i>magazine would almost certainly have assumed the complete opposite. First, it is a sign of rising national consciousness by other nations who don’t want their children to be taken away and raised as pseudo-Americans. And second, it is a sign that Americans are beginning to realize that many of their friends and neighbors don’t admire their cuckish virtue or generosity for giving a home to yet another invader.</p><p>About ten years ago, a <i>straniera </i>we knew was shocked by how she was not infrequently met with sneers and disdainful glares by Italians when she was out and about with her adopted African daughter. She found it hard to understand that they did not, on the whole, view her decision as a good thing or consider her to be a good person as a consequence. It would be understandable if this European nationalist perspective is becoming increasingly common in the USA as Americans find it harder and harder to recognize the society in which they live.</p><p>Besides, what need is there to go to Somalia to adopt Somalians anymore? You can find tens of thousands of them in Minneapolis now.</p><p>The money quote: <i>“No children were adopted from Russia, once a major source; it shut out prospective American parents for political reasons three years ago.”</i></p></div>",
  "content_text": "As if yet another indicator were necessary,\noverseas adoptions are at a 35-year low\n:\nOverseas adoptions by Americans have dipped to the lowest level in 35 years, data released on Wednesday showed. The State Department reported that it issued 5,372 visas to children who were adopted abroad or were coming to the United States to be adopted by American parents in 2016, down from 5,648 in 2015 — and a fraction of the 22,884 overseas adoptions in 2004, the peak.\nThere are, of course, a variety of factors involved. The economy is bad, fewer people are getting married, and married women who are not inclined to bear and raise their own children are even less inclined to raise someone else’s children.\nThat being said, the decline of international adoption in America is interesting in light of the celebrity fad for virtue signaling by adopting Africans; those religiously reading\nPeople\nmagazine would almost certainly have assumed the complete opposite. First, it is a sign of rising national consciousness by other nations who don’t want their children to be taken away and raised as pseudo-Americans. And second, it is a sign that Americans are beginning to realize that many of their friends and neighbors don’t admire their cuckish virtue or generosity for giving a home to yet another invader.\nAbout ten years ago, a\nstraniera\nwe knew was shocked by how she was not infrequently met with sneers and disdainful glares by Italians when she was out and about with her adopted African daughter. She found it hard to understand that they did not, on the whole, view her decision as a good thing or consider her to be a good person as a consequence. It would be understandable if this European nationalist perspective is becoming increasingly common in the USA as Americans find it harder and harder to recognize the society in which they live.\nBesides, what need is there to go to Somalia to adopt Somalians anymore? You can find tens of thousands of them in Minneapolis now.\nThe money quote:\n“No children were adopted from Russia, once a major source; it shut out prospective American parents for political reasons three years ago.”",
  "tags": [
    "cuckservative",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-14T07:04:00+00:00"
}