{
  "url": "https://voxday.net/2017/04/19/never-too-big/",
  "scraped_at": "2025-12-18T07:10:49.285517",
  "title": "Never too big",
  "date_display": "April 19, 2017",
  "date_iso": "2017-04-19T18:30:00+00:00",
  "date_from_url": "2017-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bill O’Reilly is just the latest to learn that no matter how big you are, <a href=\"http://nymag.com/daily/intelligencer/2017/04/sources-fox-news-has-decided-bill-oreilly-has-to-go.html\">SJWs in the media and the corpocracy can take you down</a> if you give them half a chance.</p><blockquote class=\"tr_bq\"><p> The Murdochs have decided Bill O’Reilly’s 21-year run at Fox News will come to an end. According to sources briefed on the discussions, network executives are preparing to announce O’Reilly’s departure before he returns from an Italian vacation on April 24…. The Murdochs’ decision to dump O’Reilly shocked many Fox News staffers I’ve spoken to in recent days. Late last week, the feeling inside the company was that Rupert Murdoch would prevail over his son James, who lobbied to jettison the embattled host. It’s still unclear exactly how the tide turned. According to one source, Lachlan Murdoch’s wife helped convince her husband that O’Reilly needed to go, which moved Lachlan into James’s corner.</p></blockquote><p>I’m not a fan of O’Reilly. My book <i>Media Whores</i> was killed by the publisher and I was paid not to write it after Fox News learned that O’Reilly was one of the subjects to whom a chapter was devoted. But the point is that no one is bigger on cable news than he is, and yet a few allegations were enough to bring him down despite his continuing popularity.</p><p>This is why you MUST build your own platform. It’s a non-negotiable.</p></div>",
  "content_text": "Bill O’Reilly is just the latest to learn that no matter how big you are,\nSJWs in the media and the corpocracy can take you down\nif you give them half a chance.\nThe Murdochs have decided Bill O’Reilly’s 21-year run at Fox News will come to an end. According to sources briefed on the discussions, network executives are preparing to announce O’Reilly’s departure before he returns from an Italian vacation on April 24…. The Murdochs’ decision to dump O’Reilly shocked many Fox News staffers I’ve spoken to in recent days. Late last week, the feeling inside the company was that Rupert Murdoch would prevail over his son James, who lobbied to jettison the embattled host. It’s still unclear exactly how the tide turned. According to one source, Lachlan Murdoch’s wife helped convince her husband that O’Reilly needed to go, which moved Lachlan into James’s corner.\nI’m not a fan of O’Reilly. My book\nMedia Whores\nwas killed by the publisher and I was paid not to write it after Fox News learned that O’Reilly was one of the subjects to whom a chapter was devoted. But the point is that no one is bigger on cable news than he is, and yet a few allegations were enough to bring him down despite his continuing popularity.\nThis is why you MUST build your own platform. It’s a non-negotiable.",
  "tags": [
    "corpocracy",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-19T17:30:00+00:00"
}