{
  "url": "https://voxday.net/2017/04/28/rape-rape-cant-finis/",
  "scraped_at": "2025-12-18T07:11:56.581810",
  "title": "Rape Rape can’t finish",
  "date_display": "April 28, 2017",
  "date_iso": "2017-04-28T18:00:00+00:00",
  "date_from_url": "2017-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of new rumors concerning the completion of <i>The Winds of Winter</i>, a number of people have been reminding me that I have been predicting that George Martin would not be able to finish <i>A Song of Ice and Fire</i> for several years now.<br> <i><br/></i><br> <i>I generally enjoy the Fire and Ice series, but I thought the last book, divided into two, bordered on the tedious and didn’t advance the story much. Like pitchers, writers tend to lose their fastball abruptly, and often without any warning. I suspect Martin’s inability to finish the book in a reasonable time frame after turning in a relatively mediocre, (in comparison with the standard he’d previously set, you understand) prior novel doesn’t bode well for A Dance with Dragons, but I will be pleased to be proved wrong in July.</i><br> – March 4, 2011</br></br></br></p><p><i>At this point, our best hope for ever seeing the series resolved may be for him to kick off sometime after the next book is released, somehow leading to me being asked to finish the series by Harper Collins.  I’ll have to think about how I’d go about fixing all the unnecessary loose ends he created in tying the Mereen Knot, but I think the first thing I would do is kill off Reek and the Bastard of Bolton in an unfortunate accident involving chicken bones, a rich cheese sauce, and a sadistic feast-orgy.</i><br> – May 6, 2013</br></p><p>Of course, now that many readers are comparing <i>Arts of Dark and Light</i> favorably with <i>A Song of Ice and Fire</i>, I’d much rather finish my own series than clean up after the gargantuan hash Martin has made of his own books, but apparently <a href=\"http://www.celebeat.com/articles/25001/20170426/the-winds-of-winter-is-now-possibly-written-by-neil-gaiman-american-gods-author-is-grrms-possible-editor.htm\">someone else is willing</a> to attempt to clean out the fat man’s stables:</p><blockquote><p> George R.R. Martin’s “The Winds of Winter” is one of the highly-anticipated novels and fans are hoping to get their hands on it this year. It is the sixth novel in the fantasy series “A Song of Ice and Fire” and HBO has previously hinted that it’s one of the priorities as a wild card. Recent reports say that the author has been busy finishing a charity work as well as a film studio in Santa Fe, Mexico. However, a new report is claiming that “American Gods” author, Neil Gaiman is now the one writing the novel on Martin’s behalf.</p><p>Earlier reports from Celebeat suggest that “The Winds of Winter” might be out in June, which is at least a month before “Game of Thrones” season 7 premieres on July 16. It is said that Martin is just finishing a charity work and then he will focus on writing the novel. Now, it is said that Gaiman has been spotted at Martin’s hometown many times, leading fans to believe that he has been writing the novel.</p><p>There are also reports suggesting that Gaiman might be Martin’s editor for “The Winds of Winter” and this could be the reason of his visits at Martin’s hometown. However, these claims are yet to be confirmed and the fans should content themselves for now that the novel should be out within this year. Apparently, Martin is busy at the moment with his film studio in Mexico, which will be available to Hollywood production as well as film entrepreneurs.</p><p>The Albuquerque Journal reports that “The Winds of Winter” author’s film studio is housed in a 30,000 square-foot non-profit building in Santa Fe, Mexico. Martin has previously indicated in his blog that he is still focused on a different project, but has made progress in the novel. He also said that he will announce the completion and delivery of the novel.</p></blockquote><p>I have to admit, I laughed at the idea that Martin has been reduced to resorting to a ghostwriter in order to simply <i>complete his own series</i>. How pathetic is that? At least Robert Jordan had the excuse of being dead. The American Tolkien indeed….</p></div>",
  "content_text": "In light of new rumors concerning the completion of\nThe Winds of Winter\n, a number of people have been reminding me that I have been predicting that George Martin would not be able to finish\nA Song of Ice and Fire\nfor several years now.\nI generally enjoy the Fire and Ice series, but I thought the last book, divided into two, bordered on the tedious and didn’t advance the story much. Like pitchers, writers tend to lose their fastball abruptly, and often without any warning. I suspect Martin’s inability to finish the book in a reasonable time frame after turning in a relatively mediocre, (in comparison with the standard he’d previously set, you understand) prior novel doesn’t bode well for A Dance with Dragons, but I will be pleased to be proved wrong in July.\n– March 4, 2011\nAt this point, our best hope for ever seeing the series resolved may be for him to kick off sometime after the next book is released, somehow leading to me being asked to finish the series by Harper Collins.  I’ll have to think about how I’d go about fixing all the unnecessary loose ends he created in tying the Mereen Knot, but I think the first thing I would do is kill off Reek and the Bastard of Bolton in an unfortunate accident involving chicken bones, a rich cheese sauce, and a sadistic feast-orgy.\n– May 6, 2013\nOf course, now that many readers are comparing\nArts of Dark and Light\nfavorably with\nA Song of Ice and Fire\n, I’d much rather finish my own series than clean up after the gargantuan hash Martin has made of his own books, but apparently\nsomeone else is willing\nto attempt to clean out the fat man’s stables:\nGeorge R.R. Martin’s “The Winds of Winter” is one of the highly-anticipated novels and fans are hoping to get their hands on it this year. It is the sixth novel in the fantasy series “A Song of Ice and Fire” and HBO has previously hinted that it’s one of the priorities as a wild card. Recent reports say that the author has been busy finishing a charity work as well as a film studio in Santa Fe, Mexico. However, a new report is claiming that “American Gods” author, Neil Gaiman is now the one writing the novel on Martin’s behalf.\nEarlier reports from Celebeat suggest that “The Winds of Winter” might be out in June, which is at least a month before “Game of Thrones” season 7 premieres on July 16. It is said that Martin is just finishing a charity work and then he will focus on writing the novel. Now, it is said that Gaiman has been spotted at Martin’s hometown many times, leading fans to believe that he has been writing the novel.\nThere are also reports suggesting that Gaiman might be Martin’s editor for “The Winds of Winter” and this could be the reason of his visits at Martin’s hometown. However, these claims are yet to be confirmed and the fans should content themselves for now that the novel should be out within this year. Apparently, Martin is busy at the moment with his film studio in Mexico, which will be available to Hollywood production as well as film entrepreneurs.\nThe Albuquerque Journal reports that “The Winds of Winter” author’s film studio is housed in a 30,000 square-foot non-profit building in Santa Fe, Mexico. Martin has previously indicated in his blog that he is still focused on a different project, but has made progress in the novel. He also said that he will announce the completion and delivery of the novel.\nI have to admit, I laughed at the idea that Martin has been reduced to resorting to a ghostwriter in order to simply\ncomplete his own series\n. How pathetic is that? At least Robert Jordan had the excuse of being dead. The American Tolkien indeed….",
  "tags": [
    "books",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-28T17:00:00+00:00"
}