{
  "url": "https://voxday.net/2017/04/06/reading-list-2016/",
  "scraped_at": "2025-12-18T07:09:10.907068",
  "title": "Reading List 2016",
  "date_display": "April 6, 2017",
  "date_iso": "2017-04-06T12:00:00+00:00",
  "date_from_url": "2017-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was so busy in 2016 that the number of books I read in their entirety declined from 63 to 52. Of the books I read last year, the one I enjoyed most was South of the Border, West of the Sun, a novel about a jazz club owner by Haruki Murakami. The novel I most enjoyed was Nick Cole’s Ctrl-Alt-Revolt!, I find it hard to imagine the game designer or serious gamer who would not enjoy it. Dance Dance Dance was very good, but Murakami did not quite bring his A-game in that one.</p><p>The worst books I read this year were Simon Hawke’s clumsy attempts to turn Shakespeare into a detective, a fictional trend that I despise, and although he is a pop-SF writer with a historical bent whom I normally enjoy reading, I gave up on the Shakespeare &amp; Smythe series after reading the first three books in it. They weren’t horrible, though, and I did not read a single book I considered to be a one-star book this year.</p><p>On the non-fiction side, I read a number of truly excellent books from Hallpike, Oman, Huntington and Turchin. We managed to acquire the Hallpike for Castalia House, we tried and failed to do the same with the Turchin books. One for three isn’t bad. The best non-fiction book was <i><a href=\"http://amzn.to/2nfLetA\">Underground</a></i>, Haruki Murakami’s fascinating and incredibly in-depth investigation into the perpetrators and the survivors of Aum Shinrikyo’s sarin attack on the Tokyo subway.</p><p>Keep in mind these ratings are not necessarily statements about a book’s significance or its literary quality, they are merely casual observations of my personal tastes and how much I happened to enjoy reading the book at the time. A five-star book is one that I recommend without any reservations, while any three-star or above is likely going to be worth your while. As always, I have read parts of more books than are on this list, but I only rate books that I have read cover to cover.<br> <b><br/></b><br> <b>FIVE STARS</b></br></br></p><p>Underground, Haruki Murakami<br> South of the Border, West of the Sun, Haruki Murakami<br> Do We Need God to be Good, C.R. Hallpike<br> CTRL ALT Revolt!, Nick Cole<br> A History of the Peninsular War, Vol. I, Charles Oman<br> The Clash of Civilizations, Sam Huntington<br> Ages of Discord, Peter Turchin</br></br></br></br></br></br></p><p><b>FOUR STARS</b></p><p>Belief or Nonbelief: A Confrontation, Umberto Eco<br> Dance Dance Dance, Haruki Murakami<br> Iron Chamber of Memory, John C. Wright<br> There Will Be War Vol. IX, Jerry Pournelle<br> Red Rising, Pierce Brown<br> Golden Sun, Pierce Brown<br> Morning Star, Pierce Brown<br> Son of the Black Sword, Larry Correia<br> Kokoro, Natsume Soseki<br> The Charterhouse of Parma, Stendahl<br> Why We Read the Classics, Italo Calvino<br> The End of the World as We Knew It, Nick Cole<br> The Origins of Political Order, Vol. 1, Francis Fukuyama<br> Clio &amp; Me: An Intellectual Biography, Martin van Creveld<br> The God of Atheists, Stefan Molyneux<br> An Equation of Almost Infinite Complexity, J. Mulrooney</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>THREE STARS</b></p><p>The Majipoor Chronicles, Robert Silverberg<br> Agent of the Imperium, Marc Miller<br> The Red and the Black, Stendahl<br> War to the Knife, Peter Grant<br> Forge a New Blade, Peter Grant<br> Inventing the Enemy, Umberto Eco<br> Five Moral Pieces, Umberto Eco<br> Free Speech Isn’t Free, RooshV<br> The Old Man and the Wasteland, Nick Cole<br> The Eden Plague, David VanDyke<br> Reaper’s Run, David VanDyke<br> Skull’s Shadows, David VanDyke<br> Penric’s Demon, Lois McMaster Bujold<br> The Castle of Crossed Destinies, Italo Calvino<br> Soda Pop Soldier, Nick Cole<br> Valentine Pontifex, Robert Silverberg<br> Sorcerers of Majipoor, Robert Silverberg<br> Ultrasociety, Peter Turchin<br> The Savage Boy, Nick Cole<br> The Road is a River, Nick Cole<br> Stoke the Flames Higher, Peter Grant</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>TWO STARS</b></p><p>The Aeronaut’s Windlass, Jim Butcher<br> Fight the Rooster, Nick Cole<br> A Mystery of Errors, Simon Hawke<br> The Slaying of the Shrew, Simon Hawke<br> Much Ado About Murder, Simon Hawke<br> The Khyber Connection, Simon Hawke<br> The Song of Achilles, Madeline Miller<br> Uprooted, Naomi Novik</br></br></br></br></br></br></br></p></div>",
  "content_text": "I was so busy in 2016 that the number of books I read in their entirety declined from 63 to 52. Of the books I read last year, the one I enjoyed most was South of the Border, West of the Sun, a novel about a jazz club owner by Haruki Murakami. The novel I most enjoyed was Nick Cole’s Ctrl-Alt-Revolt!, I find it hard to imagine the game designer or serious gamer who would not enjoy it. Dance Dance Dance was very good, but Murakami did not quite bring his A-game in that one.\nThe worst books I read this year were Simon Hawke’s clumsy attempts to turn Shakespeare into a detective, a fictional trend that I despise, and although he is a pop-SF writer with a historical bent whom I normally enjoy reading, I gave up on the Shakespeare & Smythe series after reading the first three books in it. They weren’t horrible, though, and I did not read a single book I considered to be a one-star book this year.\nOn the non-fiction side, I read a number of truly excellent books from Hallpike, Oman, Huntington and Turchin. We managed to acquire the Hallpike for Castalia House, we tried and failed to do the same with the Turchin books. One for three isn’t bad. The best non-fiction book was\nUnderground\n, Haruki Murakami’s fascinating and incredibly in-depth investigation into the perpetrators and the survivors of Aum Shinrikyo’s sarin attack on the Tokyo subway.\nKeep in mind these ratings are not necessarily statements about a book’s significance or its literary quality, they are merely casual observations of my personal tastes and how much I happened to enjoy reading the book at the time. A five-star book is one that I recommend without any reservations, while any three-star or above is likely going to be worth your while. As always, I have read parts of more books than are on this list, but I only rate books that I have read cover to cover.\nFIVE STARS\nUnderground, Haruki Murakami\nSouth of the Border, West of the Sun, Haruki Murakami\nDo We Need God to be Good, C.R. Hallpike\nCTRL ALT Revolt!, Nick Cole\nA History of the Peninsular War, Vol. I, Charles Oman\nThe Clash of Civilizations, Sam Huntington\nAges of Discord, Peter Turchin\nFOUR STARS\nBelief or Nonbelief: A Confrontation, Umberto Eco\nDance Dance Dance, Haruki Murakami\nIron Chamber of Memory, John C. Wright\nThere Will Be War Vol. IX, Jerry Pournelle\nRed Rising, Pierce Brown\nGolden Sun, Pierce Brown\nMorning Star, Pierce Brown\nSon of the Black Sword, Larry Correia\nKokoro, Natsume Soseki\nThe Charterhouse of Parma, Stendahl\nWhy We Read the Classics, Italo Calvino\nThe End of the World as We Knew It, Nick Cole\nThe Origins of Political Order, Vol. 1, Francis Fukuyama\nClio & Me: An Intellectual Biography, Martin van Creveld\nThe God of Atheists, Stefan Molyneux\nAn Equation of Almost Infinite Complexity, J. Mulrooney\nTHREE STARS\nThe Majipoor Chronicles, Robert Silverberg\nAgent of the Imperium, Marc Miller\nThe Red and the Black, Stendahl\nWar to the Knife, Peter Grant\nForge a New Blade, Peter Grant\nInventing the Enemy, Umberto Eco\nFive Moral Pieces, Umberto Eco\nFree Speech Isn’t Free, RooshV\nThe Old Man and the Wasteland, Nick Cole\nThe Eden Plague, David VanDyke\nReaper’s Run, David VanDyke\nSkull’s Shadows, David VanDyke\nPenric’s Demon, Lois McMaster Bujold\nThe Castle of Crossed Destinies, Italo Calvino\nSoda Pop Soldier, Nick Cole\nValentine Pontifex, Robert Silverberg\nSorcerers of Majipoor, Robert Silverberg\nUltrasociety, Peter Turchin\nThe Savage Boy, Nick Cole\nThe Road is a River, Nick Cole\nStoke the Flames Higher, Peter Grant\nTWO STARS\nThe Aeronaut’s Windlass, Jim Butcher\nFight the Rooster, Nick Cole\nA Mystery of Errors, Simon Hawke\nThe Slaying of the Shrew, Simon Hawke\nMuch Ado About Murder, Simon Hawke\nThe Khyber Connection, Simon Hawke\nThe Song of Achilles, Madeline Miller\nUprooted, Naomi Novik",
  "tags": [
    "Book Review",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-06T11:00:00+00:00"
}