{
  "url": "https://voxday.net/2017/04/19/restoring-deconstructed-wes/",
  "scraped_at": "2025-12-18T07:10:44.191425",
  "title": "Restoring the deconstructed West",
  "date_display": "April 19, 2017",
  "date_iso": "2017-04-19T08:19:00+00:00",
  "date_from_url": "2017-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The American Interest chronicles the sudden, and unexpected, <a href=\"https://www.the-american-interest.com/2017/04/12/the-deconstruction-of-the-west/\">decline of the West</a>:</p><blockquote><p> The problem confronting the West today stems not from a shortage of power, but rather from the inability to build consensus on the shared goals and interests in whose name that power ought to be applied. The growing instability in the international system is not, as some argue, due to the rise of China as an aspiring global power, the resurgence of Russia as a systemic spoiler, the aspirations of Iran for regional hegemony, or the rogue despotism of a nuclear-armed North Korea; the rise and relative decline of states is nothing new, and it doesn’t necessarily entail instability. The West’s problem today is also not mainly the result of the economic decline of the United States or the European Union, for while both have had to deal with serious economic issues since the 2008 meltdown, they remain the two largest economies in the world, whose combined wealth and technological prowess are unmatched. Nor is the increasing global instability due to a surge in Islamic jihadism across the globe, for despite the horrors the jihadists have wrought upon the peoples of the Middle East and North Africa, and the attendant anxiety now pervading Europe and America, they have nowhere near the capabilities needed to confront great powers.</p><p>The problem, rather, is the West’s growing inability to agree on how it should be defined as a civilization. At the core of the deepening dysfunction in the West is the self-induced deconstruction of Western culture and, with it, the glue that for two centuries kept Europe and the United States at the center of the international system. The nation-state has been arguably the most enduring and successful idea that Western culture has produced. It offers a recipe to achieve security, economic growth, and individual freedom at levels unmatched in human history. This concept of a historically anchored and territorially defined national homeland, having absorbed the principles of liberal democracy, the right to private property and liberty bound by the rule of law, has been the core building block of the West’s global success and of whatever “order” has ever existed in the so-called international order. Since 1945 it has been the most successful Western “export” across the globe, with the surge of decolonization driven by the quintessentially American precept of the right to self-determination of peoples, a testimony to its enduring appeal. Though challenged by fascism, Nazism, and communism, the West emerged victorious, for when confronted with existential danger, it defaulted to shared, deeply held values and the fervent belief that what its culture and heritage represented were worth fighting, and if necessary even dying, to preserve. The West prevailed then because it was confident that on balance it offered the best set of ideas, values, and principles for others to emulate.</p><p>Today, in the wake of decades of group identity politics and the attendant deconstruction of our heritage through academia, the media, and popular culture, this conviction in the uniqueness of the West is only a pale shadow of what it was a mere half century ago. It has been replaced by elite narratives substituting shame for pride and indifference to one’s own heritage for patriotism.</p></blockquote><p>Western civilization is a consequence of three things: The European nations, Christianity, and the Graeco-Roman legacy of philosophy and law. To restore it, anything and everything that stands in the way of those three things has to go.</p><p>The elite narratives that are designed to subvert and undermine the three pillars of the West must be rejected. These include “civil rights”, “civic nationalism”, “social justice”, “equality”, and “Judeo-Christianity”, “feminism”, and “racism”.</p><p>One of the challenges is that many people who generally support Western civilization nevertheless support one or more of these elite narratives in the misguided opinion that it benefits their identity in the long term. This is why women pursue higher education that leaves them barren because it is “good for women”, blacks pursue expansions of the welfare system because it is “good for blacks”, Mexicans fight English-only laws because it is “good for Spanish-speakers”, Italians and Irish pursue religious pluralism because it is “good for Catholics” and why Jews attempt to change national population demographics because it is “good for the Jews”.</p><p>In each case, the group’s perception of what benefits them is short-sighted, and in the long term, wrong. And, if their objectives stand in the way of what strengthens the European nations, Christianity, and the Graeco-Roman legacy, they have to be defeated, and if necessary, expelled from the West. This is what the Alt-Right ultimately stands for: <i>the survival and restoration of the West. </i>This is what logic, truth, science, and history all dictate. And upon this, everything from Netflix and smartphones and freedom of conscience and the rule of law to the ability to flush toilets in your house ultimately depends.</p><p>This is why I don’t blink or back down when people call me racist, sexist, homophobic, anti-semitic, or anything else. Because doing so necessarily makes them anti-West, anti-Christian, and anti-White, and I will choose the historical reality of the white Christian West over whatever bizarre, dysfunctional dystopia they imagine will take its place every single time.</p></div>",
  "content_text": "The American Interest chronicles the sudden, and unexpected,\ndecline of the West\n:\nThe problem confronting the West today stems not from a shortage of power, but rather from the inability to build consensus on the shared goals and interests in whose name that power ought to be applied. The growing instability in the international system is not, as some argue, due to the rise of China as an aspiring global power, the resurgence of Russia as a systemic spoiler, the aspirations of Iran for regional hegemony, or the rogue despotism of a nuclear-armed North Korea; the rise and relative decline of states is nothing new, and it doesn’t necessarily entail instability. The West’s problem today is also not mainly the result of the economic decline of the United States or the European Union, for while both have had to deal with serious economic issues since the 2008 meltdown, they remain the two largest economies in the world, whose combined wealth and technological prowess are unmatched. Nor is the increasing global instability due to a surge in Islamic jihadism across the globe, for despite the horrors the jihadists have wrought upon the peoples of the Middle East and North Africa, and the attendant anxiety now pervading Europe and America, they have nowhere near the capabilities needed to confront great powers.\nThe problem, rather, is the West’s growing inability to agree on how it should be defined as a civilization. At the core of the deepening dysfunction in the West is the self-induced deconstruction of Western culture and, with it, the glue that for two centuries kept Europe and the United States at the center of the international system. The nation-state has been arguably the most enduring and successful idea that Western culture has produced. It offers a recipe to achieve security, economic growth, and individual freedom at levels unmatched in human history. This concept of a historically anchored and territorially defined national homeland, having absorbed the principles of liberal democracy, the right to private property and liberty bound by the rule of law, has been the core building block of the West’s global success and of whatever “order” has ever existed in the so-called international order. Since 1945 it has been the most successful Western “export” across the globe, with the surge of decolonization driven by the quintessentially American precept of the right to self-determination of peoples, a testimony to its enduring appeal. Though challenged by fascism, Nazism, and communism, the West emerged victorious, for when confronted with existential danger, it defaulted to shared, deeply held values and the fervent belief that what its culture and heritage represented were worth fighting, and if necessary even dying, to preserve. The West prevailed then because it was confident that on balance it offered the best set of ideas, values, and principles for others to emulate.\nToday, in the wake of decades of group identity politics and the attendant deconstruction of our heritage through academia, the media, and popular culture, this conviction in the uniqueness of the West is only a pale shadow of what it was a mere half century ago. It has been replaced by elite narratives substituting shame for pride and indifference to one’s own heritage for patriotism.\nWestern civilization is a consequence of three things: The European nations, Christianity, and the Graeco-Roman legacy of philosophy and law. To restore it, anything and everything that stands in the way of those three things has to go.\nThe elite narratives that are designed to subvert and undermine the three pillars of the West must be rejected. These include “civil rights”, “civic nationalism”, “social justice”, “equality”, and “Judeo-Christianity”, “feminism”, and “racism”.\nOne of the challenges is that many people who generally support Western civilization nevertheless support one or more of these elite narratives in the misguided opinion that it benefits their identity in the long term. This is why women pursue higher education that leaves them barren because it is “good for women”, blacks pursue expansions of the welfare system because it is “good for blacks”, Mexicans fight English-only laws because it is “good for Spanish-speakers”, Italians and Irish pursue religious pluralism because it is “good for Catholics” and why Jews attempt to change national population demographics because it is “good for the Jews”.\nIn each case, the group’s perception of what benefits them is short-sighted, and in the long term, wrong. And, if their objectives stand in the way of what strengthens the European nations, Christianity, and the Graeco-Roman legacy, they have to be defeated, and if necessary, expelled from the West. This is what the Alt-Right ultimately stands for:\nthe survival and restoration of the West.\nThis is what logic, truth, science, and history all dictate. And upon this, everything from Netflix and smartphones and freedom of conscience and the rule of law to the ability to flush toilets in your house ultimately depends.\nThis is why I don’t blink or back down when people call me racist, sexist, homophobic, anti-semitic, or anything else. Because doing so necessarily makes them anti-West, anti-Christian, and anti-White, and I will choose the historical reality of the white Christian West over whatever bizarre, dysfunctional dystopia they imagine will take its place every single time.",
  "tags": [
    "#AltRight",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-19T07:19:00+00:00"
}