{
  "url": "https://voxday.net/2017/04/22/scott-adams-on-scientific-consensus/",
  "scraped_at": "2025-12-18T07:11:05.665066",
  "title": "Scott Adams on scientific consensus",
  "date_display": "April 22, 2017",
  "date_iso": "2017-04-22T07:00:00+00:00",
  "date_from_url": "2017-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the<a href=\"http://blog.dilbert.com/post/159792630956/big-red-flag-for-cognitive-dissonance\"> limited value of facts and logic</a> in changing people’s minds:</p><blockquote><p> The author, Tim Requarth, correctly points out that facts and logic have limited value in changing anyone’s mind about climate science, or anything else. He speaks from experience because he teaches workshops on how to better communicate science. I like this guy. He’s on the right path.</p><p>But the thing that got my attention was this bit from the article:<br> <i><br/></i><br> <i>“Kahan found that increased scientific literacy actually had a small negative effect: The conservative-leaning respondents who knew the most about science thought climate change posed the least risk. Scientific literacy, it seemed, increased polarization. In a later study, Kahan added a twist: He asked respondents what climate scientists believed. Respondents who knew more about science generally, regardless of political leaning, were better able to identify the scientific consensus—in other words, the polarization disappeared. Yet, when the same people were asked for their own opinions about climate change, the polarization returned. It showed that even when people understand the scientific consensus, they may not accept it.”</i></br></br></p><p>Notice how the author slips in his unsupported interpretation of the data: <b>Greater knowledge about science causes more polarization.</b></p><p>Well, maybe. That’s a reasonable hypothesis, but it seems incomplete. Here’s another hypothesis that fits the same observed data: <b>The people who know the most about science don’t think complex climate prediction models are credible science, and they are right.</b></p></blockquote><p>Scientists, just like everyone else, are more easily persuaded by rhetoric than by dialectic. And the scientific consensus is not science, which is why those of us with a better grasp on the distinctions between scientody, scientistry, and scientage are much more likely to reject the scientific consensus than the average individual <strike>even though</strike> <i>because </i>we understand it better.</p><p>Scott nails it here: <i>In my opinion, the conservatives who know the most about science are looking at it from an historical perspective, and they see a pattern here: Complicated prediction models rarely work.</i><br> <i><br/></i><br> Bingo. And the progressives, who have the collective memory of an amnesiac on LSD, can’t understand that historical perspective because they make a practice of ignoring absolutely everything that happened before yesterday.</br></br></p></div>",
  "content_text": "And the\nlimited value of facts and logic\nin changing people’s minds:\nThe author, Tim Requarth, correctly points out that facts and logic have limited value in changing anyone’s mind about climate science, or anything else. He speaks from experience because he teaches workshops on how to better communicate science. I like this guy. He’s on the right path.\nBut the thing that got my attention was this bit from the article:\n“Kahan found that increased scientific literacy actually had a small negative effect: The conservative-leaning respondents who knew the most about science thought climate change posed the least risk. Scientific literacy, it seemed, increased polarization. In a later study, Kahan added a twist: He asked respondents what climate scientists believed. Respondents who knew more about science generally, regardless of political leaning, were better able to identify the scientific consensus—in other words, the polarization disappeared. Yet, when the same people were asked for their own opinions about climate change, the polarization returned. It showed that even when people understand the scientific consensus, they may not accept it.”\nNotice how the author slips in his unsupported interpretation of the data:\nGreater knowledge about science causes more polarization.\nWell, maybe. That’s a reasonable hypothesis, but it seems incomplete. Here’s another hypothesis that fits the same observed data:\nThe people who know the most about science don’t think complex climate prediction models are credible science, and they are right.\nScientists, just like everyone else, are more easily persuaded by rhetoric than by dialectic. And the scientific consensus is not science, which is why those of us with a better grasp on the distinctions between scientody, scientistry, and scientage are much more likely to reject the scientific consensus than the average individual\neven though\nbecause\nwe understand it better.\nScott nails it here:\nIn my opinion, the conservatives who know the most about science are looking at it from an historical perspective, and they see a pattern here: Complicated prediction models rarely work.\nBingo. And the progressives, who have the collective memory of an amnesiac on LSD, can’t understand that historical perspective because they make a practice of ignoring absolutely everything that happened before yesterday.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-22T06:00:00+00:00"
}