{
  "url": "https://voxday.net/2017/04/12/sjw-doesnt-like-being-identified-as-suc/",
  "scraped_at": "2025-12-18T07:09:55.442512",
  "title": "SJW doesn’t like being identified as such",
  "date_display": "April 12, 2017",
  "date_iso": "2017-04-12T12:00:00+00:00",
  "date_from_url": "2017-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The amusing thing about <a href=\"https://www.washingtonpost.com/lifestyle/style/the-coded-language-of-the-alt-right-is-helping-to-power-its-rise/2017/04/07/5f269a82-1ba4-11e7-bcc2-7d1a0973e7b2_story.html?utm_term=.7a4db430aeab\">SJWs taking offense to being called SJWs</a> is that they clearly don’t understand that it was originally their own label adopted by their own kind that was weaponized by the Alt-Right’s sarcasm. Also: Every.Single.Time.</p><blockquote><p> I’ve always said that I appreciate all my readers, both those who agree with me and those who don’t. But lately I’ve been puzzled by the new slurs directed at me by some of the latter. Many I didn’t even understand, so I did some digging.</p><p>Apparently, tried-and-true insults such as “fag,” “fairy,” “kike” and “hebe” (yes, I’m Jewish) are old-school, especially among the alt-right. That small, far-right movement that seeks a whites-only state is developing new coded language, much as the Nazis once did, says noted linguist George Lakoff, a professor emeritus at the University of California at Berkeley.</p><p>For instance, in February I wrote about Milo Yiannopoulos, the now-disgraced Breitbart News editor and alt-right poster boy. I heard from many readers about that column, which took Yiannopoulos to task for his incendiary language. But one email caught my eye: “Milo is far less bigoted, misogynist, and hateful than those of you sick sociopathic and psychotic SJW’s who smear him so desperately.” Sick, sociopathic and psychotic, I knew. But SJW? I had no clue. In a personal ad it might mean “straight Jewish woman,” but two of those don’t apply to me. So what was this snarky new gem of an insult?</p><p>I emailed back, “What is an SJW?” The reply: “An SJW is a social justice warrior. In the press, this particular public predator tends to be big on PC [political correctness] virtue signaling but happy to smear others viciously with false accusations of sexism, racism, white nationalism, hate speech, etc.”</p><p>Well, that was certainly clear — I’m a “public predator” allegedly guilty of smearing Yiannopoulos by referring to his very own, widely reported hateful language.</p><p>I started looking into other slurs readers hurled at me. There was “libtard,” and one I really liked at first — “snowflake,” because they’re magical, in moderation.</p><p>But here’s the nasty undercurrent: These new words are intrinsic to the alt-right’s rise, according to Lakoff. He connects this to the Nazis and the coded language (prime example: “the master race”) that eventually allowed them to topple governmental institutions. “The strategy is to control discourse,” Lakoff points out. “One way you do that is preemptive name calling . . . based on a moral hierarchy.”</p></blockquote><p>First, the Alt-Right is much bigger than the Alt-White, much less the Alt-Reich. As evidence of this contention, I note that I’ve just been sent translations of the 16 Points in Ukrainian and, of all things, Esperanto. Second, Milo is Alt-Lite, not Alt-Right.</p><p>Third, the incessant whining about name-calling by people who don’t hesitate to hurl “Nazi” and “anti-semitic” at a pizza delivery driver who arrives thirty second late with their Veggie Supreme with extra eggplant and tofu is both pathetic as well as indicative of the extreme susceptibility of SJWs to rhetoric.</p><p>Fourth, they’re not “codewords”. As one of Steve’s commenters pointed out: ” The alt right is small but has power and this is for one reason only – the alt right is the one group that Calls Things By Their True Name.” And fifth, it’s not hard to understand <a href=\"http://www.unz.com/isteve/wp-alt-rights-nazi-like-strategy-is-to-control-discourse/\">why Steve Sailer’s appeal remains self-limited</a>, he’s the classic example of the dialectic speaker who simply can’t bring himself to accept the necessity of rhetoric. I mean, if you’re still loftily sperging at this point about using the term “warrior” for SJWs, you simply don’t grasp the way rhetoric works.</p><p>Steven Petrow’s column is prima facie evidence of why you should simply utilize SJW instead of whatever your preferred dialectic alternative might be.</p></div>",
  "content_text": "The amusing thing about\nSJWs taking offense to being called SJWs\nis that they clearly don’t understand that it was originally their own label adopted by their own kind that was weaponized by the Alt-Right’s sarcasm. Also: Every.Single.Time.\nI’ve always said that I appreciate all my readers, both those who agree with me and those who don’t. But lately I’ve been puzzled by the new slurs directed at me by some of the latter. Many I didn’t even understand, so I did some digging.\nApparently, tried-and-true insults such as “fag,” “fairy,” “kike” and “hebe” (yes, I’m Jewish) are old-school, especially among the alt-right. That small, far-right movement that seeks a whites-only state is developing new coded language, much as the Nazis once did, says noted linguist George Lakoff, a professor emeritus at the University of California at Berkeley.\nFor instance, in February I wrote about Milo Yiannopoulos, the now-disgraced Breitbart News editor and alt-right poster boy. I heard from many readers about that column, which took Yiannopoulos to task for his incendiary language. But one email caught my eye: “Milo is far less bigoted, misogynist, and hateful than those of you sick sociopathic and psychotic SJW’s who smear him so desperately.” Sick, sociopathic and psychotic, I knew. But SJW? I had no clue. In a personal ad it might mean “straight Jewish woman,” but two of those don’t apply to me. So what was this snarky new gem of an insult?\nI emailed back, “What is an SJW?” The reply: “An SJW is a social justice warrior. In the press, this particular public predator tends to be big on PC [political correctness] virtue signaling but happy to smear others viciously with false accusations of sexism, racism, white nationalism, hate speech, etc.”\nWell, that was certainly clear — I’m a “public predator” allegedly guilty of smearing Yiannopoulos by referring to his very own, widely reported hateful language.\nI started looking into other slurs readers hurled at me. There was “libtard,” and one I really liked at first — “snowflake,” because they’re magical, in moderation.\nBut here’s the nasty undercurrent: These new words are intrinsic to the alt-right’s rise, according to Lakoff. He connects this to the Nazis and the coded language (prime example: “the master race”) that eventually allowed them to topple governmental institutions. “The strategy is to control discourse,” Lakoff points out. “One way you do that is preemptive name calling . . . based on a moral hierarchy.”\nFirst, the Alt-Right is much bigger than the Alt-White, much less the Alt-Reich. As evidence of this contention, I note that I’ve just been sent translations of the 16 Points in Ukrainian and, of all things, Esperanto. Second, Milo is Alt-Lite, not Alt-Right.\nThird, the incessant whining about name-calling by people who don’t hesitate to hurl “Nazi” and “anti-semitic” at a pizza delivery driver who arrives thirty second late with their Veggie Supreme with extra eggplant and tofu is both pathetic as well as indicative of the extreme susceptibility of SJWs to rhetoric.\nFourth, they’re not “codewords”. As one of Steve’s commenters pointed out: ” The alt right is small but has power and this is for one reason only – the alt right is the one group that Calls Things By Their True Name.” And fifth, it’s not hard to understand\nwhy Steve Sailer’s appeal remains self-limited\n, he’s the classic example of the dialectic speaker who simply can’t bring himself to accept the necessity of rhetoric. I mean, if you’re still loftily sperging at this point about using the term “warrior” for SJWs, you simply don’t grasp the way rhetoric works.\nSteven Petrow’s column is prima facie evidence of why you should simply utilize SJW instead of whatever your preferred dialectic alternative might be.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-12T11:00:00+00:00"
}