{
  "url": "https://voxday.net/2017/04/15/strong-female-characters/",
  "scraped_at": "2025-12-18T07:10:18.850003",
  "title": "Strong female characters",
  "date_display": "April 15, 2017",
  "date_iso": "2017-04-15T08:49:00+00:00",
  "date_from_url": "2017-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting, and amusing, to listen to science fiction writers debate the topic of “strong female characters”, particularly in the modern context of Princess Kung-Fu. That, of course, is the unstoppable martial art practiced solely on film, by every kick-ass female character who appears on screen.</p><p>And everyone – everyone – does it. Even those <a href=\"http://www.superversivesf.com/2017/04/12/good-strong-female-characters/\">who correctly criticize the Buffies and Emma Peels</a> do it in their own way. Consider <a href=\"http://www.superversivesf.com/2017/04/01/strong-female-character-syndrome/\">Declan Finn describing</a> what he presumably considers to be more realistic versions of female fighters:</p><blockquote class=\"tr_bq\"><p> Five-feet tall (really 4’11”) Goldberg is a computer nerd. She used to work for the NSA, but went over to the Secret Service to audit security, since she’s not tall enough to jump in front of Presidents. Her fights included: punching someone in the balls, and dropping low and cutting their Achilles tendons.</p></blockquote><p>This reveals the fundamental problem with science fiction writers: they don’t get into fights. Oh, they are more inclined than most to get into word spats and verbal scrums, and even to engage in the proverbial handbags at dawn, but virtually none of them, of either sex, have ever punched anyone in the face, or been punched in the face.</p><p>For example, any time anyone mentions “punching someone in the balls” as an effective fighting technique, you know they have never actually seen anyone get struck in that manner in a combat situation. You see, there is this useful little substance called adrenaline that tends to fire up when people are engaged in combat of one form or another. It is why someone who is shot five times in the chest can nevertheless stagger forward and bury a machete in a policeman’s head. It is why someone can have a black belt’s sidekick ride up his extended leg, crush his balls between the heel and the pubic bone, and nevertheless continue fighting at full speed for 90 seconds without even slowing down.</p><p>And then, after the round was over, grimace, sink to his knees, and ask those who’d been watching, “did he hit me below the belt or something?” I once got my nose broken in a ring fight and didn’t even notice it. You can’t write about potentially lethal combat and ignore the effects of adrenaline. Actual conversation from my fighting days:</p><p>Vox: Why’d they stop the fight?<br> Alex: It’s the rule. Have to stop the bleeding.<br> Vox: Who’s bleeding?<br> Alex: You are. Like a stuck pig.</br></br></br></p><p>As for “dropping low” to attack someone’s Achilles tendons – plural, no less – that sounds like a wonderful way to get kicked in the face. There is a good reason wrestlers go for the waist, not directly for the legs, after all.</p><p>Seriously, no writer should even think about writing a hand-to-hand scene until he – or she – has been punched full-force in the face by a strong man and by a weak woman. Nor should he do it until he has punched both a strong man and a weak woman in the face. Better yet, exchange blows with a strong woman and a weak man too. The experience will absolutely prove educational and should suffice to illustrate how utterly absurd 99 percent of all hand-to-hand combat in film and fiction is. I mean, one might more reasonably, <i>more convincingly, </i>just give the woman wings and a devil’s tail, with which combination she defeats bigger, faster, stronger men by flying out of their reach, wrapping her tail around their neck, and strangling them.</p><p>Of course, even then, a sufficiently strong and alert man would simply grab her tail and bounce her face off the ground. All right, strike that, all the succubi don’t know kung fu.</p><p>Anyhow, if you would like to read a much more realistic depiction of how hand-to-hand combat in science fiction would work in any universe where F still equals MA, I suggest reading “The Amazon Gambit” from <i>Forbidden Thoughts</i>, set in the Quantum Mortis universe. I wrote it, in part, to illustrate the one way the women can be effectively used in combat.</p><p>However, comic readers need not worry. Alt-Hero will certainly contain female superheroines such as Dynamique, Kosmik Girl, Vespra, and La Fille Furie. And they will be lethal superhumans who kick prodigious ass, they simply will not necessarily be able to match fists with the likes of Capitán Europa, the head of the European Commission’s Global Justice Initiative, or Michael Martel, better known as Hammer.</p></div>",
  "content_text": "It’s always interesting, and amusing, to listen to science fiction writers debate the topic of “strong female characters”, particularly in the modern context of Princess Kung-Fu. That, of course, is the unstoppable martial art practiced solely on film, by every kick-ass female character who appears on screen.\nAnd everyone – everyone – does it. Even those\nwho correctly criticize the Buffies and Emma Peels\ndo it in their own way. Consider\nDeclan Finn describing\nwhat he presumably considers to be more realistic versions of female fighters:\nFive-feet tall (really 4’11”) Goldberg is a computer nerd. She used to work for the NSA, but went over to the Secret Service to audit security, since she’s not tall enough to jump in front of Presidents. Her fights included: punching someone in the balls, and dropping low and cutting their Achilles tendons.\nThis reveals the fundamental problem with science fiction writers: they don’t get into fights. Oh, they are more inclined than most to get into word spats and verbal scrums, and even to engage in the proverbial handbags at dawn, but virtually none of them, of either sex, have ever punched anyone in the face, or been punched in the face.\nFor example, any time anyone mentions “punching someone in the balls” as an effective fighting technique, you know they have never actually seen anyone get struck in that manner in a combat situation. You see, there is this useful little substance called adrenaline that tends to fire up when people are engaged in combat of one form or another. It is why someone who is shot five times in the chest can nevertheless stagger forward and bury a machete in a policeman’s head. It is why someone can have a black belt’s sidekick ride up his extended leg, crush his balls between the heel and the pubic bone, and nevertheless continue fighting at full speed for 90 seconds without even slowing down.\nAnd then, after the round was over, grimace, sink to his knees, and ask those who’d been watching, “did he hit me below the belt or something?” I once got my nose broken in a ring fight and didn’t even notice it. You can’t write about potentially lethal combat and ignore the effects of adrenaline. Actual conversation from my fighting days:\nVox: Why’d they stop the fight?\nAlex: It’s the rule. Have to stop the bleeding.\nVox: Who’s bleeding?\nAlex: You are. Like a stuck pig.\nAs for “dropping low” to attack someone’s Achilles tendons – plural, no less – that sounds like a wonderful way to get kicked in the face. There is a good reason wrestlers go for the waist, not directly for the legs, after all.\nSeriously, no writer should even think about writing a hand-to-hand scene until he – or she – has been punched full-force in the face by a strong man and by a weak woman. Nor should he do it until he has punched both a strong man and a weak woman in the face. Better yet, exchange blows with a strong woman and a weak man too. The experience will absolutely prove educational and should suffice to illustrate how utterly absurd 99 percent of all hand-to-hand combat in film and fiction is. I mean, one might more reasonably,\nmore convincingly,\njust give the woman wings and a devil’s tail, with which combination she defeats bigger, faster, stronger men by flying out of their reach, wrapping her tail around their neck, and strangling them.\nOf course, even then, a sufficiently strong and alert man would simply grab her tail and bounce her face off the ground. All right, strike that, all the succubi don’t know kung fu.\nAnyhow, if you would like to read a much more realistic depiction of how hand-to-hand combat in science fiction would work in any universe where F still equals MA, I suggest reading “The Amazon Gambit” from\nForbidden Thoughts\n, set in the Quantum Mortis universe. I wrote it, in part, to illustrate the one way the women can be effectively used in combat.\nHowever, comic readers need not worry. Alt-Hero will certainly contain female superheroines such as Dynamique, Kosmik Girl, Vespra, and La Fille Furie. And they will be lethal superhumans who kick prodigious ass, they simply will not necessarily be able to match fists with the likes of Capitán Europa, the head of the European Commission’s Global Justice Initiative, or Michael Martel, better known as Hammer.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-15T07:49:00+00:00"
}