{
  "url": "https://voxday.net/2017/04/15/that-might-explain-i/",
  "scraped_at": "2025-12-18T07:10:20.714474",
  "title": "That might explain it",
  "date_display": "April 15, 2017",
  "date_iso": "2017-04-15T12:00:00+00:00",
  "date_from_url": "2017-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was obvious that something with regards to North Korea had changed to concern the US, China, Japan, and Russia alike and convince President Trump to take action. It may have been <a href=\"https://ca.news.yahoo.com/north-korea-displays-submarine-based-missiles-first-time-022724211.html\">North Korea’s successful development of sub-launched ballistic missiles</a>, which presumably now give it the ability to nuke coastal US cities for the first time.</p><blockquote><p> North Korea displayed its submarine-launched ballistic missiles (SLBM) for the first time on Saturday ahead of a massive military parade in the capital, Pyongyang.</p><p>North Korea warned the United States on Saturday to end its “military hysteria” or face retaliation as a U.S. aircraft carrier group steamed towards the region and the reclusive state marked the 105th birth anniversary of its founding father.</p><p>State TV showed images of the Pukkuksong-2 SLBMs on trucks waiting to be paraded in front of leader Kim Jong Un.</p></blockquote><p>Seeing as how North Korea is believed to be able to develop long-range ICBM that will reach the USA within four years, and SLBM that may be able to reach it now, this may be the last chance that the USA and China have to impose any changes on North Korea.</p></div>",
  "content_text": "It was obvious that something with regards to North Korea had changed to concern the US, China, Japan, and Russia alike and convince President Trump to take action. It may have been\nNorth Korea’s successful development of sub-launched ballistic missiles\n, which presumably now give it the ability to nuke coastal US cities for the first time.\nNorth Korea displayed its submarine-launched ballistic missiles (SLBM) for the first time on Saturday ahead of a massive military parade in the capital, Pyongyang.\nNorth Korea warned the United States on Saturday to end its “military hysteria” or face retaliation as a U.S. aircraft carrier group steamed towards the region and the reclusive state marked the 105th birth anniversary of its founding father.\nState TV showed images of the Pukkuksong-2 SLBMs on trucks waiting to be paraded in front of leader Kim Jong Un.\nSeeing as how North Korea is believed to be able to develop long-range ICBM that will reach the USA within four years, and SLBM that may be able to reach it now, this may be the last chance that the USA and China have to impose any changes on North Korea.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-15T11:00:00+00:00"
}