{
  "url": "https://voxday.net/2017/04/04/the-missing-name/",
  "scraped_at": "2025-12-18T07:08:52.574927",
  "title": "The missing name",
  "date_display": "April 4, 2017",
  "date_iso": "2017-04-04T09:42:00+00:00",
  "date_from_url": "2017-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see how, even as the mainstream media divides its reports about <a href=\"http://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2017/04/03/abc-nbc-cover-revelation-susan-rice-ordered-trump-aides\">Susan Rice’s unlawful unmasking of the Trump administration figures</a> on predictably partisan lines, one common element remains. They all appear to assiduously avoid mentioning the name of the individual responsible for breaking the story:</p><blockquote><p> A massive revelation in the alleged surveillance of President Trump’s aides broke Monday morning when Bloomberg reported that “[f]ormer National Security Adviser Susan Rice requested the identities of U.S. persons in raw intelligence reports on dozens of occasions that connect to the Donald Trump transition and campaign.” With their identities unmasked, it allowed for someone to freely and illegally leak their names to the press. It’s controversial news but ABC and NBC both chose to ignore it that night, while CBS defended Rice.</p><p>“We learned more today about the President’s allegation that he and his aides were caught up in Obama-era surveillance,” CBS Evening News anchor Scott Pelley said, teeing up reporter Margaret Brennan. Strangely, Pelley stayed away from flinging the fiery insults which drew him much praise from the left. Instead of calling Trump’s claims “baseless,” he kept it neutral, only referring to them as “allegations.” He also described what the concern was as “Obama-era surveillance,” something he had not done in the past.</p><p>Brennan played defense for Rice, stating: “Well, Scott, as national security adviser to the president, Susan Rice could and did request the names of individuals who were picked up during legal surveillance of foreign nationals.” She then cited unnamed sources who told her there was nothing wrong with what Rice did:</p><p><i>Now, according to a former national security official, Trump associates were not the sole focus of Rice’s request, but they may have been revealed when she asked to understand why they were appearing in intelligence reports. However, Rice did not spread the information according to this former official, who insisted that there was nothing improper or political involved.</i></p><p>On Fox News’s Special Report, it was a whole different story as they led the program with Rice’s unmasking efforts. “The surveillance of people close to President Trump, possibly the President himself, now has a name and a face attached to it. And it’s one you’ve seen in major scandals before,” declared fill-in host James Rosen during the opening tease.</p><p>“Two weeks ago, Chairman of the House Intelligence Committee announced to the press and President he had uncovered a disturbing trend of intelligence collection on Trump officials, some of which was made public,” reported Chief White House Correspondent John Roberts, “Today, we learn more about the ‘how’ and ‘who’ of what’s going on.”</p><p>The Fox News reporter noted that when it came to statements from House Intelligence Committee Chairman Devin Nunes about Trump aides being swept up in incidental collection, Rice claimed she didn’t know anything. “I know nothing about this. I was surprised to see reports from Chairman Nunes on that count today,” she claimed on PBS NewsHour on March 22. That is now exposed as a lie, just like then she lied about what caused the Benghazi attack.</p></blockquote><p>It’s fascinating to see the way in which the name “Mike Cernovich” doesn’t appear in any of these reports that I’ve seen. It’s particularly interesting in light of the fact that Scott Pelley just broadcast a 60 Minutes report accusing Cerno of being “fake news”; one would think that this breaking new story would be at least somewhat relevant in this regard.</p><p>Much the same is true when Drudge breaks a story. The obvious conclusion is that the mainstream news organizations are determined to defend their perceived status, even if that means omitting where they got the story in the first place and pretending it was the result of their own reporting. Then again, they are the fake news.</p><p>This is entirely par for the course. It’s the same thing as the way you’ll see all the references to religion not causing war that are very careful to never mention either me or <i>The Irrational Atheist</i>. Even when the ideas are important and undeniable, even when the story cannot be ignored, they are determined not to credit the author for fear of elevating his profile. Of course, they do the exact opposite when they wish to raise someone’s profile, such as a Malcolm Gladwell or a Richard Dawkins, and in such cases will actually credit them for merely popularizing someone else’s ideas.</p><p>Mike tells Zerohedge <a href=\"http://www.zerohedge.com/news/2017-04-03/cernovich-explains-how-he-learned-about-susan-rice\">how he got the story</a>. Which happens to be the same way Drudge got the Lewinsky dress story:</p><blockquote><p> “Maggie Haberman had it.  She will not run any articles that are critical of the Obama administration. Eli Lake had it.  He didn’t want to run it and Bloomberg didn’t want to run it because it vindicates Trump’s claim that he had been spied upon.  And Eli Lake is a ‘never Trumper.’  Bloomberg was a ‘never Trump’ publication.”</p><p>“I’m showing you the politics of ‘real journalism’.  ‘Real journalism’ is that Bloomberg had it and the New York Times had it but they wouldn’t run it because  they don’t want to run any stories that would make Obama look bad or that will vindicate Trump.  They only want to run stories that make Trump look bad so that’s why they sat on it.”</p><p>“So where did I get the story?  I didn’t get it from the intelligence community.  Everybody’s trying to figure out where I got it from.  I got it from somebody who works in one of those media companies.  I have spies in every media organization.  I got people in news rooms.  I got it from a source within the news room who said ‘Cernovich, they’re sitting on this story, they’re not going to run it, so you can run it’.”</p><p>“If you’re at Bloomberg, I have people in there.  If you’re at the New York Times, I have people in there.  LA Times, Washington Post, you name it, I have my people in there.  I got IT people in every major news room in this country.  The IT people see every email so that’s how I knew it.”</p></blockquote><p>Moral of the story: the Fake News sits on real news when it contradicts their Narrative.</p></div>",
  "content_text": "It’s interesting to see how, even as the mainstream media divides its reports about\nSusan Rice’s unlawful unmasking of the Trump administration figures\non predictably partisan lines, one common element remains. They all appear to assiduously avoid mentioning the name of the individual responsible for breaking the story:\nA massive revelation in the alleged surveillance of President Trump’s aides broke Monday morning when Bloomberg reported that “[f]ormer National Security Adviser Susan Rice requested the identities of U.S. persons in raw intelligence reports on dozens of occasions that connect to the Donald Trump transition and campaign.” With their identities unmasked, it allowed for someone to freely and illegally leak their names to the press. It’s controversial news but ABC and NBC both chose to ignore it that night, while CBS defended Rice.\n“We learned more today about the President’s allegation that he and his aides were caught up in Obama-era surveillance,” CBS Evening News anchor Scott Pelley said, teeing up reporter Margaret Brennan. Strangely, Pelley stayed away from flinging the fiery insults which drew him much praise from the left. Instead of calling Trump’s claims “baseless,” he kept it neutral, only referring to them as “allegations.” He also described what the concern was as “Obama-era surveillance,” something he had not done in the past.\nBrennan played defense for Rice, stating: “Well, Scott, as national security adviser to the president, Susan Rice could and did request the names of individuals who were picked up during legal surveillance of foreign nationals.” She then cited unnamed sources who told her there was nothing wrong with what Rice did:\nNow, according to a former national security official, Trump associates were not the sole focus of Rice’s request, but they may have been revealed when she asked to understand why they were appearing in intelligence reports. However, Rice did not spread the information according to this former official, who insisted that there was nothing improper or political involved.\nOn Fox News’s Special Report, it was a whole different story as they led the program with Rice’s unmasking efforts. “The surveillance of people close to President Trump, possibly the President himself, now has a name and a face attached to it. And it’s one you’ve seen in major scandals before,” declared fill-in host James Rosen during the opening tease.\n“Two weeks ago, Chairman of the House Intelligence Committee announced to the press and President he had uncovered a disturbing trend of intelligence collection on Trump officials, some of which was made public,” reported Chief White House Correspondent John Roberts, “Today, we learn more about the ‘how’ and ‘who’ of what’s going on.”\nThe Fox News reporter noted that when it came to statements from House Intelligence Committee Chairman Devin Nunes about Trump aides being swept up in incidental collection, Rice claimed she didn’t know anything. “I know nothing about this. I was surprised to see reports from Chairman Nunes on that count today,” she claimed on PBS NewsHour on March 22. That is now exposed as a lie, just like then she lied about what caused the Benghazi attack.\nIt’s fascinating to see the way in which the name “Mike Cernovich” doesn’t appear in any of these reports that I’ve seen. It’s particularly interesting in light of the fact that Scott Pelley just broadcast a 60 Minutes report accusing Cerno of being “fake news”; one would think that this breaking new story would be at least somewhat relevant in this regard.\nMuch the same is true when Drudge breaks a story. The obvious conclusion is that the mainstream news organizations are determined to defend their perceived status, even if that means omitting where they got the story in the first place and pretending it was the result of their own reporting. Then again, they are the fake news.\nThis is entirely par for the course. It’s the same thing as the way you’ll see all the references to religion not causing war that are very careful to never mention either me or\nThe Irrational Atheist\n. Even when the ideas are important and undeniable, even when the story cannot be ignored, they are determined not to credit the author for fear of elevating his profile. Of course, they do the exact opposite when they wish to raise someone’s profile, such as a Malcolm Gladwell or a Richard Dawkins, and in such cases will actually credit them for merely popularizing someone else’s ideas.\nMike tells Zerohedge\nhow he got the story\n. Which happens to be the same way Drudge got the Lewinsky dress story:\n“Maggie Haberman had it.  She will not run any articles that are critical of the Obama administration. Eli Lake had it.  He didn’t want to run it and Bloomberg didn’t want to run it because it vindicates Trump’s claim that he had been spied upon.  And Eli Lake is a ‘never Trumper.’  Bloomberg was a ‘never Trump’ publication.”\n“I’m showing you the politics of ‘real journalism’.  ‘Real journalism’ is that Bloomberg had it and the New York Times had it but they wouldn’t run it because  they don’t want to run any stories that would make Obama look bad or that will vindicate Trump.  They only want to run stories that make Trump look bad so that’s why they sat on it.”\n“So where did I get the story?  I didn’t get it from the intelligence community.  Everybody’s trying to figure out where I got it from.  I got it from somebody who works in one of those media companies.  I have spies in every media organization.  I got people in news rooms.  I got it from a source within the news room who said ‘Cernovich, they’re sitting on this story, they’re not going to run it, so you can run it’.”\n“If you’re at Bloomberg, I have people in there.  If you’re at the New York Times, I have people in there.  LA Times, Washington Post, you name it, I have my people in there.  I got IT people in every major news room in this country.  The IT people see every email so that’s how I knew it.”\nMoral of the story: the Fake News sits on real news when it contradicts their Narrative.",
  "tags": [
    "conspiracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-04T08:42:00+00:00"
}