{
  "url": "https://voxday.net/2017/04/06/the-answer-to-sjw-failure-is-more-sjw/",
  "scraped_at": "2025-12-18T07:09:14.191653",
  "title": "The answer to SJW failure is more SJW",
  "date_display": "April 6, 2017",
  "date_iso": "2017-04-06T17:00:00+00:00",
  "date_from_url": "2017-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isn’t it amazing how the Left’s inevitable answer to failure is always more of the same? The EU is failing? Must need more Europe! The Venezuelan economy has collapsed? Must need more communism! Diversity comics don’t sell? <a href=\"http://www.tor.com/2017/04/05/lets-talk-about-marvel-comics-the-diversity-doesnt-sell-myth-and-what-diversity-really-means/#comments\">MORE DIVERSITY IS THE ONLY WAY!</a></p><blockquote class=\"tr_bq\"><p> A few days ago a discussion and subsequent interview with David Gabriel, Marvel Comics’ Senior VP of Sales and Marketing, at their retailer summit began making the rounds, but not for the reasons the publisher was hoping. Marvel has every reason to be concerned, as their share of the market has shrunk dramatically in the last few months. Figuring out the cause of that decrease is vital for Marvel’s survival—yet the answer they’ve come to isn’t just inaccurate, it’s also offensive.</p></blockquote><p>SJWs have reduced themselves to insisting that reality is inaccurate and offensive. After all, an SJW teen librarian writing for Tor must know considerably more about how Marvel’s comics are selling than Marvel’s own Senior VP of Sales and Marketing!</p><p>Diversity doesn’t sell for obvious reasons. Blacks don’t read very much. Hispanics don’t read very much. Asians read, but not as much as whites do. And whites like to read about blacks and Hispanics and Asians even less than Asians and blacks and Hispanics like to read about whites.</p><p>And the resistance of SJW-converged publishers to these observable facts is why Castalia House will eventually be bigger than Tor Books.</p><p>Speaking of comics, the co-creator of <i>Alt-Hero</i> and I are working on putting together a serious comic-related project. Figure two months before we have anything significant to discuss in public, although I’ve got an artist or two kicking some concepts around. But the project is going to be cool, it is going to be ambitious, and it is going to be mind-blowing in several very different ways.</p></div>",
  "content_text": "Isn’t it amazing how the Left’s inevitable answer to failure is always more of the same? The EU is failing? Must need more Europe! The Venezuelan economy has collapsed? Must need more communism! Diversity comics don’t sell?\nMORE DIVERSITY IS THE ONLY WAY!\nA few days ago a discussion and subsequent interview with David Gabriel, Marvel Comics’ Senior VP of Sales and Marketing, at their retailer summit began making the rounds, but not for the reasons the publisher was hoping. Marvel has every reason to be concerned, as their share of the market has shrunk dramatically in the last few months. Figuring out the cause of that decrease is vital for Marvel’s survival—yet the answer they’ve come to isn’t just inaccurate, it’s also offensive.\nSJWs have reduced themselves to insisting that reality is inaccurate and offensive. After all, an SJW teen librarian writing for Tor must know considerably more about how Marvel’s comics are selling than Marvel’s own Senior VP of Sales and Marketing!\nDiversity doesn’t sell for obvious reasons. Blacks don’t read very much. Hispanics don’t read very much. Asians read, but not as much as whites do. And whites like to read about blacks and Hispanics and Asians even less than Asians and blacks and Hispanics like to read about whites.\nAnd the resistance of SJW-converged publishers to these observable facts is why Castalia House will eventually be bigger than Tor Books.\nSpeaking of comics, the co-creator of\nAlt-Hero\nand I are working on putting together a serious comic-related project. Figure two months before we have anything significant to discuss in public, although I’ve got an artist or two kicking some concepts around. But the project is going to be cool, it is going to be ambitious, and it is going to be mind-blowing in several very different ways.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-06T16:00:00+00:00"
}