{
  "url": "https://voxday.net/2017/04/09/the-next-targe/",
  "scraped_at": "2025-12-18T07:09:35.392227",
  "title": "The next target",
  "date_display": "April 9, 2017",
  "date_iso": "2017-04-09T15:00:00+00:00",
  "date_from_url": "2017-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, a roundup of some other people’s thoughts. Zerohedge on <a href=\"http://www.zerohedge.com/news/2017-04-08/former-cia-officer-intelligence-confirms-russian-account-syria\">the intelligence community’s perspective</a>:</p><blockquote><p> Alarm within the U.S. intelligence community about Trump’s hasty decision to attack Syria reverberated from the Middle East back to Washington, where former CIA officer Philip Giraldi reported hearing from his intelligence contacts in the field that they were shocked at how the new poison-gas story was being distorted by Trump and the mainstream U.S. news media.</p><p>Giraldi told Scott Horton’s Webcast: “I’m hearing from sources on the ground in the Middle East, people who are intimately familiar with the intelligence that is available who are saying that the essential narrative that we’re all hearing about the Syrian government or the Russians using chemical weapons on innocent civilians is a sham.”</p><p>Giraldi said his sources were more in line with an analysis postulating an accidental release of the poison gas after an Al Qaeda arms depot was hit by a Russian airstrike.</p><p>“The intelligence confirms pretty much the account that the Russians have been giving … which is that they hit a warehouse where the rebels – now these are rebels that are, of course, connected with Al Qaeda – where the rebels were storing chemicals of their own and it basically caused an explosion that resulted in the casualties. Apparently the intelligence on this is very clear.”</p><p>Giraldi said the anger within the intelligence community over the distortion of intelligence to justify Trump’s military retaliation was so great that some covert officers were considering going public.</p><p>“People in both the agency [the CIA] and in the military who are aware of the intelligence are freaking out about this because essentially Trump completely misrepresented what he already should have known – but maybe he didn’t – and they’re afraid that this is moving toward a situation that could easily turn into an armed conflict,” Giraldi said before Thursday night’s missile strike. “They are astonished by how this is being played by the administration and by the U.S. media.”</p></blockquote><p>I tend to favor the Russian accounts because the Russians have repeatedly proven to be reliable with regards to Syrian events, while the US has repeatedly been caught pushing false narratives and even false flags. Remember the “Russian attack” on the aid convoy that abruptly disappeared from the news once it became apparent that the US drones had blown up the convoy? It was all over the international news one day and utterly gone the next. And as anyone who has read Murakami’s <i>Underground </i>knows, whatever the reported chemical was, it was not sarin.</p><p>Mike Cernovich reports that was McMaster serving as a Petraeus stand-in, not Mattis or Kushner, <a href=\"https://medium.com/@Cernovich/h-r-mcmaster-manipulating-intelligence-reports-to-trump-wants-150-000-ground-soldiers-in-syria-83346c433e99\">who was primarily responsible</a> for the Syrian attack:</p><blockquote><p> Current National Security Adviser Herbert Raymond “H. R.” McMaster is manipulating intelligence reports given to President Donald Trump, Cernovich Media can now report. McMaster is plotting how to sell a massive ground war in Syria to President Trump with the help of disgraced former CIA director and convicted criminal David Petraeus, who mishandled classified information by sharing documents with his mistress.</p><p>As NSA, McMaster’s job is to synthesize intellience reports from all other agencies. President Trump is being given an inaccurate picture of the situation in Syria, as McMaster is seeking to involve the U.S. in a full scale war in Syria. The McMaster-Petraeus plan calls for 150,000 American ground troops in Syria….</p><p>McMaster’s friends in the media, as part of a broader strategy to increase McMaster’s power, have claimed Jared Kushner and Bannon had a major falling out. In fact Kushner and Bannon are united in their opposition to McMaster’s plan. If McMaster and Petraeus have their way, America will find itself in another massive war in the Middle East.</p></blockquote><p>It’s certainly interesting to hear that Kushner and Bannon are still de facto allies. And now, since others appear to have noticed the same things that I have and gone public with it, I’ll post what I wrote to a friend several days ago:</p><blockquote><p> <i>Obviously, I don’t know what is happening. But I strongly suspect all this Syria nonsense is a feint to cover an upcoming US-China attack on North Korea.</i><br> <i><br/></i><br> <i>We’re all hearing deployment news from contacts in the military. But if you look at where the carriers are, the signs point to action in the Pacific, not the Middle East. If you look at the map of the Korean Peninsula, it would make sense for the US to defend the South Korean border, then provide air support and perform amphibious operations from the Sea of Japan while China attacks from the north and from the Yellow Sea.</i><br> <i><br/></i><br> <i>I think the fact that Trump and Putin are publicly engaged in this very angsty sabre-rattling over virtually nothing in Syria while Xi is in Florida is potentially significant. Trump and Putin play out the little Syrian charade, Trump explains it to Xi, and then the US Navy has the greenlight to go after the lunatics before Tokyo, Moscow, or Beijing get nuked.</i></br></br></br></br></p></blockquote><p>This appears to be wrong about the Syrian action a feint; the God-Emperor has come out very noisily against North Korea and expressed satisfaction with an operation that appears to have accomplished precisely nothing. It looks more like a warning to a third party. Therefore, I conclude that the Syrian strike may have achieved two goals for him.</p><ol><li>Calling the neocons’ bluff. They were all in favor of this attack and claimed it would accomplish something significant. Obviously, they knew it wouldn’t, but hoped it would provoke a response from either Assad or Putin that would permit further entanglement and a justification for an invasion. That didn’t happen, and now the President can tell them that he already took their advice and it did not work as they predicted.</li><li>Putting pressure on Kim. I don’t know what happened beyond what we all know from the news, but something that has come out of North Korea recently appears to have all the world leaders rattled. Japan’s Abe was just at the White House. China’s Xi was actually there during the Syrian strike and took no offense at what the some in the media tried to portray as disrespect. Notice in particular how Trump stressed that the Syrian attack proved that he is a man of his word just prior to launching some very serious threats at Kim.</li></ol><p>I further observe that <a href=\"http://www.zerohedge.com/news/2017-04-08/us-sends-aircraft-carrier-toward-north-korea-response-recent-provocations\">the media is now widely reporting</a> what I was already observing, which is that the US naval elements, which are always the core of any large-scale US military assault, are now stronger in the Pacific than they are in the Gulf.</p><p><i>“a massive joint naval exercise involving Japan, South Korea and the US was being held this week aimed at countering the threat from North Korean submarines”</i></p><p>Where I was clearly wrong was that I was expecting a feint followed quickly by a hard-hitting surprise attack. It appears, however, that the God-Emperor is going to attempt to negotiate first, while carrying a big stick in his hand. Of course, even with a strong US naval presence in the Sea of Japan, an attack from the north by the Chinese would probably come as a big surprise to the North Koreans.</p><p>Shouldn’t the God-Emperor put American interests first? Well, that’s just it. There are no American interests in Syria. But it’s simply not possible to say the same with any degree of certainty about the North Korean situation. If – if – China and Russia are both signing on, as appears to be the case, then it behooves us to not rush to any judgment until we know more about the situation.</p></div>",
  "content_text": "First, a roundup of some other people’s thoughts. Zerohedge on\nthe intelligence community’s perspective\n:\nAlarm within the U.S. intelligence community about Trump’s hasty decision to attack Syria reverberated from the Middle East back to Washington, where former CIA officer Philip Giraldi reported hearing from his intelligence contacts in the field that they were shocked at how the new poison-gas story was being distorted by Trump and the mainstream U.S. news media.\nGiraldi told Scott Horton’s Webcast: “I’m hearing from sources on the ground in the Middle East, people who are intimately familiar with the intelligence that is available who are saying that the essential narrative that we’re all hearing about the Syrian government or the Russians using chemical weapons on innocent civilians is a sham.”\nGiraldi said his sources were more in line with an analysis postulating an accidental release of the poison gas after an Al Qaeda arms depot was hit by a Russian airstrike.\n“The intelligence confirms pretty much the account that the Russians have been giving … which is that they hit a warehouse where the rebels – now these are rebels that are, of course, connected with Al Qaeda – where the rebels were storing chemicals of their own and it basically caused an explosion that resulted in the casualties. Apparently the intelligence on this is very clear.”\nGiraldi said the anger within the intelligence community over the distortion of intelligence to justify Trump’s military retaliation was so great that some covert officers were considering going public.\n“People in both the agency [the CIA] and in the military who are aware of the intelligence are freaking out about this because essentially Trump completely misrepresented what he already should have known – but maybe he didn’t – and they’re afraid that this is moving toward a situation that could easily turn into an armed conflict,” Giraldi said before Thursday night’s missile strike. “They are astonished by how this is being played by the administration and by the U.S. media.”\nI tend to favor the Russian accounts because the Russians have repeatedly proven to be reliable with regards to Syrian events, while the US has repeatedly been caught pushing false narratives and even false flags. Remember the “Russian attack” on the aid convoy that abruptly disappeared from the news once it became apparent that the US drones had blown up the convoy? It was all over the international news one day and utterly gone the next. And as anyone who has read Murakami’s\nUnderground\nknows, whatever the reported chemical was, it was not sarin.\nMike Cernovich reports that was McMaster serving as a Petraeus stand-in, not Mattis or Kushner,\nwho was primarily responsible\nfor the Syrian attack:\nCurrent National Security Adviser Herbert Raymond “H. R.” McMaster is manipulating intelligence reports given to President Donald Trump, Cernovich Media can now report. McMaster is plotting how to sell a massive ground war in Syria to President Trump with the help of disgraced former CIA director and convicted criminal David Petraeus, who mishandled classified information by sharing documents with his mistress.\nAs NSA, McMaster’s job is to synthesize intellience reports from all other agencies. President Trump is being given an inaccurate picture of the situation in Syria, as McMaster is seeking to involve the U.S. in a full scale war in Syria. The McMaster-Petraeus plan calls for 150,000 American ground troops in Syria….\nMcMaster’s friends in the media, as part of a broader strategy to increase McMaster’s power, have claimed Jared Kushner and Bannon had a major falling out. In fact Kushner and Bannon are united in their opposition to McMaster’s plan. If McMaster and Petraeus have their way, America will find itself in another massive war in the Middle East.\nIt’s certainly interesting to hear that Kushner and Bannon are still de facto allies. And now, since others appear to have noticed the same things that I have and gone public with it, I’ll post what I wrote to a friend several days ago:\nObviously, I don’t know what is happening. But I strongly suspect all this Syria nonsense is a feint to cover an upcoming US-China attack on North Korea.\nWe’re all hearing deployment news from contacts in the military. But if you look at where the carriers are, the signs point to action in the Pacific, not the Middle East. If you look at the map of the Korean Peninsula, it would make sense for the US to defend the South Korean border, then provide air support and perform amphibious operations from the Sea of Japan while China attacks from the north and from the Yellow Sea.\nI think the fact that Trump and Putin are publicly engaged in this very angsty sabre-rattling over virtually nothing in Syria while Xi is in Florida is potentially significant. Trump and Putin play out the little Syrian charade, Trump explains it to Xi, and then the US Navy has the greenlight to go after the lunatics before Tokyo, Moscow, or Beijing get nuked.\nThis appears to be wrong about the Syrian action a feint; the God-Emperor has come out very noisily against North Korea and expressed satisfaction with an operation that appears to have accomplished precisely nothing. It looks more like a warning to a third party. Therefore, I conclude that the Syrian strike may have achieved two goals for him.\nCalling the neocons’ bluff. They were all in favor of this attack and claimed it would accomplish something significant. Obviously, they knew it wouldn’t, but hoped it would provoke a response from either Assad or Putin that would permit further entanglement and a justification for an invasion. That didn’t happen, and now the President can tell them that he already took their advice and it did not work as they predicted.\nPutting pressure on Kim. I don’t know what happened beyond what we all know from the news, but something that has come out of North Korea recently appears to have all the world leaders rattled. Japan’s Abe was just at the White House. China’s Xi was actually there during the Syrian strike and took no offense at what the some in the media tried to portray as disrespect. Notice in particular how Trump stressed that the Syrian attack proved that he is a man of his word just prior to launching some very serious threats at Kim.\nI further observe that\nthe media is now widely reporting\nwhat I was already observing, which is that the US naval elements, which are always the core of any large-scale US military assault, are now stronger in the Pacific than they are in the Gulf.\n“a massive joint naval exercise involving Japan, South Korea and the US was being held this week aimed at countering the threat from North Korean submarines”\nWhere I was clearly wrong was that I was expecting a feint followed quickly by a hard-hitting surprise attack. It appears, however, that the God-Emperor is going to attempt to negotiate first, while carrying a big stick in his hand. Of course, even with a strong US naval presence in the Sea of Japan, an attack from the north by the Chinese would probably come as a big surprise to the North Koreans.\nShouldn’t the God-Emperor put American interests first? Well, that’s just it. There are no American interests in Syria. But it’s simply not possible to say the same with any degree of certainty about the North Korean situation. If – if – China and Russia are both signing on, as appears to be the case, then it behooves us to not rush to any judgment until we know more about the situation.",
  "tags": [
    "conspiracy",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-09T14:00:00+00:00"
}