{
  "url": "https://voxday.net/2017/04/03/the-prescient-presiden/",
  "scraped_at": "2025-12-18T07:08:47.086810",
  "title": "The prescient president",
  "date_display": "April 3, 2017",
  "date_iso": "2017-04-03T14:00:00+00:00",
  "date_from_url": "2017-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A pattern is emerging. The God-Emperor says something. The opposition media explodes in a paroxysm of disbelief and mockery ridiculing his disturbing and comical ignorance. They are somehow simultaneously laughing and terrified. Then events prove the God-Emperor right. <a href=\"http://www.unz.com/ishamir/eerie-prescience-of-donald-trump/\">Israel Shamir recounts</a> three recent incidents:</p><blockquote><p> The third case of Trump being ridiculed and fully vindicated is the most remarkable one. There were recently many threats against Jewish institutions all over the US. The Jewish media connected the threats with Trump’s election. They called it a “wave of threats”, “second wave of threats”, “third wave of threats”. Apparently, dozens, if not hundreds of Jewish institutions received intimidating calls and threats.</p><p>The Jewish journalists are usually Trump-haters. Not for some specific Jewish reasons: they are for immigration, for race-mixing (always excepting Jews), for re-gendering, and for finance. For them, Trump’s attack on financier George Soros, Federal Reserve Chair Janet Yellen, and Goldman Sachs Chair and CEO Lloyd Blankfein has been an antisemitic attack as they are Jewish.</p><p>So it was easy for them to blame Trump for the threats. At his press-conference, Trump made a short work of Jake Turx, a Jewish reporter who insinuated that Trump encouraged antisemitism. He said that the Jews probably did the threats themselves, or something to such effect. The Jewish media exploded once again. How did he dare?</p><p>The ADL, the Jewish wannabe gestapo, wrote: “anti-Semites alleged that Jews themselves are behind the numerous bomb threats to Jewish institutions as a way to garner sympathy for being a victim and that the Jews are using the cemetery desecration to force President Trump into making a statement about anti-Semitism.”</p><p>The Pennsylvania Attorney General claimed that Donald Trump said to him that Jewish people might be behind the threats and attacks on Jewish Community Centres to “make others look bad”, another liberal-Jewish publication alleged and concluded: “The President of the United States should never be claiming that threats and attacks are “false flags.” America needs a president, not a bigoted conspiracy theorist in chief.”</p><p>And then Trump called upon the FBI and had their sent agents to Israel. There, in a rather small southern town of Ashkelon, lived a young hacker with his five computers and three antennas who made all the threats single-handed. What’s worse, he did it for two years, and Israeli police did nothing to apprehend him – until they saw FBI agents. Then they immediately arrested the guy who spilled the beans right away. Apparently FBI knew all about him, but while Obama was at the helm, they did nothing.</p><p>If he were a goy, Jews would call to crucify him – and Trump. But as he was a Jew, the responses in the Jewish media were very kind and understanding. He was a very young and very patriotic young man, he was sick, and he did not understand what he did, but he surely acted for perceived benefit of the Jews.</p><p>So indeed the threats and attacks were “false flags”, as these awful antisemites and bigoted conspiracy theorists had claimed.</p></blockquote><p>Note the implication that the Israeli police may have known about the man’s two-year campaign of threats, but did nothing about it until the God-Emperor sent the FBI there. That doesn’t mean they genuinely did know, but it does tend to underline the conclusion that all accusations of so-called “anti-semitism” and all acts of vandalism by unknown perpetrators should be viewed very skeptically. The SPLC and the ADL profit from crying wolf, after all, and now we are informed that crying wolf is “for the perceived benefit of the Jews”.</p><p>Meanwhile, the opposition media has learned nothing from its continued humiliation at the God-Emperor’s hands, as <a href=\"http://www.latimes.com/projects/la-ed-our-dishonest-president/\">this hysterical tantrum by the LA Times</a> demonstrates:</p><blockquote><p> It was no secret during the campaign that Donald Trump was a narcissist and a demagogue who used fear and dishonesty to appeal to the worst in American voters. The Times called him unprepared and unsuited for the job he was seeking, and said his election would be a “catastrophe.”</p><p>Still, nothing prepared us for the magnitude of this train wreck. Like millions of other Americans, we clung to a slim hope that the new president would turn out to be all noise and bluster, or that the people around him in the White House would act as a check on his worst instincts, or that he would be sobered and transformed by the awesome responsibilities of office.</p><p>Instead, seventy-some days in — and with about 1,400 to go before his term is completed — it is increasingly clear that those hopes were misplaced…. It is impossible to know where his presidency will lead or how much damage he will do to our nation.</p></blockquote><p>“What nation is that?” said the Alt-Right.</p></div>",
  "content_text": "A pattern is emerging. The God-Emperor says something. The opposition media explodes in a paroxysm of disbelief and mockery ridiculing his disturbing and comical ignorance. They are somehow simultaneously laughing and terrified. Then events prove the God-Emperor right.\nIsrael Shamir recounts\nthree recent incidents:\nThe third case of Trump being ridiculed and fully vindicated is the most remarkable one. There were recently many threats against Jewish institutions all over the US. The Jewish media connected the threats with Trump’s election. They called it a “wave of threats”, “second wave of threats”, “third wave of threats”. Apparently, dozens, if not hundreds of Jewish institutions received intimidating calls and threats.\nThe Jewish journalists are usually Trump-haters. Not for some specific Jewish reasons: they are for immigration, for race-mixing (always excepting Jews), for re-gendering, and for finance. For them, Trump’s attack on financier George Soros, Federal Reserve Chair Janet Yellen, and Goldman Sachs Chair and CEO Lloyd Blankfein has been an antisemitic attack as they are Jewish.\nSo it was easy for them to blame Trump for the threats. At his press-conference, Trump made a short work of Jake Turx, a Jewish reporter who insinuated that Trump encouraged antisemitism. He said that the Jews probably did the threats themselves, or something to such effect. The Jewish media exploded once again. How did he dare?\nThe ADL, the Jewish wannabe gestapo, wrote: “anti-Semites alleged that Jews themselves are behind the numerous bomb threats to Jewish institutions as a way to garner sympathy for being a victim and that the Jews are using the cemetery desecration to force President Trump into making a statement about anti-Semitism.”\nThe Pennsylvania Attorney General claimed that Donald Trump said to him that Jewish people might be behind the threats and attacks on Jewish Community Centres to “make others look bad”, another liberal-Jewish publication alleged and concluded: “The President of the United States should never be claiming that threats and attacks are “false flags.” America needs a president, not a bigoted conspiracy theorist in chief.”\nAnd then Trump called upon the FBI and had their sent agents to Israel. There, in a rather small southern town of Ashkelon, lived a young hacker with his five computers and three antennas who made all the threats single-handed. What’s worse, he did it for two years, and Israeli police did nothing to apprehend him – until they saw FBI agents. Then they immediately arrested the guy who spilled the beans right away. Apparently FBI knew all about him, but while Obama was at the helm, they did nothing.\nIf he were a goy, Jews would call to crucify him – and Trump. But as he was a Jew, the responses in the Jewish media were very kind and understanding. He was a very young and very patriotic young man, he was sick, and he did not understand what he did, but he surely acted for perceived benefit of the Jews.\nSo indeed the threats and attacks were “false flags”, as these awful antisemites and bigoted conspiracy theorists had claimed.\nNote the implication that the Israeli police may have known about the man’s two-year campaign of threats, but did nothing about it until the God-Emperor sent the FBI there. That doesn’t mean they genuinely did know, but it does tend to underline the conclusion that all accusations of so-called “anti-semitism” and all acts of vandalism by unknown perpetrators should be viewed very skeptically. The SPLC and the ADL profit from crying wolf, after all, and now we are informed that crying wolf is “for the perceived benefit of the Jews”.\nMeanwhile, the opposition media has learned nothing from its continued humiliation at the God-Emperor’s hands, as\nthis hysterical tantrum by the LA Times\ndemonstrates:\nIt was no secret during the campaign that Donald Trump was a narcissist and a demagogue who used fear and dishonesty to appeal to the worst in American voters. The Times called him unprepared and unsuited for the job he was seeking, and said his election would be a “catastrophe.”\nStill, nothing prepared us for the magnitude of this train wreck. Like millions of other Americans, we clung to a slim hope that the new president would turn out to be all noise and bluster, or that the people around him in the White House would act as a check on his worst instincts, or that he would be sobered and transformed by the awesome responsibilities of office.\nInstead, seventy-some days in — and with about 1,400 to go before his term is completed — it is increasingly clear that those hopes were misplaced…. It is impossible to know where his presidency will lead or how much damage he will do to our nation.\n“What nation is that?” said the Alt-Right.",
  "tags": [
    "media",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-03T13:00:00+00:00"
}