{
  "url": "https://voxday.net/2017/04/14/the-hitler-that-wasn/",
  "scraped_at": "2025-12-18T07:10:15.086197",
  "title": "The Hitler that wasn’t",
  "date_display": "April 14, 2017",
  "date_iso": "2017-04-14T13:03:00+00:00",
  "date_from_url": "2017-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s rather fascinating that despite the media’s ritual anointing of a Hitler du jour, the one world leader who has thus far escaped being granted the title is <a href=\"http://www.reuters.com/article/us-turkey-referendum-poll-idUSKBN17F0V3\">the one most aggressively engaged in the pursuit of foreign expansionism, imperialism, and the pursuit of Lebensraum</a>, and has now utilized the Hitlerian practice of expanding his personal power through plebiscites.</p><blockquote><p> A narrow majority of Turks will vote “Yes” in Sunday’s referendum on changing the constitution to grant President Tayyip Erdogan sweeping new powers, two opinion polls showed on Thursday.</p><p>The April 16 vote will decide on the biggest change in Turkey’s system of governance since the modern republic’s foundation almost a century ago, potentially replacing its parliamentary system with an executive presidency.</p><p>Polling company Konda said the number of “yes” voters stood at 51.5 percent, but said its survey had a margin of error of plus or minus 2.4 percent.</p><p>“When this forecast is considered within the survey’s margin of error, a final judgement might be misleading,” Konda said in a statement.</p><p>Its survey, carried out face-to-face with 3,462 people in 30 provinces on April 7-9, showed turnout for the vote would be around 90 percent. It said the level of undecided voters had fallen to 9 percent from more than 20 percent in January and there was no evidence to indicate their preference.</p></blockquote></div>",
  "content_text": "It’s rather fascinating that despite the media’s ritual anointing of a Hitler du jour, the one world leader who has thus far escaped being granted the title is\nthe one most aggressively engaged in the pursuit of foreign expansionism, imperialism, and the pursuit of Lebensraum\n, and has now utilized the Hitlerian practice of expanding his personal power through plebiscites.\nA narrow majority of Turks will vote “Yes” in Sunday’s referendum on changing the constitution to grant President Tayyip Erdogan sweeping new powers, two opinion polls showed on Thursday.\nThe April 16 vote will decide on the biggest change in Turkey’s system of governance since the modern republic’s foundation almost a century ago, potentially replacing its parliamentary system with an executive presidency.\nPolling company Konda said the number of “yes” voters stood at 51.5 percent, but said its survey had a margin of error of plus or minus 2.4 percent.\n“When this forecast is considered within the survey’s margin of error, a final judgement might be misleading,” Konda said in a statement.\nIts survey, carried out face-to-face with 3,462 people in 30 provinces on April 7-9, showed turnout for the vote would be around 90 percent. It said the level of undecided voters had fallen to 9 percent from more than 20 percent in January and there was no evidence to indicate their preference.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-14T12:03:00+00:00"
}