{
  "url": "https://voxday.net/2017/04/02/the-dead-end-of-rap/",
  "scraped_at": "2025-12-18T07:08:38.027174",
  "title": "The dead end of rap",
  "date_display": "April 2, 2017",
  "date_iso": "2017-04-02T09:18:00+00:00",
  "date_from_url": "2017-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was talking to a young girl who <i>intensely </i>dislikes rap the other day. When I asked her why she disliked it, she said, “it’s so boring”. And, despite being a fan of Public Enemy since the <a href=\"https://www.youtube.com/watch?v=QczzKqzuHfw\">“Sophisticated Bitch”</a> and <a href=\"https://youtu.be/mDERo9ZNZcg\">“98 Oldsmobile”</a> days, and having been one of the very few non-Africans at the PE/NWA concert at First Avenue in 1988, I had to admit that she is absolutely right. Rap simply hasn’t gone anywhere musically since NWA’s innovation of posing as modern gangsters and dropping f-bombs every fourth word; how can anyone who has ever heard Chuck D bear to listen to Jay-Z ruining yet another lovely song with his inept, droning monologues?</p><p>Seriously, is there a bigger pop music abomination than the massive steaming dump that Jay-Z inexplicably slathers all over Alphaville’s “Forever Young”?</p><p>But when I got to thinking about it, I realized that this musical dead end was inevitable. It was always going to be the case. Most of the early “rap is crap” critics were committing a category error when they complained about “rap music”. Their instincts were right, but their sneering arguments were mostly off base and therefore unconvincing. The fact is that rap is not, technically speaking, music at all. To call it music is akin to describing “scatting” or “falsetto” or “rhythm” or “electric guitar” as music. It is, rather, a non-melodic vocal styling; it is an element of music, or if you prefer, a musical tool, rather than a form of music in itself.</p><p>And while that vocal styling can be utilized in a broad variety of music, from metal to ambient, it is not music in itself. What is often known as “rap music” is a degraded, primitive form of music created mostly by non-musicians, which is necessarily going to be either sample-based (Public Enemy), childishly simple (Dr. Dre), or an additional vocal track added to existing music (Puff Daddy, Jay-Z).</p><p>In other words, “rap music” was never anything more than a proto-SJW seize-and-ruin operation and an exercise in branding. That’s why it hasn’t gone anywhere. It can’t go anywhere because there is no actual vehicle to do so.</p><p>This isn’t to say that rap hasn’t contributed anything to actual forms of music <i>as a vocal styling</i>. Dave Draiman does not rap, but his staccato delivery and multi-syllabic lyrics made Disturbed a better, more interesting metal band. I also suspect that the move from one bass drum to two, such as one sees in bands like Disturbed and Babymetal, represents a real advance in rock drumming that stems in part from the influence of faster, more complicated vocal stylings.</p><p>And who hasn’t enjoyed Beck or twentyonepilots making use of the various possibilities presented by it? But as a musical form in itself, it simply does not exist.</p></div>",
  "content_text": "I was talking to a young girl who\nintensely\ndislikes rap the other day. When I asked her why she disliked it, she said, “it’s so boring”. And, despite being a fan of Public Enemy since the\n“Sophisticated Bitch”\nand\n“98 Oldsmobile”\ndays, and having been one of the very few non-Africans at the PE/NWA concert at First Avenue in 1988, I had to admit that she is absolutely right. Rap simply hasn’t gone anywhere musically since NWA’s innovation of posing as modern gangsters and dropping f-bombs every fourth word; how can anyone who has ever heard Chuck D bear to listen to Jay-Z ruining yet another lovely song with his inept, droning monologues?\nSeriously, is there a bigger pop music abomination than the massive steaming dump that Jay-Z inexplicably slathers all over Alphaville’s “Forever Young”?\nBut when I got to thinking about it, I realized that this musical dead end was inevitable. It was always going to be the case. Most of the early “rap is crap” critics were committing a category error when they complained about “rap music”. Their instincts were right, but their sneering arguments were mostly off base and therefore unconvincing. The fact is that rap is not, technically speaking, music at all. To call it music is akin to describing “scatting” or “falsetto” or “rhythm” or “electric guitar” as music. It is, rather, a non-melodic vocal styling; it is an element of music, or if you prefer, a musical tool, rather than a form of music in itself.\nAnd while that vocal styling can be utilized in a broad variety of music, from metal to ambient, it is not music in itself. What is often known as “rap music” is a degraded, primitive form of music created mostly by non-musicians, which is necessarily going to be either sample-based (Public Enemy), childishly simple (Dr. Dre), or an additional vocal track added to existing music (Puff Daddy, Jay-Z).\nIn other words, “rap music” was never anything more than a proto-SJW seize-and-ruin operation and an exercise in branding. That’s why it hasn’t gone anywhere. It can’t go anywhere because there is no actual vehicle to do so.\nThis isn’t to say that rap hasn’t contributed anything to actual forms of music\nas a vocal styling\n. Dave Draiman does not rap, but his staccato delivery and multi-syllabic lyrics made Disturbed a better, more interesting metal band. I also suspect that the move from one bass drum to two, such as one sees in bands like Disturbed and Babymetal, represents a real advance in rock drumming that stems in part from the influence of faster, more complicated vocal stylings.\nAnd who hasn’t enjoyed Beck or twentyonepilots making use of the various possibilities presented by it? But as a musical form in itself, it simply does not exist.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-02T08:18:00+00:00"
}