{
  "url": "https://voxday.net/2017/04/12/this-is-what-zero-fucks-looks-like/",
  "scraped_at": "2025-12-18T07:10:02.682962",
  "title": "This is what “Zero Fucks” looks like",
  "date_display": "April 12, 2017",
  "date_iso": "2017-04-12T20:00:00+00:00",
  "date_from_url": "2017-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi <a href=\"http://whatever.scalzi.com/2017/04/12/reader-request-week-2017-4-haters-and-how-i-deal-with-them/\">goes into great detail</a> explaining that he doesn’t care that people hate him, that only a few dozen people hate him anyhow, that it doesn’t matter that people hate him, and also, it totally doesn’t bother him at all that people hate him:</p><blockquote><p> Specific, embarrassingly devoted hater and his pals:</p><p>I don’t have much time for this dude anymore, and I suspect it really bothers him. Cultivating the idea of a feud between us is a cornerstone of his publishing strategy, and asserting equivalency in our careers is how he tries to convince others he’s important. And while it’s nice every now and again to raise lots of money for charitable causes off his obsession with me, in a general sense I’ve been kind of busy. I pretty much don’t think of him unless he’s jumping up and down to get my attention, or trying to make a buck off my name. It’s a lopsided deal — he needs me, but I don’t need him for anything. My real annoyance at this point is that other folks are unintentionally doing this jerk’s desperately attention-seeking work for him, sending me updates on the latest nonsense he’s saying or doing, involving the version of me he peddles to his pals. If all y’all could resist the temptation, I’d be obliged. I don’t actually care about this dude.</p><p>“Don’t actually care” is where I mostly am with my haters these days, in fact, and I acknowledge it’s a nice place to be in. I’m blessed with work I like and people in my life I love, and the time I have now is all the time I’ll ever have. I plan to spend as much of it focusing on the things I like and people I love as I can, and rather little of it on the people who get off on hating me. Go on and hate me, dudes. It’s your karma. I have better things to do with my time.</p></blockquote><p>First, SJWs always lie. And John Scalzi lies more than most. Scalzi is an insecure poser, which is why you can be certain that whatever the truth might be, it is not whatever he is saying.</p><p>Second, I never paid any attention whatsoever to John Scalzi until he began attacking me in 2005 in order to curry favor with Patrick Nielsen Hayden. I had no idea who he was. If Scalzi disappeared tomorrow, it wouldn’t bother me in the slightest. I don’t need him, I don’t want his attention, and I don’t even hate him. He’s nothing but PNH’s tool; his entire career is entirely dependent upon PNH. PNH and Tor Books are the disease, Scalzi is merely the symptom. I don’t read his blogs. I don’t read his books. I don’t read his Twitter account. I almost certainly pay less attention to him than he does to me; if nothing else, I don’t have the time.</p><p>Third, John Scalzi was so indifferent that he took the time to narrate the audiobook of a parody of <i>SJWs Always Lie</i> in 2015. (I found this somewhat remarkable given that I couldn’t be bothered to do the same for my own book.) This uncomfortable fact was completely swept under the table and ignored by those who found it utterly outrageous that Castalia House would dare to publish a parody of his most recent novel. Those who run with the ridiculous “envy” and “obsession” themes always skate over the fact that my responses to Scalzi are just that: <i>responses </i>to his little forays.</p><p>Fourth, I will always find the time to hammer John Scalzi. He is a horrible, dishonest little creature, and very nearly Plato’s Form of everything that a man should not be. If he didn’t exist, we’d have to manufacture negative examples.</p><p>Fifth, this long post indicates that Mr. Scalzi is rattled by the failure of <i>The Collapsing Empire</i> to break out in a manner justifying his book contract. Tor Books pushed it as hard as they could, but once more, they discovered that while you can call a midlister a “bestselling author” all you want, that’s not going to make his book a hit. The book sucks; even his fans don’t think much of it. Which is why the over/under on the contract being “renegotiated” moves from Book Four to Book Three.</p><p>From the comments:</p><blockquote class=\"tr_bq\"><p> I didn’t mention the name of my specific, embarrassingly devoted hater in the piece because it amuses me not to, but I don’t mind if you name him in the comment thread here. With that said, don’t turn your mentions of him into a two-minute hate, please. We all know he’s an awful person. Let’s not reiterate it endlessly.</p></blockquote><p>So very amusing! See: First Law of SJW. What’s fascinating is the idea that their pretending not to pay attention to me is somehow “infuriating”. I didn’t pay any notice to these weird little losers in high school, what on Earth makes them think I am desperate for their attention now?</p></div>",
  "content_text": "John Scalzi\ngoes into great detail\nexplaining that he doesn’t care that people hate him, that only a few dozen people hate him anyhow, that it doesn’t matter that people hate him, and also, it totally doesn’t bother him at all that people hate him:\nSpecific, embarrassingly devoted hater and his pals:\nI don’t have much time for this dude anymore, and I suspect it really bothers him. Cultivating the idea of a feud between us is a cornerstone of his publishing strategy, and asserting equivalency in our careers is how he tries to convince others he’s important. And while it’s nice every now and again to raise lots of money for charitable causes off his obsession with me, in a general sense I’ve been kind of busy. I pretty much don’t think of him unless he’s jumping up and down to get my attention, or trying to make a buck off my name. It’s a lopsided deal — he needs me, but I don’t need him for anything. My real annoyance at this point is that other folks are unintentionally doing this jerk’s desperately attention-seeking work for him, sending me updates on the latest nonsense he’s saying or doing, involving the version of me he peddles to his pals. If all y’all could resist the temptation, I’d be obliged. I don’t actually care about this dude.\n“Don’t actually care” is where I mostly am with my haters these days, in fact, and I acknowledge it’s a nice place to be in. I’m blessed with work I like and people in my life I love, and the time I have now is all the time I’ll ever have. I plan to spend as much of it focusing on the things I like and people I love as I can, and rather little of it on the people who get off on hating me. Go on and hate me, dudes. It’s your karma. I have better things to do with my time.\nFirst, SJWs always lie. And John Scalzi lies more than most. Scalzi is an insecure poser, which is why you can be certain that whatever the truth might be, it is not whatever he is saying.\nSecond, I never paid any attention whatsoever to John Scalzi until he began attacking me in 2005 in order to curry favor with Patrick Nielsen Hayden. I had no idea who he was. If Scalzi disappeared tomorrow, it wouldn’t bother me in the slightest. I don’t need him, I don’t want his attention, and I don’t even hate him. He’s nothing but PNH’s tool; his entire career is entirely dependent upon PNH. PNH and Tor Books are the disease, Scalzi is merely the symptom. I don’t read his blogs. I don’t read his books. I don’t read his Twitter account. I almost certainly pay less attention to him than he does to me; if nothing else, I don’t have the time.\nThird, John Scalzi was so indifferent that he took the time to narrate the audiobook of a parody of\nSJWs Always Lie\nin 2015. (I found this somewhat remarkable given that I couldn’t be bothered to do the same for my own book.) This uncomfortable fact was completely swept under the table and ignored by those who found it utterly outrageous that Castalia House would dare to publish a parody of his most recent novel. Those who run with the ridiculous “envy” and “obsession” themes always skate over the fact that my responses to Scalzi are just that:\nresponses\nto his little forays.\nFourth, I will always find the time to hammer John Scalzi. He is a horrible, dishonest little creature, and very nearly Plato’s Form of everything that a man should not be. If he didn’t exist, we’d have to manufacture negative examples.\nFifth, this long post indicates that Mr. Scalzi is rattled by the failure of\nThe Collapsing Empire\nto break out in a manner justifying his book contract. Tor Books pushed it as hard as they could, but once more, they discovered that while you can call a midlister a “bestselling author” all you want, that’s not going to make his book a hit. The book sucks; even his fans don’t think much of it. Which is why the over/under on the contract being “renegotiated” moves from Book Four to Book Three.\nFrom the comments:\nI didn’t mention the name of my specific, embarrassingly devoted hater in the piece because it amuses me not to, but I don’t mind if you name him in the comment thread here. With that said, don’t turn your mentions of him into a two-minute hate, please. We all know he’s an awful person. Let’s not reiterate it endlessly.\nSo very amusing! See: First Law of SJW. What’s fascinating is the idea that their pretending not to pay attention to me is somehow “infuriating”. I didn’t pay any notice to these weird little losers in high school, what on Earth makes them think I am desperate for their attention now?",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-12T19:00:00+00:00"
}