{
  "url": "https://voxday.net/2017/04/30/why-arent-you-buying-books/",
  "scraped_at": "2025-12-18T07:12:07.562868",
  "title": "Why aren’t YOU buying ebooks?",
  "date_display": "April 30, 2017",
  "date_iso": "2017-04-30T10:48:00+00:00",
  "date_from_url": "2017-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.theguardian.com/books/2017/apr/27/screen-fatigue-sees-uk-ebook-sales-plunge-17-as-readers-return-to-print\">Ebooks sales have declined </a>over the last two years. While Castalia has been growing 100 percent year-on-year for more than six straight months, we have seen our ebook sales decline in April, possibly because we haven’t released anything new in ebook – although John C. Wright’s <i>City Beyond Time</i> is now available in trade paperback.</p><blockquote><p> Britons are abandoning the ebook at an alarming rate with sales of consumer titles down almost a fifth last year, as “screen fatigue” helped fuel a five-year high in printed book sales. Sales of consumer ebooks plunged 17% to £204m last year, the lowest level since 2011 – the year the ebook craze took off as Jeff Bezos’ market-dominating Amazon Kindle took the UK by storm.</p><p>It is the second year running that sales of consumer ebooks – the biggest segment of the £538m ebook market, which fell 3% last year – have slumped as commuters, holidaymakers and leisure readers shelve digital editions in favour of good old fashioned print novels.</p><p>“I wouldn’t say that the ebook dream is over but people are clearly making decisions on when they want to spend time with their screens,” says Stephen Lotinga, chief exeutive of the Publishers Association, which published its annual yearbook on Thursday.</p><p>“There is generally a sense that people are now getting screen tiredness, or fatigue, from so many devices being used, watched or looked at in their week. [Printed] books provide an opportunity to step away from that.”</p><p>Sales of consumer ebooks hit a high water mark of £275m in 2014, when they accounted for half of the overall ebook market. The decline in consumer ebooks has been led by a slump in sales of the most popular segment, fiction, which plummeted 16% to £165m last year.</p></blockquote><p>Are we putting out too many books too fast? Are we not putting out enough new books? Is it hatred for Amazon? More than enough Kindle Unlimited? Or are people simply getting tired of reading books on screen? While we’ve seen growth on the print side, it’s not enough to support the theory that people are switching from ebook to print.</p><p>This is not a complaint, you understand. We are profoundly grateful for the staunch support we have enjoyed from Castalia House’s readers, and we are striving to improve our catalog as it grows. Not every book is going to be a great one, but I believe that our percentage of “yes, that book was worth reading and I’m glad I read it” is relatively high for the publishing industry.</p><p>Anyhow, if you haven’t delved into Selenoth yet, perhaps Didact Reach’s reaction to <b><i><a href=\"http://amzn.to/2hgubn2\">A Sea of Skulls</a></i></b> will convince you to do so:</p><blockquote><p> Having read through your superb new book, <i>A Sea of Skulls</i>, right at the tail end of last year, I found myself left with more than a few questions as to how the overall plot of the Arts of Dark and Light series tied together. And so I went back and re-read <i>A Throne of Bones</i> last week, <a href=\"http://didactsreach.blogspot.in/2013/01/book-review-throne-of-bones-by-vox-day.html\">which I had reviewed</a> back when it was released, to fill in my remaining gaps in memory.</p><p>I was truly delighted to find that the first book was actually even better after reading its sequel, four years later. Having finished it off, I went through ASOS again in fairly record time as well, and am now fully convinced that what you have created will stand the test of time as one of the best high-fantasy series ever written. I stand by my opinion that you have surpassed George Rape Rape Martin and left him panting and wheezing in the dust.</p></blockquote><p>Overwrought and excessive praise from a fanboy? Or well-merited approbation? There is really only <a href=\"http://amzn.to/2hgubn2\">one way to find out</a>.</p></div>",
  "content_text": "Ebooks sales have declined\nover the last two years. While Castalia has been growing 100 percent year-on-year for more than six straight months, we have seen our ebook sales decline in April, possibly because we haven’t released anything new in ebook – although John C. Wright’s\nCity Beyond Time\nis now available in trade paperback.\nBritons are abandoning the ebook at an alarming rate with sales of consumer titles down almost a fifth last year, as “screen fatigue” helped fuel a five-year high in printed book sales. Sales of consumer ebooks plunged 17% to £204m last year, the lowest level since 2011 – the year the ebook craze took off as Jeff Bezos’ market-dominating Amazon Kindle took the UK by storm.\nIt is the second year running that sales of consumer ebooks – the biggest segment of the £538m ebook market, which fell 3% last year – have slumped as commuters, holidaymakers and leisure readers shelve digital editions in favour of good old fashioned print novels.\n“I wouldn’t say that the ebook dream is over but people are clearly making decisions on when they want to spend time with their screens,” says Stephen Lotinga, chief exeutive of the Publishers Association, which published its annual yearbook on Thursday.\n“There is generally a sense that people are now getting screen tiredness, or fatigue, from so many devices being used, watched or looked at in their week. [Printed] books provide an opportunity to step away from that.”\nSales of consumer ebooks hit a high water mark of £275m in 2014, when they accounted for half of the overall ebook market. The decline in consumer ebooks has been led by a slump in sales of the most popular segment, fiction, which plummeted 16% to £165m last year.\nAre we putting out too many books too fast? Are we not putting out enough new books? Is it hatred for Amazon? More than enough Kindle Unlimited? Or are people simply getting tired of reading books on screen? While we’ve seen growth on the print side, it’s not enough to support the theory that people are switching from ebook to print.\nThis is not a complaint, you understand. We are profoundly grateful for the staunch support we have enjoyed from Castalia House’s readers, and we are striving to improve our catalog as it grows. Not every book is going to be a great one, but I believe that our percentage of “yes, that book was worth reading and I’m glad I read it” is relatively high for the publishing industry.\nAnyhow, if you haven’t delved into Selenoth yet, perhaps Didact Reach’s reaction to\nA Sea of Skulls\nwill convince you to do so:\nHaving read through your superb new book,\nA Sea of Skulls\n, right at the tail end of last year, I found myself left with more than a few questions as to how the overall plot of the Arts of Dark and Light series tied together. And so I went back and re-read\nA Throne of Bones\nlast week,\nwhich I had reviewed\nback when it was released, to fill in my remaining gaps in memory.\nI was truly delighted to find that the first book was actually even better after reading its sequel, four years later. Having finished it off, I went through ASOS again in fairly record time as well, and am now fully convinced that what you have created will stand the test of time as one of the best high-fantasy series ever written. I stand by my opinion that you have surpassed George Rape Rape Martin and left him panting and wheezing in the dust.\nOverwrought and excessive praise from a fanboy? Or well-merited approbation? There is really only\none way to find out\n.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-04-30T09:48:00+00:00"
}