{
  "url": "https://voxday.net/2015/07/05/a-descriptive-mode/",
  "scraped_at": "2025-12-16T13:02:05.976881",
  "title": "A descriptive model",
  "date_display": "July 5, 2015",
  "date_iso": "2015-07-05T12:17:00+00:00",
  "date_from_url": "2015-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keeping in mind, of course, that Rao is not talking about literal sociopathy here, it’s merely the term he’s chosen for his Gervais Principle model. Here he provides a useful distinction <a href=\"http://www.ribbonfarm.com/2009/11/11/the-gervais-principle-ii-posturetalk-powertalk-babytalk-and-gametalk/\">between the two types of Sociopaths</a>:</p><blockquote class=\"tr_bq\"><p> [E]ffective Sociopaths stick with steadfast discipline to the letter of<br> the law, internal and external, because the stupidest way to trip<br> yourself up is in the realm of rules where the Clueless and Losers get<br> to be judges and jury members. What they violate is its spirit, by<br> taking advantage of its ambiguities. Whether this makes them evil or<br> good depends on the situation. That’s a story for another day. Good<br> Sociopaths operate by what they <em>personally </em>choose as a higher<br> morality, in reaction to what they see as the dangers, insanities and<br> stupidities of mob morality. Evil Sociopaths are merely looking for a<br> quick, <em>safe</em> buck. Losers and the Clueless, of course, avoid individual moral decisions altogether.</br></br></br></br></br></br></br></br></br></p></blockquote><p>This is why I find the Clueless of the SF world to be so mind-bogglingly stupid. While they correctly recognize me as a Sociopath who is dangerous to the system, they don’t understand that I am the proverbial Good Sociopath. And because they are so Clueless, they completely fail to recognize the Evil Sociopaths already well-ensconced within their midst.</p><p>I mean, how hard can it possibly be for anyone conversant with this model to identify a specific Evil Sociopath who has repeatedly taken advantage of ambiguities in the science fiction world’s rules in order to make a quick, safe buck? You’d think Rao was <i>describing </i>that individual.</p></div>",
  "content_text": "Keeping in mind, of course, that Rao is not talking about literal sociopathy here, it’s merely the term he’s chosen for his Gervais Principle model. Here he provides a useful distinction\nbetween the two types of Sociopaths\n:\n[E]ffective Sociopaths stick with steadfast discipline to the letter of\nthe law, internal and external, because the stupidest way to trip\nyourself up is in the realm of rules where the Clueless and Losers get\nto be judges and jury members. What they violate is its spirit, by\ntaking advantage of its ambiguities. Whether this makes them evil or\ngood depends on the situation. That’s a story for another day. Good\nSociopaths operate by what they\npersonally\nchoose as a higher\nmorality, in reaction to what they see as the dangers, insanities and\nstupidities of mob morality. Evil Sociopaths are merely looking for a\nquick,\nsafe\nbuck. Losers and the Clueless, of course, avoid individual moral decisions altogether.\nThis is why I find the Clueless of the SF world to be so mind-bogglingly stupid. While they correctly recognize me as a Sociopath who is dangerous to the system, they don’t understand that I am the proverbial Good Sociopath. And because they are so Clueless, they completely fail to recognize the Evil Sociopaths already well-ensconced within their midst.\nI mean, how hard can it possibly be for anyone conversant with this model to identify a specific Evil Sociopath who has repeatedly taken advantage of ambiguities in the science fiction world’s rules in order to make a quick, safe buck? You’d think Rao was\ndescribing\nthat individual.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-05T11:17:00+00:00"
}