{
  "url": "https://voxday.net/2015/07/15/america-is-new-carthage/",
  "scraped_at": "2025-12-16T13:03:19.966612",
  "title": "America is the New Carthage",
  "date_display": "July 15, 2015",
  "date_iso": "2015-07-15T09:38:00+00:00",
  "date_from_url": "2015-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Americans have long considered themselves a nation blessed by God, a New Rome, a city on a hill, but as is increasingly evident, it is now a nation upon which God has turned His back and is permitting to stew in the full fruits of its own evil. And the disgusting revelation that Planned Parenthood is not only murdering America’s children on an industrial scale, <a href=\"http://www.breitbart.com/big-government/2015/07/14/planned-parenthoods-client-promised-profit-fiscal-growth-for-harvested-baby-body-parts/\">but harvesting them in much the same way the Nazis harvested their victims</a>, is sufficient to prove that America is not the New Rome it once fancied itself, but rather, the New Carthage:</p><blockquote class=\"tr_bq\"><p> The undercover journalist who videotaped a Planned Parenthood senior medical officer talking about how to buy and sell fetal body parts derived from aborted babies says Planned Parenthood is lying in their response to his video.</p><p>Planned Parenthood said Tuesday that it does not make money from selling fetal body parts to companies like StemExpress, and any revenues received are related strictly to expenses.</p><p>David Daleiden of the Center for Medical Progress said the abortion provider is lying: “Planned Parenthood makes two key admissions in their statement today; first, that aborted fetal parts are harvested at their clinics, and second, that money is exchanged in connection with this.”</p><p>He also says Planned Parenthood is lying by insisting it gets “proper consent” from its patients,” and “Planned Parenthood does not make money off the body parts.”</p></blockquote><p>It’s a little strange that the news Planned Parenthood is making an additional profit from the corpses of its victims should be so upsetting to Americans when so many of them are fine with the corporation profiting from the simple act of murder, but I suppose that shows the conscience of the nation is merely numbed, not entirely dead.</p><p>Matt Walsh put it well: “I want to thank everyone who defended Planned Parenthood today. I now know to never take any of your opinions seriously ever again.”</p><p> In any event, understand that America, like many an evil and decadent empire before it, is long overdue for a cleansing. Like it or not, the social conservatives were right, and the slippery slope they predicted, at which so many scoffed, appears to have been considerably understated.</p></div>",
  "content_text": "Americans have long considered themselves a nation blessed by God, a New Rome, a city on a hill, but as is increasingly evident, it is now a nation upon which God has turned His back and is permitting to stew in the full fruits of its own evil. And the disgusting revelation that Planned Parenthood is not only murdering America’s children on an industrial scale,\nbut harvesting them in much the same way the Nazis harvested their victims\n, is sufficient to prove that America is not the New Rome it once fancied itself, but rather, the New Carthage:\nThe undercover journalist who videotaped a Planned Parenthood senior medical officer talking about how to buy and sell fetal body parts derived from aborted babies says Planned Parenthood is lying in their response to his video.\nPlanned Parenthood said Tuesday that it does not make money from selling fetal body parts to companies like StemExpress, and any revenues received are related strictly to expenses.\nDavid Daleiden of the Center for Medical Progress said the abortion provider is lying: “Planned Parenthood makes two key admissions in their statement today; first, that aborted fetal parts are harvested at their clinics, and second, that money is exchanged in connection with this.”\nHe also says Planned Parenthood is lying by insisting it gets “proper consent” from its patients,” and “Planned Parenthood does not make money off the body parts.”\nIt’s a little strange that the news Planned Parenthood is making an additional profit from the corpses of its victims should be so upsetting to Americans when so many of them are fine with the corporation profiting from the simple act of murder, but I suppose that shows the conscience of the nation is merely numbed, not entirely dead.\nMatt Walsh put it well: “I want to thank everyone who defended Planned Parenthood today. I now know to never take any of your opinions seriously ever again.”\nIn any event, understand that America, like many an evil and decadent empire before it, is long overdue for a cleansing. Like it or not, the social conservatives were right, and the slippery slope they predicted, at which so many scoffed, appears to have been considerably understated.",
  "tags": [
    "Americana",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-15T08:38:00+00:00"
}