{
  "url": "https://voxday.net/2015/07/06/an-expert-on-overhyped-failure/",
  "scraped_at": "2025-12-16T13:02:16.619997",
  "title": "An expert on overhyped failure",
  "date_display": "July 6, 2015",
  "date_iso": "2015-07-06T19:29:00+00:00",
  "date_from_url": "2015-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sees similar problems <a href=\"http://www.reaxxion.com/10195/why-star-citizen-is-likely-going-to-be-a-complete-disaster\">on the horizon for Star Citizen</a>:</p><blockquote class=\"tr_bq\"><p> The problem that RSI is now faced with is something that us vets all saw coming a mile away. This level of exposure, all the press, the promises, the hype, the glorious anti-establishment chanting and rhetoric etc.: all of it has a very bad downside.</p><p>And it’s not like the rumblings haven’t been there. Every time there is new press about a funding milestone or yet another ship concept cash grab, there is some derogatory rhetoric associated with it because most backers are fed up and just want the game they were promised back in 2012.</p><p>Others are just waiting for the day when it all comes crashing down, so they can point, chuckle, and say they saw it coming.</p><p>And last I checked, some people had spent over $5,000 on this game. Even if you don’t want to believe that, believe this: they’ve raised about $85 million from 918,806 backers. That is an average of $92 per gamer.</p><p>A couple of weeks ago last month, when there was news about the FTC going after failed promises made by someone who crowdfunded a game, there were various discussions about the terrible precedent which would be set if this game failed to deliver and if a bunch of people reported it. And that’s no joke. We’re talking $85 million. That’s a lot of cash. Other people’s money.</p><p>If you spend $30 and get a generic game, you’ll post a bad review, tell all your friends etc. Eventually, you will move on. It happens. But in this instance, given all what has transpired, and all this money, gamers aren’t going to let it slide. Even if they lost $19.</p><p>No; they’re going to ask WTF happened to “all that money?“ because now it’s their money, not some faceless investor’s, or even a publisher.</p><p>And they’re going to be pissed because they expected more than a hangar and a largely buggy Arena Commander module which isn’t representative of the game they were pitched back in 2012, and which has to have been delivered two years later in Nov 2014.</p><p>As I’ve said before, I want this game to succeed for a lot of selfish reasons, least of all being that I funded it. I mostly want it to succeed because we don’t have any games like this in the genre, and not even my games can fill that void because they are super complex, pretty old, don’t look as pretty etc. You know, different budgets, different production values etc. And I really don’t care who makes it. All I know is that before I die, I want to play it. Is that too much to ask?</p><p>I also want it to succeed in whatever form because if it doesn’t,<br> it’s going to be another massive gamedev and videogame crowdfunding<br> black eye. I know people who are already rumbling that if this fails<br> that it is going to be more epic than the <a href=\"http://www.polygon.com/gaming/2012/5/17/3027762/curt-schillings-game-studio-struggles-to-stay-afloat\">collapse of 38 Studios in the Summer of 2012</a>. And that <a href=\"http://www.gamasutra.com/view/news/169444/38_Studios_Downfall_The_Gamasutra_Report.php\">$75 million was mostly tax-payer</a> money.  And almost three years now, that one is still playing out in the courts.</br></br></br></p><p>What I mean by this comparison is related to the following, all of<br> which happened to 38 Studios, it’s creators, primary execs, politicians<br> etc. and how the media handled it:</br></br></p><ul><li>The amount of public money raised is not something to ignore. Like<br> that studio’s sudden implosion in 2012, it’s a lot of money. The kind of<br> money that makes every lawyer, politician, analyst etc., perk up their<br> ears and try to get involved in the fray.</br></br></br></li><li>Given the number of studios working on this project worldwide, the<br> sudden loss of jobs would be catastrophic for some people, most of whom<br> had to relocate to get their jobs.</br></br></li><li>The hype surrounding this project since its 2012 inception is going<br> to guarantee that every media outlet is going to want a piece of the<br> action, and most of that is going to be based on sheer speculation,<br> wanton conjecture, bullshit anonymous “sources” etc., because the focus<br> would be on vilifying Chris and crew, rather than focusing on what<br> mistakes were made.</br></br></br></br></br></li></ul><p>And I need not even mention APB as another example.</p><div class=\"wp-caption alignnone\" id=\"attachment_10215\" style=\"width: 510px;\"></div><p>To add to the noise, there are reports that people (Travis Day, a<br> senior producer left recently) at RSI have been leaving, the executive<br> producer (!) <i><b>(UPDATE. It has been confirmed to me that Alex Mayberry, the Exec Producer, <a href=\"http://www.gamesindustry.biz/articles/2014-05-13-new-executive-producer-for-star-citizen\">hired a year ago</a>, is no longer at the company)</b></i> is on his way out, and they’re spending more than they’re bringing in because crowdfunding has peaked etc.</br></br></p><p>The understated economics of game development is quite simple. For as<br> long as I’ve been around, and seen so many projects fail because they<br> ran out of funds, you’d think that by now this is something every<br> developer and publisher would be aware of, and plan for it:</br></br></br></p><ul><li>If you’re spending $2 and bringing in $1, you’re in trouble.</li><li>If your studio is burning through $2 million a month, then you need<br> $24 million a year in funding. If you’re selling less than $2 million a<br> month, you’re in trouble.</br></br></li><li>If your studio has $24 million to make a game over a period of two<br> years, and you’re burning more than $1 million per month, you’re in<br> trouble.</br></br></li><li>If your budget is down to the wire, in that you don’t have a buffer<br> of at least 15% of your funds in reserve, and which you can use for<br> unforeseen expenses during development, you’re <i>asking</i> for trouble.</br></br></li></ul><p>None of the departures, delays etc. should necessarily be regarded as<br> a sign of trouble for the project. When you start to scale back or<br> hunker down, people leaving, delays, stuff getting cut etc. is all par<br> for the course. What you can expect though, for something of this scope,<br> is that it’s going to get scaled back. That’s assuming that it ever<br> sees the light of day.</br></br></br></br></br></p><p>And if they scale it back, that’s going back on promises. And when<br> that happens, it’s going to be a complete disaster. Guaranteed.</br></p><p>So to those of you who don’t know how this works, it doesn’t make any<br> sense to scream “failure” when you have no clue just what (a <i>lot</i>) goes into developing these games.</br></p><p>It may succeed, it may fail; but for now, all we can do is watch how it plays out. But given the <a href=\"http://www.eurogamer.net/articles/article_29857\">fiasco surrounding <i>Freelancer</i></a><i>—</i>the<br> other very ambitious game that Chris tried to make, and the<br> disappointment that was the final game as delivered versus what was<br> promised, after which Chris left the industry—we should all be worried.<br> Especially this time around, there’s no Electronic Arts and no Microsoft<br> to act as a tether, or for us to point the finger at and to hold<br> accountable.</br></br></br></br></br></br></p><p>For me, I already know—for a fact—that <i><b>they can’t build this game</b></i> they’ve pitched, and which I was looking forward to someone making.</p></blockquote><p>I’m concerned about this one too. I had a number of extensive conversations with Chris about this back when he had permission to use the Wing Commander license for it – we even discussed the possibility of using one of my AI designs for the wingmen – and I would really, really, really like to see it be successful too. Wing Commander is one of my all-time favorite games and I have very fond memories of it and of the man himself.</p><p>But the potential problem, as I see it, is that RSI got distracted by the unexpected level of success of their fund-raising efforts, and like many a charity before them, lost sight of their primary objective due to that success. This is understandable, of course, because fund-raising for a game this size is an absolute bitch for an independent, even one as well-regarded as Chris is. It takes an incredible amount of time and nineteen out of every twenty alleys eventually lead to a brick wall.</p><p>The positive side of limited resources is that it forces you to make the hard choices, you simply have no other option because you can’t do everything. I thought it was fantastic that Star Citizen managed to raise even more money than they were looking for to do Wing Commander, thinking that this was the dawn of a new funding model, but ironically enough, the very success of Star Citizen may lead to it being deemed a failure even if Chris manages to produce what would have been a very successful version of the $20 million project he originally envisioned, if it takes him $85 million to do it no one is going to be happy.</p><p>Because, as Derek Smart observes, everyone’s expectations have been raised. If it’s not the greatest game ever, if it doesn’t blow people away the way the original Wing Commander and Grand Theft Auto 5 did, it could end up having a crushing effect on game-related crowdfunding in the future.</p><p>For those of you who are too young, or too unfamiliar with the game industry, Battlecruiser 3000 AD was one of the most anticipated games of its day, but Derek never managed to deliver on its considerable promise, it had zero chance of ever living up to all the hype, and it is still, somewhat unfairly considering its relatively modest budget, (it’s rather shocking to discover that the budget was less than $650k) considered to be one of the great flops of the industry.</p><p>That being said, Derek is a smart guy and he would know about something being overhyped and unable to deliver on that hype.</p></div>",
  "content_text": "Sees similar problems\non the horizon for Star Citizen\n:\nThe problem that RSI is now faced with is something that us vets all saw coming a mile away. This level of exposure, all the press, the promises, the hype, the glorious anti-establishment chanting and rhetoric etc.: all of it has a very bad downside.\nAnd it’s not like the rumblings haven’t been there. Every time there is new press about a funding milestone or yet another ship concept cash grab, there is some derogatory rhetoric associated with it because most backers are fed up and just want the game they were promised back in 2012.\nOthers are just waiting for the day when it all comes crashing down, so they can point, chuckle, and say they saw it coming.\nAnd last I checked, some people had spent over $5,000 on this game. Even if you don’t want to believe that, believe this: they’ve raised about $85 million from 918,806 backers. That is an average of $92 per gamer.\nA couple of weeks ago last month, when there was news about the FTC going after failed promises made by someone who crowdfunded a game, there were various discussions about the terrible precedent which would be set if this game failed to deliver and if a bunch of people reported it. And that’s no joke. We’re talking $85 million. That’s a lot of cash. Other people’s money.\nIf you spend $30 and get a generic game, you’ll post a bad review, tell all your friends etc. Eventually, you will move on. It happens. But in this instance, given all what has transpired, and all this money, gamers aren’t going to let it slide. Even if they lost $19.\nNo; they’re going to ask WTF happened to “all that money?“ because now it’s their money, not some faceless investor’s, or even a publisher.\nAnd they’re going to be pissed because they expected more than a hangar and a largely buggy Arena Commander module which isn’t representative of the game they were pitched back in 2012, and which has to have been delivered two years later in Nov 2014.\nAs I’ve said before, I want this game to succeed for a lot of selfish reasons, least of all being that I funded it. I mostly want it to succeed because we don’t have any games like this in the genre, and not even my games can fill that void because they are super complex, pretty old, don’t look as pretty etc. You know, different budgets, different production values etc. And I really don’t care who makes it. All I know is that before I die, I want to play it. Is that too much to ask?\nI also want it to succeed in whatever form because if it doesn’t,\nit’s going to be another massive gamedev and videogame crowdfunding\nblack eye. I know people who are already rumbling that if this fails\nthat it is going to be more epic than the\ncollapse of 38 Studios in the Summer of 2012\n. And that\n$75 million was mostly tax-payer\nmoney.  And almost three years now, that one is still playing out in the courts.\nWhat I mean by this comparison is related to the following, all of\nwhich happened to 38 Studios, it’s creators, primary execs, politicians\netc. and how the media handled it:\nThe amount of public money raised is not something to ignore. Like\nthat studio’s sudden implosion in 2012, it’s a lot of money. The kind of\nmoney that makes every lawyer, politician, analyst etc., perk up their\nears and try to get involved in the fray.\nGiven the number of studios working on this project worldwide, the\nsudden loss of jobs would be catastrophic for some people, most of whom\nhad to relocate to get their jobs.\nThe hype surrounding this project since its 2012 inception is going\nto guarantee that every media outlet is going to want a piece of the\naction, and most of that is going to be based on sheer speculation,\nwanton conjecture, bullshit anonymous “sources” etc., because the focus\nwould be on vilifying Chris and crew, rather than focusing on what\nmistakes were made.\nAnd I need not even mention APB as another example.\nTo add to the noise, there are reports that people (Travis Day, a\nsenior producer left recently) at RSI have been leaving, the executive\nproducer (!)\n(UPDATE. It has been confirmed to me that Alex Mayberry, the Exec Producer,\nhired a year ago\n, is no longer at the company)\nis on his way out, and they’re spending more than they’re bringing in because crowdfunding has peaked etc.\nThe understated economics of game development is quite simple. For as\nlong as I’ve been around, and seen so many projects fail because they\nran out of funds, you’d think that by now this is something every\ndeveloper and publisher would be aware of, and plan for it:\nIf you’re spending $2 and bringing in $1, you’re in trouble.\nIf your studio is burning through $2 million a month, then you need\n$24 million a year in funding. If you’re selling less than $2 million a\nmonth, you’re in trouble.\nIf your studio has $24 million to make a game over a period of two\nyears, and you’re burning more than $1 million per month, you’re in\ntrouble.\nIf your budget is down to the wire, in that you don’t have a buffer\nof at least 15% of your funds in reserve, and which you can use for\nunforeseen expenses during development, you’re\nasking\nfor trouble.\nNone of the departures, delays etc. should necessarily be regarded as\na sign of trouble for the project. When you start to scale back or\nhunker down, people leaving, delays, stuff getting cut etc. is all par\nfor the course. What you can expect though, for something of this scope,\nis that it’s going to get scaled back. That’s assuming that it ever\nsees the light of day.\nAnd if they scale it back, that’s going back on promises. And when\nthat happens, it’s going to be a complete disaster. Guaranteed.\nSo to those of you who don’t know how this works, it doesn’t make any\nsense to scream “failure” when you have no clue just what (a\nlot\n) goes into developing these games.\nIt may succeed, it may fail; but for now, all we can do is watch how it plays out. But given the\nfiasco surrounding\nFreelancer\n—\nthe\nother very ambitious game that Chris tried to make, and the\ndisappointment that was the final game as delivered versus what was\npromised, after which Chris left the industry—we should all be worried.\nEspecially this time around, there’s no Electronic Arts and no Microsoft\nto act as a tether, or for us to point the finger at and to hold\naccountable.\nFor me, I already know—for a fact—that\nthey can’t build this game\nthey’ve pitched, and which I was looking forward to someone making.\nI’m concerned about this one too. I had a number of extensive conversations with Chris about this back when he had permission to use the Wing Commander license for it – we even discussed the possibility of using one of my AI designs for the wingmen – and I would really, really, really like to see it be successful too. Wing Commander is one of my all-time favorite games and I have very fond memories of it and of the man himself.\nBut the potential problem, as I see it, is that RSI got distracted by the unexpected level of success of their fund-raising efforts, and like many a charity before them, lost sight of their primary objective due to that success. This is understandable, of course, because fund-raising for a game this size is an absolute bitch for an independent, even one as well-regarded as Chris is. It takes an incredible amount of time and nineteen out of every twenty alleys eventually lead to a brick wall.\nThe positive side of limited resources is that it forces you to make the hard choices, you simply have no other option because you can’t do everything. I thought it was fantastic that Star Citizen managed to raise even more money than they were looking for to do Wing Commander, thinking that this was the dawn of a new funding model, but ironically enough, the very success of Star Citizen may lead to it being deemed a failure even if Chris manages to produce what would have been a very successful version of the $20 million project he originally envisioned, if it takes him $85 million to do it no one is going to be happy.\nBecause, as Derek Smart observes, everyone’s expectations have been raised. If it’s not the greatest game ever, if it doesn’t blow people away the way the original Wing Commander and Grand Theft Auto 5 did, it could end up having a crushing effect on game-related crowdfunding in the future.\nFor those of you who are too young, or too unfamiliar with the game industry, Battlecruiser 3000 AD was one of the most anticipated games of its day, but Derek never managed to deliver on its considerable promise, it had zero chance of ever living up to all the hype, and it is still, somewhat unfairly considering its relatively modest budget, (it’s rather shocking to discover that the budget was less than $650k) considered to be one of the great flops of the industry.\nThat being said, Derek is a smart guy and he would know about something being overhyped and unable to deliver on that hype.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-06T18:29:00+00:00"
}