{
  "url": "https://voxday.net/2015/07/19/another-kick-of-can/",
  "scraped_at": "2025-12-17T17:20:13.152270",
  "title": "Another kick of the can",
  "date_display": "July 19, 2015",
  "date_iso": "2015-07-19T10:34:00+00:00",
  "date_from_url": "2015-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The EU and the IMF managed, with extreme difficulty, to kick the can one more time than anyone thought they would be able to. But the cans keep getting bigger and heavier. And in the meantime,<a href=\"http://www.zerohedge.com/news/2015-07-18/paul-craig-roberts-greeces-lesson-russia\"> Paul Craig Roberts points out</a> that the financial powers’ savage treatment of the Greeks, and determination to wring them dry in order to avoid paying out on the losing derivative bets by their banks, is teaching countries outside the system that there is nothing in it for them.</p><blockquote class=\"tr_bq\"><p> When a member of the EU itself is being looted and driven into the ground by its compatriots, how can Russia, China, and Iran expect better treatment? If the West has no good will toward Greece, where is the West’s good will toward Russia?</p><p>The Greek government was forced to capitulate to the EU, despite the support it received from the referendum, because the Greeks relied on the good will of their European partners and underestimated the mendacity of the One Percent. The Greek government did not expect the merciless attitude of its fellow EU member governments. The Greek government actually thought that its expert analysis of the Greek debt situation and economy would carry weight in the negotiations. This expectation left the Greek government without a backup plan. The Greek government gave no thought to how to go about leaving the euro and putting in place a monetary and banking system independent of the euro. The lack of preparation for exit left the government with no alternative to the EU’s demands.</p><p>The termination of Greece’s fiscal sovereignty is what is in store for Italy, Spain, and Portugal, and eventually for France and Germany. As Jean-Claude Trichet, the former head of the European Central Bank said, the sovereign debt crisis signaled that it is time to bring Europe beyond a “strict concept of nationhood.” The next step in the centralization of Europe is political centralization. The Greek debt crisis is being used to establish the principle that being a member of the EU means that the country has lost its sovereignty.</p><p>The notion, prevalent in the Western financial media, that a solution has been imposed on the Greeks is nonsense. Nothing has been solved. The conditions to which the Greek government submitted make the debt even less payable. In a short time the issue will again be before us. As John Maynard Keynes made clear in 1936 and as every economist knows, driving down consumer incomes by cutting pensions, employment, wages, and social services, reduces consumer and investment demand, and thereby GDP, and results in large budget deficits that have to be covered by borrowing. Selling pubic assets to foreigners transfers the revenue flows out of the Greek economy into foreign hands.</p><p>Unregulated naked capitalism, has proven in the 21st century to be unable to produce economic growth anywhere in the West. Consequently, median family incomes are declining. Governments cover up the decline by underestimating inflation and by not counting as unemployed discouraged workers who, unable to find jobs, have ceased looking. By not counting discouraged workers the US is able to report a 5.2 percent rate of unemployment. Including discouraged workers brings the unemployment rate to 23.1 percent. A 23 percent rate of unemployment has nothing in common with economic recovery.</p><p>Even the language used in the West is deceptive. The Greek “bailout” does not bail out Greece. The bailout bails out the holders of Greek debt. Many of these holders are not Greece’s original creditors. What the “bailout” does is to make the New York hedge funds’ bet on the Greek debt pay off for the hedge funds. The bailout money goes not to Greece but to those who speculated on the debt being paid. According to news reports, Quantitative Easing by the ECB has been used to purchase Greek debt from the troubled banks that made the loans, so the debt issue is no longer a creditor issue.</p></blockquote><p>And so the world spirals closer to widespread violence. Having repeatedly ruled out the possibility of change through the ballot box, what else does that leave? Frankly, I’m a little surprised that the Greeks haven’t resorted to politics by other means yet.</p><p>ISIS has already brought the War in Iraq home to America. It seems highly unlikely that they will be the only ones to do so.</p><p>These actions by the global financial community smack of either desperation or provocation. I can’t tell if they actually want war – as Gen. Butler would say they do – or if their position is so precarious that they are willing to run the risk of war just to buy a little more time before the crash.</p><p>Either way, it doesn’t bode very well for the rest of us.</p></div>",
  "content_text": "The EU and the IMF managed, with extreme difficulty, to kick the can one more time than anyone thought they would be able to. But the cans keep getting bigger and heavier. And in the meantime,\nPaul Craig Roberts points out\nthat the financial powers’ savage treatment of the Greeks, and determination to wring them dry in order to avoid paying out on the losing derivative bets by their banks, is teaching countries outside the system that there is nothing in it for them.\nWhen a member of the EU itself is being looted and driven into the ground by its compatriots, how can Russia, China, and Iran expect better treatment? If the West has no good will toward Greece, where is the West’s good will toward Russia?\nThe Greek government was forced to capitulate to the EU, despite the support it received from the referendum, because the Greeks relied on the good will of their European partners and underestimated the mendacity of the One Percent. The Greek government did not expect the merciless attitude of its fellow EU member governments. The Greek government actually thought that its expert analysis of the Greek debt situation and economy would carry weight in the negotiations. This expectation left the Greek government without a backup plan. The Greek government gave no thought to how to go about leaving the euro and putting in place a monetary and banking system independent of the euro. The lack of preparation for exit left the government with no alternative to the EU’s demands.\nThe termination of Greece’s fiscal sovereignty is what is in store for Italy, Spain, and Portugal, and eventually for France and Germany. As Jean-Claude Trichet, the former head of the European Central Bank said, the sovereign debt crisis signaled that it is time to bring Europe beyond a “strict concept of nationhood.” The next step in the centralization of Europe is political centralization. The Greek debt crisis is being used to establish the principle that being a member of the EU means that the country has lost its sovereignty.\nThe notion, prevalent in the Western financial media, that a solution has been imposed on the Greeks is nonsense. Nothing has been solved. The conditions to which the Greek government submitted make the debt even less payable. In a short time the issue will again be before us. As John Maynard Keynes made clear in 1936 and as every economist knows, driving down consumer incomes by cutting pensions, employment, wages, and social services, reduces consumer and investment demand, and thereby GDP, and results in large budget deficits that have to be covered by borrowing. Selling pubic assets to foreigners transfers the revenue flows out of the Greek economy into foreign hands.\nUnregulated naked capitalism, has proven in the 21st century to be unable to produce economic growth anywhere in the West. Consequently, median family incomes are declining. Governments cover up the decline by underestimating inflation and by not counting as unemployed discouraged workers who, unable to find jobs, have ceased looking. By not counting discouraged workers the US is able to report a 5.2 percent rate of unemployment. Including discouraged workers brings the unemployment rate to 23.1 percent. A 23 percent rate of unemployment has nothing in common with economic recovery.\nEven the language used in the West is deceptive. The Greek “bailout” does not bail out Greece. The bailout bails out the holders of Greek debt. Many of these holders are not Greece’s original creditors. What the “bailout” does is to make the New York hedge funds’ bet on the Greek debt pay off for the hedge funds. The bailout money goes not to Greece but to those who speculated on the debt being paid. According to news reports, Quantitative Easing by the ECB has been used to purchase Greek debt from the troubled banks that made the loans, so the debt issue is no longer a creditor issue.\nAnd so the world spirals closer to widespread violence. Having repeatedly ruled out the possibility of change through the ballot box, what else does that leave? Frankly, I’m a little surprised that the Greeks haven’t resorted to politics by other means yet.\nISIS has already brought the War in Iraq home to America. It seems highly unlikely that they will be the only ones to do so.\nThese actions by the global financial community smack of either desperation or provocation. I can’t tell if they actually want war – as Gen. Butler would say they do – or if their position is so precarious that they are willing to run the risk of war just to buy a little more time before the crash.\nEither way, it doesn’t bode very well for the rest of us.",
  "tags": [
    "banks",
    "decline and fall",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-19T09:34:00+00:00"
}