{
  "url": "https://voxday.net/2015/07/04/ayn-rand-foresaw-world-war/",
  "scraped_at": "2025-12-16T13:01:56.747838",
  "title": "Ayn Rand foresaw World War T",
  "date_display": "July 4, 2015",
  "date_iso": "2015-07-04T06:00:00+00:00",
  "date_from_url": "2015-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Adam Hobbes explains why it’s <a href=\"http://www.reaxxion.com/10078/why-we-need-to-fight-against-transgender-acceptance\">necessary to resist</a> the SJW attempt to control the he/she language:<br/></p><blockquote><p> <i>“The uncontested absurdities of today are the accepted<br> slogans of tomorrow. They come to be accepted by degrees, by precedent,<br> by implication, by erosion, by default, by dint of constant pressure on<br> one side and constant retreat on the other—until the day when they are<br> suddenly declared to be the country’s official ideology.”</br></br></br></br></i><br> – Ayn Rand</br></p><p>The public debut of “Caitlyn” Jenner represents a watershed moment<br> for American culture. Though most have not realized it, Jenner’s coming<br> out party constitutes a significant “trial balloon” on the part of the<br> progressive left and the media. It is an attempt to cash in on years of<br> carefully managed <a href=\"http://www.latimes.com/nation/nationnow/la-na-south-carolina-dmv-transgender-20150422-story.html\">stories on transgender “discrimination,”</a> <a href=\"https://www.youtube.com/watch?v=Aqo9z6lp4GY\">sympathetic </a><a href=\"http://www.imdb.com/title/tt2070443/\">portrayals </a>of <a href=\"http://www.rottentomatoes.com/tv/3471/s01/\">transgender characters </a>in entertainment, and the generally successful campaign of the gay rights movement and social justice activists.</br></br></br></br></p><p>The goal is simple: normalize transgenderism to such an extent that<br> any criticism of the concept or its practitioners will not be tolerated.<br> They must not be allowed to succeed. Whether the silent majority of<br> Americans realize it or not, the transgender issue represents the last<br> best opportunity to turn the tide in the culture wars. Make no mistake:<br> the progressives are winning.</br></br></br></br></br></p><p>Twenty years ago a person could openly<br> criticize homosexuality. Today, thanks to the Supreme Court, people who<br> do not enthusiastically endorse gay marriage are branded as bigots, <a href=\"http://www.sfgate.com/opinion/saunders/article/Mozilla-CEO-Eich-caves-over-Prop-8-donation-5384029.php\">disqualified from high-profile business positions</a>, and generally dismissed as ignorant hicks whose views are outside of the scope of acceptable thought.</br></br></p></blockquote><p>Tolerance is not a virtue. Tolerance is “the sin of Jeroboam”. Tolerance is the little compromise that leads gradually  to intellectual obliteration.</p></div>",
  "content_text": "Adam Hobbes explains why it’s\nnecessary to resist\nthe SJW attempt to control the he/she language:\n“The uncontested absurdities of today are the accepted\nslogans of tomorrow. They come to be accepted by degrees, by precedent,\nby implication, by erosion, by default, by dint of constant pressure on\none side and constant retreat on the other—until the day when they are\nsuddenly declared to be the country’s official ideology.”\n– Ayn Rand\nThe public debut of “Caitlyn” Jenner represents a watershed moment\nfor American culture. Though most have not realized it, Jenner’s coming\nout party constitutes a significant “trial balloon” on the part of the\nprogressive left and the media. It is an attempt to cash in on years of\ncarefully managed\nstories on transgender “discrimination,”\nsympathetic\nportrayals\nof\ntransgender characters\nin entertainment, and the generally successful campaign of the gay rights movement and social justice activists.\nThe goal is simple: normalize transgenderism to such an extent that\nany criticism of the concept or its practitioners will not be tolerated.\nThey must not be allowed to succeed. Whether the silent majority of\nAmericans realize it or not, the transgender issue represents the last\nbest opportunity to turn the tide in the culture wars. Make no mistake:\nthe progressives are winning.\nTwenty years ago a person could openly\ncriticize homosexuality. Today, thanks to the Supreme Court, people who\ndo not enthusiastically endorse gay marriage are branded as bigots,\ndisqualified from high-profile business positions\n, and generally dismissed as ignorant hicks whose views are outside of the scope of acceptable thought.\nTolerance is not a virtue. Tolerance is “the sin of Jeroboam”. Tolerance is the little compromise that leads gradually  to intellectual obliteration.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-04T05:00:00+00:00"
}