{
  "url": "https://voxday.net/2015/07/20/do-not-buy-this-book/",
  "scraped_at": "2025-12-17T17:20:18.581765",
  "title": "Do not buy this book",
  "date_display": "July 20, 2015",
  "date_iso": "2015-07-20T11:14:00+00:00",
  "date_from_url": "2015-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://2.bp.blogspot.com/--QiTsNYSHl4/VazTj3JFvII/AAAAAAAABYg/iSW0GO8zR4M/s1600/BLaS_480.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/07/BLaS_480.jpg\" width=\"200\"/></a></div><p>If you are not a serious – and by serious I mean VERY VERY SERIOUS – Gene Wolfe fan. Some months ago, I was contacted by an author with perhaps the most insanely ambitious and least marketable submission I had ever imagined. He was in the process of writing a complete literary analysis of every short story and novel that Gene Wolfe had ever written. He said it ran about 800 pages… and that was just Volume One. Since I am a fan (although I have subsequently learned not a sufficiently <i>serious</i> fan), of Gene Wolfe, I decided that we would publish it if Mr. Wolfe was amenable. So, I called him up, told him about the project, and after he stopped laughing, he said that he had no objections so long as we sent him a copy when it came out. He also asked who the author was, and when I told him the author’s name, there was a brief moment of silence on the other end of the line.</p><p>“I’ve met him,” he said. “You know, he didn’t <i>seem </i>like a lunatic.”</p><p>In any event, <a href=\"http://www.amazon.com/Between-Light-Shadow-Exploration-Fiction-ebook/dp/B011YTDGY2\"><i><b>Between Light and Shadow: An Exploration of the Fiction of Gene Wolfe, 1951-1986</b></i></a> is now available <a href=\"http://www.amazon.com/Between-Light-Shadow-Exploration-Fiction-ebook/dp/B011YTDGY2\">on Amazon</a> and <a href=\"http://www.castaliahouse.com/downloads/between-light-and-shadow/\">at Castalia House</a>. It is 828 pages, retails for $6.99, and features a foreword by Gene Wolfe fan John C. Wright. From the Foreword:</p><blockquote class=\"tr_bq\"><p> He is the only author I admire without ever daring to emulate, because his skill exceeds my own too greatly. I boldly claim that he is not the greatest living science fiction author, only because he is the greatest living author writing in any genre. In scope, in craftsmanship, in capturing nuances of dialog, in skill of approaching the central mysteries of the human condition, and of putting into words what never can be put into words, he had no equal, and, save perhaps for Cordwainer Smith, no serious competitor. He is that skilled.</p><p>One line is sufficient to show the subtlety of his writing: “The great question…is determining what these symbols mean in and of themselves. We are like children who look at print and see a serpent in the last letter but one, and a sword in the last.” At the risk of spoiling the jest, I direct your attention to the last letter but one in that sentence, where you can see a serpent in the s, and a sword in the t in the last. His whole work is as cunningly contrived.</p><p>One line? One name. To pick one trifle out of the treasure house, is anyone else amused that the fencing master in the city of Viron, where all men are named for living things, is called Xiphias? Xiphias is the archaic name for swordfish. What other fish does one name a fencing master after?</p></blockquote><p>Seriously, though, this book is esoteric beyond belief. If you’re just a casual fan of Gene Wolfe, I guarantee it will go completely over your head. If you’re not a fan of Gene Wolfe, don’t even think of reading this, go read Wolfe instead. And if you’re one of the 200 potential readers of this book, you’re probably not reading this post, you’re already ordering it on Amazon. So I may as well stop here with the note that the second volume, <i><b>Beyond Time and Memory: An Exploration of the Fiction of Gene Wolfe, 1987-2015</b></i>, will be published by Castalia House next year.</p></div>",
  "content_text": "If you are not a serious – and by serious I mean VERY VERY SERIOUS – Gene Wolfe fan. Some months ago, I was contacted by an author with perhaps the most insanely ambitious and least marketable submission I had ever imagined. He was in the process of writing a complete literary analysis of every short story and novel that Gene Wolfe had ever written. He said it ran about 800 pages… and that was just Volume One. Since I am a fan (although I have subsequently learned not a sufficiently\nserious\nfan), of Gene Wolfe, I decided that we would publish it if Mr. Wolfe was amenable. So, I called him up, told him about the project, and after he stopped laughing, he said that he had no objections so long as we sent him a copy when it came out. He also asked who the author was, and when I told him the author’s name, there was a brief moment of silence on the other end of the line.\n“I’ve met him,” he said. “You know, he didn’t\nseem\nlike a lunatic.”\nIn any event,\nBetween Light and Shadow: An Exploration of the Fiction of Gene Wolfe, 1951-1986\nis now available\non Amazon\nand\nat Castalia House\n. It is 828 pages, retails for $6.99, and features a foreword by Gene Wolfe fan John C. Wright. From the Foreword:\nHe is the only author I admire without ever daring to emulate, because his skill exceeds my own too greatly. I boldly claim that he is not the greatest living science fiction author, only because he is the greatest living author writing in any genre. In scope, in craftsmanship, in capturing nuances of dialog, in skill of approaching the central mysteries of the human condition, and of putting into words what never can be put into words, he had no equal, and, save perhaps for Cordwainer Smith, no serious competitor. He is that skilled.\nOne line is sufficient to show the subtlety of his writing: “The great question…is determining what these symbols mean in and of themselves. We are like children who look at print and see a serpent in the last letter but one, and a sword in the last.” At the risk of spoiling the jest, I direct your attention to the last letter but one in that sentence, where you can see a serpent in the s, and a sword in the t in the last. His whole work is as cunningly contrived.\nOne line? One name. To pick one trifle out of the treasure house, is anyone else amused that the fencing master in the city of Viron, where all men are named for living things, is called Xiphias? Xiphias is the archaic name for swordfish. What other fish does one name a fencing master after?\nSeriously, though, this book is esoteric beyond belief. If you’re just a casual fan of Gene Wolfe, I guarantee it will go completely over your head. If you’re not a fan of Gene Wolfe, don’t even think of reading this, go read Wolfe instead. And if you’re one of the 200 potential readers of this book, you’re probably not reading this post, you’re already ordering it on Amazon. So I may as well stop here with the note that the second volume,\nBeyond Time and Memory: An Exploration of the Fiction of Gene Wolfe, 1987-2015\n, will be published by Castalia House next year.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-20T10:14:00+00:00"
}