{
  "url": "https://voxday.net/2015/07/21/everyone-hates-gawker/",
  "scraped_at": "2025-12-17T17:20:25.855158",
  "title": "Everyone hates Gawker",
  "date_display": "July 21, 2015",
  "date_iso": "2015-07-21T10:27:00+00:00",
  "date_from_url": "2015-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://img04.deviantart.net/453c/i/2015/200/7/5/gamergate_life_52_by_kukuruyoart-d91yexi.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"386\" src=\"http://img04.deviantart.net/453c/i/2015/200/7/5/gamergate_life_52_by_kukuruyoart-d91yexi.png\" width=\"640\"/></a></div><p> Because other than occasionally sending emails to their dwindling pool of advertisers, I pay no attention to <i>Gawker</i>, I completely missed the fact that <a href=\"https://archive.is/AgLFS\">the Gawker Review of Books addressed the Puppies</a> and the Gallo attack in <i>Gawker’s </i>inimitable – and yes, libelous – style back in June.</p><blockquote class=\"tr_bq\"><p> The Sad Puppies are also closely associated with neoreactionary, Gamergater, and notorious white supremacist Vox Day (he says he’s not a white supremacist, but he also says “Racism is neither a sin nor is it a societal evil. Race-based self-segregation is not only the observably preferred human norm for all races throughout the entirety of recorded human history, it is inevitable,” so go ahead and draw your own conclusions) who both played a part in picking the Sad Puppies nominees and started his own Rabid Puppies slate. Coincidentally, a number of the Rabid Puppies nominees have been published by Day’s obscure, Finland-based publishing house, Castalia House.</p><p>“I don’t mind being linked to Vox, because I don’t hate and fear Vox like a little schoolgirl who’s been stung by a wasp,” Torgersen has written.</p><p>And that’s who the most powerful publisher in sci-fi apparently decided to appease at the expense of one of its own employees.</p><p>But why?</p><p>Puppy supporters have been talking shit about Tor from the beginning of their campaign, largely because Tor editors Patrick and Teresa Nielsen Hayden have been openly critical, and were among the first to note that Gamergate and the Puppies were making common cause. In April, Larry Correia, who started and named the original Sad Puppies campaign two years ago, had to tell Puppies supporters to chill out with their attacks on the publisher, because—as Tom Doherty also pointed out—Tor has published Puppy favorites like John C. Wright. Wright rode the Puppies slates to a record-breaking six Hugo nominations this year.</p><p>The frenzy started again last week, though, when Vox Day reignited it with a screencap of Irene Gallo’s Facebook comments, calling them “libel.” (He calls a lot of things libel.)</p></blockquote><p>I don’t call “a lot of things libel”. I simply happen to be libeled on a regular basis by liars in the media at places like <i>Gawker </i>and <i>The Guardian</i>. For example, I’m not a “white supremacist”, I am a “red reservationist” who supports the right of my tribe and others to keep our racially segregated reservations established by treaty with the U.S. Federal Government.</p><p>If Jay Hathaway opposes the right of Native Americans to retain their racially segregated reservations, then he should come right out and say it. And he should also apologize for libeling me and correct his piece. But I won’t hold my breath; <i>Gawker </i>may well be history once Hulk Hogan gets through with them.</p><p>And notice classic SJW inversion at work. The Puppy supporters have been “talking shit about Tor” because Tor editor Patrick Nielsen Hayden and FORMER Tor editor Teresa Nielsen Hayden, to say nothing of various Torlings, have been “talking shit” about various Puppies for more than ten years now.</p></div>",
  "content_text": "Because other than occasionally sending emails to their dwindling pool of advertisers, I pay no attention to\nGawker\n, I completely missed the fact that\nthe Gawker Review of Books addressed the Puppies\nand the Gallo attack in\nGawker’s\ninimitable – and yes, libelous – style back in June.\nThe Sad Puppies are also closely associated with neoreactionary, Gamergater, and notorious white supremacist Vox Day (he says he’s not a white supremacist, but he also says “Racism is neither a sin nor is it a societal evil. Race-based self-segregation is not only the observably preferred human norm for all races throughout the entirety of recorded human history, it is inevitable,” so go ahead and draw your own conclusions) who both played a part in picking the Sad Puppies nominees and started his own Rabid Puppies slate. Coincidentally, a number of the Rabid Puppies nominees have been published by Day’s obscure, Finland-based publishing house, Castalia House.\n“I don’t mind being linked to Vox, because I don’t hate and fear Vox like a little schoolgirl who’s been stung by a wasp,” Torgersen has written.\nAnd that’s who the most powerful publisher in sci-fi apparently decided to appease at the expense of one of its own employees.\nBut why?\nPuppy supporters have been talking shit about Tor from the beginning of their campaign, largely because Tor editors Patrick and Teresa Nielsen Hayden have been openly critical, and were among the first to note that Gamergate and the Puppies were making common cause. In April, Larry Correia, who started and named the original Sad Puppies campaign two years ago, had to tell Puppies supporters to chill out with their attacks on the publisher, because—as Tom Doherty also pointed out—Tor has published Puppy favorites like John C. Wright. Wright rode the Puppies slates to a record-breaking six Hugo nominations this year.\nThe frenzy started again last week, though, when Vox Day reignited it with a screencap of Irene Gallo’s Facebook comments, calling them “libel.” (He calls a lot of things libel.)\nI don’t call “a lot of things libel”. I simply happen to be libeled on a regular basis by liars in the media at places like\nGawker\nand\nThe Guardian\n. For example, I’m not a “white supremacist”, I am a “red reservationist” who supports the right of my tribe and others to keep our racially segregated reservations established by treaty with the U.S. Federal Government.\nIf Jay Hathaway opposes the right of Native Americans to retain their racially segregated reservations, then he should come right out and say it. And he should also apologize for libeling me and correct his piece. But I won’t hold my breath;\nGawker\nmay well be history once Hulk Hogan gets through with them.\nAnd notice classic SJW inversion at work. The Puppy supporters have been “talking shit about Tor” because Tor editor Patrick Nielsen Hayden and FORMER Tor editor Teresa Nielsen Hayden, to say nothing of various Torlings, have been “talking shit” about various Puppies for more than ten years now.",
  "tags": [
    "#GamerGate",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-21T09:27:00+00:00"
}