{
  "url": "https://voxday.net/2015/07/31/gamergate-isnt-over/",
  "scraped_at": "2025-12-17T17:21:35.264299",
  "title": "#GamerGate is far from over",
  "date_display": "July 31, 2015",
  "date_iso": "2015-07-31T08:38:00+00:00",
  "date_from_url": "2015-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When I think about how much I used to love going to CGDC in Santa Clara, <a href=\"https://archive.is/q1gdG#selection-1633.0-1659.296\">this news</a> just infuriates me.</p><blockquote class=\"tr_bq\"><p> UBM Tech Game Network, the organizers of the Game Developers Conference 2016, are now accepting submissions to present lectures, roundtables, panels, posters and tutorials through Thursday, August 27th.</p><p>Now entering its landmark 30th edition, GDC is expanding its Advisory Board, which reviews and refines submissions for the event, by welcoming pioneering developer Amy Hennig to help guide the content of the show….</p><p>GDC is the world’s largest and longest-running event serving professionals dedicated to the art and science of making games, hosting thousands of game developers from around the world for a week of learning, networking and inspiration. GDC 2016 will take place March 14th-18th at the Moscone Convention Center in San Francisco, California.</p><p>For the main conference, the GDC Advisory Board is considering session submissions for seven tracks: Audio, Design, Production, Programming, Visual Arts, and the Business, Marketing &amp; Management track,  as well as a track on Advocacy, which covers social issues from diversity to quality of life.</p></blockquote><p>Amy Hennig isn’t the problem. She’s no Social Justice Cabbage Patch Kid like Sarkeesian or Alexander, she’s a longtime dev and she knows what she’s doing, having been responsible for the <i>Legacy of Kain</i> and <i>Uncharted </i>series. What is infuriating is the fact that the conference organizers added a track on “Advocacy, which covers social issues from diversity to quality of life.” Which, you’ll note, is something that directly interferes with “the art and science of making games”.</p><p>Both GDC and GDCE already have the huge problem of having largely been taken over by the shills and the marketeers. I’ve actually heard of talks that have been rejected <i>because the technology isn’t implemented in a game yet</i>. Back in the day, learning about new technology and techniques is exactly what we went to CGDC for! No wonder fewer and fewer senior designers and developers are attending, what is the point if you can’t learn about new tech ahead of time and you’re going to get lectured by clueless non-developers about putting their politics in your games?</p><p>I’ve designed six games this year, have three development, and will ship two. And I have less than zero professional interest in anything even remotely related to social issues.</p><p>I hope the baleful eye of #GamerGate will turn on the UBM Tech Game Network and make it clear that the game industry is no place for Advocacy.</p></div>",
  "content_text": "When I think about how much I used to love going to CGDC in Santa Clara,\nthis news\njust infuriates me.\nUBM Tech Game Network, the organizers of the Game Developers Conference 2016, are now accepting submissions to present lectures, roundtables, panels, posters and tutorials through Thursday, August 27th.\nNow entering its landmark 30th edition, GDC is expanding its Advisory Board, which reviews and refines submissions for the event, by welcoming pioneering developer Amy Hennig to help guide the content of the show….\nGDC is the world’s largest and longest-running event serving professionals dedicated to the art and science of making games, hosting thousands of game developers from around the world for a week of learning, networking and inspiration. GDC 2016 will take place March 14th-18th at the Moscone Convention Center in San Francisco, California.\nFor the main conference, the GDC Advisory Board is considering session submissions for seven tracks: Audio, Design, Production, Programming, Visual Arts, and the Business, Marketing & Management track,  as well as a track on Advocacy, which covers social issues from diversity to quality of life.\nAmy Hennig isn’t the problem. She’s no Social Justice Cabbage Patch Kid like Sarkeesian or Alexander, she’s a longtime dev and she knows what she’s doing, having been responsible for the\nLegacy of Kain\nand\nUncharted\nseries. What is infuriating is the fact that the conference organizers added a track on “Advocacy, which covers social issues from diversity to quality of life.” Which, you’ll note, is something that directly interferes with “the art and science of making games”.\nBoth GDC and GDCE already have the huge problem of having largely been taken over by the shills and the marketeers. I’ve actually heard of talks that have been rejected\nbecause the technology isn’t implemented in a game yet\n. Back in the day, learning about new technology and techniques is exactly what we went to CGDC for! No wonder fewer and fewer senior designers and developers are attending, what is the point if you can’t learn about new tech ahead of time and you’re going to get lectured by clueless non-developers about putting their politics in your games?\nI’ve designed six games this year, have three development, and will ship two. And I have less than zero professional interest in anything even remotely related to social issues.\nI hope the baleful eye of #GamerGate will turn on the UBM Tech Game Network and make it clear that the game industry is no place for Advocacy.",
  "tags": [
    "#GamerGate",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-31T07:38:00+00:00"
}