{
  "url": "https://voxday.net/2015/07/08/george-martin-opposes-tor-boyco/",
  "scraped_at": "2025-12-16T13:02:30.664551",
  "title": "George Martin opposes the Tor boycott",
  "date_display": "July 8, 2015",
  "date_iso": "2015-07-08T12:00:00+00:00",
  "date_from_url": "2015-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Rape Rape Martin takes time out of his daily fetish-writing <a href=\"http://grrm.livejournal.com/431905.html\">to urge everyone  to oppose the Tor boycott</a>, which is totally irrelevant and futile and doesn’t matter in the slightest, which is <i>precisely </i>why it must be denounced and opposed. It’s frankly a shame that he’s been distracted in this way, as old RapeSquared had been working on a smashing scene involving the violation of Arya Stark wearing the face of Cersei Lannister by two Sparrows, seven nuns, Ser Robert Strong, and King Tomas’s adopted kitten. It was really going to blow everyone’s socks off when <i>West of Eros: The Epic Rapes of George R. R. Martin </i>appears in 2017.</p><blockquote class=\"tr_bq\"><p> In one of the more recent developments, the Rabid Puppies and some of their allies and fellow travellers have declared a boycott of Tor Books. I say “Rabid” here because Beale is backing the boycott, while Larry Correia says the Sad Puppies are not boycotting anyone… though Correia and some of the other Sads certainly seem deeply sympathetic to the boycott.</p><p>I am not, needless to say. Neither is most of fandom.</p><p>Which makes this a perfect time to BUY SOME TOR BOOKS!!</p><p>So if you would like to strike a blow for free speech and decency, and support all the good people at Tor, go ye forth and buy a book today… from the Cocteau, or Amazon, or anywhere… and let your voice be heard.</p><p>[Martin adds in the comments:] “The Tor boycott is an ugly attempt to try and cost some good people their jobs. It needs to be denounced and opposed.”</p></blockquote><p>Good people? On what planet can the likes of lying, libelous, Code of Conduct-violating individuals such as Irene Gallo and Patrick Nielsen Hayden be reasonably described as “good people”? Observably not this one. And as for the “free speech and decency” Martin claims to be defending, let’s recall the speech itself:</p><p><i> “There are two extreme right-wing to neo-nazi groups, called the Sad<br> Puppies and the Rabid Puppies respectively, that are calling for the end<br> of social justice in science fiction and fantasy. They are<br> unrepentantly racist, sexist and homophobic. A noisy few but they’ve<br> been able to gather some Gamergate folks around them and elect a slate<br> of bad-to-reprehensible works on this year’s Hugo ballot.”</br></br></br></br></br></i><br> – Irene Gallo, Creative Director of Tor Books and Associate Publisher of Tor.com</br></p><p>That is a clear and undeniable violation on several counts of the Macmillan Code of Conduct. It is a completely unprovoked, absolutely unprofessional attack on Tor’s customers as well as several of Tor’s own authors. If Irene Gallo was a fry cook at McDonalds or a minimum-wage greeter at Walmart, she’d be gone already, and it is as disingenuous as it is stupid to pretend otherwise.</p><p>RapeSquared was promptly called on his little omissions by a few of his readers and didn’t hesitate to take some liberties with the facts. Because, after all, George Martin is an SJW, and <i>SJWs always lie.</i></p><blockquote class=\"tr_bq\"><p> lordevaco<br> Jul. 7th, 2015 09:00 pm (UTC)<br> I just thought it was weird to leave out why there is a boycott in the first place, so I googled it. I didn’t even know about it, but apparently it’s because someone at Tor denounced all of them as “neo-Nazis” and “unrepentantly racist, misogynist, and homophobic” and Tor didn’t do anything about it.</br></br></p><p>That’s not cool at all either.</p><p>grrm<br> Jul. 7th, 2015 10:45 pm (UTC)<br> <i>If you googled it, you should also have read that not one but TWO apologies were issued for that tweet, one by the person who posted it, one by the publisher of Tor. That should have closed the book on the affair. Instead we have a boycott and calls for firings.</i></br></br></p><p>And I have yet to see anyone on the Puppy side apologize for anything, though their name-calling has far exceeded that coming from the fans.</p><p>lumbridge<br> Jul. 8th, 2015 12:43 am (UTC)<br> Why are the sad puppies boycotting Tor books? By the way which fantasy titles would you recommend that Tor publishes?</br></br></p><p>grrm<br> Jul. 8th, 2015 01:27 am (UTC)<br> <i>It’s the Rabid Puppies boycotting Tor, not the Sads. Plus some unaffiliated or semi-affiliated allies.</i></br></br></p><p>I will not attempt to explain the whole thing. In a nutshell, a Tor employee categorized the Puppies in a nasty way, some of them got outraged and demanded an apology, an apology was issued, but the Rabids decided that was not enough and now want resignations and firings. (Which they are never going to get, by the way). </p></blockquote><p>We’ll see. Corporate actions tend to move along very slowly and then happen all at once. Macmillan’s CEO just returned from his sabbatical this week and I have been directly informed by a Macmillan executive that no decision on how to address the situation has yet been made. And while I suppose it is possible that Mr. Sargent could simply throw out the company Code of Conduct in order to retain the services of an arrogant, entitled employee who believes she can treat his company’s customers and authors with total contempt and still retain her job, I tend to doubt it.</p><p>I will not be even remotely surprised if both Ms Gallo and Mr. Nielsen Hayden leave Tor Books in the near future. Macmillan quite clearly had no idea what sort of inmate-run asylum it has on its hands, and it’s not surprising that it would take a little time for them to figure out what needs to be done in order to set it straight.</p><p>If it were my problem, I would clean house. After all, how many of the big SF/F franchises of the last 20 years has the biggest publisher in SF/F published? If one considers how hit SF/F franchises Tor Books has missed on, including Martin’s ASOIAF, it’s not as if their management team can considered irreplaceable. But it’s not my problem and not my decision. I’m simply not going to buy any Tor Books, not even those written by the excellent Mr. Wright, while Irene Gallo and Patrick Nielsen Hayden are still employed there.</p></div>",
  "content_text": "George Rape Rape Martin takes time out of his daily fetish-writing\nto urge everyone  to oppose the Tor boycott\n, which is totally irrelevant and futile and doesn’t matter in the slightest, which is\nprecisely\nwhy it must be denounced and opposed. It’s frankly a shame that he’s been distracted in this way, as old RapeSquared had been working on a smashing scene involving the violation of Arya Stark wearing the face of Cersei Lannister by two Sparrows, seven nuns, Ser Robert Strong, and King Tomas’s adopted kitten. It was really going to blow everyone’s socks off when\nWest of Eros: The Epic Rapes of George R. R. Martin\nappears in 2017.\nIn one of the more recent developments, the Rabid Puppies and some of their allies and fellow travellers have declared a boycott of Tor Books. I say “Rabid” here because Beale is backing the boycott, while Larry Correia says the Sad Puppies are not boycotting anyone… though Correia and some of the other Sads certainly seem deeply sympathetic to the boycott.\nI am not, needless to say. Neither is most of fandom.\nWhich makes this a perfect time to BUY SOME TOR BOOKS!!\nSo if you would like to strike a blow for free speech and decency, and support all the good people at Tor, go ye forth and buy a book today… from the Cocteau, or Amazon, or anywhere… and let your voice be heard.\n[Martin adds in the comments:] “The Tor boycott is an ugly attempt to try and cost some good people their jobs. It needs to be denounced and opposed.”\nGood people? On what planet can the likes of lying, libelous, Code of Conduct-violating individuals such as Irene Gallo and Patrick Nielsen Hayden be reasonably described as “good people”? Observably not this one. And as for the “free speech and decency” Martin claims to be defending, let’s recall the speech itself:\n“There are two extreme right-wing to neo-nazi groups, called the Sad\nPuppies and the Rabid Puppies respectively, that are calling for the end\nof social justice in science fiction and fantasy. They are\nunrepentantly racist, sexist and homophobic. A noisy few but they’ve\nbeen able to gather some Gamergate folks around them and elect a slate\nof bad-to-reprehensible works on this year’s Hugo ballot.”\n– Irene Gallo, Creative Director of Tor Books and Associate Publisher of Tor.com\nThat is a clear and undeniable violation on several counts of the Macmillan Code of Conduct. It is a completely unprovoked, absolutely unprofessional attack on Tor’s customers as well as several of Tor’s own authors. If Irene Gallo was a fry cook at McDonalds or a minimum-wage greeter at Walmart, she’d be gone already, and it is as disingenuous as it is stupid to pretend otherwise.\nRapeSquared was promptly called on his little omissions by a few of his readers and didn’t hesitate to take some liberties with the facts. Because, after all, George Martin is an SJW, and\nSJWs always lie.\nlordevaco\nJul. 7th, 2015 09:00 pm (UTC)\nI just thought it was weird to leave out why there is a boycott in the first place, so I googled it. I didn’t even know about it, but apparently it’s because someone at Tor denounced all of them as “neo-Nazis” and “unrepentantly racist, misogynist, and homophobic” and Tor didn’t do anything about it.\nThat’s not cool at all either.\ngrrm\nJul. 7th, 2015 10:45 pm (UTC)\nIf you googled it, you should also have read that not one but TWO apologies were issued for that tweet, one by the person who posted it, one by the publisher of Tor. That should have closed the book on the affair. Instead we have a boycott and calls for firings.\nAnd I have yet to see anyone on the Puppy side apologize for anything, though their name-calling has far exceeded that coming from the fans.\nlumbridge\nJul. 8th, 2015 12:43 am (UTC)\nWhy are the sad puppies boycotting Tor books? By the way which fantasy titles would you recommend that Tor publishes?\ngrrm\nJul. 8th, 2015 01:27 am (UTC)\nIt’s the Rabid Puppies boycotting Tor, not the Sads. Plus some unaffiliated or semi-affiliated allies.\nI will not attempt to explain the whole thing. In a nutshell, a Tor employee categorized the Puppies in a nasty way, some of them got outraged and demanded an apology, an apology was issued, but the Rabids decided that was not enough and now want resignations and firings. (Which they are never going to get, by the way).\nWe’ll see. Corporate actions tend to move along very slowly and then happen all at once. Macmillan’s CEO just returned from his sabbatical this week and I have been directly informed by a Macmillan executive that no decision on how to address the situation has yet been made. And while I suppose it is possible that Mr. Sargent could simply throw out the company Code of Conduct in order to retain the services of an arrogant, entitled employee who believes she can treat his company’s customers and authors with total contempt and still retain her job, I tend to doubt it.\nI will not be even remotely surprised if both Ms Gallo and Mr. Nielsen Hayden leave Tor Books in the near future. Macmillan quite clearly had no idea what sort of inmate-run asylum it has on its hands, and it’s not surprising that it would take a little time for them to figure out what needs to be done in order to set it straight.\nIf it were my problem, I would clean house. After all, how many of the big SF/F franchises of the last 20 years has the biggest publisher in SF/F published? If one considers how hit SF/F franchises Tor Books has missed on, including Martin’s ASOIAF, it’s not as if their management team can considered irreplaceable. But it’s not my problem and not my decision. I’m simply not going to buy any Tor Books, not even those written by the excellent Mr. Wright, while Irene Gallo and Patrick Nielsen Hayden are still employed there.",
  "tags": [
    "freakshow",
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-08T11:00:00+00:00"
}