{
  "url": "https://voxday.net/2015/07/14/good-news-for-rebels/",
  "scraped_at": "2025-12-16T13:03:15.472738",
  "title": "Good news for rebels",
  "date_display": "July 14, 2015",
  "date_iso": "2015-07-14T12:00:00+00:00",
  "date_from_url": "2015-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Considering that the US military is in the process of running exercises to practice fighting against the American people, <a href=\"http://www.washingtonpost.com/politics/pentagon-to-allow-transgender-members-to-serve-openly/2015/07/13/fe9b054a-298d-11e5-a5ea-cf74396e59ec_story.html\">this announcement is probably good news</a> for the millions of Americans who have been gunning up for the past decade:</p><blockquote class=\"tr_bq\"><p> The Pentagon announced Monday that it will allow transgender members of the military to serve openly starting next year, marking an end to a long-standing policy that barred them from the armed forces.</p><p>In an echo of the Defense Department’s repeal of the ban on gays in uniform four years ago, Defense Secretary Ashton B. Carter said he had directed the armed forces to devise new rules over the next six months that would allow transgender troops to serve, except in situations “where objective, practical impediments are identified.”</p><p>“We must ensure that everyone who’s able and willing to serve has the full and equal opportunity to do so, and we must treat all our people with the dignity and respect they deserve,” Carter said in a statement. He called the military’s current regulations “outdated” and said they were “causing uncertainty that distracts commanders from our core missions.”</p><p>Carter also issued a directive that would make it more difficult to discharge transgender personnel over the next six months while the new rules are being established, requiring all such cases to be reviewed by a senior Pentagon official. The Pentagon took a similar interim approach to freeze the discharges of gay troops while it was preparing to lift that ban five years ago.</p></blockquote><p>As an added bonus, we should stop hearing about there being too few women in the Navy SEALs and other elite forces. Just put a few of them in dresses, call them ladies, and the problem, such as it is, is solved.</p><p>One thing I didn’t realize when reading about the historical collapse of empires is how damned <i>farcical </i>it is. Heinlein’s Crazy Years are upon us, and they are considerably crazier than he’d ever imagined.</p></div>",
  "content_text": "Considering that the US military is in the process of running exercises to practice fighting against the American people,\nthis announcement is probably good news\nfor the millions of Americans who have been gunning up for the past decade:\nThe Pentagon announced Monday that it will allow transgender members of the military to serve openly starting next year, marking an end to a long-standing policy that barred them from the armed forces.\nIn an echo of the Defense Department’s repeal of the ban on gays in uniform four years ago, Defense Secretary Ashton B. Carter said he had directed the armed forces to devise new rules over the next six months that would allow transgender troops to serve, except in situations “where objective, practical impediments are identified.”\n“We must ensure that everyone who’s able and willing to serve has the full and equal opportunity to do so, and we must treat all our people with the dignity and respect they deserve,” Carter said in a statement. He called the military’s current regulations “outdated” and said they were “causing uncertainty that distracts commanders from our core missions.”\nCarter also issued a directive that would make it more difficult to discharge transgender personnel over the next six months while the new rules are being established, requiring all such cases to be reviewed by a senior Pentagon official. The Pentagon took a similar interim approach to freeze the discharges of gay troops while it was preparing to lift that ban five years ago.\nAs an added bonus, we should stop hearing about there being too few women in the Navy SEALs and other elite forces. Just put a few of them in dresses, call them ladies, and the problem, such as it is, is solved.\nOne thing I didn’t realize when reading about the historical collapse of empires is how damned\nfarcical\nit is. Heinlein’s Crazy Years are upon us, and they are considerably crazier than he’d ever imagined.",
  "tags": [
    "decline and fall",
    "freakshow",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-14T11:00:00+00:00"
}