{
  "url": "https://voxday.net/2015/07/15/good-news-bad-news/",
  "scraped_at": "2025-12-17T17:19:44.828890",
  "title": "Good news, bad news",
  "date_display": "July 15, 2015",
  "date_iso": "2015-07-15T12:18:00+00:00",
  "date_from_url": "2015-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For fans of my writing.</p><p>First, the bad news: Book Two of <i>Arts of Dark and Light</i>, <i>A SEA OF SKULLS</i>,  will not be published this year. The cover is done and it is awesome, the story is proceeding well and I’m told that it is better than <i>A THRONE OF BONES</i>, but I’m only 200k words in and there is no way I can finish it and still publish the other books Castalia is committed to publish this year, such as the three books of <i>THE STARS CAME BACK</i>, <i>THE 4GW HANDBOOK</i>, and <i>RIDING THE RED HORSE Vol. 2</i>, among others. It’s just not possible, as there aren’t enough hours in the day. I am still working on it, however, and my reasonable estimate is March next year.</p><p>The good news. I will publish a book this fall, most likely in September, and it will be a non-fiction book entitled <i>SJWS ALWAYS LIE: How to Defend Yourself From the Thought Police. </i>The meme is rapidly spreading, more and more people are understanding that the First Law of SJW is both a truism and a reliable metric, and everyone needs to know how to defend themselves against an SJW swarm. And based on who is writing it, the Foreword may well be the best part.</p><p>Since nearly everyone here is either on the anti-SJW front lines or is an observer to action on that front, I’ll be interested to know what elements you think need to be there in order for <i>SJWS ALWAYS LIE</i> to be reasonably comprehensive.</p></div>",
  "content_text": "For fans of my writing.\nFirst, the bad news: Book Two of\nArts of Dark and Light\n,\nA SEA OF SKULLS\n,  will not be published this year. The cover is done and it is awesome, the story is proceeding well and I’m told that it is better than\nA THRONE OF BONES\n, but I’m only 200k words in and there is no way I can finish it and still publish the other books Castalia is committed to publish this year, such as the three books of\nTHE STARS CAME BACK\n,\nTHE 4GW HANDBOOK\n, and\nRIDING THE RED HORSE Vol. 2\n, among others. It’s just not possible, as there aren’t enough hours in the day. I am still working on it, however, and my reasonable estimate is March next year.\nThe good news. I will publish a book this fall, most likely in September, and it will be a non-fiction book entitled\nSJWS ALWAYS LIE: How to Defend Yourself From the Thought Police.\nThe meme is rapidly spreading, more and more people are understanding that the First Law of SJW is both a truism and a reliable metric, and everyone needs to know how to defend themselves against an SJW swarm. And based on who is writing it, the Foreword may well be the best part.\nSince nearly everyone here is either on the anti-SJW front lines or is an observer to action on that front, I’ll be interested to know what elements you think need to be there in order for\nSJWS ALWAYS LIE\nto be reasonably comprehensive.",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-15T11:18:00+00:00"
}