{
  "url": "https://voxday.net/2015/07/23/goodbye-dainty-flower/",
  "scraped_at": "2025-12-17T17:20:44.151365",
  "title": "Goodbye, Dainty Flower",
  "date_display": "July 23, 2015",
  "date_iso": "2015-07-23T16:00:00+00:00",
  "date_from_url": "2015-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://twitter.com/Spacebunnyday/status/624203532158283777\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"426\" src=\"https://pbs.twimg.com/media/CKmdzUvUMAAMElF.jpg:large\" width=\"640\"/></a></div><p><i>Good-bye my sweet mamma dog. Thank you for watching over us and loving us. We will miss you forever. –<a href=\"https://twitter.com/Spacebunnyday/status/624203532158283777\">Spacebunny</a></i></p><p>We had to say goodbye to the Mamma Dog today. She practically raised the kids, whom she clearly regarded as her puppies, and she watched over them more closely than any human nanny. Every night when we turned in, she would go to each child’s bed, one after the other, and sniff at them until she was satisfied they were all right before returning to our room and settling down on her own bed on the floor next to Spacebunny’s side.</p><p>She had a very sweet, but protective nature, and whenever anyone visited the house, she always had to check them out before harrumphing in mild disapproval and retiring to a corner of the room where she could keep an eye on them. You know, just in case. She had a silly side to her too, as she would pick up pieces of her food and throw it in the air just for the fun of it. If you called her on it, she would stop, stare at you, and then do it again, almost defiantly. Her eyebrows were particularly expressive, as she would raise one, then the other, in a slightly skeptical manner.</p><p>She loved the whole family, but there was no question to whom she belonged, as she was always happiest being around her beloved mistress, with whom she even shared a birthday. She liked nothing more than to share a bowl of popcorn with Spacebunny, and when waiting for a kernel to be tossed her way, she had a funny habit of impatiently shifting her weight from one side to the other.</p><p>She was astonishingly athletic. I’ve never seen a dog with such an incredible combination of speed and power. We couldn’t figure out how she was getting in and out of the house without our knowledge one summer, and it turned out that she was casually leaping six feet vertically and four feet horizontally in and out my office window. And yet, when a baby would crawl on top of her, she would hold herself perfectly motionless, her eyebrows moving up and down as she patiently waited for the baby to crawl far enough away that she could move without hurting it.</p><p>She wasn’t flawless. I mean that literally, as the two whorls of her ridge were lopsided and she had an extra partial on the right side. She was literally half-price as a result, but she would have been a bargain at ten times the cost. She was also pigeon-toed, which gave her slightly unusual stance, and she was tall for her breed, bigger than many of the male Ridgebacks we encountered.</p><p>I only heard her “serious” bark twice. It was a deep, chesty roar that sounded as if it came up from one of the pits of the lower hells. It didn’t even sound like a dog, but <a href=\"http://www.milobookclub.com/2003/10/27/dogs-and-light-bulbs/\">some sort of cross between a lion and a hellhound</a>. And yet, for all her size and strength, she was extremely feminine, hence the Dainty Flower. But to the kids, the cats, and the other dogs, she was always the Mamma Dog.</p><p>After my Viszla died in 2010, she went into a bit of a decline, and when she was subsequently diagnosed with cancer, we wondered how long she was going to last. But then the Prodiguously Large Puppy joined the household, she seemed to absorb some of his excessive energy, and she was visibly revitalized, going on long walks with the family and playing happily with her new responsibility out in the yard as well as inside the house.</p><p>She made it to Christmas, and then to another Christmas, and then was less than entirely pleased when a Ridgeback in need of a new home joined the family a year ago. She seemed convinced that the poor little puppy needed to be defended from The Other Ridgeback, never mind that he was not only a full-grown Viszla, but such an oversized and muscular version of the breed that he was frequently mistaken for a Ridgeback himself. Even though she couldn’t keep up with the two other dogs as they chased each other back and forth outside, she would bark warnings at The Other Ridgeback, promising dire retribution and serious consequences if The Other Ridgeback should somehow harm her tiny, defenseless 70-pound puppy in any way.</p><p>She lived three years longer than we expected, but the cancer finally caught up with her. Her heart was still strong, her eyes were still bright, and she would still perk up and flick her tail when she smelled espresso – she considered any cappucino placed within reach fair game for Ridgebacks – but her rear legs were withered and she was wasting away. We had the vet come out to the house to examine her, but no one knows dogs better than Spacebunny and we already knew what the verdict would be. After everyone had the chance to say their goodbyes, the vet put her to sleep for the last time in her beloved mistress’s arms.</p><p>It may be questionable theology, but I personally cannot conceive of anything that could possibly call itself Heaven or Paradise that does not contain dogs. And I have no doubt that only a little while ago <a href=\"http://www.milobookclub.com/2010/03/16/goodbye-to-good-dog/\">the Viszla</a> came enthusiastically bounding up to her, his tail wagging furiously, barking, “you’re here, you’re FINALLY here! What took you so long?”</p><p>To which I expect the Mamma Dog replied, “I had to watch over my puppies as long as I could.”</p></div>",
  "content_text": "Good-bye my sweet mamma dog. Thank you for watching over us and loving us. We will miss you forever. –\nSpacebunny\nWe had to say goodbye to the Mamma Dog today. She practically raised the kids, whom she clearly regarded as her puppies, and she watched over them more closely than any human nanny. Every night when we turned in, she would go to each child’s bed, one after the other, and sniff at them until she was satisfied they were all right before returning to our room and settling down on her own bed on the floor next to Spacebunny’s side.\nShe had a very sweet, but protective nature, and whenever anyone visited the house, she always had to check them out before harrumphing in mild disapproval and retiring to a corner of the room where she could keep an eye on them. You know, just in case. She had a silly side to her too, as she would pick up pieces of her food and throw it in the air just for the fun of it. If you called her on it, she would stop, stare at you, and then do it again, almost defiantly. Her eyebrows were particularly expressive, as she would raise one, then the other, in a slightly skeptical manner.\nShe loved the whole family, but there was no question to whom she belonged, as she was always happiest being around her beloved mistress, with whom she even shared a birthday. She liked nothing more than to share a bowl of popcorn with Spacebunny, and when waiting for a kernel to be tossed her way, she had a funny habit of impatiently shifting her weight from one side to the other.\nShe was astonishingly athletic. I’ve never seen a dog with such an incredible combination of speed and power. We couldn’t figure out how she was getting in and out of the house without our knowledge one summer, and it turned out that she was casually leaping six feet vertically and four feet horizontally in and out my office window. And yet, when a baby would crawl on top of her, she would hold herself perfectly motionless, her eyebrows moving up and down as she patiently waited for the baby to crawl far enough away that she could move without hurting it.\nShe wasn’t flawless. I mean that literally, as the two whorls of her ridge were lopsided and she had an extra partial on the right side. She was literally half-price as a result, but she would have been a bargain at ten times the cost. She was also pigeon-toed, which gave her slightly unusual stance, and she was tall for her breed, bigger than many of the male Ridgebacks we encountered.\nI only heard her “serious” bark twice. It was a deep, chesty roar that sounded as if it came up from one of the pits of the lower hells. It didn’t even sound like a dog, but\nsome sort of cross between a lion and a hellhound\n. And yet, for all her size and strength, she was extremely feminine, hence the Dainty Flower. But to the kids, the cats, and the other dogs, she was always the Mamma Dog.\nAfter my Viszla died in 2010, she went into a bit of a decline, and when she was subsequently diagnosed with cancer, we wondered how long she was going to last. But then the Prodiguously Large Puppy joined the household, she seemed to absorb some of his excessive energy, and she was visibly revitalized, going on long walks with the family and playing happily with her new responsibility out in the yard as well as inside the house.\nShe made it to Christmas, and then to another Christmas, and then was less than entirely pleased when a Ridgeback in need of a new home joined the family a year ago. She seemed convinced that the poor little puppy needed to be defended from The Other Ridgeback, never mind that he was not only a full-grown Viszla, but such an oversized and muscular version of the breed that he was frequently mistaken for a Ridgeback himself. Even though she couldn’t keep up with the two other dogs as they chased each other back and forth outside, she would bark warnings at The Other Ridgeback, promising dire retribution and serious consequences if The Other Ridgeback should somehow harm her tiny, defenseless 70-pound puppy in any way.\nShe lived three years longer than we expected, but the cancer finally caught up with her. Her heart was still strong, her eyes were still bright, and she would still perk up and flick her tail when she smelled espresso – she considered any cappucino placed within reach fair game for Ridgebacks – but her rear legs were withered and she was wasting away. We had the vet come out to the house to examine her, but no one knows dogs better than Spacebunny and we already knew what the verdict would be. After everyone had the chance to say their goodbyes, the vet put her to sleep for the last time in her beloved mistress’s arms.\nIt may be questionable theology, but I personally cannot conceive of anything that could possibly call itself Heaven or Paradise that does not contain dogs. And I have no doubt that only a little while ago\nthe Viszla\ncame enthusiastically bounding up to her, his tail wagging furiously, barking, “you’re here, you’re FINALLY here! What took you so long?”\nTo which I expect the Mamma Dog replied, “I had to watch over my puppies as long as I could.”",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-23T15:00:00+00:00"
}