{
  "url": "https://voxday.net/2015/07/25/its-not-new-proble/",
  "scraped_at": "2025-12-17T17:20:54.792752",
  "title": "It’s not a new problem",
  "date_display": "July 25, 2015",
  "date_iso": "2015-07-25T12:00:00+00:00",
  "date_from_url": "2015-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Politics took the prize a long time ago and the Puppies are a response to the politicization of science fiction. Compare and contrast <a href=\"http://www.theguardian.com/books/booksblog/2015/jul/24/the-hugo-awards-will-be-the-losers-if-politics-takes-the-prize?CMP=share_btn_tw\">the latest Hugo mewling</a> by <i>The Guardian</i> with Mike Glyer’s count of conservative Hugo-winners:</p><blockquote class=\"tr_bq\"><p> The Hugo awards will be the losers if politics takes the prize</p><p>The controversy stirred up by science fiction’s ‘Sad Puppies’ means there will be no winners at this year’s Hugo awards</p><p>The latest furore to consume SF fandom will reach a conclusion on Friday, when voting for the Hugo awards – arguably one of the genre’s most prestigious accolades – closes. Spats around the awards are nothing new. The nominations are chosen by fans, and every year authors are accused of campaigning to get their names on the list. This year a gang of rightwing authors known as the “Sad Puppies” have taken campaigning to a whole new level. Calling on their fans to stack the nomination slate with candidates who share their political agenda, their main beef is that they believe too many genre awards go to lefty, ideological fiction, and not enough to more “swashbuckling” books. Authors and fans on both sides of the divide have written endless blogs about the controversy, big names including George RR Martin have weighed in against the Puppies, and the story has been picked up by the mainstream press.</p><p>It raises the question: who should nominate works for awards anyway? A select jury (a la the Man Booker or Clarke) or the fans who actually buy the books? Clearly there should be enough room – and integrity – for both. Yet this year’s Clarke award shortlist was almost universally praised, while, in contrast, the Hugo nominations were met with derision and incredulity (for example, so-called “rabid puppy” Vox Day, who has called women’s rights “a disease to be eradicated”, is up for two awards). You might say that this is democracy at work – the fans have spoken! – and that would be all well and good, but, tellingly, two authors recommended by the Sad Puppies have already pulled their work from the nominations, saying that they want their writing to be judged on merit and not on their assumed political affiliations. It goes without saying that all books, whatever their authors’ political stance, should be judged on whether they’re any good or not; but with some factions suggesting fans vote “No Award” on categories that they believe have been hijacked, and the Puppies urging their stormtroopers to stick to their guns, the whole thing has slipped into farce. And this is a great pity. The Hugos have always been a popularity contest, a showcase of SF fandoms’ favourite fiction, and skewing the lists for political point-scoring makes a mockery of them. Whether the Sad Puppies win the day or not, it’s the awards’ legacy that will suffer, along with the future work that would have benefited from their now damaged prestige. That’s what is truly sad.</p></blockquote><p>19 of the 266 Hugo Awards that have been given out since 1996<b> </b>have gone to political conservatives. And the legacy of the awards has already suffered, because they have been regularly given out to inferior work for at least the last 15 years. When Patrick Nielsen Hayden, Charles Stross, and John Scalzi have more Hugo nominations in far fewer years of professionally writing and editing than Isaac Asimov, Robert Heinlein, and Arthur C. Clarke, it is patently obvious that something is <i>seriously </i>wrong.</p><p>Meanwhile, women have won 65.7 Hugos in the same time. And keep in mind that <a href=\"http://www.gallup.com/poll/180452/liberals-record-trail-conservatives.aspx\">conservatives outnumber liberals by a factor of 1.6 in the USA</a>, which means that conservatives are underrepresented by a factor of 11.3, versus women being underrepresented by a factor of 2.</p><p>Now, if the SJWs in SF are to be believed, this is evidence that sexism is a serious problem but<br> there is absolutely no evidence of left wing ideological bias. They keep<br> repeating this despite the fact that the anti-right wing bias in<br> science fiction is observably 5.6 times worse than the purported sexism<br> about which they so often complain.</br></br></br></br></p><p>Of course, SJWs always lie.</p></div>",
  "content_text": "Politics took the prize a long time ago and the Puppies are a response to the politicization of science fiction. Compare and contrast\nthe latest Hugo mewling\nby\nThe Guardian\nwith Mike Glyer’s count of conservative Hugo-winners:\nThe Hugo awards will be the losers if politics takes the prize\nThe controversy stirred up by science fiction’s ‘Sad Puppies’ means there will be no winners at this year’s Hugo awards\nThe latest furore to consume SF fandom will reach a conclusion on Friday, when voting for the Hugo awards – arguably one of the genre’s most prestigious accolades – closes. Spats around the awards are nothing new. The nominations are chosen by fans, and every year authors are accused of campaigning to get their names on the list. This year a gang of rightwing authors known as the “Sad Puppies” have taken campaigning to a whole new level. Calling on their fans to stack the nomination slate with candidates who share their political agenda, their main beef is that they believe too many genre awards go to lefty, ideological fiction, and not enough to more “swashbuckling” books. Authors and fans on both sides of the divide have written endless blogs about the controversy, big names including George RR Martin have weighed in against the Puppies, and the story has been picked up by the mainstream press.\nIt raises the question: who should nominate works for awards anyway? A select jury (a la the Man Booker or Clarke) or the fans who actually buy the books? Clearly there should be enough room – and integrity – for both. Yet this year’s Clarke award shortlist was almost universally praised, while, in contrast, the Hugo nominations were met with derision and incredulity (for example, so-called “rabid puppy” Vox Day, who has called women’s rights “a disease to be eradicated”, is up for two awards). You might say that this is democracy at work – the fans have spoken! – and that would be all well and good, but, tellingly, two authors recommended by the Sad Puppies have already pulled their work from the nominations, saying that they want their writing to be judged on merit and not on their assumed political affiliations. It goes without saying that all books, whatever their authors’ political stance, should be judged on whether they’re any good or not; but with some factions suggesting fans vote “No Award” on categories that they believe have been hijacked, and the Puppies urging their stormtroopers to stick to their guns, the whole thing has slipped into farce. And this is a great pity. The Hugos have always been a popularity contest, a showcase of SF fandoms’ favourite fiction, and skewing the lists for political point-scoring makes a mockery of them. Whether the Sad Puppies win the day or not, it’s the awards’ legacy that will suffer, along with the future work that would have benefited from their now damaged prestige. That’s what is truly sad.\n19 of the 266 Hugo Awards that have been given out since 1996\nhave gone to political conservatives. And the legacy of the awards has already suffered, because they have been regularly given out to inferior work for at least the last 15 years. When Patrick Nielsen Hayden, Charles Stross, and John Scalzi have more Hugo nominations in far fewer years of professionally writing and editing than Isaac Asimov, Robert Heinlein, and Arthur C. Clarke, it is patently obvious that something is\nseriously\nwrong.\nMeanwhile, women have won 65.7 Hugos in the same time. And keep in mind that\nconservatives outnumber liberals by a factor of 1.6 in the USA\n, which means that conservatives are underrepresented by a factor of 11.3, versus women being underrepresented by a factor of 2.\nNow, if the SJWs in SF are to be believed, this is evidence that sexism is a serious problem but\nthere is absolutely no evidence of left wing ideological bias. They keep\nrepeating this despite the fact that the anti-right wing bias in\nscience fiction is observably 5.6 times worse than the purported sexism\nabout which they so often complain.\nOf course, SJWs always lie.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-25T11:00:00+00:00"
}