{
  "url": "https://voxday.net/2015/07/23/jeu-video-et-supremacisme/",
  "scraped_at": "2025-12-17T17:20:42.329711",
  "title": "Jeu vidéo et «suprémacisme»",
  "date_display": "July 23, 2015",
  "date_iso": "2015-07-23T12:00:00+00:00",
  "date_from_url": "2015-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Causeur </i>responds to Le Monde’s coverage of #GGinPAris:</p><blockquote class=\"tr_bq\"><p> <b><a href=\"http://www.causeur.fr/jeu-video-gamergate-supremacisme-33884.html\">Video Games and “Supremacism”</a></b></p><p>#Gamergate might not ring a bell with readers, but <i>Le Monde / Pixels </i>recently covered its recent meet-up in Paris. Concerned vigilance sums up the tone of the article. The author ventured onsite ready to ferret out any signs of Evil on the prowl. This unwittingly comic posture does not prove we should all bless #GG, even if it does incline us to consider this affair from a benevolent perspective. If you’ve read Alban Agnoux’s paper in Causeur #26, #Gamergate will seem like familiar territory: it is an online movement engaged in a cultural war to protect freedom of speech in video games. Against whom? Mainly against those #GGers denounce using the term social justice warriors (SJWs). In a nutshell, if you like Lara Croft, you are not an SJW. Does this also make you an antifeminist? It doesn’t take much to become a suspect these days.</p><p>Ah, how the young generation sometimes leaves us scratching our heads in perplexity! The author of the <i>Le Monde</i> article did not evade the polychromatic aspect of the #GG phenomenon. In order to balance his depiction, as well as to avoid bewildering his readers more than was necessary, it is understandable that he also chose to take some harder lines. Did he do so in order to quiet any inner doubts about his own orthodoxy as well? I would not go so far. In any case, this is where Vox Day, one of the gamers behind #GGinParis, came in handy: not too young, easier to classify, especially if you put words in his mouth. Given the number of detractors the man has already accumulated, why not join the pack? The threat lying hidden in the shadows of #GG would thus appear to boil down to him. Him, and his ideology: <i>supremacism</i>.</p><p>Perhaps it is me, but as characterizations go, this one comes across as vague, if not outright flippant. It is an accusation made in bad faith, without force and without conviction. Check out the second photo of the article, in which the alleged supremacist Vox Day appears, but which also inexplicably features the beaming smile of the black owner of the bar: how is the reader not expected to start having doubts after seeing that? If, on top of that, the readers goes off exploring the chap’s blog, well, at least all is not lost. From what I understand, accusations of <i>supremacism </i>sadden the accused greatly, as he never misses a chance to assert his Native American and Mexican heritages. And does he not seem a little too satisfied with the attention bestowed upon on him by <i>Le Monde</i>?</p><p>Yes, why not reduce the enemy to a caricature — but one has got to put some heart into it, lest the effort prove counterproductive.  </p></blockquote><p>It’s a strong and wryly jaundiced response to the <i>Le Monde</i> author’s apparent determination to stick to the Narrative, and to take the occasional cheap shot. Don’t get me wrong, I was impressed to see that the journalist not only made the hitherto unseen effort to show up at the event, but spent several hours there and talked to many people there. However, it was disappointing that he elected to run with the “supremacism” line even after acknowledging that my ancestry made the claims of being a white supremacist absurd and that a response to a single attacker cannot seriously be considered a reliable indicator of one’s perspective on a group consisting of hundreds of millions of people.</p><p>Then again, the journalist openly admitted that he did not know how to describe my actual ideology, libertarianism. And he did make an effort, as he even made reference to my attempt to put it in French terms: “Voltairean revolutionaries dedicated to <i>liberte’</i> while rejecting <i>egalite’</i>“. But the <i>Causeur </i>author is correct to call him to account for taking, shall we say, liberties with the truth, as the fact that communicating a hard-to-translate perspective does not justify inventing your own version of it.</p></div>",
  "content_text": "Causeur\nresponds to Le Monde’s coverage of #GGinPAris:\nVideo Games and “Supremacism”\n#Gamergate might not ring a bell with readers, but\nLe Monde / Pixels\nrecently covered its recent meet-up in Paris. Concerned vigilance sums up the tone of the article. The author ventured onsite ready to ferret out any signs of Evil on the prowl. This unwittingly comic posture does not prove we should all bless #GG, even if it does incline us to consider this affair from a benevolent perspective. If you’ve read Alban Agnoux’s paper in Causeur #26, #Gamergate will seem like familiar territory: it is an online movement engaged in a cultural war to protect freedom of speech in video games. Against whom? Mainly against those #GGers denounce using the term social justice warriors (SJWs). In a nutshell, if you like Lara Croft, you are not an SJW. Does this also make you an antifeminist? It doesn’t take much to become a suspect these days.\nAh, how the young generation sometimes leaves us scratching our heads in perplexity! The author of the\nLe Monde\narticle did not evade the polychromatic aspect of the #GG phenomenon. In order to balance his depiction, as well as to avoid bewildering his readers more than was necessary, it is understandable that he also chose to take some harder lines. Did he do so in order to quiet any inner doubts about his own orthodoxy as well? I would not go so far. In any case, this is where Vox Day, one of the gamers behind #GGinParis, came in handy: not too young, easier to classify, especially if you put words in his mouth. Given the number of detractors the man has already accumulated, why not join the pack? The threat lying hidden in the shadows of #GG would thus appear to boil down to him. Him, and his ideology:\nsupremacism\n.\nPerhaps it is me, but as characterizations go, this one comes across as vague, if not outright flippant. It is an accusation made in bad faith, without force and without conviction. Check out the second photo of the article, in which the alleged supremacist Vox Day appears, but which also inexplicably features the beaming smile of the black owner of the bar: how is the reader not expected to start having doubts after seeing that? If, on top of that, the readers goes off exploring the chap’s blog, well, at least all is not lost. From what I understand, accusations of\nsupremacism\nsadden the accused greatly, as he never misses a chance to assert his Native American and Mexican heritages. And does he not seem a little too satisfied with the attention bestowed upon on him by\nLe Monde\n?\nYes, why not reduce the enemy to a caricature — but one has got to put some heart into it, lest the effort prove counterproductive.\nIt’s a strong and wryly jaundiced response to the\nLe Monde\nauthor’s apparent determination to stick to the Narrative, and to take the occasional cheap shot. Don’t get me wrong, I was impressed to see that the journalist not only made the hitherto unseen effort to show up at the event, but spent several hours there and talked to many people there. However, it was disappointing that he elected to run with the “supremacism” line even after acknowledging that my ancestry made the claims of being a white supremacist absurd and that a response to a single attacker cannot seriously be considered a reliable indicator of one’s perspective on a group consisting of hundreds of millions of people.\nThen again, the journalist openly admitted that he did not know how to describe my actual ideology, libertarianism. And he did make an effort, as he even made reference to my attempt to put it in French terms: “Voltairean revolutionaries dedicated to\nliberte’\nwhile rejecting\negalite’\n“. But the\nCauseur\nauthor is correct to call him to account for taking, shall we say, liberties with the truth, as the fact that communicating a hard-to-translate perspective does not justify inventing your own version of it.",
  "tags": [
    "#GamerGate",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-23T11:00:00+00:00"
}