{
  "url": "https://voxday.net/2015/07/03/karma/",
  "scraped_at": "2025-12-16T13:01:54.923688",
  "title": "Karma",
  "date_display": "July 3, 2015",
  "date_iso": "2015-07-03T18:30:00+00:00",
  "date_from_url": "2015-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s wise to always mind your tongue and be certain that you mean what you say. Fate sometimes has a cruel way of forcing one to confront one’s own words in unexpected ways:</p><blockquote class=\"tr_bq\"><p> “That young men succeed in suicide more often than girls isn’t really the point. Indeed, the more callous among us would say that it was quite nice for young men finally to find something that they’re better at than girls….</p><p> “The last time I suggested that suicides should be left to get on with it, I received a small number of letters from people whose sons had killed themselves. All of them demanded an apology. I’d advise them this time to save their stamps because, you see, I don’t care. I don’t care because most nights of the week I still dream of my dad, who I saw waste away almost to nothing, eaten alive by the tumours that were his retirement gift for working with asbestos. Every day, as his legs went, as his sight went, my dad would declare that tomorrow he would be taking the dog out; he clung to life like a dog playing tug-of-war for the biggest, juiciest raw steak in the world.</p><p>“To ask me to feel sympathy with suicides after witnessing this is, I suggest, just as unfeeling and ignorant as my callousness must appear to you – like asking a starving African to sympathise with an anorexic. In a society still beset with the most vicious social deprivation and rampant cruelty to the very young, the very old and the very weak, the voluntary exits of a few hundred able-bodied young men each year are best dealt with as private tragedies rather than a public concern. Let them go.<br> – Julie Burchill, <a href=\"http://www.theguardian.com/theguardian/1999/oct/16/weekend7.weekend6\">16 October, 1999</a></br></p><p>This week writer Julie Burchill felt the full force of that hurt when her son, Jack, committed suicide aged just 29. Ms Burchill 55, announced the news on her Facebook page yesterday in an emotional tribute in which she blamed herself for failing him.<br>– <a href=\"http://www.dailymail.co.uk/news/article-3146632/NATALIE-CLARKE-Agony-star-writer-Julie-Burchill-son-lost-custody-takes-life.html\">1 July 2015</a></br></p></blockquote><p>It might be tempting to feel a sense of schadenfreude at Ms Burchill experiencing the full force of the pain that she derided and dismissed so cruelly in others. But it’s much better to learn from her example rather than repeat it.</p></div>",
  "content_text": "It’s wise to always mind your tongue and be certain that you mean what you say. Fate sometimes has a cruel way of forcing one to confront one’s own words in unexpected ways:\n“That young men succeed in suicide more often than girls isn’t really the point. Indeed, the more callous among us would say that it was quite nice for young men finally to find something that they’re better at than girls….\n“The last time I suggested that suicides should be left to get on with it, I received a small number of letters from people whose sons had killed themselves. All of them demanded an apology. I’d advise them this time to save their stamps because, you see, I don’t care. I don’t care because most nights of the week I still dream of my dad, who I saw waste away almost to nothing, eaten alive by the tumours that were his retirement gift for working with asbestos. Every day, as his legs went, as his sight went, my dad would declare that tomorrow he would be taking the dog out; he clung to life like a dog playing tug-of-war for the biggest, juiciest raw steak in the world.\n“To ask me to feel sympathy with suicides after witnessing this is, I suggest, just as unfeeling and ignorant as my callousness must appear to you – like asking a starving African to sympathise with an anorexic. In a society still beset with the most vicious social deprivation and rampant cruelty to the very young, the very old and the very weak, the voluntary exits of a few hundred able-bodied young men each year are best dealt with as private tragedies rather than a public concern. Let them go.\n– Julie Burchill,\n16 October, 1999\nThis week writer Julie Burchill felt the full force of that hurt when her son, Jack, committed suicide aged just 29. Ms Burchill 55, announced the news on her Facebook page yesterday in an emotional tribute in which she blamed herself for failing him.\n–\n1 July 2015\nIt might be tempting to feel a sense of schadenfreude at Ms Burchill experiencing the full force of the pain that she derided and dismissed so cruelly in others. But it’s much better to learn from her example rather than repeat it.",
  "tags": [
    "Absolute Rights",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-03T17:30:00+00:00"
}