{
  "url": "https://voxday.net/2015/07/16/lemonde-on-gginparis/",
  "scraped_at": "2025-12-17T17:19:52.144051",
  "title": "Le Mondeon GGinParis",
  "date_display": "July 16, 2015",
  "date_iso": "2015-07-16T12:20:00+00:00",
  "date_from_url": "2015-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://s2.lemde.fr/image/2015/07/15/644x322/4684103_3_5fa2_premier-rendez-vous-gamergate-dans-un-bar-a_e42d78c13e66186804fa911c828ae398.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://s2.lemde.fr/image/2015/07/15/644x322/4684103_3_5fa2_premier-rendez-vous-gamergate-dans-un-bar-a_e42d78c13e66186804fa911c828ae398.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://s2.lemde.fr/image/2015/07/15/644x322/4684103_3_5fa2_premier-rendez-vous-gamergate-dans-un-bar-a_e42d78c13e66186804fa911c828ae398.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> <b>A la rencontre du GamerGate, le mouvement libertarien qui veut défendre « ses » jeux vidéo</b><br> <a href=\"http://www.lemonde.fr/pixels/article/2015/07/15/a-la-rencontre-du-gamergate-le-mouvement-libertarien-qui-veut-defendre-ses-jeux-video_4683912_4408996.html\"><i><b></b></i></a><i><b><a href=\"http://www.lemonde.fr/pixels/article/2015/07/15/a-la-rencontre-du-gamergate-le-mouvement-libertarien-qui-veut-defendre-ses-jeux-video_4683912_4408996.html\">Le Monde</a></b></i><br> William Audureau</br></br></p><p><i>Meet GamerGate, the libertarian movement to defend “men’s” video games. Protean,<br> sometimes violent and a strange nothing, the movement of video game<br> players met Saturday, July 11 in Paris without interposed screens.</br></br></i></p><p><i>Paris, Gare de Lyon, at the stroke of 10 PM. Drinks in hand, forty<br> patrons mingle calmly on the sidewalk in front of a nondescript bar.<br> Three men stand facing them. In a black  jacket over a black T-shirt,<br> the writer known as “Vox Day” speaks to the crowd. “We<br> are the first in decades to successfully oppose the Social Justice Warriors<br> [derogatory term describing feminist and LGBT activists]. I’m right, you<br> may be left, but we fight together. You are not alone,” he declares. In<br> the audience, some lift their glasses, slightly ill at ease.</br></br></br></br></br></br></br></i></p><p>“I’m<br> against reconfiguring this movement for political purposes,” says a<br> young programmer with a psychobilly look– 50s pompadour and an easy<br> familiarity. “I’m 200% anti-racist, I’ve supported the French<br> antifascist action since the age of fourteen,” he adds as if to further<br> distance himself from one of the organizers of the event, Vox Day, a<br> video game programmer and science fiction writer known for his<br> supremacist writings and for having called a black female colleague a<br> “half-savage”– a remark he repeated Saturday to Le Monde. And yet, the<br> two men were participating in the same rally.</br></br></br></br></br></br></br></br></br></p><p>From antifascists<br> to supremacists to ecologists, libertarians, socialists and the<br> apolitical, all political sides were present, even the most extreme,<br> this Saturday, July 11 in this Parisian brasserie, during the first<br> “official” meeting of GamerGate in France…</br></br></br></br></p><p>In many respects,<br> GamerGate comes from the same culture as Anonymous. It springs from the<br> same forums, takes on the same form of hackitivism, tinted with grinning<br> anarchism and harassment; its horizontalist and conservative values are<br> close, but with a more pronounced libertarian hue and a new masculinist<br> core.<i><br/></i><br> <i> </i><br> <i>“We are revolutionaries of freedom” believes Vox Day, who presents himself in a provocative manner as an “extreme libertarian” and cites Voltaire in a triumphant tone. But all do not put as much political motives behind their support of GamerGate. “I like just to play the perfect woman with large breasts,” says an amused Elodie, 25, a software developer. “Let them not change my games.”<br> </br></i></br></br></br></br></br></br></br></p><p>I find it vaguely amusing that even in a clear attempt to do a hit piece on #GamerGate, the mere fact that Mr. Audureau actually covered the GGinParis event, and spoke directly with us, caused him to present a much more balanced piece than we’ve seen everywhere from <i>NPR </i>to <i>Popular Science</i>.</p><p>That’s why the media tries so hard to avoid talking to us and prefers to instead talk about us. Because every time we speak, we punch holes in their SJW narrative.</p></div>",
  "content_text": "A la rencontre du GamerGate, le mouvement libertarien qui veut défendre « ses » jeux vidéo\nLe Monde\nWilliam Audureau\nMeet GamerGate, the libertarian movement to defend “men’s” video games. Protean,\nsometimes violent and a strange nothing, the movement of video game\nplayers met Saturday, July 11 in Paris without interposed screens.\nParis, Gare de Lyon, at the stroke of 10 PM. Drinks in hand, forty\npatrons mingle calmly on the sidewalk in front of a nondescript bar.\nThree men stand facing them. In a black  jacket over a black T-shirt,\nthe writer known as “Vox Day” speaks to the crowd. “We\nare the first in decades to successfully oppose the Social Justice Warriors\n[derogatory term describing feminist and LGBT activists]. I’m right, you\nmay be left, but we fight together. You are not alone,” he declares. In\nthe audience, some lift their glasses, slightly ill at ease.\n“I’m\nagainst reconfiguring this movement for political purposes,” says a\nyoung programmer with a psychobilly look– 50s pompadour and an easy\nfamiliarity. “I’m 200% anti-racist, I’ve supported the French\nantifascist action since the age of fourteen,” he adds as if to further\ndistance himself from one of the organizers of the event, Vox Day, a\nvideo game programmer and science fiction writer known for his\nsupremacist writings and for having called a black female colleague a\n“half-savage”– a remark he repeated Saturday to Le Monde. And yet, the\ntwo men were participating in the same rally.\nFrom antifascists\nto supremacists to ecologists, libertarians, socialists and the\napolitical, all political sides were present, even the most extreme,\nthis Saturday, July 11 in this Parisian brasserie, during the first\n“official” meeting of GamerGate in France…\nIn many respects,\nGamerGate comes from the same culture as Anonymous. It springs from the\nsame forums, takes on the same form of hackitivism, tinted with grinning\nanarchism and harassment; its horizontalist and conservative values are\nclose, but with a more pronounced libertarian hue and a new masculinist\ncore.\n“We are revolutionaries of freedom” believes Vox Day, who presents himself in a provocative manner as an “extreme libertarian” and cites Voltaire in a triumphant tone. But all do not put as much political motives behind their support of GamerGate. “I like just to play the perfect woman with large breasts,” says an amused Elodie, 25, a software developer. “Let them not change my games.”\nI find it vaguely amusing that even in a clear attempt to do a hit piece on #GamerGate, the mere fact that Mr. Audureau actually covered the GGinParis event, and spoke directly with us, caused him to present a much more balanced piece than we’ve seen everywhere from\nNPR\nto\nPopular Science\n.\nThat’s why the media tries so hard to avoid talking to us and prefers to instead talk about us. Because every time we speak, we punch holes in their SJW narrative.",
  "tags": [
    "#GamerGate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-16T11:20:00+00:00"
}