{
  "url": "https://voxday.net/2015/07/16/m-zed-votes-no/",
  "scraped_at": "2025-12-17T17:19:53.968999",
  "title": "M-Zed votes no",
  "date_display": "July 16, 2015",
  "date_iso": "2015-07-16T14:00:00+00:00",
  "date_from_url": "2015-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>2015 Hugo Nominee Mike Z. Williamson explains <a href=\"http://www.michaelzwilliamson.com/blog/index.php?itemid=368\">why he is voting NO AWARD </a>across the board:</p><blockquote class=\"tr_bq\"><p> I have just voted NO AWARD across the board for the Hugo awards, including the category in which I am a finalist.</p><p>At one time, the Hugo WAS arguably the most significant award in SF, with the Nebula being the pro award with a different cachet.</p><p>The Nebula lost any credibility when it was awarded to If You Were An Alpha Male My Love, which was not only eyerollingly bad Mary Sue, but wasn’t SF nor even an actual story. If that’s what the pros consider to be worthy of note, it indicates a dysfunction at their level.</p><p>As for the Hugos, in the last twenty years or so, they’ve been less and less awarded for either literature or entertaining storytelling, and more and more awarded for trite fanfic.  When not, it’s been the same incestuous group awarding it within a circle of in-people, to the point where there are winners with literally 50 nominations and 30 wins.</p><p>This is just ridiculous…. The sheer, frothing, irrational vitriol aimed at us makes it clear that content will not be considered.  We are Unclean, and many have stated they will not even look at our works.</p><p>Sadly, there are quite a few nominees this year who genuinely deserve awards for their work and creativity, including other members of my own category.</p><p>And perhaps someday, an award will come along that reaches the standards of credibility and accolade their works deserve.</p><p>But at present, no such award exists.</p></blockquote><p>I am, of course, sympathetic to his position. Indeed, voting No Award across the board was my original intention, until I discovered that the SJWs in science fiction were more than willing to do the job of burning the awards to the ground for us. As I mentioned previously, why waste time burning Munich when you can trust the Germans to do it for you as you push for Berlin.</p><p>Also, and more importantly, not voting No Award permits us to correctly gauge the full extent of the SJW influence in science fiction and see how it compares to the current strength of the Sad and Rabid Puppies. That’s my chief interest in this year’s vote, because it will inform the strategy that we pursue in the future.</p><p>Remember, we haven’t even begun to finance “scholarships” in the way the other side has. Our 2015 numbers do not reflect the full extent of the force we can bring to bear.</p><p>And that is why I encourage all the Sad and Rabid Puppies to refrain from following M-Zed’s noble example, but rather vote for the various works based on their perceived merits. As the end of the voting period is rapidly approaching, I will soon post a complete list of my Hugo ballot, which of course should not be confused in any way, shape, or form with a slate or a bloc<br> vote, much less a direct order by the Supreme Dark Lord of the Evil<br> Legion of Evil to his 389 Vile Faceless Minions or anyone else.</br></br></p></div>",
  "content_text": "2015 Hugo Nominee Mike Z. Williamson explains\nwhy he is voting NO AWARD\nacross the board:\nI have just voted NO AWARD across the board for the Hugo awards, including the category in which I am a finalist.\nAt one time, the Hugo WAS arguably the most significant award in SF, with the Nebula being the pro award with a different cachet.\nThe Nebula lost any credibility when it was awarded to If You Were An Alpha Male My Love, which was not only eyerollingly bad Mary Sue, but wasn’t SF nor even an actual story. If that’s what the pros consider to be worthy of note, it indicates a dysfunction at their level.\nAs for the Hugos, in the last twenty years or so, they’ve been less and less awarded for either literature or entertaining storytelling, and more and more awarded for trite fanfic.  When not, it’s been the same incestuous group awarding it within a circle of in-people, to the point where there are winners with literally 50 nominations and 30 wins.\nThis is just ridiculous…. The sheer, frothing, irrational vitriol aimed at us makes it clear that content will not be considered.  We are Unclean, and many have stated they will not even look at our works.\nSadly, there are quite a few nominees this year who genuinely deserve awards for their work and creativity, including other members of my own category.\nAnd perhaps someday, an award will come along that reaches the standards of credibility and accolade their works deserve.\nBut at present, no such award exists.\nI am, of course, sympathetic to his position. Indeed, voting No Award across the board was my original intention, until I discovered that the SJWs in science fiction were more than willing to do the job of burning the awards to the ground for us. As I mentioned previously, why waste time burning Munich when you can trust the Germans to do it for you as you push for Berlin.\nAlso, and more importantly, not voting No Award permits us to correctly gauge the full extent of the SJW influence in science fiction and see how it compares to the current strength of the Sad and Rabid Puppies. That’s my chief interest in this year’s vote, because it will inform the strategy that we pursue in the future.\nRemember, we haven’t even begun to finance “scholarships” in the way the other side has. Our 2015 numbers do not reflect the full extent of the force we can bring to bear.\nAnd that is why I encourage all the Sad and Rabid Puppies to refrain from following M-Zed’s noble example, but rather vote for the various works based on their perceived merits. As the end of the voting period is rapidly approaching, I will soon post a complete list of my Hugo ballot, which of course should not be confused in any way, shape, or form with a slate or a bloc\nvote, much less a direct order by the Supreme Dark Lord of the Evil\nLegion of Evil to his 389 Vile Faceless Minions or anyone else.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-16T13:00:00+00:00"
}