{
  "url": "https://voxday.net/2015/07/24/moira-grey-obliterates-rainbow/",
  "scraped_at": "2025-12-17T17:20:52.949618",
  "title": "Moira Greyland obliterates the rainbow",
  "date_display": "July 24, 2015",
  "date_iso": "2015-07-24T23:53:00+00:00",
  "date_from_url": "2015-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given what she’s survived at the hands of the gay community already, I don’t think they’re going to intimidate her one little bit. The daughter of feminist icon Marion Zimmer Bradley and convicted child molester Walter Breen <a href=\"http://askthebigot.com/2015/07/23/the-story-of-moira-greyland-guest-post/\">shines sunlight on the dark underbelly of homosexual culture</a> and its obsession with molesting children:</p><blockquote class=\"tr_bq\"><p> My observation of my father and mother’s actual belief is this: since everyone is naturally gay, it is the straight establishment that makes everyone hung up and therefore limited.  Sex early will make people willing to have sex with everyone, which will bring about the utopia while eliminating homophobia and helping people become “who they really are.” It will also destroy the hated nuclear family with its paternalism, sexism, ageism (yes, for pedophiles, that is a thing) and all other “isms.”  If enough children are sexualized young enough, gayness will suddenly be “normal” and accepted by everyone, and the old fashioned notions about fidelity will vanish.  As sex is integrated as a natural part of every single relationship, the barriers between people will vanish, and the utopia will appear, as “straight culture” goes the way of the dinosaur.  As my mother used to say: “Children are brainwashed into believing they don’t want sex.”</p><p>I know, I know.  The stupidity of that particular thesis is boundless, and the actual consequence is forty-year-olds in therapy for sexual abuse, many, many suicides, and ruined lives for just about EVERYONE.  But someone needed to say it.  Will anyone hear it?</p><p>What sets gay culture apart from straight culture is the belief that early sex is good and beneficial, and the sure knowledge (don’t think for a second that they DON’T know) that the only way to produce another homosexual is to provide a boy with sexual experiences BEFORE he can be “ruined” by attraction to a girl.</p><p>If you’re OK with that, and you might not be, it is worth your consideration.  If you think I am wrong, that is your privilege, but watch out for the VAST number of stories of sexual abuse AND transgenderism that will come about from these gay “marriages.”  Already the statistics for sexual abuse of children of gays are astronomically high compared to that suffered by the children of straights.</p><p>Naturally my perspective is very uncomfortable to the liberal people I was raised with: I am “allowed” to be a victim of molestation by both parents, and “allowed” to be a victim of rather hideous violence. I am, incredibly, NOT ALLOWED to blame their homosexuality for their absolute willingness to accept all sex at all times between all people.</p><p>But that is not going to slow me down one bit. I am going to keep right on speaking out. I have been silent for entirely too long. Gay “marriage” is nothing but a way to make children over in the image of their “parents” and in ten to thirty years, the survivors will speak out.</p></blockquote><p>I suspect that the eventual backlash against the rainbow fascists in the West is going to make ISIS look merciful. Remember, the historical pendulum ALWAYS swings back sooner or later. Once it becomes clear that acceptance of homosexuality necessarily requires the acceptance of widespread child molestation, there will be no mercy. There is a very good reason homosexuality was historically categorized among the Diagnostic and Statistical Manual of Mental Disorders; it is a mental disorder that typically stems from childhood abuse of one form or another.</p><p>That doesn’t mean all homosexuals are evil individuals or are inclined to molest children. What Miss Greyland is saying makes it clear that they are, in fact, innocent <i>victims</i>, regardless of how proud they may claim to be of their past victimization. But the fact remains that there is an intrinsic link between the childhood abuse and the mental disorder, and if you disagree, then you can take it up with Moira Greyland. Just try to tell her she doesn’t know what she’s talking about.</p><p>This also provides an obvious response to those who ask “why don’t you support gay marriage?” Because I oppose child molestation. If banning gay “marriage” will save even ONE child from being sexually abused, then it is a moral imperative.</p><p>Prior to the establishment of the federal parody of marriage, children were 10 times more likely to be molested by a parent or adult guardian if their mother was a lesbian and 3 times more often if their father was gay. As Miss Greyland predicts, imagine how that ratio is going to explode if both “parents” are gay; the math indicates it will be somewhere between 9 times and 100 times more often; given the greater access to children necessarily involved, it will probably be closer to the latter figure.</p></div>",
  "content_text": "Given what she’s survived at the hands of the gay community already, I don’t think they’re going to intimidate her one little bit. The daughter of feminist icon Marion Zimmer Bradley and convicted child molester Walter Breen\nshines sunlight on the dark underbelly of homosexual culture\nand its obsession with molesting children:\nMy observation of my father and mother’s actual belief is this: since everyone is naturally gay, it is the straight establishment that makes everyone hung up and therefore limited.  Sex early will make people willing to have sex with everyone, which will bring about the utopia while eliminating homophobia and helping people become “who they really are.” It will also destroy the hated nuclear family with its paternalism, sexism, ageism (yes, for pedophiles, that is a thing) and all other “isms.”  If enough children are sexualized young enough, gayness will suddenly be “normal” and accepted by everyone, and the old fashioned notions about fidelity will vanish.  As sex is integrated as a natural part of every single relationship, the barriers between people will vanish, and the utopia will appear, as “straight culture” goes the way of the dinosaur.  As my mother used to say: “Children are brainwashed into believing they don’t want sex.”\nI know, I know.  The stupidity of that particular thesis is boundless, and the actual consequence is forty-year-olds in therapy for sexual abuse, many, many suicides, and ruined lives for just about EVERYONE.  But someone needed to say it.  Will anyone hear it?\nWhat sets gay culture apart from straight culture is the belief that early sex is good and beneficial, and the sure knowledge (don’t think for a second that they DON’T know) that the only way to produce another homosexual is to provide a boy with sexual experiences BEFORE he can be “ruined” by attraction to a girl.\nIf you’re OK with that, and you might not be, it is worth your consideration.  If you think I am wrong, that is your privilege, but watch out for the VAST number of stories of sexual abuse AND transgenderism that will come about from these gay “marriages.”  Already the statistics for sexual abuse of children of gays are astronomically high compared to that suffered by the children of straights.\nNaturally my perspective is very uncomfortable to the liberal people I was raised with: I am “allowed” to be a victim of molestation by both parents, and “allowed” to be a victim of rather hideous violence. I am, incredibly, NOT ALLOWED to blame their homosexuality for their absolute willingness to accept all sex at all times between all people.\nBut that is not going to slow me down one bit. I am going to keep right on speaking out. I have been silent for entirely too long. Gay “marriage” is nothing but a way to make children over in the image of their “parents” and in ten to thirty years, the survivors will speak out.\nI suspect that the eventual backlash against the rainbow fascists in the West is going to make ISIS look merciful. Remember, the historical pendulum ALWAYS swings back sooner or later. Once it becomes clear that acceptance of homosexuality necessarily requires the acceptance of widespread child molestation, there will be no mercy. There is a very good reason homosexuality was historically categorized among the Diagnostic and Statistical Manual of Mental Disorders; it is a mental disorder that typically stems from childhood abuse of one form or another.\nThat doesn’t mean all homosexuals are evil individuals or are inclined to molest children. What Miss Greyland is saying makes it clear that they are, in fact, innocent\nvictims\n, regardless of how proud they may claim to be of their past victimization. But the fact remains that there is an intrinsic link between the childhood abuse and the mental disorder, and if you disagree, then you can take it up with Moira Greyland. Just try to tell her she doesn’t know what she’s talking about.\nThis also provides an obvious response to those who ask “why don’t you support gay marriage?” Because I oppose child molestation. If banning gay “marriage” will save even ONE child from being sexually abused, then it is a moral imperative.\nPrior to the establishment of the federal parody of marriage, children were 10 times more likely to be molested by a parent or adult guardian if their mother was a lesbian and 3 times more often if their father was gay. As Miss Greyland predicts, imagine how that ratio is going to explode if both “parents” are gay; the math indicates it will be somewhere between 9 times and 100 times more often; given the greater access to children necessarily involved, it will probably be closer to the latter figure.",
  "tags": [
    "decline and fall",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-24T22:53:00+00:00"
}