{
  "url": "https://voxday.net/2015/07/13/of-math-and-sjw/",
  "scraped_at": "2025-12-16T13:03:06.293418",
  "title": "Of math and the SJW",
  "date_display": "July 13, 2015",
  "date_iso": "2015-07-13T10:00:00+00:00",
  "date_from_url": "2015-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which McRapey totally pwns the math:</p><blockquote class=\"tr_bq\"><p> Vox Day (@voxday)<br> The @torbooks boycott has reduced @scalzi’s Bookscan sales by 68%! http://t.co/kYXVBeBBo7 #SadPuppies</br></p><p>John Scalzi ‏@scalzi <br> 1. A detractor trying to show his “boycott” of Tor was working claimed a 68% drop in my Lock In sales since the boycott, citing Bookscan…</br></p><p>2. His only problem is that he read the data backwards. Literally backwards. My booksales went UP in that time, not down.</p><p>3. And people wonder why I occasionally say I wish I had a better class<br> of detractor. Even being able to math would be an improvement!</br></p><p>4. (To be clear, the week-to-week number movement have nothing to do<br> with boycotts or anything else. They’re the usual sales up and downs.)</br></p><p>5. Those curious can see discussion of it here:<br> http://file770.com/?p=23709 . Note the first comment, which catches the<br> math error.</br></br></p></blockquote><p>You know, I haven’t been caught out this badly since I observed that Kim Stanley Robinson was, <i>on the basis of the picture on his web site</i>, a remarkably ugly bearded woman. If nothing else, you’d think the exclamation point on a single tweet would have given it away, but apparently anything short of a “LOL”, a smiley face emoji, and a (jk) will be lost on these masters of the social arts.</p><p>Johnny Con’s attempted derision of his nameless detractor’s inability to do math is amusing because there is no mathematical error involved. There is absolutely no indication of not “being able to math”. And he would appear to have failed to realize that I was mocking Jason Sanford for a) pretending that an obviously irrelevant snapshot of data was relevant, b) listing the dates in the reverse of the usual order, and c) proceeding to reach a backwards conclusion. See, unlike Scalzi, I don’t assume the other side is completely retarded; I find it impossible to imagine that Sanford is genuinely dumb enough to believe that the data he cited is meaningful in any way, shape, or form.</p><p>SJWs like Scalzi are so easy. All you need to to do make them jump is offer them a “mistake” they can attack in order to disqualify you and show how totally smart and superior they are. As Scalzi demonstrates, they will ignore literally <i>everything</i> that is relevant to the argument at hand in their desperate eagerness to strike their pseudo-superior poses.</p><p>Sanford wrote: <i>“Lock In by John Scalzi (hardcover) 65 copies on 7/05, 39 on 6/28, 74 on 6/21, 63 on 6/14, 46 on 6/7, 54 on 5/31, 21 on 5/24.”</i> The chart, on the other hand, begins with May 24th and ends with July 5th, with the data running in the more conventional left to right manner, which made his reversal obvious even for those who don’t know how to read dates in the American manner. There is no math error; 21/65 = 0.32, which would indicate a 68 percent decline; more importantly, <a href=\"http://file770.com/?p=23709\">as Mike Glyer correctly notes</a>, the dates Sanford cites to “prove” the ineffectiveness of the boycott are invalid because he cites data from three successive weeks <a href=\"http://www.milobookclub.com/2015/06/19/tor-boycott-announced/\">before the boycott began</a>.</p><blockquote class=\"tr_bq\"><p> When I aggregated the sales for these 10 books from the week of June 21, the latest unaffected by the boycott (announced on June 19), and the sales from the week of July 5 (the latest reported by Sanford), that gave me 1,740 vs. 1,667 books. Therefore, the July 5 sales of these 10 books were 95.8% of what they were before immediately before the boycott.</p></blockquote><p>In fact, Scalzi’s Bookscan sales have observably declined since the boycott began: from 74 the week of June 21 to 65 the week of July 5. That is a 12.2 percent decline. Clearly, if we are to take Mr. Sanford’s numbers seriously, the Tor boycott has been effective.</p><p>Of course, what will likely be of considerably more concern to Tor Books than the effectiveness or lack of effectiveness of the boycott is the fact that the writer <a href=\"http://www.milobookclub.com/2015/05/29/the-olympian-indifference-of-johnny-con/\">for whom they blew off 523 new writers</a> is selling as few as 21 copies of his “best-selling” hardcover per week.</p><p>Remember the First Law of SJW: <i>SJWs always lie. </i></p></div>",
  "content_text": "In which McRapey totally pwns the math:\nVox Day (@voxday)\nThe @torbooks boycott has reduced @scalzi’s Bookscan sales by 68%! http://t.co/kYXVBeBBo7 #SadPuppies\nJohn Scalzi ‏@scalzi\n1. A detractor trying to show his “boycott” of Tor was working claimed a 68% drop in my Lock In sales since the boycott, citing Bookscan…\n2. His only problem is that he read the data backwards. Literally backwards. My booksales went UP in that time, not down.\n3. And people wonder why I occasionally say I wish I had a better class\nof detractor. Even being able to math would be an improvement!\n4. (To be clear, the week-to-week number movement have nothing to do\nwith boycotts or anything else. They’re the usual sales up and downs.)\n5. Those curious can see discussion of it here:\nhttp://file770.com/?p=23709 . Note the first comment, which catches the\nmath error.\nYou know, I haven’t been caught out this badly since I observed that Kim Stanley Robinson was,\non the basis of the picture on his web site\n, a remarkably ugly bearded woman. If nothing else, you’d think the exclamation point on a single tweet would have given it away, but apparently anything short of a “LOL”, a smiley face emoji, and a (jk) will be lost on these masters of the social arts.\nJohnny Con’s attempted derision of his nameless detractor’s inability to do math is amusing because there is no mathematical error involved. There is absolutely no indication of not “being able to math”. And he would appear to have failed to realize that I was mocking Jason Sanford for a) pretending that an obviously irrelevant snapshot of data was relevant, b) listing the dates in the reverse of the usual order, and c) proceeding to reach a backwards conclusion. See, unlike Scalzi, I don’t assume the other side is completely retarded; I find it impossible to imagine that Sanford is genuinely dumb enough to believe that the data he cited is meaningful in any way, shape, or form.\nSJWs like Scalzi are so easy. All you need to to do make them jump is offer them a “mistake” they can attack in order to disqualify you and show how totally smart and superior they are. As Scalzi demonstrates, they will ignore literally\neverything\nthat is relevant to the argument at hand in their desperate eagerness to strike their pseudo-superior poses.\nSanford wrote:\n“Lock In by John Scalzi (hardcover) 65 copies on 7/05, 39 on 6/28, 74 on 6/21, 63 on 6/14, 46 on 6/7, 54 on 5/31, 21 on 5/24.”\nThe chart, on the other hand, begins with May 24th and ends with July 5th, with the data running in the more conventional left to right manner, which made his reversal obvious even for those who don’t know how to read dates in the American manner. There is no math error; 21/65 = 0.32, which would indicate a 68 percent decline; more importantly,\nas Mike Glyer correctly notes\n, the dates Sanford cites to “prove” the ineffectiveness of the boycott are invalid because he cites data from three successive weeks\nbefore the boycott began\n.\nWhen I aggregated the sales for these 10 books from the week of June 21, the latest unaffected by the boycott (announced on June 19), and the sales from the week of July 5 (the latest reported by Sanford), that gave me 1,740 vs. 1,667 books. Therefore, the July 5 sales of these 10 books were 95.8% of what they were before immediately before the boycott.\nIn fact, Scalzi’s Bookscan sales have observably declined since the boycott began: from 74 the week of June 21 to 65 the week of July 5. That is a 12.2 percent decline. Clearly, if we are to take Mr. Sanford’s numbers seriously, the Tor boycott has been effective.\nOf course, what will likely be of considerably more concern to Tor Books than the effectiveness or lack of effectiveness of the boycott is the fact that the writer\nfor whom they blew off 523 new writers\nis selling as few as 21 copies of his “best-selling” hardcover per week.\nRemember the First Law of SJW:\nSJWs always lie.",
  "tags": [
    "McRapey",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-13T09:00:00+00:00"
}