{
  "url": "https://voxday.net/2015/07/17/outing-and-doxxing-are-cool-now/",
  "scraped_at": "2025-12-17T17:20:01.334486",
  "title": "Outing and doxxing are cool now",
  "date_display": "July 17, 2015",
  "date_iso": "2015-07-17T12:00:00+00:00",
  "date_from_url": "2015-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently, <a href=\"http://gawker.com/conde-nasts-cfo-tried-to-pay-2-500-for-a-night-with-a-1718364339\">if Gawker is any guide</a>. The difficult thing about dealing with SJWs is one can never keep track of when one is supposed to consider the same action a) outrageous or b) meritorious:</p><blockquote class=\"tr_bq\"><p> Condé Nast’s CFO Tried To Pay $2,500 for a Night With a Gay Porn Star</p><p>David Geithner, brother of ex-Obama Treasury Secretary Tim Geithner, is<br> currently the chief financial officer of Condé Nast. This past weekend,<br> he’d planned to go to Chicago—where he planned to meet a gay porn star<br> and escort for “2-3 hours” at a cost of $2,500.</br></br></br></p></blockquote><p>Actually, the chief lesson I learned from reading this article is to never rely upon gay porn star escorts, not that I anticipate any difficulties considering what has hitherto been my historical record of spotless success in this regard. Yes, the whole thing is very shady and I have no doubt Mr. Geithner has some difficult conversations with his wife and employer looming, and yes, Gawker merits every bit of the flak that it is going to take from #GamerGate and others, but Geithner is hardly the first corporate executive to have a seamy side and Gawker’s hypocrisy is very much par for the course.</p><p>What was truly shocking was the bizarre behavior of the escort. I mean, how flaky does one have to be to try to get the <i>brother </i>of a <i>former </i>administration official to help resolve one’s dispute with the Department of Housing and Urban Development on behalf of a <i>prostitute</i> whose illicit favors one has not even yet sampled?</p><p>In any event, it’s vastly amusing to see how Gawker has demonstrated its ability to make everyone across the political spectrum hate it. Whom the gods would destroy, they first make mad. If you’re interested in joining #GamerGate’s anti-Gawker action, Operation Disrespectful Nod, which has already cost Gawker more than $1 million in advertising dollars, <a href=\"http://wiki.gamergate.me/index.php?title=Projects:Operation_Disrespectful_Nod/Advertisers#Gawker\">go here</a>.</p><p><i>Emails lead the charge<br>Cleanse the world of #gawker filth<br>Our ethics shall reign</br></br></i> <br> – @GG_HaikuBot9000</br></p></div>",
  "content_text": "Apparently,\nif Gawker is any guide\n. The difficult thing about dealing with SJWs is one can never keep track of when one is supposed to consider the same action a) outrageous or b) meritorious:\nCondé Nast’s CFO Tried To Pay $2,500 for a Night With a Gay Porn Star\nDavid Geithner, brother of ex-Obama Treasury Secretary Tim Geithner, is\ncurrently the chief financial officer of Condé Nast. This past weekend,\nhe’d planned to go to Chicago—where he planned to meet a gay porn star\nand escort for “2-3 hours” at a cost of $2,500.\nActually, the chief lesson I learned from reading this article is to never rely upon gay porn star escorts, not that I anticipate any difficulties considering what has hitherto been my historical record of spotless success in this regard. Yes, the whole thing is very shady and I have no doubt Mr. Geithner has some difficult conversations with his wife and employer looming, and yes, Gawker merits every bit of the flak that it is going to take from #GamerGate and others, but Geithner is hardly the first corporate executive to have a seamy side and Gawker’s hypocrisy is very much par for the course.\nWhat was truly shocking was the bizarre behavior of the escort. I mean, how flaky does one have to be to try to get the\nbrother\nof a\nformer\nadministration official to help resolve one’s dispute with the Department of Housing and Urban Development on behalf of a\nprostitute\nwhose illicit favors one has not even yet sampled?\nIn any event, it’s vastly amusing to see how Gawker has demonstrated its ability to make everyone across the political spectrum hate it. Whom the gods would destroy, they first make mad. If you’re interested in joining #GamerGate’s anti-Gawker action, Operation Disrespectful Nod, which has already cost Gawker more than $1 million in advertising dollars,\ngo here\n.\nEmails lead the charge\nCleanse the world of #gawker filth\nOur ethics shall reign\n– @GG_HaikuBot9000",
  "tags": [
    "#GamerGate",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-17T11:00:00+00:00"
}