{
  "url": "https://voxday.net/2015/07/29/police-vs-media-sjw/",
  "scraped_at": "2025-12-17T17:21:18.665458",
  "title": "Police vs media SJW",
  "date_display": "July 29, 2015",
  "date_iso": "2015-07-29T09:06:00+00:00",
  "date_from_url": "2015-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard to know who to believe when you’re <a href=\"http://www.latimes.com/opinion/opinion-la/la-ol-rall-lapd-crosswalk-tickets-20150511-story.html\">dealing with two sets of known liars</a>. But the fact that the police were simply able to produce the recording is sufficient evidence of Ted Rall having exaggerated his experience with the LAPD without even needing to listen to it. As we all know, if the police had done anything wrong, the cameras wouldn’t have worked, the tape would have been lost, and the digital recording accidentally erased:</p><blockquote class=\"tr_bq\"><p> In a May 11 post on The Times’ OpinionLA blog, Ted Rall — a freelance cartoonist whose work appears regularly in The Times — described an incident in which he was stopped for jaywalking on Melrose Avenue in 2001. Rall said he was thrown up against a wall, handcuffed and roughed up by an LAPD motorcycle policeman who also threw his driver’s license into the sewer. Rall also wrote that dozens of onlookers shouted in protest at the officer’s conduct.</p><p>Since then, the Los Angeles Police Department has provided records about the incident, including a complaint Rall filed at the time. An audiotape of the encounter recorded by the police officer does not back up Rall’s assertions; it gives no indication that there was physical violence of any sort by the policeman or that Rall’s license was thrown into the sewer or that he was handcuffed. Nor is there any evidence on the recording of a crowd of shouting onlookers.</p><p>In Rall’s initial complaint to the LAPD, he describes the incident without mentioning any physical violence or handcuffing but says that the police officer was “belligerent and hostile” and that he threw Rall’s license into the “gutter.” The tape depicts a polite interaction.</p><p>In addition, Rall wrote in his blog post that the LAPD dismissed his complaint without ever contacting him. Department records show that internal affairs investigators made repeated attempts to contact Rall, without success.Asked to explain these inconsistencies, Rall said he stands by his blog post.</p><p>As to why he didn’t mention any physical abuse in his letter to the LAPD in 2001, Rall said he didn’t want to make an enemy of the department, in part because he hosted a local radio talk show at the time. After listening to the tape, Rall noted that it was of poor quality and contained inaudible segments.</p><p>However, the recording and other evidence provided by the LAPD raise serious questions about the accuracy of Rall’s blog post. Based on this, the piece should not have been published.</p><p>Rall’s future work will not appear in The Times.</p></blockquote><p>That’s a surprisingly harsh standard, though. If the mainstream media is really going to stop publishing journalists and contributors who lie in their articles, it won’t be long before the average newspaper consists of nothing but sports scores and classifieds.</p></div>",
  "content_text": "It’s hard to know who to believe when you’re\ndealing with two sets of known liars\n. But the fact that the police were simply able to produce the recording is sufficient evidence of Ted Rall having exaggerated his experience with the LAPD without even needing to listen to it. As we all know, if the police had done anything wrong, the cameras wouldn’t have worked, the tape would have been lost, and the digital recording accidentally erased:\nIn a May 11 post on The Times’ OpinionLA blog, Ted Rall — a freelance cartoonist whose work appears regularly in The Times — described an incident in which he was stopped for jaywalking on Melrose Avenue in 2001. Rall said he was thrown up against a wall, handcuffed and roughed up by an LAPD motorcycle policeman who also threw his driver’s license into the sewer. Rall also wrote that dozens of onlookers shouted in protest at the officer’s conduct.\nSince then, the Los Angeles Police Department has provided records about the incident, including a complaint Rall filed at the time. An audiotape of the encounter recorded by the police officer does not back up Rall’s assertions; it gives no indication that there was physical violence of any sort by the policeman or that Rall’s license was thrown into the sewer or that he was handcuffed. Nor is there any evidence on the recording of a crowd of shouting onlookers.\nIn Rall’s initial complaint to the LAPD, he describes the incident without mentioning any physical violence or handcuffing but says that the police officer was “belligerent and hostile” and that he threw Rall’s license into the “gutter.” The tape depicts a polite interaction.\nIn addition, Rall wrote in his blog post that the LAPD dismissed his complaint without ever contacting him. Department records show that internal affairs investigators made repeated attempts to contact Rall, without success.Asked to explain these inconsistencies, Rall said he stands by his blog post.\nAs to why he didn’t mention any physical abuse in his letter to the LAPD in 2001, Rall said he didn’t want to make an enemy of the department, in part because he hosted a local radio talk show at the time. After listening to the tape, Rall noted that it was of poor quality and contained inaudible segments.\nHowever, the recording and other evidence provided by the LAPD raise serious questions about the accuracy of Rall’s blog post. Based on this, the piece should not have been published.\nRall’s future work will not appear in The Times.\nThat’s a surprisingly harsh standard, though. If the mainstream media is really going to stop publishing journalists and contributors who lie in their articles, it won’t be long before the average newspaper consists of nothing but sports scores and classifieds.",
  "tags": [
    "media",
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-29T08:06:00+00:00"
}