{
  "url": "https://voxday.net/2015/07/30/rabid-puppies-dont-forget-to-vote/",
  "scraped_at": "2025-12-17T17:21:27.893065",
  "title": "Rabid Puppies: don’t forget to vote",
  "date_display": "July 30, 2015",
  "date_iso": "2015-07-30T12:00:00+00:00",
  "date_from_url": "2015-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you are, for any reason at all, interested in perusing <a href=\"http://www.milobookclub.com/2015/07/24/hugo-recommendations-2015/\">my 2015 Hugo ballot</a>, which I have already cast, you are certainly welcome to review it. If you are registered with Sasquan, you can vote <a href=\"http://sasquan.org/hugo-awards/voting/\">at the link here</a>.</p><p>As I told the lady from the publication covering the developing story to whom I spoke last night, whatever happens, we have already won. No Award was the original objective for Rabid Puppies, and with the exception of Best Novel, that is now the worst case scenario for us. The best case scenario is that we publicly break the perceived power of the science fiction SJWs and demonstrate their impotence by denying them the ability to do what we originally sought while seeing the awards go to various meritorious works and individuals.</p><p>Which, of course, was the Sad Puppies goal. It’s more than a bit ironic that the SJWs rushed to do the Rabid Puppies’ bidding in order to teach the Sad Puppies a lesson, but then, no one ever said they were smart.</p><p>The Sad Puppies’ victory condition may be unlikely, but it is still in play. We simply don’t know how all the 5,599 supporting members are going to vote and neither does anyone else. There are nearly as many new supporting members as there were total votes last year. Loncon had 10,826 members, of whom 2,882 were supporting, and 3,587 cast Hugo votes. Consider, for example, <a href=\"https://everydayshouldbetuesday.wordpress.com/2015/07/29/on-the-hugo-awards-controversy/\">the reaction of one neutral reader</a> to the various nominees:</p><blockquote class=\"tr_bq\"><p> I read the Best Novel nominees (and Ancillary Justice), the Best Novella nominees, the Best Novelette nominees, the Best Short Story nominees, the Best Graphic Story nominees (and Saga vols. 1 and 2), and every story by a Campbell nominee I could get a hold of (the only works I had read before the nominations were announced were Ancillary Justice, The Lives of Tao, and Rat Queens vol. 1). The oft-maligned Sad Puppies and Rabid Puppies nominees held up well against the non-Puppy nominees, with the large caveat that four of the six categories were dominated by Puppy nominees and one was dominated by non-Puppy nominees.</p><p>After reading all that, what do I think? First, I was somewhat surprised to learn that, for those six categories, the average rankings I gave the books were almost identical. My average ranking for the works not on a Puppy slate was 2.8, my average ranking for the Sad Puppy works was 3.0, and my average ranking for the Rabid Puppy works was 3.2. I wasn’t blown away by the Puppy nominees, but I wasn’t blown away by the non-Puppy nominees either. I would have more sympathy for anti-puppies if better works were being nominated.</p></blockquote><p>But regardless of what happens, the fact remains that the Puppies howled and the world of science fiction will never be the same again. The cultural war in science fiction isn’t over, in fact, it has barely begun in earnest. They thought they’d won, but we hadn’t even begun to take the field.</p><p>And it’s necessary. I read <i>The Year’s Best Science Fiction #18</i>, edited by David Hartwell and published by Tor Books. (Never fear, I respected the boycott, and believe me, with a few exceptions, this was research, not pleasure.) I’ll post my analysis here in a few days, but I can assure you, many of the “best” stories were outright Pink SF message fiction. We have accomplished far more than anyone expected already, but a long march through the SF institutions remains ahead of us.</p><p>My hope is that Tor Books will one day follow Gawker’s lead in publicly announcing that they have learned the error of their ways, and force its SJWs to abandon their objective of thought-policing science fiction and fantasy while enforcing diversity of identity and uniformity of ideology.</p></div>",
  "content_text": "If you are, for any reason at all, interested in perusing\nmy 2015 Hugo ballot\n, which I have already cast, you are certainly welcome to review it. If you are registered with Sasquan, you can vote\nat the link here\n.\nAs I told the lady from the publication covering the developing story to whom I spoke last night, whatever happens, we have already won. No Award was the original objective for Rabid Puppies, and with the exception of Best Novel, that is now the worst case scenario for us. The best case scenario is that we publicly break the perceived power of the science fiction SJWs and demonstrate their impotence by denying them the ability to do what we originally sought while seeing the awards go to various meritorious works and individuals.\nWhich, of course, was the Sad Puppies goal. It’s more than a bit ironic that the SJWs rushed to do the Rabid Puppies’ bidding in order to teach the Sad Puppies a lesson, but then, no one ever said they were smart.\nThe Sad Puppies’ victory condition may be unlikely, but it is still in play. We simply don’t know how all the 5,599 supporting members are going to vote and neither does anyone else. There are nearly as many new supporting members as there were total votes last year. Loncon had 10,826 members, of whom 2,882 were supporting, and 3,587 cast Hugo votes. Consider, for example,\nthe reaction of one neutral reader\nto the various nominees:\nI read the Best Novel nominees (and Ancillary Justice), the Best Novella nominees, the Best Novelette nominees, the Best Short Story nominees, the Best Graphic Story nominees (and Saga vols. 1 and 2), and every story by a Campbell nominee I could get a hold of (the only works I had read before the nominations were announced were Ancillary Justice, The Lives of Tao, and Rat Queens vol. 1). The oft-maligned Sad Puppies and Rabid Puppies nominees held up well against the non-Puppy nominees, with the large caveat that four of the six categories were dominated by Puppy nominees and one was dominated by non-Puppy nominees.\nAfter reading all that, what do I think? First, I was somewhat surprised to learn that, for those six categories, the average rankings I gave the books were almost identical. My average ranking for the works not on a Puppy slate was 2.8, my average ranking for the Sad Puppy works was 3.0, and my average ranking for the Rabid Puppy works was 3.2. I wasn’t blown away by the Puppy nominees, but I wasn’t blown away by the non-Puppy nominees either. I would have more sympathy for anti-puppies if better works were being nominated.\nBut regardless of what happens, the fact remains that the Puppies howled and the world of science fiction will never be the same again. The cultural war in science fiction isn’t over, in fact, it has barely begun in earnest. They thought they’d won, but we hadn’t even begun to take the field.\nAnd it’s necessary. I read\nThe Year’s Best Science Fiction #18\n, edited by David Hartwell and published by Tor Books. (Never fear, I respected the boycott, and believe me, with a few exceptions, this was research, not pleasure.) I’ll post my analysis here in a few days, but I can assure you, many of the “best” stories were outright Pink SF message fiction. We have accomplished far more than anyone expected already, but a long march through the SF institutions remains ahead of us.\nMy hope is that Tor Books will one day follow Gawker’s lead in publicly announcing that they have learned the error of their ways, and force its SJWs to abandon their objective of thought-policing science fiction and fantasy while enforcing diversity of identity and uniformity of ideology.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-30T11:00:00+00:00"
}