{
  "url": "https://voxday.net/2015/07/02/stamping-out-sexism-in-science/",
  "scraped_at": "2025-12-16T13:01:42.441439",
  "title": "Stamping out sexism in science",
  "date_display": "July 2, 2015",
  "date_iso": "2015-07-02T10:53:00+00:00",
  "date_from_url": "2015-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Nature </i>has a few ideas on that score. And if we lose a few male Nobel Laureates along the way, what does it matter? After all, the vast influx of female talent that is certain <a href=\"http://www.nature.com/news/sexism-has-no-place-in-science-1.17761\">to replace the old sexist dinosaurs </a>will more than make up for any losses, right?</p><blockquote class=\"tr_bq\"><p> The problem is serious and long-standing. But there are plenty of ways to tackle it. <i>Nature</i> has discussed and promoted them before, and is happy to do so again. Here is a list of measures to consider afresh:</p><ul><li>Recognize and address unconscious bias. Graduate students given<br> grants by the US National Institutes of Health are required to undergo<br> ethics training. Gender-bias training for scientists, for example, would<br> be a powerful way to help turn the tide.</br></br></br></li><li>Encourage universities and research institutions to extend the<br> deadlines for tenure or project completion for scientists (women and<br> men) who take parental leave, and do not penalize these researchers by<br> excluding them from annual salary rises. Many workplaces are happy to<br> consider and agree to such extension requests when they are made. The<br> policy should simply be adopted across the board.</br></br></br></br></br></li><li>Events organizers and others must invite female scientists to<br> lecture, review, talk and write articles. And if the woman asked says<br> no — for whatever reason — then ask others. This is about more than mere<br> visibility. It can boost female participation too. Anecdotal reports<br> suggest that women are more likely to ask questions in sessions chaired<br> by women. After acknowledging our own bias towards male contributors, <i>Nature</i>, for example, is engaged in a continued effort to commission more women in our pages.</br></br></br></br></br></li><li>Do not use vocabulary and imagery that support one gender more than<br> another. Words matter. It is not ‘political-correctness-gone-mad’ to<br> avoid defaulting to the pronouns ‘him’ and ‘he’, or to ensure that<br> photographs and illustrations feature women.</br></br></br></li><li>In communication and promotional materials, highlight women who have<br> made key contributions to previous work, whether in your own lab or<br> within your research discipline more broadly.</br></br></li><li>Be aware of the importance of informal settings and social<br> activities to workplace culture, and people’s sense of their place<br> within it. Senior scientists can, where possible, make such events<br> inclusive.</br></br></br></li></ul></blockquote><p>Can one really say the Law of Unintended Consequences applies when the consequences of a proposed action are so entirely obvious to anyone with half a brain? How many Shakespeares, Dantes, or even JRR Tolkiens have been produced since since the liberation of women from the male oppression that forcibly prevented them from putting pen to paper 40, or 80, or 97 years ago?</p><p>And what is the price of trading a few Watsons and Hunts for the scientific equivalents of Stephanie Meyers and E.L. James going to be?</p><p>Now, obviously I support women in science; I publish more female scientists than 99.9 percent of my critics do. But I don’t support female thought police in science, which is really what <i>Nature </i>is advocating here. It is the thought police, of both sexes, who truly have NO PLACE whatsoever in science.</p></div>",
  "content_text": "Nature\nhas a few ideas on that score. And if we lose a few male Nobel Laureates along the way, what does it matter? After all, the vast influx of female talent that is certain\nto replace the old sexist dinosaurs\nwill more than make up for any losses, right?\nThe problem is serious and long-standing. But there are plenty of ways to tackle it.\nNature\nhas discussed and promoted them before, and is happy to do so again. Here is a list of measures to consider afresh:\nRecognize and address unconscious bias. Graduate students given\ngrants by the US National Institutes of Health are required to undergo\nethics training. Gender-bias training for scientists, for example, would\nbe a powerful way to help turn the tide.\nEncourage universities and research institutions to extend the\ndeadlines for tenure or project completion for scientists (women and\nmen) who take parental leave, and do not penalize these researchers by\nexcluding them from annual salary rises. Many workplaces are happy to\nconsider and agree to such extension requests when they are made. The\npolicy should simply be adopted across the board.\nEvents organizers and others must invite female scientists to\nlecture, review, talk and write articles. And if the woman asked says\nno — for whatever reason — then ask others. This is about more than mere\nvisibility. It can boost female participation too. Anecdotal reports\nsuggest that women are more likely to ask questions in sessions chaired\nby women. After acknowledging our own bias towards male contributors,\nNature\n, for example, is engaged in a continued effort to commission more women in our pages.\nDo not use vocabulary and imagery that support one gender more than\nanother. Words matter. It is not ‘political-correctness-gone-mad’ to\navoid defaulting to the pronouns ‘him’ and ‘he’, or to ensure that\nphotographs and illustrations feature women.\nIn communication and promotional materials, highlight women who have\nmade key contributions to previous work, whether in your own lab or\nwithin your research discipline more broadly.\nBe aware of the importance of informal settings and social\nactivities to workplace culture, and people’s sense of their place\nwithin it. Senior scientists can, where possible, make such events\ninclusive.\nCan one really say the Law of Unintended Consequences applies when the consequences of a proposed action are so entirely obvious to anyone with half a brain? How many Shakespeares, Dantes, or even JRR Tolkiens have been produced since since the liberation of women from the male oppression that forcibly prevented them from putting pen to paper 40, or 80, or 97 years ago?\nAnd what is the price of trading a few Watsons and Hunts for the scientific equivalents of Stephanie Meyers and E.L. James going to be?\nNow, obviously I support women in science; I publish more female scientists than 99.9 percent of my critics do. But I don’t support female thought police in science, which is really what\nNature\nis advocating here. It is the thought police, of both sexes, who truly have NO PLACE whatsoever in science.",
  "tags": [
    "science",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-02T09:53:00+00:00"
}