{
  "url": "https://voxday.net/2015/07/30/the-illusion-of-knowledge/",
  "scraped_at": "2025-12-17T17:21:26.024114",
  "title": "The illusion of knowledge",
  "date_display": "July 30, 2015",
  "date_iso": "2015-07-30T09:23:00+00:00",
  "date_from_url": "2015-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I like Clark of PopeHat, but a challenge is a challenge. And one of the lures I find most irresistible is the cocksure breeziness of the man who thinks he knows what I know perfectly well he does not know. The fact is that no one who thinks “David Riccardo” is a reasonable response to a comment about immigration knows anything about economics. Or, for that matter, free trade.</p><blockquote class=\"tr_bq\"><p> James Thompson @JamesPsychol<br> Immigrants only benefit locals if they are better than the local average in ability and character, &amp; make greater contributions</br></p><p>ClarkHat ‏@ClarkHat<br> The jury finds you guilty of economic ignorance and sentences you to read David Riccardo. </br></p><p>Casher O’Neill @CasherONeill<br> @ClarkHat Do not invoke the sacred writings of Ricardo, that will get @voxday on your @@@ if he notices. 😀</br></p><p>ClarkHat ‏@ClarkHat<br> Vox can attack me on economics if he wants; I’ll fight back.</br></p></blockquote><p>First, however, I will correct Mr. Thompson and observe that immigrants in sufficient numbers present a significant problem if even they are “better than the local average in ability and character”. Consider the British in India, for example. If immigrants are inferior, they drag the invaded nation down. If they are superior, they tend to set themselves up to rule over the natives in their own interest and at the natives’ expense.</p><p>Second, David Ricardo IS economic ignorance. Ricardo believed in a) the cost-of-production theory of value, which is a precursor of Marx’s Labor Theory of Value, b) the price-of-corn theory of profit, and c) the theory of comparative advantage, all of which are widely recognized by modern economists to be intrinsically false. His mode of argument was so hopelessly inept that Joseph Schumpeter even mocked it in his epic <i>History of Economic Analysis</i>.</p><blockquote class=\"western\"><p> His interest was in the clear-cut result<br> of direct, practical significance. In order to get this he cut that<br> general system to pieces, bundled up as large parts of it as<br> possible, and put them in cold storage – so that as many things as<br> possible should be frozen and ‘given’. He then piled one simplifying<br> assumption upon another until, having really settled everything by<br> these assumptions, he was left with only a few aggregative variables<br> between which, given these assumptions, he set up simple one-way<br> relations so that, in the end, the desired results emerged almost as<br> tautologies…. The habit of applying results of this character to<br> the solution of practical problems we shall call the Ricardian Vice.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Third, David Ricardo did not take immigration into account when he copied the concept from Robert Torrens, who introduced the theory of comparative advantage in <i>An Essay on the External Corn Trade</i>. As Ambrose Evans-Pritcher noted:</p><blockquote class=\"tr_bq\"><p> Ricardo described a world where free trade in goods was opening up, but labour markets remained largely closed. This is no longer the case. Globalisation bids up the wages of high-skilled engineers or software analysts towards international levels wherever they live.</p></blockquote><p>Since Ricardo never took immigration into account, we shall do so on his behalf. I direct your attention to his original postulates from <i>On the Principles of Political Economy and Taxation</i>.</p><p><b>Unit Labor Costs</b></p><p>Britain 100 cloth 110 wine<br> Portugal 90 cloth 80 wine</br></p><p>In the absence of transportation costs, it is efficient for Britain to produce cloth, and Portugal to produce wine, since, assuming that the two goods trade at an equal price (1 unit of cloth for 1 unit of wine) Britain can then obtain wine at a cost of 100 labor units by producing cloth and trading, rather than 110 units by producing the wine itself, and Portugal can obtain cloth at a cost of 80 units by trade rather than 90 by production.</p><p>Now we introduce immigration into the equation and the free movement of labor. Obviously both wine and cloth laborers will move to Britain, since they believe they will receive an 11 percent raise and a 38 percent raise respectively. However, once they get there, the doubling of the labor supply in Britain this immigration causes will quickly cause the price of labor to fall. It will fall considerably.</p><p>This is great for Britain! It can now produce the same amount of cloth as before for price of only 47.5 units of labor and the same amount of wine for 47.5 labor units as well, thereby obtaining an equal quantity of both wine and cloth for <i>less than what it used to cost to produce the wine alone</i>. This will <i>vastly </i>increase profits in the British cloth and wine industries, as well as creating a windfall for the financial industry investing those profits! Granted, this is because wages have fallen by 50 percent; other consequences include how the newly unemployed British workers go on the dole and turn to crime, the new Portuguese immigrants are heavily inclined to vote for the Labour Party thereby imbalancing the British political system, and British women begin bearing half-Portuguese children and lower the average IQ of the next generation from 100 to 97.5, but those are mostly non-economic factors and therefore don’t count as far as economists are concerned.</p><p>They sound suspiciously familiar, though, don’t they?</p><p>In conclusion, we can see that open immigration and the free movement of labor is not only economically desirable, but is vastly preferable to comparative advantage by a factor of 105/200 and to autarky by a factor of 105/210. QED. What else can we conclude from this exercise of the Ricardian Vice?</p><ol><li>Ricardo implicitly postulated the immobility of labor.</li><li>The mobility of labor not only fails to disprove comparative advantage, but actually strengthens the case for even freer trade… at least if you’re in the higher labor cost country and you only look at the labor costs.</li><li>The mobility of labor will eliminate international trade since everyone will be living in Britain.</li><li>The mobility of labor operates to the detriment of labor.</li><li>Ricardo’s logic is remarkably stupid.</li></ol><p>But my argument against free trade does not rest on David Ricardo’s intellectual corpse. It is not even, strictly speaking, economic in nature. This is the four-step Vox Day Argument Against Free Trade.</p><ol><li>Free trade, in its true, complete, and intellectually coherent<br> form, is not limited to the free movement of goods, but includes the<br> free movement of capital and labor as well.  (The “invisible judicial line” doesn’t magically become visible simply because human bodies are involved.) </br></br></li><li>The difference between domestic economies and the global<br> international economy is not trivial, but is substantive, material, and<br> based on significant genetic, cultural, traditional, and legal<br> differences between various self-identified peoples.</br></br></br></li><li>Free trade is totally incompatible with national sovereignty,<br> democracy, and self-determination, as well as the existence of<br> independent nation-states with the right and ability to set their own<br> laws according to the preferences of their nationals.</br></br></br></li><li>Therefore, free trade must be opposed by every sovereign,<br> democratic, or self-determined people, be they American, Chinese,<br> German, or Zambian, who wish to preserve themselves as a free and<br> distinct nation possessed of its own culture, traditions, and laws.</br></br></br></li></ol></div>",
  "content_text": "Now, I like Clark of PopeHat, but a challenge is a challenge. And one of the lures I find most irresistible is the cocksure breeziness of the man who thinks he knows what I know perfectly well he does not know. The fact is that no one who thinks “David Riccardo” is a reasonable response to a comment about immigration knows anything about economics. Or, for that matter, free trade.\nJames Thompson @JamesPsychol\nImmigrants only benefit locals if they are better than the local average in ability and character, & make greater contributions\nClarkHat ‏@ClarkHat\nThe jury finds you guilty of economic ignorance and sentences you to read David Riccardo.\nCasher O’Neill @CasherONeill\n@ClarkHat Do not invoke the sacred writings of Ricardo, that will get @voxday on your @@@ if he notices. 😀\nClarkHat ‏@ClarkHat\nVox can attack me on economics if he wants; I’ll fight back.\nFirst, however, I will correct Mr. Thompson and observe that immigrants in sufficient numbers present a significant problem if even they are “better than the local average in ability and character”. Consider the British in India, for example. If immigrants are inferior, they drag the invaded nation down. If they are superior, they tend to set themselves up to rule over the natives in their own interest and at the natives’ expense.\nSecond, David Ricardo IS economic ignorance. Ricardo believed in a) the cost-of-production theory of value, which is a precursor of Marx’s Labor Theory of Value, b) the price-of-corn theory of profit, and c) the theory of comparative advantage, all of which are widely recognized by modern economists to be intrinsically false. His mode of argument was so hopelessly inept that Joseph Schumpeter even mocked it in his epic\nHistory of Economic Analysis\n.\nHis interest was in the clear-cut result\nof direct, practical significance. In order to get this he cut that\ngeneral system to pieces, bundled up as large parts of it as\npossible, and put them in cold storage – so that as many things as\npossible should be frozen and ‘given’. He then piled one simplifying\nassumption upon another until, having really settled everything by\nthese assumptions, he was left with only a few aggregative variables\nbetween which, given these assumptions, he set up simple one-way\nrelations so that, in the end, the desired results emerged almost as\ntautologies…. The habit of applying results of this character to\nthe solution of practical problems we shall call the Ricardian Vice.\nThird, David Ricardo did not take immigration into account when he copied the concept from Robert Torrens, who introduced the theory of comparative advantage in\nAn Essay on the External Corn Trade\n. As Ambrose Evans-Pritcher noted:\nRicardo described a world where free trade in goods was opening up, but labour markets remained largely closed. This is no longer the case. Globalisation bids up the wages of high-skilled engineers or software analysts towards international levels wherever they live.\nSince Ricardo never took immigration into account, we shall do so on his behalf. I direct your attention to his original postulates from\nOn the Principles of Political Economy and Taxation\n.\nUnit Labor Costs\nBritain 100 cloth 110 wine\nPortugal 90 cloth 80 wine\nIn the absence of transportation costs, it is efficient for Britain to produce cloth, and Portugal to produce wine, since, assuming that the two goods trade at an equal price (1 unit of cloth for 1 unit of wine) Britain can then obtain wine at a cost of 100 labor units by producing cloth and trading, rather than 110 units by producing the wine itself, and Portugal can obtain cloth at a cost of 80 units by trade rather than 90 by production.\nNow we introduce immigration into the equation and the free movement of labor. Obviously both wine and cloth laborers will move to Britain, since they believe they will receive an 11 percent raise and a 38 percent raise respectively. However, once they get there, the doubling of the labor supply in Britain this immigration causes will quickly cause the price of labor to fall. It will fall considerably.\nThis is great for Britain! It can now produce the same amount of cloth as before for price of only 47.5 units of labor and the same amount of wine for 47.5 labor units as well, thereby obtaining an equal quantity of both wine and cloth for\nless than what it used to cost to produce the wine alone\n. This will\nvastly\nincrease profits in the British cloth and wine industries, as well as creating a windfall for the financial industry investing those profits! Granted, this is because wages have fallen by 50 percent; other consequences include how the newly unemployed British workers go on the dole and turn to crime, the new Portuguese immigrants are heavily inclined to vote for the Labour Party thereby imbalancing the British political system, and British women begin bearing half-Portuguese children and lower the average IQ of the next generation from 100 to 97.5, but those are mostly non-economic factors and therefore don’t count as far as economists are concerned.\nThey sound suspiciously familiar, though, don’t they?\nIn conclusion, we can see that open immigration and the free movement of labor is not only economically desirable, but is vastly preferable to comparative advantage by a factor of 105/200 and to autarky by a factor of 105/210. QED. What else can we conclude from this exercise of the Ricardian Vice?\nRicardo implicitly postulated the immobility of labor.\nThe mobility of labor not only fails to disprove comparative advantage, but actually strengthens the case for even freer trade… at least if you’re in the higher labor cost country and you only look at the labor costs.\nThe mobility of labor will eliminate international trade since everyone will be living in Britain.\nThe mobility of labor operates to the detriment of labor.\nRicardo’s logic is remarkably stupid.\nBut my argument against free trade does not rest on David Ricardo’s intellectual corpse. It is not even, strictly speaking, economic in nature. This is the four-step Vox Day Argument Against Free Trade.\nFree trade, in its true, complete, and intellectually coherent\nform, is not limited to the free movement of goods, but includes the\nfree movement of capital and labor as well.  (The “invisible judicial line” doesn’t magically become visible simply because human bodies are involved.)\nThe difference between domestic economies and the global\ninternational economy is not trivial, but is substantive, material, and\nbased on significant genetic, cultural, traditional, and legal\ndifferences between various self-identified peoples.\nFree trade is totally incompatible with national sovereignty,\ndemocracy, and self-determination, as well as the existence of\nindependent nation-states with the right and ability to set their own\nlaws according to the preferences of their nationals.\nTherefore, free trade must be opposed by every sovereign,\ndemocratic, or self-determined people, be they American, Chinese,\nGerman, or Zambian, who wish to preserve themselves as a free and\ndistinct nation possessed of its own culture, traditions, and laws.",
  "tags": [
    "economics",
    "free trade",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-30T08:23:00+00:00"
}