{
  "url": "https://voxday.net/2015/07/26/the-cuckservatives-cry/",
  "scraped_at": "2025-12-17T17:21:00.279864",
  "title": "Why cuckservatives cry",
  "date_display": "July 26, 2015",
  "date_iso": "2015-07-26T10:10:00+00:00",
  "date_from_url": "2015-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://8ch.net/pol/src/1437875520283.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"https://8ch.net/pol/src/1437875520283.jpg\" width=\"303\"/></a></div><p>The recent hashtag fireworks between the pro-immigration and anti-immigration right appears to be the second step of a long-awaited political battle that I have expected for more than a decade now. For years, conservatives afraid of being called racist have stupidly attempted to finesse the immigration issue, claiming that “it’s not the immigration, it’s the illegality” while loudly declaring their support for LEGAL immigration to balance their opposition to ILLEGAL immigration. But the distinction was always meaningless; the behavior of the individual immigrant and the cumulative effects of mass immigration have historically had nothing to do with the legality or illegality of the act of immigration. The intra-Right conflict we’re seeing now is in part the result of the Obama Administration punching right through that ridiculous position by simply legalizing larger-scale immigration than before. This is the second step of the battle; the first step was the publication of Ann Coulter’s <i>Adios America</i>, which marked the first time a major American conservative media figure besides Pat Buchanan had the courage to finally come out and admit that the real problem with immigration is a) the quality of the immigrants, and b) the quantity of the immigrants.</p><p>I am an immigrant myself; my children are second-generation immigrants. Keep in mind that to the extent you consider us to be more-or-less normal Americans, that is precisely how all of the first- and second-generation Mexicans, Chinese, Somalis, and Nigerians living in America are still more-or-less normal Mexicans, Chinese, Somalis, and Nigerians. The only difference is that we’ve been here longer, we’re more integrated, and we speak the language. <i>Potete domandare Giuseppe cosi.</i> Geographical translocation is not magic. Move enough Mexicans into California, you don’t make them Californians, you turn California into Mexico. I’ve seen the same thing over here on a smaller scale in British expat colonies where people who have lived in Italy for 15 years don’t speak more than 10 words of Italian, still drink tea instead of espresso and can’t cook worth a damn. Being there doesn’t feel like Italy, it feels like being in England, and more properly English than Londonistan is these days.</p><p>I should probably mention that if you’re going to try to disqualify me as an anti-Mexican racist simply because I observe the indisputable truth, my response is simple: <i>va fanculo</i>, my great-grandfather rode with Villa, fought with Villa, and barely escaped Villa’s assassins. The truth is the truth regardless of the genetic heritage of the individual observing it.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Riding-Red-Horse-Vox-Day-ebook/dp/B00QZD9H5K\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/07/RH1_900.jpg\" width=\"199\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/07/RH1_900.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20199%20320%22%3E%3C/svg%3E\" width=\"199\"/></a></div><p>The Israeli military historian Martin van Creveld has a brilliant essay on the martial implications of immigration that will be published in Volume 2 of <a href=\"http://www.amazon.com/Riding-Red-Horse-Vox-Day-ebook/dp/B00QZD9H5K\"><b><i>Riding the Red Horse</i></b></a>, which I am now beginning to assemble.<i> </i>And the remarkable thing is that he reaches a disturbingly similar conclusion to Heartiste’s well-known aphorism, Diversity + Proximity = War, only one that is even stronger. One reason the world is in the process of descending into war all over the globe is due to the unprecedented mass movement of peoples – as Umberto Eco pointed out more than a decade ago, to call it “immigration” is fundamentally a misnomer – and the sheer scale of these mass movements makes war inevitable.</p><p>Remember, the entry of the Nazis into Austria was arguably more legal than the actions of the Obama administration with regards to immigration. The Nazis even let the <strike>immigrated </strike>invaded Austrians vote on it in a national referendum, which is something neither the Democrats and the Republican #cuckservatives would permit the American people. But the end result of the <i>Anschluss </i>was no different than the Nazi’s subsequent <strike>illegal immigration into </strike>invasion of Czechoslovakia, Nazi rule.</p><p>I think Mike Cernovich’s definition of #cuckservative is probably the most useful one. If you are in any way an advocate for those who intend to rape and pillage you and yours, you are a #cuckservative. I also think that what we’re seeing is a generational divide. People my age and older tend to view things from a perspective of a permanent white majority. So, they tend to view everything from a view of racial noblesse oblige. They believe America’s success can be shared with the New Americans without that success being destroyed.</p><p>The younger generation of white Americans know better. They know they are just another racial group among many, larger, more divided, advantaged in some ways, disadvantaged in others, and with a target tattooed on their chests due to their historical “privilege”. Those inclined to buy into the rainbow mythology become SJWs or submissive moderates, those who are not don’t buy into any of it, including the various aspects of “melting pot” theology in which their conservative elders still foolishly believe. They know that what their elders still think to be theoretically achievable is impossible, because unlike their elders, they didn’t grow up with diversity being a theoretical objective to be celebrated, but a terrible reality to be suffered.</p><p>The most ridiculous thing about #cuckservatism is that it’s an inherently losing strategy. If your primary political objective is to avoid being called racist, you will lose. And then you will be called racist anyhow.</p></div>",
  "content_text": "The recent hashtag fireworks between the pro-immigration and anti-immigration right appears to be the second step of a long-awaited political battle that I have expected for more than a decade now. For years, conservatives afraid of being called racist have stupidly attempted to finesse the immigration issue, claiming that “it’s not the immigration, it’s the illegality” while loudly declaring their support for LEGAL immigration to balance their opposition to ILLEGAL immigration. But the distinction was always meaningless; the behavior of the individual immigrant and the cumulative effects of mass immigration have historically had nothing to do with the legality or illegality of the act of immigration. The intra-Right conflict we’re seeing now is in part the result of the Obama Administration punching right through that ridiculous position by simply legalizing larger-scale immigration than before. This is the second step of the battle; the first step was the publication of Ann Coulter’s\nAdios America\n, which marked the first time a major American conservative media figure besides Pat Buchanan had the courage to finally come out and admit that the real problem with immigration is a) the quality of the immigrants, and b) the quantity of the immigrants.\nI am an immigrant myself; my children are second-generation immigrants. Keep in mind that to the extent you consider us to be more-or-less normal Americans, that is precisely how all of the first- and second-generation Mexicans, Chinese, Somalis, and Nigerians living in America are still more-or-less normal Mexicans, Chinese, Somalis, and Nigerians. The only difference is that we’ve been here longer, we’re more integrated, and we speak the language.\nPotete domandare Giuseppe cosi.\nGeographical translocation is not magic. Move enough Mexicans into California, you don’t make them Californians, you turn California into Mexico. I’ve seen the same thing over here on a smaller scale in British expat colonies where people who have lived in Italy for 15 years don’t speak more than 10 words of Italian, still drink tea instead of espresso and can’t cook worth a damn. Being there doesn’t feel like Italy, it feels like being in England, and more properly English than Londonistan is these days.\nI should probably mention that if you’re going to try to disqualify me as an anti-Mexican racist simply because I observe the indisputable truth, my response is simple:\nva fanculo\n, my great-grandfather rode with Villa, fought with Villa, and barely escaped Villa’s assassins. The truth is the truth regardless of the genetic heritage of the individual observing it.\nThe Israeli military historian Martin van Creveld has a brilliant essay on the martial implications of immigration that will be published in Volume 2 of\nRiding the Red Horse\n, which I am now beginning to assemble.\nAnd the remarkable thing is that he reaches a disturbingly similar conclusion to Heartiste’s well-known aphorism, Diversity + Proximity = War, only one that is even stronger. One reason the world is in the process of descending into war all over the globe is due to the unprecedented mass movement of peoples – as Umberto Eco pointed out more than a decade ago, to call it “immigration” is fundamentally a misnomer – and the sheer scale of these mass movements makes war inevitable.\nRemember, the entry of the Nazis into Austria was arguably more legal than the actions of the Obama administration with regards to immigration. The Nazis even let the\nimmigrated\ninvaded Austrians vote on it in a national referendum, which is something neither the Democrats and the Republican #cuckservatives would permit the American people. But the end result of the\nAnschluss\nwas no different than the Nazi’s subsequent\nillegal immigration into\ninvasion of Czechoslovakia, Nazi rule.\nI think Mike Cernovich’s definition of #cuckservative is probably the most useful one. If you are in any way an advocate for those who intend to rape and pillage you and yours, you are a #cuckservative. I also think that what we’re seeing is a generational divide. People my age and older tend to view things from a perspective of a permanent white majority. So, they tend to view everything from a view of racial noblesse oblige. They believe America’s success can be shared with the New Americans without that success being destroyed.\nThe younger generation of white Americans know better. They know they are just another racial group among many, larger, more divided, advantaged in some ways, disadvantaged in others, and with a target tattooed on their chests due to their historical “privilege”. Those inclined to buy into the rainbow mythology become SJWs or submissive moderates, those who are not don’t buy into any of it, including the various aspects of “melting pot” theology in which their conservative elders still foolishly believe. They know that what their elders still think to be theoretically achievable is impossible, because unlike their elders, they didn’t grow up with diversity being a theoretical objective to be celebrated, but a terrible reality to be suffered.\nThe most ridiculous thing about #cuckservatism is that it’s an inherently losing strategy. If your primary political objective is to avoid being called racist, you will lose. And then you will be called racist anyhow.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-26T09:10:00+00:00"
}