{
  "url": "https://voxday.net/2015/07/29/the-missed-opportunity/",
  "scraped_at": "2025-12-17T17:21:20.477383",
  "title": "The missed opportunity",
  "date_display": "July 29, 2015",
  "date_iso": "2015-07-29T12:53:00+00:00",
  "date_from_url": "2015-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An influential GamerGater, The Ralph Retort, supports Milo’s point about the conservative media <a href=\"http://theralphretort.com/master-milo-calls-out-conservative-media-says-they-blew-it-on-gamergate-7028015/\">completely missing the opportunity</a> presented by #GamerGate:</p><blockquote class=\"tr_bq\"><p> At the beginning of GamerGate, I was still a card-carrying liberal.<br> Even though I had become disillusioned with my party, I had yet to<br> switch my official affiliation. It’s not that I’ve changed <b><i>all</i> </b>my<br> positions or radically departed from my past. I just feel like my own<br> party’s thought leaders have left me behind in a very real way. I was<br> being called right-wing by people who had never done any real activism<br> or volunteering at all. They sat on Twitter and spammed #killallmen<br> constantly, so that made them good leftists. Fuck that shit and fuck<br> anyone who subscribes to it. I don’t have to toe their line, and I<br> won’t.</br></br></br></br></br></br></br></br></br></p><p>Don’t get me wrong: rank-and-file Democrats still disagree with these<br> people on radical feminism. I was just personally tired of being called<br> out over PC concerns and feminist bullshit. Plus, both parties are so<br> fucking corrupt that I don’t see a point in giving either one my vote<br> automatically. So, that’s why I personally switched. Even from the<br> start, though, I was willing to put any kind of political affiliation to<br> the side in order to fight SJWs. I saw Milo’s <a href=\"https://archive.is/gRwyj\">very first thread</a><br> on 4chan. Some people were up in arms that we were going to be<br> identified as a conservative movement. What these dopes failed to<br> realize was, we were always going to be labeled as right-wing by the<br> media. I already knew it simply because I had been experiencing it for<br> years, like I just told you.</br></br></br></br></br></br></br></br></br></br></br></p><p>This whole time, I kept waiting for the conservative media to jump<br> in, en masse. It never really happened. I guess some of them were too<br> cowardly to go up against the feminists. Maybe they were afraid to be<br> falsely labeled as harassers. I don’t know what the problem was, but I<br> know we were waiting for their support and it never materialized. Where<br> was Fox News, for fuck’s sake? Talk radio? They left us out on the<br> battlefield by ourselves with Milo, <a href=\"http://theralphretort.com/anti-gamergate-matt-lees-christina-hoff-summers-scum/\">Based Mom</a>, <a href=\"http://theralphretort.com/based-aunt-cathy-young-calls-out-the-new-republic-for-citing-valenti-0221015/\">Cathy Young</a>, <a href=\"https://twitter.com/rsmccain\">R.S. McCain</a> (<a href=\"http://theothermccain.com/2015/07/21/congratulations-dishonest-fascists-gamergate-destroys-max-read/\">great column by him here</a>) and a couple others. <a href=\"http://theralphretort.com/theralph-interviews-mike-cernovich-author-of-the-new-book-gorilla-mindset-6026015/\">Mike Cernovich</a><br> stepped up as well, although I wouldn’t really call him establishment.<br> He’s been taking great glee at shitting on those guys all week. While I<br> like Ms. Young, I can certainly understand his frustration over some<br> things. I have it too.</br></br></br></br></br></br></br></br></br></br></p><p>There’s still time for them to jump in, but it does feel like they missed the boat last fall.</p></blockquote><p>I really thought that once anti-GamerGate managed to get Anita Sarkeesian in TIME and have GG pilloried in televised dramas as well as in the Washington Post, Fox News was going to recognize it as a story and jump in. But for some reason, they never did. Nor, as Ralph observes, did any of the major talkers or columnists, not even any of the younger ones that you would expect to be at least somewhat conversant with games.</p><p>I suspect that there were multiple reasons for this, generational, political, and tonal.</p><p>I’m about as old as a gamer in the media gets. There is a very clear divide between people who are only one or two years older than I am and everyone younger. The conservative media is pretty old, and many of the younger media figures are female. So, I strongly suspect that most of the conservative media figures who were peripherally aware of #GamerGate simply couldn’t make heads or tails of what was going on. And, as we’ve seen with “cuckservative”, they are really uncomfortable with the vulgar way that gamers, especially channers, communicate.</p><p>On the political side, conservatives are almost as afraid of being accused of being sexist as racist. So, the fact that the media so readily swallowed and pushed the “gamers are harassing poor defenseless women” pretty much guaranteed that the conservative media would be about as likely to get on board with GamerGate as with ISIS. And, as we’ve seen with “cuckservative”, about all that is needed to keep the conservative media away is to cry raciss.</p><p>And then there is the tonal aspect. The conservative media, for all its pretensions, is moderate at heart. They spend as much time tone-policing and denouncing the “extremists” on the right as they do attacking the left. Since the GamerGate tone is cheerfully extremist, the conservative media was always more likely to take shots at it than support it.</p><p>Granted, the success that both GamerGate and the Puppies have had is causing some in the conservative media to come around a little. That, and the fact that the mainstream organizations they follow, such as NPR and the Wall Street Journal, are paying attention, albeit negative, to GG and the Puppies, has caused them to take another look. But given their reaction to “cuckservative” and Trump, I expect most of them to continue to largely ignore GamerGate until the next big success or two.</p><p>At that point, no doubt we’ll see books like <i>The GamerGate Manifesto</i> and <i>The New Puppy Order</i> being written by people who have never had anything to do with either GamerGate or the Puppies and published by Regnery. It’s not until the coopters and self-seekers and parade-leaders show up that one knows a movement has truly broken through to the mainstream.</p><p>And I think the shills will be very surprised to learn what sort of reception they’ll get. GG ain’t no tea party and Rabid Puppies won’t hesitate to tear off the hand that tries to put the leash on.</p></div>",
  "content_text": "An influential GamerGater, The Ralph Retort, supports Milo’s point about the conservative media\ncompletely missing the opportunity\npresented by #GamerGate:\nAt the beginning of GamerGate, I was still a card-carrying liberal.\nEven though I had become disillusioned with my party, I had yet to\nswitch my official affiliation. It’s not that I’ve changed\nall\nmy\npositions or radically departed from my past. I just feel like my own\nparty’s thought leaders have left me behind in a very real way. I was\nbeing called right-wing by people who had never done any real activism\nor volunteering at all. They sat on Twitter and spammed #killallmen\nconstantly, so that made them good leftists. Fuck that shit and fuck\nanyone who subscribes to it. I don’t have to toe their line, and I\nwon’t.\nDon’t get me wrong: rank-and-file Democrats still disagree with these\npeople on radical feminism. I was just personally tired of being called\nout over PC concerns and feminist bullshit. Plus, both parties are so\nfucking corrupt that I don’t see a point in giving either one my vote\nautomatically. So, that’s why I personally switched. Even from the\nstart, though, I was willing to put any kind of political affiliation to\nthe side in order to fight SJWs. I saw Milo’s\nvery first thread\non 4chan. Some people were up in arms that we were going to be\nidentified as a conservative movement. What these dopes failed to\nrealize was, we were always going to be labeled as right-wing by the\nmedia. I already knew it simply because I had been experiencing it for\nyears, like I just told you.\nThis whole time, I kept waiting for the conservative media to jump\nin, en masse. It never really happened. I guess some of them were too\ncowardly to go up against the feminists. Maybe they were afraid to be\nfalsely labeled as harassers. I don’t know what the problem was, but I\nknow we were waiting for their support and it never materialized. Where\nwas Fox News, for fuck’s sake? Talk radio? They left us out on the\nbattlefield by ourselves with Milo,\nBased Mom\n,\nCathy Young\n,\nR.S. McCain\n(\ngreat column by him here\n) and a couple others.\nMike Cernovich\nstepped up as well, although I wouldn’t really call him establishment.\nHe’s been taking great glee at shitting on those guys all week. While I\nlike Ms. Young, I can certainly understand his frustration over some\nthings. I have it too.\nThere’s still time for them to jump in, but it does feel like they missed the boat last fall.\nI really thought that once anti-GamerGate managed to get Anita Sarkeesian in TIME and have GG pilloried in televised dramas as well as in the Washington Post, Fox News was going to recognize it as a story and jump in. But for some reason, they never did. Nor, as Ralph observes, did any of the major talkers or columnists, not even any of the younger ones that you would expect to be at least somewhat conversant with games.\nI suspect that there were multiple reasons for this, generational, political, and tonal.\nI’m about as old as a gamer in the media gets. There is a very clear divide between people who are only one or two years older than I am and everyone younger. The conservative media is pretty old, and many of the younger media figures are female. So, I strongly suspect that most of the conservative media figures who were peripherally aware of #GamerGate simply couldn’t make heads or tails of what was going on. And, as we’ve seen with “cuckservative”, they are really uncomfortable with the vulgar way that gamers, especially channers, communicate.\nOn the political side, conservatives are almost as afraid of being accused of being sexist as racist. So, the fact that the media so readily swallowed and pushed the “gamers are harassing poor defenseless women” pretty much guaranteed that the conservative media would be about as likely to get on board with GamerGate as with ISIS. And, as we’ve seen with “cuckservative”, about all that is needed to keep the conservative media away is to cry raciss.\nAnd then there is the tonal aspect. The conservative media, for all its pretensions, is moderate at heart. They spend as much time tone-policing and denouncing the “extremists” on the right as they do attacking the left. Since the GamerGate tone is cheerfully extremist, the conservative media was always more likely to take shots at it than support it.\nGranted, the success that both GamerGate and the Puppies have had is causing some in the conservative media to come around a little. That, and the fact that the mainstream organizations they follow, such as NPR and the Wall Street Journal, are paying attention, albeit negative, to GG and the Puppies, has caused them to take another look. But given their reaction to “cuckservative” and Trump, I expect most of them to continue to largely ignore GamerGate until the next big success or two.\nAt that point, no doubt we’ll see books like\nThe GamerGate Manifesto\nand\nThe New Puppy Order\nbeing written by people who have never had anything to do with either GamerGate or the Puppies and published by Regnery. It’s not until the coopters and self-seekers and parade-leaders show up that one knows a movement has truly broken through to the mainstream.\nAnd I think the shills will be very surprised to learn what sort of reception they’ll get. GG ain’t no tea party and Rabid Puppies won’t hesitate to tear off the hand that tries to put the leash on.",
  "tags": [
    "#GamerGate",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-29T11:53:00+00:00"
}