{
  "url": "https://voxday.net/2015/07/27/the-great-ones-know/",
  "scraped_at": "2025-12-17T17:21:09.154036",
  "title": "The great ones know",
  "date_display": "July 27, 2015",
  "date_iso": "2015-07-27T12:00:00+00:00",
  "date_from_url": "2015-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A fascinating article <a href=\"http://www.telegraph.co.uk/culture/11757999/Haruki-Murakami-the-moment-I-knew-I-would-be-a-novelist.html\">by the great Japanese writer Haruki Murakami</a> about when he decided to become a novelist and how he developed his unique style:</p><blockquote class=\"tr_bq\"><p> To tell the truth, although I was reading all kinds of stuff, my<br> favourites being 19th-century Russian novels and American hard-boiled<br> detective stories, I had never taken a serious look at contemporary<br> Japanese fiction. Thus I had no idea what kind of Japanese novels were<br> being read at the time, or how I should write fiction in the Japanese<br> language.</br></br></br></br></br></p><p> For several months, I operated on pure guesswork,<br> adopting what seemed to be a likely style and running with it. When I<br> read through the result, though, I was far from impressed. It seemed to<br> fulfil the formal requirements of a novel, but it was somewhat boring,<br> and the book as a whole left me cold. If that’s the way the author<br> feels, I thought, a reader’s reaction will probably be even more<br> negative. Looks like I just don’t have what it takes, I thought<br> dejectedly. Under normal circumstances, it would have ended there – I<br> would have walked away. But the epiphany I had received on Jingu<br> Stadium’s grassy slope was still clearly etched in my mind.</br></br></br></br></br></br></br></br></br></p><p> In<br> retrospect, it was only natural that I was unable to produce a good<br> novel. It was a big mistake to assume that a guy like me who had never<br> written anything in his life could spin something brilliant right off<br> the bat. I was trying to accomplish the impossible. Give up trying to<br> write something sophisticated, I told myself. Forget all those<br> prescriptive ideas about “the novel” and “literature” and set down your<br> feelings and thoughts as they come to you, freely, in a way that you<br> like.</br></br></br></br></br></br></br></br></p><p>While it was easy to talk about setting down one’s impressions freely, doing it wasn’t all that simple. For a sheer beginner like myself it was especially hard. To make a fresh start, the first thing I had to do was get rid of my stack of manuscript paper and my fountain pen. As long as they were sitting in front of me, what I was doing felt like “literature”. In their place, I pulled out my old Olivetti typewriter from the closet. Then, as an experiment, I decided to write the opening of my novel in English. Since I was willing to try anything, I figured, why not give that a shot?</p><p>Needless to say, my ability in English composition didn’t amount to much. My vocabulary was severely limited, as was my command of English syntax. I could only write in simple, short sentences. Which meant that, however complex and numerous the thoughts running around my head might be, I couldn’t even attempt to set them down as they came to me. The language had to be simple, my ideas expressed in an easy-to-understand way, the descriptions stripped of all extraneous fat, the form made compact, and everything arranged to fit a container of limited size. The result was a rough, uncultivated kind of prose. As I struggled to express myself in that fashion, however, step by step, a distinctive rhythm began to take shape.</p><p>Since I was born and raised in Japan, the vocabulary and patterns of the Japanese language had filled the system that was me to bursting, like a barn crammed with livestock. When I sought to put my thoughts and feelings into words, those animals began to mill about, and the system crashed. Writing in a foreign language, with all the limitations that entailed, removed this obstacle. It also led me to discover that I could express my thoughts and feelings with a limited set of words and grammatical structures, as long as I combined them effectively and linked them together in a skilful manner. To sum up, I learnt that there was no need for a lot of difficult words – I didn’t have to try to impress people with beautiful turns of phrase.</p></blockquote><p>I found this fascinating, because as you may recall, I studied Japanese, and although I don’t speak it anymore, I retain enough of a sense of it that Murakami’s writing has never struck me as “translated” in the same sense that other Japanese writers do. I’d always just assumed that he had a better translator, but apparently it is the English structural influence that he imposes on his Japanese style that creates that effect.</p><p>One Murakami fan has observed: “When you read Murakami in Japanese, it’s almost like he’s translating his own writing from English.”</p><p>In any event, if you haven’t read Murakami, he’s well worth reading. He tends to stick to the same themes and Japanese fatalism runs through all of his works, but he always presents an interesting variation on those themes. My favorite Murakami novel is <i>A Wild Sheep Chase</i>. And I found it unsurprising to observe that the great ones usually recognize their own talent before others do:</p><blockquote class=\"tr_bq\"><p> That’s when it hit me. I was going to win the prize. And I was going to<br> go on to become a novelist who would enjoy some degree of success. It<br> was an audacious presumption, but I was sure at that moment that it<br> would happen. Completely sure. Not in a theoretical way but directly and<br> intuitively.</br></br></br></br></p></blockquote><p>That’s why I always laugh at those who claim that if someone openly states that they are X, it should be taken as evidence to the contrary. That’s totally false. From Ruth to Jordan, from Tolstoy to Murakami, the great ones always know it and they are not at all surprised by their own success. They expect it.</p></div>",
  "content_text": "A fascinating article\nby the great Japanese writer Haruki Murakami\nabout when he decided to become a novelist and how he developed his unique style:\nTo tell the truth, although I was reading all kinds of stuff, my\nfavourites being 19th-century Russian novels and American hard-boiled\ndetective stories, I had never taken a serious look at contemporary\nJapanese fiction. Thus I had no idea what kind of Japanese novels were\nbeing read at the time, or how I should write fiction in the Japanese\nlanguage.\nFor several months, I operated on pure guesswork,\nadopting what seemed to be a likely style and running with it. When I\nread through the result, though, I was far from impressed. It seemed to\nfulfil the formal requirements of a novel, but it was somewhat boring,\nand the book as a whole left me cold. If that’s the way the author\nfeels, I thought, a reader’s reaction will probably be even more\nnegative. Looks like I just don’t have what it takes, I thought\ndejectedly. Under normal circumstances, it would have ended there – I\nwould have walked away. But the epiphany I had received on Jingu\nStadium’s grassy slope was still clearly etched in my mind.\nIn\nretrospect, it was only natural that I was unable to produce a good\nnovel. It was a big mistake to assume that a guy like me who had never\nwritten anything in his life could spin something brilliant right off\nthe bat. I was trying to accomplish the impossible. Give up trying to\nwrite something sophisticated, I told myself. Forget all those\nprescriptive ideas about “the novel” and “literature” and set down your\nfeelings and thoughts as they come to you, freely, in a way that you\nlike.\nWhile it was easy to talk about setting down one’s impressions freely, doing it wasn’t all that simple. For a sheer beginner like myself it was especially hard. To make a fresh start, the first thing I had to do was get rid of my stack of manuscript paper and my fountain pen. As long as they were sitting in front of me, what I was doing felt like “literature”. In their place, I pulled out my old Olivetti typewriter from the closet. Then, as an experiment, I decided to write the opening of my novel in English. Since I was willing to try anything, I figured, why not give that a shot?\nNeedless to say, my ability in English composition didn’t amount to much. My vocabulary was severely limited, as was my command of English syntax. I could only write in simple, short sentences. Which meant that, however complex and numerous the thoughts running around my head might be, I couldn’t even attempt to set them down as they came to me. The language had to be simple, my ideas expressed in an easy-to-understand way, the descriptions stripped of all extraneous fat, the form made compact, and everything arranged to fit a container of limited size. The result was a rough, uncultivated kind of prose. As I struggled to express myself in that fashion, however, step by step, a distinctive rhythm began to take shape.\nSince I was born and raised in Japan, the vocabulary and patterns of the Japanese language had filled the system that was me to bursting, like a barn crammed with livestock. When I sought to put my thoughts and feelings into words, those animals began to mill about, and the system crashed. Writing in a foreign language, with all the limitations that entailed, removed this obstacle. It also led me to discover that I could express my thoughts and feelings with a limited set of words and grammatical structures, as long as I combined them effectively and linked them together in a skilful manner. To sum up, I learnt that there was no need for a lot of difficult words – I didn’t have to try to impress people with beautiful turns of phrase.\nI found this fascinating, because as you may recall, I studied Japanese, and although I don’t speak it anymore, I retain enough of a sense of it that Murakami’s writing has never struck me as “translated” in the same sense that other Japanese writers do. I’d always just assumed that he had a better translator, but apparently it is the English structural influence that he imposes on his Japanese style that creates that effect.\nOne Murakami fan has observed: “When you read Murakami in Japanese, it’s almost like he’s translating his own writing from English.”\nIn any event, if you haven’t read Murakami, he’s well worth reading. He tends to stick to the same themes and Japanese fatalism runs through all of his works, but he always presents an interesting variation on those themes. My favorite Murakami novel is\nA Wild Sheep Chase\n. And I found it unsurprising to observe that the great ones usually recognize their own talent before others do:\nThat’s when it hit me. I was going to win the prize. And I was going to\ngo on to become a novelist who would enjoy some degree of success. It\nwas an audacious presumption, but I was sure at that moment that it\nwould happen. Completely sure. Not in a theoretical way but directly and\nintuitively.\nThat’s why I always laugh at those who claim that if someone openly states that they are X, it should be taken as evidence to the contrary. That’s totally false. From Ruth to Jordan, from Tolstoy to Murakami, the great ones always know it and they are not at all surprised by their own success. They expect it.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-27T11:00:00+00:00"
}