{
  "url": "https://voxday.net/2015/07/18/the-review-as-demolition/",
  "scraped_at": "2025-12-17T17:20:11.285263",
  "title": "The review as demolition",
  "date_display": "July 18, 2015",
  "date_iso": "2015-07-18T17:29:00+00:00",
  "date_from_url": "2015-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright considers the question of whether the great works of SF, Stranger in a Strange Land, also merit consideration <a href=\"http://www.scifiwright.com/2015/07/great-books-and-genre-books/\">as Great Books</a>:</p><blockquote class=\"tr_bq\"><p> <b>Stranger in a Strange Land</b></p><p>The conceit of this satire is that a Man from Mars views our earthly customs with innocent eyes, and sees their absurdity. A human baby orphaned on Mars and raised by highly-civilized but utterly inhuman Martians: as an adult he is brought back to Earth. Escaping from the intrigues of an unscrupulous government, and finding himself possessed of vast wealth, he wanders the world. When he finally understands the human condition, he starts a Church, trains Disciples, and is eventually martyred.</p><p>The theology is what we might call solipsistic libertarian pantheism: all self-aware creatures are God, and enjoy the privilege God has of disregarding the laws and customs of mankind. The Man from Mars preaches a doctrine remarkably like that of the Adamites and similar movements preaching nudism, communalism, pacifism, free love: the Adamites held themselves to be immune to Original Sin. One may do whatever one wishes, because the only law is that there is no law.</p><p>In case you don’t recognize it yet, what is being presented here as a profound new Martian religion is no more than the counter-cultural bromides of the Flower Generation.</p><p>As Gods, the members of the Martian Church are responsible to no higher power for their evil actions, but fortunately are so enlightened that they commit no evils they consider evil. The author merely has it be the case that Mike’s followers do not suffer from lust, or greed, or pride, or envy, and therefore they can share all goods in common, share concubines without any ill-will, and, for all I know, share each other’s toothbrushes without any risk of spreading bad breath. The Church suffers no schisms and no disputes or debates, because everyone is perfect. There is no St. Peter who denies his Lord. There is no Judas.</p><p>There is also no healing of the sick and no forgiveness of sins. Instead, Mike the Martian kills various people, such as hypocritical preachers or men guilty of no capital felonies found behind bars. But it is explained that since Martians believe in reincarnation, killing a scofflaw without benefit of trial is no crime; and keeping a man behind bars is an offense to human dignity, unlike, say, sharing a concubine, which is perfectly dignified.</p><p>Mike the Martian, raised by sexless creatures, has the attitude toward copulation one might expect from a totally ignorant and innocent nonhuman: he regards it as a pleasant recreation, or as a religious ecstasy. But for all his orgies, he never actually manages to father a family, or vow faithfulness to one woman. Neither he, nor anyone in the book, mentions any connection between the use of the reproductive organs and reproduction.</p><p>But Mike is a Nietzsche-style Superman, and therefore beyond good and evil: whatever he does, fornication or murder, is right and good by definition. You see, because he does not come from earth, and therefore has no experience or understanding of human things, his conclusions about how we should conduct ourselves is automatically right; the wisdom painfully gained over generations by our forefathers is worthy of nothing but scorn.</p><p>Mike is stoned to death by an angry mob at the end of the book, and he flies to heaven wearing a halo. I am not making this up: he has wings and a halo. This event has no set up in the plot: unlike a similar story in the Book of Matthew, there is no foreshadowing of the martyrdom, no metaphysical or theological purpose, and nothing in Mike’s previous preaching gives any indication that passive submission to violence is meritorious in his philosophy. It sort of just happens, and we are supposed to feel sad and angry at the stupid yokels in the mob. (Please note the mob is white Christian Americans, probably from the Deep South. They are not outraged Muslims, or even irate Sikhs or Hindus. It was not even a crowd of unruly Irishmen. This would not have served the author’s purpose.) Whether or not the mob contained any persons whose relatives were killed, or daughters seduced, by the Man from Mars is not stated.</p><p>We are assured (in his last bit of dialog with Jubal Hershaw, his mentor) that Mike’s followers will carry on spreading the Gospel of Free Love, and will come to rule everyone else: the stupid people will all die out.</p><p>Even objecting to the eating of human flesh is regarded with righteous indignation. Not the cannibalism: that is merely a custom worthy of respect. The objection is what is objectionable, so much so that the Righteous are morally obligated to discharge loyal employees from the work whereby they earn their bread, and throw them out into the street with scorn, if they voice any queasy reservations. Does someone have even the most minimal standards of human conduct, such as even the most remote ages of history learned at the dawn of time? He is a sinner! Virtue consists only of having no virtues at all!</p><p>The moral of the story: religion is a scam, marriage is a trap, people are stupid, do as you please when you please to whomever you please. Such is the message carried from a superior civilization to the poor backward dolts on Earth. Oh, brother.</p><p>    Timeless? Being a satire is no disqualification here. Jonathon Swift’s GULLIVER’S TRAVELS is just as critical of human laws and customs, and it is timeless. A story about a lone iconoclast, a Diogenes-style cynic mocking the Pharisees will always have an appeal. If the author had stuck to mockery, and not gone out of his way to advertise the Adamite heresy, I might call this timeless. The whole philosophy of irresponsibility popular since 1968 has had a sufficiently obvious effect in increasing the sum of human misery that I doubt it can maintain its appeal. Whatever preaches disregard for the long term, either in marriage or in war, has nothing to say once the long term arrives.<br>    Infinitely Re-Readable? My personal experience has met no book that wore out its welcome more quickly and more completely. I found it a delight to read when I was a child and thought as a child, for I was eager to hear that my childish impulses and little teen lusts were a sign of my great mental and moral superiority over The Stupid People (by which I meant my elders to whom I owed obedience). Flattering the innocent wears thin on a second rereading, when they are not so innocent. The unserious copulations with unmarried women seemed, on rereading, as unrealistic as the amours of James Bond: mere sexual fantasy. When I read the book again as a grown-up, the book was a chore to read. Far from being re-readable, this is a shallow book that gets shallower on every return visit.The ideas presented are so comical, and so comically naive, one wonders if the author intended an irony: the Martian-raised man is ignorant of human nature, so that when he attempts to put into practice ideas that could never work on Earth, he is justly killed for his inability to adapt to reality.I seem to recall a similar scene in GLORY ROAD, where Oscar the hero is upbraided as a fool by his fiancee, Star the Sexy Space-Empress, because he refuses to have an orgy with the attractive wife and three attractive daughters (one underage) of his generous wife-sharing host. It is explicitly stated there that those who do not adapt to the customs of their hosts are fools deserving death. I do not recall any scene in any Heinlein book where the hero is traveling among Puritans or pious Muslims and adopts the chastity and reserve in fashion among his hosts. For that matter, I don’t recall a scene where the hero has to sleep with the ugly wife of a generous Eskimo to avoid offending his host. Apparently the rule of doing as the Romans do when in Rome is restricted to the times when Romans are having an orgy, and, at that, only when pretty people are invited.</br></p><p>    Relevant? There is talk in here about the nature of justice and the family and God and art. So at least some deeper points are addressed. But the work is certainly relevant, if not to the Great Conversa<br> tion among the Great Books, then at least to the Good Conversation among Good SF.STRANGER broke new ground by breaking conventions, and is among the first SF to attract a wider attention outside the genre. A book meets this criterion if the books that come after it, in this case, later SF books, have to take into account what the author has done here, and take a stance for or against, lest they risk being dismissed as irrelevant. For better or worse (I think it very much for the worse) the notion of moral and cultural relativism, once raised in this book, eliminates the possibility of an alien planet or alien culture being portrayed as having our values and our philosophy: if such a planet is portrayed, the author must give a convincing explanation to account for the similarity.A clean-limbed fighting man of Virginia landing on Mars and rescuing a princess from a four-armed Green Martian cannot now simply marry the girl, without the reader wondering about their marriage customs.</br></p><p>Let us turn to our next three criteria:</p><p>    Is the language graceful? This is not a fair criterion for a satire: one must ask a satire if it is biting or witty or funny, with that peculiar acrid humor natural to satire. I would say at least in part this book matches that criteria: there are quotable lines. The word “Grok” has entered at least partly into the popular vocabulary.2. Are the characters multifaceted and natural? Well, Jubal Hershaw is a character that is memorable. I remember him in all the other Heinlein books also, include A TRAMP ROYALE, which was autobiographical. You sort of know the kind of things he’ll do and say: he has a Mark Twain sense of humor and a Nietzsche contempt for the common man. He is a hedonist, selfish and ornery, a self-made man. He is a soapbox for his author’s voice. The other characters in the book are either two-word descriptions (the ornery newshound, the phony preacher, the crooked politician) or one-word descriptions (the girl). I seem to recall that there are four characters fitting that description “the girl”, and they are as alike as the sexbots from AUSTIN POWERS. Mike had to memorize their pores and freckles to tell them apart, but the author does not give us even that.No character ever steps out of character: the crooked politician never shows a moment of honesty, the phony preacher does not have a wife and family, the ornery newshound does not have a hobby or a past or a pet peeve.</p><p>    3. Is the book wise? This may well be the shallowest book I have ever read, bar none. Something like GALACTIC PATROL, or CHESSMEN OF MARS, pure heedless adventure, is actually deeper and wiser than this dressed-up preachy-book praising adultery, anarchy and atheism: it is shallower than a shallow book because it pretends to be deep. In real life one might be called upon to act as boldly and thoughtfully as the Gray Lensman or with the unselfconscious chivalry and hardihood as the Warlord of Mars. A simple paragon of honesty and bravery is actually a more profound moral philosophy than a simple disregard of moral philosophy.</p><p>Is it a good Science Fiction book? Yes indeed! I dislike this book intensely, even loathe it, for it deceived me in my youth, and lying to a child is a vile crime. But judging the innate worth of a book is not about whether one like or hates it. This book does the thing that Science Fiction is meant to do: it looks at the Earth through alien eyes, it evokes a sense of wonder, it paints a future different from our present, yet close enough to our present to make cutting comments about it.</p><p>As philosophy, the book is trite, and the message is the message of the serpent of Eden: break the laws that have been placed on you, and you shall be like unto a god! This is heady stuff, and it is easy to get intoxicated, and very easy, horribly easy, to ruin your life and the lives of innocent people around you following self-centered and idiotic ideas like the ones painted to seem so attractive here.</p><p>But as art for art’s sake, it is a perfectly workmanlike product, even a superior product. Despite certain lopsidedness in the plot pacing, STRANGER is indeed classic SF from the Good Old Days. It has earned its place on the Baen Top Ten list. If this book had a soul that could be sent to hell, I would say it has also earned its place in the Eighth Circle of Dante’s Inferno: for it is a malignant fraud.</p></blockquote><p>So, I’ll take it that’s a no?</p></div>",
  "content_text": "John C. Wright considers the question of whether the great works of SF, Stranger in a Strange Land, also merit consideration\nas Great Books\n:\nStranger in a Strange Land\nThe conceit of this satire is that a Man from Mars views our earthly customs with innocent eyes, and sees their absurdity. A human baby orphaned on Mars and raised by highly-civilized but utterly inhuman Martians: as an adult he is brought back to Earth. Escaping from the intrigues of an unscrupulous government, and finding himself possessed of vast wealth, he wanders the world. When he finally understands the human condition, he starts a Church, trains Disciples, and is eventually martyred.\nThe theology is what we might call solipsistic libertarian pantheism: all self-aware creatures are God, and enjoy the privilege God has of disregarding the laws and customs of mankind. The Man from Mars preaches a doctrine remarkably like that of the Adamites and similar movements preaching nudism, communalism, pacifism, free love: the Adamites held themselves to be immune to Original Sin. One may do whatever one wishes, because the only law is that there is no law.\nIn case you don’t recognize it yet, what is being presented here as a profound new Martian religion is no more than the counter-cultural bromides of the Flower Generation.\nAs Gods, the members of the Martian Church are responsible to no higher power for their evil actions, but fortunately are so enlightened that they commit no evils they consider evil. The author merely has it be the case that Mike’s followers do not suffer from lust, or greed, or pride, or envy, and therefore they can share all goods in common, share concubines without any ill-will, and, for all I know, share each other’s toothbrushes without any risk of spreading bad breath. The Church suffers no schisms and no disputes or debates, because everyone is perfect. There is no St. Peter who denies his Lord. There is no Judas.\nThere is also no healing of the sick and no forgiveness of sins. Instead, Mike the Martian kills various people, such as hypocritical preachers or men guilty of no capital felonies found behind bars. But it is explained that since Martians believe in reincarnation, killing a scofflaw without benefit of trial is no crime; and keeping a man behind bars is an offense to human dignity, unlike, say, sharing a concubine, which is perfectly dignified.\nMike the Martian, raised by sexless creatures, has the attitude toward copulation one might expect from a totally ignorant and innocent nonhuman: he regards it as a pleasant recreation, or as a religious ecstasy. But for all his orgies, he never actually manages to father a family, or vow faithfulness to one woman. Neither he, nor anyone in the book, mentions any connection between the use of the reproductive organs and reproduction.\nBut Mike is a Nietzsche-style Superman, and therefore beyond good and evil: whatever he does, fornication or murder, is right and good by definition. You see, because he does not come from earth, and therefore has no experience or understanding of human things, his conclusions about how we should conduct ourselves is automatically right; the wisdom painfully gained over generations by our forefathers is worthy of nothing but scorn.\nMike is stoned to death by an angry mob at the end of the book, and he flies to heaven wearing a halo. I am not making this up: he has wings and a halo. This event has no set up in the plot: unlike a similar story in the Book of Matthew, there is no foreshadowing of the martyrdom, no metaphysical or theological purpose, and nothing in Mike’s previous preaching gives any indication that passive submission to violence is meritorious in his philosophy. It sort of just happens, and we are supposed to feel sad and angry at the stupid yokels in the mob. (Please note the mob is white Christian Americans, probably from the Deep South. They are not outraged Muslims, or even irate Sikhs or Hindus. It was not even a crowd of unruly Irishmen. This would not have served the author’s purpose.) Whether or not the mob contained any persons whose relatives were killed, or daughters seduced, by the Man from Mars is not stated.\nWe are assured (in his last bit of dialog with Jubal Hershaw, his mentor) that Mike’s followers will carry on spreading the Gospel of Free Love, and will come to rule everyone else: the stupid people will all die out.\nEven objecting to the eating of human flesh is regarded with righteous indignation. Not the cannibalism: that is merely a custom worthy of respect. The objection is what is objectionable, so much so that the Righteous are morally obligated to discharge loyal employees from the work whereby they earn their bread, and throw them out into the street with scorn, if they voice any queasy reservations. Does someone have even the most minimal standards of human conduct, such as even the most remote ages of history learned at the dawn of time? He is a sinner! Virtue consists only of having no virtues at all!\nThe moral of the story: religion is a scam, marriage is a trap, people are stupid, do as you please when you please to whomever you please. Such is the message carried from a superior civilization to the poor backward dolts on Earth. Oh, brother.\nTimeless? Being a satire is no disqualification here. Jonathon Swift’s GULLIVER’S TRAVELS is just as critical of human laws and customs, and it is timeless. A story about a lone iconoclast, a Diogenes-style cynic mocking the Pharisees will always have an appeal. If the author had stuck to mockery, and not gone out of his way to advertise the Adamite heresy, I might call this timeless. The whole philosophy of irresponsibility popular since 1968 has had a sufficiently obvious effect in increasing the sum of human misery that I doubt it can maintain its appeal. Whatever preaches disregard for the long term, either in marriage or in war, has nothing to say once the long term arrives.\nInfinitely Re-Readable? My personal experience has met no book that wore out its welcome more quickly and more completely. I found it a delight to read when I was a child and thought as a child, for I was eager to hear that my childish impulses and little teen lusts were a sign of my great mental and moral superiority over The Stupid People (by which I meant my elders to whom I owed obedience). Flattering the innocent wears thin on a second rereading, when they are not so innocent. The unserious copulations with unmarried women seemed, on rereading, as unrealistic as the amours of James Bond: mere sexual fantasy. When I read the book again as a grown-up, the book was a chore to read. Far from being re-readable, this is a shallow book that gets shallower on every return visit.The ideas presented are so comical, and so comically naive, one wonders if the author intended an irony: the Martian-raised man is ignorant of human nature, so that when he attempts to put into practice ideas that could never work on Earth, he is justly killed for his inability to adapt to reality.I seem to recall a similar scene in GLORY ROAD, where Oscar the hero is upbraided as a fool by his fiancee, Star the Sexy Space-Empress, because he refuses to have an orgy with the attractive wife and three attractive daughters (one underage) of his generous wife-sharing host. It is explicitly stated there that those who do not adapt to the customs of their hosts are fools deserving death. I do not recall any scene in any Heinlein book where the hero is traveling among Puritans or pious Muslims and adopts the chastity and reserve in fashion among his hosts. For that matter, I don’t recall a scene where the hero has to sleep with the ugly wife of a generous Eskimo to avoid offending his host. Apparently the rule of doing as the Romans do when in Rome is restricted to the times when Romans are having an orgy, and, at that, only when pretty people are invited.\nRelevant? There is talk in here about the nature of justice and the family and God and art. So at least some deeper points are addressed. But the work is certainly relevant, if not to the Great Conversa\ntion among the Great Books, then at least to the Good Conversation among Good SF.STRANGER broke new ground by breaking conventions, and is among the first SF to attract a wider attention outside the genre. A book meets this criterion if the books that come after it, in this case, later SF books, have to take into account what the author has done here, and take a stance for or against, lest they risk being dismissed as irrelevant. For better or worse (I think it very much for the worse) the notion of moral and cultural relativism, once raised in this book, eliminates the possibility of an alien planet or alien culture being portrayed as having our values and our philosophy: if such a planet is portrayed, the author must give a convincing explanation to account for the similarity.A clean-limbed fighting man of Virginia landing on Mars and rescuing a princess from a four-armed Green Martian cannot now simply marry the girl, without the reader wondering about their marriage customs.\nLet us turn to our next three criteria:\nIs the language graceful? This is not a fair criterion for a satire: one must ask a satire if it is biting or witty or funny, with that peculiar acrid humor natural to satire. I would say at least in part this book matches that criteria: there are quotable lines. The word “Grok” has entered at least partly into the popular vocabulary.2. Are the characters multifaceted and natural? Well, Jubal Hershaw is a character that is memorable. I remember him in all the other Heinlein books also, include A TRAMP ROYALE, which was autobiographical. You sort of know the kind of things he’ll do and say: he has a Mark Twain sense of humor and a Nietzsche contempt for the common man. He is a hedonist, selfish and ornery, a self-made man. He is a soapbox for his author’s voice. The other characters in the book are either two-word descriptions (the ornery newshound, the phony preacher, the crooked politician) or one-word descriptions (the girl). I seem to recall that there are four characters fitting that description “the girl”, and they are as alike as the sexbots from AUSTIN POWERS. Mike had to memorize their pores and freckles to tell them apart, but the author does not give us even that.No character ever steps out of character: the crooked politician never shows a moment of honesty, the phony preacher does not have a wife and family, the ornery newshound does not have a hobby or a past or a pet peeve.\n3. Is the book wise? This may well be the shallowest book I have ever read, bar none. Something like GALACTIC PATROL, or CHESSMEN OF MARS, pure heedless adventure, is actually deeper and wiser than this dressed-up preachy-book praising adultery, anarchy and atheism: it is shallower than a shallow book because it pretends to be deep. In real life one might be called upon to act as boldly and thoughtfully as the Gray Lensman or with the unselfconscious chivalry and hardihood as the Warlord of Mars. A simple paragon of honesty and bravery is actually a more profound moral philosophy than a simple disregard of moral philosophy.\nIs it a good Science Fiction book? Yes indeed! I dislike this book intensely, even loathe it, for it deceived me in my youth, and lying to a child is a vile crime. But judging the innate worth of a book is not about whether one like or hates it. This book does the thing that Science Fiction is meant to do: it looks at the Earth through alien eyes, it evokes a sense of wonder, it paints a future different from our present, yet close enough to our present to make cutting comments about it.\nAs philosophy, the book is trite, and the message is the message of the serpent of Eden: break the laws that have been placed on you, and you shall be like unto a god! This is heady stuff, and it is easy to get intoxicated, and very easy, horribly easy, to ruin your life and the lives of innocent people around you following self-centered and idiotic ideas like the ones painted to seem so attractive here.\nBut as art for art’s sake, it is a perfectly workmanlike product, even a superior product. Despite certain lopsidedness in the plot pacing, STRANGER is indeed classic SF from the Good Old Days. It has earned its place on the Baen Top Ten list. If this book had a soul that could be sent to hell, I would say it has also earned its place in the Eighth Circle of Dante’s Inferno: for it is a malignant fraud.\nSo, I’ll take it that’s a no?",
  "tags": [
    "Book Review",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-18T16:29:00+00:00"
}