{
  "url": "https://voxday.net/2015/07/09/the-war-at-tor/",
  "scraped_at": "2025-12-16T13:02:41.281288",
  "title": "The war at Tor",
  "date_display": "July 9, 2015",
  "date_iso": "2015-07-09T14:00:00+00:00",
  "date_from_url": "2015-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like a swan swimming across a pond, what looks like serenity from the outside often masks a tremendous amount of activity going on beneath the surface. Over the last few weeks I’ve had several conversations with executives at Tor Books, Macmillan, and Macmillan UK, and I can assure you that there is a very good reason for Mr. George Martin’s <a href=\"http://grrm.livejournal.com/432697.html\">sudden and repeated calls</a> for supporters of Irene Gallo and others at Tor Books to “denounce and oppose” the ongoing Tor boycott.</p><blockquote class=\"tr_bq\"><p> For those who want to stand up to the bullies and rabids and their Tor boycott, please note that SONGS OF THE DYING EARTH was published by Tor. (They were also Jack Vance’s publisher for most of the last few decades).  </p></blockquote><p>That was a pretty good anthology actually. Despite the best efforts of the various authors it seldom rose to full-blown Vancean heights, but I quite liked the Tanith Lee and John C. Wright stories it contained. What Martin appears to be trying to do with his multiple posts on the subject is make it harder for the executives at Macmillan to hold anyone at Tor Books responsible for their repeated violations of the Macmillan Code of Conduct or for their attacks on Tor’s authors and customers. And although Martin is unwilling to come right out and say it, he is offering an implicit threat that if Macmillan does the right thing and jettisons the unprofessional parties concerned, he and other SJWs will launch their own boycott of Tor and take their future books to other publishers.</p><p>The reason George is doing this now is because he knows what’s going on inside Tor thanks to his various contacts there. Things are getting very heated, as it has been reported that Patrick Nielsen Hayden has threatened to take his Scalzi (and other writers) and go elsewhere if either Irene Gallo or Moshe Feder are fired or forced to resign. Whether John Scalzi backs PNH to this extent or not (and if he is even aware of this threat on his behalf or not), I do not know, but I personally find it very difficult to believe that Scalzi would ever consent to put his ten-year contract with Tor Books in jeopardy for anyone’s sake. He may be grateful to PNH for launching and repeatedly propping up his career, but he’s not THAT grateful.</p><p>If it’s true that PNH is threatening to take his ball and go to DAW or some other publishing home, it’s an amateurish move that demonstrates the very sort of entitled unprofessionalism and poor decision-making that has put Tor Books into the current situation in the first place. But it shouldn’t be a surprise that PNH might be taking this line, as he would not be the only Tor-affiliated individual who to take such a stance. For example, Tor author Mary Robinette Kowal has already publicly threatened to return the advances for her next two books and take them elsewhere if Ms Gallo is fired.</p><blockquote class=\"tr_bq\"><p> ‏ @RizziWorld How about this. If they fire Irene, I will return the advances on my next two books and pull them.<br> 7:23 AM – <a href=\"https://twitter.com/MaryRobinette/status/610090148257267713\">14 Jun 2015</a></br></p></blockquote><p>What a noble gesture in support of an employee’s right to publicly attack the company’s customers! Anyhow, if Mr. Nielsen Hayden was in fact foolish enough to threaten his superiors in any way, I expect he will soon receive an object lesson in the realities of corporate power.</p><p>And for the witch hunters at Tor who are desperate to learn with whom I have been speaking, I am kind enough to give you one little hint. Go to <a href=\"http://twitter.com/voxday\">my Twitter account</a>, search through it, and see who has commented on my tweets. I think you will find the results to be illuminating.</p></div>",
  "content_text": "Like a swan swimming across a pond, what looks like serenity from the outside often masks a tremendous amount of activity going on beneath the surface. Over the last few weeks I’ve had several conversations with executives at Tor Books, Macmillan, and Macmillan UK, and I can assure you that there is a very good reason for Mr. George Martin’s\nsudden and repeated calls\nfor supporters of Irene Gallo and others at Tor Books to “denounce and oppose” the ongoing Tor boycott.\nFor those who want to stand up to the bullies and rabids and their Tor boycott, please note that SONGS OF THE DYING EARTH was published by Tor. (They were also Jack Vance’s publisher for most of the last few decades).\nThat was a pretty good anthology actually. Despite the best efforts of the various authors it seldom rose to full-blown Vancean heights, but I quite liked the Tanith Lee and John C. Wright stories it contained. What Martin appears to be trying to do with his multiple posts on the subject is make it harder for the executives at Macmillan to hold anyone at Tor Books responsible for their repeated violations of the Macmillan Code of Conduct or for their attacks on Tor’s authors and customers. And although Martin is unwilling to come right out and say it, he is offering an implicit threat that if Macmillan does the right thing and jettisons the unprofessional parties concerned, he and other SJWs will launch their own boycott of Tor and take their future books to other publishers.\nThe reason George is doing this now is because he knows what’s going on inside Tor thanks to his various contacts there. Things are getting very heated, as it has been reported that Patrick Nielsen Hayden has threatened to take his Scalzi (and other writers) and go elsewhere if either Irene Gallo or Moshe Feder are fired or forced to resign. Whether John Scalzi backs PNH to this extent or not (and if he is even aware of this threat on his behalf or not), I do not know, but I personally find it very difficult to believe that Scalzi would ever consent to put his ten-year contract with Tor Books in jeopardy for anyone’s sake. He may be grateful to PNH for launching and repeatedly propping up his career, but he’s not THAT grateful.\nIf it’s true that PNH is threatening to take his ball and go to DAW or some other publishing home, it’s an amateurish move that demonstrates the very sort of entitled unprofessionalism and poor decision-making that has put Tor Books into the current situation in the first place. But it shouldn’t be a surprise that PNH might be taking this line, as he would not be the only Tor-affiliated individual who to take such a stance. For example, Tor author Mary Robinette Kowal has already publicly threatened to return the advances for her next two books and take them elsewhere if Ms Gallo is fired.\n‏ @RizziWorld How about this. If they fire Irene, I will return the advances on my next two books and pull them.\n7:23 AM –\n14 Jun 2015\nWhat a noble gesture in support of an employee’s right to publicly attack the company’s customers! Anyhow, if Mr. Nielsen Hayden was in fact foolish enough to threaten his superiors in any way, I expect he will soon receive an object lesson in the realities of corporate power.\nAnd for the witch hunters at Tor who are desperate to learn with whom I have been speaking, I am kind enough to give you one little hint. Go to\nmy Twitter account\n, search through it, and see who has commented on my tweets. I think you will find the results to be illuminating.",
  "tags": [
    "Puppies",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-09T13:00:00+00:00"
}