{
  "url": "https://voxday.net/2015/07/01/the-hysteria-crescendos/",
  "scraped_at": "2025-12-16T13:01:36.206408",
  "title": "The hysteria crescendos",
  "date_display": "July 1, 2015",
  "date_iso": "2015-07-01T09:10:00+00:00",
  "date_from_url": "2015-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Hensley appears determined <a href=\"http://file770.com/?p=23448&amp;cpage=4#comment-299308\">to provide conclusive evidence</a> of the Three Laws of SJW:</p><blockquote class=\"tr_bq\"><p> <b>Chris Hensley on June 30, 2015 at 9:46 am said</b><br> I will make this point, again. I will repeat his point until I am blue in the face. Vox Day and his Rabid Puppies are a hate group. They are extreme-right wing, white supremacist, homophobic thugs. Their actions are racist, misogynistic, homophobic and the list goes on. I have shown my evidence of their bigotry, repeatedly. Everyone else who has made those claims here has shown their evidence, repeatedly. You have not shown a shred of evidence to the contrary. There is no war, there are no sides. The only people talking about a war are Vox Day and his supporters. They are thugs, because they behave like thugs. Despite your claims to the contrary, they are not behaving as reasonable men. They are behaving as bullies and cowards.</br></p><p>You can admit those facts. You can provide evidence showing that their actions towards the Worldcon, Irene Gallo, and a great many others does not constitute harassment and cowardice. If you are willing to do neither then there is nothing to discuss. If you continue to defend their actions, if you cover for them while they harm others, then you share responsibility for those actions.</p></blockquote><p>We see all Three Laws of SJW on display here.</p><ul></ul><ol><li>SJWs always lie.</li><li>SJWs always double down.</li><li>SJWs always project.</li></ol><ul></ul><p>If this Hensley is to be taken seriously, a collection of individuals voting on an award, and doing so in considerably less lockstep than numerous <i>confirmed</i> historical bloc votes, are “a hate group”? Spending $40 and filling out a ballot makes us “thugs”? Indians and Latinos and Asians and blacks are “white supremacists?” A writer with a gay fan club and three electronic dance hits on a gay record label is “homophobic”? Simply not buying books from a publisher that has openly and publicly attacked us is “behaving as bullies and cowards”? Nominating books we like instead of books they like constitutes “harassment and cowardice”? </p><p>That is not taking liberties with the truth. That is not twisting and contorting the truth to present a false image. That is holding the truth hostage in the cellar, chaining it to a bed, and repeatedly raping it in a futile attempt to father a false narrative. It is very easy to observe that our actions are not <i>any </i>of the things the SJWs claim them to be. Entertainment Weekly had to issue multiple retractions after being foolish enough to take the SJW claims at face value. Other publications will eventually do the same.</p><p>But all the various lies that Chris Hensley and the other SJWs keep hurling in the futile hope that they will finally stick and disqualify aren’t interesting. Most of them are literal repetitions of the same narrative Johnny Con has been selling to no avail for several years now. What is interesting is how their level of hysteria has observably increased. Why, one wonders, is it necessary for them to lie until they are blue in the face? Why are they even more desperate to disqualify me now than they were back in April or May?</p><p>Why are they still babbling incoherently about us while simultaneously insisting on our totally irrelevant wrongness?</p><p>I don’t know. Perhaps they fear that the record influx of Supporting Members are not all reliable SJWs and Truefen flooding in to defend the Hugo Awards by voting to not give out any awards. Perhaps they notice that my site traffic has continue to rise, and that support for both Sad and Rabid Puppies continues to grow as more sane people observe the behavior of the SJWs and realize we were not exaggerating. Perhaps it is simply a reflection of the wider cultural war that has heated up of late. Perhaps it is a reflection of the economic instability that now haunts even those who don’t pay much attention to the economy. Perhaps it is because we use their tactics against them more effectively than they do.</p><p>But whatever the reason, it is clear that they are afraid of me, of you, and of the growing number of people who realize that they are incoherent lunatics who possess an insane and immoral vision for society. Let them hurl spurious labels and tell ridiculous lies. It’s what they do. We are immune to all their pointing and shrieking and posturing and preening attempts to DISQUALIFY.</p><p>We don’t care. And as for the idea that the “only people talking about a war are Vox Day and his supporters”, see: the First Law of SJW. And note that this reference to <a href=\"http://archive.is/Io4Vw\">a cultural war happening in fiction</a> precedes the existence of Rabid Puppies by five months.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CI0MoNpVAAA3ZtY.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://pbs.twimg.com/media/CI0MoNpVAAA3ZtY.png\" width=\"260\"/></a></div><p> UPDATE: Mike Glyer has noticed the increased activity as well.</p><blockquote class=\"tr_bq\"><p> Activity in June was so intense that 19 of last month’s posts now rank among this blog’s 25 most-viewed of all-time.<br> The reason is the huge amount of dialogue in the comments section. Five posts drew over 1,000 comments.<br> “Lord Foul’s Baying,” the June 14 roundup, is not only the month’s top post but trails only the photo essay about the Bradbury house teardown as this blog’s most-read entry. It collected over 1,300 comments.</br></br></p></blockquote><p>I’m sure that intensity is simply the result of the SJWs being <i>so</i> <i>interested </i>in talking about <i>the books they love</i>. It wouldn’t have anything to do with their insane obsession with shoring up their crumbling Puppy Narrative, as we are reliably informed that we don’t matter, we’re totally irrelevant, we’re only bots with a bunch of fake Twitter accounts, and absolutely no one pays any attention to anything we write, say, think, or boycott. Also, unrepentant bad-to-reprehensible racist misogynistic homophobic neo-Nazi hate group thugs.</p></div>",
  "content_text": "Chris Hensley appears determined\nto provide conclusive evidence\nof the Three Laws of SJW:\nChris Hensley on June 30, 2015 at 9:46 am said\nI will make this point, again. I will repeat his point until I am blue in the face. Vox Day and his Rabid Puppies are a hate group. They are extreme-right wing, white supremacist, homophobic thugs. Their actions are racist, misogynistic, homophobic and the list goes on. I have shown my evidence of their bigotry, repeatedly. Everyone else who has made those claims here has shown their evidence, repeatedly. You have not shown a shred of evidence to the contrary. There is no war, there are no sides. The only people talking about a war are Vox Day and his supporters. They are thugs, because they behave like thugs. Despite your claims to the contrary, they are not behaving as reasonable men. They are behaving as bullies and cowards.\nYou can admit those facts. You can provide evidence showing that their actions towards the Worldcon, Irene Gallo, and a great many others does not constitute harassment and cowardice. If you are willing to do neither then there is nothing to discuss. If you continue to defend their actions, if you cover for them while they harm others, then you share responsibility for those actions.\nWe see all Three Laws of SJW on display here.\nSJWs always lie.\nSJWs always double down.\nSJWs always project.\nIf this Hensley is to be taken seriously, a collection of individuals voting on an award, and doing so in considerably less lockstep than numerous\nconfirmed\nhistorical bloc votes, are “a hate group”? Spending $40 and filling out a ballot makes us “thugs”? Indians and Latinos and Asians and blacks are “white supremacists?” A writer with a gay fan club and three electronic dance hits on a gay record label is “homophobic”? Simply not buying books from a publisher that has openly and publicly attacked us is “behaving as bullies and cowards”? Nominating books we like instead of books they like constitutes “harassment and cowardice”?\nThat is not taking liberties with the truth. That is not twisting and contorting the truth to present a false image. That is holding the truth hostage in the cellar, chaining it to a bed, and repeatedly raping it in a futile attempt to father a false narrative. It is very easy to observe that our actions are not\nany\nof the things the SJWs claim them to be. Entertainment Weekly had to issue multiple retractions after being foolish enough to take the SJW claims at face value. Other publications will eventually do the same.\nBut all the various lies that Chris Hensley and the other SJWs keep hurling in the futile hope that they will finally stick and disqualify aren’t interesting. Most of them are literal repetitions of the same narrative Johnny Con has been selling to no avail for several years now. What is interesting is how their level of hysteria has observably increased. Why, one wonders, is it necessary for them to lie until they are blue in the face? Why are they even more desperate to disqualify me now than they were back in April or May?\nWhy are they still babbling incoherently about us while simultaneously insisting on our totally irrelevant wrongness?\nI don’t know. Perhaps they fear that the record influx of Supporting Members are not all reliable SJWs and Truefen flooding in to defend the Hugo Awards by voting to not give out any awards. Perhaps they notice that my site traffic has continue to rise, and that support for both Sad and Rabid Puppies continues to grow as more sane people observe the behavior of the SJWs and realize we were not exaggerating. Perhaps it is simply a reflection of the wider cultural war that has heated up of late. Perhaps it is a reflection of the economic instability that now haunts even those who don’t pay much attention to the economy. Perhaps it is because we use their tactics against them more effectively than they do.\nBut whatever the reason, it is clear that they are afraid of me, of you, and of the growing number of people who realize that they are incoherent lunatics who possess an insane and immoral vision for society. Let them hurl spurious labels and tell ridiculous lies. It’s what they do. We are immune to all their pointing and shrieking and posturing and preening attempts to DISQUALIFY.\nWe don’t care. And as for the idea that the “only people talking about a war are Vox Day and his supporters”, see: the First Law of SJW. And note that this reference to\na cultural war happening in fiction\nprecedes the existence of Rabid Puppies by five months.\nUPDATE: Mike Glyer has noticed the increased activity as well.\nActivity in June was so intense that 19 of last month’s posts now rank among this blog’s 25 most-viewed of all-time.\nThe reason is the huge amount of dialogue in the comments section. Five posts drew over 1,000 comments.\n“Lord Foul’s Baying,” the June 14 roundup, is not only the month’s top post but trails only the photo essay about the Bradbury house teardown as this blog’s most-read entry. It collected over 1,300 comments.\nI’m sure that intensity is simply the result of the SJWs being\nso\ninterested\nin talking about\nthe books they love\n. It wouldn’t have anything to do with their insane obsession with shoring up their crumbling Puppy Narrative, as we are reliably informed that we don’t matter, we’re totally irrelevant, we’re only bots with a bunch of fake Twitter accounts, and absolutely no one pays any attention to anything we write, say, think, or boycott. Also, unrepentant bad-to-reprehensible racist misogynistic homophobic neo-Nazi hate group thugs.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-01T08:10:00+00:00"
}