{
  "url": "https://voxday.net/2015/07/11/the-built-in-bias-of-wikipedia/",
  "scraped_at": "2025-12-16T13:02:53.845898",
  "title": "The built-in bias of Wikipedia",
  "date_display": "July 11, 2015",
  "date_iso": "2015-07-11T06:00:00+00:00",
  "date_from_url": "2015-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve commented before on how the editors at Wikipedia doggedly turn every article about a left-leaning public figure <a href=\"http://thefederalist.com/2014/09/18/why-is-wikipedia-deleting-all-references-to-neil-tysons-fabrication/\">into a defense case</a>, while every one about a right-wing figure is prosecutorial in nature:</p><blockquote class=\"tr_bq\"><p> Neil Tyson, a prominent popularizer of science (he even has his own television show) was recently found to have repeatedly fabricated multiple quotes over several years. The fabrications were not a one-off thing. They were deliberate and calculated, crafted with one goal in mind: to elevate Tyson, and by extension his audience, at the expense of know-nothing, knuckle-dragging nutjobs who hate science. Tyson targeted journalists, members of Congress, even former President George W. Bush. And what was their crime? They were guilty of rejecting science, according to Tyson.</p><p>There’s only one problem. None of the straw man quotes that Tyson uses to tear them down are real….</p><p>After I published my piece about Neil Tyson’s fabrication of the George W. Bush quote, several users edited <a href=\"http://en.wikipedia.org/wiki/Neil_deGrasse_Tyson\" rel=\"noopener\" target=\"_blank\">Neil Tyson’s wiki page</a><br> to include details of the quote fabrication controversy. The<br> fact-loving, evidence-weighing, ever-objective editors of the online<br> encyclopedia did not appreciate the inclusion of the evidence of Tyson’s<br> fabrication. Not at all.</br></br></br></br></p><div> According to a review of the <a href=\"http://en.wikipedia.org/w/index.php?title=Neil_deGrasse_Tyson&amp;action=history\" rel=\"noopener\" target=\"_blank\">edit history of Tyson’s page</a>,<br> one long-time Wikipedia editor deleted an entire pending section<br> summarizing the issue of Tyson’s fabricated quotes. Another editor<br> attempted to insert a brief mention of Tyson’s fabrication of the George<br> W. Bush quote. That mention was also deleted. When it was reinserted,<br> it was deleted yet again by an editor who describes himself as <a href=\"http://en.wikipedia.org/wiki/User:Zero_Serenity\" rel=\"noopener\" target=\"_blank\">a childless progressive and an apostle of Daily Kos</a> (h/t <a href=\"https://twitter.com/kerpen/status/512418987175862273\" rel=\"noopener\" target=\"_blank\">@kerpen</a>).<p>Literally every single mention of Tyson’s history of fabricating quotes has been removed from <a href=\"http://en.wikipedia.org/wiki/Neil_deGrasse_Tyson\" rel=\"noopener\" target=\"_blank\">Tyson’s Wikipedia page</a>.</p></br></br></br></br></br></div></blockquote><p>Meanwhile, the Wikipedia page about me contains more about NK Jemisin and John Scalzi than it does about a professional career that has been covered everywhere from the New York Times to Computer Gaming World, casts doubt on my heritage, and reduces my entire personal life to two of the four languages I speak. I mean, at the very least, you’d think they’d mention that I speak English, that my blog is the most highly trafficked one in science fiction and fantasy, or my son is the youngest male author ever published.</p><p>But, of course, anything that might reflect well on me, or poorly on Tyson, is something that the Wikipedia editors are determined to excise. And that’s why you should never take anything you read on Wikipedia as anything but a starting point.</p></div>",
  "content_text": "I’ve commented before on how the editors at Wikipedia doggedly turn every article about a left-leaning public figure\ninto a defense case\n, while every one about a right-wing figure is prosecutorial in nature:\nNeil Tyson, a prominent popularizer of science (he even has his own television show) was recently found to have repeatedly fabricated multiple quotes over several years. The fabrications were not a one-off thing. They were deliberate and calculated, crafted with one goal in mind: to elevate Tyson, and by extension his audience, at the expense of know-nothing, knuckle-dragging nutjobs who hate science. Tyson targeted journalists, members of Congress, even former President George W. Bush. And what was their crime? They were guilty of rejecting science, according to Tyson.\nThere’s only one problem. None of the straw man quotes that Tyson uses to tear them down are real….\nAfter I published my piece about Neil Tyson’s fabrication of the George W. Bush quote, several users edited\nNeil Tyson’s wiki page\nto include details of the quote fabrication controversy. The\nfact-loving, evidence-weighing, ever-objective editors of the online\nencyclopedia did not appreciate the inclusion of the evidence of Tyson’s\nfabrication. Not at all.\nAccording to a review of the\nedit history of Tyson’s page\n,\none long-time Wikipedia editor deleted an entire pending section\nsummarizing the issue of Tyson’s fabricated quotes. Another editor\nattempted to insert a brief mention of Tyson’s fabrication of the George\nW. Bush quote. That mention was also deleted. When it was reinserted,\nit was deleted yet again by an editor who describes himself as\na childless progressive and an apostle of Daily Kos\n(h/t\n@kerpen\n).\nLiterally every single mention of Tyson’s history of fabricating quotes has been removed from\nTyson’s Wikipedia page\n.\nMeanwhile, the Wikipedia page about me contains more about NK Jemisin and John Scalzi than it does about a professional career that has been covered everywhere from the New York Times to Computer Gaming World, casts doubt on my heritage, and reduces my entire personal life to two of the four languages I speak. I mean, at the very least, you’d think they’d mention that I speak English, that my blog is the most highly trafficked one in science fiction and fantasy, or my son is the youngest male author ever published.\nBut, of course, anything that might reflect well on me, or poorly on Tyson, is something that the Wikipedia editors are determined to excise. And that’s why you should never take anything you read on Wikipedia as anything but a starting point.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-11T05:00:00+00:00"
}