{
  "url": "https://voxday.net/2015/07/14/the-new-spanish-inquisition/",
  "scraped_at": "2025-12-17T17:19:39.900117",
  "title": "The new Spanish Inquisition",
  "date_display": "July 14, 2015",
  "date_iso": "2015-07-14T16:00:00+00:00",
  "date_from_url": "2015-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zerohedge reports on some new Spanish laws: <b><br/></b></p><blockquote class=\"tr_bq\"><p> 1. If you photograph security personnel and then share these images on social media: up to €30.000 fine (particularly if photo exposes violence used against a member of the public). This fine could increase depending on the number of Instagram or social media followers you have.<br>2. Tweet or retweet information or the “location of an organized protest” can now be interpreted as an act of terrorism as it incites others to “commit a crime” (now that “demonstrating” in many ways has become a crime). Sound “1984”-ish? Read about Orwell and his time in Spain.<br>3. Snowden-like whistle blowing is now defined as an act of terrorism. If you write for a local publication, be careful what you print, whom you speak to, and whether the government is listening.<br>4. Visiting or consulting terrorist websites – even for investigative purposes – can be interpreted as an act of terrorism. Make sure you use “Tor” browser, reject cookies, and don’t allow pop-ups. Not to mention, don’t post it on your Facebook timeline!<br>5. Be careful with the royal jokes! Any satirical<br> comment against the royal family is a new crime “against the Crown”. For<br> example, “What did Leticia and the Bishop have to say after they ––“<br> (SORRY CENSORED).<br> 6. No more hassling elected members of the government or<br> local authorities – even if they say one thing in order to be elected,<br> but then go and do the exact opposite. Confronting them about<br> this hypocritical behavior. Even if you see them in the street chatting<br> to a street cleaner, dining at their favorite expensive restaurant, or<br> having their shoes shined by that physics graduate who cannot find a<br> decent job in the country, hassling them about their behavior is now a<br> criminal offence.<br> 7. Has your local river been so polluted by that plastic factory<br> along the edge that all life has extinguished? Well, tough! Greenpeace<br> or similar protests are now finable from €601–€30.000.<br> 8. Protests in a spontaneous way outside Parliament are now illegal.<br> For example if Parliament passes a hugely unpopular bill, or are<br> debating something extremely important to you or your community, it is<br> now finable from €601 – €30.000. Tip: Use Google Maps to protest just<br> around the corner – but don’t tweet the location!<br> 9. Obstructing an officer in the course of their business, “resisting<br> arrest”, refusing to leave a demonstration when told, or getting in the<br> way of a swinging baton are all now finable offences from €601 –<br> €30.000.<br> 10. Showing lack of respect to officers of the law is an immediate fine of €100 – €600.<br> Answering back, asking a disrespectful question, making a funny face,<br> showing your bottom to an officer of the law, or telling him/her that<br> their breath reminds you of your dog’s underparts is now, sadly, not<br> advisable.<br> 11. Occupying, squatting, or refusing to leave an office, business,<br> bank or other place until your complaint has been heard as a protest is<br> now a €100 – €600 fine (no more flash mobs).<br> 12. Digital protests: Writing something that could technically “disturb the peace” is a now a crime. Bloggers beware, for no one has yet defined whose peace you could be disturbing.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Looks like the USA doesn’t have the only government that is actively preparing to face widespread civil unrest. I wonder why that might be?</p></div>",
  "content_text": "Zerohedge reports on some new Spanish laws:\n1. If you photograph security personnel and then share these images on social media: up to €30.000 fine (particularly if photo exposes violence used against a member of the public). This fine could increase depending on the number of Instagram or social media followers you have.\n2. Tweet or retweet information or the “location of an organized protest” can now be interpreted as an act of terrorism as it incites others to “commit a crime” (now that “demonstrating” in many ways has become a crime). Sound “1984”-ish? Read about Orwell and his time in Spain.\n3. Snowden-like whistle blowing is now defined as an act of terrorism. If you write for a local publication, be careful what you print, whom you speak to, and whether the government is listening.\n4. Visiting or consulting terrorist websites – even for investigative purposes – can be interpreted as an act of terrorism. Make sure you use “Tor” browser, reject cookies, and don’t allow pop-ups. Not to mention, don’t post it on your Facebook timeline!\n5. Be careful with the royal jokes! Any satirical\ncomment against the royal family is a new crime “against the Crown”. For\nexample, “What did Leticia and the Bishop have to say after they ––“\n(SORRY CENSORED).\n6. No more hassling elected members of the government or\nlocal authorities – even if they say one thing in order to be elected,\nbut then go and do the exact opposite. Confronting them about\nthis hypocritical behavior. Even if you see them in the street chatting\nto a street cleaner, dining at their favorite expensive restaurant, or\nhaving their shoes shined by that physics graduate who cannot find a\ndecent job in the country, hassling them about their behavior is now a\ncriminal offence.\n7. Has your local river been so polluted by that plastic factory\nalong the edge that all life has extinguished? Well, tough! Greenpeace\nor similar protests are now finable from €601–€30.000.\n8. Protests in a spontaneous way outside Parliament are now illegal.\nFor example if Parliament passes a hugely unpopular bill, or are\ndebating something extremely important to you or your community, it is\nnow finable from €601 – €30.000. Tip: Use Google Maps to protest just\naround the corner – but don’t tweet the location!\n9. Obstructing an officer in the course of their business, “resisting\narrest”, refusing to leave a demonstration when told, or getting in the\nway of a swinging baton are all now finable offences from €601 –\n€30.000.\n10. Showing lack of respect to officers of the law is an immediate fine of €100 – €600.\nAnswering back, asking a disrespectful question, making a funny face,\nshowing your bottom to an officer of the law, or telling him/her that\ntheir breath reminds you of your dog’s underparts is now, sadly, not\nadvisable.\n11. Occupying, squatting, or refusing to leave an office, business,\nbank or other place until your complaint has been heard as a protest is\nnow a €100 – €600 fine (no more flash mobs).\n12. Digital protests: Writing something that could technically “disturb the peace” is a now a crime. Bloggers beware, for no one has yet defined whose peace you could be disturbing.\nLooks like the USA doesn’t have the only government that is actively preparing to face widespread civil unrest. I wonder why that might be?",
  "tags": [
    "decline and fall",
    "law",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-14T15:00:00+00:00"
}