{
  "url": "https://voxday.net/2015/07/07/there-will-be-war-vols-iii-and-iv/",
  "scraped_at": "2025-12-16T13:02:18.577901",
  "title": "There Will Be War Vols III and IV",
  "date_display": "July 7, 2015",
  "date_iso": "2015-07-07T07:46:00+00:00",
  "date_from_url": "2015-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://3.bp.blogspot.com/-0OvRUt06fbY/VZZn8A-8jMI/AAAAAAAABWU/LpoaEoU_kWI/s1600/TWBWv3_480.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/07/TWBWv3_480.jpg\" width=\"200\"/></a></div><p>Created by the bestselling SF novelist Jerry Pournelle, THERE WILL BE<br> WAR is a landmark science fiction anthology series that combines<br> top-notch military science fiction with factual essays by various<br> generals and military experts on everything from High Frontier and the<br> Strategic Defense Initiative to the aftermath of the Vietnam War. It<br> features some of the greatest military science fiction ever published,<br> such Orson Scott Card’s “Ender’s Game” in Volume I and Joel Rosenberg’s<br> “Cincinnatus” in Volume II. Many science fiction greats were featured in<br> the original nine-volume series, which ran from 1982 to 1990, including<br> Robert Heinlein, Arthur C. Clarke, Philip K. Dick, Gordon Dickson, Poul<br> Anderson, Jack Vance, John Brunner, Gregory Benford, Robert Silverberg,<br> Harry Turtledove, and Ben Bova.</br></br></br></br></br></br></br></br></br></br></br></p><p><a href=\"http://www.amazon.com/There-Will-Be-War-III-ebook/dp/B01110QOVQ\">THERE WILL BE WAR Volume IIII</a> is edited by Jerry Pournelle and John<br> F. Carr, and features 16 stories, articles, and poems. Of particular<br> note are “Hide and Seek” by Arthur C. Clarke, “The Spectre General” by<br> Theodore Cogswell, “The Myth of a Liberation” by Truong Nhu Tang, and<br> “Silent Leges” by Jerry Pournelle.</br></br></br></br></p><p>382 pages, no DRM. It is available at <a href=\"http://www.amazon.com/There-Will-Be-War-III-ebook/dp/B01110QOVQ\">Amazon </a>and <a href=\"http://www.castaliahouse.com/downloads/there-will-be-war-vol-iii/\">Castalia House</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://3.bp.blogspot.com/-ToB0La3xVYA/VZZn8N1rNOI/AAAAAAAABWQ/CZMPSNupcWw/s1600/TWBWv4_480.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/07/TWBWv4_480.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/07/TWBWv4_480.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%20320%22%3E%3C/svg%3E\" width=\"200\"/></a></div><p><a href=\"http://www.amazon.com/There-Will-Be-War-IV-ebook/dp/B01110QGW8\"> THERE WILL BE WAR Volume IV</a> is edited by Jerry Pournelle and John F.<br> Carr, and features 21 stories, articles, and poems. Of particular note<br> are “The Cloak and the Staff” by Gordon R. Dickson, “Interim Justice” by<br> William F. Wu, “Psyops” by Stefan Possony, and “No Truce with Kings” by<br> Poul Anderson.</br></br></br></br></p><p>378 pages, no DRM. It is available at <a href=\"http://www.amazon.com/There-Will-Be-War-IV-ebook/dp/B01110QGW8\">Amazon </a>and <a href=\"http://www.castaliahouse.com/downloads/there-will-be-war-vol-iv/\">Castalia House</a>.</p></div>",
  "content_text": "Created by the bestselling SF novelist Jerry Pournelle, THERE WILL BE\nWAR is a landmark science fiction anthology series that combines\ntop-notch military science fiction with factual essays by various\ngenerals and military experts on everything from High Frontier and the\nStrategic Defense Initiative to the aftermath of the Vietnam War. It\nfeatures some of the greatest military science fiction ever published,\nsuch Orson Scott Card’s “Ender’s Game” in Volume I and Joel Rosenberg’s\n“Cincinnatus” in Volume II. Many science fiction greats were featured in\nthe original nine-volume series, which ran from 1982 to 1990, including\nRobert Heinlein, Arthur C. Clarke, Philip K. Dick, Gordon Dickson, Poul\nAnderson, Jack Vance, John Brunner, Gregory Benford, Robert Silverberg,\nHarry Turtledove, and Ben Bova.\nTHERE WILL BE WAR Volume IIII\nis edited by Jerry Pournelle and John\nF. Carr, and features 16 stories, articles, and poems. Of particular\nnote are “Hide and Seek” by Arthur C. Clarke, “The Spectre General” by\nTheodore Cogswell, “The Myth of a Liberation” by Truong Nhu Tang, and\n“Silent Leges” by Jerry Pournelle.\n382 pages, no DRM. It is available at\nAmazon\nand\nCastalia House\n.\nTHERE WILL BE WAR Volume IV\nis edited by Jerry Pournelle and John F.\nCarr, and features 21 stories, articles, and poems. Of particular note\nare “The Cloak and the Staff” by Gordon R. Dickson, “Interim Justice” by\nWilliam F. Wu, “Psyops” by Stefan Possony, and “No Truce with Kings” by\nPoul Anderson.\n378 pages, no DRM. It is available at\nAmazon\nand\nCastalia House\n.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-07T06:46:00+00:00"
}