{
  "url": "https://voxday.net/2015/07/27/those-clever-cuckservatives/",
  "scraped_at": "2025-12-17T17:21:10.627373",
  "title": "Those clever cuckservatives",
  "date_display": "July 27, 2015",
  "date_iso": "2015-07-27T16:00:00+00:00",
  "date_from_url": "2015-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They must think conservatives are mind-bogglingly stupid. <a href=\"http://hotair.com/archives/2015/07/26/dont-believe-the-cuckservative-lie/\">Hot Air defends cuckservatives</a> by claiming that trying to appeal to black voters is an effective long term strategy for Republicans:</p><blockquote class=\"tr_bq\"><blockquote class=\"tr_bq\"><p> This is horrifically shortsighted. It was amazing, yet unsurprising, how much agreement there was between FreedomWorks and Center for American Progress representatives during their joint summit on justice reform in DC. This wasn’t talking government spending, it was talking freedom, liberty, and getting the government out of things they shouldn’t be involved in. Rand Paul speaks at Bowie State and Howard universities and gets people nodding their heads in agreement. He’s discussing the importance of government getting out of the lives of others, not placating them or speaking about reparations. Paul is thinking long term and hopes to eventually get more conservative and libertarian African-Americans, instead of the current crop of leftists. It may take 30 to 50 years, but that doesn’t mean it’s not worth the effort.</p></blockquote></blockquote><p>Well, if people are nodding their heads, clearly that must trump 50 years of electoral voting patterns! What are demographics in comparison with a single politician’s hopes?</p><p><b>1960 presidential election</b><br> White percentage of population: 85.4<br> Black vote: 68 percent Democrat.</br></br></p><p><b>1984 presidential election</b><br> White percentage of population: 75.6<br> Black: 10 percent of voters. 91 percent Democrat.<br> Hispanic: 3 percent of voters. 66 percent Democrat</br></br></br></p><p><b>2012 presidential election</b><br> White percentage of population: 63.7<br> Black: 13 percent of voters. 93 percent Democrat<br> Hispanic: 10 percent of voters. 71 percent Democrat</br></br></br></p><p>At this rate of progression, in 30 years the white percentage of the population will be 53.7, blacks will be voting 95 percent Democrat and Hispanics will be voting 76 percent Democrat. All of the Republican outreach efforts over the last 30 years have only made matters worse, and in the meantime, over 20 million new Democrats entered the country via post-1986 immigration. Another 30 to 50 years means another 30 to 50 million immigrants, less than 25 percent of whom will be inclined to vote for smaller government. It is obviously and observably the cuckservatives <a href=\"http://www.breitbart.com/big-government/2015/07/26/new-california-mass-immigration-turning-virginia-blue/\">whose strategy is horrifically shortsighted</a>.</p><p>The demographic implications are perfectly clear. Either the Republican Party moves considerably to the Left or it becomes the White Party. Those are its only two viable options. It is obvious which of those two options are preferred by cuckservatives, the only question will be whether they can retain their control of the Republican Party or not.</p><p>That being said, I happen to think the question is largely irrelevant. The current American political system doesn’t have 30 years. It doesn’t even have 20 left to it. As I have long predicted, I think the decline element of decline-and-fall will be complete by 2033.</p><p>Hateful Heretic’s response to the Hot Air piece is straightforward and powerful:</p><blockquote class=\"tr_bq\"><p> Most of us really like capitalism, meritocracy, property rights, and the rule of law. Unlike you we recognize that the left’s program of demographic replacement will destroy those things forever, and that those values, as “universally good” as they may be, are largely only attractive to persons of Anglo-European heritage….</p><p>You know what’s short-sighted? Displacement-level immigration. Hispanics are not going to vote for freedom and capitalism. They don’t vote for it in Mexico, they don’t vote for it in Venezuela, they don’t vote for it in Colombia, they don’t vote for it in Bolivia, they don’t vote for it in Argentina, they don’t vote for it in Brazil, they don’t vote for it in Chile, they don’t vote for it in Guatemala, and they’re not going to vote for it here.</p></blockquote><p>He’s right. Each successive wave of immigration, dating back to those coming from Europe, have pushed the USA further from its concept of liberty, limited government, and “the Rights of Englishmen”. And on a related note, Mike Cernovich explains why he, and others on the alt-Right, have <a href=\"http://www.crimeandfederalism.com/2015/07/why-does-the-word-cuckervative-trigger-conservative-men.html\">no qualms about dismissing and disregarding</a> these theoretical “conservative” allies:</p><blockquote class=\"tr_bq\"><p> Cuckservatives control the right-wing airwaves. Have any of them reached out to me – someone who objectively speaking has a far greater reach and sells more books than the usual talking heads – to discuss men’s issues? No. The right has ignored me and other men – even more palatable men like the A Voice for Men Camp – for years. They choose to ignore out concerns and refused to give us a platform.</p><p>When Gawker and MSNBC attacked me, where were these so-called “allies” on the right? </p></blockquote><p>When the only time they bother to notice you is to join the Left in attacking you, then they aren’t an ally. Regardless of what they claim to believe. Also, and more importantly, the cuckservatives are on the wrong side of all three of the only three issues that really matter: national sovereignty, immigration, and the Federal Reserve. They might not be Leftists, but for all practical intents and purposes, they may as well be.</p><p>Considering how many of them have come out recently and endorsed gay “marriage”, it appears that they’re little more interested in conserving anything about traditional America than the neocons are. But <a href=\"https://www.washingtonpost.com/blogs/plum-line/wp/2015/07/27/morning-plum-big-majority-of-gop-voters-favors-mass-deportation-poll-finds/\">conservatives don’t agree</a> with their cuckservative would-be leaders.</p><p>Big majority of GOP voters favors mass deportation, poll finds</p></div>",
  "content_text": "They must think conservatives are mind-bogglingly stupid.\nHot Air defends cuckservatives\nby claiming that trying to appeal to black voters is an effective long term strategy for Republicans:\nThis is horrifically shortsighted. It was amazing, yet unsurprising, how much agreement there was between FreedomWorks and Center for American Progress representatives during their joint summit on justice reform in DC. This wasn’t talking government spending, it was talking freedom, liberty, and getting the government out of things they shouldn’t be involved in. Rand Paul speaks at Bowie State and Howard universities and gets people nodding their heads in agreement. He’s discussing the importance of government getting out of the lives of others, not placating them or speaking about reparations. Paul is thinking long term and hopes to eventually get more conservative and libertarian African-Americans, instead of the current crop of leftists. It may take 30 to 50 years, but that doesn’t mean it’s not worth the effort.\nWell, if people are nodding their heads, clearly that must trump 50 years of electoral voting patterns! What are demographics in comparison with a single politician’s hopes?\n1960 presidential election\nWhite percentage of population: 85.4\nBlack vote: 68 percent Democrat.\n1984 presidential election\nWhite percentage of population: 75.6\nBlack: 10 percent of voters. 91 percent Democrat.\nHispanic: 3 percent of voters. 66 percent Democrat\n2012 presidential election\nWhite percentage of population: 63.7\nBlack: 13 percent of voters. 93 percent Democrat\nHispanic: 10 percent of voters. 71 percent Democrat\nAt this rate of progression, in 30 years the white percentage of the population will be 53.7, blacks will be voting 95 percent Democrat and Hispanics will be voting 76 percent Democrat. All of the Republican outreach efforts over the last 30 years have only made matters worse, and in the meantime, over 20 million new Democrats entered the country via post-1986 immigration. Another 30 to 50 years means another 30 to 50 million immigrants, less than 25 percent of whom will be inclined to vote for smaller government. It is obviously and observably the cuckservatives\nwhose strategy is horrifically shortsighted\n.\nThe demographic implications are perfectly clear. Either the Republican Party moves considerably to the Left or it becomes the White Party. Those are its only two viable options. It is obvious which of those two options are preferred by cuckservatives, the only question will be whether they can retain their control of the Republican Party or not.\nThat being said, I happen to think the question is largely irrelevant. The current American political system doesn’t have 30 years. It doesn’t even have 20 left to it. As I have long predicted, I think the decline element of decline-and-fall will be complete by 2033.\nHateful Heretic’s response to the Hot Air piece is straightforward and powerful:\nMost of us really like capitalism, meritocracy, property rights, and the rule of law. Unlike you we recognize that the left’s program of demographic replacement will destroy those things forever, and that those values, as “universally good” as they may be, are largely only attractive to persons of Anglo-European heritage….\nYou know what’s short-sighted? Displacement-level immigration. Hispanics are not going to vote for freedom and capitalism. They don’t vote for it in Mexico, they don’t vote for it in Venezuela, they don’t vote for it in Colombia, they don’t vote for it in Bolivia, they don’t vote for it in Argentina, they don’t vote for it in Brazil, they don’t vote for it in Chile, they don’t vote for it in Guatemala, and they’re not going to vote for it here.\nHe’s right. Each successive wave of immigration, dating back to those coming from Europe, have pushed the USA further from its concept of liberty, limited government, and “the Rights of Englishmen”. And on a related note, Mike Cernovich explains why he, and others on the alt-Right, have\nno qualms about dismissing and disregarding\nthese theoretical “conservative” allies:\nCuckservatives control the right-wing airwaves. Have any of them reached out to me – someone who objectively speaking has a far greater reach and sells more books than the usual talking heads – to discuss men’s issues? No. The right has ignored me and other men – even more palatable men like the A Voice for Men Camp – for years. They choose to ignore out concerns and refused to give us a platform.\nWhen Gawker and MSNBC attacked me, where were these so-called “allies” on the right?\nWhen the only time they bother to notice you is to join the Left in attacking you, then they aren’t an ally. Regardless of what they claim to believe. Also, and more importantly, the cuckservatives are on the wrong side of all three of the only three issues that really matter: national sovereignty, immigration, and the Federal Reserve. They might not be Leftists, but for all practical intents and purposes, they may as well be.\nConsidering how many of them have come out recently and endorsed gay “marriage”, it appears that they’re little more interested in conserving anything about traditional America than the neocons are. But\nconservatives don’t agree\nwith their cuckservative would-be leaders.\nBig majority of GOP voters favors mass deportation, poll finds",
  "tags": [
    "decline and fall",
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-27T15:00:00+00:00"
}