{
  "url": "https://voxday.net/2015/07/10/why-rand-paul-lost-my-vote/",
  "scraped_at": "2025-12-16T13:02:48.328391",
  "title": "Why Rand Paul lost my vote",
  "date_display": "July 10, 2015",
  "date_iso": "2015-07-10T12:00:00+00:00",
  "date_from_url": "2015-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Morefield <a href=\"http://www.theblaze.com/contributions/why-rand-paul-lost-my-vote/\">explains</a>:</p><blockquote class=\"tr_bq\"><p> As a libertarian-leaning Constitutionalist, I enthusiastically supported Ron Paul in the last two elections. So nobody who knows me was surprised when I declared my early excitement and support of his son, Rand, as a possible presidential prospect even before he won his Senate seat. Both father and son extol so many of the liberty-centered virtues that once made this country great and which are so rarely articulated today.</p><p>However, unlike his more ideologically-pure father, whose “take-me-or-leave-me” approach wasn’t one to sacrifice even a sliver of his beliefs for electoral victory, Rand is a bit more pragmatic. As someone who was at times frustrated by Ron Paul’s intransigence on even seemingly unimportant issues to the detriment of his public perception (come on, does anybody in the country actually think killing Bin Laden was a bad thing?), I can appreciate Rand’s desire to at least keep his finger on the pulse of what collective America is feeling….</p><p>No matter how you slice it, the fact remains that this Stalinesque push<br> to remove any vestiges of those “evil” Confederates is bound to alienate<br> a significant percentage of the very voters Rand Paul should be able to<br> count on as his base. So, when Rand adds his voice to the commissars,<br> those of us in Southern flyover country to whom that flag represents the<br> honor of thousands of Americans who fought and died for their homeland,<br> not slavery, bristle just a little. We care about a lot of things,<br> including getting along with folks of all races, but we don’t give two<br> hoots about what the “beltway” says is politically-correct.</br></br></br></br></br></br></br></br></p></blockquote><p>I think Rand Paul sank his campaign when he endorsed the Confederate flag purge. He’s not as bad as Jeb Bush, of course, even Hillary Clinton may not be. But I think most of his father’s supporters, who have always viewed him with a certain degree of skepticism and concern, will look elsewhere as a result of his opposition to the symbol of the South.</p></div>",
  "content_text": "Scott Morefield\nexplains\n:\nAs a libertarian-leaning Constitutionalist, I enthusiastically supported Ron Paul in the last two elections. So nobody who knows me was surprised when I declared my early excitement and support of his son, Rand, as a possible presidential prospect even before he won his Senate seat. Both father and son extol so many of the liberty-centered virtues that once made this country great and which are so rarely articulated today.\nHowever, unlike his more ideologically-pure father, whose “take-me-or-leave-me” approach wasn’t one to sacrifice even a sliver of his beliefs for electoral victory, Rand is a bit more pragmatic. As someone who was at times frustrated by Ron Paul’s intransigence on even seemingly unimportant issues to the detriment of his public perception (come on, does anybody in the country actually think killing Bin Laden was a bad thing?), I can appreciate Rand’s desire to at least keep his finger on the pulse of what collective America is feeling….\nNo matter how you slice it, the fact remains that this Stalinesque push\nto remove any vestiges of those “evil” Confederates is bound to alienate\na significant percentage of the very voters Rand Paul should be able to\ncount on as his base. So, when Rand adds his voice to the commissars,\nthose of us in Southern flyover country to whom that flag represents the\nhonor of thousands of Americans who fought and died for their homeland,\nnot slavery, bristle just a little. We care about a lot of things,\nincluding getting along with folks of all races, but we don’t give two\nhoots about what the “beltway” says is politically-correct.\nI think Rand Paul sank his campaign when he endorsed the Confederate flag purge. He’s not as bad as Jeb Bush, of course, even Hillary Clinton may not be. But I think most of his father’s supporters, who have always viewed him with a certain degree of skepticism and concern, will look elsewhere as a result of his opposition to the symbol of the South.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-10T11:00:00+00:00"
}