{
  "url": "https://voxday.net/2015/07/20/why-everyone-hates-mcrapey/",
  "scraped_at": "2025-12-17T17:20:20.399673",
  "title": "Why everyone hates McRapey",
  "date_display": "July 20, 2015",
  "date_iso": "2015-07-20T12:15:00+00:00",
  "date_from_url": "2015-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It looks like John Scalzi is back in the depressive phase of his cycle, as he offers <a href=\"https://archive.is/DFTSL\">ten theories about why he is so disliked</a> by so many people. You know, he simply could have asked us. We would have told him. But let’s see how many he gets right. Without having looked at them yet, I’m going to guess 3 out of 10:</p><blockquote class=\"tr_bq\"><p> Over on Facebook at the moment, and as a subset of a larger discussion, there’s a conversational thread about why so many dudes (and it is largely dudes, and dudes of a certain sort and political persuasion) have such a rabid dislike of me, both as a writer and as a human being.</p><p>Naturally, I have thoughts on this, based on years of personal observation, so below you’ll find my hypotheses on why I am so widely disliked by a certain type of dude. These hypotheses are mix and match: Not all will apply to everyone.</p><p><b>1. Because I’m an asshole.</b> TRUE</p><p><b>2. Because they’re assholes.</b> FALSE. No one dislikes Scalzi due to them being an asshole. Some would certainly put me in that category and that’s not why I dislike Scalzi; vastly more non-assholes dislike Scalzi than the sum total of everyone who can even remotely be described as one. As for the idea of “an unpleasant variation of starfucking”, I would point out that most of the people who dislike him here disliked him back in 2005, long before he was a Tor-made SF star.</p><p><b>3. Because of my politics.</b> FALSE. I live in Europe. I have plenty of friends who are far to the left of Scalzi; the Socialist Party is the #2 party in my region. I would guess that most of my friends outside the USA are to his left. It’s entirely possible to be of the political left and not be an obnoxious fraud.</p><p><b>4. Because I should be with them and I’m not.</b> FALSE. We most certainly do not want McRapey with us in any way, shape, or form. That’s just insulting.</p><p><b>5. Because I’m successful:</b> FALSE. We live in a world where Britney Spears is a music star, Katie Price is a bestselling author, and there are probably any number of Hollywood stars who would serve as an example of acting success without talent. Scalzi may be a mediocre stunt author, but is not entirely without talent and his level of success is minimal compared to some egregiously less talented writers. Scalzi simply can’t seem to grasp that not everyone is as driven by envy as he is.</p><p><b>6. Because I’m not a real man.</b> TRUE. He’s a prime example of a gamma male, a parody of a real man, which is why he inspires disgust in men and women alike.</p><p><b>7. Because they can’t actually do anything to me.</b> FALSE. If nothing else, I’ve exposed him as a fraud who repeatedly lies about his success.</p><p><b>8. Because of envy.</b> FALSE See the Third Law of SJW: SJWs Always Project.<br> <b><br>9. Because I refused to recognize that they were right about something that one time, or several times</br></b>. FALSE.</br></p><p><b>10. Because of tribal identification.</b> TRUE. He is a proud SJW. He is anti-GG.  Both of those identifications are sufficient reason for tens of thousands of #GamerGaters alone to legitimately hate him.</p></blockquote><p>What do you know, 3 out of 10. Do I know the little freakshow or what? And notice how he keeps trying to tie everything back to envy, because people envy him, because he is successful, which he obviously needs to remind himself on a regular basis. Now let’s list the eight primary reasons he is hated; only two of which he managed to identify, in the order of most to least hateful.</p><ol><li>He is a liar. John Scalzi repeatedly lies, and when caught lying, he does not admit it and repent, but keeps lying and then lies about those who caught him out. He lies about himself. He lies about others. He’s <i>reliably </i>dishonest and even when he isn’t blatantly lying, he’s deceptive. I doubt it will surprise anyone in the least if it eventually turns out there is some funny business concerning his book contract not exactly being what it was described as being.</li><li>He is a con artist. Almost everything he does, from his writing to getting published by Tor to campaigning for awards to laying claim to be a popular blogger, is a calculated, self-promoting scam. I know from multiple sources that in public he pretends to be better friends with people than he in fact is, particularly when those people are better known than he is.</li><li>He’s a coward. He’d also be a bully, but he’s too cowardly for that. He runs away from any challenge he can’t simply ban.</li><li>He is obnoxious. I think he covered that with #1 above.</li><li>He is pathologically narcissistic. All those silly Photoshop-edited<br> selfies are indicative of a narcissist who absolutely loathes his own<br> physical appearance. The combination of his pathological narcissism with<br> his physical ugliness is literally repulsive and goes well beyond the<br> usual gamma issues. Although he is disgusted by himself, he resents us for being disgusted by him. Hence the constant “look at me, love me” antics. His incessant need for attention would be pitiful if it didn’t manifest in such obnoxious ways.</br></br></br></br></li><li>He is pretentious. Look at how he tried to call himself a game developer and talked about the game he was working on when he was<br> nothing but a lowly writer on the failed project. (It was a ridiculous rail-shooter for mobile; I knew it would fail from the moment I read the description.) Some things never change; I caught him exaggerating the number and nature of his publications in our very first meeting back<br> in 2005.</br></br></li><li>He is a gamma male. All gammas are secret kings ruling over their delusion bubble with majesty and sly, smooth charm, but Scalzi is a particularly virulent example of the species, as he’s somehow able to convince others of low socio-sexual rank that they, too, can be winners like him. But he more or less nailed this in #6. He’s not a real man.</li><li>He significantly overrates his intelligence. He’s not stupid. Far from it. But he’s more than a standard deviation below me, and I’m not the smartest guy around. He’s a high midwit with delusions of brilliance, and like all midwits, assumes that if he can’t understand something, that must be because it’s stupid. This is more annoying than hateful, though.</li></ol><p>Did I miss anything? Why do you hate John Scalzi? Apparently he wants to know. But if I had a single piece of advice for him if he genuinely wanted to be less hated, it would be this: stop lying. Stop lying to yourself, stop lying to your readers, and stop lying to your enemies. You’re not fooling ANYONE anymore.</p><p>Yes, lying has worked for him in the past. He would not be where he is today without repeatedly lying to lots of people. But the seeds of failure are often sown in the mindless repetition of what made us successful.</p></div>",
  "content_text": "It looks like John Scalzi is back in the depressive phase of his cycle, as he offers\nten theories about why he is so disliked\nby so many people. You know, he simply could have asked us. We would have told him. But let’s see how many he gets right. Without having looked at them yet, I’m going to guess 3 out of 10:\nOver on Facebook at the moment, and as a subset of a larger discussion, there’s a conversational thread about why so many dudes (and it is largely dudes, and dudes of a certain sort and political persuasion) have such a rabid dislike of me, both as a writer and as a human being.\nNaturally, I have thoughts on this, based on years of personal observation, so below you’ll find my hypotheses on why I am so widely disliked by a certain type of dude. These hypotheses are mix and match: Not all will apply to everyone.\n1. Because I’m an asshole.\nTRUE\n2. Because they’re assholes.\nFALSE. No one dislikes Scalzi due to them being an asshole. Some would certainly put me in that category and that’s not why I dislike Scalzi; vastly more non-assholes dislike Scalzi than the sum total of everyone who can even remotely be described as one. As for the idea of “an unpleasant variation of starfucking”, I would point out that most of the people who dislike him here disliked him back in 2005, long before he was a Tor-made SF star.\n3. Because of my politics.\nFALSE. I live in Europe. I have plenty of friends who are far to the left of Scalzi; the Socialist Party is the #2 party in my region. I would guess that most of my friends outside the USA are to his left. It’s entirely possible to be of the political left and not be an obnoxious fraud.\n4. Because I should be with them and I’m not.\nFALSE. We most certainly do not want McRapey with us in any way, shape, or form. That’s just insulting.\n5. Because I’m successful:\nFALSE. We live in a world where Britney Spears is a music star, Katie Price is a bestselling author, and there are probably any number of Hollywood stars who would serve as an example of acting success without talent. Scalzi may be a mediocre stunt author, but is not entirely without talent and his level of success is minimal compared to some egregiously less talented writers. Scalzi simply can’t seem to grasp that not everyone is as driven by envy as he is.\n6. Because I’m not a real man.\nTRUE. He’s a prime example of a gamma male, a parody of a real man, which is why he inspires disgust in men and women alike.\n7. Because they can’t actually do anything to me.\nFALSE. If nothing else, I’ve exposed him as a fraud who repeatedly lies about his success.\n8. Because of envy.\nFALSE See the Third Law of SJW: SJWs Always Project.\n9. Because I refused to recognize that they were right about something that one time, or several times\n. FALSE.\n10. Because of tribal identification.\nTRUE. He is a proud SJW. He is anti-GG.  Both of those identifications are sufficient reason for tens of thousands of #GamerGaters alone to legitimately hate him.\nWhat do you know, 3 out of 10. Do I know the little freakshow or what? And notice how he keeps trying to tie everything back to envy, because people envy him, because he is successful, which he obviously needs to remind himself on a regular basis. Now let’s list the eight primary reasons he is hated; only two of which he managed to identify, in the order of most to least hateful.\nHe is a liar. John Scalzi repeatedly lies, and when caught lying, he does not admit it and repent, but keeps lying and then lies about those who caught him out. He lies about himself. He lies about others. He’s\nreliably\ndishonest and even when he isn’t blatantly lying, he’s deceptive. I doubt it will surprise anyone in the least if it eventually turns out there is some funny business concerning his book contract not exactly being what it was described as being.\nHe is a con artist. Almost everything he does, from his writing to getting published by Tor to campaigning for awards to laying claim to be a popular blogger, is a calculated, self-promoting scam. I know from multiple sources that in public he pretends to be better friends with people than he in fact is, particularly when those people are better known than he is.\nHe’s a coward. He’d also be a bully, but he’s too cowardly for that. He runs away from any challenge he can’t simply ban.\nHe is obnoxious. I think he covered that with #1 above.\nHe is pathologically narcissistic. All those silly Photoshop-edited\nselfies are indicative of a narcissist who absolutely loathes his own\nphysical appearance. The combination of his pathological narcissism with\nhis physical ugliness is literally repulsive and goes well beyond the\nusual gamma issues. Although he is disgusted by himself, he resents us for being disgusted by him. Hence the constant “look at me, love me” antics. His incessant need for attention would be pitiful if it didn’t manifest in such obnoxious ways.\nHe is pretentious. Look at how he tried to call himself a game developer and talked about the game he was working on when he was\nnothing but a lowly writer on the failed project. (It was a ridiculous rail-shooter for mobile; I knew it would fail from the moment I read the description.) Some things never change; I caught him exaggerating the number and nature of his publications in our very first meeting back\nin 2005.\nHe is a gamma male. All gammas are secret kings ruling over their delusion bubble with majesty and sly, smooth charm, but Scalzi is a particularly virulent example of the species, as he’s somehow able to convince others of low socio-sexual rank that they, too, can be winners like him. But he more or less nailed this in #6. He’s not a real man.\nHe significantly overrates his intelligence. He’s not stupid. Far from it. But he’s more than a standard deviation below me, and I’m not the smartest guy around. He’s a high midwit with delusions of brilliance, and like all midwits, assumes that if he can’t understand something, that must be because it’s stupid. This is more annoying than hateful, though.\nDid I miss anything? Why do you hate John Scalzi? Apparently he wants to know. But if I had a single piece of advice for him if he genuinely wanted to be less hated, it would be this: stop lying. Stop lying to yourself, stop lying to your readers, and stop lying to your enemies. You’re not fooling ANYONE anymore.\nYes, lying has worked for him in the past. He would not be where he is today without repeatedly lying to lots of people. But the seeds of failure are often sown in the mindless repetition of what made us successful.",
  "tags": [
    "freakshow",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-20T11:15:00+00:00"
}