{
  "url": "https://voxday.net/2015/07/09/yes-next-question/",
  "scraped_at": "2025-12-16T13:02:39.432180",
  "title": "Yes. Next question",
  "date_display": "July 9, 2015",
  "date_iso": "2015-07-09T12:00:00+00:00",
  "date_from_url": "2015-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Conde Nast <a href=\"http://www.vanityfair.com/news/2015/07/anti-semitism-france-hostage-hyper-cacher-kosher-market\">asks a Troubling Question</a> to which the answer is obvious:</p><blockquote class=\"tr_bq\"><p> <b>The Troubling Question in the French Jewish Community: Is It Time to Leave?</b></p><p>How can anyone be allowed to paint a swastika on the statue of Marianne, the goddess of French liberty, in the very center of the Place de la République?”</p><p>That was what the chairman of one of France’s most celebrated luxury brands was thinking last July, when a tall man in a black shirt and a kaffiyeh leapt to the ledge of Marianne’s pedestal and scrawled a black swastika. All around him, thousands of angry demonstrators were swarming the square with fake rockets, Palestinian and Hamas flags, even the black-and-white banners of ISIS. Here, barely a mile and a half from the Galeries Lafayette, the heart of bourgeois Paris, the chants: “MORT AUX JUIFS! MORT AUX JUIFS!” Death to the Jews. It was Saturday, July 26, 2014, and a pro-Palestinian demonstration turned into a day of terror in one of the most fashionable neighborhoods of the city.</p><p>“Do something! Do you see what is happening here?” the chairman said to a line of police officers watching the demonstration build to a frenzy. “What do you expect us to do?” one officer said, then looked away. For years, the chairman, a longtime anti-racism activist, has turned up at rallies like this one to see which politicians and which radical groups were present. (For reasons of personal safety, the chairman asked not to be identified for this story.) France’s endless demonstrations are a mainstay of the republic, a sacred right rooted in the legacy of Voltaire. But hate speech is a criminal offense—people may express their opinions, but not to the extent of insulting others based on their race, religion, or sex. The protest—against Israel’s Gaza policies—had been banned by the government, fearful of violence, following flare-ups in the preceding weeks. But if the police were to move in too quickly, the riots might continue all summer long—suburbs in flames, mobs in central Paris.</p><p>Photographs and videos of the swastika and its perpetrator, of protesters chanting “Kill the Jews,” and of the Palestinian, Hamas, and ISIS flags were sent in a rush to various groups in the Jewish community who assess threats. By early afternoon, some of these reached Sammy Ghozlan, a 72-year-old retired police commissioner who has spent his career working the banlieues, the belt of working-class, racially mixed suburbs that surround Paris. Ghozlan is a folk hero of the banlieues and has a nickname that is impossible to forget: le poulet cacher—“the kosher chicken.” (Poulet is slang for cop.) For 15 years, he has overseen France’s National Bureau for Vigilance Against Anti-Semitism—known by its French abbreviation, B.N.V.C.A.—a community hotline he founded that is funded by his police pension and whatever small donations he can come by. Its purpose is nothing less than to protect the Jews of France….</p><p>Two days before the <i>Charlie Hebdo</i><br> attack, Sammy announced what, to many, including me, was unthinkable:<br> Sammy Ghozlan, proud Frenchman and the dean of Paris’s anti-Semitic<br> crime-fighters, had joined the thousands of French Jews moving to<br> Israel.</br></br></br></br></p></blockquote><p>The Jews in Europe are doomed because they spent the last 70 years undermining European nationalism and supporting the transformation of European population demographics. That strategy was understandable, given their mid-century experience with German nationalism, but short-sighted, and its long-term failure was absolutely inevitable. That is relatively obvious now; everyone from Benjamin Netanyahu to Sammy Ghozlan has concluded that it is time for continental Jews to go home to Israel. And while the Jews in the UK aren’t quite at that point yet, I expect they will be soon enough. The English have long looked with mild disapproval upon the Jews in their midst, but<br> they simply don’t hate them the way their millions of recent Polish and Muslim immigrants do.</br></p><p>What is much less obvious at this point is that the Jews in America appear to be similarly doomed because their elite has spent the last 50 years undermining American nationalism and supporting the transformation of America’s population demographics under the mistaken impression that it would be “good for the Jews”. Feeling threatened by European nationalism as a result of their experience with Germanic nationalism, a small number of elite Jews worked very hard to remove the barriers to entry that protected their people from those who hate them considerably more than Frenchmen or Americans do. In fact, some of them are still at it; consider <a href=\"http://www.nationaljournal.com/next-america/perspectives/why-immigration-reform-is-a-jewish-issue-20140411\">this piece published in the National Journal</a>:</p><p><i>Nearly 70 percent of Jews support comprehensive immigration reform, according to a survey released by the Public Religion Research Institute and the Brookings Institution in March 2013…. Jews have always been immigrants. We’re always searching for a safe place to call home. That is one reason we are so invested in making sure that today’s immigrants have the opportunity to build their lives in America like we did. </i></p><p>Obviously very few Jews have made what might be called the French connection between immigration and anti-semitism yet. Due to the larger Jewish population in America and the USA’s bigger geography, the USA is probably 30 years behind France in this regard, but one nevertheless can observe the same process at work. The outcome is so predictable that one would almost suspect those responsible of being ruthless Zionists with the long term goal of driving all of their compatriots to Israel whether they will or no.</p><p>Even in the case of immigrants who don’t have anything against Jews, groups such as the Mexicans and Chinese, the demographic tradeoff has been a negative one for the Jews because unlike the various European nations, the newcomers are totally immune to the Holocaustianity to which misbehaving Jews have tried to hide behind for decades. Forget Greenspan, Bernanke, and Yellen, even critics of <i>Bernie Madoff</i>, the Jewish con artist who materially harmed more Jews than any anti-semite since Adolf Hitler, were declared to be “anti-semites” by Abe Foxman of the Anti-Defamation League.</p><p>But notice that for all the wealth and power possessed by “the chairman of one of France’s most celebrated luxury brands”, such things are impotent in the face of the Muslim numbers, which dwarf France’s Jewish population, 5 million to 500,000. (Note to American readers who think France is being swamped by Islam: the USA has proportionately more Hispanic residents than France has Muslim residents, 52 million and 18 percent vs five million and 8 percent.)</p><p>Now nationalism is resurgent throughout Europe, everywhere from Greece and Italy to Norway and Sweden. But while those European nationalists are primarily opposed to the Jew-hating invaders, they will not lift a finger to aid or defend the Jews who have been actively attempting to suppress them for decades. Indeed, most Jews in America are still more concerned about the nationalists than they are about those who are actually calling openly for their death. The European Jews have learned better.</p><p>It is said that generals always fight the previous war. In this case, it seems apparent that the diaspora Jews were determined to fight their previous enemy rather than their current one. But it should have been obvious that any nation that is unwilling or unable to defend itself is a nation that will be equally unable to defend its guests.</p><p>That is why I expect the French policeman’s response will serve as a predictive microcosm of the European and American responses to the war that the New Europeans and the New Americans are waging on their resident Jews.</p><p><i>“What do you expect us to do?” one officer said, then looked away.  </i></p><p>If the Jews in America do not wish to see America follow Europe’s lead in this regard, they are going to have to do a complete 180 on immigration, do it fast, and do it hard.<i> </i>Regardless, I suspect an investment in Israeli real estate may be something to seriously consider as the demand for housing there is only going to grow.<i><br/></i></p></div>",
  "content_text": "Conde Nast\nasks a Troubling Question\nto which the answer is obvious:\nThe Troubling Question in the French Jewish Community: Is It Time to Leave?\nHow can anyone be allowed to paint a swastika on the statue of Marianne, the goddess of French liberty, in the very center of the Place de la République?”\nThat was what the chairman of one of France’s most celebrated luxury brands was thinking last July, when a tall man in a black shirt and a kaffiyeh leapt to the ledge of Marianne’s pedestal and scrawled a black swastika. All around him, thousands of angry demonstrators were swarming the square with fake rockets, Palestinian and Hamas flags, even the black-and-white banners of ISIS. Here, barely a mile and a half from the Galeries Lafayette, the heart of bourgeois Paris, the chants: “MORT AUX JUIFS! MORT AUX JUIFS!” Death to the Jews. It was Saturday, July 26, 2014, and a pro-Palestinian demonstration turned into a day of terror in one of the most fashionable neighborhoods of the city.\n“Do something! Do you see what is happening here?” the chairman said to a line of police officers watching the demonstration build to a frenzy. “What do you expect us to do?” one officer said, then looked away. For years, the chairman, a longtime anti-racism activist, has turned up at rallies like this one to see which politicians and which radical groups were present. (For reasons of personal safety, the chairman asked not to be identified for this story.) France’s endless demonstrations are a mainstay of the republic, a sacred right rooted in the legacy of Voltaire. But hate speech is a criminal offense—people may express their opinions, but not to the extent of insulting others based on their race, religion, or sex. The protest—against Israel’s Gaza policies—had been banned by the government, fearful of violence, following flare-ups in the preceding weeks. But if the police were to move in too quickly, the riots might continue all summer long—suburbs in flames, mobs in central Paris.\nPhotographs and videos of the swastika and its perpetrator, of protesters chanting “Kill the Jews,” and of the Palestinian, Hamas, and ISIS flags were sent in a rush to various groups in the Jewish community who assess threats. By early afternoon, some of these reached Sammy Ghozlan, a 72-year-old retired police commissioner who has spent his career working the banlieues, the belt of working-class, racially mixed suburbs that surround Paris. Ghozlan is a folk hero of the banlieues and has a nickname that is impossible to forget: le poulet cacher—“the kosher chicken.” (Poulet is slang for cop.) For 15 years, he has overseen France’s National Bureau for Vigilance Against Anti-Semitism—known by its French abbreviation, B.N.V.C.A.—a community hotline he founded that is funded by his police pension and whatever small donations he can come by. Its purpose is nothing less than to protect the Jews of France….\nTwo days before the\nCharlie Hebdo\nattack, Sammy announced what, to many, including me, was unthinkable:\nSammy Ghozlan, proud Frenchman and the dean of Paris’s anti-Semitic\ncrime-fighters, had joined the thousands of French Jews moving to\nIsrael.\nThe Jews in Europe are doomed because they spent the last 70 years undermining European nationalism and supporting the transformation of European population demographics. That strategy was understandable, given their mid-century experience with German nationalism, but short-sighted, and its long-term failure was absolutely inevitable. That is relatively obvious now; everyone from Benjamin Netanyahu to Sammy Ghozlan has concluded that it is time for continental Jews to go home to Israel. And while the Jews in the UK aren’t quite at that point yet, I expect they will be soon enough. The English have long looked with mild disapproval upon the Jews in their midst, but\nthey simply don’t hate them the way their millions of recent Polish and Muslim immigrants do.\nWhat is much less obvious at this point is that the Jews in America appear to be similarly doomed because their elite has spent the last 50 years undermining American nationalism and supporting the transformation of America’s population demographics under the mistaken impression that it would be “good for the Jews”. Feeling threatened by European nationalism as a result of their experience with Germanic nationalism, a small number of elite Jews worked very hard to remove the barriers to entry that protected their people from those who hate them considerably more than Frenchmen or Americans do. In fact, some of them are still at it; consider\nthis piece published in the National Journal\n:\nNearly 70 percent of Jews support comprehensive immigration reform, according to a survey released by the Public Religion Research Institute and the Brookings Institution in March 2013…. Jews have always been immigrants. We’re always searching for a safe place to call home. That is one reason we are so invested in making sure that today’s immigrants have the opportunity to build their lives in America like we did.\nObviously very few Jews have made what might be called the French connection between immigration and anti-semitism yet. Due to the larger Jewish population in America and the USA’s bigger geography, the USA is probably 30 years behind France in this regard, but one nevertheless can observe the same process at work. The outcome is so predictable that one would almost suspect those responsible of being ruthless Zionists with the long term goal of driving all of their compatriots to Israel whether they will or no.\nEven in the case of immigrants who don’t have anything against Jews, groups such as the Mexicans and Chinese, the demographic tradeoff has been a negative one for the Jews because unlike the various European nations, the newcomers are totally immune to the Holocaustianity to which misbehaving Jews have tried to hide behind for decades. Forget Greenspan, Bernanke, and Yellen, even critics of\nBernie Madoff\n, the Jewish con artist who materially harmed more Jews than any anti-semite since Adolf Hitler, were declared to be “anti-semites” by Abe Foxman of the Anti-Defamation League.\nBut notice that for all the wealth and power possessed by “the chairman of one of France’s most celebrated luxury brands”, such things are impotent in the face of the Muslim numbers, which dwarf France’s Jewish population, 5 million to 500,000. (Note to American readers who think France is being swamped by Islam: the USA has proportionately more Hispanic residents than France has Muslim residents, 52 million and 18 percent vs five million and 8 percent.)\nNow nationalism is resurgent throughout Europe, everywhere from Greece and Italy to Norway and Sweden. But while those European nationalists are primarily opposed to the Jew-hating invaders, they will not lift a finger to aid or defend the Jews who have been actively attempting to suppress them for decades. Indeed, most Jews in America are still more concerned about the nationalists than they are about those who are actually calling openly for their death. The European Jews have learned better.\nIt is said that generals always fight the previous war. In this case, it seems apparent that the diaspora Jews were determined to fight their previous enemy rather than their current one. But it should have been obvious that any nation that is unwilling or unable to defend itself is a nation that will be equally unable to defend its guests.\nThat is why I expect the French policeman’s response will serve as a predictive microcosm of the European and American responses to the war that the New Europeans and the New Americans are waging on their resident Jews.\n“What do you expect us to do?” one officer said, then looked away.\nIf the Jews in America do not wish to see America follow Europe’s lead in this regard, they are going to have to do a complete 180 on immigration, do it fast, and do it hard.\nRegardless, I suspect an investment in Israeli real estate may be something to seriously consider as the demand for housing there is only going to grow.",
  "tags": [
    "immigration",
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-07-09T11:00:00+00:00"
}