{
  "url": "https://voxday.net/2024/08/12/educating-the-englishman/",
  "scraped_at": "2026-01-08T19:19:15.815395",
  "title": "Educating the Englishman",
  "date_display": "August 12, 2024",
  "date_iso": "2024-08-12T09:39:02+00:00",
  "date_from_url": "2024-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins, who is considerably less intelligent than the average individual who has never read one of his books tends to imagine, attempts to criticize the USA’s Constitutional limits on democracy. This is a rather transparent attempt by the hapless evolutionist to avoid criticizing his own kingdom’s even more stringent assaults on democracy, probably because if he did, he would be arrested, imprisoned, and convicted within 48 hours. Devon Eriksen wasted no time <a href=\"https://nitter.poast.org/Devon_Eriksen_/status/1822771460236042358\">in setting Dawkins straight</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Richard Dawkins: </strong><em>Electoral College could deliver presidency to party with 73,000 votes against “losing” party’s 260,000. US Senate election: Single voter in Wyoming wields more influence than 65 Californians. Convicted felon can be President but not superbly qualified US citizen born abroad.</em></p><p><strong>Devon Eriksen: </strong>You see, the people who wrote the Constitution understood that a nation is more than just a collection of people. It also consists of all the organizations, processes, institutions, and industries required to actually keep those people alive and have a functional society.</p><p>All of these things need political power to defend and advance their interests, allowing them to function.</p><p>So, the Constitution itself was designed as a balancing act. Some things are up for a vote, and others are not. And when representation is apportioned, it is not doled out equally by head count.</p><p>This is not a bug. It’s a feature. And it’s incredibly wise.</p><p>The more technologically advanced a civilization becomes, the fewer actual thinking human people are employed by life-sustaining industries.</p><p>That’s a good thing. It is the whole fucking point of technology… free up most of your population from whacking at the dirt with a stick to survive, and they can be engineers, businessmen, tradesmen, entertainers, and artists. People are freed from drudgery, invent cool stuff with all their newfound spare time, and life is better.</p><p>But what about those life-sustaining industries? They still have to run. They still need political power in order to make sure the laws protect them, and society sees to their needs. But their work involves very few people, and a lot of machines.</p><p>And machines don’t vote.</p><p>So it’s not only very important, but gradually more and more important, to the health of your nation that the political will of a cattle rancher in Wyoming carries more weight than that of a fashion magazine editor in San Francisco.</p><p>Because fewer and fewer people in your society even understand what is necessary to keep everyone fed.</p></blockquote><p>With the partial exception of Switzerland, the West never had any democracy. In the USA, it is not only limited by the Constitution, but even more strictly by the courts, which make a habit of overturning every referendum that doesn’t please the elite and mostly foreign oligarchy that actually runs the empire masquerading as a “republic”. But both “democracy” and “freedom” are useful rhetorical terms for the imperial propagandists, as they don’t have any substantive meaning that tends to contradict the inverted definitions that are used today.</p><p>Dawkins, like most secularists, is orders of magnitude away from understanding anything about the modern world. In rejecting every aspect of the supernatural, he is completely unequipped to make any sense at all between the ancient war between the fallen god of Carthage and the fallen god of Rome, much less the Divine Invasion that is in, but not of that war.</p><p><em><a href=\"https://social.infogalactic.com/micropost/88278519-dd9b-43d6-8a18-ab7d79770b57\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Richard Dawkins, who is considerably less intelligent than the average individual who has never read one of his books tends to imagine, attempts to criticize the USA’s Constitutional limits on democracy. This is a rather transparent attempt by the hapless evolutionist to avoid criticizing his own kingdom’s even more stringent assaults on democracy, probably because if he did, he would be arrested, imprisoned, and convicted within 48 hours. Devon Eriksen wasted no time\nin setting Dawkins straight\n:\nRichard Dawkins:\nElectoral College could deliver presidency to party with 73,000 votes against “losing” party’s 260,000. US Senate election: Single voter in Wyoming wields more influence than 65 Californians. Convicted felon can be President but not superbly qualified US citizen born abroad.\nDevon Eriksen:\nYou see, the people who wrote the Constitution understood that a nation is more than just a collection of people. It also consists of all the organizations, processes, institutions, and industries required to actually keep those people alive and have a functional society.\nAll of these things need political power to defend and advance their interests, allowing them to function.\nSo, the Constitution itself was designed as a balancing act. Some things are up for a vote, and others are not. And when representation is apportioned, it is not doled out equally by head count.\nThis is not a bug. It’s a feature. And it’s incredibly wise.\nThe more technologically advanced a civilization becomes, the fewer actual thinking human people are employed by life-sustaining industries.\nThat’s a good thing. It is the whole fucking point of technology… free up most of your population from whacking at the dirt with a stick to survive, and they can be engineers, businessmen, tradesmen, entertainers, and artists. People are freed from drudgery, invent cool stuff with all their newfound spare time, and life is better.\nBut what about those life-sustaining industries? They still have to run. They still need political power in order to make sure the laws protect them, and society sees to their needs. But their work involves very few people, and a lot of machines.\nAnd machines don’t vote.\nSo it’s not only very important, but gradually more and more important, to the health of your nation that the political will of a cattle rancher in Wyoming carries more weight than that of a fashion magazine editor in San Francisco.\nBecause fewer and fewer people in your society even understand what is necessary to keep everyone fed.\nWith the partial exception of Switzerland, the West never had any democracy. In the USA, it is not only limited by the Constitution, but even more strictly by the courts, which make a habit of overturning every referendum that doesn’t please the elite and mostly foreign oligarchy that actually runs the empire masquerading as a “republic”. But both “democracy” and “freedom” are useful rhetorical terms for the imperial propagandists, as they don’t have any substantive meaning that tends to contradict the inverted definitions that are used today.\nDawkins, like most secularists, is orders of magnitude away from understanding anything about the modern world. In rejecting every aspect of the supernatural, he is completely unequipped to make any sense at all between the ancient war between the fallen god of Carthage and the fallen god of Rome, much less the Divine Invasion that is in, but not of that war.\nDISCUSS ON SG",
  "tags": [
    "atheism",
    "Christianity",
    "history",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-08-12T09:39:04+00:00"
}