{
  "url": "https://voxday.net/2024/08/30/hear-for-yourself/",
  "scraped_at": "2026-01-08T19:21:07.999507",
  "title": "Hear For Yourself",
  "date_display": "August 30, 2024",
  "date_iso": "2024-08-30T13:25:51+00:00",
  "date_from_url": "2024-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The wall of silence surrounding Neil Gaiman is cracking and beginning to crumble, as both <em>The Bookseller</em> and <em>Publishers Weekly</em> have now publicly referenced the latest Tortoise Media episode, and, as previously mentioned, <em>The Bookseller</em> has been actively reaching out to Gaiman’s publishers for comments on the growing number of accusations of sexual assault, to absolutely no avail.</p><p>I suspect the reason further cracks are appearing is that hearing Neil Gaiman’s words in his own voice is more convincing to a skeptic than any amount of documentary and testimonial evidence would be. Any hope of simply blaming the podcast series on an anti-trans agenda or that it’s a whole lot of nothing is rapidly disappearing. <a href=\"https://www.dropbox.com/scl/fi/cnemezc2lqk13juk1q6n6/Episode-6-The-pattern.pdf?rlkey=5fqo34qzc3t8qsmh2b7zwmxqu&amp;st=4dsq81y3&amp;dl=0\">The transcript of the sixth episode</a> is now available, and it is extremely damning. Though again, not as damning as <a href=\"https://open.spotify.com/episode/0NULZe0boc1mcP2i5rsiKo\">actually hearing Gaiman’s whiny, self-pitying voice</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>NEIL GAIMAN: Hello!<br/>CLAIRE: Hey!<br/>NEIL GAIMAN: How are you? Apart from probably very nervous about this call.<br/>CLAIRE: (brief chuckle) Um… I’m doing well, I – (inaudible, trails off in background) …my letter…<br/>NEIL GAIMAN: …reading your letter, I – if I’d known that – I’d took up that headspace…<br/>CLAIRE: (audible breath) Heh…<br/>NEIL GAIMAN: for you… I would’ve… I don’t know! I would’ve – I definitely would’ve been reaching out a long – time ago! I… I… you know… I’ve never thought of you with anything other than fondness, and…<br/>CLAIRE: Mm.<br/>NEIL GAIMAN: – a little awkwardness, and… um… you know… have me feeling like I’ve got the wrong end of the stick, but I thought you were – terrific! And I – was heartbroken, seeing that I was giving you nightmares, and… (heavy sighs) So I’m really sorry!<br/>NEIL GAIMAN: I … don’t think anything is gonna unwrite the bits that I’ve obviously fucked up on all this. And – and I’m trying to make up some of the damage.</p><p>PAUL CARUANA GALIZIA: Claire tells him that she’s had a long stretch of therapy, one that’s put financial strain on her family, and she expresses concern about how expensive the baby she’s expecting is going to be. Neil Gaiman is quick to offer a solution.</p><p>NEIL GAIMAN: Would you like me to send you some money?<br/>CLAIRE: I – again, the whole – like, putting a price tag on –<br/>NEIL GAIMAN: I mean, I’m not – I’m not trying to put a price tag, I’m –<br/>CLAIRE: (nervous laugh) …yeah…<br/>NEIL GAIMAN: like – just trying to – I’m – I’m not sure that I’m – reading you – I’m, I, I said that very bluntly, ‘cause, uh – (CLAIRE laughs) Like – listen – you’ve got a baby on the way and I appreciate that five hundred – dollars a month…<br/>CLAIRE: (laugh) Yeah.<br/>NEIL GAIMAN: …is, over a decade, is gonna stack up, and … a lot of that must have been my fault.</p><p>PAUL CARUANA GALIZIA: The two end the call slightly awkwardly. Five days later, Neil Gaiman calls Claire again.</p><p>NEIL GAIMAN: So, I have a plan.<br/>CLAIRE: Okay?<br/>NEIL GAIMAN: And I wanted to run it by you… and see if it’s acceptable for you. Um… and I’ve been doing a lot of thinking. A lot of – a lot of listening to what you were saying on the last call. Um… so… what you said about paying for your… therapy. (CLAIRE murmurs) I did the numbers and I went, “Well, that’s 10 years… at $500 a month,” which I make comes out to about $60,000.<br/>Um… so what I would propose… is that I will give you 15 thousand dollars a year for four years. Which… is the – the top level of a tax-free gift.<br/>CLAIRE: Mm.<br/>NEIL GAIMAN: So I can gift it – I can gift you $15,000 each year. And you do not have to pay that, pay any tax or anything on that. That is just a gift. Um… and then, I’m gonna make a hefty donation, to… to the place you sent me the link to.<br/>CLAIRE: Mm-hmm (affirmative).<br/>NEIL GAIMAN: …And that is my plan, if that is acceptable to you.<br/>CLAIRE: That – is really generous! Um, and I appreciate your – um – your appreciation for the –<br/>NEIL GAIMAN: …You know, I did something so much shittier than I ever dreamed, that I – I didn’t even realize I was doing something shitty. I did something really shitty.</p><p>PAUL CARUANA GALIZIA: On the 2nd of August 2022, Neil Gaiman sends Claire $60,000 to cover the cost of her therapy. It’s not the first time Neil Gaiman has paid women he was involved with money. Two months earlier, he had sent some NZ$13,000 (which is nearly US$8,000) and a non-disclosure agreement to Scarlett after an allegedly abusive sexual relationship that lasted three weeks. And around 8 months before paying Claire, he had paid US$275,000 and an NDA to Caroline Wallner after he allegedly coerced her into providing him with sex under the threat of evicting her and her three daughters from his property.</p></blockquote><p>Mr. Galizia and others who are actively investigating the allegations have assured us there is more to come. A lot more, I would imagine, considering some of the unpleasant things that are being uncovered and some of the unexpected connections <a href=\"https://arkhavencomics.com/2024/07/25/gaimangate-the-authorial-edition/\">that are now being made</a>. At this point, given that we now have reason to suspect Gaiman of being another manufactured success, I don’t think it’s even entirely safe to assume that the actor playing the role of the writer necessarily wrote everything that “Neil Gaiman” is presently credited with having written; the larger question is how deep this particular rabbit hole is going to go.</p><p>#GaimanGate quote of the day: <em>“Neil Gaiman’s work is for immature goths at an 8th grade reading level.”</em></p><p>Indeed.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b7cafdfe-094e-46a6-85ce-290a29add977\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The wall of silence surrounding Neil Gaiman is cracking and beginning to crumble, as both\nThe Bookseller\nand\nPublishers Weekly\nhave now publicly referenced the latest Tortoise Media episode, and, as previously mentioned,\nThe Bookseller\nhas been actively reaching out to Gaiman’s publishers for comments on the growing number of accusations of sexual assault, to absolutely no avail.\nI suspect the reason further cracks are appearing is that hearing Neil Gaiman’s words in his own voice is more convincing to a skeptic than any amount of documentary and testimonial evidence would be. Any hope of simply blaming the podcast series on an anti-trans agenda or that it’s a whole lot of nothing is rapidly disappearing.\nThe transcript of the sixth episode\nis now available, and it is extremely damning. Though again, not as damning as\nactually hearing Gaiman’s whiny, self-pitying voice\n.\nNEIL GAIMAN: Hello!\nCLAIRE: Hey!\nNEIL GAIMAN: How are you? Apart from probably very nervous about this call.\nCLAIRE: (brief chuckle) Um… I’m doing well, I – (inaudible, trails off in background) …my letter…\nNEIL GAIMAN: …reading your letter, I – if I’d known that – I’d took up that headspace…\nCLAIRE: (audible breath) Heh…\nNEIL GAIMAN: for you… I would’ve… I don’t know! I would’ve – I definitely would’ve been reaching out a long – time ago! I… I… you know… I’ve never thought of you with anything other than fondness, and…\nCLAIRE: Mm.\nNEIL GAIMAN: – a little awkwardness, and… um… you know… have me feeling like I’ve got the wrong end of the stick, but I thought you were – terrific! And I – was heartbroken, seeing that I was giving you nightmares, and… (heavy sighs) So I’m really sorry!\nNEIL GAIMAN: I … don’t think anything is gonna unwrite the bits that I’ve obviously fucked up on all this. And – and I’m trying to make up some of the damage.\nPAUL CARUANA GALIZIA: Claire tells him that she’s had a long stretch of therapy, one that’s put financial strain on her family, and she expresses concern about how expensive the baby she’s expecting is going to be. Neil Gaiman is quick to offer a solution.\nNEIL GAIMAN: Would you like me to send you some money?\nCLAIRE: I – again, the whole – like, putting a price tag on –\nNEIL GAIMAN: I mean, I’m not – I’m not trying to put a price tag, I’m –\nCLAIRE: (nervous laugh) …yeah…\nNEIL GAIMAN: like – just trying to – I’m – I’m not sure that I’m – reading you – I’m, I, I said that very bluntly, ‘cause, uh – (CLAIRE laughs) Like – listen – you’ve got a baby on the way and I appreciate that five hundred – dollars a month…\nCLAIRE: (laugh) Yeah.\nNEIL GAIMAN: …is, over a decade, is gonna stack up, and … a lot of that must have been my fault.\nPAUL CARUANA GALIZIA: The two end the call slightly awkwardly. Five days later, Neil Gaiman calls Claire again.\nNEIL GAIMAN: So, I have a plan.\nCLAIRE: Okay?\nNEIL GAIMAN: And I wanted to run it by you… and see if it’s acceptable for you. Um… and I’ve been doing a lot of thinking. A lot of – a lot of listening to what you were saying on the last call. Um… so… what you said about paying for your… therapy. (CLAIRE murmurs) I did the numbers and I went, “Well, that’s 10 years… at $500 a month,” which I make comes out to about $60,000.\nUm… so what I would propose… is that I will give you 15 thousand dollars a year for four years. Which… is the – the top level of a tax-free gift.\nCLAIRE: Mm.\nNEIL GAIMAN: So I can gift it – I can gift you $15,000 each year. And you do not have to pay that, pay any tax or anything on that. That is just a gift. Um… and then, I’m gonna make a hefty donation, to… to the place you sent me the link to.\nCLAIRE: Mm-hmm (affirmative).\nNEIL GAIMAN: …And that is my plan, if that is acceptable to you.\nCLAIRE: That – is really generous! Um, and I appreciate your – um – your appreciation for the –\nNEIL GAIMAN: …You know, I did something so much shittier than I ever dreamed, that I – I didn’t even realize I was doing something shitty. I did something really shitty.\nPAUL CARUANA GALIZIA: On the 2nd of August 2022, Neil Gaiman sends Claire $60,000 to cover the cost of her therapy. It’s not the first time Neil Gaiman has paid women he was involved with money. Two months earlier, he had sent some NZ$13,000 (which is nearly US$8,000) and a non-disclosure agreement to Scarlett after an allegedly abusive sexual relationship that lasted three weeks. And around 8 months before paying Claire, he had paid US$275,000 and an NDA to Caroline Wallner after he allegedly coerced her into providing him with sex under the threat of evicting her and her three daughters from his property.\nMr. Galizia and others who are actively investigating the allegations have assured us there is more to come. A lot more, I would imagine, considering some of the unpleasant things that are being uncovered and some of the unexpected connections\nthat are now being made\n. At this point, given that we now have reason to suspect Gaiman of being another manufactured success, I don’t think it’s even entirely safe to assume that the actor playing the role of the writer necessarily wrote everything that “Neil Gaiman” is presently credited with having written; the larger question is how deep this particular rabbit hole is going to go.\n#GaimanGate quote of the day:\n“Neil Gaiman’s work is for immature goths at an 8th grade reading level.”\nIndeed.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-08-30T13:32:49+00:00"
}