{
  "url": "https://voxday.net/2024/08/17/sfwa-melting-down/",
  "scraped_at": "2026-01-08T19:19:47.394061",
  "title": "SFWA Melting Down",
  "date_display": "August 17, 2024",
  "date_iso": "2024-08-17T00:05:22+00:00",
  "date_from_url": "2024-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It looks as if SFWA is rapidly going the way of RWA, which is to say, toward extinction. Fandom Pulse has covered the resignation of the last TWO presidents in the last three weeks, now <a href=\"https://substack.com/app-link/post?publication_id=2271663&amp;post_id=144972469&amp;utm_source=post-email-title&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=3a0ajt&amp;token=eyJ1c2VyX2lkIjoxOTgyMDgzNjEsInBvc3RfaWQiOjE0NDk3MjQ2OSwiaWF0IjoxNzIzODUxODY4LCJleHAiOjE3MjY0NDM4NjgsImlzcyI6InB1Yi0yMjcxNjYzIiwic3ViIjoicG9zdC1yZWFjdGlvbiJ9.xA9r5W1-3LlQxqBuofgQy8DMyTZ8JL3NpTMn182WU_g\">it’s got some inside information</a> as to what appears to be going on.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>For the first of the inside information Fandom Pulse has gotten on the situation, we have a post to the SFWA forums from Michael Capobianco that exposes troubles within the organization. Capobianco wrote a series of novels in the 1990s and was married to fan-favorite Star Trek novelist A.C. Crispin before she passed. In this post, Capobianco exposes former President Jeffe Kennedy’s gross incompetence and mismanagement at running SFWA, and paints a story of disaster through the recent years of the organization. He said:</p><p><em>Since I think a lot of people are taken aback by Jeffe’s sudden resignation and lack some of the context of what’s been happening lately, I wanted to post here with my own perspective. Please note that this post is not an attack on any board member, on Jeffe, or on the board as a whole.</em>..</p><p><em>However, I just wanted it on the record that her resignation letter (attached here as a PDF in case you haven’t seen it) ignores the fact that some past members of the board and former staff, as well as numerous SFWA members, were asking for her to be removed from her position for a number of reasons. I would even say that her email is a great example of why folks were asking for her removal—it places the blame for what’s happening squarely on something else and makes her seem like the victim, rather than accepting any accountability for how her own actions have led to the current circumstances.</em></p><p><em>The immediate event that kicked this off was Terra LeMay being terminated from her staff position after putting in a 90-day notice due to being denied reasonable disability accommodations, and then banned from Discord and blocked from accessing her SFWA email (presumably by Jeffe) after she asked for an explanation on Discord in the ask-the-board channel. Prior to that, several former board members and staff have also resigned from their positions, although I do not know for certain these resignations were related to Jeffe and actually did not realize the staff had resigned at all until this happened. (AFAIK Kate is currently the only SFWA staff member.)</em></p><p><em>Communications from the board have been slow and opaque in general for the past few years, and the Nebulas conference seems to always get cited as a reason not to do anything. But on top of that, a number of volunteers or former volunteers (myself included) have been frustrated with a lack of transparency from the board and the fact that some board members have tended to consistently blame volunteers for projects failing when it was the board that canceled them—or even for projects succeeding if they caused extra work for the organization or its board members and volunteers—despite also frequently pushing extra-heavy workloads onto those volunteers and providing them with zero support. (As an example of this, see Jason Sanford’s post about his withdrawal from running SFWA’s annual auction.)</em></p><p><em>It seems like a part of the issue is that everyone serving on the board and in some volunteer positions is asked to sign a really broad NDA, which they feel stops them from being able to ever talk about anything. My personal opinion is that in this case, that NDA and the opaque environment it creates resulted in a space in which staff and board members did not feel empowered to speak out about their own poor treatment, and which allowed Jeffe to continue acting in ways that did not necessarily benefit the organization as a whole.</em></p></blockquote><p>You know, back in 2013, SFWA had the opportunity to elect a smart business- and technology-savvy author who had a pretty clear vision for the way the industry was headed as its president. Not only <a href=\"https://voxday.net/2013/05/03/sfwa-opts-for-status-quo/\">did they not elect me</a>, they even pretended to kick me out of the club for my effrontery in thinking that a very different course of action to prepare for the coming changes in the industry was in order. Of course, like everything the SFWA Board does, they did it incompetently and ineffectively, as they never held the membership-wide vote on expulsion that the state bylaws required at the time. Like it or not, I’m still a Life Member, at least for the next 6-9 months it takes for SFWA to completely collapse.</p><p>Needless to say, I’m only surprised it has taken this long, as I pointed out 11 years ago.</p><p><em>I certainly wish Steven Gould good fortune in piloting the organization, although given his support for the status quo and his stated opinion that SF/F is not in any trouble as an industry, my concern is that his victory will tend to increase the probability that the organization will founder upon the very shoals my platform was designed to avoid. But that is Mr. Gould’s concern now, not mine.</em></p><p>So, I founded and focused my attention on a little organization called Castalia House instead. At this point, I’d say that was a pretty good tradeoff. And if you want to have a look at our beautiful new <em>WAR AND PEACE</em> stampings for the pair of upcoming Library and Libraria editions, as well as the lovely new sign on display for the 2024-25 season at Meadowbank Stadium, <a href=\"https://castalialibrary.substack.com/p/war-and-peace-stamp-test\">check out the Castalia Library substack</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/045564f0-8051-47bf-aadf-0cdec8b26d5d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It looks as if SFWA is rapidly going the way of RWA, which is to say, toward extinction. Fandom Pulse has covered the resignation of the last TWO presidents in the last three weeks, now\nit’s got some inside information\nas to what appears to be going on.\nFor the first of the inside information Fandom Pulse has gotten on the situation, we have a post to the SFWA forums from Michael Capobianco that exposes troubles within the organization. Capobianco wrote a series of novels in the 1990s and was married to fan-favorite Star Trek novelist A.C. Crispin before she passed. In this post, Capobianco exposes former President Jeffe Kennedy’s gross incompetence and mismanagement at running SFWA, and paints a story of disaster through the recent years of the organization. He said:\nSince I think a lot of people are taken aback by Jeffe’s sudden resignation and lack some of the context of what’s been happening lately, I wanted to post here with my own perspective. Please note that this post is not an attack on any board member, on Jeffe, or on the board as a whole.\n..\nHowever, I just wanted it on the record that her resignation letter (attached here as a PDF in case you haven’t seen it) ignores the fact that some past members of the board and former staff, as well as numerous SFWA members, were asking for her to be removed from her position for a number of reasons. I would even say that her email is a great example of why folks were asking for her removal—it places the blame for what’s happening squarely on something else and makes her seem like the victim, rather than accepting any accountability for how her own actions have led to the current circumstances.\nThe immediate event that kicked this off was Terra LeMay being terminated from her staff position after putting in a 90-day notice due to being denied reasonable disability accommodations, and then banned from Discord and blocked from accessing her SFWA email (presumably by Jeffe) after she asked for an explanation on Discord in the ask-the-board channel. Prior to that, several former board members and staff have also resigned from their positions, although I do not know for certain these resignations were related to Jeffe and actually did not realize the staff had resigned at all until this happened. (AFAIK Kate is currently the only SFWA staff member.)\nCommunications from the board have been slow and opaque in general for the past few years, and the Nebulas conference seems to always get cited as a reason not to do anything. But on top of that, a number of volunteers or former volunteers (myself included) have been frustrated with a lack of transparency from the board and the fact that some board members have tended to consistently blame volunteers for projects failing when it was the board that canceled them—or even for projects succeeding if they caused extra work for the organization or its board members and volunteers—despite also frequently pushing extra-heavy workloads onto those volunteers and providing them with zero support. (As an example of this, see Jason Sanford’s post about his withdrawal from running SFWA’s annual auction.)\nIt seems like a part of the issue is that everyone serving on the board and in some volunteer positions is asked to sign a really broad NDA, which they feel stops them from being able to ever talk about anything. My personal opinion is that in this case, that NDA and the opaque environment it creates resulted in a space in which staff and board members did not feel empowered to speak out about their own poor treatment, and which allowed Jeffe to continue acting in ways that did not necessarily benefit the organization as a whole.\nYou know, back in 2013, SFWA had the opportunity to elect a smart business- and technology-savvy author who had a pretty clear vision for the way the industry was headed as its president. Not only\ndid they not elect me\n, they even pretended to kick me out of the club for my effrontery in thinking that a very different course of action to prepare for the coming changes in the industry was in order. Of course, like everything the SFWA Board does, they did it incompetently and ineffectively, as they never held the membership-wide vote on expulsion that the state bylaws required at the time. Like it or not, I’m still a Life Member, at least for the next 6-9 months it takes for SFWA to completely collapse.\nNeedless to say, I’m only surprised it has taken this long, as I pointed out 11 years ago.\nI certainly wish Steven Gould good fortune in piloting the organization, although given his support for the status quo and his stated opinion that SF/F is not in any trouble as an industry, my concern is that his victory will tend to increase the probability that the organization will founder upon the very shoals my platform was designed to avoid. But that is Mr. Gould’s concern now, not mine.\nSo, I founded and focused my attention on a little organization called Castalia House instead. At this point, I’d say that was a pretty good tradeoff. And if you want to have a look at our beautiful new\nWAR AND PEACE\nstampings for the pair of upcoming Library and Libraria editions, as well as the lovely new sign on display for the 2024-25 season at Meadowbank Stadium,\ncheck out the Castalia Library substack\n.\nDISCUSS ON SG",
  "tags": [
    "Castalia Library",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-08-17T01:22:02+00:00"
}