{
  "url": "https://voxday.net/2024/08/12/she-knows-some-bad-people/",
  "scraped_at": "2026-01-08T19:19:19.622460",
  "title": "She Knows Some Bad People",
  "date_display": "August 12, 2024",
  "date_iso": "2024-08-12T23:39:52+00:00",
  "date_from_url": "2024-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is a short piece about Neil Gaiman by a woman with whom I was briefly acquainted; I also knew the “Mike” to whom she refers, and even spent quite a bit of time talking to him about Traveller at the one science convention I ever went to, which I believe was called Minicon. He had contributed a few adventures to Marc Miller’s excellent SF game, and I was interested in obtaining the video game rights to it. Elise was a bit of a character, as she attended the Minnesota writers workshop that consisted of Lois McMaster Bujold, Pat Wrede, Joel Rosenberg, Bruce Bethke, and Peg Kerr, among others, at which I was a guest for a few months in the mid-90s. However, I was always a bit confused as to what Elise was doing there, as she never wrote anything and didn’t appear to ever read anyone else’s work either. I don’t believe Mike aka John M. Ford belonged to the writer’s group, or if he did, he never showed up while I was there.</em></p><p><em>The one thing I remember about Elise was that she was what I consider to be a full-time professional feminist. So, if she says she didn’t know Gaiman was up to the various shenanigans of which he has been repeatedly accused, I have <span style=\"text-decoration: underline;\">absolutely no doubt</span> that she didn’t, because she struck me as the sort of woman that is obsessively interested in complaining about every form of male oppression. Which tells us that Gaiman was more than a bit circumspect in his predations, and that he was very much a self-controlled and intentional stalker of insecure and starstruck young women.</em></p><p>I’ve known Neil Gaiman since the very early nineties, when Mike said a friend was coming to a local book-centric fantasy convention and that we should look after him. Apparently he sounded trepidatious or something; Mike said something about how of course there were the comics but the friend said he’s only written one book and he only wrote half of that. Sure, Mike, we can make your friend welcome. So we did. I wrote elsewhere about how this left me for some years with a habit of checking in on Neil at events or when he had a recording session where I worked. I’d go by to see how he was doing, ask whether he’d eaten lately, see if he needed anything. I didn’t quite march over and tell him to put on a sweater, but it was like that. (He always had a leather jacket; a sweater wasn’t necessary.)</p><p>Over the decades there were shared meals in various cities, late night convention conversations, visits to the house, gatherings and parties, some with musicals written by Mike because Neil had made a typo on the invitation too good for Mike to resist. For many years I’ve navigated to Neil’s house by singing the American Pie filk Mike wrote about Neil’s invitation to his annual Guy Fawkes Day party which contained the driving directions. One verse ended “The tower lights will be alive; you’ll see the house as you arrive. But do not park upon the drive!” because that last bit was emphasized on the invitation.</p><p>Mike and Neil meant a lot to each other. Back in the day, watching the two of them talk writing at a restaurant or sushi bar or a room at a convention late at night was a true delight. When Mike died, Neil helped me through the aftermath. He gave one of the eulogies. He did kind things. He wrote a foreword for Mike’s posthumously published book Aspects which was pretty much another eulogy. He told me it was the hardest thing he ever had to write, and that we were very lucky to have had Mike in our lives.</p><p>One time at the house Neil gave me beeswax from his beehives. I used it to make pendants where meteorite dust was sealed into tiny corked glass bottles with the beeswax and sterling silver wire. Stardust in a bottle.</p><p>For decades, my metric for buying a new pair of glasses was that whichever one made me wonder what Neil would think of it was the one I’d probably buy.</p><p>He took me to my first Tori Amos concert many years ago.</p><p>So yeah, I’ve been friends with Neil for somewhere upwards of three decades.</p><p>After the news broke, I walked through my house, and every room had something Neil had written, or some art or music that he had introduced me to, or something he had given me. He’s woven through so many memories, with Mike and without. I looked through various correspondence, all the notes with “So much love to you,” all the snippets of news and shared silliness. Years. Decades.</p><p>And you know what? Not one bit of that cancels out any of what the survivors say. He’s been my friend for a long time. And I believe them. Which is a tangled set of feelings from one angle, but from another perspective what rings true to me is clear. I believe them.</p><p>When I see people saying “Oh, everybody knew,” I shake my head. Everybody did not know. I didn’t know. Nobody in any of the whisper networks told me, or warned me, or asked me to help anyone who had been hurt. And I never figured it out for myself. When the news broke, I was shocked.</p><p>Thinking back, I wondered whether anyone had thought he must be OK to be around because of people like me who were his friends. It’s happened before. I don’t like being used as cover… What I say to my friend when we next talk will be between me and him. What I most want to say is “You know fairy tales. You WRITE fairy tales. What did you think was going to happen??”</p><p><em><a href=\"https://social.infogalactic.com/micropost/4d2ca787-ad6d-4dff-8ffe-ed208c47c1a5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is a short piece about Neil Gaiman by a woman with whom I was briefly acquainted; I also knew the “Mike” to whom she refers, and even spent quite a bit of time talking to him about Traveller at the one science convention I ever went to, which I believe was called Minicon. He had contributed a few adventures to Marc Miller’s excellent SF game, and I was interested in obtaining the video game rights to it. Elise was a bit of a character, as she attended the Minnesota writers workshop that consisted of Lois McMaster Bujold, Pat Wrede, Joel Rosenberg, Bruce Bethke, and Peg Kerr, among others, at which I was a guest for a few months in the mid-90s. However, I was always a bit confused as to what Elise was doing there, as she never wrote anything and didn’t appear to ever read anyone else’s work either. I don’t believe Mike aka John M. Ford belonged to the writer’s group, or if he did, he never showed up while I was there.\nThe one thing I remember about Elise was that she was what I consider to be a full-time professional feminist. So, if she says she didn’t know Gaiman was up to the various shenanigans of which he has been repeatedly accused, I have\nabsolutely no doubt\nthat she didn’t, because she struck me as the sort of woman that is obsessively interested in complaining about every form of male oppression. Which tells us that Gaiman was more than a bit circumspect in his predations, and that he was very much a self-controlled and intentional stalker of insecure and starstruck young women.\nI’ve known Neil Gaiman since the very early nineties, when Mike said a friend was coming to a local book-centric fantasy convention and that we should look after him. Apparently he sounded trepidatious or something; Mike said something about how of course there were the comics but the friend said he’s only written one book and he only wrote half of that. Sure, Mike, we can make your friend welcome. So we did. I wrote elsewhere about how this left me for some years with a habit of checking in on Neil at events or when he had a recording session where I worked. I’d go by to see how he was doing, ask whether he’d eaten lately, see if he needed anything. I didn’t quite march over and tell him to put on a sweater, but it was like that. (He always had a leather jacket; a sweater wasn’t necessary.)\nOver the decades there were shared meals in various cities, late night convention conversations, visits to the house, gatherings and parties, some with musicals written by Mike because Neil had made a typo on the invitation too good for Mike to resist. For many years I’ve navigated to Neil’s house by singing the American Pie filk Mike wrote about Neil’s invitation to his annual Guy Fawkes Day party which contained the driving directions. One verse ended “The tower lights will be alive; you’ll see the house as you arrive. But do not park upon the drive!” because that last bit was emphasized on the invitation.\nMike and Neil meant a lot to each other. Back in the day, watching the two of them talk writing at a restaurant or sushi bar or a room at a convention late at night was a true delight. When Mike died, Neil helped me through the aftermath. He gave one of the eulogies. He did kind things. He wrote a foreword for Mike’s posthumously published book Aspects which was pretty much another eulogy. He told me it was the hardest thing he ever had to write, and that we were very lucky to have had Mike in our lives.\nOne time at the house Neil gave me beeswax from his beehives. I used it to make pendants where meteorite dust was sealed into tiny corked glass bottles with the beeswax and sterling silver wire. Stardust in a bottle.\nFor decades, my metric for buying a new pair of glasses was that whichever one made me wonder what Neil would think of it was the one I’d probably buy.\nHe took me to my first Tori Amos concert many years ago.\nSo yeah, I’ve been friends with Neil for somewhere upwards of three decades.\nAfter the news broke, I walked through my house, and every room had something Neil had written, or some art or music that he had introduced me to, or something he had given me. He’s woven through so many memories, with Mike and without. I looked through various correspondence, all the notes with “So much love to you,” all the snippets of news and shared silliness. Years. Decades.\nAnd you know what? Not one bit of that cancels out any of what the survivors say. He’s been my friend for a long time. And I believe them. Which is a tangled set of feelings from one angle, but from another perspective what rings true to me is clear. I believe them.\nWhen I see people saying “Oh, everybody knew,” I shake my head. Everybody did not know. I didn’t know. Nobody in any of the whisper networks told me, or warned me, or asked me to help anyone who had been hurt. And I never figured it out for myself. When the news broke, I was shocked.\nThinking back, I wondered whether anyone had thought he must be OK to be around because of people like me who were his friends. It’s happened before. I don’t like being used as cover… What I say to my friend when we next talk will be between me and him. What I most want to say is “You know fairy tales. You WRITE fairy tales. What did you think was going to happen??”\nDISCUSS ON SG",
  "tags": [
    "history",
    "Pink SF",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-08-12T23:39:53+00:00"
}