{
  "url": "https://voxday.net/2024/08/09/technology-changes-war/",
  "scraped_at": "2026-01-08T19:19:01.026210",
  "title": "Technology Changes War",
  "date_display": "August 9, 2024",
  "date_iso": "2024-08-09T09:34:45+00:00",
  "date_from_url": "2024-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And when it changes, those who struggle to adapt will suffer. Col Macgregor reports that an attempt to infiltrate Yemen <a href=\"https://www.youtube.com/watch?v=g_-WTBF_-Wc\">resulted in a complete disaster</a> courtesy of Russian satellite technology.</p><p><strong>Andrew Napolitano:</strong> <em>Colonel was there recently some military activity by the Houthies which resulted in about 70 deaths of IDF and some American contractors about which you can tell us?</em></p><p><strong>Col. Douglas Macgregor:</strong> Well, I can tell you only what I found through open source material. I haven’t seen anything classified but I am reliably told that roughly 70 Israeli Special Forces along with some number of Americans, the total number was 70. How many were American mercenaries that joined in this operation, I don’t know what the exact breakdown was, but it was obviously mostly Israeli. They infiltrated successfully into Yemen, but they were tracked from the moment they infiltrated by overhead satellites, presumably Russian, and the Russians provided this information to the Iranians who immediately telegraphed it to the Houthis. Whatever you say about the Houthis, they’re tough hombres on the battlefield. They set up an ambush and they killed all of them, and there is footage of the dead. I haven’t had a chance to examine it carefully, clearly most of it’s Israeli, but there are some indisputably some American mercenaries, there may be some Brits mixed into it who are also employees of the same contract firm now. This is something very important for everybody listening to understand: persistent surveillance today changes everything in warfare. It not only enables precision strike on a scale that has never been the case in the past, it makes it impossible for forces to infiltrate into regions without being discovered.</p><p>We can’t know yet if this report is true or not. But there are four reasons it is credible:</p><ol class=\"wp-block-list\"><li>Yemen successfully denied the Red Sea to the US Navy earlier this year.</li><li>The US Navy wants to put its four aircraft carriers in the Middle East in position to support Israeli efforts in the region, but is endangered by Yemeni land-to-sea strike abilities.</li><li>Taking out the coastal missile batteries using air strikes has failed.</li><li>An infantry infiltration was the only remaining option for eliminating Yemeni land-to-sea capabilities.</li></ol><p>So, the fact that the IDF and some US special forces are reported to have attempted the obvious solution to the problem makes sense. However, I fail to see how this puts Israel on the ropes in any way; the denial of the Red Sea was already an accomplished fact and despite decades of claims to the contrary, Iran is observably not in any particular hurry to start a full-scale war with Israel.</p><p>Speaking of technology and war, I highly recommend Martin van Creveld’s work on the matter. It’s an excellent and informative book.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c34a8e85-2e51-4f61-86a3-c8ce07216925\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And when it changes, those who struggle to adapt will suffer. Col Macgregor reports that an attempt to infiltrate Yemen\nresulted in a complete disaster\ncourtesy of Russian satellite technology.\nAndrew Napolitano:\nColonel was there recently some military activity by the Houthies which resulted in about 70 deaths of IDF and some American contractors about which you can tell us?\nCol. Douglas Macgregor:\nWell, I can tell you only what I found through open source material. I haven’t seen anything classified but I am reliably told that roughly 70 Israeli Special Forces along with some number of Americans, the total number was 70. How many were American mercenaries that joined in this operation, I don’t know what the exact breakdown was, but it was obviously mostly Israeli. They infiltrated successfully into Yemen, but they were tracked from the moment they infiltrated by overhead satellites, presumably Russian, and the Russians provided this information to the Iranians who immediately telegraphed it to the Houthis. Whatever you say about the Houthis, they’re tough hombres on the battlefield. They set up an ambush and they killed all of them, and there is footage of the dead. I haven’t had a chance to examine it carefully, clearly most of it’s Israeli, but there are some indisputably some American mercenaries, there may be some Brits mixed into it who are also employees of the same contract firm now. This is something very important for everybody listening to understand: persistent surveillance today changes everything in warfare. It not only enables precision strike on a scale that has never been the case in the past, it makes it impossible for forces to infiltrate into regions without being discovered.\nWe can’t know yet if this report is true or not. But there are four reasons it is credible:\nYemen successfully denied the Red Sea to the US Navy earlier this year.\nThe US Navy wants to put its four aircraft carriers in the Middle East in position to support Israeli efforts in the region, but is endangered by Yemeni land-to-sea strike abilities.\nTaking out the coastal missile batteries using air strikes has failed.\nAn infantry infiltration was the only remaining option for eliminating Yemeni land-to-sea capabilities.\nSo, the fact that the IDF and some US special forces are reported to have attempted the obvious solution to the problem makes sense. However, I fail to see how this puts Israel on the ropes in any way; the denial of the Red Sea was already an accomplished fact and despite decades of claims to the contrary, Iran is observably not in any particular hurry to start a full-scale war with Israel.\nSpeaking of technology and war, I highly recommend Martin van Creveld’s work on the matter. It’s an excellent and informative book.\nDISCUSS ON SG",
  "tags": [
    "Middle East",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-08-09T09:34:47+00:00"
}