{
  "url": "https://voxday.net/2024/08/28/the-gaiman-defense-team-in-action/",
  "scraped_at": "2026-01-08T19:21:00.617652",
  "title": "The Gaiman Defense Team in Action",
  "date_display": "August 28, 2024",
  "date_iso": "2024-08-28T12:06:39+00:00",
  "date_from_url": "2024-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Behind the scenes, Neil Gaiman and his coterie of freakshows and followers and PR firms have been actively engaged in gaslighting his growing number of accusers for the last two months. This is probably the primary reason for the wall of silence from everyone who has worshipped at the feet of the modestly-talented charlatan, which is nearly everyone in science fiction and fantasy today. One target of this gaslighting has apparently had enough of  the nonsense and was gracious enough <a href=\"https://bsky.app/profile/tessfowler.bsky.social/post/3l2pudtcg2r26\">to expose it publicly</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A summary of the SIXTH episode about Neil Gaiman’s decades long web of abuse. He can be heard in recorded calls. This is Neil. Listen to it for yourself.</p><p>Also of note, my former friend who is deep in his cultish inner circle sent me private emails from this woman speaking in this episode. Private emails sent to me in the hopes I wouldn’t believe her story (first aired on a different podcast). Emails from when she was 21/22 and was in the midst of her situation with Neil.</p><p>Neil sent this woman’s emails out to one of his lovers and god knows who else, along with lies about her claims…long AFTER these phone calls you’ll hear in this episode. He admits it. And later lies. Lies that arrived on my phone randomly from someone I considered my friend. Because apparently he really enjoys brain washing people.</p><p>I am livid. These women have been brave to come forward this way! Guess he’s not so far removed from his Scientology upbringing after all, eh? If you want to come forward about Neil in any way I hope you will feel empowered by the women who have spoken out. You don’t have to protect him any longer.</p><p>I won’t share screencaps of Claire’s emails themselves because those shouldn’t have been shared with me in the first place but this is from my former friend, the day after we fought by phone. Neil forwarded my friend these emails which she sent to me and at least one other person TO DISCREDIT CLAIRE.</p><p>The exact date was the day after Claire’s story first dropped. July 28th i believe? He was working overtime texting and calling people to get them in line. Also his lawyers apparently asked him for a list of names of all his “girlfriends” who might be “unhappy”.</p></blockquote><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-64243\" decoding=\"async\" fetchpriority=\"high\" height=\"961\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/08/image-51.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/08/image-51.png 512w, https://voxday.net/wp-content/uploads/2024/08/image-51-160x300.png 160w\" width=\"512\"/></figure></div><p>It’s somewhat amusing how the Gaiman Defense Team tries to hit any angle that they think might work. But denigrating journalists who are literally doing their job as “sociopaths who just wanted a story” is never going to work with anyone. I’ve been the subject of more stupid, pointless, and unmerited hit pieces than Neil Gaiman ever will be, and it never even occurred to me to blame the journalists or call them psychopaths for trying to score a few points with the SJW crowd.</p><p>I mean, when a Tor Books author publishes a piece in a major UK newspaper quoting numerous Tor editors and authors about how evil you are for stealing nominations that should have gone to Tor editors and authors like they always do, it’s hard to take it personally. The motivation underlying the hit piece isn’t exactly opaque.</p><p>Anyhow, I really don’t think the defense team’s “get to know the real Gaiman behind the allegations” is a tactic that is likely to prove successful. Because the real Gaiman, the one you can hear on the podcast, is a creepy, self-pitying little Gamma male, whose success has obviously been mostly manufactured for him. Forget autism and narcissism, I’ll bet he’s got one whopper of a case of Imposter Syndrome, because he’s an even bigger literary imposter than John Scalzi. What Gaiman’s fans like about him is not the actual individual, it is the Wizard of Goth construction that conceals the wretched little man.</p><p>I just finished reading Gaiman’s <em>Ocean at the End of the Lane</em>. It’s not terrible. It has its elements and its moments. I’ll review it on the Darkstream sometime. But for me, the most noteworthy aspect of the little novel was not its whitewashing of a historical Scientology-related suicide that may or may not have actually been a suicide, but rather, its relentless and imitative mediocrity.</p><p>Jeff Vandermeer saw it too. Any halfway-decent author who actually reads a Gaiman book can’t help but see that it’s always been fraudulent. Given what we now know of his Scientology background, his success in bookselling shouldn’t be taken any more indicative of his literary talents than L. Ron Hubbard’s was.</p><p><em>Just stop quoting stupid ass Neil Gaiman writing advice. It’s always like “trust in your dreams” or other shit you see on a bumpersticker or on a sign in a Hobby Lobby. “Trust your dreams and pixie dust will shoot out of your ass.”</em></p><p>The art always betrays the author. I knew John C. Wright was a science fiction grand master from the first time I read <em>The Golden Age</em>. I knew Cornelius Claudio Kreutsch was a genuine magician at the keyboard the first time I saw him play in Barcelona. And I knew Neil Gaiman was a literary fraud by the time I finished reading the sixth issue of <em>Sandman</em> back in 2018; I’d previously read <em>Good Omens</em>, which aside from a few typical Terry Pratchett gems, I found to be a disappointing and not-very-funny Douglas Adams pastiche.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><noscript><img alt=\"\" class=\"wp-image-64244\" decoding=\"async\" height=\"587\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/08/image-52.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/08/image-52.png 512w, https://voxday.net/wp-content/uploads/2024/08/image-52-262x300.png 262w\" width=\"512\"/></noscript><img alt=\"\" class=\"lazyload wp-image-64244\" data-sizes=\"(max-width: 512px) 100vw, 512px\" data-src=\"https://voxday.net/wp-content/uploads/2024/08/image-52.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2024/08/image-52.png 512w, https://voxday.net/wp-content/uploads/2024/08/image-52-262x300.png 262w\" decoding=\"async\" height=\"587\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20587%22%3E%3C/svg%3E\" width=\"512\"/></figure></div><p>Neil Gaiman is Jordan Peterson for the Drama Club. He mirrors back to them what they want to see in themselves He was always John Dee, never Dream.</p><p><strong>UPDATE: </strong>The Wall of Silence just developed <a href=\"https://www.thebookseller.com/news/neil-gaiman-accused-of-sexual-assault-by-fifth-woman#Echobox=1724860230\">a pretty big crack</a>. <em>The Bookseller</em> is an important industry site in the UK:</p><p><em>The Bookseller reached out to Gaiman’s representatives, who did not respond, and his publishers, with Headline declining to comment, and Bloomsbury, Penguin Random House (PRH) and HarperCollins US not responding to requests to comment. The Bookseller also reached out to the Royal Society of Literature, of which Gaiman is a patron, which declined to comment, as did the Publishers Association. The Bookseller also contacted the Society of Authors (SoA) for a comment but it did not respond.</em></p><p>Just wait until the publishing industry realizes that a significant percentage of Gaiman’s alleged 50 million book sales went to Scientology, as with L. Ron Hubbard’s “bestsellers”.</p><p><em><a href=\"https://social.infogalactic.com/micropost/fc85a56f-9454-4cc6-80f3-e507307f68cb\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Behind the scenes, Neil Gaiman and his coterie of freakshows and followers and PR firms have been actively engaged in gaslighting his growing number of accusers for the last two months. This is probably the primary reason for the wall of silence from everyone who has worshipped at the feet of the modestly-talented charlatan, which is nearly everyone in science fiction and fantasy today. One target of this gaslighting has apparently had enough of  the nonsense and was gracious enough\nto expose it publicly\n:\nA summary of the SIXTH episode about Neil Gaiman’s decades long web of abuse. He can be heard in recorded calls. This is Neil. Listen to it for yourself.\nAlso of note, my former friend who is deep in his cultish inner circle sent me private emails from this woman speaking in this episode. Private emails sent to me in the hopes I wouldn’t believe her story (first aired on a different podcast). Emails from when she was 21/22 and was in the midst of her situation with Neil.\nNeil sent this woman’s emails out to one of his lovers and god knows who else, along with lies about her claims…long AFTER these phone calls you’ll hear in this episode. He admits it. And later lies. Lies that arrived on my phone randomly from someone I considered my friend. Because apparently he really enjoys brain washing people.\nI am livid. These women have been brave to come forward this way! Guess he’s not so far removed from his Scientology upbringing after all, eh? If you want to come forward about Neil in any way I hope you will feel empowered by the women who have spoken out. You don’t have to protect him any longer.\nI won’t share screencaps of Claire’s emails themselves because those shouldn’t have been shared with me in the first place but this is from my former friend, the day after we fought by phone. Neil forwarded my friend these emails which she sent to me and at least one other person TO DISCREDIT CLAIRE.\nThe exact date was the day after Claire’s story first dropped. July 28th i believe? He was working overtime texting and calling people to get them in line. Also his lawyers apparently asked him for a list of names of all his “girlfriends” who might be “unhappy”.\nIt’s somewhat amusing how the Gaiman Defense Team tries to hit any angle that they think might work. But denigrating journalists who are literally doing their job as “sociopaths who just wanted a story” is never going to work with anyone. I’ve been the subject of more stupid, pointless, and unmerited hit pieces than Neil Gaiman ever will be, and it never even occurred to me to blame the journalists or call them psychopaths for trying to score a few points with the SJW crowd.\nI mean, when a Tor Books author publishes a piece in a major UK newspaper quoting numerous Tor editors and authors about how evil you are for stealing nominations that should have gone to Tor editors and authors like they always do, it’s hard to take it personally. The motivation underlying the hit piece isn’t exactly opaque.\nAnyhow, I really don’t think the defense team’s “get to know the real Gaiman behind the allegations” is a tactic that is likely to prove successful. Because the real Gaiman, the one you can hear on the podcast, is a creepy, self-pitying little Gamma male, whose success has obviously been mostly manufactured for him. Forget autism and narcissism, I’ll bet he’s got one whopper of a case of Imposter Syndrome, because he’s an even bigger literary imposter than John Scalzi. What Gaiman’s fans like about him is not the actual individual, it is the Wizard of Goth construction that conceals the wretched little man.\nI just finished reading Gaiman’s\nOcean at the End of the Lane\n. It’s not terrible. It has its elements and its moments. I’ll review it on the Darkstream sometime. But for me, the most noteworthy aspect of the little novel was not its whitewashing of a historical Scientology-related suicide that may or may not have actually been a suicide, but rather, its relentless and imitative mediocrity.\nJeff Vandermeer saw it too. Any halfway-decent author who actually reads a Gaiman book can’t help but see that it’s always been fraudulent. Given what we now know of his Scientology background, his success in bookselling shouldn’t be taken any more indicative of his literary talents than L. Ron Hubbard’s was.\nJust stop quoting stupid ass Neil Gaiman writing advice. It’s always like “trust in your dreams” or other shit you see on a bumpersticker or on a sign in a Hobby Lobby. “Trust your dreams and pixie dust will shoot out of your ass.”\nThe art always betrays the author. I knew John C. Wright was a science fiction grand master from the first time I read\nThe Golden Age\n. I knew Cornelius Claudio Kreutsch was a genuine magician at the keyboard the first time I saw him play in Barcelona. And I knew Neil Gaiman was a literary fraud by the time I finished reading the sixth issue of\nSandman\nback in 2018; I’d previously read\nGood Omens\n, which aside from a few typical Terry Pratchett gems, I found to be a disappointing and not-very-funny Douglas Adams pastiche.\nNeil Gaiman is Jordan Peterson for the Drama Club. He mirrors back to them what they want to see in themselves He was always John Dee, never Dream.\nUPDATE:\nThe Wall of Silence just developed\na pretty big crack\n.\nThe Bookseller\nis an important industry site in the UK:\nThe Bookseller reached out to Gaiman’s representatives, who did not respond, and his publishers, with Headline declining to comment, and Bloomsbury, Penguin Random House (PRH) and HarperCollins US not responding to requests to comment. The Bookseller also reached out to the Royal Society of Literature, of which Gaiman is a patron, which declined to comment, as did the Publishers Association. The Bookseller also contacted the Society of Authors (SoA) for a comment but it did not respond.\nJust wait until the publishing industry realizes that a significant percentage of Gaiman’s alleged 50 million book sales went to Scientology, as with L. Ron Hubbard’s “bestsellers”.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "Pink SF",
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-08-28T18:40:33+00:00"
}