{
  "url": "https://voxday.net/2008/04/04/amyndan-irony/",
  "scraped_at": "2026-01-08T22:18:18.632839",
  "title": "Amyndan irony",
  "date_display": "April 4, 2008",
  "date_iso": "2008-04-04T11:49:00+00:00",
  "date_from_url": "2008-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I have <a href=\"http://pandagon.blogsome.com/2008/04/02/doh/\">a certain amount of sympathy for Ms Marcotte’s annoyance</a> at posted “reviews” and one-star ratings by non-reading critics – note how the review of TIA rated “most useful” begins “I only managed to read the first 3 chapters of this book” – I can’t help but laugh at the unintentional irony contained in her complaint about them:</p><blockquote><p>Anti-feminists who haven’t even read my book are posting negative “reviews” at Amazon. I hate to bleg, but I’d be so grateful if people who actually know what they’re talking about and aren’t motivated by a white hot hatred of women could counterbalance that.</p><p>It’s so weird how a bunch of men who’ve never met me hold me personally responsible for the fact that they’re too obnoxious to get laid or have women look at them with much besides disgust.</p></blockquote><p>It’s even weirder how a woman complaining about men judging her book without reading it would simultaneously pronounce judgment upon their sexual attractiveness to women without possessing any information about them except their dislike of her book.  What an interesting metric of sexual attraction!  Unfortunately, with the likes of Amynda, this sort of obtuse cluelessness is not so much predictable as inescapable.</p><p>As for reviews, it’s pretty simple.  If you haven’t read the book, your opinion is irrelevant and anyone who would review a book without reading it in its entirety is a ridiculous cretin.  This is true of intellectual zeroes in every camp, I have no more respect for the clueless theist who writes a negative review of <i>The God Delusion</i> than for the autistic atheist who writes a fictional one of <i>The Irrational Atheist</i>.  If you want to criticize something, then read it.  If you can’t be bothered, then keep your yapping little mouth shut and leave the discussion to the adults.</p></div>",
  "content_text": "While I have\na certain amount of sympathy for Ms Marcotte’s annoyance\nat posted “reviews” and one-star ratings by non-reading critics – note how the review of TIA rated “most useful” begins “I only managed to read the first 3 chapters of this book” – I can’t help but laugh at the unintentional irony contained in her complaint about them:\nAnti-feminists who haven’t even read my book are posting negative “reviews” at Amazon. I hate to bleg, but I’d be so grateful if people who actually know what they’re talking about and aren’t motivated by a white hot hatred of women could counterbalance that.\nIt’s so weird how a bunch of men who’ve never met me hold me personally responsible for the fact that they’re too obnoxious to get laid or have women look at them with much besides disgust.\nIt’s even weirder how a woman complaining about men judging her book without reading it would simultaneously pronounce judgment upon their sexual attractiveness to women without possessing any information about them except their dislike of her book.  What an interesting metric of sexual attraction!  Unfortunately, with the likes of Amynda, this sort of obtuse cluelessness is not so much predictable as inescapable.\nAs for reviews, it’s pretty simple.  If you haven’t read the book, your opinion is irrelevant and anyone who would review a book without reading it in its entirety is a ridiculous cretin.  This is true of intellectual zeroes in every camp, I have no more respect for the clueless theist who writes a negative review of\nThe God Delusion\nthan for the autistic atheist who writes a fictional one of\nThe Irrational Atheist\n.  If you want to criticize something, then read it.  If you can’t be bothered, then keep your yapping little mouth shut and leave the discussion to the adults.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-04T10:49:00+00:00"
}