{
  "url": "https://voxday.net/2008/04/09/caught-ou/",
  "scraped_at": "2026-01-08T22:18:53.651284",
  "title": "Caught out",
  "date_display": "April 9, 2008",
  "date_iso": "2008-04-09T09:44:00+00:00",
  "date_from_url": "2008-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unsurprisingly, it’s an econonomist who appears to have caught psychological researchers <a href=\"http://www.nytimes.com/2008/04/08/science/08tier.html?em&amp;ex=1207886400&amp;en=2b8f677ffd1f2caf&amp;ei=5087%0A\">making a basic fallacy</a>.  Of course, this can’t possibly have happened, since we have been repeatedly informed that without proper training and credentials in a specific science, it is impossible to render any meaningful criticism of that science:</p><blockquote><p>The Monty Hall Problem has struck again, and this time it’s not merely embarrassing mathematicians. If the calculations of a Yale economist are correct, there’s a sneaky logical fallacy in some of the most famous experiments in psychology.</p><p>The economist, M. Keith Chen, has challenged research into cognitive dissonance, including the 1956 experiment that first identified a remarkable ability of people to rationalize their choices. Dr. Chen says that choice rationalization could still turn out to be a real phenomenon, but he maintains that there’s a fatal flaw in the classic 1956 experiment and hundreds of similar ones. He says researchers have fallen for a version of what mathematicians call the Monty Hall Problem, in honor of the host of the old television show, “Let’s Make a Deal.”</p></blockquote><p>Chen’s observation hasn’t disproved the concept of choice rationalization, but he’s certainly called an amount of the reported evidence for it into question.  As I’ve contended numerous times in the past, I expect similar weaknesses, fallacies and unfounded assumptions to be discovered in various sciences, including astrophysics, biology and economics.  Some models will need to be thrown out, others will survive the test and be made stronger.  That is as it should be; the resistance of scientists to sound logical and factual criticism of their models does not testify to confidence in their proper application of the scientific method.</p><p>It may surprise some to know that I am every bit as critical of the mainstream Neo-Keynesian economics model as I am of the mainstream Neo-Darwinian biological model.  If I don’t write about the former as often, it’s because the subject is of less interest to most people, being far too esoteric for the average individual who cannot grasp that there is no inherent value to a U.S. paper dollar, let alone the fact that not even the eminent former head of the Federal Reserve can say what “money” is.  But then, that’s what the podcasts are for.  Tomorrow’s interview must unfortunately remain nameless, but I think I can guarantee that it will be of no little interest to those who are interested in the subject of the global economy.</p></div>",
  "content_text": "Unsurprisingly, it’s an econonomist who appears to have caught psychological researchers\nmaking a basic fallacy\n.  Of course, this can’t possibly have happened, since we have been repeatedly informed that without proper training and credentials in a specific science, it is impossible to render any meaningful criticism of that science:\nThe Monty Hall Problem has struck again, and this time it’s not merely embarrassing mathematicians. If the calculations of a Yale economist are correct, there’s a sneaky logical fallacy in some of the most famous experiments in psychology.\nThe economist, M. Keith Chen, has challenged research into cognitive dissonance, including the 1956 experiment that first identified a remarkable ability of people to rationalize their choices. Dr. Chen says that choice rationalization could still turn out to be a real phenomenon, but he maintains that there’s a fatal flaw in the classic 1956 experiment and hundreds of similar ones. He says researchers have fallen for a version of what mathematicians call the Monty Hall Problem, in honor of the host of the old television show, “Let’s Make a Deal.”\nChen’s observation hasn’t disproved the concept of choice rationalization, but he’s certainly called an amount of the reported evidence for it into question.  As I’ve contended numerous times in the past, I expect similar weaknesses, fallacies and unfounded assumptions to be discovered in various sciences, including astrophysics, biology and economics.  Some models will need to be thrown out, others will survive the test and be made stronger.  That is as it should be; the resistance of scientists to sound logical and factual criticism of their models does not testify to confidence in their proper application of the scientific method.\nIt may surprise some to know that I am every bit as critical of the mainstream Neo-Keynesian economics model as I am of the mainstream Neo-Darwinian biological model.  If I don’t write about the former as often, it’s because the subject is of less interest to most people, being far too esoteric for the average individual who cannot grasp that there is no inherent value to a U.S. paper dollar, let alone the fact that not even the eminent former head of the Federal Reserve can say what “money” is.  But then, that’s what the podcasts are for.  Tomorrow’s interview must unfortunately remain nameless, but I think I can guarantee that it will be of no little interest to those who are interested in the subject of the global economy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-09T08:44:00+00:00"
}