{
  "url": "https://voxday.net/2008/04/07/chicks-get-clicks/",
  "scraped_at": "2026-01-08T22:18:39.045820",
  "title": "Chicks get clicks",
  "date_display": "April 7, 2008",
  "date_iso": "2008-04-07T08:19:00+00:00",
  "date_from_url": "2008-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a pity John Hawkins didn’t reference “Libertarian Girl” in his investigation of the travails of the female blogger.  The argument for young, attractive women <a href=\"http://libertariangirl.typepad.com/my_weblog/2005/02/if_it_werent_fo.html\">achieving their success based solely on merit</a> is ludicrous, one has only to turn on Fox News or survey the non-fiction bestseller lists to realize that merit barely even enters into the equation, which is why, like Hollywood actresses and porn stars, women in the media tend to find less and less work as they garner more experience in their field.</p><blockquote><p>One thing I learned from this blog is how easy attractive woman have it. When I had a blog as my real self, no one linked to me, no one left any comments, it was as if the blog existed in a vacuum. But things were different for Libertarian Girl. Every day I’d check Technorati and discover new unsolicited links. It was like I had warped into an alternate universe where all the rules had changed. At the rate things were happening, this would have been an A-list blog in a few more months.  It’s funny how there have been some posts in the blogosphere saying that the political blogosphere was a boys club that discriminated against women, as evidenced by how few politics bloggers were women. Boy were they completely off the mark. It’s ten times easier for a woman’s blog to become popular.</p><p>This effect no doubt carries over into the real world. Whenever I see an attractive woman with a successful career, I’ll remember the experience of this blog and assume that she didn’t really get there on merit, just her looks.</p></blockquote><p>The old editor at WND and I used to joke about how if I ever wanted another national syndication deal and a Fox gig, I’d simply continue writing my columns, but with a picture of Spacebunny at the top.  If Spacebunny ever starts her own blog, I have no doubt whatsoever that she’ll quickly develop a readership 10x the size of this one.  Based solely on her many merits, of course.</p><p>The thing is, while success is always nice, success that comes through something other than your own achievement is always less than entirely satisfactory.  So, it’s a bit of a two-edged sword and one that one really shouldn’t begrudge.</p></div>",
  "content_text": "It’s a pity John Hawkins didn’t reference “Libertarian Girl” in his investigation of the travails of the female blogger.  The argument for young, attractive women\nachieving their success based solely on merit\nis ludicrous, one has only to turn on Fox News or survey the non-fiction bestseller lists to realize that merit barely even enters into the equation, which is why, like Hollywood actresses and porn stars, women in the media tend to find less and less work as they garner more experience in their field.\nOne thing I learned from this blog is how easy attractive woman have it. When I had a blog as my real self, no one linked to me, no one left any comments, it was as if the blog existed in a vacuum. But things were different for Libertarian Girl. Every day I’d check Technorati and discover new unsolicited links. It was like I had warped into an alternate universe where all the rules had changed. At the rate things were happening, this would have been an A-list blog in a few more months.  It’s funny how there have been some posts in the blogosphere saying that the political blogosphere was a boys club that discriminated against women, as evidenced by how few politics bloggers were women. Boy were they completely off the mark. It’s ten times easier for a woman’s blog to become popular.\nThis effect no doubt carries over into the real world. Whenever I see an attractive woman with a successful career, I’ll remember the experience of this blog and assume that she didn’t really get there on merit, just her looks.\nThe old editor at WND and I used to joke about how if I ever wanted another national syndication deal and a Fox gig, I’d simply continue writing my columns, but with a picture of Spacebunny at the top.  If Spacebunny ever starts her own blog, I have no doubt whatsoever that she’ll quickly develop a readership 10x the size of this one.  Based solely on her many merits, of course.\nThe thing is, while success is always nice, success that comes through something other than your own achievement is always less than entirely satisfactory.  So, it’s a bit of a two-edged sword and one that one really shouldn’t begrudge.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-07T07:19:00+00:00"
}