{
  "url": "https://voxday.net/2008/04/25/darwins-dingleberries/",
  "scraped_at": "2026-01-08T22:20:48.649573",
  "title": "Darwin’s dingleberries",
  "date_display": "April 25, 2008",
  "date_iso": "2008-04-25T09:33:00+00:00",
  "date_from_url": "2008-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is what passes for a defense of the theory of evolution by natural selection’s <a href=\"http://www.newscientist.com/channel/life/dn13677-evolution-myths-evolution-is-not-predictive.html\">predictive power</a>:</p><blockquote><p>Cosmologists make precise predictions about what will happen to the universe in 20 billion years’ time. Biologists struggle to predict how a few bacteria in a dish might evolve over 20 hours. Some claim that this lack of precise predictive power means evolution is not scientific.  However, what matters in science is not how much you can predict on the basis of a theory or how precise those predictions are, but whether the predictions you can make turn out to be right….</p><p>Perhaps the most striking prediction in biology was made in 1975 by entomologist Richard Alexander. After studying the evolution of eusocial insects such as termites, he predicted that some burrowing rodents in the tropics might have evolved the same eusocial system – as later proved to be the case with the naked mole-rat….  Most predictions relate to very specific aspects of evolutionary theory. If a eusocial mammal like the naked mole-rat had not been found, for instance, it would have proved only that Alexander’s ideas about the evolution of eusocial behaviour were probably wrong, not that there is anything wrong with the wider theory.</p></blockquote><p>This is just absurdly pathetic.  The entire article is nothing but a list of excuses for why the model simply can’t do what <i>New Scientist</i> disingenuously insists that it can.  Suggesting that something that already took place might perhaps maybe possibly have happened a certain way <i>is not a prediction</i>.  Alexander didn’t predict the existence of the naked mole rat or even the existence of a eusocial vertebrate, he merely “asked himself what characteristics a eusocial vertebrate would have if it had evolved”.  Musing out loud is not making a prediction, nor did Alexander ever explain how a eusocial vertebrate that had not evolved would have different characteristics.  Evolutionists make the Biblical prophecy-interpretation nuts look clinically accurate in comparison.  Economic predictions, fuzzy and wildly inaccurate as they often are, are orders of magnitude more specific than “the most striking prediction” that evolutionary biology has ever made despite dealing with far greater levels of complexity.  And as always, we are informed that if the TENS model makes an incorrect prediction, well, that doesn’t mean the model is wrong….</p><p>The problem with the TENS model isn’t that it’s wrong, it’s that it is almost completely useless for anything except providing a scientific-sounding basis for historical fiction.  It can’t predict anything more specific than whatever anyone with an imagination can pull out of his backside, or with any greater degree of reliability.  But, it must be confessed that <i>New Scientist</i> does manage to <a href=\"http://www.newscientist.com/channel/life/dn13620\">perfectly summarize the “science” of evolution</a> when it states in a most authoritative manner: <i>“Evolution is as firmly established a scientific fact as the roundness of the Earth.”</i></p><p>Of course, the Earth isn’t round.  It’s a geoid that is very nearly an oblate spheroid.  How can you not love the scientific precision of the butterfly collectors?  You really need to read the entire list of 24 myths, there’s more dancing there than you’ll find at the average disco.</p><p>UPDATE – Jerry Pournelle quotes Fred Reed: <i>“If something looks implausible, it probably is. Evolution writ large is the belief that a cloud of hydrogen will spontaneously invent extreme-ultraviolet lithography, perform Swan Lake, and write all the books in the British Museum.</i>“</p><p>Not all in six days, of course.  A certain amount of time is required.  As for how much, you’d have to ask Richard Dawkins.  He’s done the math.</p></div>",
  "content_text": "This is what passes for a defense of the theory of evolution by natural selection’s\npredictive power\n:\nCosmologists make precise predictions about what will happen to the universe in 20 billion years’ time. Biologists struggle to predict how a few bacteria in a dish might evolve over 20 hours. Some claim that this lack of precise predictive power means evolution is not scientific.  However, what matters in science is not how much you can predict on the basis of a theory or how precise those predictions are, but whether the predictions you can make turn out to be right….\nPerhaps the most striking prediction in biology was made in 1975 by entomologist Richard Alexander. After studying the evolution of eusocial insects such as termites, he predicted that some burrowing rodents in the tropics might have evolved the same eusocial system – as later proved to be the case with the naked mole-rat….  Most predictions relate to very specific aspects of evolutionary theory. If a eusocial mammal like the naked mole-rat had not been found, for instance, it would have proved only that Alexander’s ideas about the evolution of eusocial behaviour were probably wrong, not that there is anything wrong with the wider theory.\nThis is just absurdly pathetic.  The entire article is nothing but a list of excuses for why the model simply can’t do what\nNew Scientist\ndisingenuously insists that it can.  Suggesting that something that already took place might perhaps maybe possibly have happened a certain way\nis not a prediction\n.  Alexander didn’t predict the existence of the naked mole rat or even the existence of a eusocial vertebrate, he merely “asked himself what characteristics a eusocial vertebrate would have if it had evolved”.  Musing out loud is not making a prediction, nor did Alexander ever explain how a eusocial vertebrate that had not evolved would have different characteristics.  Evolutionists make the Biblical prophecy-interpretation nuts look clinically accurate in comparison.  Economic predictions, fuzzy and wildly inaccurate as they often are, are orders of magnitude more specific than “the most striking prediction” that evolutionary biology has ever made despite dealing with far greater levels of complexity.  And as always, we are informed that if the TENS model makes an incorrect prediction, well, that doesn’t mean the model is wrong….\nThe problem with the TENS model isn’t that it’s wrong, it’s that it is almost completely useless for anything except providing a scientific-sounding basis for historical fiction.  It can’t predict anything more specific than whatever anyone with an imagination can pull out of his backside, or with any greater degree of reliability.  But, it must be confessed that\nNew Scientist\ndoes manage to\nperfectly summarize the “science” of evolution\nwhen it states in a most authoritative manner:\n“Evolution is as firmly established a scientific fact as the roundness of the Earth.”\nOf course, the Earth isn’t round.  It’s a geoid that is very nearly an oblate spheroid.  How can you not love the scientific precision of the butterfly collectors?  You really need to read the entire list of 24 myths, there’s more dancing there than you’ll find at the average disco.\nUPDATE – Jerry Pournelle quotes Fred Reed:\n“If something looks implausible, it probably is. Evolution writ large is the belief that a cloud of hydrogen will spontaneously invent extreme-ultraviolet lithography, perform Swan Lake, and write all the books in the British Museum.\n“\nNot all in six days, of course.  A certain amount of time is required.  As for how much, you’d have to ask Richard Dawkins.  He’s done the math.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-25T08:33:00+00:00"
}