{
  "url": "https://voxday.net/2008/04/28/derb-waxes-wro/",
  "scraped_at": "2026-01-08T22:21:20.005833",
  "title": "Derb waxes wroth",
  "date_display": "April 28, 2008",
  "date_iso": "2008-04-28T19:43:00+00:00",
  "date_from_url": "2008-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over <a href=\"http://corner.nationalreview.com/post/?q=ZTA2NmQ4ZjEyNzFlYmM3YzI5MDg1OWNmOTg2ODRkOTY=\">a movie he refuses to see</a>:</p><blockquote><p>A mature scientific theory is as much a glory of our civilization as is a cathedral or a university; and it is uniquely of ours. Other civilizations had temples, universities, systems of government, literature, philosophy; but only we of the West came up with scientific method, and the whole world owes the innumerable fruits of that method to us.</p><p>I am a huge fan of Western civilization. Thus, when people — well-educated people, who ought to set an example for the general — sneer at and spit on these majestic creations of the human intellect, I get mad. They are taking sides with barbarism. They ought to be ashamed of themselves. Ben Stein ought to be ashamed of himself. And no, I <i>won’t</i> sit through his wretched movie.</p></blockquote><p>I kind of like the idea of a scientific theory being viewed as a tribute to Western civilization.  However, there’s one rather serious problem… it is becoming increasingly clear that Darwinism isn’t science according to any reasonable definition of the term, much less has it produced a mature scientific theory that produces any fruits of the sort that Derb rightly regards so highly.  What are the fruits of Darwinian “science” that are not primarily derived from Mendelian genetics?  Hey, we got a fly with a leg sticking out of its head!  And a “striking prediction” that wouldn’t pass muster with the Catholic Church if it were claimed to be a miracle.  What is it about atheism that seems to drive otherwise perfectly rational people over the edge?</p><p>As you know, I quite like Derb.  He’s a smart and insightful guy and one of my favorite National Reviewers.  But that uncharacteristic closing line is… well, let’s just say it teeters perilously close to being embarrassing.</p></div>",
  "content_text": "Over\na movie he refuses to see\n:\nA mature scientific theory is as much a glory of our civilization as is a cathedral or a university; and it is uniquely of ours. Other civilizations had temples, universities, systems of government, literature, philosophy; but only we of the West came up with scientific method, and the whole world owes the innumerable fruits of that method to us.\nI am a huge fan of Western civilization. Thus, when people — well-educated people, who ought to set an example for the general — sneer at and spit on these majestic creations of the human intellect, I get mad. They are taking sides with barbarism. They ought to be ashamed of themselves. Ben Stein ought to be ashamed of himself. And no, I\nwon’t\nsit through his wretched movie.\nI kind of like the idea of a scientific theory being viewed as a tribute to Western civilization.  However, there’s one rather serious problem… it is becoming increasingly clear that Darwinism isn’t science according to any reasonable definition of the term, much less has it produced a mature scientific theory that produces any fruits of the sort that Derb rightly regards so highly.  What are the fruits of Darwinian “science” that are not primarily derived from Mendelian genetics?  Hey, we got a fly with a leg sticking out of its head!  And a “striking prediction” that wouldn’t pass muster with the Catholic Church if it were claimed to be a miracle.  What is it about atheism that seems to drive otherwise perfectly rational people over the edge?\nAs you know, I quite like Derb.  He’s a smart and insightful guy and one of my favorite National Reviewers.  But that uncharacteristic closing line is… well, let’s just say it teeters perilously close to being embarrassing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-28T18:43:00+00:00"
}