{
  "url": "https://voxday.net/2008/04/23/england-disappears/",
  "scraped_at": "2026-01-08T22:20:27.287055",
  "title": "England disappears",
  "date_display": "April 23, 2008",
  "date_iso": "2008-04-23T09:07:00+00:00",
  "date_from_url": "2008-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brussels <a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2008/04/23/nmap123.xml\">eliminates England</a> on St. George’s Day:</p><blockquote><p>The new European plan splits England into three zones that are joined with areas in other countries.  The “Manche” region covers part of southern England and northern France while the Atlantic region includes western parts of England, Portugal, Spain and Wales.</p><p>The North Sea region includes eastern England, Sweden, Denmark, the Netherlands and parts of Germany.  A copy of the map, which makes no reference to England or Britain, has even renamed the English Channel the “Channel Sea”….  German ministers claimed that the plan was about “underlying the goal of a united Europe” to “permanently overcome old borders” at a time when the “Constitution for Europe needs to regain momentum”.</p></blockquote><p>In the course of history, there are few things more common than a smaller political entity being swallowed up and its identity subsumed by a larger one.  What happened to Burgundy and Castille and Athens is happening to England today, the only difference is that the English people don’t fully realize it yet.  Unfortunately, it is probably too late for them already, or it will be once the <s>European Constitution</s>Lisbon Treaty comes into effect.</p></div>",
  "content_text": "Brussels\neliminates England\non St. George’s Day:\nThe new European plan splits England into three zones that are joined with areas in other countries.  The “Manche” region covers part of southern England and northern France while the Atlantic region includes western parts of England, Portugal, Spain and Wales.\nThe North Sea region includes eastern England, Sweden, Denmark, the Netherlands and parts of Germany.  A copy of the map, which makes no reference to England or Britain, has even renamed the English Channel the “Channel Sea”….  German ministers claimed that the plan was about “underlying the goal of a united Europe” to “permanently overcome old borders” at a time when the “Constitution for Europe needs to regain momentum”.\nIn the course of history, there are few things more common than a smaller political entity being swallowed up and its identity subsumed by a larger one.  What happened to Burgundy and Castille and Athens is happening to England today, the only difference is that the English people don’t fully realize it yet.  Unfortunately, it is probably too late for them already, or it will be once the\nEuropean Constitution\nLisbon Treaty comes into effect.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-23T08:07:00+00:00"
}