{
  "url": "https://voxday.net/2008/04/24/fred-on-evolution/",
  "scraped_at": "2026-01-08T22:20:41.928676",
  "title": "Fred on Evolution",
  "date_display": "April 24, 2008",
  "date_iso": "2008-04-24T11:39:00+00:00",
  "date_from_url": "2008-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Go on, accuse him of being an evangelical Christian or whatever, <a href=\"http://www.fredoneverything.net/Hart.shtml\">make his day</a>:</p><blockquote><p>I think it a shame that discussion of evolution usually boils down to a pledge of allegiance either to Darwin or to the handling of snakes. This view admirably distracts attention from the observation that much of Darwinism doesn’t square with observation or even make sense. Religion has nothing to do with it, being an innocent bystander.  I recently read <i>Understanding Human History</i>, by Michael Hart, which deals with the influence of intelligence on history. Hart is an astrophysicist, and his book is well worth reading—except when he deals with evolution, when he goes ditzy. They all do….</p><p>The entire Darwinian structure rests on the willingness to accept wild theories without examination.</p></blockquote><p>Of course, by “theories” he is referring to the English language sense of the word:</p><p>“<i>contemplation or speculation</i>“, “<i>guess or conjecture</i>“</p><p>It’s pretty obvious that “<i>a coherent group of general propositions used as principles of explanation for a class of phenomena</i>” can’t possibly apply, given the contradictory incoherencies of many evolutionary “explanations” and “stable strategies” for observed phenomena.  As some noted yesterday, it is the infinitely pliable nature of evolutionary theory that indicates its fundamentally non-scientific nature.  There are, of course, useful aspects of the Neo-Darwinian synthesis, however, those aspects are almost entirely the part known as Mendelian genetics and have always stood quite nicely on their own.</p></div>",
  "content_text": "Go on, accuse him of being an evangelical Christian or whatever,\nmake his day\n:\nI think it a shame that discussion of evolution usually boils down to a pledge of allegiance either to Darwin or to the handling of snakes. This view admirably distracts attention from the observation that much of Darwinism doesn’t square with observation or even make sense. Religion has nothing to do with it, being an innocent bystander.  I recently read\nUnderstanding Human History\n, by Michael Hart, which deals with the influence of intelligence on history. Hart is an astrophysicist, and his book is well worth reading—except when he deals with evolution, when he goes ditzy. They all do….\nThe entire Darwinian structure rests on the willingness to accept wild theories without examination.\nOf course, by “theories” he is referring to the English language sense of the word:\n“\ncontemplation or speculation\n“, “\nguess or conjecture\n“\nIt’s pretty obvious that “\na coherent group of general propositions used as principles of explanation for a class of phenomena\n” can’t possibly apply, given the contradictory incoherencies of many evolutionary “explanations” and “stable strategies” for observed phenomena.  As some noted yesterday, it is the infinitely pliable nature of evolutionary theory that indicates its fundamentally non-scientific nature.  There are, of course, useful aspects of the Neo-Darwinian synthesis, however, those aspects are almost entirely the part known as Mendelian genetics and have always stood quite nicely on their own.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-24T10:39:00+00:00"
}