{
  "url": "https://voxday.net/2008/04/19/frum-nails-i/",
  "scraped_at": "2026-01-08T22:19:57.781194",
  "title": "The declining value of education",
  "date_display": "April 19, 2008",
  "date_iso": "2008-04-19T11:15:00+00:00",
  "date_from_url": "2008-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have criticized David Frum numerous times in the past, but he definitely <a href=\"http://marketplace.publicradio.org/display/web/2008/04/16/frum_commentary/\">nails it here</a>:</p><blockquote><p>Surging prices, collapsing returns, ending in a crash — housing? Yes, but the pattern may equally apply to another area of middle-class aspiration — college education. And as high school seniors receive their fat or thin acceptance or rejection letters this month, maybe we should all take a closer look at what their money buys.</p><p>Over the past decade the cost of college tuition has approximately doubled, faster at private colleges. This rapidly inflating investment is yielding a declining return. The earnings of bachelor-degree holders have been dropping this decade. After inflation, B.A. holders earned more than $54,000 in 2000. That dropped 5 percent over the next four years.</p></blockquote><p>This is not a sustainable situation; politicians and parents have long mistaken the mere possession of a degree with a genuinely valuable education.  As those of us with degrees from expensive universities well know, they simply aren’t worth anywhere near the price that was charged for them.</p><p>One can learn far more from reading on one’s own than sitting in a crowded room being talked at.  Frum’s Bookshelf is a good example of this, although I’m interested in the idea of taking his concept even further by making use of the Web 2.0 user-generated aspects of this blog.  What would you make of a regularly scheduled Voxiversity feature in which I’ll select a serious book related to a particular subject and those interested will go methodically through it with weekly discussions of each chapter?  I could invite various experts to lead the discussions; those who aren’t regulars already might be willing to participate if they knew that people were buying their books for this purpose.  For example, I am currently reading <i>The Landmark Thucydides</i> to which VDH contributed the forward and perhaps he would be interested in participating, particularly if he knew that a certain number of people had bought the book for this purpose.  Actually, he’d probably be more interested if we chose <i>A War Like No Other</i>, but you get the point.</p><p>Anyhow, let me know if this might be of enough interest for you to participate and what would be the first books you’d be interested in reading and discussing.  History, literature, economics and military classics are the subjects I’m interested in; please don’t even THINK about suggesting anything related to atheism, theology, evolution, biology or intelligent design.</p></div>",
  "content_text": "I have criticized David Frum numerous times in the past, but he definitely\nnails it here\n:\nSurging prices, collapsing returns, ending in a crash — housing? Yes, but the pattern may equally apply to another area of middle-class aspiration — college education. And as high school seniors receive their fat or thin acceptance or rejection letters this month, maybe we should all take a closer look at what their money buys.\nOver the past decade the cost of college tuition has approximately doubled, faster at private colleges. This rapidly inflating investment is yielding a declining return. The earnings of bachelor-degree holders have been dropping this decade. After inflation, B.A. holders earned more than $54,000 in 2000. That dropped 5 percent over the next four years.\nThis is not a sustainable situation; politicians and parents have long mistaken the mere possession of a degree with a genuinely valuable education.  As those of us with degrees from expensive universities well know, they simply aren’t worth anywhere near the price that was charged for them.\nOne can learn far more from reading on one’s own than sitting in a crowded room being talked at.  Frum’s Bookshelf is a good example of this, although I’m interested in the idea of taking his concept even further by making use of the Web 2.0 user-generated aspects of this blog.  What would you make of a regularly scheduled Voxiversity feature in which I’ll select a serious book related to a particular subject and those interested will go methodically through it with weekly discussions of each chapter?  I could invite various experts to lead the discussions; those who aren’t regulars already might be willing to participate if they knew that people were buying their books for this purpose.  For example, I am currently reading\nThe Landmark Thucydides\nto which VDH contributed the forward and perhaps he would be interested in participating, particularly if he knew that a certain number of people had bought the book for this purpose.  Actually, he’d probably be more interested if we chose\nA War Like No Other\n, but you get the point.\nAnyhow, let me know if this might be of enough interest for you to participate and what would be the first books you’d be interested in reading and discussing.  History, literature, economics and military classics are the subjects I’m interested in; please don’t even THINK about suggesting anything related to atheism, theology, evolution, biology or intelligent design.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-19T10:15:00+00:00"
}