{
  "url": "https://voxday.net/2008/04/12/girls-and-game-theory/",
  "scraped_at": "2026-01-08T22:19:23.096757",
  "title": "Girls and game theory",
  "date_display": "April 12, 2008",
  "date_iso": "2008-04-12T08:55:00+00:00",
  "date_from_url": "2008-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://www.slate.com/id/2188684/\">Eligible Bachelor Paradox explained</a>:</p><blockquote><p>You can think of this traditional concept of the search for marriage partners as a kind of an auction. In this auction, some women will be more confident of their prospects, others less so. In game-theory terms, you would call the first group “strong bidders” and the second “weak bidders.” Your first thought might be that the “strong bidders”—women who (whether because of looks, social ability, or any other reason) are conventionally deemed more of a catch—would consistently win this kind of auction.</p><p>But this is not true. In fact, game theory predicts, and empirical studies of auctions bear out, that auctions will often be won by “weak” bidders, who know that they can be outbid and so bid more aggressively, while the “strong” bidders will hold out for a really great deal. You can find <a href=\"http://www2.wiwi.hu-berlin.de/wt1/staff/ivanova-stenzel/asym-finaleercorrected3.pdf\">a technical discussion of this</a> here….  This is how you come to the Eligible-Bachelor Paradox, which is no longer so paradoxical. The pool of appealing men shrinks as many are married off and taken out of the game, leaving a disproportionate number of men who are notably imperfect (perhaps they are short, socially awkward, underemployed). And at the same time, you get a pool of women weighted toward the attractive, desirable “strong bidders.”</p><p>Where have all the most appealing men gone? Married young, most of them—and sometimes to women whose most salient characteristic was not their beauty, or passion, or intellect, but their decisiveness.</p></blockquote><p>This is quite useful and I wish I’d taken the time to apply the game theory for myself since it describes precisely what I’ve observed and been commenting upon for a few years now.  Some women of my acquaintance that were extraordinarily strong bidders in their middle twenties later ended up marrying men who simply weren’t the caliber of the men who were competing for their attention a decade prior, while those who still haven’t married are now contemplating choices between various men, none of whom would have gotten a second look from them 15 years ago.</p><p>Men always understand that desirable women have options.  Women seem to have a harder time understanding that desirable men do too.  Note that decisiveness here does not apply to one’s character, merely the strength of one’s bid.  If one woman has 30 points of attraction and is competing with a woman with 50 such points, she will nevertheless have the competitive advantage when she goes all in if her rival only puts in a mathematically half-hearted effort.</p><p>The economic key to successfully finding and marrying a mate you find desirable, then, is to go all in once you have found an individual that meets your criteria rather than obsessively comparing various satisfactory options in hopes of determining the ideal one.  And it should be noted that by “going all in” I do not mean “acting like a stalker”.</p><p>You know, there just might be a book in this sort of thing….</p></div>",
  "content_text": "The\nEligible Bachelor Paradox explained\n:\nYou can think of this traditional concept of the search for marriage partners as a kind of an auction. In this auction, some women will be more confident of their prospects, others less so. In game-theory terms, you would call the first group “strong bidders” and the second “weak bidders.” Your first thought might be that the “strong bidders”—women who (whether because of looks, social ability, or any other reason) are conventionally deemed more of a catch—would consistently win this kind of auction.\nBut this is not true. In fact, game theory predicts, and empirical studies of auctions bear out, that auctions will often be won by “weak” bidders, who know that they can be outbid and so bid more aggressively, while the “strong” bidders will hold out for a really great deal. You can find\na technical discussion of this\nhere….  This is how you come to the Eligible-Bachelor Paradox, which is no longer so paradoxical. The pool of appealing men shrinks as many are married off and taken out of the game, leaving a disproportionate number of men who are notably imperfect (perhaps they are short, socially awkward, underemployed). And at the same time, you get a pool of women weighted toward the attractive, desirable “strong bidders.”\nWhere have all the most appealing men gone? Married young, most of them—and sometimes to women whose most salient characteristic was not their beauty, or passion, or intellect, but their decisiveness.\nThis is quite useful and I wish I’d taken the time to apply the game theory for myself since it describes precisely what I’ve observed and been commenting upon for a few years now.  Some women of my acquaintance that were extraordinarily strong bidders in their middle twenties later ended up marrying men who simply weren’t the caliber of the men who were competing for their attention a decade prior, while those who still haven’t married are now contemplating choices between various men, none of whom would have gotten a second look from them 15 years ago.\nMen always understand that desirable women have options.  Women seem to have a harder time understanding that desirable men do too.  Note that decisiveness here does not apply to one’s character, merely the strength of one’s bid.  If one woman has 30 points of attraction and is competing with a woman with 50 such points, she will nevertheless have the competitive advantage when she goes all in if her rival only puts in a mathematically half-hearted effort.\nThe economic key to successfully finding and marrying a mate you find desirable, then, is to go all in once you have found an individual that meets your criteria rather than obsessively comparing various satisfactory options in hopes of determining the ideal one.  And it should be noted that by “going all in” I do not mean “acting like a stalker”.\nYou know, there just might be a book in this sort of thing….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-12T07:55:00+00:00"
}