{
  "url": "https://voxday.net/2008/04/14/i-have-been-remiss/",
  "scraped_at": "2026-01-08T22:19:34.089706",
  "title": "I have been remiss",
  "date_display": "April 14, 2008",
  "date_iso": "2008-04-14T06:59:00+00:00",
  "date_from_url": "2008-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is <a href=\"http://www.realclearpolitics.com/articles/2008/04/deterrence_to_defend_israel.html\">Charles Krauthammer’s Holocaust Declaration</a> referred to in today’s column:</p><blockquote><p><i>It shall be the policy of this nation to regard any nuclear attack upon Israel by Iran, or originating in Iran, as an attack by Iran on the United States, requiring a full retaliatory response upon Iran.</i></p><p>This should be followed with a simple explanation: “As a beacon of tolerance and as leader of the free world, the United States will not permit a second Holocaust to be perpetrated upon the Jewish people.”</p><p>This policy — the Holocaust Declaration — would establish a firm benchmark that would outlive this administration. Every future president — and every serious presidential candidate — would have to publicly state whether or not he supports the Holocaust Declaration.</p></blockquote><p>In other words, Krauthammer wants to establish the United States as the Praetorian Guard for the Jewish people, risking its national interest in order to pretend that it is a beacon of tolerance.  As <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=61491\">I noted in today’s column</a>, this is a complete non-starter for a variety of reasons… chief among them the fact that Israel is not, as Krauthammer describes it, an “allied democracy”.  It is not an ally at all.  The idea that the USA has “no more pressing cause” than defending Israel has far more to do with Krauthammer’s loyalties than it does with anything even remotely resembling reality.</p></div>",
  "content_text": "Here is\nCharles Krauthammer’s Holocaust Declaration\nreferred to in today’s column:\nIt shall be the policy of this nation to regard any nuclear attack upon Israel by Iran, or originating in Iran, as an attack by Iran on the United States, requiring a full retaliatory response upon Iran.\nThis should be followed with a simple explanation: “As a beacon of tolerance and as leader of the free world, the United States will not permit a second Holocaust to be perpetrated upon the Jewish people.”\nThis policy — the Holocaust Declaration — would establish a firm benchmark that would outlive this administration. Every future president — and every serious presidential candidate — would have to publicly state whether or not he supports the Holocaust Declaration.\nIn other words, Krauthammer wants to establish the United States as the Praetorian Guard for the Jewish people, risking its national interest in order to pretend that it is a beacon of tolerance.  As\nI noted in today’s column\n, this is a complete non-starter for a variety of reasons… chief among them the fact that Israel is not, as Krauthammer describes it, an “allied democracy”.  It is not an ally at all.  The idea that the USA has “no more pressing cause” than defending Israel has far more to do with Krauthammer’s loyalties than it does with anything even remotely resembling reality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-14T05:59:00+00:00"
}