{
  "url": "https://voxday.net/2008/04/09/imperfect-library/",
  "scraped_at": "2026-01-08T22:18:57.318902",
  "title": "An imperfect library",
  "date_display": "April 9, 2008",
  "date_iso": "2008-04-09T10:44:00+00:00",
  "date_from_url": "2008-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently Spacebunny and I only have <a href=\"http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2008/04/06/nosplit/sv_classics06.xml&amp;CMP=ILC-mostviewedbox#6\">52 of the 110 best books</a> that make up the Perfect Library according to the Telegraph.  We’re particularly bad on Books That Changed Your World, as <i>Hitchhikers</i> is the only one of the ten I own, although I have read <i>Zen and the Art of Motorcycle Maintenance</i> (rolls eyes).  History is rather better, as we not only own seven out of the ten, but have all seven right here in my office.  Only nine of ten on SF, I don’t have <i>Day of the Triffids</i>, at least not that I’m aware of.  But how is Orwell SF and how can you possibly leave out Heinlein?</p><p>The list isn’t that bad, although it cheats by counting series as books and I think you could throw out the entire Books That Changed Your World section without any loss after putting Adams into SF.  Also, the inclusion of <i>Das Kapital</i> is a joke, almost no one outside of seriously committed Communists or hard-core Austrians actually reads the whole thing and <i>The Wealth of Nations</i> is far more integral to a basic understanding of economics.  Leaving out Dorothy Sayers and Rex Stout in favor of Thomas Harris, Elmore Leonard and Patricia Highsmith is criminal, and neither Pullman nor Rowling belong in the children’s section.  I’d replace those two with Lloyd Alexander and Laura Ingalls Wilder.  The total absence of Asian literature is also bothersome, where are Murasaki Shikibu, Confucius and Sun Tzu, at the bare minimum?</p><p>Of course, leaving off most of the great philosophical and religious works borders on the bizarre.  It seems most strange to ignore Plato, Aristotle and the Bible.</p></div>",
  "content_text": "Apparently Spacebunny and I only have\n52 of the 110 best books\nthat make up the Perfect Library according to the Telegraph.  We’re particularly bad on Books That Changed Your World, as\nHitchhikers\nis the only one of the ten I own, although I have read\nZen and the Art of Motorcycle Maintenance\n(rolls eyes).  History is rather better, as we not only own seven out of the ten, but have all seven right here in my office.  Only nine of ten on SF, I don’t have\nDay of the Triffids\n, at least not that I’m aware of.  But how is Orwell SF and how can you possibly leave out Heinlein?\nThe list isn’t that bad, although it cheats by counting series as books and I think you could throw out the entire Books That Changed Your World section without any loss after putting Adams into SF.  Also, the inclusion of\nDas Kapital\nis a joke, almost no one outside of seriously committed Communists or hard-core Austrians actually reads the whole thing and\nThe Wealth of Nations\nis far more integral to a basic understanding of economics.  Leaving out Dorothy Sayers and Rex Stout in favor of Thomas Harris, Elmore Leonard and Patricia Highsmith is criminal, and neither Pullman nor Rowling belong in the children’s section.  I’d replace those two with Lloyd Alexander and Laura Ingalls Wilder.  The total absence of Asian literature is also bothersome, where are Murasaki Shikibu, Confucius and Sun Tzu, at the bare minimum?\nOf course, leaving off most of the great philosophical and religious works borders on the bizarre.  It seems most strange to ignore Plato, Aristotle and the Bible.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-09T09:44:00+00:00"
}