{
  "url": "https://voxday.net/2008/04/11/in-defense-of-euthyphro/",
  "scraped_at": "2026-01-08T22:19:15.750817",
  "title": "In defense of Euthyphro",
  "date_display": "April 11, 2008",
  "date_iso": "2008-04-11T06:44:00+00:00",
  "date_from_url": "2008-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jasper has a go:</p><blockquote><p>In seeking to resolve the dilemma, you state that <i>“At first glance, this looks easy enough, as simply substituting “obedience” for “the pious” will destroy the dilemma because it eliminates the tautology posed. One can’t do this since it’s not right to simply substitute whatever terms one likes and declare the problem solved.”</i> Later in the argument, you then say: <i>“At this point we can reach three conclusions: 1. The Euthyphro “dilemma” is defeated by shifting the focus from “the pious” to “obedience,” therefore it is an inappropriate criticism of Christian morality that is founded on obedience to God’s Will.”</i> So this point is based on you doing something that you have previously declared is not allowed.</p></blockquote><p>You’re skipping over the extremely relevant section wherein I distinguish between refuting the Euthyphro dilemma on its own terms and refuting its mistaken application to Christian morality because the definition of that morality precludes the second horn of the dilemma.  Ergo, no tautology and no dilemma.  One cannot simply change Socrates’s definitions and claim to be attacking the dilemma on its own terms, while one cannot apply the dilemma to a specific morality without changing those definitions accordingly.</p><blockquote><p>You also state that <i>“it can only be considered a genuine problem for those who insist that a fixed principle cannot be arbitrary. In other words, for those paying absolutely no attention to reality. There are a panoply of fixed variables which, if they were different than they are, would radically alter the reality of our universe.”</i> Here you conflate moral principles with physical variables; but they are not the same, and consequently this point is irrelevant.</p></blockquote><p>Conflate?  Combine into one?  Not at all.  You’re forgetting the rather obvious fact that whereas the necessary physical variables of this universe are fixed, moral principles vary even within it.  Therefore, it is a massive logical error on multiple levels to assume that in the universe next door, moral principles must be the same as they are in this universe, while physical variables are assumed to be different.  In fact, given the competing moral principles currently on offer in this universe, one couldn’t possibly even say which of them must be the fixed ones next door.</p><blockquote><p>You finally state that <i>“The section about disagreement between gods regarding the pious and impious does not apply to a monotheistic god or a Supreme God who rules over other, lesser gods and deines their morality for them.”</i> Socrates and Euthyphro agree in the course of the dialogue to discuss that “what all the gods love is pious and holy, and the opposite which they all hate, impious” – in all respects, a situation identical to being under a monotheistic god. So this point is irrelevant.</p></blockquote><p>You’re incorrect.  If you read the dialogue more closely, you will see that the situations are not identical because in the one case, the net result of “what all the gods love” is a drastically reduced set of polytheistic divine preferences to the lowest common denominator, whereas in the monotheistic case, that preference is exercised in full.  For example, Athena’s love for Athens must be excised in the former case, but is retained were she the god in the latter.</p><blockquote><p>The rest of your refutation rests on a misunderstanding of what actually constitutes the Euthyphro dilemma. You focus obsessively on a literal translation of the language, rather than attempting to understand the underlying argument. In modern terms, this is phrased as: Is something moral because god commands it, or does god command it because it is moral? You simply don’t address this at all in your supposed refutation, as far as I can see; I may be missing the point entirely, but in that case you have not managed to convey your argument well.</p></blockquote><p>This is a false statement based on intellectual laziness.  There is no “underlying argument”, Socrates makes a specific and detailed argument with various assertions and assumptions along the way, and as I have shown, some of them are not logically justifiable.  If you want an answer to what you describe as the modern terms, it is that something is moral because god commands it.  God’s game, god’s rules.  Now, you can still argue that God doesn’t exist or that his rules are imperfectly understood by Man, but that’s a tangential subject that cannot be reasonably used to defend the dilemma.</p><p>UPDATE – I should point out that I’m not breaking much new ground here, except possibly in the specific refutation of the dilemma on Socrates’s own terms.  As much as I respect Aristotle and Aquinas, I’m rather pleased to know that I’m following <a href=\"http://www.britannica.com/eb/article-252531/ethics\">a path trod by the original wielder of the logical razor</a>:</p><p><i>[William of] Ockham boldly broke with much that had been taken for granted by his immediate predecessors. Fundamental to his approach was his rejection of the central Aristotelian idea that all things have an ultimate end toward which they naturally tend. He therefore also spurned Aquinas’s attempt to base morality on human nature and with it the idea that goodness is closely connected with happiness, which is the ultimate end of human beings. Ockham was thus led to a position that contrasted starkly with almost all previous ethical doctrines in the West. Ockham denied all standards of good and evil that are independent of God’s will. What God wills is good; what God condemns is evil. That is all there is to say about the matter. This position is sometimes called a divine approbation theory, because it defines good as whatever is approved by God.</i></p></div>",
  "content_text": "Jasper has a go:\nIn seeking to resolve the dilemma, you state that\n“At first glance, this looks easy enough, as simply substituting “obedience” for “the pious” will destroy the dilemma because it eliminates the tautology posed. One can’t do this since it’s not right to simply substitute whatever terms one likes and declare the problem solved.”\nLater in the argument, you then say:\n“At this point we can reach three conclusions: 1. The Euthyphro “dilemma” is defeated by shifting the focus from “the pious” to “obedience,” therefore it is an inappropriate criticism of Christian morality that is founded on obedience to God’s Will.”\nSo this point is based on you doing something that you have previously declared is not allowed.\nYou’re skipping over the extremely relevant section wherein I distinguish between refuting the Euthyphro dilemma on its own terms and refuting its mistaken application to Christian morality because the definition of that morality precludes the second horn of the dilemma.  Ergo, no tautology and no dilemma.  One cannot simply change Socrates’s definitions and claim to be attacking the dilemma on its own terms, while one cannot apply the dilemma to a specific morality without changing those definitions accordingly.\nYou also state that\n“it can only be considered a genuine problem for those who insist that a fixed principle cannot be arbitrary. In other words, for those paying absolutely no attention to reality. There are a panoply of fixed variables which, if they were different than they are, would radically alter the reality of our universe.”\nHere you conflate moral principles with physical variables; but they are not the same, and consequently this point is irrelevant.\nConflate?  Combine into one?  Not at all.  You’re forgetting the rather obvious fact that whereas the necessary physical variables of this universe are fixed, moral principles vary even within it.  Therefore, it is a massive logical error on multiple levels to assume that in the universe next door, moral principles must be the same as they are in this universe, while physical variables are assumed to be different.  In fact, given the competing moral principles currently on offer in this universe, one couldn’t possibly even say which of them must be the fixed ones next door.\nYou finally state that\n“The section about disagreement between gods regarding the pious and impious does not apply to a monotheistic god or a Supreme God who rules over other, lesser gods and deines their morality for them.”\nSocrates and Euthyphro agree in the course of the dialogue to discuss that “what all the gods love is pious and holy, and the opposite which they all hate, impious” – in all respects, a situation identical to being under a monotheistic god. So this point is irrelevant.\nYou’re incorrect.  If you read the dialogue more closely, you will see that the situations are not identical because in the one case, the net result of “what all the gods love” is a drastically reduced set of polytheistic divine preferences to the lowest common denominator, whereas in the monotheistic case, that preference is exercised in full.  For example, Athena’s love for Athens must be excised in the former case, but is retained were she the god in the latter.\nThe rest of your refutation rests on a misunderstanding of what actually constitutes the Euthyphro dilemma. You focus obsessively on a literal translation of the language, rather than attempting to understand the underlying argument. In modern terms, this is phrased as: Is something moral because god commands it, or does god command it because it is moral? You simply don’t address this at all in your supposed refutation, as far as I can see; I may be missing the point entirely, but in that case you have not managed to convey your argument well.\nThis is a false statement based on intellectual laziness.  There is no “underlying argument”, Socrates makes a specific and detailed argument with various assertions and assumptions along the way, and as I have shown, some of them are not logically justifiable.  If you want an answer to what you describe as the modern terms, it is that something is moral because god commands it.  God’s game, god’s rules.  Now, you can still argue that God doesn’t exist or that his rules are imperfectly understood by Man, but that’s a tangential subject that cannot be reasonably used to defend the dilemma.\nUPDATE – I should point out that I’m not breaking much new ground here, except possibly in the specific refutation of the dilemma on Socrates’s own terms.  As much as I respect Aristotle and Aquinas, I’m rather pleased to know that I’m following\na path trod by the original wielder of the logical razor\n:\n[William of] Ockham boldly broke with much that had been taken for granted by his immediate predecessors. Fundamental to his approach was his rejection of the central Aristotelian idea that all things have an ultimate end toward which they naturally tend. He therefore also spurned Aquinas’s attempt to base morality on human nature and with it the idea that goodness is closely connected with happiness, which is the ultimate end of human beings. Ockham was thus led to a position that contrasted starkly with almost all previous ethical doctrines in the West. Ockham denied all standards of good and evil that are independent of God’s will. What God wills is good; what God condemns is evil. That is all there is to say about the matter. This position is sometimes called a divine approbation theory, because it defines good as whatever is approved by God.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-11T05:44:00+00:00"
}