{
  "url": "https://voxday.net/2008/04/10/it-is-science/",
  "scraped_at": "2026-01-08T22:19:08.351579",
  "title": "It is science!",
  "date_display": "April 10, 2008",
  "date_iso": "2008-04-10T13:35:00+00:00",
  "date_from_url": "2008-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you read Derb’s description of <a href=\"http://corner.nationalreview.com/post/?q=ZDk5MTA2ZWUxNmQ5OTMyMjQ2NGIzNzQ1NzlhNDRkNGE=\">his adventures in Consciousness Studies</a>, please try to keep in mind that we dualists the ones who are to be laughed at because of our belief that consciousness is a non-material phenomenon:</p><blockquote><p>One thing you wonder in advance about conferences like this is what the proportions will be of (a) real research results and original insights, as opposed to (b) academic log-rolling, tenured self-indulgence, flogging of dead horses, and content-free arm-waving. In the afternoon plenary session we got some of the (b).</p><p>The topic was “Sex and consciousness.” Barry Komisaruk of Rutgers started with an interesting account of some neurophysiological experiments, then wandered off into the arm-waving zone. Sample: “If time is a fourth dimension, why can’t consciousness be a fifth dimension?” Uh, because you can quantify time, but you can’t quantify consciousness. How are you gonna set up a co-ordinate axis if you can’t quantify?</p><p>Then Jenny Wade (not sure of her affiliation) got up and told us about some research she’d done. She’d got a sample heavily loaded with middle-aged university women and asked them about their mind states during sex. For heaven’s sake: I can get this stuff from reading Erica Jong. I left when she started talking about Tantric sex. I know Tibet’s in the news, but really.</p></blockquote><p>I’m not averse to studying consciousness, whether it be via the use of empirical evidence or Bongzilla, but I do think it’s quite funny when one considers that these are the people upon whom the average atheist is relying in his Dennett-approved doxastic division of labor, whether he realizes it or not.  Because, you know, there’s some physicists who have this really <i>awesome</i> scientific model….  Anyhow, Derb and I may be on opposite sides of the religion divide, but I always find his acerbic skepticism to be entertaining, no matter the target.</p></div>",
  "content_text": "As you read Derb’s description of\nhis adventures in Consciousness Studies\n, please try to keep in mind that we dualists the ones who are to be laughed at because of our belief that consciousness is a non-material phenomenon:\nOne thing you wonder in advance about conferences like this is what the proportions will be of (a) real research results and original insights, as opposed to (b) academic log-rolling, tenured self-indulgence, flogging of dead horses, and content-free arm-waving. In the afternoon plenary session we got some of the (b).\nThe topic was “Sex and consciousness.” Barry Komisaruk of Rutgers started with an interesting account of some neurophysiological experiments, then wandered off into the arm-waving zone. Sample: “If time is a fourth dimension, why can’t consciousness be a fifth dimension?” Uh, because you can quantify time, but you can’t quantify consciousness. How are you gonna set up a co-ordinate axis if you can’t quantify?\nThen Jenny Wade (not sure of her affiliation) got up and told us about some research she’d done. She’d got a sample heavily loaded with middle-aged university women and asked them about their mind states during sex. For heaven’s sake: I can get this stuff from reading Erica Jong. I left when she started talking about Tantric sex. I know Tibet’s in the news, but really.\nI’m not averse to studying consciousness, whether it be via the use of empirical evidence or Bongzilla, but I do think it’s quite funny when one considers that these are the people upon whom the average atheist is relying in his Dennett-approved doxastic division of labor, whether he realizes it or not.  Because, you know, there’s some physicists who have this really\nawesome\nscientific model….  Anyhow, Derb and I may be on opposite sides of the religion divide, but I always find his acerbic skepticism to be entertaining, no matter the target.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-10T12:35:00+00:00"
}