{
  "url": "https://voxday.net/2008/04/23/its-not-democracy/",
  "scraped_at": "2026-01-08T22:20:25.481245",
  "title": "It’s not a democracy",
  "date_display": "April 23, 2008",
  "date_iso": "2008-04-23T08:08:00+00:00",
  "date_from_url": "2008-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Again, I repeat the statement I first made in 2003.  Hillary Clinton will be the next president.  Those who point out that she can’t win because she can’t get enough delegates don’t understand that the entire purpose of the superdelegates is <a href=\"http://abcnews.go.com/Politics/Vote2008/story?id=4701035&amp;page=1\">to shut down the democratic primary process</a>:</p><blockquote><p>With neither candidate able to get the 2,025 delegates needed to win the party’s nomination, tonight’s win in Pennsylvania will bolster Clinton’s argument to superdelegates — the 795 Democratic party officials and members of Congress who may ultimately decide the nomination.</p></blockquote><p>The fact that Obama has more delegates is totally irrelevant.  He can’t get enough to win, so the matter goes to the superdelegates.  They are not about to put their bets and connections to central power on such an obvious loser in November.  Winning 95 percent of the black vote isn’t going to make up for getting slaughtered by whites and Hispanics, who simply will not support an elitist African supremacist with a gift for both oratory and untimely gaffes.  Obama was supposed to give Hillary a run for her money and make her look electable; now that he has accomplished that and even some Republicans see her as the least of three evils, her accession to the Cherry Blossom Throne is all but guaranteed.</p><p>In case you still haven’t grasped The Narrative, they’ll even spell it out for you:  Hillary Clinton has <a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2008/04/23/wuspols523.xml\">her Rocky Balboa moment</a> in Pennsylvania.</p></div>",
  "content_text": "Again, I repeat the statement I first made in 2003.  Hillary Clinton will be the next president.  Those who point out that she can’t win because she can’t get enough delegates don’t understand that the entire purpose of the superdelegates is\nto shut down the democratic primary process\n:\nWith neither candidate able to get the 2,025 delegates needed to win the party’s nomination, tonight’s win in Pennsylvania will bolster Clinton’s argument to superdelegates — the 795 Democratic party officials and members of Congress who may ultimately decide the nomination.\nThe fact that Obama has more delegates is totally irrelevant.  He can’t get enough to win, so the matter goes to the superdelegates.  They are not about to put their bets and connections to central power on such an obvious loser in November.  Winning 95 percent of the black vote isn’t going to make up for getting slaughtered by whites and Hispanics, who simply will not support an elitist African supremacist with a gift for both oratory and untimely gaffes.  Obama was supposed to give Hillary a run for her money and make her look electable; now that he has accomplished that and even some Republicans see her as the least of three evils, her accession to the Cherry Blossom Throne is all but guaranteed.\nIn case you still haven’t grasped The Narrative, they’ll even spell it out for you:  Hillary Clinton has\nher Rocky Balboa moment\nin Pennsylvania.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-23T07:08:00+00:00"
}