{
  "url": "https://voxday.net/2008/04/02/jamie-just-passed-out-from-envy/",
  "scraped_at": "2026-01-08T22:18:04.241315",
  "title": "Dick to the Dawk",
  "date_display": "April 2, 2008",
  "date_iso": "2008-04-02T16:01:00+00:00",
  "date_from_url": "2008-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamie just passed out from envy after watching this video which a UK reader emailed to me today.  As I have repeatedly stated, the backlash is only beginning.  I had no idea it would be so much fun, though.</p><p><i>He’s smarter than you, he’s got a science degree!</i></p><div><b><a href=\"http://www.dailymotion.com/video/x4vp5t_dawkins-beware-the-believers-dicky_fun\">Dawkins – Beware The Believers- [Dicky D Rap]</a></b></div><p>I suspect this wasn’t quite what the Four Horsemen of the Bukkakelypse had in mind in that rather smug roundtable discussion wherein it was concluded that there was no need for respect to enter into the religion/atheism debate.  Of course, thanks to the social autism that pervades scientistry, it’s not exactly hard to send a convincing message that science is deeply uncool and undeservedly arrogant.</p><p>UPDATE – While Derb demonstrates that he has both a) a clue, and, b) a sense of humor, one of his NRO readers <a href=\"http://corner.nationalreview.com/post/?q=MjliYTJiNGM1OGUyNGIzMzA1ZDJkOWQ3MDJlOGM2ZDY=\">manifestly does not</a>:</p><blockquote><p>So the argument here is that people who spend their lives working in scientific research are arrogant buffoons if they claim to know more about scientific topics than non-scientists? And this is funny?</p></blockquote><p>I wonder if this guy realizes that Dawkins hasn’t done any science for a long time, he’s literally a professional propagandist now.  Dennett is a philosopher and Hitchens is a journalist, so they’ve never done any, although PZ Myers does apparently torture fish from time to time when he’s not busy haranguing the religious faithful.  It is science!  On the other hand, give the guy some credit as unlike Richard Dawkins and his little cult, he did at least manage to grasp that <a href=\"http://richarddawkins.net/article,2409,Beware-the-Believers,RandomSlice\">it is expressing a perspective that is critical of both science and atheism.</a></p><p><i>“If anyone can understand a single word of this, don’t bother to translate, just tell me whose side it’s on.”</i> <br>– Richard Dawkins aka The Uncockblockable</br></p><p><i>“i just want to assure everyone that everyone is looking very deeply into this, and it isnt necessary. i understand this kind of thing very well, and i can say with no doubt that the intent is to flatter a pro-science stance.”</i><br>– random Richarddawkins.net commenter</br></p></div>",
  "content_text": "Jamie just passed out from envy after watching this video which a UK reader emailed to me today.  As I have repeatedly stated, the backlash is only beginning.  I had no idea it would be so much fun, though.\nHe’s smarter than you, he’s got a science degree!\nDawkins – Beware The Believers- [Dicky D Rap]\nI suspect this wasn’t quite what the Four Horsemen of the Bukkakelypse had in mind in that rather smug roundtable discussion wherein it was concluded that there was no need for respect to enter into the religion/atheism debate.  Of course, thanks to the social autism that pervades scientistry, it’s not exactly hard to send a convincing message that science is deeply uncool and undeservedly arrogant.\nUPDATE – While Derb demonstrates that he has both a) a clue, and, b) a sense of humor, one of his NRO readers\nmanifestly does not\n:\nSo the argument here is that people who spend their lives working in scientific research are arrogant buffoons if they claim to know more about scientific topics than non-scientists? And this is funny?\nI wonder if this guy realizes that Dawkins hasn’t done any science for a long time, he’s literally a professional propagandist now.  Dennett is a philosopher and Hitchens is a journalist, so they’ve never done any, although PZ Myers does apparently torture fish from time to time when he’s not busy haranguing the religious faithful.  It is science!  On the other hand, give the guy some credit as unlike Richard Dawkins and his little cult, he did at least manage to grasp that\nit is expressing a perspective that is critical of both science and atheism.\n“If anyone can understand a single word of this, don’t bother to translate, just tell me whose side it’s on.”\n– Richard Dawkins aka The Uncockblockable\n“i just want to assure everyone that everyone is looking very deeply into this, and it isnt necessary. i understand this kind of thing very well, and i can say with no doubt that the intent is to flatter a pro-science stance.”\n– random Richarddawkins.net commenter",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-02T15:01:00+00:00"
}