{
  "url": "https://voxday.net/2008/04/06/massachusetts-discovers-economics/",
  "scraped_at": "2026-01-08T22:18:37.133153",
  "title": "Massachusetts discovers economics",
  "date_display": "April 6, 2008",
  "date_iso": "2008-04-06T13:11:00+00:00",
  "date_from_url": "2008-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently the Law of Supply and Demand still <a href=\"http://www.nytimes.com/2008/04/05/us/05doctors.html?ei=5087&amp;em=&amp;en=7e890db1d78a1061&amp;ex=1207627200&amp;adxnnl=1&amp;adxnnlx=1207487162-WudxMRRadqQVBl2gDvKnqQ\">comes as a bit of a shock</a> to some.  What, you mean you can’t subsidize the cost of health care without increasing the demand for it?</p><blockquote><p>Now in Massachusetts, in an unintended consequence of universal coverage, the imbalance is being exacerbated by the state’s new law requiring residents to have health insurance.</p></blockquote><p>Naturally, the economically clueless idiots behind this demand-side problem are seeking to compound it by subsidizing the supply-side.  All that needs to be done is eliminate Medicare and the AMA and let the market and the individual sort it out for themselves.  Yes, some stupid and unfortunate people will suffer from a lack of health care as a result, but far fewer than are now suffering from it.  There is no problem with the free market that government solutions cannot exacerbate.</p><p>And you can always count on the liberal fascists to want to throw force into the equation: <i>“Since the government is taking over the health care, doctors should not be “encouraged” to join primary-care. They should be required. If doctors refuse, they should be arrested and locked up.</i></p></div>",
  "content_text": "Apparently the Law of Supply and Demand still\ncomes as a bit of a shock\nto some.  What, you mean you can’t subsidize the cost of health care without increasing the demand for it?\nNow in Massachusetts, in an unintended consequence of universal coverage, the imbalance is being exacerbated by the state’s new law requiring residents to have health insurance.\nNaturally, the economically clueless idiots behind this demand-side problem are seeking to compound it by subsidizing the supply-side.  All that needs to be done is eliminate Medicare and the AMA and let the market and the individual sort it out for themselves.  Yes, some stupid and unfortunate people will suffer from a lack of health care as a result, but far fewer than are now suffering from it.  There is no problem with the free market that government solutions cannot exacerbate.\nAnd you can always count on the liberal fascists to want to throw force into the equation:\n“Since the government is taking over the health care, doctors should not be “encouraged” to join primary-care. They should be required. If doctors refuse, they should be arrested and locked up.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-06T12:11:00+00:00"
}