{
  "url": "https://voxday.net/2008/04/13/more-publishing-fraud/",
  "scraped_at": "2026-01-08T22:19:30.466966",
  "title": "More publishing fraud",
  "date_display": "April 13, 2008",
  "date_iso": "2008-04-13T14:11:00+00:00",
  "date_from_url": "2008-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Mr Kohnstamm, whose book is titled Do Travel Writers Go To Hell?, said yesterday that he had worked on more than a dozen books for Lonely Planet, including its titles on Brazil, Colombia, the Caribbean, Venezuela, Chile and South America.</p><p>In one case, he said he had not even visited the country he wrote about.</p><p>“They didn’t pay me enough to go Colombia,” he said.</p><p>“I wrote the book in San Francisco. I got the information from a chick I was dating – an intern in the Colombian Consulate.</p></blockquote><p><a href=\"http://www.news.com.au/dailytelegraph/story/0,22049,23530231-5013605,00.html\">This doesn’t surprise me</a> at all.  Most readers would be shocked at how little editing takes place in the publishing world.  Based on my experience with one of the largest fiction publishing houses, I can say that while they’ll spend eighteen months making a decision about publishing a book proposal <i>for which they approached YOU in the first place</i>, once you turn in the first and final draft, they’ll let one underpaid editor fresh out of college spend a week or two going over the manuscript.  If you’re lucky, a second one might line-edit it and correct your punctuation errors.</p><p>If you don’t believe me, just consider the size of the first Harry Potter book compared to the last one.  Do you really think it got any editing?  Does it read like it was edited?</p><p>There is no way a travel book gets fact-checked.  It would cost too much.  I’ve lived in Europe for a decade and I don’t think I’ve looked at a travel book since the first year we were here and we visited Florence and Verona.  Unless you like reading them for the fiction, they serve little point now that you can look up hotels on the Internet.</p></div>",
  "content_text": "Mr Kohnstamm, whose book is titled Do Travel Writers Go To Hell?, said yesterday that he had worked on more than a dozen books for Lonely Planet, including its titles on Brazil, Colombia, the Caribbean, Venezuela, Chile and South America.\nIn one case, he said he had not even visited the country he wrote about.\n“They didn’t pay me enough to go Colombia,” he said.\n“I wrote the book in San Francisco. I got the information from a chick I was dating – an intern in the Colombian Consulate.\nThis doesn’t surprise me\nat all.  Most readers would be shocked at how little editing takes place in the publishing world.  Based on my experience with one of the largest fiction publishing houses, I can say that while they’ll spend eighteen months making a decision about publishing a book proposal\nfor which they approached YOU in the first place\n, once you turn in the first and final draft, they’ll let one underpaid editor fresh out of college spend a week or two going over the manuscript.  If you’re lucky, a second one might line-edit it and correct your punctuation errors.\nIf you don’t believe me, just consider the size of the first Harry Potter book compared to the last one.  Do you really think it got any editing?  Does it read like it was edited?\nThere is no way a travel book gets fact-checked.  It would cost too much.  I’ve lived in Europe for a decade and I don’t think I’ve looked at a travel book since the first year we were here and we visited Florence and Verona.  Unless you like reading them for the fiction, they serve little point now that you can look up hotels on the Internet.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-13T13:11:00+00:00"
}