{
  "url": "https://voxday.net/2008/04/14/no-excuse/",
  "scraped_at": "2026-01-08T22:19:35.911228",
  "title": "No excuse",
  "date_display": "April 14, 2008",
  "date_iso": "2008-04-14T16:45:00+00:00",
  "date_from_url": "2008-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The allegations of abuse of a girl is <a href=\"http://www.deseretnews.com/article/1,5143,695270108,00.html\">no excuse for kidnapping hundreds of children</a> and breaking up their families:</p><blockquote><p>The leader of the Yearning For Zion Ranch says he doesn’t understand how the government could sweep in and seize all their children based on an unproven allegation.</p><p>“This whole situation is abusive and out of hand,” said Merril Jessop, a presiding elder in the FLDS Church. “The nearest thing I have ever seen comparable to this, even on the TV shows, is Nazi Germany.”</p><p>“The only thing we ask of the governor and citizens of Texas,” Jessop said, “is to give every man, woman and child due process and an attorney before they destroy their lives.”</p></blockquote><p>As usual, good intentions pave the road to Hell.  The irony is that those who are supportive the government seizing these children on the basis of allegations of a sexually abused fifteen-year old are often the same people who argue a fifteen-year old girl is mature enough to have sex and get an abortion without parental consent.  Now, I’m not a big fan of the Mormon religion or its variants myself. <i>But that doesn’t mean that it is right to look the other way as these Americans’ unalienable and Constitutional rights are trampled and their children are forcibly kidnapped by government agents!</i></p><p>About the only positive thing you can say about it is that unlike Waco, the government forces didn’t kill them all.  This is not America, this is the decaying corpse of what was once America.  How long will it be before the first child is seized based on evidence of abuse that consists of ownership of a book that advocates the “hitting” a misbehaving child?</p></div>",
  "content_text": "The allegations of abuse of a girl is\nno excuse for kidnapping hundreds of children\nand breaking up their families:\nThe leader of the Yearning For Zion Ranch says he doesn’t understand how the government could sweep in and seize all their children based on an unproven allegation.\n“This whole situation is abusive and out of hand,” said Merril Jessop, a presiding elder in the FLDS Church. “The nearest thing I have ever seen comparable to this, even on the TV shows, is Nazi Germany.”\n“The only thing we ask of the governor and citizens of Texas,” Jessop said, “is to give every man, woman and child due process and an attorney before they destroy their lives.”\nAs usual, good intentions pave the road to Hell.  The irony is that those who are supportive the government seizing these children on the basis of allegations of a sexually abused fifteen-year old are often the same people who argue a fifteen-year old girl is mature enough to have sex and get an abortion without parental consent.  Now, I’m not a big fan of the Mormon religion or its variants myself.\nBut that doesn’t mean that it is right to look the other way as these Americans’ unalienable and Constitutional rights are trampled and their children are forcibly kidnapped by government agents!\nAbout the only positive thing you can say about it is that unlike Waco, the government forces didn’t kill them all.  This is not America, this is the decaying corpse of what was once America.  How long will it be before the first child is seized based on evidence of abuse that consists of ownership of a book that advocates the “hitting” a misbehaving child?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-14T15:45:00+00:00"
}