{
  "url": "https://voxday.net/2008/04/25/one-star-reviews/",
  "scraped_at": "2026-01-08T22:20:50.526420",
  "title": "One-star reviews",
  "date_display": "April 25, 2008",
  "date_iso": "2008-04-25T11:38:00+00:00",
  "date_from_url": "2008-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I take <a href=\"http://scalzi.com/whatever/?p=663\">Mr. John Scalzi’s advice to writers </a> to post one-star reviews of their books:</p><blockquote><p><i>“These days the most popular books are books that slam other books or writers that slam other writers or idealists on one side slamming idealists on the other side. Get a clue!”</i></p><p>“I only managed to read the first 3 chapters of this book. Vox Day employs so many logical fallacies and so much dishonest rhetoric that it’s a difficult read.”</p><p>“The book starts with many generic arguments that evolve down to the old question of “without god, how can there be morals?”. Anyone who has spent 5 minutes reading the ‘Argument from morality’ page on wikipedia will find these sections silly or at least inefficient.  The attacks use short quotes from Dawkins/Harris books, and as a reader I feel like I am not getting the context of the quotes. In the case of the Harris state vs county crime/religion statistic, I wish Vox would quote the reason Harris was using it… for all I know Harris was making a point that the corelation is meaningless.”</p><p>“Since I’m not willing to pick this book apart in review, I recommend that anyone interested read the book and exercise their own critical thinking skills. If you’re not well read in other areas of science and religion, don’t bother.”</p><p>“If the author wrote the book for the three most often named Athiests, I could probably give him 4 or five stars, the 1 star is for the book as written, assuming that it was intended for mass market readership. I really have no quarrel with Day’s disgust with Athiests if that is how he feels, not do I have any problem with Harris et. al. espousing their lack of beilef in a supreme being.  My problem is with the author and what appears to be an extreme ego.”</p><p>“I opened this book expecting, or at least hoping, to find a reasoned rebuttal to the arguments of better-known authors, but what I found was a meaningless parade of misrepresentations and outright lies. From someone who has actually named himself the Voice of God, this was a remarkably mundane read.”</p><p>“[Vox Day’s] arrogance, rudeness, and unending logical fallacies have brought nothing to the intellectual discussion between theists and atheists.”</p></blockquote><p>I think Scalzi was right.  If it is really true that we are defined by our enemies, I suddenly find that I feel kind of… feel kind of invincible.  Is it getting hot in here, or is it just me?</p><p>And speaking of reading three chapters, <a href=\"http://www.rationalresponders.com/crossexam\">Kelly of the Rational Response Squad has responded</a> to my response to her critique of chapter two.  I’m quite content to leave it with her and wait for her critique of chapter three, although I should probably note that “the vast majority of historians” she mentioned do not disagree with me, but with her.  Kelly’s airy dismissal of the Encylopedia Britannica also happens to reject what has been the historical consensus for the last 70 years.</p></div>",
  "content_text": "In which I take\nMr. John Scalzi’s advice to writers\nto post one-star reviews of their books:\n“These days the most popular books are books that slam other books or writers that slam other writers or idealists on one side slamming idealists on the other side. Get a clue!”\n“I only managed to read the first 3 chapters of this book. Vox Day employs so many logical fallacies and so much dishonest rhetoric that it’s a difficult read.”\n“The book starts with many generic arguments that evolve down to the old question of “without god, how can there be morals?”. Anyone who has spent 5 minutes reading the ‘Argument from morality’ page on wikipedia will find these sections silly or at least inefficient.  The attacks use short quotes from Dawkins/Harris books, and as a reader I feel like I am not getting the context of the quotes. In the case of the Harris state vs county crime/religion statistic, I wish Vox would quote the reason Harris was using it… for all I know Harris was making a point that the corelation is meaningless.”\n“Since I’m not willing to pick this book apart in review, I recommend that anyone interested read the book and exercise their own critical thinking skills. If you’re not well read in other areas of science and religion, don’t bother.”\n“If the author wrote the book for the three most often named Athiests, I could probably give him 4 or five stars, the 1 star is for the book as written, assuming that it was intended for mass market readership. I really have no quarrel with Day’s disgust with Athiests if that is how he feels, not do I have any problem with Harris et. al. espousing their lack of beilef in a supreme being.  My problem is with the author and what appears to be an extreme ego.”\n“I opened this book expecting, or at least hoping, to find a reasoned rebuttal to the arguments of better-known authors, but what I found was a meaningless parade of misrepresentations and outright lies. From someone who has actually named himself the Voice of God, this was a remarkably mundane read.”\n“[Vox Day’s] arrogance, rudeness, and unending logical fallacies have brought nothing to the intellectual discussion between theists and atheists.”\nI think Scalzi was right.  If it is really true that we are defined by our enemies, I suddenly find that I feel kind of… feel kind of invincible.  Is it getting hot in here, or is it just me?\nAnd speaking of reading three chapters,\nKelly of the Rational Response Squad has responded\nto my response to her critique of chapter two.  I’m quite content to leave it with her and wait for her critique of chapter three, although I should probably note that “the vast majority of historians” she mentioned do not disagree with me, but with her.  Kelly’s airy dismissal of the Encylopedia Britannica also happens to reject what has been the historical consensus for the last 70 years.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-25T10:38:00+00:00"
}