{
  "url": "https://voxday.net/2008/04/11/revised-estimate/",
  "scraped_at": "2026-01-08T22:19:21.218597",
  "title": "A revised estimate",
  "date_display": "April 11, 2008",
  "date_iso": "2008-04-11T16:30:00+00:00",
  "date_from_url": "2008-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I previously asserted that Richard Dawkins couldn’t last 5 minutes in a debate of <i>The God Delusion</i> with me.  After reading <a href=\"http://www.expelledthemovie.com/chronicle.php?article=16\">this account of his encounter with Mark Mathis</a>, the producer of the movie EXPELLED, I think I may have been a bit too generous.  Dawkins is the proverbial example of a man who is intellectually crippled by his short-sighted refusal to listen to substantive criticism:</p><blockquote><p>Dawkins: Why were you dishonest about the film you were going to make?! We were lead to believe that you were going to present a fair account of evolution.</p><p>[Richard Dawkins is now bouncing up like a man on a string to launch his charges. He then fades into his seat when a proper, logical explanation is given.]</p><p>Mathis: Mr. Dawkins, that’s precisely what we have done. We’ve presented a fair account of the academic persecution that goes on across America and indeed the world when a scientist dares to disagree with the Darwinian view.<br>Dawkins: You were not forthcoming with me that you were making a film that involved people who claim they have been persecuted!</br></p><p>Mathis: Professor Dawkins, I contacted you by e-mail prior to our interview. You quizzed me on all of the questions in your backyard for a half hour before we sat down with the cameras. After the interview you signed our release and accepted a generous payment for your time (Laughter). I think we were very fair with you.</p><p>Mathis: By the way Mr. Dawkins, I want to tell you that what you said on Atheist Radio not long ago was completely untrue. You tried to take credit for setting up our second interview location at the British Museum of Natural History. I set up that location and it involved a tremendous amount of time and effort and a very large check. You also claimed on Atheist radio that you expected me to be doing the interview and not Mr. Stein, that you were duped again. I have a long e-mail record of my communication with you, explaining that following the success of The God Delusion Mr. Stein wanted to interview you himself. I sent you a list of Mr. Stein’s broad range of accomplishments. I can accept this situation as perhaps a lapse of memory, but what you said was not true.</p><p>Dawkins: Those are minor points.<br>Mathis: Not to me. You called me a liar on the radio (Laughter).</br></p><p>Dawkins: If that is the case then I offer you an apology.<br>Mathis: I accept.</br></p></blockquote><p>(Brushing away a tear)  It’s deeply touching, isn’t it?  Now, I haven’t seen the movie, so I have no idea whether it makes a conclusive case against the scientific community or if it is the dishonest schlockfest that PZ Myers claims it to be.  Since neither evolutionary biology nor professional squabbles over tenure in academia are of much interest to me, I don’t particularly care one way or the other; I am skeptical of the medium as a vehicle for anything but propaganda and emotional manipulation anyhow.  Still, as a writer engaged in the religion/atheism debate, I find it completely unsurprising that atheism’s current champion should prove to be so incapable of defending himself against an attack, even in his area of nominal expertise.  How could he, when he manifestly prefers wallowing in mindless adulation to studying his opponents and engaging them with an eye towards honing his arguments.  Information about the enemy should always be treasured and studied in detail, not ignored.  One would do very well to learn from his negative example.</p><p>And speaking of those who have no clue that just maybe the rest of the world doesn’t think precisely the way they do, <a href=\"http://adriennelily.livejournal.com/110969.html?thread=491897#t491897\">John Scalzi’s attempt to explain </a>to one disgruntled Whatever reader that she is not, in fact, the epicenter of humanity, is both funny and informative:</p><blockquote><p><i>“Every time I’ve read the comments at your site, the people there come across as intelligent, open-minded, educated people. I find it hard to believe that there are actually that many who agree with Vox.”</i></p><p>Now, discovering who reads Whatever is an imperfect science — I’ve not taken a poll. But what I *do* have are piles and piles of stats, which tell me on a very granular level how many people visit, (relevant to this discussion) where they’re coming from when they visit, and who links to the site. These tell me that lots of folks come in from sites whose politics, social views, and general lifestyle preferences differ from mine, sometime dramatically. Are these majority? By no means — but, as an example, even before this week, about as many people came to visit my site from Vox Day’s blog as comment frequently on the site. If they chose to comment on the site on a daily basis, the tenor of the comment threads would be different. Over the last 30 days, the top five referring sites are Neil Gaiman’s, PZ Myers’, Glenn Reynolds’, Vox Day’s and the Nielsen Hayden’s. It’s an eclectic mix, to be sure, and all of those referrers are in the thousands of clicks, aggregate (and in the case of VD, was so before this week, too).</p></blockquote><p>I had no idea Mr. Scalzi was so popular in these parts.  No wonder his books sell so well, if his work harbors broad spectrum appeal to the Ilk, the Pharyngulans <i>and</i> the cult of the Tor Witch.</p></div>",
  "content_text": "I previously asserted that Richard Dawkins couldn’t last 5 minutes in a debate of\nThe God Delusion\nwith me.  After reading\nthis account of his encounter with Mark Mathis\n, the producer of the movie EXPELLED, I think I may have been a bit too generous.  Dawkins is the proverbial example of a man who is intellectually crippled by his short-sighted refusal to listen to substantive criticism:\nDawkins: Why were you dishonest about the film you were going to make?! We were lead to believe that you were going to present a fair account of evolution.\n[Richard Dawkins is now bouncing up like a man on a string to launch his charges. He then fades into his seat when a proper, logical explanation is given.]\nMathis: Mr. Dawkins, that’s precisely what we have done. We’ve presented a fair account of the academic persecution that goes on across America and indeed the world when a scientist dares to disagree with the Darwinian view.\nDawkins: You were not forthcoming with me that you were making a film that involved people who claim they have been persecuted!\nMathis: Professor Dawkins, I contacted you by e-mail prior to our interview. You quizzed me on all of the questions in your backyard for a half hour before we sat down with the cameras. After the interview you signed our release and accepted a generous payment for your time (Laughter). I think we were very fair with you.\nMathis: By the way Mr. Dawkins, I want to tell you that what you said on Atheist Radio not long ago was completely untrue. You tried to take credit for setting up our second interview location at the British Museum of Natural History. I set up that location and it involved a tremendous amount of time and effort and a very large check. You also claimed on Atheist radio that you expected me to be doing the interview and not Mr. Stein, that you were duped again. I have a long e-mail record of my communication with you, explaining that following the success of The God Delusion Mr. Stein wanted to interview you himself. I sent you a list of Mr. Stein’s broad range of accomplishments. I can accept this situation as perhaps a lapse of memory, but what you said was not true.\nDawkins: Those are minor points.\nMathis: Not to me. You called me a liar on the radio (Laughter).\nDawkins: If that is the case then I offer you an apology.\nMathis: I accept.\n(Brushing away a tear)  It’s deeply touching, isn’t it?  Now, I haven’t seen the movie, so I have no idea whether it makes a conclusive case against the scientific community or if it is the dishonest schlockfest that PZ Myers claims it to be.  Since neither evolutionary biology nor professional squabbles over tenure in academia are of much interest to me, I don’t particularly care one way or the other; I am skeptical of the medium as a vehicle for anything but propaganda and emotional manipulation anyhow.  Still, as a writer engaged in the religion/atheism debate, I find it completely unsurprising that atheism’s current champion should prove to be so incapable of defending himself against an attack, even in his area of nominal expertise.  How could he, when he manifestly prefers wallowing in mindless adulation to studying his opponents and engaging them with an eye towards honing his arguments.  Information about the enemy should always be treasured and studied in detail, not ignored.  One would do very well to learn from his negative example.\nAnd speaking of those who have no clue that just maybe the rest of the world doesn’t think precisely the way they do,\nJohn Scalzi’s attempt to explain\nto one disgruntled Whatever reader that she is not, in fact, the epicenter of humanity, is both funny and informative:\n“Every time I’ve read the comments at your site, the people there come across as intelligent, open-minded, educated people. I find it hard to believe that there are actually that many who agree with Vox.”\nNow, discovering who reads Whatever is an imperfect science — I’ve not taken a poll. But what I *do* have are piles and piles of stats, which tell me on a very granular level how many people visit, (relevant to this discussion) where they’re coming from when they visit, and who links to the site. These tell me that lots of folks come in from sites whose politics, social views, and general lifestyle preferences differ from mine, sometime dramatically. Are these majority? By no means — but, as an example, even before this week, about as many people came to visit my site from Vox Day’s blog as comment frequently on the site. If they chose to comment on the site on a daily basis, the tenor of the comment threads would be different. Over the last 30 days, the top five referring sites are Neil Gaiman’s, PZ Myers’, Glenn Reynolds’, Vox Day’s and the Nielsen Hayden’s. It’s an eclectic mix, to be sure, and all of those referrers are in the thousands of clicks, aggregate (and in the case of VD, was so before this week, too).\nI had no idea Mr. Scalzi was so popular in these parts.  No wonder his books sell so well, if his work harbors broad spectrum appeal to the Ilk, the Pharyngulans\nand\nthe cult of the Tor Witch.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-11T15:30:00+00:00"
}