{
  "url": "https://voxday.net/2008/04/08/so-kick-them-out-already/",
  "scraped_at": "2026-01-08T22:18:46.288378",
  "title": "So kick them out already",
  "date_display": "April 8, 2008",
  "date_iso": "2008-04-08T09:58:00+00:00",
  "date_from_url": "2008-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Equalitarians don’t seem to understand that the primary role of the military is <a href=\"http://www.alternet.org/waroniraq/80995\">to do very bad things to people</a>, many of whom don’t deserve it:</p><blockquote><p>The stories are shocking in their simplicity and brutality: A female military recruit is pinned down at knifepoint and raped repeatedly in her own barracks. Her attackers hid their faces but she identified them by their uniforms; they were her fellow soldiers. During a routine gynecological exam, a female soldier is attacked and raped by her military physician. Yet another young soldier, still adapting to life in a war zone, is raped by her commanding officer. Afraid for her standing in her unit, she feels she has nowhere to turn.  These are true stories, and, sadly, not isolated incidents. Women serving in the U.S. military are more likely to be raped by a fellow soldier than killed by enemy fire in Iraq.</p><p>The scope of the problem was brought into acute focus for me during a visit to the West Los Angeles VA Healthcare Center, where I met with female veterans and their doctors. My jaw dropped when the doctors told me that 41% of female veterans seen at the clinic say they were victims of sexual assault while in the military, and 29% report being raped during their military service.</p></blockquote><p>This isn’t shocking, this is entirely predictable.  It was predicted, as it was one of the many reasons that sane individuals have opposed women serving in the military from the very start.  The idea that you can overcome Man’s moral resistence to murdering people so that he will kill on command without having any impact whatsoever on his other moral restraints is a classic example of the Education Fallacy.</p><p>Soldiers have always raped women; a kinder, gentler, more civilized military that is incapable of rape is also a military that is going to crumble in disarray before the onslaught of military forces less concerned with social niceties and more focused on winning wars.  As every brilliant commander who ever loosed his troops on a defeated city knew, military discipline has its limits and attempting to stretch those limits risks sacrificing discipline entirely.  And if you don’t want the hard men on the front lines subject to military discipline with their attentions focused on an external enemy, then where do you want them?  Wandering around suburban malls?  Working as policemen and security guards?  With sufficient training, one can turn a human wolf into an extremely effective sheepdog, but one can never hope to turn him into a toy poodle.</p><p>It’s worth noting how one soldier explains why soldiers have so much contempt for the female “soldiers” in their midst: <i>“As an infantryman in the Army, my view is that the simple fact of the matter is that the large majority of women in the military are not soldiers. They may wear a uniform…even passed basic training..but they are not soldiers. They are chicks who like to dress like soldiers. They expect special treatment for being female (and often get it), have lower standards, have almost no respect for military courtesy and discipline, pay lipservice to equality and then cry foul when they get treated the same as their male co-workers, and all to often, their advance in paygrade is tied not to their job performance, but who they are sleeping with. Men don’t take them seriously because they don’t take the job, the standards of military culture, their fellow servicepeople, or themselves seriously.  I have no doubts that there are legitimate cases of rape and assault within the military, but since the military became coed, fraternization has gone rampant and it is very hard…very hard….to be able to distinguish the legitimate cases from the ones where a female is screaming sour grapes because she tried to trade sex for rank and lost out on the deal…particularly if the “victim” already has a reputation of sleeping around to get things she wants. That is why so many cases get dropped because of lack of evidence.”</i></p></div>",
  "content_text": "Equalitarians don’t seem to understand that the primary role of the military is\nto do very bad things to people\n, many of whom don’t deserve it:\nThe stories are shocking in their simplicity and brutality: A female military recruit is pinned down at knifepoint and raped repeatedly in her own barracks. Her attackers hid their faces but she identified them by their uniforms; they were her fellow soldiers. During a routine gynecological exam, a female soldier is attacked and raped by her military physician. Yet another young soldier, still adapting to life in a war zone, is raped by her commanding officer. Afraid for her standing in her unit, she feels she has nowhere to turn.  These are true stories, and, sadly, not isolated incidents. Women serving in the U.S. military are more likely to be raped by a fellow soldier than killed by enemy fire in Iraq.\nThe scope of the problem was brought into acute focus for me during a visit to the West Los Angeles VA Healthcare Center, where I met with female veterans and their doctors. My jaw dropped when the doctors told me that 41% of female veterans seen at the clinic say they were victims of sexual assault while in the military, and 29% report being raped during their military service.\nThis isn’t shocking, this is entirely predictable.  It was predicted, as it was one of the many reasons that sane individuals have opposed women serving in the military from the very start.  The idea that you can overcome Man’s moral resistence to murdering people so that he will kill on command without having any impact whatsoever on his other moral restraints is a classic example of the Education Fallacy.\nSoldiers have always raped women; a kinder, gentler, more civilized military that is incapable of rape is also a military that is going to crumble in disarray before the onslaught of military forces less concerned with social niceties and more focused on winning wars.  As every brilliant commander who ever loosed his troops on a defeated city knew, military discipline has its limits and attempting to stretch those limits risks sacrificing discipline entirely.  And if you don’t want the hard men on the front lines subject to military discipline with their attentions focused on an external enemy, then where do you want them?  Wandering around suburban malls?  Working as policemen and security guards?  With sufficient training, one can turn a human wolf into an extremely effective sheepdog, but one can never hope to turn him into a toy poodle.\nIt’s worth noting how one soldier explains why soldiers have so much contempt for the female “soldiers” in their midst:\n“As an infantryman in the Army, my view is that the simple fact of the matter is that the large majority of women in the military are not soldiers. They may wear a uniform…even passed basic training..but they are not soldiers. They are chicks who like to dress like soldiers. They expect special treatment for being female (and often get it), have lower standards, have almost no respect for military courtesy and discipline, pay lipservice to equality and then cry foul when they get treated the same as their male co-workers, and all to often, their advance in paygrade is tied not to their job performance, but who they are sleeping with. Men don’t take them seriously because they don’t take the job, the standards of military culture, their fellow servicepeople, or themselves seriously.  I have no doubts that there are legitimate cases of rape and assault within the military, but since the military became coed, fraternization has gone rampant and it is very hard…very hard….to be able to distinguish the legitimate cases from the ones where a female is screaming sour grapes because she tried to trade sex for rank and lost out on the deal…particularly if the “victim” already has a reputation of sleeping around to get things she wants. That is why so many cases get dropped because of lack of evidence.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-08T08:58:00+00:00"
}