{
  "url": "https://voxday.net/2008/04/27/tia-all-critics-are-created-equa/",
  "scraped_at": "2026-01-08T22:21:03.504338",
  "title": "TIA: all critics are created equal",
  "date_display": "April 27, 2008",
  "date_iso": "2008-04-27T10:49:00+00:00",
  "date_from_url": "2008-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since it’s my philosophy that all honest criticism merits addressing, I’m finally turning to <a href=\"http://irrationalatheist.com/forum/viewtopic.php?f=2&amp;t=527\">Mr. Tom Marking’s critique of TIA</a> now:</p><blockquote><p>1) Overview</p><p>On page 8 we find the following quotation: “These days atheism is, like the atheist’s ultimate destination, hot indeed.” And there are several quotes more obnoxious than this but I suspect they were offered tongue-in-cheek. This is exactly the type of stuff that diminishes his arguments and lends credence to the characterizations of Mr. Day which are prevalent on several science blogs. I know he is trying to be witty and irreverant but it becomes a pain after a while to wade through all this nonsense and get to the heart of his main critique of the New Atheist authors. In passing I will say that there is nothing more certain to piss off atheists than to threaten them with the ol’ hellfire and brimstone routine. We can always get that kind of stuff by tuning into the Sunday televangelist shows. We don’t need it from a book which supposedly wants to be taken seriously.</p></blockquote><p>1.  An ad hominum attack says nothing, positive or negative, about an unrelated argument made in its vicinity.  If I correct your math, then call you an idiot, the latter action doesn’t change the fact that I showed your math was wrong.<br>2. The characterizations of me on various science blogs have little to do with my presentation and everything to do with the effectiveness of my arguments.  PZ, for example, calls nearly every religious individual to whom he refers stupid.  He very seldom, however, ever attempts to criticize my actual arguments; this is because he’s not capable of doing so.  And he’s arguably the most capable of the aforementioned science bloggers, who are a very lightweight lot when it comes to brainpower.<br>3. The book is called <i>The Irrational Atheist</i>, an accusation which upsets the average atheist a lot more than any televangelist’s threats of nonexistent hellfire.  Let’s just say that not pissing off atheists wasn’t exactly a priority.  Dawkins and company set the rules, I’m just playing by them.</br></br></p><blockquote><p>2.) NEW ATHEISTS SAY STUPID THINGS</p><p>Now I admit that Harris got a little carried away with his “even a single little girl once in a million years” bit, but can anyone seriously doubt that the remark about 260 million Americans presenting evidence is anything more than a rhetorical flourish? Does the author seriously think that Harris has in mind the opening of evidence processing centers in all 50 states? I doubt that very much. All he’s really saying is that theists assert that God exists so let them show evidence for that position.</p><p>Turning now to page 283 let us now peruse the author’s own pet theory comparing God to a computer game designer (a theory I might add which has the sanction of the majority of Christian theologians around the world – NOT!):</p><p><i>“Faced with a maliciously corrupted game, the posthuman designer can either turn it off or attempt to fix it. He could simply manually scrub each aspect of the game, but this brute force solution would risk creating new problems and would certainly warn the mischievous interloper. A more elegant solution would be to trap the malicious posthuman and his friends in the game without warning, then insert a viral APC designed to infect other APCs with the ability to resist the malice of the posthuman intruder. His purpose in doing so would be to salvage those APCs whose emergent behavior suits his original plan to develop AIs capable of demonstrating the behaviors required for the real game.”</i></p><p>Yeah, Vox, we’re really with you so far (translation: we have no friggin’ idea what the heck that last paragraph was all about). So yes, Harris, Dawkins, and Hitchens say stupid things in their books from time to time and perhaps quite frequently, but so does Mr. Day and in great plentitude.</p></blockquote><p>1.  The main point, which seems to have escaped Mr. Marking, is that Harris’s multiple definitions of atheism directly conflict with one another.  The secondary point, which also escapes him, is that theists aren’t obliged to present evidence to anyone to justify their beliefs.  Harris made a rhetorical point, I mocked it in the process of making a better one.<br>2.  I pointed out that the Game Designer God concept was not mainstream theology in the book.  Neither I nor anyone else thinks it is anything but a potentially interesting analogy that might help some people get past their theodicy hang-up.<br>3.  The fact that Mr. Marking can’t understand a perfectly clear analogy to an MMO is hardly testimony to my predilection for saying stupid things.  Nor is one poor example sufficient evidence of a “great plentitude”.</br></br></p><blockquote><p>3.) A QUESTION OF COMPETENCE</p><p>So Harris is right in this case – the civilized world does agree that slavery is an abomination. The fact that there still exist criminal organizations which flout international law is not proof that an anti-slavery consensus does not exist….  Vox cannot have it both ways. He cannot claim credit for Christianity abolishing slavery and at the same time claim there is no anti-slavery consensus. It must be one or the other….</p><p>116 centuries? That would mean the first religion, Hinduism, began in 9,600 B.C. or only a few centuries after the last Ice Age ended. I know Hinduism is ancient but is it that ancient? A quick pit stop at Wikipedia confirms my suspicions:</p><p>“Modern Hinduism grew out of the Vedas, the oldest of which is the Rigveda, dated to 1700 – 1100 BCE”</p><p>So Vox only missed the correct start of Hinduism by about 8 millenia. Of course what he has done is to sum up durations of religions which are concurrent and thus he overcounts the total span of all religions by about 80 centuries. His percentage error is over 200 percent. Harris’ error was about 10 percent. But anyone can make a mistake, right?</p></blockquote><p>1.  Criminal organizations are part of the civilized world.  They always have been.  Government!=sum total of civilization.  Legality!=morality. <br>2.  Abolishment refers to law.  Consensus does not.  The two statements are not in the least bit contradictory.<br>3.  “These five religions have approximately 4.85 billion adherents, representing an estimated 71.3 percent of the world’s<br>population in 2007, and they have been around for a <b>COLLECTIVE</b> 11,600 years.”  Collective is defined as “Assembled into or viewed as a whole.”  Now, “cumulative” would probably have been a better choice, but even so, the problem isn’t with my math, which is correct, it’s with the fact that Mr. Marking can’t bloody read.</br></br></br></p><blockquote><p>Now, getting more into the meat of the issue we turn to chapter 3 entitled “The Case Against Science”. Mr. Day points out that it is science itself which threatens the continued survival of mankind and not religion.</p><p><i>p45: “So, in only 3 percent of the time that religion has been on the scene, science has managed to produce multiple threats to continued human existence.”</i></p><p>By the way, that 3 percent should be replaced with 9 percent based upon Vox’s previous miscalculation. I actually agree with the author on this point. It is primarily the availability of modern technology produced by science which is the gravest threat to our survival as a species….</p><p>Taking the atomic bomb as an example, according to Mr. Day the sole responsibility for the development of nuclear weapons rests with the scientists themselves. What about the politicians who funded the Manhattan Project, the military people who organized it, and the numerous bureacrats who managed the project? Can they all now escape culpability? Is it only the scientists who are to blame?…</p><p>Hate to rain on your parade, Vox, but the 4,000 banned books (most of them scientific or philosophical works) continued to be banned until 1966, not 1753….</p><p>So lots of ve<br> iled threats that the Christians and other religious believers will do in the scientists. Given that the scientists in this scenario created the nuclear weapons, know how to use them, and have access to them whereas the religious masses do not, just how does Mr. Day expect this war to end? I would suspect the final score would be something like scientists: 4.85 billion, religious folks: 0.</br></p></blockquote><p>1.  Again, there is no miscalculation.  The cumulative sum is both the correct figure and the relevant one for comparison’s sake.<br>2.  Yes, it is only the scientists who are to blame for the EXISTENCE of the weapons developed by science, although the RESPONSIBILITY can certainly be shared more broadly, just as I pointed out in the book.  Once more, Mr. Marking’s sloppiness leads him into error.  Does he seriously believe that the aforementioned weapons would still exist if there had been only politicians and bureaucrats to develop them?<br>3.  If the Church’s opposition to the novels of Daniel Defoe and Honore de Balzac, (which have been readily available to the public ever since they were first published), is not a crime against science, then what is? <br>4.  This is both silly and stupid.  What would be the point of veiled threats to further a war I argue does not even exist?  It’s a simple matter of numbers.  Science can’t win a war against religion; the best it could hope to do is wipe out the entire human race.  The fact that atheists continue to promote this insane idea of inherent conflict tends to go some way towards explaining their bloody historical track record.</br></br></br></p><p>I’ll address the fifth and final point separately, since Mr. Marking has gone to some trouble to attempt to support it in detail.  Rest assured, it’s no more tenable than the previous four.</p></div>",
  "content_text": "Since it’s my philosophy that all honest criticism merits addressing, I’m finally turning to\nMr. Tom Marking’s critique of TIA\nnow:\n1) Overview\nOn page 8 we find the following quotation: “These days atheism is, like the atheist’s ultimate destination, hot indeed.” And there are several quotes more obnoxious than this but I suspect they were offered tongue-in-cheek. This is exactly the type of stuff that diminishes his arguments and lends credence to the characterizations of Mr. Day which are prevalent on several science blogs. I know he is trying to be witty and irreverant but it becomes a pain after a while to wade through all this nonsense and get to the heart of his main critique of the New Atheist authors. In passing I will say that there is nothing more certain to piss off atheists than to threaten them with the ol’ hellfire and brimstone routine. We can always get that kind of stuff by tuning into the Sunday televangelist shows. We don’t need it from a book which supposedly wants to be taken seriously.\n1.  An ad hominum attack says nothing, positive or negative, about an unrelated argument made in its vicinity.  If I correct your math, then call you an idiot, the latter action doesn’t change the fact that I showed your math was wrong.\n2. The characterizations of me on various science blogs have little to do with my presentation and everything to do with the effectiveness of my arguments.  PZ, for example, calls nearly every religious individual to whom he refers stupid.  He very seldom, however, ever attempts to criticize my actual arguments; this is because he’s not capable of doing so.  And he’s arguably the most capable of the aforementioned science bloggers, who are a very lightweight lot when it comes to brainpower.\n3. The book is called\nThe Irrational Atheist\n, an accusation which upsets the average atheist a lot more than any televangelist’s threats of nonexistent hellfire.  Let’s just say that not pissing off atheists wasn’t exactly a priority.  Dawkins and company set the rules, I’m just playing by them.\n2.) NEW ATHEISTS SAY STUPID THINGS\nNow I admit that Harris got a little carried away with his “even a single little girl once in a million years” bit, but can anyone seriously doubt that the remark about 260 million Americans presenting evidence is anything more than a rhetorical flourish? Does the author seriously think that Harris has in mind the opening of evidence processing centers in all 50 states? I doubt that very much. All he’s really saying is that theists assert that God exists so let them show evidence for that position.\nTurning now to page 283 let us now peruse the author’s own pet theory comparing God to a computer game designer (a theory I might add which has the sanction of the majority of Christian theologians around the world – NOT!):\n“Faced with a maliciously corrupted game, the posthuman designer can either turn it off or attempt to fix it. He could simply manually scrub each aspect of the game, but this brute force solution would risk creating new problems and would certainly warn the mischievous interloper. A more elegant solution would be to trap the malicious posthuman and his friends in the game without warning, then insert a viral APC designed to infect other APCs with the ability to resist the malice of the posthuman intruder. His purpose in doing so would be to salvage those APCs whose emergent behavior suits his original plan to develop AIs capable of demonstrating the behaviors required for the real game.”\nYeah, Vox, we’re really with you so far (translation: we have no friggin’ idea what the heck that last paragraph was all about). So yes, Harris, Dawkins, and Hitchens say stupid things in their books from time to time and perhaps quite frequently, but so does Mr. Day and in great plentitude.\n1.  The main point, which seems to have escaped Mr. Marking, is that Harris’s multiple definitions of atheism directly conflict with one another.  The secondary point, which also escapes him, is that theists aren’t obliged to present evidence to anyone to justify their beliefs.  Harris made a rhetorical point, I mocked it in the process of making a better one.\n2.  I pointed out that the Game Designer God concept was not mainstream theology in the book.  Neither I nor anyone else thinks it is anything but a potentially interesting analogy that might help some people get past their theodicy hang-up.\n3.  The fact that Mr. Marking can’t understand a perfectly clear analogy to an MMO is hardly testimony to my predilection for saying stupid things.  Nor is one poor example sufficient evidence of a “great plentitude”.\n3.) A QUESTION OF COMPETENCE\nSo Harris is right in this case – the civilized world does agree that slavery is an abomination. The fact that there still exist criminal organizations which flout international law is not proof that an anti-slavery consensus does not exist….  Vox cannot have it both ways. He cannot claim credit for Christianity abolishing slavery and at the same time claim there is no anti-slavery consensus. It must be one or the other….\n116 centuries? That would mean the first religion, Hinduism, began in 9,600 B.C. or only a few centuries after the last Ice Age ended. I know Hinduism is ancient but is it that ancient? A quick pit stop at Wikipedia confirms my suspicions:\n“Modern Hinduism grew out of the Vedas, the oldest of which is the Rigveda, dated to 1700 – 1100 BCE”\nSo Vox only missed the correct start of Hinduism by about 8 millenia. Of course what he has done is to sum up durations of religions which are concurrent and thus he overcounts the total span of all religions by about 80 centuries. His percentage error is over 200 percent. Harris’ error was about 10 percent. But anyone can make a mistake, right?\n1.  Criminal organizations are part of the civilized world.  They always have been.  Government!=sum total of civilization.  Legality!=morality.\n2.  Abolishment refers to law.  Consensus does not.  The two statements are not in the least bit contradictory.\n3.  “These five religions have approximately 4.85 billion adherents, representing an estimated 71.3 percent of the world’s\npopulation in 2007, and they have been around for a\nCOLLECTIVE\n11,600 years.”  Collective is defined as “Assembled into or viewed as a whole.”  Now, “cumulative” would probably have been a better choice, but even so, the problem isn’t with my math, which is correct, it’s with the fact that Mr. Marking can’t bloody read.\nNow, getting more into the meat of the issue we turn to chapter 3 entitled “The Case Against Science”. Mr. Day points out that it is science itself which threatens the continued survival of mankind and not religion.\np45: “So, in only 3 percent of the time that religion has been on the scene, science has managed to produce multiple threats to continued human existence.”\nBy the way, that 3 percent should be replaced with 9 percent based upon Vox’s previous miscalculation. I actually agree with the author on this point. It is primarily the availability of modern technology produced by science which is the gravest threat to our survival as a species….\nTaking the atomic bomb as an example, according to Mr. Day the sole responsibility for the development of nuclear weapons rests with the scientists themselves. What about the politicians who funded the Manhattan Project, the military people who organized it, and the numerous bureacrats who managed the project? Can they all now escape culpability? Is it only the scientists who are to blame?…\nHate to rain on your parade, Vox, but the 4,000 banned books (most of them scientific or philosophical works) continued to be banned until 1966, not 1753….\nSo lots of ve\niled threats that the Christians and other religious believers will do in the scientists. Given that the scientists in this scenario created the nuclear weapons, know how to use them, and have access to them whereas the religious masses do not, just how does Mr. Day expect this war to end? I would suspect the final score would be something like scientists: 4.85 billion, religious folks: 0.\n1.  Again, there is no miscalculation.  The cumulative sum is both the correct figure and the relevant one for comparison’s sake.\n2.  Yes, it is only the scientists who are to blame for the EXISTENCE of the weapons developed by science, although the RESPONSIBILITY can certainly be shared more broadly, just as I pointed out in the book.  Once more, Mr. Marking’s sloppiness leads him into error.  Does he seriously believe that the aforementioned weapons would still exist if there had been only politicians and bureaucrats to develop them?\n3.  If the Church’s opposition to the novels of Daniel Defoe and Honore de Balzac, (which have been readily available to the public ever since they were first published), is not a crime against science, then what is?\n4.  This is both silly and stupid.  What would be the point of veiled threats to further a war I argue does not even exist?  It’s a simple matter of numbers.  Science can’t win a war against religion; the best it could hope to do is wipe out the entire human race.  The fact that atheists continue to promote this insane idea of inherent conflict tends to go some way towards explaining their bloody historical track record.\nI’ll address the fifth and final point separately, since Mr. Marking has gone to some trouble to attempt to support it in detail.  Rest assured, it’s no more tenable than the previous four.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-27T09:49:00+00:00"
}