{
  "url": "https://voxday.net/2008/04/21/voice-of-people-is-heard/",
  "scraped_at": "2026-01-08T22:20:08.849241",
  "title": "The voice of the people is heard",
  "date_display": "April 21, 2008",
  "date_iso": "2008-04-21T07:55:00+00:00",
  "date_from_url": "2008-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And promptly ignored.  You already knew my opinion of democracy, right?  Anyhow, we’re going with Thucydides and <i>The History of the Peloponnesian War</i>, since my primary purpose in taking the poll was less to pick the book and more to see if there was sufficient interest in the historical classics to bother with this Voxiversity thing.  I elected not to do <i>Human Action</i> despite the almost alarming level of interest in it because I’m already elbow-deep in economics with the podcasts and whatnot.  (By the way, those are henceforth going to be bi-weekly, since the post-interview audio adjustments take too much time.)  Also, I think it would probably be wiser to start out with something more basic if/when we get around to economics.  Mises makes a lot less sense if you don’t know the Keynesianism and Marxism that he is criticizing.  I was a bit surprised that Clausewitz had so much support and that John Julius Norwich and Mr. Shakespeare had so little.  Wilson would be fun, but I didn’t seriously think many would be interested in it.</p><p>So, now you’ve got 12 days to pick up a copy of <i>The History of the Peloponnesian War</i> and read through 1.115.  That’s page 63 in the paperback version of <i><a href=\"http://www.amazon.com/Landmark-Thucydides-Comprehensive-Guide-Peloponnesian/dp/0684827905/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1208764493&amp;sr=8-1\">The Landmark Thucydides</a></i>, which I highly recommend.  It’s only $17, but if you’d rather not spend the money, or would rather spend that $17 <a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1208765383&amp;sr=1-1\">on another book of unquestionable merit</a>, you can simply download <a href=\"http://manybooks.net/titles/thucydidetext04plpwr10.html\">the text in your favorite format, including audiobook, from ManyBooks</a>.  The plain text isn’t marked, so just read down to the point where Sparta and Athens conclude the Thirty Years Peace.</p><p>And yes, there will be a quiz….</p></div>",
  "content_text": "And promptly ignored.  You already knew my opinion of democracy, right?  Anyhow, we’re going with Thucydides and\nThe History of the Peloponnesian War\n, since my primary purpose in taking the poll was less to pick the book and more to see if there was sufficient interest in the historical classics to bother with this Voxiversity thing.  I elected not to do\nHuman Action\ndespite the almost alarming level of interest in it because I’m already elbow-deep in economics with the podcasts and whatnot.  (By the way, those are henceforth going to be bi-weekly, since the post-interview audio adjustments take too much time.)  Also, I think it would probably be wiser to start out with something more basic if/when we get around to economics.  Mises makes a lot less sense if you don’t know the Keynesianism and Marxism that he is criticizing.  I was a bit surprised that Clausewitz had so much support and that John Julius Norwich and Mr. Shakespeare had so little.  Wilson would be fun, but I didn’t seriously think many would be interested in it.\nSo, now you’ve got 12 days to pick up a copy of\nThe History of the Peloponnesian War\nand read through 1.115.  That’s page 63 in the paperback version of\nThe Landmark Thucydides\n, which I highly recommend.  It’s only $17, but if you’d rather not spend the money, or would rather spend that $17\non another book of unquestionable merit\n, you can simply download\nthe text in your favorite format, including audiobook, from ManyBooks\n.  The plain text isn’t marked, so just read down to the point where Sparta and Athens conclude the Thirty Years Peace.\nAnd yes, there will be a quiz….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-21T06:55:00+00:00"
}