{
  "url": "https://voxday.net/2008/04/10/voxonomics-1-4/",
  "scraped_at": "2026-01-08T22:19:04.696045",
  "title": "Voxonomics 1-4",
  "date_display": "April 10, 2008",
  "date_iso": "2008-04-10T00:00:00+00:00",
  "date_from_url": "2008-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sorry about the quality of this week’s podcast as we were experiencing some interference with the phone lines.  But I think the content will more than make up for this, since I’m speaking with an international figure from the global financial industry with whom I have been acquainted for a long time.  Passport, as we shall call him, is a highly intelligent and astoundingly successful individual, and I was delighted that he was willing to be interviewed for <a href=\"http://www.voxday.net/tox/voxonomics_1-4.mp3\">the fourth Voxonomics podcast</a>.</p><p><i>Recommended Reading:</i><br><a href=\"http://www.shadowstats.com/article/56\"><br>The Consumer Price Index</br></a></br></p><p>This article is not written by Passport, but is a pretty good summary of what he was talking about.  Shadowstats recalculates the economic statistics according to previous government methodologies to provide apples-to-apples historical data.  This <a href=\"http://www.shadowstats.com/article/20\">2005 newsletter</a>, (scroll down to the CPI section), shows the process in progress.</p></div>",
  "content_text": "I’m sorry about the quality of this week’s podcast as we were experiencing some interference with the phone lines.  But I think the content will more than make up for this, since I’m speaking with an international figure from the global financial industry with whom I have been acquainted for a long time.  Passport, as we shall call him, is a highly intelligent and astoundingly successful individual, and I was delighted that he was willing to be interviewed for\nthe fourth Voxonomics podcast\n.\nRecommended Reading:\nThe Consumer Price Index\nThis article is not written by Passport, but is a pretty good summary of what he was talking about.  Shadowstats recalculates the economic statistics according to previous government methodologies to provide apples-to-apples historical data.  This\n2005 newsletter\n, (scroll down to the CPI section), shows the process in progress.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-09T23:00:00+00:00"
}