{
  "url": "https://voxday.net/2008/04/04/world-it-changes/",
  "scraped_at": "2026-01-08T22:18:16.832361",
  "title": "The world, it changes",
  "date_display": "April 4, 2008",
  "date_iso": "2008-04-04T08:19:00+00:00",
  "date_from_url": "2008-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://online.wsj.com/article/SB120723631543086595.html?mod=googlenews_wsj\">it’s about time</a>:</p><blockquote><p>Marking a radical departure from traditional book-publishing practices, HarperCollins Publishers says it will launch a new book imprint that won’t accept returns from retailers and will pay little or no advances to authors.</p></blockquote><p>I’m excited about this, because it will give newer authors more of a fair shake.  One thing that I’ve always hated about the conventional publishing model is that a publishing company tends to put its efforts behind those books that it gave the biggest advance rather than the ones that have the greatest sales potential.  This tends to cause the inexpensive book with potential to disappear without a trace – since no one has ever heard of it – without doing much for to aid the success of the more expensive one.  Back when The World in Shadow was published, Pocket Books put a major effort behind a really bad series of foreign novels to which they had acquired the American rights while putting no effort behind my book or the book of another insigificant author.</p><p>The foreign series flopped despite an expensive marketing campaign which included endcaps in every Barnes and Noble, while my book sold just well enough for them to sign me to another book in the series.  The other guy’s book didn’t, which is why Pocket Books didn’t publish his next one, a book that just happened to be entitled <i>The DaVinci Code</i>.</p><p>The publishing model is simply broken, so it’s good to see that publishing companies are exploring more rational new options.  And on that score, some congratulations are in order, as The Original Cyberpunk and his wife have announced their new endeavor, <a href=\"http://rantingroom.blogspot.com/2008/04/lessons-learned.html\">Rampant Loon Press</a>.</p></div>",
  "content_text": "And\nit’s about time\n:\nMarking a radical departure from traditional book-publishing practices, HarperCollins Publishers says it will launch a new book imprint that won’t accept returns from retailers and will pay little or no advances to authors.\nI’m excited about this, because it will give newer authors more of a fair shake.  One thing that I’ve always hated about the conventional publishing model is that a publishing company tends to put its efforts behind those books that it gave the biggest advance rather than the ones that have the greatest sales potential.  This tends to cause the inexpensive book with potential to disappear without a trace – since no one has ever heard of it – without doing much for to aid the success of the more expensive one.  Back when The World in Shadow was published, Pocket Books put a major effort behind a really bad series of foreign novels to which they had acquired the American rights while putting no effort behind my book or the book of another insigificant author.\nThe foreign series flopped despite an expensive marketing campaign which included endcaps in every Barnes and Noble, while my book sold just well enough for them to sign me to another book in the series.  The other guy’s book didn’t, which is why Pocket Books didn’t publish his next one, a book that just happened to be entitled\nThe DaVinci Code\n.\nThe publishing model is simply broken, so it’s good to see that publishing companies are exploring more rational new options.  And on that score, some congratulations are in order, as The Original Cyberpunk and his wife have announced their new endeavor,\nRampant Loon Press\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-04-04T07:19:00+00:00"
}