{
  "url": "https://voxday.net/2017/06/29/alt-retard-wants-rematc/",
  "scraped_at": "2025-12-18T07:20:21.058718",
  "title": "Alt-Retard wants a rematch",
  "date_display": "June 29, 2017",
  "date_iso": "2017-06-29T11:50:00+00:00",
  "date_from_url": "2017-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> Supreme Dark Lord‏ @voxday<br> White Nationalist fantasies notwithstanding, Europeans no more identify as Europeans than white Americans identify as European-Americans.</br></p><p>Brian Ninetails‏ @BrianNinetails<br> Once a goon always a goon amirite?</br></p><p>Brian Ninetails‏ @BrianNinetails<br> I’ll make sure we shit on you artistically, you just made the list</br></p><p>Supreme Dark Lord‏ @voxday<br> Bring it on. The last time Alt-Retard tried to bring it, they backed down in 12 hours. The VFM will eat you alive. And facts are facts.</br></p><p>Brian Ninetails‏ @BrianNinetails<br> Capped</br></p><p>Supreme Dark Lord‏ @voxday<br> No need. I’ll put this right there on my blog and it will stay there. Including the part where your friends beg me to call them off.</br></p></blockquote><p>We have had a successful ceasefire with the Alt-White for a while now. Apparently it is off as far as this Brian Ninetails is concerned, whoever he is. Because I am kind, you may consider him a snack. The leashes are off. But leave everyone else out of it, until we see which way they decide to jump or if they have the sense to leave him to his fate.</p><p>Have fun.</p></div>",
  "content_text": "Supreme Dark Lord‏ @voxday\nWhite Nationalist fantasies notwithstanding, Europeans no more identify as Europeans than white Americans identify as European-Americans.\nBrian Ninetails‏ @BrianNinetails\nOnce a goon always a goon amirite?\nBrian Ninetails‏ @BrianNinetails\nI’ll make sure we shit on you artistically, you just made the list\nSupreme Dark Lord‏ @voxday\nBring it on. The last time Alt-Retard tried to bring it, they backed down in 12 hours. The VFM will eat you alive. And facts are facts.\nBrian Ninetails‏ @BrianNinetails\nCapped\nSupreme Dark Lord‏ @voxday\nNo need. I’ll put this right there on my blog and it will stay there. Including the part where your friends beg me to call them off.\nWe have had a successful ceasefire with the Alt-White for a while now. Apparently it is off as far as this Brian Ninetails is concerned, whoever he is. Because I am kind, you may consider him a snack. The leashes are off. But leave everyone else out of it, until we see which way they decide to jump or if they have the sense to leave him to his fate.\nHave fun.",
  "tags": [
    "#AltRetard",
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-29T10:50:00+00:00"
}