{
  "url": "https://voxday.net/2017/06/01/alt-right-is-inevitable/",
  "scraped_at": "2025-12-18T07:16:26.173858",
  "title": "Alt-Right is inevitable",
  "date_display": "June 1, 2017",
  "date_iso": "2017-06-01T07:22:00+00:00",
  "date_from_url": "2017-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A cuckservative finally realizes that <a href=\"http://ace.mu.nu/archives/369999.php\">moral posturing is no substitute</a> for fighting back:</p><blockquote><p> If you’re in a fight with someone, and you never do anything but parry blows and dodge, you can at least hope for him to tire himself out.</p><p>But he’ll have regained his endurance by the next morning. And, as he actually enjoys just throwing blows at you, and you’ve done nothing to convince him this is a counterproductive idea — he will be back.</p><p>If you never actually hit him right the fuck back — when is he ever going to learn that fighting is not a good idea?</p><p>Many of us — and I blame myself here — have been pushing an idea of unilateral disarmament in this arena, hoping they would just learn how awful and venomous they are.</p><p>But they don’t. I think they take a rather different lesson from our passive resistance than the one they intended.</p><p>We intended that by passively resisting, they would see us as showing moral courage and would learn from us that ceaseless violence and bullying and collectivized political campaigns run against everyday citizens pursuing no public office are wrong.</p><p>But they didn’t learn that.</p><p>What our self-restraint has taught them is quite the opposite–when we refuse to fight back, they take that as signalling that deep down, we know they’re right and that we are the monsters, and thus, our refusal to engage them in the fight they’ve started does not prove our moral rightness, but instead our moral corruption.</p></blockquote><p>These people would have saved themselves a lot of time and frustration by simply reading SJWAL. And it’s going to take them more time, and more SJW lunacy, before they actually start fighting. Even in this post, Ace feels the need to virtue-signal about how <i>he doesn’t want to fight</i>, and he laments discovering that it is necessary to do so.</p><p>He shouldn’t. The Alt-Right <i>enjoys </i>the conflict. We love it when they hand us yet another excuse for a reprisal. We are the happiest of warriors and we like nothing better than to see our enemies in full, panicked flight before us.</p><p>The Alt-Right is inevitable because everyone who doesn’t join it will have submitted to the social justice Left. And not every cuck and con and libertarian and liberal is willing to do that. We’re not going to convince them. The SJWs are, because they’re certainly not going to stop on their own.</p></div>",
  "content_text": "A cuckservative finally realizes that\nmoral posturing is no substitute\nfor fighting back:\nIf you’re in a fight with someone, and you never do anything but parry blows and dodge, you can at least hope for him to tire himself out.\nBut he’ll have regained his endurance by the next morning. And, as he actually enjoys just throwing blows at you, and you’ve done nothing to convince him this is a counterproductive idea — he will be back.\nIf you never actually hit him right the fuck back — when is he ever going to learn that fighting is not a good idea?\nMany of us — and I blame myself here — have been pushing an idea of unilateral disarmament in this arena, hoping they would just learn how awful and venomous they are.\nBut they don’t. I think they take a rather different lesson from our passive resistance than the one they intended.\nWe intended that by passively resisting, they would see us as showing moral courage and would learn from us that ceaseless violence and bullying and collectivized political campaigns run against everyday citizens pursuing no public office are wrong.\nBut they didn’t learn that.\nWhat our self-restraint has taught them is quite the opposite–when we refuse to fight back, they take that as signalling that deep down, we know they’re right and that we are the monsters, and thus, our refusal to engage them in the fight they’ve started does not prove our moral rightness, but instead our moral corruption.\nThese people would have saved themselves a lot of time and frustration by simply reading SJWAL. And it’s going to take them more time, and more SJW lunacy, before they actually start fighting. Even in this post, Ace feels the need to virtue-signal about how\nhe doesn’t want to fight\n, and he laments discovering that it is necessary to do so.\nHe shouldn’t. The Alt-Right\nenjoys\nthe conflict. We love it when they hand us yet another excuse for a reprisal. We are the happiest of warriors and we like nothing better than to see our enemies in full, panicked flight before us.\nThe Alt-Right is inevitable because everyone who doesn’t join it will have submitted to the social justice Left. And not every cuck and con and libertarian and liberal is willing to do that. We’re not going to convince them. The SJWs are, because they’re certainly not going to stop on their own.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-01T06:22:00+00:00"
}