{
  "url": "https://voxday.net/2017/06/02/alt-retard-economics/",
  "scraped_at": "2025-12-18T07:16:37.178596",
  "title": "Alt-Retard economics",
  "date_display": "June 2, 2017",
  "date_iso": "2017-06-02T12:14:00+00:00",
  "date_from_url": "2017-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Having seen and heard a few economically illiterate morons pop up and advocate NATIONAL SOCIALISM as some sort of answer to globalism and free trade, I decided that I would take the five minutes required to demonstrate that national socialism is A) not a coherent economic theory or program, B) not a viable economic system, and C) structurally doomed to fail even faster than the current US system is today.</p><p><b>A) National socialism is not a coherent economic theory.</b></p><p>“The basic feature of our economic theory is that we have no theory at all.”<br> – Adolf Hitler</br></p><p><b>B) National socialism is not a viable economic practice.</b></p><p>USA 6-year budget deficit to revenue, 2010-2016<br> 26.8 percent</br></p><p>National Socialist Germany 6-year budget deficit to revenue, 1933-1939<br> 62.9 percent</br></p><p><b>C) National Socialism was structurally doomed to fail even faster than the current US system is today.</b></p><p>Both the current US system and the historical Nazi systems were dependent upon credit booms. But the Nazi debt-spending was <i>135 percent worse</i> than the USA’s insanely profligate ways. The ad hoc National Socialist economics meant that the Nazis either had to surrender to the bankers on whom they had declared metaphorical war or engage in material imperialist war to acquire the resources to pay off their rapidly growing debts.</p><p>Anyone who advocates national socialism as an economic solution is either totally ignorant or literally retarded. It is even less credible than libertarianism, free trade, or globalism. Frankly, to call it “retarded” is probably a little too generous.</p></div>",
  "content_text": "Having seen and heard a few economically illiterate morons pop up and advocate NATIONAL SOCIALISM as some sort of answer to globalism and free trade, I decided that I would take the five minutes required to demonstrate that national socialism is A) not a coherent economic theory or program, B) not a viable economic system, and C) structurally doomed to fail even faster than the current US system is today.\nA) National socialism is not a coherent economic theory.\n“The basic feature of our economic theory is that we have no theory at all.”\n– Adolf Hitler\nB) National socialism is not a viable economic practice.\nUSA 6-year budget deficit to revenue, 2010-2016\n26.8 percent\nNational Socialist Germany 6-year budget deficit to revenue, 1933-1939\n62.9 percent\nC) National Socialism was structurally doomed to fail even faster than the current US system is today.\nBoth the current US system and the historical Nazi systems were dependent upon credit booms. But the Nazi debt-spending was\n135 percent worse\nthan the USA’s insanely profligate ways. The ad hoc National Socialist economics meant that the Nazis either had to surrender to the bankers on whom they had declared metaphorical war or engage in material imperialist war to acquire the resources to pay off their rapidly growing debts.\nAnyone who advocates national socialism as an economic solution is either totally ignorant or literally retarded. It is even less credible than libertarianism, free trade, or globalism. Frankly, to call it “retarded” is probably a little too generous.",
  "tags": [
    "#AltRetard",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-02T11:14:00+00:00"
}