{
  "url": "https://voxday.net/2017/06/12/boomercide/",
  "scraped_at": "2025-12-18T07:17:51.552558",
  "title": "Boomercide",
  "date_display": "June 12, 2017",
  "date_iso": "2017-06-12T08:29:00+00:00",
  "date_from_url": "2017-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Zman has a few ideas concerning <a href=\"http://thezman.com/wordpress/?p=10514\">why their grandchildren hate the Boomers</a>:</p><blockquote><p> I’ve never cared for generational politics so maybe that’s why I have no trouble with the younger generation. In my youth, I was forced to sit through endless lectures by Baby Boomer teachers about how Generation X was a bunch of slackers. By the time I reached high school, I could, from memory, draw maps of the Ho Chi Min Trail and recite the playlist at Woodstock, despite having no interest in either. I’ve always thought that my generation’s disinterest was due to having to sit through so many Boomer sermons.</p><p>If you are a Boomer reading this, you are no doubt outraged, scandalized and offended at my comments. Just to be clear, I’m not talking about you. You are an exception. In fact, you are unique, like a snowflake, a special creation that stands in stark contrast to the conformity of your coevals. You’re special! That’s always been the amusing part about Boomer culture. They love talking about themselves, but hate it when others talk about them….</p><p>Anyway, hanging around the bad kids on-line, I’ve noted their extreme hostility to Baby Boomers and Boomer politics. It’s not the normal youthful rejection of their parent’s stuff as their parents are not Boomers. In the case of the 20-somethings, their parents are my generation. Their grandparents are the Boomers. This means the so-called Gen-Z and Millennials literally want to push granny off a cliff. I’ve read screeds by youngsters to that effect. They really hate the Boomers and not in an abstract way.</p><p>The coming Boomercide, if it happens, is going to be triggered by some portly old guys in comfort waist slacks, showing up at an alt-right rally wearing tricorne hats, preaching “heritage not hate.” It is the Boomer impulse to accept the morality of the Left while pretending to reject the consequence of it, that enrages the youth. Whatever you want to say about the alt-right kids, they have this one thing right. Boomer politics is all about the so-called conservatives swearing that the liberals are the real racists, as if it matters.</p></blockquote><p>We know why Generation X hates the Boomers. We’ve had to listen to variations of their “70 is the new 50” narcissism all our lives and endure their babbling about how their inferior, mush-sounding, crudely recorded analog music played by inept musicians with rudimentary technique is the greatest music created in human history. (I’m not arguing for A Flock of Seagulls here, I’m merely pointing out that neither the Beatles nor Led Zeppelin have anything on Mozart and Vivaldi.)</p><p>But that’s not why the younger generations hate them. First, I’ve noticed that the Baby Boomers, on average, absolutely suck as grandparents. Most kids I knew growing up knew their grandparents well and spent loads of time with them. As for me, I was closer to my maternal grandparents than anyone else in my extended family; I still miss them greatly today. But I am amazed to observe how little time many grandparents now want to spend with their grandkids.</p><p>Second, I think that the younger generations, growing up in harder times and facing a much more challenging future, are angry at the Baby Boomers for squandering what should have been their inheritance of Western civilization and white America. Even though it’s not necessarily their fault – Baby Boomers were not responsible for the Immigration Act of 1965 or the Civil Rights movement or the Great Society – the Baby Boomers supported, and in most cases, <i>still support</i> those terrible, dyscivilizational catastrophes. As one commenter there noted, <i>Boomers are the r-Selected offspring of WWII rabbits, “You’ll never want for anything like I did!”</i></p><p>Third, the Baby Boomers grew up in an idyllic white Norman Rockwell picture. That alone is sufficient for the growing and statistically significant non-white minority among the younger generations to hate them.</p><p>But a GenXer should not speak for the succeeding generations. Those are merely my suspicions. If you are younger than Generation X, then speak for yourself. Do you admire or loathe the Baby Boomers? Do you wish to emulate them and embrace their ideals or reject them and all their works? Do you share GenX’s cynicism or do you consider us to be overly pessimistic? Speak for yourself.</p><p>And if you are a Baby Boomer, do your best to restrain your urge to inform everyone how they really feel about your generation. I’m not asking you how you feel about it, and remember, the Zman has already acknowledged that you are a special snowflake, rare if not unique among your g-g-generation. I’m not asking the Gen Xers either, as we already know their opinions on the matter. And let me say as well that I am perfectly aware that macro is not micro and I personally admire those Baby Boomers who somehow managed to cast off the disastrous spirit of their g-g-generation. For example, I think this Boomer has a perceptive take on the situation.</p><blockquote><p> Our poor decisions as Boomers and those of our parents (Silents voted for the folks who put the 1965 immigration act into effect) obliterated them. So it’s no longer worth kvetching about “the youth,” in the same way that these young whites can complain about “the boomers.” The boomers are 90%+ white Americans with several generations of history and tradition, just like their parents. “The youth,” in the America of today are nearing a Mestizo plurality and the shrinking white youth cohort is now politically eclipsed by every other stripe in the liberal rainbow.</p><p>Isolating the white youth, I’d say they’re about as good of stock as we ever had. Trouble is, we left them to institutions that were obviously out to destroy them, fill their heads with madness, and let their non-white peers batter them into submission. And somehow by no fault of our own a whole bunch of them have founded the alt-right and got a serious reactionary movement going.</p><p>It’s no small feat what the young white men of today have accomplished. Personally, I think it’s time to lend a hand rather than punch down. We earned the licks we’re getting. So far as I’m concerned, the right-wing youth can pillory us all day.</p></blockquote><p>That, I think, is the important point. Even now, it’s still not too late for Baby Boomers to throw what is left of the weight of their generational cohort to help their grandchildren and great-grandchildren rather than hinder them.</p><p>UPDATE: Boomer narcissism in action.</p><blockquote><p> Real phone call with my Boomer Mom:</p><p>ME: Had a friend commit suicide &amp; another die of cancer</p><p>BM: Oh that’s too bad… we just bought an RV!</p></blockquote></div>",
  "content_text": "The Zman has a few ideas concerning\nwhy their grandchildren hate the Boomers\n:\nI’ve never cared for generational politics so maybe that’s why I have no trouble with the younger generation. In my youth, I was forced to sit through endless lectures by Baby Boomer teachers about how Generation X was a bunch of slackers. By the time I reached high school, I could, from memory, draw maps of the Ho Chi Min Trail and recite the playlist at Woodstock, despite having no interest in either. I’ve always thought that my generation’s disinterest was due to having to sit through so many Boomer sermons.\nIf you are a Boomer reading this, you are no doubt outraged, scandalized and offended at my comments. Just to be clear, I’m not talking about you. You are an exception. In fact, you are unique, like a snowflake, a special creation that stands in stark contrast to the conformity of your coevals. You’re special! That’s always been the amusing part about Boomer culture. They love talking about themselves, but hate it when others talk about them….\nAnyway, hanging around the bad kids on-line, I’ve noted their extreme hostility to Baby Boomers and Boomer politics. It’s not the normal youthful rejection of their parent’s stuff as their parents are not Boomers. In the case of the 20-somethings, their parents are my generation. Their grandparents are the Boomers. This means the so-called Gen-Z and Millennials literally want to push granny off a cliff. I’ve read screeds by youngsters to that effect. They really hate the Boomers and not in an abstract way.\nThe coming Boomercide, if it happens, is going to be triggered by some portly old guys in comfort waist slacks, showing up at an alt-right rally wearing tricorne hats, preaching “heritage not hate.” It is the Boomer impulse to accept the morality of the Left while pretending to reject the consequence of it, that enrages the youth. Whatever you want to say about the alt-right kids, they have this one thing right. Boomer politics is all about the so-called conservatives swearing that the liberals are the real racists, as if it matters.\nWe know why Generation X hates the Boomers. We’ve had to listen to variations of their “70 is the new 50” narcissism all our lives and endure their babbling about how their inferior, mush-sounding, crudely recorded analog music played by inept musicians with rudimentary technique is the greatest music created in human history. (I’m not arguing for A Flock of Seagulls here, I’m merely pointing out that neither the Beatles nor Led Zeppelin have anything on Mozart and Vivaldi.)\nBut that’s not why the younger generations hate them. First, I’ve noticed that the Baby Boomers, on average, absolutely suck as grandparents. Most kids I knew growing up knew their grandparents well and spent loads of time with them. As for me, I was closer to my maternal grandparents than anyone else in my extended family; I still miss them greatly today. But I am amazed to observe how little time many grandparents now want to spend with their grandkids.\nSecond, I think that the younger generations, growing up in harder times and facing a much more challenging future, are angry at the Baby Boomers for squandering what should have been their inheritance of Western civilization and white America. Even though it’s not necessarily their fault – Baby Boomers were not responsible for the Immigration Act of 1965 or the Civil Rights movement or the Great Society – the Baby Boomers supported, and in most cases,\nstill support\nthose terrible, dyscivilizational catastrophes. As one commenter there noted,\nBoomers are the r-Selected offspring of WWII rabbits, “You’ll never want for anything like I did!”\nThird, the Baby Boomers grew up in an idyllic white Norman Rockwell picture. That alone is sufficient for the growing and statistically significant non-white minority among the younger generations to hate them.\nBut a GenXer should not speak for the succeeding generations. Those are merely my suspicions. If you are younger than Generation X, then speak for yourself. Do you admire or loathe the Baby Boomers? Do you wish to emulate them and embrace their ideals or reject them and all their works? Do you share GenX’s cynicism or do you consider us to be overly pessimistic? Speak for yourself.\nAnd if you are a Baby Boomer, do your best to restrain your urge to inform everyone how they really feel about your generation. I’m not asking you how you feel about it, and remember, the Zman has already acknowledged that you are a special snowflake, rare if not unique among your g-g-generation. I’m not asking the Gen Xers either, as we already know their opinions on the matter. And let me say as well that I am perfectly aware that macro is not micro and I personally admire those Baby Boomers who somehow managed to cast off the disastrous spirit of their g-g-generation. For example, I think this Boomer has a perceptive take on the situation.\nOur poor decisions as Boomers and those of our parents (Silents voted for the folks who put the 1965 immigration act into effect) obliterated them. So it’s no longer worth kvetching about “the youth,” in the same way that these young whites can complain about “the boomers.” The boomers are 90%+ white Americans with several generations of history and tradition, just like their parents. “The youth,” in the America of today are nearing a Mestizo plurality and the shrinking white youth cohort is now politically eclipsed by every other stripe in the liberal rainbow.\nIsolating the white youth, I’d say they’re about as good of stock as we ever had. Trouble is, we left them to institutions that were obviously out to destroy them, fill their heads with madness, and let their non-white peers batter them into submission. And somehow by no fault of our own a whole bunch of them have founded the alt-right and got a serious reactionary movement going.\nIt’s no small feat what the young white men of today have accomplished. Personally, I think it’s time to lend a hand rather than punch down. We earned the licks we’re getting. So far as I’m concerned, the right-wing youth can pillory us all day.\nThat, I think, is the important point. Even now, it’s still not too late for Baby Boomers to throw what is left of the weight of their generational cohort to help their grandchildren and great-grandchildren rather than hinder them.\nUPDATE: Boomer narcissism in action.\nReal phone call with my Boomer Mom:\nME: Had a friend commit suicide & another die of cancer\nBM: Oh that’s too bad… we just bought an RV!",
  "tags": [
    "Baby Boomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-12T07:29:00+00:00"
}