{
  "url": "https://voxday.net/2017/06/12/crisis-conceit-review/",
  "scraped_at": "2025-12-18T07:17:50.036776",
  "title": "Crisis & Conceit: a review",
  "date_display": "June 12, 2017",
  "date_iso": "2017-06-12T00:00:00+00:00",
  "date_from_url": "2017-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The first review of <a href=\"http://amzn.to/2sHz63I\">Volume II of my collected columns</a>:</p><blockquote><p> <b><a href=\"https://www.amazon.com/gp/customer-reviews/R13C6PPFUPLH5G/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&amp;ASIN=B072JRQT4H\">Great read from a gifted writer</a></b></p><p>As stated in the description, this book is a collection of Vox Day’s published articles from 2006 – 2009, a time of immense changes in the political and economic landscape. This collection is historic and will make some future thesis writer extremely happy with a progression of articles that week by week chronicles the changing face of America and the World, with a lens that addresses religion, politics, soccer, NATO and, most tellingly, economic forces. There he is, in black and white, foretelling the meltdown of world markets.</p><p>It may be that his greatest strength is his well versed long view of history. He has the knowledge of the past and the flexibility to apply that learning to the issues of the present. There is a great depth of understanding of macro and micro movers across many civilizations that adds a welcome sense of gravitas to his writing.</p><p>His opinion of George W. Bush is not flattering to President Bush, but in hindsight, I believe Vox Day’s opinion is painfully accurate. A disappointed libertarian at heart, his view of the 2008 election over the course of the year is a prolonged scream against what most of us did not see coming. His disdain for John McCain as a candidate is almost as venomous as his disdain for Hillary, whom he refers to as The Lizard Queen. The articles also cover other candidates, including some things I had not heard about Obama, but were about rumors swirling around Obama that were not being covered or investigated by the media (February 25, 2007!). I was shocked to realize that the Obama cover-ups started so early.</p><p>His articles also foretell the the immigration issues that about to engulf the entire world in a few short years.</p></blockquote><p>An excerpt:</p><p><b>Rainbow mutations</b><br> March 27, 2006</br></p><p>What does the shape of a Minneapolis stripper’s naked bottom have in common with a landmark of English finance? And how is it possible that the color of the roadside prostitutes in Italy can harbor any implications for the ability of a New York woman to stay home with her children? The point of commonality, as it happens, is historical patterns of migration.</p><p>In 1990, Umberto Eco wrote an article titled “Migrazioni”, which was published in L’Espresso. In that essay, he presciently noted that what Europe was undergoing at that time was not a phenomenon of immigration, but of migration. The difference is significant and one of degree—an individual can immigrate or emigrate, but only a people migrate.</p><p>Eco observed that migrations result in inexorable changes to the region of destination, changes to the normal form of dress as well as changes to the color of skin, eyes and hair. A secular humanist in good standing, he adroitly avoids committing the grand faux pas of criticizing this hybridization, fatalistically accepting the inevitability of a new Afro-European culture. For to even hint at criticism would, of course, be crude racist ethnocentrism of the first degree, and not even the reputation of one of the world’s leading intellectuals could survive accusations of that.</p><p>But what the great <i>dottore </i>mentions only in passing, and what the defenders of the diversity faith avoid discussing like sorority girls pretending not to hear a bulimic sister purging her caloric sins in the neighboring stall, is that changes to the political culture as well as the physical mean are likewise unavoidable. For 40 years, the people of nations such as Denmark, France, Germany, the Netherlands and the United Kingdom believed it was possible to bring Muslim immigrants into their countries in order to replace their declining workforces. They believed their governing elite’s assurances that prolonged exposure to the French or English way of life would suffice to turn these immigrants into ersatz Frenchmen or Englishmen.</p><p>What they did not realize was that their governments were not permitting immigration, but were instead inspiring a mass migration. Now, there are demands for Sharia in the land which once mobilized against a Catholic armada, the French are showing signs of wishing to revive Maurice Papon’s practice of baptizing Algerians in the Seine and even the notoriously tolerant Dutch are beginning to question the once-sacrosanct notion that all cultures are created equal.</p><p>While in the United States, Islam is still an issue of immigration, not migration, this does not mean that Americans are not facing their own migrational challenge. With the importation of 30 million immigrants of varying degrees of legality in the last 35 years, most from Spanish-speaking countries that have never known individual liberty or free markets, combined with 34 million native women listening to the siren song of feminism and putting family life on the back burner, the probability that America will be able to retain its unique political identity and the tattered remnants of its Constitution are rapidly decreasing.</p><p>For example, the vast majority of native-born Americans of African and European descent consider the notion of a supranational American Union with Canada, Mexico and various Central American countries to be unthinkable and would oppose it if they recognized it to be the natural progression from NAFTA and the FTAA. But is the same true of the growing Spanish-speaking population across the Southwest, an outspoken segment of which is already calling for closer ties with Mexico? As recent events in Afghanistan and the Palestinian Authority have demonstrated to all and sundry, democratic institutions are not capable, by themselves, of moderating ideology, religion or cultural identification.</p><p>It is unlikely that Europe can solve its demographic problems without violence—Eco seems uncharacteristically untroubled when he notes that periods of mass migrations are not known for being peaceful—but it is not necessarily too late for the United States. The answer is simple, but it will require inspired leadership that is conspicuously lacking today. If America is to remain America, sovereign, liberal and free, then her people must completely turn away from the ideologies of multiculturalism, immigrationism and feminism. If they do not—and continue on the present path—she will not be sovereign, liberal or free within four decades.</p><p>This country, like her Old World progenitors, stands on the brink of precipitate change. In embracing the rainbow, America has been engulfed in its lethally mutating rays and the resulting cancer will surely kill her if it is not removed in the near future.</p></div>",
  "content_text": "The first review of\nVolume II of my collected columns\n:\nGreat read from a gifted writer\nAs stated in the description, this book is a collection of Vox Day’s published articles from 2006 – 2009, a time of immense changes in the political and economic landscape. This collection is historic and will make some future thesis writer extremely happy with a progression of articles that week by week chronicles the changing face of America and the World, with a lens that addresses religion, politics, soccer, NATO and, most tellingly, economic forces. There he is, in black and white, foretelling the meltdown of world markets.\nIt may be that his greatest strength is his well versed long view of history. He has the knowledge of the past and the flexibility to apply that learning to the issues of the present. There is a great depth of understanding of macro and micro movers across many civilizations that adds a welcome sense of gravitas to his writing.\nHis opinion of George W. Bush is not flattering to President Bush, but in hindsight, I believe Vox Day’s opinion is painfully accurate. A disappointed libertarian at heart, his view of the 2008 election over the course of the year is a prolonged scream against what most of us did not see coming. His disdain for John McCain as a candidate is almost as venomous as his disdain for Hillary, whom he refers to as The Lizard Queen. The articles also cover other candidates, including some things I had not heard about Obama, but were about rumors swirling around Obama that were not being covered or investigated by the media (February 25, 2007!). I was shocked to realize that the Obama cover-ups started so early.\nHis articles also foretell the the immigration issues that about to engulf the entire world in a few short years.\nAn excerpt:\nRainbow mutations\nMarch 27, 2006\nWhat does the shape of a Minneapolis stripper’s naked bottom have in common with a landmark of English finance? And how is it possible that the color of the roadside prostitutes in Italy can harbor any implications for the ability of a New York woman to stay home with her children? The point of commonality, as it happens, is historical patterns of migration.\nIn 1990, Umberto Eco wrote an article titled “Migrazioni”, which was published in L’Espresso. In that essay, he presciently noted that what Europe was undergoing at that time was not a phenomenon of immigration, but of migration. The difference is significant and one of degree—an individual can immigrate or emigrate, but only a people migrate.\nEco observed that migrations result in inexorable changes to the region of destination, changes to the normal form of dress as well as changes to the color of skin, eyes and hair. A secular humanist in good standing, he adroitly avoids committing the grand faux pas of criticizing this hybridization, fatalistically accepting the inevitability of a new Afro-European culture. For to even hint at criticism would, of course, be crude racist ethnocentrism of the first degree, and not even the reputation of one of the world’s leading intellectuals could survive accusations of that.\nBut what the great\ndottore\nmentions only in passing, and what the defenders of the diversity faith avoid discussing like sorority girls pretending not to hear a bulimic sister purging her caloric sins in the neighboring stall, is that changes to the political culture as well as the physical mean are likewise unavoidable. For 40 years, the people of nations such as Denmark, France, Germany, the Netherlands and the United Kingdom believed it was possible to bring Muslim immigrants into their countries in order to replace their declining workforces. They believed their governing elite’s assurances that prolonged exposure to the French or English way of life would suffice to turn these immigrants into ersatz Frenchmen or Englishmen.\nWhat they did not realize was that their governments were not permitting immigration, but were instead inspiring a mass migration. Now, there are demands for Sharia in the land which once mobilized against a Catholic armada, the French are showing signs of wishing to revive Maurice Papon’s practice of baptizing Algerians in the Seine and even the notoriously tolerant Dutch are beginning to question the once-sacrosanct notion that all cultures are created equal.\nWhile in the United States, Islam is still an issue of immigration, not migration, this does not mean that Americans are not facing their own migrational challenge. With the importation of 30 million immigrants of varying degrees of legality in the last 35 years, most from Spanish-speaking countries that have never known individual liberty or free markets, combined with 34 million native women listening to the siren song of feminism and putting family life on the back burner, the probability that America will be able to retain its unique political identity and the tattered remnants of its Constitution are rapidly decreasing.\nFor example, the vast majority of native-born Americans of African and European descent consider the notion of a supranational American Union with Canada, Mexico and various Central American countries to be unthinkable and would oppose it if they recognized it to be the natural progression from NAFTA and the FTAA. But is the same true of the growing Spanish-speaking population across the Southwest, an outspoken segment of which is already calling for closer ties with Mexico? As recent events in Afghanistan and the Palestinian Authority have demonstrated to all and sundry, democratic institutions are not capable, by themselves, of moderating ideology, religion or cultural identification.\nIt is unlikely that Europe can solve its demographic problems without violence—Eco seems uncharacteristically untroubled when he notes that periods of mass migrations are not known for being peaceful—but it is not necessarily too late for the United States. The answer is simple, but it will require inspired leadership that is conspicuously lacking today. If America is to remain America, sovereign, liberal and free, then her people must completely turn away from the ideologies of multiculturalism, immigrationism and feminism. If they do not—and continue on the present path—she will not be sovereign, liberal or free within four decades.\nThis country, like her Old World progenitors, stands on the brink of precipitate change. In embracing the rainbow, America has been engulfed in its lethally mutating rays and the resulting cancer will surely kill her if it is not removed in the near future.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-11T23:00:00+00:00"
}