{
  "url": "https://voxday.net/2017/06/01/darkstream-why-communism-is-better-than/",
  "scraped_at": "2025-12-18T07:16:23.919969",
  "title": "Darkstream: why Communism is better than free markets",
  "date_display": "June 1, 2017",
  "date_iso": "2017-06-01T00:30:00+00:00",
  "date_from_url": "2017-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.periscope.tv/voxday/1PlKQAAqYwBKE\">This one should amuse the VFM</a>. I sort of lost my patience with the midwits and binary thinkers who think that the correct way to respond to someone saying something original is to quote conventional boilerplate of the sort that anyone who is even half-educated already knows. Anyhow, it should also interest those of an economic bent, as in the course of explaining the observation that Communism is better for a nation in the long-term than liberal democratic capitalism, (the what, if you will) I was able to explain the economic reasons <i>why </i>that always had to be the case.</p><p>This doesn’t mean that socialism isn’t economically retarded; it is. But it is that very retardation that tends to protect a nation from the ravages of the global free markets. And if you’re tempted to respond that the global markets aren’t truly free, well, watch the Darkstream first.</p><p>It might help to remember the fact that X being better than Y does not mean that X is either good or desirable in itself.</p></div>",
  "content_text": "This one should amuse the VFM\n. I sort of lost my patience with the midwits and binary thinkers who think that the correct way to respond to someone saying something original is to quote conventional boilerplate of the sort that anyone who is even half-educated already knows. Anyhow, it should also interest those of an economic bent, as in the course of explaining the observation that Communism is better for a nation in the long-term than liberal democratic capitalism, (the what, if you will) I was able to explain the economic reasons\nwhy\nthat always had to be the case.\nThis doesn’t mean that socialism isn’t economically retarded; it is. But it is that very retardation that tends to protect a nation from the ravages of the global free markets. And if you’re tempted to respond that the global markets aren’t truly free, well, watch the Darkstream first.\nIt might help to remember the fact that X being better than Y does not mean that X is either good or desirable in itself.",
  "tags": [
    "Darkstream",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-31T23:30:00+00:00"
}