{
  "url": "https://voxday.net/2017/06/13/diversity-proximity-radicalization/",
  "scraped_at": "2025-12-18T07:17:58.470145",
  "title": "Diversity + Proximity = Radicalization",
  "date_display": "June 13, 2017",
  "date_iso": "2017-06-13T09:20:00+00:00",
  "date_from_url": "2017-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point, it should hardly come as a surprise that one of the basic tenets of multiculturalism – the idea that exposure to the secular West will cause Muslims to become more liberal and less extreme – is not only false, but has been known to be false for centuries.</p><blockquote class=\"tr_bq\"><p> Malikism in Spain represented well the Sunni tradition of the Islamic West, which historically has been more rigid than the Sunni tradition of the Islamic Middle East. Citing several medieval Muslim sources, the great Hungarian Arabist Ignaz Goldziher confirmed that, contrary to popular opinion, the practice of Islam in Spain was much more rigorous than in the East. If anything, the presence of large Catholic populations to the north and in their midst, along with the conversion to Islam of many of the earlier inhabitants, seems to have exacerbated the Andalusian clerics’ zeal in adhering to Maliki teachings. In other words, far from being conducive to tolerance, living close to Christians exacerbated Islamism in al-Andalus.<br>  – Darío Fernández-Morera, <i><a href=\"http://amzn.to/2rdf9QX\">The Myth of the Andalusian Paradise: Muslims, Christians, and Jews under Islamic Rule in Medieval Spain</a></i></br></p></blockquote><p>Of course, given the incredible amount of historical revisionism and ahistorical falsehoods, and outright multicultural propaganda chronicled by Fernández-Morera in his extraordinarily detailed book, it’s hardly a surprise that the popular opinion of those who know nothing of the history of Muslim Spain would prove susceptible to the whitewashed version.</p><p>Fernández-Morera’s book reminds me a little of <i>The Irrational Atheist</i>, in that he follows a similar method of quoting the English-speaking Arabist historians, many of whom are clearly unaware of the various Spanish and Arabic accounts, at length, before conclusively demonstrating how hopelessly wrong they are. The destruction of the myth of al-Andalus is so complete, and so brutal, that the only real question is whether the historians he is methodically abusing are shamelessly mendacious or merely pig-ignorant.</p><p>But regardless, it is historical evidence that the longer the current wave of Islam is permitted residence in the West, the more radical, violent, and zealous it will become. Secular hopes of liberal accommodation are in vain, as Islamic jurisprudence looks even more askance on atheists than it does on those it terms polytheists.</p></div>",
  "content_text": "At this point, it should hardly come as a surprise that one of the basic tenets of multiculturalism – the idea that exposure to the secular West will cause Muslims to become more liberal and less extreme – is not only false, but has been known to be false for centuries.\nMalikism in Spain represented well the Sunni tradition of the Islamic West, which historically has been more rigid than the Sunni tradition of the Islamic Middle East. Citing several medieval Muslim sources, the great Hungarian Arabist Ignaz Goldziher confirmed that, contrary to popular opinion, the practice of Islam in Spain was much more rigorous than in the East. If anything, the presence of large Catholic populations to the north and in their midst, along with the conversion to Islam of many of the earlier inhabitants, seems to have exacerbated the Andalusian clerics’ zeal in adhering to Maliki teachings. In other words, far from being conducive to tolerance, living close to Christians exacerbated Islamism in al-Andalus.\n– Darío Fernández-Morera,\nThe Myth of the Andalusian Paradise: Muslims, Christians, and Jews under Islamic Rule in Medieval Spain\nOf course, given the incredible amount of historical revisionism and ahistorical falsehoods, and outright multicultural propaganda chronicled by Fernández-Morera in his extraordinarily detailed book, it’s hardly a surprise that the popular opinion of those who know nothing of the history of Muslim Spain would prove susceptible to the whitewashed version.\nFernández-Morera’s book reminds me a little of\nThe Irrational Atheist\n, in that he follows a similar method of quoting the English-speaking Arabist historians, many of whom are clearly unaware of the various Spanish and Arabic accounts, at length, before conclusively demonstrating how hopelessly wrong they are. The destruction of the myth of al-Andalus is so complete, and so brutal, that the only real question is whether the historians he is methodically abusing are shamelessly mendacious or merely pig-ignorant.\nBut regardless, it is historical evidence that the longer the current wave of Islam is permitted residence in the West, the more radical, violent, and zealous it will become. Secular hopes of liberal accommodation are in vain, as Islamic jurisprudence looks even more askance on atheists than it does on those it terms polytheists.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-13T08:20:00+00:00"
}