{
  "url": "https://voxday.net/2017/06/20/dont-talk-to-media/",
  "scraped_at": "2025-12-18T07:19:04.466862",
  "title": "Don’t. Talk. To. The. Media.",
  "date_display": "June 20, 2017",
  "date_iso": "2017-06-20T12:00:00+00:00",
  "date_from_url": "2017-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tommy Robinson is the latest to learn that it is a bad idea, <a href=\"https://www.thesun.co.uk/news/3838787/piers-morgan-tommy-robinson-good-morning-britain/\">even when it’s live television</a>:</p><blockquote><p> Piers Morgan blasted former English Defence League leader Tommy Robinson for being a “bigoted lunatic stirring up hatred” as he clashed with the right-wing activist this morning.</p><p>As Robinson pulled out a copy of the Koran on Good Morning Britain, Piers blasted him, saying: “Show some damn respect for people’s religious beliefs.“You’re sounding like a complete lunatic. You’re sounding like a bigoted lunatic.</p><p>“You’re stirring up hatred.</p><p>“You’re being a complete disgrace.”</p><p>Holding up the Koran, Robinson branded it a “violent and cursed book” and said: “This book is the reason we are in such a mess.”</p><p>Piers responded: “We’re in this mess because people take Islam, they are terrorists and they abuse the nature of Islam and… perpetrate evil.”</p><p>And the former EDL leader refused to accept Islam was a religion, saying: “Islam is an idea – a bad idea.” Asked if he was Islamophobic, Robinson retorted: “There’s no such word as Islamophobia. A phobia is an irrational fear, it’s not irrational to fear these things.”</p></blockquote><p>I don’t know if people’s egos are simply too tempted by the thought of appearing on camera or if they truly believe they are smarter than almost every single person who has been summoned to play punching bag before them, but it’s remarkable how whether a reasonable individual is conservative, Alt-Right, Alt-Lite, or simply nationalist, they are drawn like moths to the candleflame of the hostile media’s cameras.</p><p>Tommy Robinson complained on Twitter:</p><p><b>Tommy Robinson @TRobinsonNewEra</b><br> <i>Piers Morgan usual technique of not letting the person he is interviewing actually answer any questions.  Just…</i></br></p><p><b>Supreme Dark Lord‏  @voxday</b><br> <i>Do you really not understand that you were there to be a punching bag? He was virtue-signaling at your expense. Don’t talk to the media! </i><br> <i><br/></i>When you are approached by the media, be it Megyn Kelly, Piers Morgan, Wired, The New York Times, or The Atlantic, you must understand that they see you as the <i>content du jour</i>. And the content is always folded, spindled, and mutilated to fit their current Narrative, which is NOT the reason they will give you when they try to get you to talk to them or appear on their show.</br></br></p><p>Here is the thing. You don’t need the media. As Mike Cernovich points out, <i>they need you</i>. It is Piers Morgan whose name is on the headlines because Tommy Robinson was willing to make Morgan relevant today, not the other way around. Who is more relevant and has a bigger platform, Richard Spencer, who leaps to talk to the media, or Stefan Molyneux, who will not even return their emails?</p><p>And as both Mike and I have noticed, mainstream exposure doesn’t even move the needle. Not in terms of blog traffic, Twitter followers, or book sales. It is probable pain for no gain. Whereas whenever he goes on Infowars or I go on FreeDomainRadio, we see observable bumps in one or more metrics.</p><p>In light of this, I should mention that I am modifying my media policy. Previously, I had been willing to answer written questions posed to me by reporters in writing. I have now learned that they will <i>never </i>run those answers because they cannot use them to fit the Narrative. So, I will not be replying to any mainstream media inquiries that do not specifically, and solely, concern Castalia House books, Infogalactic, or games for which I am the lead designer.</p><p>UPDATE: had to modify that and add Infogalactic since Wired is apparently doing a story on it. I don’t know if it is a hit piece or a tech piece yet, but their questions – which I have answered in writing – were solely focused on tech-related issues. We’ll see.</p></div>",
  "content_text": "Tommy Robinson is the latest to learn that it is a bad idea,\neven when it’s live television\n:\nPiers Morgan blasted former English Defence League leader Tommy Robinson for being a “bigoted lunatic stirring up hatred” as he clashed with the right-wing activist this morning.\nAs Robinson pulled out a copy of the Koran on Good Morning Britain, Piers blasted him, saying: “Show some damn respect for people’s religious beliefs.“You’re sounding like a complete lunatic. You’re sounding like a bigoted lunatic.\n“You’re stirring up hatred.\n“You’re being a complete disgrace.”\nHolding up the Koran, Robinson branded it a “violent and cursed book” and said: “This book is the reason we are in such a mess.”\nPiers responded: “We’re in this mess because people take Islam, they are terrorists and they abuse the nature of Islam and… perpetrate evil.”\nAnd the former EDL leader refused to accept Islam was a religion, saying: “Islam is an idea – a bad idea.” Asked if he was Islamophobic, Robinson retorted: “There’s no such word as Islamophobia. A phobia is an irrational fear, it’s not irrational to fear these things.”\nI don’t know if people’s egos are simply too tempted by the thought of appearing on camera or if they truly believe they are smarter than almost every single person who has been summoned to play punching bag before them, but it’s remarkable how whether a reasonable individual is conservative, Alt-Right, Alt-Lite, or simply nationalist, they are drawn like moths to the candleflame of the hostile media’s cameras.\nTommy Robinson complained on Twitter:\nTommy Robinson @TRobinsonNewEra\nPiers Morgan usual technique of not letting the person he is interviewing actually answer any questions.  Just…\nSupreme Dark Lord‏  @voxday\nDo you really not understand that you were there to be a punching bag? He was virtue-signaling at your expense. Don’t talk to the media!\nWhen you are approached by the media, be it Megyn Kelly, Piers Morgan, Wired, The New York Times, or The Atlantic, you must understand that they see you as the\ncontent du jour\n. And the content is always folded, spindled, and mutilated to fit their current Narrative, which is NOT the reason they will give you when they try to get you to talk to them or appear on their show.\nHere is the thing. You don’t need the media. As Mike Cernovich points out,\nthey need you\n. It is Piers Morgan whose name is on the headlines because Tommy Robinson was willing to make Morgan relevant today, not the other way around. Who is more relevant and has a bigger platform, Richard Spencer, who leaps to talk to the media, or Stefan Molyneux, who will not even return their emails?\nAnd as both Mike and I have noticed, mainstream exposure doesn’t even move the needle. Not in terms of blog traffic, Twitter followers, or book sales. It is probable pain for no gain. Whereas whenever he goes on Infowars or I go on FreeDomainRadio, we see observable bumps in one or more metrics.\nIn light of this, I should mention that I am modifying my media policy. Previously, I had been willing to answer written questions posed to me by reporters in writing. I have now learned that they will\nnever\nrun those answers because they cannot use them to fit the Narrative. So, I will not be replying to any mainstream media inquiries that do not specifically, and solely, concern Castalia House books, Infogalactic, or games for which I am the lead designer.\nUPDATE: had to modify that and add Infogalactic since Wired is apparently doing a story on it. I don’t know if it is a hit piece or a tech piece yet, but their questions – which I have answered in writing – were solely focused on tech-related issues. We’ll see.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-20T11:00:00+00:00"
}