{
  "url": "https://voxday.net/2017/06/29/excerpt-hitler-in-he/",
  "scraped_at": "2025-12-18T07:20:28.863579",
  "title": "EXCERPT: Hitler in Hell",
  "date_display": "June 29, 2017",
  "date_iso": "2017-06-29T22:00:00+00:00",
  "date_from_url": "2017-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>An excerpt from Martin van Creveld’s new novel, </i><a href=\"http://amzn.to/2u1kg8A\" style=\"font-style: italic; font-weight: bold;\">Hitler in Hell</a><i style=\"font-weight: bold;\">. </i><i>Please note that on the advice of one of our Amazon-bestselling authors, we have removed the book from the Castalia House bookstore for the time being and entered it into the Kindle Select program. It is now available <a href=\"http://amzn.to/2u1kg8A\">via Kindle Unlimited</a>; if you purchased the book from our bookstore but did not download it, please email us and we will make sure you receive you receive your book. We apologize if this causes any confusion.</i><br> <i><b><br/></b></i><br> <i><b>Revolution and Collapse</b></i></br></br></p><p>Over the next few years, during which I began my political activity, I had plenty of opportunities to analyze the causes of the collapse. In fact, addressing them in numerous public meetings large and small, I did so until I was blue in the face. Some of my conclusions simply continued thoughts that had been with me during the war and even before it had started. The rest were directly related to our defeat.</p><p>The Second Reich, as it was widely known, had been born under an auspicious star amidst the thunder of victorious battle. For that we had Bismarck to thank and, coming right after him, Chief of Staff Helmut von Moltke and Minister of War Albrecht von Roon. Nothing symbolized it as well as the Siegessäule, or Victory Column, in Berlin. Originally sixty-seven meters tall, it was wrapped entirely by captured enemy cannons. In 1939, as part of my plan to renovate the city and to turn it into Europe’s capital, I had its height increased by another seven and a half meters. I also moved it from its original site at the Königsplatz (now misnamed the Platz der Republik) near the Reichstag to the Grosser Stern. But back to the Reich. Over the first forty-three years of its existence it enjoyed immense prosperity and economic growth. Simple people, who always and everywhere form the great majority, were impressed by that prosperity as well as the evident military strength of the Reich, which was put on display on appropriate occasions.</p><p>Having done so, they attributed the sudden collapse of the structure solely to the war, which had brought so much misery to them. But this is absurd. In fact, all the collapse did was to expose weaknesses that had long existed. Chief among them were general suffrage which Germany got before England, misleadingly known as the “mother of democracies,” did. On its heels came elections and democracy. All three were non-German elements of government. Initially, they were foisted on us by the professors of 1848, who wanted nothing better than to ape the “ideals” of the French Revolution. Once established, they quickly turned into a morass of useless chatter and corruption.</p><p>Next came the failure to properly deal with the liberated provinces, Alsace and Lorraine. As a result, they never truly became an integral part of the Reich. To repeat, Wilhelm II’s foreign policy was essentially misdirected. To add insult to injury it was often weak and vacillating as well.</p><p>Finally, there was the tolerance long shown for those vile Marxist traitors, the Social Democrats. Starting long before the war and redoubling their efforts while it lasted, they did whatever they could to foment discontent and to incite the people against the army and the government. Their ability to do so was due to the government’s inability or unwillingness to rein in the press. Not that the non-socialist press was necessarily better. Only parts of it supported the government in its conduct of the war, and much of it did what it could to undermine them.</p><p>Though the war was over, the British blockade still continued. Only in the middle of 1919 was it finally lifted, enabling us to resume our imports and exports. But this happened only to a very limited extent. Partly because of carelessness in August 1914, partly because of enemy action, and partly because no new merchantmen were built during the war, we had lost almost our entire merchant navy.<br> Much of what we still possessed had to be given away gratis as reparations. In any case the enemy had used the war to steal our overseas markets from us. This caused production to come to a halt and unemployment to soar. The demobilization of the armies, which at the end of the war still numbered several million men, added to the problem. That’s to say nothing of the hundreds of thousands maimed and crippled men who had to be taken care of in one way or another.</br></p><p>Determined to avenge themselves on us, our enemies took large parts of Prussia and Silesia, which had been German for centuries, if not longer, away from the Reich. This caused hundreds of thousands of our fellow citizens, who understandably were unwilling to live under Polish (mis)rule, to leave their homes to migrate to the west, where nothing had been done to receive them. Nor did the process of drawing the borders unfold peacefully. Throughout 1919, in many places, volunteer units known variously as Freikorps, or the Black Reichswehr, fought heroically, if ultimately unsuccessfully, to retain the lands in question.</p><p>All over Germany, wherever one looked, people shivered and hungered. It goes without saying that I detest that self-appointed artist and filthy pornographer, Georg Grosz. Luckily for him, he left the country in a hurry in 1933, or else I would have had him thrown into a concentration camp! Still I must concede that many of his sketches, which show starving workers, fat, evil-looking capitalists with heaps of money, and made-up prostitutes presented a true, if one-sided and perverted, picture of reality at the time. Much later, I learned that the origins of this misery had been explored in depth by the English economist John Maynard Keynes in his booklet The Economic Consequences of the Peace (1919). He could hardly have done a better job.</p><p>Political conditions naturally reflected the economic situation. The new Social-Democratic government was unable to resist the Allied demands. So weak were the “statesmen” whom the so-called “Revolution” had brought to power that they signed the famous Kriegsschuld, war-guilt, article under which Germany assumed responsibility for the war. To be sure, history bristles with occasions when the defeated were not only despoiled but humiliated. However, the Kriegsschuld business was something new and unprecedented. Besides preparing the “legal” basis for extracting reparations, it hit straight at the nation’s soul, which, of course, was just what it had been meant to do.</p><p>Internally, the political situation was even worse. The Social Democrats, having successfully undermined public order, were unable to reimpose it. Everywhere workers, incited by their often Jewish leaders, spat on officers, tore the epaulets from their shoulders, and beat them up. So bad were conditions that many places were reduced to anarchy. That specifically included Bavaria and Munich, where I was stationed at the time and where the Jews set up a “Soviet Republic.” The stupidity of these people was truly amazing. During the few days the “Republic” lasted its foreign affairs commissar, Franz Lipp, whose record included several stays in mental hospitals, actually declared war on Switzerland. That was done, he explained, because the Swiss had refused to lend him sixty locomotives! At one point I myself, rifle in hand, had to chase away three scoundrels who had come to arrest me in my quarters.</p><p>In the end the Reichswehr, assisted by Freikorps units, re-took Munich and exacted a well-deserved vengeance. Eugene Leviné, the Jewish Communist who had led the uprising, was killed. Not so his uncouth right-hand man and fellow Jew, Erich Mühsam. He was arrested, tried, and sentenced to fifteen years in prison. But he did not have to stay there for long; in 1924 an amnesty was granted, and he was released. After the Reichstagbrand on 28 February 1933, I had him arrested and sent to a concentration camp where the boys, seeking their revenge, saw to it that he would expire. Good! As these two gentlemen illustrate so nicely, behind each and every one of these problems stood the Jews.</p></div>",
  "content_text": "An excerpt from Martin van Creveld’s new novel,\nHitler in Hell\n.\nPlease note that on the advice of one of our Amazon-bestselling authors, we have removed the book from the Castalia House bookstore for the time being and entered it into the Kindle Select program. It is now available\nvia Kindle Unlimited\n; if you purchased the book from our bookstore but did not download it, please email us and we will make sure you receive you receive your book. We apologize if this causes any confusion.\nRevolution and Collapse\nOver the next few years, during which I began my political activity, I had plenty of opportunities to analyze the causes of the collapse. In fact, addressing them in numerous public meetings large and small, I did so until I was blue in the face. Some of my conclusions simply continued thoughts that had been with me during the war and even before it had started. The rest were directly related to our defeat.\nThe Second Reich, as it was widely known, had been born under an auspicious star amidst the thunder of victorious battle. For that we had Bismarck to thank and, coming right after him, Chief of Staff Helmut von Moltke and Minister of War Albrecht von Roon. Nothing symbolized it as well as the Siegessäule, or Victory Column, in Berlin. Originally sixty-seven meters tall, it was wrapped entirely by captured enemy cannons. In 1939, as part of my plan to renovate the city and to turn it into Europe’s capital, I had its height increased by another seven and a half meters. I also moved it from its original site at the Königsplatz (now misnamed the Platz der Republik) near the Reichstag to the Grosser Stern. But back to the Reich. Over the first forty-three years of its existence it enjoyed immense prosperity and economic growth. Simple people, who always and everywhere form the great majority, were impressed by that prosperity as well as the evident military strength of the Reich, which was put on display on appropriate occasions.\nHaving done so, they attributed the sudden collapse of the structure solely to the war, which had brought so much misery to them. But this is absurd. In fact, all the collapse did was to expose weaknesses that had long existed. Chief among them were general suffrage which Germany got before England, misleadingly known as the “mother of democracies,” did. On its heels came elections and democracy. All three were non-German elements of government. Initially, they were foisted on us by the professors of 1848, who wanted nothing better than to ape the “ideals” of the French Revolution. Once established, they quickly turned into a morass of useless chatter and corruption.\nNext came the failure to properly deal with the liberated provinces, Alsace and Lorraine. As a result, they never truly became an integral part of the Reich. To repeat, Wilhelm II’s foreign policy was essentially misdirected. To add insult to injury it was often weak and vacillating as well.\nFinally, there was the tolerance long shown for those vile Marxist traitors, the Social Democrats. Starting long before the war and redoubling their efforts while it lasted, they did whatever they could to foment discontent and to incite the people against the army and the government. Their ability to do so was due to the government’s inability or unwillingness to rein in the press. Not that the non-socialist press was necessarily better. Only parts of it supported the government in its conduct of the war, and much of it did what it could to undermine them.\nThough the war was over, the British blockade still continued. Only in the middle of 1919 was it finally lifted, enabling us to resume our imports and exports. But this happened only to a very limited extent. Partly because of carelessness in August 1914, partly because of enemy action, and partly because no new merchantmen were built during the war, we had lost almost our entire merchant navy.\nMuch of what we still possessed had to be given away gratis as reparations. In any case the enemy had used the war to steal our overseas markets from us. This caused production to come to a halt and unemployment to soar. The demobilization of the armies, which at the end of the war still numbered several million men, added to the problem. That’s to say nothing of the hundreds of thousands maimed and crippled men who had to be taken care of in one way or another.\nDetermined to avenge themselves on us, our enemies took large parts of Prussia and Silesia, which had been German for centuries, if not longer, away from the Reich. This caused hundreds of thousands of our fellow citizens, who understandably were unwilling to live under Polish (mis)rule, to leave their homes to migrate to the west, where nothing had been done to receive them. Nor did the process of drawing the borders unfold peacefully. Throughout 1919, in many places, volunteer units known variously as Freikorps, or the Black Reichswehr, fought heroically, if ultimately unsuccessfully, to retain the lands in question.\nAll over Germany, wherever one looked, people shivered and hungered. It goes without saying that I detest that self-appointed artist and filthy pornographer, Georg Grosz. Luckily for him, he left the country in a hurry in 1933, or else I would have had him thrown into a concentration camp! Still I must concede that many of his sketches, which show starving workers, fat, evil-looking capitalists with heaps of money, and made-up prostitutes presented a true, if one-sided and perverted, picture of reality at the time. Much later, I learned that the origins of this misery had been explored in depth by the English economist John Maynard Keynes in his booklet The Economic Consequences of the Peace (1919). He could hardly have done a better job.\nPolitical conditions naturally reflected the economic situation. The new Social-Democratic government was unable to resist the Allied demands. So weak were the “statesmen” whom the so-called “Revolution” had brought to power that they signed the famous Kriegsschuld, war-guilt, article under which Germany assumed responsibility for the war. To be sure, history bristles with occasions when the defeated were not only despoiled but humiliated. However, the Kriegsschuld business was something new and unprecedented. Besides preparing the “legal” basis for extracting reparations, it hit straight at the nation’s soul, which, of course, was just what it had been meant to do.\nInternally, the political situation was even worse. The Social Democrats, having successfully undermined public order, were unable to reimpose it. Everywhere workers, incited by their often Jewish leaders, spat on officers, tore the epaulets from their shoulders, and beat them up. So bad were conditions that many places were reduced to anarchy. That specifically included Bavaria and Munich, where I was stationed at the time and where the Jews set up a “Soviet Republic.” The stupidity of these people was truly amazing. During the few days the “Republic” lasted its foreign affairs commissar, Franz Lipp, whose record included several stays in mental hospitals, actually declared war on Switzerland. That was done, he explained, because the Swiss had refused to lend him sixty locomotives! At one point I myself, rifle in hand, had to chase away three scoundrels who had come to arrest me in my quarters.\nIn the end the Reichswehr, assisted by Freikorps units, re-took Munich and exacted a well-deserved vengeance. Eugene Leviné, the Jewish Communist who had led the uprising, was killed. Not so his uncouth right-hand man and fellow Jew, Erich Mühsam. He was arrested, tried, and sentenced to fifteen years in prison. But he did not have to stay there for long; in 1924 an amnesty was granted, and he was released. After the Reichstagbrand on 28 February 1933, I had him arrested and sent to a concentration camp where the boys, seeking their revenge, saw to it that he would expire. Good! As these two gentlemen illustrate so nicely, behind each and every one of these problems stood the Jews.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-29T21:00:00+00:00"
}