{
  "url": "https://voxday.net/2017/06/14/john-piper-celebrates-mudsharking/",
  "scraped_at": "2025-12-18T07:18:13.036057",
  "title": "John Piper celebrates mudsharking",
  "date_display": "June 14, 2017",
  "date_iso": "2017-06-14T14:00:00+00:00",
  "date_from_url": "2017-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have gradually come to believe that John Piper may be the ultimate wolf in sheep’s clothing. There is not a single tragedy, there is not a single dyscivic or dyscivilizational trend that he does not celebrate as God’s will or good Christian behavior <a href=\"http://www.desiringgod.org/articles/fifty-years-after-loving-v-virginia\">in his mealy-mouthed manner</a>:</p><blockquote><p> Fifty years ago, on June 12, 1967, the United States Supreme Court declared unconstitutional all state laws that prohibited interracial marriage. The case was called Loving v. Virginia. Mildred Jeter (who was black and Native American) and Richard Loving (who was white) were married in 1958 in Washington, D.C. When they returned to their hometown of Richmond, Virginia, they were arrested. They pled guilty to “cohabiting as man and wife, against the peace and dignity of the Commonwealth.”</p><p>This is a court decision worth celebrating. But far more important than the legalization of interracial marriage in one nation is the fact that God’s revealed will for the world is not undermined but advanced when a man and a woman from different ethnicities marry in Christ. That is a startling and controversial claim in the face of diverse opposition to interracial marriage in our own day. (The following quotes appear in Bloodlines, pages 204–205.)</p><p>From the black community, one spokesman says, “Interracial marriage undermines [African-Americans’] ability to introduce our children to black role models who accept their racial identity with pride.”</p><p>From the white community, another spokesman says, “We are seeing the death of the American and his replacement with a non-European type. . . . White people . . . are going to have to struggle mightily to survive the Neo-Melting Pot. . . . Call it what it is: Genocide and extinction of the white genotype.”</p><p>From the white evangelical community, another says, “I would never marry a black. Why? Because I believe God made the races, separated them, and set the bounds of their habitation (Deuteronomy 32:8; Acts 17:26). He made them uniquely different and intended that these distinctions remain.”</p><p>Against all of these objections, I believe it is as important as it ever has been that Christians settle it in their minds that interracial marriage in Christ is not only a beautiful picture of Christ’s marriage to his church, but also a flesh-and-blood incarnation of the unity Christ achieved by his death and resurrection….</p><p>The freedom and the beauty and peace of interracial marriage is one ray of the glory of Christ that should be shining from this new humanity — this “chosen race” (1 Peter 2:9) — which Jesus Christ died and rose again to create.</p></blockquote><p>That’s right up there with “Tornadoes are Christ’s fingers being dragged across the land.” I have no doubt whatsoever that this depraved man is going to end up by endorsing Islam as “a beautiful, glorious demonstration of Christ’s love for the Messenger of God, may peace be upon him”. Frankly, it’s a surprise that he hasn’t changed his position on women in the pulpit yet. If he lives another five years, I expect he will.</p><p>I have always been convinced that the Calvinists are absolutely and utterly wrong when it comes to theology. And every single time I read something John Piper has written, it underlines my opinion in that regard.</p><p>After all, what can be a more beautiful picture of Christianity than white women working to support their black husbands – 98 percent of whom do not financially support their mixed-race children – when they aren’t strangling or beating them to death? A reader writes of learning that a former college girlfriend <a href=\"http://www.nbcdfw.com/news/local/Charge-Upgraded-to-Capital-Murder-for-Suspect-in-TCU-Area-Strangulation-421382753.html\">recently enjoyed the freedom and beauty and peace of paying the toll</a>:</p><blockquote class=\"tr_bq\"><p> Witnessing the blueprint of the problems often discussed in this corner of the web unfold in person is sobering. Looking back, as a mid 20’s guy who wasn’t redpilled until my senior year of college, and as even more so as a recently converted Christian: the immensity of how truly evil those forcing this upon the world are has finally hit me. A true modern liberal fairy tale. Happy ending and all. Upper middle class white woman goes to college, does well at first, but the school has the exact effect its intended to have. A corrosive concoction of drugs and dick lead to her having to leave and live at home her junior year. I lost touch with her for about two years, but I actually caught up with her a few months before this and she had more or less gotten her act together. But alas, past actions have consequences in the present. And in this reality sleeping with a historically violent black whose concept of forensic science leads him to believe leaving his underwear in the washing machine after a rape-murder is sufficient cover leads to the well-documented results.</p></blockquote><p>Can’t you just feel the rays of the glory of Christ shining from that new humanity?</p></div>",
  "content_text": "I have gradually come to believe that John Piper may be the ultimate wolf in sheep’s clothing. There is not a single tragedy, there is not a single dyscivic or dyscivilizational trend that he does not celebrate as God’s will or good Christian behavior\nin his mealy-mouthed manner\n:\nFifty years ago, on June 12, 1967, the United States Supreme Court declared unconstitutional all state laws that prohibited interracial marriage. The case was called Loving v. Virginia. Mildred Jeter (who was black and Native American) and Richard Loving (who was white) were married in 1958 in Washington, D.C. When they returned to their hometown of Richmond, Virginia, they were arrested. They pled guilty to “cohabiting as man and wife, against the peace and dignity of the Commonwealth.”\nThis is a court decision worth celebrating. But far more important than the legalization of interracial marriage in one nation is the fact that God’s revealed will for the world is not undermined but advanced when a man and a woman from different ethnicities marry in Christ. That is a startling and controversial claim in the face of diverse opposition to interracial marriage in our own day. (The following quotes appear in Bloodlines, pages 204–205.)\nFrom the black community, one spokesman says, “Interracial marriage undermines [African-Americans’] ability to introduce our children to black role models who accept their racial identity with pride.”\nFrom the white community, another spokesman says, “We are seeing the death of the American and his replacement with a non-European type. . . . White people . . . are going to have to struggle mightily to survive the Neo-Melting Pot. . . . Call it what it is: Genocide and extinction of the white genotype.”\nFrom the white evangelical community, another says, “I would never marry a black. Why? Because I believe God made the races, separated them, and set the bounds of their habitation (Deuteronomy 32:8; Acts 17:26). He made them uniquely different and intended that these distinctions remain.”\nAgainst all of these objections, I believe it is as important as it ever has been that Christians settle it in their minds that interracial marriage in Christ is not only a beautiful picture of Christ’s marriage to his church, but also a flesh-and-blood incarnation of the unity Christ achieved by his death and resurrection….\nThe freedom and the beauty and peace of interracial marriage is one ray of the glory of Christ that should be shining from this new humanity — this “chosen race” (1 Peter 2:9) — which Jesus Christ died and rose again to create.\nThat’s right up there with “Tornadoes are Christ’s fingers being dragged across the land.” I have no doubt whatsoever that this depraved man is going to end up by endorsing Islam as “a beautiful, glorious demonstration of Christ’s love for the Messenger of God, may peace be upon him”. Frankly, it’s a surprise that he hasn’t changed his position on women in the pulpit yet. If he lives another five years, I expect he will.\nI have always been convinced that the Calvinists are absolutely and utterly wrong when it comes to theology. And every single time I read something John Piper has written, it underlines my opinion in that regard.\nAfter all, what can be a more beautiful picture of Christianity than white women working to support their black husbands – 98 percent of whom do not financially support their mixed-race children – when they aren’t strangling or beating them to death? A reader writes of learning that a former college girlfriend\nrecently enjoyed the freedom and beauty and peace of paying the toll\n:\nWitnessing the blueprint of the problems often discussed in this corner of the web unfold in person is sobering. Looking back, as a mid 20’s guy who wasn’t redpilled until my senior year of college, and as even more so as a recently converted Christian: the immensity of how truly evil those forcing this upon the world are has finally hit me. A true modern liberal fairy tale. Happy ending and all. Upper middle class white woman goes to college, does well at first, but the school has the exact effect its intended to have. A corrosive concoction of drugs and dick lead to her having to leave and live at home her junior year. I lost touch with her for about two years, but I actually caught up with her a few months before this and she had more or less gotten her act together. But alas, past actions have consequences in the present. And in this reality sleeping with a historically violent black whose concept of forensic science leads him to believe leaving his underwear in the washing machine after a rape-murder is sufficient cover leads to the well-documented results.\nCan’t you just feel the rays of the glory of Christ shining from that new humanity?",
  "tags": [
    "Christianity",
    "cuckservative",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-14T13:00:00+00:00"
}