{
  "url": "https://voxday.net/2017/06/25/posterity-tk-vs-vd/",
  "scraped_at": "2025-12-18T07:19:49.645155",
  "title": "Posterity: TK vs VD",
  "date_display": "June 25, 2017",
  "date_iso": "2017-06-25T17:00:00+00:00",
  "date_from_url": "2017-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you probably know, <a href=\"http://www.milobookclub.com/2017/01/10/muh-constitution-he-cucked-cuckingly/\">my argument</a> is that the Posterity for whom the Constitution is intended to defend the Blessings of Liberty consists solely of the genetic descendants of the People of the several and united States. Posterity does not include immigrants, descendants of immigrants, invaders, conquerers, tourists, students, Americans born in Portugal, or anyone else who happens to subsequently reside in the same geographic location, or share the same civic ideals, as the original We the People.</p><p>Tom Kratman, as part of his series on Civic Nationalism, took a very different stance in an essay entitled <a href=\"http://www.everyjoe.com/2017/04/17/politics/civic-nationalism-ourselves-and-our-posterity/#1\">Ourselves and Our Posterity</a>. He claims that in this particular case, “our posterity” means nothing more than “succeeding generations”. Read the whole thing, it’s not an incompetent case, merely an incorrect one. Not only that, but he also claims that the alternative definition to which I subscribe, “actual legal descendants and heirs”, is “utter nonsense”. He wrote:</p><p><i>I’m not sloppy Vox, you’re just wrong, your genetically based posterity argument utter nonsense, start to finish.</i><br> <i><br/></i><br> He also added, rather confidently, that he can match me IQ point for IQ point.<br> <i><br/></i><br> <i>Vox, since you set store by it, I can match you IQ point for IQ point. Yes, I can… </i><i>Once again. you have a word in the preamble which doesn’t carry it’s own definition. The dictionaries of the day do not help you, because they use three definitions. Within the document, itself, you have clear, absolutely unambiguous evidence that they intended immigration and naturalization because they provided from immigrants to eventually, within their lifetimes, be able to hold any elective office in the land but one. You have the 1790 act, which is commentary on the intent, but not actually necessary because the constitution itself, as mentioned above, provides for the ability of naturalized citizens to become senators and reps. ANd then there is the problem of omission. I mentioned Hobbes in my first post in this thread. Why? I mentioned it because he had translated Thucydides 148 or so years before the revolution; they had that in their libraries, and so they knew about more restrictive – genetic posterity-based – rules for citizenship and neglected to use them. Would have been easy. Didn’t bother. Did, once again, put in provisions for non-genetically based citizens in the highest office.</i><br> <i><br/></i>Now, I don’t mind people calling me out. It adds a certain flavor to the discourse. The problem, however, is that one’s ability to match me in the decathalon is irrelevant when the contest concerned is the 100-meter dash. This is particularly relevant if you happen to know that I can’t pole vault over my own height. As I warned Tom, his case is an eminently reasonable one, but it is a purely logical argument of the sort preferred by lawyers, the very sort of argument that reliably fails when the relevant evidence is examined. As with many an economic model, Tom’s case relies upon imputing a false rationality and coherence to the behavior of all-too-often irrational and self-contradictory human beings. I could come up with a dozen alternative explanations to his logical conundrum, but I won’t bother, because I have a considerably more effective response to offer.</br></br></br></br></br></p><p>The question is this: how do we determine which of the three definitions of posterity should correctly apply to the term “posterity” as it is used in “ourselves and our posterity”? The answer, as I previously suggested, is straightforward. To understand how the term was meant to be understood in the Preamble, we must look at how the same people using it were using it in their other writings. Fortunately, there are more than a few mentions of “posterity” in both the Federalist and Anti-Federalist Papers which are discussing the very constitution in question. There are seven instances in the Federalist Papers.</p><ol><li><i>To this manly spirit, posterity will be indebted for the possession, and the world for the example, of the numerous innovations displayed on the American theatre, in favor of private rights and public happiness.</i> (DEFINITION 3: future history)</li><li><i>In framing a government for posterity as well as ourselves, we ought, in those provisions which are designed to be permanent, to calculate, not on temporary, but on permanent causes of expense. </i>(DEFINITION 3: future history)</li><li><i>This dependence, and the necessity of being bound himself, and his posterity, by the laws to which he gives his assent, are the true, and they are the strong chords of sympathy between the representative and the constituent.</i> (DEFINITION 1: descendants)</li><li><i>WE, THE PEOPLE of the United States, to secure the blessings of liberty to ourselves and our posterity, do ORDAIN and ESTABLISH this Constitution for the United States of America.</i> (TBD)</li><li><i>No partial motive, no particular interest, no pride of opinion, no temporary passion or prejudice, will justify to himself, to his country, or to his posterity, an improper election of the part he is to act.</i> (DEFINITION 1: descendants)</li><li><i>…upon Congress, as they are now constituted; and either the machine, from the intrinsic feebleness of its structure, will moulder into pieces, in spite of our ill-judged efforts to prop it; or, by successive augmentations of its force an energy, as necessity might prompt, we shall finally accumulate, in a single body, all the most important prerogatives of sovereignty, and thus entail upon our posterity one of the most execrable forms of government that human infatuation ever contrived. </i>(TBD)</li><li><i>Whence could it have proceeded, that the Athenians, a people who would not suffer an army to be commanded by fewer than ten generals, and who required no other proof of danger to their liberties than the illustrious merit of a fellow-citizen, should consider one illustrious citizen as a more eligible depositary of the fortunes of themselves and their posterity, than a select body of citizens, from whose common deliberations more wisdom, as well as more safety, might have been expected?</i> (DEFINITION 1: descendants)</li></ol><div> Note that the distinction between “posterity”, used in the sense of future history, and “his posterity” and “their posterity”, used in the sense of direct genetic descendants. This suggests that “our posterity” is also meant to be understood in the case of the latter. Also note that none of the seven examples are clearly instances of Definition 2: succeeding generations with the possible exceptions of 2 and 6. But there is considerably more evidence to consider. Now let’s turn to the Anti-Federalist Papers.</div><div> <a name=\"more\"></a></div><div><ul><li><i>Therefore, a general presumption that rulers will govern well is not a sufficient security. — You are then under a sacred obligation to provide for the safety of your posterity, and would you now basely desert their interests, when by a small share of prudence you may transmit to them a beautiful political patrimony, that will prevent the necessity of their travelling through seas of blood to obtain that, which your wisdom might have secured.</i> -Anti-Federalist No. 5, </li><li><i>The first thing I have at heart is American liberty; the second thing is American union; and I hope the people of Virginia will endeavor to preserve that union. The increasing population of the Southern States is far greater than that of New England; consequently, in a short time, they will be far more numerous than the people of that country. Consider this, and you will find this state more particularly interested to support American liberty, and not bind our posterity by an improvident relinquishment of our rights.</i> – Anti-Federalist No. 34, The Problem of Concurrent Taxation</li><li><i>Rouse up, my friends, a matter of infinite importance is before you on the carpet, soon to be decided in your convention: The New Constitution. Seize the happy moment. Secure to yourselves and your posterity the jewel Liberty, which has cost you so much blood and treasure, by a well regulated Bill of Rights, from the encroachments of men in power. For if Congress will do these things in the dry tree when their power is small, what won’t they do when they have all the resources of the United States at their command?</i> – Anti-Federalist No. 13, The Expense of the New Government</li></ul></div><div><div> Notice in No. 34 the way a distinction is made between Virginia’s posterity and the posterity of the 12 other States. This makes it very clear that “our posterity” refers, specifically and solely, to direct genetic descendants and no one else. Furtheremore, there are other relevant examples from the era that underline the same point.</div><div><ul><li><i>We have counted the cost of this contest and find nothing so dreadful as voluntary slavery. Honor, justice, and humanity forbid us tamely to surrender that freedom which we received from our gallant ancestors, and which our innocent posterity have a right to receive from us. </i> – DECLARATION OF TAKING UP ARMS: RESOLUTIONS OF THE SECOND CONTINENTAL CONGRESS JULY 6, 1775</li><li><i>They were governed by counts, sent them by the kings of Oviedo and Leon, until 859, when finding themselves without a chief, because Zeno, who commanded them, was made prisoner, they rose and took arms to resist Ordogne, son of Alfonsus the Third, whose domination was too severe for them, chose for their chief an issue of the blood-royal of Scotland, by the mother’s side, and son-in-law of Zeno their governor, who having overcome Ordogne, in 870, they chose him for their lord, and his posterity, who bore afterwards the name of Haro, succeeded him, from father to son, until the king Don Pedro the Cruel, having put to death those who were in possession of the lordship, reduced them to a treaty, by which they united their country, under the title of a lordship, with Castile, by which convention the king of Spain is now lord of. </i> – John Adams, Letter IV, Biscay</li><li><i>That mankind have a right to bind themselves by their own voluntary acts, can scarcely be questioned: but how far have they a right to enter into engagements to bind their posterity likewise? Are the acts of the dead binding upon their living posterity, to all generations; or has posterity the same natural rights which their ancestors have enjoyed before them? And if they have, what right have any generation of men to establish any particular form of government for succeeding generations? The answer is not difficult: “Government,” said the congress of the American States, in behalf of their constituents, “derives its just authority from the consent of the governed.” This fundamental principle then may serve as a guide to direct our judgment with respect to the question. To which we may add, in the words of the author of Common Sense, a law is not binding upon posterity, merely, because it was made by their ancestors; but, because posterity have not repealed it. It is the acquiescence of posterity under the law, which continues its obligation upon them, and not any right which their ancestors had to </i><i>bind them.</i> – BLACKSTONE’S COMMENTARIES: WITH NOTES OF REFERENCE, TO THE CONSTITUTION AND LAWS, OF THE FEDERAL GOVERNMENT OF THE UNITED STATES; AND OF THE COMMONWEALTH OF VIRGINIA, 1803</li></ul></div><div> First, posterity is directly tied to “ancestors”. Therefore, it means “descendants”. Second, “his posterity” means succession from “father to son” of men bearing the same name. Therefore, it means “descendants”. Third, posterity is again directly tied to ancestors and it is specifically distinguished from “succeeding generations”. In fact, the former is used as potential justification for the latter. Therefore, again, posterity means “descendants”. In fact, it is the first definition of posterity, which Tom incorrectly described as “utter nonsense, start to finish”, that is the only possible definition applicable. Therefore, my case for “ourselves and our posterity” referring solely to direct genetic descendants is not merely correct, it is conclusive.<p>Finally, Tom appealed to the fact that the Founding Fathers had Hobbes in their libraries. But they had John Locke in their libraries as well. And Locke’s reference to posterity not only underlines my case, but deals a fatal blow to the false notion that immigrants and invaders and other pretenders can <i>ever </i>stake a rightful claim to the Blessings of Liberty intended by the American Revolutionaries for their direct genetic descendants.</p></div><div><ul><li><i>No damage therefore, that men in the state of nature (as all princes and governments are in reference to one another) suffer from one another, can give a conqueror power to dispossess the posterity of the vanquished, and turn them out of that inheritance, which ought to be the possession of them and their descendants to all generations. The conqueror indeed will be apt to think himself master: and it is the very condition of the subdued not to be able to dispute their right. But if that be all, it gives no other title than what bare force gives to the stronger over the weaker: and, by this reason, he that is strongest will have a right to whatever he pleases to seize on. </i>– John Locke, Of Conquest, <i>Second Treatise on Civil Government</i>, 1690</li></ul></div></div></div>",
  "content_text": "As you probably know,\nmy argument\nis that the Posterity for whom the Constitution is intended to defend the Blessings of Liberty consists solely of the genetic descendants of the People of the several and united States. Posterity does not include immigrants, descendants of immigrants, invaders, conquerers, tourists, students, Americans born in Portugal, or anyone else who happens to subsequently reside in the same geographic location, or share the same civic ideals, as the original We the People.\nTom Kratman, as part of his series on Civic Nationalism, took a very different stance in an essay entitled\nOurselves and Our Posterity\n. He claims that in this particular case, “our posterity” means nothing more than “succeeding generations”. Read the whole thing, it’s not an incompetent case, merely an incorrect one. Not only that, but he also claims that the alternative definition to which I subscribe, “actual legal descendants and heirs”, is “utter nonsense”. He wrote:\nI’m not sloppy Vox, you’re just wrong, your genetically based posterity argument utter nonsense, start to finish.\nHe also added, rather confidently, that he can match me IQ point for IQ point.\nVox, since you set store by it, I can match you IQ point for IQ point. Yes, I can…\nOnce again. you have a word in the preamble which doesn’t carry it’s own definition. The dictionaries of the day do not help you, because they use three definitions. Within the document, itself, you have clear, absolutely unambiguous evidence that they intended immigration and naturalization because they provided from immigrants to eventually, within their lifetimes, be able to hold any elective office in the land but one. You have the 1790 act, which is commentary on the intent, but not actually necessary because the constitution itself, as mentioned above, provides for the ability of naturalized citizens to become senators and reps. ANd then there is the problem of omission. I mentioned Hobbes in my first post in this thread. Why? I mentioned it because he had translated Thucydides 148 or so years before the revolution; they had that in their libraries, and so they knew about more restrictive – genetic posterity-based – rules for citizenship and neglected to use them. Would have been easy. Didn’t bother. Did, once again, put in provisions for non-genetically based citizens in the highest office.\nNow, I don’t mind people calling me out. It adds a certain flavor to the discourse. The problem, however, is that one’s ability to match me in the decathalon is irrelevant when the contest concerned is the 100-meter dash. This is particularly relevant if you happen to know that I can’t pole vault over my own height. As I warned Tom, his case is an eminently reasonable one, but it is a purely logical argument of the sort preferred by lawyers, the very sort of argument that reliably fails when the relevant evidence is examined. As with many an economic model, Tom’s case relies upon imputing a false rationality and coherence to the behavior of all-too-often irrational and self-contradictory human beings. I could come up with a dozen alternative explanations to his logical conundrum, but I won’t bother, because I have a considerably more effective response to offer.\nThe question is this: how do we determine which of the three definitions of posterity should correctly apply to the term “posterity” as it is used in “ourselves and our posterity”? The answer, as I previously suggested, is straightforward. To understand how the term was meant to be understood in the Preamble, we must look at how the same people using it were using it in their other writings. Fortunately, there are more than a few mentions of “posterity” in both the Federalist and Anti-Federalist Papers which are discussing the very constitution in question. There are seven instances in the Federalist Papers.\nTo this manly spirit, posterity will be indebted for the possession, and the world for the example, of the numerous innovations displayed on the American theatre, in favor of private rights and public happiness.\n(DEFINITION 3: future history)\nIn framing a government for posterity as well as ourselves, we ought, in those provisions which are designed to be permanent, to calculate, not on temporary, but on permanent causes of expense.\n(DEFINITION 3: future history)\nThis dependence, and the necessity of being bound himself, and his posterity, by the laws to which he gives his assent, are the true, and they are the strong chords of sympathy between the representative and the constituent.\n(DEFINITION 1: descendants)\nWE, THE PEOPLE of the United States, to secure the blessings of liberty to ourselves and our posterity, do ORDAIN and ESTABLISH this Constitution for the United States of America.\n(TBD)\nNo partial motive, no particular interest, no pride of opinion, no temporary passion or prejudice, will justify to himself, to his country, or to his posterity, an improper election of the part he is to act.\n(DEFINITION 1: descendants)\n…upon Congress, as they are now constituted; and either the machine, from the intrinsic feebleness of its structure, will moulder into pieces, in spite of our ill-judged efforts to prop it; or, by successive augmentations of its force an energy, as necessity might prompt, we shall finally accumulate, in a single body, all the most important prerogatives of sovereignty, and thus entail upon our posterity one of the most execrable forms of government that human infatuation ever contrived.\n(TBD)\nWhence could it have proceeded, that the Athenians, a people who would not suffer an army to be commanded by fewer than ten generals, and who required no other proof of danger to their liberties than the illustrious merit of a fellow-citizen, should consider one illustrious citizen as a more eligible depositary of the fortunes of themselves and their posterity, than a select body of citizens, from whose common deliberations more wisdom, as well as more safety, might have been expected?\n(DEFINITION 1: descendants)\nNote that the distinction between “posterity”, used in the sense of future history, and “his posterity” and “their posterity”, used in the sense of direct genetic descendants. This suggests that “our posterity” is also meant to be understood in the case of the latter. Also note that none of the seven examples are clearly instances of Definition 2: succeeding generations with the possible exceptions of 2 and 6. But there is considerably more evidence to consider. Now let’s turn to the Anti-Federalist Papers.\nTherefore, a general presumption that rulers will govern well is not a sufficient security. — You are then under a sacred obligation to provide for the safety of your posterity, and would you now basely desert their interests, when by a small share of prudence you may transmit to them a beautiful political patrimony, that will prevent the necessity of their travelling through seas of blood to obtain that, which your wisdom might have secured.\n-Anti-Federalist No. 5,\nThe first thing I have at heart is American liberty; the second thing is American union; and I hope the people of Virginia will endeavor to preserve that union. The increasing population of the Southern States is far greater than that of New England; consequently, in a short time, they will be far more numerous than the people of that country. Consider this, and you will find this state more particularly interested to support American liberty, and not bind our posterity by an improvident relinquishment of our rights.\n– Anti-Federalist No. 34, The Problem of Concurrent Taxation\nRouse up, my friends, a matter of infinite importance is before you on the carpet, soon to be decided in your convention: The New Constitution. Seize the happy moment. Secure to yourselves and your posterity the jewel Liberty, which has cost you so much blood and treasure, by a well regulated Bill of Rights, from the encroachments of men in power. For if Congress will do these things in the dry tree when their power is small, what won’t they do when they have all the resources of the United States at their command?\n– Anti-Federalist No. 13, The Expense of the New Government\nNotice in No. 34 the way a distinction is made between Virginia’s posterity and the posterity of the 12 other States. This makes it very clear that “our posterity” refers, specifically and solely, to direct genetic descendants and no one else. Furtheremore, there are other relevant examples from the era that underline the same point.\nWe have counted the cost of this contest and find nothing so dreadful as voluntary slavery. Honor, justice, and humanity forbid us tamely to surrender that freedom which we received from our gallant ancestors, and which our innocent posterity have a right to receive from us.\n– DECLARATION OF TAKING UP ARMS: RESOLUTIONS OF THE SECOND CONTINENTAL CONGRESS JULY 6, 1775\nThey were governed by counts, sent them by the kings of Oviedo and Leon, until 859, when finding themselves without a chief, because Zeno, who commanded them, was made prisoner, they rose and took arms to resist Ordogne, son of Alfonsus the Third, whose domination was too severe for them, chose for their chief an issue of the blood-royal of Scotland, by the mother’s side, and son-in-law of Zeno their governor, who having overcome Ordogne, in 870, they chose him for their lord, and his posterity, who bore afterwards the name of Haro, succeeded him, from father to son, until the king Don Pedro the Cruel, having put to death those who were in possession of the lordship, reduced them to a treaty, by which they united their country, under the title of a lordship, with Castile, by which convention the king of Spain is now lord of.\n– John Adams, Letter IV, Biscay\nThat mankind have a right to bind themselves by their own voluntary acts, can scarcely be questioned: but how far have they a right to enter into engagements to bind their posterity likewise? Are the acts of the dead binding upon their living posterity, to all generations; or has posterity the same natural rights which their ancestors have enjoyed before them? And if they have, what right have any generation of men to establish any particular form of government for succeeding generations? The answer is not difficult: “Government,” said the congress of the American States, in behalf of their constituents, “derives its just authority from the consent of the governed.” This fundamental principle then may serve as a guide to direct our judgment with respect to the question. To which we may add, in the words of the author of Common Sense, a law is not binding upon posterity, merely, because it was made by their ancestors; but, because posterity have not repealed it. It is the acquiescence of posterity under the law, which continues its obligation upon them, and not any right which their ancestors had to\nbind them.\n– BLACKSTONE’S COMMENTARIES: WITH NOTES OF REFERENCE, TO THE CONSTITUTION AND LAWS, OF THE FEDERAL GOVERNMENT OF THE UNITED STATES; AND OF THE COMMONWEALTH OF VIRGINIA, 1803\nFirst, posterity is directly tied to “ancestors”. Therefore, it means “descendants”. Second, “his posterity” means succession from “father to son” of men bearing the same name. Therefore, it means “descendants”. Third, posterity is again directly tied to ancestors and it is specifically distinguished from “succeeding generations”. In fact, the former is used as potential justification for the latter. Therefore, again, posterity means “descendants”. In fact, it is the first definition of posterity, which Tom incorrectly described as “utter nonsense, start to finish”, that is the only possible definition applicable. Therefore, my case for “ourselves and our posterity” referring solely to direct genetic descendants is not merely correct, it is conclusive.\nFinally, Tom appealed to the fact that the Founding Fathers had Hobbes in their libraries. But they had John Locke in their libraries as well. And Locke’s reference to posterity not only underlines my case, but deals a fatal blow to the false notion that immigrants and invaders and other pretenders can\never\nstake a rightful claim to the Blessings of Liberty intended by the American Revolutionaries for their direct genetic descendants.\nNo damage therefore, that men in the state of nature (as all princes and governments are in reference to one another) suffer from one another, can give a conqueror power to dispossess the posterity of the vanquished, and turn them out of that inheritance, which ought to be the possession of them and their descendants to all generations. The conqueror indeed will be apt to think himself master: and it is the very condition of the subdued not to be able to dispute their right. But if that be all, it gives no other title than what bare force gives to the stronger over the weaker: and, by this reason, he that is strongest will have a right to whatever he pleases to seize on.\n– John Locke, Of Conquest,\nSecond Treatise on Civil Government\n, 1690",
  "tags": [
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-25T16:00:00+00:00"
}