{
  "url": "https://voxday.net/2017/06/07/the-dragon-and-dying-industry/",
  "scraped_at": "2025-12-18T07:17:13.224493",
  "title": "The Dragon and the dying industry",
  "date_display": "June 7, 2017",
  "date_iso": "2017-06-07T10:07:00+00:00",
  "date_from_url": "2017-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russell Newquist announces <a href=\"http://russellnewquist.com/2017/06/2017-dragon-award-nominations/\">his Dragon Award recommendations</a>:</p><blockquote><p> The nomination period for the 2017 Dragon Awards closes very soon. I waited until almost the last minute this year, but I do have a handful of recommendations.</p><ul><li><b>Best Science Fiction Novel</b> – I’m going to have to go with <i>The Secret Kings</i> by Brian Niemeier. Its predecessor proved worthy of last year’s Dragon Award, and the third book in the series only ratchets everything up further. Solid book. Read my review of it here.</li><li><b>Best Fantasy Novel</b> – Hands down, <i>A Sea of Skulls</i> by Vox Day. I’ll have a review of this one up soonish, but this series continues to beat the pants off of A Song of Ice and Fire.</li><li><b>Best Young Adult Novel</b> – <i>Rachel and the Many Splendored Dreamland</i> by L. Jagi Lamplighter. This book actually turned a 13 year old girl (horrible creatures!) into a lovable character, and deserves the award for that alone. But it’s a fantastic book on top of that. See my review for more details.</li><li><b>Best Military SF or Fantasy Novel</b> – I’ve been too busy and haven’t read any this year. ?</li></ul></blockquote><p>Read the rest of them there. I am pleased, however, to see that readers continue to think highly of the Arts of Dark and Light series, and in particular, <i>A Sea of Skulls</i>. It’s interesting to see how there is still absolutely no notice taken of it at all, or of massively successful authors such as Richard Fox, BV Larson, David VanDyke, Nick Cole, Vaughn Heppner, Christopher Nuttall, in the mainstream SF/F publishing world.</p><p>Which, of course, is one reason why the mainstream SF/F publishing world is dying. File 770 chronicles <a href=\"http://file770.com/?p=35503\">the shrinkage of BookExpo</a>:</p><blockquote><p> Having attended from the mid 1970s to now, I’ve seen the convention grow enormously, with extravagant parties and promotional events — parties on paddle wheelers in New Orleans, at Hugh Hefner’s mansion in LA, at Radio City Music Hall in NYC, and the party in DC for The Name of the Rose, held at the Italian Embassy’s estate — among memorable soirees, and then shrink from more than 40,000 attendees to the current ensmalled convention, with exhibits taking a fraction of the space they used to.</p><p>There were wide empty places on the exhibit floor that in years past would have had booths shoe-horned in everywhere; empty spaces behind black curtains where nothing was happening; meeting rooms that in previous years would have been on other floors.</p><p>Many of the older exhibitors I talked to commented on this shrinking convention, and wondered what the future would bring. The convention has already become a 2-and-a-half day event from 4-5 days previously. It’s rattling around in the Javits Center now, and I wonder whether it could go back to being held in a few large hotels instead. Or back to DC’s Shoreham Hotel, where it was held for decades, with the publishers displaying their wares on card tables in the hotel’s garage.</p></blockquote><p><a href=\"https://pbs.twimg.com/media/DBpANlEW0AAWgp0.jpg:large\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" data-original-height=\"240\" data-original-width=\"320\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DBpANlEW0AAWgp0.jpg:large\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"240\" data-original-width=\"320\" data-src=\"https://pbs.twimg.com/media/DBpANlEW0AAWgp0.jpg:large\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20240%22%3E%3C/svg%3E\"/></a>But the shrinking trade shows and aging fan conventions aren’t the only sign. I have been increasingly hearing about cuts at Tor, Baen, Orbit, and other publishing houses, cuts that include names most SF readers would recognize. Most of this information isn’t public yet, but don’t be surprised when you start seeing familiar names gravitating to independent publishing houses or suddenly deciding to “dip a toe” into the wild West of self-publishing.</p><p>The product is the problem. But it certainly doesn’t help that mainstream SF/F is increasingly a pure SJW freakshow, written by, published by, and read by socially hapless freaks whose only appeal is to their fellow social justice warriors. The photo, taken at BookExpo, is a graphic illustration of the decline and fall of science fiction in a snapshot.</p></div>",
  "content_text": "Russell Newquist announces\nhis Dragon Award recommendations\n:\nThe nomination period for the 2017 Dragon Awards closes very soon. I waited until almost the last minute this year, but I do have a handful of recommendations.\nBest Science Fiction Novel\n– I’m going to have to go with\nThe Secret Kings\nby Brian Niemeier. Its predecessor proved worthy of last year’s Dragon Award, and the third book in the series only ratchets everything up further. Solid book. Read my review of it here.\nBest Fantasy Novel\n– Hands down,\nA Sea of Skulls\nby Vox Day. I’ll have a review of this one up soonish, but this series continues to beat the pants off of A Song of Ice and Fire.\nBest Young Adult Novel\n–\nRachel and the Many Splendored Dreamland\nby L. Jagi Lamplighter. This book actually turned a 13 year old girl (horrible creatures!) into a lovable character, and deserves the award for that alone. But it’s a fantastic book on top of that. See my review for more details.\nBest Military SF or Fantasy Novel\n– I’ve been too busy and haven’t read any this year. ?\nRead the rest of them there. I am pleased, however, to see that readers continue to think highly of the Arts of Dark and Light series, and in particular,\nA Sea of Skulls\n. It’s interesting to see how there is still absolutely no notice taken of it at all, or of massively successful authors such as Richard Fox, BV Larson, David VanDyke, Nick Cole, Vaughn Heppner, Christopher Nuttall, in the mainstream SF/F publishing world.\nWhich, of course, is one reason why the mainstream SF/F publishing world is dying. File 770 chronicles\nthe shrinkage of BookExpo\n:\nHaving attended from the mid 1970s to now, I’ve seen the convention grow enormously, with extravagant parties and promotional events — parties on paddle wheelers in New Orleans, at Hugh Hefner’s mansion in LA, at Radio City Music Hall in NYC, and the party in DC for The Name of the Rose, held at the Italian Embassy’s estate — among memorable soirees, and then shrink from more than 40,000 attendees to the current ensmalled convention, with exhibits taking a fraction of the space they used to.\nThere were wide empty places on the exhibit floor that in years past would have had booths shoe-horned in everywhere; empty spaces behind black curtains where nothing was happening; meeting rooms that in previous years would have been on other floors.\nMany of the older exhibitors I talked to commented on this shrinking convention, and wondered what the future would bring. The convention has already become a 2-and-a-half day event from 4-5 days previously. It’s rattling around in the Javits Center now, and I wonder whether it could go back to being held in a few large hotels instead. Or back to DC’s Shoreham Hotel, where it was held for decades, with the publishers displaying their wares on card tables in the hotel’s garage.\nBut the shrinking trade shows and aging fan conventions aren’t the only sign. I have been increasingly hearing about cuts at Tor, Baen, Orbit, and other publishing houses, cuts that include names most SF readers would recognize. Most of this information isn’t public yet, but don’t be surprised when you start seeing familiar names gravitating to independent publishing houses or suddenly deciding to “dip a toe” into the wild West of self-publishing.\nThe product is the problem. But it certainly doesn’t help that mainstream SF/F is increasingly a pure SJW freakshow, written by, published by, and read by socially hapless freaks whose only appeal is to their fellow social justice warriors. The photo, taken at BookExpo, is a graphic illustration of the decline and fall of science fiction in a snapshot.",
  "tags": [
    "books",
    "Pink SF",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-07T09:07:00+00:00"
}