{
  "url": "https://voxday.net/2017/06/28/threatening-violence/",
  "scraped_at": "2025-12-18T07:20:10.539109",
  "title": "Threatening violence",
  "date_display": "June 28, 2017",
  "date_iso": "2017-06-28T08:54:00+00:00",
  "date_from_url": "2017-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This comment was left on this blog yesterday:</p><blockquote><p> Black Oathkeeper June 27, 2017 6:40 PM<br> First off, I’m an Oathkeeper and a black conservative and if any of y’all said filth like “blacks are inherently violent” to my black face, I’d knock your rotten teeth out.</br></p><p>Ps: All y’all from Vox Day who spammed our website today, just know we have your IP address and have passed it along to the authorities. Many in law enforcement are VERY interested in racist groups like the Alt-Right.</p></blockquote><p>At first, we assumed that it was a troll pretending to be an Oathkeeper, given the absurd posturing of the commenter and the inaccurate information it contained. But then we looked up the IP address of the commenter and learned that it pointed to Hamilton, Montana. A search for Oathkeepers connected to Montana revealed that one of the members of their Board of Directors, Greg McWhirter, <a href=\"https://www.oathkeepers.org/board-of-directors/\">is a Montana resident</a>.</p><p><i>Greg McWhirter was born and raised in the inner city of Indianapolis. He served as a Marion County for 11 years until 2015, when he took a law enforcement position in Montana.</i></p><p>Of course, Montana is a big state. But a little more searching revealed a Gregory McWhirter who lives in Hamilton, Montana, and previously lived in Indianapolis.<br> <i><br/></i><br> <i>Gregory Mcwhirter</i><br> <i>Lives in Hamilton MT</i><br> <i>Used to live in Hamilton MT, Indianapolis IN</i></br></br></br></br></p><p>It looks as if we <i>may </i>have our culprit. I have contacted two of the Oathkeepers’ Directors today to ask them to investigate the incident, and, if Mr. McWhirter is indeed determined to be the responsible party, learn if they endorse this kind of behavior on the part of their Directors. Depending upon their response, we may also consider lodging a complaint with the Hamilton police concerning what appears to be a violation of Montana’s privacy in communications act.</p><p><u>45-8-213</u>. Privacy in communications. <i>(1) “Except as provided in 69-6-104, a person commits the offense of violating privacy in communications if the person knowingly or purpose”</i><br> <i>(a) “with the purpose to terrify, intimidate, threaten, harass, annoy, or offend, communicates with a person by telephone or electronic mail and uses obscene, lewd, or profane language, suggests a lewd or lascivious act, or threatens to inflict injury or physical harm to the person or property of the person. The use of obscene, lewd, or profane language or the making of a threat or lewd or lascivious suggestions is prima facie evidence of an intent to terrify, intimidate, threaten, harass, annoy, or offend.”</i></br></p><p> UPDATE: I have heard back from Oathkeepers. They assure me that they will be discussing this matter with the Board of Directors.</p></div>",
  "content_text": "This comment was left on this blog yesterday:\nBlack Oathkeeper June 27, 2017 6:40 PM\nFirst off, I’m an Oathkeeper and a black conservative and if any of y’all said filth like “blacks are inherently violent” to my black face, I’d knock your rotten teeth out.\nPs: All y’all from Vox Day who spammed our website today, just know we have your IP address and have passed it along to the authorities. Many in law enforcement are VERY interested in racist groups like the Alt-Right.\nAt first, we assumed that it was a troll pretending to be an Oathkeeper, given the absurd posturing of the commenter and the inaccurate information it contained. But then we looked up the IP address of the commenter and learned that it pointed to Hamilton, Montana. A search for Oathkeepers connected to Montana revealed that one of the members of their Board of Directors, Greg McWhirter,\nis a Montana resident\n.\nGreg McWhirter was born and raised in the inner city of Indianapolis. He served as a Marion County for 11 years until 2015, when he took a law enforcement position in Montana.\nOf course, Montana is a big state. But a little more searching revealed a Gregory McWhirter who lives in Hamilton, Montana, and previously lived in Indianapolis.\nGregory Mcwhirter\nLives in Hamilton MT\nUsed to live in Hamilton MT, Indianapolis IN\nIt looks as if we\nmay\nhave our culprit. I have contacted two of the Oathkeepers’ Directors today to ask them to investigate the incident, and, if Mr. McWhirter is indeed determined to be the responsible party, learn if they endorse this kind of behavior on the part of their Directors. Depending upon their response, we may also consider lodging a complaint with the Hamilton police concerning what appears to be a violation of Montana’s privacy in communications act.\n45-8-213\n. Privacy in communications.\n(1) “Except as provided in 69-6-104, a person commits the offense of violating privacy in communications if the person knowingly or purpose”\n(a) “with the purpose to terrify, intimidate, threaten, harass, annoy, or offend, communicates with a person by telephone or electronic mail and uses obscene, lewd, or profane language, suggests a lewd or lascivious act, or threatens to inflict injury or physical harm to the person or property of the person. The use of obscene, lewd, or profane language or the making of a threat or lewd or lascivious suggestions is prima facie evidence of an intent to terrify, intimidate, threaten, harass, annoy, or offend.”\nUPDATE: I have heard back from Oathkeepers. They assure me that they will be discussing this matter with the Board of Directors.",
  "tags": [
    "cuckservative",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-28T07:54:00+00:00"
}