{
  "url": "https://voxday.net/2017/06/19/we-have-hasbara/",
  "scraped_at": "2025-12-18T07:18:58.950767",
  "title": "Zerohedge has hasbara",
  "date_display": "June 19, 2017",
  "date_iso": "2017-06-19T17:02:00+00:00",
  "date_from_url": "2017-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently Robert Trip has been hired to run around to different right-wing sites and proclaim that Alex Jones and Mike Cernovich were “hog-tailed” by Megyn Kelly. From Zerohedge:</p><blockquote><p> Robert Trip Jun 19, 2017 12:39 PM<br> The poor bastard didn’t stand a fucking chance going head to head with the Power Chick.</br></p><p>I’ve replayed the interview and I’ve never seen anyone get hog-tailed like that.</p><p> Robert Trip Jun 19, 2017 12:17 PM<br> Alex.</br></p><p>Take it like a man and stop whining.</p><p>You were had in spades, big time.</p><p>Raked over the coals.</p><p>Wow! What a total beat down!</p></blockquote><p>However, he is NOT RobertT here. Robert is honestly dubious.</p><blockquote><p> RobertT June 19, 2017 11:39 AM <br> Only idiots mess with the media. Cernovich, jones don’t seem to understand, when it comes to the media, sheer numbers outweigh everything else. Most people don’t even know what all the uproar was about, they just know what the MSM said. And even if they don’t trust the MSM, that is still all they know. My advice, just try to stay completely off their radar. Eventually they lose interest. If your reputation is still intact, count yourself lucky.</br></p><p>RobertT June 19, 2017 11:48 AM <br> People who are pretending Cernovich &amp; Jones ‘won’ are mistaken. That’s not to say it’s not helpful to the movement for people to fall on their swords now and then. But in the final analysis, that’s what they did.</br></p><p>RobertT June 19, 2017 11:57 AM <br> The only things saving Trump is his twitter feed. And Rush. And the fact that he is constantly on the attack. The MSM is constantly responding. Believe me, they may hate his guts, but they enjoy the game. Cernovich and Jones tried to do it the old way, tried to win on the facts. In Trump’s world, what’s a fact? How could they miss that?</br></p></blockquote><p>Keep this in mind whenever you’re running into commenters on a site who can’t be reasoned with, but stick firmly to their narrative. If they’re not an SJW, they’re probably paid hasbara.</p></div>",
  "content_text": "Apparently Robert Trip has been hired to run around to different right-wing sites and proclaim that Alex Jones and Mike Cernovich were “hog-tailed” by Megyn Kelly. From Zerohedge:\nRobert Trip Jun 19, 2017 12:39 PM\nThe poor bastard didn’t stand a fucking chance going head to head with the Power Chick.\nI’ve replayed the interview and I’ve never seen anyone get hog-tailed like that.\nRobert Trip Jun 19, 2017 12:17 PM\nAlex.\nTake it like a man and stop whining.\nYou were had in spades, big time.\nRaked over the coals.\nWow! What a total beat down!\nHowever, he is NOT RobertT here. Robert is honestly dubious.\nRobertT June 19, 2017 11:39 AM\nOnly idiots mess with the media. Cernovich, jones don’t seem to understand, when it comes to the media, sheer numbers outweigh everything else. Most people don’t even know what all the uproar was about, they just know what the MSM said. And even if they don’t trust the MSM, that is still all they know. My advice, just try to stay completely off their radar. Eventually they lose interest. If your reputation is still intact, count yourself lucky.\nRobertT June 19, 2017 11:48 AM\nPeople who are pretending Cernovich & Jones ‘won’ are mistaken. That’s not to say it’s not helpful to the movement for people to fall on their swords now and then. But in the final analysis, that’s what they did.\nRobertT June 19, 2017 11:57 AM\nThe only things saving Trump is his twitter feed. And Rush. And the fact that he is constantly on the attack. The MSM is constantly responding. Believe me, they may hate his guts, but they enjoy the game. Cernovich and Jones tried to do it the old way, tried to win on the facts. In Trump’s world, what’s a fact? How could they miss that?\nKeep this in mind whenever you’re running into commenters on a site who can’t be reasoned with, but stick firmly to their narrative. If they’re not an SJW, they’re probably paid hasbara.",
  "tags": [
    "conspiracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-06-19T16:02:00+00:00"
}