{
  "url": "https://voxday.net/2022/11/12/castalia-library-clarification/",
  "scraped_at": "2026-01-08T13:37:31.917610",
  "title": "Castalia Library Clarification",
  "date_display": "November 12, 2022",
  "date_iso": "2022-11-12T18:10:57+00:00",
  "date_from_url": "2022-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contra my previous post on the subject, the November-December book, #19 in the Castalia Library subscription, is <em>THE LAWDOG FILES</em> by Lawdog. This is actually two books in one, because it contains both <em>THE LAWDOG FILES</em> and <em>THE LAWDOG FILES: AFRICAN ADVENTURES</em>. And consequently, this means THE ARTS OF WAR, featuring an introduction by Alex Macris, will be the January-February book, #20 in the subscription.</p><p>I’m sorry for the confusion, but somehow I forgot that we’ve already printed the interiors of <em>LAWDOG </em>and so we can get it shipped sooner than we can ship <em>THE ARTS</em>. The site store has already been updated accordingly. But if, for whatever reason, you a) subscribed in the week between November 5 and November 12, and b) do not want LAWDOG, please email me and let me know which of the previously released books you would like instead.</p><p>Also, if you’re on Gab, please note that we’ve established <a href=\"https://gab.com/CastaliaLibrary\">a Library account there</a> which you can follow for regular updates and announcements.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A critter well known to us in our town twisted off one evening and decided to add Attempted Murder to his curriculum vitae by hitting his lady<em> du jour</em> in the head a couple of times with a hatchet. Not one to leave a job half done, he dragged her out to the lake, wired her up to a cinderblock, and shoved her off into the water. Wonder of wonders, she survived. Even bigger wonder, she came into town and filed charges on her homicidal boyfriend. I had been out on a date and wandered back into town about the time that the search was really getting wound up. I’d no sooner walked through the door of the office when the sheriff hit me with three conflicting orders on where to go, one of which would require asbestos underoos. I decided that going back home to change out of my date clothes would be counterproductive, so I was digging through my locker trying to find my spare set of armor when the call came in. One of our local merchants had spotted the critter climbing in the back window of an abandoned building used for storage. Since the other two deputies were on the far side of the county, the sheriff made a posse of me and a luckless Highway Patrol Trooper who had come in for a coffee refill, and we went tear-arsing off to Downtown Bugscuffle. The abandoned building in question had, at one time, been a fairly swanky department store positioned on the prize end of Main Street. However, in the intervening hundred years or so, the entire block had fallen into disuse and disrepair, leaving the once-grand old building standing all alone, used only for storing various and sundry stuff that needed storing by the locals.</p><p>For those of you who don’t know how to search a large building with only three people, it’s really quite simple. One officer, whom we’ll call “the sheriff,” stands on one corner watching the front of the building and the west side. The second officer, or “random DPS trooper,” stands at the opposite corner of the building, watching the back of the building and the east side. The third officer, being the bravest and most handsome of the three, goes inside with the idea of flushing the critter out a window where he can be spotted by one of the other two and, hopefully, arrested.</p><p>Three guesses who got to go inside, and the first two don’t count. Let me tell you, that place was darker than the Earl of Hell’s waistcoat and stacked floor-to-ceiling with shelves. On those shelves were the collected knick-knacks of 20 years of Main Street stores. And not a lightbulb anywhere.</p><p>There I was, with a snubbie .357, a five-cell Maglight, and a Handi-Talkie, and only two hands. About the fourth time I tried to answer the sheriff’s “Have you got him yet?” radio call while trying to cover a suspicious patch of darkness with the .357 and juggling the Mag-Lite, I stopped in the feeble light of the moon shining down through a hole in the ceiling to make a few adjustments.</p><p>I was occupied with trying to figure out which I needed more, the Mag-lite or the Handi-talkie, when the SOB decided to jump me. I’m here to tell you, folks, things went rodeo from there. He lunged out of a shadow and tried to grab for my throat, and me, reacting totally out of instinct, I whacked him a good one across the forehead with the Maglight.</p><p>Bulb, batteries, and assorted electronic parts arced gracefully into the darkness. The critter took one step back and jumped at me again.</p><p>Things were not looking good in Dogville.</p><p>I held the snubbie back with my right hand, trying to keep it away from the critter’s grasp, and I tried to stiff-arm him away with my left when I stepped onto what was later found to be a D-cell battery from my Maglight.</p><p>Down I went. And the alleged aspiring axe murderer landed on top of me. Hoo boy. The gloves really came off then. We rolled around on the cold cement. I was hitting him in the head with the butt of my revolver and giving him elbow smashes to the jaw and brachial plexus, knee strikes, you name it, the whole enchilada. And he kept grabbing at my throat.</p><p>Finally, we rolled into a patch of moonlight, and I saw the bastard had a knife!</p><p>Folks, I hate knives. No, I really hate knives. He was on top of me, and he had to weigh three-hundred pounds, and that damn knife was coming down at me in slow motion at just about the same time the barrel of my snubbie rammed up under his chin.</p><p>I squeezed off two rounds.</p><p>The .357 magnum is a powerful round. Two of them, fired in quick succession, sufficed to blow the electronic brains and assorted stuffing of the Animatronic Life-Like Talking Santa Claus that formerly belonged to the local Thriftway halfway to Dodge City.</p><p>You don’t want to know what a couple of .357 rounds will do to hydraulics.</p><p><em>sigh</em></p> <cite>“The Good Shoot”,<em> THE LAWDOG FILES</em>, Castalia Library #19</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/b17f2ef2-25af-4e24-9759-525d97543b90\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Contra my previous post on the subject, the November-December book, #19 in the Castalia Library subscription, is\nTHE LAWDOG FILES\nby Lawdog. This is actually two books in one, because it contains both\nTHE LAWDOG FILES\nand\nTHE LAWDOG FILES: AFRICAN ADVENTURES\n. And consequently, this means THE ARTS OF WAR, featuring an introduction by Alex Macris, will be the January-February book, #20 in the subscription.\nI’m sorry for the confusion, but somehow I forgot that we’ve already printed the interiors of\nLAWDOG\nand so we can get it shipped sooner than we can ship\nTHE ARTS\n. The site store has already been updated accordingly. But if, for whatever reason, you a) subscribed in the week between November 5 and November 12, and b) do not want LAWDOG, please email me and let me know which of the previously released books you would like instead.\nAlso, if you’re on Gab, please note that we’ve established\na Library account there\nwhich you can follow for regular updates and announcements.\nA critter well known to us in our town twisted off one evening and decided to add Attempted Murder to his curriculum vitae by hitting his lady\ndu jour\nin the head a couple of times with a hatchet. Not one to leave a job half done, he dragged her out to the lake, wired her up to a cinderblock, and shoved her off into the water. Wonder of wonders, she survived. Even bigger wonder, she came into town and filed charges on her homicidal boyfriend. I had been out on a date and wandered back into town about the time that the search was really getting wound up. I’d no sooner walked through the door of the office when the sheriff hit me with three conflicting orders on where to go, one of which would require asbestos underoos. I decided that going back home to change out of my date clothes would be counterproductive, so I was digging through my locker trying to find my spare set of armor when the call came in. One of our local merchants had spotted the critter climbing in the back window of an abandoned building used for storage. Since the other two deputies were on the far side of the county, the sheriff made a posse of me and a luckless Highway Patrol Trooper who had come in for a coffee refill, and we went tear-arsing off to Downtown Bugscuffle. The abandoned building in question had, at one time, been a fairly swanky department store positioned on the prize end of Main Street. However, in the intervening hundred years or so, the entire block had fallen into disuse and disrepair, leaving the once-grand old building standing all alone, used only for storing various and sundry stuff that needed storing by the locals.\nFor those of you who don’t know how to search a large building with only three people, it’s really quite simple. One officer, whom we’ll call “the sheriff,” stands on one corner watching the front of the building and the west side. The second officer, or “random DPS trooper,” stands at the opposite corner of the building, watching the back of the building and the east side. The third officer, being the bravest and most handsome of the three, goes inside with the idea of flushing the critter out a window where he can be spotted by one of the other two and, hopefully, arrested.\nThree guesses who got to go inside, and the first two don’t count. Let me tell you, that place was darker than the Earl of Hell’s waistcoat and stacked floor-to-ceiling with shelves. On those shelves were the collected knick-knacks of 20 years of Main Street stores. And not a lightbulb anywhere.\nThere I was, with a snubbie .357, a five-cell Maglight, and a Handi-Talkie, and only two hands. About the fourth time I tried to answer the sheriff’s “Have you got him yet?” radio call while trying to cover a suspicious patch of darkness with the .357 and juggling the Mag-Lite, I stopped in the feeble light of the moon shining down through a hole in the ceiling to make a few adjustments.\nI was occupied with trying to figure out which I needed more, the Mag-lite or the Handi-talkie, when the SOB decided to jump me. I’m here to tell you, folks, things went rodeo from there. He lunged out of a shadow and tried to grab for my throat, and me, reacting totally out of instinct, I whacked him a good one across the forehead with the Maglight.\nBulb, batteries, and assorted electronic parts arced gracefully into the darkness. The critter took one step back and jumped at me again.\nThings were not looking good in Dogville.\nI held the snubbie back with my right hand, trying to keep it away from the critter’s grasp, and I tried to stiff-arm him away with my left when I stepped onto what was later found to be a D-cell battery from my Maglight.\nDown I went. And the alleged aspiring axe murderer landed on top of me. Hoo boy. The gloves really came off then. We rolled around on the cold cement. I was hitting him in the head with the butt of my revolver and giving him elbow smashes to the jaw and brachial plexus, knee strikes, you name it, the whole enchilada. And he kept grabbing at my throat.\nFinally, we rolled into a patch of moonlight, and I saw the bastard had a knife!\nFolks, I hate knives. No, I really hate knives. He was on top of me, and he had to weigh three-hundred pounds, and that damn knife was coming down at me in slow motion at just about the same time the barrel of my snubbie rammed up under his chin.\nI squeezed off two rounds.\nThe .357 magnum is a powerful round. Two of them, fired in quick succession, sufficed to blow the electronic brains and assorted stuffing of the Animatronic Life-Like Talking Santa Claus that formerly belonged to the local Thriftway halfway to Dodge City.\nYou don’t want to know what a couple of .357 rounds will do to hydraulics.\nsigh\n“The Good Shoot”,\nTHE LAWDOG FILES\n, Castalia Library #19\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-12T18:10:59+00:00"
}