{
  "url": "https://voxday.net/2022/11/01/never-to-forgive-never-to-forget/",
  "scraped_at": "2026-01-08T13:36:18.998357",
  "title": "Never to Forgive, Never to Forget",
  "date_display": "November 1, 2022",
  "date_iso": "2022-11-01T10:35:38+00:00",
  "date_from_url": "2022-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.theatlantic.com/ideas/archive/2022/10/covid-response-forgiveness/671879/\">There will be no “pandemic amnesty”</a>. Those of us who weren’t stupid enough to fall for the obvious lies of the global depopulationists, the corrupt scientists, and the media are neither going to forgive nor forget the lies that were told, the incessant attacks on us, or the price that is still being paid by our friends and family members who refused to listen to us.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When the vaccines came out, we lacked definitive data on the relative efficacies of the Johnson &amp; Johnson shot versus the mRNA options from Pfizer and Moderna. The mRNA vaccines have won out. But at the time, many people in public health were either neutral or expressed a J&amp;J preference. This misstep wasn’t nefarious. It was the result of uncertainty….</p><p>Given the amount of uncertainty, almost every position was taken on every topic. And on every topic, someone was eventually proved right, and someone else was proved wrong. In some instances, the right people were right for the wrong reasons. In other instances, they had a prescient understanding of the available information.</p><p>The people who got it right, for whatever reason, may want to gloat. Those who got it wrong, for whatever reason, may feel defensive and retrench into a position that doesn’t accord with the facts. All of this gloating and defensiveness continues to gobble up a lot of social energy and to drive the culture wars, especially on the internet. These discussions are heated, unpleasant and, ultimately, unproductive. In the face of so much uncertainty, getting something right had a hefty element of luck. And, similarly, getting something wrong wasn’t a moral failing. Treating pandemic choices as a scorecard on which some people racked up more points than others is preventing us from moving forward.</p><p>We have to put these fights aside and declare a pandemic amnesty. We can leave out the willful purveyors of actual misinformation while forgiving the hard calls that people had no choice but to make with imperfect knowledge. Los Angeles County closed its beaches in summer 2020. Ex post facto, this makes no more sense than my family’s masked hiking trips. But we need to learn from our mistakes and then let them go. We need to forgive the attacks, too. Because I thought schools should reopen and argued that kids as a group were not at high risk, I was called a “teacher killer” and a “génocidaire.” It wasn’t pleasant, but feelings were high. And I certainly don’t need to dissect and rehash that time for the rest of my days.</p><p>Moving on is crucial now, because the pandemic created many problems that we still need to solve.</p></blockquote><p>There is no forgiveness without repentance. Not only is there no repentance from the pro-vaccine side, many of their lies are still being told! And the gaslighting and backpedaling by the politicians, the corporations, and the pharmaceutical companies – <em>we never said the vaccines would prevent the transmission of COVID or forced anyone to get vaccinated</em> – is absolutely unrepentant and unconscionable.</p><p>As Spacebunny <a href=\"https://gab.com/Spacebunny/posts/109264420510287654\">aptly quoted Cerno</a>, “there is no reconciliation without restitution.”</p><p>The only way to learn from mistakes is to admit them, and virtually no one who got vaccinated and/or pushed the vaccination on others is even willing to admit they were mistaken, much less repent of their foolish and hateful words. All of them will pay a price for their decisions, both physically and in terms of the way in which their decision-making capabilities will be regarded in the future. It is a price that is not only inescapable, but entirely merited.</p><p>The ongoing problems will not be solved by the people who created and exacerbated them, especially not when those people are desperate to deny their responsibility for the problems.</p><p>Never ascribe to uncertainty or error that which can be explained by malicious and satanic evil.</p><p><em><a href=\"https://social.infogalactic.com/micropost/50f3dda4-0f9c-431d-b801-01398df60afe\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "There will be no “pandemic amnesty”\n. Those of us who weren’t stupid enough to fall for the obvious lies of the global depopulationists, the corrupt scientists, and the media are neither going to forgive nor forget the lies that were told, the incessant attacks on us, or the price that is still being paid by our friends and family members who refused to listen to us.\nWhen the vaccines came out, we lacked definitive data on the relative efficacies of the Johnson & Johnson shot versus the mRNA options from Pfizer and Moderna. The mRNA vaccines have won out. But at the time, many people in public health were either neutral or expressed a J&J preference. This misstep wasn’t nefarious. It was the result of uncertainty….\nGiven the amount of uncertainty, almost every position was taken on every topic. And on every topic, someone was eventually proved right, and someone else was proved wrong. In some instances, the right people were right for the wrong reasons. In other instances, they had a prescient understanding of the available information.\nThe people who got it right, for whatever reason, may want to gloat. Those who got it wrong, for whatever reason, may feel defensive and retrench into a position that doesn’t accord with the facts. All of this gloating and defensiveness continues to gobble up a lot of social energy and to drive the culture wars, especially on the internet. These discussions are heated, unpleasant and, ultimately, unproductive. In the face of so much uncertainty, getting something right had a hefty element of luck. And, similarly, getting something wrong wasn’t a moral failing. Treating pandemic choices as a scorecard on which some people racked up more points than others is preventing us from moving forward.\nWe have to put these fights aside and declare a pandemic amnesty. We can leave out the willful purveyors of actual misinformation while forgiving the hard calls that people had no choice but to make with imperfect knowledge. Los Angeles County closed its beaches in summer 2020. Ex post facto, this makes no more sense than my family’s masked hiking trips. But we need to learn from our mistakes and then let them go. We need to forgive the attacks, too. Because I thought schools should reopen and argued that kids as a group were not at high risk, I was called a “teacher killer” and a “génocidaire.” It wasn’t pleasant, but feelings were high. And I certainly don’t need to dissect and rehash that time for the rest of my days.\nMoving on is crucial now, because the pandemic created many problems that we still need to solve.\nThere is no forgiveness without repentance. Not only is there no repentance from the pro-vaccine side, many of their lies are still being told! And the gaslighting and backpedaling by the politicians, the corporations, and the pharmaceutical companies –\nwe never said the vaccines would prevent the transmission of COVID or forced anyone to get vaccinated\n– is absolutely unrepentant and unconscionable.\nAs Spacebunny\naptly quoted Cerno\n, “there is no reconciliation without restitution.”\nThe only way to learn from mistakes is to admit them, and virtually no one who got vaccinated and/or pushed the vaccination on others is even willing to admit they were mistaken, much less repent of their foolish and hateful words. All of them will pay a price for their decisions, both physically and in terms of the way in which their decision-making capabilities will be regarded in the future. It is a price that is not only inescapable, but entirely merited.\nThe ongoing problems will not be solved by the people who created and exacerbated them, especially not when those people are desperate to deny their responsibility for the problems.\nNever ascribe to uncertainty or error that which can be explained by malicious and satanic evil.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-01T11:24:58+00:00"
}