{
  "url": "https://voxday.net/2022/11/20/rip-greg-bear/",
  "scraped_at": "2026-01-08T13:38:29.520101",
  "title": "RIP Greg Bear",
  "date_display": "November 20, 2022",
  "date_iso": "2022-11-20T12:05:27+00:00",
  "date_from_url": "2022-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://arkhavencomics.com/2022/11/20/greg-bear-1951-2022/\">Five-time Nebula winner Greg Bear died</a> November 19, a week after heart surgery from which he never awoke. A CT scan showed stroke damage was caused to many parts of the brain by clots that had been hiding in a false lumen of the anterior artery to the brain ever since an earlier surgery eight years ago. After a review of the possible outcomes by the medical team, and following the wishes expressed in his advance directive, Bear was taken off life support and died two hours later.</em></p><p>He wasn’t a major talent or a SF icon, but he was a legitimate author who represented the last gasp of mainstream science fiction being founded in actual science. I didn’t know him, and I didn’t particularly like the three or four books of his that I read, but his passing is indicative of an era that is observably in the process of ending.</p><p><em><a href=\"https://social.infogalactic.com/micropost/aa2324c9-29c0-4d68-8dc2-2cefaf7afd37\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Five-time Nebula winner Greg Bear died\nNovember 19, a week after heart surgery from which he never awoke. A CT scan showed stroke damage was caused to many parts of the brain by clots that had been hiding in a false lumen of the anterior artery to the brain ever since an earlier surgery eight years ago. After a review of the possible outcomes by the medical team, and following the wishes expressed in his advance directive, Bear was taken off life support and died two hours later.\nHe wasn’t a major talent or a SF icon, but he was a legitimate author who represented the last gasp of mainstream science fiction being founded in actual science. I didn’t know him, and I didn’t particularly like the three or four books of his that I read, but his passing is indicative of an era that is observably in the process of ending.\nDISCUSS ON SG",
  "tags": [
    "books",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-20T12:46:15+00:00"
}