{
  "url": "https://voxday.net/2022/11/11/the-oathkeepers-glowed/",
  "scraped_at": "2026-01-08T13:37:24.621739",
  "title": "The Oathkeepers Glowed",
  "date_display": "November 11, 2022",
  "date_iso": "2022-11-11T20:10:11+00:00",
  "date_from_url": "2022-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is not exactly surprising to anyone who has been paying attention to organizations like Unite the Right, the Oathkeepers, and the Patriot Front over the last few years. The FBI is treating the white Right <a href=\"https://archive.ph/y4sR5\">in much the same manner</a> it treated the black Left in the 1960s.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>An F.B.I. informant who was embedded for months in the inner circle of Stewart Rhodes, the leader of the Oath Keepers militia, is likely to testify as a defense witness at the seditious conspiracy trial of Mr. Rhodes in connection with the attack on the Capitol on Jan. 6, 2021.</p><p>The informant, Greg McWhirter, served as the Oath Keepers’ vice president but was secretly reporting to the F.B.I. about the group’s activities in the weeks and months leading up to the Capitol attack, according to two people familiar with the matter.</p><p>Despite their relationship with Mr. McWhirter, federal prosecutors decided not to call him as a government witness at the trial of Mr. Rhodes and his four co-defendants, which is now unfolding in Federal District Court in Washington. The prosecution rested its case last week without calling other key cooperating witnesses, including three members of the Oath Keepers who pleaded guilty to seditious conspiracy charges….</p><p>Mr. McWhirter is the second known F.B.I. confidential source who was in a position to provide information to federal agents about the Oath Keepers before Jan. 6, raising questions about why investigators did not know more about the attack on the Capitol.</p></blockquote><p>Federal investigators knew everything about the so-called “attack on the Capitol” because they planned it. About the only more patently obvious false flag is the next one, the one that will provide the USA with a <em>casus belli</em> against Russia.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3aab3cd1-e158-49eb-8614-fbd362c00583\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is not exactly surprising to anyone who has been paying attention to organizations like Unite the Right, the Oathkeepers, and the Patriot Front over the last few years. The FBI is treating the white Right\nin much the same manner\nit treated the black Left in the 1960s.\nAn F.B.I. informant who was embedded for months in the inner circle of Stewart Rhodes, the leader of the Oath Keepers militia, is likely to testify as a defense witness at the seditious conspiracy trial of Mr. Rhodes in connection with the attack on the Capitol on Jan. 6, 2021.\nThe informant, Greg McWhirter, served as the Oath Keepers’ vice president but was secretly reporting to the F.B.I. about the group’s activities in the weeks and months leading up to the Capitol attack, according to two people familiar with the matter.\nDespite their relationship with Mr. McWhirter, federal prosecutors decided not to call him as a government witness at the trial of Mr. Rhodes and his four co-defendants, which is now unfolding in Federal District Court in Washington. The prosecution rested its case last week without calling other key cooperating witnesses, including three members of the Oath Keepers who pleaded guilty to seditious conspiracy charges….\nMr. McWhirter is the second known F.B.I. confidential source who was in a position to provide information to federal agents about the Oath Keepers before Jan. 6, raising questions about why investigators did not know more about the attack on the Capitol.\nFederal investigators knew everything about the so-called “attack on the Capitol” because they planned it. About the only more patently obvious false flag is the next one, the one that will provide the USA with a\ncasus belli\nagainst Russia.\nDISCUSS ON SG",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-11T20:11:39+00:00"
}