{
  "url": "https://voxday.net/2022/11/05/the-arts-of-war/",
  "scraped_at": "2026-01-08T13:37:33.781157",
  "title": "The Arts of War",
  "date_display": "November 5, 2022",
  "date_iso": "2022-11-05T13:10:36+00:00",
  "date_from_url": "2022-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <s>November-December</s> January-February book for <a href=\"https://arkhavencomics.com/product-category/leather/\">the Castalia Library subscription</a> is <em>THE ARTS OF WAR</em>, featuring an introduction by Alexander Macris, a game designer who attended West Point. And yes, it will contain Sun Tzu, but more importantly, it will include works of major military history significance with which you are almost certainly unfamiliar, such as Frontinus, Vegetius, Maurice, and others.</p><p>As our ace proofreader noted after completing his read-through and cleanup of Sextus Frontinus:</p><p><em>It really bothers me that I was never taught works like this. I read Sun Tzu, Mushashi, and other Asians on the art of war. But Frontinus and these others are our heritage, and I never even heard of them until now, and that’s wrong. Think about how cool history class would have been if we had read even snippets of these books.</em></p><p><em>Arts of Dark and Light</em> readers may wish to note that it is the works of Frontinus to which Marcus Valerius repeatedly refers throughout the series. In my opinion, <em>THE ARTS OF WAR</em> is about as close to a must-read as the Castalia Library is ever likely to feature, and I highly recommend <a href=\"https://arkhavencomics.com/product-category/leather/\">subscribing to the Library</a> if you have not already done so.</p><p>In other Library-related news:</p><ul class=\"wp-block-list\"><li>The November-December subscription book is <em>THE LAWDOG FILES</em>.</li><li>The <a href=\"https://arkhavencomics.com/product/castalia-library-annual/\">Annual Castalia Library subscription</a> now includes a complimentary edition of <em>DISCOURSES </em>by Machiavelli. Current subscribers who renew their subscription may substitute the Library edition of their choice so long as it is in stock. Subscribers who wish to pay by wire transfer instead of credit card should email me directly for payment information.</li><li>The <a href=\"https://arkhavencomics.com/product/libraria-castalia-annual/\"><span style=\"text-decoration: underline;\">Annual Libraria Castalia subscription</span></a> now includes a copy of <em>THE DIVINE COMEDY</em> by Dante. Current subscribers who renew or upgrade their subscription may substitute the Libraria/Library edition of their choice so long as it is in stock. Subscribers who wish to pay by wire transfer instead of credit card should email me directly for payment information.</li><li>The next books scheduled to ship are a) Vols. 1-6 of the leather Castalia Library Junior Classics later this month and b) A THRONE OF BONES Vols I and II on December 16. There are still <a href=\"https://arkhavencomics.com/product/junior-classics-leather/\">23 Junior Classic sets</a> available.</li><li>We are currently in communication with a major European author concerning the production of a leather-bound line of his works. This may or may not be done under the Castalia Library imprint.</li><li>A major step forward concerning the Swiss bindery was completed yesterday, as we received an important approval from the relevant government authority.</li><li>The MIDNIGHT’S WAR crowdfund will include a leatherbound edition of the omnibus.</li><li>We are currently focused on getting all four books of the <em>INCERTO </em>set by NN Taleb into production.</li></ul><p><em><a href=\"https://social.infogalactic.com/micropost/b608c4f0-768b-4f60-8944-8ad98aa41518\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The\nNovember-December\nJanuary-February book for\nthe Castalia Library subscription\nis\nTHE ARTS OF WAR\n, featuring an introduction by Alexander Macris, a game designer who attended West Point. And yes, it will contain Sun Tzu, but more importantly, it will include works of major military history significance with which you are almost certainly unfamiliar, such as Frontinus, Vegetius, Maurice, and others.\nAs our ace proofreader noted after completing his read-through and cleanup of Sextus Frontinus:\nIt really bothers me that I was never taught works like this. I read Sun Tzu, Mushashi, and other Asians on the art of war. But Frontinus and these others are our heritage, and I never even heard of them until now, and that’s wrong. Think about how cool history class would have been if we had read even snippets of these books.\nArts of Dark and Light\nreaders may wish to note that it is the works of Frontinus to which Marcus Valerius repeatedly refers throughout the series. In my opinion,\nTHE ARTS OF WAR\nis about as close to a must-read as the Castalia Library is ever likely to feature, and I highly recommend\nsubscribing to the Library\nif you have not already done so.\nIn other Library-related news:\nThe November-December subscription book is\nTHE LAWDOG FILES\n.\nThe\nAnnual Castalia Library subscription\nnow includes a complimentary edition of\nDISCOURSES\nby Machiavelli. Current subscribers who renew their subscription may substitute the Library edition of their choice so long as it is in stock. Subscribers who wish to pay by wire transfer instead of credit card should email me directly for payment information.\nThe\nAnnual Libraria Castalia subscription\nnow includes a copy of\nTHE DIVINE COMEDY\nby Dante. Current subscribers who renew or upgrade their subscription may substitute the Libraria/Library edition of their choice so long as it is in stock. Subscribers who wish to pay by wire transfer instead of credit card should email me directly for payment information.\nThe next books scheduled to ship are a) Vols. 1-6 of the leather Castalia Library Junior Classics later this month and b) A THRONE OF BONES Vols I and II on December 16. There are still\n23 Junior Classic sets\navailable.\nWe are currently in communication with a major European author concerning the production of a leather-bound line of his works. This may or may not be done under the Castalia Library imprint.\nA major step forward concerning the Swiss bindery was completed yesterday, as we received an important approval from the relevant government authority.\nThe MIDNIGHT’S WAR crowdfund will include a leatherbound edition of the omnibus.\nWe are currently focused on getting all four books of the\nINCERTO\nset by NN Taleb into production.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-12T18:12:17+00:00"
}