{
  "url": "https://voxday.net/2022/11/13/what-makes-boomers-special/",
  "scraped_at": "2026-01-08T13:37:35.615477",
  "title": "What Makes Boomers Special",
  "date_display": "November 13, 2022",
  "date_iso": "2022-11-13T11:02:14+00:00",
  "date_from_url": "2022-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s true that not ALL Boomers are like that. So let’s content ourselves with saying that a sufficient quantity of them are to safely predict what will be the average Boomer’s response to any and all subjects. Such as, for example, financial responsibility and debt relief, <a href=\"https://gab.com/Overton_GloryHole/posts/109335845614668923\">as Neon Revolt discovered recently</a> when a Boomer explained to him why Boomers are special and nothing is ever their fault.</p><p><strong>NEON REVOLT:</strong> Live feed of conservative voters voooting hardeeeeer, to make sure no one ever escapes student debt.</p><p><strong>BOOMER: </strong>I’ve admired your research and papers, but am now a little confused about the attacks today. Are you comparing gambling seniors who have earned a living for 60 or more years with the student population having a right to free student loan payoffs? Boomers did pay off their student debt because we learned the values of responsibility and accountability. Granted, I don’t think enough people have woken up to the horrors that we will face in the near future, but I do know that even in my state, the turn out was beyond what anyone imagined. Boomers are well aware of the negative “social culture” that is being pushed today and are flabbergasted to say the least. Conservative boomers were hoodwinked into voting for the malevolent types like the Bushes. Thanks to people like you, we have done our research and learned many more truths. What makes boomers special is that we grew up in an age to be open to new ideas and to think for ourselves.</p><p><strong>VP READER WHO IS PROBABLY GEN-X: </strong>I highly recommend doing a “boomer” keyword search of @voxday ‘s blog and reading the results voraciously. Your response, “Boomers did pay off their student debt because we learned the values of responsibility and accountability” is utterly clueless as is all too typical of the boomer mindset.</p><p>To be clear, not that it is at all relevant, but I have no student loans. I didn’t pursue some grievance-studies degree. I went to a fourth-tier university because it was affordable. I have no direct dog in this fight. So no ad-homs about me trying to get free gibs or some such nonsense.</p><p>To suggest that those who need debt relief somehow lack responsibility and accountability as you insinuate is asinine. The entire system is corrupt from top to bottom and bears little resemblance to the system in which you participated. 18-year olds from broken boomer families were bombarded with pro-college propaganda their entire lives to the point that they were led to believe any tuition cost is worth the benefit of a college “education”.</p><p>And this is even more absurd: “What makes boomers special is that we grew up in an age to be open to new ideas and to think for ourselves.” You’ve got to be kidding. What you interpret as thinking for yourself is more akin to discarding tried and true social and moral frameworks because psy-ops told you not to trust anyone over 30. Boomers as a cohort more think <em>about</em> themselves rather than for themselves.</p><p>Indeed, look at your comment in which you talk about how special you are as boomers for your openness to new ideas and how you learned responsibility and accountability. Boomers can’t help talking about themselves. I’ll never forget, for example, finding a very special book in a friends-of-the-library sale titled “<em>Hipper Than Our Kids: A Rock and Roll Journal of the Baby Boom Generation</em>”. Good parents don’t measure themselves against their kids; they measure their kids against themselves and strive mightily to raise people who are <em>better</em>, not “hipper” than themselves.</p><p>Prove me wrong about boomer self-absorption. Knee-jerk NAXALT responses are inelligible. Every boomer craps their pants when someone suggests ending the Social Security Ponzi scheme because “I paid into it, dammit!” Yeah, you paid into a fraudulent, generational Ponzi scheme, so muster up that legendary boomer accountability and responsibility and accept your losses and sunk costs instead of continuing to siphon from younger workers today.</p><p>Boomers shut down the economy and tried to force the clot-shot on everyone in order to protect themselves. Your job, boomers, was to make the necessary personal sacrifices to let the young live their lives and muster again that legendary boomer accountability and responsibility and take the extra precautions yourselves. Even the boomer President Orange Warp-Speed was in on the clot-shot hysteria.</p><p>Think for yourselves? If you’d done that, you wouldn’t have mass clot-shotted yourselves and cut yourselves off from supposed loved ones if they were unvaxxed. Responsibility and accountability? You would have quarantined yourselves to let the young get on with their lives.</p><p>Look, you’re probably a personable enough guy if we met one-on-one. You probably feel like you want to do the right thing. But that doesn’t negate the absurdities I just pointed out. Seriously, your generation is special in a bad way, not a good way. Just leave it at that, move on, and do your best to make restitution any way you can to the younger generations you let down.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6ada3615-e6c8-4151-a99c-f003dc7f117f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s true that not ALL Boomers are like that. So let’s content ourselves with saying that a sufficient quantity of them are to safely predict what will be the average Boomer’s response to any and all subjects. Such as, for example, financial responsibility and debt relief,\nas Neon Revolt discovered recently\nwhen a Boomer explained to him why Boomers are special and nothing is ever their fault.\nNEON REVOLT:\nLive feed of conservative voters voooting hardeeeeer, to make sure no one ever escapes student debt.\nBOOMER:\nI’ve admired your research and papers, but am now a little confused about the attacks today. Are you comparing gambling seniors who have earned a living for 60 or more years with the student population having a right to free student loan payoffs? Boomers did pay off their student debt because we learned the values of responsibility and accountability. Granted, I don’t think enough people have woken up to the horrors that we will face in the near future, but I do know that even in my state, the turn out was beyond what anyone imagined. Boomers are well aware of the negative “social culture” that is being pushed today and are flabbergasted to say the least. Conservative boomers were hoodwinked into voting for the malevolent types like the Bushes. Thanks to people like you, we have done our research and learned many more truths. What makes boomers special is that we grew up in an age to be open to new ideas and to think for ourselves.\nVP READER WHO IS PROBABLY GEN-X:\nI highly recommend doing a “boomer” keyword search of @voxday ‘s blog and reading the results voraciously. Your response, “Boomers did pay off their student debt because we learned the values of responsibility and accountability” is utterly clueless as is all too typical of the boomer mindset.\nTo be clear, not that it is at all relevant, but I have no student loans. I didn’t pursue some grievance-studies degree. I went to a fourth-tier university because it was affordable. I have no direct dog in this fight. So no ad-homs about me trying to get free gibs or some such nonsense.\nTo suggest that those who need debt relief somehow lack responsibility and accountability as you insinuate is asinine. The entire system is corrupt from top to bottom and bears little resemblance to the system in which you participated. 18-year olds from broken boomer families were bombarded with pro-college propaganda their entire lives to the point that they were led to believe any tuition cost is worth the benefit of a college “education”.\nAnd this is even more absurd: “What makes boomers special is that we grew up in an age to be open to new ideas and to think for ourselves.” You’ve got to be kidding. What you interpret as thinking for yourself is more akin to discarding tried and true social and moral frameworks because psy-ops told you not to trust anyone over 30. Boomers as a cohort more think\nabout\nthemselves rather than for themselves.\nIndeed, look at your comment in which you talk about how special you are as boomers for your openness to new ideas and how you learned responsibility and accountability. Boomers can’t help talking about themselves. I’ll never forget, for example, finding a very special book in a friends-of-the-library sale titled “\nHipper Than Our Kids: A Rock and Roll Journal of the Baby Boom Generation\n”. Good parents don’t measure themselves against their kids; they measure their kids against themselves and strive mightily to raise people who are\nbetter\n, not “hipper” than themselves.\nProve me wrong about boomer self-absorption. Knee-jerk NAXALT responses are inelligible. Every boomer craps their pants when someone suggests ending the Social Security Ponzi scheme because “I paid into it, dammit!” Yeah, you paid into a fraudulent, generational Ponzi scheme, so muster up that legendary boomer accountability and responsibility and accept your losses and sunk costs instead of continuing to siphon from younger workers today.\nBoomers shut down the economy and tried to force the clot-shot on everyone in order to protect themselves. Your job, boomers, was to make the necessary personal sacrifices to let the young live their lives and muster again that legendary boomer accountability and responsibility and take the extra precautions yourselves. Even the boomer President Orange Warp-Speed was in on the clot-shot hysteria.\nThink for yourselves? If you’d done that, you wouldn’t have mass clot-shotted yourselves and cut yourselves off from supposed loved ones if they were unvaxxed. Responsibility and accountability? You would have quarantined yourselves to let the young get on with their lives.\nLook, you’re probably a personable enough guy if we met one-on-one. You probably feel like you want to do the right thing. But that doesn’t negate the absurdities I just pointed out. Seriously, your generation is special in a bad way, not a good way. Just leave it at that, move on, and do your best to make restitution any way you can to the younger generations you let down.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-13T11:02:18+00:00"
}