{
  "url": "https://voxday.net/2022/11/23/when-nurture-wins/",
  "scraped_at": "2026-01-08T13:38:47.197701",
  "title": "When Nurture Wins",
  "date_display": "November 23, 2022",
  "date_iso": "2022-11-23T10:20:03+00:00",
  "date_from_url": "2022-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is straight-up <a href=\"https://social.infogalactic.com/micropost/ef883f5e-6746-4742-a99d-7d61e44a787a\">child abuse</a>. Literally satanic child abuse from which they will likely never recover.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Elllon Muskrat:</strong> A few years back I took my kids to a showing of The Little Mermaid at the Castro Theatre in SF. It was introduced and MCd by some drag folks. The kids just said “look at the pretty ladies” and then we watched the movie.</p><p><strong>Dave Watson:</strong> Wait! Your children haven’t been turned into DragQueens?! Impossible!</p><p><strong>Elllon Muskrat:</strong> Well, they have all come out as trans in the years since, but I don’t think the Little Mermaid show was the catalyst.</p></blockquote><p>Never, ever, again say that God blesses America. It’s readily apparent that He hasn’t been doing that for some time now.</p><p><a href=\"https://social.infogalactic.com/micropost/ef883f5e-6746-4742-a99d-7d61e44a787a\">DISCUSS ON SG</a></p></div>",
  "content_text": "This is straight-up\nchild abuse\n. Literally satanic child abuse from which they will likely never recover.\nElllon Muskrat:\nA few years back I took my kids to a showing of The Little Mermaid at the Castro Theatre in SF. It was introduced and MCd by some drag folks. The kids just said “look at the pretty ladies” and then we watched the movie.\nDave Watson:\nWait! Your children haven’t been turned into DragQueens?! Impossible!\nElllon Muskrat:\nWell, they have all come out as trans in the years since, but I don’t think the Little Mermaid show was the catalyst.\nNever, ever, again say that God blesses America. It’s readily apparent that He hasn’t been doing that for some time now.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-11-23T10:20:06+00:00"
}