{
  "url": "https://voxday.net/2010/07/26/abolish-tenure/",
  "scraped_at": "2026-01-08T23:32:55.691369",
  "title": "Abolish tenure",
  "date_display": "July 26, 2010",
  "date_iso": "2010-07-26T14:15:00+00:00",
  "date_from_url": "2010-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Academic tenure is one of the many factors that increasingly make American academia an intellectual joke and reduces the value of academic credentials.  Fortunately, it is one of the more easily fixed ones.  Just do the obvious and financially responsible thing and <a href=\"http://www.nytimes.com/roomfordebate/2010/7/19/what-if-college-tenure-dies/why-tenure-is-unsustainable-and-indefensible\">get rid of it</a>.</p><blockquote><p>If you were the C.E.O. of a company and the board of directors said: “We want this to be the best company of its kind in the world. Hire the best people you can find and pay them whatever is required.” Would you offer anybody a contract with these terms: lifetime employment, no possibility of dismissal, regardless of performance? If you did, your company would fail and you would be looking for a new job. Why should academia be any different from every other profession?</p><p>To those who say that the abolition of tenure will make faculty reluctant to be demanding with students or express controversial views, I respond that in almost 40 years of teaching, I have not known a single person who has been more willing to speak out after tenure than before. In fact, nothing represses the free expression of ideas more than the long and usually fruitless quest for tenure.</p></blockquote><p>One of the main reasons that academics are so hopelessly dull these days is that they are heavily incentivized to pay homage to the present orthodoxy and risk joblessness and career-ending ostracism if they do not kowtow to the status quo.  For example, it is utterly absurd that economics professors remain stubbornly and willfully ignorant of Austrian economic theory in favor of their outdated and inaccurate monetarist and Neo-Keynesian models that have left four generations of economics students bewildered at the way in which real world economic events refuse to conform to their educations.</p><p>It’s not exactly a secret that tenure <a href=\"http://www.nytimes.com/roomfordebate/2010/7/19/what-if-college-tenure-dies/tenure-reduces-intellectual-diversity\">does exactly the opposite of what it is supposed to do</a> with regards to academic freedom.  While it does protect the professoriat from interference on the part of those who pay their salaries, it actually subjects the individual academic to greater pressure from the academics who control the golden tenure grants.</p><blockquote><p>There are two reasonable arguments for tenure. First is that it protects academic freedom, shielding professors with unpopular views from retribution. Supposedly, this increases intellectual diversity, promoting universities as a marketplace of ideas. Secondly, tenure is a fringe benefit that makes academia more attractive to the best scholars, in so doing reducing the salaries needed to lure them.</p><p>While tenure has undoubtedly protected some good people from losing their jobs, it actually may on balance reduce intellectual diversity. Many ideologically driven tenured professors use their job security to aggressively thwart efforts to increase alternative viewpoints being taught. Hence conservatives often feel that they are frozen out of good academic jobs simply because the tenured faculty dominating departments simply do not want alternative perspectives given academic prominence….  The fact is that tenured faculty members often use their power to stifle innovation and change.</p></blockquote></div>",
  "content_text": "Academic tenure is one of the many factors that increasingly make American academia an intellectual joke and reduces the value of academic credentials.  Fortunately, it is one of the more easily fixed ones.  Just do the obvious and financially responsible thing and\nget rid of it\n.\nIf you were the C.E.O. of a company and the board of directors said: “We want this to be the best company of its kind in the world. Hire the best people you can find and pay them whatever is required.” Would you offer anybody a contract with these terms: lifetime employment, no possibility of dismissal, regardless of performance? If you did, your company would fail and you would be looking for a new job. Why should academia be any different from every other profession?\nTo those who say that the abolition of tenure will make faculty reluctant to be demanding with students or express controversial views, I respond that in almost 40 years of teaching, I have not known a single person who has been more willing to speak out after tenure than before. In fact, nothing represses the free expression of ideas more than the long and usually fruitless quest for tenure.\nOne of the main reasons that academics are so hopelessly dull these days is that they are heavily incentivized to pay homage to the present orthodoxy and risk joblessness and career-ending ostracism if they do not kowtow to the status quo.  For example, it is utterly absurd that economics professors remain stubbornly and willfully ignorant of Austrian economic theory in favor of their outdated and inaccurate monetarist and Neo-Keynesian models that have left four generations of economics students bewildered at the way in which real world economic events refuse to conform to their educations.\nIt’s not exactly a secret that tenure\ndoes exactly the opposite of what it is supposed to do\nwith regards to academic freedom.  While it does protect the professoriat from interference on the part of those who pay their salaries, it actually subjects the individual academic to greater pressure from the academics who control the golden tenure grants.\nThere are two reasonable arguments for tenure. First is that it protects academic freedom, shielding professors with unpopular views from retribution. Supposedly, this increases intellectual diversity, promoting universities as a marketplace of ideas. Secondly, tenure is a fringe benefit that makes academia more attractive to the best scholars, in so doing reducing the salaries needed to lure them.\nWhile tenure has undoubtedly protected some good people from losing their jobs, it actually may on balance reduce intellectual diversity. Many ideologically driven tenured professors use their job security to aggressively thwart efforts to increase alternative viewpoints being taught. Hence conservatives often feel that they are frozen out of good academic jobs simply because the tenured faculty dominating departments simply do not want alternative perspectives given academic prominence….  The fact is that tenured faculty members often use their power to stifle innovation and change.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-26T13:15:00+00:00"
}