{
  "url": "https://voxday.net/2010/07/09/attempting-to-redefine-reality/",
  "scraped_at": "2026-01-08T23:31:33.015597",
  "title": "Attempting to redefine reality",
  "date_display": "July 9, 2010",
  "date_iso": "2010-07-09T12:58:00+00:00",
  "date_from_url": "2010-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To say nothing of blowing a hole right through Divine Exceptionalist theology:</p><blockquote><p>A federal district court judge in Boston today <a href=\"http://www.boston.com/news/local/breaking_news/2010/07/judge_declares_3.html\">struck down the 1996 federal law</a> that defines marriage as a union exclusively between a man and a woman.  Judge Joseph L. Tauro ruled that the federal Defense of Marriage law violates the Constitutional right of married same-sex couples to equal protection under the law and upends the federal government’s long history of allowing states to set their own marriage laws.</p></blockquote><p>And now that the one <s>man</s>, one <s>woman</s> definition has been arbitrarily struck down on nonsensical grounds, there can be absolutely no question that the <s>one</s> man, <s>one</s> woman part will be challenged and struck down as well.  All of the homogamy supporters who claim otherwise are <i>already</i> wrong, as anyone who happens to have read a pro-polygamy press release will know.  That’s a done deal.  It’s a bit more of a stretch to be able to tell if people will also be able to marry animals due to the presumed consent issues, but you can bet that some horse-loving freakshow is going to try.  It’s legal in New Zealand, you know.</p><p>Of course, the licensed tripartite entity that the government calls marriage isn’t actually marriage anyhow, which is why I’m personally quite relaxed about this sort of thing.  Two or three or ten men can call themselves a school of fish if they want to, but their self-application of the title doesn’t make them so.</p><p>Now, I tend to think that America is doomed because of its addiction to debt, but the social engineers are certainly building an impressive argument on behalf of the various religious eschatologists.  It takes a pretty sizable set of historical blinders not to see the signs of a diseased and decadent society approaching its final days.</p></div>",
  "content_text": "To say nothing of blowing a hole right through Divine Exceptionalist theology:\nA federal district court judge in Boston today\nstruck down the 1996 federal law\nthat defines marriage as a union exclusively between a man and a woman.  Judge Joseph L. Tauro ruled that the federal Defense of Marriage law violates the Constitutional right of married same-sex couples to equal protection under the law and upends the federal government’s long history of allowing states to set their own marriage laws.\nAnd now that the one\nman\n, one\nwoman\ndefinition has been arbitrarily struck down on nonsensical grounds, there can be absolutely no question that the\none\nman,\none\nwoman part will be challenged and struck down as well.  All of the homogamy supporters who claim otherwise are\nalready\nwrong, as anyone who happens to have read a pro-polygamy press release will know.  That’s a done deal.  It’s a bit more of a stretch to be able to tell if people will also be able to marry animals due to the presumed consent issues, but you can bet that some horse-loving freakshow is going to try.  It’s legal in New Zealand, you know.\nOf course, the licensed tripartite entity that the government calls marriage isn’t actually marriage anyhow, which is why I’m personally quite relaxed about this sort of thing.  Two or three or ten men can call themselves a school of fish if they want to, but their self-application of the title doesn’t make them so.\nNow, I tend to think that America is doomed because of its addiction to debt, but the social engineers are certainly building an impressive argument on behalf of the various religious eschatologists.  It takes a pretty sizable set of historical blinders not to see the signs of a diseased and decadent society approaching its final days.",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-09T11:58:00+00:00"
}