{
  "url": "https://voxday.net/2010/07/19/bit-off/",
  "scraped_at": "2026-01-08T23:32:23.938145",
  "title": "A bit off",
  "date_display": "July 19, 2010",
  "date_iso": "2010-07-19T17:15:00+00:00",
  "date_from_url": "2010-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ireland’s <a href=\"http://www.irishtimes.com/newspaper/breaking/2010/0719/breaking7.html\">debt is downgraded</a>:</p><blockquote><p>Credit agency Moody’s has downgraded Ireland’s government bond ratings to Aa2, blaming banking liabilities, weak growth prospects and a substantial increase in the debt to GDP ratio….  The general government debt-to-GDP ratio was at 64 per cent at the end of last year, up from 25 per cent before the financial crisis took hold, and is continuing to rise.</p></blockquote><p>I had Ireland, Spain, and the Baltic countries as the first to be downgraded.  Instead, it was Greece, Spain, and Portugal that kicked off the sovereign debt spiral earlier this year.  But it was only a matter of time before Ireland joined the party.</p><p>For those who are interested, here is a debt specialist’s opinion on what will happen in the Great Depression 2.0 scenario that I have been predicting: <i>“<a href=\"http://www.calculatedriskblog.com/2010/07/part-5a-what-happens-if-things-go.html\">Here is the Really Bad scenario</a>. It’s not a worst possible scenario. It is more like the Long Depression or the Great Depression reoccurring under 2010 conditions.  In the Really Bad scenario, 45% of the countries with large outstanding sovereign debts are in default within a 2-3 year period.”</i></p></div>",
  "content_text": "Ireland’s\ndebt is downgraded\n:\nCredit agency Moody’s has downgraded Ireland’s government bond ratings to Aa2, blaming banking liabilities, weak growth prospects and a substantial increase in the debt to GDP ratio….  The general government debt-to-GDP ratio was at 64 per cent at the end of last year, up from 25 per cent before the financial crisis took hold, and is continuing to rise.\nI had Ireland, Spain, and the Baltic countries as the first to be downgraded.  Instead, it was Greece, Spain, and Portugal that kicked off the sovereign debt spiral earlier this year.  But it was only a matter of time before Ireland joined the party.\nFor those who are interested, here is a debt specialist’s opinion on what will happen in the Great Depression 2.0 scenario that I have been predicting:\n“\nHere is the Really Bad scenario\n. It’s not a worst possible scenario. It is more like the Long Depression or the Great Depression reoccurring under 2010 conditions.  In the Really Bad scenario, 45% of the countries with large outstanding sovereign debts are in default within a 2-3 year period.”",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-19T16:15:00+00:00"
}