{
  "url": "https://voxday.net/2010/07/05/danger-of-white-knighting/",
  "scraped_at": "2026-01-08T23:31:19.048592",
  "title": "The danger of white knighting",
  "date_display": "July 5, 2010",
  "date_iso": "2010-07-05T13:15:00+00:00",
  "date_from_url": "2010-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is always heroic to rescue a child.  But to “rescue” a woman from “violence against women”?  Sometimes, but by no means always.  Even the police know that <a href=\"http://abclocal.go.com/wls/story?section=news/local&amp;id=7533190\">intervening in a domestic situation is dangerously stupid</a> given the roughly 50/50 chance that the woman initiated the violence:</p><blockquote><p>A Good Samaritan who tried to help a stranger being hit by her husband was badly beaten after the man turned on him.  Matthew Leone has a broken jaw and one third of his skull has been removed because his brain is swollen after he was beaten earlier this week.</p></blockquote><p>I am totally opposed to the “chivalrous” notions that “you should never hit a woman” and “violence against women is absolutely disgusting”.  What does that make violence against men, peachy keen?  Either violence is acceptable or it isn’t, and I firmly believe that the Dragon motto of “start nothing, finish everything” applies universally.  If a woman is dumb enough to escalate conflict to a physical level with a larger, stronger, and faster opponent, then she absolutely merits any subsequent beating that she takes.  People always focus on the “finish everything” half, but the more important one is “start nothing”.  Now, if I am attacked, I may <i>choose</i> not to retaliate on the basis of my Christian principles, but that has nothing to do with the sex of the attacker.  A decision to let a physical assault pass is my choice and that choice doesn’t negate my absolute self-defense right to respond to the initiation of violence with incapacitating violence.</p><p>This doesn’t mean that one should never intervene in a violent situation, but that if one is going to intervene, one must do so in precisely the same manner that one would intervene if two men were fighting.  That’s precisely why the police usually handcuff both parties involved first, then attempt to sort the matter out once everyone has been incapacitated.  As I have mentioned before, you should never intervene in any violent situation unless you are absolutely certain that an even greater level of violence is justified in stopping it.  If one man is stabbing another, then go ahead and blow his head off.  If one woman is smashing another woman’s face against the floor, then go ahead and break her wrists.  But if all you’re going to do is demand the bigger party – which isn’t necessarily the guilty party – relax while you strike a moral pose at them, you shouldn’t be terribly surprised when you wind up in the hospital.</p><p>And given the fact that the woman wasn’t injured and the husband was only charged with a misdemeanor, it’s pretty obvious that the white knight’s intervention not only wasn’t necessary in this case, but actually made a bad situation worse.  I tend to doubt that the woman is going to appreciate her husband being needlessly put away in prison for 3-5 years.</p></div>",
  "content_text": "It is always heroic to rescue a child.  But to “rescue” a woman from “violence against women”?  Sometimes, but by no means always.  Even the police know that\nintervening in a domestic situation is dangerously stupid\ngiven the roughly 50/50 chance that the woman initiated the violence:\nA Good Samaritan who tried to help a stranger being hit by her husband was badly beaten after the man turned on him.  Matthew Leone has a broken jaw and one third of his skull has been removed because his brain is swollen after he was beaten earlier this week.\nI am totally opposed to the “chivalrous” notions that “you should never hit a woman” and “violence against women is absolutely disgusting”.  What does that make violence against men, peachy keen?  Either violence is acceptable or it isn’t, and I firmly believe that the Dragon motto of “start nothing, finish everything” applies universally.  If a woman is dumb enough to escalate conflict to a physical level with a larger, stronger, and faster opponent, then she absolutely merits any subsequent beating that she takes.  People always focus on the “finish everything” half, but the more important one is “start nothing”.  Now, if I am attacked, I may\nchoose\nnot to retaliate on the basis of my Christian principles, but that has nothing to do with the sex of the attacker.  A decision to let a physical assault pass is my choice and that choice doesn’t negate my absolute self-defense right to respond to the initiation of violence with incapacitating violence.\nThis doesn’t mean that one should never intervene in a violent situation, but that if one is going to intervene, one must do so in precisely the same manner that one would intervene if two men were fighting.  That’s precisely why the police usually handcuff both parties involved first, then attempt to sort the matter out once everyone has been incapacitated.  As I have mentioned before, you should never intervene in any violent situation unless you are absolutely certain that an even greater level of violence is justified in stopping it.  If one man is stabbing another, then go ahead and blow his head off.  If one woman is smashing another woman’s face against the floor, then go ahead and break her wrists.  But if all you’re going to do is demand the bigger party – which isn’t necessarily the guilty party – relax while you strike a moral pose at them, you shouldn’t be terribly surprised when you wind up in the hospital.\nAnd given the fact that the woman wasn’t injured and the husband was only charged with a misdemeanor, it’s pretty obvious that the white knight’s intervention not only wasn’t necessary in this case, but actually made a bad situation worse.  I tend to doubt that the woman is going to appreciate her husband being needlessly put away in prison for 3-5 years.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-05T12:15:00+00:00"
}