{
  "url": "https://voxday.net/2010/07/10/day-vs-krugman/",
  "scraped_at": "2026-01-08T23:31:38.119210",
  "title": "Day vs Krugman",
  "date_display": "July 10, 2010",
  "date_iso": "2010-07-10T15:35:00+00:00",
  "date_from_url": "2010-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On Hayek vs Keynes. Krugman <a href=\"http://krugman.blogs.nytimes.com/2010/07/09/keynes-versus-hayek-1932/\">redefines the concept</a> of bizarre:</p><blockquote><p>First, Hayek was as bad on the Depression as I thought. The claim that  “many of the troubles of the world at the present time are due to  imprudent borrowing and spending on the part of the public authorities” —  in 1932! — is bizarre.</p></blockquote><p>Yes, <a href=\"http://calculatedriskimages.blogspot.com/2010/07/sovereign-defaults-1921-to-1980.html\">this graph of sovereign defaults from 1921 to 1980</a> quite clearly shows that there was absolutely no problem with imprudent borrowing and spending by the public authorities.  Here is the list of the 25 sovereign defaults covering the time that Hayek and Keynes were debating; from 1930 to 1934.  Notice that the bulk of them happened to come precisely in 1932.</p><p><i>Mexico, Ecuador, Bolivia, Brazil, Chile, Dominican Republic, Peru, Turkey, Liberia, Austria, Bulgaria, Colombia, Costa Rica, El Salvador, Germany, Greece, Hungary, Nicaragua, Panama, Paraguay, Cuba, Guatemala, Romania, Uruguay, Yugoslavia.</i></p><p>And the Keynesian “solution” to the problem didn’t help much either, since there were 14 more sovereign defaults before WWII ended in 1945:  <i>Colombia, Poland, Brazil, Austria, Czechoslovakia, El Salvador, China, Germany, Austria, Japan, Poland, Turkey, Hungary, Japan.</i></p><p>The only thing that is bizarre here is Paul Krugman’s inability to connect “imprudent borrowing and spending by the public authorities” with historical sovereign defaults.  Now consider how much panic has rocked the markets due to two mere <i>threats</i> of sovereign defaults by two very small nations, Dubai and Greece.  Think about how many banks failed or were nationalized after the credit crunch of 2008.  Then think about the possibility that no less than 25 nations default on their debts before 2014.  Do you think that just might, perhaps, have some effect on the international financial system?  Krugman’s Keynesian know-it-all act was always ridiculous, but now he’s fast approaching self-parody with his astonishing inability to comprehend that debt really is a problem despite the Keynesian model’s insistence otherwise.</p></div>",
  "content_text": "On Hayek vs Keynes. Krugman\nredefines the concept\nof bizarre:\nFirst, Hayek was as bad on the Depression as I thought. The claim that  “many of the troubles of the world at the present time are due to  imprudent borrowing and spending on the part of the public authorities” —  in 1932! — is bizarre.\nYes,\nthis graph of sovereign defaults from 1921 to 1980\nquite clearly shows that there was absolutely no problem with imprudent borrowing and spending by the public authorities.  Here is the list of the 25 sovereign defaults covering the time that Hayek and Keynes were debating; from 1930 to 1934.  Notice that the bulk of them happened to come precisely in 1932.\nMexico, Ecuador, Bolivia, Brazil, Chile, Dominican Republic, Peru, Turkey, Liberia, Austria, Bulgaria, Colombia, Costa Rica, El Salvador, Germany, Greece, Hungary, Nicaragua, Panama, Paraguay, Cuba, Guatemala, Romania, Uruguay, Yugoslavia.\nAnd the Keynesian “solution” to the problem didn’t help much either, since there were 14 more sovereign defaults before WWII ended in 1945:\nColombia, Poland, Brazil, Austria, Czechoslovakia, El Salvador, China, Germany, Austria, Japan, Poland, Turkey, Hungary, Japan.\nThe only thing that is bizarre here is Paul Krugman’s inability to connect “imprudent borrowing and spending by the public authorities” with historical sovereign defaults.  Now consider how much panic has rocked the markets due to two mere\nthreats\nof sovereign defaults by two very small nations, Dubai and Greece.  Think about how many banks failed or were nationalized after the credit crunch of 2008.  Then think about the possibility that no less than 25 nations default on their debts before 2014.  Do you think that just might, perhaps, have some effect on the international financial system?  Krugman’s Keynesian know-it-all act was always ridiculous, but now he’s fast approaching self-parody with his astonishing inability to comprehend that debt really is a problem despite the Keynesian model’s insistence otherwise.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-10T14:35:00+00:00"
}