{
  "url": "https://voxday.net/2010/07/28/defend-yourself/",
  "scraped_at": "2026-01-08T23:33:12.223792",
  "title": "Defend yourself",
  "date_display": "July 28, 2010",
  "date_iso": "2010-07-28T17:45:00+00:00",
  "date_from_url": "2010-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t <a href=\"http://www.washingtonexaminer.com/local/crime/_Deadly-delay__-Police-wait-while-mother_-sons-slain-1003063-99207119.html\">rely on the cops</a>:</p><blockquote><p>The District police department policy on forcible entry caused a “deadly delay” as officers waited for a supervisor outside an apartment while a mother and her two young sons were being stabbed to death inside, according to a lawsuit filed by the woman’s family.  The policy that led to police taking nearly an hour to finally bust down the door and find the murdered family is at the center of a $60 million wrongful death lawsuit against the city and the officers involved.</p></blockquote><p>As has happened in every other case of this type, the police will be found to have no liability because it has been well-established in various courts of law that <i>they have absolutely no responsibility for defending you</i>.  If you are relying on the police instead of yourself, you are quite literally defenseless.  If you don’t own a shotgun, a rifle, and a pistol or three, then you are neglecting one of your most basic responsibilities as a human being.</p></div>",
  "content_text": "Don’t\nrely on the cops\n:\nThe District police department policy on forcible entry caused a “deadly delay” as officers waited for a supervisor outside an apartment while a mother and her two young sons were being stabbed to death inside, according to a lawsuit filed by the woman’s family.  The policy that led to police taking nearly an hour to finally bust down the door and find the murdered family is at the center of a $60 million wrongful death lawsuit against the city and the officers involved.\nAs has happened in every other case of this type, the police will be found to have no liability because it has been well-established in various courts of law that\nthey have absolutely no responsibility for defending you\n.  If you are relying on the police instead of yourself, you are quite literally defenseless.  If you don’t own a shotgun, a rifle, and a pistol or three, then you are neglecting one of your most basic responsibilities as a human being.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-28T16:45:00+00:00"
}