{
  "url": "https://voxday.net/2010/07/27/disrespecting-strong-independent-women_27/",
  "scraped_at": "2026-01-08T23:33:03.081523",
  "title": "Disrespecting strong, independent women",
  "date_display": "July 27, 2010",
  "date_iso": "2010-07-27T13:30:00+00:00",
  "date_from_url": "2010-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt this patriarchal oppressor got what he deserved for preventing a bold woman warrior from wreaking righteous female fury on a fellow patriarch.  Would-be white knights should keep in mind that they are not only <a href=\"http://www.startribune.com/local/stpaul/99282829.html?elr=KArksUUUycaEacyU\">risking serious personal injury</a> for a strange woman, but there’s a very good chance she won’t even be grateful.</p><blockquote><p>“I just simply say, ‘Dude, that’s enough,’ [thinking] maybe he’ll back off,” Skripka said. “He got in my face. I didn’t flinch. I said, ‘Dude, back off,’ pardon my French but that’s the words I used. Then I finally said, ‘Dude, what’s your problem?’ The next thing I know is I’m waking up on a gurney. I was knocked out cold.”</p><p>In addition to the cuts and bruises, he also suffered a concussion….</p><p>“I suppose I got more engaged than I should have,” said Skripka, who was released from the hospital Monday afternoon. “I just wanted to do the right thing. If it was my sister or my friend getting assaulted, I’m going to do what I can.  All he had to do was stop, all he had to do was stop assaulting her,” said Skripka, who has had his own brushes with the law, the most recent a burglary charge in 2008 from Dakota County. “Just walk away from the situation, cool off. I don’t know why he had to continue and then turn on somebody else.”</p></blockquote><p>Yes, and all you had to do was mind your own business and walk away from a situation that didn’t concern you in any way.  The guy didn’t just turn on somebody else, Skripa chose to interfere with him.  Now, Skripa may have wanted to do the right thing, but he nevertheless did the wrong thing.  Now I agree, if it was my sister or female friend getting assaulted, I’m going to do what I can too.  I would do the same for my brother or male friend.  But a random woman on the street who is just as likely to be the instigator of the violence as the victim <i>is neither my sister nor my friend.</i> And more importantly, doing what one can is not limited to posturing and verbal bravado.</p><p>As I previously advised, you should never intervene in a violent domestic quarrel or even petty crime unless it is clear that potentially lethal violence is merited.  A woman isn’t likely to be severely injured by getting pushed or slapped or punched, so you can’t justify stepping in unless and until there are obvious indications that the man actually intends to inflict serious and potentially fatal harm.  As the foolish Mr. Skripka discovered, even men who get physical with women are usually holding quite a bit back; a man who is dumb enough to white knight in these situations is simply offering an already angry and violent man a target upon which he can fully unleash the force he is still partially controlling.</p><p>Basically, unless what you’re seeing definitely merits putting someone in the hospital or the morgue and would be considered justifiable in a court of law, let it pass.  Based on the statistics, half the time the woman attacked first and deserves the beating anyhow.</p></div>",
  "content_text": "No doubt this patriarchal oppressor got what he deserved for preventing a bold woman warrior from wreaking righteous female fury on a fellow patriarch.  Would-be white knights should keep in mind that they are not only\nrisking serious personal injury\nfor a strange woman, but there’s a very good chance she won’t even be grateful.\n“I just simply say, ‘Dude, that’s enough,’ [thinking] maybe he’ll back off,” Skripka said. “He got in my face. I didn’t flinch. I said, ‘Dude, back off,’ pardon my French but that’s the words I used. Then I finally said, ‘Dude, what’s your problem?’ The next thing I know is I’m waking up on a gurney. I was knocked out cold.”\nIn addition to the cuts and bruises, he also suffered a concussion….\n“I suppose I got more engaged than I should have,” said Skripka, who was released from the hospital Monday afternoon. “I just wanted to do the right thing. If it was my sister or my friend getting assaulted, I’m going to do what I can.  All he had to do was stop, all he had to do was stop assaulting her,” said Skripka, who has had his own brushes with the law, the most recent a burglary charge in 2008 from Dakota County. “Just walk away from the situation, cool off. I don’t know why he had to continue and then turn on somebody else.”\nYes, and all you had to do was mind your own business and walk away from a situation that didn’t concern you in any way.  The guy didn’t just turn on somebody else, Skripa chose to interfere with him.  Now, Skripa may have wanted to do the right thing, but he nevertheless did the wrong thing.  Now I agree, if it was my sister or female friend getting assaulted, I’m going to do what I can too.  I would do the same for my brother or male friend.  But a random woman on the street who is just as likely to be the instigator of the violence as the victim\nis neither my sister nor my friend.\nAnd more importantly, doing what one can is not limited to posturing and verbal bravado.\nAs I previously advised, you should never intervene in a violent domestic quarrel or even petty crime unless it is clear that potentially lethal violence is merited.  A woman isn’t likely to be severely injured by getting pushed or slapped or punched, so you can’t justify stepping in unless and until there are obvious indications that the man actually intends to inflict serious and potentially fatal harm.  As the foolish Mr. Skripka discovered, even men who get physical with women are usually holding quite a bit back; a man who is dumb enough to white knight in these situations is simply offering an already angry and violent man a target upon which he can fully unleash the force he is still partially controlling.\nBasically, unless what you’re seeing definitely merits putting someone in the hospital or the morgue and would be considered justifiable in a court of law, let it pass.  Based on the statistics, half the time the woman attacked first and deserves the beating anyhow.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-27T12:30:00+00:00"
}