{
  "url": "https://voxday.net/2010/07/03/dont-cry-for-me-maradona/",
  "scraped_at": "2026-01-08T23:31:09.880023",
  "title": "Don’t cry for me, Maradona",
  "date_display": "July 3, 2010",
  "date_iso": "2010-07-03T17:30:00+00:00",
  "date_from_url": "2010-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Germany 4<br> Argentina 0</br></p><p>Germany underlined that their demolition of England was no fluke.  They also showed that a world class team needs world class strikers who can actually finish; Miroslav Klose is at the forefront of a powerful and speedy attack that includes Podolski, Özil, and Schweinsteiger.  Messi, on the other hand, demonstrated that he’s more of a ball-controlling midfielder than a true striker capable of finishing.</p><p>I have to say that the contrast between Maradona and Italy’s Lippi couldn’t have been greater.  He was magnanimous in victory against Greece, prompting Spacebunny to wonder if he would be as sporting in defeat.  But unlike the fraudulent Lippi, who disappeared into the locker room without a word of consolation to his players or a word of congratulations to the other team, no sooner did the whistle blow than Maradona was out on the field again hugging his players and offering a sincere hand to the other team, this time in congratulations.  He is a deeply troubled man, but it’s heartening to see that on the field, he is still a champion.</p><p>As for the Ghana game, I am not surprised that the Black Stars found a way to lose it.  Uruguay is mentally tough, very mentally tough, as was exemplified by Suarez watching the penalty as he walked backwards towards the locker room after his red card.  A forward on the goal line, kicked out of the game, and he still hadn’t given up hope.  Like the Americans, Uruguay doesn’t just play to the 90th minute, they fight and scrap and claw until the final whistle blows.  I still can’t see them shutting down the high-speed Dutch attack, but the contrast between their relentless spirit and the inexcusable lapse in Dutch effort at the end of the Brazil game does make me think that an upset is not quite as impossible as I would have thought.  I still expect the Netherlands to claim the cup, as I predicted at the beginning, but the Dutch should not make the mistake of looking ahead to <s>Germany</s>the final.</p></div>",
  "content_text": "Germany 4\nArgentina 0\nGermany underlined that their demolition of England was no fluke.  They also showed that a world class team needs world class strikers who can actually finish; Miroslav Klose is at the forefront of a powerful and speedy attack that includes Podolski, Özil, and Schweinsteiger.  Messi, on the other hand, demonstrated that he’s more of a ball-controlling midfielder than a true striker capable of finishing.\nI have to say that the contrast between Maradona and Italy’s Lippi couldn’t have been greater.  He was magnanimous in victory against Greece, prompting Spacebunny to wonder if he would be as sporting in defeat.  But unlike the fraudulent Lippi, who disappeared into the locker room without a word of consolation to his players or a word of congratulations to the other team, no sooner did the whistle blow than Maradona was out on the field again hugging his players and offering a sincere hand to the other team, this time in congratulations.  He is a deeply troubled man, but it’s heartening to see that on the field, he is still a champion.\nAs for the Ghana game, I am not surprised that the Black Stars found a way to lose it.  Uruguay is mentally tough, very mentally tough, as was exemplified by Suarez watching the penalty as he walked backwards towards the locker room after his red card.  A forward on the goal line, kicked out of the game, and he still hadn’t given up hope.  Like the Americans, Uruguay doesn’t just play to the 90th minute, they fight and scrap and claw until the final whistle blows.  I still can’t see them shutting down the high-speed Dutch attack, but the contrast between their relentless spirit and the inexcusable lapse in Dutch effort at the end of the Brazil game does make me think that an upset is not quite as impossible as I would have thought.  I still expect the Netherlands to claim the cup, as I predicted at the beginning, but the Dutch should not make the mistake of looking ahead to\nGermany\nthe final.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-03T16:30:00+00:00"
}