{
  "url": "https://voxday.net/2010/07/04/flipping-flipped-scrip/",
  "scraped_at": "2026-01-08T23:31:13.512389",
  "title": "Flipping the flipped script",
  "date_display": "July 4, 2010",
  "date_iso": "2010-07-04T15:30:00+00:00",
  "date_from_url": "2010-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A fair amount of what this woman writes about is wrong and even the title of <a href=\"http://www.hookingupsmart.com/2010/06/30/hookinguprealities/how-to-flip-a-player/\">this post</a> is misleading, but she grasps the important issues better than most and her core message here is correct.  A woman can “tame” even the most hard core player if he is genuinely ready to settle down and raise a family:</p><blockquote><p>The secret to flipping a player is finding one who wants to be flipped.  A pretend asshole. A guy who’s gone from beta to bastard and back again. The truth is, a very high percentage of males understand that assholes get laid. Many don’t know what to do about it. Others work hard to acquire skills with women via Game. But many, many young men just flip into acting like jerks. When in doubt, insult her. Walk away. Never show you care. This is surprisingly effective, and it really doesn’t require a bootcamp to role-play this way. Some of these guys will like the action so much, they won’t ever come back from the Dark side. Some will. You gotta figure about 20% of guys getting laid are jerks. The rest are just acting like jerks. That doesn’t make them fun to be around, but it does mean they are susceptible to being poached.</p></blockquote><p>This strikes me as somewhat of a statement of the obvious; since Game concerns the simulation of Alpha behavior, there is going to be a clear difference between the natural Game player and the simulated one.  And, of course, it’s true that the simulated Alpha is less likely to be a complete and unrepentant bastard.  Now, I do believe even complete bastards can change from ruthless and cold-hearted cad to faithful family man because that’s precisely what happened to me.  However, this only came about through the transformative power of Jesus Christ; a woman can enable such a transformation, but I don’t see how she could possibly bring it about on her own.</p><p>I think the problem with the beta to bastard and back concept is that as you act, so you eventually become.  Few whores start out thinking to earn crack money on the street; they are more likely to embark upon their descent as a low-rent model or fully-clothed cigarette girl at the strip club.  (I once placed a bet with a club owner on how long it would take his new cigarette girl to graduate to the stage.  I said a month and lost.  Two weeks, or more precisely, eight working evenings.)  Experience leaves its mark on men too, even if we don’t tend to get that “ridden hard, put away wet” look that is so easy to see on women with a history of promiscuity.  (By the way, women, you may wish to note that observant men can usually estimate how many men have had you with a surprising degree of accuracy.  It’s a fun party trick, although not one recommended for dinner parties with married couples.)  Once a man ceases to put women on pedestals, he is very unlikely to ever do so again, much less become a shield-brandishing White Knight ever ready to defend a mythical honor.</p><p>It’s a dangerous game both ways, of course.  On the one hand, even Hugh Hefner wanted to settle down and raise a family for a while, but the sentiment passed and soon he was collecting larger and more visible harems than ever before.  On the other, a relapsed Game player whose behavior has been tamed into delta or even gamma behavior is going to generate contempt and disgust in the very woman who tamed him… so she will go off and seek another faux alpha to tame or a real one to entertain her.  The irony, of course, being that not long after she leaves the relapsed Game player due to his contemptible gammadom, he’ll be back to his old ways with a bitter vengeance, leaving a trail of women half her age strewn behind him in broken-hearted adoration.</p><p>This is why I think it is a massive mistake for women to attempt to play alpha-tamer.  A real man only does things for his own reasons, (which should not be confused with his self-interest), and unless he is motivated to change his ways by a higher power, any other externally induced change, be it for reasons of romance, fear, familial pressure, or even boredom, is unlikely to last over time.</p><p>And it’s even possible that change for all the right reasons could lead a woman to develop some degree of contempt for even the strongest, most attractive man.  There is a saying, after all, that no man is a hero to his valet and the intimate familiarity of family life can’t help but breed the occasional eye-rolling, and perhaps even disgust.  I doubt that it’s much sexier to clean up after George Clooney’s vomit than anyone else’s.  But it’s always important to remember that men are not monkeys, women are not weasels, and both sexes are at least <i>capable</i> of surmounting our biological instincts in our own long-term best interests.  That’s why it is wise to recall that love is a choice and it should never be confused with the short-lived chemical cloudburst that sometimes passes for it.</p><p>But in the end, if you want a good man, then stop chasing bad ones.</p></div>",
  "content_text": "A fair amount of what this woman writes about is wrong and even the title of\nthis post\nis misleading, but she grasps the important issues better than most and her core message here is correct.  A woman can “tame” even the most hard core player if he is genuinely ready to settle down and raise a family:\nThe secret to flipping a player is finding one who wants to be flipped.  A pretend asshole. A guy who’s gone from beta to bastard and back again. The truth is, a very high percentage of males understand that assholes get laid. Many don’t know what to do about it. Others work hard to acquire skills with women via Game. But many, many young men just flip into acting like jerks. When in doubt, insult her. Walk away. Never show you care. This is surprisingly effective, and it really doesn’t require a bootcamp to role-play this way. Some of these guys will like the action so much, they won’t ever come back from the Dark side. Some will. You gotta figure about 20% of guys getting laid are jerks. The rest are just acting like jerks. That doesn’t make them fun to be around, but it does mean they are susceptible to being poached.\nThis strikes me as somewhat of a statement of the obvious; since Game concerns the simulation of Alpha behavior, there is going to be a clear difference between the natural Game player and the simulated one.  And, of course, it’s true that the simulated Alpha is less likely to be a complete and unrepentant bastard.  Now, I do believe even complete bastards can change from ruthless and cold-hearted cad to faithful family man because that’s precisely what happened to me.  However, this only came about through the transformative power of Jesus Christ; a woman can enable such a transformation, but I don’t see how she could possibly bring it about on her own.\nI think the problem with the beta to bastard and back concept is that as you act, so you eventually become.  Few whores start out thinking to earn crack money on the street; they are more likely to embark upon their descent as a low-rent model or fully-clothed cigarette girl at the strip club.  (I once placed a bet with a club owner on how long it would take his new cigarette girl to graduate to the stage.  I said a month and lost.  Two weeks, or more precisely, eight working evenings.)  Experience leaves its mark on men too, even if we don’t tend to get that “ridden hard, put away wet” look that is so easy to see on women with a history of promiscuity.  (By the way, women, you may wish to note that observant men can usually estimate how many men have had you with a surprising degree of accuracy.  It’s a fun party trick, although not one recommended for dinner parties with married couples.)  Once a man ceases to put women on pedestals, he is very unlikely to ever do so again, much less become a shield-brandishing White Knight ever ready to defend a mythical honor.\nIt’s a dangerous game both ways, of course.  On the one hand, even Hugh Hefner wanted to settle down and raise a family for a while, but the sentiment passed and soon he was collecting larger and more visible harems than ever before.  On the other, a relapsed Game player whose behavior has been tamed into delta or even gamma behavior is going to generate contempt and disgust in the very woman who tamed him… so she will go off and seek another faux alpha to tame or a real one to entertain her.  The irony, of course, being that not long after she leaves the relapsed Game player due to his contemptible gammadom, he’ll be back to his old ways with a bitter vengeance, leaving a trail of women half her age strewn behind him in broken-hearted adoration.\nThis is why I think it is a massive mistake for women to attempt to play alpha-tamer.  A real man only does things for his own reasons, (which should not be confused with his self-interest), and unless he is motivated to change his ways by a higher power, any other externally induced change, be it for reasons of romance, fear, familial pressure, or even boredom, is unlikely to last over time.\nAnd it’s even possible that change for all the right reasons could lead a woman to develop some degree of contempt for even the strongest, most attractive man.  There is a saying, after all, that no man is a hero to his valet and the intimate familiarity of family life can’t help but breed the occasional eye-rolling, and perhaps even disgust.  I doubt that it’s much sexier to clean up after George Clooney’s vomit than anyone else’s.  But it’s always important to remember that men are not monkeys, women are not weasels, and both sexes are at least\ncapable\nof surmounting our biological instincts in our own long-term best interests.  That’s why it is wise to recall that love is a choice and it should never be confused with the short-lived chemical cloudburst that sometimes passes for it.\nBut in the end, if you want a good man, then stop chasing bad ones.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-04T14:30:00+00:00"
}