{
  "url": "https://voxday.net/2010/07/13/hmmm-2/",
  "scraped_at": "2026-01-08T23:31:54.730089",
  "title": "Hmmm",
  "date_display": "July 13, 2010",
  "date_iso": "2010-07-13T19:21:00+00:00",
  "date_from_url": "2010-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Read this list of personal characteristics:</p><p><i>Witty, i.e. smart<br> Irreverent<br> Secure<br> Sadistic<br> Perceptive<br> Impulsive<br> Narcissistic<br> A natural at negging<br> Ridiculous in his peacocking<br> A terrible relationship prospect</br></br></br></br></br></br></br></br></br></i></p><p>Now, that list could have been compiled 15 years ago to describe me with the exception of the Peacocking and the Impulsive.  Probably more smart than witty, more’s the pity, but there you go.  Anyhow, based on how things turned out for Spacebunny and me, there just might be hope <a href=\"http://www.hookingupsmart.com/2010/06/04/hookinguprealities/russell-brand-is-gross-and-hot/\">for Russell Brand</a> maintaining a successful marriage.  Or rather, there might have been were he not a Hollywood celebrity.  I also think it’s interesting to note how his marital choice of Katy Perry, she of the execrable pop music and the evangelical Christian background, tends to underline <a href=\"http://www.milobookclub.com/2010/07/09/mailvox-hierarchy-of-female/\">the hierarchy of female attractiveness</a> I explained a few days ago.  Miss Perry’s expansive endowment notwithstanding, there is no way she is one-half as pretty as at least one-quarter of the girls to whom Mr. Brand has, in the immortal words of Lebronze, taken his talents.</p></div>",
  "content_text": "Read this list of personal characteristics:\nWitty, i.e. smart\nIrreverent\nSecure\nSadistic\nPerceptive\nImpulsive\nNarcissistic\nA natural at negging\nRidiculous in his peacocking\nA terrible relationship prospect\nNow, that list could have been compiled 15 years ago to describe me with the exception of the Peacocking and the Impulsive.  Probably more smart than witty, more’s the pity, but there you go.  Anyhow, based on how things turned out for Spacebunny and me, there just might be hope\nfor Russell Brand\nmaintaining a successful marriage.  Or rather, there might have been were he not a Hollywood celebrity.  I also think it’s interesting to note how his marital choice of Katy Perry, she of the execrable pop music and the evangelical Christian background, tends to underline\nthe hierarchy of female attractiveness\nI explained a few days ago.  Miss Perry’s expansive endowment notwithstanding, there is no way she is one-half as pretty as at least one-quarter of the girls to whom Mr. Brand has, in the immortal words of Lebronze, taken his talents.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-13T18:21:00+00:00"
}