{
  "url": "https://voxday.net/2010/07/01/ignorant-and-slackminded/",
  "scraped_at": "2026-01-08T23:30:57.144317",
  "title": "Ignorant and slackminded",
  "date_display": "July 1, 2010",
  "date_iso": "2010-07-01T16:49:00+00:00",
  "date_from_url": "2010-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was not at all impressed by <a href=\"http://www.zerohedge.com/article/fed-economist-bloggers-are-stupid\">the lunatic defense of economic credentialism</a> by an economist employed by the very institution that is most responsible for the incoming Great Depression 2.0.  But then I read this astonishingly ignorant appeal to <i>morality</i> by Fred Clark and I had to admit that Kartik Athreya may have had a point in insisting that at least some bloggers <a href=\"http://slacktivist.typepad.com/slacktivist/2010/06/rendering-unto-krugman.html\">shouldn’t write about economic matters</a>:</p><blockquote><p>I’m not an economist, but we’ve got five applicants for every single job opening. If you tell me that the best response to that situation is to lay off hundreds of thousands of teachers, I will not accept that this means that you’re smarter and more expert than I am. I will instead conclude — regardless of your prestige or position or years of study — that you’re a moral imbecile. And knowing what I know about your inability to make moral judgments I will have no reason to trust you to make complicated macroeconomic ones.</p></blockquote><p>No, Fred, it’s perfectly clear that you’re not an economist and you don’t know a damn thing about economics.  I’ve read a lot of nonsense since the credit crunch began in the summer of 2008, most of it written by economists, but this is remarkably stupid even by those standards.  There is simply no defense for either the infantile moral posturing or the spectacular ignorance revealed by it.  The misplaced Keynesian faith in animal spirits notwithstanding, economics is not magic.  It is complicated, yes, and there are a few special exceptions to the law of supply and demand, but that law is not significantly more flexible than the laws of physics.  What the clueless Clark doesn’t recognize is that the federal government has massively and permanently distorted the signals of the labor market for a long period of time, leading to an incredible malinvestment of human capital into various industries, including the education industry.  Now that the artificially extended limits of demand have been reached in that and many other industries, the education bubble is in the process of popping precisely as Austrian theory predicts, leaving hundreds of thousands of teachers, (or more accurately, hundreds of thousands of non-teaching admininstrative bureaucrats employed by the school districts), whose labor is no longer necessary or affordable at their current rates by deeply indebted communities.</p><p>Morality has nothing to do with the correct conclusion that when a glass is already full, you cannot pour more water into it.  It’s simply an observable matter of fact.  And if a full glass happens to be shrinking, then water is going to have to come out of it.  Taking exception to such basic logic does not make you a moral exemplar, rather, denying it makes you an intellectual imbecile.  Based on the evidence here, logic also dictates that no economist, or even economically aware individual, need concern themselves with what Mr. Clark thinks of their moral judgments or anything else.</p><p>If Clark wishes to wax indignant over gross and destructive immorality, he should focus his ire on the Fed, on the banks, and on the politicians who constructed a fraudulent financial system that was mathematically certain to fail and inflict millions of job losses on teachers, real estate agents, government employees, Fortune 500 corporations, and small family businesses alike.  The salient fact is not whether 9.7% unemployment is high enough or not, but that utilizing more government intervention to prevent that rate from rising higher is guaranteed to extend and exacerbate the trauma to the labor force.</p><p>The reason the economic contraction confounds so many political bloggers like Slacktivist <i>regardless of their party allegiance</i> is that the problem cannot possibly be characterized as a Democratic problem or a Republican problem.  It is, instead, a fundamentally structural problem with the financial system that dates back to the establishment of the fourth U.S. central bank.  The long run has arrived and it has rendered the conventional liberal vs conservative debate completely irrelevant.  Ironically, the solution is to be found in the example set by a Democratic president, Andrew Jackson.  If Democrats want to find an plausible answer, they need to look to their party roots, not their present ideology.</p><p>UPDATE: the comments are even better.  This was my favorite: “<i>If Krugman and DeLong are right (and Paul Krugman is always right) then short-term government borrowing and spending should be a high priority right now.”</i></p><p>Paul Krugman is always right?  That’s an intriguing statement.</p><p>1. Paul Krugman recommended investing in real estate and stocks while making fun of gold investors in 2002. <br> 2. Paul Krugman thought the Fed should inflate a housing bubble in 2002.<br> 3. Paul Krugman declared a $600 billion stimulus plan was required in November 2008.  In 2009, he complained that the Obama adminstration’s $787 billion stimulus plan was too small.<br> 4. And he was a bit late in <a href=\"http://www.milobookclub.com/2010/06/28/krugman-concedes-only-one-year-late/\">recognizing the obvious</a>.</br></br></br></p></div>",
  "content_text": "I was not at all impressed by\nthe lunatic defense of economic credentialism\nby an economist employed by the very institution that is most responsible for the incoming Great Depression 2.0.  But then I read this astonishingly ignorant appeal to\nmorality\nby Fred Clark and I had to admit that Kartik Athreya may have had a point in insisting that at least some bloggers\nshouldn’t write about economic matters\n:\nI’m not an economist, but we’ve got five applicants for every single job opening. If you tell me that the best response to that situation is to lay off hundreds of thousands of teachers, I will not accept that this means that you’re smarter and more expert than I am. I will instead conclude — regardless of your prestige or position or years of study — that you’re a moral imbecile. And knowing what I know about your inability to make moral judgments I will have no reason to trust you to make complicated macroeconomic ones.\nNo, Fred, it’s perfectly clear that you’re not an economist and you don’t know a damn thing about economics.  I’ve read a lot of nonsense since the credit crunch began in the summer of 2008, most of it written by economists, but this is remarkably stupid even by those standards.  There is simply no defense for either the infantile moral posturing or the spectacular ignorance revealed by it.  The misplaced Keynesian faith in animal spirits notwithstanding, economics is not magic.  It is complicated, yes, and there are a few special exceptions to the law of supply and demand, but that law is not significantly more flexible than the laws of physics.  What the clueless Clark doesn’t recognize is that the federal government has massively and permanently distorted the signals of the labor market for a long period of time, leading to an incredible malinvestment of human capital into various industries, including the education industry.  Now that the artificially extended limits of demand have been reached in that and many other industries, the education bubble is in the process of popping precisely as Austrian theory predicts, leaving hundreds of thousands of teachers, (or more accurately, hundreds of thousands of non-teaching admininstrative bureaucrats employed by the school districts), whose labor is no longer necessary or affordable at their current rates by deeply indebted communities.\nMorality has nothing to do with the correct conclusion that when a glass is already full, you cannot pour more water into it.  It’s simply an observable matter of fact.  And if a full glass happens to be shrinking, then water is going to have to come out of it.  Taking exception to such basic logic does not make you a moral exemplar, rather, denying it makes you an intellectual imbecile.  Based on the evidence here, logic also dictates that no economist, or even economically aware individual, need concern themselves with what Mr. Clark thinks of their moral judgments or anything else.\nIf Clark wishes to wax indignant over gross and destructive immorality, he should focus his ire on the Fed, on the banks, and on the politicians who constructed a fraudulent financial system that was mathematically certain to fail and inflict millions of job losses on teachers, real estate agents, government employees, Fortune 500 corporations, and small family businesses alike.  The salient fact is not whether 9.7% unemployment is high enough or not, but that utilizing more government intervention to prevent that rate from rising higher is guaranteed to extend and exacerbate the trauma to the labor force.\nThe reason the economic contraction confounds so many political bloggers like Slacktivist\nregardless of their party allegiance\nis that the problem cannot possibly be characterized as a Democratic problem or a Republican problem.  It is, instead, a fundamentally structural problem with the financial system that dates back to the establishment of the fourth U.S. central bank.  The long run has arrived and it has rendered the conventional liberal vs conservative debate completely irrelevant.  Ironically, the solution is to be found in the example set by a Democratic president, Andrew Jackson.  If Democrats want to find an plausible answer, they need to look to their party roots, not their present ideology.\nUPDATE: the comments are even better.  This was my favorite: “\nIf Krugman and DeLong are right (and Paul Krugman is always right) then short-term government borrowing and spending should be a high priority right now.”\nPaul Krugman is always right?  That’s an intriguing statement.\n1. Paul Krugman recommended investing in real estate and stocks while making fun of gold investors in 2002.\n2. Paul Krugman thought the Fed should inflate a housing bubble in 2002.\n3. Paul Krugman declared a $600 billion stimulus plan was required in November 2008.  In 2009, he complained that the Obama adminstration’s $787 billion stimulus plan was too small.\n4. And he was a bit late in\nrecognizing the obvious\n.",
  "tags": [
    "economics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-01T15:49:00+00:00"
}