{
  "url": "https://voxday.net/2010/07/14/lest-you-wonder/",
  "scraped_at": "2026-01-08T23:32:00.202747",
  "title": "Lest you wonder",
  "date_display": "July 14, 2010",
  "date_iso": "2010-07-14T17:15:00+00:00",
  "date_from_url": "2010-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why the business and economics coverage at The Atlantic is so abysmal.  Megan McClueless, the “libertarian” who voted for Obama, <a href=\"http://www.theatlantic.com/business/archive/2010/07/reader-thoughts-why-pickup-artists-are-lame/59627/\">tries another take</a> on Game:</p><blockquote><p>My off the cuff observation was a genuine one; this whole thing sounds  like what girls used to do.  And in fact, at some level the PUAs have to  know that it’s not really particularly manly.  Why do I think this?   Because if your girlfriend (however temporary) caught you mimicking Tom  Cruise in front of the mirror, or spending your spare time trolling  message boards for magic tricks to impress women with . . . well, would  she be more enamored, or would she slither out of bed in disgust and  start looking for her clothes?</p><p>I am not against people attempting  to upgrade their social skills, nor am I horrified at the thought that  “beta” males will somehow sneak into the gene pool; after all, I live in  the city often called “Hollywood for Nerds”.  But the combination of  artificiality, superficiality, and manipulation in the PUA manifestos  makes it really hard not to snicker.</p></blockquote><p>We have certainly reached a nadir of understanding when a method which was originally developed and is still primarily used <i>to have sex with women</i> is denigrated as unmanly.  And to appeal to a hypothetical girlfriend’s opinion is to miss the point entirely.  What horrifies McClueless is the idea that after 40+ years of relentless feminist indoctrination, the men of the West have shattered the pedestal of intrinsic female superiority that had been so painstakingly constructed.  Ironically, it takes the non-economist Roissy <a href=\"http://www.samvincente.com/feminists-still-not-getting-it-never-will\">to explain the core of the matter</a> to the credentialed economist.</p><p><i>The herculean efforts required of the vast majority of men to seduce women that strike McArdle as unseemly and calculating when compared to the relatively easy go of it women in their prime years have when setting about to seduce men is just a reflection of the biological inequality between the sexes in their value on the sexual market. Sperm is cheap, eggs are expensive, and all that. McArdle is mistaken to assume this disparity in degree of mating effort caused by intrinsic sex differences is proof of men’s venality or women’s nobility.</i></p><p>The CDC statistics indicate that the primary sociosexual problem is that 75% of the women are primarily attracted to only 10% of the men.  There is little that can be done about the demand side since women like what they like, so the solution has to come from the supply side.  This is in everyone’s interest, male and female alike, since an expansion of the supply of men who are attractive to women will have the effect of lowering the high price women are forced to pay for the privilege of receiving Alpha attention.</p><p>But McArdle’s inept critique is a helpful reminder of an important maxim. <i>Never pay any attention to what a woman <b>says</b> about what attracts women.  Pay attention to what she does.  And more importantly, <b>who</b> she does.</i></p></div>",
  "content_text": "Why the business and economics coverage at The Atlantic is so abysmal.  Megan McClueless, the “libertarian” who voted for Obama,\ntries another take\non Game:\nMy off the cuff observation was a genuine one; this whole thing sounds  like what girls used to do.  And in fact, at some level the PUAs have to  know that it’s not really particularly manly.  Why do I think this?   Because if your girlfriend (however temporary) caught you mimicking Tom  Cruise in front of the mirror, or spending your spare time trolling  message boards for magic tricks to impress women with . . . well, would  she be more enamored, or would she slither out of bed in disgust and  start looking for her clothes?\nI am not against people attempting  to upgrade their social skills, nor am I horrified at the thought that  “beta” males will somehow sneak into the gene pool; after all, I live in  the city often called “Hollywood for Nerds”.  But the combination of  artificiality, superficiality, and manipulation in the PUA manifestos  makes it really hard not to snicker.\nWe have certainly reached a nadir of understanding when a method which was originally developed and is still primarily used\nto have sex with women\nis denigrated as unmanly.  And to appeal to a hypothetical girlfriend’s opinion is to miss the point entirely.  What horrifies McClueless is the idea that after 40+ years of relentless feminist indoctrination, the men of the West have shattered the pedestal of intrinsic female superiority that had been so painstakingly constructed.  Ironically, it takes the non-economist Roissy\nto explain the core of the matter\nto the credentialed economist.\nThe herculean efforts required of the vast majority of men to seduce women that strike McArdle as unseemly and calculating when compared to the relatively easy go of it women in their prime years have when setting about to seduce men is just a reflection of the biological inequality between the sexes in their value on the sexual market. Sperm is cheap, eggs are expensive, and all that. McArdle is mistaken to assume this disparity in degree of mating effort caused by intrinsic sex differences is proof of men’s venality or women’s nobility.\nThe CDC statistics indicate that the primary sociosexual problem is that 75% of the women are primarily attracted to only 10% of the men.  There is little that can be done about the demand side since women like what they like, so the solution has to come from the supply side.  This is in everyone’s interest, male and female alike, since an expansion of the supply of men who are attractive to women will have the effect of lowering the high price women are forced to pay for the privilege of receiving Alpha attention.\nBut McArdle’s inept critique is a helpful reminder of an important maxim.\nNever pay any attention to what a woman\nsays\nabout what attracts women.  Pay attention to what she does.  And more importantly,\nwho\nshe does.",
  "tags": [
    "trainwreck",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-14T16:15:00+00:00"
}