{
  "url": "https://voxday.net/2010/07/12/mailvox-loyalty-proxy/",
  "scraped_at": "2026-01-08T23:31:45.547781",
  "title": "Mailvox: the loyalty proxy",
  "date_display": "July 12, 2010",
  "date_iso": "2010-07-12T14:15:00+00:00",
  "date_from_url": "2010-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Renee 84 sees a double-standard at work:</p><blockquote><p>I find it interesting that it seems as if a man’s sexual history doesn’t seem to serve as a practical proxy for their sexual loyalty.</p><p>As a Christian, I know that God never proclaimed that ONLY women should be virgins before marriage, it applied to both males and females. So whenever I hear conversations from men around the blogsphere who have admitted to having casual sex themselves, lost their virginity at a young age, multiple partners at one time, etc, who call women sluts for having casual sex themselves, I pretty much think that they’re hypocrites.</p><p>I’m not one to look at a cad (basically a male slut) in a positive light.  I hear all sorts of reasons for this type of double standard and many of them make sense. But in the end, in my eyes this doesn’t trump God’s Word and morals. They end of being almost excuses in a way.</p></blockquote><p>It’s not so much that a man’s sexual history doesn’t serve as a practical proxy for their sexual loyalty, it’s that women don’t need the proxy because they place a much lower value on sexual loyalty than men do.  It is perfectly clear that women are attracted to men with sexual experience and actively dislike men who don’t have it.  It is primarily women who make fun of men who don’t have success with women, they are the ones who label such men losers.  Indeed, as has often been seen right here on this blog, attacking a man’s sexual history and implying its brevity is a favored form of female insult.</p><p>So women are less concerned with sexual loyalty than with sexual status; on average they are very happy to trade an increased risk of sexual disloyalty for higher sexual status in the short-term as well as the long-term.  (The reason that women who have sex with Alphas and Betas eventually settle for Deltas and Gammas is because they possess insufficient value to land the higher status men for anything beyond the short term.)  There is really not much room for debate on this as there are legions of men with no sexual history and low sexual status available at every geek-related convention and yet not even the most desperate woman would consider seeking a husband there.</p><p>I have no doubt that Renee84 regards studs in a negative light intellectually, but that doesn’t mean that she isn’t emotionally and physically attracted to them in the same way that most women are.  If it were true that women were genuinely repelled by studs, they would flee from rock stars and pro athletes in disgust rather than throwing themselves at them in droves.  Now, one should never forget that women possess brains and free will and are perfectly capable of surmounting their biological impulses, but that doesn’t change the basic and observable fact that the impulses are there to be resisted.</p><p>Men, on the other hand, highly prize sexual loyalty and place a very negative value on women with extensive sexual histories.  This should be obvious when one considers the contemptuous male attitude towards prostitutes and porn stars.  The modern men of the West may not realize that they still place such store in sexual loyalty, but the instinctive fury that can be aroused when a man’s wife is touching another man or otherwise <a href=\"http://www.marriedmansexlife.com/2010/07/female-loyalty-is-selling-point.html\">sends unconscious signals of her prospective sexual availability in public</a> tends to indicate that they do, even if they’re not killing each other in duels over petty insults to a woman’s honor any more.</p><p>So, I think it’s a misnomer to describe the situation as a double standard when it’s really two different sets of subjective values that underlie two entirely different standards.  If women regarded rock stars in the same way that men regard street hookers, then the double standard would be hypocritical.  But given the breadth of the divergence in the opposite sexual value perspectives, it really shouldn’t be regarded that way.</p><p>Now, given the Biblical acceptance of multiple wives, I don’t think it can reasonably said that male virginity comes with precisely the same premium that female virginity does, although it certainly comes with some premium given the instruction that deacons of the church are to have only one wife.  This lower premium does not excuse premarital fornication in any way, of course; I merely note it as a tangent.  I see the secular “double standard” as entirely irrelevant to the Christian perspective because, as is so often the case, the Christian view is fundamentally different than the secular one as it is necessarily driven by non-biomechanic concerns that simply don’t apply to the non-Christian.  But as one can usefully discuss gravity and its implications without necessarily taking the Christian perspective on it into account, one can likewise discuss Game.</p></div>",
  "content_text": "Renee 84 sees a double-standard at work:\nI find it interesting that it seems as if a man’s sexual history doesn’t seem to serve as a practical proxy for their sexual loyalty.\nAs a Christian, I know that God never proclaimed that ONLY women should be virgins before marriage, it applied to both males and females. So whenever I hear conversations from men around the blogsphere who have admitted to having casual sex themselves, lost their virginity at a young age, multiple partners at one time, etc, who call women sluts for having casual sex themselves, I pretty much think that they’re hypocrites.\nI’m not one to look at a cad (basically a male slut) in a positive light.  I hear all sorts of reasons for this type of double standard and many of them make sense. But in the end, in my eyes this doesn’t trump God’s Word and morals. They end of being almost excuses in a way.\nIt’s not so much that a man’s sexual history doesn’t serve as a practical proxy for their sexual loyalty, it’s that women don’t need the proxy because they place a much lower value on sexual loyalty than men do.  It is perfectly clear that women are attracted to men with sexual experience and actively dislike men who don’t have it.  It is primarily women who make fun of men who don’t have success with women, they are the ones who label such men losers.  Indeed, as has often been seen right here on this blog, attacking a man’s sexual history and implying its brevity is a favored form of female insult.\nSo women are less concerned with sexual loyalty than with sexual status; on average they are very happy to trade an increased risk of sexual disloyalty for higher sexual status in the short-term as well as the long-term.  (The reason that women who have sex with Alphas and Betas eventually settle for Deltas and Gammas is because they possess insufficient value to land the higher status men for anything beyond the short term.)  There is really not much room for debate on this as there are legions of men with no sexual history and low sexual status available at every geek-related convention and yet not even the most desperate woman would consider seeking a husband there.\nI have no doubt that Renee84 regards studs in a negative light intellectually, but that doesn’t mean that she isn’t emotionally and physically attracted to them in the same way that most women are.  If it were true that women were genuinely repelled by studs, they would flee from rock stars and pro athletes in disgust rather than throwing themselves at them in droves.  Now, one should never forget that women possess brains and free will and are perfectly capable of surmounting their biological impulses, but that doesn’t change the basic and observable fact that the impulses are there to be resisted.\nMen, on the other hand, highly prize sexual loyalty and place a very negative value on women with extensive sexual histories.  This should be obvious when one considers the contemptuous male attitude towards prostitutes and porn stars.  The modern men of the West may not realize that they still place such store in sexual loyalty, but the instinctive fury that can be aroused when a man’s wife is touching another man or otherwise\nsends unconscious signals of her prospective sexual availability in public\ntends to indicate that they do, even if they’re not killing each other in duels over petty insults to a woman’s honor any more.\nSo, I think it’s a misnomer to describe the situation as a double standard when it’s really two different sets of subjective values that underlie two entirely different standards.  If women regarded rock stars in the same way that men regard street hookers, then the double standard would be hypocritical.  But given the breadth of the divergence in the opposite sexual value perspectives, it really shouldn’t be regarded that way.\nNow, given the Biblical acceptance of multiple wives, I don’t think it can reasonably said that male virginity comes with precisely the same premium that female virginity does, although it certainly comes with some premium given the instruction that deacons of the church are to have only one wife.  This lower premium does not excuse premarital fornication in any way, of course; I merely note it as a tangent.  I see the secular “double standard” as entirely irrelevant to the Christian perspective because, as is so often the case, the Christian view is fundamentally different than the secular one as it is necessarily driven by non-biomechanic concerns that simply don’t apply to the non-Christian.  But as one can usefully discuss gravity and its implications without necessarily taking the Christian perspective on it into account, one can likewise discuss Game.",
  "tags": [
    "mailvox",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-12T13:15:00+00:00"
}