{
  "url": "https://voxday.net/2010/07/15/mailvox-uber-dawks-strikes-three/",
  "scraped_at": "2026-01-08T23:32:03.828911",
  "title": "Mailvox: Uber Dawks strikes three",
  "date_display": "July 15, 2010",
  "date_iso": "2010-07-15T15:00:00+00:00",
  "date_from_url": "2010-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can’t stop him, you can only hope to contain him!</p><blockquote><p>I did not mean “objective scientific evidence”, I mean any objective evidence at all. The Bible is not an objective piece of evidence, scientific or otherwise. Wrong. Try again in our bonus round. Reading the comments on your blog this morning, it seems that none of your ilk can come up with anything either. The Courtier’s Reply is still looking mighty valid.</p><p>Finally, not that I need to justify any credentials, but since your ilk has been speculating, I am a Ph.D. candidate in Evolutionary Psychology at a prestigious major university. My views are not the minority among atheists, but the majority. Go to Pharyngula and you’ll see that I’m not alone. Read Dawkins more polemical work, read Sam Harris or Chris Hitchens, I’m not saying anything that hasn’t already been tackled at length by these great thinkers.</p><p>Also, for all the mocking of my celebrity atheist paragraph, I was not appealing to these men to validate atheism, but rather to show that the atheist in that comic is a grand caricature, representative of the kind of narrow thinking that you Christian fundies are known for.</p></blockquote><p><i><b>evidence</b><br> –noun<br> 1. that which tends to prove or disprove something; ground for belief; proof.<br> 2. something that makes plain or clear; an indication or sign.<br> 3. Data presented to a court or jury in proof of the facts in issue and which may include the testimony of witnesses, records, documents, or objects.</br></br></br></br></i></p><p>Evidence is any information so given, whether furnished by witnesses or derived from documents or from any other source.</p><p>I have to admit, I’m not exactly what one would call concerned about the opinion of anyone who believes that there is no evidence for the existence when God even after the difference between “evidence” and “scientific evidence” has been pointed out to him.  I am probably the least likely man on the planet to be moved by the arguments of anyone who genuinely believes Richard Dawkins, Sam Harris, and Christopher Hitchens are, and I quote, “great thinkers”.  This is surely the very worst site on the Internet to make an appeal to Pharyngula and as for <a href=\"http://3.bp.blogspot.com/_3UXl0oMYPLs/TDyKatD-ZlI/AAAAAAAAAMg/n45lScaQtNM/s1600/courtier.jpg\">The Courtier’s Reply</a>, it requires the sort of innumeracy and complete philosophical ignorance we have come to expect of <s>butterfly collectors</s>biologists to take it seriously.  But I have absolutely no doubt that his maleducated and irrational views are the majority among atheists; that is precisely why I titled my book on the subject “The Irrational Atheist”.</p><p>The thing that is so ridiculous about the definitionally challenged “no evidence” argument is that even third-rate minds like Dawkins know that it is hopelessly incorrect.  The existence of testimonial and documentary evidence for God is the very reason Richard Dawkins wrote an essay arguing for the superiority of <i>scientific evidence</i> over eyewitness evidence in <i>The Devil’s Chaplain</i>, although scientific evidence is less valid in a court of law than eyewitness evidence and is rightly considered much less reliable than documentary evidence of the sort that the Bible represents.</p><p>Anyhow, I’m sure we all wish the PhD-to-be great success in his future career in the gastronomical service industry.</p></div>",
  "content_text": "You can’t stop him, you can only hope to contain him!\nI did not mean “objective scientific evidence”, I mean any objective evidence at all. The Bible is not an objective piece of evidence, scientific or otherwise. Wrong. Try again in our bonus round. Reading the comments on your blog this morning, it seems that none of your ilk can come up with anything either. The Courtier’s Reply is still looking mighty valid.\nFinally, not that I need to justify any credentials, but since your ilk has been speculating, I am a Ph.D. candidate in Evolutionary Psychology at a prestigious major university. My views are not the minority among atheists, but the majority. Go to Pharyngula and you’ll see that I’m not alone. Read Dawkins more polemical work, read Sam Harris or Chris Hitchens, I’m not saying anything that hasn’t already been tackled at length by these great thinkers.\nAlso, for all the mocking of my celebrity atheist paragraph, I was not appealing to these men to validate atheism, but rather to show that the atheist in that comic is a grand caricature, representative of the kind of narrow thinking that you Christian fundies are known for.\nevidence\n–noun\n1. that which tends to prove or disprove something; ground for belief; proof.\n2. something that makes plain or clear; an indication or sign.\n3. Data presented to a court or jury in proof of the facts in issue and which may include the testimony of witnesses, records, documents, or objects.\nEvidence is any information so given, whether furnished by witnesses or derived from documents or from any other source.\nI have to admit, I’m not exactly what one would call concerned about the opinion of anyone who believes that there is no evidence for the existence when God even after the difference between “evidence” and “scientific evidence” has been pointed out to him.  I am probably the least likely man on the planet to be moved by the arguments of anyone who genuinely believes Richard Dawkins, Sam Harris, and Christopher Hitchens are, and I quote, “great thinkers”.  This is surely the very worst site on the Internet to make an appeal to Pharyngula and as for\nThe Courtier’s Reply\n, it requires the sort of innumeracy and complete philosophical ignorance we have come to expect of\nbutterfly collectors\nbiologists to take it seriously.  But I have absolutely no doubt that his maleducated and irrational views are the majority among atheists; that is precisely why I titled my book on the subject “The Irrational Atheist”.\nThe thing that is so ridiculous about the definitionally challenged “no evidence” argument is that even third-rate minds like Dawkins know that it is hopelessly incorrect.  The existence of testimonial and documentary evidence for God is the very reason Richard Dawkins wrote an essay arguing for the superiority of\nscientific evidence\nover eyewitness evidence in\nThe Devil’s Chaplain\n, although scientific evidence is less valid in a court of law than eyewitness evidence and is rightly considered much less reliable than documentary evidence of the sort that the Bible represents.\nAnyhow, I’m sure we all wish the PhD-to-be great success in his future career in the gastronomical service industry.",
  "tags": [
    "atheism",
    "freakshow",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-15T14:00:00+00:00"
}