{
  "url": "https://voxday.net/2010/07/14/mailvox-catching-up-on-history/",
  "scraped_at": "2026-01-08T23:31:56.545309",
  "title": "Mailvox: catching up on history",
  "date_display": "July 14, 2010",
  "date_iso": "2010-07-14T11:53:00+00:00",
  "date_from_url": "2010-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BG asks about the Crusades:</p><blockquote><p>I’ve been reading your blog, and comments, for years now, stealing countless hours of productivity from my employer. My brother-in-law, a younger man, who I don’t think is saved but is searching, just emailed me asking me to tell him about the Crusades. He said what information he has found so far has been confusing. I haven’t talked to him yet. He knows I know a lot, but I really haven’t studied the Crusades. Can you or one of the Ilk, please direct me to a good source? I don’t expect to take up your time, but any thoughts on the topic would also be greatly appreciated.</p></blockquote><p>I would start with Stephen Runcimen’s three-volume History of the Crusades.  I would then read John Julius Norwich’s three-volume history of Byzantium, which gives a solid background for the events that led up to the Crusades.  What those ignorant of Byzantine history don’t understand – which is probably more than 95 percent of the people who bring up the Crusades in casual conversation – is that the Crusades were not an <i>offensive</i> campaign in any way, shape, or form, but rather a <i>defensive</i> one for which more than one desperate emperor of Byzantium had spent years pleading.</p><p>MN, on the other hand, has a pair of questions related to American history:</p><blockquote><p>I’ve emailed you once before, and I just want to say thanks again for your blog and column. I’m 24 and I can honestly say that in the year or so since I started following your work, my critical thinking abilities have developed more than in the 12 years of public school and 4 of college combined.</p><p>Anyway, being that today is America’s Independence Day, I was thinking about its history, specifically the Civil War. I’m able to effectively rationalize most of my beliefs about it, but I am having trouble with a couple things that I hoped you might help with:</p><p>1. I believe I’ve recall you writing that had you been around in 1860, you would have fought for the South. I’m undecided on what I would’ve done. Certainly, the southern states’ sovereignty was being infringed and they had the right to defend it. However, how do you justify defending the institution of slavery? While I do not believe in human equality in any real sense, to my mind, the idea of slavery seems in blatant conflict with both the Declaration of Independence and the ‘Life, Liberty, and Property’ part of the 5th Amendment. I also believe that one of the few legitimate functions of our government is to uphold these basic rights, so in that sense, I can rationalize that perhaps the North was justified. The only counter I can come up with is that slaves were not considered citizens, and thus not afforded these rights.</p><p>2. I also believe you’ve called Lincoln the worst president in American history. Because he wiped his ass with the Bill of Rights and ended any notions of state sovereignty, I agree with you to a point. Its to a point because, from some things I’ve read, Lincoln’s plan had he lived was to ship all of the slaves back to Africa or the Caribbean as part of the reconstruction progress. In my opinion, this would absolutely have been the correct move, both at the time and in hindsight from 2010. If this is true, can you really call Lincoln the worst president ever, or were his violations of the Constitution too egregious to overcome? I can’t say that he’s worse than guys like FDR, Wilson, or Obama.</p></blockquote><p>My answer to question one comes in two parts.  First, as a libertarian, I would prefer an institution of voluntary private slavery to the present system of federal slavery that is in effect today.  Either I own myself or another party does.  If I am prevented from selling something, in this case my body, then it is obvious that I do not legally own it.  Someone else does.  In the present United States the government claims legal ownership of its citizens, as evidenced by the Selective Service Act and the income tax, so it is a little bizarre for present-day involuntary slaves of the state to posture about their opposition to historical involuntary private slavery.  Note that the fact your owner has not elected to draft you is of no more significance to your legal and factual status as a slave to the state than the fact that the owner of a  field slave in the 1800s did not require him to work in the fields on a particular day.</p><p>As to the second part, state sovereignty is not conditional.  For good or ill, either it exists or it does not.  Also, slavery could not possibly have been the primary issue inspiring secession due to the fact that four slave states remained in the Union.  But regardless of whether or not slavery was the secondary or tertiary factor beyond the pre-war economic rape of the South by the North, that is totally irrelevant with regards to the question of whether a sovereign state had the right to secede from a voluntary union or not.  The great evil of the Civil War and the irrelevance of slavery can be seen by the fact that the Union is no longer voluntary, but is imposed by force to this date even though private involuntary slavery is now a dead issue.</p><p>Regarding the second question, my opinion of Lincoln has absolutely nothing to do with his plans regarding the former slaves.  The reason he is by far the worst president is because he murdered the American Republic and imposed the American Empire on the American people at a tremendous cost in American blood.  He was America’s Caesar, and like Caesar, he received a fitting reward for his treasonous crime against his country.</p><p>UPDATE – In answer to the inevitable and illogical argument that the Southern States secession was all about slavery, consider the following analogy.  Suppose you want to fly a flag, as permitted by the rules of your homeowner’s association, but the committee that runs the homeowner’s association suddenly decides they don’t want you to fly one.  They show up at your house unannounced to inform you of their decision, then barge into your bedroom in order to confiscate any flags that they might find.  If then you punch the head of the committee in the face, was your desire to fly a flag the cause?</p></div>",
  "content_text": "BG asks about the Crusades:\nI’ve been reading your blog, and comments, for years now, stealing countless hours of productivity from my employer. My brother-in-law, a younger man, who I don’t think is saved but is searching, just emailed me asking me to tell him about the Crusades. He said what information he has found so far has been confusing. I haven’t talked to him yet. He knows I know a lot, but I really haven’t studied the Crusades. Can you or one of the Ilk, please direct me to a good source? I don’t expect to take up your time, but any thoughts on the topic would also be greatly appreciated.\nI would start with Stephen Runcimen’s three-volume History of the Crusades.  I would then read John Julius Norwich’s three-volume history of Byzantium, which gives a solid background for the events that led up to the Crusades.  What those ignorant of Byzantine history don’t understand – which is probably more than 95 percent of the people who bring up the Crusades in casual conversation – is that the Crusades were not an\noffensive\ncampaign in any way, shape, or form, but rather a\ndefensive\none for which more than one desperate emperor of Byzantium had spent years pleading.\nMN, on the other hand, has a pair of questions related to American history:\nI’ve emailed you once before, and I just want to say thanks again for your blog and column. I’m 24 and I can honestly say that in the year or so since I started following your work, my critical thinking abilities have developed more than in the 12 years of public school and 4 of college combined.\nAnyway, being that today is America’s Independence Day, I was thinking about its history, specifically the Civil War. I’m able to effectively rationalize most of my beliefs about it, but I am having trouble with a couple things that I hoped you might help with:\n1. I believe I’ve recall you writing that had you been around in 1860, you would have fought for the South. I’m undecided on what I would’ve done. Certainly, the southern states’ sovereignty was being infringed and they had the right to defend it. However, how do you justify defending the institution of slavery? While I do not believe in human equality in any real sense, to my mind, the idea of slavery seems in blatant conflict with both the Declaration of Independence and the ‘Life, Liberty, and Property’ part of the 5th Amendment. I also believe that one of the few legitimate functions of our government is to uphold these basic rights, so in that sense, I can rationalize that perhaps the North was justified. The only counter I can come up with is that slaves were not considered citizens, and thus not afforded these rights.\n2. I also believe you’ve called Lincoln the worst president in American history. Because he wiped his ass with the Bill of Rights and ended any notions of state sovereignty, I agree with you to a point. Its to a point because, from some things I’ve read, Lincoln’s plan had he lived was to ship all of the slaves back to Africa or the Caribbean as part of the reconstruction progress. In my opinion, this would absolutely have been the correct move, both at the time and in hindsight from 2010. If this is true, can you really call Lincoln the worst president ever, or were his violations of the Constitution too egregious to overcome? I can’t say that he’s worse than guys like FDR, Wilson, or Obama.\nMy answer to question one comes in two parts.  First, as a libertarian, I would prefer an institution of voluntary private slavery to the present system of federal slavery that is in effect today.  Either I own myself or another party does.  If I am prevented from selling something, in this case my body, then it is obvious that I do not legally own it.  Someone else does.  In the present United States the government claims legal ownership of its citizens, as evidenced by the Selective Service Act and the income tax, so it is a little bizarre for present-day involuntary slaves of the state to posture about their opposition to historical involuntary private slavery.  Note that the fact your owner has not elected to draft you is of no more significance to your legal and factual status as a slave to the state than the fact that the owner of a  field slave in the 1800s did not require him to work in the fields on a particular day.\nAs to the second part, state sovereignty is not conditional.  For good or ill, either it exists or it does not.  Also, slavery could not possibly have been the primary issue inspiring secession due to the fact that four slave states remained in the Union.  But regardless of whether or not slavery was the secondary or tertiary factor beyond the pre-war economic rape of the South by the North, that is totally irrelevant with regards to the question of whether a sovereign state had the right to secede from a voluntary union or not.  The great evil of the Civil War and the irrelevance of slavery can be seen by the fact that the Union is no longer voluntary, but is imposed by force to this date even though private involuntary slavery is now a dead issue.\nRegarding the second question, my opinion of Lincoln has absolutely nothing to do with his plans regarding the former slaves.  The reason he is by far the worst president is because he murdered the American Republic and imposed the American Empire on the American people at a tremendous cost in American blood.  He was America’s Caesar, and like Caesar, he received a fitting reward for his treasonous crime against his country.\nUPDATE – In answer to the inevitable and illogical argument that the Southern States secession was all about slavery, consider the following analogy.  Suppose you want to fly a flag, as permitted by the rules of your homeowner’s association, but the committee that runs the homeowner’s association suddenly decides they don’t want you to fly one.  They show up at your house unannounced to inform you of their decision, then barge into your bedroom in order to confiscate any flags that they might find.  If then you punch the head of the committee in the face, was your desire to fly a flag the cause?",
  "tags": [
    "history",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-14T10:53:00+00:00"
}