{
  "url": "https://voxday.net/2010/07/29/more-excuses-from-fowl-atheis/",
  "scraped_at": "2026-01-08T23:33:17.883353",
  "title": "More excuses from the Fowl Atheist",
  "date_display": "July 29, 2010",
  "date_iso": "2010-07-29T17:15:00+00:00",
  "date_from_url": "2010-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ Myers <a href=\"http://scienceblogs.com/pharyngula/2010/07/a_science_section_on_huffpo_sw.php\">tries to defend his cowardly fear of public debate</a> and his inability to formulate effective arguments under the guise of criticizing the idea of a science section on a popular web site:</p><blockquote><p><i>[JL Vernon] “The most resounding message emerging from the opposition is the idea that having “real science” share a platform with “bad science” will ultimately tarnish the reputation of the legitimate scientists and science communicators who choose to participate. This is essentially the same argument Richard Dawkins, PZ Meyers and others take when refusing to debate evolutionists. The concept here being that by sharing the stage with creationists, scientists lend credibility to the creationist arguments. In some ways, I think this is a cowardly response. If you have a sound argument, the opposition should not win the debate.</i></p><p>That’s wrong on multiple levels. First, a debate is not won by sound argument; it’s by persuasive rhetoric. Many creationists have that skill (I have to repeat a mantra I’ve got: creationists are not stupid, just ignorant and misled by ignorant arguments), so it is a serious tactical error to think that because all the facts and science are on your side, you’re going to win debates. That’s a recipe for consistent failure.</p><p>The other problem here is that I’ve “won” most of my debates…because the other side is just nuts. Jerry Bergman and Geoff Simmons, to name two, were raving loonies who made me embarrassed to be sharing a spotlight with them. There was no gain for me, and plenty for them. You get two possibilities: you’ll face an eloquent rhetorician who will run rings around you despite your command of the facts, or you’ll get a nutcase who makes you feel like you’re sharing the podium with a brain-damaged hobo. Neither are great options.</p></blockquote><p>Vernon is right.  It is a cowardly response.  It is also a very revealing response about how genuinely confident the individual is in the arguments he makes.  (That confidence may or may not be well-placed, of course.)  As I have demonstrated here on numerous occasions, if one is possessed of a sufficient command of the relevant facts, it is a very simple thing to dismantle the credibility of one’s opponent and demonstrate the logical fallacies and factual errors utilized in his arguments.  It escapes no one’s attention that frauds like Dawkins never hesitate to debate decrepit elderly priests and clueless female journalists, but run for shelter the moment a competent opponent appears on the horizon.  The amusing thing is that pseudo-scientists like PZ simply can’t understand the reason they are regularly losing the battle for public opinion is that they have increasingly abandoned science in favor of political and ideological activism.  Worse, they have done so in favor of an anti-democratic technocratic authoritarianism that is far more dangerous than the imaginary theocracies of their fevered nightmares.</p><p>Consider this bit from “<a href=\"http://www.american.com/archive/2010/july/science-turns-authoritarian\">Science Turns Authoritarian</a>“: <i>Science is losing its credibility because it has adopted an authoritarian tone, and has let itself be co-opted by politics….  We searched Nexis for the following phrases to see how their use has changed over the last 30 years: “science says we must,” “science says we should,” “science tells us we must,” “science tells us we should,” “science commands,” “science requires,” “science dictates,” and “science compels.”</i></p><p>What we found surprised us. One phrase, in particular, has become dramatically more frequent in recent years: “Science tells us we should.” Increased usage of this phrase leads to a chart resembling a steep mountain climb (or, for those with a mischievous bent, a “hockey stick”). The use of the phrase “science requires” also increases sharply over time. The chart (below) vividly shows the increasing use of those particular phrases. Some of this may simply reflect the general growth of media output and the growth of new media, but if that were the case, we would expect all of the terms to have shown similar growth, which they do not.</p><p>In other words, around the end of the 1980s, science (at least science reporting) took on a distinctly authoritarian tone. Whether because of funding availability or a desire by some senior academics for greater relevance, or just the spread of activism through the university, scientists stopped speaking objectively and started telling people what to do.</p><p>I am not at all opposed to science qua science, but I am inexorably opposed to all forms of science-flavored authoritarianism.  Needless to say, any refusal to bow before the misapplication of science by scientists is enough cause one to be labled “anti-science” even though it is the short-sighted actions of scientists that are rapidly destroying the credibility of science.  All of this makes me wonder… perhaps WND needs a science section.  And, of course, a master of persuasive rhetoric as the editor.</p></div>",
  "content_text": "PZ Myers\ntries to defend his cowardly fear of public debate\nand his inability to formulate effective arguments under the guise of criticizing the idea of a science section on a popular web site:\n[JL Vernon] “The most resounding message emerging from the opposition is the idea that having “real science” share a platform with “bad science” will ultimately tarnish the reputation of the legitimate scientists and science communicators who choose to participate. This is essentially the same argument Richard Dawkins, PZ Meyers and others take when refusing to debate evolutionists. The concept here being that by sharing the stage with creationists, scientists lend credibility to the creationist arguments. In some ways, I think this is a cowardly response. If you have a sound argument, the opposition should not win the debate.\nThat’s wrong on multiple levels. First, a debate is not won by sound argument; it’s by persuasive rhetoric. Many creationists have that skill (I have to repeat a mantra I’ve got: creationists are not stupid, just ignorant and misled by ignorant arguments), so it is a serious tactical error to think that because all the facts and science are on your side, you’re going to win debates. That’s a recipe for consistent failure.\nThe other problem here is that I’ve “won” most of my debates…because the other side is just nuts. Jerry Bergman and Geoff Simmons, to name two, were raving loonies who made me embarrassed to be sharing a spotlight with them. There was no gain for me, and plenty for them. You get two possibilities: you’ll face an eloquent rhetorician who will run rings around you despite your command of the facts, or you’ll get a nutcase who makes you feel like you’re sharing the podium with a brain-damaged hobo. Neither are great options.\nVernon is right.  It is a cowardly response.  It is also a very revealing response about how genuinely confident the individual is in the arguments he makes.  (That confidence may or may not be well-placed, of course.)  As I have demonstrated here on numerous occasions, if one is possessed of a sufficient command of the relevant facts, it is a very simple thing to dismantle the credibility of one’s opponent and demonstrate the logical fallacies and factual errors utilized in his arguments.  It escapes no one’s attention that frauds like Dawkins never hesitate to debate decrepit elderly priests and clueless female journalists, but run for shelter the moment a competent opponent appears on the horizon.  The amusing thing is that pseudo-scientists like PZ simply can’t understand the reason they are regularly losing the battle for public opinion is that they have increasingly abandoned science in favor of political and ideological activism.  Worse, they have done so in favor of an anti-democratic technocratic authoritarianism that is far more dangerous than the imaginary theocracies of their fevered nightmares.\nConsider this bit from “\nScience Turns Authoritarian\n“:\nScience is losing its credibility because it has adopted an authoritarian tone, and has let itself be co-opted by politics….  We searched Nexis for the following phrases to see how their use has changed over the last 30 years: “science says we must,” “science says we should,” “science tells us we must,” “science tells us we should,” “science commands,” “science requires,” “science dictates,” and “science compels.”\nWhat we found surprised us. One phrase, in particular, has become dramatically more frequent in recent years: “Science tells us we should.” Increased usage of this phrase leads to a chart resembling a steep mountain climb (or, for those with a mischievous bent, a “hockey stick”). The use of the phrase “science requires” also increases sharply over time. The chart (below) vividly shows the increasing use of those particular phrases. Some of this may simply reflect the general growth of media output and the growth of new media, but if that were the case, we would expect all of the terms to have shown similar growth, which they do not.\nIn other words, around the end of the 1980s, science (at least science reporting) took on a distinctly authoritarian tone. Whether because of funding availability or a desire by some senior academics for greater relevance, or just the spread of activism through the university, scientists stopped speaking objectively and started telling people what to do.\nI am not at all opposed to science qua science, but I am inexorably opposed to all forms of science-flavored authoritarianism.  Needless to say, any refusal to bow before the misapplication of science by scientists is enough cause one to be labled “anti-science” even though it is the short-sighted actions of scientists that are rapidly destroying the credibility of science.  All of this makes me wonder… perhaps WND needs a science section.  And, of course, a master of persuasive rhetoric as the editor.",
  "tags": [
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-29T16:15:00+00:00"
}