{
  "url": "https://voxday.net/2010/07/28/mr-buchanan-reads-blog/",
  "scraped_at": "2026-01-08T23:33:08.591968",
  "title": "Mr. Buchanan reads the blog",
  "date_display": "July 28, 2010",
  "date_iso": "2010-07-28T07:45:00+00:00",
  "date_from_url": "2010-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Actually, considering some of the people who have emailed me, it wouldn’t be all that surprising.  In any event, I’m not the only one who is contemplating <a href=\"http://www.huffingtonpost.com/2010/07/27/rendell-obama-could-face_n_661172.html\">a primary challenge</a> to the Magic Negro.</p><blockquote><p>PAT BUCHANAN: [Anti-Vietnam sentiment] drew an anti-war candidate, Eugene McCarthy, first into the New Hampshire primary, and after he did fairly well with 42%, it drew Robert Kennedy in against their own president, tore the Democratic Party apart, and led, of course, to a Republican era. If the president is still hanging in to Afghanistan in 2011, 2012, do you see an anti-war candidate coming out of the Democratic Party?</p><p>ED RENDELL: It’s possible, Pat. It really depends on how far it deteriorates [emphasis mine]. But on the other hand, if troop withdrawal begins in 2011, if there’s some signs that we’re trying to get out of there, and I heard, I think you were talking about, if there are only 3,000 American troops, we still have a presence. But if we start to begin to reduce our presence, I think that’s probably enough to keep an anti-war candidate out of the race.”</p></blockquote><p>As Instapundit noted, the important thing here isn’t that Rendell is the governor of Pennsylvania, but that he is <a href=\"http://www.riehlworldview.com/carnivorous_conservative/2010/07/clintonista-rendell-obama-may-be-primaried-in-2012.html\">a known Clintonista</a>.  And from my perspective, what’s intriguing about taking a foreign policy line of potential attack on Obama rather than his unpopularity among white voters and negative effect on other Democratic politicians is that whereas practically any Democrat could make a case for himself on the basis of the former, there is only one individual who is in a uniquely advantageous position to utilize the former.</p><p>The Secretary of State.</p><p>Due to her Cabinet position and foreign policy focus, the Lizard Queen is uniquely positioned to credibly declare that the situation in Afghanistan has deteriorated and become untenable.  Should she resign her position next year to run against an Obama who has continued the wars, contra to his promises in the 2008 primaries, she will have no trouble obliterating him in the 2012 campaign for the nomination.  Now, the fact that she COULD do this doesn’t mean that she WILL; after all, she didn’t move to oppose immigration and the wars when doing so could have guaranteed her both the nomination and the election last time.</p><p>But given the growing signs that Obama may soon not only continue but extend what is increasingly beginning to look like an American-Islamic war, it is clear that he is likely to be extraordinarily vulnerable if the Lizard Queen elects to strike against her current boss.  The first indication that she intends to do so will be a growing chorus of elite Democratic opinion against Obama’s conduct of the war, particularly with regards to Afghanistan and Pakistan.  (I doubt they will criticize anything related to Iran, assuming there is anything to complain about, in order to placate potential donors in the Israel lobby that has been banging on the Iran war drum ever since Baghdad fell.)  But the more significant indicator would be her resignation from the Cabinet next year.</p></div>",
  "content_text": "Actually, considering some of the people who have emailed me, it wouldn’t be all that surprising.  In any event, I’m not the only one who is contemplating\na primary challenge\nto the Magic Negro.\nPAT BUCHANAN: [Anti-Vietnam sentiment] drew an anti-war candidate, Eugene McCarthy, first into the New Hampshire primary, and after he did fairly well with 42%, it drew Robert Kennedy in against their own president, tore the Democratic Party apart, and led, of course, to a Republican era. If the president is still hanging in to Afghanistan in 2011, 2012, do you see an anti-war candidate coming out of the Democratic Party?\nED RENDELL: It’s possible, Pat. It really depends on how far it deteriorates [emphasis mine]. But on the other hand, if troop withdrawal begins in 2011, if there’s some signs that we’re trying to get out of there, and I heard, I think you were talking about, if there are only 3,000 American troops, we still have a presence. But if we start to begin to reduce our presence, I think that’s probably enough to keep an anti-war candidate out of the race.”\nAs Instapundit noted, the important thing here isn’t that Rendell is the governor of Pennsylvania, but that he is\na known Clintonista\n.  And from my perspective, what’s intriguing about taking a foreign policy line of potential attack on Obama rather than his unpopularity among white voters and negative effect on other Democratic politicians is that whereas practically any Democrat could make a case for himself on the basis of the former, there is only one individual who is in a uniquely advantageous position to utilize the former.\nThe Secretary of State.\nDue to her Cabinet position and foreign policy focus, the Lizard Queen is uniquely positioned to credibly declare that the situation in Afghanistan has deteriorated and become untenable.  Should she resign her position next year to run against an Obama who has continued the wars, contra to his promises in the 2008 primaries, she will have no trouble obliterating him in the 2012 campaign for the nomination.  Now, the fact that she COULD do this doesn’t mean that she WILL; after all, she didn’t move to oppose immigration and the wars when doing so could have guaranteed her both the nomination and the election last time.\nBut given the growing signs that Obama may soon not only continue but extend what is increasingly beginning to look like an American-Islamic war, it is clear that he is likely to be extraordinarily vulnerable if the Lizard Queen elects to strike against her current boss.  The first indication that she intends to do so will be a growing chorus of elite Democratic opinion against Obama’s conduct of the war, particularly with regards to Afghanistan and Pakistan.  (I doubt they will criticize anything related to Iran, assuming there is anything to complain about, in order to placate potential donors in the Israel lobby that has been banging on the Iran war drum ever since Baghdad fell.)  But the more significant indicator would be her resignation from the Cabinet next year.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-28T06:45:00+00:00"
}