{
  "url": "https://voxday.net/2010/07/25/out-of-curiosity/",
  "scraped_at": "2026-01-08T23:32:49.663950",
  "title": "Weekly Poll: Afghanistan and Iraq",
  "date_display": "July 25, 2010",
  "date_iso": "2010-07-25T12:26:00+00:00",
  "date_from_url": "2010-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of Mr. Farah’s recent conversion to the anti-war cause, I’m wondering how many readers here support the wars in Afghanistan and Iraq, how many oppose them, and how many, like Mr. Farah and me, have changed from supporting at least one of them to opposing them both at some point along the way.  As for me, I never supported the Afghan war and began openly opposing the Iraqi war in 2004 when I learned that my support for it on the grounds of the broken ceasefire agreement was based on incorrect information; the agreement was between Iraq and the United Nations, not Iraq and the USA.  Therefore I was forced to conclude that sans any declaration of war or <i>casus belli</i>, the Iraqi war and subsequent occupation was always wholly illegitimate as well as lacking in any national security interest.</p><p><iframe frameborder=\"0\" id=\"proprofs\" name=\"proprofs\" src=\"http://www.proprofs.com/polls/widget/?title=what-is-your-position-on-the-wars-in-afghanistan-and-iraq&amp;theme=grey&amp;width=300\" style=\"width:321px; height:450px; overflow-x:hidden;\"></iframe></p><div style=\"font-size:10px; font-family:Arial, Helvetica, sans-serif; color:#000;\"><a href=\"http://www.proprofs.com/polls/poll/?title=what-is-your-position-on-the-wars-in-afghanistan-and-iraq\" rel=\"noopener\" target=\"_blank\" title=\"What is your position on the wars in Afghanistan and Iraq?\">War Poll</a> » <a href=\"http://www.proprofs.com/polls/\" rel=\"noopener\" target=\"_blank\" title=\"make online polls\">make online polls</a><br> Tags : <a href=\"http://www.proprofs.com/polls/online-polls/?topic=war\" rel=\"noopener\" target=\"_blank\" title=\"war\">war</a> <a href=\"http://www.proprofs.com/polls/online-polls/?topic=politics\" rel=\"noopener\" target=\"_blank\" title=\"politics\">politics</a></br></div></div>",
  "content_text": "In light of Mr. Farah’s recent conversion to the anti-war cause, I’m wondering how many readers here support the wars in Afghanistan and Iraq, how many oppose them, and how many, like Mr. Farah and me, have changed from supporting at least one of them to opposing them both at some point along the way.  As for me, I never supported the Afghan war and began openly opposing the Iraqi war in 2004 when I learned that my support for it on the grounds of the broken ceasefire agreement was based on incorrect information; the agreement was between Iraq and the United Nations, not Iraq and the USA.  Therefore I was forced to conclude that sans any declaration of war or\ncasus belli\n, the Iraqi war and subsequent occupation was always wholly illegitimate as well as lacking in any national security interest.\nWar Poll\n»\nmake online polls\nTags :\nwar\npolitics",
  "tags": [
    "polls",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-25T11:26:00+00:00"
}