{
  "url": "https://voxday.net/2010/07/20/plus-ca-change-plus-cest-la-meme-chose/",
  "scraped_at": "2026-01-08T23:32:27.638513",
  "title": "Plus ça change, plus c’est la même chose",
  "date_display": "July 20, 2010",
  "date_iso": "2010-07-20T15:44:00+00:00",
  "date_from_url": "2010-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“While [the King of Sweden and Norway and former Marshal of France] Bernadotte was in Paris I saw him every day. He but faintly disguised from me the hope he had entertained of ruling France; and in the numerous conversations to which our respective occupations led I ascertained, though Bernadotte did not formally tell me so, that he once had strong expectations of succeeding Napoleon…. Bernadotte expressed to me astonishment at the recall of the Bourbons, and assured me that he had not expected the French people would so readily have consented to the Restoration. I confess I was surprised that Bernadotte, with the intelligence I knew him to possess, should imagine that the will of subjects has any influence in changes of government!”<br> – Louis Antoine Fauvelet de Bourrienne, <i>The Memoirs of Napoleon</i></br></p></div>",
  "content_text": "“While [the King of Sweden and Norway and former Marshal of France] Bernadotte was in Paris I saw him every day. He but faintly disguised from me the hope he had entertained of ruling France; and in the numerous conversations to which our respective occupations led I ascertained, though Bernadotte did not formally tell me so, that he once had strong expectations of succeeding Napoleon…. Bernadotte expressed to me astonishment at the recall of the Bourbons, and assured me that he had not expected the French people would so readily have consented to the Restoration. I confess I was surprised that Bernadotte, with the intelligence I knew him to possess, should imagine that the will of subjects has any influence in changes of government!”\n– Louis Antoine Fauvelet de Bourrienne,\nThe Memoirs of Napoleon",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-20T14:44:00+00:00"
}