{
  "url": "https://voxday.net/2010/07/22/rape-ex-post-facto/",
  "scraped_at": "2026-01-08T23:32:38.581729",
  "title": "Rape, ex post facto",
  "date_display": "July 22, 2010",
  "date_iso": "2010-07-22T13:45:00+00:00",
  "date_from_url": "2010-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If it is rape <a href=\"http://www.guardian.co.uk/world/2010/jul/21/arab-guilty-rape-consensual-sex-jew\">for an Arab to pass for a Israeli</a>, I imagine that Jews who are mistaken for Italians or Caucasians will have to be prosecuted as well.  To say nothing of all those women who falsely claim to be single when they actually have boyfriends or husbands.</p><blockquote><p>A Palestinian man has been convicted of rape after having consensual sex with a woman who had believed him to be a fellow Jew.  Sabbar Kashur, 30, was sentenced to 18 months in prison on Monday after the court ruled that he was guilty of rape by deception. According to the complaint filed by the woman with the Jerusalem district court, the two met in downtown Jerusalem in September 2008 where Kashur, an Arab from East Jerusalem, introduced himself as a Jewish bachelor seeking a serious relationship.  The two then had consensual sex in a nearby building before Kashur left.</p><p>When she later found out that he was not Jewish but an Arab, she filed a criminal complaint for rape and indecent assault.The two then had consensual sex in a nearby building before Kashur left.</p></blockquote><p>This ex post facto claim of rape is both logically and legally absurd, of course, but it does tend to suggest that Israel is as brutally ethnocentric as the European anti-Zionists claim contra the claims of its defenders.  Given the apparent precedent set by this conviction, one is inclined to wonder if the American Jews who so eagerly descended upon the South during the Sixties on behalf of black rights will now take their guilt-ridden activism to Israel on behalf of the Arabs.</p><p>However, to be fair to the Israeli legal system, it should be kept in mind that this was <a href=\"http://edition.cnn.com/2010/WORLD/meast/07/21/israel.rape.by.deception/index.html#fbid=2YCg5w1Jiki\">the result of a plea-bargain</a>, not a trial, so no precedent was, in fact, set.  While the ethno-religious aspect of the case is what has attracted the media’s attention, I don’t think that the focus of the deception was actually on his married state is any less potentially problematic.</p></div>",
  "content_text": "If it is rape\nfor an Arab to pass for a Israeli\n, I imagine that Jews who are mistaken for Italians or Caucasians will have to be prosecuted as well.  To say nothing of all those women who falsely claim to be single when they actually have boyfriends or husbands.\nA Palestinian man has been convicted of rape after having consensual sex with a woman who had believed him to be a fellow Jew.  Sabbar Kashur, 30, was sentenced to 18 months in prison on Monday after the court ruled that he was guilty of rape by deception. According to the complaint filed by the woman with the Jerusalem district court, the two met in downtown Jerusalem in September 2008 where Kashur, an Arab from East Jerusalem, introduced himself as a Jewish bachelor seeking a serious relationship.  The two then had consensual sex in a nearby building before Kashur left.\nWhen she later found out that he was not Jewish but an Arab, she filed a criminal complaint for rape and indecent assault.The two then had consensual sex in a nearby building before Kashur left.\nThis ex post facto claim of rape is both logically and legally absurd, of course, but it does tend to suggest that Israel is as brutally ethnocentric as the European anti-Zionists claim contra the claims of its defenders.  Given the apparent precedent set by this conviction, one is inclined to wonder if the American Jews who so eagerly descended upon the South during the Sixties on behalf of black rights will now take their guilt-ridden activism to Israel on behalf of the Arabs.\nHowever, to be fair to the Israeli legal system, it should be kept in mind that this was\nthe result of a plea-bargain\n, not a trial, so no precedent was, in fact, set.  While the ethno-religious aspect of the case is what has attracted the media’s attention, I don’t think that the focus of the deception was actually on his married state is any less potentially problematic.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-22T12:45:00+00:00"
}