{
  "url": "https://voxday.net/2010/07/17/science-vs-religion/",
  "scraped_at": "2026-01-08T23:32:12.977573",
  "title": "Science vs religion: a bet",
  "date_display": "July 17, 2010",
  "date_iso": "2010-07-17T10:21:00+00:00",
  "date_from_url": "2010-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PTQ claimed that science has a vast track record of correct predictions while religion has none.  “Science has produced zillions of correct predictions. Religion has produced none.  A bigger winner-loser gulf does not exist.”  Very well, then let’s place a bet on the matter:</p><p>Religion: The poor will be with you always.<br> Science: Global poverty will be ended by 2025.</br></p><p>From <i>The End of Poverty</i> by economist Jeffrey Sachs: “This book declares, at the core, that steadfast, science-based approaches can end extreme poverty on the planet. The benefits of modern science and technology which have reached Bulgaria and most of the rest of the world can work for the poorest of the poor as well…. the great challenge and possibility of our time: to end extreme poverty on the planet by the year 2025.”</p><p>Now, since this is far from the first time that the possibility of an end to poverty has been proclaimed; religion’s track record over the previous two millennia remains unblemished to date.  But here we have a straightforward science-based claim that extreme poverty can be eliminated from the planet in 15 years.  Science says it can be done.  Religion, specifically the Christian faith, says it can’t.</p><p>If, as has been claimed, scientific predictions are so much more reliable than religious ones, obviously the pro-science side will have to give the pro-religion one the odds.  I don’t think it’s necessary to go as far as demanding zillion to one odds; I’ll settle for 1200 to 1 and put up one U.S. dollar against one ounce of gold that the religious prediction is correct, the scientific prediction is incorrect and extreme poverty will not be eradicated from the globe by 2025.</p><p>Now, put your money where your mouth is, science fetishists.  If you won’t, recognize that you are admitting you don’t actually believe that religion does not produce correct predictions despite those predictions having been made thousands of years before the scientific ones.  The fact is that some religion is so much more accurate than science in certain matters related to human behavior that it can spot science the additional experience of 2,000 years of human history upon which to draw and still best it.</p></div>",
  "content_text": "PTQ claimed that science has a vast track record of correct predictions while religion has none.  “Science has produced zillions of correct predictions. Religion has produced none.  A bigger winner-loser gulf does not exist.”  Very well, then let’s place a bet on the matter:\nReligion: The poor will be with you always.\nScience: Global poverty will be ended by 2025.\nFrom\nThe End of Poverty\nby economist Jeffrey Sachs: “This book declares, at the core, that steadfast, science-based approaches can end extreme poverty on the planet. The benefits of modern science and technology which have reached Bulgaria and most of the rest of the world can work for the poorest of the poor as well…. the great challenge and possibility of our time: to end extreme poverty on the planet by the year 2025.”\nNow, since this is far from the first time that the possibility of an end to poverty has been proclaimed; religion’s track record over the previous two millennia remains unblemished to date.  But here we have a straightforward science-based claim that extreme poverty can be eliminated from the planet in 15 years.  Science says it can be done.  Religion, specifically the Christian faith, says it can’t.\nIf, as has been claimed, scientific predictions are so much more reliable than religious ones, obviously the pro-science side will have to give the pro-religion one the odds.  I don’t think it’s necessary to go as far as demanding zillion to one odds; I’ll settle for 1200 to 1 and put up one U.S. dollar against one ounce of gold that the religious prediction is correct, the scientific prediction is incorrect and extreme poverty will not be eradicated from the globe by 2025.\nNow, put your money where your mouth is, science fetishists.  If you won’t, recognize that you are admitting you don’t actually believe that religion does not produce correct predictions despite those predictions having been made thousands of years before the scientific ones.  The fact is that some religion is so much more accurate than science in certain matters related to human behavior that it can spot science the additional experience of 2,000 years of human history upon which to draw and still best it.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-17T09:21:00+00:00"
}