{
  "url": "https://voxday.net/2010/07/23/sports-guy-game/",
  "scraped_at": "2026-01-08T23:32:44.096251",
  "title": "Sports Guy Game",
  "date_display": "July 23, 2010",
  "date_iso": "2010-07-23T13:15:00+00:00",
  "date_from_url": "2010-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite being a natural negger, Bill Simmons demonstrates that he’s not only a Delta, <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/100722/mailbag1\">but he doesn’t actually understand the concept of Game</a>:</p><blockquote><p>Q: As a female, I usually have a hard time admitting that I read your articles. I have a harder time admitting that I think you’re hilarious. I feel like I should despise you on principle, because let’s be honest, you’re a pig. But I do like you. More than I care to admit. I find myself referencing you in everyday conversation. If I can use you to back up what I’m saying, I think it has more weight. And when guys find out I like you, they love it (thanks for that). So my question is, how do you do it? How have you managed to make a self-respecting woman eagerly await you next column, even though I’ve come to expect you to have at least one disrespectful comment in there?<br> — Amanda, Richmond</br></p><p>SG: Typical e-mail from a female reader: expresses her disgust, insults me, changes her mind three times and ultimately admits that she can’t live without me. I don’t blame Amanda because she’s been weaned on 20 years of chick flicks, and the one rule of chick flicks is this: “Find the one guy who either drives you crazy or you can’t have, then fall madly in love with him even though you know it’s completely wrong.”</p></blockquote><p>Incorrect.  Amanda doesn’t read the Sports Guy because of the chick flicks, the chick flicks are a hamster rationalization of the natural female tendency to be drawn to men who don’t put them on pedestals.  Throw in the DHV aspect of fame – the woman wouldn’t find the column so irresistible if it wasn’t by a columnist who has rightly become famous by virtue of taking his talents to ESPN – and it’s quite natural that she would like it despite finding it despicable on principle.</p><p>I used to be puzzled when women would send me emails complaining about my columns… accompanied by their pictures. WTF?  Now, in light of Game theory, it makes considerably more sense.  Of course, it doesn’t happen as often now that my feminist critics of yore are all deathly afraid of provoking public responses to their criticism.  It’s been rather interesting to see how the amount of public criticism has fallen dramatically while the daily blog readership has continued to steadily grow.</p></div>",
  "content_text": "Despite being a natural negger, Bill Simmons demonstrates that he’s not only a Delta,\nbut he doesn’t actually understand the concept of Game\n:\nQ: As a female, I usually have a hard time admitting that I read your articles. I have a harder time admitting that I think you’re hilarious. I feel like I should despise you on principle, because let’s be honest, you’re a pig. But I do like you. More than I care to admit. I find myself referencing you in everyday conversation. If I can use you to back up what I’m saying, I think it has more weight. And when guys find out I like you, they love it (thanks for that). So my question is, how do you do it? How have you managed to make a self-respecting woman eagerly await you next column, even though I’ve come to expect you to have at least one disrespectful comment in there?\n— Amanda, Richmond\nSG: Typical e-mail from a female reader: expresses her disgust, insults me, changes her mind three times and ultimately admits that she can’t live without me. I don’t blame Amanda because she’s been weaned on 20 years of chick flicks, and the one rule of chick flicks is this: “Find the one guy who either drives you crazy or you can’t have, then fall madly in love with him even though you know it’s completely wrong.”\nIncorrect.  Amanda doesn’t read the Sports Guy because of the chick flicks, the chick flicks are a hamster rationalization of the natural female tendency to be drawn to men who don’t put them on pedestals.  Throw in the DHV aspect of fame – the woman wouldn’t find the column so irresistible if it wasn’t by a columnist who has rightly become famous by virtue of taking his talents to ESPN – and it’s quite natural that she would like it despite finding it despicable on principle.\nI used to be puzzled when women would send me emails complaining about my columns… accompanied by their pictures. WTF?  Now, in light of Game theory, it makes considerably more sense.  Of course, it doesn’t happen as often now that my feminist critics of yore are all deathly afraid of provoking public responses to their criticism.  It’s been rather interesting to see how the amount of public criticism has fallen dramatically while the daily blog readership has continued to steadily grow.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-23T12:15:00+00:00"
}