{
  "url": "https://voxday.net/2010/07/27/suicide-of-liberal-society/",
  "scraped_at": "2026-01-08T23:33:04.918893",
  "title": "Suicide of the liberal society",
  "date_display": "July 27, 2010",
  "date_iso": "2010-07-27T17:15:00+00:00",
  "date_from_url": "2010-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of the recent Supreme Court decision on Christian Legal Society v. Martinez, <a href=\"http://opinionator.blogs.nytimes.com/2010/07/26/is-religion-special/?hp\">Stanley Fish considers the question</a> of whether religion should be given special status in a liberal society or not.  And his correct conclusion is precisely why it is foolish for secularists to celebrate what is little more than a step towards secular self-destruction:</p><blockquote><p>The dilemma is sharpened and even rendered poignant by the fact that liberalism very much wants to believe that it is being fair to religion, but what it calls fairness amounts to cutting religion down to liberal size….  What it goes to show is that the conflict between the liberal state, with its devotion to procedural rather than substantive norms, and religion, which is all substance from its doctrines to its procedures, is intractable. In his “Political Liberalism,”  John Rawls asks how democracy’s aspiration for “a just and stable society of free and equal citizens” can be squared with the fact that some of those citizens hold beliefs that are exclusionary; how can they receive equal treatment if they deny it to others?</p></blockquote><p>What the modern secularists tend to forget is that the reason religion was historically granted a special place in society is due to its incredible power, which only the historically illiterate secularist will ignore.  The idea behind enshrining the freedom of religious expression into the Constitution was to avoid the sort of power struggles between Church and Church or Church and State that tended to tear society apart.  But misconceived confidence in the idea of linear progress through science and technology to a sexy, science fiction secular utopia, in addition to the judicially-dictated transformation from freedom of religion to freedom from religion, is setting the stage for a return of the very problems that the earlier form of American liberal society was constructed to avoid.  This is short-sighted, because the easily demonstrated fact of the matter is that religion is far hardier and far more difficult to destroy than liberal society.  The logic is simple.  If there is no longer room for religion in liberal society, then liberal society will eventually be destroyed like every other force that has tried to oppose religion… assuming it doesn’t collapse of its metastasizing contradictions first.</p></div>",
  "content_text": "In light of the recent Supreme Court decision on Christian Legal Society v. Martinez,\nStanley Fish considers the question\nof whether religion should be given special status in a liberal society or not.  And his correct conclusion is precisely why it is foolish for secularists to celebrate what is little more than a step towards secular self-destruction:\nThe dilemma is sharpened and even rendered poignant by the fact that liberalism very much wants to believe that it is being fair to religion, but what it calls fairness amounts to cutting religion down to liberal size….  What it goes to show is that the conflict between the liberal state, with its devotion to procedural rather than substantive norms, and religion, which is all substance from its doctrines to its procedures, is intractable. In his “Political Liberalism,”  John Rawls asks how democracy’s aspiration for “a just and stable society of free and equal citizens” can be squared with the fact that some of those citizens hold beliefs that are exclusionary; how can they receive equal treatment if they deny it to others?\nWhat the modern secularists tend to forget is that the reason religion was historically granted a special place in society is due to its incredible power, which only the historically illiterate secularist will ignore.  The idea behind enshrining the freedom of religious expression into the Constitution was to avoid the sort of power struggles between Church and Church or Church and State that tended to tear society apart.  But misconceived confidence in the idea of linear progress through science and technology to a sexy, science fiction secular utopia, in addition to the judicially-dictated transformation from freedom of religion to freedom from religion, is setting the stage for a return of the very problems that the earlier form of American liberal society was constructed to avoid.  This is short-sighted, because the easily demonstrated fact of the matter is that religion is far hardier and far more difficult to destroy than liberal society.  The logic is simple.  If there is no longer room for religion in liberal society, then liberal society will eventually be destroyed like every other force that has tried to oppose religion… assuming it doesn’t collapse of its metastasizing contradictions first.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-27T16:15:00+00:00"
}