{
  "url": "https://voxday.net/2010/07/26/talking-out-of-both-sides/",
  "scraped_at": "2026-01-08T23:32:59.394581",
  "title": "Talking out of both sides",
  "date_display": "July 26, 2010",
  "date_iso": "2010-07-26T20:15:00+00:00",
  "date_from_url": "2010-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://corner.nationalreview.com/post/?q=MjRlOTkwYmQ2MTkwMWQ2YzM3OTdhMjU3MmQxNDAzODc=\">Joe Lieberman</a> on the Wikileaks document dump: <i>“The disclosure of tens of thousands of classified documents on the Afghanistan war is profoundly irresponsible and harmful to our national security. The Obama administration is absolutely right to condemn these leaks.  Most of these documents add nothing to the public understanding of the war in Afghanistan. The materials – which cover the period from 2004 to 2009 – reflect the reality, recognized by everyone, that the insurgency was gaining momentum during these years while our coalition was losing ground. That is precisely why President Obama carried out a policy review in late 2009 and subsequently ordered a surge of forces to Afghanistan as part of a comprehensive civil-military counterinsurgency strategy that is now under way under the command of General Petraeus.”</i></p><p>James Jay Carafano of NRO <a href=\"http://corner.nationalreview.com/post/?q=MjcyZDdkNWM2NTc1MmI3MWQxNTE0YjBhYjQ2ZDhmZWI=\">on the same</a>: <i>“For sure, the “Afghan Diary” will be used to trash the U.S.-led war effort, just as the Pentagon Papers were used to undermine the war in Vietnam. But we must remember that (1) selectively released documents lack context and don’t tell the whole story; and (2) these documents are about the past. Wars are won in the future. The U.S. has a new general and a new strategy and more forces. Past performance is no guarantee of future earnings. While the documents may be less useful for understanding where we go from here in Afghanistan, their release certainly speaks volumes about the timeless challenges faced by democracies trying to wage wars. That should be the real focus of public concern. It looks as if information that was released could well put lives at risk in the future.”</i></p><p>One Democrat + One Republican = One War Party.  And note the incoherency of the message that they’re pushing with more unity than JournoList.  The leaked documents don’t matter and add nothing to the understanding of the war because they are so ancient and from the past… but at the same time they harm national security and are putting lives at risk in the future!  I’d be interested to hear a defense of the logic upon which that argument rests.</p><p>It’s interesting to see how the War Party, which is ostensibly fighting wars to bring freedom and democracy to the rest of the world, desperately wants to shut off the flow of relevant information to the free and democratic people who are theoretically supposed to be deciding if they wish to engage in war or not.  It’s almost as if the War Party is really more dedicated to the “fighting wars” part of the equation than the “to bring freedom and democracy to the rest of the world” bit.</p></div>",
  "content_text": "Joe Lieberman\non the Wikileaks document dump:\n“The disclosure of tens of thousands of classified documents on the Afghanistan war is profoundly irresponsible and harmful to our national security. The Obama administration is absolutely right to condemn these leaks.  Most of these documents add nothing to the public understanding of the war in Afghanistan. The materials – which cover the period from 2004 to 2009 – reflect the reality, recognized by everyone, that the insurgency was gaining momentum during these years while our coalition was losing ground. That is precisely why President Obama carried out a policy review in late 2009 and subsequently ordered a surge of forces to Afghanistan as part of a comprehensive civil-military counterinsurgency strategy that is now under way under the command of General Petraeus.”\nJames Jay Carafano of NRO\non the same\n:\n“For sure, the “Afghan Diary” will be used to trash the U.S.-led war effort, just as the Pentagon Papers were used to undermine the war in Vietnam. But we must remember that (1) selectively released documents lack context and don’t tell the whole story; and (2) these documents are about the past. Wars are won in the future. The U.S. has a new general and a new strategy and more forces. Past performance is no guarantee of future earnings. While the documents may be less useful for understanding where we go from here in Afghanistan, their release certainly speaks volumes about the timeless challenges faced by democracies trying to wage wars. That should be the real focus of public concern. It looks as if information that was released could well put lives at risk in the future.”\nOne Democrat + One Republican = One War Party.  And note the incoherency of the message that they’re pushing with more unity than JournoList.  The leaked documents don’t matter and add nothing to the understanding of the war because they are so ancient and from the past… but at the same time they harm national security and are putting lives at risk in the future!  I’d be interested to hear a defense of the logic upon which that argument rests.\nIt’s interesting to see how the War Party, which is ostensibly fighting wars to bring freedom and democracy to the rest of the world, desperately wants to shut off the flow of relevant information to the free and democratic people who are theoretically supposed to be deciding if they wish to engage in war or not.  It’s almost as if the War Party is really more dedicated to the “fighting wars” part of the equation than the “to bring freedom and democracy to the rest of the world” bit.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-26T19:15:00+00:00"
}