{
  "url": "https://voxday.net/2010/07/29/time-beats-war-dru/",
  "scraped_at": "2026-01-08T23:33:19.719041",
  "title": "TIME beats the war drum",
  "date_display": "July 29, 2010",
  "date_iso": "2010-07-29T20:45:00+00:00",
  "date_from_url": "2010-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The cover picture of a woman with her nose cut off is captioned “<a href=\"http://www.time.com/time/world/article/0,8599,2007269,00.html\">What Happens If We Leave Afghanistan</a>.”  This would appear to indicate that the Magic Negro isn’t even thinking about ending the occupation next year or his supporters in the media wouldn’t be reduced to banging the drums in an attempt to stir up some belated war fever in such an obvious way.</p><p>The ridiculous thing is the way in which TIME missed the obvious point, which is that the brutal punishment meted out to the young women for breaking a marital contract happened <i>under the American military occupation.</i> Saving the noses of Afghan women certainly isn’t a bad thing but there is no circumstance in which one can honestly claim that it is in the American national interest or concerns American national security in any way.</p></div>",
  "content_text": "The cover picture of a woman with her nose cut off is captioned “\nWhat Happens If We Leave Afghanistan\n.”  This would appear to indicate that the Magic Negro isn’t even thinking about ending the occupation next year or his supporters in the media wouldn’t be reduced to banging the drums in an attempt to stir up some belated war fever in such an obvious way.\nThe ridiculous thing is the way in which TIME missed the obvious point, which is that the brutal punishment meted out to the young women for breaking a marital contract happened\nunder the American military occupation.\nSaving the noses of Afghan women certainly isn’t a bad thing but there is no circumstance in which one can honestly claim that it is in the American national interest or concerns American national security in any way.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-29T19:45:00+00:00"
}