{
  "url": "https://voxday.net/2010/07/30/what-makes-statement-scientific/",
  "scraped_at": "2026-01-08T23:33:23.407761",
  "title": "What makes a statement “scientific”?",
  "date_display": "July 30, 2010",
  "date_iso": "2010-07-30T11:35:00+00:00",
  "date_from_url": "2010-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dan Gezelter of Open Science <a href=\"http://www.openscience.org/blog/?p=312\">contemplates the question</a>:</p><blockquote><p>Popper concluded that it is impossible to know that a theory is true based on observations (O); science can tell us only that the theory is false (or that it has yet to be refuted). He concluded that meaningful scientific statements are falsifiable.</p><p>A more realistic picture of scientific theories isn’t this simple. We often base our theories on a set of auxiliary assumptions which we take as postulates for our theories. For example, a theory for liquid dynamics might depend on the whole of classical mechanics being taken as a postulate, or a theory of viral genetics might depend on the Hardy-Weinberg equilibrium. In these cases, classical mechanics (or the Hardy-Wienberg equilibrium) are the auxiliary assumptions for our specific theories.</p><p>These auxiliary assumptions can help show that science is often not a deductively valid exercise….  Falsifying a theory requires that auxiliary assumption (AA) be demonstrably true. Auxiliary assumptions are often highly theoretical — remember, auxiliary assumptions might be statements like the entirety of classical mechanics is correct or the Hardy-Weinberg equilibrium is valid! It is important to note, that if we can’t verify AA, we will not be able to falsify T by using the valid argument above. Contrary to Popper, there really is no asymmetry between falsification and verification. If we cannot verify theoretical statements, then we cannot falsify them either.</p><p>Since verifying a theoretical statement is nearly impossible, and falsification often requires verification of assumptions, where does that leave scientific theories? What is required of a statement to make it scientific?</p></blockquote><p>In light of the increasing tendency of scientists to gravitate towards credentialism, authoritarianism, and hiding behind fictional concepts of property, I find the development of the Open Science movement to be both significant and encouraging.  There is nothing that will hinder, if not outright prevent, the transformation of science from a method open to anyone into a technocratic ideologically-driven priesthood more effectively than forcing scientific papers and pronouncements to stand publicly on their own merits.</p><p>Open Source Software has transformed the world of software development; at least one-third of the programs I now use on a daily basis are OSS.  I suspect Open Science has the potential to have an even more significant and even more <i>necessary</i> impact on the increasingly corrupt and politicized field of science.  But just as the developers of proprietary software continue to fight the rising tide of open source software, one can expect the practitioners of closed science to bitterly resist open science.  I, for one, anticipate hearing the convoluted arguments they will present for keeping science safely locked away behind credentialed doors.</p><p>Many things have changed in the past 46 years, but Richard Feynman’s <a href=\"http://www.fotuva.org/feynman/what_is_science.html\">definition of science</a> is even more applicable today than it was when he first articulated it: <i>“Science is the belief in the ignorance of experts.”</i></p></div>",
  "content_text": "Dan Gezelter of Open Science\ncontemplates the question\n:\nPopper concluded that it is impossible to know that a theory is true based on observations (O); science can tell us only that the theory is false (or that it has yet to be refuted). He concluded that meaningful scientific statements are falsifiable.\nA more realistic picture of scientific theories isn’t this simple. We often base our theories on a set of auxiliary assumptions which we take as postulates for our theories. For example, a theory for liquid dynamics might depend on the whole of classical mechanics being taken as a postulate, or a theory of viral genetics might depend on the Hardy-Weinberg equilibrium. In these cases, classical mechanics (or the Hardy-Wienberg equilibrium) are the auxiliary assumptions for our specific theories.\nThese auxiliary assumptions can help show that science is often not a deductively valid exercise….  Falsifying a theory requires that auxiliary assumption (AA) be demonstrably true. Auxiliary assumptions are often highly theoretical — remember, auxiliary assumptions might be statements like the entirety of classical mechanics is correct or the Hardy-Weinberg equilibrium is valid! It is important to note, that if we can’t verify AA, we will not be able to falsify T by using the valid argument above. Contrary to Popper, there really is no asymmetry between falsification and verification. If we cannot verify theoretical statements, then we cannot falsify them either.\nSince verifying a theoretical statement is nearly impossible, and falsification often requires verification of assumptions, where does that leave scientific theories? What is required of a statement to make it scientific?\nIn light of the increasing tendency of scientists to gravitate towards credentialism, authoritarianism, and hiding behind fictional concepts of property, I find the development of the Open Science movement to be both significant and encouraging.  There is nothing that will hinder, if not outright prevent, the transformation of science from a method open to anyone into a technocratic ideologically-driven priesthood more effectively than forcing scientific papers and pronouncements to stand publicly on their own merits.\nOpen Source Software has transformed the world of software development; at least one-third of the programs I now use on a daily basis are OSS.  I suspect Open Science has the potential to have an even more significant and even more\nnecessary\nimpact on the increasingly corrupt and politicized field of science.  But just as the developers of proprietary software continue to fight the rising tide of open source software, one can expect the practitioners of closed science to bitterly resist open science.  I, for one, anticipate hearing the convoluted arguments they will present for keeping science safely locked away behind credentialed doors.\nMany things have changed in the past 46 years, but Richard Feynman’s\ndefinition of science\nis even more applicable today than it was when he first articulated it:\n“Science is the belief in the ignorance of experts.”",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-30T10:35:00+00:00"
}