{
  "url": "https://voxday.net/2010/07/30/why-women-overrate-themselves/",
  "scraped_at": "2026-01-08T23:33:25.208487",
  "title": "Why women overrate themselves",
  "date_display": "July 30, 2010",
  "date_iso": "2010-07-30T17:15:00+00:00",
  "date_from_url": "2010-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Veronica: Why do you have to be such a mega-bitch?<br> Heather #1: Because I can be.</br></i></p><p>Most men understand it when the most attractive women consider themselves too good for the average joe.  Because, in short, they are, and few men have much of a problem with that.   Where men get confused and irritated is when a woman who is manifestly NOT too good for them by any reasonable objective metric acts as if she genuinely believes that she is.  The reason is exactly as Occam’s Razor suggests.  She does.  And here’s why.</p><p>Women have a strong preference to date and mate up.  Men, on the other hand, are much more inclined to date broad-spectrum and mate down.  And while most men understand that the definition of “up” varies according to sex – men placing extra value on looks and sexual history, women placing emphasis on social status and wealth – they don’t understand the logical consequences of women dating up and men dating down.  And these consequences are further exacerbated by men generally being the pursuers and women the pursued.</p><p>Look at it this way.  A woman who manages to attract the passing attention of a higher-status man, even if she does so through taking the role of the pursuer, is quite reasonably, if incorrectly, inclined to consider herself worthy of the attentions of higher status men in the future despite the declining marginal utility of her youth and sexual history.  This is why a woman will always identify her status by the football star, the surgeon, or the singer in the band with whom she once spent a few hours rather than by the nondescript fellow who was her boyfriend for several years, regardless of how long ago it was.  Roissy had an amusing post about a woman who had dated Anthony Kiedis a long time ago and actually carried around pictures of them in order to show them to people she had just met.</p><p>This creates an essentially Austrian problem of false signals leading to malinvestment.  Because women do not distinguish between the <i>quantity</i> of male attention and the <i>quality</i>, the conflation encourages them to a) overrate their own attractiveness, and, b) invest their time and attention in men who are not likely to have any interest in them beyond the immediate term.  So, the female 6 considers herself an 8 by virtue of the times that a male 9 decided that she was the best available at the moment, and quite logically feels insulted when she is approached by a male 5 or 6.  Meanwhile, the male 6 is standing there in astonishment, staring at what he believes is quite clearly an appropriate counterpart and wondering who in the world she thinks she is.</p><p>What this means is that thanks to modern hook-up culture, the average woman now tends to consider herself a 7 or 8 rather than a 5, which is one of the many social factors that make it hard for her to eventually “settle”.</p></div>",
  "content_text": "Veronica: Why do you have to be such a mega-bitch?\nHeather #1: Because I can be.\nMost men understand it when the most attractive women consider themselves too good for the average joe.  Because, in short, they are, and few men have much of a problem with that.   Where men get confused and irritated is when a woman who is manifestly NOT too good for them by any reasonable objective metric acts as if she genuinely believes that she is.  The reason is exactly as Occam’s Razor suggests.  She does.  And here’s why.\nWomen have a strong preference to date and mate up.  Men, on the other hand, are much more inclined to date broad-spectrum and mate down.  And while most men understand that the definition of “up” varies according to sex – men placing extra value on looks and sexual history, women placing emphasis on social status and wealth – they don’t understand the logical consequences of women dating up and men dating down.  And these consequences are further exacerbated by men generally being the pursuers and women the pursued.\nLook at it this way.  A woman who manages to attract the passing attention of a higher-status man, even if she does so through taking the role of the pursuer, is quite reasonably, if incorrectly, inclined to consider herself worthy of the attentions of higher status men in the future despite the declining marginal utility of her youth and sexual history.  This is why a woman will always identify her status by the football star, the surgeon, or the singer in the band with whom she once spent a few hours rather than by the nondescript fellow who was her boyfriend for several years, regardless of how long ago it was.  Roissy had an amusing post about a woman who had dated Anthony Kiedis a long time ago and actually carried around pictures of them in order to show them to people she had just met.\nThis creates an essentially Austrian problem of false signals leading to malinvestment.  Because women do not distinguish between the\nquantity\nof male attention and the\nquality\n, the conflation encourages them to a) overrate their own attractiveness, and, b) invest their time and attention in men who are not likely to have any interest in them beyond the immediate term.  So, the female 6 considers herself an 8 by virtue of the times that a male 9 decided that she was the best available at the moment, and quite logically feels insulted when she is approached by a male 5 or 6.  Meanwhile, the male 6 is standing there in astonishment, staring at what he believes is quite clearly an appropriate counterpart and wondering who in the world she thinks she is.\nWhat this means is that thanks to modern hook-up culture, the average woman now tends to consider herself a 7 or 8 rather than a 5, which is one of the many social factors that make it hard for her to eventually “settle”.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-30T16:15:00+00:00"
}