{
  "url": "https://voxday.net/2010/07/13/why-church-women-dont-like-church-men/",
  "scraped_at": "2026-01-08T23:31:51.090444",
  "title": "Why church women don’t like church men",
  "date_display": "July 13, 2010",
  "date_iso": "2010-07-13T09:42:00+00:00",
  "date_from_url": "2010-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Aunt Haley explains how Churchianity <a href=\"http://haleyshalo.wordpress.com/2010/07/05/before-wife-loser-after-wife-ex-loser/\">hinders happy marriages</a>:</p><blockquote><p>I’ve noticed that it’s fairly common in evangelical circles for a man to more or less prostrate himself at the feet of his wife’s saintly goodness, proclaiming some mixture of the following:</p><p>* I don’t deserve my wife.<br> * I was a mess before I met my wife.<br> * If it weren’t for my wife, I don’t know where I’d be right now.<br> * I don’t know what she sees in me.<br> * I’m an idiot, but for some reason, she married me.</br></br></br></br></p><p>Among Christian women, humility is an ENORMOUS turn-on and is considered an outward sign of inward maturity…. This “my wife is better than me” attitude is sad.  It may be humble on the surface, but it’s really just a big fat ugly DLV.</p></blockquote><p>Note that this is an indictment of Churchianity, not Christianity.  There is an important difference.  In Christianity, the husband is the head of the household.  In Churchianity, the husband is the <i>servant leader</i>, by which it is actually meant that he is a servant rather than a leader.  And no man who doesn’t know what he’d do without his wife possesses the confident and muscular faith that sustained the martyrs, crushed paganism, ended global slavery, and changed the world for the better.</p><p>Men and women are meant to complement each other.  Women need men to help them improve themselves every bit as badly as men need women, if not more so.  And yet, are the men of the church ever called upon to help their wives develop intellectually, to broaden their interests outside their personal relations, to maintain themselves physically, and to refrain from being caught up in the destructive spiderweb of gossip?  Not that I’ve ever heard.</p><p>The abject pedestalization of wives in Churchianity doesn’t even make sense in conventionally omniderigent evangelical terms.  If God gave you your wife, then who are you to assert you do not deserve her?  Women want to be married to a man who is awesome, so it is an insult to her character, her intelligence, and her quality to claim that you’re some sort of lower being that she has kindly deigned to lift up out of pure altruism.  And while it’s probably true that you’re an idiot, given MPAI, the fact of the matter is that she is almost certainly an idiot too.  It’s no wonder many women of the church are discontent in their marriages, if their husbands can’t see anything of merit in themselves, how do they expect their wives to do so?</p><p>False modesty isn’t humility, it’s a deceitful facade presented by whiny and insecure bitches of both sexes and it has no place in a Christian marriage.</p></div>",
  "content_text": "Aunt Haley explains how Churchianity\nhinders happy marriages\n:\nI’ve noticed that it’s fairly common in evangelical circles for a man to more or less prostrate himself at the feet of his wife’s saintly goodness, proclaiming some mixture of the following:\n* I don’t deserve my wife.\n* I was a mess before I met my wife.\n* If it weren’t for my wife, I don’t know where I’d be right now.\n* I don’t know what she sees in me.\n* I’m an idiot, but for some reason, she married me.\nAmong Christian women, humility is an ENORMOUS turn-on and is considered an outward sign of inward maturity…. This “my wife is better than me” attitude is sad.  It may be humble on the surface, but it’s really just a big fat ugly DLV.\nNote that this is an indictment of Churchianity, not Christianity.  There is an important difference.  In Christianity, the husband is the head of the household.  In Churchianity, the husband is the\nservant leader\n, by which it is actually meant that he is a servant rather than a leader.  And no man who doesn’t know what he’d do without his wife possesses the confident and muscular faith that sustained the martyrs, crushed paganism, ended global slavery, and changed the world for the better.\nMen and women are meant to complement each other.  Women need men to help them improve themselves every bit as badly as men need women, if not more so.  And yet, are the men of the church ever called upon to help their wives develop intellectually, to broaden their interests outside their personal relations, to maintain themselves physically, and to refrain from being caught up in the destructive spiderweb of gossip?  Not that I’ve ever heard.\nThe abject pedestalization of wives in Churchianity doesn’t even make sense in conventionally omniderigent evangelical terms.  If God gave you your wife, then who are you to assert you do not deserve her?  Women want to be married to a man who is awesome, so it is an insult to her character, her intelligence, and her quality to claim that you’re some sort of lower being that she has kindly deigned to lift up out of pure altruism.  And while it’s probably true that you’re an idiot, given MPAI, the fact of the matter is that she is almost certainly an idiot too.  It’s no wonder many women of the church are discontent in their marriages, if their husbands can’t see anything of merit in themselves, how do they expect their wives to do so?\nFalse modesty isn’t humility, it’s a deceitful facade presented by whiny and insecure bitches of both sexes and it has no place in a Christian marriage.",
  "tags": [
    "Christianity",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-13T08:42:00+00:00"
}