{
  "url": "https://voxday.net/2010/07/27/why-i-am-not-economis/",
  "scraped_at": "2026-01-08T23:33:01.240651",
  "title": "Why I am not an economist",
  "date_display": "July 27, 2010",
  "date_iso": "2010-07-27T10:15:00+00:00",
  "date_from_url": "2010-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“The development of a profession of economists is an offshoot of interventionism. The professional economist is the specialist who is instrumental in designing various measures of government interference with business.”<br> – Ludwig von Mises, <i>Human Action</i></br></p><p>In other words, if you want to understand what’s actually happening as opposed to learning the latest justifications for more government intervention, you would be wise to find yourself an informed amateur.  It wasn’t as if Smith, Ricardo, or Marx had any professional credentials, after all.  And consider, for example, that Bruce Bartlett is <a href=\"http://capitalgainsandgames.com/blog/bruce-bartlett/1873/time-new-thinking-stimulus?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+CapitalGainsAndGames+%28Capital+Gains+and+Games+-+Wall+Street%2C+Washington%2C+and+Everything+in+Between%29\">the first professional economist to finally reach the conclusion</a> that I have been telling everyone for literally years: there is nothing that either the government or the central banks can do to “fix” the financial crisis or the economic contraction.</p><blockquote><p>For the last three weeks, my Fiscal Times columns have been focusing on Fed policy. The main reason is that although I think there is scope for additional fiscal stimulus, there is simply no support in Congress for doing more than has been done. Like it or not, those favoring stimulus got one bite at the apple and they didn’t do enough….</p><p>That basically leaves two things that the Fed can do: buy longer term securities and buy very unconventional assets such foreign currency denominated bonds. The first it has already done some of without doing much to get money circulating. The second would put the Fed at war with the Treasury, which jealously guards its dominion over exchange rate policy. It will also raise holy hell with the “strong dollar” crowd and undoubtedly invite foreign retaliation. It’s even possible that China could effectively sterilize the intervention by soaking up all the dollars created by the Fed.</p><p>Thus it appears that there is virtually nothing that can be done to stimulate the economy. For various reasons—political, institutional and substantive—there is no prospect of either fiscal or monetary stimulus.</p></blockquote><p>More importantly, <i>it wouldn’t work anyhow!</i> Bartlett, who is correct in discerning that there is no realistic political chance for more fiscal stimulus even though he is incorrect to think it could possibly help, calls for “new thinking” on stimulus.  I’d be happier if they’d all just throw up their hands in despair, admit that they have no idea what they’re doing, and stop digging the damn hole deeper.</p></div>",
  "content_text": "“The development of a profession of economists is an offshoot of interventionism. The professional economist is the specialist who is instrumental in designing various measures of government interference with business.”\n– Ludwig von Mises,\nHuman Action\nIn other words, if you want to understand what’s actually happening as opposed to learning the latest justifications for more government intervention, you would be wise to find yourself an informed amateur.  It wasn’t as if Smith, Ricardo, or Marx had any professional credentials, after all.  And consider, for example, that Bruce Bartlett is\nthe first professional economist to finally reach the conclusion\nthat I have been telling everyone for literally years: there is nothing that either the government or the central banks can do to “fix” the financial crisis or the economic contraction.\nFor the last three weeks, my Fiscal Times columns have been focusing on Fed policy. The main reason is that although I think there is scope for additional fiscal stimulus, there is simply no support in Congress for doing more than has been done. Like it or not, those favoring stimulus got one bite at the apple and they didn’t do enough….\nThat basically leaves two things that the Fed can do: buy longer term securities and buy very unconventional assets such foreign currency denominated bonds. The first it has already done some of without doing much to get money circulating. The second would put the Fed at war with the Treasury, which jealously guards its dominion over exchange rate policy. It will also raise holy hell with the “strong dollar” crowd and undoubtedly invite foreign retaliation. It’s even possible that China could effectively sterilize the intervention by soaking up all the dollars created by the Fed.\nThus it appears that there is virtually nothing that can be done to stimulate the economy. For various reasons—political, institutional and substantive—there is no prospect of either fiscal or monetary stimulus.\nMore importantly,\nit wouldn’t work anyhow!\nBartlett, who is correct in discerning that there is no realistic political chance for more fiscal stimulus even though he is incorrect to think it could possibly help, calls for “new thinking” on stimulus.  I’d be happier if they’d all just throw up their hands in despair, admit that they have no idea what they’re doing, and stop digging the damn hole deeper.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-27T09:15:00+00:00"
}