{
  "url": "https://voxday.net/2010/07/07/youre-not-part-of-solution/",
  "scraped_at": "2026-01-08T23:31:26.724122",
  "title": "You’re not part of the solution",
  "date_display": "July 7, 2010",
  "date_iso": "2010-07-07T11:33:00+00:00",
  "date_from_url": "2010-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you want to know why there is no hope for America, it is because “conservatives” like Roger Simon have successfully managed to put themselves forward as the Right when in fact they are, and have always been, nothing more than <a href=\"http://pajamasmedia.com/rogerlsimon/2010/07/03/happy-unbirthday-america/?singlepage=true\">the right side of the Left</a>:</p><blockquote><p>When I was young, early twenties, I felt tremendous guilt about what happened to black people in this country, even though my family arrived here fifty years after the freeing of the slaves and were themselves escaping the pogroms of Europe. Those feelings — and a sense of what was right, of course — propelled me into the civil rights movement and I am very proud to have participated. When I moved to Los Angeles and began making money in Hollywood, I still wanted to do something and started to help finance the Black Panther Breakfast Program. The Panthers did seem a bit on the tough side, but somehow I thought it was the right thing to do. Those kids in Watts were hungry, weren’t they? The “black supremacy thing” was just a “phase.”</p><p>Well, soon enough it became obvious that I was wrong. The supremacy thing was the least of it. Or a charade. The Panthers were thugs. Even worse, they were murderers and drug dealers. Worst of all, they were a horrible example to their community, a straight line ticket to oblivion.</p><p>And when I look at the videos of the New Black Panthers menacing voters in front of the polling place, I see the same thing, the same guys. Any African-American who really cared about his people would want those thugs prosecuted. He wouldn’t want them on the street as am example to the children of the community.</p></blockquote><p>Mr. Simon, you are as wrong today as you were wrong then.  You clearly haven’t learned anything about tribal loyalties since you were so magnanimously attempting to structurally alter the very place that offered your family a place of refuge.  The easily verifiable fact is that despite your totally irrelevant opinion about what African-Americans should care about or think, no African-American wants to see a few Black Panthers prosecuted for voter intimidation any more than he wanted to see OJ found guilty of murder.</p><p>Mr. Simon’s personal history offers a very clear case against the immigration he supports.  Notice that he is actually proud of having worked to increase Federal power while successfully weakening individual property rights and the Constitutional right to free association.  As Hayek pointed out regarding “social justice”, “civil rights” are not and cannot be unalienable rights endowed by a Creator.  They are nothing more than politically inspired, government-granted privileges.  While a small amount of immigration can certainly strengthen a society, mass immigration does nothing but alter, weaken, and eventually destroy it.  There is no “strength through diversity”, only “conquest through division” a fact that most of history’s great conquerors have known and utilized.  You will note that the diversity and immigration advocates never cite any historical examples for the obvious reason that migration, as mass immigration is more accurately labled, has long been the death knell of the societies inundated by it.</p><p>For those who missed it before, I note that “the melting pot” is ahistorical fiction written by a hypocritical Zionist and no one who cites it as some sort of societal ideal should be taken any more seriously than a guy wearing a red Star Trek uniform and calling for the establishment of the United Federation of Planets.  Moreover, the melting pot ideal is at its core nothing more than the usual utopian Marxist transnationalism: <i>“Here shall they all unite to build the Republic of Man.”</i></p></div>",
  "content_text": "If you want to know why there is no hope for America, it is because “conservatives” like Roger Simon have successfully managed to put themselves forward as the Right when in fact they are, and have always been, nothing more than\nthe right side of the Left\n:\nWhen I was young, early twenties, I felt tremendous guilt about what happened to black people in this country, even though my family arrived here fifty years after the freeing of the slaves and were themselves escaping the pogroms of Europe. Those feelings — and a sense of what was right, of course — propelled me into the civil rights movement and I am very proud to have participated. When I moved to Los Angeles and began making money in Hollywood, I still wanted to do something and started to help finance the Black Panther Breakfast Program. The Panthers did seem a bit on the tough side, but somehow I thought it was the right thing to do. Those kids in Watts were hungry, weren’t they? The “black supremacy thing” was just a “phase.”\nWell, soon enough it became obvious that I was wrong. The supremacy thing was the least of it. Or a charade. The Panthers were thugs. Even worse, they were murderers and drug dealers. Worst of all, they were a horrible example to their community, a straight line ticket to oblivion.\nAnd when I look at the videos of the New Black Panthers menacing voters in front of the polling place, I see the same thing, the same guys. Any African-American who really cared about his people would want those thugs prosecuted. He wouldn’t want them on the street as am example to the children of the community.\nMr. Simon, you are as wrong today as you were wrong then.  You clearly haven’t learned anything about tribal loyalties since you were so magnanimously attempting to structurally alter the very place that offered your family a place of refuge.  The easily verifiable fact is that despite your totally irrelevant opinion about what African-Americans should care about or think, no African-American wants to see a few Black Panthers prosecuted for voter intimidation any more than he wanted to see OJ found guilty of murder.\nMr. Simon’s personal history offers a very clear case against the immigration he supports.  Notice that he is actually proud of having worked to increase Federal power while successfully weakening individual property rights and the Constitutional right to free association.  As Hayek pointed out regarding “social justice”, “civil rights” are not and cannot be unalienable rights endowed by a Creator.  They are nothing more than politically inspired, government-granted privileges.  While a small amount of immigration can certainly strengthen a society, mass immigration does nothing but alter, weaken, and eventually destroy it.  There is no “strength through diversity”, only “conquest through division” a fact that most of history’s great conquerors have known and utilized.  You will note that the diversity and immigration advocates never cite any historical examples for the obvious reason that migration, as mass immigration is more accurately labled, has long been the death knell of the societies inundated by it.\nFor those who missed it before, I note that “the melting pot” is ahistorical fiction written by a hypocritical Zionist and no one who cites it as some sort of societal ideal should be taken any more seriously than a guy wearing a red Star Trek uniform and calling for the establishment of the United Federation of Planets.  Moreover, the melting pot ideal is at its core nothing more than the usual utopian Marxist transnationalism:\n“Here shall they all unite to build the Republic of Man.”",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-07-07T10:33:00+00:00"
}