{
  "url": "https://voxday.net/2007/11/29/another-day-another-scare/",
  "scraped_at": "2026-01-08T22:02:08.648732",
  "title": "Another day, another scare",
  "date_display": "November 29, 2007",
  "date_iso": "2007-11-29T11:55:00+00:00",
  "date_from_url": "2007-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Violence depicted on television, in films and video games raises the risk of aggressive behavior in adults and young viewers and poses a serious threat to public health, according to a new study.<br>After reviewing more than 50 years of research on the impact of violence in the media, L. Rowell Huesmann, of the University of Michigan, and his colleague Brad Bushman concluded that <a href=\"http://news.yahoo.com/s/nm/20071128/tc_nm/media_violence_tech_dc\">only smoking posed a greater danger</a>.</br></p><p>“Exposure to violent electronic media has a larger effect than all but one other well known threat to public health. The only effect slightly larger than the effect of media violence on aggression is that of cigarette smoking on lung cancer,” he said in a statement.</p></blockquote><p>Wolfenstein 3D and Mortal Kombat, the two games that are primarily responsible for violence in video games, were both published in 1992.  That year, there were <a href=\"http://www.ojp.gov/bjs/homicide/tables/totalstab.htm\">23,760 murders in the USA</a> which represented a murder rate of 9.3 per 100,000 population.  In 2005, following more than decade of spines being ripped out with bare hands and demons being disemboweled by chainsaws, there were 16,692 murders, but the nation’s larger population means that the murder rate is 5.6, a 40 percent REDUCTION.</p><p>Another day, another video game scare.</p></div>",
  "content_text": "Violence depicted on television, in films and video games raises the risk of aggressive behavior in adults and young viewers and poses a serious threat to public health, according to a new study.\nAfter reviewing more than 50 years of research on the impact of violence in the media, L. Rowell Huesmann, of the University of Michigan, and his colleague Brad Bushman concluded that\nonly smoking posed a greater danger\n.\n“Exposure to violent electronic media has a larger effect than all but one other well known threat to public health. The only effect slightly larger than the effect of media violence on aggression is that of cigarette smoking on lung cancer,” he said in a statement.\nWolfenstein 3D and Mortal Kombat, the two games that are primarily responsible for violence in video games, were both published in 1992.  That year, there were\n23,760 murders in the USA\nwhich represented a murder rate of 9.3 per 100,000 population.  In 2005, following more than decade of spines being ripped out with bare hands and demons being disemboweled by chainsaws, there were 16,692 murders, but the nation’s larger population means that the murder rate is 5.6, a 40 percent REDUCTION.\nAnother day, another video game scare.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-29T11:55:00+00:00"
}