{
  "url": "https://voxday.net/2007/11/14/bushs-best-buddy/",
  "scraped_at": "2026-01-08T22:00:27.875214",
  "title": "Bush’s best buddy",
  "date_display": "November 14, 2007",
  "date_iso": "2007-11-14T09:17:00+00:00",
  "date_from_url": "2007-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The president’s new little French friend is <a href=\"http://www.telegraph.co.uk/news/main.jhtml;jsessionid=JGSQUZBKWLGIHQFIQMFSFFWAVCBQ0IV0?xml=/news/2007/11/14/wfra114.xml\">avowedly anti-democratic</a>.  Instead of invading Iran, perhaps we should invade France in order to bring democracy there:</p><blockquote><p>Referendums on the new European Union Treaty were “dangerous” and would be lost in France, Britain and other countries, Nicolas Sarkozy has admitted.</p><p>The French president’s confession that governments could not win popular votes on a “simplified treaty” – drawn up to replace the EU constitution rejected by his countrymen two years ago – was made in a closed meeting of senior Euro-MPs.</p><p>“France was just ahead of all the other countries in voting no. It would happen in all member states if they have a referendum. There is a cleavage between people and governments,” he said.</p></blockquote><p>Needless to say, all the clueless “conservatives” at Townhall and National Review just love Sarkozy.  He may be an anti-democrat working towards the completion of a <a href=\"http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2007/11/14/do1402.xml\">corrupt </a>neo-totalitarian empire, but he is willing to support an attack on Iran and more war is the only issue that neocon-led Republicans care about anymore besides retaining the last vestiges of their power in Washington.</p></div>",
  "content_text": "The president’s new little French friend is\navowedly anti-democratic\n.  Instead of invading Iran, perhaps we should invade France in order to bring democracy there:\nReferendums on the new European Union Treaty were “dangerous” and would be lost in France, Britain and other countries, Nicolas Sarkozy has admitted.\nThe French president’s confession that governments could not win popular votes on a “simplified treaty” – drawn up to replace the EU constitution rejected by his countrymen two years ago – was made in a closed meeting of senior Euro-MPs.\n“France was just ahead of all the other countries in voting no. It would happen in all member states if they have a referendum. There is a cleavage between people and governments,” he said.\nNeedless to say, all the clueless “conservatives” at Townhall and National Review just love Sarkozy.  He may be an anti-democrat working towards the completion of a\ncorrupt\nneo-totalitarian empire, but he is willing to support an attack on Iran and more war is the only issue that neocon-led Republicans care about anymore besides retaining the last vestiges of their power in Washington.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-14T09:17:00+00:00"
}