{
  "url": "https://voxday.net/2007/11/12/confirmation/",
  "scraped_at": "2026-01-08T22:00:07.752879",
  "title": "Confirmation",
  "date_display": "November 12, 2007",
  "date_iso": "2007-11-12T11:10:00+00:00",
  "date_from_url": "2007-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I recently banned a commenter who had accused me of lying about Sam Harris and his suggestion that it may be ethically justifiable to kill people for their beliefs.  The commenter insisted that I had mischaracterized Harris’s position and quoted it out of context, however, after a reader emailed me an excerpt from an email exchange with Harris, it is clear that my characterization of his position expressed in <em>The End of Faith</em> was precise and correct.  In that email exchange, Harris answered the question “what ‘certain beliefs’ justify unprovoked killing?”</p><blockquote><p>The beliefs that are rattling around the brains of people like Osama bin Laden and Ayman Al Zawahiri.  When you ask why would it be ethical to drop a bomb on these two guys, the answer cannot be, “because they have killed so many people.”  They haven’t, to my knowledge, killed anyone.</p></blockquote><p>So, Harris’s position is exactly what I described previously, a justification for lethal preemptive self-defense.  Harris readily admits that he is not referring to a reaction, but rather an unprovoked action in response to a belief he considers dangerous.  While one could make the case that both bin Laden and al-Zawahiri are guilty of killing in the same way that George W. Bush or a mafia don are guilty, Harris’s explanation explictly precludes that argument.</p><p>By the way, I should note that I exchanged email with Sam Harris prior to posting this and received permission to quote him on this; I may vehemently disagree with the man but that doesn’t justify making what was a private statement public.  As it happens, Mr. Harris explained that he has posted exactly the same statement on <a href=\"http://www.samharris.org/site/full_text/response-to-controversy2/\">his own web site</a>, so he had no problem with my quoting either the email or the site.</p></div>",
  "content_text": "I recently banned a commenter who had accused me of lying about Sam Harris and his suggestion that it may be ethically justifiable to kill people for their beliefs.  The commenter insisted that I had mischaracterized Harris’s position and quoted it out of context, however, after a reader emailed me an excerpt from an email exchange with Harris, it is clear that my characterization of his position expressed in\nThe End of Faith\nwas precise and correct.  In that email exchange, Harris answered the question “what ‘certain beliefs’ justify unprovoked killing?”\nThe beliefs that are rattling around the brains of people like Osama bin Laden and Ayman Al Zawahiri.  When you ask why would it be ethical to drop a bomb on these two guys, the answer cannot be, “because they have killed so many people.”  They haven’t, to my knowledge, killed anyone.\nSo, Harris’s position is exactly what I described previously, a justification for lethal preemptive self-defense.  Harris readily admits that he is not referring to a reaction, but rather an unprovoked action in response to a belief he considers dangerous.  While one could make the case that both bin Laden and al-Zawahiri are guilty of killing in the same way that George W. Bush or a mafia don are guilty, Harris’s explanation explictly precludes that argument.\nBy the way, I should note that I exchanged email with Sam Harris prior to posting this and received permission to quote him on this; I may vehemently disagree with the man but that doesn’t justify making what was a private statement public.  As it happens, Mr. Harris explained that he has posted exactly the same statement on\nhis own web site\n, so he had no problem with my quoting either the email or the site.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-12T11:10:00+00:00"
}