{
  "url": "https://voxday.net/2007/11/20/darwin-and-dead-eohippus/",
  "scraped_at": "2026-01-08T22:01:14.348183",
  "title": "Darwin and the dead eohippus",
  "date_display": "November 20, 2007",
  "date_iso": "2007-11-20T13:49:00+00:00",
  "date_from_url": "2007-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I can’t help but wonder if a recent exchange of emails with Mr. Derbyshire might have had <a href=\"http://corner.nationalreview.com/post/?q=ZDNjZDEwYTk1ODQxY2JlOTU0ZDIxYTllNGY0YjNhZDE=\">a little bit to do with this post</a>:</p><blockquote><p>I’ve been predicting for a while now that the champions of human exceptionalism will give up on bashing poor old Chuck Darwin and migrate to neuroscience and “Consciousness Studies,” where the pickings are richer, and there are real mysteries defying our present understanding….  My prediction is coming true, though: For folk who want to rail against materialism, beating up on Darwin will soon be old hat—flogging a dead eohippus, so to speak. Neuroscience is where the action is, for human-exceptionalism affirmers and deniers both.</p></blockquote><p>My publisher and I have pretty much reached an agreement upon what my next book is going to be, and it’s not going to be anything related to dating or the media.  I finally decided that I’m really not interested enough in either issue to do the level of research I require of myself; I may despise the various media whores but they’ll be gone soon enough and ten years from now we won’t even remember who half of them were.</p><p>I can’t announce a title as yet, but I can say that the subject will be anthropeschatology.  I’m interested on that area where science, religion, technology and philosophy all intersect, and the book is based in part upon my experience with artificial intelligence.</p><p>It’s kind of strange being at that point when you’re not only done with the book but have largely put it mentally behind you, while almost no one knows anything about it.  I have been pleased, however, to learn that those few who have read TIA appear to think rather well of it, theists and atheists alike.  I’ll try to post some of the comments here when we’re coordinating the surge around the release date.</p><p>UPDATE – speaking of TIA, this is rather nice.  In the book, I wrote critically of Sam Harris’s position on stem cells and pointed out that a significant portion of his <em>Letter to a Christian Nation</em> was already outdated and irrelevant based upon new developments in stem cell-related research.  This confirms that I was correct to do so:</p><blockquote><p>Two prominent scientific journals—Science and Cell—are each today publishing papers that demonstrate extraordinary success with a technique called “somatic cell reprogramming.” Working separately, and using slightly different methods, these two teams (one of which is led by James Thomson of the University of Wisconsin, the original innovator of human embryonic stem cells) have each successfully taken a regular human skin cell and transformed it into what appears to be the equivalent of an embryonic stem cell—all without the need for embryos, or eggs, or any other ethically controversial methods.</p></blockquote></div>",
  "content_text": "I can’t help but wonder if a recent exchange of emails with Mr. Derbyshire might have had\na little bit to do with this post\n:\nI’ve been predicting for a while now that the champions of human exceptionalism will give up on bashing poor old Chuck Darwin and migrate to neuroscience and “Consciousness Studies,” where the pickings are richer, and there are real mysteries defying our present understanding….  My prediction is coming true, though: For folk who want to rail against materialism, beating up on Darwin will soon be old hat—flogging a dead eohippus, so to speak. Neuroscience is where the action is, for human-exceptionalism affirmers and deniers both.\nMy publisher and I have pretty much reached an agreement upon what my next book is going to be, and it’s not going to be anything related to dating or the media.  I finally decided that I’m really not interested enough in either issue to do the level of research I require of myself; I may despise the various media whores but they’ll be gone soon enough and ten years from now we won’t even remember who half of them were.\nI can’t announce a title as yet, but I can say that the subject will be anthropeschatology.  I’m interested on that area where science, religion, technology and philosophy all intersect, and the book is based in part upon my experience with artificial intelligence.\nIt’s kind of strange being at that point when you’re not only done with the book but have largely put it mentally behind you, while almost no one knows anything about it.  I have been pleased, however, to learn that those few who have read TIA appear to think rather well of it, theists and atheists alike.  I’ll try to post some of the comments here when we’re coordinating the surge around the release date.\nUPDATE – speaking of TIA, this is rather nice.  In the book, I wrote critically of Sam Harris’s position on stem cells and pointed out that a significant portion of his\nLetter to a Christian Nation\nwas already outdated and irrelevant based upon new developments in stem cell-related research.  This confirms that I was correct to do so:\nTwo prominent scientific journals—Science and Cell—are each today publishing papers that demonstrate extraordinary success with a technique called “somatic cell reprogramming.” Working separately, and using slightly different methods, these two teams (one of which is led by James Thomson of the University of Wisconsin, the original innovator of human embryonic stem cells) have each successfully taken a regular human skin cell and transformed it into what appears to be the equivalent of an embryonic stem cell—all without the need for embryos, or eggs, or any other ethically controversial methods.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-20T13:49:00+00:00"
}