{
  "url": "https://voxday.net/2007/11/29/education-is-answer/",
  "scraped_at": "2026-01-08T22:02:14.144555",
  "title": "Education is the answer",
  "date_display": "November 29, 2007",
  "date_iso": "2007-11-29T17:02:00+00:00",
  "date_from_url": "2007-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher seems a little stunned by <a href=\"http://blog.beliefnet.com/crunchycon/2007/11/illegal-immigrants-a-welfare-n.html\">the new report from the The Center of Immigration Studies</a>:</p><blockquote><p>+ Immigrants account for one in eight U.S. residents, the highest level in 80 years. In 1970 it was one in 21; in 1980 it was one in 16; and in 1990 it was one in 13.</p><p>+ Overall, nearly one in three immigrants is an illegal alien. Half of Mexican and Central American immigrants and one-third of South American immigrants are illegal.</p><p>+ The primary reason for the high rates of immigrant poverty, lack of health insurance, and welfare use is their low education levels, not their legal status or an unwillingness to work….</p><p>The report concludes that: “Even during the great wave of immigration at the turn of the 19th century, the immigrant population was much less than half what it is today.” We simply are being swamped, and there should be a time out for assimilation. Yet as a liberal, Spanish-speaking friend admitted to me yesterday, in a conversation about what each side in the immigration debate is loath to admit, that on his pro-immigration side, “The uncomfortable truth is that Latino immigrants are not assimilating.”</p></blockquote><p>Thank the NEA that we’ve got all those excellent public schools with which we can bring transform all those little Garcias and Rodriguezes into productive Anglo-Saxon Americans.  That’ll work, right?  All they really need to get caught up is a few years of indoctrination in global warming, gay rights and gender-bending.  But not in English, of course.  That would be <i>ethnocentric</i>.</p></div>",
  "content_text": "Rod Dreher seems a little stunned by\nthe new report from the The Center of Immigration Studies\n:\n+ Immigrants account for one in eight U.S. residents, the highest level in 80 years. In 1970 it was one in 21; in 1980 it was one in 16; and in 1990 it was one in 13.\n+ Overall, nearly one in three immigrants is an illegal alien. Half of Mexican and Central American immigrants and one-third of South American immigrants are illegal.\n+ The primary reason for the high rates of immigrant poverty, lack of health insurance, and welfare use is their low education levels, not their legal status or an unwillingness to work….\nThe report concludes that: “Even during the great wave of immigration at the turn of the 19th century, the immigrant population was much less than half what it is today.” We simply are being swamped, and there should be a time out for assimilation. Yet as a liberal, Spanish-speaking friend admitted to me yesterday, in a conversation about what each side in the immigration debate is loath to admit, that on his pro-immigration side, “The uncomfortable truth is that Latino immigrants are not assimilating.”\nThank the NEA that we’ve got all those excellent public schools with which we can bring transform all those little Garcias and Rodriguezes into productive Anglo-Saxon Americans.  That’ll work, right?  All they really need to get caught up is a few years of indoctrination in global warming, gay rights and gender-bending.  But not in English, of course.  That would be\nethnocentric\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-29T17:02:00+00:00"
}