{
  "url": "https://voxday.net/2007/11/05/end-of-immigration/",
  "scraped_at": "2026-01-08T21:59:19.870212",
  "title": "The end of immigration",
  "date_display": "November 5, 2007",
  "date_iso": "2007-11-05T09:09:00+00:00",
  "date_from_url": "2007-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It hasn’t begun yet, but <a href=\"http://news.yahoo.com/s/ap/20071104/ap_on_re_eu/italy_immigrants_tension\">it is in sight</a>:</p><blockquote><p>“In Rome alone, 20,000 expulsions should be carried out right away,” right-wing leader Gianfranco Fini, a key Berlusconi ally, said on a TV talk show Sunday.</p><p>Romanians have been detained as suspects in several recent high-profile crimes, including the rape of a woman on church steps in northern Italy, a mugging that left a Rome cyclist in a coma for weeks before he died, and the robbery of a Milan coffee bar in which the elderly owner was beaten and her daughter raped.  Other recent crimes in which foreigners are suspected include the mugging of Oscar-winning director Giuseppe Tornatore, which sent him to the hospital; the holdup of a prominent TV anchorman and the mugging of a Rome municipal commissioner….</p><p>Italian authorities say statistics show foreigners commit a disproportionate number of crimes. Rome Mayor Walter Veltroni said 75 percent of arrests in the city in the last year involved Romanians. On a national level, less than 5 percent of Italy’s population in 2004 — before Romania joined the EU — was foreign, yet foreigners accounted for 26 percent of those convicted of crimes.</p></blockquote><p>The same pressure is building across Europe, as similar stories can be found in Germany, Scandinavia, the Netherlands, France, Switzerland and the UK.  The anti-nationalists are still in charge, as shown by <a href=\"http://www.telegraph.co.uk/news/main.jhtml;jsessionid=VRYKZFJWH0BF5QFIQMGCFFOAVCBQUIV0?xml=/news/2007/11/05/nmigrants105.xml\">the recent Tory scalp</a> obtained by the multicultis in Britain, but I wouldn’t be at all surprised to see Hastilow return as a more influential figure soon, given the popularity and accuracy of his “controversial” statements.</p></div>",
  "content_text": "It hasn’t begun yet, but\nit is in sight\n:\n“In Rome alone, 20,000 expulsions should be carried out right away,” right-wing leader Gianfranco Fini, a key Berlusconi ally, said on a TV talk show Sunday.\nRomanians have been detained as suspects in several recent high-profile crimes, including the rape of a woman on church steps in northern Italy, a mugging that left a Rome cyclist in a coma for weeks before he died, and the robbery of a Milan coffee bar in which the elderly owner was beaten and her daughter raped.  Other recent crimes in which foreigners are suspected include the mugging of Oscar-winning director Giuseppe Tornatore, which sent him to the hospital; the holdup of a prominent TV anchorman and the mugging of a Rome municipal commissioner….\nItalian authorities say statistics show foreigners commit a disproportionate number of crimes. Rome Mayor Walter Veltroni said 75 percent of arrests in the city in the last year involved Romanians. On a national level, less than 5 percent of Italy’s population in 2004 — before Romania joined the EU — was foreign, yet foreigners accounted for 26 percent of those convicted of crimes.\nThe same pressure is building across Europe, as similar stories can be found in Germany, Scandinavia, the Netherlands, France, Switzerland and the UK.  The anti-nationalists are still in charge, as shown by\nthe recent Tory scalp\nobtained by the multicultis in Britain, but I wouldn’t be at all surprised to see Hastilow return as a more influential figure soon, given the popularity and accuracy of his “controversial” statements.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-05T09:09:00+00:00"
}