{
  "url": "https://voxday.net/2007/11/22/happy-thanksgiving-5/",
  "scraped_at": "2026-01-08T22:01:25.469776",
  "title": "Happy Thanksgiving",
  "date_display": "November 22, 2007",
  "date_iso": "2007-11-22T12:46:00+00:00",
  "date_from_url": "2007-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been a strange year this year, with many ups and downs, but I am thankful to God for many things.  This year, I’m particularly grateful for being able to see out of both eyes, for the daily joys of my family, and for the chance to be involved in so many diverse and interesting pasttimes.</p><p>I’m also deeply appreciative of the VP Ilk, as the various challenges so often posed here by friends and occasional foes alike tend to inure me against the temptation to sink into intellectual sloth.  I’m also thankful for my extraordinarily open-minded publisher, BenBella Books, who informed me yesterday that TIA had gone to the printers earlier that afternoon.</p><p>So, in that light it seems only right that I should open <a href=\"http://jamsco.wordpress.com/2007/02/19/a-defense-of-the-omniderigence-of-god/\">the Responsible Puppet’s long-awaited discussion</a> of the Open view of God by posting a brief excerpt from TIA which happens to relate to this subject.  This excerpt is far from my complete word on the matter, as the Open view is only tangentially relevant to my response to a specific New Atheist argument and is barely touched upon in TIA, but it should nevertheless serve to get this conversation rolling.</p><blockquote><p><b>The Contradiction of Divine Characteristics</b></p><p>In a chapter considering the arguments for God’s existence, Richard  Dawkins muses briefly upon what he considers to be a logical contradiction.  He writes:</p><p><em>Incidentally, it has not escaped the notice of logicians that omniscience and omnipotence are mutually incompatible. If God is omniscient, he must already know how he is going to intervene to change the course of history using his omnipotence. But that means he can’t change his mind about his intervention, which means he is not omnipotent.</em></p><p>As Dawkins surely knows, this is a silly and superficial argument; indeed, he follows it up with a little piece of doggerel by Karen Owens before promptly abandoning the line of reasoning in favor of a return to his attack upon Thomas Aquinas. While the argument appears to make sense at first glance, it’s merely a variation on the deeply philosophical question that troubles so many children and atheists, of whether God can create a rock so heavy that He cannot lift it.</p><p>First, it is important to note that the Christian God, the god towards whom Dawkins directs the great majority of his attacks, makes no broad claims to omniscience. Although there are eighty-seven references to the things that the biblical God knows, only a single example could potentially be interpreted as a universal claim to complete knowledge.</p><p>Among the things that God claims to know are the following: He knows the way to wisdom and where it dwells, he knows the day of the wicked is coming, he knows the secrets of men’s hearts, he knows the thoughts of men and their futility. He knows the proud from afar, he knows what lies in darkness, and he knows what you need before you ask him. He knows the Son, he knows the day and the hour that the heavens and the earth shall pass away, he knows the mind of the Spirit and that the Apostle Paul loved the Corinthians.<br>He knows who are his, he knows how to rescue godly men from trials, and perhaps most importantly, he knows that the thoughts of the wise are futile.</br></p><p>The only straightforward claim to omniscience is made on God’s behalf by the Apostle John, who clearly states “he knows everything.” However, the context in which the statement is made also indicates that this particular “everything” is not intended to encompass life and the universe, but rather everything about human hearts. Not only does this interpretation make more sense in light of the verse than with an inexplicable revelation of a divine quality that appears nowhere else in the Bible, but it is also in keeping with many previous statements made about God’s knowledge.</p><p>After all, when Hercule Poirot confronts the murderer in an Agatha Christie novel and informs the killer that he knows everything, the educated reader does not usually interpret this as a statement that the Belgian detective is confessing that he is the physical manifestation of Hermes Trismegistus, but rather that he knows everything about the crime he has been detecting.</p><p>In keeping with this interpretation, Dr. Greg Boyd, the pastor at Woodland Hills Church and the author of <em>Letters to a Skeptic</em>, has written a book laying out a convincing case for the Open View of God, which among other things chronicles the many biblical examples of God being surprised, changing His mind, and even being thwarted. Moreover, it would be very, very strange for a presumably intelligent being such as Satan to place a bet with God if he believed that God knew with certainty what Job’s reaction to his torments would be.</p></blockquote><p>The verse mentioned above is 1 John 13:18 which states: <em>“Dear children, let us not love with words or tongue but with actions and in truth. This then is how we know that we belong to the truth, and how we set our hearts at rest in his presence whenever our hearts condemn us. For God is greater than our hearts, and he knows everything.”</em></p><p>And in answer to his two questions:</p><p>(1) I have no idea, I’ve never counted.<br>(2) A significant rewriting of the Bible which eliminates all of the many obvious implications and outright demonstrations that God is not actively managing every single Earthly event and individual action.</br></p><p>There is a strange similarity between omniderigistes and the New Atheists.  Both groups take a small number of specific Bible verses, assign one reasonable interpretation to them, and then argue that it is the only possible interpretation in defiance of numerous equally possible alternatives that are better supported by historical facts, logic and other Bible verses.</p><p>The omniderigent interpretation of “sovereignty” is a good case in point.  One of the Puppet’s commentors asked “What does it mean “to reign” if it doesn’t mean to exercise active control over creation?”  I ask in return, is that really supposed to be a serious question?  Queen Elizabeth II indubitably reigns over England, does she exercise active control over every event and action in her realm?  As anyone who knows the first thing about every single sovereign in human history should recognize, references to God’s sovereignty over His Creation are a much stronger argument AGAINST the omniderigent view than they are one for it.</p><p>But regardless of one’s view of the matter, today is an excellent day to thank Him for His many blessings.</p></div>",
  "content_text": "It’s been a strange year this year, with many ups and downs, but I am thankful to God for many things.  This year, I’m particularly grateful for being able to see out of both eyes, for the daily joys of my family, and for the chance to be involved in so many diverse and interesting pasttimes.\nI’m also deeply appreciative of the VP Ilk, as the various challenges so often posed here by friends and occasional foes alike tend to inure me against the temptation to sink into intellectual sloth.  I’m also thankful for my extraordinarily open-minded publisher, BenBella Books, who informed me yesterday that TIA had gone to the printers earlier that afternoon.\nSo, in that light it seems only right that I should open\nthe Responsible Puppet’s long-awaited discussion\nof the Open view of God by posting a brief excerpt from TIA which happens to relate to this subject.  This excerpt is far from my complete word on the matter, as the Open view is only tangentially relevant to my response to a specific New Atheist argument and is barely touched upon in TIA, but it should nevertheless serve to get this conversation rolling.\nThe Contradiction of Divine Characteristics\nIn a chapter considering the arguments for God’s existence, Richard  Dawkins muses briefly upon what he considers to be a logical contradiction.  He writes:\nIncidentally, it has not escaped the notice of logicians that omniscience and omnipotence are mutually incompatible. If God is omniscient, he must already know how he is going to intervene to change the course of history using his omnipotence. But that means he can’t change his mind about his intervention, which means he is not omnipotent.\nAs Dawkins surely knows, this is a silly and superficial argument; indeed, he follows it up with a little piece of doggerel by Karen Owens before promptly abandoning the line of reasoning in favor of a return to his attack upon Thomas Aquinas. While the argument appears to make sense at first glance, it’s merely a variation on the deeply philosophical question that troubles so many children and atheists, of whether God can create a rock so heavy that He cannot lift it.\nFirst, it is important to note that the Christian God, the god towards whom Dawkins directs the great majority of his attacks, makes no broad claims to omniscience. Although there are eighty-seven references to the things that the biblical God knows, only a single example could potentially be interpreted as a universal claim to complete knowledge.\nAmong the things that God claims to know are the following: He knows the way to wisdom and where it dwells, he knows the day of the wicked is coming, he knows the secrets of men’s hearts, he knows the thoughts of men and their futility. He knows the proud from afar, he knows what lies in darkness, and he knows what you need before you ask him. He knows the Son, he knows the day and the hour that the heavens and the earth shall pass away, he knows the mind of the Spirit and that the Apostle Paul loved the Corinthians.\nHe knows who are his, he knows how to rescue godly men from trials, and perhaps most importantly, he knows that the thoughts of the wise are futile.\nThe only straightforward claim to omniscience is made on God’s behalf by the Apostle John, who clearly states “he knows everything.” However, the context in which the statement is made also indicates that this particular “everything” is not intended to encompass life and the universe, but rather everything about human hearts. Not only does this interpretation make more sense in light of the verse than with an inexplicable revelation of a divine quality that appears nowhere else in the Bible, but it is also in keeping with many previous statements made about God’s knowledge.\nAfter all, when Hercule Poirot confronts the murderer in an Agatha Christie novel and informs the killer that he knows everything, the educated reader does not usually interpret this as a statement that the Belgian detective is confessing that he is the physical manifestation of Hermes Trismegistus, but rather that he knows everything about the crime he has been detecting.\nIn keeping with this interpretation, Dr. Greg Boyd, the pastor at Woodland Hills Church and the author of\nLetters to a Skeptic\n, has written a book laying out a convincing case for the Open View of God, which among other things chronicles the many biblical examples of God being surprised, changing His mind, and even being thwarted. Moreover, it would be very, very strange for a presumably intelligent being such as Satan to place a bet with God if he believed that God knew with certainty what Job’s reaction to his torments would be.\nThe verse mentioned above is 1 John 13:18 which states:\n“Dear children, let us not love with words or tongue but with actions and in truth. This then is how we know that we belong to the truth, and how we set our hearts at rest in his presence whenever our hearts condemn us. For God is greater than our hearts, and he knows everything.”\nAnd in answer to his two questions:\n(1) I have no idea, I’ve never counted.\n(2) A significant rewriting of the Bible which eliminates all of the many obvious implications and outright demonstrations that God is not actively managing every single Earthly event and individual action.\nThere is a strange similarity between omniderigistes and the New Atheists.  Both groups take a small number of specific Bible verses, assign one reasonable interpretation to them, and then argue that it is the only possible interpretation in defiance of numerous equally possible alternatives that are better supported by historical facts, logic and other Bible verses.\nThe omniderigent interpretation of “sovereignty” is a good case in point.  One of the Puppet’s commentors asked “What does it mean “to reign” if it doesn’t mean to exercise active control over creation?”  I ask in return, is that really supposed to be a serious question?  Queen Elizabeth II indubitably reigns over England, does she exercise active control over every event and action in her realm?  As anyone who knows the first thing about every single sovereign in human history should recognize, references to God’s sovereignty over His Creation are a much stronger argument AGAINST the omniderigent view than they are one for it.\nBut regardless of one’s view of the matter, today is an excellent day to thank Him for His many blessings.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-22T12:46:00+00:00"
}