{
  "url": "https://voxday.net/2007/11/05/he-wont-be-last-sammy/",
  "scraped_at": "2026-01-08T21:59:25.072939",
  "title": "He won’t be the last, Sammy",
  "date_display": "November 5, 2007",
  "date_iso": "2007-11-05T21:04:00+00:00",
  "date_from_url": "2007-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris is upset because <a href=\"http://richarddawkins.net/article,1834,Response-to-Theodore-Dalrymple,Sam-Harris\">Theodore Dalrymple can read</a>:</p><blockquote><p>Beyond simply hating my book, Dalrymple seems to imagine that he has exposed me for what I am: not merely a fraud, and a lazy thinker, but a genocidal maniac. On Dalrymple’s reading, everyone who liked The End of Faith—my editor at Norton, the critics who favorably reviewed it, the deluded souls at the PEN America Foundation who awarded it their prize for nonfiction in 2005—must have simply skipped the chapter where I recommend that we murder millions of innocent people for thought crimes. Granted, the few sentences that Dalrymple lifted from my book with forensic care, like bloody fingerprints, seem alarming when viewed out of context. Indeed, I appreciated this liability when I wrote them. I am very happy to report, however, that no devout Christian, Muslim, or Jew—many of whom detested The End of Faith—has had the gall to excerpt these sentences and intentionally mislead readers the way Dalrymple has. His summary of my views is among the least honest I have come across, and his criticism of the “new atheist” bestsellers the least enlightening. This is more of an accomplishment, in fact, than it may appear. The race to the bottom has been fast and furious.</p></blockquote><p>Except, of course, that Dalrymple’s accusations are not misleading at all.  In <i>The End of Faith</i> Harris is clearly justifying preemptive mass murder in self-defense against dangerous thoughts; he specifically refers to “ideas” and not actions.  It is impossible to view this as anything but an attempt to justify killing large quantities of people for crimes they have not committed.  Imagine that, an atheist attempting to justify mass murder… we certainly haven’t heard that one before!</p><p>Harris’s proposed ethic is, as Dalrymple noted in his apology for being “intemperate”, (not, you’ll notice, inaccurate in any way), quite likely to lead to mission creep.  Morever, Harris even points out precisely where that mission creep is likely to occur, as he echoes the call of past atheist icons like Bertrand Russell in advocating the establishment of dictatorial world government and the extirpation of national identity.</p><p>Notice that at no point in his “defense” does he actually offer a defense of his assertion or even deny it, he only argues everyone else who liked his book hadn’t complained about it.  This, of course, says far more about what kind of morons liked his book than it does about what he did or did not write.</p><p>Harris is both a fraud and a lazy thinker, as I document in TIA to the point of dead-horse beating.  There are literally dozens of examples.  There’s also some evidence that he is intentionally dishonest, although I incline to the belief that it is merely intellectual incompetence.  Sam Harris may or may not be a genocidal maniac, but it is absolutely clear that his book offers far more cover and support for genocidal maniacs than religious moderates offer religious extremists.</p><p>If Harris wishes to clarify his views with more precision, then he should do so.  As long as he insists that it is ethical to slaughter people for dangerous, intolerable and unspecified ideas, he will continue to be viewed with contempt and disgust by all rational human beings.</p></div>",
  "content_text": "Sam Harris is upset because\nTheodore Dalrymple can read\n:\nBeyond simply hating my book, Dalrymple seems to imagine that he has exposed me for what I am: not merely a fraud, and a lazy thinker, but a genocidal maniac. On Dalrymple’s reading, everyone who liked The End of Faith—my editor at Norton, the critics who favorably reviewed it, the deluded souls at the PEN America Foundation who awarded it their prize for nonfiction in 2005—must have simply skipped the chapter where I recommend that we murder millions of innocent people for thought crimes. Granted, the few sentences that Dalrymple lifted from my book with forensic care, like bloody fingerprints, seem alarming when viewed out of context. Indeed, I appreciated this liability when I wrote them. I am very happy to report, however, that no devout Christian, Muslim, or Jew—many of whom detested The End of Faith—has had the gall to excerpt these sentences and intentionally mislead readers the way Dalrymple has. His summary of my views is among the least honest I have come across, and his criticism of the “new atheist” bestsellers the least enlightening. This is more of an accomplishment, in fact, than it may appear. The race to the bottom has been fast and furious.\nExcept, of course, that Dalrymple’s accusations are not misleading at all.  In\nThe End of Faith\nHarris is clearly justifying preemptive mass murder in self-defense against dangerous thoughts; he specifically refers to “ideas” and not actions.  It is impossible to view this as anything but an attempt to justify killing large quantities of people for crimes they have not committed.  Imagine that, an atheist attempting to justify mass murder… we certainly haven’t heard that one before!\nHarris’s proposed ethic is, as Dalrymple noted in his apology for being “intemperate”, (not, you’ll notice, inaccurate in any way), quite likely to lead to mission creep.  Morever, Harris even points out precisely where that mission creep is likely to occur, as he echoes the call of past atheist icons like Bertrand Russell in advocating the establishment of dictatorial world government and the extirpation of national identity.\nNotice that at no point in his “defense” does he actually offer a defense of his assertion or even deny it, he only argues everyone else who liked his book hadn’t complained about it.  This, of course, says far more about what kind of morons liked his book than it does about what he did or did not write.\nHarris is both a fraud and a lazy thinker, as I document in TIA to the point of dead-horse beating.  There are literally dozens of examples.  There’s also some evidence that he is intentionally dishonest, although I incline to the belief that it is merely intellectual incompetence.  Sam Harris may or may not be a genocidal maniac, but it is absolutely clear that his book offers far more cover and support for genocidal maniacs than religious moderates offer religious extremists.\nIf Harris wishes to clarify his views with more precision, then he should do so.  As long as he insists that it is ethical to slaughter people for dangerous, intolerable and unspecified ideas, he will continue to be viewed with contempt and disgust by all rational human beings.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-05T21:04:00+00:00"
}