{
  "url": "https://voxday.net/2007/11/28/hollywhore-triumvirate/",
  "scraped_at": "2026-01-08T22:01:58.521419",
  "title": "Hollywhore Triumvirate",
  "date_display": "November 28, 2007",
  "date_iso": "2007-11-28T12:12:00+00:00",
  "date_from_url": "2007-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not a fan of his fiction, but I am definitely down with his recommendation of <a href=\"http://www.instapunk.com/archives/InstaPunkArchiveV2.php3?a=1172\">Britney Spears as Person of the Year</a>.  I think it should be a rotating award given out to Miss Spears, Miss Hilton and Miss Lohan until an ambitious new slutress proves herself worthy of replacing one of the Hollywhore Triumvirate.  Hey, if news is nothing but what the sheep are interested in reading about, why not?</p><blockquote><p>So you’ve got these things going on… and instead, you see a lot of this back-fence gossip. So I said something to the Nightline guy about waterboarding, and if the Bush administration didn’t think it was torture, they ought to do some personal investigation. Someone in the Bush family should actually be waterboarded so they could report on it to George. I said, I didn’t think he would do it, but I suggested Jenna be waterboarded and then she could talk about whether or not she thought it was torture.</p><p>And the guy says to me — the Nightline guy — I didn’t get the guy’s name….  he said to me, “If we didn’t cover cultural things, we wouldn’t be covering you and The Mist, and promoting the movie.” And I’m like, “Britney Spears and Lindsay Lohan aren’t cultural.” They aren’t political. They’re economic only in the mildest sense of the word…  Britney Spears is just trailer trash…. And yet, you know and I know that if you go to those sites that tell you what the most blogged-about things on the Internet are, it’s Britney, it’s Lindsay. So I think it would be terrific [to have them as TIME Persons of the Year]. There would be such a scream from the American reading public, sure. But at the same time, it’s time for somebody to discuss the difference between real news and fake news…</p></blockquote><p>As for the justification of waterboarding in the linked post, I note that the same rationale which is always used to justify it and other forms of torture – what if you could save X number of people by torturing Y number of people in an urgent situtation where X &gt; Y – could easily be used to rationalize the elimination of the Jewish people or any minority deemed overly troublesome by the majority.</p></div>",
  "content_text": "I’m not a fan of his fiction, but I am definitely down with his recommendation of\nBritney Spears as Person of the Year\n.  I think it should be a rotating award given out to Miss Spears, Miss Hilton and Miss Lohan until an ambitious new slutress proves herself worthy of replacing one of the Hollywhore Triumvirate.  Hey, if news is nothing but what the sheep are interested in reading about, why not?\nSo you’ve got these things going on… and instead, you see a lot of this back-fence gossip. So I said something to the Nightline guy about waterboarding, and if the Bush administration didn’t think it was torture, they ought to do some personal investigation. Someone in the Bush family should actually be waterboarded so they could report on it to George. I said, I didn’t think he would do it, but I suggested Jenna be waterboarded and then she could talk about whether or not she thought it was torture.\nAnd the guy says to me — the Nightline guy — I didn’t get the guy’s name….  he said to me, “If we didn’t cover cultural things, we wouldn’t be covering you and The Mist, and promoting the movie.” And I’m like, “Britney Spears and Lindsay Lohan aren’t cultural.” They aren’t political. They’re economic only in the mildest sense of the word…  Britney Spears is just trailer trash…. And yet, you know and I know that if you go to those sites that tell you what the most blogged-about things on the Internet are, it’s Britney, it’s Lindsay. So I think it would be terrific [to have them as TIME Persons of the Year]. There would be such a scream from the American reading public, sure. But at the same time, it’s time for somebody to discuss the difference between real news and fake news…\nAs for the justification of waterboarding in the linked post, I note that the same rationale which is always used to justify it and other forms of torture – what if you could save X number of people by torturing Y number of people in an urgent situtation where X > Y – could easily be used to rationalize the elimination of the Jewish people or any minority deemed overly troublesome by the majority.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-28T12:12:00+00:00"
}