{
  "url": "https://voxday.net/2007/11/29/i-stand-corrected/",
  "scraped_at": "2026-01-08T22:02:12.299699",
  "title": "I stand corrected",
  "date_display": "November 29, 2007",
  "date_iso": "2007-11-29T15:31:00+00:00",
  "date_from_url": "2007-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LBRFTHOI demonstrates statistical incompetence:</p><blockquote><p>Actually, statistics bear out that well over 50%, and upwards of 70%, of all child abuse- sexual and otherwise- is committed by parents.  So, as much as I hate to respectfully disagree with those being so ignorantly and vulgarly disrespectful to our public schools and their teachers, I will nonetheless do so respectfully and rationally using nothing but the numbers: statistically, it is the public school that should be worried about protecting children from parents, especially in the area of sexual violation, and not the other way around.</p></blockquote><p>This would only be true if you happen to ignore the accessibility and population factors.  The average parent has access to his children around sixteen hours per day.  The average teacher has access to a particular child approximately one hour per day.  There are also far more parents than teachers.  LBRFTHOI is doing the equivalent of comparing the number of murders in the United States with South Africa and concluding that the USA is more dangerous despite its far lower murder rate per 100,000 population.</p><p>Also, if you’re using “nothing but the numbers”, it would be helpful to provide an actual number; a range somewhere between 50 percent and “upwards of 70 percent” is so imprecise as to approach completely meaningless.</p><p>My disrespect for the teachers and schools is hardly ignorant; I have yet to see or be informed of any reason to regard either with even the slightest bit of respect.  As for the vulgar nature of that disrespect, I only seem to recall referring to the latter.  But I do appreciate the notice that I have been remiss, by all means, fuck <a href=\"http://www.voxday.net/archive/2005/020705.html\">the idiots at the chalkboard</a> who so amusingly call themselves “teachers” too.</p></div>",
  "content_text": "LBRFTHOI demonstrates statistical incompetence:\nActually, statistics bear out that well over 50%, and upwards of 70%, of all child abuse- sexual and otherwise- is committed by parents.  So, as much as I hate to respectfully disagree with those being so ignorantly and vulgarly disrespectful to our public schools and their teachers, I will nonetheless do so respectfully and rationally using nothing but the numbers: statistically, it is the public school that should be worried about protecting children from parents, especially in the area of sexual violation, and not the other way around.\nThis would only be true if you happen to ignore the accessibility and population factors.  The average parent has access to his children around sixteen hours per day.  The average teacher has access to a particular child approximately one hour per day.  There are also far more parents than teachers.  LBRFTHOI is doing the equivalent of comparing the number of murders in the United States with South Africa and concluding that the USA is more dangerous despite its far lower murder rate per 100,000 population.\nAlso, if you’re using “nothing but the numbers”, it would be helpful to provide an actual number; a range somewhere between 50 percent and “upwards of 70 percent” is so imprecise as to approach completely meaningless.\nMy disrespect for the teachers and schools is hardly ignorant; I have yet to see or be informed of any reason to regard either with even the slightest bit of respect.  As for the vulgar nature of that disrespect, I only seem to recall referring to the latter.  But I do appreciate the notice that I have been remiss, by all means, fuck\nthe idiots at the chalkboard\nwho so amusingly call themselves “teachers” too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-29T15:31:00+00:00"
}