{
  "url": "https://voxday.net/2007/11/19/interview-with-jonathan-haid/",
  "scraped_at": "2026-01-08T22:01:07.009984",
  "title": "Interview with Jonathan Haidt",
  "date_display": "November 19, 2007",
  "date_iso": "2007-11-19T13:14:00+00:00",
  "date_from_url": "2007-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Vox Day interviewed Jonathan Haidt, author of <a href=\"http://www.happinesshypothesis.com/\">The Happiness Hypothesis</a>, on November 14, 2007.</em></p><p><b>What is the Happiness Hypothesis?</b></p><p>It’s actually a title made up by the publisher before the book was finished and originally I had no idea what it might be.  They were trying to convey that the book was about happiness, but it’s scientific!   But as I was writing the book, it turned out that there are a number of happiness hypotheses and I was able to derive a pretty good one from them.  The simplest happiness hypothesis is that happiness comes from getting what you want, but almost everybody knows that’s not true.  You get some pleasure, but it’s very short-lived and then you move onto what’s next.  The much more widespread happiness hypothesis is that happiness comes from within, not from getting what you want but from wanting what you’ve got.  This is very common, it’s the view taken by Buddha and the Stoics, that happiness is about controlling your wants and desires.</p><p><b>Would that represent the S in the Happiness Formula, H=S+C+V?</b></p><p>It’s not a true formula, it’s more of a representation of the factors that matter.  The S, the [biological] set point is an illustration of that.  We all have kind of a set point for happiness that fits with the notion that most people are about as happy as they make up their minds to be, the idea that you can’t really change your level of happiness, you might as well just accept it.  But positive psychology isn’t quite so fatalistic, positive psychology says that there are some environmental conditions, that’s the C, although those don’t matter all that much.  And then there’s the voluntary activities, the V, the things that you can do that will change your habitual thinking patterns.  That’s where Seligman did his original research on optimism and this is where I think positive psychology doesn’t agree with that second happiness hypothesis, it doesn’t agree with any fatalistic view.  You can change things.  But to the extent that the V is internal, it does fit with the idea that happiness comes from within because of the importance of getting your thoughts right.</p><p>Now, the version that I came to at the end of the book, and this is what got me into the study of religion and so many other interesting things, is that happiness isn’t just getting your thoughts right, it doesn’t just come from within.  What I concluded is that happiness really comes from between.  It comes from getting the right relationships between yourself and others, yourself and your work, and yourself and something larger than yourself.  So, I think that happiness emerges when you get yourself situated in the right way, in the right kind of engagements that just turn you on.  It’s so easy for us to say, it’s trite to say, “oh, you know something larger then yourself”.  What the Hell does that mean?   Does that just mean God?  What does it mean?  What I found in doing research for the last chapter is that there is some research on an off-switch for the self.  People have the ability to shut themselves off and become part of a larger, collective group.</p><p>Religions are technologies that are evolved over millenia to do this and many religions are very effective in doing this.  I’m an atheist, I don’t believe that gods actually exist, but I part company with the New Atheists because I believe that religion is an adaptation that generally works quite well to supress selfishness, to create moral communities, to help people work together, trust each other and collaborate towards common ends.</p><p>This is why I now say that even though I’m an atheist, I have a lot of respect for religion, and even though I’m an Enlightenmenter, I have a lot of respect for critiques of the Enlightenment that point out all of the good things that were thrown out by the Enlightenment.</p><p><b>A lot of the Enlightenment and New Enlightenment figures have advocated an ethic based on happiness and suffering.  How is this different than utilitarianism and how can it avoid devolving into a mere numbers game?</b></p><p>This is the real problem, the central problem of the Enlightenment.  When you push the rationalist view to its extreme, pretty much all you have left to go on is pleasure and pain, or happiness, or some variant of utilitarianism.  I think conservatives are right, there are certain things that are better off veiled.  There are certain things better off not being exposed to the light.  Now, to the scientist, that’s a terrible thing to say and I’m not saying that science should necessarily stop.  But I think if we respect and even revere our founders, if we have things that bind us together and make us proud of who we are and what our nation is, we’re much better off than if we do all the careful historical research and then advertise the fact that our Founding Fathers all have warts and moral lapses.</p><p>In a sense, my view is that to be the ultimate utilitarian, in order to design a society that is ultimately best for people, you have to take a very broad view of the tremendous needs that people have for community, for reverence, for respect and for moral orientation.  A narrow-minded utilitarianism strips down the universe, reduces people to mere consumers and makes this broader sense of satisfaction impossible.</p><p><b>I understand you were at the Beyond Belief II conference.</b></p><p>I didn’t go to the first one, but I heard from the people who were there that this one was much calmer, much more focused on the science, much less polemical.  The last one really was a big celebration of an atheist rebellion against the oppression of religion and the respect it’s been accorded in society.  I think the hero of the first one was Scott Atran, an anthropologist who has a much better understanding of what religion is, in particular Islam, as opposed to people like Sam Harris who just bash Islam and have no clue what it’s really about.  They had kind of a run-in the last time around, this time there wasn’t so much of that.  Richard Dawkins was not there, Sam Harris and Dan Dennett were, so religion was one of the most-discussed topics but the theme was Enlightenment 2.0 and I think we stuck to that theme.</p><p>We had some really good talks from historians about what the Enlightenment was, about how the Enlightenment did lead both to many good things about modernity as well as some terrible moral abominations.  My talk was entitled “Enlightenment 2.0 requires Morality 2.0” and I was trying to make the point that morality is, in part, a team sport, it binds groups together to do combat with others, and to point out that we have no diversity within science when it comes to morality.  We are all liberals, that’s a problem.  I asked for a show of hands and every hand went up when I asked who was left of center; one hand went up when I asked who was right of center.</p><p>I think people were receptive to the claim that to really do the Enlightenment right, to really do science right, we have to understand the biases and the problems that reason is prone to.  We have to correct for them.  There was one guy who was trying to rally the troops to fight the evil Templeton Foundation, which is defending religion, but I stood up and said, “Look, this is just what I’m talking about, about this team sport business.”  This is very unscientific to try and rally the troops, let’s look at how the Templeton Foundation actually works.  If they are pressuring people to change their findings and change their research, then it’s corrupt and we should all oppose them.  And if not, we shouldn’t.</p><p><b>Did they accuse you of a conflict of interest at that point?</b></p><p>Nobody did.  Some people thanked me afterwards and said they agreed with me.  I imagine people like Dennett and Harris did not, but things were perfectly cordial.  There were intellectual disagreements, especially over whether religion is an adaptation and/or group selecti<br> on, but my sense is that it was scientists behaving in a reasonably scientific way.</br></p><p><b>One thing that you demonstrate in <em>The Happiness Hypothesis</em> is that the scientific evidence increasingly appears to indicate that Man is less rational than is commonly supposed.  What implications does that have for an Enlightenment that is based entirely on Reason?</b></p><p>It means that an Enlightenment based entirely on Reason could happen, but not on this planet, not with this species.  It means that we must always be aware of how pervasive the confirmation bias is.  Whatever we want to believe, we set out to look for any evidence that supports that belief.  If we find even a single piece of evidence that supports what we want to believe, we feel like we’re done, we’ve done our homework and we can now be certain about what we believe.  Everyone does this, on both sides, and therefore, people disagree with each other while both being certain that they’re right.</p><p>It especially means that we must be aware of the problem of moral diversity and moral teams.  Whenever there is a moral team that has no moral diversity and is trying to study the other team, we can pretty much bet money – we can take 3-1 odds – that they’re going to get it wrong.  They can’t get it right because the biasing effects of morality are so strong.  So, when you have atheists studying religion, that’s fine, unless they hate religion.  If you have atheists who hate religion studying it, you can bet that they’re going to get it wrong.  Their mental software is too pervasively biased by what they want to believe.</p><p>So, part of the scientific process is to have people challenge those claims, to provide empirical tests of claims, and in most cases that ends up working pretty well.  The problem with religions, of course, is that it’s hard to test them.  We’re either comparing texts or we’re comparing historical arguments, it’s very difficult to do experiments.  Not that the Enlightenment dream is impossible, only that we must realize the flaws of the players in it.  I’m a true Enlightenmenter, I’m a secular quasi-rationalist who thinks that if everyone would learn about moral psychology and understand its limitations, we could do a lot better than we’re doing now.</p><p><b>I’m not sure of that, but I’m an anti-Enlightenment sort.</b></p><p>I now respect that.</p><p><b>You talk about four different root causes of evil and one of them is the idea of thinking that one is good.  You tie this specifically to the teaching of self-esteem that has been taking place for some time now.  What does this imply for a generation that has been raised with intentionally inflated self-esteem?</b></p><p>There’s fascinating research showing a complicated relationship between self-esteem and aggression.  When crime exploded in the 1980s, the American political left went crazy for the idea that these poor kids suffered from low self-esteem and that’s why they were lashing out.  So, self-esteem programs were implemented and they didn’t do very much.  Roy Baumeister wrote a devastating critique of self-esteem research in the 1990s showing that it’s not low self-esteem that leads boys to be violent, but high, unstable self-esteem.  It’s when you have self-esteem that’s been artificially raised; you think you’re great but you’re really not and you kind of know it.  Whenever something happens that reveals you’re not great, that’s when you’re humiliated and that’s when you’re likely to lash out.  It’s complicated, of course, but I think Baumeister is on to something important.  It’s generally not good to raise people’s self-esteem directly, what you want to do is provide them with skills that they can be proud of and will generate a sense of self-worth.</p><p><b>It is interesting that all of the various school shooters seem to have been tremendously arrogant.</b></p><p>That doesn’t surprise me.  Another thing we know about them is that they were often bullied.  So, when you get arrogance combined with being bullied, then that is definitely a recipe for lashing out, especially when you have youth and testosterone combined in the same package.</p><p>I read an extraordinary book by a philosopher named Jonathan Glover, called <i>Humanity: A Moral History of the Twentieth Century</i>.  It goes through all of the various atrocities, the wars and genocides.  And you realize, after looking through them all, is that the simplest formula for atrocity is the certainty that you are right combined with the belief that the end justifies the means.  There are people who kill others for purely selfish motives, but when you have groups killing groups, it’s rarely just selfish, it’s almost always got a strong component of morality in it and it usually doesn’t start from nothing, it escalates from efforts to exclude or humiliate the other group, to violence and ultimately to murder.</p><p>The combination of having a moral justification and believing that the end justifies the means, that’s really the recipe for moral disaster.  I think you see that in the Bush administration.  The Bush administration is so certain that it’s right that they will twist any law, make up any evidence and do whatever it takes.  And they really believe that they are good people.  They don’t think they’re evil, they’re fighting for what they think is good.  But they’re so blind about the nature of morality that they end up doing terrible, terrible things.</p></div>",
  "content_text": "Vox Day interviewed Jonathan Haidt, author of\nThe Happiness Hypothesis\n, on November 14, 2007.\nWhat is the Happiness Hypothesis?\nIt’s actually a title made up by the publisher before the book was finished and originally I had no idea what it might be.  They were trying to convey that the book was about happiness, but it’s scientific!   But as I was writing the book, it turned out that there are a number of happiness hypotheses and I was able to derive a pretty good one from them.  The simplest happiness hypothesis is that happiness comes from getting what you want, but almost everybody knows that’s not true.  You get some pleasure, but it’s very short-lived and then you move onto what’s next.  The much more widespread happiness hypothesis is that happiness comes from within, not from getting what you want but from wanting what you’ve got.  This is very common, it’s the view taken by Buddha and the Stoics, that happiness is about controlling your wants and desires.\nWould that represent the S in the Happiness Formula, H=S+C+V?\nIt’s not a true formula, it’s more of a representation of the factors that matter.  The S, the [biological] set point is an illustration of that.  We all have kind of a set point for happiness that fits with the notion that most people are about as happy as they make up their minds to be, the idea that you can’t really change your level of happiness, you might as well just accept it.  But positive psychology isn’t quite so fatalistic, positive psychology says that there are some environmental conditions, that’s the C, although those don’t matter all that much.  And then there’s the voluntary activities, the V, the things that you can do that will change your habitual thinking patterns.  That’s where Seligman did his original research on optimism and this is where I think positive psychology doesn’t agree with that second happiness hypothesis, it doesn’t agree with any fatalistic view.  You can change things.  But to the extent that the V is internal, it does fit with the idea that happiness comes from within because of the importance of getting your thoughts right.\nNow, the version that I came to at the end of the book, and this is what got me into the study of religion and so many other interesting things, is that happiness isn’t just getting your thoughts right, it doesn’t just come from within.  What I concluded is that happiness really comes from between.  It comes from getting the right relationships between yourself and others, yourself and your work, and yourself and something larger than yourself.  So, I think that happiness emerges when you get yourself situated in the right way, in the right kind of engagements that just turn you on.  It’s so easy for us to say, it’s trite to say, “oh, you know something larger then yourself”.  What the Hell does that mean?   Does that just mean God?  What does it mean?  What I found in doing research for the last chapter is that there is some research on an off-switch for the self.  People have the ability to shut themselves off and become part of a larger, collective group.\nReligions are technologies that are evolved over millenia to do this and many religions are very effective in doing this.  I’m an atheist, I don’t believe that gods actually exist, but I part company with the New Atheists because I believe that religion is an adaptation that generally works quite well to supress selfishness, to create moral communities, to help people work together, trust each other and collaborate towards common ends.\nThis is why I now say that even though I’m an atheist, I have a lot of respect for religion, and even though I’m an Enlightenmenter, I have a lot of respect for critiques of the Enlightenment that point out all of the good things that were thrown out by the Enlightenment.\nA lot of the Enlightenment and New Enlightenment figures have advocated an ethic based on happiness and suffering.  How is this different than utilitarianism and how can it avoid devolving into a mere numbers game?\nThis is the real problem, the central problem of the Enlightenment.  When you push the rationalist view to its extreme, pretty much all you have left to go on is pleasure and pain, or happiness, or some variant of utilitarianism.  I think conservatives are right, there are certain things that are better off veiled.  There are certain things better off not being exposed to the light.  Now, to the scientist, that’s a terrible thing to say and I’m not saying that science should necessarily stop.  But I think if we respect and even revere our founders, if we have things that bind us together and make us proud of who we are and what our nation is, we’re much better off than if we do all the careful historical research and then advertise the fact that our Founding Fathers all have warts and moral lapses.\nIn a sense, my view is that to be the ultimate utilitarian, in order to design a society that is ultimately best for people, you have to take a very broad view of the tremendous needs that people have for community, for reverence, for respect and for moral orientation.  A narrow-minded utilitarianism strips down the universe, reduces people to mere consumers and makes this broader sense of satisfaction impossible.\nI understand you were at the Beyond Belief II conference.\nI didn’t go to the first one, but I heard from the people who were there that this one was much calmer, much more focused on the science, much less polemical.  The last one really was a big celebration of an atheist rebellion against the oppression of religion and the respect it’s been accorded in society.  I think the hero of the first one was Scott Atran, an anthropologist who has a much better understanding of what religion is, in particular Islam, as opposed to people like Sam Harris who just bash Islam and have no clue what it’s really about.  They had kind of a run-in the last time around, this time there wasn’t so much of that.  Richard Dawkins was not there, Sam Harris and Dan Dennett were, so religion was one of the most-discussed topics but the theme was Enlightenment 2.0 and I think we stuck to that theme.\nWe had some really good talks from historians about what the Enlightenment was, about how the Enlightenment did lead both to many good things about modernity as well as some terrible moral abominations.  My talk was entitled “Enlightenment 2.0 requires Morality 2.0” and I was trying to make the point that morality is, in part, a team sport, it binds groups together to do combat with others, and to point out that we have no diversity within science when it comes to morality.  We are all liberals, that’s a problem.  I asked for a show of hands and every hand went up when I asked who was left of center; one hand went up when I asked who was right of center.\nI think people were receptive to the claim that to really do the Enlightenment right, to really do science right, we have to understand the biases and the problems that reason is prone to.  We have to correct for them.  There was one guy who was trying to rally the troops to fight the evil Templeton Foundation, which is defending religion, but I stood up and said, “Look, this is just what I’m talking about, about this team sport business.”  This is very unscientific to try and rally the troops, let’s look at how the Templeton Foundation actually works.  If they are pressuring people to change their findings and change their research, then it’s corrupt and we should all oppose them.  And if not, we shouldn’t.\nDid they accuse you of a conflict of interest at that point?\nNobody did.  Some people thanked me afterwards and said they agreed with me.  I imagine people like Dennett and Harris did not, but things were perfectly cordial.  There were intellectual disagreements, especially over whether religion is an adaptation and/or group selecti\non, but my sense is that it was scientists behaving in a reasonably scientific way.\nOne thing that you demonstrate in\nThe Happiness Hypothesis\nis that the scientific evidence increasingly appears to indicate that Man is less rational than is commonly supposed.  What implications does that have for an Enlightenment that is based entirely on Reason?\nIt means that an Enlightenment based entirely on Reason could happen, but not on this planet, not with this species.  It means that we must always be aware of how pervasive the confirmation bias is.  Whatever we want to believe, we set out to look for any evidence that supports that belief.  If we find even a single piece of evidence that supports what we want to believe, we feel like we’re done, we’ve done our homework and we can now be certain about what we believe.  Everyone does this, on both sides, and therefore, people disagree with each other while both being certain that they’re right.\nIt especially means that we must be aware of the problem of moral diversity and moral teams.  Whenever there is a moral team that has no moral diversity and is trying to study the other team, we can pretty much bet money – we can take 3-1 odds – that they’re going to get it wrong.  They can’t get it right because the biasing effects of morality are so strong.  So, when you have atheists studying religion, that’s fine, unless they hate religion.  If you have atheists who hate religion studying it, you can bet that they’re going to get it wrong.  Their mental software is too pervasively biased by what they want to believe.\nSo, part of the scientific process is to have people challenge those claims, to provide empirical tests of claims, and in most cases that ends up working pretty well.  The problem with religions, of course, is that it’s hard to test them.  We’re either comparing texts or we’re comparing historical arguments, it’s very difficult to do experiments.  Not that the Enlightenment dream is impossible, only that we must realize the flaws of the players in it.  I’m a true Enlightenmenter, I’m a secular quasi-rationalist who thinks that if everyone would learn about moral psychology and understand its limitations, we could do a lot better than we’re doing now.\nI’m not sure of that, but I’m an anti-Enlightenment sort.\nI now respect that.\nYou talk about four different root causes of evil and one of them is the idea of thinking that one is good.  You tie this specifically to the teaching of self-esteem that has been taking place for some time now.  What does this imply for a generation that has been raised with intentionally inflated self-esteem?\nThere’s fascinating research showing a complicated relationship between self-esteem and aggression.  When crime exploded in the 1980s, the American political left went crazy for the idea that these poor kids suffered from low self-esteem and that’s why they were lashing out.  So, self-esteem programs were implemented and they didn’t do very much.  Roy Baumeister wrote a devastating critique of self-esteem research in the 1990s showing that it’s not low self-esteem that leads boys to be violent, but high, unstable self-esteem.  It’s when you have self-esteem that’s been artificially raised; you think you’re great but you’re really not and you kind of know it.  Whenever something happens that reveals you’re not great, that’s when you’re humiliated and that’s when you’re likely to lash out.  It’s complicated, of course, but I think Baumeister is on to something important.  It’s generally not good to raise people’s self-esteem directly, what you want to do is provide them with skills that they can be proud of and will generate a sense of self-worth.\nIt is interesting that all of the various school shooters seem to have been tremendously arrogant.\nThat doesn’t surprise me.  Another thing we know about them is that they were often bullied.  So, when you get arrogance combined with being bullied, then that is definitely a recipe for lashing out, especially when you have youth and testosterone combined in the same package.\nI read an extraordinary book by a philosopher named Jonathan Glover, called\nHumanity: A Moral History of the Twentieth Century\n.  It goes through all of the various atrocities, the wars and genocides.  And you realize, after looking through them all, is that the simplest formula for atrocity is the certainty that you are right combined with the belief that the end justifies the means.  There are people who kill others for purely selfish motives, but when you have groups killing groups, it’s rarely just selfish, it’s almost always got a strong component of morality in it and it usually doesn’t start from nothing, it escalates from efforts to exclude or humiliate the other group, to violence and ultimately to murder.\nThe combination of having a moral justification and believing that the end justifies the means, that’s really the recipe for moral disaster.  I think you see that in the Bush administration.  The Bush administration is so certain that it’s right that they will twist any law, make up any evidence and do whatever it takes.  And they really believe that they are good people.  They don’t think they’re evil, they’re fighting for what they think is good.  But they’re so blind about the nature of morality that they end up doing terrible, terrible things.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-19T13:14:00+00:00"
}