{
  "url": "https://voxday.net/2007/11/26/journalist-dreams-of-blogocaus/",
  "scraped_at": "2026-01-08T22:01:45.694693",
  "title": "A journalist dreams of a Blogocaust",
  "date_display": "November 26, 2007",
  "date_iso": "2007-11-26T11:48:00+00:00",
  "date_from_url": "2007-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bill Conlin of the Philadelphia News, like most journalists, is a maleducated moron who thinks he’s much more intelligent than he actually is.  But he has managed to take the suicidal dead-tree journalist’s impulse for self-immolating sallies into the blogosphere <a href=\"http://crashburnalley.com/?p=47\">to impressive new heights</a>:</p><blockquote><p>The only positive thing I can think of about Hitler’s time on earth–I’m sure he would have eliminated all bloggers. In Colonial times, bloggers were called “Pamphleteers.” They hung on street corners handing them out to passersby. Now, they hang out on electronic street corners, hoping somebody mouses on to their pretentious sites. Different medium, same MO. Shakespeare accidentally summed up the genre best with these words from a MacBeth soliloquy: “. . .a tale told by an idiot, full of sound and fury, signifying nothing. . .”</p></blockquote><p>This is hilarious, especially considering that those “Colonial Pampleteers” were actually the immediate precursors of modern newspapers and, eventually, so-called, self-styled “professional journalists”, not bloggers.  How many more journalists need to get their heads handed to them by better-educated, smarter and more knowledgeable bloggers before they begin to realize that neither the power nor the technology curve is on their side?</p><p>I particularly enjoyed Conlin’s subsequent insistence that his dead friend having been a Jew somehow insulates him from his rhetorical dreams of blogocaust.  How very convenient for him that the witness for this close, antisemitism-nullifying relationship isn’t available to testify for the defense… and besides, do you know who else liked dead Jews?  Hitler.  It seems to escape this eminent <i>journalist</i> that it’s not the mere invocation of the dread H-word which is the problem here, but the fact that he’s fantasizing about the murder of literally hundreds of thousands of people.  Still, the ironic truth is that he’s almost surely right about Hitler’s opinion of the blogosphere.  It’s not as if the elites in either the Republican or Democratic parties, or, for that matter, the nation’s editorial boards, are particularly keen on it either.</p></div>",
  "content_text": "Bill Conlin of the Philadelphia News, like most journalists, is a maleducated moron who thinks he’s much more intelligent than he actually is.  But he has managed to take the suicidal dead-tree journalist’s impulse for self-immolating sallies into the blogosphere\nto impressive new heights\n:\nThe only positive thing I can think of about Hitler’s time on earth–I’m sure he would have eliminated all bloggers. In Colonial times, bloggers were called “Pamphleteers.” They hung on street corners handing them out to passersby. Now, they hang out on electronic street corners, hoping somebody mouses on to their pretentious sites. Different medium, same MO. Shakespeare accidentally summed up the genre best with these words from a MacBeth soliloquy: “. . .a tale told by an idiot, full of sound and fury, signifying nothing. . .”\nThis is hilarious, especially considering that those “Colonial Pampleteers” were actually the immediate precursors of modern newspapers and, eventually, so-called, self-styled “professional journalists”, not bloggers.  How many more journalists need to get their heads handed to them by better-educated, smarter and more knowledgeable bloggers before they begin to realize that neither the power nor the technology curve is on their side?\nI particularly enjoyed Conlin’s subsequent insistence that his dead friend having been a Jew somehow insulates him from his rhetorical dreams of blogocaust.  How very convenient for him that the witness for this close, antisemitism-nullifying relationship isn’t available to testify for the defense… and besides, do you know who else liked dead Jews?  Hitler.  It seems to escape this eminent\njournalist\nthat it’s not the mere invocation of the dread H-word which is the problem here, but the fact that he’s fantasizing about the murder of literally hundreds of thousands of people.  Still, the ironic truth is that he’s almost surely right about Hitler’s opinion of the blogosphere.  It’s not as if the elites in either the Republican or Democratic parties, or, for that matter, the nation’s editorial boards, are particularly keen on it either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-26T11:48:00+00:00"
}