{
  "url": "https://voxday.net/2007/11/27/mailvox-tactics-arent-enoug/",
  "scraped_at": "2026-01-08T22:01:54.801046",
  "title": "Mailvox: tactics aren’t enough",
  "date_display": "November 27, 2007",
  "date_iso": "2007-11-27T14:49:00+00:00",
  "date_from_url": "2007-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday’s column has GS hot about the collar:</p><blockquote><p>Your column “Unwinnable War” makes it quite amusing to watch you turn and turn 180 degrees now that your gloom and doom predictions for Iraq are not working out. It is NOT the “neo-conservatives” who are in a “muddle at the moment.”  It is the “cut and run” Democrats and neo-isolationists such as yourself that find themselves in that position. American success is bad news for you guys.</p><p>The rumors of war with Iran you spread are not going too well either, so now you are beginning to debunk those rumors too instead of admitting that you should not have spread them in the first place. Finally, you do not admit that once democracy was imposed on Germany and Japan it WAS successful. Instead you point to minor historical events that took place before Berlin and Tokyo were taken by force and democracy was imposed on them. Your sense of history comes from the footnotes.</p><p>Next week, tell us what a mess Bush made of the North Korean situation and how the Middle East talks are irrelevant too. Better yet, tell us how you ARE relevant.</p></blockquote><p>This is amusing.  First, I never predicted the failure of “the surge”, in fact, I even wrote before General Petraeus’s report that it would be portrayed and regarded as a success.  What I expected, then as now, that the <i>tactical</i> success would prove to be irrelevant.  And, indeed, there has been absolutely no improvement on the political scene while the larger strategic picture has absolutely gotten worse.</p><p>As for the “successful” imposition of democracy on Germany and Japan, I note that Germany is currently being ruled by an unelected and dictatorial Commission with zero respect for human rights and that both Germany and Japan <i>are still being occupied</i> more than sixty years later.</p><p>After I wrote back to GS, he responded again as follows:</p><blockquote><p>Right. . .nothing was accomplished in Iraq. Therefore, Saddam Hussein must still be in power, his sons are waiting to succeed him, Iraq never had free elections, it is still threatening its neighbors, the Kurds are still getting gassed and Iraq oil is still off the market.  In your view, these changes are only “tactical successes.”</p><p>Worse yet, your positions are not even consistent.  If the Iraq government is a “puppet regime” as you say, then why aren’t they passing the laws we want passed?  Their inability to get things done is not helping the “neo-conservative” cause.</p><p>And if the invasion was is nothing more than “imperialism” as you state, then shouldn’t some Americans benefit from the increased supply as a result of that?  Even if you argue that the American consumer will not benefit from more oil because of the evil corporate conspirators who control big oil, the American stockholders who hold shares in oil companies should benefit.</p><p>As you see it, everything is a doom and gloom twilight zone where only bad things happen. Fortunately, the percentage of American people who agree with you is about the same as the number who support the absurd and dangerous neo-isolationist foreign policy views of your heroes, Ron Paul and Pat Buchanan.</p></blockquote><p>Let’s count the errors here.  1) We’ve exchanged the secular Saddam for a Shiite mullah regime sympathetic to Iran. 2) Iraq didn’t have free elections and we wrote both the rules for it as well as their “constitution”.  3) The Kurds aren’t getting gassed, which is good, but they are attacking our ally Turkey, which has just overwhelmingly voted an Islamic party into power.  But yeah, they are pumping oil… wait, I thought this invasion was about democracy and WMD?</p><p>4) The Iraqi government is a puppet regime, it’s just not an obedient one.  They want to kick us out, but can’t, so they’re simply cooling their heels and refusing to do what we want them to do.  That’s why Charles Krauthammer was pleading for everyone to ignore the failed government benchmarks and pay attention to the temporary military lull instead.  5) Some Americans are benefitting, that’s why the oil companies have been registering record profits over the last few years.  6) The Republicans have already lost the House, the Senate and staunch Spanish and Australian allies over the occupation, apparently they’ll have to lose the White House before GS will consider the possibility that perhaps occupying Mesopotamia is not as popular a policy as he clearly believes it to be.</p><p>Only a mindless propaganda parrot could possibly examine the evidence and conclude that the views of Ron Paul and Pat Buchanan are dangerous to America.  Quite to the contrary, it is idiot America’s failure to heed their clear and substantive warnings that is fast leading it to destruction and irrelevance.</p></div>",
  "content_text": "Yesterday’s column has GS hot about the collar:\nYour column “Unwinnable War” makes it quite amusing to watch you turn and turn 180 degrees now that your gloom and doom predictions for Iraq are not working out. It is NOT the “neo-conservatives” who are in a “muddle at the moment.”  It is the “cut and run” Democrats and neo-isolationists such as yourself that find themselves in that position. American success is bad news for you guys.\nThe rumors of war with Iran you spread are not going too well either, so now you are beginning to debunk those rumors too instead of admitting that you should not have spread them in the first place. Finally, you do not admit that once democracy was imposed on Germany and Japan it WAS successful. Instead you point to minor historical events that took place before Berlin and Tokyo were taken by force and democracy was imposed on them. Your sense of history comes from the footnotes.\nNext week, tell us what a mess Bush made of the North Korean situation and how the Middle East talks are irrelevant too. Better yet, tell us how you ARE relevant.\nThis is amusing.  First, I never predicted the failure of “the surge”, in fact, I even wrote before General Petraeus’s report that it would be portrayed and regarded as a success.  What I expected, then as now, that the\ntactical\nsuccess would prove to be irrelevant.  And, indeed, there has been absolutely no improvement on the political scene while the larger strategic picture has absolutely gotten worse.\nAs for the “successful” imposition of democracy on Germany and Japan, I note that Germany is currently being ruled by an unelected and dictatorial Commission with zero respect for human rights and that both Germany and Japan\nare still being occupied\nmore than sixty years later.\nAfter I wrote back to GS, he responded again as follows:\nRight. . .nothing was accomplished in Iraq. Therefore, Saddam Hussein must still be in power, his sons are waiting to succeed him, Iraq never had free elections, it is still threatening its neighbors, the Kurds are still getting gassed and Iraq oil is still off the market.  In your view, these changes are only “tactical successes.”\nWorse yet, your positions are not even consistent.  If the Iraq government is a “puppet regime” as you say, then why aren’t they passing the laws we want passed?  Their inability to get things done is not helping the “neo-conservative” cause.\nAnd if the invasion was is nothing more than “imperialism” as you state, then shouldn’t some Americans benefit from the increased supply as a result of that?  Even if you argue that the American consumer will not benefit from more oil because of the evil corporate conspirators who control big oil, the American stockholders who hold shares in oil companies should benefit.\nAs you see it, everything is a doom and gloom twilight zone where only bad things happen. Fortunately, the percentage of American people who agree with you is about the same as the number who support the absurd and dangerous neo-isolationist foreign policy views of your heroes, Ron Paul and Pat Buchanan.\nLet’s count the errors here.  1) We’ve exchanged the secular Saddam for a Shiite mullah regime sympathetic to Iran. 2) Iraq didn’t have free elections and we wrote both the rules for it as well as their “constitution”.  3) The Kurds aren’t getting gassed, which is good, but they are attacking our ally Turkey, which has just overwhelmingly voted an Islamic party into power.  But yeah, they are pumping oil… wait, I thought this invasion was about democracy and WMD?\n4) The Iraqi government is a puppet regime, it’s just not an obedient one.  They want to kick us out, but can’t, so they’re simply cooling their heels and refusing to do what we want them to do.  That’s why Charles Krauthammer was pleading for everyone to ignore the failed government benchmarks and pay attention to the temporary military lull instead.  5) Some Americans are benefitting, that’s why the oil companies have been registering record profits over the last few years.  6) The Republicans have already lost the House, the Senate and staunch Spanish and Australian allies over the occupation, apparently they’ll have to lose the White House before GS will consider the possibility that perhaps occupying Mesopotamia is not as popular a policy as he clearly believes it to be.\nOnly a mindless propaganda parrot could possibly examine the evidence and conclude that the views of Ron Paul and Pat Buchanan are dangerous to America.  Quite to the contrary, it is idiot America’s failure to heed their clear and substantive warnings that is fast leading it to destruction and irrelevance.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-27T14:49:00+00:00"
}