{
  "url": "https://voxday.net/2007/11/05/mixed-emotions/",
  "scraped_at": "2026-01-08T21:59:23.215176",
  "title": "Mixed emotions",
  "date_display": "November 5, 2007",
  "date_iso": "2007-11-05T17:30:00+00:00",
  "date_from_url": "2007-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As a reader, writer and general skeptic about the future of a post-literate world, I find it hard to be joyful about <a href=\"http://www.editorandpublisher.com/eandp/news/article_display.jsp?vnu_content_id=1003667950\">the continued decline of conventional newspapers</a>.  On the other hand, as a right-wing technophile whose nationally syndicated column was rejected by pretty much every major newspaper editor with the exception of the Dallas Morning News, it neither surprises nor upsets me to see how badly the left-wing ideologues are crashing and burning in the marketplace now that technology has shattered their ideological monopoly:</p><blockquote><p>According to an analysis of ABC figures, for 538 daily U.S. newspapers, circulation declined 2.5% to 40,689,617. For 609 papers that filed on Sunday, overall circulation dropped 3.5% to 46,771,486….</p><p>In the Minneapolis/St. Paul area, circulation declined in Minneapolis and was virtually flat in St. Paul. At the Star Tribune, daily dropped 6.5% to 335,443, and Sunday was down 4.3% to 570,443. Daily and Sunday circulation at the St. Paul Pioneer Press was up a fraction — 0.1% for both averages. Daily circ is 184,474 and Sunday is 245,930.</p></blockquote><p>Talk about a dying business….  It’s interesting to note that WorldNetDaily’s daily readership already exceeds the Pioneer Press’s circulation and is rapidly approaching that of the Star Tribune.</p></div>",
  "content_text": "As a reader, writer and general skeptic about the future of a post-literate world, I find it hard to be joyful about\nthe continued decline of conventional newspapers\n.  On the other hand, as a right-wing technophile whose nationally syndicated column was rejected by pretty much every major newspaper editor with the exception of the Dallas Morning News, it neither surprises nor upsets me to see how badly the left-wing ideologues are crashing and burning in the marketplace now that technology has shattered their ideological monopoly:\nAccording to an analysis of ABC figures, for 538 daily U.S. newspapers, circulation declined 2.5% to 40,689,617. For 609 papers that filed on Sunday, overall circulation dropped 3.5% to 46,771,486….\nIn the Minneapolis/St. Paul area, circulation declined in Minneapolis and was virtually flat in St. Paul. At the Star Tribune, daily dropped 6.5% to 335,443, and Sunday was down 4.3% to 570,443. Daily and Sunday circulation at the St. Paul Pioneer Press was up a fraction — 0.1% for both averages. Daily circ is 184,474 and Sunday is 245,930.\nTalk about a dying business….  It’s interesting to note that WorldNetDaily’s daily readership already exceeds the Pioneer Press’s circulation and is rapidly approaching that of the Star Tribune.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-05T17:30:00+00:00"
}