{
  "url": "https://voxday.net/2007/11/26/nro-recommends-tia/",
  "scraped_at": "2026-01-08T22:01:47.504866",
  "title": "NRO recommends TIA",
  "date_display": "November 26, 2007",
  "date_iso": "2007-11-26T12:30:00+00:00",
  "date_from_url": "2007-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>National Review offers <a href=\"http://article.nationalreview.com/?q=NjI4NGI0ZGI3M2RkOWMxZDZkZmRlOThlOGEwNTgxZDU=\">a few suggestions</a> for the intellectual on your list:</p><blockquote><p>Every Thanksgiving, National Review Online asks some regular contributors and friends for their suggestions for gift-giving for the upcoming Christmas season. This year, as often is the case, the list is book heavy — but is not without its surprises. We aim to help and hope it does….</p><p>For argumentation on the science vs. religion front, here are two books, one from each side. For believers, WorldNetDaily columnist Vox Day offers <em>The Irrational Atheist</em>, in which he takes on the “unholy trinity” of Richard Dawkins, Sam Harris, and Christopher Hitchens. Good polemical stuff, with tables of atheist mass-murderers, much sneering at “scientism,” and some arresting eye-stoppers like: “Jerusalem aside, the Crusades were surprisingly irreligious.” On the other side, Cornelius J. Troost’s <em>Apes or Angels: Darwin, Dover, Human Nature, and Race</em> is a good survey of current understandings about human nature — including the religious component — from a coolly naturalistic, “evol-con” point of view. I wish Prof. Troost were not quite so free with exclamation points, but his book fulfills the essential condition any book on the contemporary human sciences should, if it wants to be taken seriously, viz.: it will offend Leftist blank-slaters and Rightist anti-Darwinists equally.</p></blockquote><p>That was certainly a delightful surprise.  I don’t know if it will be possible to actually get your hands on the book before Christmas, however, since it’s impossible to say when the books will ship from the publisher to the various bookstores.  Books are usually available to the public well before their official publication date, but I think it’s unlikely that one could get a copy before Christmas.</p><p>Anyhow, it’s encouraging to learn that it’s not only fellow theists who think well of the book.  The only thing I should like to note is that the “arresting eyestoppers” to which John Derbyshire refers aren’t there for contrarian shock value, as could be inferred from the phrase, but are fully supported in the text.  For example, that statement about the Crusades to which Derb refers isn’t a naked assertion, but rather an evidence-based conclusion that happens to concur with the conclusions of three historians who are generally considered to know a good deal about that particular epoch, Charles Oman, Steven Runciman and John Julius Norwich.</p><p>Anyhow, if you’re an atheist or science blogger who is interested in reviewing the book, just send me an email expressing your willingness to write a review and I’ll arrange to have an electronic review copy sent to you when the book comes out.</p></div>",
  "content_text": "National Review offers\na few suggestions\nfor the intellectual on your list:\nEvery Thanksgiving, National Review Online asks some regular contributors and friends for their suggestions for gift-giving for the upcoming Christmas season. This year, as often is the case, the list is book heavy — but is not without its surprises. We aim to help and hope it does….\nFor argumentation on the science vs. religion front, here are two books, one from each side. For believers, WorldNetDaily columnist Vox Day offers\nThe Irrational Atheist\n, in which he takes on the “unholy trinity” of Richard Dawkins, Sam Harris, and Christopher Hitchens. Good polemical stuff, with tables of atheist mass-murderers, much sneering at “scientism,” and some arresting eye-stoppers like: “Jerusalem aside, the Crusades were surprisingly irreligious.” On the other side, Cornelius J. Troost’s\nApes or Angels: Darwin, Dover, Human Nature, and Race\nis a good survey of current understandings about human nature — including the religious component — from a coolly naturalistic, “evol-con” point of view. I wish Prof. Troost were not quite so free with exclamation points, but his book fulfills the essential condition any book on the contemporary human sciences should, if it wants to be taken seriously, viz.: it will offend Leftist blank-slaters and Rightist anti-Darwinists equally.\nThat was certainly a delightful surprise.  I don’t know if it will be possible to actually get your hands on the book before Christmas, however, since it’s impossible to say when the books will ship from the publisher to the various bookstores.  Books are usually available to the public well before their official publication date, but I think it’s unlikely that one could get a copy before Christmas.\nAnyhow, it’s encouraging to learn that it’s not only fellow theists who think well of the book.  The only thing I should like to note is that the “arresting eyestoppers” to which John Derbyshire refers aren’t there for contrarian shock value, as could be inferred from the phrase, but are fully supported in the text.  For example, that statement about the Crusades to which Derb refers isn’t a naked assertion, but rather an evidence-based conclusion that happens to concur with the conclusions of three historians who are generally considered to know a good deal about that particular epoch, Charles Oman, Steven Runciman and John Julius Norwich.\nAnyhow, if you’re an atheist or science blogger who is interested in reviewing the book, just send me an email expressing your willingness to write a review and I’ll arrange to have an electronic review copy sent to you when the book comes out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-26T12:30:00+00:00"
}