{
  "url": "https://voxday.net/2007/11/24/oh-nos/",
  "scraped_at": "2026-01-08T22:01:32.953569",
  "title": "Oh nos!",
  "date_display": "November 24, 2007",
  "date_iso": "2007-11-24T20:52:00+00:00",
  "date_from_url": "2007-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ recommends <a href=\"http://scienceblogs.com/pharyngula/2007/11/making_libraries_safe_havens_f.php#more\">pulling all the atheist writers out of our shelves</a> after hearing that the execrable Philip Pullman’s work could possibly be tossed out of a few Catholic libraries in Canada.  But should we regard that as a threat or a promise?</p><blockquote><p>It’s just atheism that spurs this objection. I think we ought to run with it. The school board didn’t go far enough. Let’s purge school libraries of all books by atheists.</p></blockquote><p>Look at his list.  What a bunch of literary lightweights!  I’ll admit, I have a soft spot for Asimov and Adams, mostly because I thought they were really great <em>when I was in junior high</em>.  Try to read Asimov’s novels as an adult without cringing… it’s tough since he has about as much interest in character development as the director of a movie based on a 3D shooter starring an inarticulate pro wrestler.  Love Paglia and Pratchett, but both are one-trick ponies.  Arthur C. Clarke was an SF giant and wrote one great novel and several great short stories, but he’s hardly Dostoevsky.  Can’t stand Vonnegut, Harrison or Hoellebecq, and Dave Barry is mildly amusing but it would be a toss-up as to who is the most dreadful stylist, him, Harris or Rand.  Rushdie isn’t bad, he’s just massively – MASSIVELY – overrated.</p><p>The only two I’d take very seriously are Mieville and Leopardi, both of whom are intelligent and genuinely talented writers, but possess[ed] seriously screwed-up minds.  And their inclusion here is a little amusing, given how the overt socialism of the former and the overt nihilism of the the latter are two things from which atheists usually do their level best to disassociate themselves.</p><p>“This is going to greatly thin out the science fiction section of the library”, PZ notes.  That’s very true, he could probably add eighty percent of the current membership of SFWA to his list, but it is the atheism pervading science fiction and modern fantasy that is a primary factor in keeping both subgenres banished to a much-disrespected literary ghetto.  I’m not the only one <a href=\"http://www.milobookclub.com/2005/11/28/cs-lewis-and-problem-of-religion-in/\">who has noticed</a>; even the aforementioned atheist Paglia has publicly commented upon the negative effect of atheism on the arts.</p><p>Why shouldn’t any library ditch Pullman if it wants to anyhow, especially if it’s a Catholic one?  His books have no more inherent right to a place there than do my overtly Christian novels.</p><p>While there are actually some very good atheist writers, past and present, all this post actually demonstrates is that either the Wikipedia editors or our friendly community college professor have the reading habits of a teenager… assuming PZ actually reads anything outside of atheist cheerleading and tentacle porn.  I mean, if you’re writing about sci-fi and atheism, how do you come up with Lem while leaving out Heinlein?</p></div>",
  "content_text": "PZ recommends\npulling all the atheist writers out of our shelves\nafter hearing that the execrable Philip Pullman’s work could possibly be tossed out of a few Catholic libraries in Canada.  But should we regard that as a threat or a promise?\nIt’s just atheism that spurs this objection. I think we ought to run with it. The school board didn’t go far enough. Let’s purge school libraries of all books by atheists.\nLook at his list.  What a bunch of literary lightweights!  I’ll admit, I have a soft spot for Asimov and Adams, mostly because I thought they were really great\nwhen I was in junior high\n.  Try to read Asimov’s novels as an adult without cringing… it’s tough since he has about as much interest in character development as the director of a movie based on a 3D shooter starring an inarticulate pro wrestler.  Love Paglia and Pratchett, but both are one-trick ponies.  Arthur C. Clarke was an SF giant and wrote one great novel and several great short stories, but he’s hardly Dostoevsky.  Can’t stand Vonnegut, Harrison or Hoellebecq, and Dave Barry is mildly amusing but it would be a toss-up as to who is the most dreadful stylist, him, Harris or Rand.  Rushdie isn’t bad, he’s just massively – MASSIVELY – overrated.\nThe only two I’d take very seriously are Mieville and Leopardi, both of whom are intelligent and genuinely talented writers, but possess[ed] seriously screwed-up minds.  And their inclusion here is a little amusing, given how the overt socialism of the former and the overt nihilism of the the latter are two things from which atheists usually do their level best to disassociate themselves.\n“This is going to greatly thin out the science fiction section of the library”, PZ notes.  That’s very true, he could probably add eighty percent of the current membership of SFWA to his list, but it is the atheism pervading science fiction and modern fantasy that is a primary factor in keeping both subgenres banished to a much-disrespected literary ghetto.  I’m not the only one\nwho has noticed\n; even the aforementioned atheist Paglia has publicly commented upon the negative effect of atheism on the arts.\nWhy shouldn’t any library ditch Pullman if it wants to anyhow, especially if it’s a Catholic one?  His books have no more inherent right to a place there than do my overtly Christian novels.\nWhile there are actually some very good atheist writers, past and present, all this post actually demonstrates is that either the Wikipedia editors or our friendly community college professor have the reading habits of a teenager… assuming PZ actually reads anything outside of atheist cheerleading and tentacle porn.  I mean, if you’re writing about sci-fi and atheism, how do you come up with Lem while leaving out Heinlein?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-24T20:52:00+00:00"
}