{
  "url": "https://voxday.net/2007/11/25/on-obscurity-and-achievemen/",
  "scraped_at": "2026-01-08T22:01:34.768075",
  "title": "On obscurity and significance",
  "date_display": "November 25, 2007",
  "date_iso": "2007-11-25T11:51:00+00:00",
  "date_from_url": "2007-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isaac finds humor in my failure to be impressed by a few atheist writers:</p><blockquote><p>[Vox Day], author of obscure Christian fantasy novels calling PB Shelley, Saramago, Primo Levi, Lichtenberg, Stanislaw Lem, and Largerkvist literary lightweights?</p></blockquote><p>Yep.  They don’t exactly rank with Homer, Shakespeare, Dostoevsky, Flaubert, Calvino or Goethe, do they?  They don’t even rank with MacDonald, Tolkein, Hesse or Fitzgerald.  I should have specifically mentioned Shelley in my list of exclusions, however, as I like his poetry and he was very influential, although I suspect his biography remains an important factor in both his popularity and his influence.</p><p>Of course, it is ironic to note that Lem is famously known for having publicly agreed with my generally low opinion of science fiction’s literary qualities.  It’s only that I don’t think his stuff is particularly great either.</p><blockquote><p>I am on the floor laughing.</p></blockquote><p>Hey, enjoy it while you can.  It seems timely to mention here that one philosopher, with whom I am unfamiliar but who is apparently well-regarded in some intellectual circles, recently declared that TIA significantly raised the intellectual level of the entire religion-atheism debate.  Now, perhaps he’ll be alone in his opinion once the book comes out, on the other hand, I’m still pretty young by literary standards.</p><p>Out of curiosity, have you ever actually read either <em>The World in Shadow</em> or <em>The Wrath of Angels</em>, Isaac?  Or do you simply believe that obscurity is somehow fundamentally incompatible with literary significance?  I have to mention, I’m always amazed at how many complete strangers enjoy informing me that I’m obscure… and in a culture where fame is increasingly predicated on one’s predilection for exposing one’s genitalia to photographers.  Obviously I’m going about this ALL wrong!</p><p>What I find alternatively irritating and amusing is the outright bias in the science fiction and fantasy genre, where writers who are doing little more than writing bad ripoffs of Tolkein and Lewis refuse to even consider flipping through anything with a similarly overt Christian perspective.  Seriously, nearly every SF reviewer I ever contacted openly refused to even look at the EW books and I would bet that there is only a single member of SFWA who has read all three of them.  (And no, I’m not including myself.)  Now, that’s certainly their perogative, but one can’t reasonably cite a lack of literary praise as a strike against a collection of books that the critics simply will not read.</p><p>In any case, my shortcomings as a creative writer have very little, if anything, to do with my criticial faculties as a reader.</p></div>",
  "content_text": "Isaac finds humor in my failure to be impressed by a few atheist writers:\n[Vox Day], author of obscure Christian fantasy novels calling PB Shelley, Saramago, Primo Levi, Lichtenberg, Stanislaw Lem, and Largerkvist literary lightweights?\nYep.  They don’t exactly rank with Homer, Shakespeare, Dostoevsky, Flaubert, Calvino or Goethe, do they?  They don’t even rank with MacDonald, Tolkein, Hesse or Fitzgerald.  I should have specifically mentioned Shelley in my list of exclusions, however, as I like his poetry and he was very influential, although I suspect his biography remains an important factor in both his popularity and his influence.\nOf course, it is ironic to note that Lem is famously known for having publicly agreed with my generally low opinion of science fiction’s literary qualities.  It’s only that I don’t think his stuff is particularly great either.\nI am on the floor laughing.\nHey, enjoy it while you can.  It seems timely to mention here that one philosopher, with whom I am unfamiliar but who is apparently well-regarded in some intellectual circles, recently declared that TIA significantly raised the intellectual level of the entire religion-atheism debate.  Now, perhaps he’ll be alone in his opinion once the book comes out, on the other hand, I’m still pretty young by literary standards.\nOut of curiosity, have you ever actually read either\nThe World in Shadow\nor\nThe Wrath of Angels\n, Isaac?  Or do you simply believe that obscurity is somehow fundamentally incompatible with literary significance?  I have to mention, I’m always amazed at how many complete strangers enjoy informing me that I’m obscure… and in a culture where fame is increasingly predicated on one’s predilection for exposing one’s genitalia to photographers.  Obviously I’m going about this ALL wrong!\nWhat I find alternatively irritating and amusing is the outright bias in the science fiction and fantasy genre, where writers who are doing little more than writing bad ripoffs of Tolkein and Lewis refuse to even consider flipping through anything with a similarly overt Christian perspective.  Seriously, nearly every SF reviewer I ever contacted openly refused to even look at the EW books and I would bet that there is only a single member of SFWA who has read all three of them.  (And no, I’m not including myself.)  Now, that’s certainly their perogative, but one can’t reasonably cite a lack of literary praise as a strike against a collection of books that the critics simply will not read.\nIn any case, my shortcomings as a creative writer have very little, if anything, to do with my criticial faculties as a reader.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-25T11:51:00+00:00"
}