{
  "url": "https://voxday.net/2007/11/27/ov3-pick-your-poison/",
  "scraped_at": "2026-01-08T22:01:52.949145",
  "title": "OV3: Pick your poison",
  "date_display": "November 27, 2007",
  "date_iso": "2007-11-27T10:55:00+00:00",
  "date_from_url": "2007-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TRP has, quite naturally, asked me to provide some verses supporting my <i>aprevistan</i> contention that capability is not action, that God is not omniscient and that He does not have a Divine Plan which He personally micromanages down to the very smallest level of quantum detail. It is easy to comply with his request because there are so many overt and obvious examples from which to draw; unlike the omniderigistes, I have no need of keeping a list of pre-prepared verses on hand in order to avoid trapping myself in a logical corner.  Instead, I merely selected one example from each of the first five books of the Bible.  I note that there are literally hundreds of verses that are equally relevant and similarly supportive of the Open View position.</p><p>For the various atheists and agnostics here, I realize all of this theology will amount to nothing more than an exercise in counting average fairies per toadstool or whatever, but I encourage you to either skip the discussion entirely, or better yet, to look at it as an opportunity to better understand how to engage in theistic disputation and join it on an entirely conjectural basis.  If you think it’s all nonsense, that’s fine, but this particular post isn’t about you.</p><blockquote><p><b>Genesis 3:8</b> <br>8 Then the man and his wife heard the sound of the LORD God as he was walking in the garden in the cool of the day, and they hid from the LORD God among the trees of the garden. 9 But the LORD God called to the man, “Where are you?”</br></p><p>10 He answered, “I heard you in the garden, and I was afraid because I was naked; so I hid.”</p><p>11 And he said, “Who told you that you were naked? Have you eaten from the tree that I commanded you not to eat from?”</p><p>12 The man said, “The woman you put here with me—she gave me some fruit from the tree, and I ate it.”</p></blockquote><p>There are three possibilities here.  Either (1)God was lying to the man about not knowing where he was, (2) He was asking rhetorical questions to which He already knew the answer, or (3) He did not know where the man was and did not know – as opposed to correctly deduced – that the man had eaten from the tree that He had commended him not to eat from.  I ask TRP, which he believes to be the correct answer?</p><blockquote><p><b>Exodus 3:7-10</b><br>7 The LORD said, “I have indeed seen the misery of my people in Egypt. I have heard them crying out because of their slave drivers, and I am concerned about their suffering. 8 So I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land into a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites and Jebusites. 9 And now the cry of the Israelites has reached me, and I have seen the way the Egyptians are oppressing them. 10 So now, go. I am sending you to Pharaoh to bring my people the Israelites out of Egypt.”</br></p></blockquote><p>In verse 9, God’s statement that “now the cry of the Israelites has reached me” clearly implies that it had not reached Him prior to that moment.  I ask TRP, did God previously know about their suffering prior to hearing that cry?  And at which point did He become concerned about their suffering, prior to hearing that cry or as a result of it?</p><blockquote><p><b>Leviticus 18 24-28</b><br>24 “‘Do not defile yourselves in any of these ways, because this is how the nations that I am going to drive out before you became defiled. 25 Even the land was defiled; so I punished it for its sin, and the land vomited out its inhabitants. 26 But you must keep my decrees and my laws. The native-born and the aliens living among you must not do any of these detestable things, 27 for all these things were done by the people who lived in the land before you, and the land became defiled. 28 And if you defile the land, it will vomit you out as it vomited out the nations that were before you.</br></p></blockquote><p>I ask TRP, is this prophetic warning an if/then statement or not?  Was it possible for the Israelites to not defile the land and therefore not be driven out?  If not, then why did God pretend to offer the Israelites a choice when He was actually planning to cause them to defile the land and cause it to vomit them out?</p><blockquote><p><b>Numbers 3:12-13</b><br>12 “I have taken the Levites from among the Israelites in place of the first male offspring of every Israelite woman. The Levites are mine, 13 for all the firstborn are mine. When I struck down all the firstborn in Egypt, I set apart for myself every firstborn in Israel, whether man or animal. They are to be mine. I am the LORD.”</br></p></blockquote><p>The significance here requires a reference to Exodus 12:23. <i>When the LORD goes through the land to strike down the Egyptians, he will see the blood on the top and sides of the doorframe and will pass over that doorway, and he will not permit the destroyer to enter your houses and strike you down.</i></p><p>Now, who struck down the firstborn, the LORD or the destroyer?  Are the LORD and the destroyer one and the same?  This is an extremely important question, as it cuts to the very heart of the sovereignty issue and has important ramifications for the capacity/action aspect of the debate as well.</p><blockquote><p><b>Deuteronomy 1:26-43</b></p><p>Rebellion Against the LORD<br> 26 But you were unwilling to go up; you rebelled against the command of the LORD your God. 27 You grumbled in your tents and said, “The LORD hates us; so he brought us out of Egypt to deliver us into the hands of the Amorites to destroy us. 28 Where can we go? Our brothers have made us lose heart. They say, ‘The people are stronger and taller than we are; the cities are large, with walls up to the sky. We even saw the Anakites there.’ “</br></p><p> 29 Then I said to you, “Do not be terrified; do not be afraid of them. 30 The LORD your God, who is going before you, will fight for you, as he did for you in Egypt, before your very eyes, 31 and in the desert. There you saw how the LORD your God carried you, as a father carries his son, all the way you went until you reached this place.”</p><p> 32 In spite of this, you did not trust in the LORD your God, 33 who went ahead of you on your journey, in fire by night and in a cloud by day, to search out places for you to camp and to show you the way you should go.</p><p> 34 When the LORD heard what you said, he was angry and solemnly swore: 35 “Not a man of this evil generation shall see the good land I swore to give your forefathers, 36 except Caleb son of Jephunneh. He will see it, and I will give him and his descendants the land he set his feet on, because he followed the LORD wholeheartedly.”</p><p> 37 Because of you the LORD became angry with me also and said, “You shall not enter it, either. 38 But your assistant, Joshua son of Nun, will enter it. Encourage him, because he will lead Israel to inherit it. 39 And the little ones that you said would be taken captive, your children who do not yet know good from bad—they will enter the land. I will give it to them and they will take possession of it. 40 But as for you, turn around and set out toward the desert along the route to the Red Sea. [a] “</p><p> 41 Then you replied, “We have sinned against the LORD. We will go up and fight, as the LORD our God commanded us.” So every one of you put on his weapons, thinking it easy to go up into the hill country.</p><p> 42 But the LORD said to me, “Tell them, ‘Do not go up and fight, because I will not be with you. You will be defeated by your enemies.’ “</p><p> 43 So I told you, but you would not listen. You rebelled against the LORD’s command and in your arrogance you marched up into the hill country. 44 The Amorites who lived in those hills came out against you; they chased you like a swarm of bees and beat you down from Seir all the way to Hormah. 45 You came back and wept before the LORD, but he paid no attention to your weeping and turned a deaf ear to you.</p></blockquote><p><br>Did the people of Israel rebel against the Lord’s command or not?  Was it God’s will that they rebel against Him or was it their will?    Was it God’s original plan for Moses and the people of Israel to enter Canaan or did He always intend for them to die in the desert?  Was God genuinely angry, or was He merely pretending to be angry for the purpose of making the puppet show seem more convincing to the puppets whose strings He was pulling?</br></p><p>UPDATE – TRP requests a clarification:</p><blockquote><p>Do you actually believe that God CAN do this? Do you believe he DOES do this?</p></blockquote><p>Assuming he’s referring to 1 Samuel 2: 6-8, my answer to the first question is yes.  My answer to the second question is yes, occasionally.</p></div>",
  "content_text": "TRP has, quite naturally, asked me to provide some verses supporting my\naprevistan\ncontention that capability is not action, that God is not omniscient and that He does not have a Divine Plan which He personally micromanages down to the very smallest level of quantum detail. It is easy to comply with his request because there are so many overt and obvious examples from which to draw; unlike the omniderigistes, I have no need of keeping a list of pre-prepared verses on hand in order to avoid trapping myself in a logical corner.  Instead, I merely selected one example from each of the first five books of the Bible.  I note that there are literally hundreds of verses that are equally relevant and similarly supportive of the Open View position.\nFor the various atheists and agnostics here, I realize all of this theology will amount to nothing more than an exercise in counting average fairies per toadstool or whatever, but I encourage you to either skip the discussion entirely, or better yet, to look at it as an opportunity to better understand how to engage in theistic disputation and join it on an entirely conjectural basis.  If you think it’s all nonsense, that’s fine, but this particular post isn’t about you.\nGenesis 3:8\n8 Then the man and his wife heard the sound of the LORD God as he was walking in the garden in the cool of the day, and they hid from the LORD God among the trees of the garden. 9 But the LORD God called to the man, “Where are you?”\n10 He answered, “I heard you in the garden, and I was afraid because I was naked; so I hid.”\n11 And he said, “Who told you that you were naked? Have you eaten from the tree that I commanded you not to eat from?”\n12 The man said, “The woman you put here with me—she gave me some fruit from the tree, and I ate it.”\nThere are three possibilities here.  Either (1)God was lying to the man about not knowing where he was, (2) He was asking rhetorical questions to which He already knew the answer, or (3) He did not know where the man was and did not know – as opposed to correctly deduced – that the man had eaten from the tree that He had commended him not to eat from.  I ask TRP, which he believes to be the correct answer?\nExodus 3:7-10\n7 The LORD said, “I have indeed seen the misery of my people in Egypt. I have heard them crying out because of their slave drivers, and I am concerned about their suffering. 8 So I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land into a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites and Jebusites. 9 And now the cry of the Israelites has reached me, and I have seen the way the Egyptians are oppressing them. 10 So now, go. I am sending you to Pharaoh to bring my people the Israelites out of Egypt.”\nIn verse 9, God’s statement that “now the cry of the Israelites has reached me” clearly implies that it had not reached Him prior to that moment.  I ask TRP, did God previously know about their suffering prior to hearing that cry?  And at which point did He become concerned about their suffering, prior to hearing that cry or as a result of it?\nLeviticus 18 24-28\n24 “‘Do not defile yourselves in any of these ways, because this is how the nations that I am going to drive out before you became defiled. 25 Even the land was defiled; so I punished it for its sin, and the land vomited out its inhabitants. 26 But you must keep my decrees and my laws. The native-born and the aliens living among you must not do any of these detestable things, 27 for all these things were done by the people who lived in the land before you, and the land became defiled. 28 And if you defile the land, it will vomit you out as it vomited out the nations that were before you.\nI ask TRP, is this prophetic warning an if/then statement or not?  Was it possible for the Israelites to not defile the land and therefore not be driven out?  If not, then why did God pretend to offer the Israelites a choice when He was actually planning to cause them to defile the land and cause it to vomit them out?\nNumbers 3:12-13\n12 “I have taken the Levites from among the Israelites in place of the first male offspring of every Israelite woman. The Levites are mine, 13 for all the firstborn are mine. When I struck down all the firstborn in Egypt, I set apart for myself every firstborn in Israel, whether man or animal. They are to be mine. I am the LORD.”\nThe significance here requires a reference to Exodus 12:23.\nWhen the LORD goes through the land to strike down the Egyptians, he will see the blood on the top and sides of the doorframe and will pass over that doorway, and he will not permit the destroyer to enter your houses and strike you down.\nNow, who struck down the firstborn, the LORD or the destroyer?  Are the LORD and the destroyer one and the same?  This is an extremely important question, as it cuts to the very heart of the sovereignty issue and has important ramifications for the capacity/action aspect of the debate as well.\nDeuteronomy 1:26-43\nRebellion Against the LORD\n26 But you were unwilling to go up; you rebelled against the command of the LORD your God. 27 You grumbled in your tents and said, “The LORD hates us; so he brought us out of Egypt to deliver us into the hands of the Amorites to destroy us. 28 Where can we go? Our brothers have made us lose heart. They say, ‘The people are stronger and taller than we are; the cities are large, with walls up to the sky. We even saw the Anakites there.’ “\n29 Then I said to you, “Do not be terrified; do not be afraid of them. 30 The LORD your God, who is going before you, will fight for you, as he did for you in Egypt, before your very eyes, 31 and in the desert. There you saw how the LORD your God carried you, as a father carries his son, all the way you went until you reached this place.”\n32 In spite of this, you did not trust in the LORD your God, 33 who went ahead of you on your journey, in fire by night and in a cloud by day, to search out places for you to camp and to show you the way you should go.\n34 When the LORD heard what you said, he was angry and solemnly swore: 35 “Not a man of this evil generation shall see the good land I swore to give your forefathers, 36 except Caleb son of Jephunneh. He will see it, and I will give him and his descendants the land he set his feet on, because he followed the LORD wholeheartedly.”\n37 Because of you the LORD became angry with me also and said, “You shall not enter it, either. 38 But your assistant, Joshua son of Nun, will enter it. Encourage him, because he will lead Israel to inherit it. 39 And the little ones that you said would be taken captive, your children who do not yet know good from bad—they will enter the land. I will give it to them and they will take possession of it. 40 But as for you, turn around and set out toward the desert along the route to the Red Sea. [a] “\n41 Then you replied, “We have sinned against the LORD. We will go up and fight, as the LORD our God commanded us.” So every one of you put on his weapons, thinking it easy to go up into the hill country.\n42 But the LORD said to me, “Tell them, ‘Do not go up and fight, because I will not be with you. You will be defeated by your enemies.’ “\n43 So I told you, but you would not listen. You rebelled against the LORD’s command and in your arrogance you marched up into the hill country. 44 The Amorites who lived in those hills came out against you; they chased you like a swarm of bees and beat you down from Seir all the way to Hormah. 45 You came back and wept before the LORD, but he paid no attention to your weeping and turned a deaf ear to you.\nDid the people of Israel rebel against the Lord’s command or not?  Was it God’s will that they rebel against Him or was it their will?    Was it God’s original plan for Moses and the people of Israel to enter Canaan or did He always intend for them to die in the desert?  Was God genuinely angry, or was He merely pretending to be angry for the purpose of making the puppet show seem more convincing to the puppets whose strings He was pulling?\nUPDATE – TRP requests a clarification:\nDo you actually believe that God CAN do this? Do you believe he DOES do this?\nAssuming he’s referring to 1 Samuel 2: 6-8, my answer to the first question is yes.  My answer to the second question is yes, occasionally.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-27T10:55:00+00:00"
}