{
  "url": "https://voxday.net/2007/11/26/potential-derailmen/",
  "scraped_at": "2026-01-08T22:01:42.026710",
  "title": "A potential derailment",
  "date_display": "November 26, 2007",
  "date_iso": "2007-11-26T08:44:00+00:00",
  "date_from_url": "2007-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I wrote <a href=\"http://www.milobookclub.com/2007/09/21/hillary-stays-in-close/\">in September</a>, it’s not actually news that Hillary isn’t normally oriented.  But given how tightly this has been kept under wraps and how obediently protective the media – both “conservative” and mainstream – has been of this oft-testified fact, it’s interesting to see how rumors of her and her omnipresent aide have <a href=\"http://www.timesonline.co.uk/tol/news/world/us_and_americas/article2917646.ece\">begun to surface in the international press</a>.  It seems increasingly probable that the Hillary and <a href=\"http://images.politico.com/global/humaimage.jpg\">Huma </a>scandal is the one upon which the Los Angeles Times has been sitting, about which so many rumors have been flying.</p><p>It would be a very, very interesting development if it turns out that the Internet has developed to the point that not even the united efforts of the conventional media suffice to kill a politically explosive story.  Because for all the inevitable protestations about how sex is no one’s business and shouldn’t be a factor, Hillary would neither be the first nor the last political candidate to be sunk by her poor judgment in these matters.</p><p>A few weeks ago, Ron Rosenbaum <a href=\"http://www.blogger.com/publish-confirmation.g?blogID=5604161&amp;postID=7767166439809239733&amp;timestamp=1196068848786&amp;javascriptEnabled=true\">reflected on the media’s culpability</a> in protecting the unnamed candidate in the same way they protected FDR and Kennedy:</p><blockquote><p>Now, as I say it’s a rumor; I haven’t seen the supporting evidence. But the person who told me said it offhandedly as if everyone in his world knew about it. And if you look close enough you can find hints of something impending, something potentially derailing to this candidate in the reporting of the campaign. Which could mean that something unspoken, unwritten about is influencing what is written, what we read.</p><p>Why are well wired media elite keeping silent about it? Because they think we can’t handle the truth? Because they think it’s substantively irrelevant? What standards of judgment are they using? Are they afraid that to print it will bring on opprobrium. Are they afraid not printing it will bring on opprobrium? Or both?</p><p>But alas if it leaks out from less “responsible” sources. then all their contextual protectiveness of us will have been wasted.</p></blockquote><p>From the way Rosenbaum described it, the rumor could apply to either Obama or Clinton, although there has certainly been lots of talk of late about Hillary losing both Iowa and New Hampshire.  We already know it’s about a Democrat, otherwise the media wouldn’t have been keeping their lips sealed in the first place.  But I still think he was probably referring to the lid finally coming off of Hillary Clinton’s Wellesleyan ways.</p></div>",
  "content_text": "As I wrote\nin September\n, it’s not actually news that Hillary isn’t normally oriented.  But given how tightly this has been kept under wraps and how obediently protective the media – both “conservative” and mainstream – has been of this oft-testified fact, it’s interesting to see how rumors of her and her omnipresent aide have\nbegun to surface in the international press\n.  It seems increasingly probable that the Hillary and\nHuma\nscandal is the one upon which the Los Angeles Times has been sitting, about which so many rumors have been flying.\nIt would be a very, very interesting development if it turns out that the Internet has developed to the point that not even the united efforts of the conventional media suffice to kill a politically explosive story.  Because for all the inevitable protestations about how sex is no one’s business and shouldn’t be a factor, Hillary would neither be the first nor the last political candidate to be sunk by her poor judgment in these matters.\nA few weeks ago, Ron Rosenbaum\nreflected on the media’s culpability\nin protecting the unnamed candidate in the same way they protected FDR and Kennedy:\nNow, as I say it’s a rumor; I haven’t seen the supporting evidence. But the person who told me said it offhandedly as if everyone in his world knew about it. And if you look close enough you can find hints of something impending, something potentially derailing to this candidate in the reporting of the campaign. Which could mean that something unspoken, unwritten about is influencing what is written, what we read.\nWhy are well wired media elite keeping silent about it? Because they think we can’t handle the truth? Because they think it’s substantively irrelevant? What standards of judgment are they using? Are they afraid that to print it will bring on opprobrium. Are they afraid not printing it will bring on opprobrium? Or both?\nBut alas if it leaks out from less “responsible” sources. then all their contextual protectiveness of us will have been wasted.\nFrom the way Rosenbaum described it, the rumor could apply to either Obama or Clinton, although there has certainly been lots of talk of late about Hillary losing both Iowa and New Hampshire.  We already know it’s about a Democrat, otherwise the media wouldn’t have been keeping their lips sealed in the first place.  But I still think he was probably referring to the lid finally coming off of Hillary Clinton’s Wellesleyan ways.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-26T08:44:00+00:00"
}