{
  "url": "https://voxday.net/2007/11/23/purloined-ideology/",
  "scraped_at": "2026-01-08T22:01:29.315271",
  "title": "The purloined ideology",
  "date_display": "November 23, 2007",
  "date_iso": "2007-11-23T19:55:00+00:00",
  "date_from_url": "2007-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Arno Lustiger, a Jewish historian and Holocaust survivor, has started proceedings to sue the magazine’s German edition for publishing an interview with Horst Mahler, the former left-wing extremist who transformed into one of Germany’s most rabid neo-Nazi public figures. The interview appeared in the Nov. 1 print and online editions.</p><p>Filed Nov. 7 and released to the public on Nov. 21, the suit notes that Mahler denied and belittled the Holocaust, which is illegal in Germany.</p></blockquote><p>The media continues to be mystified how <a href=\"http://www.jpost.com/servlet/Satellite?cid=1195546701089&amp;pagename=JPost%2FJPArticle%2FShowFull\">so many left-wing extremists have magically transformed</a> themselves into Fascists, Nazis, Neo-Nazis and Neocons.  It never seems to occur to them that this is because Fascists, Nazis, Neo-Nazis and Neocons are all variants of a basic left-wing ideology which is dependent upon large and powerful central governments harboring expansionary ambitions.</p></div>",
  "content_text": "Arno Lustiger, a Jewish historian and Holocaust survivor, has started proceedings to sue the magazine’s German edition for publishing an interview with Horst Mahler, the former left-wing extremist who transformed into one of Germany’s most rabid neo-Nazi public figures. The interview appeared in the Nov. 1 print and online editions.\nFiled Nov. 7 and released to the public on Nov. 21, the suit notes that Mahler denied and belittled the Holocaust, which is illegal in Germany.\nThe media continues to be mystified how\nso many left-wing extremists have magically transformed\nthemselves into Fascists, Nazis, Neo-Nazis and Neocons.  It never seems to occur to them that this is because Fascists, Nazis, Neo-Nazis and Neocons are all variants of a basic left-wing ideology which is dependent upon large and powerful central governments harboring expansionary ambitions.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-23T19:55:00+00:00"
}