{
  "url": "https://voxday.net/2007/11/14/religion-and-equality/",
  "scraped_at": "2026-01-08T22:00:30.120294",
  "title": "Religion and equality",
  "date_display": "November 14, 2007",
  "date_iso": "2007-11-14T12:01:00+00:00",
  "date_from_url": "2007-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I take mild exception to Half Sigma’s <a href=\"http://www.halfsigma.com/2007/11/religion-and-eq.html\">conception of religious equality</a>:</p><blockquote><p>He correctly points out the hypocrisy of leftists who criticize Christians for denying Darwinism.  But when he says “we are all equal before God,” he’s forgetting that during the era of slavery, exactly the opposite was said, that God endorsed slavery and that Africans were the descendants of Canaan, doomed to slavery because of the Curse of Ham.</p><p>The thing about religion is that it gives you a justification to believe in whatever you want. But science reveals inconvenient truths.</p></blockquote><p>Given Half Sigma’s deep interest in IQ, I find it difficult to believe that he really thinks it likely that I have forgotten how some Christians historically made use of the Bible to defend their position on slavery.  But I’m hardly in a position to complain about anyone else’s flights of rhetoric and the point is a logical fallacy anyhow; Christianity need answer for demonstrably bad Christian theology to the same extent that science need answer for demonstrably bad science.  And when one considers that the only significant anti-slavery force in human history has been evangelical Christianity, it would seem very strange to attempt to blame it in any way for an old and enduring institution that long preceded it and is showing signs of reappearing in its absence.</p><p>Half-Sigma’s actual error is the idea that equality before God somehow precludes slavery.  That is a category error.  God is no respecter of either persons or property; since He does not even acknowledge human ownership of material property, He cannot possibly respect human ownership of other humans for good or for ill.  He can and does, on the other hand, condemn poor stewardship of every kind; which is why the slave owner who thinks he owns his slaves is charged with treating them well.</p><p>No religion gives a blanket justification to believe whatever you want.  And one can construct an argument for slavery on scientific principles even more easily than one can on Christian grounds since science offers no justification for equality of any kind.</p><p>But this is a minor issue and I applaud Half Sigma’s courageous stance against anti-scientific equalitarian correctness.  In fact, the most interesting thing I noticed on Half Sigma’s blog wasn’t related to either IQ or religion, but rather his note that a mention in one of the New York Times’s most emailed articles <a href=\"http://www.halfsigma.com/2007/11/aftermath-of-th.html\">only led to a maximum potential increase of 4,000 visitors</a>.  It is this sort of revealing tidbit, more than all of the various articles on declining newspaper circulations, that attests to the declining relevance of the increasingly decrepit Grey Lady to today’s culture.</p></div>",
  "content_text": "In which I take mild exception to Half Sigma’s\nconception of religious equality\n:\nHe correctly points out the hypocrisy of leftists who criticize Christians for denying Darwinism.  But when he says “we are all equal before God,” he’s forgetting that during the era of slavery, exactly the opposite was said, that God endorsed slavery and that Africans were the descendants of Canaan, doomed to slavery because of the Curse of Ham.\nThe thing about religion is that it gives you a justification to believe in whatever you want. But science reveals inconvenient truths.\nGiven Half Sigma’s deep interest in IQ, I find it difficult to believe that he really thinks it likely that I have forgotten how some Christians historically made use of the Bible to defend their position on slavery.  But I’m hardly in a position to complain about anyone else’s flights of rhetoric and the point is a logical fallacy anyhow; Christianity need answer for demonstrably bad Christian theology to the same extent that science need answer for demonstrably bad science.  And when one considers that the only significant anti-slavery force in human history has been evangelical Christianity, it would seem very strange to attempt to blame it in any way for an old and enduring institution that long preceded it and is showing signs of reappearing in its absence.\nHalf-Sigma’s actual error is the idea that equality before God somehow precludes slavery.  That is a category error.  God is no respecter of either persons or property; since He does not even acknowledge human ownership of material property, He cannot possibly respect human ownership of other humans for good or for ill.  He can and does, on the other hand, condemn poor stewardship of every kind; which is why the slave owner who thinks he owns his slaves is charged with treating them well.\nNo religion gives a blanket justification to believe whatever you want.  And one can construct an argument for slavery on scientific principles even more easily than one can on Christian grounds since science offers no justification for equality of any kind.\nBut this is a minor issue and I applaud Half Sigma’s courageous stance against anti-scientific equalitarian correctness.  In fact, the most interesting thing I noticed on Half Sigma’s blog wasn’t related to either IQ or religion, but rather his note that a mention in one of the New York Times’s most emailed articles\nonly led to a maximum potential increase of 4,000 visitors\n.  It is this sort of revealing tidbit, more than all of the various articles on declining newspaper circulations, that attests to the declining relevance of the increasingly decrepit Grey Lady to today’s culture.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-14T12:01:00+00:00"
}