{
  "url": "https://voxday.net/2007/11/13/smart-money-stays-ou/",
  "scraped_at": "2026-01-08T22:00:24.197855",
  "title": "Smart money stays out",
  "date_display": "November 13, 2007",
  "date_iso": "2007-11-13T21:03:00+00:00",
  "date_from_url": "2007-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rob Long on <a href=\"http://roblong.com/?p=19\">the financial disaster that is the television production business</a>:</p><blockquote><p>It’s fun to watch the color drain from the faces of these smart, entrepreneurial, risk-taking people when I tell them how much it costs to fail – and I mean fail, as in total loss – in the TV business….</p><p>Marc senses that what we’re seeing right now is a “rebuild” of the entertainment industry.  And that may be the case.  But it looks more to me, right now, like disruption.  Like the current model of well-compensated, expensive failure – really kind of like the Austro-Hungarian aristocracy, around 1911, still riding around on horses, in bright red battle dress, about to face a cheaper, leaner, world – is about to get trampled on.  I’m not sure rebuild is the word.  Unless it’s what happens after “demolish.”</p><p>My Silicon Valley friends all shake their heads in amazement that the system has gone on so long.</p></blockquote><p>I don’t care about the writers strike although I assume they’ve probably got a point, somewhere in there.  I don’t like their industry or their product, although the points long raises does tend to make one ask that telling question… <em>cui bono</em>?</p><p>UPDATE – Okay, Scalzi makes it abundantly clear that the writers do indeed have <a href=\"http://scalzi.com/whatever/?p=125\">a salient grievance</a>:</p><blockquote><p>Television networks not wanting to pay residuals on Internet viewings of their shows, because they’re “promotional,” even as they sell advertising on them? Kiss my ass.</p></blockquote></div>",
  "content_text": "Rob Long on\nthe financial disaster that is the television production business\n:\nIt’s fun to watch the color drain from the faces of these smart, entrepreneurial, risk-taking people when I tell them how much it costs to fail – and I mean fail, as in total loss – in the TV business….\nMarc senses that what we’re seeing right now is a “rebuild” of the entertainment industry.  And that may be the case.  But it looks more to me, right now, like disruption.  Like the current model of well-compensated, expensive failure – really kind of like the Austro-Hungarian aristocracy, around 1911, still riding around on horses, in bright red battle dress, about to face a cheaper, leaner, world – is about to get trampled on.  I’m not sure rebuild is the word.  Unless it’s what happens after “demolish.”\nMy Silicon Valley friends all shake their heads in amazement that the system has gone on so long.\nI don’t care about the writers strike although I assume they’ve probably got a point, somewhere in there.  I don’t like their industry or their product, although the points long raises does tend to make one ask that telling question…\ncui bono\n?\nUPDATE – Okay, Scalzi makes it abundantly clear that the writers do indeed have\na salient grievance\n:\nTelevision networks not wanting to pay residuals on Internet viewings of their shows, because they’re “promotional,” even as they sell advertising on them? Kiss my ass.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-13T21:03:00+00:00"
}