{
  "url": "https://voxday.net/2007/11/04/ye-cats-2/",
  "scraped_at": "2026-01-08T21:59:15.484120",
  "title": "Ye cats",
  "date_display": "November 4, 2007",
  "date_iso": "2007-11-04T19:46:00+00:00",
  "date_from_url": "2007-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If I owned the Vikings, I don’t know if I could restrain myself from firing Childress at half-time.  The long field goal attempt was fine, but not having the field goal team ready to cover a runback is inexcusable, <i>especially when the other team’s kick returner is positioned in front of the goalposts!</i></p><p>I don’t wish Jackson any harm, but after seeing him throw two should-be interceptions and miss two screen passes, I’m certainly in no hurry to see him return from whatever injury he suffered in the first half.</p><p>UPDATE – Holy Oklahoma Tailbacks!</p><blockquote><p>Adrian Peterson raced to the NFL’s single-game rushing record at the midpoint of his rookie season.  After giving up the longest play in league history on a missed field goal right before halftime, the Vikings turned to their amazing rookie and Peterson delivered — rushing for an NFL-record 296 yards in a 35-17 victory over the San Diego Chargers on Sunday.</p></blockquote><p>He’s going to go for 300 before this season is over.  He would have done it today if they hadn’t wanted to get Taylor a touchdown.</p></div>",
  "content_text": "If I owned the Vikings, I don’t know if I could restrain myself from firing Childress at half-time.  The long field goal attempt was fine, but not having the field goal team ready to cover a runback is inexcusable,\nespecially when the other team’s kick returner is positioned in front of the goalposts!\nI don’t wish Jackson any harm, but after seeing him throw two should-be interceptions and miss two screen passes, I’m certainly in no hurry to see him return from whatever injury he suffered in the first half.\nUPDATE – Holy Oklahoma Tailbacks!\nAdrian Peterson raced to the NFL’s single-game rushing record at the midpoint of his rookie season.  After giving up the longest play in league history on a missed field goal right before halftime, the Vikings turned to their amazing rookie and Peterson delivered — rushing for an NFL-record 296 yards in a 35-17 victory over the San Diego Chargers on Sunday.\nHe’s going to go for 300 before this season is over.  He would have done it today if they hadn’t wanted to get Taylor a touchdown.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-11-04T19:46:00+00:00"
}