{
  "url": "https://voxday.net/2020/02/07/a-narrow-escape/",
  "scraped_at": "2025-12-21T03:15:15.245510",
  "title": "A narrow escape",
  "date_display": "February 7, 2020",
  "date_iso": "2020-02-07T22:55:15+00:00",
  "date_from_url": "2020-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fortunately for humanity, its greatest thinker has survived to think more of the thoughts that no one has thought before. Mikhaela Peterson explains the recent silence of Jordan Peterson:</p><blockquote><p>The last year has been extremely difficult for our family. Dad was put on a low dose of a benzodiazepine a few years ago for anxiety following an extremely severe autoimmune reaction to food. He took the medication as prescribed. Last April when my mom was diagnosed with terminal cancer, the dose of the medication was increased. It became apparent that he was suffering from both a physical dependency and a paradoxical reaction to the medication. A paradoxical reaction means the drugs do the opposite of what they’re supposed to. These reactions are rare but are not unheard of.</p><p>For the last 8 months he’s been in unbearable discomfort from this drug, made worse when trying to remove it, because of the addition of withdrawal symptoms, stemming from physical dependence. He experienced terrible akathisia, which is a condition where the person feels an incredible, endless, irresistible restlessness, bordering on panic, and an inability to sit still. The reaction made him suicidal.</p><p>After several failed treatment attempts in North American hospitals, including attempts at tapering and micro-tapering, we had to seek an emergency medical benzodiazepine detox, which we were only able to find in Russia. It was incredibly gruelling, and was further complicated by severe pneumonia which we’ve been told he developed in one of the previous hospitals. He’s had to spend 4 weeks in the ICU in terrible shape, but, with the help of some extremely competent and courageous doctors, he survived.  The decision to bring him to Russia was made in extreme desperation, when we couldn’t find any better option. The uncertainty around his recovery has been one of the most difficult and scary experiences we’ve ever had.</p><p>So: Finally Dad is on the mend, even though there’s a lot of physiological damage that he needs to recover from. He’s improving, and is off the horrible medication. His sense of humour is back. He’s smiling again for the first time in months, but he still has a long way to go to recover fully.</p></blockquote><p>It’s more than a little strange, is it not, that a complete stranger could coincidentally happen to anticipate an emotional crisis of this magnitude prior to its occurrence? But setting aside the various possible causes of the crisis, let us simply observe that perhaps one would be, shall we say, <i>unwise</i>, to live one’s life according to the philosophy and precepts of a man who is clearly unwell on multiple levels, including the physical, the psychological, and the spiritual.</p></div>",
  "content_text": "Fortunately for humanity, its greatest thinker has survived to think more of the thoughts that no one has thought before. Mikhaela Peterson explains the recent silence of Jordan Peterson:\nThe last year has been extremely difficult for our family. Dad was put on a low dose of a benzodiazepine a few years ago for anxiety following an extremely severe autoimmune reaction to food. He took the medication as prescribed. Last April when my mom was diagnosed with terminal cancer, the dose of the medication was increased. It became apparent that he was suffering from both a physical dependency and a paradoxical reaction to the medication. A paradoxical reaction means the drugs do the opposite of what they’re supposed to. These reactions are rare but are not unheard of.\nFor the last 8 months he’s been in unbearable discomfort from this drug, made worse when trying to remove it, because of the addition of withdrawal symptoms, stemming from physical dependence. He experienced terrible akathisia, which is a condition where the person feels an incredible, endless, irresistible restlessness, bordering on panic, and an inability to sit still. The reaction made him suicidal.\nAfter several failed treatment attempts in North American hospitals, including attempts at tapering and micro-tapering, we had to seek an emergency medical benzodiazepine detox, which we were only able to find in Russia. It was incredibly gruelling, and was further complicated by severe pneumonia which we’ve been told he developed in one of the previous hospitals. He’s had to spend 4 weeks in the ICU in terrible shape, but, with the help of some extremely competent and courageous doctors, he survived.  The decision to bring him to Russia was made in extreme desperation, when we couldn’t find any better option. The uncertainty around his recovery has been one of the most difficult and scary experiences we’ve ever had.\nSo: Finally Dad is on the mend, even though there’s a lot of physiological damage that he needs to recover from. He’s improving, and is off the horrible medication. His sense of humour is back. He’s smiling again for the first time in months, but he still has a long way to go to recover fully.\nIt’s more than a little strange, is it not, that a complete stranger could coincidentally happen to anticipate an emotional crisis of this magnitude prior to its occurrence? But setting aside the various possible causes of the crisis, let us simply observe that perhaps one would be, shall we say,\nunwise\n, to live one’s life according to the philosophy and precepts of a man who is clearly unwell on multiple levels, including the physical, the psychological, and the spiritual.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-02-07T22:55:15+00:00"
}