{
  "url": "https://voxday.net/2020/02/02/bernie-must-have-been-winning/",
  "scraped_at": "2025-12-21T03:14:41.428693",
  "title": "Bernie must have been winning",
  "date_display": "February 2, 2020",
  "date_iso": "2020-02-02T11:49:18+00:00",
  "date_from_url": "2020-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Des Moines Register inexplicably refuses to release its final poll before the Iowa caucuses:</p><blockquote><p>The Des Moines Register, CNN and Selzer &amp; Co. have made the decision to not release the final installment of the CNN/Des Moines Register/Mediacom poll as planned this evening.</p><p>Nothing is more important to the Register and its polling partners than the integrity of the Iowa Poll. Today, a respondent raised an issue with the way the survey was administered, which could have compromised the results of the poll. It appears a candidate’s name was omitted in at least one interview in which the respondent was asked to name their preferred candidate.</p><p>While this appears to be isolated to one surveyor, we cannot confirm that with certainty. Therefore, the partners made the difficult decision to not to move forward with releasing the Iowa Poll.</p></blockquote><p>Sanders was shown leading by as much as four points in the previous poll. The pollster with the best track record, <a href=\"https://www.politico.com/news/2020/02/01/iowa-poll-2020-110155\">had him five points ahead</a> of Creepy Joe.</p><blockquote class=\"tr_bq\"><p>Selzer’s most recent poll, conducted Jan. 2-8, showed Sanders at 20 percent, Warren at 17 percent, Buttigieg at 16 percent and Biden at 15 percent. </p></blockquote><p>And “subsequent reports said that Pete Buttigieg’s name had either been accidentally omitted or mispronounced by a poll worker during at least one call.” Yeah, because that would have <i>totally </i>altered the results….</p><p><a href=\"https://www.politico.com/news/2020/01/31/dnc-superdelegates-110083\">It’s obvious</a> that the Democrats desperately want to avoid throwing a decrepit jewish socialist up against the God-Emperor Donald I. As wicked and stupid as they are, even they understand that will end in disaster as blacks and Hispanics either stay home or vote for the only candidate they can possibly respect.</p><p>Buttigieg and Klobuchar are nonentities. Biden is as hapless as he is hopeless. Sanders is more obviously unelectable than Dukakis or Mondale ever were. Warren has been unable to generate enthusiasm. They have no one to stop the inevitable Trumpslide 2020.</p></div>",
  "content_text": "The Des Moines Register inexplicably refuses to release its final poll before the Iowa caucuses:\nThe Des Moines Register, CNN and Selzer & Co. have made the decision to not release the final installment of the CNN/Des Moines Register/Mediacom poll as planned this evening.\nNothing is more important to the Register and its polling partners than the integrity of the Iowa Poll. Today, a respondent raised an issue with the way the survey was administered, which could have compromised the results of the poll. It appears a candidate’s name was omitted in at least one interview in which the respondent was asked to name their preferred candidate.\nWhile this appears to be isolated to one surveyor, we cannot confirm that with certainty. Therefore, the partners made the difficult decision to not to move forward with releasing the Iowa Poll.\nSanders was shown leading by as much as four points in the previous poll. The pollster with the best track record,\nhad him five points ahead\nof Creepy Joe.\nSelzer’s most recent poll, conducted Jan. 2-8, showed Sanders at 20 percent, Warren at 17 percent, Buttigieg at 16 percent and Biden at 15 percent.\nAnd “subsequent reports said that Pete Buttigieg’s name had either been accidentally omitted or mispronounced by a poll worker during at least one call.” Yeah, because that would have\ntotally\naltered the results….\nIt’s obvious\nthat the Democrats desperately want to avoid throwing a decrepit jewish socialist up against the God-Emperor Donald I. As wicked and stupid as they are, even they understand that will end in disaster as blacks and Hispanics either stay home or vote for the only candidate they can possibly respect.\nButtigieg and Klobuchar are nonentities. Biden is as hapless as he is hopeless. Sanders is more obviously unelectable than Dukakis or Mondale ever were. Warren has been unable to generate enthusiasm. They have no one to stop the inevitable Trumpslide 2020.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-02-02T11:49:18+00:00"
}