{
  "url": "https://voxday.net/2020/02/16/plagiarizing-the-narrative/",
  "scraped_at": "2025-12-21T12:45:09.004669",
  "title": "Plagiarizing the narrative",
  "date_display": "February 16, 2020",
  "date_iso": "2020-02-16T11:03:27+00:00",
  "date_from_url": "2020-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not a mystery. Fiction authors don’t predict events, the crisis manufacturers simply <a href=\"https://www.scmp.com/lifestyle/arts-culture/article/3050481/virus-called-wuhan-400-makes-people-terribly-ill-dean-koontz\">rip off their narratives</a> from them from time to time:</p><blockquote><p><i>The Eyes of Darkness</i>, a 1981 thriller by bestselling suspense author Dean Koontz, tells of a Chinese military lab that creates a virus as part of its biological weapons programme. The lab is located in Wuhan, which lends the virus its name, Wuhan-400. A chilling literary coincidence or a case of writer as unwitting prophet?</p><p>In <i>The Eyes of Darkness</i>, a grieving mother, Christina Evans, sets out to discover whether her son Danny died on a camping trip or if – as suspicious messages suggest – he is still alive. She eventually tracks him down to a military facility where he is being held after being accidentally contaminated with man-made microorganisms created at the research centre in Wuhan.</p><p>If that made the hair on the back of your neck stand up, read this passage from the book: “It was around that time that a Chinese scientist named Li Chen moved to the United States while carrying a floppy disk of data from China’s most important and dangerous new biological weapon of the past decade. They call it Wuhan-400 because it was developed in their RDNA laboratory just outside the city of Wuhan.”</p><p>In another strange coincidence, the Wuhan Institute of Virology, which houses China’s only level four biosafety laboratory, the highest-level classification of labs that study the deadliest viruses, is just 32km from the epicentre of the current coronavirus outbreak. The opening of the maximum-security lab was covered in a 2017 story in the journal Nature, which warned of safety risks in a culture where hierarchy trumps an open culture.</p></blockquote><p>Sometimes they get away with it, sometimes they don’t. For example, the keyboardist/DJ in Psykosonik “borrowed” a techno riff for the post-chorus for one of our songs from dance groove he liked to spin by a little-known European techno group. Not a big deal, that’s something that techno and house groups do all the time and is generally considered homage, not plagiarism. We did find it a little embarrassing, however, when that initially-unknown song somehow blew up into a stadium anthem that is regularly heard to this day.</p><p>Ironically, both songs made the Billboard Top 40 club chart, at numbers 14 and 37, respectively.</p></div>",
  "content_text": "It’s not a mystery. Fiction authors don’t predict events, the crisis manufacturers simply\nrip off their narratives\nfrom them from time to time:\nThe Eyes of Darkness\n, a 1981 thriller by bestselling suspense author Dean Koontz, tells of a Chinese military lab that creates a virus as part of its biological weapons programme. The lab is located in Wuhan, which lends the virus its name, Wuhan-400. A chilling literary coincidence or a case of writer as unwitting prophet?\nIn\nThe Eyes of Darkness\n, a grieving mother, Christina Evans, sets out to discover whether her son Danny died on a camping trip or if – as suspicious messages suggest – he is still alive. She eventually tracks him down to a military facility where he is being held after being accidentally contaminated with man-made microorganisms created at the research centre in Wuhan.\nIf that made the hair on the back of your neck stand up, read this passage from the book: “It was around that time that a Chinese scientist named Li Chen moved to the United States while carrying a floppy disk of data from China’s most important and dangerous new biological weapon of the past decade. They call it Wuhan-400 because it was developed in their RDNA laboratory just outside the city of Wuhan.”\nIn another strange coincidence, the Wuhan Institute of Virology, which houses China’s only level four biosafety laboratory, the highest-level classification of labs that study the deadliest viruses, is just 32km from the epicentre of the current coronavirus outbreak. The opening of the maximum-security lab was covered in a 2017 story in the journal Nature, which warned of safety risks in a culture where hierarchy trumps an open culture.\nSometimes they get away with it, sometimes they don’t. For example, the keyboardist/DJ in Psykosonik “borrowed” a techno riff for the post-chorus for one of our songs from dance groove he liked to spin by a little-known European techno group. Not a big deal, that’s something that techno and house groups do all the time and is generally considered homage, not plagiarism. We did find it a little embarrassing, however, when that initially-unknown song somehow blew up into a stadium anthem that is regularly heard to this day.\nIronically, both songs made the Billboard Top 40 club chart, at numbers 14 and 37, respectively.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-02-16T11:03:27+00:00"
}