{
  "url": "https://voxday.net/2020/02/25/the-corruption-of-the-church/",
  "scraped_at": "2025-12-21T12:46:00.810524",
  "title": "The corruption of the Church",
  "date_display": "February 25, 2020",
  "date_iso": "2020-02-25T13:40:37+00:00",
  "date_from_url": "2020-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dostoevsky understood that when the Church becomes the State, it ceases to be the Church, as he described in <i>The Brothers Karamazov</i>:</p><blockquote class=\"tr_bq\"><p>In many cases there are no churches there at all, for though ecclesiastics and splendid church buildings remain, the churches themselves have long ago striven to pass from Church into State and to disappear in it completely. So it seems at least in Lutheran countries. As for Rome, it was proclaimed a State instead of a Church a thousand years ago.</p></blockquote><p>The State Churches of Great Britain, Norway, and Sweden bear testimony to this perspective. Temporal power has always been the great temptation of the Christian, as it was of Jesus Christ himself.<br><i><br/></i><i>The devil took him to a very high mountain and showed him all the kingdoms of the world and their splendor.  “All this I will give you,” he said, “if you will bow down and worship me.” Jesus said to him, “Away from me, Satan! For it is written: ‘Worship the Lord your God, and serve him only.’” </i></br></p><p>Of course, Dostoevsky very well understood that others accepted the offer that Jesus Christ rejected.</p><blockquote class=\"tr_bq\"><p>All that I can say is known to Thee already. And is it for me to conceal from Thee our mystery? Perhaps it is Thy will to hear it from my lips. Listen, then. We are not working with Thee, but with <i>him</i>–that is our mystery. It’s long–eight centuries–since we have been on <i>his </i>side and not on Thine. Just eight centuries ago, we took from him what Thou didst reject with scorn, that last gift he offered Thee, showing Thee all the kingdoms of the earth. We took from him Rome and the sword of Cæsar, and proclaimed ourselves sole rulers of the earth, though hitherto we have not been able to complete our work. But whose fault is that? Oh, the work is only beginning, but it has begun. It has long to await completion and the earth has yet much to suffer, but we shall triumph and shall be Cæsars, and then we shall plan the universal happiness of man.</p></blockquote><p>Beware those who preach the unity of Man and the healing of the world. Those who do have taken the Grand Ticket.</p></div>",
  "content_text": "Dostoevsky understood that when the Church becomes the State, it ceases to be the Church, as he described in\nThe Brothers Karamazov\n:\nIn many cases there are no churches there at all, for though ecclesiastics and splendid church buildings remain, the churches themselves have long ago striven to pass from Church into State and to disappear in it completely. So it seems at least in Lutheran countries. As for Rome, it was proclaimed a State instead of a Church a thousand years ago.\nThe State Churches of Great Britain, Norway, and Sweden bear testimony to this perspective. Temporal power has always been the great temptation of the Christian, as it was of Jesus Christ himself.\nThe devil took him to a very high mountain and showed him all the kingdoms of the world and their splendor.  “All this I will give you,” he said, “if you will bow down and worship me.” Jesus said to him, “Away from me, Satan! For it is written: ‘Worship the Lord your God, and serve him only.’”\nOf course, Dostoevsky very well understood that others accepted the offer that Jesus Christ rejected.\nAll that I can say is known to Thee already. And is it for me to conceal from Thee our mystery? Perhaps it is Thy will to hear it from my lips. Listen, then. We are not working with Thee, but with\nhim\n–that is our mystery. It’s long–eight centuries–since we have been on\nhis\nside and not on Thine. Just eight centuries ago, we took from him what Thou didst reject with scorn, that last gift he offered Thee, showing Thee all the kingdoms of the earth. We took from him Rome and the sword of Cæsar, and proclaimed ourselves sole rulers of the earth, though hitherto we have not been able to complete our work. But whose fault is that? Oh, the work is only beginning, but it has begun. It has long to await completion and the earth has yet much to suffer, but we shall triumph and shall be Cæsars, and then we shall plan the universal happiness of man.\nBeware those who preach the unity of Man and the healing of the world. Those who do have taken the Grand Ticket.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-02-25T13:40:37+00:00"
}