{
  "url": "https://voxday.net/2020/02/04/the-necessity-of-debt-cancellation/",
  "scraped_at": "2025-12-21T03:14:57.219422",
  "title": "The necessity of debt cancellation",
  "date_display": "February 4, 2020",
  "date_iso": "2020-02-04T13:58:45+00:00",
  "date_from_url": "2020-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.unz.com/mhudson/the-history-of-debt-cancellation-and-austerity-in-europe/\">An excellent interview</a> with Michael Hudson, author of <i>And Forgive Them Their Debts</i>:</p><blockquote><p><b>Rees Jeannotte:</b> To think about a more sensible way to deal with a debt crisis. Maybe you can use the most recent example of a national debt cancellation, namely here in Germany.</p><p><b>Michael Hudson:</b> That’s right. The German Economic Miracle was the Allied debt reforms of 1947/48. They essentially wiped out all debts except for what employers owed their employees – you know, the workers’ wages and minimum working balances at the banks. It was easy for the Allies to cancel the debts owed to German creditors. because the creditors were mainly Nazis. The whole idea was to wipe them out. They didn’t the want to leave the former Nazis with financial power to take over the economy again. They wanted a Clean Slate.</p><p>Canceling the debts created the German Economic Miracle. Because the economy was able to operate without personal debt, and without much public debt or corporate debt. It was able to take off. Today, essentially you’re dealing with a criminalized banking class that I think we should treat in the same way that the Allies treated the Nazis. If you don’t cancel the debts owed to them, the economy is going to shrink and shrink, and polarize. We’re going to have essentially a neo-feudalism controlled by the creditor class, like you had in Rome in the Dark Ages. Do you really want a new Dark Age?</p><p><b>Rees Jeannotte:</b> No, not particularly. This leads us into the financial crisis of 2008, where you were among the few people to predict it accurately. It was largely based on a giant private debt bubble. Private debt is something that we don’t hear much about. I tried to look for the totals on private debt worldwide. You find out the debt to GDP ratio for public debt. For government debt, but it’s never about private debt.</p><p><b>Michael Hudson:</b> That is because the right-wing politicians want to abolish government and the social services it provides. Apart from the money governments owe for military spending and NATO, they owe pensions and health care. The right-wing program in Germany and Europe is to get rid of pensions, to lower them, to financialize and privatize the pension system instead of Germany’s pay-as-you-go system, which is quite good. They want to get rid of social spending.</p><p>Also, they look at government debt as the adversary of private debt. For instance, in the United States, President Clinton finally ran a budget surplus in the last year of his rule. What happens when a government runs a surplus? That means that it doesn’t spend money into the economy. The economy has to rely on banks to get credit, because every economy needs credit to function and grow. Bankers realize that if the government doesn’t provide the economy with money – by spending deficits into the economy to promote employment – then people will have to borrow from the banks. But if they keep borrowing from the banks to buy homes rising in price and just to maintain their living standards, their families will end up looking like Greece or Argentina. They’re going to have to pay more of their income as interest. Bankers will end up with the houses, and with private industry. They will end up controlling everything, including the government.</p><p>For thousands of years the leading tension of civilization has been over who is going to dominate and plan society’s economy. Will it be democratic governments or wise rulers seeking stability and military security? Or, will it be a financial oligarchy that wants to get rich by impoverishing the rest of society?</p></blockquote><p>He’s correct. The ultimate and mathematically certain outcome of the current financial system is that the owners of the banks own literally all the property and all of the people. This is not a question of right-wing vs left-wing, and it’s very important to remember that banks are not capitalism, corporations are not human beings, and usury is not freedom.</p><p>Quite the opposite, as it happens.</p><p>As usual, there are commenters at Unz who can be relied upon to produce the retarded “conservative” attack on debt cancellation. Make no mistake, if at this point you still oppose debt cancellation on the grounds of “personal responsibility”, you are economically retarded, by which I mean, you are so stupid, so shortsighted, and so unable to do the very simple math involved that if I had the ability to do so, I would forbid you to read this blog.</p><p><i>If it’s selective then people who made responsible economic decisions will be forced to subsidize the self-indulgent and/or foolish economic decisions of others. </i></p><p>The inexorable math of usury and the way in which credit shifts the demand curve upward dictates that however “responsible” your economic decisions are, sooner or later you will be forced to not only “subsidize the self-indulgent and/or foolish economic decisions of others”, you will be forced to make equally foolish decisions yourself. The fiscal conservative’s belief in “responsible debt” is no different than the Churchian’s belief in Judeochristianity, and it stems from exactly the same evil source.</p></div>",
  "content_text": "An excellent interview\nwith Michael Hudson, author of\nAnd Forgive Them Their Debts\n:\nRees Jeannotte:\nTo think about a more sensible way to deal with a debt crisis. Maybe you can use the most recent example of a national debt cancellation, namely here in Germany.\nMichael Hudson:\nThat’s right. The German Economic Miracle was the Allied debt reforms of 1947/48. They essentially wiped out all debts except for what employers owed their employees – you know, the workers’ wages and minimum working balances at the banks. It was easy for the Allies to cancel the debts owed to German creditors. because the creditors were mainly Nazis. The whole idea was to wipe them out. They didn’t the want to leave the former Nazis with financial power to take over the economy again. They wanted a Clean Slate.\nCanceling the debts created the German Economic Miracle. Because the economy was able to operate without personal debt, and without much public debt or corporate debt. It was able to take off. Today, essentially you’re dealing with a criminalized banking class that I think we should treat in the same way that the Allies treated the Nazis. If you don’t cancel the debts owed to them, the economy is going to shrink and shrink, and polarize. We’re going to have essentially a neo-feudalism controlled by the creditor class, like you had in Rome in the Dark Ages. Do you really want a new Dark Age?\nRees Jeannotte:\nNo, not particularly. This leads us into the financial crisis of 2008, where you were among the few people to predict it accurately. It was largely based on a giant private debt bubble. Private debt is something that we don’t hear much about. I tried to look for the totals on private debt worldwide. You find out the debt to GDP ratio for public debt. For government debt, but it’s never about private debt.\nMichael Hudson:\nThat is because the right-wing politicians want to abolish government and the social services it provides. Apart from the money governments owe for military spending and NATO, they owe pensions and health care. The right-wing program in Germany and Europe is to get rid of pensions, to lower them, to financialize and privatize the pension system instead of Germany’s pay-as-you-go system, which is quite good. They want to get rid of social spending.\nAlso, they look at government debt as the adversary of private debt. For instance, in the United States, President Clinton finally ran a budget surplus in the last year of his rule. What happens when a government runs a surplus? That means that it doesn’t spend money into the economy. The economy has to rely on banks to get credit, because every economy needs credit to function and grow. Bankers realize that if the government doesn’t provide the economy with money – by spending deficits into the economy to promote employment – then people will have to borrow from the banks. But if they keep borrowing from the banks to buy homes rising in price and just to maintain their living standards, their families will end up looking like Greece or Argentina. They’re going to have to pay more of their income as interest. Bankers will end up with the houses, and with private industry. They will end up controlling everything, including the government.\nFor thousands of years the leading tension of civilization has been over who is going to dominate and plan society’s economy. Will it be democratic governments or wise rulers seeking stability and military security? Or, will it be a financial oligarchy that wants to get rich by impoverishing the rest of society?\nHe’s correct. The ultimate and mathematically certain outcome of the current financial system is that the owners of the banks own literally all the property and all of the people. This is not a question of right-wing vs left-wing, and it’s very important to remember that banks are not capitalism, corporations are not human beings, and usury is not freedom.\nQuite the opposite, as it happens.\nAs usual, there are commenters at Unz who can be relied upon to produce the retarded “conservative” attack on debt cancellation. Make no mistake, if at this point you still oppose debt cancellation on the grounds of “personal responsibility”, you are economically retarded, by which I mean, you are so stupid, so shortsighted, and so unable to do the very simple math involved that if I had the ability to do so, I would forbid you to read this blog.\nIf it’s selective then people who made responsible economic decisions will be forced to subsidize the self-indulgent and/or foolish economic decisions of others.\nThe inexorable math of usury and the way in which credit shifts the demand curve upward dictates that however “responsible” your economic decisions are, sooner or later you will be forced to not only “subsidize the self-indulgent and/or foolish economic decisions of others”, you will be forced to make equally foolish decisions yourself. The fiscal conservative’s belief in “responsible debt” is no different than the Churchian’s belief in Judeochristianity, and it stems from exactly the same evil source.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-02-04T13:58:45+00:00"
}