{
  "url": "https://voxday.net/2020/02/02/whose-authority-would-that-be/",
  "scraped_at": "2025-12-21T03:14:43.255104",
  "title": "Whose authority would that be?",
  "date_display": "February 2, 2020",
  "date_iso": "2020-02-02T14:27:45+00:00",
  "date_from_url": "2020-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Kurgan addresses John Salza’s <i>The Errors of Sedevacantism and Ecclesiastical Law</i> <a href=\"http://www.gfilotto.com/shooting-down-the-false-objections-to-sede-privationsim\">in detail</a>:</p><blockquote><p>As a result of Vox Day mentioning my earlier blog post challenge to nominal Catholics concerning the fact that we have only had antipopes since 1958, one of the commenters there brought up some supposed studied theologians who claim to have fully refuted the position they call Sedevacantism (but I call SedePrivationism for precision, since words matter). My post on the antipopes and the legal reasoning why is <a href=\"http://www.gfilotto.com/logical-challenge-to-ann-and-all-nominal-catholics\">here</a> and it is rooted in the fact that we, as obedient catholics, must believe the fake Popes are fake, and have been at the very least since 1963, for certain, because that is what the Code of Canon Law of 1917 necessarily states, which being put together by the Magisterium of the Church, we, as Catholics could never and should never had ignored when Vatican 2 raised its evil and apostate head from the darkness. Nor can we ignore it now. Remember that the only current and valid code of canon law is the one of 1917, since the one of 1983 was put together by the same impostors, non-clerics and non-catholics that usurped the Chair of Peter in the first place, and it was also specifically designed to try and invalidate the truth of the code of 1917 and obfuscate its clarity and precision.</p><p>Not having read or known anything about the two individuals mentioned by the commenter at VP calling himself MisesMat, who later emailed me and assured me both these gentlemen would be happy to debate me, in writing, I did a quick search for one the names that he mentioned and found Salza’s document online, which I reproduce below with my commentary. His words are in black and mine in red.</p></blockquote><p>Not being Roman Catholic, I only scanned both documents in passing. So, I won’t pass any judgement on either man’s case, except to say that I am extremely dubious of anyone who, in light of the observable misrule of the present Fake Pope, could possibly reach the following conclusion.</p><p><i>Restoring the Church will be furthered by recognizing the authority of the current Pope.</i></p><p>Extremely dubious is, of course, a significant understatement.</p></div>",
  "content_text": "The Kurgan addresses John Salza’s\nThe Errors of Sedevacantism and Ecclesiastical Law\nin detail\n:\nAs a result of Vox Day mentioning my earlier blog post challenge to nominal Catholics concerning the fact that we have only had antipopes since 1958, one of the commenters there brought up some supposed studied theologians who claim to have fully refuted the position they call Sedevacantism (but I call SedePrivationism for precision, since words matter). My post on the antipopes and the legal reasoning why is\nhere\nand it is rooted in the fact that we, as obedient catholics, must believe the fake Popes are fake, and have been at the very least since 1963, for certain, because that is what the Code of Canon Law of 1917 necessarily states, which being put together by the Magisterium of the Church, we, as Catholics could never and should never had ignored when Vatican 2 raised its evil and apostate head from the darkness. Nor can we ignore it now. Remember that the only current and valid code of canon law is the one of 1917, since the one of 1983 was put together by the same impostors, non-clerics and non-catholics that usurped the Chair of Peter in the first place, and it was also specifically designed to try and invalidate the truth of the code of 1917 and obfuscate its clarity and precision.\nNot having read or known anything about the two individuals mentioned by the commenter at VP calling himself MisesMat, who later emailed me and assured me both these gentlemen would be happy to debate me, in writing, I did a quick search for one the names that he mentioned and found Salza’s document online, which I reproduce below with my commentary. His words are in black and mine in red.\nNot being Roman Catholic, I only scanned both documents in passing. So, I won’t pass any judgement on either man’s case, except to say that I am extremely dubious of anyone who, in light of the observable misrule of the present Fake Pope, could possibly reach the following conclusion.\nRestoring the Church will be furthered by recognizing the authority of the current Pope.\nExtremely dubious is, of course, a significant understatement.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-02-02T14:27:45+00:00"
}