{
  "url": "https://voxday.net/2024/03/03/a-useful-faq-on-usury/",
  "scraped_at": "2026-01-08T14:25:59.626301",
  "title": "A Few Thoughts on Usury",
  "date_display": "March 3, 2024",
  "date_iso": "2024-03-03T15:08:42+00:00",
  "date_from_url": "2024-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, it’s necessary to define usury, which is not synonymous with either “loan” or “interest”, although unsurprisingly, the modern definition has been corrupted and is incorrect. The American Heritage defines it thusly:</p><ul class=\"wp-block-list\"><li><em>The practice of lending money and charging the borrower interest, especially at an exorbitant or illegally high rate.</em></li><li><em>An excessive or illegally high rate of interest charged on borrowed money.</em></li><li><em>Interest charged or paid on a loan.</em></li></ul><p>Even in the precise wordings of the definition, we can see the ambiguity that is the red flag that a word spell has been cast. If both interest charged and paid on a loan are usury, then both the lender and the borrower are usurers. And if all interest paid is usury, then there is no need to bring the rate of interest into the equation at all, and any exorbitant, excessive, or illegal aspect is irrelevant.</p><p>Now, the history of economics, especially as recounted by Murray Rothbard, is essentially the history of relentlessly challenging the Catholic Church’s ban on usury. And in retrospect, it’s clear that this incoherence is the direct result of centuries of gradually chipping away at the concept through adulteration and expansion of the moral and legal permissibility of usury.</p><p>In order to determine if a proposed contract is usurious, only three questions need be asked. If the answers to all three questions are unanimously <em>yes</em>, then the contract is not usurious and it is a legitimate <em>census </em>agreement as opposed to an illegitimate and usurious <em>mutuum</em> agreement:</p><ol class=\"wp-block-list\"><li><em>Is interest charged on the loan?</em></li><li><em>Has the borrower posted collateral providing security on the loan?</em></li><li><em>Is the lender’s recourse for recovery of principal and interest, in a case of default, limited to the named collateral and only the named collateral?</em></li></ol><p>The difference, as is made abundantly clear in <a href=\"https://zippycatholic.wordpress.com/2014/11/10/usury-faq-or-money-on-the-pill/#31\">this extremely useful and well-informed FAQ on the subject</a>, depends upon <em>the nature of the guarantee for the loan</em>, and NOT <em>the existence of any interest.</em> This is why student loans, credit card loans, and even car and home loans that are backed by personal guarantees are wicked, whereas corporate bonds and convertible notes are not. It is also why usury is so uniformly destructive from an entirely secular sense, while allowing the usurers to hide behind the legitimate utility of debt that permits the healthy growth of agriculture and industry without inevitably giving way to a credit bubble and eventual economic collapse.</p><p>In fact, the etymological shift in the definitional focus from collateral to interest looks downright suspicious to me as a student of historical kakology.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When reading old books and documents on usury it is important to keep in mind that the word ‘loan’ in English translations is almost always a translation of ‘mutuum’ or the like. It refers specifically to loans secured by the personal guarantee of the borrower, sometimes called a ‘loan for consumption’. Not all modern ‘debt’ or ‘loans’ are secured by the personal guarantee of a borrower or borrowers…</p><p>St. Thomas Aquinas explains that usurious lending involves selling something which does not exist.  This is very counterintuitive to people indoctrinated in modernity, and yet obvious once you’ve set aside modern anti-realism about property and economic value. </p><p>Another way to see that what is bought-and-sold in a mutuum does not exist is to observe that, under the terms of the contract, it is possible for the lender to fail to recover everything he is entitled to recover under the contract. The reason a full recourse lender is sometimes unable to recover what he is owed under the terms of the contract is because what he is owed under the terms of the contract does not exist…</p><p>Part of what made the usury doctrine clear to me when I first really began to grasp it (as opposed to – and I was as guilty of this as anyone – superficially dismissing caricatures rooted in anti-realist modernism) is that as an investor and entrepreneur, I see investment contracts involving peronal guarantees of repayment as inherently dysfunctional. If either the investor or the entrepreneur feels the need to throw personal guarantees into the mix in order to get the deal done, that is a major red flag that the proposed capital structure of the investment doesn’t make sense on its own terms. Usually this is because the property risks – the risks of partial or total loss of capital invested – in the investment are high enough to make a simple fixed-interest debt instrument inappropriate. Instead of personal guarantees the structure should be something like a convertible note, with equity upside, or it should be secured by a larger base of existing (though probably illiquid) capital. Basically, someone is trying to consume capital they don’t have and/or shift their own risks – the risks inherent in their own portfolios of property – onto third parties, personally.</p><p>Anyway, I haven’t really added anything new to the ancient understanding of usury here. I was just a guy who happened to be standing in the right spot to see what caused the train wreck, and I’m trying to explain what I saw in our common modern language as best I can. Like theft usury often does pay, at least in the short run, and it causes all sorts of damage that impacts different people differently and unfairly. Usury is inherently dysfunctional and morally evil, like theft. It may be mildly interesting sociologically that the Catholic Church was right for millennia about a simple core financial and moral truth that modern people, for all their putative economic and technical sophistication, have gotten completely wrong.</p></blockquote><p>This may be useful in the current economic hard times, as those who are wise stewards of their resources are likely to have friends, families, and acquaintances coming to them and asking them for help that goes beyond the usual charity that does not require deciding between one serious opportunity and another. The thing that is important to understand is that while one can provide a loan, and one can legitimately receive interest on that loan, the collateral provided as a guarantee against default on it must be real, specific, and, of course, proportional to the value of the combined principle and scheduled interest of the loan.</p><p>For example, if a farmer who owns ten acres of land worth 60k borrows 10k from you, you cannot hold him responsible for repaying it. And while you can require him to put up his land as collateral as a condition for the loan, you can’t legitimately have him provide all ten acres he owns as a guarantee since the land is worth 6k per acre. In that case, two acres is sufficient backing for the principle and interest; a proper <em>census </em>contract tends to look a lot more like a normal sale with a time delay than a bank loan full of terms and conditions that are manifestly one-sided and predatory.</p><p>Now, all this being said, it is still possible that the traditional distinction made by Christendom between <em>mutuum </em>and <em>census </em>is insufficient without a periodic jubilee, as this selection from the 1911 Encyclopaedia Britannica shows:</p><p><em>In Athens about the time of Solon’s legislation (594 B.C.) the bulk of the population, who had originally been small proprietors or <strong>metayers</strong>, became gradually indebted to the rich to such an extent that they were practically slaves. Those who still kept their property nominally were in the position of Irish cottiers: they owed more than they could pay, and stone pillars erected on their land showed the amount of the debts and the names of the lenders. Usury had given all the power of the state to a small plutocracy. </em></p><p><em>The remedy which Solon adopted was of a kind that we are accustomed to consider as purely modern. In the first place, it is true that according to ancient practice he proclaimed a general <strong>seisachtheia</strong>, or shaking off of burdens: he cancelled all the debts made on the security of the land or the person of the debtor. This measure alone would, however, have been of little service had he not at the same time enacted that henceforth no loans could be made on the bodily security of the debtor, and the creditor was confined to a share of the property. The consequence of this simple but effective reform was that Athens was never again disturbed by the agitation of insolvent debtors. Solon left the rate of interest to be determined by free contract, and sometimes the rate was exceedingly high, but none of the evils so generally prevalent in antiquity were experienced.</em></p><p>It is informative to observe that Solon’s successful solution to the problem of usury-based plutocracy of the sort that we are presently observing all across the West was very similar, though not identical, to the later teachings of Aquinas on the subject. And it’s interesting to note that the Solonic imposition of a limit to the share on the property serving as collateral is exactly the same conclusion that I independently reached in the paragraph above, while his proclamation of a general <em>seisachtheia </em>is exactly what Michael Hudson prescribes for the global economy.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d2730fbb-54fa-4d78-94f4-16b48c3e0859\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "First, it’s necessary to define usury, which is not synonymous with either “loan” or “interest”, although unsurprisingly, the modern definition has been corrupted and is incorrect. The American Heritage defines it thusly:\nThe practice of lending money and charging the borrower interest, especially at an exorbitant or illegally high rate.\nAn excessive or illegally high rate of interest charged on borrowed money.\nInterest charged or paid on a loan.\nEven in the precise wordings of the definition, we can see the ambiguity that is the red flag that a word spell has been cast. If both interest charged and paid on a loan are usury, then both the lender and the borrower are usurers. And if all interest paid is usury, then there is no need to bring the rate of interest into the equation at all, and any exorbitant, excessive, or illegal aspect is irrelevant.\nNow, the history of economics, especially as recounted by Murray Rothbard, is essentially the history of relentlessly challenging the Catholic Church’s ban on usury. And in retrospect, it’s clear that this incoherence is the direct result of centuries of gradually chipping away at the concept through adulteration and expansion of the moral and legal permissibility of usury.\nIn order to determine if a proposed contract is usurious, only three questions need be asked. If the answers to all three questions are unanimously\nyes\n, then the contract is not usurious and it is a legitimate\ncensus\nagreement as opposed to an illegitimate and usurious\nmutuum\nagreement:\nIs interest charged on the loan?\nHas the borrower posted collateral providing security on the loan?\nIs the lender’s recourse for recovery of principal and interest, in a case of default, limited to the named collateral and only the named collateral?\nThe difference, as is made abundantly clear in\nthis extremely useful and well-informed FAQ on the subject\n, depends upon\nthe nature of the guarantee for the loan\n, and NOT\nthe existence of any interest.\nThis is why student loans, credit card loans, and even car and home loans that are backed by personal guarantees are wicked, whereas corporate bonds and convertible notes are not. It is also why usury is so uniformly destructive from an entirely secular sense, while allowing the usurers to hide behind the legitimate utility of debt that permits the healthy growth of agriculture and industry without inevitably giving way to a credit bubble and eventual economic collapse.\nIn fact, the etymological shift in the definitional focus from collateral to interest looks downright suspicious to me as a student of historical kakology.\nWhen reading old books and documents on usury it is important to keep in mind that the word ‘loan’ in English translations is almost always a translation of ‘mutuum’ or the like. It refers specifically to loans secured by the personal guarantee of the borrower, sometimes called a ‘loan for consumption’. Not all modern ‘debt’ or ‘loans’ are secured by the personal guarantee of a borrower or borrowers…\nSt. Thomas Aquinas explains that usurious lending involves selling something which does not exist.  This is very counterintuitive to people indoctrinated in modernity, and yet obvious once you’ve set aside modern anti-realism about property and economic value.\nAnother way to see that what is bought-and-sold in a mutuum does not exist is to observe that, under the terms of the contract, it is possible for the lender to fail to recover everything he is entitled to recover under the contract. The reason a full recourse lender is sometimes unable to recover what he is owed under the terms of the contract is because what he is owed under the terms of the contract does not exist…\nPart of what made the usury doctrine clear to me when I first really began to grasp it (as opposed to – and I was as guilty of this as anyone – superficially dismissing caricatures rooted in anti-realist modernism) is that as an investor and entrepreneur, I see investment contracts involving peronal guarantees of repayment as inherently dysfunctional. If either the investor or the entrepreneur feels the need to throw personal guarantees into the mix in order to get the deal done, that is a major red flag that the proposed capital structure of the investment doesn’t make sense on its own terms. Usually this is because the property risks – the risks of partial or total loss of capital invested – in the investment are high enough to make a simple fixed-interest debt instrument inappropriate. Instead of personal guarantees the structure should be something like a convertible note, with equity upside, or it should be secured by a larger base of existing (though probably illiquid) capital. Basically, someone is trying to consume capital they don’t have and/or shift their own risks – the risks inherent in their own portfolios of property – onto third parties, personally.\nAnyway, I haven’t really added anything new to the ancient understanding of usury here. I was just a guy who happened to be standing in the right spot to see what caused the train wreck, and I’m trying to explain what I saw in our common modern language as best I can. Like theft usury often does pay, at least in the short run, and it causes all sorts of damage that impacts different people differently and unfairly. Usury is inherently dysfunctional and morally evil, like theft. It may be mildly interesting sociologically that the Catholic Church was right for millennia about a simple core financial and moral truth that modern people, for all their putative economic and technical sophistication, have gotten completely wrong.\nThis may be useful in the current economic hard times, as those who are wise stewards of their resources are likely to have friends, families, and acquaintances coming to them and asking them for help that goes beyond the usual charity that does not require deciding between one serious opportunity and another. The thing that is important to understand is that while one can provide a loan, and one can legitimately receive interest on that loan, the collateral provided as a guarantee against default on it must be real, specific, and, of course, proportional to the value of the combined principle and scheduled interest of the loan.\nFor example, if a farmer who owns ten acres of land worth 60k borrows 10k from you, you cannot hold him responsible for repaying it. And while you can require him to put up his land as collateral as a condition for the loan, you can’t legitimately have him provide all ten acres he owns as a guarantee since the land is worth 6k per acre. In that case, two acres is sufficient backing for the principle and interest; a proper\ncensus\ncontract tends to look a lot more like a normal sale with a time delay than a bank loan full of terms and conditions that are manifestly one-sided and predatory.\nNow, all this being said, it is still possible that the traditional distinction made by Christendom between\nmutuum\nand\ncensus\nis insufficient without a periodic jubilee, as this selection from the 1911 Encyclopaedia Britannica shows:\nIn Athens about the time of Solon’s legislation (594 B.C.) the bulk of the population, who had originally been small proprietors or\nmetayers\n, became gradually indebted to the rich to such an extent that they were practically slaves. Those who still kept their property nominally were in the position of Irish cottiers: they owed more than they could pay, and stone pillars erected on their land showed the amount of the debts and the names of the lenders. Usury had given all the power of the state to a small plutocracy.\nThe remedy which Solon adopted was of a kind that we are accustomed to consider as purely modern. In the first place, it is true that according to ancient practice he proclaimed a general\nseisachtheia\n, or shaking off of burdens: he cancelled all the debts made on the security of the land or the person of the debtor. This measure alone would, however, have been of little service had he not at the same time enacted that henceforth no loans could be made on the bodily security of the debtor, and the creditor was confined to a share of the property. The consequence of this simple but effective reform was that Athens was never again disturbed by the agitation of insolvent debtors. Solon left the rate of interest to be determined by free contract, and sometimes the rate was exceedingly high, but none of the evils so generally prevalent in antiquity were experienced.\nIt is informative to observe that Solon’s successful solution to the problem of usury-based plutocracy of the sort that we are presently observing all across the West was very similar, though not identical, to the later teachings of Aquinas on the subject. And it’s interesting to note that the Solonic imposition of a limit to the share on the property serving as collateral is exactly the same conclusion that I independently reached in the paragraph above, while his proclamation of a general\nseisachtheia\nis exactly what Michael Hudson prescribes for the global economy.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "economics",
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-03T15:16:46+00:00"
}