{
  "url": "https://voxday.net/2024/03/28/archeology-and-the-sacred-name-of-god/",
  "scraped_at": "2026-01-08T14:28:19.714359",
  "title": "Archeology and the Sacred Name of God",
  "date_display": "March 28, 2024",
  "date_iso": "2024-03-28T09:06:22+00:00",
  "date_from_url": "2024-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is a very important difference between <a href=\"https://remnantradio.org/Archives/articles/sacred_name.htm\">the Greek and the Hebrew</a> Old Testaments:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Greek Septuagint Old Testament of 285 BC never used any sacred name for God, nor was such ever mentioned by other ancient writers such as the Israelite historians, Philo, and Josephus, or the later Eusebius, or even the Jewish Aristeas the Exegete who wrote his commentary on the Greek Septuagint. The YHWH word did not appear in any Old Testament text until the Masoretic Text of 1000AD! Nor was the existence of any Hebrew language Old Testament text ever mentioned by ancient theologians, whose work was exclusively with the Greek Septuagint text.</p><p>From the viewpoint of modern theologians, it must first be understood that they all still today accept the Masoretic Hebrew text of 1,000 AD as the true ancient language and Old Testament of our patriarchs. Anyone who dared question this assumption would end his career. Since that Masoretic Text includes the four letter tetragrammeton, YHWH, over 6,000 times, theologians are forced to speculate that Moses must have put it in his Pentateuch. The Anchor Bible Dictionary, vol. 6, p. 1012, reads as follows: <em>“In terms of the biblical narrative, some suggest that Moses derived the name of Yahweh from the Egyptians, while others think Yahweh was a Midianite deity worshipped by the Kenite clan. Moses would have been introduced to this new deity when he married the daughter of Jethro…” </em></p><p>Certainly, Moses would have been acquainted with the Pagan religion of the Egyptians. But, even if the Pentateuch was actually written by Moses in the 15th C. BC, he could not have written it in the Hebrew language which was not formed until the time of the Israelite captivities, from the 8th to 6th centuries BC, when the captive Israelites merged their native Phoenician language with the Aramaic of their captors. Now, I ask you, who wants to raise his hand to claim that Moses adopted the name of a foreign deity as a substitute for “God” or “Lord.”</p><p>If we set aside the closed-minded obduracy of modern scholarship, we can see that Moses did not write any text in the modern Hebrew language because it did not exist at that time, nor was there any Hebrew alphabet or script. The oldest Old Testament text known is the Greek Septuagint of 285 BC, and the word does not appear in it one single time, or in any other ancient Israelite writing, with one exception which I will mention now.</p><p>To place this information in proper context, recall that the northern kingdom of Israelites, who had turned to other gods, had been purged from the Holy Land during the 8th century BC, along with most of Judea. It would not be until 586 BC that the last three unconquered cities of Judea, namely Jerusalem, Azekah, and Lachish, were defeated. Archaeologists have found eighteen ostraca (clay sherds) in the city of Lachish from about 590 BC, most of them being letters from subordinates to a man named Yaosh, the military governor of Lachish. It is unknown if the writer was Israelite or Babylonian…</p><p>At the time of this letter in 590 BC, it would only be four more years before Lachish was conquered as a punishment from God because His Israelite children had gone chasing after Pagan gods.</p></blockquote><p>Now, I’m not a theologian. This should be regarded as a starting point for investigation rather than an end. Even so, in this context, a lot of what is happening today begins to make sense, does it not? And it’s not as if we are not instructed, by the highest religious authorities, that their g-d is absolutely not God, the Father of Jesus Christ. I’ve certainly never witnessed anything positive come out of the Christian esotericism that dabbles in concepts like sacred names and languages.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1e2036e4-07de-41dc-8b37-5f404c74c700\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "There is a very important difference between\nthe Greek and the Hebrew\nOld Testaments:\nThe Greek Septuagint Old Testament of 285 BC never used any sacred name for God, nor was such ever mentioned by other ancient writers such as the Israelite historians, Philo, and Josephus, or the later Eusebius, or even the Jewish Aristeas the Exegete who wrote his commentary on the Greek Septuagint. The YHWH word did not appear in any Old Testament text until the Masoretic Text of 1000AD! Nor was the existence of any Hebrew language Old Testament text ever mentioned by ancient theologians, whose work was exclusively with the Greek Septuagint text.\nFrom the viewpoint of modern theologians, it must first be understood that they all still today accept the Masoretic Hebrew text of 1,000 AD as the true ancient language and Old Testament of our patriarchs. Anyone who dared question this assumption would end his career. Since that Masoretic Text includes the four letter tetragrammeton, YHWH, over 6,000 times, theologians are forced to speculate that Moses must have put it in his Pentateuch. The Anchor Bible Dictionary, vol. 6, p. 1012, reads as follows:\n“In terms of the biblical narrative, some suggest that Moses derived the name of Yahweh from the Egyptians, while others think Yahweh was a Midianite deity worshipped by the Kenite clan. Moses would have been introduced to this new deity when he married the daughter of Jethro…”\nCertainly, Moses would have been acquainted with the Pagan religion of the Egyptians. But, even if the Pentateuch was actually written by Moses in the 15th C. BC, he could not have written it in the Hebrew language which was not formed until the time of the Israelite captivities, from the 8th to 6th centuries BC, when the captive Israelites merged their native Phoenician language with the Aramaic of their captors. Now, I ask you, who wants to raise his hand to claim that Moses adopted the name of a foreign deity as a substitute for “God” or “Lord.”\nIf we set aside the closed-minded obduracy of modern scholarship, we can see that Moses did not write any text in the modern Hebrew language because it did not exist at that time, nor was there any Hebrew alphabet or script. The oldest Old Testament text known is the Greek Septuagint of 285 BC, and the word does not appear in it one single time, or in any other ancient Israelite writing, with one exception which I will mention now.\nTo place this information in proper context, recall that the northern kingdom of Israelites, who had turned to other gods, had been purged from the Holy Land during the 8th century BC, along with most of Judea. It would not be until 586 BC that the last three unconquered cities of Judea, namely Jerusalem, Azekah, and Lachish, were defeated. Archaeologists have found eighteen ostraca (clay sherds) in the city of Lachish from about 590 BC, most of them being letters from subordinates to a man named Yaosh, the military governor of Lachish. It is unknown if the writer was Israelite or Babylonian…\nAt the time of this letter in 590 BC, it would only be four more years before Lachish was conquered as a punishment from God because His Israelite children had gone chasing after Pagan gods.\nNow, I’m not a theologian. This should be regarded as a starting point for investigation rather than an end. Even so, in this context, a lot of what is happening today begins to make sense, does it not? And it’s not as if we are not instructed, by the highest religious authorities, that their g-d is absolutely not God, the Father of Jesus Christ. I’ve certainly never witnessed anything positive come out of the Christian esotericism that dabbles in concepts like sacred names and languages.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "history",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-28T09:06:23+00:00"
}