{
  "url": "https://voxday.net/2024/03/20/go-away-gamma/",
  "scraped_at": "2026-01-08T14:27:31.167246",
  "title": "Go Away, Gamma",
  "date_display": "March 20, 2024",
  "date_iso": "2024-03-20T01:09:20+00:00",
  "date_from_url": "2024-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case I haven’t made it entirely and absolutely clear, being “a longtime reader”, being a “supporter”, being a “subscriber”, being a “backer”, or even being “your biggest fan” cuts absolutely no ice with me. In fact, to the contrary, if you are any of those things, I have higher expectations of you than I do of some random drive-by commenter who knows nothing of me or of this community.</p><p>Today at Sigma Game, I asked women who had experience of raising, dating, or marrying Deltas <a href=\"https://sigmagame.substack.com/p/ladies-turn-the-delta-experience\">to share their opinions</a> concerning some of the pros and cons of Delta males. I also specifically told men to not share their own opinions or experiences, but to limit themselves to commenting on what the women were saying.</p><p>Needless to say, there were a few Gammas who were too emotionally incontinent to restrain themselves and simply let the women talk. One, in particular, didn’t hesitate to ignore my directions and go right off the deep end.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Elwin Ransom: </strong><em>Comments are interesting, but as I read them I can’t help feeling that many classifications by commenters are very likely skewed by perception and situational biases. I have long thought about a Myers-Briggs style test for SSH, but instead of just creating one and guessing what certain types will answer, thereby invoking the “this is what me the Alpha/Sigma would say” type response, a better proposal would be to create such a test, then administer it to a known set including all types, then correlate responses based on what the known set of answers. Hard part would be to find and agree upon the classification of the set of base answerees – but once complete, would be more quantitative way of self-assessment.</em></p><p><strong>Man of the Atom: </strong>What does your husband do?</p><p><em>[Very long digression by a few commenters on why Man of the Atom, as a commenter, would attempt to keep the comments on track and on topic redacted.]</em></p><p><strong>Elwin Ransom: </strong><em>He’s providing an unasked-for service, anonymously, on a comment board on the internet. That makes him a loser. Not Gamma on your part, and no further contemplation required.</em></p><p><strong>Vox Day:</strong> It’s fascinating how the Gammas always identify themselves so quickly. Do you simply not have any idea how transparent all your little machinations are to everyone, ESPECIALLY women, who play those games much better than you do?</p><p><strong>Man of the Atom: </strong>You still haven’t told us what your husband does.</p><p><strong>Elwin Ransom:</strong> <em>He shuts the fuck up when no one asked for his opinion, that’s what he does.</em></p><p><strong>Vox Day: </strong>You didn’t. Why should he? Also, you’re permanently banned. I don’t wish to turn this into a no-Gammas zone, but it’s probably going to end up that way over time.</p></blockquote><p>But wait, there’s more! Because of course there is. Within 11 minutes of my banning Mr. Ransom from Sigma Game, I received an email which led to the following exchange.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>“Elwin Ransom” (real name redacted)</strong>: <em>The commenter on your Sigma Game thread that you just banned was me. I have been a reader for close to two decades, and subscriber to both Castalia series since they started. No longer.</em></p><p><strong>Vox Day: </strong>Excellent. You clearly learned nothing over those two decades. Your behavior was unwanted, disrespectful, vulgar, and you should be embarrassed for yourself. But you won’t be, because you’ll just fire up your Gamma delusion bubble and convince yourself that you were justified. We’ll be pleased to refund you for any books you haven’t received yet. Just email [the usual address] to make the request.</p></blockquote><p>So, for those who didn’t subscribe early enough, if it turns out there is an extra Thucydides, we’ll let you know.</p><p><em><a href=\"https://social.infogalactic.com/micropost/989771b5-9d15-4695-a47f-5d1c1fc1a993\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In case I haven’t made it entirely and absolutely clear, being “a longtime reader”, being a “supporter”, being a “subscriber”, being a “backer”, or even being “your biggest fan” cuts absolutely no ice with me. In fact, to the contrary, if you are any of those things, I have higher expectations of you than I do of some random drive-by commenter who knows nothing of me or of this community.\nToday at Sigma Game, I asked women who had experience of raising, dating, or marrying Deltas\nto share their opinions\nconcerning some of the pros and cons of Delta males. I also specifically told men to not share their own opinions or experiences, but to limit themselves to commenting on what the women were saying.\nNeedless to say, there were a few Gammas who were too emotionally incontinent to restrain themselves and simply let the women talk. One, in particular, didn’t hesitate to ignore my directions and go right off the deep end.\nElwin Ransom:\nComments are interesting, but as I read them I can’t help feeling that many classifications by commenters are very likely skewed by perception and situational biases. I have long thought about a Myers-Briggs style test for SSH, but instead of just creating one and guessing what certain types will answer, thereby invoking the “this is what me the Alpha/Sigma would say” type response, a better proposal would be to create such a test, then administer it to a known set including all types, then correlate responses based on what the known set of answers. Hard part would be to find and agree upon the classification of the set of base answerees – but once complete, would be more quantitative way of self-assessment.\nMan of the Atom:\nWhat does your husband do?\n[Very long digression by a few commenters on why Man of the Atom, as a commenter, would attempt to keep the comments on track and on topic redacted.]\nElwin Ransom:\nHe’s providing an unasked-for service, anonymously, on a comment board on the internet. That makes him a loser. Not Gamma on your part, and no further contemplation required.\nVox Day:\nIt’s fascinating how the Gammas always identify themselves so quickly. Do you simply not have any idea how transparent all your little machinations are to everyone, ESPECIALLY women, who play those games much better than you do?\nMan of the Atom:\nYou still haven’t told us what your husband does.\nElwin Ransom:\nHe shuts the fuck up when no one asked for his opinion, that’s what he does.\nVox Day:\nYou didn’t. Why should he? Also, you’re permanently banned. I don’t wish to turn this into a no-Gammas zone, but it’s probably going to end up that way over time.\nBut wait, there’s more! Because of course there is. Within 11 minutes of my banning Mr. Ransom from Sigma Game, I received an email which led to the following exchange.\n“Elwin Ransom” (real name redacted)\n:\nThe commenter on your Sigma Game thread that you just banned was me. I have been a reader for close to two decades, and subscriber to both Castalia series since they started. No longer.\nVox Day:\nExcellent. You clearly learned nothing over those two decades. Your behavior was unwanted, disrespectful, vulgar, and you should be embarrassed for yourself. But you won’t be, because you’ll just fire up your Gamma delusion bubble and convince yourself that you were justified. We’ll be pleased to refund you for any books you haven’t received yet. Just email [the usual address] to make the request.\nSo, for those who didn’t subscribe early enough, if it turns out there is an extra Thucydides, we’ll let you know.\nDISCUSS ON SG",
  "tags": [
    "Castalia Library",
    "Gamma",
    "Sigma Game",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-20T01:39:22+00:00"
}