{
  "url": "https://voxday.net/2024/03/02/honeypot-or-genuine-alt-tech/",
  "scraped_at": "2026-01-08T14:25:50.751434",
  "title": "Honeypot or Genuine Alt-Tech",
  "date_display": "March 2, 2024",
  "date_iso": "2024-03-02T12:05:10+00:00",
  "date_from_url": "2024-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I support Andrew Torba and what he’s trying to do with Gab Social and Gab AI, and I particularly support his latest move to reduce the amount of resources that freeloaders are permitted to burn, but I don’t have perfect knowledge of him or the situation. And I definitely have made mistakes about people who later turned out to be infiltrators, gatekeepers, or bad actors, so in the interest of contemplating the essential truth of the matter, I’m linking to two articles about Gab that are polar opposites, one dedicated to attacking Torba, the other by Torba himself explaining his recent actions.</p><p>First is <a href=\"https://providencepost.com/torba-grift-of-gab/\">the hit piece</a>. While it is well-researched and most of the details appear to be accurate, there is nothing conclusive, it’s mostly guilt-by-association combined with an apparent lack of knowledge of how much it costs to run even what looks like a shoestring operation and make a living, especially when all the cheaper mainstream options cannot be used. And a similar approach could be just as easily used to “expose” me. His mother may be an astrology freak, but my father is a convicted felon. His brother may be gay, but mine died of a drug overdose. And the questionable nature of his past involvement with the Silicon Valley crowd can’t even begin to compare with my having been a Wax Trax! recording artist. Which is why I’m essentially dubious about the significance of the various red flags being waved:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Over the past decade, the United States, and to a great extent the entire world, have been in a growing state of censorship. Ideas that go against the accepted narrative are often removed from the internet and the creators of those ideas are persecuted as being “hateful” or purveyors of disinformation. Many major hubs of communication like Twitter, Facebook and Youtube have actively censored their platforms, particularly after the 2016 US Presidential Election primarily due to the rise of the Alt-Right movement. E-celebrities, content creators, and many of their followers found themselves banned from mainstream social media, which created a vacuum that was soon filled by vaporware sites and grifters whose profits lay in victimhood narratives and false hype, none of which are more notorious or egregious than Gab and its founder Andrew Torba.</p><p>Founded just months before the 2016 Presidential Election by self-described Silicon Valley conservative Andrew Torba, Gab touted itself as a censorship-free alternative to Twitter and was heavily promoted by the media before becoming associated with far-right extremism and hate after the 2018 Pittsburgh synagogue shooting. As of 2022, Gab has adopted a militant Christian nationalist bent and boasts of having an excess of one million “cumulative registered accounts” as well as having a value of $10 million, despite indisputable evidence to the contrary.</p><p>Since Gab’s inception, Torba has shapeshifted and rebranded himself many times in order to attract any group that would promote Gab and give him money. Over the course of Gab’s history, Torba has pandered to nearly every fringe online community on the right-wing spectrum; ranging from 4chan lolicon connoisseurs and edgelords to the QAnon and MAGA cults and beyond. If one looks past Torba’s conservative christian veneer they will find an affinity grifter who says and does everything in his power to keep the façade of Gab being a viable alternative to Twitter going and keep the money flowing. Torba relied on making misleading claims about the user base and utility of Gab in order to rip off millions of dollars from investors, many of whom he swindled using his conservative christian affinity grift.</p><p>Gab’s notoriety is mainly due to Torba fostering a drama producing environment on the site by not moderating terms of service violations like doxxing and threats of violence. Why does Torba purposefully leave some of the more unhinged elements of Gab unmoderated? What has Torba done to improve Gab with the millions of dollars he raised? What happened to those millions? Why hasn’t the SEC done anything about it? Does Gab’s seeming immunity from legal consequences and purposeful lack of moderation point to it being a honeypot, especially considering Torba’s frequent willingness to report his own users to the Feds?</p> <cite>Andrew Torba And The Grift Of Gab, THE PROVIDENCE POST, 15 March 2023</cite></blockquote><p>Second is Torba’s post made in the aftermath of the anti-freeloading policy that I personally believe to not only be justified, but long overdue for a business that has reportedly been running in the red on the Silicon Valley investment model for a long time. I even expressed my opinion on the matter in a meme posted on Gab this morning, of which Torba himself approved.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62037\" decoding=\"async\" fetchpriority=\"high\" height=\"287\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/03/image-1.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/03/image-1.png 512w, https://voxday.net/wp-content/uploads/2024/03/image-1-300x168.png 300w\" width=\"512\"/></figure></div><p><a href=\"https://gab.com/a/posts/112023815529535659\">Torba’s recent post</a>, at least to me, reads like that of a moderately successful entrepreneur who is simply doing whatever he needs to do to in order to keep the lights on his current operation in a moribund industry, even as he attempts to shift resources toward a more promising one in a new and growing industry.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Thank you to everyone who upgraded to GabPRO today. We had our single biggest revenue day for PRO since January 2021. Gab Social is well on its way to becoming sustainable longterm.</p><p>The past year has been very tough. As many of you noted we have been operating at a loss for a long time and that needed to change quickly.</p><p>The compounding problems of both storage space filling up and capital draining month to month had to be solved or Gab was going to die. We couldn’t let that happen and so drastic measures had to be taken to solve two problems at once. We also needed to do something big that would get the attention of everyone here so that all of us could be focused on solving these issues together.</p><p>There’s no other conspiracy here. That’s the simple truth of the matter. The advertising market tanked last year with the economy/inflation and it impacted us hard. We made significant cost cutting measures over the past year but it still wasn’t enough. Running a website as big as Gab costs a lot of money and there’s no way around that.</p><p>The team has started working on the storage issue and this change buys us a lot more time to handle it. We have been reading many of your suggestions and taking them into account.</p><p>We see that many of you are concerned about your identity which I totally understand as someone who has been dragged through the mud personally for 8 years now by the media, members of Congress, foreign governments, the ADL, the SPLC, and many more people. I’ve been”canceled” 100 times over. I get it.</p><p>That being said there are plenty of ways you can support us anonymously. The easiest way to do that is by sending physical mail to our mailing address with a money order, etc. We have a mail in check option on the GabPRO checkout flow. Just be sure to include your reference number and Gab username. You can get a money order at any post office and plenty of other places. You can also work with other Gabbers you trust who can gift you a PRO account.</p><p>I’m confident that Gab will emerge from this stronger than ever with a more united community.</p><p>We can’t do this alone anymore. We need your help if we are going to make this work longterm and I know that together we can get the job done and keep the one single place on the internet that allows free speech to stay online permanently.</p></blockquote><p>Those who haven’t been on the business end of a deplatforming, and haven’t been subjected to a full-bore media assault, have no idea how stressful it is or how it hardens those who have gone through those things without cracking. Assuming that Torba is not an actor or a honeypot, and the evidence presented is neither substantial nor convincing, I can assure you that Torba no longer cares one little bit about the opinions of those with the luxury to cling to their precious anonymity or those who think they know better than he does what it takes to keep Gab alive.</p><p>As every Castalia, Arkhaven, Infogalactic, and UATV subscriber knows, either you actively and materially support what you like or you don’t matter at all. Just as no army has any use for warriors who won’t fight, no business has any use for supporters who burn up its resources rather than contribute them. The reason Castalia House will be around when Tor Books goes out of business, and the reason UATV will be around when YouTube turns out the lights, is solely due to the strength and the commitment of this community. I do not say that lightly. It’s the literal truth.</p><p>If the Gab community is strong enough, and committed enough, and if Torba is genuinely the committed Christian Nationalist man he now presents himself as being, it will survive. If any of those three pieces are missing, it will not. In the meantime, and despite our well-known past differences, I wish him and his endeavors well.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a4778431-9b4e-463e-b4c2-4d25ed3e7992\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I support Andrew Torba and what he’s trying to do with Gab Social and Gab AI, and I particularly support his latest move to reduce the amount of resources that freeloaders are permitted to burn, but I don’t have perfect knowledge of him or the situation. And I definitely have made mistakes about people who later turned out to be infiltrators, gatekeepers, or bad actors, so in the interest of contemplating the essential truth of the matter, I’m linking to two articles about Gab that are polar opposites, one dedicated to attacking Torba, the other by Torba himself explaining his recent actions.\nFirst is\nthe hit piece\n. While it is well-researched and most of the details appear to be accurate, there is nothing conclusive, it’s mostly guilt-by-association combined with an apparent lack of knowledge of how much it costs to run even what looks like a shoestring operation and make a living, especially when all the cheaper mainstream options cannot be used. And a similar approach could be just as easily used to “expose” me. His mother may be an astrology freak, but my father is a convicted felon. His brother may be gay, but mine died of a drug overdose. And the questionable nature of his past involvement with the Silicon Valley crowd can’t even begin to compare with my having been a Wax Trax! recording artist. Which is why I’m essentially dubious about the significance of the various red flags being waved:\nOver the past decade, the United States, and to a great extent the entire world, have been in a growing state of censorship. Ideas that go against the accepted narrative are often removed from the internet and the creators of those ideas are persecuted as being “hateful” or purveyors of disinformation. Many major hubs of communication like Twitter, Facebook and Youtube have actively censored their platforms, particularly after the 2016 US Presidential Election primarily due to the rise of the Alt-Right movement. E-celebrities, content creators, and many of their followers found themselves banned from mainstream social media, which created a vacuum that was soon filled by vaporware sites and grifters whose profits lay in victimhood narratives and false hype, none of which are more notorious or egregious than Gab and its founder Andrew Torba.\nFounded just months before the 2016 Presidential Election by self-described Silicon Valley conservative Andrew Torba, Gab touted itself as a censorship-free alternative to Twitter and was heavily promoted by the media before becoming associated with far-right extremism and hate after the 2018 Pittsburgh synagogue shooting. As of 2022, Gab has adopted a militant Christian nationalist bent and boasts of having an excess of one million “cumulative registered accounts” as well as having a value of $10 million, despite indisputable evidence to the contrary.\nSince Gab’s inception, Torba has shapeshifted and rebranded himself many times in order to attract any group that would promote Gab and give him money. Over the course of Gab’s history, Torba has pandered to nearly every fringe online community on the right-wing spectrum; ranging from 4chan lolicon connoisseurs and edgelords to the QAnon and MAGA cults and beyond. If one looks past Torba’s conservative christian veneer they will find an affinity grifter who says and does everything in his power to keep the façade of Gab being a viable alternative to Twitter going and keep the money flowing. Torba relied on making misleading claims about the user base and utility of Gab in order to rip off millions of dollars from investors, many of whom he swindled using his conservative christian affinity grift.\nGab’s notoriety is mainly due to Torba fostering a drama producing environment on the site by not moderating terms of service violations like doxxing and threats of violence. Why does Torba purposefully leave some of the more unhinged elements of Gab unmoderated? What has Torba done to improve Gab with the millions of dollars he raised? What happened to those millions? Why hasn’t the SEC done anything about it? Does Gab’s seeming immunity from legal consequences and purposeful lack of moderation point to it being a honeypot, especially considering Torba’s frequent willingness to report his own users to the Feds?\nAndrew Torba And The Grift Of Gab, THE PROVIDENCE POST, 15 March 2023\nSecond is Torba’s post made in the aftermath of the anti-freeloading policy that I personally believe to not only be justified, but long overdue for a business that has reportedly been running in the red on the Silicon Valley investment model for a long time. I even expressed my opinion on the matter in a meme posted on Gab this morning, of which Torba himself approved.\nTorba’s recent post\n, at least to me, reads like that of a moderately successful entrepreneur who is simply doing whatever he needs to do to in order to keep the lights on his current operation in a moribund industry, even as he attempts to shift resources toward a more promising one in a new and growing industry.\nThank you to everyone who upgraded to GabPRO today. We had our single biggest revenue day for PRO since January 2021. Gab Social is well on its way to becoming sustainable longterm.\nThe past year has been very tough. As many of you noted we have been operating at a loss for a long time and that needed to change quickly.\nThe compounding problems of both storage space filling up and capital draining month to month had to be solved or Gab was going to die. We couldn’t let that happen and so drastic measures had to be taken to solve two problems at once. We also needed to do something big that would get the attention of everyone here so that all of us could be focused on solving these issues together.\nThere’s no other conspiracy here. That’s the simple truth of the matter. The advertising market tanked last year with the economy/inflation and it impacted us hard. We made significant cost cutting measures over the past year but it still wasn’t enough. Running a website as big as Gab costs a lot of money and there’s no way around that.\nThe team has started working on the storage issue and this change buys us a lot more time to handle it. We have been reading many of your suggestions and taking them into account.\nWe see that many of you are concerned about your identity which I totally understand as someone who has been dragged through the mud personally for 8 years now by the media, members of Congress, foreign governments, the ADL, the SPLC, and many more people. I’ve been”canceled” 100 times over. I get it.\nThat being said there are plenty of ways you can support us anonymously. The easiest way to do that is by sending physical mail to our mailing address with a money order, etc. We have a mail in check option on the GabPRO checkout flow. Just be sure to include your reference number and Gab username. You can get a money order at any post office and plenty of other places. You can also work with other Gabbers you trust who can gift you a PRO account.\nI’m confident that Gab will emerge from this stronger than ever with a more united community.\nWe can’t do this alone anymore. We need your help if we are going to make this work longterm and I know that together we can get the job done and keep the one single place on the internet that allows free speech to stay online permanently.\nThose who haven’t been on the business end of a deplatforming, and haven’t been subjected to a full-bore media assault, have no idea how stressful it is or how it hardens those who have gone through those things without cracking. Assuming that Torba is not an actor or a honeypot, and the evidence presented is neither substantial nor convincing, I can assure you that Torba no longer cares one little bit about the opinions of those with the luxury to cling to their precious anonymity or those who think they know better than he does what it takes to keep Gab alive.\nAs every Castalia, Arkhaven, Infogalactic, and UATV subscriber knows, either you actively and materially support what you like or you don’t matter at all. Just as no army has any use for warriors who won’t fight, no business has any use for supporters who burn up its resources rather than contribute them. The reason Castalia House will be around when Tor Books goes out of business, and the reason UATV will be around when YouTube turns out the lights, is solely due to the strength and the commitment of this community. I do not say that lightly. It’s the literal truth.\nIf the Gab community is strong enough, and committed enough, and if Torba is genuinely the committed Christian Nationalist man he now presents himself as being, it will survive. If any of those three pieces are missing, it will not. In the meantime, and despite our well-known past differences, I wish him and his endeavors well.\nDISCUSS ON SG",
  "tags": [
    "#AltTech",
    "conspiracy",
    "corpocracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-02T12:05:12+00:00"
}