{
  "url": "https://voxday.net/2024/03/02/just-1-thing/",
  "scraped_at": "2026-01-08T14:25:54.450933",
  "title": "Just 1 Thing",
  "date_display": "March 2, 2024",
  "date_iso": "2024-03-02T18:46:19+00:00",
  "date_from_url": "2024-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People have finally figured out that you cannot allow SJWs one single thing and you need to eject them as soon as they show themselves if you want to keep your community intact and functioning.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>My friend got perma banned from the discord without a warning when all bro did was ask if theres a chance they will add a Igbtq cape or background. Dude was perma banned and even got a death threat in his dms. I get it that a lot of ppl that play this game are COD fanboys from shroud and summitlgs fanbase but dude it is pathetic how toxic this community is.</p><p>All he asked was to add in 1 thing and for some reason everyone thinks theyre gonna cater to Igbtq ppi or somehow its gonna turn into politics.</p><p>People just think adding 1 thing will completely ruin the game and end the world lol I dont get it and how its gonna seperate us from being united, its not that deep lol it is 1 thing which is a rainbow flag they already got loads of other capes of different colors I dont see how adding 1 rainbow cape is gonna ruin everything, like womp womp if you believe that.</p></blockquote><p>In his book <em>Liberal Fascism</em>, Jonah Goldberg described this as the “just one brick” strategy. First you allow them one brick, then you allow them another, and before you know it, they’ve walled you out. Never show any mercy to SJWs. Never provide any leeway or second chances to SJW infiltrators. As the mods of this game discord rightly demonstrated, you eject them for showing even the smallest sign of SJW.</p><p>This is especially important if your organization has any women in it. Women are kind-hearted and they always want to give bad actors second, third, and fourth chances. Which is why they tend to make very bad prison guards, border patrol officers, and community moderators.</p><p>Don’t hesitate. Don’t overthink it. Don’t attempt to balance the good against the bad. Just hit the eject button. And then hit it again to eject everyone who said you shouldn’t have hit it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c2d38b7b-8be7-45ec-a5ff-75ec0d952803\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "People have finally figured out that you cannot allow SJWs one single thing and you need to eject them as soon as they show themselves if you want to keep your community intact and functioning.\nMy friend got perma banned from the discord without a warning when all bro did was ask if theres a chance they will add a Igbtq cape or background. Dude was perma banned and even got a death threat in his dms. I get it that a lot of ppl that play this game are COD fanboys from shroud and summitlgs fanbase but dude it is pathetic how toxic this community is.\nAll he asked was to add in 1 thing and for some reason everyone thinks theyre gonna cater to Igbtq ppi or somehow its gonna turn into politics.\nPeople just think adding 1 thing will completely ruin the game and end the world lol I dont get it and how its gonna seperate us from being united, its not that deep lol it is 1 thing which is a rainbow flag they already got loads of other capes of different colors I dont see how adding 1 rainbow cape is gonna ruin everything, like womp womp if you believe that.\nIn his book\nLiberal Fascism\n, Jonah Goldberg described this as the “just one brick” strategy. First you allow them one brick, then you allow them another, and before you know it, they’ve walled you out. Never show any mercy to SJWs. Never provide any leeway or second chances to SJW infiltrators. As the mods of this game discord rightly demonstrated, you eject them for showing even the smallest sign of SJW.\nThis is especially important if your organization has any women in it. Women are kind-hearted and they always want to give bad actors second, third, and fourth chances. Which is why they tend to make very bad prison guards, border patrol officers, and community moderators.\nDon’t hesitate. Don’t overthink it. Don’t attempt to balance the good against the bad. Just hit the eject button. And then hit it again to eject everyone who said you shouldn’t have hit it.\nDISCUSS ON SG",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-02T18:46:21+00:00"
}