{
  "url": "https://voxday.net/2024/03/17/razorfist-on-kindle/",
  "scraped_at": "2026-01-08T14:27:14.393019",
  "title": "RazörFist on Kindle",
  "date_display": "March 17, 2024",
  "date_iso": "2024-03-17T19:13:00+00:00",
  "date_from_url": "2024-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.amazon.com/gp/product/B0CY9KR958\"><img alt=\"\" class=\"wp-image-62233\" decoding=\"async\" fetchpriority=\"high\" height=\"300\" sizes=\"(max-width: 401px) 100vw, 401px\" src=\"https://voxday.net/wp-content/uploads/2024/03/image-31.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/03/image-31.png 401w, https://voxday.net/wp-content/uploads/2024/03/image-31-300x224.png 300w\" width=\"401\"/></a></figure></div><p><em>MENUVIA</em></p><p><em>A sparkling gem made rough stone, the seat of political power in the Kingdom of Vale. Revolt foments among the patrician class and open gang war looms on the horizon. As the Argentine Tower plots revolution, a lone thief with a past as dark as Menuvia itself picks the wrong lock and opens the wrong door. Shadows still cast in the dark of night, underneath the long moonlight…</em></p><p><em>An original illustrated fantasy series by RazörFist</em></p><p>Now that Amazon has restored Castalia’s Kindle account, <a href=\"https://www.amazon.com/gp/product/B0CY9KR958\">the two books of his NIGHTVALE series</a>, <em>The Long Moonlight</em> and <em>Death Mask</em>, are both available on Kindle. And we’ll have an announcement about our next publishing collaboration with the Shaded Poet of the Unauthorized coming soon.</p><p>While <a href=\"https://www.amazon.com/dp/B0CVDSF177\">the <em>ARTS OF DARK AND LIGHT</em> series</a> is also available on Kindle, <em>the CASTALIA JUNIOR CLASSICS</em> will not be. For some arcane reason known only to the Kindle Content Review committee, of the first three books in the series, only <em>Myths &amp; Legends</em> passed muster on the second try. We did, however, receive the good news that <em>The Nature of Ethics: Defining Ethics, Good &amp; Evil</em>, a book we don’t publish and did not submit to KDP, had been accepted for publication, so in light of these various and confusing factors, we decided to simply limit the availability of the Junior Classics on Amazon to the hardcover editions.</p><p><em><a href=\"https://social.infogalactic.com/micropost/37647261-4910-4fd7-ab31-20f2e1fb3624\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "MENUVIA\nA sparkling gem made rough stone, the seat of political power in the Kingdom of Vale. Revolt foments among the patrician class and open gang war looms on the horizon. As the Argentine Tower plots revolution, a lone thief with a past as dark as Menuvia itself picks the wrong lock and opens the wrong door. Shadows still cast in the dark of night, underneath the long moonlight…\nAn original illustrated fantasy series by RazörFist\nNow that Amazon has restored Castalia’s Kindle account,\nthe two books of his NIGHTVALE series\n,\nThe Long Moonlight\nand\nDeath Mask\n, are both available on Kindle. And we’ll have an announcement about our next publishing collaboration with the Shaded Poet of the Unauthorized coming soon.\nWhile\nthe\nARTS OF DARK AND LIGHT\nseries\nis also available on Kindle,\nthe CASTALIA JUNIOR CLASSICS\nwill not be. For some arcane reason known only to the Kindle Content Review committee, of the first three books in the series, only\nMyths & Legends\npassed muster on the second try. We did, however, receive the good news that\nThe Nature of Ethics: Defining Ethics, Good & Evil\n, a book we don’t publish and did not submit to KDP, had been accepted for publication, so in light of these various and confusing factors, we decided to simply limit the availability of the Junior Classics on Amazon to the hardcover editions.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-17T19:13:00+00:00"
}