{
  "url": "https://voxday.net/2024/03/12/remember-theyre-the-bad-guys/",
  "scraped_at": "2026-01-08T14:26:46.865603",
  "title": "Remember, THEY’RE the Bad Guys",
  "date_display": "March 12, 2024",
  "date_iso": "2024-03-12T10:28:14+00:00",
  "date_from_url": "2024-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re supposed to believe that the Russians are the bad guys because a vaccinated CIA agent died of a heart attack after returning to Russia of his own volition and being imprisoned for some obvious crimes. Meanwhile, every civilian in the USA who exposes the wrongdoing of a politician, a corporation, or a government agency ends up conveniently “committing suicide” right before <a href=\"https://www.msn.com/en-us/news/politics/boeing-whistleblower-found-dead-in-apparent-suicide/ar-BB1jJ6FH?OCID=ansmsnnews11\">they’re scheduled to testify</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A prominent Boeing whistleblower who reported on safety and quality control concerns in the company’s production line was found dead Saturday, according to South Carolina authorities. John Barnett, 62, died of an apparent self-inflicted wound on Friday, the Charleston County Coroner’s office said. He was found in his truck at his hotel’s parking lot.</p><p>A 32-year veteran of Boeing, Barnett’s 2019 whistleblower allegations claimed that overworked employees at its South Carolina plant frequently fitted substandard parts on planes and reported faulty oxygen systems that could result in as many as 1 in 4 oxygen masks not operating properly.</p><p>Boeing denied Barnett’s claims, but a follow-up investigation by the Federal Aviation Administration lent credence to some aspects of his allegations. A report found that more than 50 “non-conforming” parts were unable to be traced and were lost in the company’s system. Barnett was in Charleston to be questioned for a long-running retaliation suit against the company.</p><p>His death comes as Boeing is under increased regulatory scrutiny for its 737 Max aircraft manufacturing process after a door blew out of a flight midair in January. The incident launched a widespread investigation into Boeing manufacturing, discovering lax quality control.</p></blockquote><p>It’s not only impossible to believe anything one reads in the Clown World media anymore, it’s hard to believe we were ever dumb enough, and naive enough, to believe what they were reporting 30 years ago. It’s not like this is a new phenomenon; while Frank Pentageli did actually commit suicide at the behest of the Corleones in <em>The Godfather 2</em>, the fact that the story from 1974 showed how he was under ineffective FBI protection makes it clear that these attacks on witnesses have been around for decades.</p><p><em><a href=\"https://social.infogalactic.com/micropost/ab915b0c-5d90-423f-83f4-85516c06e24c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We’re supposed to believe that the Russians are the bad guys because a vaccinated CIA agent died of a heart attack after returning to Russia of his own volition and being imprisoned for some obvious crimes. Meanwhile, every civilian in the USA who exposes the wrongdoing of a politician, a corporation, or a government agency ends up conveniently “committing suicide” right before\nthey’re scheduled to testify\n.\nA prominent Boeing whistleblower who reported on safety and quality control concerns in the company’s production line was found dead Saturday, according to South Carolina authorities. John Barnett, 62, died of an apparent self-inflicted wound on Friday, the Charleston County Coroner’s office said. He was found in his truck at his hotel’s parking lot.\nA 32-year veteran of Boeing, Barnett’s 2019 whistleblower allegations claimed that overworked employees at its South Carolina plant frequently fitted substandard parts on planes and reported faulty oxygen systems that could result in as many as 1 in 4 oxygen masks not operating properly.\nBoeing denied Barnett’s claims, but a follow-up investigation by the Federal Aviation Administration lent credence to some aspects of his allegations. A report found that more than 50 “non-conforming” parts were unable to be traced and were lost in the company’s system. Barnett was in Charleston to be questioned for a long-running retaliation suit against the company.\nHis death comes as Boeing is under increased regulatory scrutiny for its 737 Max aircraft manufacturing process after a door blew out of a flight midair in January. The incident launched a widespread investigation into Boeing manufacturing, discovering lax quality control.\nIt’s not only impossible to believe anything one reads in the Clown World media anymore, it’s hard to believe we were ever dumb enough, and naive enough, to believe what they were reporting 30 years ago. It’s not like this is a new phenomenon; while Frank Pentageli did actually commit suicide at the behest of the Corleones in\nThe Godfather 2\n, the fact that the story from 1974 showed how he was under ineffective FBI protection makes it clear that these attacks on witnesses have been around for decades.\nDISCUSS ON SG",
  "tags": [
    "Fake News",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-12T10:28:16+00:00"
}