{
  "url": "https://voxday.net/2024/03/17/tell-me-youre-low-status/",
  "scraped_at": "2026-01-08T14:27:11.096624",
  "title": "Tell Me You’re Low Status",
  "date_display": "March 17, 2024",
  "date_iso": "2024-03-17T01:09:43+00:00",
  "date_from_url": "2024-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Without actually telling me you’re low status. The Educated Hillbilly <a href=\"https://threadreaderapp.com/thread/1669374000328220672.html\">attempts to psychoanalyze</a> a bitter success:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Imagine knowing you’re better than everyone else &amp; having to share a school bus with them. A lunch table. A class room. The rage builds for 18 years.</p></blockquote><p>This idea has never made any sense to me. What sort of person is <em>angry </em>about their own perceived self-superiority? I’ve never seen a woman who knows she is prettier than everyone else being angry about it. She’s perhaps a little standoffish due to being preemptively labelled a bitch or worse by all the women on the mere basis of her appearance, but she isn’t angry. I’ve never known anyone who is genuinely smarter than everyone else being angry about having to put up with the relentless retardery that is necessitated by human contact, it’s just a quotidian reality that has to be endured with stoicism lest one slip into existential despair.</p><p>What athlete is angry about being forced to compete on the athletic field with his sporting inferiors? Isn’t that the whole point of winning? So, who imagines that intrinsic superiority is a source of <em>anger</em>?</p><p>The answer, of course, is the gamma male. Now, this is not to say that the Educated Hillbilly is a gamma male now, but the evidence suggests that he may have been in his youth. Perhaps he has graduated to delta, perhaps he is still a gamma, it really makes no difference because this isn’t about him, but rather, his diagnosis of the Columbia professor.</p><p>Now, I was fortunate in my choice to attend an elite Ivy League reject school rather than an Ivy, which is why I a) actually had a good time in college and b) remain capable of meeting people without informing them of where I received my university education in the first thirty seconds of conversation. While in retrospect I would have done better to attend either a) Stanford or b) Arizona State, it was a reasonable, if suboptimal, decision. However, even at an Ivy reject school, there was a fair amount of the “ex nihilo” population, most of whom had one chip or another on their shoulder about their backgrounds, and all of whom were varying degrees of bitter about not getting into their top choice of schools. Some, like my freshman year roommate, were defensively proud of their deprived backgrounds, others went in the opposite direction and began speaking like characters out of Monte Python and dressing like characters out of PG Wodehouse.</p><p>The professoressa in question was clearly more inclined to the latter, although not so much so that she invented a new and more impressive family history for herself in preference to the real one. Instead, she tries to ingratiate herself into her new and preferred surroundings by expressing her disdain for her humble background in a way that will no more impress the New York Brahmins than a pencil-neck dork talking down Aaron Rodgers will impress the jocks.</p><p>What drives this woman is not anger, but rather insecurity, combined with a very reasonable feeling of betrayal. First, her insecurity about her own superiority; if she was that confident in it, she wouldn’t have feared her potential inability to escape her original surroundings or being mistaken in any way for being one of those inferior beings. Second, her well-placed insecurity about her place in her new surroundings; she will never be a high-status WASP, Jew, or media celebrity, no matter how many academic credentials she collects.</p><p><em>A credential is piece of paper that aspirational failures are awarded as participation trophies in lieu of genuine accomplishments.</em></p><p>All of her complaints and ever-more-elaborate fictions serve no purpose except to remind her betters that she is not, and never will be, one of them. She would have done much better to never, ever, speak of her unfortunate roots; then she might, possibly, have had a chance of passing, at least among those who met her later in life. <em>The Great Gatsby</em> addresses this very subject; F. Scott Fitzgerald’s entire life and his literary career were shaped by his love-hate relationship with his Midwestern background and his failure to graduate from Princeton.</p><p><em><a href=\"https://social.infogalactic.com/micropost/fbfd32a2-7aa7-45f9-b66c-a12605c097f0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Without actually telling me you’re low status. The Educated Hillbilly\nattempts to psychoanalyze\na bitter success:\nImagine knowing you’re better than everyone else & having to share a school bus with them. A lunch table. A class room. The rage builds for 18 years.\nThis idea has never made any sense to me. What sort of person is\nangry\nabout their own perceived self-superiority? I’ve never seen a woman who knows she is prettier than everyone else being angry about it. She’s perhaps a little standoffish due to being preemptively labelled a bitch or worse by all the women on the mere basis of her appearance, but she isn’t angry. I’ve never known anyone who is genuinely smarter than everyone else being angry about having to put up with the relentless retardery that is necessitated by human contact, it’s just a quotidian reality that has to be endured with stoicism lest one slip into existential despair.\nWhat athlete is angry about being forced to compete on the athletic field with his sporting inferiors? Isn’t that the whole point of winning? So, who imagines that intrinsic superiority is a source of\nanger\n?\nThe answer, of course, is the gamma male. Now, this is not to say that the Educated Hillbilly is a gamma male now, but the evidence suggests that he may have been in his youth. Perhaps he has graduated to delta, perhaps he is still a gamma, it really makes no difference because this isn’t about him, but rather, his diagnosis of the Columbia professor.\nNow, I was fortunate in my choice to attend an elite Ivy League reject school rather than an Ivy, which is why I a) actually had a good time in college and b) remain capable of meeting people without informing them of where I received my university education in the first thirty seconds of conversation. While in retrospect I would have done better to attend either a) Stanford or b) Arizona State, it was a reasonable, if suboptimal, decision. However, even at an Ivy reject school, there was a fair amount of the “ex nihilo” population, most of whom had one chip or another on their shoulder about their backgrounds, and all of whom were varying degrees of bitter about not getting into their top choice of schools. Some, like my freshman year roommate, were defensively proud of their deprived backgrounds, others went in the opposite direction and began speaking like characters out of Monte Python and dressing like characters out of PG Wodehouse.\nThe professoressa in question was clearly more inclined to the latter, although not so much so that she invented a new and more impressive family history for herself in preference to the real one. Instead, she tries to ingratiate herself into her new and preferred surroundings by expressing her disdain for her humble background in a way that will no more impress the New York Brahmins than a pencil-neck dork talking down Aaron Rodgers will impress the jocks.\nWhat drives this woman is not anger, but rather insecurity, combined with a very reasonable feeling of betrayal. First, her insecurity about her own superiority; if she was that confident in it, she wouldn’t have feared her potential inability to escape her original surroundings or being mistaken in any way for being one of those inferior beings. Second, her well-placed insecurity about her place in her new surroundings; she will never be a high-status WASP, Jew, or media celebrity, no matter how many academic credentials she collects.\nA credential is piece of paper that aspirational failures are awarded as participation trophies in lieu of genuine accomplishments.\nAll of her complaints and ever-more-elaborate fictions serve no purpose except to remind her betters that she is not, and never will be, one of them. She would have done much better to never, ever, speak of her unfortunate roots; then she might, possibly, have had a chance of passing, at least among those who met her later in life.\nThe Great Gatsby\naddresses this very subject; F. Scott Fitzgerald’s entire life and his literary career were shaped by his love-hate relationship with his Midwestern background and his failure to graduate from Princeton.\nDISCUSS ON SG",
  "tags": [
    "education",
    "media",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-17T01:09:44+00:00"
}