{
  "url": "https://voxday.net/2024/03/09/the-roots-of-gamergate-2-0/",
  "scraped_at": "2026-01-08T14:26:32.452912",
  "title": "The Roots of GamerGate 2.0",
  "date_display": "March 9, 2024",
  "date_iso": "2024-03-09T18:14:52+00:00",
  "date_from_url": "2024-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dark Herald delves into <a href=\"https://arkhavencomics.com/2024/03/09/sweet-baby-cyanide/\">the latest iteration of GamerGate</a> at the Arkhaven blog:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It all began with GamerGate.</p><p>Well, no it didn’t. It began with decisions that the editors of PC gaming magazines made.</p><p>Back in the 1990s I had a subscription to Computer Gaming World. It was a don’t miss back then. Given what the internet was like at the time, a print magazine was an absolute necessity. At least if you were going to find out if Master of Orion II was anywhere near as good as the first game, (BTW, it was better). Is the full version Redneck Rampage as difficult to run as the share-ware? (Yes, definitely). Or is John Romero really going to make you, his bitch? (No, he wasn’t.) You would also get interviews with people like Roberta Williams and Richard Garriott. Plus, you would find out which conventions were going to have the best computer gaming room. (It mattered in those days because it might be the only place you could play some titles if your friends didn’t have a copy.)</p><p>Here’s the big thing. There was a real sense of community back then and gaming magazines were the glue that was holding us together. The guys that wrote those articles were part of our tribe. They spoke our language, shared our concerns, and agreed with us on what was cool.</p><p>The gaming magazines were huge and I don’t just mean within gaming culture. They were physically gigantic. There was a point where CGW had 500 pages. That was where the trouble began.</p><p>When you have that many pages, you need to fill them with something. The editors of gaming magazines had run into a problem there. They could hire more gamers and teach them how to write, a longer process to be sure but in the end, you would have more in-depth articles by people who know and love gaming. However, given how fast the gaming magazines were growing and how much original content they needed month to month, a shortcut beckoned siren-like to the editors.</p><p>There was always a pile of resumes from journalism majors who were shotgunning any publication in the hopes of landing a gig. They knew absolutely nothing about gaming, but they did know how to write, (sort of, they were journalism majors after all). The view clearly was, just give them something easy to play until we can find someone better.</p><p>So, the editors started hiring journalism majors as a temporary shortcut. The kind of temporary shortcut that stays forever. Journalism majors could write about games, but they didn’t love them. They didn’t care at all about game mechanics, what they had a passion for was narrative story structure and pretty, pretty pictures. So long as a game had those it would get a ten-star review even if the gameplay sucked.</p><p>It was obvious that these journalism majors were setting the game difficulty on Toddler Mode and playing through as fast as possible. They wanted to experience the narrative with as little interruption by gameplay as could be managed.</p><p>This temporary fix stuck around. The journalists got promoted. Then the magazines started getting bought by media conglomerates like Ziff Davis, who definitely preferred to work with journalists. Consequently, the gamers at the gaming magazines got shunted to the side and the journalists started making the hiring decisions. Guess who they hired?</p><p>You guessed right. Other journalists.</p></blockquote><p>Most readers here know of my involvement in GamerGate, including the hosting of #GGinParis with Mike and Milo. But I was much more deeply involved with game journalism starting more than 20 years before the exposure of the GameJournoPros list.</p><p><em>Computer Game World</em> was arguably one of the greatest magazines in publishing history. I read it from cover to cover, carefully taking notes as to who did what and worked for which company, to the point that when I started attending industry events, I could speak substantively to pretty much anyone of note that I met.</p><p>I eventually started writing for them, had one of our games reviewed by them, and even contributed by writing the initial review for the much-anticipated id-and-Raven game <em>Heretic</em>. In fact, I was the only game developer who was permitted to write for them, for as Editor-in-Chief Johnny Wilson once said, correctly, “Vox would rather cut his arm off than cut a bad game any slack.” Johnny was eventually replaced by Chris Lombardi, who was also excellent and possessed of a formidable intelligence, but once Ziff Davis bought them and Chris was hired away by one of the early gaming networks, the quality declined rapidly, to the point that I no longer even bothered subscribing even though I was a game developer.</p><p>So, I can state with some authority that it’s a good history. Read the whole thing there.</p><p><em><a href=\"https://social.infogalactic.com/micropost/ce2f2d83-10a9-4026-8390-205a8f098a68\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Dark Herald delves into\nthe latest iteration of GamerGate\nat the Arkhaven blog:\nIt all began with GamerGate.\nWell, no it didn’t. It began with decisions that the editors of PC gaming magazines made.\nBack in the 1990s I had a subscription to Computer Gaming World. It was a don’t miss back then. Given what the internet was like at the time, a print magazine was an absolute necessity. At least if you were going to find out if Master of Orion II was anywhere near as good as the first game, (BTW, it was better). Is the full version Redneck Rampage as difficult to run as the share-ware? (Yes, definitely). Or is John Romero really going to make you, his bitch? (No, he wasn’t.) You would also get interviews with people like Roberta Williams and Richard Garriott. Plus, you would find out which conventions were going to have the best computer gaming room. (It mattered in those days because it might be the only place you could play some titles if your friends didn’t have a copy.)\nHere’s the big thing. There was a real sense of community back then and gaming magazines were the glue that was holding us together. The guys that wrote those articles were part of our tribe. They spoke our language, shared our concerns, and agreed with us on what was cool.\nThe gaming magazines were huge and I don’t just mean within gaming culture. They were physically gigantic. There was a point where CGW had 500 pages. That was where the trouble began.\nWhen you have that many pages, you need to fill them with something. The editors of gaming magazines had run into a problem there. They could hire more gamers and teach them how to write, a longer process to be sure but in the end, you would have more in-depth articles by people who know and love gaming. However, given how fast the gaming magazines were growing and how much original content they needed month to month, a shortcut beckoned siren-like to the editors.\nThere was always a pile of resumes from journalism majors who were shotgunning any publication in the hopes of landing a gig. They knew absolutely nothing about gaming, but they did know how to write, (sort of, they were journalism majors after all). The view clearly was, just give them something easy to play until we can find someone better.\nSo, the editors started hiring journalism majors as a temporary shortcut. The kind of temporary shortcut that stays forever. Journalism majors could write about games, but they didn’t love them. They didn’t care at all about game mechanics, what they had a passion for was narrative story structure and pretty, pretty pictures. So long as a game had those it would get a ten-star review even if the gameplay sucked.\nIt was obvious that these journalism majors were setting the game difficulty on Toddler Mode and playing through as fast as possible. They wanted to experience the narrative with as little interruption by gameplay as could be managed.\nThis temporary fix stuck around. The journalists got promoted. Then the magazines started getting bought by media conglomerates like Ziff Davis, who definitely preferred to work with journalists. Consequently, the gamers at the gaming magazines got shunted to the side and the journalists started making the hiring decisions. Guess who they hired?\nYou guessed right. Other journalists.\nMost readers here know of my involvement in GamerGate, including the hosting of #GGinParis with Mike and Milo. But I was much more deeply involved with game journalism starting more than 20 years before the exposure of the GameJournoPros list.\nComputer Game World\nwas arguably one of the greatest magazines in publishing history. I read it from cover to cover, carefully taking notes as to who did what and worked for which company, to the point that when I started attending industry events, I could speak substantively to pretty much anyone of note that I met.\nI eventually started writing for them, had one of our games reviewed by them, and even contributed by writing the initial review for the much-anticipated id-and-Raven game\nHeretic\n. In fact, I was the only game developer who was permitted to write for them, for as Editor-in-Chief Johnny Wilson once said, correctly, “Vox would rather cut his arm off than cut a bad game any slack.” Johnny was eventually replaced by Chris Lombardi, who was also excellent and possessed of a formidable intelligence, but once Ziff Davis bought them and Chris was hired away by one of the early gaming networks, the quality declined rapidly, to the point that I no longer even bothered subscribing even though I was a game developer.\nSo, I can state with some authority that it’s a good history. Read the whole thing there.\nDISCUSS ON SG",
  "tags": [
    "#GamerGate",
    "games",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-09T18:16:14+00:00"
}