{
  "url": "https://voxday.net/2024/03/14/the-end-of-liberalism-2/",
  "scraped_at": "2026-01-08T14:26:56.723080",
  "title": "The End of Liberalism",
  "date_display": "March 14, 2024",
  "date_iso": "2024-03-14T12:47:39+00:00",
  "date_from_url": "2024-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The satanic seeds of the Enlightenment have finally blossomed to the point that they are killing entire nations. We’ve already learned, much to our surprise, that Communism is less fatal to a nation than the financial capitalism, neo-liberalism, and globalism of Clown World, now we’re discovering that even the insane ideology of the Juche, the state ideology of North Korea, <a href=\"https://www.youtube.com/watch?v=01LBdVBNlyI\">is observably better for a nation</a> than the best that the modern West has to offer.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>I think it’s so funny that Korean women are so done with Korean men that they’re literally just deciding to die out. Y’all heard of the 4B movement. I’m a big fan. The 4B movement stands for these four things. It’s basically Korean feminism which is cheaper and more efficient. </em></p><p>The 4B movement initially gained recognition on Twitter in 2019 because of course it did, through various feminist social media accounts and they are focused on envisioning a future without men because of course they are.  The cornerstone of feminism is that everything is oppressive. The 4B movement had an Escape the Corset movement. The word corset is used here for the societal mechanisms that bind and repress women like toxic beauty standards. Just like in Western feminism, toxic means anything I don’t like. I need all of this from you but you need something from me, that’s toxic. Korean women literally just gave up on their men they’re like, they’re not going to change so we’re all going to go extinct.</p><p>That’s where she’s wrong. She says that Korean women are mad at Korean men, but they’re actually mad at God, and if you don’t like that word, just call it the universe or physics or whatever, it’s the same thing. This is a hierarchy of creation, it goes from God or the universe all the way down through man to woman to child to the natural world and all the way back up.  It goes both ways. Basically the universe just is the way it is, you can’t get rid of gravity and men have to deal with that directly and build things from it, and we also give approval and attention and validation to women, who then provide nurturing to communities and children. Their role is to be the learners and they provide creativity and new ways in developing new things to do with the natural world, which is howwe get new things like the internet or different types of cheese or whatever, but in the same way that man cannot simply ignore the rules of gravity, women cannot simply ignore what men need from them either, otherwise we can’t do our jobs, that’s just how reality works.</p><p>S what these women are saying is I want resources and money and power and everything, I just don’t want to provide men with what they need in order to continue creating them. Usually what keeps this whole thing going is that men provide women with approval, attention, and validation, so basically if men don’t follow the rules of the universe, then they don’t get what they need from the universe. That’s just physically how life works, you need to know when to plant seeds and stuff, and usually when women don’t follow the rules made by men, and give men what they need, then men don’t provide women with what they need in return.</p><p>But now women have these cellphones that are providing them with all of this approval, attention, and validation, which makes them think “I don’t need men anymore” even though men are still making all the stuff, so because women are no longer providing this men are no longer providing that, which means no one can have any of these things and women are saying “okay we’d rather die”. that’s what quotes like this mean.</p><p>Rebellion is as the sin of Witchcraft because you have rejected the word of the Lord, He has also rejected you from being King. That means if you don’t do as the universe demands then you’re not going to get anything from it. So man has to build society according to the rules of reality and women have to fit into society according to the rules of society, and then children have get good grades or they don’t get the ice cream or whatever. It works the sameway. The Bible uses that word a lot, <em>rebellious</em>, and what that means is “I want the benefits but I’m not going to follow the rules,” that’s why this argument is so important. “I want you to provide me with things but I’m not going to provide anything back.”</p><p>Imagine if you were saying “I want food to grow, I’m just not going to do any farming,” that’s what this is illustrating. If you don’t do what you have to then you don’t get anything back, and if you don’t provide men with what they need in order to make food and fix buildings and stuff, then they’re not going to give you any of those things and then everyone die. I’m not saying that men don’t have work to do, I don’t know what’s going on in Korea, maybe the corset is too tight, maybe men need to start providing something new, but if it’s anything like American feminism, it’s probably all get-get-get and never “where are we getting this from” and every time you break that chain you just die off, which they literally are, by the way.</p><p>Korea has the lowest birthrates in the world but I just think that’s so funny… Korean as an ethnicity is about to go away. It works the same every time you fill your mind with entitlement, you blame somebody for what you don’t have, and then you use the government to take it away from them. When the government gives stuff to women for free, then women stop giving men support and men go “what’s the point” and then women go “what’s the point” and then well, bye-bye, Korea.</p></blockquote><p>Except Korea will not die. The Korea that will survive is Best Korea. Scientific, evolutionarily-superior Korea. It’s very unlikely that South Korean women will be permitted to simply die off and end Korean civilization, the odds significantly favor them instead being enslaved and utilized by the North Koreans to ensure national survival. And the great irony is that these women will apparently be happier as slaves than as free women allowed to pursue any path they wanted, because, when given complete freedom to become anything they imagined, they consciously chose rebellion against their Creator and suicide.</p><p>Clown World is a satanic global fail.</p><p><em><a href=\"https://social.infogalactic.com/micropost/ddc75775-4fd3-4bd3-915f-042888aa7aa6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The satanic seeds of the Enlightenment have finally blossomed to the point that they are killing entire nations. We’ve already learned, much to our surprise, that Communism is less fatal to a nation than the financial capitalism, neo-liberalism, and globalism of Clown World, now we’re discovering that even the insane ideology of the Juche, the state ideology of North Korea,\nis observably better for a nation\nthan the best that the modern West has to offer.\nI think it’s so funny that Korean women are so done with Korean men that they’re literally just deciding to die out. Y’all heard of the 4B movement. I’m a big fan. The 4B movement stands for these four things. It’s basically Korean feminism which is cheaper and more efficient.\nThe 4B movement initially gained recognition on Twitter in 2019 because of course it did, through various feminist social media accounts and they are focused on envisioning a future without men because of course they are.  The cornerstone of feminism is that everything is oppressive. The 4B movement had an Escape the Corset movement. The word corset is used here for the societal mechanisms that bind and repress women like toxic beauty standards. Just like in Western feminism, toxic means anything I don’t like. I need all of this from you but you need something from me, that’s toxic. Korean women literally just gave up on their men they’re like, they’re not going to change so we’re all going to go extinct.\nThat’s where she’s wrong. She says that Korean women are mad at Korean men, but they’re actually mad at God, and if you don’t like that word, just call it the universe or physics or whatever, it’s the same thing. This is a hierarchy of creation, it goes from God or the universe all the way down through man to woman to child to the natural world and all the way back up.  It goes both ways. Basically the universe just is the way it is, you can’t get rid of gravity and men have to deal with that directly and build things from it, and we also give approval and attention and validation to women, who then provide nurturing to communities and children. Their role is to be the learners and they provide creativity and new ways in developing new things to do with the natural world, which is howwe get new things like the internet or different types of cheese or whatever, but in the same way that man cannot simply ignore the rules of gravity, women cannot simply ignore what men need from them either, otherwise we can’t do our jobs, that’s just how reality works.\nS what these women are saying is I want resources and money and power and everything, I just don’t want to provide men with what they need in order to continue creating them. Usually what keeps this whole thing going is that men provide women with approval, attention, and validation, so basically if men don’t follow the rules of the universe, then they don’t get what they need from the universe. That’s just physically how life works, you need to know when to plant seeds and stuff, and usually when women don’t follow the rules made by men, and give men what they need, then men don’t provide women with what they need in return.\nBut now women have these cellphones that are providing them with all of this approval, attention, and validation, which makes them think “I don’t need men anymore” even though men are still making all the stuff, so because women are no longer providing this men are no longer providing that, which means no one can have any of these things and women are saying “okay we’d rather die”. that’s what quotes like this mean.\nRebellion is as the sin of Witchcraft because you have rejected the word of the Lord, He has also rejected you from being King. That means if you don’t do as the universe demands then you’re not going to get anything from it. So man has to build society according to the rules of reality and women have to fit into society according to the rules of society, and then children have get good grades or they don’t get the ice cream or whatever. It works the sameway. The Bible uses that word a lot,\nrebellious\n, and what that means is “I want the benefits but I’m not going to follow the rules,” that’s why this argument is so important. “I want you to provide me with things but I’m not going to provide anything back.”\nImagine if you were saying “I want food to grow, I’m just not going to do any farming,” that’s what this is illustrating. If you don’t do what you have to then you don’t get anything back, and if you don’t provide men with what they need in order to make food and fix buildings and stuff, then they’re not going to give you any of those things and then everyone die. I’m not saying that men don’t have work to do, I don’t know what’s going on in Korea, maybe the corset is too tight, maybe men need to start providing something new, but if it’s anything like American feminism, it’s probably all get-get-get and never “where are we getting this from” and every time you break that chain you just die off, which they literally are, by the way.\nKorea has the lowest birthrates in the world but I just think that’s so funny… Korean as an ethnicity is about to go away. It works the same every time you fill your mind with entitlement, you blame somebody for what you don’t have, and then you use the government to take it away from them. When the government gives stuff to women for free, then women stop giving men support and men go “what’s the point” and then women go “what’s the point” and then well, bye-bye, Korea.\nExcept Korea will not die. The Korea that will survive is Best Korea. Scientific, evolutionarily-superior Korea. It’s very unlikely that South Korean women will be permitted to simply die off and end Korean civilization, the odds significantly favor them instead being enslaved and utilized by the North Koreans to ensure national survival. And the great irony is that these women will apparently be happier as slaves than as free women allowed to pursue any path they wanted, because, when given complete freedom to become anything they imagined, they consciously chose rebellion against their Creator and suicide.\nClown World is a satanic global fail.\nDISCUSS ON SG",
  "tags": [
    "Asia",
    "Christianity",
    "Clown World"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-14T12:49:30+00:00"
}