{
  "url": "https://voxday.net/2024/03/05/the-end-of-demonetization/",
  "scraped_at": "2026-01-08T14:26:08.098199",
  "title": "The End of Demonetization",
  "date_display": "March 5, 2024",
  "date_iso": "2024-03-05T12:30:14+00:00",
  "date_from_url": "2024-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The BRICS alliance – which is to say Russia and China – <a href=\"https://www.rt.com/business/593783-brics-blockchain-payment-system/\">is taking direct aim</a> at the ability of Clown World’s credit system to demonetize individuals, organizations, and nations of which it disapproves:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The BRICS group of emerging economies plans to create a payment system based on digital technologies, Yury Ushakov, a senior foreign policy aide to Russian President Vladimir Putin, has told TASS in an interview published on Tuesday.</p><p>According to Ushakov, the system would be “outside of politics” and would not depend on national agendas or the fiat currencies of countries around the globe.</p><p><em>“We believe that an important goal for the future is the creation within the BRICS framework of an independent settlement payment system that would be based on the most modern technologies, such as digital currencies and blockchain,”</em> Ushakov stated.<em> “It would be comfortable for any state, person and business, and would not require significant costs.”</em> The presidential aide did not specify the details or the time frame for the development of the new system.</p></blockquote><p>Now, this could certainly be a case of exchanging King Log for King Stork. But it appears the Russians and Chinese have learned from watching the demise of the UK and the USA, and that neither of them are eager to assume the crown of foreign corruption that history teaches inevitably comes with empire and ruling over foreign peoples.</p><p>And this will be a very good thing for both the BRICSIA alliance as well as the persecuted people and organizations living under Clown World’s increasingly despotic rule. As with sanctions, the practice of demonitization is going to backfire with catastrophic results for the organizations that engage in it, as they will no longer be able to compete effectively with more trustworthy competitors upon whom their clients can rely.</p><p><em><a href=\"https://social.infogalactic.com/micropost/32eae548-dda2-4d77-9953-5a652b462704\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The BRICS alliance – which is to say Russia and China –\nis taking direct aim\nat the ability of Clown World’s credit system to demonetize individuals, organizations, and nations of which it disapproves:\nThe BRICS group of emerging economies plans to create a payment system based on digital technologies, Yury Ushakov, a senior foreign policy aide to Russian President Vladimir Putin, has told TASS in an interview published on Tuesday.\nAccording to Ushakov, the system would be “outside of politics” and would not depend on national agendas or the fiat currencies of countries around the globe.\n“We believe that an important goal for the future is the creation within the BRICS framework of an independent settlement payment system that would be based on the most modern technologies, such as digital currencies and blockchain,”\nUshakov stated.\n“It would be comfortable for any state, person and business, and would not require significant costs.”\nThe presidential aide did not specify the details or the time frame for the development of the new system.\nNow, this could certainly be a case of exchanging King Log for King Stork. But it appears the Russians and Chinese have learned from watching the demise of the UK and the USA, and that neither of them are eager to assume the crown of foreign corruption that history teaches inevitably comes with empire and ruling over foreign peoples.\nAnd this will be a very good thing for both the BRICSIA alliance as well as the persecuted people and organizations living under Clown World’s increasingly despotic rule. As with sanctions, the practice of demonitization is going to backfire with catastrophic results for the organizations that engage in it, as they will no longer be able to compete effectively with more trustworthy competitors upon whom their clients can rely.\nDISCUSS ON SG",
  "tags": [
    "banks",
    "Clown World",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-05T12:30:16+00:00"
}