{
  "url": "https://voxday.net/2024/03/07/the-thucydides-stamp/",
  "scraped_at": "2026-01-08T14:26:20.261827",
  "title": "The Thucydides Stamp",
  "date_display": "March 7, 2024",
  "date_iso": "2024-03-07T12:45:56+00:00",
  "date_from_url": "2024-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No, it’s not some bizarre permutation on the so-called Thucydides Trap now en vogue with regards to the challenge being posed by China to Clown World’s imperialist hegemony, it’s <a href=\"https://castalialibrary.substack.com/p/the-landmark-thucydides-stamp\">the report on the successful test-stamping</a> of the first Castalia History book, complete with pictures.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62109\" decoding=\"async\" fetchpriority=\"high\" height=\"340\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/03/image-13.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/03/image-13.png 512w, https://voxday.net/wp-content/uploads/2024/03/image-13-300x199.png 300w\" width=\"512\"/></figure></div><p>The successful test means that the books should be going out to the warehouse early next week, so some of you might even have them as soon as next weekend. We’ve seen the first reports of the two volumes of the Cambridge Medieval History <a href=\"https://social.infogalactic.com/micropost/d4037085-151f-4f25-8343-8b91b546bbfd\">showing up in the wild</a> on SocialGalactic already, so March is clearly going to be a very big month for Castalia History subscribers.</p><p>We’ve also got some good news for Castalia Library subscribers. <a href=\"https://castalialibrary.substack.com/p/the-illuminated-beowulf\">Check out the update</a> at the bottom. And due to the unique nature of, and exceptionally high level of general interest in, <em>THE ILLUMINATED BEOWULF</em>, we are going to depart from our usual policy and allow non-subscribers to purchase a preordered copy for $199 for a very limited period of time beginning later this month.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2e86b161-879a-4350-8b0b-927b7a98f2c6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "No, it’s not some bizarre permutation on the so-called Thucydides Trap now en vogue with regards to the challenge being posed by China to Clown World’s imperialist hegemony, it’s\nthe report on the successful test-stamping\nof the first Castalia History book, complete with pictures.\nThe successful test means that the books should be going out to the warehouse early next week, so some of you might even have them as soon as next weekend. We’ve seen the first reports of the two volumes of the Cambridge Medieval History\nshowing up in the wild\non SocialGalactic already, so March is clearly going to be a very big month for Castalia History subscribers.\nWe’ve also got some good news for Castalia Library subscribers.\nCheck out the update\nat the bottom. And due to the unique nature of, and exceptionally high level of general interest in,\nTHE ILLUMINATED BEOWULF\n, we are going to depart from our usual policy and allow non-subscribers to purchase a preordered copy for $199 for a very limited period of time beginning later this month.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-07T12:45:58+00:00"
}