{
  "url": "https://voxday.net/2024/03/17/the-paper-is-not-magic/",
  "scraped_at": "2026-01-08T14:27:12.931232",
  "title": "The Paper is Not Magic",
  "date_display": "March 17, 2024",
  "date_iso": "2024-03-17T11:00:31+00:00",
  "date_from_url": "2024-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And, as Liberia has proven, <a href=\"https://social.infogalactic.com/micropost/ab492d28-5514-4776-a0e4-1d5e3d121eec\">it doesn’t make the dirt magic</a> either.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Our Constitution was made only for a moral and religious People. It is wholly inadequate to the government of any other. It is therefore futile and foolish to make appeals to Constitutional arguments in an immoral and atheistic society. Our enemies have disregarded what the Constitution says for half a century. It is a mistake continuing to play by a set of rules that our enemies no longer obey. Worse yet, turning a piece of paper into an idol and elevating it to some pseudo “holy” status in our minds.</p></blockquote><p>Andrew Torba is correct. The power is not in the paper, the power is in the ideas and those ideas have been adulterated and perverted wherever they haven’t been abandoned. Neither the words nor the ideas have ever applied in any way to newcomers, immigrants, citizens, illegals, invaders, foreigners, or the children of those diverse peoples, they only ever applied to the Posterity of the Founders, the direct genetic blood descendants of the men who fought the American Revolution against their British brethren for independence from the King of England.</p><p>The Constitution was written to safeguard the liberties of the sons and daughters of the American Revolution and no one else. That’s what the Preamble to it says and that’s <a href=\"https://voxday.net/2017/06/25/posterity-tk-vs-vd/\">literally what Posterity meant</a>. And that’s what it still means today, the legalistic fantasies of the would-be inclusive midwits who overrate the importance of their credentials and their own cognitive capabilities notwithstanding.</p><p>The words of the U.S. Constitution <em>have never applied in any way </em>to most of the “Americans” who are reading this now. So to fetishize it, to place any trust whatsoever in it, is to fundamentally fail to understand what it is, why it was written, and why it is no longer even remotely applicable to the United States of America in the Year of Our Lord 2024.</p><p><em>No damage therefore, that men in the state of nature suffer from one another, can give a conqueror power to dispossess the posterity of the vanquished, and turn them out of that inheritance, which ought to be the possession of them and their descendants to all generations. The conqueror indeed will be apt to think himself master: and it is the very condition of the subdued not to be able to dispute their right. But if that be all, it gives no other title than what bare force gives to the stronger over the weaker: and, by this reason, he that is strongest will have a right to whatever he pleases to seize on.</em><br/>– John Locke, <em>Of Conquest, Second Treatise on Civil Government</em>, 1690</p><p><em><a href=\"https://social.infogalactic.com/micropost/ab492d28-5514-4776-a0e4-1d5e3d121eec\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And, as Liberia has proven,\nit doesn’t make the dirt magic\neither.\nOur Constitution was made only for a moral and religious People. It is wholly inadequate to the government of any other. It is therefore futile and foolish to make appeals to Constitutional arguments in an immoral and atheistic society. Our enemies have disregarded what the Constitution says for half a century. It is a mistake continuing to play by a set of rules that our enemies no longer obey. Worse yet, turning a piece of paper into an idol and elevating it to some pseudo “holy” status in our minds.\nAndrew Torba is correct. The power is not in the paper, the power is in the ideas and those ideas have been adulterated and perverted wherever they haven’t been abandoned. Neither the words nor the ideas have ever applied in any way to newcomers, immigrants, citizens, illegals, invaders, foreigners, or the children of those diverse peoples, they only ever applied to the Posterity of the Founders, the direct genetic blood descendants of the men who fought the American Revolution against their British brethren for independence from the King of England.\nThe Constitution was written to safeguard the liberties of the sons and daughters of the American Revolution and no one else. That’s what the Preamble to it says and that’s\nliterally what Posterity meant\n. And that’s what it still means today, the legalistic fantasies of the would-be inclusive midwits who overrate the importance of their credentials and their own cognitive capabilities notwithstanding.\nThe words of the U.S. Constitution\nhave never applied in any way\nto most of the “Americans” who are reading this now. So to fetishize it, to place any trust whatsoever in it, is to fundamentally fail to understand what it is, why it was written, and why it is no longer even remotely applicable to the United States of America in the Year of Our Lord 2024.\nNo damage therefore, that men in the state of nature suffer from one another, can give a conqueror power to dispossess the posterity of the vanquished, and turn them out of that inheritance, which ought to be the possession of them and their descendants to all generations. The conqueror indeed will be apt to think himself master: and it is the very condition of the subdued not to be able to dispute their right. But if that be all, it gives no other title than what bare force gives to the stronger over the weaker: and, by this reason, he that is strongest will have a right to whatever he pleases to seize on.\n– John Locke,\nOf Conquest, Second Treatise on Civil Government\n, 1690\nDISCUSS ON SG",
  "tags": [
    "Americana",
    "history",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-17T11:07:26+00:00"
}