{
  "url": "https://voxday.net/2024/03/29/total-tory-implosion/",
  "scraped_at": "2026-01-08T14:28:28.206056",
  "title": "Total Tory Implosion",
  "date_display": "March 29, 2024",
  "date_iso": "2024-03-29T20:03:04+00:00",
  "date_from_url": "2024-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dominick Cummings predicts the collapse of the British Conservative Party:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The only future for the Tories was to let Vote Leave transform them into a new party 2020-24. The Party would now be unrecognisable: CCHQ closed and the party re-opened in the midlands with the rancid old guard ‘retired’, the economy would be extremely different and millions of swing voters would have vanished from the 40% tax rate (pushed up to 100k), MP pay and nurses pay would be linked to the growth/fall of average wages (‘if the voters get a pay cut the MPs get a pay cut’), term limits for MPs, the government would be years into a national project to rebuild the NHS, it would be far more ‘on the right’ on violent crime/borders etc than the median Tory MP, we’d have left the ECHR amid widespread applause that shattered Labour and stopped the ludicrous farce of a major country paralysed in handling a few dinghies, the trans madness and other manifestations of the Left’s Gadarene-psychosis would have been crushed, the broken Northcote-Trevelyan model of a closed-caste civil service recruiting only from within (and optimising for <em>preserve bureaucratic power/budgets</em> over <em>productive adaptation</em>) would have been pried open to recruit the best people in the world, we’d be very popular with ex-Labour voters, we’d be about to crush Starmer and the SW1 debate would be about a startup party replacing Labour.</p><p>Instead they broke their deal with us and tried to operate as if it’s ~1999 and 2016 never happened. The collapse in quality of MPs, their delusions about politics and communication, their total obsession with the deranged ‘news’ and punditry of the disintegrating old media instead of how power works — all this guaranteed their own disintegration.</p><p>Sunak thought about reviving the deal but decided to double-down on trusting the Establishment and the ‘strategy’ of the most Insider-pundit in SW1 to focus on week-to-week party management — a ‘strategy’ that doomed him to fail with the public then an inevitable collapse of authority with the MPs/Whitehall. 2025-9 the old Tory Party will probably be replaced.</p></blockquote><p>The Conservative Party failed to preserve Great Britain. It has also failed to preserve itself, as it is presently led by a foreign individual one Chinese diplomat has described as a “street defiler”. There is no question that it deserves to die, the only question that remains is what will replace it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6d8a274f-4f45-4164-a16c-ebf31485c022\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Dominick Cummings predicts the collapse of the British Conservative Party:\nThe only future for the Tories was to let Vote Leave transform them into a new party 2020-24. The Party would now be unrecognisable: CCHQ closed and the party re-opened in the midlands with the rancid old guard ‘retired’, the economy would be extremely different and millions of swing voters would have vanished from the 40% tax rate (pushed up to 100k), MP pay and nurses pay would be linked to the growth/fall of average wages (‘if the voters get a pay cut the MPs get a pay cut’), term limits for MPs, the government would be years into a national project to rebuild the NHS, it would be far more ‘on the right’ on violent crime/borders etc than the median Tory MP, we’d have left the ECHR amid widespread applause that shattered Labour and stopped the ludicrous farce of a major country paralysed in handling a few dinghies, the trans madness and other manifestations of the Left’s Gadarene-psychosis would have been crushed, the broken Northcote-Trevelyan model of a closed-caste civil service recruiting only from within (and optimising for\npreserve bureaucratic power/budgets\nover\nproductive adaptation\n) would have been pried open to recruit the best people in the world, we’d be very popular with ex-Labour voters, we’d be about to crush Starmer and the SW1 debate would be about a startup party replacing Labour.\nInstead they broke their deal with us and tried to operate as if it’s ~1999 and 2016 never happened. The collapse in quality of MPs, their delusions about politics and communication, their total obsession with the deranged ‘news’ and punditry of the disintegrating old media instead of how power works — all this guaranteed their own disintegration.\nSunak thought about reviving the deal but decided to double-down on trusting the Establishment and the ‘strategy’ of the most Insider-pundit in SW1 to focus on week-to-week party management — a ‘strategy’ that doomed him to fail with the public then an inevitable collapse of authority with the MPs/Whitehall. 2025-9 the old Tory Party will probably be replaced.\nThe Conservative Party failed to preserve Great Britain. It has also failed to preserve itself, as it is presently led by a foreign individual one Chinese diplomat has described as a “street defiler”. There is no question that it deserves to die, the only question that remains is what will replace it.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-29T20:03:05+00:00"
}