{
  "url": "https://voxday.net/2024/03/21/us-troops-on-taiwan/",
  "scraped_at": "2026-01-08T14:27:39.202179",
  "title": "US Troops on Taiwan",
  "date_display": "March 21, 2024",
  "date_iso": "2024-03-21T00:13:36+00:00",
  "date_from_url": "2024-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think we can safely assume that all the European dramatics about sending troops to Ukraine are going to vanish pretty quickly once it’s clear that no amount of their hapless soldiers being sent to Hell by Mr. Kinzhal is going to inspire the USA to invoke Article 5 of NATO and declare war on Russia. Because “resignation” of Ms Color Revolution, Victoria Nuland, has just been followed up by <a href=\"https://www.the-express.com/news/world-news/131715/taiwan-usa-troops-china\">another indication of the US military’s shift</a> toward the Southeast Asian front.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>American troops are to be permanently stationed in Taiwan, according to Taipei, a huge move that will likely send tensions with China soaring. According to reports from Taiwan’s United Daily News (UDN), US Army Green Berets from the 1st Special Forces Group are now permanently stationed at bases of the 101st Amphibious Reconnaissance Battalion, a Taiwanese army special operations force, located in outlying island counties of Penghu and Kinmen. Notably, Kinmen lies just over a mile from Chinese shores.</p><p>Additionally, reports suggest an American military presence in the northeast city of Taoyuan on Taiwan’s main island, with service members providing specialized training on drone equipment for Taiwan’s elite Airborne Special Service Company.</p> <cite>World on the brink as Taiwan admits US troops are now stationed on Chinese border, 20 March 2024</cite></blockquote><p>Not a peep out of the Chinese media or the Foreign Ministry yet. But I imagine that they will have something to say about this soon. And if they don’t… well, that would communicate a strong message too.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9ada89d6-a77d-4a81-8de9-0ce3ea65f8c8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I think we can safely assume that all the European dramatics about sending troops to Ukraine are going to vanish pretty quickly once it’s clear that no amount of their hapless soldiers being sent to Hell by Mr. Kinzhal is going to inspire the USA to invoke Article 5 of NATO and declare war on Russia. Because “resignation” of Ms Color Revolution, Victoria Nuland, has just been followed up by\nanother indication of the US military’s shift\ntoward the Southeast Asian front.\nAmerican troops are to be permanently stationed in Taiwan, according to Taipei, a huge move that will likely send tensions with China soaring. According to reports from Taiwan’s United Daily News (UDN), US Army Green Berets from the 1st Special Forces Group are now permanently stationed at bases of the 101st Amphibious Reconnaissance Battalion, a Taiwanese army special operations force, located in outlying island counties of Penghu and Kinmen. Notably, Kinmen lies just over a mile from Chinese shores.\nAdditionally, reports suggest an American military presence in the northeast city of Taoyuan on Taiwan’s main island, with service members providing specialized training on drone equipment for Taiwan’s elite Airborne Special Service Company.\nWorld on the brink as Taiwan admits US troops are now stationed on Chinese border, 20 March 2024\nNot a peep out of the Chinese media or the Foreign Ministry yet. But I imagine that they will have something to say about this soon. And if they don’t… well, that would communicate a strong message too.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-03-21T00:13:38+00:00"
}