{
  "url": "https://voxday.net/2006/01/20/confession/",
  "scraped_at": "2026-01-08T20:56:29.087069",
  "title": "A confession",
  "date_display": "January 20, 2006",
  "date_iso": "2006-01-20T09:51:00+00:00",
  "date_from_url": "2006-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s true, I am a sad and lonely man.  I miss my dear, darling Treo.  My closest companion is in for repairs, having inexplicably lost her ability to talk to me when not on speakerphone.  Now I am forced to make do with a wretched Samsung, which is a tiny feat of telephonic ingenuity, <em>but doesn’t have a Palm OS!</em> The horror!</p><p>It’s not that I am bookless or anything, as I moved my 1GB library over to my Dana Wireless for the nonce, but it just isn’t the same.  The Dana is a wonderful writing tool, but it doesn’t fit in my pocket like my Treo, which has completely changed my outlook on having to wait for people.  So, I’m having to make do with a physical book on Scipio Africanus in the meantime.</p><p>On the upside, however, I am getting in form again with the arrival of my old exercise bike.  It’s the only one I will use, and in combination with a PS/2, Madden 2006 and a Mitsubishi projector, it makes for the ultimate workout experience.  I measured the lightscreen the other night and it’s a solid 7 feet by 5 feet, 5 inches.</p><p>Forget plasma.  That’s so 20th century.</p><p>Eight more days until I get my Treo back… but who’s counting.</p></div>",
  "content_text": "It’s true, I am a sad and lonely man.  I miss my dear, darling Treo.  My closest companion is in for repairs, having inexplicably lost her ability to talk to me when not on speakerphone.  Now I am forced to make do with a wretched Samsung, which is a tiny feat of telephonic ingenuity,\nbut doesn’t have a Palm OS!\nThe horror!\nIt’s not that I am bookless or anything, as I moved my 1GB library over to my Dana Wireless for the nonce, but it just isn’t the same.  The Dana is a wonderful writing tool, but it doesn’t fit in my pocket like my Treo, which has completely changed my outlook on having to wait for people.  So, I’m having to make do with a physical book on Scipio Africanus in the meantime.\nOn the upside, however, I am getting in form again with the arrival of my old exercise bike.  It’s the only one I will use, and in combination with a PS/2, Madden 2006 and a Mitsubishi projector, it makes for the ultimate workout experience.  I measured the lightscreen the other night and it’s a solid 7 feet by 5 feet, 5 inches.\nForget plasma.  That’s so 20th century.\nEight more days until I get my Treo back… but who’s counting.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-20T09:51:00+00:00"
}