{
  "url": "https://voxday.net/2006/01/03/cowardly-conservatives/",
  "scraped_at": "2026-01-08T20:54:50.129648",
  "title": "Cowardly conservatives",
  "date_display": "January 3, 2006",
  "date_iso": "2006-01-03T16:39:00+00:00",
  "date_from_url": "2006-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In what feels like a very strange moment indeed, I <a href=\"http://kos.dailykos.com/\">find myself in complete agreement</a> with the epitome of the left-wing blogosophere, Kos:</p><blockquote><p>When our nation was founded, we had men of real character and courage fighting for their nascent America, one in which liberty and freedom trumped the authorative tendencies of the monarchy. Patrick Henry gave words to those efforts:</p><p>“Give me liberty or give me death!”</p><p>My, how far we have fallen, with an administration that parlays the incessant fear of its supporters into increased authoritativeness to the point where he now resembles the very despot we fought in our war of independence.</p><p>And his supporters bellow, as they cower under their beds:</p><p>Here’s our liberties, just spare us from death!</p><p>These blowhards pretend they are macho even as they piddle on themselves in abject terror from every “boo!” that comes out of Osama Bin Laden’s mouth. They like to speak about how tough they are, even though they send others to fight their battles and couldn’t last a day in places like Iraq, or Sudan, or the El Salvador of my youth, or any other war-torn nation.</p></blockquote><p>This sounds rather like what I wrote in a column <a href=\"http://www.voxday.net/archive/2005/121905.html\">two weeks ago</a>:</p><p>“America was founded on the principle that it is right to sacrifice blood for liberty. It is telling that the Bush defenders make precisely the opposite argument, that it is right to sacrifice liberty in order to avoid the shedding of American blood. In this they are, like the Dear Leader, avowedly anti-American.”</p><p>This cowardly conservatism is quite strange, especially given that twenty nuclear-blasted cities couldn’t destroy America, any more than a pair of them could destroy Japan.  The only thing that can destroy America is if Americans permit their government to eliminate the concepts of individual freedom, the rule of law and limited government that are the essence of the nation.</p><p>As the Apostle Paul writes, we are not given a spirit of fear.  Decisions predicated on fear are seldom good or right, nor do they often bring about the safety desired.</p><p>UPDATE: The good ones are going.  Fred rings in the New Year from Mexico with a shot or three of tequila: <em>Being in Mexico adds perspective, at least if you watch the great booby hatch to the north. I especially like the Warn Terr, the preferred toy of the latest Bush. Down here we read all about how the feddle gummint is keeping terrace out of the US so everyone will be safer than probably lots of them want to be. (I’d rather be in danger. Just leave me alone.)</em></p><p>That is the essence of the America That Was.  “I’d rather be in danger.  Just leave me alone.”  No doubt it was safer back in 18th century England too.</p></div>",
  "content_text": "In what feels like a very strange moment indeed, I\nfind myself in complete agreement\nwith the epitome of the left-wing blogosophere, Kos:\nWhen our nation was founded, we had men of real character and courage fighting for their nascent America, one in which liberty and freedom trumped the authorative tendencies of the monarchy. Patrick Henry gave words to those efforts:\n“Give me liberty or give me death!”\nMy, how far we have fallen, with an administration that parlays the incessant fear of its supporters into increased authoritativeness to the point where he now resembles the very despot we fought in our war of independence.\nAnd his supporters bellow, as they cower under their beds:\nHere’s our liberties, just spare us from death!\nThese blowhards pretend they are macho even as they piddle on themselves in abject terror from every “boo!” that comes out of Osama Bin Laden’s mouth. They like to speak about how tough they are, even though they send others to fight their battles and couldn’t last a day in places like Iraq, or Sudan, or the El Salvador of my youth, or any other war-torn nation.\nThis sounds rather like what I wrote in a column\ntwo weeks ago\n:\n“America was founded on the principle that it is right to sacrifice blood for liberty. It is telling that the Bush defenders make precisely the opposite argument, that it is right to sacrifice liberty in order to avoid the shedding of American blood. In this they are, like the Dear Leader, avowedly anti-American.”\nThis cowardly conservatism is quite strange, especially given that twenty nuclear-blasted cities couldn’t destroy America, any more than a pair of them could destroy Japan.  The only thing that can destroy America is if Americans permit their government to eliminate the concepts of individual freedom, the rule of law and limited government that are the essence of the nation.\nAs the Apostle Paul writes, we are not given a spirit of fear.  Decisions predicated on fear are seldom good or right, nor do they often bring about the safety desired.\nUPDATE: The good ones are going.  Fred rings in the New Year from Mexico with a shot or three of tequila:\nBeing in Mexico adds perspective, at least if you watch the great booby hatch to the north. I especially like the Warn Terr, the preferred toy of the latest Bush. Down here we read all about how the feddle gummint is keeping terrace out of the US so everyone will be safer than probably lots of them want to be. (I’d rather be in danger. Just leave me alone.)\nThat is the essence of the America That Was.  “I’d rather be in danger.  Just leave me alone.”  No doubt it was safer back in 18th century England too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-03T16:39:00+00:00"
}