{
  "url": "https://voxday.net/2006/01/31/economically-illiterate-lef/",
  "scraped_at": "2026-01-08T20:57:34.229325",
  "title": "The economically-illiterate Left",
  "date_display": "January 31, 2006",
  "date_iso": "2006-01-31T11:02:00+00:00",
  "date_from_url": "2006-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> Exxon Mobil Corp. (XOM.N: Quote, Profile, Research), the world’s largest publicly traded oil company, on Monday reported a quarterly profit of $10.7 billion, capping a year of record earnings dominated by surging oil and gas prices.</p><p>The results pushed up Exxon’s profit for the year to a staggering $36.13 billion — bigger than the economies of 125 of the 184 countries ranked by the World Bank. Profit rose 42 percent from 2004.</p><p>The company and its peers have come under fire for posting billions in profit while consumers struggle with high gasoline prices. Exxon was quick to emphasize that such results would help it make long-term investments to meet energy demand.</p><p>The Irving, Texas company’s fourth-quarter net income rose 27 percent, to $10.71 billion, or $1.71 a share, from $8.42 billion, or $1.30 a share, a year earlier. Revenue was just shy of $100 billion.</p></blockquote><p>Try to keep this little profit statement in mind the next time you run into one of the morons from the “No Blood For Oil” crowd.  As I pointed out in an article two years ago, oil is paid for in dollars, which are nothing but debt.  So, there’s no national incentive to wage war for oil <em>unless you can’t pay for it in dollars</em>.  And if you want to theorize about global corporate conspiracies influencing politicians behind closed doors, you should probably know that the oil companies LOVE expensive oil, for as the quote above demonstrates, they make significantly more money.  Nobody wants cheap oil except the masses, whose feelings are irrelevant no matter which way you look at it.</p><p>I am no fan of the Bush administration, the neocons or their World Democratic Revolution, for a myriad of reasons.  But don’t ever make the mistake of lumping me in with those utterly clueless cretins on the Left.</p></div>",
  "content_text": "Exxon Mobil Corp. (XOM.N: Quote, Profile, Research), the world’s largest publicly traded oil company, on Monday reported a quarterly profit of $10.7 billion, capping a year of record earnings dominated by surging oil and gas prices.\nThe results pushed up Exxon’s profit for the year to a staggering $36.13 billion — bigger than the economies of 125 of the 184 countries ranked by the World Bank. Profit rose 42 percent from 2004.\nThe company and its peers have come under fire for posting billions in profit while consumers struggle with high gasoline prices. Exxon was quick to emphasize that such results would help it make long-term investments to meet energy demand.\nThe Irving, Texas company’s fourth-quarter net income rose 27 percent, to $10.71 billion, or $1.71 a share, from $8.42 billion, or $1.30 a share, a year earlier. Revenue was just shy of $100 billion.\nTry to keep this little profit statement in mind the next time you run into one of the morons from the “No Blood For Oil” crowd.  As I pointed out in an article two years ago, oil is paid for in dollars, which are nothing but debt.  So, there’s no national incentive to wage war for oil\nunless you can’t pay for it in dollars\n.  And if you want to theorize about global corporate conspiracies influencing politicians behind closed doors, you should probably know that the oil companies LOVE expensive oil, for as the quote above demonstrates, they make significantly more money.  Nobody wants cheap oil except the masses, whose feelings are irrelevant no matter which way you look at it.\nI am no fan of the Bush administration, the neocons or their World Democratic Revolution, for a myriad of reasons.  But don’t ever make the mistake of lumping me in with those utterly clueless cretins on the Left.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-31T11:02:00+00:00"
}