{
  "url": "https://voxday.net/2006/01/06/gripping-endorsemen/",
  "scraped_at": "2026-01-08T20:55:06.683582",
  "title": "A gripping endorsement",
  "date_display": "January 6, 2006",
  "date_iso": "2006-01-06T11:05:00+00:00",
  "date_from_url": "2006-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d been having some problems with my hands while lifting; I’d have minor palm pain in my right hand for a day or two after doing anything reasonably heavy.  But Spacebunny bought me <a href=\"http://newgrip.com/\">a pair of these</a> for Christmas and I can testify that they make a big difference.  The neoprene is twice as thick as a regular neoprene lifting glove, and about four times thicker than leather gloves.</p><p>When benching yesterday, the NewGrips made it possible to hit two more reps on my last set repping out at 225; normally, my leather gloves tend to slip just a little, sliding my grip out just enough to make the last reps too risky past a certain point.  They’re also quite comfortable, the neoprene keeps your hands from getting calluses and they provide both an excellent grip as well as some support for your wrists from the straps to which the pad is attached with velcro.</p><p>Best of all, no pain whatsoever.  The thickness of the neoprene absorbs enough of the weight that it doesn’t strain whatever tendon or ligament wasn’t liking things.  They may look a little odd and take a few minutes to get used to, but if you’re at all serious about lifting, they’re worth checking out.</p></div>",
  "content_text": "I’d been having some problems with my hands while lifting; I’d have minor palm pain in my right hand for a day or two after doing anything reasonably heavy.  But Spacebunny bought me\na pair of these\nfor Christmas and I can testify that they make a big difference.  The neoprene is twice as thick as a regular neoprene lifting glove, and about four times thicker than leather gloves.\nWhen benching yesterday, the NewGrips made it possible to hit two more reps on my last set repping out at 225; normally, my leather gloves tend to slip just a little, sliding my grip out just enough to make the last reps too risky past a certain point.  They’re also quite comfortable, the neoprene keeps your hands from getting calluses and they provide both an excellent grip as well as some support for your wrists from the straps to which the pad is attached with velcro.\nBest of all, no pain whatsoever.  The thickness of the neoprene absorbs enough of the weight that it doesn’t strain whatever tendon or ligament wasn’t liking things.  They may look a little odd and take a few minutes to get used to, but if you’re at all serious about lifting, they’re worth checking out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-06T11:05:00+00:00"
}