{
  "url": "https://voxday.net/2006/01/14/in-defense-of-littlest-chickenhawk/",
  "scraped_at": "2026-01-08T20:55:40.030576",
  "title": "In defense of the Littlest Chickenhawk",
  "date_display": "January 14, 2006",
  "date_iso": "2006-01-14T09:23:00+00:00",
  "date_from_url": "2006-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lightning Aura jumps in very late:</p><blockquote><p>I have not been reading this blog for very long, so I dont know what happened between you two. If you really wanted to ‘eviscerate’ him why not have an intellectual debate?</p></blockquote><p>Because a debate takes two.  Mr. Shapiro is too scared and self-important to do what he declares is everyone else’s sacred duty; like Michelle Malkin he is also too frightened to respond to <a href=\"http://www.voxday.net/archive/2005/082905.html\">a very public calling-out</a> in the very place he is published.  This failure to respond in any way is particularly egregious in Mr. Shapiro’s case since I wrote in response to two weeks’ worth of Shapiro columns written in preemptive self-defense.</p><p>Vox’s Third Law of Scorn:  If you refuse to respond to legitimate criticism, you deserve all subsequent criticism, legitimate and illegitimate.</p><p>PC badly misplaces his trust:</p><blockquote><p>I pray to God that it gets ever louder and eventually, when they take over the helm of the world from the the lost generation that are their parents, the likes of Shapiro will be representative of the majority of their fellow, contemporary citizens. Because if that is not the case they will standing at the helm of a cultural ship heading for oblivion to be listed as just another shipwreck of history.  What is your beef against Ben Shapiro?</p><p>For God’s sake give the kid room. He is not long out of his teens.</p></blockquote><p>Yes, leadership by short-sighted, self-declared imperialists too self-important to perform what they declare to be duty on the part of others is just what this country needs.  I’m not a big fan of Ivy League lawyers in the first place, much less those yearning for a career in politics.</p><p>Like most hawks innocent of history, Shapiro fails to understand that empire is a sign of incipient decline and weakness, not strength and vitality.  Empires are hollow at the core, which is why they tend to come crashing down so quickly.  And hollow at the core is an excellent summation of latter-day America.</p><p>As for slack, if you wish to run with the big dogs, then how can you complain about getting knocked down when someone takes exception to your barking?  And surely a mainstream syndicated columnist, picked out from the masses for his talent, insight and intelligence, will have no trouble responding to the substance of a critique from a mere Internet columnist like my humble self.</p></div>",
  "content_text": "Lightning Aura jumps in very late:\nI have not been reading this blog for very long, so I dont know what happened between you two. If you really wanted to ‘eviscerate’ him why not have an intellectual debate?\nBecause a debate takes two.  Mr. Shapiro is too scared and self-important to do what he declares is everyone else’s sacred duty; like Michelle Malkin he is also too frightened to respond to\na very public calling-out\nin the very place he is published.  This failure to respond in any way is particularly egregious in Mr. Shapiro’s case since I wrote in response to two weeks’ worth of Shapiro columns written in preemptive self-defense.\nVox’s Third Law of Scorn:  If you refuse to respond to legitimate criticism, you deserve all subsequent criticism, legitimate and illegitimate.\nPC badly misplaces his trust:\nI pray to God that it gets ever louder and eventually, when they take over the helm of the world from the the lost generation that are their parents, the likes of Shapiro will be representative of the majority of their fellow, contemporary citizens. Because if that is not the case they will standing at the helm of a cultural ship heading for oblivion to be listed as just another shipwreck of history.  What is your beef against Ben Shapiro?\nFor God’s sake give the kid room. He is not long out of his teens.\nYes, leadership by short-sighted, self-declared imperialists too self-important to perform what they declare to be duty on the part of others is just what this country needs.  I’m not a big fan of Ivy League lawyers in the first place, much less those yearning for a career in politics.\nLike most hawks innocent of history, Shapiro fails to understand that empire is a sign of incipient decline and weakness, not strength and vitality.  Empires are hollow at the core, which is why they tend to come crashing down so quickly.  And hollow at the core is an excellent summation of latter-day America.\nAs for slack, if you wish to run with the big dogs, then how can you complain about getting knocked down when someone takes exception to your barking?  And surely a mainstream syndicated columnist, picked out from the masses for his talent, insight and intelligence, will have no trouble responding to the substance of a critique from a mere Internet columnist like my humble self.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-14T09:23:00+00:00"
}