{
  "url": "https://voxday.net/2006/01/17/mailvox-dont-even-star/",
  "scraped_at": "2026-01-08T20:56:00.653593",
  "title": "Mailvox: don’t even start",
  "date_display": "January 17, 2006",
  "date_iso": "2006-01-17T11:16:00+00:00",
  "date_from_url": "2006-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bisch is begging for a beatdown:</p><blockquote><p>You guys talking about the interception that was called off by instant replay are whack. The tuck rule call was the correct call under the rules at the time (and still). The Steelers’ safety who knocked it out of his own hand with his own knee didn’t show possession as it’s defined in the rulebook.</p></blockquote><p>A)  Any discussion of the “infamous” tuck rule play is totally beside the point.  The officials did get it wrong then, but not in the way that whiny Raidess fans think.  Woodson clearly head-slapped Brady, ergo 15-yard penalty, first down, no controversy.</p><p>B) “The league acknowledged Monday that referee Pete Morelli erred when he overturned on replay Polamalu’s interception of a Peyton Manning pass Sunday in the playoff game between Pittsburgh and Indianapolis.  Mike Pereira, the league’s vice president of officiating, said in a statement that Morelli should have let the call on the field stand.</p><p>By the way, I received this hilarious little rip on <a href=\"http://baseballsavant.blogspot.com/\">the Baseball Savant</a> yesterday from JB: <em>I recall you posting the Baseball Savant’s playoff picks a year ago, when he went 0 for 4 in the divisional round. He’s improving!</em></p><p>Here’s the latest: My winners this weekend are Washington, Carolina, Indianapolis, and New England.</p><p>No doubt gamblers everywhere are eager to know who he’s picking in the championship games… so they can safely go the other way.  But he’s feeling no pain, not in comparison with the knowledge that his Colts have passed the Vikings and are fast approaching the Bills as <a href=\"http://coldhardfootballfacts.com/Article.php?Page=664&amp;Category=1\">the all-time NFL chokers</a>.</p></div>",
  "content_text": "Bisch is begging for a beatdown:\nYou guys talking about the interception that was called off by instant replay are whack. The tuck rule call was the correct call under the rules at the time (and still). The Steelers’ safety who knocked it out of his own hand with his own knee didn’t show possession as it’s defined in the rulebook.\nA)  Any discussion of the “infamous” tuck rule play is totally beside the point.  The officials did get it wrong then, but not in the way that whiny Raidess fans think.  Woodson clearly head-slapped Brady, ergo 15-yard penalty, first down, no controversy.\nB) “The league acknowledged Monday that referee Pete Morelli erred when he overturned on replay Polamalu’s interception of a Peyton Manning pass Sunday in the playoff game between Pittsburgh and Indianapolis.  Mike Pereira, the league’s vice president of officiating, said in a statement that Morelli should have let the call on the field stand.\nBy the way, I received this hilarious little rip on\nthe Baseball Savant\nyesterday from JB:\nI recall you posting the Baseball Savant’s playoff picks a year ago, when he went 0 for 4 in the divisional round. He’s improving!\nHere’s the latest: My winners this weekend are Washington, Carolina, Indianapolis, and New England.\nNo doubt gamblers everywhere are eager to know who he’s picking in the championship games… so they can safely go the other way.  But he’s feeling no pain, not in comparison with the knowledge that his Colts have passed the Vikings and are fast approaching the Bills as\nthe all-time NFL chokers\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-17T11:16:00+00:00"
}