{
  "url": "https://voxday.net/2006/01/22/mailvox-it-seems-sally-is-smart-one/",
  "scraped_at": "2026-01-08T20:56:45.346979",
  "title": "Mailvox: It seems Sally is the smart one",
  "date_display": "January 22, 2006",
  "date_iso": "2006-01-22T18:26:00+00:00",
  "date_from_url": "2006-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jeremy not only attempts to defend what would otherwise appear to be indefensible, but he actually thinks I’m afraid to respond to him:</p><blockquote><p>It surprises me that such a comment would be brought up to support women’s rights.  I am not sure that I follow how past leaders decisions be them male or female have anything to with the reasons why women’s rights are important.  I further more am surprised that a fellow that appears to be smart would take the time to publicly challenge the argument.  Many people could point out good or bad decisions made by past leaders, I am not sure this would get either of you two anywhere.</p></blockquote><p>It surprised me too.  Of course, if I hadn’t responded to it, people like Jeremy would have claimed that I didn’t respond to it because I was afraid to do so.</p><blockquote><p>“On June 5, 1944, after many months of heated debate, Harvard Corporation finally voted to admit women into its medical college. A committee had earlier recommended that the available “mediocre men” be replaced with a group of “very superior women.” Young female applicants with degrees from four-year undergraduate schools scored considerably higher on aptitude tests than male applicants. Harvard realized that, if only as a matter of self-preservation, its almost-two-hundred-year policy of excluding women had to be reversed.” (About.com)  I am not sure your statement isn’t based on skewed historical statistics.  After all, if we went on the statistics of the pre 1950’s white people are superior athletes to blacks.  How about you write a column about that.  Was all medical advancement made by men?  Are women so helpless, or are people like you trying to make them that way once more?</p></blockquote><p>And yet those “very superior women” went on to achieve nothing that the “mediocre men” weren’t doing over the last sixty years, although the push for HMOs as a precursor to nationalizing health care – very popular among women – has managed to degrade the appeal of a medical career.  I’d be interested in seeing those statistics of pre-1950s whites you cite without source, considering that Jesse Owens was winning four gold medals in 1936 and Joe Louis won the world boxing championship in 1937.  And yes, at least 99 percent of all medical advancement has been made by men since the days of Galen.</p><blockquote><p>#1 women are now able to fend off sexist idiots such as yourself.  You seem to be very unamerican, I am appauled that you call yourself a libetarian.  What liberty is there in taking rights away and imposing your beliefs on to others?</p></blockquote><p>According to the feminists, more women are being raped, beaten and abused than ever before, especially on Super Bowl Sunday, so even that justification would appear to be a non-starter.  The only “right” I advocate taking away from women is the “right” to vote, which is not a right at all.  Since women’s suffrage has resulted in the loss of individual rights from owning firearms and private property to smoking and drinking, it should be obvious how liberty can be increased by removing the voting franchise from a group with a strong prediliction for hating individual freedom.  I have never imposed my beliefs on anyone, unlike the feminists, I do not believe my ideology is so rationally weak as to require legal force to survive.</p><blockquote><p>While in college I found few women unable to provide for themselves.  You are actually furthering this by disallowing them from their rights.  You ought to check your history also.  Women were not given suffrage in the US until 1920, prohibition movement was started in 1869 and ratified in 1919, began in 1920.  How were women able to put this in to place?</p></blockquote><p>You mean those women whose tuitions were being paid by Mommy and Daddy, not to mention the government?  As for Prohibition, women first received the right to vote in 1893 in Colorado and their strong support for Prohibition was one reason that many men opposed women’s suffrage: <em>“Opponents of the women’s suffrage movement were convinced that if women received the right to vote, prohibition would become the law of the land. In fact, women were among the most ardent supporters of prohibition, and anti-prohibition organizations, such as the National Brewers’ Association, were among the most vocal anti-suffragists.”</em></p><blockquote><p>If they do not contribute anything how do you propose your children are taken care of in your decree?  I am sure that you will be able to achieve success and take care of your children at the same time.  You are quite obviously stuck in the past.  While I was in college the number of successful females was starting to greatly out number the men.  While in the work force and in a global company I see women in very powerful and monetarily endowed positions in increasing numbers.  They are also successful in these positions (hence the increasing numbers.)  You are obviously quite OLD.  Your last sentence appears to me, speaking from experience, that you have been rejected by women many times.  Is this the reason for your sour attitude? I surely hope not.</p></blockquote><p>Jeremy clearly has the typical reading comprehension problem, as I did not say women contribute nothing to society, I said that they collectively contribute nothing to building wealth and advancing technology in a society.  This should be obvious, since there are no shortage of historical or modern examples of impoverished societies where women successfully bear and raise children.  I have no doubt that women are inordinately successful in college today, the problem is that success in college no longer means that one is even capable of balancing a checkbook or understanding a short text.  As for the rejection issue, we’ve been over that before… suffice it to say that it has not been an issue.</p><blockquote><p>That is awfully convient to say when men have ruled for over 5000 years, plenty of time to make proof for themselves.  You are only going to give women, what, about 25 years?</p></blockquote><p>Given how women have managed to collectively embarrass themselves by what they’ve done with their so-called freedom, I don’t believe any more time is needed to prove my point.  And considering what they’ve done to the country, I don’t believe the republic will survive another 85 years of women’s suffrage.  There is a reason, after all, that the same men who wrote the Constitution went out of their way to fight  the “despotism of the petticoat”, as John Adams put it, and took the vote away from women in New York, Massachusetts and New Hampshire prior to the Constitutional Convention.</p><blockquote><p>You are a real science buff too I see. A million years for evolution? Better check again. You might be surprised to find out that it can be in the thousands, or even shorter. Again math is tough, so maybe you don’t have appreciation for numbers say after the 10,000 mark. Roaches are immune to many of the pesticides they weren’t 50 years ago.</p></blockquote><p>This is interesting in that it’s always the evolutionists here who insist that evolution takes a very long time whenever an evolutionary skeptic like myself points out that evolution has not been proven by the scientific method.  I’ll leave this one for them to deal with.</p><blockquote><p>ALL MEN (With the exception of Mae West, the only of which did not kill excessive numbers of people).  If  you would like to see the continuation of the western world maybe you should look into other causes. Land conservation, natural resource preservation, a more inhabitable environment. I seriously doubt that a reduction in population is going to put an end to it.</p></blockquote><p>Jeremy conveniently skips over the fact that American women alone have ended more lives than Hitler, Stalin and Pol Pot combined.  As for the decline of the West, conservation cannot possibly be an issue as both Europe and the United States currently have more forested, less polluted la<br> nd than they have enjoyed in over a century.  The problem is not a reduction in population alone, it is a reduction in natural population combined with an influx of non-Western immigration within and growing enemy populations without.  The West’s current supremacy is not a Divine mandate and will only continue so long as there is enough of a West to remain supreme.  The long term choice is not between the feminist Equalitarian society and traditional Western society, it is between traditional Western society and either Middle Eastern or Chinese society.</br></p></div>",
  "content_text": "Jeremy not only attempts to defend what would otherwise appear to be indefensible, but he actually thinks I’m afraid to respond to him:\nIt surprises me that such a comment would be brought up to support women’s rights.  I am not sure that I follow how past leaders decisions be them male or female have anything to with the reasons why women’s rights are important.  I further more am surprised that a fellow that appears to be smart would take the time to publicly challenge the argument.  Many people could point out good or bad decisions made by past leaders, I am not sure this would get either of you two anywhere.\nIt surprised me too.  Of course, if I hadn’t responded to it, people like Jeremy would have claimed that I didn’t respond to it because I was afraid to do so.\n“On June 5, 1944, after many months of heated debate, Harvard Corporation finally voted to admit women into its medical college. A committee had earlier recommended that the available “mediocre men” be replaced with a group of “very superior women.” Young female applicants with degrees from four-year undergraduate schools scored considerably higher on aptitude tests than male applicants. Harvard realized that, if only as a matter of self-preservation, its almost-two-hundred-year policy of excluding women had to be reversed.” (About.com)  I am not sure your statement isn’t based on skewed historical statistics.  After all, if we went on the statistics of the pre 1950’s white people are superior athletes to blacks.  How about you write a column about that.  Was all medical advancement made by men?  Are women so helpless, or are people like you trying to make them that way once more?\nAnd yet those “very superior women” went on to achieve nothing that the “mediocre men” weren’t doing over the last sixty years, although the push for HMOs as a precursor to nationalizing health care – very popular among women – has managed to degrade the appeal of a medical career.  I’d be interested in seeing those statistics of pre-1950s whites you cite without source, considering that Jesse Owens was winning four gold medals in 1936 and Joe Louis won the world boxing championship in 1937.  And yes, at least 99 percent of all medical advancement has been made by men since the days of Galen.\n#1 women are now able to fend off sexist idiots such as yourself.  You seem to be very unamerican, I am appauled that you call yourself a libetarian.  What liberty is there in taking rights away and imposing your beliefs on to others?\nAccording to the feminists, more women are being raped, beaten and abused than ever before, especially on Super Bowl Sunday, so even that justification would appear to be a non-starter.  The only “right” I advocate taking away from women is the “right” to vote, which is not a right at all.  Since women’s suffrage has resulted in the loss of individual rights from owning firearms and private property to smoking and drinking, it should be obvious how liberty can be increased by removing the voting franchise from a group with a strong prediliction for hating individual freedom.  I have never imposed my beliefs on anyone, unlike the feminists, I do not believe my ideology is so rationally weak as to require legal force to survive.\nWhile in college I found few women unable to provide for themselves.  You are actually furthering this by disallowing them from their rights.  You ought to check your history also.  Women were not given suffrage in the US until 1920, prohibition movement was started in 1869 and ratified in 1919, began in 1920.  How were women able to put this in to place?\nYou mean those women whose tuitions were being paid by Mommy and Daddy, not to mention the government?  As for Prohibition, women first received the right to vote in 1893 in Colorado and their strong support for Prohibition was one reason that many men opposed women’s suffrage:\n“Opponents of the women’s suffrage movement were convinced that if women received the right to vote, prohibition would become the law of the land. In fact, women were among the most ardent supporters of prohibition, and anti-prohibition organizations, such as the National Brewers’ Association, were among the most vocal anti-suffragists.”\nIf they do not contribute anything how do you propose your children are taken care of in your decree?  I am sure that you will be able to achieve success and take care of your children at the same time.  You are quite obviously stuck in the past.  While I was in college the number of successful females was starting to greatly out number the men.  While in the work force and in a global company I see women in very powerful and monetarily endowed positions in increasing numbers.  They are also successful in these positions (hence the increasing numbers.)  You are obviously quite OLD.  Your last sentence appears to me, speaking from experience, that you have been rejected by women many times.  Is this the reason for your sour attitude? I surely hope not.\nJeremy clearly has the typical reading comprehension problem, as I did not say women contribute nothing to society, I said that they collectively contribute nothing to building wealth and advancing technology in a society.  This should be obvious, since there are no shortage of historical or modern examples of impoverished societies where women successfully bear and raise children.  I have no doubt that women are inordinately successful in college today, the problem is that success in college no longer means that one is even capable of balancing a checkbook or understanding a short text.  As for the rejection issue, we’ve been over that before… suffice it to say that it has not been an issue.\nThat is awfully convient to say when men have ruled for over 5000 years, plenty of time to make proof for themselves.  You are only going to give women, what, about 25 years?\nGiven how women have managed to collectively embarrass themselves by what they’ve done with their so-called freedom, I don’t believe any more time is needed to prove my point.  And considering what they’ve done to the country, I don’t believe the republic will survive another 85 years of women’s suffrage.  There is a reason, after all, that the same men who wrote the Constitution went out of their way to fight  the “despotism of the petticoat”, as John Adams put it, and took the vote away from women in New York, Massachusetts and New Hampshire prior to the Constitutional Convention.\nYou are a real science buff too I see. A million years for evolution? Better check again. You might be surprised to find out that it can be in the thousands, or even shorter. Again math is tough, so maybe you don’t have appreciation for numbers say after the 10,000 mark. Roaches are immune to many of the pesticides they weren’t 50 years ago.\nThis is interesting in that it’s always the evolutionists here who insist that evolution takes a very long time whenever an evolutionary skeptic like myself points out that evolution has not been proven by the scientific method.  I’ll leave this one for them to deal with.\nALL MEN (With the exception of Mae West, the only of which did not kill excessive numbers of people).  If  you would like to see the continuation of the western world maybe you should look into other causes. Land conservation, natural resource preservation, a more inhabitable environment. I seriously doubt that a reduction in population is going to put an end to it.\nJeremy conveniently skips over the fact that American women alone have ended more lives than Hitler, Stalin and Pol Pot combined.  As for the decline of the West, conservation cannot possibly be an issue as both Europe and the United States currently have more forested, less polluted la\nnd than they have enjoyed in over a century.  The problem is not a reduction in population alone, it is a reduction in natural population combined with an influx of non-Western immigration within and growing enemy populations without.  The West’s current supremacy is not a Divine mandate and will only continue so long as there is enough of a West to remain supreme.  The long term choice is not between the feminist Equalitarian society and traditional Western society, it is between traditional Western society and either Middle Eastern or Chinese society.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-22T18:26:00+00:00"
}