{
  "url": "https://voxday.net/2006/01/06/mailvox-projection/",
  "scraped_at": "2026-01-08T20:55:10.428413",
  "title": "Mailvox: projection",
  "date_display": "January 6, 2006",
  "date_iso": "2006-01-06T13:07:00+00:00",
  "date_from_url": "2006-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Digital needs to brush up on his Italian history:</p><blockquote><p>Get your facts straight. Fascists opposed women and forced feminist organizations to disband and put a stop to feminist publications.</p><p>Believe what you want however, I just wanted to offer some truth.</p><p>I find that it is typically those who are fear filled and emotionally unbalanced that have the greatest difficulty with truth.</p></blockquote><p>Which, no doubt, is why Digital will have trouble absorbing the verifiable historical facts.  From <a href=\"http://www.voxday.net/archive/2004/062804.html\">The Manifesto of the Fascist Struggle</a>, written by Benito Mussolini and published in The People of Italy on June 6, 1919:</p><p><em>Italians! Here is the program of a genuinely Italian movement. It is revolutionary because it is anti-dogmatic, strongly innovative and against prejudice.</em></p><p>For the political problem: We demand:</p><p>a) Universal suffrage polled on a regional basis, with proportional representation and voting and electoral office eligibility for women.</p><p>As I stated, it’s the very first plank in the Fascist platform.  This really shouldn’t be that hard to grasp.  Totalitarians always turn on those who bring them to power, just ask Ernst Röhm and the Sturmabteilung or Georgi Plekhanov and the Mensheviks.  In a democratic system, statist totalitarians will always favor the women’s vote, because women reliably vote for them.  This is even true in Islamic democracies such as Turkey: <em>“Both female and male MPs admitted that male leaders easily coopted women through women branches to extend their control over women at the same time as providing them access to politics.”  (Yesim Arat, “Patriarchal Paradox: Women in Politics in Turkey,” Associated University Press, 1984. p. 103)</em> Once safely in power, statists then favor using women as brood mares in service to the state; from each according to her abilities, and all that.</p><p>Today, the female prediliction for “diversity” and multiculturalism is being used in precisely this manner by the Wahhabbists.</p></div>",
  "content_text": "Digital needs to brush up on his Italian history:\nGet your facts straight. Fascists opposed women and forced feminist organizations to disband and put a stop to feminist publications.\nBelieve what you want however, I just wanted to offer some truth.\nI find that it is typically those who are fear filled and emotionally unbalanced that have the greatest difficulty with truth.\nWhich, no doubt, is why Digital will have trouble absorbing the verifiable historical facts.  From\nThe Manifesto of the Fascist Struggle\n, written by Benito Mussolini and published in The People of Italy on June 6, 1919:\nItalians! Here is the program of a genuinely Italian movement. It is revolutionary because it is anti-dogmatic, strongly innovative and against prejudice.\nFor the political problem: We demand:\na) Universal suffrage polled on a regional basis, with proportional representation and voting and electoral office eligibility for women.\nAs I stated, it’s the very first plank in the Fascist platform.  This really shouldn’t be that hard to grasp.  Totalitarians always turn on those who bring them to power, just ask Ernst Röhm and the Sturmabteilung or Georgi Plekhanov and the Mensheviks.  In a democratic system, statist totalitarians will always favor the women’s vote, because women reliably vote for them.  This is even true in Islamic democracies such as Turkey:\n“Both female and male MPs admitted that male leaders easily coopted women through women branches to extend their control over women at the same time as providing them access to politics.”  (Yesim Arat, “Patriarchal Paradox: Women in Politics in Turkey,” Associated University Press, 1984. p. 103)\nOnce safely in power, statists then favor using women as brood mares in service to the state; from each according to her abilities, and all that.\nToday, the female prediliction for “diversity” and multiculturalism is being used in precisely this manner by the Wahhabbists.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-06T13:07:00+00:00"
}