{
  "url": "https://voxday.net/2006/01/03/quatrainial-explanation/",
  "scraped_at": "2026-01-08T20:54:44.407592",
  "title": "A quatrainial explanation",
  "date_display": "January 3, 2006",
  "date_iso": "2006-01-03T09:31:00+00:00",
  "date_from_url": "2006-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wasn’t trying to be mysterious and most of them were pretty obvious, but since a few of them apparently escaped people, I suppose I might as well explain them here.  The wording is Nostradamus’s, I merely switched a few words around to suit my meanings.</p><p><em>Where the litters are overturned by the whirlwind <br>and fingers are stained in porphyry<br>the olde republic will be troubled by its people.<br>At this time the elephant will rule wrongly.</br></br></br></em></p><p>Post-electoral Iraq.  There will be no problems that the Bush administration can’t make worse.  Opposition to the Afghani-Iraqi occupations and the entire Middle East adventure will crescendo when the notion of hitting Iran is openly bruited about, until the next event turns things around.</p><p><em>Soldiers drawn away for a far distant fight.<br>The borderlands will be most grievously troubled.<br>South and west will know a greater struggle.<br>The men of the moment will have their hearts tried.</br></br></br></em></p><p>The open southern border of the US will lead to trouble, most likely in California.</p><p><em>The jaws of the Lion will be forsaken,<br>when the waters no more suffice<br>Charlemagne’s sons will have made a constitution<br>in Nice and Maastricht, a revenant time cannot kill</br></br></br></em></p><p>France and Germany continue to lead the U.K. by the nose into an ever-closer and increasingly fatal embrace by the European Union.  The twice-rejected EU constitution will be put in place, voters be damned.</p><p><em>Arrived too late, the act has been done.<br>The wind was against them, letters intercepted on their way.<br>The conspirators were nine of a party.<br>By Caesar the Younger shall these enterprises be undertaken.</br></br></br></em></p><p>Echelon and the Bush administration’s spying on Americans will be defended by the Supreme Court, should it ever get that far.  Most likely, they’ll do so by refusing to hear a challenge against it.</p><p><em>Through anger and internal hatreds, the greedy <br>will hatch a great plot against the empty throne.<br>Secretly they will place enemies as a threat,<br>and will find sedition against his old adherents</br></br></br></em></p><p>Loyalty to the old, kingless republic – the Constitution – will be seen as treason by those who support Georgicus Rex because, after all, We Are At War.</p><p><em>From the enslaved populace, songs, chants and demands,<br>while Hawks and Eagles are alike captive in prisons.<br>These will in the future by headless idiots<br>be received as divine prayers.</br></br></br></em></p><p>Jailed jihadists (desert hawks) will eventually be joined in prison by patriots loyal to the aforementioned empty throne.  The sheep will bleat and the stinking shepherds who sit where they should not will think themselves well-loved gods.  Nothing new under the sun….</p><p><em>Because of French discord and negligence<br>an opening shall be given to the Mohammedans.<br>The land of proud De Gaulle will be soaked in blood,<br>and the faces of the fair covered with shame and veils.</br></br></br></em></p><p>And so ends the French experiment with equalitarianism, no better than the French experiment with egalitarianism.</p><p><em>In the third month, at sunrise,<br>the Boar and the Leopard meet on the battlefield.<br>The fatigued Leopard looks up to heaven<br>and sees an Eagle flying too high near the sun.</br></br></br></em></p><p>The next UN-ordered war will be Iran.  Boar = bore = UN.  Leopard = Iran.   This will only add to the increasingly risky American imperial overstretch.</p><p><em>The great Orso which I sense approaching<br>will often turn (in various areas) then become worldwide.<br>It will grow so vast and terrible that it will tear<br>roots from the trees and children from the breast.</br></br></br></em></p><p>Not a good year for stocks.</p><p><em>The nearest son of the sterling will attain<br>A return to glory in the realm of the privileged:<br>Everyone will fear his fierce glory,<br>But he will burn out like a star breathing its last.</br></br></br></em></p><p>The dollar bounce continues this year, peaks and heads south again.</p></div>",
  "content_text": "I wasn’t trying to be mysterious and most of them were pretty obvious, but since a few of them apparently escaped people, I suppose I might as well explain them here.  The wording is Nostradamus’s, I merely switched a few words around to suit my meanings.\nWhere the litters are overturned by the whirlwind\nand fingers are stained in porphyry\nthe olde republic will be troubled by its people.\nAt this time the elephant will rule wrongly.\nPost-electoral Iraq.  There will be no problems that the Bush administration can’t make worse.  Opposition to the Afghani-Iraqi occupations and the entire Middle East adventure will crescendo when the notion of hitting Iran is openly bruited about, until the next event turns things around.\nSoldiers drawn away for a far distant fight.\nThe borderlands will be most grievously troubled.\nSouth and west will know a greater struggle.\nThe men of the moment will have their hearts tried.\nThe open southern border of the US will lead to trouble, most likely in California.\nThe jaws of the Lion will be forsaken,\nwhen the waters no more suffice\nCharlemagne’s sons will have made a constitution\nin Nice and Maastricht, a revenant time cannot kill\nFrance and Germany continue to lead the U.K. by the nose into an ever-closer and increasingly fatal embrace by the European Union.  The twice-rejected EU constitution will be put in place, voters be damned.\nArrived too late, the act has been done.\nThe wind was against them, letters intercepted on their way.\nThe conspirators were nine of a party.\nBy Caesar the Younger shall these enterprises be undertaken.\nEchelon and the Bush administration’s spying on Americans will be defended by the Supreme Court, should it ever get that far.  Most likely, they’ll do so by refusing to hear a challenge against it.\nThrough anger and internal hatreds, the greedy\nwill hatch a great plot against the empty throne.\nSecretly they will place enemies as a threat,\nand will find sedition against his old adherents\nLoyalty to the old, kingless republic – the Constitution – will be seen as treason by those who support Georgicus Rex because, after all, We Are At War.\nFrom the enslaved populace, songs, chants and demands,\nwhile Hawks and Eagles are alike captive in prisons.\nThese will in the future by headless idiots\nbe received as divine prayers.\nJailed jihadists (desert hawks) will eventually be joined in prison by patriots loyal to the aforementioned empty throne.  The sheep will bleat and the stinking shepherds who sit where they should not will think themselves well-loved gods.  Nothing new under the sun….\nBecause of French discord and negligence\nan opening shall be given to the Mohammedans.\nThe land of proud De Gaulle will be soaked in blood,\nand the faces of the fair covered with shame and veils.\nAnd so ends the French experiment with equalitarianism, no better than the French experiment with egalitarianism.\nIn the third month, at sunrise,\nthe Boar and the Leopard meet on the battlefield.\nThe fatigued Leopard looks up to heaven\nand sees an Eagle flying too high near the sun.\nThe next UN-ordered war will be Iran.  Boar = bore = UN.  Leopard = Iran.   This will only add to the increasingly risky American imperial overstretch.\nThe great Orso which I sense approaching\nwill often turn (in various areas) then become worldwide.\nIt will grow so vast and terrible that it will tear\nroots from the trees and children from the breast.\nNot a good year for stocks.\nThe nearest son of the sterling will attain\nA return to glory in the realm of the privileged:\nEveryone will fear his fierce glory,\nBut he will burn out like a star breathing its last.\nThe dollar bounce continues this year, peaks and heads south again.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-03T09:31:00+00:00"
}