{
  "url": "https://voxday.net/2006/01/18/shaq-is-big-big-man/",
  "scraped_at": "2026-01-08T20:56:13.511703",
  "title": "Shaq is a big, big man",
  "date_display": "January 18, 2006",
  "date_iso": "2006-01-18T12:57:00+00:00",
  "date_from_url": "2006-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>“What the great Bill Russell said meant a lot,” said O’Neal….  “He said he never had any rivals. He said he talked to Mr. Chamberlain at least once a week before he passed away, and I actually thought they hated each other, but he told me that wasn’t the case at all. It was something I had to hear from a guy like that. My mother and father also called me and told me to shake Kobe’s hand and that we were making a big deal about nothing. And even though I do act crazy sometimes, I do listen.”</p></blockquote><p>I’ve always liked the Big Aristotle as a person, though not as a basketball player.  (The non-calls on his multitude of offensive fouls are as bad as those on MJ’s travelling.)  And insasmuch as NBA stars are role models for many boys, seeing a man who was so badly and publicly disrespected <a href=\"http://sportsillustrated.cnn.com/2006/writers/arash_markazi/01/17/hot.read/index.html\">put that behind him with a handshake and a smile</a> is probably more meaningful than it would be in a more rational world.</p><p>Kobe Bryant may be a great basketball player and a smart guy, but he’s a terrible teammate and a shady individual.  Here’s hoping he can learn something about character from his ex-teammate.  Shaq is a physical giant who has his money and his rings, but he’s never been bigger than he was on the pre-game court that day.</p></div>",
  "content_text": "“What the great Bill Russell said meant a lot,” said O’Neal….  “He said he never had any rivals. He said he talked to Mr. Chamberlain at least once a week before he passed away, and I actually thought they hated each other, but he told me that wasn’t the case at all. It was something I had to hear from a guy like that. My mother and father also called me and told me to shake Kobe’s hand and that we were making a big deal about nothing. And even though I do act crazy sometimes, I do listen.”\nI’ve always liked the Big Aristotle as a person, though not as a basketball player.  (The non-calls on his multitude of offensive fouls are as bad as those on MJ’s travelling.)  And insasmuch as NBA stars are role models for many boys, seeing a man who was so badly and publicly disrespected\nput that behind him with a handshake and a smile\nis probably more meaningful than it would be in a more rational world.\nKobe Bryant may be a great basketball player and a smart guy, but he’s a terrible teammate and a shady individual.  Here’s hoping he can learn something about character from his ex-teammate.  Shaq is a physical giant who has his money and his rings, but he’s never been bigger than he was on the pre-game court that day.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-18T12:57:00+00:00"
}