{
  "url": "https://voxday.net/2006/01/02/smack-bitches-down/",
  "scraped_at": "2026-01-08T20:54:40.760441",
  "title": "Smack the bitches down",
  "date_display": "January 2, 2006",
  "date_iso": "2006-01-02T17:39:00+00:00",
  "date_from_url": "2006-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An interview <a href=\"http://www.nationalreview.com/interrogatory/obeirne200512290819.asp\">with Kate O’Beirne on NRO</a>:</p><blockquote><p>Lopez: What’s the worst thing that women who make the world worse do?</p><p>O’Beirne: They put us at war with the men in our lives, the fathers, husbands, and sons who love and support us. Because men don’t like arguing with women and naively assumed that if they gave feminists what they wanted they would be left alone, the allegedly fierce patriarchy collapsed in the face of the feminist assault. The moral intimidation feminists inflict on men means that other women have to take on the modern, destructive women’s movement. In the pages of my book you will meet some of the smart, admirable women who take on the feminists. The feminist message is crippling to our daughters, but we mothers of sons in particular have to defend our offspring. We are not raising unindicted co-conspirators in the gender wars!</p></blockquote><p>Feminists are right in one regard.  It is men’s fault that women have been allowed to cripple the West, murder millions of children and reduce the wage rate.  The answer to feminists and feminism is not to be a polite little pussy and hope they’ll leave you alone, it’s to smack down every fem-bitch that is foolish enough to confront you, however passive-aggressively. <em>Especially</em> the passive-aggressive ones.</p><p>Feminists are weak and they know it.  I have seen them literally shake and heard their voices quiver – some practically wet themselves – when forced to deal with an alpha male who isn’t fazed by female verbal facility.  The only way they can win is through manipulation or by appealing to the situational daddy, so any man who finds himself oppressed absolutely deserves what he gets.  If you’re in a corporation that has been taken over by the left-lunatic women in HR, then leave.  Abandon those IT jobs and middle-management dead-ends to the affirmative-action women to run as best they can.  Be a man and start your own company, or at least find a job where you can speak and breathe freely.</p><p>And whatever you do, stop covering for them.  If a woman tries to manipulate you into doing her job for her, smile nicely, make the appropriate apologies and let her twist in the wind.  Competent women never pull that sort of nonsense, so look at it as an opportunity to help the company rid itself of a useless appendage.  A nice guy is nothing but a tool to women; they don’t respect doormats who will do whatever they want and one of the great ironies is how women only want men who they cannot boss around.  Don’t fall for the oldest trick in the book.</p><p>The nice thing about confronting feminists in this manner is that it almost invariably inspires them to expose their inherent totalitarianism to everyone present, including themselves.  So, really, you’re doing them a favor by helping them learn more about their sociopathic heads, themselves.  It’s a win-win.</p></div>",
  "content_text": "An interview\nwith Kate O’Beirne on NRO\n:\nLopez: What’s the worst thing that women who make the world worse do?\nO’Beirne: They put us at war with the men in our lives, the fathers, husbands, and sons who love and support us. Because men don’t like arguing with women and naively assumed that if they gave feminists what they wanted they would be left alone, the allegedly fierce patriarchy collapsed in the face of the feminist assault. The moral intimidation feminists inflict on men means that other women have to take on the modern, destructive women’s movement. In the pages of my book you will meet some of the smart, admirable women who take on the feminists. The feminist message is crippling to our daughters, but we mothers of sons in particular have to defend our offspring. We are not raising unindicted co-conspirators in the gender wars!\nFeminists are right in one regard.  It is men’s fault that women have been allowed to cripple the West, murder millions of children and reduce the wage rate.  The answer to feminists and feminism is not to be a polite little pussy and hope they’ll leave you alone, it’s to smack down every fem-bitch that is foolish enough to confront you, however passive-aggressively.\nEspecially\nthe passive-aggressive ones.\nFeminists are weak and they know it.  I have seen them literally shake and heard their voices quiver – some practically wet themselves – when forced to deal with an alpha male who isn’t fazed by female verbal facility.  The only way they can win is through manipulation or by appealing to the situational daddy, so any man who finds himself oppressed absolutely deserves what he gets.  If you’re in a corporation that has been taken over by the left-lunatic women in HR, then leave.  Abandon those IT jobs and middle-management dead-ends to the affirmative-action women to run as best they can.  Be a man and start your own company, or at least find a job where you can speak and breathe freely.\nAnd whatever you do, stop covering for them.  If a woman tries to manipulate you into doing her job for her, smile nicely, make the appropriate apologies and let her twist in the wind.  Competent women never pull that sort of nonsense, so look at it as an opportunity to help the company rid itself of a useless appendage.  A nice guy is nothing but a tool to women; they don’t respect doormats who will do whatever they want and one of the great ironies is how women only want men who they cannot boss around.  Don’t fall for the oldest trick in the book.\nThe nice thing about confronting feminists in this manner is that it almost invariably inspires them to expose their inherent totalitarianism to everyone present, including themselves.  So, really, you’re doing them a favor by helping them learn more about their sociopathic heads, themselves.  It’s a win-win.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-02T17:39:00+00:00"
}