{
  "url": "https://voxday.net/2006/01/06/strength-of-glass/",
  "scraped_at": "2026-01-08T20:55:05.192188",
  "title": "The strength of glass",
  "date_display": "January 6, 2006",
  "date_iso": "2006-01-06T09:53:00+00:00",
  "date_from_url": "2006-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bandersnatch notes an amusing little kerfluffle:</p><blockquote><p>Oh man, Vox, you’re missing out on quite the dramafest.  Some students at feministe blogger Jill’s campus are considering a Miss NYC calendar – this has upset young Jill for obvious reasons, she posted on feministe about this, some students read her posts and have been bashing her on a public forum, Jill found out about it, she posted about that, they dissed her some more, etc, etc and now there’s talk about campus police getting involved, sexual harassment, etc. This is hilarious for three reasons:</p><p>1) I remember a post you made last week about wimmin not being strong enough to take blunt criticism – behold, a real world example happening before our eyes in real time!</p><p>2) I recall Jill has blogged about you a few times and the comments posted about you weren’t very nice and pleasant and I think a few even hinted at physical violence.  Funny, how it’s only a police matter when a precious dainty little feminist is being verbally insulted.</p><p>3) I always get a kick from seeing strong independent wimmin being reduced to little scared cats crying to the big brave campus police to protect them from a bunch of guys calling them fat and ugly online.</p></blockquote><p>And just how does Jill prove my earlier point about those tuff, tuff Zeta feminists?</p><p>She writes: <em>“Unfortunately, supporters of the calendar are coming out in full force, and seem to be choosing to counter feminist questions with personal attacks instead of having a reasoned discussion….  What’s more interesting is how they choose to discount feminist arguments — calling us “hairy,” “overzealous,” “hippies,” “ungrateful bitches,” and “ugly.””</em></p><p>She <a href=\"http://www.feministe.us/blog/archives/2006/01/04/a-follow-up/\">later adds</a>:<em>“A Follow-Up… to yesterday’s very short post on the discussion board about how I’m hideous and a fat ugly pig…. I was a little bit in shock, and a little bit upset, when I first read the message board, so I didn’t really get into why I even posted it or why it bothered me so much….  The fact is that it feels threatening to know that people I go to school with are reading this board and posting on it. It’s gross, it’s cowardly, and it’s intentionally hurtful. It shows a remarkable amount of cruelty toward a person that, as far as I know, they’ve never met.”</em></p><p>Naturally, the response of the little friends of this strong, independent woman is to recommend running to Daddy… the Dean of Students.  The great irony, of course, is that this is the very girl – how completely unsurprising to learn that she’s a college student – whose blog features the following <a href=\"http://www.feministe.us/blog/archives/2005/11/27/possibly-the-most-disgusting-thing-ive-ever-read/\">gross, cowardly and intentionally hurtful comments</a> showing remarkable cruelty – sniff – to someone she’s never met:</p><p><em>“So in case you ever wondered how conservative assholes like Vox Day actually view women, it’s as straight-up property.”</em></p><p><em>He’s clearly a borderline sociopath and a full-on misogynist.</em></p><p><em>He’s just a vile idiot.</em></p><p><em>Can we castrate all these people? Please?</em></p><p><em>will someone please shoot this man in the face?</em></p><p><em>“V.D.” has no female friends at all, guaranteed. And boy oh boy, is he ever pissed off about it! And it’s all their fault.</em></p><p><em>Nothing more irritating than an in your face bible thumping maniac who spouts scripture like a broken faucet. The only thing worse is an out and out chauvanist. Guess what, this guy’s both. If in fact someone does find where he lives, I have some fun ideas of what to do with him involving my fencing equipment.</em></p><p><em>He’s the most female-hating piece of shit I’ve ever seen on the internets, bar none–and I myself am very much a conservative. Frankly, anyone who identifies himself as a “Christian Libertarian” freaks me out, like a David Duke or Timothy McVeigh.</em></p><p><em>But y’know, all that angry misogyny…he just screams “self-loathing closeted queen” to me. He practically broadcasts it. I know stereotypes are unreliable at best, but I’ll be damned if he doesn’t fit it.</em></p><p><em>Wow, the anti-Semitic defenders of the Jew-hating Vox Day are now turning around and calling Cindy Sheehan an anti-Semite! You guys project better than a Bell and Howell tungsten-bulb unit.</em> <b>(Note – this comment is especially weird, since it wasn’t any of my readers who got on Sheehan, but other Feministe commenters.  I’ve never written about Sheehan and she’s never been discussed at VP.)</b></p><p><em> I say Cindy Sheehan is an anti-Semite, and I say that Vox Day is a piece of shit.</em></p><p><em>I think Vox Day’s tune might change if HE were the one to be raped, especially if the prepetrator is a 350lb black guy; Vox Day sounds a little racist, doesn’t he?</em></p><p><em>He should be anally raped with the thick end of a baseball bat with rusty fishhooks and see how HE likes it!</em></p><p><em>Read the comments on Vox’s website- you realise most of the commenters there aren’t decent people after all. Assholes.</em></p><p>Clearly, we insufficiently civilized denizens of the Right have a great deal to learn about etiquette and intellectual consistency from our moral superiors of the Feminist Left.  And Jill, you’re absolutely right, it was totally unnecessary for those people to call you fat and ugly.  Given that you’re a feminist headed for law school, everyone already knew that.</p></div>",
  "content_text": "Bandersnatch notes an amusing little kerfluffle:\nOh man, Vox, you’re missing out on quite the dramafest.  Some students at feministe blogger Jill’s campus are considering a Miss NYC calendar – this has upset young Jill for obvious reasons, she posted on feministe about this, some students read her posts and have been bashing her on a public forum, Jill found out about it, she posted about that, they dissed her some more, etc, etc and now there’s talk about campus police getting involved, sexual harassment, etc. This is hilarious for three reasons:\n1) I remember a post you made last week about wimmin not being strong enough to take blunt criticism – behold, a real world example happening before our eyes in real time!\n2) I recall Jill has blogged about you a few times and the comments posted about you weren’t very nice and pleasant and I think a few even hinted at physical violence.  Funny, how it’s only a police matter when a precious dainty little feminist is being verbally insulted.\n3) I always get a kick from seeing strong independent wimmin being reduced to little scared cats crying to the big brave campus police to protect them from a bunch of guys calling them fat and ugly online.\nAnd just how does Jill prove my earlier point about those tuff, tuff Zeta feminists?\nShe writes:\n“Unfortunately, supporters of the calendar are coming out in full force, and seem to be choosing to counter feminist questions with personal attacks instead of having a reasoned discussion….  What’s more interesting is how they choose to discount feminist arguments — calling us “hairy,” “overzealous,” “hippies,” “ungrateful bitches,” and “ugly.””\nShe\nlater adds\n:\n“A Follow-Up… to yesterday’s very short post on the discussion board about how I’m hideous and a fat ugly pig…. I was a little bit in shock, and a little bit upset, when I first read the message board, so I didn’t really get into why I even posted it or why it bothered me so much….  The fact is that it feels threatening to know that people I go to school with are reading this board and posting on it. It’s gross, it’s cowardly, and it’s intentionally hurtful. It shows a remarkable amount of cruelty toward a person that, as far as I know, they’ve never met.”\nNaturally, the response of the little friends of this strong, independent woman is to recommend running to Daddy… the Dean of Students.  The great irony, of course, is that this is the very girl – how completely unsurprising to learn that she’s a college student – whose blog features the following\ngross, cowardly and intentionally hurtful comments\nshowing remarkable cruelty – sniff – to someone she’s never met:\n“So in case you ever wondered how conservative assholes like Vox Day actually view women, it’s as straight-up property.”\nHe’s clearly a borderline sociopath and a full-on misogynist.\nHe’s just a vile idiot.\nCan we castrate all these people? Please?\nwill someone please shoot this man in the face?\n“V.D.” has no female friends at all, guaranteed. And boy oh boy, is he ever pissed off about it! And it’s all their fault.\nNothing more irritating than an in your face bible thumping maniac who spouts scripture like a broken faucet. The only thing worse is an out and out chauvanist. Guess what, this guy’s both. If in fact someone does find where he lives, I have some fun ideas of what to do with him involving my fencing equipment.\nHe’s the most female-hating piece of shit I’ve ever seen on the internets, bar none–and I myself am very much a conservative. Frankly, anyone who identifies himself as a “Christian Libertarian” freaks me out, like a David Duke or Timothy McVeigh.\nBut y’know, all that angry misogyny…he just screams “self-loathing closeted queen” to me. He practically broadcasts it. I know stereotypes are unreliable at best, but I’ll be damned if he doesn’t fit it.\nWow, the anti-Semitic defenders of the Jew-hating Vox Day are now turning around and calling Cindy Sheehan an anti-Semite! You guys project better than a Bell and Howell tungsten-bulb unit.\n(Note – this comment is especially weird, since it wasn’t any of my readers who got on Sheehan, but other Feministe commenters.  I’ve never written about Sheehan and she’s never been discussed at VP.)\nI say Cindy Sheehan is an anti-Semite, and I say that Vox Day is a piece of shit.\nI think Vox Day’s tune might change if HE were the one to be raped, especially if the prepetrator is a 350lb black guy; Vox Day sounds a little racist, doesn’t he?\nHe should be anally raped with the thick end of a baseball bat with rusty fishhooks and see how HE likes it!\nRead the comments on Vox’s website- you realise most of the commenters there aren’t decent people after all. Assholes.\nClearly, we insufficiently civilized denizens of the Right have a great deal to learn about etiquette and intellectual consistency from our moral superiors of the Feminist Left.  And Jill, you’re absolutely right, it was totally unnecessary for those people to call you fat and ugly.  Given that you’re a feminist headed for law school, everyone already knew that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-06T09:53:00+00:00"
}