{
  "url": "https://voxday.net/2006/01/10/when-women-love-bad-boy-hes-usually/",
  "scraped_at": "2026-01-08T20:55:25.328773",
  "title": "When women love a bad boy, he’s usually a liar",
  "date_display": "January 10, 2006",
  "date_iso": "2006-01-10T17:52:00+00:00",
  "date_from_url": "2006-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Elder <a href=\"http://www.fraterslibertas.com/2006_01_01_archive.html#113690900751233925\">directs our attention to Oprah’s latest exercise in self-parody</a>:</p><blockquote><p>While reading this incredible story on the way that <a href=\"http://www.thesmokinggun.com/jamesfrey/0104061jamesfrey1.html\">James Frey conned Oprah (and millions of other women)</a>, I realized that it was, to use an overused sports cliche,  right in your wheelhouse. It’s a long piece, but well worth the read. Enjoy.</p></blockquote><p>Do women just not have a BS detector?  I often used to wonder that when watching some wide-eyed beauty swallowing one of my sketchier friend’s wildly absurd fictions whole.  Now, I’m sure that they don’t.  This guy is so obviously full of it that you’d have to be careful about lighting a match within ten yards of him for fear of igniting the methane.</p></div>",
  "content_text": "The Elder\ndirects our attention to Oprah’s latest exercise in self-parody\n:\nWhile reading this incredible story on the way that\nJames Frey conned Oprah (and millions of other women)\n, I realized that it was, to use an overused sports cliche,  right in your wheelhouse. It’s a long piece, but well worth the read. Enjoy.\nDo women just not have a BS detector?  I often used to wonder that when watching some wide-eyed beauty swallowing one of my sketchier friend’s wildly absurd fictions whole.  Now, I’m sure that they don’t.  This guy is so obviously full of it that you’d have to be careful about lighting a match within ten yards of him for fear of igniting the methane.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-01-10T17:52:00+00:00"
}