{
  "url": "https://voxday.net/2008/05/20/africans-on-immigration/",
  "scraped_at": "2026-01-08T22:24:20.010374",
  "title": "Africans on immigration",
  "date_display": "May 20, 2008",
  "date_iso": "2008-05-20T08:00:00+00:00",
  "date_from_url": "2008-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No one likes being <a href=\"http://www.telegraph.co.uk/news/worldnews/africaandindianocean/southafrica/1989673/Zimbabwe-refugees-flee-South-Africa-as-violence-erupts.html\">invaded en masse</a>:</p><blockquote><p>Thousands of black immigrants in Johannesburg have fled their homes amid a growing tide of mob violence that has left at least 23 people dead and many badly injured…. The mobs hacked at their victims and set others on fire in scenes reminiscent of the township violence of the apartheid years. Up to 6,000 immigrants were reported to have fled their homes.</p></blockquote><p>It’s an interesting to see how the reporter keeps describing the Zimbabweans fleeing their “homes”, considering that the entire point is that their homes are not in South Africa.  When did the migratory invasion of tens of thousands, or even millions, become “immigration” anyhow? <a href=\"http://hotair.com/archives/2008/05/19/muslim-school-officials-attack-news-crew-in-twin-cities/\">The mass migrants are not immigrants</a> in the historical sense that the term is understood.  It should be abundantly clear to even the casual observer that if this global open borders debacle is not shut down in a civil manner, it will be shut down in a very uncivil one.</p><p>Keep in mind that if the Romans had viewed the migratory Germanic tribes as “immigrants” rather than invaders, the Roman Empire would have ended before it started.</p></div>",
  "content_text": "No one likes being\ninvaded en masse\n:\nThousands of black immigrants in Johannesburg have fled their homes amid a growing tide of mob violence that has left at least 23 people dead and many badly injured…. The mobs hacked at their victims and set others on fire in scenes reminiscent of the township violence of the apartheid years. Up to 6,000 immigrants were reported to have fled their homes.\nIt’s an interesting to see how the reporter keeps describing the Zimbabweans fleeing their “homes”, considering that the entire point is that their homes are not in South Africa.  When did the migratory invasion of tens of thousands, or even millions, become “immigration” anyhow?\nThe mass migrants are not immigrants\nin the historical sense that the term is understood.  It should be abundantly clear to even the casual observer that if this global open borders debacle is not shut down in a civil manner, it will be shut down in a very uncivil one.\nKeep in mind that if the Romans had viewed the migratory Germanic tribes as “immigrants” rather than invaders, the Roman Empire would have ended before it started.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-20T07:00:00+00:00"
}