{
  "url": "https://voxday.net/2008/05/02/and-there-was-much-rejoicing-2/",
  "scraped_at": "2026-01-08T22:22:02.134716",
  "title": "And there was much rejoicing",
  "date_display": "May 2, 2008",
  "date_iso": "2008-05-02T13:30:00+00:00",
  "date_from_url": "2008-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t have any objection to other bloggers commenting on what has been a headline story in the local news.  PZ is good enough to point out that the story has little to do with me and goes so far as to <a href=\"http://scienceblogs.com/pharyngula/2008/05/pray_for_robert_beale_too.php#comments\">encourage people to pray for my father</a>.  Of course, he is being sarcastic, but it was still was an appropriate and wittily sardonic way of noting the news:</p><blockquote><p>On this National Day of Prayer, pray ferociously for Robert Beale.</p></blockquote><p>I will, naturally, object to the assertion that my father is particularly dishonest, greedy, or sleazy.  From what I’ve heard, no one involved in the case, including the prosecutors and the jury, actually believed that to be the case.  It’s not as if he couldn’t have easily deprived more than a hundred families of their source of income and retired to Tahiti any time over the last twenty years; the 1.6 million reported in the story may sound like a lot, but it probably represents less than one quarter of one percent of his corporate income since he started his first company.  (NB: this is all public info, I’m not pointing out anything new here.)  This may help one understand why most people familiar with the case tend to think he’s a pretty nice guy who happens to be crazy, regardless of which side they’re on.  He isn’t, but it’s not hard to understand why a rational observer would reach that conclusion.</p><p>It’s a pity that PZ’s Pharyngulans couldn’t have followed his civil lead.  Because regardless of what they may think of him now, they were the people that he wanted to help too.</p></div>",
  "content_text": "I don’t have any objection to other bloggers commenting on what has been a headline story in the local news.  PZ is good enough to point out that the story has little to do with me and goes so far as to\nencourage people to pray for my father\n.  Of course, he is being sarcastic, but it was still was an appropriate and wittily sardonic way of noting the news:\nOn this National Day of Prayer, pray ferociously for Robert Beale.\nI will, naturally, object to the assertion that my father is particularly dishonest, greedy, or sleazy.  From what I’ve heard, no one involved in the case, including the prosecutors and the jury, actually believed that to be the case.  It’s not as if he couldn’t have easily deprived more than a hundred families of their source of income and retired to Tahiti any time over the last twenty years; the 1.6 million reported in the story may sound like a lot, but it probably represents less than one quarter of one percent of his corporate income since he started his first company.  (NB: this is all public info, I’m not pointing out anything new here.)  This may help one understand why most people familiar with the case tend to think he’s a pretty nice guy who happens to be crazy, regardless of which side they’re on.  He isn’t, but it’s not hard to understand why a rational observer would reach that conclusion.\nIt’s a pity that PZ’s Pharyngulans couldn’t have followed his civil lead.  Because regardless of what they may think of him now, they were the people that he wanted to help too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-02T12:30:00+00:00"
}