{
  "url": "https://voxday.net/2008/05/13/canadian-conservatis/",
  "scraped_at": "2026-01-08T22:23:22.443980",
  "title": "Canadian conservatism",
  "date_display": "May 13, 2008",
  "date_iso": "2008-05-13T08:23:00+00:00",
  "date_from_url": "2008-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://corner.nationalreview.com/post/?q=ZmU5YTJkNjdlY2I4ODFjYmMyMTk0NDk2NzY0YTRhYTc=\">America’s favorite conservative writer</a>?</p><blockquote><p>I’m all for the option of invading just about anyone, at least in the sense that I believe in a doctrine of conditional sovereignty. That’s to say, there’s no reason why a dictatorship should expect its sovereignty to be as respected as, say, New Zealand’s</p></blockquote><p>If you’re looking for the likes of conservative favorite Mark Steyn – a Canadian – to defend American national sovereignty against the North American Union, the World Court, the Law of the Sea Treaty, or any other suprenational organization, you’re almost surely misplacing your trust.  Because anyone who believes in “conditional sovereignty” will always find some excuse, some <i>condition</i> to go along with the program.  As F.A. von Hayek pointed out, the adjective is there to modify the noun, and “sovereignty” that is only respected on the conditional basis of one’s approval is no sovereignty at all.</p><p>No wonder American conservatism is in such dire straits.</p></div>",
  "content_text": "This is\nAmerica’s favorite conservative writer\n?\nI’m all for the option of invading just about anyone, at least in the sense that I believe in a doctrine of conditional sovereignty. That’s to say, there’s no reason why a dictatorship should expect its sovereignty to be as respected as, say, New Zealand’s\nIf you’re looking for the likes of conservative favorite Mark Steyn – a Canadian – to defend American national sovereignty against the North American Union, the World Court, the Law of the Sea Treaty, or any other suprenational organization, you’re almost surely misplacing your trust.  Because anyone who believes in “conditional sovereignty” will always find some excuse, some\ncondition\nto go along with the program.  As F.A. von Hayek pointed out, the adjective is there to modify the noun, and “sovereignty” that is only respected on the conditional basis of one’s approval is no sovereignty at all.\nNo wonder American conservatism is in such dire straits.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-13T07:23:00+00:00"
}