{
  "url": "https://voxday.net/2008/05/18/case-for-polyandry/",
  "scraped_at": "2026-01-08T22:24:03.463171",
  "title": "The case for polyandry",
  "date_display": "May 18, 2008",
  "date_iso": "2008-05-18T09:44:00+00:00",
  "date_from_url": "2008-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William Safire saw <a href=\"http://www.nytimes.com/2008/05/18/opinion/18opclassic.html?_r=1&amp;oref=slogin\">the inevitable result of legalizing homogamy</a> in this tongue-in-cheek piece written more than a decade ago:</p><blockquote><p>1. A woman’s chance of being left alone would be cut in half overnight. If one man left, there would still be another standing by. Both the wife and the stay-behind spouse would, in their joint rejection, be drawn more closely together. Moreover, the search for a replacement second husband would be easier, conducted by two abandoned spouses, one of whom could work or stay home with the children while the other cruised singles bars or followed up personal ads. Also, because women live longer, a backup husband reduces full widowhood.</p><p>2. The likelihood of the presence of a male role model in the home for children would be doubled. The era of the latchkey child would end abruptly, as one of the husbands would be at home at all times for roughhouse and nurturing.</p><p>3. Marital fidelity would be enhanced by internalizing the eternal triangle. The costs of living together could be cut sharply by eliminating the need for assignations. Three can live as cheaply as two; remove the adult from adultery.</p><p>Who could oppose this modest proposal to extend connubial rights, inheritance-tax advantages and benefits blessings to millions of lonely women and angry extra males?</p></blockquote><p>Since I think <i>de jure</i> or <i>de facto</i> polygamy – which is tantamount to polygyny due to historical sexual dynamics – is vastly more societally stable than the current Western system of a serially monogamous divorce culture, I suspect the unintended consequences of the Lavender Mafia’s push for homogamy may turn out to have some surprisingly positive results.  If state-sanctioned homogamy is the price required to effectively destroy feminism, and polygyny will totally eviscerate feminism, it’s a pretty small price to pay.</p><p>Now, it’s true that a polygamous culture isn’t likely to be very respectful of individual liberties nor is it necessarily inclined to small government, but then, neither is the one we currently inhabit.</p></div>",
  "content_text": "William Safire saw\nthe inevitable result of legalizing homogamy\nin this tongue-in-cheek piece written more than a decade ago:\n1. A woman’s chance of being left alone would be cut in half overnight. If one man left, there would still be another standing by. Both the wife and the stay-behind spouse would, in their joint rejection, be drawn more closely together. Moreover, the search for a replacement second husband would be easier, conducted by two abandoned spouses, one of whom could work or stay home with the children while the other cruised singles bars or followed up personal ads. Also, because women live longer, a backup husband reduces full widowhood.\n2. The likelihood of the presence of a male role model in the home for children would be doubled. The era of the latchkey child would end abruptly, as one of the husbands would be at home at all times for roughhouse and nurturing.\n3. Marital fidelity would be enhanced by internalizing the eternal triangle. The costs of living together could be cut sharply by eliminating the need for assignations. Three can live as cheaply as two; remove the adult from adultery.\nWho could oppose this modest proposal to extend connubial rights, inheritance-tax advantages and benefits blessings to millions of lonely women and angry extra males?\nSince I think\nde jure\nor\nde facto\npolygamy – which is tantamount to polygyny due to historical sexual dynamics – is vastly more societally stable than the current Western system of a serially monogamous divorce culture, I suspect the unintended consequences of the Lavender Mafia’s push for homogamy may turn out to have some surprisingly positive results.  If state-sanctioned homogamy is the price required to effectively destroy feminism, and polygyny will totally eviscerate feminism, it’s a pretty small price to pay.\nNow, it’s true that a polygamous culture isn’t likely to be very respectful of individual liberties nor is it necessarily inclined to small government, but then, neither is the one we currently inhabit.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-18T08:44:00+00:00"
}