{
  "url": "https://voxday.net/2008/05/22/catkiller-on-prince-caspian/",
  "scraped_at": "2026-01-08T22:24:39.969286",
  "title": "Catkiller onPrince Caspian",
  "date_display": "May 22, 2008",
  "date_iso": "2008-05-22T11:20:00+00:00",
  "date_from_url": "2008-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After eviscerating an AlterNet reviewer of the film, Catkiller <a href=\"http://www.rightnation.us/forums/blog/mr__naron/index.php?s=964ebf41888f90147b823e93a7616e79&amp;showentry=2574\">takes a welcome swipe</a> at the execrable Pullman, who can look forward to five more billion-dollar beatings at the box office before the sequel to his flop appears:</p><blockquote><p>In stories where creators of worlds love their creations so much that they sacrifice themselves, death is better than life? Boys are better than girls exactly how? Did Jones and Pullman not consult on Lucy’s piety? How is Lewis racist? The lightest colored person in the movies is the *ahem* White Witch, the very character Jones roots for. In A Horse and His Boy the main character meets good dark skinned people and bad dark skinned people. How is that racist?</p><p>At least Pullman can rest in smug assuredness that his books spawned a great movie like The Golden Compass. The fact that it taught Speed Racer how to flop is proof that it’s the superior film because it stands to reason that an authentically good film could only be appreciated by a small number of “brights” while the masses enjoy the typical big Hollywood productions like Prince Caspian.</p></blockquote><p>I probably won’t see it for a while myself, being less than terribly interested in movies.  I haven’t even bothered seeing <i>The Dark is Rising</i>, a series I liked even better than <i>The Chronicles of Narnia</i>.  But I have little doubt that I’ll enjoy it when I do get around to seeing it.  While Spacebunny was certainly correct in pointing out that the long battle scenes in <i>The Lord of the Rings</i> were strictly extralibral, I think they fit well within the context of the stories and make welcome additions in the alternate medium.</p></div>",
  "content_text": "After eviscerating an AlterNet reviewer of the film, Catkiller\ntakes a welcome swipe\nat the execrable Pullman, who can look forward to five more billion-dollar beatings at the box office before the sequel to his flop appears:\nIn stories where creators of worlds love their creations so much that they sacrifice themselves, death is better than life? Boys are better than girls exactly how? Did Jones and Pullman not consult on Lucy’s piety? How is Lewis racist? The lightest colored person in the movies is the *ahem* White Witch, the very character Jones roots for. In A Horse and His Boy the main character meets good dark skinned people and bad dark skinned people. How is that racist?\nAt least Pullman can rest in smug assuredness that his books spawned a great movie like The Golden Compass. The fact that it taught Speed Racer how to flop is proof that it’s the superior film because it stands to reason that an authentically good film could only be appreciated by a small number of “brights” while the masses enjoy the typical big Hollywood productions like Prince Caspian.\nI probably won’t see it for a while myself, being less than terribly interested in movies.  I haven’t even bothered seeing\nThe Dark is Rising\n, a series I liked even better than\nThe Chronicles of Narnia\n.  But I have little doubt that I’ll enjoy it when I do get around to seeing it.  While Spacebunny was certainly correct in pointing out that the long battle scenes in\nThe Lord of the Rings\nwere strictly extralibral, I think they fit well within the context of the stories and make welcome additions in the alternate medium.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-22T10:20:00+00:00"
}