{
  "url": "https://voxday.net/2008/05/31/come-on-eileen/",
  "scraped_at": "2026-01-08T22:25:46.043886",
  "title": "Come on Eileen",
  "date_display": "May 31, 2008",
  "date_iso": "2008-05-31T17:15:00+00:00",
  "date_from_url": "2008-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kill it. <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/ireland/2055562/Irish-referendum-could-scupper-EU-treaty.html\">Kill it dead</a>.  And notice, by the way, just how “representative” those parties in a “representative democracy” are when it counts:</p><blockquote><p>Despite every major political party backing the Yes campaign, support for a No vote is growing daily.  The most recent poll put the Yes voters at 41 per cent and the No voters at 33 per cent.  That sounds like a healthy lead until you discover the Yes campaign was polling well over 50 per cent on the eve of another Irish EU referendum – on the Nice Treaty in 2001 – before the electorate delivered a resounding No.</p></blockquote><p>The poll discrepancies make it pretty clear that it’s not only the politicians who are in the bag, but the media as well.  I notice, by the way, that no other so-called “democratic” European nation is being allowed to vote on the <s>European Constitution</s>Lisbon Treaty.  “In Brussels, European parliamentarians are twitchy about the future of the EU’s 495 million citizens resting in the hands of the one million Irish voters expected to turn out on polling day.”</p><p>The Brussels mafia managed to silence the other 494 million, so that one million had better speak out very loud and very clear that fulfilling the dream of Napoleon Bonaparte and Adolf Hitler will not be done by Irish hands.</p><p>Vote NO, Ireland.  If you disliked English rule, why would you think Eurofascist rule will be any more palatable?</p></div>",
  "content_text": "Kill it.\nKill it dead\n.  And notice, by the way, just how “representative” those parties in a “representative democracy” are when it counts:\nDespite every major political party backing the Yes campaign, support for a No vote is growing daily.  The most recent poll put the Yes voters at 41 per cent and the No voters at 33 per cent.  That sounds like a healthy lead until you discover the Yes campaign was polling well over 50 per cent on the eve of another Irish EU referendum – on the Nice Treaty in 2001 – before the electorate delivered a resounding No.\nThe poll discrepancies make it pretty clear that it’s not only the politicians who are in the bag, but the media as well.  I notice, by the way, that no other so-called “democratic” European nation is being allowed to vote on the\nEuropean Constitution\nLisbon Treaty.  “In Brussels, European parliamentarians are twitchy about the future of the EU’s 495 million citizens resting in the hands of the one million Irish voters expected to turn out on polling day.”\nThe Brussels mafia managed to silence the other 494 million, so that one million had better speak out very loud and very clear that fulfilling the dream of Napoleon Bonaparte and Adolf Hitler will not be done by Irish hands.\nVote NO, Ireland.  If you disliked English rule, why would you think Eurofascist rule will be any more palatable?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-31T16:15:00+00:00"
}