{
  "url": "https://voxday.net/2008/05/03/comment-status/",
  "scraped_at": "2026-01-08T22:22:05.770150",
  "title": "Comment status",
  "date_display": "May 3, 2008",
  "date_iso": "2008-05-03T08:19:00+00:00",
  "date_from_url": "2008-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Blackblade and company think they’ve figured out the truncated comment text issue and it looks like they’ll have it resolved early next week.  In the meantime, I recommend copying and saving your comments before trying to enter them.  As you can see, Lec has stripped out the avatars, reduced the namebar size, and modified the namebar colors in keeping with a color scheme suggested by SWW.  The latter is an improvement, but I’m not sure that we can’t do better, so if you have any suggestions on that score please chime in.  I think we’ll give #f9f9e2 a whirl next, it’s a bit more subtle.</p><p>By the way, while I encourage the report of problems and suggestions for a better implementation, I can’t stress enough how little I care about redundant repetitions of the obvious.  All that accomplishes is to demonstrate an annoying ignorance of the way software development works.  Speaking as one who has produced a software project that had the benefit of dozens of Intel testers, I can say with some authority that no amount of testing can compare with real world stress tests.  Most problematic bugs are intermittent, so they often don’t show up in the artificial usage by the testers.  As Blackblade mentioned, the average number of comments on all their other sites is 12.</p><p>It’s true that this commenting system isn’t ready for prime time.  It isn’t supposed to be, not yet, and it might interest you to know that this blog is serving as a practical laboratory for a few much bigger sites that are interested in some of the forthcoming new features that they can’t get via Haloscan, WordPress, or other commenting systems.</p><p>Here’s a list of requests I sent to Blackblade on Wednesday.  Some of them have already been implemented and are indicated by strikethrough, but if anything is missing, let me know:</p><p>FIXES</p><p>1. <s>Display the correct number of comments.  For example, on the “Overrated” post, it indicates there are 47 comments.  In both Expanded and Collapsed mode, I count 25.</s><br>2. <s>Remove everything from the main page except a single line in between the post text and “POSTED BY VOX @ TIMESTAMP”.</s> That line should have the blue CO logo, “Comments (X)”, and “Comment page”.  “Comments (X)” should be hotlinked to bring up the comments in the frame.  The “Comment page” should bring up the separate post page which contains the post and all of the comments in expanded mode, with the oldest comments on top.  The boxes for Username and so forth should go at the bottom, as now.  Until the frame is ready, just have the “Comments (X)” hotlink bring up the separate post page.  Depending upon which people find they prefer, frame or page, we may eventually elect to switch option attached to “Comments (X)” and replace “Comment Page” with “Comment Pop-up”. <br>3. <s>After a comment is submitted, the view should be centered on the new comment that has just appeared.  Presently, it appears to try to center one on the entire page or something, which is usually nowhere near the new comment.</s><br>4.  Reverse Order should remember the state of the comments and respect that.  Hitting Reverse Order twice does not return the user to the original state as it should, but in a collapsed state.<br>5.  Rip out that useless “There are currently no comments” text.  It already says “0 comments”.<br>6.  If you’re storing a cookie anyhow, you should be able to remember the non-registered users ID if he is commenting multiple times in a single session.<br>7. <s>Trying to post without a Username should bring up red text saying “anonymous comments not permitted” rather than “outsourced.poster.mandatory”.</s><br>8. <s>Timestamp in “04.29.08 – 3:40 pm” format.  Eastern Standard Time.</s><br>9.  Truncated comment entry problem.  Use a 10k character limit.<br>10.  “Slow down” and black box display after estimated 120+ comments.<br>11.  Username and Comment not aligned quite properly with white text boxes</br></br></br></br></br></br></br></br></br></br></p><p>FEATURES</p><p>1.  The frame should have a dark blue border like the sidebars, not transparent. <br>2.  The size should be 750 pixels high and 600 pixels wide.  Resizable is preferable; if that’s not technically possible, it might be a nice coComment feature to allow registered users to set their preferred frame size in their own settings.<br>3.  There should be three basic modes, Expanded, Collapsed, and Recent.  Expanded is all expanded, Collapsed is all collapsed to name bars, Recent should show the last three comments and last five name bars and nothing else.  No collection of horizontal bars.  The frame should open in Recent mode.<br>4.  The frame needs to have a Refresh button.  Perhaps at the bottom left, on the same line as Submit.<br>5.  When a new comment is made, the number of comments is updated and either the number blinks coComment blue or the blue co logo flashes green.  This will prevent needless refreshes.  Bold text on the new number. <br>6.  I need an edit function as well as delete.<br>7.  Dynamic word and phrase blacklists for both Username and Comment boxes implemented.<br>8.  Take out the “No &amp;, +, /, %, |, @, ,  characters allowed “.  This is confusing because it causes some to assume that HTML cannot be used.  Have it pop up as a message in red text if someone tries to enter one. <br>9.  Preview function for commenters.  A Reply button with autoformatted quoting would also be nice.<br>10.  Ability to use name that is not Username.</br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "Blackblade and company think they’ve figured out the truncated comment text issue and it looks like they’ll have it resolved early next week.  In the meantime, I recommend copying and saving your comments before trying to enter them.  As you can see, Lec has stripped out the avatars, reduced the namebar size, and modified the namebar colors in keeping with a color scheme suggested by SWW.  The latter is an improvement, but I’m not sure that we can’t do better, so if you have any suggestions on that score please chime in.  I think we’ll give #f9f9e2 a whirl next, it’s a bit more subtle.\nBy the way, while I encourage the report of problems and suggestions for a better implementation, I can’t stress enough how little I care about redundant repetitions of the obvious.  All that accomplishes is to demonstrate an annoying ignorance of the way software development works.  Speaking as one who has produced a software project that had the benefit of dozens of Intel testers, I can say with some authority that no amount of testing can compare with real world stress tests.  Most problematic bugs are intermittent, so they often don’t show up in the artificial usage by the testers.  As Blackblade mentioned, the average number of comments on all their other sites is 12.\nIt’s true that this commenting system isn’t ready for prime time.  It isn’t supposed to be, not yet, and it might interest you to know that this blog is serving as a practical laboratory for a few much bigger sites that are interested in some of the forthcoming new features that they can’t get via Haloscan, WordPress, or other commenting systems.\nHere’s a list of requests I sent to Blackblade on Wednesday.  Some of them have already been implemented and are indicated by strikethrough, but if anything is missing, let me know:\nFIXES\n1.\nDisplay the correct number of comments.  For example, on the “Overrated” post, it indicates there are 47 comments.  In both Expanded and Collapsed mode, I count 25.\n2.\nRemove everything from the main page except a single line in between the post text and “POSTED BY VOX @ TIMESTAMP”.\nThat line should have the blue CO logo, “Comments (X)”, and “Comment page”.  “Comments (X)” should be hotlinked to bring up the comments in the frame.  The “Comment page” should bring up the separate post page which contains the post and all of the comments in expanded mode, with the oldest comments on top.  The boxes for Username and so forth should go at the bottom, as now.  Until the frame is ready, just have the “Comments (X)” hotlink bring up the separate post page.  Depending upon which people find they prefer, frame or page, we may eventually elect to switch option attached to “Comments (X)” and replace “Comment Page” with “Comment Pop-up”.\n3.\nAfter a comment is submitted, the view should be centered on the new comment that has just appeared.  Presently, it appears to try to center one on the entire page or something, which is usually nowhere near the new comment.\n4.  Reverse Order should remember the state of the comments and respect that.  Hitting Reverse Order twice does not return the user to the original state as it should, but in a collapsed state.\n5.  Rip out that useless “There are currently no comments” text.  It already says “0 comments”.\n6.  If you’re storing a cookie anyhow, you should be able to remember the non-registered users ID if he is commenting multiple times in a single session.\n7.\nTrying to post without a Username should bring up red text saying “anonymous comments not permitted” rather than “outsourced.poster.mandatory”.\n8.\nTimestamp in “04.29.08 – 3:40 pm” format.  Eastern Standard Time.\n9.  Truncated comment entry problem.  Use a 10k character limit.\n10.  “Slow down” and black box display after estimated 120+ comments.\n11.  Username and Comment not aligned quite properly with white text boxes\nFEATURES\n1.  The frame should have a dark blue border like the sidebars, not transparent.\n2.  The size should be 750 pixels high and 600 pixels wide.  Resizable is preferable; if that’s not technically possible, it might be a nice coComment feature to allow registered users to set their preferred frame size in their own settings.\n3.  There should be three basic modes, Expanded, Collapsed, and Recent.  Expanded is all expanded, Collapsed is all collapsed to name bars, Recent should show the last three comments and last five name bars and nothing else.  No collection of horizontal bars.  The frame should open in Recent mode.\n4.  The frame needs to have a Refresh button.  Perhaps at the bottom left, on the same line as Submit.\n5.  When a new comment is made, the number of comments is updated and either the number blinks coComment blue or the blue co logo flashes green.  This will prevent needless refreshes.  Bold text on the new number.\n6.  I need an edit function as well as delete.\n7.  Dynamic word and phrase blacklists for both Username and Comment boxes implemented.\n8.  Take out the “No &, +, /, %, |, @, ,  characters allowed “.  This is confusing because it causes some to assume that HTML cannot be used.  Have it pop up as a message in red text if someone tries to enter one.\n9.  Preview function for commenters.  A Reply button with autoformatted quoting would also be nice.\n10.  Ability to use name that is not Username.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-03T07:19:00+00:00"
}