{
  "url": "https://voxday.net/2008/05/16/defense-of-ad-homine/",
  "scraped_at": "2026-01-08T22:23:52.265890",
  "title": "A defense of Ad Hominem",
  "date_display": "May 16, 2008",
  "date_iso": "2008-05-16T16:15:00+00:00",
  "date_from_url": "2008-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Let me begin by saying that I have absolutely no problem with ad hominem attacks.  I indulge in them quite often; my particular idiom is usually to first make an ad hominem attack, shred the errant logic of the argument second, and finally close with a non-ad hominem attack made on the legitimate basis of step two.  So, in this vein, let me first say that 1) <a href=\"http://sphericaltime.livejournal.com/27304.html\">Spherical Time</a> is rather lacking in the wits department.  Regarding 2), I quote ST’s recent post concerning Chad Orzel’s bizarre attack on John Scalzi that contained numerous ad hominem attacks on me as well:</p><blockquote><p>Ad hominem attacks are what happens when someone reaches the end of their ability to argue coherently. Sometimes people go to it quickly because they are poor advocates for their position or their arguments suck. After a long, long time of valid arguments that are constantly ignored and dismissed out of hand because of deeply held irrational beliefs, sometimes even the best of us do it.</p><p>Orzel calls Day a lunatic. That’s his opinion, and from what I see Orzel isn’t the type of person to call someone that lightly….  I can’t say that I agree with Orzel yet, but if the faithful pack of Day supporters that shows up whenever his name is mentioned is any clue, then I suspect that Orzel’s not completely out of line for having dropped the logical arguments in favor of the ad hominem attacks.  He’s just tired of saying things that are ignored.</p></blockquote><p>Now, consider <a href=\"http://scienceblogs.com/principles/2008/04/john_scalzi_should_be_ashamed.php\">what this Orzel fellow wrote</a>.  He had not been making valid arguments that were ignored or dismissed for a long time, in fact, to the best of my knowledge he had never once attempted to refute anything I have written over the last five years.  Moreover, he STILL hasn’t made a single logical argument against anything I wrote in TIA; as we’ve seen, there simply don’t appear to be any atheists that are capable of doing so, the occasional false claims that have been asserted in this regard notwithstanding.  The end of his ability to argue coherently was demonstrated at the very beginning of his argument!</p><p>This is strange, because if I am, as Orzel says, “a fucking lunatic”, he should be able to easily refute any of my arguments.  But he can’t.  And he knows he can’t, which is why he immediately resorted to the ad hominem attacks that Spherical Time is attempting to defend.  Most likely, Spherical Time can’t either, 3) because his decision to base his defense of Ad Hominem on such an unsuitable foundation provides substantive evidence of his own logical incompetence.</p><p>There is, of course, a very solid basis for Orzel’s belief in my lunacy.  For as it is stated in Vox’s First Law: any sufficiently advanced intelligence is indistinguishable from insanity.</p></div>",
  "content_text": "Let me begin by saying that I have absolutely no problem with ad hominem attacks.  I indulge in them quite often; my particular idiom is usually to first make an ad hominem attack, shred the errant logic of the argument second, and finally close with a non-ad hominem attack made on the legitimate basis of step two.  So, in this vein, let me first say that 1)\nSpherical Time\nis rather lacking in the wits department.  Regarding 2), I quote ST’s recent post concerning Chad Orzel’s bizarre attack on John Scalzi that contained numerous ad hominem attacks on me as well:\nAd hominem attacks are what happens when someone reaches the end of their ability to argue coherently. Sometimes people go to it quickly because they are poor advocates for their position or their arguments suck. After a long, long time of valid arguments that are constantly ignored and dismissed out of hand because of deeply held irrational beliefs, sometimes even the best of us do it.\nOrzel calls Day a lunatic. That’s his opinion, and from what I see Orzel isn’t the type of person to call someone that lightly….  I can’t say that I agree with Orzel yet, but if the faithful pack of Day supporters that shows up whenever his name is mentioned is any clue, then I suspect that Orzel’s not completely out of line for having dropped the logical arguments in favor of the ad hominem attacks.  He’s just tired of saying things that are ignored.\nNow, consider\nwhat this Orzel fellow wrote\n.  He had not been making valid arguments that were ignored or dismissed for a long time, in fact, to the best of my knowledge he had never once attempted to refute anything I have written over the last five years.  Moreover, he STILL hasn’t made a single logical argument against anything I wrote in TIA; as we’ve seen, there simply don’t appear to be any atheists that are capable of doing so, the occasional false claims that have been asserted in this regard notwithstanding.  The end of his ability to argue coherently was demonstrated at the very beginning of his argument!\nThis is strange, because if I am, as Orzel says, “a fucking lunatic”, he should be able to easily refute any of my arguments.  But he can’t.  And he knows he can’t, which is why he immediately resorted to the ad hominem attacks that Spherical Time is attempting to defend.  Most likely, Spherical Time can’t either, 3) because his decision to base his defense of Ad Hominem on such an unsuitable foundation provides substantive evidence of his own logical incompetence.\nThere is, of course, a very solid basis for Orzel’s belief in my lunacy.  For as it is stated in Vox’s First Law: any sufficiently advanced intelligence is indistinguishable from insanity.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-16T15:15:00+00:00"
}