{
  "url": "https://voxday.net/2008/05/02/deja-vu/",
  "scraped_at": "2026-01-08T22:21:58.491214",
  "title": "Deja vu",
  "date_display": "May 2, 2008",
  "date_iso": "2008-05-02T08:19:00+00:00",
  "date_from_url": "2008-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I half expect Obama to appear in public carrying a copy of <i>The God Delusion</i> soon.  This whole black church thing really <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=63153\">doesn’t appear to be working</a> for the Magic Negro:</p><blockquote><p>The man slated to become chief pastor at the Trinity United Church of Christ has called blacks “lepers” with a “skin disease,” claimed U.S. entertainment corporations operate with “disdain” for black people, and in a fiery sermon claimed retired pastor Rev. Jeremiah Wright was “lynched” by the media and compared the embattled pastor to Jesus.  Otis Moss III, lauded this week by Obama as a “wonderful young pastor,” also recently refused to deny claims by Wright that the U.S. government was involved in distributing illegal drugs to minorities or spreading the AIDS virus to blacks.</p></blockquote><p>Make that, the Formerly Magic Negro.  His next blunder looks to be a tremendously entertaining one. <i>“Barack Obama has turned to his wife, Michelle, in an effort to woo working class voters after being cast as an elitist in the race for the White House.”</i></p><p>Yeah, subjecting America to the highly annoying Mrs. Obama, now that’s <i>really</i> going to help his candidacy.  I suspect he’s in full late-season NBA tank mode.  About all that’s left to complete his self-immolation is lighting up a cigarette on national TV while announcing that he prefers Olympic figure skating to the NFL, then putting on a checkered kaffir and denying the Holocaust.</p></div>",
  "content_text": "I half expect Obama to appear in public carrying a copy of\nThe God Delusion\nsoon.  This whole black church thing really\ndoesn’t appear to be working\nfor the Magic Negro:\nThe man slated to become chief pastor at the Trinity United Church of Christ has called blacks “lepers” with a “skin disease,” claimed U.S. entertainment corporations operate with “disdain” for black people, and in a fiery sermon claimed retired pastor Rev. Jeremiah Wright was “lynched” by the media and compared the embattled pastor to Jesus.  Otis Moss III, lauded this week by Obama as a “wonderful young pastor,” also recently refused to deny claims by Wright that the U.S. government was involved in distributing illegal drugs to minorities or spreading the AIDS virus to blacks.\nMake that, the Formerly Magic Negro.  His next blunder looks to be a tremendously entertaining one.\n“Barack Obama has turned to his wife, Michelle, in an effort to woo working class voters after being cast as an elitist in the race for the White House.”\nYeah, subjecting America to the highly annoying Mrs. Obama, now that’s\nreally\ngoing to help his candidacy.  I suspect he’s in full late-season NBA tank mode.  About all that’s left to complete his self-immolation is lighting up a cigarette on national TV while announcing that he prefers Olympic figure skating to the NFL, then putting on a checkered kaffir and denying the Holocaust.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-02T07:19:00+00:00"
}