{
  "url": "https://voxday.net/2008/05/02/dr-helen-highlights-hausfrauhrer/",
  "scraped_at": "2026-01-08T22:22:03.952025",
  "title": "Dr. Helen highlights Der Hausfrauhrer",
  "date_display": "May 2, 2008",
  "date_iso": "2008-05-02T16:00:00+00:00",
  "date_from_url": "2008-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the cunning nature of <a href=\"http://drhelen.blogspot.com/2008/05/soft-and-aimless-or-strong-and.html\">his strategic approach to life</a>:</p><blockquote><p>Say, instead, a man sits around or get some half-assed job where he doesn’t make much. His wife is working and supporting the family or at least pays for more than half. He no longer has to worry about working himself into an early grave, his wife can take that risk. He can spend more time with the kids and if the marriage goes bad, he has every right to claim he was around them more and had more hands on time with them–thus gaining him a greater chance at custody or at least more visitation time. If the marriage goes well, the man wins since he gets to spend more time with his kids and avoid an early heart attack. If he does head to divorce court, even a chivalrous judge will have to admit that the father is the primary caregiver.</p></blockquote><p>That’s the real advantage of the house-husband over the game designer.  Sure, we both sit around doing nothing but play games all day, but if Dr. Who ever leaves his redneck posterior for the handsome and urbane surgeon that is clearly her due, Nate not only hits the financial jackpot but gets to keep his kids.  Outstanding!  Watch and learn, grasshopper, watch and learn.  And don’t fret about the tears shed by would-be parasites <a href=\"http://drmelissaclouthier.blogspot.com/2008/05/men-need-to-butch-up.html\">upset at finding themselves outparasat</a>. <i>A girlfriend of mine told me that her three best girlfriends all have husbands that stay home while their wives work and the men sit around complaining about their wives. That just seems wrong somehow.</i></p><p>That’s not wrong, it’s just funny.  Butch up?  Seems to me that the modern American woman already has.  Anyhow, if you’ll excuse me, I believe I have some hookers to beat up and cops to run over in my stolen automobile.</p><p>UPDATE – Why do women think that any real man is going to pay attention to their endless attempts <a href=\"http://wizbangblog.com/content/2008/05/01/paging-men-everywhere-its-time-to-man-up.php\">to define a Real Man</a>?  This woman’s advice rather reminds me of a cat telling mice that a Real Mouse will sit patiently in the food dish until the cat gets hungry:</p><blockquote><p>If a woman wants to work outside the home, then that’s great. A real man would encourage her to, if that’s what she chose to do. But a real man would also accept her role as housewife if that was what she wanted — even if it meant taking on extra financial responsibility.</p></blockquote><p>In other words, a Real Man will do whatever a woman wants.  Right… anyhow, those cops aren’t going to shoot themselves.</p></div>",
  "content_text": "And the cunning nature of\nhis strategic approach to life\n:\nSay, instead, a man sits around or get some half-assed job where he doesn’t make much. His wife is working and supporting the family or at least pays for more than half. He no longer has to worry about working himself into an early grave, his wife can take that risk. He can spend more time with the kids and if the marriage goes bad, he has every right to claim he was around them more and had more hands on time with them–thus gaining him a greater chance at custody or at least more visitation time. If the marriage goes well, the man wins since he gets to spend more time with his kids and avoid an early heart attack. If he does head to divorce court, even a chivalrous judge will have to admit that the father is the primary caregiver.\nThat’s the real advantage of the house-husband over the game designer.  Sure, we both sit around doing nothing but play games all day, but if Dr. Who ever leaves his redneck posterior for the handsome and urbane surgeon that is clearly her due, Nate not only hits the financial jackpot but gets to keep his kids.  Outstanding!  Watch and learn, grasshopper, watch and learn.  And don’t fret about the tears shed by would-be parasites\nupset at finding themselves outparasat\n.\nA girlfriend of mine told me that her three best girlfriends all have husbands that stay home while their wives work and the men sit around complaining about their wives. That just seems wrong somehow.\nThat’s not wrong, it’s just funny.  Butch up?  Seems to me that the modern American woman already has.  Anyhow, if you’ll excuse me, I believe I have some hookers to beat up and cops to run over in my stolen automobile.\nUPDATE – Why do women think that any real man is going to pay attention to their endless attempts\nto define a Real Man\n?  This woman’s advice rather reminds me of a cat telling mice that a Real Mouse will sit patiently in the food dish until the cat gets hungry:\nIf a woman wants to work outside the home, then that’s great. A real man would encourage her to, if that’s what she chose to do. But a real man would also accept her role as housewife if that was what she wanted — even if it meant taking on extra financial responsibility.\nIn other words, a Real Man will do whatever a woman wants.  Right… anyhow, those cops aren’t going to shoot themselves.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-02T15:00:00+00:00"
}