{
  "url": "https://voxday.net/2008/05/20/first-albums/",
  "scraped_at": "2026-01-08T22:24:27.304689",
  "title": "First albums",
  "date_display": "May 20, 2008",
  "date_iso": "2008-05-20T18:31:00+00:00",
  "date_from_url": "2008-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate has <a href=\"http://bloggerblaster.blogspot.com/2008_05_01_archive.html#258190201081849315\">an inquiring mind</a>:</p><blockquote><p>You are hearby ordered to share yours as well. Lets see a link. I wanna know… year… band… album… Lets see a youtube vid of a song off the first album you ever bought with your own money.</p></blockquote><p>I don’t remember the year, but the first album I ever bought was AC/DC’s <i>Back in Black</i>.  I still like it, despite my subsequent departures into New Wave, gangster rap, and eventually techno-industrial music.  (The rap was a track thing, let’s just say that there weren’t a lot of sprinter/jumper/hurdler types particularly into Alphaville, Depeche Mode and Japan… although I have to confess that <i>It Takes a Nation of Millions</i> is in the CD changer at the moment.)</p><p>But let’s face it, the actual first isn’t really the point.  So, more to the point, I would have to say that the most embarrassing album I ever bought has to be <a href=\"http://www.youtube.com/watch?v=Wmp9kxNZwN8\">Face to Face</a>.  (The Nena album auf Deutsch was the other serious candidate, but I was studying German pretty heavily at the time and there were actually two or three halfway-decent songs on it that tends to somewhat mitigate that otherwise absurd purchase.)  Forget today, I was wondering what in the world I had been thinking by the time the second song finished playing!  Completely on the other end of the spectrum, I am still enraptured by <a href=\"http://www.youtube.com/watch?v=H8RxNeHKgNU&amp;feature=related\">this extraordinary CD</a> by one of the world’s finest lyricists.</p></div>",
  "content_text": "Nate has\nan inquiring mind\n:\nYou are hearby ordered to share yours as well. Lets see a link. I wanna know… year… band… album… Lets see a youtube vid of a song off the first album you ever bought with your own money.\nI don’t remember the year, but the first album I ever bought was AC/DC’s\nBack in Black\n.  I still like it, despite my subsequent departures into New Wave, gangster rap, and eventually techno-industrial music.  (The rap was a track thing, let’s just say that there weren’t a lot of sprinter/jumper/hurdler types particularly into Alphaville, Depeche Mode and Japan… although I have to confess that\nIt Takes a Nation of Millions\nis in the CD changer at the moment.)\nBut let’s face it, the actual first isn’t really the point.  So, more to the point, I would have to say that the most embarrassing album I ever bought has to be\nFace to Face\n.  (The Nena album auf Deutsch was the other serious candidate, but I was studying German pretty heavily at the time and there were actually two or three halfway-decent songs on it that tends to somewhat mitigate that otherwise absurd purchase.)  Forget today, I was wondering what in the world I had been thinking by the time the second song finished playing!  Completely on the other end of the spectrum, I am still enraptured by\nthis extraordinary CD\nby one of the world’s finest lyricists.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-20T17:31:00+00:00"
}