{
  "url": "https://voxday.net/2008/05/25/flds-tide-has-turned/",
  "scraped_at": "2026-01-08T22:25:11.007591",
  "title": "FLDS: the tide has turned",
  "date_display": "May 25, 2008",
  "date_iso": "2008-05-25T17:00:00+00:00",
  "date_from_url": "2008-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The law was always against the CPS.  Now <a href=\"http://pajamasmedia.com/blog/even-polygamists-are-innocent-until-proven-guilty/\">the emotional tide has turned</a> as well:</p><blockquote><p>When I first heard about the raid, I applauded the efforts of protective services. As a parent, all I could imagine was my teenage daughter  being forced to live in such an environment, where, according to the authorities, there was a pervasive atmosphere of subservience and sexual indemnity for the girls.</p><p>But the more I read about the story, the more I became alarmed at the way the state had acted. My tune abruptly changed from “how could they” in regards to the leaders of the sect and the mothers, to “how could they” in regards to protective services. Instead of imaging my daughter living in such a rigid and archaic environment, I was now imagining her being snatched from my life by overzealous “advocates”  who presume they know what is happening to her or what will happen to her within my house.  So I was relieved when a state appeals court ruled on Friday that officials of the State Department of Family and Protective Services had no right to take the children away from their parents and scatter them across the state in foster homes.</p></blockquote><p>At this point, only those who are total tools that believe a government can do no wrong due to mere fact of it being the government are on the side of the CPS.  The essential battles have been won, so we should now see things rapidly proceed to the CYA stage from the governor on down.  As Instapundit has said, the entire case has evolved into <a href=\"http://www.chron.com/disp/story.mpl/front/5800274.html\">a legal debacle</a> that goes well beyond nuns playing hockey.</p></div>",
  "content_text": "The law was always against the CPS.  Now\nthe emotional tide has turned\nas well:\nWhen I first heard about the raid, I applauded the efforts of protective services. As a parent, all I could imagine was my teenage daughter  being forced to live in such an environment, where, according to the authorities, there was a pervasive atmosphere of subservience and sexual indemnity for the girls.\nBut the more I read about the story, the more I became alarmed at the way the state had acted. My tune abruptly changed from “how could they” in regards to the leaders of the sect and the mothers, to “how could they” in regards to protective services. Instead of imaging my daughter living in such a rigid and archaic environment, I was now imagining her being snatched from my life by overzealous “advocates”  who presume they know what is happening to her or what will happen to her within my house.  So I was relieved when a state appeals court ruled on Friday that officials of the State Department of Family and Protective Services had no right to take the children away from their parents and scatter them across the state in foster homes.\nAt this point, only those who are total tools that believe a government can do no wrong due to mere fact of it being the government are on the side of the CPS.  The essential battles have been won, so we should now see things rapidly proceed to the CYA stage from the governor on down.  As Instapundit has said, the entire case has evolved into\na legal debacle\nthat goes well beyond nuns playing hockey.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-25T16:00:00+00:00"
}