{
  "url": "https://voxday.net/2008/05/26/fly-in-soup/",
  "scraped_at": "2026-01-08T22:25:16.574775",
  "title": "The lizard in the ointment",
  "date_display": "May 26, 2008",
  "date_iso": "2008-05-26T08:37:00+00:00",
  "date_from_url": "2008-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Krugman doesn’t notice <a href=\"http://www.nytimes.com/2008/05/26/opinion/26krugman.html?hp\">the rather glaring flaw</a> in his scenario:</p><blockquote><p>Mrs. Clinton needs to do her part: she needs to be careful not to act as a spoiler during what’s left of the primary, she needs to bow out gracefully if, as seems almost certain, Mr. Obama receives the nod, and she needs to campaign strongly for the nominee once the convention is over. She has said she’ll do that, and there’s no reason to believe that she doesn’t mean it.</p></blockquote><p>Except, of course, that doing her part will not get her what she wants.  So, what happens if she doesn’t play along?  That’s my point in <a href=\"http://www.worldnetdaily.com/index.php?pageId=65279\">today’s column</a>… and I notice that Team Obama isn’t doing what Krugman declares needs to be done either.  Is there any reason to believe Team Clinton is less ruthlessly focused on winning at all costs than Team Obama?  Assuming that a woman will fight like a man is potentially erroneous at best, and it’s clear that Obama’s obvious weakness in the general election is of serious and growing concern to Democrats.</p><p>UPDATE – Paul Lukasiak postulates <a href=\"http://taylormarsh.com/archives_view.php?id=27781\">Democratic buyer’s remorse</a>:</p><blockquote><p> Ever since the media declared that Barack Obama was “inevitable” after February 19th, based on a two week period when the an unprepared Hillary Clinton campaign suffered “10 straight losses”, rank and file Democratic voters have been sending a message. Rather than rally ‘round the “inevitable nominee” that message has been a consistent, loud, and clear message to the Democratic Party – DO NOT WANT.</p></blockquote></div>",
  "content_text": "Paul Krugman doesn’t notice\nthe rather glaring flaw\nin his scenario:\nMrs. Clinton needs to do her part: she needs to be careful not to act as a spoiler during what’s left of the primary, she needs to bow out gracefully if, as seems almost certain, Mr. Obama receives the nod, and she needs to campaign strongly for the nominee once the convention is over. She has said she’ll do that, and there’s no reason to believe that she doesn’t mean it.\nExcept, of course, that doing her part will not get her what she wants.  So, what happens if she doesn’t play along?  That’s my point in\ntoday’s column\n… and I notice that Team Obama isn’t doing what Krugman declares needs to be done either.  Is there any reason to believe Team Clinton is less ruthlessly focused on winning at all costs than Team Obama?  Assuming that a woman will fight like a man is potentially erroneous at best, and it’s clear that Obama’s obvious weakness in the general election is of serious and growing concern to Democrats.\nUPDATE – Paul Lukasiak postulates\nDemocratic buyer’s remorse\n:\nEver since the media declared that Barack Obama was “inevitable” after February 19th, based on a two week period when the an unprepared Hillary Clinton campaign suffered “10 straight losses”, rank and file Democratic voters have been sending a message. Rather than rally ‘round the “inevitable nominee” that message has been a consistent, loud, and clear message to the Democratic Party – DO NOT WANT.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-26T07:37:00+00:00"
}