{
  "url": "https://voxday.net/2008/05/02/guilt-by-address/",
  "scraped_at": "2026-01-08T22:21:56.678921",
  "title": "Guilt by address",
  "date_display": "May 2, 2008",
  "date_iso": "2008-05-02T07:28:00+00:00",
  "date_from_url": "2008-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And as for those “older men”, it’s <a href=\"http://www.chron.com/disp/story.mpl/ap/nation/5747774.html\">not necessarily the image</a> that everyone had in mind:</p><blockquote><p>Texas District Judge Barbara Walther signed the order Wednesday giving the state custody of the 1-day-old infant born to a teen believed to be 15 or 16 years old.  The girl has claimed to be 18 and based on a bishop’s record used during the custody hearing two weeks ago, she would be 18 now. But officials believe she is younger and placed her in foster care with other children taken from the ranch.  The newborn is the teen’s second child; the first is a 20-month-old boy. The father of both children was identified as Jackson Jessop, 22….</p><p>The bishop’s records released Thursday were used by CPS to demonstrate a pattern of abuse justifying the removal of all FLDS children in a hearing two weeks ago. The records indicate that about two-thirds of the ranch’s households were polygamous while the others were young couples or traditional nuclear families.</p></blockquote><p>So, an infant has been taken away from his mother because the father is <i>four years older</i>, and possibly as much as <i>seven</i> years older.  The horror!  Even more disturbing, about one-third of the families likely weren’t guilty of anything worse than living in the vicinity of those who have so offended the State of Texas.  And yet, their children have been kidnapped too.</p></div>",
  "content_text": "And as for those “older men”, it’s\nnot necessarily the image\nthat everyone had in mind:\nTexas District Judge Barbara Walther signed the order Wednesday giving the state custody of the 1-day-old infant born to a teen believed to be 15 or 16 years old.  The girl has claimed to be 18 and based on a bishop’s record used during the custody hearing two weeks ago, she would be 18 now. But officials believe she is younger and placed her in foster care with other children taken from the ranch.  The newborn is the teen’s second child; the first is a 20-month-old boy. The father of both children was identified as Jackson Jessop, 22….\nThe bishop’s records released Thursday were used by CPS to demonstrate a pattern of abuse justifying the removal of all FLDS children in a hearing two weeks ago. The records indicate that about two-thirds of the ranch’s households were polygamous while the others were young couples or traditional nuclear families.\nSo, an infant has been taken away from his mother because the father is\nfour years older\n, and possibly as much as\nseven\nyears older.  The horror!  Even more disturbing, about one-third of the families likely weren’t guilty of anything worse than living in the vicinity of those who have so offended the State of Texas.  And yet, their children have been kidnapped too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-02T06:28:00+00:00"
}