{
  "url": "https://voxday.net/2008/05/16/homogamy-diktat_16/",
  "scraped_at": "2026-01-08T22:23:50.440908",
  "title": "The homogamy diktat",
  "date_display": "May 16, 2008",
  "date_iso": "2008-05-16T13:00:00+00:00",
  "date_from_url": "2008-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And so California <a href=\"http://www.latimes.com/news/local/la-me-gaymarriage16-2008may16,0,6182317.story\">skips down the lavender brick road</a>, at least until the people of California get their chance to speak their piece via referendum:</p><blockquote><p>The California Supreme Court struck down the state’s ban on same-sex marriage Thursday in a broadly worded decision that would invalidate virtually any law that discriminates on the basis of sexual orientation.</p></blockquote><p>Being a libertarian, I see no reason why the government should be involved in any way with the private social contracts written between individuals.  Marriage is no more subject to legal definition than friendship; what passes for government-defined “marriage” is no more marriage than a fish is a frog.  A marriage license is simply a binding legal contract between three parties that happens to share a name with the ancient institution.  The state governments didn’t even control the licensing until 1853, so either no one was legally married in America before then or there is a complete distinction between marriage and the tripartite legal institution that was redefined yesterday in California.</p><p>Now, what is tremendously amusing to me is the way that many who look favorably on homogamy <a href=\"http://scalzi.com/whatever/?p=760#comments\">appear to be reluctant to recognize</a> how this creates the de facto legalization of polygyny.  For if it is bigotry or an arbitrary denial of a basic human right to define marriage as “one man and one woman”, the same reasoning that applies to changing the nouns must also apply to the numbers.  Now, I don’t have a personal problem with this, in fact, I just had lunch yesterday with a good friend who has two de facto wives.  I’m having dinner with another friend tonight who has three children by three different women.  Not my life, not my problem.</p><p>The California decision is only interesting for what it says about where the USA is on the historical decadence scale.  It may even be a positive thing, highlighting the distinction between real marriage and government marriage as well as laying the groundwork for the final destruction of Western feminism.  I’m mostly pointing out the obvious here; one cannot logically accept a legal redefinition of “marriage” that includes homogamy that does not implicitly accept polygyny.</p><p>By the way, I note that this was a Republican-dominated court, thus exploding the last remaining argument for McCain in 2008.</p></div>",
  "content_text": "And so California\nskips down the lavender brick road\n, at least until the people of California get their chance to speak their piece via referendum:\nThe California Supreme Court struck down the state’s ban on same-sex marriage Thursday in a broadly worded decision that would invalidate virtually any law that discriminates on the basis of sexual orientation.\nBeing a libertarian, I see no reason why the government should be involved in any way with the private social contracts written between individuals.  Marriage is no more subject to legal definition than friendship; what passes for government-defined “marriage” is no more marriage than a fish is a frog.  A marriage license is simply a binding legal contract between three parties that happens to share a name with the ancient institution.  The state governments didn’t even control the licensing until 1853, so either no one was legally married in America before then or there is a complete distinction between marriage and the tripartite legal institution that was redefined yesterday in California.\nNow, what is tremendously amusing to me is the way that many who look favorably on homogamy\nappear to be reluctant to recognize\nhow this creates the de facto legalization of polygyny.  For if it is bigotry or an arbitrary denial of a basic human right to define marriage as “one man and one woman”, the same reasoning that applies to changing the nouns must also apply to the numbers.  Now, I don’t have a personal problem with this, in fact, I just had lunch yesterday with a good friend who has two de facto wives.  I’m having dinner with another friend tonight who has three children by three different women.  Not my life, not my problem.\nThe California decision is only interesting for what it says about where the USA is on the historical decadence scale.  It may even be a positive thing, highlighting the distinction between real marriage and government marriage as well as laying the groundwork for the final destruction of Western feminism.  I’m mostly pointing out the obvious here; one cannot logically accept a legal redefinition of “marriage” that includes homogamy that does not implicitly accept polygyny.\nBy the way, I note that this was a Republican-dominated court, thus exploding the last remaining argument for McCain in 2008.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-16T12:00:00+00:00"
}