{
  "url": "https://voxday.net/2008/05/07/horse-is-horse/",
  "scraped_at": "2026-01-08T22:22:39.538488",
  "title": "That horse is a horse",
  "date_display": "May 7, 2008",
  "date_iso": "2008-05-07T14:51:00+00:00",
  "date_from_url": "2008-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I don’t follow horse-racing <a href=\"http://bloggerblaster.blogspot.com/2008_05_01_archive.html#4523989639875967245\">like some do</a>, even a total neophyte could tell that Big Brown possesses an extra gear that the other Derby entrants lacked.  It was fun to watch him stay wide the entire race, then kick it up a level to finish all the others off in a matter of seconds without putting forth any real effort.  On a side note, it was a pity about the brave little filly; Spacebunny, who loves horses, didn’t find the crack about it probably being her ACL to be terribly funny.  (In my defense, this was before the news broke about her broken ankles and subsequent euthanasia.)</p><p>Some of you may recall that I was a D1 sprinter back in the day.  In the 200, I used to like to use the curve in much the same manner that Big Brown’s jockey did on the Derby’s final turn.  My preference was to run in lane two and hang back a few steps behind the leader, then slingshot off the curve into the straightaway to blow past him when he wasn’t expecting it.  I always ran my fastest times that way, which used to drive my college coach nuts.</p><p>He called me in once when he was examining video of our meet at Georgetown and pointed to the screen.  “It almost looks like you’re pacing the curve,” he said.</p><p>“Yeah, I am,” I replied.  “I always take it easy until we hit the stretch.”</p><p>He scratched his head, then said: “You do know it’s called the 200 meter dash, right?  That’s because you’re supposed to run as fast as you damn well can for the whole 200 meters!”</p><p>So, at his urging, at the next meet I tried going flat out from the start.  That didn’t work so well.  I hit the wall at 180, finished fifth and turned in a time more than a second slower than normal.</p><p>Horse or Man, some like to run in front like frightened rabbits.  I think those are the psychologically weak ones.  Breathe down their neck and they break down; pass them and they quit.  More confident competitors prefer to hang back and keep an eye on everyone, knowing that they’re in control and can take over at the moment of their choosing.  There’s no more confident feeling than effortlessly keeping pace with someone who is going as hard as they can, knowing that you’ve still got another gear left in you.</p><p>Unfortunately, speed disappears with age.  That top gear is just a fond memory now.</p></div>",
  "content_text": "While I don’t follow horse-racing\nlike some do\n, even a total neophyte could tell that Big Brown possesses an extra gear that the other Derby entrants lacked.  It was fun to watch him stay wide the entire race, then kick it up a level to finish all the others off in a matter of seconds without putting forth any real effort.  On a side note, it was a pity about the brave little filly; Spacebunny, who loves horses, didn’t find the crack about it probably being her ACL to be terribly funny.  (In my defense, this was before the news broke about her broken ankles and subsequent euthanasia.)\nSome of you may recall that I was a D1 sprinter back in the day.  In the 200, I used to like to use the curve in much the same manner that Big Brown’s jockey did on the Derby’s final turn.  My preference was to run in lane two and hang back a few steps behind the leader, then slingshot off the curve into the straightaway to blow past him when he wasn’t expecting it.  I always ran my fastest times that way, which used to drive my college coach nuts.\nHe called me in once when he was examining video of our meet at Georgetown and pointed to the screen.  “It almost looks like you’re pacing the curve,” he said.\n“Yeah, I am,” I replied.  “I always take it easy until we hit the stretch.”\nHe scratched his head, then said: “You do know it’s called the 200 meter dash, right?  That’s because you’re supposed to run as fast as you damn well can for the whole 200 meters!”\nSo, at his urging, at the next meet I tried going flat out from the start.  That didn’t work so well.  I hit the wall at 180, finished fifth and turned in a time more than a second slower than normal.\nHorse or Man, some like to run in front like frightened rabbits.  I think those are the psychologically weak ones.  Breathe down their neck and they break down; pass them and they quit.  More confident competitors prefer to hang back and keep an eye on everyone, knowing that they’re in control and can take over at the moment of their choosing.  There’s no more confident feeling than effortlessly keeping pace with someone who is going as hard as they can, knowing that you’ve still got another gear left in you.\nUnfortunately, speed disappears with age.  That top gear is just a fond memory now.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-07T13:51:00+00:00"
}