{
  "url": "https://voxday.net/2008/05/09/intellectual-maturation/",
  "scraped_at": "2026-01-08T22:22:54.191859",
  "title": "Intellectual maturation",
  "date_display": "May 9, 2008",
  "date_iso": "2008-05-09T09:06:00+00:00",
  "date_from_url": "2008-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rachel Lucas reads <i>Mere Christianity</i> and <a href=\"http://rachellucas.com/index.php/2008/05/06/the-daily-dog-piety/\">reassesses a few previous assumptions</a>:</p><blockquote><p>I’ll be perfectly honest: I’ve spent many, many years refusing to accept the idea that a truly rational, reasonable, smart adult could sincerely believe in any religion, including Christianity…..  I’ve realized lately that part of my problem with the whole subject was that I was doing exactly what I so very much HATE for other people to do: projecting. I assumed the majority of you who are Christian were such because either someone told you to be or more to the point, because you didn’t know any better, simply because you had not bothered to do the research. Well, hello. My name is Rachl Lukis and guess what? I hadn’t bothered to do the research.</p><p>One line from Lewis’ book that actually made me laugh out loud (at myself) was that if people “cannot understand books written for grown-ups, they should not talk about them”. I’ve mentioned before that I’ve read the Bible a couple of times, but the thing is, I didn’t read it as a real grown-up. The last time I read it, I was actively looking for faults to prove that I was right. I wasn’t truly being objective and considering it in a historical or scholarly context.</p><p>It’s difficult to articulate on a blog why I’m even bothering trying to learn about Christianity now because as I’ve mentioned before, I hate being misunderstood. The truth is that I am not exactly seeking salvation or God or anything like that, and frankly if I were, I would not talk about it with virtual strangers at this stage of the game. At this moment, my biggest aim is simply trying to relieve myself of the terrifying feeling I’ve had for years that I live in a society full of and run by people who believe a theology I don’t believe in, and that therefore I am surrounded by crazy people. It’s a bit of cognitive dissonance that I simply couldn’t take anymore.</p><p>Is my dad a crazy person? Are 90% of the people who read my blog crazy people? Are most of my friends crazy people? If I think Christianity is crazy, then the only answer to those questions is YES. But it just never added up. I had to know how they could believe something that I do not think is real and somehow not be crazy. That’s why I started asking about it here and why I started reading books like the Lewis one. And I have to tell you that the mission has been accomplished. It’s not even remotely “crazy” to believe in Christianity, and Christians have perfectly sound reasons to believe what they do, even if I disagree with some of their conclusions.</p></blockquote><p>This is an interesting post, because it is an honest admission of what far too many atheists obviously find themselves doing, whether they realize it or not.  Most atheists haven’t actually reasoned anything through for themselves and because they’re operating on intellectual autopilot, they assume that everyone else must be too.  This is why people like Kelly of the RRS, the three-chapter reviewers, and even a few of the New Atheists such as Sam Harris and Christopher Hitchens are so easily thrown off kilter by TIA and/or demolished in rational discourse; they simply have no idea of the depth of intellectual activity taking place on the other side and are therefore ill-prepared to defend their own positions.</p><p>Reliant upon superficial and inaccurate sound bites, the average atheist reliably reveals near-total ignorance of not only theology, but also history, philosophy, logic and even the dictionary.  There are few things I find more amusing than hearing an atheist get started on the “evidence” line; I have yet to run into a single atheist who is not stopped dead in his tracks and forced to backpedal by the simple observation that scientific evidence is but a subset of the various forms of evidence known to Man.  There are surely exceptions to this particular intellectual ineptitude – Richard Dawkins being one – but I’ve yet to meet one personally.</p><p>I don’t think it’s crazy to be an atheist and I completely understand the appeal of atheism, especially for the young.  What’s not to like about a behavioral <i>carte blanche</i> limited only by one’s desires, societal mores and the policeman around the corner?  There is much that is compelling about the concept of Enlightenment 2.0 and the shiny secular science fiction society it promises the true believers.  Unfortunately, I happen to find that progressive vision far less rationally credible than I do an ancient tribal anthology telling the story of a fallen creature who is congenitally incapable of lifting himself out of his own evil.</p></div>",
  "content_text": "Rachel Lucas reads\nMere Christianity\nand\nreassesses a few previous assumptions\n:\nI’ll be perfectly honest: I’ve spent many, many years refusing to accept the idea that a truly rational, reasonable, smart adult could sincerely believe in any religion, including Christianity…..  I’ve realized lately that part of my problem with the whole subject was that I was doing exactly what I so very much HATE for other people to do: projecting. I assumed the majority of you who are Christian were such because either someone told you to be or more to the point, because you didn’t know any better, simply because you had not bothered to do the research. Well, hello. My name is Rachl Lukis and guess what? I hadn’t bothered to do the research.\nOne line from Lewis’ book that actually made me laugh out loud (at myself) was that if people “cannot understand books written for grown-ups, they should not talk about them”. I’ve mentioned before that I’ve read the Bible a couple of times, but the thing is, I didn’t read it as a real grown-up. The last time I read it, I was actively looking for faults to prove that I was right. I wasn’t truly being objective and considering it in a historical or scholarly context.\nIt’s difficult to articulate on a blog why I’m even bothering trying to learn about Christianity now because as I’ve mentioned before, I hate being misunderstood. The truth is that I am not exactly seeking salvation or God or anything like that, and frankly if I were, I would not talk about it with virtual strangers at this stage of the game. At this moment, my biggest aim is simply trying to relieve myself of the terrifying feeling I’ve had for years that I live in a society full of and run by people who believe a theology I don’t believe in, and that therefore I am surrounded by crazy people. It’s a bit of cognitive dissonance that I simply couldn’t take anymore.\nIs my dad a crazy person? Are 90% of the people who read my blog crazy people? Are most of my friends crazy people? If I think Christianity is crazy, then the only answer to those questions is YES. But it just never added up. I had to know how they could believe something that I do not think is real and somehow not be crazy. That’s why I started asking about it here and why I started reading books like the Lewis one. And I have to tell you that the mission has been accomplished. It’s not even remotely “crazy” to believe in Christianity, and Christians have perfectly sound reasons to believe what they do, even if I disagree with some of their conclusions.\nThis is an interesting post, because it is an honest admission of what far too many atheists obviously find themselves doing, whether they realize it or not.  Most atheists haven’t actually reasoned anything through for themselves and because they’re operating on intellectual autopilot, they assume that everyone else must be too.  This is why people like Kelly of the RRS, the three-chapter reviewers, and even a few of the New Atheists such as Sam Harris and Christopher Hitchens are so easily thrown off kilter by TIA and/or demolished in rational discourse; they simply have no idea of the depth of intellectual activity taking place on the other side and are therefore ill-prepared to defend their own positions.\nReliant upon superficial and inaccurate sound bites, the average atheist reliably reveals near-total ignorance of not only theology, but also history, philosophy, logic and even the dictionary.  There are few things I find more amusing than hearing an atheist get started on the “evidence” line; I have yet to run into a single atheist who is not stopped dead in his tracks and forced to backpedal by the simple observation that scientific evidence is but a subset of the various forms of evidence known to Man.  There are surely exceptions to this particular intellectual ineptitude – Richard Dawkins being one – but I’ve yet to meet one personally.\nI don’t think it’s crazy to be an atheist and I completely understand the appeal of atheism, especially for the young.  What’s not to like about a behavioral\ncarte blanche\nlimited only by one’s desires, societal mores and the policeman around the corner?  There is much that is compelling about the concept of Enlightenment 2.0 and the shiny secular science fiction society it promises the true believers.  Unfortunately, I happen to find that progressive vision far less rationally credible than I do an ancient tribal anthology telling the story of a fallen creature who is congenitally incapable of lifting himself out of his own evil.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-09T08:06:00+00:00"
}