{
  "url": "https://voxday.net/2008/05/23/mccain-is-mcliar/",
  "scraped_at": "2026-01-08T22:24:54.691956",
  "title": "McCain is a McLiar",
  "date_display": "May 23, 2008",
  "date_iso": "2008-05-23T23:58:00+00:00",
  "date_from_url": "2008-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just in case you needed <a href=\"http://thecaucus.blogs.nytimes.com/2008/05/22/mccain-says-immigration-reform-should-be-top-priority/\">one more reason</a> to vote third party instead of Republican this November:</p><blockquote><p>In yet another sign of his pivoting toward the general election, Senator John McCain said at a roundtable with business leaders here today that comprehensive immigration reform should be a top priority for the next president.  Mr. McCain’s willingness to address the issue was striking given how the topic became something of a third-rail for Republican presidential candidates during the primary….</p><p>The measure failed last spring after a firestorm of grassroots opposition. The issue became an important touchstone in the Republican primary, as the candidates scrambled to one-up each other in their tough talk on immigration as they sought to appeal to primary voters.  Mr. McCain largely stopped talking about the issue and repeatedly invoked a mantra that he had gotten the message from voters that the borders needed to be secured first, before any solution for the illegal immigrants already here is addressed.</p></blockquote><p>He got the message.  And now, he’s ignoring it.  How very shocking!  Here’s my advice: don’t even THINK about voting for this lunatic.  Even George W. Bush waited until after he got elected to start stabbing conservatives in the back.  McCain is so eager to do the same, he simply can’t wait.</p><p>And yet, some eternal optimists will argue that McCain has a double-secret conservative plan to nominate conservative judges.  Right.  And meanwhile, Hillary gives Sen. Obama one last warning: <i>“We all remember Bobby Kennedy was assassinated in June in California….”</i> Gee, I can’t imagine why she isn’t dropping out.</p></div>",
  "content_text": "Just in case you needed\none more reason\nto vote third party instead of Republican this November:\nIn yet another sign of his pivoting toward the general election, Senator John McCain said at a roundtable with business leaders here today that comprehensive immigration reform should be a top priority for the next president.  Mr. McCain’s willingness to address the issue was striking given how the topic became something of a third-rail for Republican presidential candidates during the primary….\nThe measure failed last spring after a firestorm of grassroots opposition. The issue became an important touchstone in the Republican primary, as the candidates scrambled to one-up each other in their tough talk on immigration as they sought to appeal to primary voters.  Mr. McCain largely stopped talking about the issue and repeatedly invoked a mantra that he had gotten the message from voters that the borders needed to be secured first, before any solution for the illegal immigrants already here is addressed.\nHe got the message.  And now, he’s ignoring it.  How very shocking!  Here’s my advice: don’t even THINK about voting for this lunatic.  Even George W. Bush waited until after he got elected to start stabbing conservatives in the back.  McCain is so eager to do the same, he simply can’t wait.\nAnd yet, some eternal optimists will argue that McCain has a double-secret conservative plan to nominate conservative judges.  Right.  And meanwhile, Hillary gives Sen. Obama one last warning:\n“We all remember Bobby Kennedy was assassinated in June in California….”\nGee, I can’t imagine why she isn’t dropping out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-23T22:58:00+00:00"
}