{
  "url": "https://voxday.net/2008/05/04/media-games/",
  "scraped_at": "2026-01-08T22:22:11.241313",
  "title": "Media narrative",
  "date_display": "May 4, 2008",
  "date_iso": "2008-05-04T08:00:00+00:00",
  "date_from_url": "2008-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The actual dialogue, for the record:</p><blockquote><p><b>Q: </b><i>the jurors said they were struck by a comment he made that implied “you’re just the little people” (I don’t recall that one, but I wasn’t always there). The also thought he seems “arrogant” and the fact he compared himself to moses and MLK in his opening made them feel “he was on a mission to be one of them.” -This seems contradictory to what Bob’s brothers and niece said, and even some of the employees who testified against him, who found him down to earth and often helpful. Did your dad have two opposite sides? Or was his courtroom personna misinterpreted?</i></p><p><b>A: </b>I think like many of those who have worked their way up from the farm, he can be a bit of a snob.  Not socially – he’s an engineer, after all – but in the sense of not really wanting to be around people who reminded him of what he worked so hard to escape.  And then, being an engineer, he has the typical engineer’s disregard for those who don’t know the facts when he does.  So, it doesn’t surprise me that this might have led to his courtroom persona creating a mistaken assumption of arrogance.</p></blockquote><p>However, please note that I’m not in the least bit annoyed because <a href=\"http://www.startribune.com/local/18548429.html\">the article</a> was less wildly inaccurate than the usual newspaper story – let alone <a href=\"http://shakespearessister.blogspot.com/2008/05/saturday-schadenfreude.html\">blog post</a> – about my father.  But I think it’s important to put a partially-quoted phrase that could easily be misunderstood in its proper context.</p></div>",
  "content_text": "The actual dialogue, for the record:\nQ:\nthe jurors said they were struck by a comment he made that implied “you’re just the little people” (I don’t recall that one, but I wasn’t always there). The also thought he seems “arrogant” and the fact he compared himself to moses and MLK in his opening made them feel “he was on a mission to be one of them.” -This seems contradictory to what Bob’s brothers and niece said, and even some of the employees who testified against him, who found him down to earth and often helpful. Did your dad have two opposite sides? Or was his courtroom personna misinterpreted?\nA:\nI think like many of those who have worked their way up from the farm, he can be a bit of a snob.  Not socially – he’s an engineer, after all – but in the sense of not really wanting to be around people who reminded him of what he worked so hard to escape.  And then, being an engineer, he has the typical engineer’s disregard for those who don’t know the facts when he does.  So, it doesn’t surprise me that this might have led to his courtroom persona creating a mistaken assumption of arrogance.\nHowever, please note that I’m not in the least bit annoyed because\nthe article\nwas less wildly inaccurate than the usual newspaper story – let alone\nblog post\n– about my father.  But I think it’s important to put a partially-quoted phrase that could easily be misunderstood in its proper context.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-04T07:00:00+00:00"
}