{
  "url": "https://voxday.net/2008/05/02/media-culpa/",
  "scraped_at": "2026-01-08T22:22:00.294983",
  "title": "Media culpa",
  "date_display": "May 2, 2008",
  "date_iso": "2008-05-02T09:11:00+00:00",
  "date_from_url": "2008-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jason Whitlock rightly points out <a href=\"http://msn.foxsports.com/nfl/story/8092720?MSNHPHMA\">how the media has cut its own throat</a> even as his journalistic counterparts <a href=\"http://www.profootballtalk.com/2008/04/30/our-take-on-bissinger-vs-leitch/\">rage, rage, against the dying of their might</a>:</p><blockquote><p>Bloggers, like journalists and writers, play favorites. Leitch’s site troubles a lot of journalists, traditional newspaper writers and broadcasters because we are often the target of his humiliation….  Bloggers might be inspired by their loathing of traditional media, but they are not the cause of our growing irrelevance. We did that with our refusal to adapt to new technology, our clutching of political correctness and the transparency of our agenda-driven “objective journalism.”  We opened the door. And it won’t be closed with bluster and anger.</p></blockquote><p>Now, it’s obvious that journalism’s decline isn’t entirely the result of their faux objectivity, educational incompetence and institutional arrogance.  Journalists are also caught on the wrong side of the technology curve.  But they can either adapt or die.   I’m often described as a blogger, but I’m also a former <i>three-time</i> nationally syndicated columnist.  Sure, I didn’t pursue it as a career and the political syndication was obviously doomed from the start – I told UPS that I couldn’t imagine them pulling it off before signing the contract – but the fact of the matter is that the blog makes my WND column not only more relevant, but better.</p><p>Bloggers are much better than journalists for two reasons.  Number one, we’re smarter on average.  Number two, we tend to have expertise and educations that are not limited to the field of transmitting information from point A to point B.  This happens to be rather useful when there’s a need to clarify, place in context, or otherwise process the information being transmitted.</p></div>",
  "content_text": "Jason Whitlock rightly points out\nhow the media has cut its own throat\neven as his journalistic counterparts\nrage, rage, against the dying of their might\n:\nBloggers, like journalists and writers, play favorites. Leitch’s site troubles a lot of journalists, traditional newspaper writers and broadcasters because we are often the target of his humiliation….  Bloggers might be inspired by their loathing of traditional media, but they are not the cause of our growing irrelevance. We did that with our refusal to adapt to new technology, our clutching of political correctness and the transparency of our agenda-driven “objective journalism.”  We opened the door. And it won’t be closed with bluster and anger.\nNow, it’s obvious that journalism’s decline isn’t entirely the result of their faux objectivity, educational incompetence and institutional arrogance.  Journalists are also caught on the wrong side of the technology curve.  But they can either adapt or die.   I’m often described as a blogger, but I’m also a former\nthree-time\nnationally syndicated columnist.  Sure, I didn’t pursue it as a career and the political syndication was obviously doomed from the start – I told UPS that I couldn’t imagine them pulling it off before signing the contract – but the fact of the matter is that the blog makes my WND column not only more relevant, but better.\nBloggers are much better than journalists for two reasons.  Number one, we’re smarter on average.  Number two, we tend to have expertise and educations that are not limited to the field of transmitting information from point A to point B.  This happens to be rather useful when there’s a need to clarify, place in context, or otherwise process the information being transmitted.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-02T08:11:00+00:00"
}