{
  "url": "https://voxday.net/2008/05/06/message-from-mr-harris/",
  "scraped_at": "2026-01-08T22:22:31.387295",
  "title": "A message from Mr. Harris",
  "date_display": "May 6, 2008",
  "date_iso": "2008-05-06T16:00:00+00:00",
  "date_from_url": "2008-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Many thanks.  I’ll keep <a href=\"http://www.samharris.org/\">the surveys</a> open for at least ten days….  As you might imagine, there are not too many dedicated Christians on my mailing list.  To address the (understandable) concerns of Christians who might fear that the purpose of this work is to attack Christianity. It surely isn’t. The purpose is to design stimuli that Christians and nonbelievers respond to in predictable ways so that we can better understand belief at the level of the brain.</p></blockquote><p>While I have my doubts about the efficacy of the chosen method and have some concerns about the wording of a number of questions that I suspect will lead to false negatives and false positives, Sam’s use of Christians and atheists is a perfectly reasonable one designed to take advantage of the very bright line that divides believers and non-believers on this particular subject.  So, the purpose of the study doesn’t actually have anything directly to do with Christianity at all.  I don’t know whether the data gathered by the surveys will ultimately support or contradict his thesis, but I certainly think it would be interesting to see how the data stacked up if a similar survey were to be given to believers and non-believers in the Theory of Evolution by Natural Selection or the Labor Theory of Value.</p><p>Anyhow, if you haven’t taken all four surveys yet, do take a few minutes and cruise through them.  Sam’s made a few changes, so if you did one or more yesterday, feel free to take another crack.  He notes that there’s been a very heavy atheist response to the study and adds: “<i>The changes I made in the surveys are not that significant, but it would be good to have people taking the latest. Apart from correcting a few typos, the biggest change was in the answer options: “don’t know” has become “neither agree nor disagree”, which is more appropriate, psychometrically speaking.</i>“</p><p><a href=\"http://www.zoomerang.com/Survey/survey-intro.zgi?p=WEB227S9SN8LS7\">Survey A</a></p><p><a href=\"http://www.zoomerang.com/Survey/survey-intro.zgi?p=WEB227S9T78M4K\">Survey B</a></p><p><a href=\"http://www.zoomerang.com/Survey/survey-intro.zgi?p=WEB227S9TR8MFK\">Survey C</a></p><p><a href=\"http://www.zoomerang.com/Survey/survey-intro.zgi?p=WEB227S9U68MPH\">Survey D</a></p><p>I’d be interested to know what questions people thought were the most likely to produce either a false positive or a false negative, and what you think a better variant of that question would have been.  While some of the problems may have stemmed from Sam’s relatively unsophisticated view of Christianity, I think the much more significant problem is the sheer difficulty of nailing down identical core beliefs across a group of more than two individuals.</p><p>My growing suspicion is that the more we zoom into the nature of Man’s mind, the less space for even the slightest pretension to human rationality will we find.  But regardless, I fully support the investigation.</p></div>",
  "content_text": "Many thanks.  I’ll keep\nthe surveys\nopen for at least ten days….  As you might imagine, there are not too many dedicated Christians on my mailing list.  To address the (understandable) concerns of Christians who might fear that the purpose of this work is to attack Christianity. It surely isn’t. The purpose is to design stimuli that Christians and nonbelievers respond to in predictable ways so that we can better understand belief at the level of the brain.\nWhile I have my doubts about the efficacy of the chosen method and have some concerns about the wording of a number of questions that I suspect will lead to false negatives and false positives, Sam’s use of Christians and atheists is a perfectly reasonable one designed to take advantage of the very bright line that divides believers and non-believers on this particular subject.  So, the purpose of the study doesn’t actually have anything directly to do with Christianity at all.  I don’t know whether the data gathered by the surveys will ultimately support or contradict his thesis, but I certainly think it would be interesting to see how the data stacked up if a similar survey were to be given to believers and non-believers in the Theory of Evolution by Natural Selection or the Labor Theory of Value.\nAnyhow, if you haven’t taken all four surveys yet, do take a few minutes and cruise through them.  Sam’s made a few changes, so if you did one or more yesterday, feel free to take another crack.  He notes that there’s been a very heavy atheist response to the study and adds: “\nThe changes I made in the surveys are not that significant, but it would be good to have people taking the latest. Apart from correcting a few typos, the biggest change was in the answer options: “don’t know” has become “neither agree nor disagree”, which is more appropriate, psychometrically speaking.\n“\nSurvey A\nSurvey B\nSurvey C\nSurvey D\nI’d be interested to know what questions people thought were the most likely to produce either a false positive or a false negative, and what you think a better variant of that question would have been.  While some of the problems may have stemmed from Sam’s relatively unsophisticated view of Christianity, I think the much more significant problem is the sheer difficulty of nailing down identical core beliefs across a group of more than two individuals.\nMy growing suspicion is that the more we zoom into the nature of Man’s mind, the less space for even the slightest pretension to human rationality will we find.  But regardless, I fully support the investigation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-06T15:00:00+00:00"
}