{
  "url": "https://voxday.net/2008/05/16/now-she-notices/",
  "scraped_at": "2026-01-08T22:23:46.744164",
  "title": "Now she notices",
  "date_display": "May 16, 2008",
  "date_iso": "2008-05-16T08:29:00+00:00",
  "date_from_url": "2008-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peggy Noonan’s piece is <a href=\"http://online.wsj.com/article/SB121088369408596389.html?mod=todays_columnists\">an almost flawless example</a> of why I have such scorn for the mainstream media and the readers who follow their every predictive blunder and turn-on-a-dime change of tune:</p><blockquote><p>“Members and pundits . . . fail to understand the deep seated antipathy toward the president, the war, gas prices, the economy, foreclosures,” said Rep. Tom Davis of Virginia in a 20-page memo to House GOP leaders.  The party, Mr. Davis told me, is “an airplane flying right into a mountain.”</p><p>The moment when the party could have broken, on principle, with the administration – over the thinking behind and the carrying out of the war, over immigration, spending and the size of government – has passed….  Mr. Bush has squandered the hard-built paternity of 40 years. But so has the party, and so have its leaders. If they had pushed away for serious reasons, they could have separated the party’s fortunes from the president’s. This would have left a painfully broken party, but they wouldn’t be left with a ruined “brand,” as they all say, speaking the language of marketing. And they speak that language because they are marketers, not thinkers. Not serious about policy. Not serious about ideas. And not serious about leadership, only followership.</p></blockquote><p>And certainly not serious about principles.  The problem with Miss Peggy is that the moment at which pundits could predict disaster for Republicans and remain relevant has long passed.  Now, I don’t know about you, but I certainly remember all the Bush defenders at National Review, at WorldNetDaily, and on Fox, some of whom are STILL rabidly defending the ongoing occupations, urging new imperial invasions and asserting the economy is in double-secret good health.  There’s a long, long list of “conservative” blogs and radio shows, from Medved and Hewitt to Malkin and Powerline, that have resolutely insisted that the Bush administration and the Republican Party were on the right track.  Now, of course, many of them are delicately attempting to extricate themselves from their past opinions.  It won’t be long before they all are.  But I encourage you to remember their astute analytical abilities as we approach the summer stretch run of the 2008 election.  Unless and until you understand that most pundits are nothing more than party cheerleaders bent on sucking you into their wishful thinking, you will be susceptible to buying into their attempted manipulations.  Strange, isn’t it, that Miss Peggy didn’t see fit to talk about how much Reagan she sees in Bush these days….</p><p>Meanwhile, John McCain is characteristically engaged in <a href=\"http://www.nytimes.com/2008/05/16/opinion/16fri1.html?hp\">betraying his backers</a>: <i>“Mr. McCain said in a speech that if elected, he will end the war in Iraq by the close of his first term….”</i> I quite look forward to hearing all the outraged comments from the war-cheerleaders and chickenhawks about how McCain is a cut-and-run liberal.</p><p>This WND reader, on the other hand, completely comprehends the root of the problem and who is responsible. <i>“You “conservatives” had your chance – and now you’re stuck. Your beloved AM talk hosts scurrying about, tied up in knots, not knowing what to say or where to go. So you turn to things like trying to pit the Democrat candidates against each other (Operation Chaos), or picking on every little word/phrase a Democrat candidate utters, in hopes of somehow turning it into an issue of importance.  Pitiful.  And what of your beloved (now fractured) Republican Party? It’s in shambles. Why? Because none of you believe in the tenets of liberty – liberty in the vein of self-governance, self-regulation and limited government overall.”</i></p></div>",
  "content_text": "Peggy Noonan’s piece is\nan almost flawless example\nof why I have such scorn for the mainstream media and the readers who follow their every predictive blunder and turn-on-a-dime change of tune:\n“Members and pundits . . . fail to understand the deep seated antipathy toward the president, the war, gas prices, the economy, foreclosures,” said Rep. Tom Davis of Virginia in a 20-page memo to House GOP leaders.  The party, Mr. Davis told me, is “an airplane flying right into a mountain.”\nThe moment when the party could have broken, on principle, with the administration – over the thinking behind and the carrying out of the war, over immigration, spending and the size of government – has passed….  Mr. Bush has squandered the hard-built paternity of 40 years. But so has the party, and so have its leaders. If they had pushed away for serious reasons, they could have separated the party’s fortunes from the president’s. This would have left a painfully broken party, but they wouldn’t be left with a ruined “brand,” as they all say, speaking the language of marketing. And they speak that language because they are marketers, not thinkers. Not serious about policy. Not serious about ideas. And not serious about leadership, only followership.\nAnd certainly not serious about principles.  The problem with Miss Peggy is that the moment at which pundits could predict disaster for Republicans and remain relevant has long passed.  Now, I don’t know about you, but I certainly remember all the Bush defenders at National Review, at WorldNetDaily, and on Fox, some of whom are STILL rabidly defending the ongoing occupations, urging new imperial invasions and asserting the economy is in double-secret good health.  There’s a long, long list of “conservative” blogs and radio shows, from Medved and Hewitt to Malkin and Powerline, that have resolutely insisted that the Bush administration and the Republican Party were on the right track.  Now, of course, many of them are delicately attempting to extricate themselves from their past opinions.  It won’t be long before they all are.  But I encourage you to remember their astute analytical abilities as we approach the summer stretch run of the 2008 election.  Unless and until you understand that most pundits are nothing more than party cheerleaders bent on sucking you into their wishful thinking, you will be susceptible to buying into their attempted manipulations.  Strange, isn’t it, that Miss Peggy didn’t see fit to talk about how much Reagan she sees in Bush these days….\nMeanwhile, John McCain is characteristically engaged in\nbetraying his backers\n:\n“Mr. McCain said in a speech that if elected, he will end the war in Iraq by the close of his first term….”\nI quite look forward to hearing all the outraged comments from the war-cheerleaders and chickenhawks about how McCain is a cut-and-run liberal.\nThis WND reader, on the other hand, completely comprehends the root of the problem and who is responsible.\n“You “conservatives” had your chance – and now you’re stuck. Your beloved AM talk hosts scurrying about, tied up in knots, not knowing what to say or where to go. So you turn to things like trying to pit the Democrat candidates against each other (Operation Chaos), or picking on every little word/phrase a Democrat candidate utters, in hopes of somehow turning it into an issue of importance.  Pitiful.  And what of your beloved (now fractured) Republican Party? It’s in shambles. Why? Because none of you believe in the tenets of liberty – liberty in the vein of self-governance, self-regulation and limited government overall.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-16T07:29:00+00:00"
}