{
  "url": "https://voxday.net/2008/05/15/price-of-pragmatis/",
  "scraped_at": "2026-01-08T22:23:43.058433",
  "title": "The price of pragmatism",
  "date_display": "May 15, 2008",
  "date_iso": "2008-05-15T14:06:00+00:00",
  "date_from_url": "2008-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s only now that Republicans begin to realize that <a href=\"http://www.politico.com/news/stories/0508/10366.html\">they just might be a facing a problem</a>?</p><blockquote><p>For the past 18 months, ever since the 2006 elections, congressional Republicans have been like a hospital patient trying to convince visitors that he is not really all that sick: a bit under the weather; actually feel better than I sound; should be up and about any day; thanks for asking.</p><p>Suddenly — belatedly — all pretense is gone….</p><p>Combined with the 30 seats that the GOP lost in 2006, that would leave the party facing a 70-vote deficit against Democrats in the House — a state of powerlessness reminiscent of Republicans’ long wilderness years in the 1960s and ’70s.</p></blockquote><p>This was all completely predictable.  it was, in fact, predicted.  Consider what I wrote about the turn to Arnold Schwarzenegger as a pragmatic Republican savior <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=20784\">back in 2003</a>: <i>“Pragmatism in politics is self-defeating in the long run. It is a euphemism for the slow sacrifice of one’s principles. The constant substitution of “electable” moderates for principled conservatives is what repeatedly kills the Republican Party and prevents it from ever realizing even a small part of its platform when it is in power.”</i></p><p>I reminded everyone of this again in 2005, in a column entitled “<a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=32413\">The Coming Conservative Collaps</a>e”, which pointed out the inevitable result of the political pragmatism then championed by the likes of Hugh Hewitt and Powerline.  I hope you will keep this track record in mind as the popular pundits of the so-called right encourage you to help them bury conservatives in even deeper beneath the weight of the electoral corpse that is the Republican Party this November.</p><p>It doesn’t surprise me that pundits are wrong from time to time.  Everyone is, including me.  What does surprise me, however, is when people continue to place their trust in those who are reliably and dependably wrong.  Then, of course, I remind myself that most people are idiots and it all makes sense again.</p><p>UPDATE – Even the moderate Republicans <a href=\"http://corner.nationalreview.com/post/?q=MjhhYzcwZDllNzM5ODc5OTQ4MTY0YmEyNDgyY2U5NDU=\">are unhappy</a>:</p><blockquote><p>Every time I hear Senator McCain speak it pushes me a bit closer to the point that I think that I simply cannot vote for him. This coming from a person who voted for Ford and Dole. I listened to Rush at lunch today and it made me so disgusted with the Republicans that I had to turn it off before I had a stroke.</p></blockquote><p>It will be interesting to see if Republican disgust survives the convention and the so-called conservative media’s shrieking about this being the “MOSTEST IMPORTANTEST ELECTION EVER!”</p></div>",
  "content_text": "It’s only now that Republicans begin to realize that\nthey just might be a facing a problem\n?\nFor the past 18 months, ever since the 2006 elections, congressional Republicans have been like a hospital patient trying to convince visitors that he is not really all that sick: a bit under the weather; actually feel better than I sound; should be up and about any day; thanks for asking.\nSuddenly — belatedly — all pretense is gone….\nCombined with the 30 seats that the GOP lost in 2006, that would leave the party facing a 70-vote deficit against Democrats in the House — a state of powerlessness reminiscent of Republicans’ long wilderness years in the 1960s and ’70s.\nThis was all completely predictable.  it was, in fact, predicted.  Consider what I wrote about the turn to Arnold Schwarzenegger as a pragmatic Republican savior\nback in 2003\n:\n“Pragmatism in politics is self-defeating in the long run. It is a euphemism for the slow sacrifice of one’s principles. The constant substitution of “electable” moderates for principled conservatives is what repeatedly kills the Republican Party and prevents it from ever realizing even a small part of its platform when it is in power.”\nI reminded everyone of this again in 2005, in a column entitled “\nThe Coming Conservative Collaps\ne”, which pointed out the inevitable result of the political pragmatism then championed by the likes of Hugh Hewitt and Powerline.  I hope you will keep this track record in mind as the popular pundits of the so-called right encourage you to help them bury conservatives in even deeper beneath the weight of the electoral corpse that is the Republican Party this November.\nIt doesn’t surprise me that pundits are wrong from time to time.  Everyone is, including me.  What does surprise me, however, is when people continue to place their trust in those who are reliably and dependably wrong.  Then, of course, I remind myself that most people are idiots and it all makes sense again.\nUPDATE – Even the moderate Republicans\nare unhappy\n:\nEvery time I hear Senator McCain speak it pushes me a bit closer to the point that I think that I simply cannot vote for him. This coming from a person who voted for Ford and Dole. I listened to Rush at lunch today and it made me so disgusted with the Republicans that I had to turn it off before I had a stroke.\nIt will be interesting to see if Republican disgust survives the convention and the so-called conservative media’s shrieking about this being the “MOSTEST IMPORTANTEST ELECTION EVER!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-15T13:06:00+00:00"
}