{
  "url": "https://voxday.net/2008/05/06/punking-original-cyberpunk/",
  "scraped_at": "2026-01-08T22:22:25.977176",
  "title": "Punking the Original Cyberpunk",
  "date_display": "May 6, 2008",
  "date_iso": "2008-05-06T09:47:00+00:00",
  "date_from_url": "2008-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The OC requests reader reviews of <a href=\"http://rantingroom.blogspot.com/2008/05/cyberpunk-reader-reviews-wanted.html\">a landmark work of science fiction</a>:</p><blockquote><p>I’m starting to collect reader reviews of my Cyberpunk novel. If you’ve read it and want to comment on it or ask some questions about it, please feel free to do so on this thread. If you haven’t read it but think you might want to, you can <a href=\"http://www.brucebethke.com/articles/cyb3rpnk.pdf\">download a pdf of the manuscript</a>.</p></blockquote><p>It’s been a long time since I read <i>Cyberpunk</i>, so I think I’ll take another crack at it before writing a review.  If you haven’t read it yet, give it a whirl; it’s different than you might expect.  The OC’s style is apparent, of course, but the novel has nearly as much in common with Orson Scott Card as with William Gibson.</p></div>",
  "content_text": "The OC requests reader reviews of\na landmark work of science fiction\n:\nI’m starting to collect reader reviews of my Cyberpunk novel. If you’ve read it and want to comment on it or ask some questions about it, please feel free to do so on this thread. If you haven’t read it but think you might want to, you can\ndownload a pdf of the manuscript\n.\nIt’s been a long time since I read\nCyberpunk\n, so I think I’ll take another crack at it before writing a review.  If you haven’t read it yet, give it a whirl; it’s different than you might expect.  The OC’s style is apparent, of course, but the novel has nearly as much in common with Orson Scott Card as with William Gibson.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-06T08:47:00+00:00"
}