{
  "url": "https://voxday.net/2008/05/12/pz-discovers-were-seals_12/",
  "scraped_at": "2026-01-08T22:23:20.607264",
  "title": "PZ discovers were-seals",
  "date_display": "May 12, 2008",
  "date_iso": "2008-05-12T15:00:00+00:00",
  "date_from_url": "2008-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He’s not the only one who is late to notice <a href=\"http://scienceblogs.com/pharyngula/2008/05/mass_market_genre_surprise.php\">the femalization of the fantasy genre</a>.  I was speaking with an executive at a major MMO company last Friday, who asked me in what genre they should set their next MMO.  When I told him “dark romance”, he had no idea what I was talking about.  And I’m not sure he believed me when I told him how popular it is these days:</p><blockquote><p>It’s also been a long, long time since I plumbed that paragon of mass-market genrefication, the warehouse shopping version of a bookstore, and I discovered a new (to me) development….  the real surprise was the second most popular genre that was everywhere on those book shelves: vampire novels. It’s as if Laurell Hamilton and Anne Rice have recently had an unholy tryst and have spawned a scampering horde of little horror-romance novelists who have all skittered off and scrawled out series after series of stories about vampiresses, vampire huntresses, vampire princesses, vampire trailer park queens, and vampire lovers. They all seemed to be by female authors and feature female protagonists, too; some of the covers also blurred into similarity with the romance novels, except that the muscular-breasted Fabio on the cover was also sporting fangs.</p></blockquote><p>I’ve got nothing against vampires or dark fantasy.  In fact, I love Jim Butcher’s books and intend to dabble a bit more in that area at some point in the future.  But fantasy romance is every bit as tiresome as space romance, if a bit bloodier.  And they wonder why boys don’t read or watch television any longer… it’s an increasingly vicious circle that will only get worse.  Now that Jim Baen is gone, how long will it be before the onetime leader in military science fiction begins publishing chick-lit in space or sexy were-seal novels?</p><p>That conversation with the MMO exec was sort of funny.  When he asked me to explain what “dark romance” was, I said that it was just sexy vampires.  There was a long pause, and then he said “seriously?”  I couldn’t help but laugh at the total disbelief in his voice.  And yet, the funniest thing is that despite all the evidence to the contrary, some men STILL think that women are attracted to nice guys.  It’s clearly all about the fangs, metaphorically or otherwise.</p></div>",
  "content_text": "He’s not the only one who is late to notice\nthe femalization of the fantasy genre\n.  I was speaking with an executive at a major MMO company last Friday, who asked me in what genre they should set their next MMO.  When I told him “dark romance”, he had no idea what I was talking about.  And I’m not sure he believed me when I told him how popular it is these days:\nIt’s also been a long, long time since I plumbed that paragon of mass-market genrefication, the warehouse shopping version of a bookstore, and I discovered a new (to me) development….  the real surprise was the second most popular genre that was everywhere on those book shelves: vampire novels. It’s as if Laurell Hamilton and Anne Rice have recently had an unholy tryst and have spawned a scampering horde of little horror-romance novelists who have all skittered off and scrawled out series after series of stories about vampiresses, vampire huntresses, vampire princesses, vampire trailer park queens, and vampire lovers. They all seemed to be by female authors and feature female protagonists, too; some of the covers also blurred into similarity with the romance novels, except that the muscular-breasted Fabio on the cover was also sporting fangs.\nI’ve got nothing against vampires or dark fantasy.  In fact, I love Jim Butcher’s books and intend to dabble a bit more in that area at some point in the future.  But fantasy romance is every bit as tiresome as space romance, if a bit bloodier.  And they wonder why boys don’t read or watch television any longer… it’s an increasingly vicious circle that will only get worse.  Now that Jim Baen is gone, how long will it be before the onetime leader in military science fiction begins publishing chick-lit in space or sexy were-seal novels?\nThat conversation with the MMO exec was sort of funny.  When he asked me to explain what “dark romance” was, I said that it was just sexy vampires.  There was a long pause, and then he said “seriously?”  I couldn’t help but laugh at the total disbelief in his voice.  And yet, the funniest thing is that despite all the evidence to the contrary, some men STILL think that women are attracted to nice guys.  It’s clearly all about the fangs, metaphorically or otherwise.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-12T14:00:00+00:00"
}