{
  "url": "https://voxday.net/2008/05/19/read-then-review/",
  "scraped_at": "2026-01-08T22:24:16.375205",
  "title": "Read, THEN review",
  "date_display": "May 19, 2008",
  "date_iso": "2008-05-19T20:37:00+00:00",
  "date_from_url": "2008-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The first <a href=\"http://www.amazon.com/review/R2ABQS31M37E8F/ref=cm_cr_rdp_perm\">3-star non-reader review</a> I’ve ever seen:</p><blockquote><p><b>Haven’t read this book yet…</b></p><p>…hence the 3-star, kind of middling star rating. I am going to read this book, as soon as I’ve finished Antony Flew’s “There is a God.” But the book I must recommend is a book by Scott Hahn and Benjamin Wiker called “Answering the New Atheism: Dismantling Dawkins’ Case Against God.”</p></blockquote><p>Apparently he thinks that book reviews are an appropriate place to recommend other books.  Or something.  Look, the concept really isn’t that difficult.  FIRST, you read the book.  THEN you write the review.  This applies regardless of how much or how little you think you’re going to like the book, and regardless of how much you think you’ve read about the book or its author.  I’ve read terrible books by authors I love.  I’ve read really good books by authors that I happen to know from personal experience are complete idiots.  That’s why you always have to read the book in order to ascertain its worth… which is largely subjective anyhow.</p><p>Now, I’m flattered that TIA has become enough of a success that other anti-New Atheist authors see fit to reference it in various ways.  It was nice to see it <a href=\"http://www.christianworldviewnetwork.com/article.php/3493/By_David_Noebel\">mentioned by David Noebel</a> in company with the books by Aikman, Berlinski, and Lennox.  As you may recall, I have always contended that TIA is merely one shot in a veritable barrage that will be headed the New Atheists’ way for years to come; it may be one of the better ones to date but it probably will not turn out to be the best.  But regardless… always read before you review.  Always.</p></div>",
  "content_text": "The first\n3-star non-reader review\nI’ve ever seen:\nHaven’t read this book yet…\n…hence the 3-star, kind of middling star rating. I am going to read this book, as soon as I’ve finished Antony Flew’s “There is a God.” But the book I must recommend is a book by Scott Hahn and Benjamin Wiker called “Answering the New Atheism: Dismantling Dawkins’ Case Against God.”\nApparently he thinks that book reviews are an appropriate place to recommend other books.  Or something.  Look, the concept really isn’t that difficult.  FIRST, you read the book.  THEN you write the review.  This applies regardless of how much or how little you think you’re going to like the book, and regardless of how much you think you’ve read about the book or its author.  I’ve read terrible books by authors I love.  I’ve read really good books by authors that I happen to know from personal experience are complete idiots.  That’s why you always have to read the book in order to ascertain its worth… which is largely subjective anyhow.\nNow, I’m flattered that TIA has become enough of a success that other anti-New Atheist authors see fit to reference it in various ways.  It was nice to see it\nmentioned by David Noebel\nin company with the books by Aikman, Berlinski, and Lennox.  As you may recall, I have always contended that TIA is merely one shot in a veritable barrage that will be headed the New Atheists’ way for years to come; it may be one of the better ones to date but it probably will not turn out to be the best.  But regardless… always read before you review.  Always.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-19T19:37:00+00:00"
}