{
  "url": "https://voxday.net/2008/05/25/reflections-on-firefly/",
  "scraped_at": "2026-01-08T22:25:07.388560",
  "title": "Reflections onFirefly",
  "date_display": "May 25, 2008",
  "date_iso": "2008-05-25T10:47:00+00:00",
  "date_from_url": "2008-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, I finally got around to watching the first episode of <i>Firefly</i>.  Or, if I understand the history correctly, what should have been the first episode of Firefly but wasn’t.  I have not one, but two DVD series, and while I’m a casual Whedonista, I simply never got around to firing them up.</p><p>While I like the concept of the space western and found the first episode to be generally entertaining, I didn’t find it terribly hard to understand why the show got cancelled.  Here’s the reasons, which will likely be modified as I work my way through the series:</p><p>1.  It struck me as a bit slow-paced for a modern television show.  The directing and camera angles seemed to be a bit odd as well.  This is just a general impression, not a criticism per se.</p><p>2.  The guy playing the captain is almost spectacularly miscast, which is fatal for a show structured around him.  The guy’s not a bad actor, his lines are fine and you can very clearly see the role that he’s supposed to be playing, but he simply cannot carry it off.  For all that he’s supposed to be a hardass ex-sergeant and ruthless bastard with a heart, he looks and comes off more like a popular middle manager at a large corporation.  If nothing else, he should not have been permitted to have that horribly out-of-place. prep school haircut.  I almost laughed out loud when he was shown finishing up in the bathroom… I was waiting for him to pull out a blowdryer or a hairbrush.</p><p>3.  Whedon would have done a lot better to acquire an existing fictional space universe and written the show within that, or else spent a lot more time on world-building. <i>Firefly</i> in the <i>Traveller</i> universe would have been very cool, for example, but as it is, the generic background and the general lack of effort shows.  The spaceship flying over the stampeding horses bit is clever, though.</p><p>4.  Forced characterization.  Women make horrible soldiers and generally don’t enjoy technical jobs.  This has been true for millenia and it will likely be true for millenia to come.  TV shows can insist on jamming the square pegs into the round holes all they like, but they can’t make it work.  Throwing in an ironic “Mr. Mom” element really doesn’t enhance the suspension of disbelief necessary to enjoy SF/F.  And television producers don’t seem to be aware of how these “reverse-stereotypes” have become cliches; I can’t remember the last time I saw a strapping male athlete beat a soft, spaghetti-armed woman in any fictional physical competition.  The female engineer and Number Two are fine as actresses – the engineer is, anyhow, Number Two strikes me as another miscasting to the extent that she makes an impression at all – but they don’t fit their nominal roles well.</p><p>All that being said, I generally liked the show and can see why other SF fans did too.  I’ll revisit my initial thoughts after I watch the remaining 13 episodes.  At this point, however, I find myself more inclined to mourn the disappearance of <i>The Dresden Files</i>, especially after reading the most recent book in the series.</p></div>",
  "content_text": "So, I finally got around to watching the first episode of\nFirefly\n.  Or, if I understand the history correctly, what should have been the first episode of Firefly but wasn’t.  I have not one, but two DVD series, and while I’m a casual Whedonista, I simply never got around to firing them up.\nWhile I like the concept of the space western and found the first episode to be generally entertaining, I didn’t find it terribly hard to understand why the show got cancelled.  Here’s the reasons, which will likely be modified as I work my way through the series:\n1.  It struck me as a bit slow-paced for a modern television show.  The directing and camera angles seemed to be a bit odd as well.  This is just a general impression, not a criticism per se.\n2.  The guy playing the captain is almost spectacularly miscast, which is fatal for a show structured around him.  The guy’s not a bad actor, his lines are fine and you can very clearly see the role that he’s supposed to be playing, but he simply cannot carry it off.  For all that he’s supposed to be a hardass ex-sergeant and ruthless bastard with a heart, he looks and comes off more like a popular middle manager at a large corporation.  If nothing else, he should not have been permitted to have that horribly out-of-place. prep school haircut.  I almost laughed out loud when he was shown finishing up in the bathroom… I was waiting for him to pull out a blowdryer or a hairbrush.\n3.  Whedon would have done a lot better to acquire an existing fictional space universe and written the show within that, or else spent a lot more time on world-building.\nFirefly\nin the\nTraveller\nuniverse would have been very cool, for example, but as it is, the generic background and the general lack of effort shows.  The spaceship flying over the stampeding horses bit is clever, though.\n4.  Forced characterization.  Women make horrible soldiers and generally don’t enjoy technical jobs.  This has been true for millenia and it will likely be true for millenia to come.  TV shows can insist on jamming the square pegs into the round holes all they like, but they can’t make it work.  Throwing in an ironic “Mr. Mom” element really doesn’t enhance the suspension of disbelief necessary to enjoy SF/F.  And television producers don’t seem to be aware of how these “reverse-stereotypes” have become cliches; I can’t remember the last time I saw a strapping male athlete beat a soft, spaghetti-armed woman in any fictional physical competition.  The female engineer and Number Two are fine as actresses – the engineer is, anyhow, Number Two strikes me as another miscasting to the extent that she makes an impression at all – but they don’t fit their nominal roles well.\nAll that being said, I generally liked the show and can see why other SF fans did too.  I’ll revisit my initial thoughts after I watch the remaining 13 episodes.  At this point, however, I find myself more inclined to mourn the disappearance of\nThe Dresden Files\n, especially after reading the most recent book in the series.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-25T09:47:00+00:00"
}