{
  "url": "https://voxday.net/2008/05/01/roman-rollback/",
  "scraped_at": "2026-01-08T22:21:49.332014",
  "title": "Roman rollback",
  "date_display": "May 1, 2008",
  "date_iso": "2008-05-01T10:59:00+00:00",
  "date_from_url": "2008-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will be interesting to listen to those who supposedly favor democracy complaining about what is indubitably <a href=\"http://www.telegraph.co.uk/news/worldnews/1915484/Rome%27s-new-mayor-promises-purge-of-migrants.html\">the will of the Italian people</a>:</p><blockquote><p>Gianni Alemanno, 50, a firebrand neo-fascist and the first Right-wing mayor of the city since the Second World War, vowed to make Rome “secure” as he was sworn into office after his election at the weekend.  The election of Mr Alemanno confirmed a strong shift to the Right by Italians, who have been sickened by a spate of violent crimes committed by immigrants….</p><p>The new mayor said that his first action would be to begin “immediate expulsions” of the 20,000 immigrants in the city with criminal records.  “We cannot welcome them without discipline,” he said. “We will chase out the delinquents. There are 85 abusive nomad camps to destroy.”</p></blockquote><p>Things are getting very strange when former Fascists are the most rational-sounding politicians on the world stage.  Of course, when it comes to the aggressive rhetoric – Bossi’s smoking rifles, for example – it must always be remembered that these are <i>Italians</i> speaking and they are not exactly the most literal people in the world.</p></div>",
  "content_text": "It will be interesting to listen to those who supposedly favor democracy complaining about what is indubitably\nthe will of the Italian people\n:\nGianni Alemanno, 50, a firebrand neo-fascist and the first Right-wing mayor of the city since the Second World War, vowed to make Rome “secure” as he was sworn into office after his election at the weekend.  The election of Mr Alemanno confirmed a strong shift to the Right by Italians, who have been sickened by a spate of violent crimes committed by immigrants….\nThe new mayor said that his first action would be to begin “immediate expulsions” of the 20,000 immigrants in the city with criminal records.  “We cannot welcome them without discipline,” he said. “We will chase out the delinquents. There are 85 abusive nomad camps to destroy.”\nThings are getting very strange when former Fascists are the most rational-sounding politicians on the world stage.  Of course, when it comes to the aggressive rhetoric – Bossi’s smoking rifles, for example – it must always be remembered that these are\nItalians\nspeaking and they are not exactly the most literal people in the world.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-01T09:59:00+00:00"
}