{
  "url": "https://voxday.net/2008/05/28/science-speaks-for-once/",
  "scraped_at": "2026-01-08T22:25:27.876635",
  "title": "Science speaks, for once",
  "date_display": "May 28, 2008",
  "date_iso": "2008-05-28T09:13:00+00:00",
  "date_from_url": "2008-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vaccine enthusiasts such as <a href=\"http://meganmcardle.theatlantic.com/archives/2008/03/more_parents_forgoing_vaccinat.php\">Megan McArdle</a>, <a href=\"http://scienceblogs.com/insolence/2006/04/vox_inserts_his_foot_into_his.php\">Respectful Insolence</a> and others very much like to point out that there is no scientific link between autism and the modern vaccine schedule.  They particularly enjoy pointing out that no scientific study has been shown that vaccines have any negative effects on childhood development.  And they are correct, but what they never seem to see fit to mention is that this is because no actual scientific studies have been done on the matter.  What have been provided instead are statistical studies, temporal correlations and metastudies that are little more meaningful than the statistical “study” referenced in TIA wherein I proved that atheism is linked to Asperger’s Syndrome.</p><p>However, <a href=\"http://www.telegraph.co.uk/health/main.jhtml?xml=/health/2008/05/26/hautism126.xml&amp;page=2\">that missing evidence of vaccine harm appears to have been detected</a> by a researcher who got around the supposed ethical problem of studying vaccines by using monkeys.  (The vaccine cheerleaders have historically attempted to evade the use of actual science to investigate the matter by claiming it would be unethical to make use of an unvaccinated control group, thereby begging the question.)</p><blockquote><p>The vaccine hypothesis was bolstered recently by a five-year study in monkeys who were given the same vaccinations that American children are routinely given. Last week, Dr Laura Hewitson, a specialist in obstetrics, gynaecology and reproductive sciences at the University of Pittsburgh, told the International Meeting for Autism Research in London that in the double-blind placebo-controlled study, 13 vaccinated animals showed increased aggression, impaired cognitive skills and developmental delay. The three unvaccinated animals in the study developed normally.</p><p>“There was a significant difference between the two groups,” said Hewitson. “The vaccinated group had trouble developing reflexes?… They also became more insular and more aggressive. There was an increase in aggressive behaviour after they had their MMR vaccines, and they stopped exploring their surroundings as much.”</p><p>Abnormal brain activity was found in the monkeys, and higher sensitivity to a naturally occurring brain chemical linked to sleeplessness, hallucinations, lack of social skills and a high pain threshold – all symptoms found in children on the autistic spectrum. The monkeys also exhibited abnormalities of the amygdala, the part of the brain which regulates emotions.</p><p>“We can’t conclude that vaccines cause autism from this study,” said Hewitson, “What we can conclude is that the vaccinated monkeys showed significant negative behavioural differences before and after the MMR.”</p></blockquote><p>Obviously, the matter is far from concluded.  This is a very small study that involves monkeys rather than humans.  It is possible that further studies will achieve different results.  But what the vaccine defenders will have to explain away – and just watch them try to evade the topic and change the subject to the benefits of herd immunity – is that there is direct scientific evidence that the modern American vaccine schedule impairs cognitive development.</p><p>I am not opposed to all vaccines.  I don’t know if the vaccine schedule causes autism or other forms of harm.  But I am opposed to an accelerated schedule that injects far more chemicals into children at a much younger age than was required to achieve the historical results in suppressing various childhood diseases, especially when there is absolutely no scientific evidence to demonstrate that the modern schedule is not harming children.  Those who attempt to paint every critic of the modern vaccine schedule as pre-Industrial ignoramuses bent on living in disease-ridden squalor are being disingenuous, if not downright dishonest, and their opinions about vaccine safety should be taken about as seriously as a vaccine salesman working for a Big Pharma company.</p><p>Consider this: if the vaccine schedule is not harmful to a statistically significant number of children, then why are its advocates so afraid of proper long-term double-blind studies of the sort that Dr. Hewitson has done?</p></div>",
  "content_text": "Vaccine enthusiasts such as\nMegan McArdle\n,\nRespectful Insolence\nand others very much like to point out that there is no scientific link between autism and the modern vaccine schedule.  They particularly enjoy pointing out that no scientific study has been shown that vaccines have any negative effects on childhood development.  And they are correct, but what they never seem to see fit to mention is that this is because no actual scientific studies have been done on the matter.  What have been provided instead are statistical studies, temporal correlations and metastudies that are little more meaningful than the statistical “study” referenced in TIA wherein I proved that atheism is linked to Asperger’s Syndrome.\nHowever,\nthat missing evidence of vaccine harm appears to have been detected\nby a researcher who got around the supposed ethical problem of studying vaccines by using monkeys.  (The vaccine cheerleaders have historically attempted to evade the use of actual science to investigate the matter by claiming it would be unethical to make use of an unvaccinated control group, thereby begging the question.)\nThe vaccine hypothesis was bolstered recently by a five-year study in monkeys who were given the same vaccinations that American children are routinely given. Last week, Dr Laura Hewitson, a specialist in obstetrics, gynaecology and reproductive sciences at the University of Pittsburgh, told the International Meeting for Autism Research in London that in the double-blind placebo-controlled study, 13 vaccinated animals showed increased aggression, impaired cognitive skills and developmental delay. The three unvaccinated animals in the study developed normally.\n“There was a significant difference between the two groups,” said Hewitson. “The vaccinated group had trouble developing reflexes?… They also became more insular and more aggressive. There was an increase in aggressive behaviour after they had their MMR vaccines, and they stopped exploring their surroundings as much.”\nAbnormal brain activity was found in the monkeys, and higher sensitivity to a naturally occurring brain chemical linked to sleeplessness, hallucinations, lack of social skills and a high pain threshold – all symptoms found in children on the autistic spectrum. The monkeys also exhibited abnormalities of the amygdala, the part of the brain which regulates emotions.\n“We can’t conclude that vaccines cause autism from this study,” said Hewitson, “What we can conclude is that the vaccinated monkeys showed significant negative behavioural differences before and after the MMR.”\nObviously, the matter is far from concluded.  This is a very small study that involves monkeys rather than humans.  It is possible that further studies will achieve different results.  But what the vaccine defenders will have to explain away – and just watch them try to evade the topic and change the subject to the benefits of herd immunity – is that there is direct scientific evidence that the modern American vaccine schedule impairs cognitive development.\nI am not opposed to all vaccines.  I don’t know if the vaccine schedule causes autism or other forms of harm.  But I am opposed to an accelerated schedule that injects far more chemicals into children at a much younger age than was required to achieve the historical results in suppressing various childhood diseases, especially when there is absolutely no scientific evidence to demonstrate that the modern schedule is not harming children.  Those who attempt to paint every critic of the modern vaccine schedule as pre-Industrial ignoramuses bent on living in disease-ridden squalor are being disingenuous, if not downright dishonest, and their opinions about vaccine safety should be taken about as seriously as a vaccine salesman working for a Big Pharma company.\nConsider this: if the vaccine schedule is not harmful to a statistically significant number of children, then why are its advocates so afraid of proper long-term double-blind studies of the sort that Dr. Hewitson has done?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-28T08:13:00+00:00"
}