{
  "url": "https://voxday.net/2008/05/22/secret-history-of-star-wars/",
  "scraped_at": "2026-01-08T22:24:38.155295",
  "title": "The Secret History of Star Wars",
  "date_display": "May 22, 2008",
  "date_iso": "2008-05-22T07:10:00+00:00",
  "date_from_url": "2008-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>These days, <a href=\"http://secrethistoryofstarwars.com/The_Secret_History_of_Star_Wars.pdf\">the free ebooks</a> are getting to be more interesting than most of the books published by the literary gatekeepers:</p><blockquote><p>At its simplest, <i>The Secret History of Star Wars</i> is a new full-length e-book exploring the writing and creation of the Star Wars saga. Culled from over 400 sources and filled with quotes from people such as George Lucas, Gary Kurtz and Mark Hamill, it traces all the way back to 1973 to examine how the first 14-page treatment that began the series came to be and was slowly built, draft by draft, year by year and movie by movie. Covering a period of over four decades, you will discover how George Lucas got his ideas for the original film, how Darth Vader was made into Luke Skywalker’s father in 1978 and forever altered the arc of the story, what happened to the infamous third trilogy in the series and how the prequel stories came to be. The book also reveals the style and method of Lucas himself and how his personal life affected and shaped the story, for better and worse. This is a book which challenges many legends surrounding the series and places the films in a new light. For the more casual fan this will be a mesmerising read and for those who think they know everything about the series, prepare to be surprised!</p></blockquote><p>This reminds me of one shining moment of my life.  It was my 30th birthday, when Spacebunny gave me a Ms Pac-man machine and a fair portion of our social circle was witness to the epic humbling of Big Chilly.  He is STILL bitter about the fact that my team did the unthinkable and defeated his team in a game of Star Wars Trivial Pursuit.  I haven’t dared to risk losing my crowing rights in a rematch, but I may consider putting them on the line after reading through this historical tome.</p><p>That’s why I don’t play backgammon either.  Big Chilly and Goatrider played daily backgammon for ages.  After being subjected to repeated blandishments for about five years, I broke down long enough to beat both of them in succession one afternoon, then promptly retired with an undefeated record.  Sometimes, you just have to quit when you’re ahead.</p></div>",
  "content_text": "These days,\nthe free ebooks\nare getting to be more interesting than most of the books published by the literary gatekeepers:\nAt its simplest,\nThe Secret History of Star Wars\nis a new full-length e-book exploring the writing and creation of the Star Wars saga. Culled from over 400 sources and filled with quotes from people such as George Lucas, Gary Kurtz and Mark Hamill, it traces all the way back to 1973 to examine how the first 14-page treatment that began the series came to be and was slowly built, draft by draft, year by year and movie by movie. Covering a period of over four decades, you will discover how George Lucas got his ideas for the original film, how Darth Vader was made into Luke Skywalker’s father in 1978 and forever altered the arc of the story, what happened to the infamous third trilogy in the series and how the prequel stories came to be. The book also reveals the style and method of Lucas himself and how his personal life affected and shaped the story, for better and worse. This is a book which challenges many legends surrounding the series and places the films in a new light. For the more casual fan this will be a mesmerising read and for those who think they know everything about the series, prepare to be surprised!\nThis reminds me of one shining moment of my life.  It was my 30th birthday, when Spacebunny gave me a Ms Pac-man machine and a fair portion of our social circle was witness to the epic humbling of Big Chilly.  He is STILL bitter about the fact that my team did the unthinkable and defeated his team in a game of Star Wars Trivial Pursuit.  I haven’t dared to risk losing my crowing rights in a rematch, but I may consider putting them on the line after reading through this historical tome.\nThat’s why I don’t play backgammon either.  Big Chilly and Goatrider played daily backgammon for ages.  After being subjected to repeated blandishments for about five years, I broke down long enough to beat both of them in succession one afternoon, then promptly retired with an undefeated record.  Sometimes, you just have to quit when you’re ahead.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-22T06:10:00+00:00"
}