{
  "url": "https://voxday.net/2008/05/15/silly-last-words/",
  "scraped_at": "2026-01-08T22:23:44.911745",
  "title": "Silly last words",
  "date_display": "May 15, 2008",
  "date_iso": "2008-05-15T17:03:00+00:00",
  "date_from_url": "2008-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>“Some seem to believe we should negotiate with terrorists and radicals, as if some ingenious argument will persuade them they have been wrong all along,” <a href=\"http://blogs.abcnews.com/politicalradar/2008/05/obama-takes-iss.html\">the President said</a> to the country’s legislative body, “We have heard this foolish delusion before. As Nazi tanks crossed into Poland in 1939, an American senator declared: ‘Lord, if only I could have talked to Hitler, all of this might have been avoided.’ We have an obligation to call this what it is –- the false comfort of appeasement, which has been repeatedly discredited by history.”</p></blockquote><p>So, to George W. Bush, negotiation is appeasement and war is a matter of who is right and who is wrong.  That sort of leaves the possibility of surrender out of the equation, doesn’t it.  Better prepare for a really long war, then, if you’re going to declare no quarter in advance.  I suggest that the belief that your side is inevitably going to win has been far more often discredited by history than appeasement.  Especially when you’ve got no definition of winning, let alone a credible plan to do so.</p></div>",
  "content_text": "“Some seem to believe we should negotiate with terrorists and radicals, as if some ingenious argument will persuade them they have been wrong all along,”\nthe President said\nto the country’s legislative body, “We have heard this foolish delusion before. As Nazi tanks crossed into Poland in 1939, an American senator declared: ‘Lord, if only I could have talked to Hitler, all of this might have been avoided.’ We have an obligation to call this what it is –- the false comfort of appeasement, which has been repeatedly discredited by history.”\nSo, to George W. Bush, negotiation is appeasement and war is a matter of who is right and who is wrong.  That sort of leaves the possibility of surrender out of the equation, doesn’t it.  Better prepare for a really long war, then, if you’re going to declare no quarter in advance.  I suggest that the belief that your side is inevitably going to win has been far more often discredited by history than appeasement.  Especially when you’ve got no definition of winning, let alone a credible plan to do so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-15T16:03:00+00:00"
}