{
  "url": "https://voxday.net/2008/05/06/strong-independent-woman/",
  "scraped_at": "2026-01-08T22:22:29.582932",
  "title": "A strong, independent woman",
  "date_display": "May 6, 2008",
  "date_iso": "2008-05-06T15:57:00+00:00",
  "date_from_url": "2008-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pretty Lady brings to our attention <a href=\"http://www.ohprettylady.blogspot.com/\">a fine female mind held back</a> by The Patriarchy:</p><blockquote><p><b>Former Dartmouth professor Priya Venkatesan has plans to sue both students and colleagues</b></p><p>“One female student was a nose-blower,” says Priya Venkatesan, who, until just a few weeks ago, was a professor in Dartmouth’s writing department. A 1990 graduate of the College, Venkatesan spent the better part of her twenties earning a Masters in Genetics and a PhD in Literature. But those were different days. Now, Venkatesan finds her thoughts occupied by that student who “incessantly disrupted class with her nose-blowing.” Or the one who interrupted her lecture on bioethics with “a real evil look that made me feel very uncomfortable.” Or the one who loudly declared that Lyotard was “cheesy.”</p></blockquote><p>I’m only disappointed that Venkatiswhatever wasn’t cited as proof that women CAN TOO do hard science during my little run in with the Electrolites.  Although, I suppose it would be difficult to do any Nobel-winning work if the janitor persecuted her by emptying trash cans too loudly.  I laughed.  I cried.  Much better than <i>Cats</i>.  No matter how ridiculous you find the equalitarians, they will always manage to exceed even your most cynical estimates.  And you know, I suspect that PZ and company won’t be scoffing for long at my assertion of the peril that Title IX poses for academic science:</p><p><i><a href=\"http://www.dartmouthindependent.com/archives/2008/05/post-9.html\">Ms. Venkatesan’s scholarly specialty is “science studies</a>,” which, as she wrote in a journal article last year, “teaches that scientific knowledge has suspect access to truth…. Scientific facts do not correspond to a natural reality but conform to a social construct.”</i></p></div>",
  "content_text": "Pretty Lady brings to our attention\na fine female mind held back\nby The Patriarchy:\nFormer Dartmouth professor Priya Venkatesan has plans to sue both students and colleagues\n“One female student was a nose-blower,” says Priya Venkatesan, who, until just a few weeks ago, was a professor in Dartmouth’s writing department. A 1990 graduate of the College, Venkatesan spent the better part of her twenties earning a Masters in Genetics and a PhD in Literature. But those were different days. Now, Venkatesan finds her thoughts occupied by that student who “incessantly disrupted class with her nose-blowing.” Or the one who interrupted her lecture on bioethics with “a real evil look that made me feel very uncomfortable.” Or the one who loudly declared that Lyotard was “cheesy.”\nI’m only disappointed that Venkatiswhatever wasn’t cited as proof that women CAN TOO do hard science during my little run in with the Electrolites.  Although, I suppose it would be difficult to do any Nobel-winning work if the janitor persecuted her by emptying trash cans too loudly.  I laughed.  I cried.  Much better than\nCats\n.  No matter how ridiculous you find the equalitarians, they will always manage to exceed even your most cynical estimates.  And you know, I suspect that PZ and company won’t be scoffing for long at my assertion of the peril that Title IX poses for academic science:\nMs. Venkatesan’s scholarly specialty is “science studies\n,” which, as she wrote in a journal article last year, “teaches that scientific knowledge has suspect access to truth…. Scientific facts do not correspond to a natural reality but conform to a social construct.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-06T14:57:00+00:00"
}