{
  "url": "https://voxday.net/2008/05/22/upon-further-review/",
  "scraped_at": "2026-01-08T22:24:43.676913",
  "title": "Upon further review",
  "date_display": "May 22, 2008",
  "date_iso": "2008-05-22T14:00:00+00:00",
  "date_from_url": "2008-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The antigun crowd that attempts to use gun suicide as a rationale for firearms bans might have a few second thoughts once they consider the alternatives.  Especially considering that some nations with higher suicide rates than the USA favor <a href=\"http://www.breitbart.com/article.php?id=D90QL6NG0&amp;show_article=1\">pesticide beverages as their exit ticket of choice</a>:</p><blockquote><p>A Japanese farmer who committed suicide by drinking pesticide vomited the poison at a hospital before he died, releasing toxic fumes that sickened more than 50 people, the hospital said Thursday.  Doctors were trying to pump the 34-year-old man’s stomach when he threw up, spraying his rescuers with chloropicrin, causing 54 doctors, nurses and patients to develop breathing problems and eye sores.  Ten of them were hospitalized themselves, and 90 hospital personnel had to be called in to help with the emergency Wednesday night, said Tomoko Nagao, spokeswoman for the Red Cross Kumamoto Hospital in southern Japan.</p></blockquote><p>Also, there is a fair amount of evidence that more than a few fatal auto accidents are actually cases of suicide-by-car.</p></div>",
  "content_text": "The antigun crowd that attempts to use gun suicide as a rationale for firearms bans might have a few second thoughts once they consider the alternatives.  Especially considering that some nations with higher suicide rates than the USA favor\npesticide beverages as their exit ticket of choice\n:\nA Japanese farmer who committed suicide by drinking pesticide vomited the poison at a hospital before he died, releasing toxic fumes that sickened more than 50 people, the hospital said Thursday.  Doctors were trying to pump the 34-year-old man’s stomach when he threw up, spraying his rescuers with chloropicrin, causing 54 doctors, nurses and patients to develop breathing problems and eye sores.  Ten of them were hospitalized themselves, and 90 hospital personnel had to be called in to help with the emergency Wednesday night, said Tomoko Nagao, spokeswoman for the Red Cross Kumamoto Hospital in southern Japan.\nAlso, there is a fair amount of evidence that more than a few fatal auto accidents are actually cases of suicide-by-car.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-22T13:00:00+00:00"
}