{
  "url": "https://voxday.net/2008/05/23/weirder-than-you-imagine/",
  "scraped_at": "2026-01-08T22:24:51.025526",
  "title": "An iceberg of insanity",
  "date_display": "May 23, 2008",
  "date_iso": "2008-05-23T17:18:00+00:00",
  "date_from_url": "2008-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This weirdness is just the merest frost on the tip of the iceberg of third world insanity <a href=\"http://seattletimes.nwsource.com/html/localnews/2004428244_yee21m.html\">that would be an Obama administration</a>:</p><blockquote><p>A former Army Muslim chaplain at Guantánamo Bay, Cuba, who was cleared of spy accusations is now a Democratic National Convention delegate pledged to Sen. Barack Obama.</p></blockquote><p>A Muslim pledged to B. Hussein Obama.  Imagine that!  Fortunately, I still don’t expect him to win either the nomination or the presidency.  As for Yee, South Texian points out that the well-traveled delegate <a href=\"http://www.southtexian.com/2008/05/coming-home-to-roost.html\">wasn’t exactly exonerated</a> of the various charges he was facing.  Now, I’m no fan of the Bush administration’s various violations of due process and habeus corpus, but there’s something very odd indeed about a man who decides that it’s important to travel to Syria to talk about these abuses.</p></div>",
  "content_text": "This weirdness is just the merest frost on the tip of the iceberg of third world insanity\nthat would be an Obama administration\n:\nA former Army Muslim chaplain at Guantánamo Bay, Cuba, who was cleared of spy accusations is now a Democratic National Convention delegate pledged to Sen. Barack Obama.\nA Muslim pledged to B. Hussein Obama.  Imagine that!  Fortunately, I still don’t expect him to win either the nomination or the presidency.  As for Yee, South Texian points out that the well-traveled delegate\nwasn’t exactly exonerated\nof the various charges he was facing.  Now, I’m no fan of the Bush administration’s various violations of due process and habeus corpus, but there’s something very odd indeed about a man who decides that it’s important to travel to Syria to talk about these abuses.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-23T16:18:00+00:00"
}