{
  "url": "https://voxday.net/2008/05/05/what-sex-did-for-women/",
  "scraped_at": "2026-01-08T22:22:20.458773",
  "title": "What Sex did for women",
  "date_display": "May 5, 2008",
  "date_iso": "2008-05-05T08:15:00+00:00",
  "date_from_url": "2008-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since a number of female blogs appear to be wondering where all the real men went, the answer is: <a href=\"http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/film/article3838953.ece\">anywhere where women who miss “Sex and the City” aren’t</a>.  “Spiting their pretty faces” would have applied here, except for the fact that Horseface was downright heinous, Slagantha was old, disease-infested and literally cancerous, the annoying lawyer was an unattractive, unknowing lesbian, and while the prissy WASP did actually have a pretty face, her body was shaped less like a woman’s than a mutated pear with cankles.</p><blockquote><p>A lot of 21-century working women now view men as fun emotional rollercoasters, as a hobby rather than a vocation. To have singleness represented in such a glamorous way was a relief – in more traditional accounts, a single woman of that age is officially on the shelf….  The seventysomething novelist Fay Weldon, who found the series “impossible not to enjoy”, is reluctant to lend messages to the show, but suggests that one might be: “Find ways to enjoy yourself, but give up the hunt for men. It’s just debasing.”</p></blockquote><p>So, traditional marriage is debasing, but lonely cat-collecting while watching civilization slowly devolve into the third world, that’s liberating!  But it’s nice to know that women are now officially down with single men treating women as objects for temporary amusement.  The amusing thing is that women traditionally viewed strippers as being lower class; in these equalitarian times, being worthy of the pole is the pinnacle of female achievement.</p></div>",
  "content_text": "Since a number of female blogs appear to be wondering where all the real men went, the answer is:\nanywhere where women who miss “Sex and the City” aren’t\n.  “Spiting their pretty faces” would have applied here, except for the fact that Horseface was downright heinous, Slagantha was old, disease-infested and literally cancerous, the annoying lawyer was an unattractive, unknowing lesbian, and while the prissy WASP did actually have a pretty face, her body was shaped less like a woman’s than a mutated pear with cankles.\nA lot of 21-century working women now view men as fun emotional rollercoasters, as a hobby rather than a vocation. To have singleness represented in such a glamorous way was a relief – in more traditional accounts, a single woman of that age is officially on the shelf….  The seventysomething novelist Fay Weldon, who found the series “impossible not to enjoy”, is reluctant to lend messages to the show, but suggests that one might be: “Find ways to enjoy yourself, but give up the hunt for men. It’s just debasing.”\nSo, traditional marriage is debasing, but lonely cat-collecting while watching civilization slowly devolve into the third world, that’s liberating!  But it’s nice to know that women are now officially down with single men treating women as objects for temporary amusement.  The amusing thing is that women traditionally viewed strippers as being lower class; in these equalitarian times, being worthy of the pole is the pinnacle of female achievement.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-05T07:15:00+00:00"
}