{
  "url": "https://voxday.net/2008/05/15/when-rise-is-not-rise/",
  "scraped_at": "2026-01-08T22:23:39.284673",
  "title": "When a rise is not a rise",
  "date_display": "May 15, 2008",
  "date_iso": "2008-05-15T09:28:00+00:00",
  "date_from_url": "2008-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When it’s <a href=\"http://biz.yahoo.com/ap/080514/economy.html?.v=6\">a government statistic</a>:</p><blockquote><p>Consumer prices slowed in April despite the biggest jump in food costs in nearly two decades. But with oil near record levels, Americans should brace for more pain at the pump in coming months….</p><p>For April, energy prices were unchanged and gasoline prices even fell by 2 percent, a decline that would strike motorists as strange, given that they have been watching the price of gasoline rise relentlessly in recent weeks.  However, since gasoline prices normally rise in April, the 5.6 percent increase in gasoline prices for the month was turned into a 2 percent drop after the government adjusted for normal seasonal variations — little comfort to people now paying pump prices that hit a new national record of $3.758 per gallon on Thursday, up nearly 40 cents in the past month.</p></blockquote><p>Yes, you read it correctly, an observable 10.6 percent increase – the 5.6 percent figure is month-on-month and avoids the peaks and troughs – is reported as a 2 percent DECREASE.  This is the reverse side of the “cut” in government spending that is not a decrease, but merely a reduction in the rate of increase.  If you really believe that inflation is anywhere nearly as low as reported, you’re either blind, economically illiterate or stubbornly and willfully stupid.  These “core inflation” games are part of the inflation-hiding techniques I discussed <a href=\"http://www.milobookclub.com/2008/04/23/voxonomics-1-5/\">in an earlier podcast</a>.  And before anyone tries to argue that housing prices are falling, do keep in mind that they aren’t included in the CPI statistics.  If they had been, we would have seen annual double-digit increases in the CPI until recently.</p><p>Now that we’ve established their willingness to blatantly lie, what else do you think they’re trying to deceive you about?</p><p>UPDATE – It’s not just here that <a href=\"http://corner.nationalreview.com/post/?q=OWE1YzlhZjIyMTk5MWI4NzM0ODEyYWI0MTM3MmY0ZDM=\">wages are stagnant</a> even with the significantly understated CPI:</p><blockquote><p>Statistics Canada reported that, after adjustment for inflation, Canadian wage-earners are earning less than in 1980. For example, in British Columbia the median wage-earner earns 11.3% less than a quarter-century ago.</p></blockquote><p>Ain’t working women and immigrants grand!  Mark Steyn points out that the latter come with the additional feature of making the War on Poverty indefinite.</p></div>",
  "content_text": "When it’s\na government statistic\n:\nConsumer prices slowed in April despite the biggest jump in food costs in nearly two decades. But with oil near record levels, Americans should brace for more pain at the pump in coming months….\nFor April, energy prices were unchanged and gasoline prices even fell by 2 percent, a decline that would strike motorists as strange, given that they have been watching the price of gasoline rise relentlessly in recent weeks.  However, since gasoline prices normally rise in April, the 5.6 percent increase in gasoline prices for the month was turned into a 2 percent drop after the government adjusted for normal seasonal variations — little comfort to people now paying pump prices that hit a new national record of $3.758 per gallon on Thursday, up nearly 40 cents in the past month.\nYes, you read it correctly, an observable 10.6 percent increase – the 5.6 percent figure is month-on-month and avoids the peaks and troughs – is reported as a 2 percent DECREASE.  This is the reverse side of the “cut” in government spending that is not a decrease, but merely a reduction in the rate of increase.  If you really believe that inflation is anywhere nearly as low as reported, you’re either blind, economically illiterate or stubbornly and willfully stupid.  These “core inflation” games are part of the inflation-hiding techniques I discussed\nin an earlier podcast\n.  And before anyone tries to argue that housing prices are falling, do keep in mind that they aren’t included in the CPI statistics.  If they had been, we would have seen annual double-digit increases in the CPI until recently.\nNow that we’ve established their willingness to blatantly lie, what else do you think they’re trying to deceive you about?\nUPDATE – It’s not just here that\nwages are stagnant\neven with the significantly understated CPI:\nStatistics Canada reported that, after adjustment for inflation, Canadian wage-earners are earning less than in 1980. For example, in British Columbia the median wage-earner earns 11.3% less than a quarter-century ago.\nAin’t working women and immigrants grand!  Mark Steyn points out that the latter come with the additional feature of making the War on Poverty indefinite.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-15T08:28:00+00:00"
}