{
  "url": "https://voxday.net/2008/05/19/why-women-fall-for-bad-men/",
  "scraped_at": "2026-01-08T22:24:14.509174",
  "title": "Why women fall for bad men",
  "date_display": "May 19, 2008",
  "date_iso": "2008-05-19T16:41:00+00:00",
  "date_from_url": "2008-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s two examples of this in action:</p><blockquote><p>Mr. Obama reveals many things in his books, speeches and interviews but polarity and a tropism toward the extreme are not among them.<br>– Peggy Noonan, WSJ</br></p><p>Obama is, in fact, radical. Hearing him at a rally, he doesn’t sound like it. (Read some of The Audacity of Hope and he doesn’t sound like it.) Goodness knows I know it. I’ve had the experience — you listen to him, you start to project, you start to get caught up. For me, it was only a matter of seconds before I came to.<br>– Katherine Lopez, NRO</br></p></blockquote><p>Like Schiffren and Lopez, I find myself wondering what Miss Peggy was smoking for breakfast with that statement.  Obama is extreme by literally every measure; he holds very few mainstream positions.  But the two statements show how women simply don’t pay attention to the same signals given off by men that other men notice, at least not initially.  Because Obama isn’t shrieking provocative phrases and bugging his eyes out like his overly dramatic pastor, but instead speaks in soothing tones using ambiguous words, they have a tendency to project their own opinions on him rather than paying attention to anything he has done or is specifically articulating.  Pretty Lady is, to a certain extent, correct, in that the change Obama endlessly champions is one of tone.  It is definitely not one of substance, except in that he favors an increase in the expansion of government power over the individual.</p><p>The current “debate” over who would talk to Hitler is a good example.  Bush and McCain are posturing about taking a hardline on negotiating with “terrorists”, the “change” that Obama offers involves the groundbreaking concept of an open line of communications to one’s enemies.  But as everyone taking part in the Thucydides study knows quite well, heralds and ambassadors doing their job in wartime aren’t exactly a new idea.</p><p>Fortunately, I still see no evidence that Obama will win the nomination except the obvious – and please don’t even think about bringing up the delegate count again.  It takes a special sort of individual to bring up the obvious when the entire bloody context is <i>looking beyond the obvious</i>.  Nothing has changed in the last two weeks except for his recent demonstration in West Virginia that he may be one of the very few Democrats capable of losing to John McCain in November despite the massive winds blowing in a Democratic direction.  Now, that would be ironic; the Republicans go ahead and offer up the expected sacrificial lamb, only the clueless wing of the Democratic party insist on nominating the one guy who can’t manage to cut its throat.</p><p>This doesn’t mean they won’t go ahead and give him the nod, of course, but I would be surprised if they did.  It’s not that I’m wedded to my Hillary prediction, it’s simply that given the historical evidence I don’t think it’s wise to base one’s analysis on the Democratic party’s propensity to play by the rules.</p><p>UPDATE – Speaking of the Magic Negro, Rachel Lucas wonders if perhaps <a href=\"http://rachellucas.com/index.php/2008/05/19/two-minutes-hate-obama-tries-to-sound-threatening/\">he’s going to go all Hussein on Republicans</a> over his America-hating wife:</p><blockquote><p>“If they think that they’re going to try to make Michelle an issue in this campaign, they should be careful, because that I find unacceptable — the notion that you start attacking my wife or my family,” he said.</p></blockquote><p>If you don’t want your wife to get attacked, then you should probably make sure that she doesn’t say incredibly stupid things about your presidential candidacy in front of television cameras, Mr. Snory Stinker.  Actually, given what an annoying Ivy League Liberal Michelle Obama is, Obama would be wise to see that she is provided with weekly shots of botox in the tongue for the duration of the campaign.  Her big mouth is potential kryptonite to his Magical Negritude, although considering Obama’s history, he probably wouldn’t hesitate to throw her under the bus to keep company with his first literary agent, his grandmother, and his pastor if that’s what the next step required.</p><p>UPDATE II – Mark Steyn points out that Obama isn’t exactly what you’d call <a href=\"http://corner.nationalreview.com/post/?q=NDFjNGU2Yzk0ZGY1OTNhOWY2MzdiNmMzNjM2YjQ1NmM=\">sound on national sovereignty</a>, or, when you think about it, the English language:</p><blockquote><p>So “leadership” means finding out what other countries want from America and then doing it. Good luck with that.</p></blockquote></div>",
  "content_text": "Here’s two examples of this in action:\nMr. Obama reveals many things in his books, speeches and interviews but polarity and a tropism toward the extreme are not among them.\n– Peggy Noonan, WSJ\nObama is, in fact, radical. Hearing him at a rally, he doesn’t sound like it. (Read some of The Audacity of Hope and he doesn’t sound like it.) Goodness knows I know it. I’ve had the experience — you listen to him, you start to project, you start to get caught up. For me, it was only a matter of seconds before I came to.\n– Katherine Lopez, NRO\nLike Schiffren and Lopez, I find myself wondering what Miss Peggy was smoking for breakfast with that statement.  Obama is extreme by literally every measure; he holds very few mainstream positions.  But the two statements show how women simply don’t pay attention to the same signals given off by men that other men notice, at least not initially.  Because Obama isn’t shrieking provocative phrases and bugging his eyes out like his overly dramatic pastor, but instead speaks in soothing tones using ambiguous words, they have a tendency to project their own opinions on him rather than paying attention to anything he has done or is specifically articulating.  Pretty Lady is, to a certain extent, correct, in that the change Obama endlessly champions is one of tone.  It is definitely not one of substance, except in that he favors an increase in the expansion of government power over the individual.\nThe current “debate” over who would talk to Hitler is a good example.  Bush and McCain are posturing about taking a hardline on negotiating with “terrorists”, the “change” that Obama offers involves the groundbreaking concept of an open line of communications to one’s enemies.  But as everyone taking part in the Thucydides study knows quite well, heralds and ambassadors doing their job in wartime aren’t exactly a new idea.\nFortunately, I still see no evidence that Obama will win the nomination except the obvious – and please don’t even think about bringing up the delegate count again.  It takes a special sort of individual to bring up the obvious when the entire bloody context is\nlooking beyond the obvious\n.  Nothing has changed in the last two weeks except for his recent demonstration in West Virginia that he may be one of the very few Democrats capable of losing to John McCain in November despite the massive winds blowing in a Democratic direction.  Now, that would be ironic; the Republicans go ahead and offer up the expected sacrificial lamb, only the clueless wing of the Democratic party insist on nominating the one guy who can’t manage to cut its throat.\nThis doesn’t mean they won’t go ahead and give him the nod, of course, but I would be surprised if they did.  It’s not that I’m wedded to my Hillary prediction, it’s simply that given the historical evidence I don’t think it’s wise to base one’s analysis on the Democratic party’s propensity to play by the rules.\nUPDATE – Speaking of the Magic Negro, Rachel Lucas wonders if perhaps\nhe’s going to go all Hussein on Republicans\nover his America-hating wife:\n“If they think that they’re going to try to make Michelle an issue in this campaign, they should be careful, because that I find unacceptable — the notion that you start attacking my wife or my family,” he said.\nIf you don’t want your wife to get attacked, then you should probably make sure that she doesn’t say incredibly stupid things about your presidential candidacy in front of television cameras, Mr. Snory Stinker.  Actually, given what an annoying Ivy League Liberal Michelle Obama is, Obama would be wise to see that she is provided with weekly shots of botox in the tongue for the duration of the campaign.  Her big mouth is potential kryptonite to his Magical Negritude, although considering Obama’s history, he probably wouldn’t hesitate to throw her under the bus to keep company with his first literary agent, his grandmother, and his pastor if that’s what the next step required.\nUPDATE II – Mark Steyn points out that Obama isn’t exactly what you’d call\nsound on national sovereignty\n, or, when you think about it, the English language:\nSo “leadership” means finding out what other countries want from America and then doing it. Good luck with that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-05-19T15:41:00+00:00"
}