{
  "url": "https://voxday.net/2011/03/17/75-percen/",
  "scraped_at": "2025-12-13T23:05:39.135199",
  "title": "75 percent",
  "date_display": "March 17, 2011",
  "date_iso": "2011-03-17T20:30:00+00:00",
  "date_from_url": "2011-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>75 percent of the religious persecution around the world <a href=\"http://www.acnuk.org/news.php/205/ukinternational-new-report-reveals-75-percent-of-religious-persecution-is-against-christians\">is directed at Christians</a>.  It is committed by the religious and irreligious alike.  Meanwhile, Western liberals wring their hands about nonexistent persecution of Muslims and hunt for anti-semitic Nazis.  When the militant arms of the Church of England and the Southern Baptists are openly committing murder without fear of prosecution, then perhaps they’ll have a case.  Until then, they should shut up and look at what is happening around the world:</p><blockquote><p>The British branch of the 64-year-old, Vatican-approved organization Aid to the Church in Need today released a report finding that a full 75 percent of religious persecution is currently being carried out against Christians. It further claims that, in two-thirds of the countries, this persecution has worsened. “For millions of Christians around the world,” the report states, “persecution, violence discrimination and suffering are a way of life as they live out their faith.”</p></blockquote><p>Of course, secular society doesn’t care about Christians being persecuted, since a significant portion of it is actively and openly hoping to perform similar persecution itself.  But that’s all right, because as before, the persecution will only serve to forge a stronger Church.</p></div>",
  "content_text": "75 percent of the religious persecution around the world\nis directed at Christians\n.  It is committed by the religious and irreligious alike.  Meanwhile, Western liberals wring their hands about nonexistent persecution of Muslims and hunt for anti-semitic Nazis.  When the militant arms of the Church of England and the Southern Baptists are openly committing murder without fear of prosecution, then perhaps they’ll have a case.  Until then, they should shut up and look at what is happening around the world:\nThe British branch of the 64-year-old, Vatican-approved organization Aid to the Church in Need today released a report finding that a full 75 percent of religious persecution is currently being carried out against Christians. It further claims that, in two-thirds of the countries, this persecution has worsened. “For millions of Christians around the world,” the report states, “persecution, violence discrimination and suffering are a way of life as they live out their faith.”\nOf course, secular society doesn’t care about Christians being persecuted, since a significant portion of it is actively and openly hoping to perform similar persecution itself.  But that’s all right, because as before, the persecution will only serve to forge a stronger Church.",
  "tags": [
    "Christianity",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-17T20:30:00+00:00"
}