{
  "url": "https://voxday.net/2011/03/20/abercrombies-inquisition/",
  "scraped_at": "2025-12-13T23:05:53.897887",
  "title": "Abercrombie’s inquisition",
  "date_display": "March 20, 2011",
  "date_iso": "2011-03-20T08:11:00+00:00",
  "date_from_url": "2011-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, I finished reading Abercrombie’s <i>The First Law</i> series. I quite liked it despite the various criticisms I’ve mentioned in the past, but I wanted to mention something that struck me about the book’s most interesting character, the torturer of the Royal Inquisition, Sand dan Glotka. Abercrombie devotes a great deal of time and attention to Glotka and it shows. His backstory is involved and interesting, his descent from superficial hero to deeply introspective anti-hero is compelling, and he manages to come off in a sympathetic manner despite the many awful deeds he consciously elects to perform. There is only one significant problem with the character of Glotka.</p><p>The greater part of the Inquisition as portrayed in <i>The First Law</i> is a load of historical bollocks.</p><p>Read the rest <a href=\"http://www.blackgate.com/2011/03/20/no-one-expects-it/\">at the Black Gate</a>.</p></div>",
  "content_text": "So, I finished reading Abercrombie’s\nThe First Law\nseries. I quite liked it despite the various criticisms I’ve mentioned in the past, but I wanted to mention something that struck me about the book’s most interesting character, the torturer of the Royal Inquisition, Sand dan Glotka. Abercrombie devotes a great deal of time and attention to Glotka and it shows. His backstory is involved and interesting, his descent from superficial hero to deeply introspective anti-hero is compelling, and he manages to come off in a sympathetic manner despite the many awful deeds he consciously elects to perform. There is only one significant problem with the character of Glotka.\nThe greater part of the Inquisition as portrayed in\nThe First Law\nis a load of historical bollocks.\nRead the rest\nat the Black Gate\n.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-20T08:11:00+00:00"
}