{
  "url": "https://voxday.net/2011/03/17/abusive-social-workers-vs-pedophile/",
  "scraped_at": "2025-12-13T23:05:33.658619",
  "title": "Abusive social workers vs pedophile priests",
  "date_display": "March 17, 2011",
  "date_iso": "2011-03-17T11:43:00+00:00",
  "date_from_url": "2011-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I somehow doubt we’ll ever hear anywhere nearly as much about this, and the rampant child abuse being committed on a daily basis by teachers and other public school personnel, as we do about the behavior of pedophile priests from six decades ago.  But give The New York Times credit for going against left-liberal orthodoxy and <a href=\"http://www.nytimes.com/2011/03/13/nyregion/13homes.html?src=recg&amp;pagewanted=all\">publishing the results</a> of its investigation:</p><blockquote><p>A New York Times investigation over the past year has found widespread problems in the more than 2,000 state-run homes. In hundreds of cases reviewed by The Times, employees who sexually abused, beat or taunted residents were rarely fired, even after repeated offenses, and in many cases, were simply transferred to other group homes run by the state.  And, despite a state law requiring that incidents in which a crime may have been committed be reported to law enforcement, such referrals are rare: State records show that of some 13,000 allegations of abuse in 2009 within state-operated and licensed homes, fewer than 5 percent were referred to law enforcement.</p></blockquote><p>Note that in the United States, 10,667 people made allegations of child sexual abuse between 1950 and 2002 against 4,392 priests.  This represented around 4 percent of the 109,694 priests who were ordained and active during that time.  Given that there were 13,000 allegations of abuse in one state representing one-fifteenth of the U.S. population in 2009 alone, this indicates that state social workers are 951 times more likely to abuse a disabled person under their supervision than a Catholic priest was to sexually abuse a child.</p><p>This doesn’t excuse what the pedophile priests did nor does it excuse the diabolical decision of the Vatican to permit homosexuals to join the priesthood in the first place.  They eminently deserve whatever punishment they receive, in both this world and the next.  But it puts the scale of their evil deeds into the proper statistical perspective.  And while one could argue that physical beatings and psychological abuse are not as bad as sexual abuse and should be omitted from the comparison, one also has to keep in mind that none of the crimes committed by the priests rose to the lethal level either.</p><p>It also shows the tremendous hypocrisy of those who simultaneously claim that there is no truth to religion and yet attempt to hold religious individuals to a higher standard than they hold anyone else.  Social workers and schoolteachers commit far more abuse, sexual and otherwise, than religious leaders, especially if religious leaders who are openly in direct violation of their religious standards are omitted from the equation as logic dictates they must be.  (Why should we be surprised that a man who rejects the Church’s stand on homosexuality should also reject the Church’s stand on the sexual abuse of children or anything else?)  But it is quite clear from the reaction of the state agency to the crimes of its agents that the Catholic Church’s reaction to the crimes committed by its priests was an entirely normal bureaucratic one.  It can, and should, be condemned by Christians who believe in a higher standard for Christian leaders.  Secular individuals, who don’t believe in any such standards, have no such grounds for similar condemnation, especially when they show so little interest in the far more common crimes committed by secular agents of the state.</p></div>",
  "content_text": "I somehow doubt we’ll ever hear anywhere nearly as much about this, and the rampant child abuse being committed on a daily basis by teachers and other public school personnel, as we do about the behavior of pedophile priests from six decades ago.  But give The New York Times credit for going against left-liberal orthodoxy and\npublishing the results\nof its investigation:\nA New York Times investigation over the past year has found widespread problems in the more than 2,000 state-run homes. In hundreds of cases reviewed by The Times, employees who sexually abused, beat or taunted residents were rarely fired, even after repeated offenses, and in many cases, were simply transferred to other group homes run by the state.  And, despite a state law requiring that incidents in which a crime may have been committed be reported to law enforcement, such referrals are rare: State records show that of some 13,000 allegations of abuse in 2009 within state-operated and licensed homes, fewer than 5 percent were referred to law enforcement.\nNote that in the United States, 10,667 people made allegations of child sexual abuse between 1950 and 2002 against 4,392 priests.  This represented around 4 percent of the 109,694 priests who were ordained and active during that time.  Given that there were 13,000 allegations of abuse in one state representing one-fifteenth of the U.S. population in 2009 alone, this indicates that state social workers are 951 times more likely to abuse a disabled person under their supervision than a Catholic priest was to sexually abuse a child.\nThis doesn’t excuse what the pedophile priests did nor does it excuse the diabolical decision of the Vatican to permit homosexuals to join the priesthood in the first place.  They eminently deserve whatever punishment they receive, in both this world and the next.  But it puts the scale of their evil deeds into the proper statistical perspective.  And while one could argue that physical beatings and psychological abuse are not as bad as sexual abuse and should be omitted from the comparison, one also has to keep in mind that none of the crimes committed by the priests rose to the lethal level either.\nIt also shows the tremendous hypocrisy of those who simultaneously claim that there is no truth to religion and yet attempt to hold religious individuals to a higher standard than they hold anyone else.  Social workers and schoolteachers commit far more abuse, sexual and otherwise, than religious leaders, especially if religious leaders who are openly in direct violation of their religious standards are omitted from the equation as logic dictates they must be.  (Why should we be surprised that a man who rejects the Church’s stand on homosexuality should also reject the Church’s stand on the sexual abuse of children or anything else?)  But it is quite clear from the reaction of the state agency to the crimes of its agents that the Catholic Church’s reaction to the crimes committed by its priests was an entirely normal bureaucratic one.  It can, and should, be condemned by Christians who believe in a higher standard for Christian leaders.  Secular individuals, who don’t believe in any such standards, have no such grounds for similar condemnation, especially when they show so little interest in the far more common crimes committed by secular agents of the state.",
  "tags": [
    "politics",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-17T11:43:00+00:00"
}