{
  "url": "https://voxday.net/2011/03/31/alpha-mail-alpha-watching/",
  "scraped_at": "2025-12-13T23:06:53.374297",
  "title": "Alpha Mail: alpha watching",
  "date_display": "March 31, 2011",
  "date_iso": "2011-03-31T17:13:00+00:00",
  "date_from_url": "2011-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which a woman interprets her friends’ fascinated reaction <a href=\"http://alphagameplan.blogspot.com/2011/03/alpha-mail-alpha-watching-and-hamster.html\">to a young buffoon</a>:</p><blockquote><p>Jill: Still bragging! This guy is out of control and he can’t swim for shit though he is totally talking like he can. His buddies were laughing at him behind his back.  Its ok, a girls swim team just showed up, all business. They make him look like the chump he is. Girl power! Haha. I think he just joined the army, lmao, no wonder John is getting out, I would too after I saw this jackass joining.</p><p>Kari: Love the Douche Bags they let in! And most likely he’s an officer lmao!</p><p>Me: A kid with that kind of confidence will land himself a hottie.</p></blockquote><p>As an added bonus, Susan notes how female hypergamy <a href=\"http://alphagameplan.blogspot.com/2011/03/its-small-hypergamous-world.html\">shapes modern film and fiction</a> and confirms its trans-cultural nature in addition to <a href=\"http://www.hookingupsmart.com/2011/03/31/hookinguprealities/straight-talk-on-the-rooftop-sex-controversy/\">sharing her thoughts</a> on the USC rooftop sex scandal, complete with a video of a hilariously futile attempt by two women to somehow shame <i>Tucker Max</i>.  Tucker’s effortless domination of the two women is an object lesson in Displaying High Value; note how they get increasingly bitchy, but submissive as the “debate” continues.</p></div>",
  "content_text": "In which a woman interprets her friends’ fascinated reaction\nto a young buffoon\n:\nJill: Still bragging! This guy is out of control and he can’t swim for shit though he is totally talking like he can. His buddies were laughing at him behind his back.  Its ok, a girls swim team just showed up, all business. They make him look like the chump he is. Girl power! Haha. I think he just joined the army, lmao, no wonder John is getting out, I would too after I saw this jackass joining.\nKari: Love the Douche Bags they let in! And most likely he’s an officer lmao!\nMe: A kid with that kind of confidence will land himself a hottie.\nAs an added bonus, Susan notes how female hypergamy\nshapes modern film and fiction\nand confirms its trans-cultural nature in addition to\nsharing her thoughts\non the USC rooftop sex scandal, complete with a video of a hilariously futile attempt by two women to somehow shame\nTucker Max\n.  Tucker’s effortless domination of the two women is an object lesson in Displaying High Value; note how they get increasingly bitchy, but submissive as the “debate” continues.",
  "tags": [
    "game theory"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-31T16:13:00+00:00"
}