{
  "url": "https://voxday.net/2011/03/11/atheism-and-isla/",
  "scraped_at": "2025-12-13T23:04:57.014702",
  "title": "Atheism and Islam",
  "date_display": "March 11, 2011",
  "date_iso": "2011-03-11T08:27:00+00:00",
  "date_from_url": "2011-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.publiusforum.com/images/atheistsforislam.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.publiusforum.com/images/atheistsforislam.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.publiusforum.com/images/atheistsforislam.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p><i>“There’s also pretty general agreement on which religions are the  toxic worst.   These would be the religions that combine particularly  crazy superstitions with a blood-soaked historical record.  We atheists  think of these as deadly memetic plagues, occasionally found in  relatively well-behaved quiescent phases but prone to bloom into  full-fledged insane murderousness whenever the next charismatic nutcase  wanders along to remind them what they’re really about.</i></p><p><i> </i><i>And which two religions are at the very top of the threat-potential  list?  No prizes for guessing that they are Christianity and Islam, not  necessarily in that order.  Both have relatively tolerable minorities  (Christianity’s Quakers and Unitarians, Islam’s Sufis) but have  extremely dangerous and powerful fundamentalist  groups that effectively  dominate the discourse inside their communities.</i></p><p><i> </i><i>An accident of our time, post-9/11, is that Islam currently appears  the more dangerous of the two.  This is a case both Christoper Hitchens  and myself on this blog have argued, despite our shared detestation of  Christianity.  And it’s why the notion that Western militant atheists  would run en masse to Islam in preference to Christianity is especially  absurd.  That would be trading from bad to worse.”</i></p><p>One of the things I pointed out in <i>The Irrational Atheist</i> is the fundamentally non-scientific perspective of the average militant atheist.  Like the “Dark Ages” philosophers they cite so ignorantly and inaccurately as evidence of their supposed intellectual superiority, they regularly utilize false logic in the place of the observable, empirical evidence.  Thus, they insist that Christianity is indicative of mental illness despite the fact that Christians are happier, live longer, and are much less likely to commit suicide than atheists.  They declare that humanity will become more secular in the face of statistics that show religious growth exploding around the planet.  And they insist that Christianity is liable “to bloom into  full-fledged insane murderousness whenever the next charismatic nutcase  wanders along” even though it is a matter of historical record that atheist leaders are 580 times more likely to kill at least 20,000 of their own followers than Christian leaders and the <i>average </i>atheist crime against humanity is 18.3 MILLION percent worse than the worst slaughter committed by a Christian leader.</p><p>It is always amusing, in light of the martial record of the last ten centuries, to see that the two most-cited examples of Christianity’s supposed predilection for warfare date back to 1095 and 1618.</p><p>As with his earlier post on Game, Eric Raymond demonstrates that <a href=\"http://esr.ibiblio.org/?p=3030\">he hasn’t bothered to do even the smallest amount of relevant research</a> before opining on the matter.  If he had, he would have learned that a) militant atheists do not attack specific religions on the basis of their threat potential, but rather on the basis of the religion to which they are primarily exposed, b) many atheists support the growth of Islam in the West as an alternative to the Christianity for which they harbor a pathological hatred, c) Islamic expansionism is not “an accident of our time”, and d) Christianity is not, and has never been, anywhere near as blood-soaked or crazily superstitious as the paganism that it replaced or the neo-paganism that has replaced it in the post-Christian West.</p><p>One can quite reasonably point out, as Raymond has done, that supporting Islam in the place of Christianity is trading from bad to worse.  But that doesn’t change the fact that many atheists <a href=\"http://www.publiusforum.com/2011/03/09/atheists-for-islam-happy-to-support-religion/\">are doing precisely that</a>, which we must conclude is due to the fact that <i>most atheists are irrational</i>.</p></div>",
  "content_text": "“There’s also pretty general agreement on which religions are the  toxic worst.   These would be the religions that combine particularly  crazy superstitions with a blood-soaked historical record.  We atheists  think of these as deadly memetic plagues, occasionally found in  relatively well-behaved quiescent phases but prone to bloom into  full-fledged insane murderousness whenever the next charismatic nutcase  wanders along to remind them what they’re really about.\nAnd which two religions are at the very top of the threat-potential  list?  No prizes for guessing that they are Christianity and Islam, not  necessarily in that order.  Both have relatively tolerable minorities  (Christianity’s Quakers and Unitarians, Islam’s Sufis) but have  extremely dangerous and powerful fundamentalist  groups that effectively  dominate the discourse inside their communities.\nAn accident of our time, post-9/11, is that Islam currently appears  the more dangerous of the two.  This is a case both Christoper Hitchens  and myself on this blog have argued, despite our shared detestation of  Christianity.  And it’s why the notion that Western militant atheists  would run en masse to Islam in preference to Christianity is especially  absurd.  That would be trading from bad to worse.”\nOne of the things I pointed out in\nThe Irrational Atheist\nis the fundamentally non-scientific perspective of the average militant atheist.  Like the “Dark Ages” philosophers they cite so ignorantly and inaccurately as evidence of their supposed intellectual superiority, they regularly utilize false logic in the place of the observable, empirical evidence.  Thus, they insist that Christianity is indicative of mental illness despite the fact that Christians are happier, live longer, and are much less likely to commit suicide than atheists.  They declare that humanity will become more secular in the face of statistics that show religious growth exploding around the planet.  And they insist that Christianity is liable “to bloom into  full-fledged insane murderousness whenever the next charismatic nutcase  wanders along” even though it is a matter of historical record that atheist leaders are 580 times more likely to kill at least 20,000 of their own followers than Christian leaders and the\naverage\natheist crime against humanity is 18.3 MILLION percent worse than the worst slaughter committed by a Christian leader.\nIt is always amusing, in light of the martial record of the last ten centuries, to see that the two most-cited examples of Christianity’s supposed predilection for warfare date back to 1095 and 1618.\nAs with his earlier post on Game, Eric Raymond demonstrates that\nhe hasn’t bothered to do even the smallest amount of relevant research\nbefore opining on the matter.  If he had, he would have learned that a) militant atheists do not attack specific religions on the basis of their threat potential, but rather on the basis of the religion to which they are primarily exposed, b) many atheists support the growth of Islam in the West as an alternative to the Christianity for which they harbor a pathological hatred, c) Islamic expansionism is not “an accident of our time”, and d) Christianity is not, and has never been, anywhere near as blood-soaked or crazily superstitious as the paganism that it replaced or the neo-paganism that has replaced it in the post-Christian West.\nOne can quite reasonably point out, as Raymond has done, that supporting Islam in the place of Christianity is trading from bad to worse.  But that doesn’t change the fact that many atheists\nare doing precisely that\n, which we must conclude is due to the fact that\nmost atheists are irrational\n.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-11T08:27:00+00:00"
}