{
  "url": "https://voxday.net/2011/03/03/be-prepared/",
  "scraped_at": "2025-12-13T23:04:05.437058",
  "title": "Be prepared",
  "date_display": "March 3, 2011",
  "date_iso": "2011-03-03T09:36:00+00:00",
  "date_from_url": "2011-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since it doesn’t do to wing it before discussing economics with someone who has a reasonably sophisticated grasp on the subject, I thought I had better acquaint myself with the latest statistical updates before attempting to talk about them in public.  What is interesting to note in all of this recent inflation hysteria is that the rate of increase of the CPI-U measure of price changes and the M2 money supply measure are both presently <i>below</i> their 50-year average.  Below is a chart showing the change in CPI-U and M2 on a monthly basis since January 2008.</p><p><a href=\"https://lh3.googleusercontent.com/-VgAiIB_20Og/TW9YTXeC1-I/AAAAAAAAAOc/MdjFvBXDzB4/s1600/CPI-M2_2008-2011.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"317\" src=\"https://lh3.googleusercontent.com/-VgAiIB_20Og/TW9YTXeC1-I/AAAAAAAAAOc/MdjFvBXDzB4/s400/CPI-M2_2008-2011.png\" width=\"400\"/></a> The average annual growth over this period is 1.44% for CPI-U and 6.16% for M2.  That sounds like a lot, but to put it in perspective, the average annual growth over the 51 years from January 1960 to January 2011 is 4.13% for CPI-U and 6.86% for M2.  It’s far below the record three-year periods of 1978-1980 in which CPI-U averaged 11.6% growth per year, or when M2 growth averaged 12.2% growth in 1977-1979.  And while it is absolutely correct to doubt the veracity of these government-published figures – anyone who goes through the M2 statistics won’t miss the discrepancy between various H6 reports <i>for the exact same month</i> – but since these statistics are being used to support the inflationary case, the fact that they are not increasing at an unusually rapid rate must be taken into account.</p><p>It hasn’t escaped my attention that gold, oil, and commodity prices are all increasing.  Neither have I failed to note that other prices are continuing to fall.  The collapse of housing prices, down 31.4% from their 2006 Case-Schiller peak and falling at an annual average rate of 7.9% over the three years covered in the chart above, are much more indicative of a deflationary environment rather than an inflationary one.  How do we balance these contradictory indications?  I expect that is a question that Mr. Schiff will probably want to discuss.</p><p><a href=\"https://lh3.googleusercontent.com/-OBlHLeALXBw/TW9mpBFXkEI/AAAAAAAAAOg/L3G8jdPJMVQ/s1600/Inflation_1960-2010.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"226\" src=\"https://lh3.googleusercontent.com/-OBlHLeALXBw/TW9mpBFXkEI/AAAAAAAAAOg/L3G8jdPJMVQ/s320/Inflation_1960-2010.png\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://lh3.googleusercontent.com/-OBlHLeALXBw/TW9mpBFXkEI/AAAAAAAAAOg/L3G8jdPJMVQ/s320/Inflation_1960-2010.png\" decoding=\"async\" height=\"226\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20226%22%3E%3C/svg%3E\" width=\"320\"/></a>Now, in <a href=\"http://www.youtube.com/watch?v=XYC0ekh-KqU\">the video entitled <i>Four Keynesian Inflations</i></a>, I explain why attempting to measure inflation in terms of CPI and GDP makes absolutely no sense, despite the fact that this is how the financial media always describes it.  But, even if we accept the idea that inflation is the rate of dollar price changes (CPI) in excess of the rate of economic growth measured in dollars (GDP), it should be obvious from the chart entitled <i>Inflation 1960-2010</i>, which subtracts Real GDP from CPI-U, that inflation is neither at a historically high level nor is it even increasing at the moment.  I think the chart demonstrates even more clearly that the Samuelsonian metrics involved are almost completely worthless as they clearly do not measure what they purport to measure, but since they presently frame the context of the mainstream economic analysis, it is necessary to take them into account.</p><p>Since we’re apparently also going to be discussing Federal Reserve Chairman Ben Bernanke, it may be helpful to read <a href=\"http://www.federalreserve.gov/newsevents/testimony/bernanke20110301a.htm\">his most recent report to the Congress</a> if you want to follow along.</p></div>",
  "content_text": "Since it doesn’t do to wing it before discussing economics with someone who has a reasonably sophisticated grasp on the subject, I thought I had better acquaint myself with the latest statistical updates before attempting to talk about them in public.  What is interesting to note in all of this recent inflation hysteria is that the rate of increase of the CPI-U measure of price changes and the M2 money supply measure are both presently\nbelow\ntheir 50-year average.  Below is a chart showing the change in CPI-U and M2 on a monthly basis since January 2008.\nThe average annual growth over this period is 1.44% for CPI-U and 6.16% for M2.  That sounds like a lot, but to put it in perspective, the average annual growth over the 51 years from January 1960 to January 2011 is 4.13% for CPI-U and 6.86% for M2.  It’s far below the record three-year periods of 1978-1980 in which CPI-U averaged 11.6% growth per year, or when M2 growth averaged 12.2% growth in 1977-1979.  And while it is absolutely correct to doubt the veracity of these government-published figures – anyone who goes through the M2 statistics won’t miss the discrepancy between various H6 reports\nfor the exact same month\n– but since these statistics are being used to support the inflationary case, the fact that they are not increasing at an unusually rapid rate must be taken into account.\nIt hasn’t escaped my attention that gold, oil, and commodity prices are all increasing.  Neither have I failed to note that other prices are continuing to fall.  The collapse of housing prices, down 31.4% from their 2006 Case-Schiller peak and falling at an annual average rate of 7.9% over the three years covered in the chart above, are much more indicative of a deflationary environment rather than an inflationary one.  How do we balance these contradictory indications?  I expect that is a question that Mr. Schiff will probably want to discuss.\nNow, in\nthe video entitled\nFour Keynesian Inflations\n, I explain why attempting to measure inflation in terms of CPI and GDP makes absolutely no sense, despite the fact that this is how the financial media always describes it.  But, even if we accept the idea that inflation is the rate of dollar price changes (CPI) in excess of the rate of economic growth measured in dollars (GDP), it should be obvious from the chart entitled\nInflation 1960-2010\n, which subtracts Real GDP from CPI-U, that inflation is neither at a historically high level nor is it even increasing at the moment.  I think the chart demonstrates even more clearly that the Samuelsonian metrics involved are almost completely worthless as they clearly do not measure what they purport to measure, but since they presently frame the context of the mainstream economic analysis, it is necessary to take them into account.\nSince we’re apparently also going to be discussing Federal Reserve Chairman Ben Bernanke, it may be helpful to read\nhis most recent report to the Congress\nif you want to follow along.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-03T09:36:00+00:00"
}