{
  "url": "https://voxday.net/2011/03/13/book-review-heroes/",
  "scraped_at": "2025-12-13T23:05:09.796726",
  "title": "Book review:The Heroes",
  "date_display": "March 13, 2011",
  "date_iso": "2011-03-13T13:34:00+00:00",
  "date_from_url": "2011-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The Heroes</em>, by Joe Abercrombie<br> Orbit (560 pages, $24.99, February 2011)</br></p><p>After the lively discussion of two weeks ago regarding <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-the-fantasy-novel/\">the decline and fall of modern fantasy fiction</a> begun by Leo Grin, I find a certain ironic pleasure in being able to unequivocally declare that Joe Abercrombie is, without question, the best writer of fantasy military fiction being published today.  Were it not for the fictitious medievalesque setting, <em>The Heroes</em> would barely qualify as fantasy at all, but even so, as pure military fiction, Abercrombie compares favorably with David Drake, Ralph Peters, David Weber, and even Tom Clancy post-<em>Red Storm Rising</em>.  I quite enjoyed the book and very much look forward to reading more of Abercrombie’s dark and bloody work in the future.</p><p><em>The Heroes </em>is a stand-alone novel that utilizes many characters from Abercrombie’s popular epic nihilism series, <em>The First Law</em>.   It is a small-scale tale of a three-day battle between the Union and the newly crowned King of the North, and is somewhat reminiscent of historical tales of Gettysburg and other epic battles in the way the action tends to revolve around the physical environment, such as the prehistoric monuments on the large hill that provide the novel with its title.  The title is more than a little tongue-in-cheek, as it happens, given that the theme of the book, smashed home as ferociously as one of Abercrombie’s anti-hero’s heavy swords hammers into the skull of a defeated enemy, is that there are no heroes and victorious battles and heroic deeds alike go ultimately for naught.</p><p>Read the rest of the review of <i>The Heroes</i> <a href=\"http://www.blackgate.com/2011/03/13/book-review-the-heroes-by-joe-abercrombie/\">at the Black Gate</a></p></div>",
  "content_text": "The Heroes\n, by Joe Abercrombie\nOrbit (560 pages, $24.99, February 2011)\nAfter the lively discussion of two weeks ago regarding\nthe decline and fall of modern fantasy fiction\nbegun by Leo Grin, I find a certain ironic pleasure in being able to unequivocally declare that Joe Abercrombie is, without question, the best writer of fantasy military fiction being published today.  Were it not for the fictitious medievalesque setting,\nThe Heroes\nwould barely qualify as fantasy at all, but even so, as pure military fiction, Abercrombie compares favorably with David Drake, Ralph Peters, David Weber, and even Tom Clancy post-\nRed Storm Rising\n.  I quite enjoyed the book and very much look forward to reading more of Abercrombie’s dark and bloody work in the future.\nThe Heroes\nis a stand-alone novel that utilizes many characters from Abercrombie’s popular epic nihilism series,\nThe First Law\n.   It is a small-scale tale of a three-day battle between the Union and the newly crowned King of the North, and is somewhat reminiscent of historical tales of Gettysburg and other epic battles in the way the action tends to revolve around the physical environment, such as the prehistoric monuments on the large hill that provide the novel with its title.  The title is more than a little tongue-in-cheek, as it happens, given that the theme of the book, smashed home as ferociously as one of Abercrombie’s anti-hero’s heavy swords hammers into the skull of a defeated enemy, is that there are no heroes and victorious battles and heroic deeds alike go ultimately for naught.\nRead the rest of the review of\nThe Heroes\nat the Black Gate",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-13T13:34:00+00:00"
}