{
  "url": "https://voxday.net/2011/03/02/claws-of-lion-kitty/",
  "scraped_at": "2025-12-13T23:03:58.113497",
  "title": "Claws of the lion kitty",
  "date_display": "March 2, 2011",
  "date_iso": "2011-03-02T12:43:00+00:00",
  "date_from_url": "2011-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which RS Bakker affects the pose of a philosopher, <a href=\"http://rsbakker.wordpress.com/2011/02/27/conviction-convicts/\">to comic effect</a>:</p><blockquote><p>I find myself wondering about the people who read through Theo’s blog entries, nodding their head and thinking, “Yes–Yes!“</p><p>What, if anything distinguishes us from these guys? Are we every bit as chauvinistic as they are, only in different ways? For a long time now, this has been my impression of many you find in the humanities: self-serving dogmatism concealed behind a facade of pseudo-critical homilies. Only sophisticated where Theo is crude, adroit where Theo is clumsy.</p><p>In teaching practical reasoning I’ve always been troubled by two specific fallacies: the arguments ad hominem and ad populum. If it is the case that we cannot help but unconsciously game ambiguities to secure status and prestige (which is to say, confabulate rationalizations), and if it’s also the case that the our cognitive incapacity and the complexity of the world are such that anything may be rationalized, then the who of the argument becomes all-important, doesn’t it?</p></blockquote><p>Chauvinistic.  Clumsy.  Unsophisticated. Overdeveloped rationalization module.  A dearth of humor.  False sense of intelligence.  Thinks – presumably falsely – has hit the cognitive jackpot.  Buying own bullshit.</p><p>What a delightfully descriptive portrait!  How fortunate it is that Bakker is <i>“troubled”</i> by the fallacious ad hominem argument… at least when teaching practical reasoning.  He would appear to be considerably more comfortable with it when wielding it in a passive-aggressive manner he can barely bring himself to attempt disguising.  Like most mid-witted academics, he has no idea what to do when forced to deal with arguments presented by a member of the cognitive elite that are over his head, so he is forced to resort to the usual character assassination in order to explain why this incomprehensible personage is inferior to his noble, self-questioning self instead of trying to address the arguments.</p><p>I don’t find myself thinking at all about the people who read through Bakker’s posts and agree with them.  They’re morally confused individuals who suffer from either insufficient intelligence or a surfeit of modern secularist dogma which renders them unable accept the conclusions that logic forces them to confront.  So, like overmatched mid-wits usually do, they attempt to move the goalposts, desperately attempt to avoid admitting that they’ve been shown to be incorrect, and launch bitchy little passive-aggressive assaults in an attempt to maintain their self-image as rational and intelligent individuals.</p><p>The thing that I find so tremendously amusing about the half-educated and moderately intelligent is that they so seldom recognize the obvious limits to their knowledge and capacity for reason.  They primarily concern themselves with the superficial aspects of the intellectual life rather than its substance; their conversation is replete with references to their credentials, the name-dropping of authors they haven’t really read, and ideas they only dimly recall.  It was entirely typical example of this type when James claimed to have “read everything Nietzsche has written that I could get my hands on including two biographies” but nevertheless didn’t recognize the term “Preachers of Death” <i>even though I had quoted the entire passage related to it and credited the quote to “Friedrich Nietzsche, Thus Spake Zarathustra, IX”.</i> They don’t recognize or understand their own intellectual heritage because they don’t actually know much about it.  So, it should be no surprise to learn that Bakker’s assumption of the superiority of his own sophistication and moral courage is neither a new nor original action:</p><p><i>But in the loneliest wilderness happeneth the second metamorphosis: here the spirit becometh a lion; freedom will it capture, and lordship in its own wilderness.</i></p><p>Its last Lord it here seeketh: hostile will it be to him, and to its last God; for victory will it struggle with the great dragon.</p><p>What is the great dragon which the spirit is no longer inclined to call Lord and God? “Thou-shalt,” is the great dragon called. But the spirit of the lion saith, “I will.”</p><p>“Thou-shalt,” lieth in its path, sparkling with gold—a scale-covered beast; and on every scale glittereth golden, “Thou shalt!”</p><p>The values of a thousand years glitter on those scales, and thus speaketh the mightiest of all dragons: “All the values of things—glitter on me.</p><p>All values have already been created, and all created values—do I represent. Verily, there shall be no ‘I will’ any more. Thus speaketh the dragon.</p><p>My brethren, wherefore is there need of the lion in the spirit? Why sufficeth not the beast of burden, which renounceth and is reverent?</p><p>To create new values—that, even the lion cannot yet accomplish: but to create itself freedom for new creating—that can the might of the lion do.</p><p>To create itself freedom, and give a holy Nay even unto duty: for that, my brethren, there is need of the lion.</p><p>To assume the right to new values—that is the most formidable assumption for a load-bearing and reverent spirit. Verily, unto such a spirit it is preying, and the work of a beast of prey.</p><p>As its holiest, it once loved “Thou-shalt”: now is it forced to find illusion and arbitrariness even in the holiest things, that it may capture freedom from its love: the lion is needed for this capture.</p><p>Now, I obviously disagree with those who think themselves lions and pronounce themselves superior on the basis of their rejection of the values of “the great dragon”.  (The Biblically astute reader will note the satanic inversion of the metaphorical images there.)  Still more do I oppose those who have undergone the third metamorphosis and think to construct their own value systems capable of serving as a standard by which previous moral values can be judged.  But I can only be amused by the claws of the lion kitties, who scratch harmlessly away as they attempt to build their value system on that shaky foundation which declares “doubt as the highest virtue”, especially when they do it in obvious ignorance of the well-worn path they are treading.</p><p>Bakker and his readers simply do not understand what morals and moral standards are, which is why they are not equipped to even begin the discussion from which Bakker has retreated.  The irony is that Bakker was extolling the virtues of 8-bit greyscale by favorably comparing it with the crudity of the three primary colors, before turning to contemplate the unsophistication of those who he believes can only perceive those three simple colors.  And in doing so, he has revealed how he completely fails to grasp that those three primary colors are all that is necessary to produce the 16.7 million colors that he cannot see.</p><p>I don’t expect Bakker and his kind to agree with me.  I don’t even expect them to understand me.  Let’s face it, if they couldn’t grasp the moral/color analogy,  “lion kitty” is going to be about as intelligible as “hno4^d39fu”.  But we can hope that perhaps one day Bakker will intellectually mature and learn that the step that follows self-questioning is <i>answering those questions</i>.  Some people appear certain because they have never asked themselves any questions about their underlying assumptions and beliefs.  Others do because they have asked all of the pertinent questions and decided upon what reason, research, and experience indicate are the best possible answers.  It is apparent that Bakker can’t tell the difference… which is unsurprising considering that he cannot tell the difference between libertarian morality and conservative legality either.</p></div>",
  "content_text": "In which RS Bakker affects the pose of a philosopher,\nto comic effect\n:\nI find myself wondering about the people who read through Theo’s blog entries, nodding their head and thinking, “Yes–Yes!“\nWhat, if anything distinguishes us from these guys? Are we every bit as chauvinistic as they are, only in different ways? For a long time now, this has been my impression of many you find in the humanities: self-serving dogmatism concealed behind a facade of pseudo-critical homilies. Only sophisticated where Theo is crude, adroit where Theo is clumsy.\nIn teaching practical reasoning I’ve always been troubled by two specific fallacies: the arguments ad hominem and ad populum. If it is the case that we cannot help but unconsciously game ambiguities to secure status and prestige (which is to say, confabulate rationalizations), and if it’s also the case that the our cognitive incapacity and the complexity of the world are such that anything may be rationalized, then the who of the argument becomes all-important, doesn’t it?\nChauvinistic.  Clumsy.  Unsophisticated. Overdeveloped rationalization module.  A dearth of humor.  False sense of intelligence.  Thinks – presumably falsely – has hit the cognitive jackpot.  Buying own bullshit.\nWhat a delightfully descriptive portrait!  How fortunate it is that Bakker is\n“troubled”\nby the fallacious ad hominem argument… at least when teaching practical reasoning.  He would appear to be considerably more comfortable with it when wielding it in a passive-aggressive manner he can barely bring himself to attempt disguising.  Like most mid-witted academics, he has no idea what to do when forced to deal with arguments presented by a member of the cognitive elite that are over his head, so he is forced to resort to the usual character assassination in order to explain why this incomprehensible personage is inferior to his noble, self-questioning self instead of trying to address the arguments.\nI don’t find myself thinking at all about the people who read through Bakker’s posts and agree with them.  They’re morally confused individuals who suffer from either insufficient intelligence or a surfeit of modern secularist dogma which renders them unable accept the conclusions that logic forces them to confront.  So, like overmatched mid-wits usually do, they attempt to move the goalposts, desperately attempt to avoid admitting that they’ve been shown to be incorrect, and launch bitchy little passive-aggressive assaults in an attempt to maintain their self-image as rational and intelligent individuals.\nThe thing that I find so tremendously amusing about the half-educated and moderately intelligent is that they so seldom recognize the obvious limits to their knowledge and capacity for reason.  They primarily concern themselves with the superficial aspects of the intellectual life rather than its substance; their conversation is replete with references to their credentials, the name-dropping of authors they haven’t really read, and ideas they only dimly recall.  It was entirely typical example of this type when James claimed to have “read everything Nietzsche has written that I could get my hands on including two biographies” but nevertheless didn’t recognize the term “Preachers of Death”\neven though I had quoted the entire passage related to it and credited the quote to “Friedrich Nietzsche, Thus Spake Zarathustra, IX”.\nThey don’t recognize or understand their own intellectual heritage because they don’t actually know much about it.  So, it should be no surprise to learn that Bakker’s assumption of the superiority of his own sophistication and moral courage is neither a new nor original action:\nBut in the loneliest wilderness happeneth the second metamorphosis: here the spirit becometh a lion; freedom will it capture, and lordship in its own wilderness.\nIts last Lord it here seeketh: hostile will it be to him, and to its last God; for victory will it struggle with the great dragon.\nWhat is the great dragon which the spirit is no longer inclined to call Lord and God? “Thou-shalt,” is the great dragon called. But the spirit of the lion saith, “I will.”\n“Thou-shalt,” lieth in its path, sparkling with gold—a scale-covered beast; and on every scale glittereth golden, “Thou shalt!”\nThe values of a thousand years glitter on those scales, and thus speaketh the mightiest of all dragons: “All the values of things—glitter on me.\nAll values have already been created, and all created values—do I represent. Verily, there shall be no ‘I will’ any more. Thus speaketh the dragon.\nMy brethren, wherefore is there need of the lion in the spirit? Why sufficeth not the beast of burden, which renounceth and is reverent?\nTo create new values—that, even the lion cannot yet accomplish: but to create itself freedom for new creating—that can the might of the lion do.\nTo create itself freedom, and give a holy Nay even unto duty: for that, my brethren, there is need of the lion.\nTo assume the right to new values—that is the most formidable assumption for a load-bearing and reverent spirit. Verily, unto such a spirit it is preying, and the work of a beast of prey.\nAs its holiest, it once loved “Thou-shalt”: now is it forced to find illusion and arbitrariness even in the holiest things, that it may capture freedom from its love: the lion is needed for this capture.\nNow, I obviously disagree with those who think themselves lions and pronounce themselves superior on the basis of their rejection of the values of “the great dragon”.  (The Biblically astute reader will note the satanic inversion of the metaphorical images there.)  Still more do I oppose those who have undergone the third metamorphosis and think to construct their own value systems capable of serving as a standard by which previous moral values can be judged.  But I can only be amused by the claws of the lion kitties, who scratch harmlessly away as they attempt to build their value system on that shaky foundation which declares “doubt as the highest virtue”, especially when they do it in obvious ignorance of the well-worn path they are treading.\nBakker and his readers simply do not understand what morals and moral standards are, which is why they are not equipped to even begin the discussion from which Bakker has retreated.  The irony is that Bakker was extolling the virtues of 8-bit greyscale by favorably comparing it with the crudity of the three primary colors, before turning to contemplate the unsophistication of those who he believes can only perceive those three simple colors.  And in doing so, he has revealed how he completely fails to grasp that those three primary colors are all that is necessary to produce the 16.7 million colors that he cannot see.\nI don’t expect Bakker and his kind to agree with me.  I don’t even expect them to understand me.  Let’s face it, if they couldn’t grasp the moral/color analogy,  “lion kitty” is going to be about as intelligible as “hno4^d39fu”.  But we can hope that perhaps one day Bakker will intellectually mature and learn that the step that follows self-questioning is\nanswering those questions\n.  Some people appear certain because they have never asked themselves any questions about their underlying assumptions and beliefs.  Others do because they have asked all of the pertinent questions and decided upon what reason, research, and experience indicate are the best possible answers.  It is apparent that Bakker can’t tell the difference… which is unsurprising considering that he cannot tell the difference between libertarian morality and conservative legality either.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-02T12:43:00+00:00"
}