{
  "url": "https://voxday.net/2011/03/15/divorce-domino/",
  "scraped_at": "2025-12-13T23:05:22.629681",
  "title": "The divorce domino",
  "date_display": "March 15, 2011",
  "date_iso": "2011-03-15T11:44:00+00:00",
  "date_from_url": "2011-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I often find myself thinking that it would really behoove the chattering class to consider getting out of the large coastal cities <a href=\"http://www.nytimes.com/2011/03/13/magazine/mag-13Monogmy-t.html?_r=1&amp;partner=rss&amp;emc=rss\">before making grand, sweeping conclusions about modern society</a>.  It often appears to escape the mid-witted would-be intellectuals there that as large and influential as those cities might be, they only represent a small portion of the American population.</p><blockquote><p>On Thanksgiving 2008, Dana Adam Shapiro, a few years removed from his Oscar nomination for directing the documentary “Murderball,” visited his childhood home in Boston to find that a good friend of his was divorcing. The friend had been married for three years and, like Shapiro, was in his mid-30s. (Shapiro is now 37.) This was the fourth divorce that Shapiro heard about just that month. In fact, after absorbing the news, he sat down to make a list of all the couples he knew, under the age of 40, whose marriages had already broken up. He came up with 14 names.</p></blockquote><p>I am older than Shapiro.  I am married.  If I make a list of all the couples that I know whose marriages broke up before the age of 40, I can come up with a grand total of three.  (I’m assuming the writer meant “couples” rather than “names of individuals in broken couples” here.)  I can stretch that to seven if I include couples that I don’t know very well.  That represents less than 10 percent of the married couples under 44 that I know.  Regardless of whether I look at the Shoreview Bible Study, which has only seen one divorce out of 15+ couples, or simply look at the marriages of our closest friends, where six couples out of six remain married, it seems absurd to present what is a potentially useful documentary on why married couples who break up do so as if the number of couples doing so is unbelievably high.</p><p>This is not to say that all of those marriages are equally happy, that any of them are immune to the possibility of breakup, or that there is nothing to be learned from looking at the fate of failed marriages.  I cannot sit and view the relationships of others as a “smug married” not when both my parents and Spacebunny’s parents are divorced.  But we can either learn from the negative examples of others or repeat them, and I am optimistic that Spacebunny and I are intelligent and observant enough to successfully manage the former.  And since I wouldn’t conclude, from the basis of my personal experience, that divorce is very unusual and rare, so why would someone from the opposite end of the spectrum do so?</p><p>There is some reason to believe that Shapiro’s perception of marriage is a warped one caused by his choice of the wrong friends.  As with obesity, divorce appears to be somewhat contagious.  If those you consider your peers divorce over what is not infrequently either blatant narcissism or petty issues, it is much easier for you to justify doing so.  Whereas on the other hand, if you see your peers sticking together in spite of him being a fundamental pain in the ass or her being an irritating bitch, divorce over lesser quotidian offenses is all but unthinkable.</p><p>Of course, it doesn’t hurt to know that grass is just grass, wherever you go.  Unless you’re married to a genuine psycho bitch, a frigid woman, or an unfaithful one, the woman you know is always better than the one you don’t.</p><p>It’s not hard to see the common thread in the three examples of failed marriages provided.  “It’s all about me.”  If your feelings for someone else are predominantly shaped by how they feel about you or what they provide for you, you probably shouldn’t get married.  You’re not fit for it.</p></div>",
  "content_text": "I often find myself thinking that it would really behoove the chattering class to consider getting out of the large coastal cities\nbefore making grand, sweeping conclusions about modern society\n.  It often appears to escape the mid-witted would-be intellectuals there that as large and influential as those cities might be, they only represent a small portion of the American population.\nOn Thanksgiving 2008, Dana Adam Shapiro, a few years removed from his Oscar nomination for directing the documentary “Murderball,” visited his childhood home in Boston to find that a good friend of his was divorcing. The friend had been married for three years and, like Shapiro, was in his mid-30s. (Shapiro is now 37.) This was the fourth divorce that Shapiro heard about just that month. In fact, after absorbing the news, he sat down to make a list of all the couples he knew, under the age of 40, whose marriages had already broken up. He came up with 14 names.\nI am older than Shapiro.  I am married.  If I make a list of all the couples that I know whose marriages broke up before the age of 40, I can come up with a grand total of three.  (I’m assuming the writer meant “couples” rather than “names of individuals in broken couples” here.)  I can stretch that to seven if I include couples that I don’t know very well.  That represents less than 10 percent of the married couples under 44 that I know.  Regardless of whether I look at the Shoreview Bible Study, which has only seen one divorce out of 15+ couples, or simply look at the marriages of our closest friends, where six couples out of six remain married, it seems absurd to present what is a potentially useful documentary on why married couples who break up do so as if the number of couples doing so is unbelievably high.\nThis is not to say that all of those marriages are equally happy, that any of them are immune to the possibility of breakup, or that there is nothing to be learned from looking at the fate of failed marriages.  I cannot sit and view the relationships of others as a “smug married” not when both my parents and Spacebunny’s parents are divorced.  But we can either learn from the negative examples of others or repeat them, and I am optimistic that Spacebunny and I are intelligent and observant enough to successfully manage the former.  And since I wouldn’t conclude, from the basis of my personal experience, that divorce is very unusual and rare, so why would someone from the opposite end of the spectrum do so?\nThere is some reason to believe that Shapiro’s perception of marriage is a warped one caused by his choice of the wrong friends.  As with obesity, divorce appears to be somewhat contagious.  If those you consider your peers divorce over what is not infrequently either blatant narcissism or petty issues, it is much easier for you to justify doing so.  Whereas on the other hand, if you see your peers sticking together in spite of him being a fundamental pain in the ass or her being an irritating bitch, divorce over lesser quotidian offenses is all but unthinkable.\nOf course, it doesn’t hurt to know that grass is just grass, wherever you go.  Unless you’re married to a genuine psycho bitch, a frigid woman, or an unfaithful one, the woman you know is always better than the one you don’t.\nIt’s not hard to see the common thread in the three examples of failed marriages provided.  “It’s all about me.”  If your feelings for someone else are predominantly shaped by how they feel about you or what they provide for you, you probably shouldn’t get married.  You’re not fit for it.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-15T11:44:00+00:00"
}