{
  "url": "https://voxday.net/2011/03/06/fantasy-romance-and-omega-author/",
  "scraped_at": "2025-12-13T23:04:25.586964",
  "title": "Fantasy, Romance, and the Omega author",
  "date_display": "March 6, 2011",
  "date_iso": "2011-03-06T20:24:00+00:00",
  "date_from_url": "2011-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What is the essential difference between Fantasy and Romance?  The lines appear to be increasingly blurred these days.  While the RWA didn’t include the teen romance of the <em>Twilight </em>series on its list of bestselling romance novels, the current list includes books from the <em>Ghostwalkers </em>and <em>Immortals After Dark</em> series and one can hardly walk through a grocery store, let alone a bookstore, without encountering an interspecies love triangle between a woman, a vampire, and a werewolf.  For some reason, it would appear that two vampires, or alternatively, two werewolves, seldom share common tastes in human women.  So there is magic and the supernatural in Romance and there is no dearth of love and sex in Fantasy.  So what is the difference?</p><p>Aside from the covers, arguably the most reliable method to distinguish between the two is this:  In Romance, men typically pursue women.  Sometimes they even <em>ravish </em>them.  In Fantasy, on the other hand, men are almost invariably surprised by female interest in them.</p><p>Read the rest <a href=\"http://www.blackgate.com/2011/03/06/fantasy-romance-and-the-omega-author/\">at the Black Gate</a>.</p></div>",
  "content_text": "What is the essential difference between Fantasy and Romance?  The lines appear to be increasingly blurred these days.  While the RWA didn’t include the teen romance of the\nTwilight\nseries on its list of bestselling romance novels, the current list includes books from the\nGhostwalkers\nand\nImmortals After Dark\nseries and one can hardly walk through a grocery store, let alone a bookstore, without encountering an interspecies love triangle between a woman, a vampire, and a werewolf.  For some reason, it would appear that two vampires, or alternatively, two werewolves, seldom share common tastes in human women.  So there is magic and the supernatural in Romance and there is no dearth of love and sex in Fantasy.  So what is the difference?\nAside from the covers, arguably the most reliable method to distinguish between the two is this:  In Romance, men typically pursue women.  Sometimes they even\nravish\nthem.  In Fantasy, on the other hand, men are almost invariably surprised by female interest in them.\nRead the rest\nat the Black Gate\n.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-06T20:24:00+00:00"
}