{
  "url": "https://voxday.net/2011/03/25/gateway-to-apostasy/",
  "scraped_at": "2025-12-13T23:06:25.711522",
  "title": "The gateway to apostasy",
  "date_display": "March 25, 2011",
  "date_iso": "2011-03-25T21:04:00+00:00",
  "date_from_url": "2011-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roissy provides a reason <a href=\"http://roissy.wordpress.com/2011/03/25/dating-a-vegetarian-girl-is-a-sacrifice/\">why men should never date vegetarian women</a>… as if it wasn’t already a priori apparent:</p><blockquote><p>I have a theory that the reason grazers react so violently to bacon aroma is because it smells SO GOOD it might tempt them to betray the Gaianist religion for which they have sacrificed so many years in penitential devotion. Bacon is the gateway meat to apostasy.</p></blockquote><p>I don’t have a problem with most freak dieters, having been one myself in the past.  But I absolutely loathe vegetarians.  As Roissy observes, it’s not a diet, it’s a religion.  And a particularly stupid religion at that.  Vegetarians are among the only people on the planet who make Scientologists look rational and reasonable.</p><p>I think he’s onto something with regards to the bacon thing, however.  I was seated next to a vegetarian who hadn’t eaten any meat for five years, but the excellent <i>jambon negra</i> on the start plate provided too much of a temptation for her and after “just trying a bite”, she ended up helping polish the whole thing off.</p></div>",
  "content_text": "Roissy provides a reason\nwhy men should never date vegetarian women\n… as if it wasn’t already a priori apparent:\nI have a theory that the reason grazers react so violently to bacon aroma is because it smells SO GOOD it might tempt them to betray the Gaianist religion for which they have sacrificed so many years in penitential devotion. Bacon is the gateway meat to apostasy.\nI don’t have a problem with most freak dieters, having been one myself in the past.  But I absolutely loathe vegetarians.  As Roissy observes, it’s not a diet, it’s a religion.  And a particularly stupid religion at that.  Vegetarians are among the only people on the planet who make Scientologists look rational and reasonable.\nI think he’s onto something with regards to the bacon thing, however.  I was seated next to a vegetarian who hadn’t eaten any meat for five years, but the excellent\njambon negra\non the start plate provided too much of a temptation for her and after “just trying a bite”, she ended up helping polish the whole thing off.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-25T21:04:00+00:00"
}