{
  "url": "https://voxday.net/2011/03/28/great-gay-sou/",
  "scraped_at": "2025-12-13T23:06:38.604868",
  "title": "The great gay soul",
  "date_display": "March 28, 2011",
  "date_iso": "2011-03-28T13:00:00+00:00",
  "date_from_url": "2011-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A new biography of Gandhi tends to confirm Winston Churchill’s <a href=\"http://www.dailymail.co.uk/news/article-1370554/Gandhi-left-wife-live-male-lover-new-book-claims.html\">view of the man</a>:</p><blockquote><p>Mahatma Gandhi was bisexual and left his wife to live with a German-Jewish bodybuilder, a controversial biography has claimed.  The leader of the Indian independence movement is said to have been deeply in love with Hermann Kallenbach….  Kallenbach was born in Germany but emigrated to South Africa where he became a wealthy architect.</p><p>Gandhi was working there and Kallenbach became one of his closest disciples.  The pair lived together for two years in a house Kallenbach built in South Africa and pledged to give one another ‘more love, and yet more love . . . such love as they hope the world has not yet seen.’</p></blockquote><p>A love story involving Gandhi, Jews, and gays… no doubt we can expect to see at least three major Hollywood movies made out of this.  As NRO’s Andrew Stuttaford points out, Gandhi was actually <a href=\"http://www.nationalreview.com/corner/263175/feet-clay-andrew-stuttaford\">an irrelevant failure</a>, for the most part.  Of his four primary goals, the only one in which he succeeded was the Indian independence movement.  Of course, the British were clearly going to withdraw from India anyhow with or without pressure from Gandhi’s movement.</p><p>And it shouldn’t be too surprising that like many who profess to love humanity in general, Gandhi tended to despise individuals with whom he came into contact.  In other words, he was somewhat of a proto-Hillary Clinton.</p></div>",
  "content_text": "A new biography of Gandhi tends to confirm Winston Churchill’s\nview of the man\n:\nMahatma Gandhi was bisexual and left his wife to live with a German-Jewish bodybuilder, a controversial biography has claimed.  The leader of the Indian independence movement is said to have been deeply in love with Hermann Kallenbach….  Kallenbach was born in Germany but emigrated to South Africa where he became a wealthy architect.\nGandhi was working there and Kallenbach became one of his closest disciples.  The pair lived together for two years in a house Kallenbach built in South Africa and pledged to give one another ‘more love, and yet more love . . . such love as they hope the world has not yet seen.’\nA love story involving Gandhi, Jews, and gays… no doubt we can expect to see at least three major Hollywood movies made out of this.  As NRO’s Andrew Stuttaford points out, Gandhi was actually\nan irrelevant failure\n, for the most part.  Of his four primary goals, the only one in which he succeeded was the Indian independence movement.  Of course, the British were clearly going to withdraw from India anyhow with or without pressure from Gandhi’s movement.\nAnd it shouldn’t be too surprising that like many who profess to love humanity in general, Gandhi tended to despise individuals with whom he came into contact.  In other words, he was somewhat of a proto-Hillary Clinton.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-28T12:00:00+00:00"
}