{
  "url": "https://voxday.net/2011/03/30/has-tea-party-given-up/",
  "scraped_at": "2025-12-13T23:06:46.026064",
  "title": "Has the Tea Party given up?",
  "date_display": "March 30, 2011",
  "date_iso": "2011-03-30T10:03:00+00:00",
  "date_from_url": "2011-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know if they have, but it is clear that they would be perfectly justified in doing so.  An Instapundit reader <a href=\"http://pajamasmedia.com/instapundit/117684/\">emails</a>:</p><blockquote><p>“Can’t speak for the whole tea party but I can speak for many of those with jobs, kids, limited resources and true love for this country. The issues facing this country at the federal level are so large and complex that only honest people have a chance of fixing the problems. We all know that we are not dealing with an honest opposition. We are dealing with people who are only trying to maintain their disgusting grip on the levers of power. See Shumer just today. This country is about to crash in a horrible “Man caused disaster” and we can not get that message to the vast majority of people. Our leadership plays games while we know the Titanic is sinking. The question is do we actually get pitch forks and march on Washington and gig them (If we did we would be terrorists) or do we hunker down and prepare for the worse. Unfortunately, most people are doing the later and it is only a matter of time before they will be proven right. If you publish this, I want our leaders in Washington to hear only one thing. Stop the games and the power grabs and do what it right. The future of your country and your children/grandchildren are depending on you and you are play politics. Shame on you. Wake up and do your duty.”</p></blockquote><p>The problem is that it isn’t just the Democratic opposition that isn’t honest.  It is the majority of the Republicans who were endorsed by the Tea Party as well.  Even worse, the same accusation of dishonesty – or at least logical incoherence – can be directed at the greater part of the Tea Party itself, since most Tea Partiers support the expensive military occupations and kinetic actions in Afghanistan, Iraq, and now Libya.  It is impossible to simultaneously argue that the nation is near bankruptcy and that it can afford to continue its foreign military adventures and foreign aid grants.  As long as the Tea Party attempts to do so, we will know it does not merit being taken seriously.</p><p>Speaking of unserious, a Tea Party darling, Sen. Marco Rubio, demonstrates that he is not to be taken seriously either: <i>“I will vote to defeat an increase in the debt limit unless it is the last one we ever authorize and is accompanied by a plan for fundamental tax reform, an overhaul of our regulatory structure, a cut to discretionary spending, a balanced-budget amendment, and reforms to save Social Security, Medicare and Medicaid.”</i></p><p>In other words, he’s willing to throw away a concrete limitation on the size of government for nebulous promises of future responsibility.  I can’t help but be reminded of Reagan’s last-ever 1986 immigration amnesty… and given that Florida is now represented by a Hispanic senator, I think it is fairly obvious how much credence should be placed in the effectiveness of those promises.</p></div>",
  "content_text": "I don’t know if they have, but it is clear that they would be perfectly justified in doing so.  An Instapundit reader\nemails\n:\n“Can’t speak for the whole tea party but I can speak for many of those with jobs, kids, limited resources and true love for this country. The issues facing this country at the federal level are so large and complex that only honest people have a chance of fixing the problems. We all know that we are not dealing with an honest opposition. We are dealing with people who are only trying to maintain their disgusting grip on the levers of power. See Shumer just today. This country is about to crash in a horrible “Man caused disaster” and we can not get that message to the vast majority of people. Our leadership plays games while we know the Titanic is sinking. The question is do we actually get pitch forks and march on Washington and gig them (If we did we would be terrorists) or do we hunker down and prepare for the worse. Unfortunately, most people are doing the later and it is only a matter of time before they will be proven right. If you publish this, I want our leaders in Washington to hear only one thing. Stop the games and the power grabs and do what it right. The future of your country and your children/grandchildren are depending on you and you are play politics. Shame on you. Wake up and do your duty.”\nThe problem is that it isn’t just the Democratic opposition that isn’t honest.  It is the majority of the Republicans who were endorsed by the Tea Party as well.  Even worse, the same accusation of dishonesty – or at least logical incoherence – can be directed at the greater part of the Tea Party itself, since most Tea Partiers support the expensive military occupations and kinetic actions in Afghanistan, Iraq, and now Libya.  It is impossible to simultaneously argue that the nation is near bankruptcy and that it can afford to continue its foreign military adventures and foreign aid grants.  As long as the Tea Party attempts to do so, we will know it does not merit being taken seriously.\nSpeaking of unserious, a Tea Party darling, Sen. Marco Rubio, demonstrates that he is not to be taken seriously either:\n“I will vote to defeat an increase in the debt limit unless it is the last one we ever authorize and is accompanied by a plan for fundamental tax reform, an overhaul of our regulatory structure, a cut to discretionary spending, a balanced-budget amendment, and reforms to save Social Security, Medicare and Medicaid.”\nIn other words, he’s willing to throw away a concrete limitation on the size of government for nebulous promises of future responsibility.  I can’t help but be reminded of Reagan’s last-ever 1986 immigration amnesty… and given that Florida is now represented by a Hispanic senator, I think it is fairly obvious how much credence should be placed in the effectiveness of those promises.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-30T09:03:00+00:00"
}