{
  "url": "https://voxday.net/2011/03/20/here-we-go-again-3/",
  "scraped_at": "2025-12-13T23:05:55.728831",
  "title": "Here we go again",
  "date_display": "March 20, 2011",
  "date_iso": "2011-03-20T14:30:00+00:00",
  "date_from_url": "2011-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Somehow, I doubt that <a href=\"http://abcnews.go.com/International/libya-international-military-coalition-launch-assault-gadhafi-forces/story?id=13174246\">the third time</a> will prove the charm:</p><blockquote><p>U.S. and British warships have reportedly launched the opening salvo of the intervention in Libya — called Operation Odyssey Dawn — firing some 110 Tomahawk cruise missiles at Qaddafi anti-air defenses, mostly on the coast of Western Libya and extending between Tripoli and Benghazi. Word is that U.S. AFRICOM will run the first few days of the operation in an effort to “shape the battlefield” before turning over command to another member of the coalition.</p><p>The initial launch also included the launching of American electronic warfare aircraft.</p></blockquote><p>Nothing spells decline and fall like a bankrupt, demographically dying empire getting entangled in one unnecessary military conflict after another.</p><p>UPDATE – This is certainly <a href=\"http://www.politico.com/news/stories/0311/51595.html\">an amusing development</a>: <i>A hard-core group of liberal House Democrats is questioning the constitutionality of U.S. missile strikes against Libya, with one lawmaker raising the prospect of impeachment during a Democratic Caucus conference call on Saturday.</i></p><p>I told you that the Democratic elders want to get rid of Obama a while ago.  There is absolutely no way they want him leading them into the 2012 electoral campaign.  And it would be absolutely hilarious to see <i>Democrats</i> leading the impeachment charge against this lamest of first-term lame ducks.</p></div>",
  "content_text": "Somehow, I doubt that\nthe third time\nwill prove the charm:\nU.S. and British warships have reportedly launched the opening salvo of the intervention in Libya — called Operation Odyssey Dawn — firing some 110 Tomahawk cruise missiles at Qaddafi anti-air defenses, mostly on the coast of Western Libya and extending between Tripoli and Benghazi. Word is that U.S. AFRICOM will run the first few days of the operation in an effort to “shape the battlefield” before turning over command to another member of the coalition.\nThe initial launch also included the launching of American electronic warfare aircraft.\nNothing spells decline and fall like a bankrupt, demographically dying empire getting entangled in one unnecessary military conflict after another.\nUPDATE – This is certainly\nan amusing development\n:\nA hard-core group of liberal House Democrats is questioning the constitutionality of U.S. missile strikes against Libya, with one lawmaker raising the prospect of impeachment during a Democratic Caucus conference call on Saturday.\nI told you that the Democratic elders want to get rid of Obama a while ago.  There is absolutely no way they want him leading them into the 2012 electoral campaign.  And it would be absolutely hilarious to see\nDemocrats\nleading the impeachment charge against this lamest of first-term lame ducks.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-20T14:30:00+00:00"
}