{
  "url": "https://voxday.net/2011/03/24/it-would-appear-i-was-wrong/",
  "scraped_at": "2025-12-13T23:06:18.324928",
  "title": "It would appear I was wrong",
  "date_display": "March 24, 2011",
  "date_iso": "2011-03-24T15:38:00+00:00",
  "date_from_url": "2011-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in November 2008, just before Obama was elected, I declared: <i>“you know that between Zimbabwe, Kenya, and the Congo, <a href=\"http://www.milobookclub.com/2008/11/02/flock-of-c-gulls/\">a President Obama is going to invade Africa</a> one way or another.”</i></p><p>But he’s running out of time and obviously Obama is not invading Libya, he is merely <a href=\"http://www.slate.com/id/2074367/\">engaging in kinetic action</a> there.  I’m not sure which is more amusing, all of the usual doubletalk meant to indicate that engaging in acts of war is not warfare or the contortions with which Obama’s most liberal supporters are attempting to excuse their erstwhile peace candidate as he not only continues Bush’s two wars, but launches a third one.</p><p>But I know what is more amusing still… the neocons’ new fears that their World Democratic Revolution blueprint, which involves making use of the UN to sideline the U.S. Congress and justify attacking anyone the neocons want to attack, could lead to a US attack on Israel if utilized by the new Arab democrats in the Middle East.</p><p>All of which goes to underline the inherent wisdom in pre-WWI American isolationism.  Wars may be wildly profitable to some, but they reliably lead to circumstances that are unforeseen by even the most perspicacious profiteers.</p></div>",
  "content_text": "Back in November 2008, just before Obama was elected, I declared:\n“you know that between Zimbabwe, Kenya, and the Congo,\na President Obama is going to invade Africa\none way or another.”\nBut he’s running out of time and obviously Obama is not invading Libya, he is merely\nengaging in kinetic action\nthere.  I’m not sure which is more amusing, all of the usual doubletalk meant to indicate that engaging in acts of war is not warfare or the contortions with which Obama’s most liberal supporters are attempting to excuse their erstwhile peace candidate as he not only continues Bush’s two wars, but launches a third one.\nBut I know what is more amusing still… the neocons’ new fears that their World Democratic Revolution blueprint, which involves making use of the UN to sideline the U.S. Congress and justify attacking anyone the neocons want to attack, could lead to a US attack on Israel if utilized by the new Arab democrats in the Middle East.\nAll of which goes to underline the inherent wisdom in pre-WWI American isolationism.  Wars may be wildly profitable to some, but they reliably lead to circumstances that are unforeseen by even the most perspicacious profiteers.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-24T15:38:00+00:00"
}