{
  "url": "https://voxday.net/2011/03/04/its-because-you-collectively-suck/",
  "scraped_at": "2025-12-13T23:04:16.431367",
  "title": "It’s because you collectively suck",
  "date_display": "March 4, 2011",
  "date_iso": "2011-03-04T18:00:00+00:00",
  "date_from_url": "2011-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Teachers are in shock at <a href=\"http://www.nytimes.com/2011/03/03/education/03teacher.html?src=me&amp;ref=general\">the contempt in which they are held</a>:</p><blockquote><p>The jabs Erin Parker has heard about her job have stunned her. <i>Oh you pathetic teachers</i>, read the online comments and placards of counterdemonstrators. <i>You are glorified baby sitters who leave work at 3 p.m. You deserve minimum wage.</i></p><p>“You feel punched in the stomach,” said Ms. Parker, a high school science teacher in Madison, Wis., where public employees’ two-week occupation of the State Capitol has stalled but not deterred the governor’s plan to try to strip them of bargaining rights….  Around the country, many teachers see demands to cut their income, benefits and say in how schools are run through collective bargaining as attacks not just on their livelihoods, but on their value to society.</p><p>Even in a country that is of two minds about teachers — Americans glowingly recall the ones who changed their lives, but think the job with its summers off is cushy — education experts say teachers have rarely been the targets of such scorn from politicians and voters.</p></blockquote><p>Perhaps the reason for this scorn might have something to do with little facts such as <a href=\"http://www.nytimes.com/2011/03/04/nyregion/04remedial.html?hpw=&amp;pagewanted=all\">these</a>:</p><p><i>About three-quarters of the 17,500 freshmen at the community colleges this year have needed remedial instruction in reading, writing or math, and nearly a quarter of the freshmen have required such instruction in all three subjects. In the past five years, a subset of students deemed “triple low remedial” — with the most severe deficits in all three subjects — has doubled, to 1,000.  The reasons are familiar but were reinforced last month by startling statistics from state education officials: fewer than half of all New York State students who graduated from high school in 2009 were prepared for college or careers, as measured by state Regents tests in English and math. In New York City, the proportion was 23 percent.</i></p><p>I would argue that most public school teachers don’t even deserve minimum wage, for the obvious reason that they can’t do their jobs.  Fire them all, tear down the system, and replace it with a technological spin on homeschooling for those parents who can’t homeschool.  I guarantee the results would not merely be superior, but <i>vastly</i> superior.</p></div>",
  "content_text": "Teachers are in shock at\nthe contempt in which they are held\n:\nThe jabs Erin Parker has heard about her job have stunned her.\nOh you pathetic teachers\n, read the online comments and placards of counterdemonstrators.\nYou are glorified baby sitters who leave work at 3 p.m. You deserve minimum wage.\n“You feel punched in the stomach,” said Ms. Parker, a high school science teacher in Madison, Wis., where public employees’ two-week occupation of the State Capitol has stalled but not deterred the governor’s plan to try to strip them of bargaining rights….  Around the country, many teachers see demands to cut their income, benefits and say in how schools are run through collective bargaining as attacks not just on their livelihoods, but on their value to society.\nEven in a country that is of two minds about teachers — Americans glowingly recall the ones who changed their lives, but think the job with its summers off is cushy — education experts say teachers have rarely been the targets of such scorn from politicians and voters.\nPerhaps the reason for this scorn might have something to do with little facts such as\nthese\n:\nAbout three-quarters of the 17,500 freshmen at the community colleges this year have needed remedial instruction in reading, writing or math, and nearly a quarter of the freshmen have required such instruction in all three subjects. In the past five years, a subset of students deemed “triple low remedial” — with the most severe deficits in all three subjects — has doubled, to 1,000.  The reasons are familiar but were reinforced last month by startling statistics from state education officials: fewer than half of all New York State students who graduated from high school in 2009 were prepared for college or careers, as measured by state Regents tests in English and math. In New York City, the proportion was 23 percent.\nI would argue that most public school teachers don’t even deserve minimum wage, for the obvious reason that they can’t do their jobs.  Fire them all, tear down the system, and replace it with a technological spin on homeschooling for those parents who can’t homeschool.  I guarantee the results would not merely be superior, but\nvastly\nsuperior.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-04T18:00:00+00:00"
}