{
  "url": "https://voxday.net/2011/03/01/killer-vaccines/",
  "scraped_at": "2025-12-13T23:03:54.410609",
  "title": "Killer vaccines",
  "date_display": "March 1, 2011",
  "date_iso": "2011-03-01T19:14:00+00:00",
  "date_from_url": "2011-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Supreme Court renders vaccine makers <a href=\"http://www.cbsnews.com/8301-504564_162-20034847-504564.html\">unaccountable</a>:</p><blockquote><p>The Supreme Court today gave vaccine manufacturers greater protection from lawsuits by parents who say vaccinations harmed their children, ruling that Congress had blocked those types of claims against drug makers.  In a 6-2 decision, the justices said Congress had effectively shut the courthouse door to these lawsuits in 1986, when it created a special vaccine court designed to compensate victims of vaccine injuries.</p></blockquote><p>Contrary to the common assumption, I am not uniformly anti-vaccine.  I think some vaccines make sense and represent a reasonable risk.  On the other hand, I simply do not understand those people, especially left-wing scientists, who insist that all vaccines are intrinsically good.  The following questions spring to mind:</p><p>1.  Why does profiting from vaccines rather than anything else magically make a corporation intrinsically good rather than presumably greedy and evil?</p><p>2.  How can one justify vaccines for non-lethal and non-communicable diseases on the basis of historically lethal and highly communicable diseases?</p><p>3.  If vaccines are not capable of causing serious harm to children, <i>why is it necessary to set up a system to compensate children who have been harmed and immunize vaccine makers from financial responsibility for those their products have injured</i>?</p><p>4.  How can anyone rationally claim that science uniformly supports vaccine use when no empirical studies that actually utilize the scientific method of experimentation and observation are utilized in testing vaccine safety?</p><p>5.  Why do pro-vaccine advocates attack those who don’t vaccinate their children according to the vaccine schedule <i>when doctors specifically tell parents not to vaccinate</i> their children according to the schedule if an older sibling has had a negative reaction to a vaccine?</p><p>6.  Why do pro-vaccine advocates assume that vaccines which are proven to be safe for adults are also safe for infants and toddlers who weigh a fraction of what an adult weighs?</p><p>Now, based on the principle of “follow the money”, I am confident that the current vaccine schedule is significantly more dangerous than most anti-vaccine people believe.  If they were anywhere nearly as safe as advertised, it wouldn’t be necessary to provide special protection to the manufacturers.  That doesn’t mean that it doesn’t make sense to get vaccinized for tetanus and polio, but why on Earth would it make sense to take any risk, however slight, in order to avoid getting a cold or the chicken pox?</p></div>",
  "content_text": "The Supreme Court renders vaccine makers\nunaccountable\n:\nThe Supreme Court today gave vaccine manufacturers greater protection from lawsuits by parents who say vaccinations harmed their children, ruling that Congress had blocked those types of claims against drug makers.  In a 6-2 decision, the justices said Congress had effectively shut the courthouse door to these lawsuits in 1986, when it created a special vaccine court designed to compensate victims of vaccine injuries.\nContrary to the common assumption, I am not uniformly anti-vaccine.  I think some vaccines make sense and represent a reasonable risk.  On the other hand, I simply do not understand those people, especially left-wing scientists, who insist that all vaccines are intrinsically good.  The following questions spring to mind:\n1.  Why does profiting from vaccines rather than anything else magically make a corporation intrinsically good rather than presumably greedy and evil?\n2.  How can one justify vaccines for non-lethal and non-communicable diseases on the basis of historically lethal and highly communicable diseases?\n3.  If vaccines are not capable of causing serious harm to children,\nwhy is it necessary to set up a system to compensate children who have been harmed and immunize vaccine makers from financial responsibility for those their products have injured\n?\n4.  How can anyone rationally claim that science uniformly supports vaccine use when no empirical studies that actually utilize the scientific method of experimentation and observation are utilized in testing vaccine safety?\n5.  Why do pro-vaccine advocates attack those who don’t vaccinate their children according to the vaccine schedule\nwhen doctors specifically tell parents not to vaccinate\ntheir children according to the schedule if an older sibling has had a negative reaction to a vaccine?\n6.  Why do pro-vaccine advocates assume that vaccines which are proven to be safe for adults are also safe for infants and toddlers who weigh a fraction of what an adult weighs?\nNow, based on the principle of “follow the money”, I am confident that the current vaccine schedule is significantly more dangerous than most anti-vaccine people believe.  If they were anywhere nearly as safe as advertised, it wouldn’t be necessary to provide special protection to the manufacturers.  That doesn’t mean that it doesn’t make sense to get vaccinized for tetanus and polio, but why on Earth would it make sense to take any risk, however slight, in order to avoid getting a cold or the chicken pox?",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-01T19:14:00+00:00"
}