{
  "url": "https://voxday.net/2011/03/07/krugman-is-correc/",
  "scraped_at": "2025-12-13T23:04:29.277579",
  "title": "Krugman is correct!",
  "date_display": "March 7, 2011",
  "date_iso": "2011-03-07T14:15:00+00:00",
  "date_from_url": "2011-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Will wonders never cease!  Of course, I note that what he gets right is <a href=\"http://www.nytimes.com/2011/03/07/opinion/07krugman.html?hp\">an observation on education and technology</a> that has absolutely nothing to do with economics.  It would appear his track record of uniform failure on that subject remains spotless:</p><blockquote><p>It is a truth universally acknowledged that education is the key to economic success. Everyone knows that the jobs of the future will require ever higher levels of skill. That’s why, in an appearance Friday with former Florida Gov. Jeb Bush, President Obama declared that “If we want more good news on the jobs front then we’ve got to make more investments in education.”</p><p>But what everyone knows is wrong.</p><p>The day after the Obama-Bush event, The Times published an article about the growing use of software to perform legal research. Computers, it turns out, can quickly analyze millions of documents, cheaply performing a task that used to require armies of lawyers and paralegals. In this case, then, technological progress is actually reducing the demand for highly educated workers.  And legal research isn’t an isolated example. As the article points out, software has also been replacing engineers in such tasks as chip design. More broadly, the idea that modern technology eliminates only menial jobs, that well-educated workers are clear winners, may dominate popular discussion, but it’s actually decades out of date.</p></blockquote><p>It is actually not a question.  Everyone is wrong to the extent that they believe education has anything to do with macroeconomic success, and this is easily observable even if one omits the technology factor.  In Tunisia, for example, 57 percent of those entering the labor market <a href=\"http://mises.org/daily/5045/The-Education-Bubble-Is-Fuel-for-Revolt\">have college degrees</a>.  The comparable figure in the United States is 30 percent.  But the Tunisian unemployment rate among those college graduates is 45 percent, three times higher than the national rate.   That’s why so many of them who participated in the recent revolt a) spoke English, and b) had the time to participate.</p><p>What those who make a fetish of education simply fail to understand is that knowledge – particularly knowledge of the sort that is sufficiently codified to be included in a college textbook – is not intrinsically valuable to anyone.  It makes no difference to me if you happen to know the date of Agincourt, the periodic table of the elements, or the correct way to utilize Pascal parameters.  Your knowledge of those things isn’t going to produce any value to me, since profit is only created through human action.</p><p>The fallacious idea underlying the link between education and economic growth is that expanding an individual’s knowledge base will enable him to engage in more economically productive action.  But this completely depends upon a) what that knowledge is, b) the ability and willingness of workers to translate knowledge into action, and c) the utility of those actions in producing goods and services that customers want or need.  In most cases, the education that is being provided fails on all three points.</p><p>Producing more lawyers, social workers, and Womyn’s Studies majors is not going to generate any productive economic activity, indeed, it is guaranteed to generate activity that will increase economic contraction by inhibiting the free flow of goods and services.  Combine that with the development of technologies that will significantly reduce the need for human service providers such as lawyers, paralegals, engineers, and teachers, and there is a perfect storm of mass white-collar unemployment on the horizon, not only in the United States, but all around the world.</p></div>",
  "content_text": "Will wonders never cease!  Of course, I note that what he gets right is\nan observation on education and technology\nthat has absolutely nothing to do with economics.  It would appear his track record of uniform failure on that subject remains spotless:\nIt is a truth universally acknowledged that education is the key to economic success. Everyone knows that the jobs of the future will require ever higher levels of skill. That’s why, in an appearance Friday with former Florida Gov. Jeb Bush, President Obama declared that “If we want more good news on the jobs front then we’ve got to make more investments in education.”\nBut what everyone knows is wrong.\nThe day after the Obama-Bush event, The Times published an article about the growing use of software to perform legal research. Computers, it turns out, can quickly analyze millions of documents, cheaply performing a task that used to require armies of lawyers and paralegals. In this case, then, technological progress is actually reducing the demand for highly educated workers.  And legal research isn’t an isolated example. As the article points out, software has also been replacing engineers in such tasks as chip design. More broadly, the idea that modern technology eliminates only menial jobs, that well-educated workers are clear winners, may dominate popular discussion, but it’s actually decades out of date.\nIt is actually not a question.  Everyone is wrong to the extent that they believe education has anything to do with macroeconomic success, and this is easily observable even if one omits the technology factor.  In Tunisia, for example, 57 percent of those entering the labor market\nhave college degrees\n.  The comparable figure in the United States is 30 percent.  But the Tunisian unemployment rate among those college graduates is 45 percent, three times higher than the national rate.   That’s why so many of them who participated in the recent revolt a) spoke English, and b) had the time to participate.\nWhat those who make a fetish of education simply fail to understand is that knowledge – particularly knowledge of the sort that is sufficiently codified to be included in a college textbook – is not intrinsically valuable to anyone.  It makes no difference to me if you happen to know the date of Agincourt, the periodic table of the elements, or the correct way to utilize Pascal parameters.  Your knowledge of those things isn’t going to produce any value to me, since profit is only created through human action.\nThe fallacious idea underlying the link between education and economic growth is that expanding an individual’s knowledge base will enable him to engage in more economically productive action.  But this completely depends upon a) what that knowledge is, b) the ability and willingness of workers to translate knowledge into action, and c) the utility of those actions in producing goods and services that customers want or need.  In most cases, the education that is being provided fails on all three points.\nProducing more lawyers, social workers, and Womyn’s Studies majors is not going to generate any productive economic activity, indeed, it is guaranteed to generate activity that will increase economic contraction by inhibiting the free flow of goods and services.  Combine that with the development of technologies that will significantly reduce the need for human service providers such as lawyers, paralegals, engineers, and teachers, and there is a perfect storm of mass white-collar unemployment on the horizon, not only in the United States, but all around the world.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-07T14:15:00+00:00"
}