{
  "url": "https://voxday.net/2011/03/22/land-of-scanned/",
  "scraped_at": "2025-12-13T23:06:09.733230",
  "title": "Land of the scanned",
  "date_display": "March 22, 2011",
  "date_iso": "2011-03-22T20:00:00+00:00",
  "date_from_url": "2011-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know this will come as a shock, but the TSA has been planning to expand the airport scanner program to encompass other forms of transportation <a href=\"http://blogs.forbes.com/andygreenberg/2011/03/02/docs-reveal-tsa-plan-to-body-scan-pedestrians-train-passengers/\">for some time now</a>:</p><blockquote><p>Giving Transportation Security Administration agents a peek under your clothes may soon be a practice that goes well beyond airport checkpoints. Newly uncovered documents show that as early as 2006, the Department of Homeland Security has been planning pilot programs to deploy mobile scanning units that can be set up at public events and in train stations, along with mobile x-ray vans capable of scanning pedestrians on city streets.</p><p>The non-profit Electronic Privacy Information Center (EPIC) on Wednesday published documents it obtained from the Department of Homeland Security showing that from 2006 to 2008 the agency planned a study of of new anti-terrorism technologies that EPIC believes raise serious privacy concerns. The projects range from what the DHS describes as “a walk through x-ray screening system that could be deployed at entrances to special events or other points of interest” to “covert inspection of moving subjects” employing the same backscatter imaging technology currently used in American airports.</p></blockquote><p>By the way, I have read the TSA “denial” that was added to the linked article.  Note the precise wording: ““TSA has not tested the advanced imaging technology that is currently used at airports in mass transit environments and does not have plans to do so.”  Of course not.  Because the advanced imaging technology that they will be using in mobile units and in fixed pedestrian locations will be a <i>different</i> technology, of course.</p></div>",
  "content_text": "I know this will come as a shock, but the TSA has been planning to expand the airport scanner program to encompass other forms of transportation\nfor some time now\n:\nGiving Transportation Security Administration agents a peek under your clothes may soon be a practice that goes well beyond airport checkpoints. Newly uncovered documents show that as early as 2006, the Department of Homeland Security has been planning pilot programs to deploy mobile scanning units that can be set up at public events and in train stations, along with mobile x-ray vans capable of scanning pedestrians on city streets.\nThe non-profit Electronic Privacy Information Center (EPIC) on Wednesday published documents it obtained from the Department of Homeland Security showing that from 2006 to 2008 the agency planned a study of of new anti-terrorism technologies that EPIC believes raise serious privacy concerns. The projects range from what the DHS describes as “a walk through x-ray screening system that could be deployed at entrances to special events or other points of interest” to “covert inspection of moving subjects” employing the same backscatter imaging technology currently used in American airports.\nBy the way, I have read the TSA “denial” that was added to the linked article.  Note the precise wording: ““TSA has not tested the advanced imaging technology that is currently used at airports in mass transit environments and does not have plans to do so.”  Of course not.  Because the advanced imaging technology that they will be using in mobile units and in fixed pedestrian locations will be a\ndifferent\ntechnology, of course.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-22T20:00:00+00:00"
}