{
  "url": "https://voxday.net/2011/03/08/lesson-in-equality/",
  "scraped_at": "2025-12-13T23:04:34.755670",
  "title": "A lesson in equality",
  "date_display": "March 8, 2011",
  "date_iso": "2011-03-08T09:33:00+00:00",
  "date_from_url": "2011-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which coma girl teaches <a href=\"http://www.dailymail.co.uk/news/article-1363928/Man-beat-woman-coma-New-York-parking-space-apologises-but.html\">an object lesson in equality</a> and the wisdom of not initiating physical violence:</p><blockquote><p>A father-of-two accused of punching a woman so hard in a dispute over a parking space that she now she lays in a coma is claiming that she threw the first punch, and that he was acting in self-defence.  The altercation took place on February 25 when 4ft 11in, 100 pound Lana Rosas, 25, was standing in the space she was saving for her boyfriend on 14th street in New York’s East Village and refused to let 35-year-old, 150-pound Oscar Fuller park there.  The argument that followed left Rosas lying in the street unconscious with blood pouring from her mouth. She has been in a coma at Bellevue Hospital ever since the February 25 incident….</p><p>Manhattan prosecutors said in court papers that Fuller hit Rosas ‘with so much force that the woman flew off of her feet, was knocked unconscious and hit her head on the ground.’</p></blockquote><p>Obviously, there is no way to know exactly what happened unless there is security camera footage, but if Fuller’s version of events is accurate, he deserves to be fully exonerated and Rosas should be charged with assault upon her recovery.  Assuming that Fuller was, in fact, attacked by the woman and punched several times in the face, he did absolutely nothing wrong or illegal in throwing a single punch at his attacker, however hard it might have been.  No one feels any sympathy for a smaller man who is dumb enough to start a fight he can’t finish and there should be absolutely none for a woman who does exactly the same thing.  Conversely, if Fuller punched Rosas for simply attempting to hold the parking place, he should be found guilty of the count charged.  But the fact that he is only facing a single count of second-degree assault despite the seriousness of the woman’s injuries tends to indicate that at least part of Fuller’s story is supported by the evidence.</p><p>And for all those would-be women warriors out there, notice that this was a relatively fair fight between the sexes as Fuller is a little guy who only outweighed Rosas by 50 pounds.  It’s not as if he was a 250-pound construction worker; if he had been, Rosas would likely be dead already.  Tough girl posturing and <a href=\"http://www.blackgate.com/2009/02/15/on-kick-ass-female-fighters/\">fantasies about female martial prowess</a> notwithstanding, women simply are not capable of winning serious physical altercations with men, even with men who are physically smaller than they are.  Ignorance has consequences and the consequences can be deadly.</p><p>The way to prevent these sorts of stupid tragedies from taking place is not to continue attempting to brainwash boys with outdated nonsense by telling them “you should never hit a girl”.  All that does is to destroy adult credibility in young male eyes as boys will inevitably notice that despite all the equality talk, girls are very seldom punished for hitting them, even when unprovoked.  The answer is to teach everyone, boys and girls alike, not to initiate physical violence.  Both men and women must understand that no one has any right to attack another individual without the expectation of facing violent retaliation.</p><p>The more distasteful that a woman finds the idea of men beating down women in response to being attacked, the more she should be committed to telling women <i>not to attack men</i>.  After all, how hard is it to not physically attack someone, especially someone bigger, stronger, and faster than you are?  It is long past time for women to understand that they lost the privilege to be considered off-limits to retaliatory violence the moment they collectively demanded legal equality with men.</p></div>",
  "content_text": "In which coma girl teaches\nan object lesson in equality\nand the wisdom of not initiating physical violence:\nA father-of-two accused of punching a woman so hard in a dispute over a parking space that she now she lays in a coma is claiming that she threw the first punch, and that he was acting in self-defence.  The altercation took place on February 25 when 4ft 11in, 100 pound Lana Rosas, 25, was standing in the space she was saving for her boyfriend on 14th street in New York’s East Village and refused to let 35-year-old, 150-pound Oscar Fuller park there.  The argument that followed left Rosas lying in the street unconscious with blood pouring from her mouth. She has been in a coma at Bellevue Hospital ever since the February 25 incident….\nManhattan prosecutors said in court papers that Fuller hit Rosas ‘with so much force that the woman flew off of her feet, was knocked unconscious and hit her head on the ground.’\nObviously, there is no way to know exactly what happened unless there is security camera footage, but if Fuller’s version of events is accurate, he deserves to be fully exonerated and Rosas should be charged with assault upon her recovery.  Assuming that Fuller was, in fact, attacked by the woman and punched several times in the face, he did absolutely nothing wrong or illegal in throwing a single punch at his attacker, however hard it might have been.  No one feels any sympathy for a smaller man who is dumb enough to start a fight he can’t finish and there should be absolutely none for a woman who does exactly the same thing.  Conversely, if Fuller punched Rosas for simply attempting to hold the parking place, he should be found guilty of the count charged.  But the fact that he is only facing a single count of second-degree assault despite the seriousness of the woman’s injuries tends to indicate that at least part of Fuller’s story is supported by the evidence.\nAnd for all those would-be women warriors out there, notice that this was a relatively fair fight between the sexes as Fuller is a little guy who only outweighed Rosas by 50 pounds.  It’s not as if he was a 250-pound construction worker; if he had been, Rosas would likely be dead already.  Tough girl posturing and\nfantasies about female martial prowess\nnotwithstanding, women simply are not capable of winning serious physical altercations with men, even with men who are physically smaller than they are.  Ignorance has consequences and the consequences can be deadly.\nThe way to prevent these sorts of stupid tragedies from taking place is not to continue attempting to brainwash boys with outdated nonsense by telling them “you should never hit a girl”.  All that does is to destroy adult credibility in young male eyes as boys will inevitably notice that despite all the equality talk, girls are very seldom punished for hitting them, even when unprovoked.  The answer is to teach everyone, boys and girls alike, not to initiate physical violence.  Both men and women must understand that no one has any right to attack another individual without the expectation of facing violent retaliation.\nThe more distasteful that a woman finds the idea of men beating down women in response to being attacked, the more she should be committed to telling women\nnot to attack men\n.  After all, how hard is it to not physically attack someone, especially someone bigger, stronger, and faster than you are?  It is long past time for women to understand that they lost the privilege to be considered off-limits to retaliatory violence the moment they collectively demanded legal equality with men.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-08T09:33:00+00:00"
}