{
  "url": "https://voxday.net/2011/03/14/libertarian-plato/",
  "scraped_at": "2025-12-13T23:05:20.811448",
  "title": "The libertarian Plato",
  "date_display": "March 14, 2011",
  "date_iso": "2011-03-14T21:00:00+00:00",
  "date_from_url": "2011-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sometimes people make the mistake of asking what I’ve been reading lately.  This post may explain why they seldom make that mistake more than once.  Now, I may be among the more vehement critics of the dishonest Socratic logic presented in Plato’s dialogues, but even I wouldn’t go so far as to suggest that the correct reading of Plato’s totalitarian <i>Republic</i> is to conclude the exact opposite of what is written in it, as Patrick Tinsley does in his very unusual paper entitled “<a href=\"http://libertarianpapers.org/articles/2011/lp-3-2.pdf\">Plato and the Spell of the State</a>“:</p><blockquote><p>[W]e will contend that totalitarianism is not at all Plato’s proposed solution to the problem of untrustworthy politicians. His mistrust runs too deep for that. Far from advocating the totalitarian state, Plato opens it up to the light of truth, exposing it as an unjust and literally unnatural breach of the convivial social order. And he does something else as well. As we shall see, Plato attempts to show that the totalitarian state is an abomination not only for its victims, but also for its rulers. This is so, it turns out, because the desire to rule is an unruly desire; it corrupts, corrodes, and even colonizes the soul that it seduces. In the end, the desire to possess the body politic will possess the body of the politician. Whosoever would be master is doomed to be a slave….</p><p>Before we understand Plato’s rhetorical strategy, therefore, we must see that the view of Plato as totalitarian proceeds from the false assumption that Plato’s dialogues express the author’s true beliefs, typically through the character Socrates. In fact, Austrians from Menger to Rothbard fail even to acknowledge that the Platonic Socrates is a literary character. They simply read the dramatic elements out of Plato’s plays and treat them as treatises instead. According to them, Plato believes what Socrates says, and nothing besides. But this way of reading Plato produces a paradox. Namely, that if Plato believed the words that he wrote for Socrates, then he should never have written them.</p><p>The way out of the paradox is to substitute a literary reading of Plato for a literal one. We cannot take Plato, or Socrates, at his word. Instead, we must read between the lines. In order to understand Plato, we must understand that his meaning, very often, is what he leaves unwritten—and that what his characters say in dialogue, Plato delights in deconstructing with dramatic details and unspoken textual cues. His text “knows for whom it should speak and for whom it should remain silent.” If Plato speaks through Socrates, then, it is only because Socrates’ speech is so frequently<br> ironic, concealing his true beliefs behind a veil of silence.</br></p></blockquote><p>It would be an understatement to say that I do not find this argument persuasive.  To be honest, I find Sam Harris’s arguments not only more compelling, but less indicative of past drug use.  Tinsley’s conclusion strikes me as the bizarre result of combining libertarianism, Plato-worship, post-modern literary interpretation, an obsession with the English Vice, and an imagination unfettered by the limits of reason.  This is not a paper that is likely to convince the average conservative Republican that libertarians don’t smoke marijuana.  Or marijuana liberally laced with angel dust followed by a crack-infused chaser of tiger’s blood, for that matter.</p><p>To begin with, the supposed paradox is no such thing; few would be so foolish as to seriously argue that because Socrates happened to say a few negative things about writing, everything that Plato wrote down about his words is therefore completely and necessarily invalidated.  Tinsley builds up a mountain, and a very strange mountain at that, from an insignificant molehill.  But he’s just getting started, we haven’t seen <i>anything</i> yet.</p><p>One need not assume that Plato agreed with absolutely every word that Socrates uttered to take them at face value.  From the ideological perspective, it doesn’t actually matter if the dialogues are faithful recreations of actual conversations in which Socrates participated or if the Socrates of Plato’s dialogues had no more connection to the historical Athenian than the dreaming Scipio of Cicero’s dialogues had to do with the historical Roman to take the words of those dialogues literally.</p><p>In fact, it doesn’t even matter if Tinsley is correct and Plato was actually a libertarian opponent of the totalitarian state.  As an Italian admiral once told me: “In the end, it all comes down to Plato versus Aristotle.  It always does.”  Regardless of whether it was his intention or not – and based on what Rothbard tells us of the Greek’s philosophical focus on the polis rather than the individual, I am quite confident it was his intention – Plato has long been the ultimate champion of the collective.  His writings serve as the foundation for the intellectual defense of the State and have been utilized as this manner by his fellow statists for centuries.</p><p>Even though one could not possibly accept it, one might be inclined to take Tinsley’s argument more seriously if it did not veer off onto a lengthy tangent on “the depraved depth of the tyrant’s erotic abnormality.”  What on Earth, one finds oneself wondering, does any of this have to do with Plato, let alone the State?</p><p><i>“This anal orientation can also be found in the Sphinx’s riddle, which, by suggesting the two-, four-, and three-footed sexual positions associated with sodomy, “quite clearly [calls for] a pederastic explanation.”  Oedipus must solve the riddle of his father’s crime. That the Sphinx’s “riddle of the foot” plays on the relationship between pedia and pederasty is confirmed by several ancient sources.”</i></p><p>It turns out that the point of this anal extravaganza is to inform us that Plato has constructed Socrates as the anti-Oedipus, who we are instructed was apparently was a passive sodomite in addition to being a parracide and a literal motherfucker.  What we are supposed to conclude from all of this is that Plato is attempting to show us, in a subtle manner so subtle that it has been lost on classic scholars for more than two millenia that “when a tyrant perverts the natural order, the natural order perverts him, afflicting him with the most revolting and unnatural appetites”.  This, apparently, is a “unique method for dispelling the state”.</p><p>Unique?  Most definitely.  Effective?  Highly dubious.  The correct reading of the author of <i>The Republic</i>?  Let us just say that I remain unconvinced.  But let us not speak too harshly of “Plato and the Spell of the State”, as what it lacks in compelling argument it more than makes up for in pure, unadulterated comedic appeal.  I couldn’t care less if Tinsley is right or not, because on a scale of one to ten, I would give “Plato” a twelve.  Because in this case, eleven just isn’t enough.</p></div>",
  "content_text": "Sometimes people make the mistake of asking what I’ve been reading lately.  This post may explain why they seldom make that mistake more than once.  Now, I may be among the more vehement critics of the dishonest Socratic logic presented in Plato’s dialogues, but even I wouldn’t go so far as to suggest that the correct reading of Plato’s totalitarian\nRepublic\nis to conclude the exact opposite of what is written in it, as Patrick Tinsley does in his very unusual paper entitled “\nPlato and the Spell of the State\n“:\n[W]e will contend that totalitarianism is not at all Plato’s proposed solution to the problem of untrustworthy politicians. His mistrust runs too deep for that. Far from advocating the totalitarian state, Plato opens it up to the light of truth, exposing it as an unjust and literally unnatural breach of the convivial social order. And he does something else as well. As we shall see, Plato attempts to show that the totalitarian state is an abomination not only for its victims, but also for its rulers. This is so, it turns out, because the desire to rule is an unruly desire; it corrupts, corrodes, and even colonizes the soul that it seduces. In the end, the desire to possess the body politic will possess the body of the politician. Whosoever would be master is doomed to be a slave….\nBefore we understand Plato’s rhetorical strategy, therefore, we must see that the view of Plato as totalitarian proceeds from the false assumption that Plato’s dialogues express the author’s true beliefs, typically through the character Socrates. In fact, Austrians from Menger to Rothbard fail even to acknowledge that the Platonic Socrates is a literary character. They simply read the dramatic elements out of Plato’s plays and treat them as treatises instead. According to them, Plato believes what Socrates says, and nothing besides. But this way of reading Plato produces a paradox. Namely, that if Plato believed the words that he wrote for Socrates, then he should never have written them.\nThe way out of the paradox is to substitute a literary reading of Plato for a literal one. We cannot take Plato, or Socrates, at his word. Instead, we must read between the lines. In order to understand Plato, we must understand that his meaning, very often, is what he leaves unwritten—and that what his characters say in dialogue, Plato delights in deconstructing with dramatic details and unspoken textual cues. His text “knows for whom it should speak and for whom it should remain silent.” If Plato speaks through Socrates, then, it is only because Socrates’ speech is so frequently\nironic, concealing his true beliefs behind a veil of silence.\nIt would be an understatement to say that I do not find this argument persuasive.  To be honest, I find Sam Harris’s arguments not only more compelling, but less indicative of past drug use.  Tinsley’s conclusion strikes me as the bizarre result of combining libertarianism, Plato-worship, post-modern literary interpretation, an obsession with the English Vice, and an imagination unfettered by the limits of reason.  This is not a paper that is likely to convince the average conservative Republican that libertarians don’t smoke marijuana.  Or marijuana liberally laced with angel dust followed by a crack-infused chaser of tiger’s blood, for that matter.\nTo begin with, the supposed paradox is no such thing; few would be so foolish as to seriously argue that because Socrates happened to say a few negative things about writing, everything that Plato wrote down about his words is therefore completely and necessarily invalidated.  Tinsley builds up a mountain, and a very strange mountain at that, from an insignificant molehill.  But he’s just getting started, we haven’t seen\nanything\nyet.\nOne need not assume that Plato agreed with absolutely every word that Socrates uttered to take them at face value.  From the ideological perspective, it doesn’t actually matter if the dialogues are faithful recreations of actual conversations in which Socrates participated or if the Socrates of Plato’s dialogues had no more connection to the historical Athenian than the dreaming Scipio of Cicero’s dialogues had to do with the historical Roman to take the words of those dialogues literally.\nIn fact, it doesn’t even matter if Tinsley is correct and Plato was actually a libertarian opponent of the totalitarian state.  As an Italian admiral once told me: “In the end, it all comes down to Plato versus Aristotle.  It always does.”  Regardless of whether it was his intention or not – and based on what Rothbard tells us of the Greek’s philosophical focus on the polis rather than the individual, I am quite confident it was his intention – Plato has long been the ultimate champion of the collective.  His writings serve as the foundation for the intellectual defense of the State and have been utilized as this manner by his fellow statists for centuries.\nEven though one could not possibly accept it, one might be inclined to take Tinsley’s argument more seriously if it did not veer off onto a lengthy tangent on “the depraved depth of the tyrant’s erotic abnormality.”  What on Earth, one finds oneself wondering, does any of this have to do with Plato, let alone the State?\n“This anal orientation can also be found in the Sphinx’s riddle, which, by suggesting the two-, four-, and three-footed sexual positions associated with sodomy, “quite clearly [calls for] a pederastic explanation.”  Oedipus must solve the riddle of his father’s crime. That the Sphinx’s “riddle of the foot” plays on the relationship between pedia and pederasty is confirmed by several ancient sources.”\nIt turns out that the point of this anal extravaganza is to inform us that Plato has constructed Socrates as the anti-Oedipus, who we are instructed was apparently was a passive sodomite in addition to being a parracide and a literal motherfucker.  What we are supposed to conclude from all of this is that Plato is attempting to show us, in a subtle manner so subtle that it has been lost on classic scholars for more than two millenia that “when a tyrant perverts the natural order, the natural order perverts him, afflicting him with the most revolting and unnatural appetites”.  This, apparently, is a “unique method for dispelling the state”.\nUnique?  Most definitely.  Effective?  Highly dubious.  The correct reading of the author of\nThe Republic\n?  Let us just say that I remain unconvinced.  But let us not speak too harshly of “Plato and the Spell of the State”, as what it lacks in compelling argument it more than makes up for in pure, unadulterated comedic appeal.  I couldn’t care less if Tinsley is right or not, because on a scale of one to ten, I would give “Plato” a twelve.  Because in this case, eleven just isn’t enough.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-14T21:00:00+00:00"
}