{
  "url": "https://voxday.net/2011/03/04/long-awaited-dance/",
  "scraped_at": "2025-12-13T23:04:14.619673",
  "title": "A long-awaited dance",
  "date_display": "March 4, 2011",
  "date_iso": "2011-03-04T14:00:00+00:00",
  "date_from_url": "2011-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I can’t pretend that I’m anywhere nearly as excited as a lot of epic fantasy fans are, but I will probably re-read the series in order to refresh my memory before reading<a href=\"http://www.blackgate.com/2011/03/03/the-dragons-are-coming/\"> the next book in the series</a>:</p><blockquote><p>Great news for fans of epic fantasy today: The great George R. R. Martin has announced on his web page that the long, long-awaited 5th book in his SONG OF ICE AND FIRE series is almost done. No kidding this time.  A DANCE WITH DRAGONS will be hitting stories on July 12, 2011. Although previous dates have been set and then cancelled, Martin says this one is “for real.”</p></blockquote><p>I generally enjoy the <i>Fire and Ice</i> series, but I thought the last book, divided into two, bordered on the tedious and didn’t advance the story much.  Like pitchers, writers tend to lose their fastball abruptly, and often without any warning.  I suspect Martin’s inability to finish the book in a reasonable time frame after turning in a relatively mediocre, (in comparison with the standard he’d previously set, you understand) prior novel doesn’t bode well for <i>A Dance with Dragons</i>, but I will be pleased to be proved wrong in July.</p></div>",
  "content_text": "I can’t pretend that I’m anywhere nearly as excited as a lot of epic fantasy fans are, but I will probably re-read the series in order to refresh my memory before reading\nthe next book in the series\n:\nGreat news for fans of epic fantasy today: The great George R. R. Martin has announced on his web page that the long, long-awaited 5th book in his SONG OF ICE AND FIRE series is almost done. No kidding this time.  A DANCE WITH DRAGONS will be hitting stories on July 12, 2011. Although previous dates have been set and then cancelled, Martin says this one is “for real.”\nI generally enjoy the\nFire and Ice\nseries, but I thought the last book, divided into two, bordered on the tedious and didn’t advance the story much.  Like pitchers, writers tend to lose their fastball abruptly, and often without any warning.  I suspect Martin’s inability to finish the book in a reasonable time frame after turning in a relatively mediocre, (in comparison with the standard he’d previously set, you understand) prior novel doesn’t bode well for\nA Dance with Dragons\n, but I will be pleased to be proved wrong in July.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-04T14:00:00+00:00"
}