{
  "url": "https://voxday.net/2011/03/04/mailvox-replay/",
  "scraped_at": "2025-12-13T23:04:12.769155",
  "title": "Mailvox: the replay link",
  "date_display": "March 4, 2011",
  "date_iso": "2011-03-04T09:16:00+00:00",
  "date_from_url": "2011-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cocomoe sends a link for the benefit of those who couldn’t listen live yesterday:</p><blockquote><p><a href=\"http://www.gcnlive.com/programs/peterSchiff/archives.php\">The Vox Schiff interview</a> can be relistened and relistened to here for free Mar 3 hour 1: (Vox starts at minute 27).  I thought Vox did real well and even better the 2nd time you listen and get Schiff to be more background.</p></blockquote><p>Actually, I don’t feel as if I even began making a case, for as I mentioned in the comments yesterday, I had no idea that there was going to be a debate about inflation.  I was told that we’d be discussing inflation and deflation in the context of Bernanke’s recent testimony to Congress.  So, what you’re hearing is my attempt to be polite and avoid simply telling the host “congratulations, you’ve figured out the basics of supply, demand, and the quantity theory of inflation, which has only been around since Ssu-Ma Chien in the second century BC.”  There is literally nothing that Schiff is saying that any economics student didn’t learn in Econ 101 except the bit about the Federal Reserve Notes.  That doesn’t mean he’s necessarily wrong about high rates of inflation coming, only that repeating what the Wall Street Journal has been saying since April 2008 isn’t telling anyone anything new nor does it explain in any way the various anomalies that I have noted in the money supply and the credit markets.  Just saying “housing is an asset”, which isn’t even true in the case of housing, is not a meaningful response, let alone a substantive rebuttal.  For all that there are multiple definitions of inflation, all of them include the concept of a <i>general</i> increase in prices and there can be no price inflation if wages and housing prices are falling even though prices are rising in other sectors.</p><p><i>“The only Chinese with notable views in the more strictly economic realm was the distinguished second century B.C. historian, Ssu-ma Ch’ien (145c. 90 BC)…. Ch’ien was one of the world’s first monetary theorists. He pointed out that increased quantity and a debased quality of coinage by government depreciates the value of money and makes prices rise. And he saw too that government inherently tended to engage in this sort of inflation and debasement.”</i><br> – Murray Rothbard, <i>An Austrian Perspective on the History of Economic Thought</i>, pp 26-27.</br></p><p>By the way, here are the specifics on the incidences of default versus hyperinflation in Europe since 1800 that I mentioned in the interview.  There have been 73 sovereign defaults compared to 20 total years of hyperinflation in Austria (2 years, 1,733%), Germany (2 years, 2.22E+10%), Greece (4 years, 3.02E+10%), Hungary (2 years, 9.63+26%), Poland (2 years, 51,699.4%), Russia (8 years, 13,534.7%).  Similar ratios are seen in Latin America and Africa.  However, high rates of annual inflation are quite common historically and the USA is actually quite unusual in having had only one year since 1800, 1864 to be precise, where inflation exceeded 20 percent.  One thing inflationistas might find interesting is the fact that hyperinflation is NOT necessarily dictated by the increase in the quantity of money, because in at least two cases, those of Germany and Hungary, the amount of inflation exceeded the increase in the money supply.</p><p>UPDATE – WND has a nice, if somewhat tongue-in-cheek article <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=270525\">on RGD hitting #1</a> in its category on Amazon.  Of course, the headline is a little unfortunate, as I would hope demand for it hasn’t actually peaked at this point.</p></div>",
  "content_text": "Cocomoe sends a link for the benefit of those who couldn’t listen live yesterday:\nThe Vox Schiff interview\ncan be relistened and relistened to here for free Mar 3 hour 1: (Vox starts at minute 27).  I thought Vox did real well and even better the 2nd time you listen and get Schiff to be more background.\nActually, I don’t feel as if I even began making a case, for as I mentioned in the comments yesterday, I had no idea that there was going to be a debate about inflation.  I was told that we’d be discussing inflation and deflation in the context of Bernanke’s recent testimony to Congress.  So, what you’re hearing is my attempt to be polite and avoid simply telling the host “congratulations, you’ve figured out the basics of supply, demand, and the quantity theory of inflation, which has only been around since Ssu-Ma Chien in the second century BC.”  There is literally nothing that Schiff is saying that any economics student didn’t learn in Econ 101 except the bit about the Federal Reserve Notes.  That doesn’t mean he’s necessarily wrong about high rates of inflation coming, only that repeating what the Wall Street Journal has been saying since April 2008 isn’t telling anyone anything new nor does it explain in any way the various anomalies that I have noted in the money supply and the credit markets.  Just saying “housing is an asset”, which isn’t even true in the case of housing, is not a meaningful response, let alone a substantive rebuttal.  For all that there are multiple definitions of inflation, all of them include the concept of a\ngeneral\nincrease in prices and there can be no price inflation if wages and housing prices are falling even though prices are rising in other sectors.\n“The only Chinese with notable views in the more strictly economic realm was the distinguished second century B.C. historian, Ssu-ma Ch’ien (145c. 90 BC)…. Ch’ien was one of the world’s first monetary theorists. He pointed out that increased quantity and a debased quality of coinage by government depreciates the value of money and makes prices rise. And he saw too that government inherently tended to engage in this sort of inflation and debasement.”\n– Murray Rothbard,\nAn Austrian Perspective on the History of Economic Thought\n, pp 26-27.\nBy the way, here are the specifics on the incidences of default versus hyperinflation in Europe since 1800 that I mentioned in the interview.  There have been 73 sovereign defaults compared to 20 total years of hyperinflation in Austria (2 years, 1,733%), Germany (2 years, 2.22E+10%), Greece (4 years, 3.02E+10%), Hungary (2 years, 9.63+26%), Poland (2 years, 51,699.4%), Russia (8 years, 13,534.7%).  Similar ratios are seen in Latin America and Africa.  However, high rates of annual inflation are quite common historically and the USA is actually quite unusual in having had only one year since 1800, 1864 to be precise, where inflation exceeded 20 percent.  One thing inflationistas might find interesting is the fact that hyperinflation is NOT necessarily dictated by the increase in the quantity of money, because in at least two cases, those of Germany and Hungary, the amount of inflation exceeded the increase in the money supply.\nUPDATE – WND has a nice, if somewhat tongue-in-cheek article\non RGD hitting #1\nin its category on Amazon.  Of course, the headline is a little unfortunate, as I would hope demand for it hasn’t actually peaked at this point.",
  "tags": [
    "economics",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-04T09:16:00+00:00"
}