{
  "url": "https://voxday.net/2011/03/29/mailvox-reservations-abou/",
  "scraped_at": "2025-12-13T23:06:42.357875",
  "title": "Mailvox: reservations about libertarianism",
  "date_display": "March 29, 2011",
  "date_iso": "2011-03-29T12:20:00+00:00",
  "date_from_url": "2011-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SE asks about libertarianism vis-a-vis conservatism:</p><blockquote><p>I have enjoyed your blog for many months, and find your work both insightful and refreshing.  Over the last few months, I have been pushed from standard conservatism to libertarianism.  However, I have a few reservations about the latter. It is clear that, in theory, libertarianism is ideal to a certain extent.  But I cannot get rid of an instinctive feeling that something is wrong with the libertarian movement (not the theory itself).</p><p>For example, many articles seem to simply enlarge on how things go wrong when government gets involved in just about anything.  I cannot disagree with the sentiment, and it has been a revelation to me to find out just how useless and destructive governments can be, but I think that libertarians can concentrate on this too much, and ignore the deeper realities of human nature.  They seem to think that once government is cut down to size and most things are left to the market, everything will fall into place.  I agree in part, but I cannot help thinking things are not so simple.  (I am of course not suggesting that more government power is a good idea.)</p><p>The heart of my doubts, however, is in the similarities I can perceive between some libertarian and leftist writings.  I know that libertarian opposition to wars, imperialism, police heavy-handedness etc. is based on principled and reasoned arguments, but it’s the rhetoric that bothers me, as it reminds me strongly of the standard liberal line.  There are two sorts of anti-government movements, but it is possible to confuse the two due to their similar rhetoric.  And how many people may have just looked at the basic ideas, concluded that they like a system which is anti-government and wants to legalise drugs and so on, and have called themselves libertarian on that basis without thinking of all that it necessarily involves?</p><p>There is overlap between libertarian and liberal policies, although the principles behind them are completely different, eg. liberals are obviously not really anti-government, just anti-certain governments.  I worry that some libertarians may actually be motivated by the same mindset as those on the radical left.  It seems to be becoming quite a common label people give themselves, and unfortunately, when a good idea gets to be widely known and popular, it often loses its original purity.  Couple this with the emotional appeal to the ideas of revolution, tearing down the system etc. and the libertarian movement may get apparent support from people who are not truly sympathetic to it in all its ramifications.</p><p>It is my belief that libertarianism should encompass every aspect of life in order to avoid this danger.  I don’t mean there should be a set of, for example, religious beliefs associated with it; I just mean that it shouldn’t just be something you tack onto your other beliefs, or merely pay lip service to. We need a strong moral basis for libertarianism to work, as well.  The minds of the majority of people need to be thoroughly made pro-liberty.  The human mind is constantly in danger of abandoning liberty, and falling prey to statism, and perhaps libertarians do not concentrate enough on this crucial problem.</p><p>Touching on specific issues, I know that many libertarians support abortion, for example.  This may be totally at odds with their advocacy of protection of individual rights, but you have to concede that, as yet, not that many have admitted the contradiction.  Is it a simple oversight or something deeper?  Again, a lot of libertarians support open borders.  In an ideal world where there were no cultural or religious differences, this might be an admirable position.  But human nature is such that allowing mass immigration will almost always be a disaster eventually, as I have come to accept from reading your thoughts on the topic.  And yet the policy of open borders seems to follow from libertarian principles.</p><p>However, the biggest problem in my view is a feeling that I cannot get rid of no matter how much I agree with the libertarian arguments.  Feel free to ridicule but I just have this sense that something is wrong when I read their writings – not with the facts or reasoning as such, but with the way it sounds. Perhaps it is the economic focus in some cases, obscuring the moral or behavioural aspects.  It is significant that I have never once got this feeling when reading your blog or columns, but often have when reading on mises.org, or Rothbard’s essays, for example (although I agree with most of his arguments).  I was looking into this thought, and found that in <i>The Betrayal of the American Right</i>, Rothbard says “The book was written after the end of our alliance with the New Left, which had begun promisingly in the early and mid-1960s but had ended in the mad if short-lived orgy of violence and destruction at the end of the decade.”</p><p>Such an alliance just seems strange to me, and indicates either a very naive move, or a deeper relationship between the two movements.  This fact bothers me, as on an intellectual level I cannot think of a better system than libertarianism. It does not help when libertarians confuse things by claiming theirs is a leftist ideology. Or is this actually true?  I would have thought that, in theory, despite their non-conservative views on such things as drugs and homosexuality, libertarianism is of the right.  I had believed that it was at least related to conservatism; and this seemed verified when I noticed that many libertarians seemed to originate in conservative circles.  But I was surprised to see an entry on Wikipedia for ‘left-libertarianism’, and unnerved to find links to the anarchist movement.</p><p>This is my dilemma: now I have been exposed to libertarian ideas, I cannot with integrity remain loyal to the conservative movement, whatever that may be, and I find their views too vague and statist. But although I find libertarian ideas on many topics so intellectually convincing, I cannot take the leap and give it my wholehearted support because this undefined, but very real, feeling gets in the way.  (However, I would vote for the UK Libertarian Party despite all this, if I thought it would make any difference, having given up long ago on the Conservatives.)</p><p>Of course I am new to libertarianism, so there may be a perfectly good explanation for this.  It is possible that as I learn more, I will see something I missed.  I also realise that conservatives have their own problems, mostly a fatal attraction to government intervention when it suits them, and an irritating lack of strong principles, whereas libertarians seem to have a much better ordered system of thought.</p><p>I sincerely would like to believe that I am just imagining things.  Do you think this niggling doubt is based on reality? Is there a conceptual link between the two ideologies?</p></blockquote><p>The first thing that always has to be kept in mind when considering a political ideology is that one should never judge the ism by the ist.  MPAI applies to libertarians every bit as much as it applies to conservatives or liberals.  Because ideology is neither logic nor science, most ideologies are self-contradicting to a certain extent.  Thus, we have libertarians who simultaneously support both open borders and the concept of the sovereign nation-state, liberals who support both free speech and hate speech laws, and conservatives who support both a strong military and rampant foreign intervention.</p><p>Few libertarians trouble to think through the rational consequences of all their positions.  But human liberty is not a justification for ignoring either gravity or population demographics.  And as for abortion, that is a simple matter of whether the unborn child is considered a human individual or not.  It is both unscientific and irrational to insist that it is not, but few people are actually capable of grasping the relevant science or reason with regards to the subject.</p><p>The important thing to understand about libertarianism is that it is not ideals that drive it, but rather a cynical view of human nature.  It is the anti-progressive ideology, because it is predicated on the idea that humanity cannot be improved and that government will always eventually turn on the people over whom it governs.  While some libertarians wax lyrical about liberty and the free market, libertarianism is ultimately about preventing the government from killing its citizens by refusing to permit it the means or the justification to do so.</p><p>As for the similarity of liberal and libertarian rhetoric, that is easily dealt with.  Modern “liberals” are liars.  Even their stolen name is dishonest, as there is nothing liberal about the average “liberal”; it would be much more accurate to label them statists as their preference is almost uniformly in support of more state interference in the economy and the lives of the citizenry rather than less.  Since they are intrinsically dishonest and deceptive, there is no reason to take their rhetoric seriously.</p></div>",
  "content_text": "SE asks about libertarianism vis-a-vis conservatism:\nI have enjoyed your blog for many months, and find your work both insightful and refreshing.  Over the last few months, I have been pushed from standard conservatism to libertarianism.  However, I have a few reservations about the latter. It is clear that, in theory, libertarianism is ideal to a certain extent.  But I cannot get rid of an instinctive feeling that something is wrong with the libertarian movement (not the theory itself).\nFor example, many articles seem to simply enlarge on how things go wrong when government gets involved in just about anything.  I cannot disagree with the sentiment, and it has been a revelation to me to find out just how useless and destructive governments can be, but I think that libertarians can concentrate on this too much, and ignore the deeper realities of human nature.  They seem to think that once government is cut down to size and most things are left to the market, everything will fall into place.  I agree in part, but I cannot help thinking things are not so simple.  (I am of course not suggesting that more government power is a good idea.)\nThe heart of my doubts, however, is in the similarities I can perceive between some libertarian and leftist writings.  I know that libertarian opposition to wars, imperialism, police heavy-handedness etc. is based on principled and reasoned arguments, but it’s the rhetoric that bothers me, as it reminds me strongly of the standard liberal line.  There are two sorts of anti-government movements, but it is possible to confuse the two due to their similar rhetoric.  And how many people may have just looked at the basic ideas, concluded that they like a system which is anti-government and wants to legalise drugs and so on, and have called themselves libertarian on that basis without thinking of all that it necessarily involves?\nThere is overlap between libertarian and liberal policies, although the principles behind them are completely different, eg. liberals are obviously not really anti-government, just anti-certain governments.  I worry that some libertarians may actually be motivated by the same mindset as those on the radical left.  It seems to be becoming quite a common label people give themselves, and unfortunately, when a good idea gets to be widely known and popular, it often loses its original purity.  Couple this with the emotional appeal to the ideas of revolution, tearing down the system etc. and the libertarian movement may get apparent support from people who are not truly sympathetic to it in all its ramifications.\nIt is my belief that libertarianism should encompass every aspect of life in order to avoid this danger.  I don’t mean there should be a set of, for example, religious beliefs associated with it; I just mean that it shouldn’t just be something you tack onto your other beliefs, or merely pay lip service to. We need a strong moral basis for libertarianism to work, as well.  The minds of the majority of people need to be thoroughly made pro-liberty.  The human mind is constantly in danger of abandoning liberty, and falling prey to statism, and perhaps libertarians do not concentrate enough on this crucial problem.\nTouching on specific issues, I know that many libertarians support abortion, for example.  This may be totally at odds with their advocacy of protection of individual rights, but you have to concede that, as yet, not that many have admitted the contradiction.  Is it a simple oversight or something deeper?  Again, a lot of libertarians support open borders.  In an ideal world where there were no cultural or religious differences, this might be an admirable position.  But human nature is such that allowing mass immigration will almost always be a disaster eventually, as I have come to accept from reading your thoughts on the topic.  And yet the policy of open borders seems to follow from libertarian principles.\nHowever, the biggest problem in my view is a feeling that I cannot get rid of no matter how much I agree with the libertarian arguments.  Feel free to ridicule but I just have this sense that something is wrong when I read their writings – not with the facts or reasoning as such, but with the way it sounds. Perhaps it is the economic focus in some cases, obscuring the moral or behavioural aspects.  It is significant that I have never once got this feeling when reading your blog or columns, but often have when reading on mises.org, or Rothbard’s essays, for example (although I agree with most of his arguments).  I was looking into this thought, and found that in\nThe Betrayal of the American Right\n, Rothbard says “The book was written after the end of our alliance with the New Left, which had begun promisingly in the early and mid-1960s but had ended in the mad if short-lived orgy of violence and destruction at the end of the decade.”\nSuch an alliance just seems strange to me, and indicates either a very naive move, or a deeper relationship between the two movements.  This fact bothers me, as on an intellectual level I cannot think of a better system than libertarianism. It does not help when libertarians confuse things by claiming theirs is a leftist ideology. Or is this actually true?  I would have thought that, in theory, despite their non-conservative views on such things as drugs and homosexuality, libertarianism is of the right.  I had believed that it was at least related to conservatism; and this seemed verified when I noticed that many libertarians seemed to originate in conservative circles.  But I was surprised to see an entry on Wikipedia for ‘left-libertarianism’, and unnerved to find links to the anarchist movement.\nThis is my dilemma: now I have been exposed to libertarian ideas, I cannot with integrity remain loyal to the conservative movement, whatever that may be, and I find their views too vague and statist. But although I find libertarian ideas on many topics so intellectually convincing, I cannot take the leap and give it my wholehearted support because this undefined, but very real, feeling gets in the way.  (However, I would vote for the UK Libertarian Party despite all this, if I thought it would make any difference, having given up long ago on the Conservatives.)\nOf course I am new to libertarianism, so there may be a perfectly good explanation for this.  It is possible that as I learn more, I will see something I missed.  I also realise that conservatives have their own problems, mostly a fatal attraction to government intervention when it suits them, and an irritating lack of strong principles, whereas libertarians seem to have a much better ordered system of thought.\nI sincerely would like to believe that I am just imagining things.  Do you think this niggling doubt is based on reality? Is there a conceptual link between the two ideologies?\nThe first thing that always has to be kept in mind when considering a political ideology is that one should never judge the ism by the ist.  MPAI applies to libertarians every bit as much as it applies to conservatives or liberals.  Because ideology is neither logic nor science, most ideologies are self-contradicting to a certain extent.  Thus, we have libertarians who simultaneously support both open borders and the concept of the sovereign nation-state, liberals who support both free speech and hate speech laws, and conservatives who support both a strong military and rampant foreign intervention.\nFew libertarians trouble to think through the rational consequences of all their positions.  But human liberty is not a justification for ignoring either gravity or population demographics.  And as for abortion, that is a simple matter of whether the unborn child is considered a human individual or not.  It is both unscientific and irrational to insist that it is not, but few people are actually capable of grasping the relevant science or reason with regards to the subject.\nThe important thing to understand about libertarianism is that it is not ideals that drive it, but rather a cynical view of human nature.  It is the anti-progressive ideology, because it is predicated on the idea that humanity cannot be improved and that government will always eventually turn on the people over whom it governs.  While some libertarians wax lyrical about liberty and the free market, libertarianism is ultimately about preventing the government from killing its citizens by refusing to permit it the means or the justification to do so.\nAs for the similarity of liberal and libertarian rhetoric, that is easily dealt with.  Modern “liberals” are liars.  Even their stolen name is dishonest, as there is nothing liberal about the average “liberal”; it would be much more accurate to label them statists as their preference is almost uniformly in support of more state interference in the economy and the lives of the citizenry rather than less.  Since they are intrinsically dishonest and deceptive, there is no reason to take their rhetoric seriously.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-29T11:20:00+00:00"
}