{
  "url": "https://voxday.net/2011/03/19/mailvox-on-socrates/",
  "scraped_at": "2025-12-13T23:05:47.955465",
  "title": "Mailvox: on Socrates",
  "date_display": "March 19, 2011",
  "date_iso": "2011-03-19T11:52:00+00:00",
  "date_from_url": "2011-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>F1 wonders why I think poorly of Socrates:</p><blockquote><p>I’m interested in your take on Socrates given that you’ve said you’re inclined to despise him. He seems to me like a man that surpasses most, in authenticity at least, and any man who can simultaneously understand him and despise him would seem to me to really be taking a bold position. He might be annoying, and even describes himself as a “gadfly”, but I think the example he gave was really something extraordinary and admirable, so why do you “tend to despise him”?</p></blockquote><p>I think that to understand Socrates is to despise him.  If we assume that Plato’s portrait of the Athenian philosopher is accurate and his rendering of the dialogues is a reasonable facsimile of the historical conversations that took place, we are forced to conclude that Socrates is anything but authentic or admirable in a variety of ways.  He was most certainly extraordinary and his intelligence was formidable, but his philosophy is essentially evil, self-serving, and juvenile.  Over the centuries, we have not only seen <i>The Republic</i> serve as philosophical justification for both tyranny and self-appointed elitism, but we must note that the behavior of his prize pupil, Alcibiades, is entirely in keeping with the principles Socrates taught.  If one judges a philosopher by his fruits, Socrates fares very ill indeed.</p><p>I have not gone through the various dialogues with the same close attention that I paid to <i>Euthyphro</i>, but as I demonstrated in my critique of it, Socrates demonstrates an astonishingly dishonest willingness to apply a false equivalency in order to complete his structurally illogical argument.  Despite my regular use of the Socratic method to discredit and humiliate overmatched critics, I have little regard for it as a method to determine truth because it often relies upon artificially simplifying multi-faceted concepts into a single binary question.  The Socratic method is far from useless, but I see it as being a rhetorical weapon than a philosophical device.  Which, naturally, raises the question of why Socrates made such heavy use of it and for what purpose.</p><p>In summary, I see Socrates as a fraudulent philosophical trickster whose false modesty and respect for the gods is no more convincing than his illegitimate logic in <i>Euthyphro</i>.  And if there is one thing I despise more than intellectual frauds, it is false modesty.  Genuine humility is a virtue, whereas false modesty is one of the crudest conceivable insults to the observer’s intelligence.</p><p>While we’re on the subject of email, HM5 responded to my post on crushing women’s dreams over at Alpha Game:</p><blockquote><p>As a woman, I find this discussion very enlightening. I don’t know what sort of women you know, but you don’t appear to respect them very much. Women do, as a whole, have a deep need to be mothers; its in our dna. However, the fact that you discuss treating women like they have no clue what they want is really astonishing. Perhaps it is what most men are truly thinking. Perhaps your women respect you too much to believe that this is really the way you feel. Perhaps if they read your comments they would see some part truth and some complete misunderstandings that are so far off base as to be funny.</p></blockquote><p>I <a href=\"http://alphagameplan.blogspot.com/2011/03/alpha-mail-what-women-want.html\">responded at Alpha Game</a>, but suffice it to say that I think women should think very carefully about their historical statements before they demand men treat their words with full equalitarian respect.</p></div>",
  "content_text": "F1 wonders why I think poorly of Socrates:\nI’m interested in your take on Socrates given that you’ve said you’re inclined to despise him. He seems to me like a man that surpasses most, in authenticity at least, and any man who can simultaneously understand him and despise him would seem to me to really be taking a bold position. He might be annoying, and even describes himself as a “gadfly”, but I think the example he gave was really something extraordinary and admirable, so why do you “tend to despise him”?\nI think that to understand Socrates is to despise him.  If we assume that Plato’s portrait of the Athenian philosopher is accurate and his rendering of the dialogues is a reasonable facsimile of the historical conversations that took place, we are forced to conclude that Socrates is anything but authentic or admirable in a variety of ways.  He was most certainly extraordinary and his intelligence was formidable, but his philosophy is essentially evil, self-serving, and juvenile.  Over the centuries, we have not only seen\nThe Republic\nserve as philosophical justification for both tyranny and self-appointed elitism, but we must note that the behavior of his prize pupil, Alcibiades, is entirely in keeping with the principles Socrates taught.  If one judges a philosopher by his fruits, Socrates fares very ill indeed.\nI have not gone through the various dialogues with the same close attention that I paid to\nEuthyphro\n, but as I demonstrated in my critique of it, Socrates demonstrates an astonishingly dishonest willingness to apply a false equivalency in order to complete his structurally illogical argument.  Despite my regular use of the Socratic method to discredit and humiliate overmatched critics, I have little regard for it as a method to determine truth because it often relies upon artificially simplifying multi-faceted concepts into a single binary question.  The Socratic method is far from useless, but I see it as being a rhetorical weapon than a philosophical device.  Which, naturally, raises the question of why Socrates made such heavy use of it and for what purpose.\nIn summary, I see Socrates as a fraudulent philosophical trickster whose false modesty and respect for the gods is no more convincing than his illegitimate logic in\nEuthyphro\n.  And if there is one thing I despise more than intellectual frauds, it is false modesty.  Genuine humility is a virtue, whereas false modesty is one of the crudest conceivable insults to the observer’s intelligence.\nWhile we’re on the subject of email, HM5 responded to my post on crushing women’s dreams over at Alpha Game:\nAs a woman, I find this discussion very enlightening. I don’t know what sort of women you know, but you don’t appear to respect them very much. Women do, as a whole, have a deep need to be mothers; its in our dna. However, the fact that you discuss treating women like they have no clue what they want is really astonishing. Perhaps it is what most men are truly thinking. Perhaps your women respect you too much to believe that this is really the way you feel. Perhaps if they read your comments they would see some part truth and some complete misunderstandings that are so far off base as to be funny.\nI\nresponded at Alpha Game\n, but suffice it to say that I think women should think very carefully about their historical statements before they demand men treat their words with full equalitarian respect.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-19T11:52:00+00:00"
}