{
  "url": "https://voxday.net/2011/03/27/mysterious-decline/",
  "scraped_at": "2025-12-13T23:06:33.060012",
  "title": "A mysterious decline",
  "date_display": "March 27, 2011",
  "date_iso": "2011-03-27T14:00:00+00:00",
  "date_from_url": "2011-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times ponders <a href=\"http://www.nytimes.com/2011/03/27/opinion/27Sugrue.html?hp\">a seeming imponderable</a>:</p><blockquote><p>AT first glance, the numbers released by the Census Bureau last week showing a precipitous drop in Detroit’s population — 25 percent over the last decade — seem to bear a silver lining: most of those leaving the city are blacks headed to the suburbs, once the refuge of mid-century white flight.</p><p>But a closer analysis of the data suggests that the story of housing discrimination that has dominated American urban life since the early 20th century is far from over. In the Detroit metropolitan area, blacks are moving into so-called secondhand suburbs: established communities with deteriorating housing stock that are falling out of favor with younger white homebuyers. If historical trends hold, these suburbs will likely shift from white to black — and soon look much like Detroit itself, with resegregated schools, dwindling tax bases and decaying public services.</p></blockquote><p>And why might that be?  How do these urban dystopias continue to keep sprouting up around the country?  Since we obviously know that all people are the same everywhere, what could possibly explain this bizarre tendency towards economic disintegration and social breakdown that appears to follow blacks around like an inexplicable curse?</p><p>The unusual thing about the NYT article is the way it avoids playing the usual racism card.  When it mentions the way in which “the city’s whites fought what they called the “Negro invasion” with every tool at their disposal”, it doesn’t frame the description of the historical resistance with the usual delegitimizing codewords, probably because the historical fears of Detroit’s white populace were ultimately proven to underestimate the negative consequences of the Great Migration.  I doubt even the most pessimistic white racist could have imagined the decrepit state to which Detroit has declined in 60 years.</p><p>The article is somewhat amusing in how it laments the fate of the black recon elements.  “Much to their chagrin, many new black suburbanites found that integration was just a phase between when the first blacks moved in and the last whites took their children out of the public schools.”  One would think that black people who don’t want to live with black people should understand that white people don’t want to live with them either.</p><p>In society after society, the same pattern is repeated.  Majority populations will tolerate a minority population up to a certain point, which is somewhere between two and ten percent of the population.  More than that and the minority population will begin to demand societal modifications to suit itself by virtue of its size, at which point the majority population will quite reasonably begin to react in a distinctly hostile manner.   If there is room to retreat, the majority population will retreat.  If there is not, there will either be violence or the eventual disappearance of the erstwhile majority population.</p><p>But keep in mind that the trends ebb and flow.  In the nineteenth century, it was thought that the black race was on a demographic decline to extinction.  In the twenty-first, it is sometimes assumed that the white race is.  Neither is likely true, and now that the Hispanic population exceeds the black population in the United States, the monochromatic lens through which most race relations are viewed is increasingly irrelevant.</p><p>The dream isn’t deferred, it is simply impossible because it is nothing more than a delusion that one racial populations will behave in exactly the same manner as another one.  Since this has never happened yet in the recorded history of the human race, it seems more than a little quixotic to believe that because <i>individuals</i> have surmounted their racial, ethnic, and cultural differences, entire populations not only can, but will.</p></div>",
  "content_text": "The New York Times ponders\na seeming imponderable\n:\nAT first glance, the numbers released by the Census Bureau last week showing a precipitous drop in Detroit’s population — 25 percent over the last decade — seem to bear a silver lining: most of those leaving the city are blacks headed to the suburbs, once the refuge of mid-century white flight.\nBut a closer analysis of the data suggests that the story of housing discrimination that has dominated American urban life since the early 20th century is far from over. In the Detroit metropolitan area, blacks are moving into so-called secondhand suburbs: established communities with deteriorating housing stock that are falling out of favor with younger white homebuyers. If historical trends hold, these suburbs will likely shift from white to black — and soon look much like Detroit itself, with resegregated schools, dwindling tax bases and decaying public services.\nAnd why might that be?  How do these urban dystopias continue to keep sprouting up around the country?  Since we obviously know that all people are the same everywhere, what could possibly explain this bizarre tendency towards economic disintegration and social breakdown that appears to follow blacks around like an inexplicable curse?\nThe unusual thing about the NYT article is the way it avoids playing the usual racism card.  When it mentions the way in which “the city’s whites fought what they called the “Negro invasion” with every tool at their disposal”, it doesn’t frame the description of the historical resistance with the usual delegitimizing codewords, probably because the historical fears of Detroit’s white populace were ultimately proven to underestimate the negative consequences of the Great Migration.  I doubt even the most pessimistic white racist could have imagined the decrepit state to which Detroit has declined in 60 years.\nThe article is somewhat amusing in how it laments the fate of the black recon elements.  “Much to their chagrin, many new black suburbanites found that integration was just a phase between when the first blacks moved in and the last whites took their children out of the public schools.”  One would think that black people who don’t want to live with black people should understand that white people don’t want to live with them either.\nIn society after society, the same pattern is repeated.  Majority populations will tolerate a minority population up to a certain point, which is somewhere between two and ten percent of the population.  More than that and the minority population will begin to demand societal modifications to suit itself by virtue of its size, at which point the majority population will quite reasonably begin to react in a distinctly hostile manner.   If there is room to retreat, the majority population will retreat.  If there is not, there will either be violence or the eventual disappearance of the erstwhile majority population.\nBut keep in mind that the trends ebb and flow.  In the nineteenth century, it was thought that the black race was on a demographic decline to extinction.  In the twenty-first, it is sometimes assumed that the white race is.  Neither is likely true, and now that the Hispanic population exceeds the black population in the United States, the monochromatic lens through which most race relations are viewed is increasingly irrelevant.\nThe dream isn’t deferred, it is simply impossible because it is nothing more than a delusion that one racial populations will behave in exactly the same manner as another one.  Since this has never happened yet in the recorded history of the human race, it seems more than a little quixotic to believe that because\nindividuals\nhave surmounted their racial, ethnic, and cultural differences, entire populations not only can, but will.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-27T13:00:00+00:00"
}