{
  "url": "https://voxday.net/2011/03/15/never-trust-experts/",
  "scraped_at": "2025-12-13T23:05:24.466862",
  "title": "Never trust the experts",
  "date_display": "March 15, 2011",
  "date_iso": "2011-03-15T15:45:00+00:00",
  "date_from_url": "2011-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zero Hedge underlines <a href=\"http://www.zerohedge.com/article/remember-mit-all-safe-paper\">one of my personal maxims</a>:</p><blockquote><p>Confirming, yet again, that MIT Ph.D.’s (such as the FRBNY’s Brian Sack) are among the most dangerous around, a paper made the rounds yesterday by one Josef Oehmen titled: “Why I am not worried about Japan’s nuclear reactors.” In the ensuing 48 hours, anyone who listened to Josef’s advice (who incidentally is not a scientist) and was also “not worried about the reactors” has paid an exorbitant price, possibly up to and including their lives. We demand that MIT School of Nuclear Science and Engineering clarify their position on the matter, and make sure that incidents such as this, where Oehmen’s paper received top billing due to its perceived “endorsement” by MIT and has since been completely discredited, never recur.</p><p>Full paper as was originally posted:</p><p><i>I repeat, there was and will *not* be any significant release of radioactivity from the damaged Japanese reactors.</i></p></blockquote><p>An expert is someone who is always correct when it doesn’t matter and usually wrong when it counts.  This is one of the reasons why I never, ever, put any faith in credentials.  Credentials are completely worthless, they’re not worth the paper on which they are printed.  Experience is somewhat more useful, but when the experienced individual cannot provide clear and sensible answers to straightforward and logically sound questions, your BS radar should be sounding like a radiation alarm at a Fukushima nuclear plant.</p><p>How did that M.I.T. PhD-backed prediction hold up? <i>“Dangerous levels of radiation leaking from a crippled nuclear plant forced Japan to order 140,000 people to seal themselves indoors Tuesday after an explosion and a fire dramatically escalated the crisis spawned by a deadly tsunami.  In a nationally televised statement, Prime Minister Naoto Kan said radiation had spread from the four stricken reactors of the Fukushima Dai-ichi nuclear plant along Japan’s northeastern coast.”</i></p><p>And now we know what an assurance from an M.I.T. PhD is worth.  How much less, then, is a PhD from a lesser school or in a less rigorous discipline to be trusted?  What must always be kept in mind is that the expert’s primary motivation is not what most people assume it to be.  Their main motivation is to <i>sound</i> credible rather than make an accurate judgment so they will always play the probabilities and state the obvious because this a) allows them to be correct most of the time, and b) only be wrong when everyone else is wrong.</p></div>",
  "content_text": "Zero Hedge underlines\none of my personal maxims\n:\nConfirming, yet again, that MIT Ph.D.’s (such as the FRBNY’s Brian Sack) are among the most dangerous around, a paper made the rounds yesterday by one Josef Oehmen titled: “Why I am not worried about Japan’s nuclear reactors.” In the ensuing 48 hours, anyone who listened to Josef’s advice (who incidentally is not a scientist) and was also “not worried about the reactors” has paid an exorbitant price, possibly up to and including their lives. We demand that MIT School of Nuclear Science and Engineering clarify their position on the matter, and make sure that incidents such as this, where Oehmen’s paper received top billing due to its perceived “endorsement” by MIT and has since been completely discredited, never recur.\nFull paper as was originally posted:\nI repeat, there was and will *not* be any significant release of radioactivity from the damaged Japanese reactors.\nAn expert is someone who is always correct when it doesn’t matter and usually wrong when it counts.  This is one of the reasons why I never, ever, put any faith in credentials.  Credentials are completely worthless, they’re not worth the paper on which they are printed.  Experience is somewhat more useful, but when the experienced individual cannot provide clear and sensible answers to straightforward and logically sound questions, your BS radar should be sounding like a radiation alarm at a Fukushima nuclear plant.\nHow did that M.I.T. PhD-backed prediction hold up?\n“Dangerous levels of radiation leaking from a crippled nuclear plant forced Japan to order 140,000 people to seal themselves indoors Tuesday after an explosion and a fire dramatically escalated the crisis spawned by a deadly tsunami.  In a nationally televised statement, Prime Minister Naoto Kan said radiation had spread from the four stricken reactors of the Fukushima Dai-ichi nuclear plant along Japan’s northeastern coast.”\nAnd now we know what an assurance from an M.I.T. PhD is worth.  How much less, then, is a PhD from a lesser school or in a less rigorous discipline to be trusted?  What must always be kept in mind is that the expert’s primary motivation is not what most people assume it to be.  Their main motivation is to\nsound\ncredible rather than make an accurate judgment so they will always play the probabilities and state the obvious because this a) allows them to be correct most of the time, and b) only be wrong when everyone else is wrong.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-15T15:45:00+00:00"
}