{
  "url": "https://voxday.net/2011/03/31/obama-is-not-eligible/",
  "scraped_at": "2025-12-13T23:06:51.524447",
  "title": "Obama is not eligible",
  "date_display": "March 31, 2011",
  "date_iso": "2011-03-31T13:00:00+00:00",
  "date_from_url": "2011-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is becoming increasingly clear that Obama is not eligible to hold the office he is presently usurping.  This nominal <a href=\"http://www.sandiego.com/news/opinion-feature-the-obama-birth-certificate-debate\">debate between two San Diego columnists</a> clearly demonstrates that the pro-Obama side has no defense for its position that Obama is a natural-born U.S. citizen and therefore Constitutionally eligible for the presidency other than snark and nonsensical appeals to conspiracy theory.  The claim that doubts about Obama’s eligibility might lead to another Holocaust even though the writer can’t figure out how that might come to pass is particularly noteworthy.</p><blockquote><p>Question 2) Where is the controversy today?</p><p>WL: With the failure of the courts to allow any examination of the merits based upon forensicly obtained evidence, birthers have turned to various other ancillary investigative venues to obtain disclosure.</p><p>Recent documents substantiate that Obama only attended Columbia University for 9 months in 1982-1983, contrary to official accounts.<br> FOIA and other requests have been submitted to the State Department for passport and travel records.<br> The Selective Service and Social Security Administrations have been asked for documentation regarding Obama’s Connecticut-based social security number 042-68-4425.<br> Investigators have traced the number prior to Obama’s [ending in 4424] to Newington, Conn. resident Thomas Wood, deceased at age 19.<br> To date no government agency can explain how Obama obtained the Connecticut number when at no point in his child or early adult years was he a resident of the state.<br> Investigations continue into Hawaiian infant-death records for sequential relationships with Obama’s COLB record number 151 01961 010641.<br> The Nordyke twins have made public their long-form certificates with numbers ending in 37 and 38.<br> There are several infant-death candidates that may have had birth certificate numbers issued during the August 1961 time frame. These efforts hope to yield more information now kept from the public.</br></br></br></br></br></br></br></p><p>DE: Today, birtherism is a matter of right wing political convenience. Besides the fact that the birther thing is one big ridiculous distraction from all the actual and very real problems currently facing our country and our world, it is useful for politicians as a dogwhistle. It isn’t 100% politically correct or fashionable to call someone a dirty stinking UnAmerican brown shit stain who hates Jesus and apple pie. That kind of talk is simply not allowed, but it’s possible to allude to that kind of thing. It’s very easy to thanks to the f**kwitted, evidence-free birther conspiracy theory. That’s why it’s beneficial for Donald Trump, a man who has got to be smarter than he looks, to imply that – golly gee willickers, guys, you know, hyuck, I just don’t know if Obama is an American or not since nobody from his childhood remembers him at all – excepting of course, for his kindergarten teachers.</p></blockquote><p>In summary, while it is still possible that Obama is Constitutionally eligible, you have to be an ignorant fool to believe that he has offered any conclusive evidence on his own behalf.  And when one considers all the actual evidence that has been amassed along with the mass of information being hidden from the public, the logical conclusion is that there is something very unusual about the man that likely goes well beyond his probable lack of Constitutional eligibility.</p><p>Whatever the truth turns out to be, one thing is perfectly clear.  The man is a fraud from start to finish and will be a strong candidate for the most inept president in U.S. history.  I will be extremely surprised if he can manage to obtain the Democratic nomination next year, much less the election.</p></div>",
  "content_text": "It is becoming increasingly clear that Obama is not eligible to hold the office he is presently usurping.  This nominal\ndebate between two San Diego columnists\nclearly demonstrates that the pro-Obama side has no defense for its position that Obama is a natural-born U.S. citizen and therefore Constitutionally eligible for the presidency other than snark and nonsensical appeals to conspiracy theory.  The claim that doubts about Obama’s eligibility might lead to another Holocaust even though the writer can’t figure out how that might come to pass is particularly noteworthy.\nQuestion 2) Where is the controversy today?\nWL: With the failure of the courts to allow any examination of the merits based upon forensicly obtained evidence, birthers have turned to various other ancillary investigative venues to obtain disclosure.\nRecent documents substantiate that Obama only attended Columbia University for 9 months in 1982-1983, contrary to official accounts.\nFOIA and other requests have been submitted to the State Department for passport and travel records.\nThe Selective Service and Social Security Administrations have been asked for documentation regarding Obama’s Connecticut-based social security number 042-68-4425.\nInvestigators have traced the number prior to Obama’s [ending in 4424] to Newington, Conn. resident Thomas Wood, deceased at age 19.\nTo date no government agency can explain how Obama obtained the Connecticut number when at no point in his child or early adult years was he a resident of the state.\nInvestigations continue into Hawaiian infant-death records for sequential relationships with Obama’s COLB record number 151 01961 010641.\nThe Nordyke twins have made public their long-form certificates with numbers ending in 37 and 38.\nThere are several infant-death candidates that may have had birth certificate numbers issued during the August 1961 time frame. These efforts hope to yield more information now kept from the public.\nDE: Today, birtherism is a matter of right wing political convenience. Besides the fact that the birther thing is one big ridiculous distraction from all the actual and very real problems currently facing our country and our world, it is useful for politicians as a dogwhistle. It isn’t 100% politically correct or fashionable to call someone a dirty stinking UnAmerican brown shit stain who hates Jesus and apple pie. That kind of talk is simply not allowed, but it’s possible to allude to that kind of thing. It’s very easy to thanks to the f**kwitted, evidence-free birther conspiracy theory. That’s why it’s beneficial for Donald Trump, a man who has got to be smarter than he looks, to imply that – golly gee willickers, guys, you know, hyuck, I just don’t know if Obama is an American or not since nobody from his childhood remembers him at all – excepting of course, for his kindergarten teachers.\nIn summary, while it is still possible that Obama is Constitutionally eligible, you have to be an ignorant fool to believe that he has offered any conclusive evidence on his own behalf.  And when one considers all the actual evidence that has been amassed along with the mass of information being hidden from the public, the logical conclusion is that there is something very unusual about the man that likely goes well beyond his probable lack of Constitutional eligibility.\nWhatever the truth turns out to be, one thing is perfectly clear.  The man is a fraud from start to finish and will be a strong candidate for the most inept president in U.S. history.  I will be extremely surprised if he can manage to obtain the Democratic nomination next year, much less the election.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-31T12:00:00+00:00"
}