{
  "url": "https://voxday.net/2011/03/08/of-orcs-and-alphas/",
  "scraped_at": "2025-12-13T23:04:38.425556",
  "title": "Of orcs and “alphas”",
  "date_display": "March 8, 2011",
  "date_iso": "2011-03-08T18:00:00+00:00",
  "date_from_url": "2011-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I tend to roll my eyes at alphas and their burning need to have their social superiority recognized, I don’t see fit to falsely denigrate them. They may not be the brightest collection of men on the planet, but neither are they orcs. They don’t have green skin and they certainly don’t ride warpigs.  This is why I never cease to find it amusing how men who are new to the theory of Game and don’t know the first thing about it are so prone to triumphantly declaring themselves an alpha… or even “<a href=\"http://alphagameplan.blogspot.com/2011/03/alphas-are-not-orcs.html\">a natural alpha</a>“.</p><p>Also, DJ has contributed his first post to Alpha Game, which is an intriguing application of Game <a href=\"http://alphagameplan.blogspot.com/2011/03/danger-of-self-deprecation.html\">to his workplace</a>.</p><p>UPDATE: RM has contributed his first post as well.  He is an omega, and I defy any man <a href=\"http://alphagameplan.blogspot.com/2011/03/bitter-discovery.html\">to read his story</a> without feeling some sense of empathy or admitting that Game is more than a cheap trick for pick-up artists to use on barsluts.  In some cases it has the potential, in a very literal and material sense, to be a lifesaver.</p></div>",
  "content_text": "While I tend to roll my eyes at alphas and their burning need to have their social superiority recognized, I don’t see fit to falsely denigrate them. They may not be the brightest collection of men on the planet, but neither are they orcs. They don’t have green skin and they certainly don’t ride warpigs.  This is why I never cease to find it amusing how men who are new to the theory of Game and don’t know the first thing about it are so prone to triumphantly declaring themselves an alpha… or even “\na natural alpha\n“.\nAlso, DJ has contributed his first post to Alpha Game, which is an intriguing application of Game\nto his workplace\n.\nUPDATE: RM has contributed his first post as well.  He is an omega, and I defy any man\nto read his story\nwithout feeling some sense of empathy or admitting that Game is more than a cheap trick for pick-up artists to use on barsluts.  In some cases it has the potential, in a very literal and material sense, to be a lifesaver.",
  "tags": [
    "game theory"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-08T18:00:00+00:00"
}