{
  "url": "https://voxday.net/2011/03/16/responding-to-bully/",
  "scraped_at": "2025-12-13T23:05:28.151561",
  "title": "Responding to a bully",
  "date_display": "March 16, 2011",
  "date_iso": "2011-03-16T09:23:00+00:00",
  "date_from_url": "2011-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/EkkS7EK_PxU?rel=0\" title=\"YouTube video player\" width=\"560\"></iframe></p><p><i>The same brief clip has been uploaded over and over on the Web: A scrawny bully sucker punches a larger chunkier boy multiple times, as other kids look on, some taunting. Then suddenly, with the speed and agility of an alligator, the victim responds, flipping the kid and bodyslamming him. “There’ll be reprisals from other kids in the school and he still has to go to school somewhere,” Casey’s father told the Daily Telegraph. “He’s not a violent kid, it’s the first time he’s lashed out and I don’t want him to be victimized over that.” Casey’s father added, “He’s always been taught never to hit. Apparently other people’s parents don’t teach their kids that.”</i></p><p>There are some lessons worth noting here.  First, smaller people can be bullies too, if they believe they can get away with it. <i>This includes girls and women.</i> And such bullies will continue to provoke and attack as long as the larger victim indicates his unwillingness to defend himself.  This is why it is important to react strongly enough to inflict real pain on a woman or child the first time they hit you, as it will teach them an important lesson about your unwillingness to accept physical attack without the risk of serious injury.  If a man submits to the physical bullying until it reaches the point at which he snaps, he’s a lot more likely to do more damage than he intends.  In this case, the little bully was fortunate that he didn’t get his leg broken or his skull cracked on the concrete, not that he wouldn’t have merited it if he had.</p><p>And you never know who is going to decide to test you for one reason or another.  A boy once inexplicably elected to kick me in the balls because I relayed his mother’s request that he go upstairs for dinner.  It didn’t hurt, but I reacted strongly in order to communicate to him that attacking an adult man without provocation was an insanely stupid thing to do.  Some people just need to learn life’s lessons in a physical manner.  Don’t hesitate to instruct them in a calm, but thorough manner.</p><p>Second, I have reluctantly been convinced that people, and perhaps more importantly, the police, are much more accepting of locks and throws utilized in self-defense than they are of punches and kicks, despite the fact that locks and throws are potentially more damaging and lethal.  So, if a bully throws a punch, instead of just trying to block it, step forward, grab the wrist, then step back and turn with your other hand placed behind the puncher’s elbow.  This will use his momentum to face-plant him on the ground if you’re in the open or smash his head into the wall if you have your back to one and it will happen before anyone realizes what is taking place.  If you’re dealing with more than one opponent and need a fast incapacitation, pull the punching arm straight to lock it and smash your forearm through the elbow.  Even if you don’t break the arm, the guy isn’t going to be throwing any punches with it for a minute or two.</p><p>Third, learn to finish.  Don’t step back when your opponent is down but not incapacitated or submissive, kick him in the face or in the sides.  Once is sufficient, any more will have people thinking you’re trying to kill the guy and leaping in to stop you.</p><p>And finally, refusing to teach your kid to fight, or worse, teaching him to not defend himself, doesn’t mean that he won’t have to do so.  In fact, it actually makes it much more likely that he’ll be targeted by bullies.  Bullies, of both the physical and psychological varieties, are much more often cowards than real fighters, so they seek soft targets.  Make it clear that you are not a soft target and there is a very good chance that you’ll never have a bully or a predator attempt to bother you in any way.</p></div>",
  "content_text": "The same brief clip has been uploaded over and over on the Web: A scrawny bully sucker punches a larger chunkier boy multiple times, as other kids look on, some taunting. Then suddenly, with the speed and agility of an alligator, the victim responds, flipping the kid and bodyslamming him. “There’ll be reprisals from other kids in the school and he still has to go to school somewhere,” Casey’s father told the Daily Telegraph. “He’s not a violent kid, it’s the first time he’s lashed out and I don’t want him to be victimized over that.” Casey’s father added, “He’s always been taught never to hit. Apparently other people’s parents don’t teach their kids that.”\nThere are some lessons worth noting here.  First, smaller people can be bullies too, if they believe they can get away with it.\nThis includes girls and women.\nAnd such bullies will continue to provoke and attack as long as the larger victim indicates his unwillingness to defend himself.  This is why it is important to react strongly enough to inflict real pain on a woman or child the first time they hit you, as it will teach them an important lesson about your unwillingness to accept physical attack without the risk of serious injury.  If a man submits to the physical bullying until it reaches the point at which he snaps, he’s a lot more likely to do more damage than he intends.  In this case, the little bully was fortunate that he didn’t get his leg broken or his skull cracked on the concrete, not that he wouldn’t have merited it if he had.\nAnd you never know who is going to decide to test you for one reason or another.  A boy once inexplicably elected to kick me in the balls because I relayed his mother’s request that he go upstairs for dinner.  It didn’t hurt, but I reacted strongly in order to communicate to him that attacking an adult man without provocation was an insanely stupid thing to do.  Some people just need to learn life’s lessons in a physical manner.  Don’t hesitate to instruct them in a calm, but thorough manner.\nSecond, I have reluctantly been convinced that people, and perhaps more importantly, the police, are much more accepting of locks and throws utilized in self-defense than they are of punches and kicks, despite the fact that locks and throws are potentially more damaging and lethal.  So, if a bully throws a punch, instead of just trying to block it, step forward, grab the wrist, then step back and turn with your other hand placed behind the puncher’s elbow.  This will use his momentum to face-plant him on the ground if you’re in the open or smash his head into the wall if you have your back to one and it will happen before anyone realizes what is taking place.  If you’re dealing with more than one opponent and need a fast incapacitation, pull the punching arm straight to lock it and smash your forearm through the elbow.  Even if you don’t break the arm, the guy isn’t going to be throwing any punches with it for a minute or two.\nThird, learn to finish.  Don’t step back when your opponent is down but not incapacitated or submissive, kick him in the face or in the sides.  Once is sufficient, any more will have people thinking you’re trying to kill the guy and leaping in to stop you.\nAnd finally, refusing to teach your kid to fight, or worse, teaching him to not defend himself, doesn’t mean that he won’t have to do so.  In fact, it actually makes it much more likely that he’ll be targeted by bullies.  Bullies, of both the physical and psychological varieties, are much more often cowards than real fighters, so they seek soft targets.  Make it clear that you are not a soft target and there is a very good chance that you’ll never have a bully or a predator attempt to bother you in any way.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-16T09:23:00+00:00"
}