{
  "url": "https://voxday.net/2011/03/08/temples-of-reason-crumble/",
  "scraped_at": "2025-12-13T23:04:36.606938",
  "title": "The temples of Reason crumble",
  "date_display": "March 8, 2011",
  "date_iso": "2011-03-08T14:30:00+00:00",
  "date_from_url": "2011-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Brooks explains, though only in part, <a href=\"http://www.nytimes.com/2011/03/08/opinion/08brooks.html?_r=1&amp;hp\">why enlightenment humanism has failed</a>:</p><blockquote><p>We had a financial regime based on the notion that bankers are rational creatures who wouldn’t do anything stupid en masse. For the past 30 years we’ve tried many different ways to restructure our educational system — trying big schools and little schools, charters and vouchers — that, for years, skirted the core issue: the relationship between a teacher and a student.</p><p>I’ve come to believe that these failures spring from a single failure: reliance on an overly simplistic view of human nature. We have a prevailing view in our society — not only in the policy world, but in many spheres — that we are divided creatures. Reason, which is trustworthy, is separate from the emotions, which are suspect. Society progresses to the extent that reason can suppress the passions….</p><p>[The present] body of research suggests the French enlightenment view of human nature, which emphasized individualism and reason, was wrong. The British enlightenment, which emphasized social sentiments, was more accurate about who we are. It suggests we are not divided creatures. We don’t only progress as reason dominates the passions. We also thrive as we educate our emotions.</p></blockquote><p>Brooks is looking in the right direction, but he’s not looking far enough.  Man is not merely an emotional being, but a <i>spiritual</i> one.  He seeks purpose and meaning in addition to happiness and joy.  A new humanism that attempts to incorporate emotion into its rationalist models will certainly improve upon the dreadful performance of the previous models, but is still going to fall considerably short of effectiveness as the continued failure of utilitarianism in all its various permutations demonstrates.</p><p>The humanist model of the British enlightenment is certainly superior to the French one.  But so long as humanists cling stubbornly to their dogmatic secularism, in the face of an increasing body of scientific evidence demonstrating the superiority of the religious models in terms of health, demographics, societal stability, and human happiness, even their improved models of human behavior are doomed to certain failure.</p><p>I have pointed out many times before that man is not a rational animal, he is a rationalizing creature.  Man’s behavior cannot be understood or reliably anticipated until both his rationalizations and his purposes in concocting those rationalizations are reasonably understood.</p></div>",
  "content_text": "David Brooks explains, though only in part,\nwhy enlightenment humanism has failed\n:\nWe had a financial regime based on the notion that bankers are rational creatures who wouldn’t do anything stupid en masse. For the past 30 years we’ve tried many different ways to restructure our educational system — trying big schools and little schools, charters and vouchers — that, for years, skirted the core issue: the relationship between a teacher and a student.\nI’ve come to believe that these failures spring from a single failure: reliance on an overly simplistic view of human nature. We have a prevailing view in our society — not only in the policy world, but in many spheres — that we are divided creatures. Reason, which is trustworthy, is separate from the emotions, which are suspect. Society progresses to the extent that reason can suppress the passions….\n[The present] body of research suggests the French enlightenment view of human nature, which emphasized individualism and reason, was wrong. The British enlightenment, which emphasized social sentiments, was more accurate about who we are. It suggests we are not divided creatures. We don’t only progress as reason dominates the passions. We also thrive as we educate our emotions.\nBrooks is looking in the right direction, but he’s not looking far enough.  Man is not merely an emotional being, but a\nspiritual\none.  He seeks purpose and meaning in addition to happiness and joy.  A new humanism that attempts to incorporate emotion into its rationalist models will certainly improve upon the dreadful performance of the previous models, but is still going to fall considerably short of effectiveness as the continued failure of utilitarianism in all its various permutations demonstrates.\nThe humanist model of the British enlightenment is certainly superior to the French one.  But so long as humanists cling stubbornly to their dogmatic secularism, in the face of an increasing body of scientific evidence demonstrating the superiority of the religious models in terms of health, demographics, societal stability, and human happiness, even their improved models of human behavior are doomed to certain failure.\nI have pointed out many times before that man is not a rational animal, he is a rationalizing creature.  Man’s behavior cannot be understood or reliably anticipated until both his rationalizations and his purposes in concocting those rationalizations are reasonably understood.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-08T14:30:00+00:00"
}