{
  "url": "https://voxday.net/2011/03/01/were-25-24/",
  "scraped_at": "2025-12-13T23:03:56.260958",
  "title": "We’re #2524",
  "date_display": "March 1, 2011",
  "date_iso": "2011-03-01T23:31:00+00:00",
  "date_from_url": "2011-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would appear Death By 1000 Papercuts’s Alexa-based metric has Vox Popoli listed as <a href=\"http://deathby1000papercuts.com/2011/03/top-libertarian-40-sites-march-2011/\">the 24th most popular libertarian site</a> on the Internet.  Perhaps this will suffice to convince people that I am really not a social conservative, given that my staunch support for legal drugs, prostitution, and nuclear weapons, (to say nothing of my opposition to military imperialism, financial interventionism, government-sanctioned marriage, and the pledge of allegiance), doesn’t appear to have done the trick.</p><p>Now, I’m not into chest-thumping over hits and lists and awards.  Except, of course, the one award given by Bane, which I will cherish always. (Note to those who bought into the whole Bane is Dead charade… just look at the Middle East.  Now you know what he’s been up to.)  First, there are too many horrible sites that are highly ranked and too many very good sites that virtually no one reads to take the numbers game very seriously.  Second, let’s be honest, I am a little too arrogant to be inclined to put much credence in a metric that depends upon what most people like, most people being idiots and all.</p><p>But I do find it a little mystifying when those with readerships that are but a fraction of the Dread Ilk – let alone the WND readership – attempt to dismiss what I’m writing because they think no one reads it.  How, precisely, does that compute?</p></div>",
  "content_text": "It would appear Death By 1000 Papercuts’s Alexa-based metric has Vox Popoli listed as\nthe 24th most popular libertarian site\non the Internet.  Perhaps this will suffice to convince people that I am really not a social conservative, given that my staunch support for legal drugs, prostitution, and nuclear weapons, (to say nothing of my opposition to military imperialism, financial interventionism, government-sanctioned marriage, and the pledge of allegiance), doesn’t appear to have done the trick.\nNow, I’m not into chest-thumping over hits and lists and awards.  Except, of course, the one award given by Bane, which I will cherish always. (Note to those who bought into the whole Bane is Dead charade… just look at the Middle East.  Now you know what he’s been up to.)  First, there are too many horrible sites that are highly ranked and too many very good sites that virtually no one reads to take the numbers game very seriously.  Second, let’s be honest, I am a little too arrogant to be inclined to put much credence in a metric that depends upon what most people like, most people being idiots and all.\nBut I do find it a little mystifying when those with readerships that are but a fraction of the Dread Ilk – let alone the WND readership – attempt to dismiss what I’m writing because they think no one reads it.  How, precisely, does that compute?",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-01T23:31:00+00:00"
}