{
  "url": "https://voxday.net/2011/03/21/what-free-marke/",
  "scraped_at": "2025-12-13T23:06:00.864628",
  "title": "What free market",
  "date_display": "March 21, 2011",
  "date_iso": "2011-03-21T14:00:00+00:00",
  "date_from_url": "2011-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you needed any more evidence that Americans <a href=\"http://www.citizen-times.com/article/20110319/NEWS01/110319006/1001/news/Liberty-Dollar-fake-currency-creator-convicted-federal-court?odyssey=nav|head\">do not enjoy a free market</a>, look no further:</p><blockquote><p>“Attempts to undermine the legitimate currency of this country are simply a unique form of domestic terrorism,” U.S. Attorney Anne Tompkins said. “While these forms of anti-government activities do not involve violence, they are every bit as insidious and represent a clear and present danger to the economic stability of this country. We are determined to meet these threats through infiltration, disruption and dismantling of organizations which seek to challenge the legitimacy of our democratic form of government,” Tompkins said.</p><p>Von NotHaus, 67, faces up to 25 years in prison during sentencing, which hasn’t been scheduled. The government also is seeking the forfeiture of about 16,000 pounds of Liberty Dollar coins and precious metals valued at nearly $7 million.</p></blockquote><p>This is insane on at least three levels.  First, if anyone in the country is going to be arrested for financially-related domestic terrorism representing a clear and present danger to the economic stability of the country, it should be Alan Greenspan and Ben Bernanke.  They, more than anyone, have put the nation on the brink of economic and political collapse.  Second, if the Neo-Keynesian economic policies being pursued by the federal government are correct, then more money circulating in the system is beneficial to it regardless of whether they are Federal Reserve Notes, Liberty Dollars, or Donkey Kong’s Coconut currency since it increases the money supply.  Third, our legitimate <i>Constitutional </i>form of government doesn’t permit the use money that is not gold and silver.  Fourth, if America did have a genuinely democratic form of government, Americans would be permitted to utilize any form of currency they happened to desire.</p><p>On the other hand, it is obvious that Von Nothaus left himself vulnerable to counterfeiting charges by consciously imitating the look and feel of U.S. coinage.  It would be interesting to know if they would have been able to successfully charge him with counterfeiting if he had produced silver coins shaped in triangles and rectangles that bore no similarities whatsoever to the federal ones.  And on an economic note, it may amuse some of you to know that the first time I glanced over the article, I read “infiltration” as “inflation”.</p></div>",
  "content_text": "If you needed any more evidence that Americans\ndo not enjoy a free market\n, look no further:\n“Attempts to undermine the legitimate currency of this country are simply a unique form of domestic terrorism,” U.S. Attorney Anne Tompkins said. “While these forms of anti-government activities do not involve violence, they are every bit as insidious and represent a clear and present danger to the economic stability of this country. We are determined to meet these threats through infiltration, disruption and dismantling of organizations which seek to challenge the legitimacy of our democratic form of government,” Tompkins said.\nVon NotHaus, 67, faces up to 25 years in prison during sentencing, which hasn’t been scheduled. The government also is seeking the forfeiture of about 16,000 pounds of Liberty Dollar coins and precious metals valued at nearly $7 million.\nThis is insane on at least three levels.  First, if anyone in the country is going to be arrested for financially-related domestic terrorism representing a clear and present danger to the economic stability of the country, it should be Alan Greenspan and Ben Bernanke.  They, more than anyone, have put the nation on the brink of economic and political collapse.  Second, if the Neo-Keynesian economic policies being pursued by the federal government are correct, then more money circulating in the system is beneficial to it regardless of whether they are Federal Reserve Notes, Liberty Dollars, or Donkey Kong’s Coconut currency since it increases the money supply.  Third, our legitimate\nConstitutional\nform of government doesn’t permit the use money that is not gold and silver.  Fourth, if America did have a genuinely democratic form of government, Americans would be permitted to utilize any form of currency they happened to desire.\nOn the other hand, it is obvious that Von Nothaus left himself vulnerable to counterfeiting charges by consciously imitating the look and feel of U.S. coinage.  It would be interesting to know if they would have been able to successfully charge him with counterfeiting if he had produced silver coins shaped in triangles and rectangles that bore no similarities whatsoever to the federal ones.  And on an economic note, it may amuse some of you to know that the first time I glanced over the article, I read “infiltration” as “inflation”.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-21T14:00:00+00:00"
}