{
  "url": "https://voxday.net/2011/03/10/wisconsin-republicans-show-some/",
  "scraped_at": "2025-12-13T23:04:51.456634",
  "title": "Wisconsin Republicans show some backbone",
  "date_display": "March 10, 2011",
  "date_iso": "2011-03-10T14:30:00+00:00",
  "date_from_url": "2011-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Senate <a href=\"http://hosted.ap.org/dynamic/stories/U/US_WISCONSIN_BUDGET_UNIONS?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2011-03-09-19-45-22\">outflanks the Democratic fleebaggers</a>.</p><blockquote><p>The Wisconsin Senate succeeded in voting Wednesday to strip nearly all collective bargaining rights from public workers, after Republicans outmaneuvered the chamber’s missing Democrats and approved an explosive proposal that has rocked the state and unions nationwide.</p><p>“You are cowards!” spectators in the Senate gallery screamed as lawmakers voted. Within hours, a crowd of a few hundred protesters inside the Capitol had grown to an estimated 7,000, more than had been in the building at any point during weeks of protests….  All 14 Senate Democrats fled to Illinois nearly three weeks ago….</p></blockquote><p>I don’t think the side whose elected representatives ran away has a lot of room for calling anyone else “cowards”.  The only cowardly thing the Republicans have done is to exclude police and fire unions from the new law, but I don’t think that’s what the protesters meant.  As for the calls for a general strike, Governor Walker will be hoping that the unions try it as this will give him the chance to shatter the public unions for good.  There is a term for politicians who take on and break unions in economic hard times, and that is “respected head of government”.  Don’t forget that union-breaking was the early signature of both Reagan and Thatcher.  If the unions are foolish enough to go to the wall on this, despite getting played so badly, and Walker crushes them, both the Republican nomination and the White House will be his for the taking.</p><p>UPDATE: The Democratic Left is showing its newfound, post-Arizona <a href=\"http://www.620wtmj.com/news/local/117732923.html\">respect for political civility</a>: <i>“Please put your things in order because you will be killed and your familes will also be killed due to your actions in the last 8 weeks. Please explain to them that this is because if we get rid of you and your families then it will save the rights of 300,000 people and also be able to close the deficit that you have created. I hope you have a good time in hell. Read below for more information on possible scenarios in which you will die.”</i></p></div>",
  "content_text": "The Senate\noutflanks the Democratic fleebaggers\n.\nThe Wisconsin Senate succeeded in voting Wednesday to strip nearly all collective bargaining rights from public workers, after Republicans outmaneuvered the chamber’s missing Democrats and approved an explosive proposal that has rocked the state and unions nationwide.\n“You are cowards!” spectators in the Senate gallery screamed as lawmakers voted. Within hours, a crowd of a few hundred protesters inside the Capitol had grown to an estimated 7,000, more than had been in the building at any point during weeks of protests….  All 14 Senate Democrats fled to Illinois nearly three weeks ago….\nI don’t think the side whose elected representatives ran away has a lot of room for calling anyone else “cowards”.  The only cowardly thing the Republicans have done is to exclude police and fire unions from the new law, but I don’t think that’s what the protesters meant.  As for the calls for a general strike, Governor Walker will be hoping that the unions try it as this will give him the chance to shatter the public unions for good.  There is a term for politicians who take on and break unions in economic hard times, and that is “respected head of government”.  Don’t forget that union-breaking was the early signature of both Reagan and Thatcher.  If the unions are foolish enough to go to the wall on this, despite getting played so badly, and Walker crushes them, both the Republican nomination and the White House will be his for the taking.\nUPDATE: The Democratic Left is showing its newfound, post-Arizona\nrespect for political civility\n:\n“Please put your things in order because you will be killed and your familes will also be killed due to your actions in the last 8 weeks. Please explain to them that this is because if we get rid of you and your families then it will save the rights of 300,000 people and also be able to close the deficit that you have created. I hope you have a good time in hell. Read below for more information on possible scenarios in which you will die.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-10T14:30:00+00:00"
}