{
  "url": "https://voxday.net/2011/03/23/wishful-thinking-2/",
  "scraped_at": "2025-12-13T23:06:11.589889",
  "title": "Wishful thinking",
  "date_display": "March 23, 2011",
  "date_iso": "2011-03-23T14:59:00+00:00",
  "date_from_url": "2011-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Someday, scientists will learn that mathematical models only predict <a href=\"http://www.bbc.co.uk/news/science-environment-12811197\">what they are constructed to predict</a>.  At that point, they will have finally intellectually evolved to the point of a 13 year-old computer programmer.  Because computer models are neither studies nor are they science:</p><blockquote><p>A study using census data from nine countries shows that religion there is set for extinction, say researchers. The study found a steady rise in those claiming no religious affiliation.  The team’s mathematical model attempts to account for the interplay between the number of religious respondents and the social motives behind being one.  The result, reported at the American Physical Society meeting in Dallas, US, indicates that religion will all but die out altogether in those countries.</p></blockquote><p>I think it is far more likely that one or more of the listed countries, starting with The Netherlands, will become completely Islamic than it will become completely irreligious.  The key <i>logical</i> flaw in the study is that in addition to positing that social groups that have more members are going to be more attractive and that social groups have a social status or utility, it also posits that all social groups have equal utility.</p><p>But this isn’t the case, particularly when comparing religious groups with non-religious groups.  The non-religious groups don’t provide their memberships with the same benefits as the religious groups, for the obvious reason that they are an intrinsically negative group, defined solely by what they are not.  As atheists love to claim, none of them have anything in common with one another, except for the fact that they are uniformly smarter, more highly evolved, better educated, and morally superior on the basis of their non-belief.  (Hey, I TOLD you they were irrational).</p><p>But even if the non-religious do have some things in common, this doesn’t mean that they will benefit from membership in the non-religious group the way that most religious individuals do.  And, of course, ignoring the demographics in favor of cherry-picking one linear projection rather than another is rather unlikely to deliver a reliable predictive model.  This is nothing new, it’s merely the same deluded assertion that has been repeatedly made by Enlightenment propagandists since the 18th century.  They were wrong then and they’re wrong now.</p><p>UPDATE – AL notes that the “study” is even worse than it appears at first glance: <i>“I was expecting a full demographic study. But all they have is a nonlinear model fit using datasets of nine particularly nonreligious countries (with the exception of Ireland). Even in the cases of Switzerland and Austria, they just use one canton/province — anyone with a passing knowledge of religious demographics knows that Vienna has been non-religious for a while. No data for the US either.  Now, the authors claim that their model can be “perturbed” and be applied perfectly to other datasets to see similar results. I wonder what the results would be if one used the data for a Muslim country. Meanwhile, the Ikhwan just won the election for constitutional changes in Egypt and Gaddafi has vowed to pack France with immigrants if he goes down.”</i></p></div>",
  "content_text": "Someday, scientists will learn that mathematical models only predict\nwhat they are constructed to predict\n.  At that point, they will have finally intellectually evolved to the point of a 13 year-old computer programmer.  Because computer models are neither studies nor are they science:\nA study using census data from nine countries shows that religion there is set for extinction, say researchers. The study found a steady rise in those claiming no religious affiliation.  The team’s mathematical model attempts to account for the interplay between the number of religious respondents and the social motives behind being one.  The result, reported at the American Physical Society meeting in Dallas, US, indicates that religion will all but die out altogether in those countries.\nI think it is far more likely that one or more of the listed countries, starting with The Netherlands, will become completely Islamic than it will become completely irreligious.  The key\nlogical\nflaw in the study is that in addition to positing that social groups that have more members are going to be more attractive and that social groups have a social status or utility, it also posits that all social groups have equal utility.\nBut this isn’t the case, particularly when comparing religious groups with non-religious groups.  The non-religious groups don’t provide their memberships with the same benefits as the religious groups, for the obvious reason that they are an intrinsically negative group, defined solely by what they are not.  As atheists love to claim, none of them have anything in common with one another, except for the fact that they are uniformly smarter, more highly evolved, better educated, and morally superior on the basis of their non-belief.  (Hey, I TOLD you they were irrational).\nBut even if the non-religious do have some things in common, this doesn’t mean that they will benefit from membership in the non-religious group the way that most religious individuals do.  And, of course, ignoring the demographics in favor of cherry-picking one linear projection rather than another is rather unlikely to deliver a reliable predictive model.  This is nothing new, it’s merely the same deluded assertion that has been repeatedly made by Enlightenment propagandists since the 18th century.  They were wrong then and they’re wrong now.\nUPDATE – AL notes that the “study” is even worse than it appears at first glance:\n“I was expecting a full demographic study. But all they have is a nonlinear model fit using datasets of nine particularly nonreligious countries (with the exception of Ireland). Even in the cases of Switzerland and Austria, they just use one canton/province — anyone with a passing knowledge of religious demographics knows that Vienna has been non-religious for a while. No data for the US either.  Now, the authors claim that their model can be “perturbed” and be applied perfectly to other datasets to see similar results. I wonder what the results would be if one used the data for a Muslim country. Meanwhile, the Ikhwan just won the election for constitutional changes in Egypt and Gaddafi has vowed to pack France with immigrants if he goes down.”",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-23T14:59:00+00:00"
}