{
  "url": "https://voxday.net/2011/03/17/yemen-and-art-of-dream-crushing/",
  "scraped_at": "2025-12-13T23:05:35.472108",
  "title": "Yemen and the art of dream-crushing",
  "date_display": "March 17, 2011",
  "date_iso": "2011-03-17T14:15:00+00:00",
  "date_from_url": "2011-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is a Game maxim which some may regard as controversial, although it really isn’t. Men who want a strong and lasting long-term relationship <a href=\"http://alphagameplan.blogspot.com/2011/03/how-to-crush-womans-dreams.html\">should crush a woman’s dreams</a> without hesitation, if those dreams are not entirely consistent with her primary role as a wife and mother.</p><p>Also at Alpha Game, a lightbulb goes off in the mind of the resident Omega regarding <a href=\"http://alphagameplan.blogspot.com/2011/03/lightbulb.html\">his fear of approaching women</a>. <i>Thinking further about the subject of fear I had an insight. I began to ask myself why I was afraid. I started looking for the source of the fear, going beyond facing it and rather trying to understand it. What I found was that I am not afraid of girls. If I was I would not be able to go out in public. Really, why would I, a 6’2″ guy be afraid of a tiny 5′ girl? Nor am I afraid of conversation with a stranger. While I prefer my own company, having a pleasant chat with someone is not that difficult. What, then, makes me nervous when I approach?</i></p><p>RM contemplates how much of his desire to wait until marriage was the legitimate Biblical teaching versus Churchian custom and <a href=\"http://alphagameplan.blogspot.com/2011/03/church-of-delta.html\">his own mask of delta</a>. <i>When I was a younger delta, I believed I had strong convictions about waiting for marriage for sexual intimacy. This was the result of my many years of churchianity morality training. Some of it was Biblically correct… other parts not so much. What I have come to understand is that this was more than a belief, it was a convenient mask for my delta ways.</i></p><p>And finally, <a href=\"http://alphagameplan.blogspot.com/2011/03/alpha-mail-marriage-and-comedy.html\">the first Alpha Mail post</a>.</p></div>",
  "content_text": "Here is a Game maxim which some may regard as controversial, although it really isn’t. Men who want a strong and lasting long-term relationship\nshould crush a woman’s dreams\nwithout hesitation, if those dreams are not entirely consistent with her primary role as a wife and mother.\nAlso at Alpha Game, a lightbulb goes off in the mind of the resident Omega regarding\nhis fear of approaching women\n.\nThinking further about the subject of fear I had an insight. I began to ask myself why I was afraid. I started looking for the source of the fear, going beyond facing it and rather trying to understand it. What I found was that I am not afraid of girls. If I was I would not be able to go out in public. Really, why would I, a 6’2″ guy be afraid of a tiny 5′ girl? Nor am I afraid of conversation with a stranger. While I prefer my own company, having a pleasant chat with someone is not that difficult. What, then, makes me nervous when I approach?\nRM contemplates how much of his desire to wait until marriage was the legitimate Biblical teaching versus Churchian custom and\nhis own mask of delta\n.\nWhen I was a younger delta, I believed I had strong convictions about waiting for marriage for sexual intimacy. This was the result of my many years of churchianity morality training. Some of it was Biblically correct… other parts not so much. What I have come to understand is that this was more than a belief, it was a convenient mask for my delta ways.\nAnd finally,\nthe first Alpha Mail post\n.",
  "tags": [
    "game theory"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-03-17T14:15:00+00:00"
}