{
  "url": "https://voxday.net/2005/02/11/and-you-think-im-conspiracis/",
  "scraped_at": "2026-01-08T19:52:48.062071",
  "title": "And you think I’M a conspiracist!",
  "date_display": "February 11, 2005",
  "date_iso": "2005-02-11T08:42:00+00:00",
  "date_from_url": "2005-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Maybe Paul <a href=\"http://digilander.libero.it/jamespaul/fc1.html\">really is dead</a>….  Courtesy of the thankfully inimitable Bane.  Being born after the “Paul is dead” hooplah, I’d never given the matter a moment’s thought, but speaking as someone who has written a few songs professionally, I have wondered about the qualitative difference between the melodies flowing through the early Beatles music and the rather leaden tunes of post-Beatles McCartney-written songs.  When Douglas Adams referred to Paul McCartney as a phenomenal songwriter* – I was first reading Hitchhikers when the Wings were still active and I really didn’t know much Beatles’ music – I had no idea how on Earth he could possibly write that.</p><p>*<em>in describing the sweetly xenophobic songs sung by the people of Krikkit</em></p></div>",
  "content_text": "Maybe Paul\nreally is dead\n….  Courtesy of the thankfully inimitable Bane.  Being born after the “Paul is dead” hooplah, I’d never given the matter a moment’s thought, but speaking as someone who has written a few songs professionally, I have wondered about the qualitative difference between the melodies flowing through the early Beatles music and the rather leaden tunes of post-Beatles McCartney-written songs.  When Douglas Adams referred to Paul McCartney as a phenomenal songwriter* – I was first reading Hitchhikers when the Wings were still active and I really didn’t know much Beatles’ music – I had no idea how on Earth he could possibly write that.\n*\nin describing the sweetly xenophobic songs sung by the people of Krikkit",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-11T08:42:00+00:00"
}