{
  "url": "https://voxday.net/2005/02/08/chasm-beckons/",
  "scraped_at": "2026-01-08T19:52:25.697888",
  "title": "The chasm beckons",
  "date_display": "February 8, 2005",
  "date_iso": "2005-02-08T08:41:00+00:00",
  "date_from_url": "2005-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stephen Roach, one of the few mainstream economists for whom I have any respect, highlights an interesting confession:<br/></p><blockquote><p>:<br> <br>At long last, <a href=\"http://www.morganstanley.com/GEFdata/digests/20050207-mon.html#anchor0\">Federal Reserve Chairman Alan Greenspan has owned up</a> to the central role he has played in sparking unprecedented global imbalances.  His confession came in the form of a speech innocuously entitled, “Current Account” that was given in London at the Advancing Enterprise 2005 Conference on the eve of the 5 February G-7 meeting.  In the narrow world of econo-speak, his prepared text contains the functional equivalent of a “smoking gun.”</br></br></p><p>Greenspan’s admission came when he finally made the connection between the excesses of America’s property market and its gaping current account deficit.  To the best of my knowledge, this was the first time he ventured into this realm of the debate with such clarity.  He starts by conceding “…the growth of home mortgage debt has been the major contributor to the decline in the personal saving rate in the United States from almost 6 percent in 1993 to its current level of 1 percent.”  He then goes on to admit that the rapid growth in home mortgage debt over the past five years has been “driven largely by equity extraction” — jargon for the withdrawal of asset appreciation from the consumer’s largest portfolio holding, the home.    In addition, the Chairman cites survey data suggesting, “Approximately half of equity extraction shows up in additional household expenditures, reducing savings commensurately and thereby presumably contributing to the current account deficit.”  In other words, he concedes that a debt-induced consumption boom has led to a massive current account deficit.  That says it all, in my view.</p><p>The obvious and most important point is that rapid growth of US mortgage debt did not come out of thin air.  It was, of course, a direct outgrowth of the Fed’s hyper-accommodation of the post-bubble era — namely, short-term interest rates that have been negative in real terms for longer than at any point since the 1970s.  As Greenspan’s dryly notes, “The fall in US interest rates since the early 1980s has supported home price increases.”<br/></p></blockquote><p>I’m not precisely sure what Greenspan’s confession of the obvious indicates, but my intuitive response is that he is providing a public warning for those with the wits to pay attention.  Roach adds: “What he is saying implicitly is that the Fed will need to withdraw support from the Asset Economy by restoring some semblance of normalcy to America’s real interest rate structure.”</p><p>In other words, the Fed is not planning to continuing the attempt to inflate its way out – which was never going to work in the long term anyhow – so the price of assets is likely to fall.  This may be why the dollar has already risen 7 percent against the euro at the time when everyone (except me and a few Elliott Wavers) was predicting its imminent demise.</p><p>The old saying is buy low, sell high.  I suspect that Good Sir Alan is telling us that the time for the latter has finally arrived.<br/></p></div>",
  "content_text": "Stephen Roach, one of the few mainstream economists for whom I have any respect, highlights an interesting confession:\n:\nAt long last,\nFederal Reserve Chairman Alan Greenspan has owned up\nto the central role he has played in sparking unprecedented global imbalances.  His confession came in the form of a speech innocuously entitled, “Current Account” that was given in London at the Advancing Enterprise 2005 Conference on the eve of the 5 February G-7 meeting.  In the narrow world of econo-speak, his prepared text contains the functional equivalent of a “smoking gun.”\nGreenspan’s admission came when he finally made the connection between the excesses of America’s property market and its gaping current account deficit.  To the best of my knowledge, this was the first time he ventured into this realm of the debate with such clarity.  He starts by conceding “…the growth of home mortgage debt has been the major contributor to the decline in the personal saving rate in the United States from almost 6 percent in 1993 to its current level of 1 percent.”  He then goes on to admit that the rapid growth in home mortgage debt over the past five years has been “driven largely by equity extraction” — jargon for the withdrawal of asset appreciation from the consumer’s largest portfolio holding, the home.    In addition, the Chairman cites survey data suggesting, “Approximately half of equity extraction shows up in additional household expenditures, reducing savings commensurately and thereby presumably contributing to the current account deficit.”  In other words, he concedes that a debt-induced consumption boom has led to a massive current account deficit.  That says it all, in my view.\nThe obvious and most important point is that rapid growth of US mortgage debt did not come out of thin air.  It was, of course, a direct outgrowth of the Fed’s hyper-accommodation of the post-bubble era — namely, short-term interest rates that have been negative in real terms for longer than at any point since the 1970s.  As Greenspan’s dryly notes, “The fall in US interest rates since the early 1980s has supported home price increases.”\nI’m not precisely sure what Greenspan’s confession of the obvious indicates, but my intuitive response is that he is providing a public warning for those with the wits to pay attention.  Roach adds: “What he is saying implicitly is that the Fed will need to withdraw support from the Asset Economy by restoring some semblance of normalcy to America’s real interest rate structure.”\nIn other words, the Fed is not planning to continuing the attempt to inflate its way out – which was never going to work in the long term anyhow – so the price of assets is likely to fall.  This may be why the dollar has already risen 7 percent against the euro at the time when everyone (except me and a few Elliott Wavers) was predicting its imminent demise.\nThe old saying is buy low, sell high.  I suspect that Good Sir Alan is telling us that the time for the latter has finally arrived.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-08T08:41:00+00:00"
}