{
  "url": "https://voxday.net/2005/02/20/gigo-messes-with-wrong-blog/",
  "scraped_at": "2026-01-08T19:54:00.194825",
  "title": "GIGO messes with the wrong blog",
  "date_display": "February 20, 2005",
  "date_iso": "2005-02-20T12:07:00+00:00",
  "date_from_url": "2005-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Datadave demonstrates his near-complete ignorance of history and economics:</p><blockquote><p>You don’t know your history, The last King of France Louie #? practiced Libertarian market economics to his nation’s disaster.</p></blockquote><p>Oh, you poor, wildly ignorant thing.  You openly admit that you don’t know that Louis XVI was the last crowned king of pre-Revolutionary France, while simultaneously claiming that others don’t know history?  I strongly suggest you read Andrew Dickson White’s THE HISTORY OF FIAT MONEY IN FRANCE so that you can begin to understand the historical scenario.  You can download a free copy <a href=\"http://lynncoins.com/fiat-money-france.htm\">here</a>.   THE OLD REGIME AND THE FRENCH REVOLUTION by Tocqueville would certainly be in order, though you might wish to start with an easier read, CITIZENS, by Simon Schama, first.  Although given your apparent level of ignorance, even a little Dickens and Dumas would likely prove more than a little enlightening.</p><p>The irony of conflating monarchical rule with libertarianism is amusing enough, but the ahistorical assertion that the French economy was totally ruined prior to the Revolution* is almost as bad, considering how much worse the National Assembly managed to exacerbate the situation in a matter of months.</p><p>As for Krugman, I’ll post an amusing example of his typically disastrous predictions later today.  And likely one dealing with his “truthfulness” as well.  And no, I am not a fan of Bush’s “privatization” plan either; I predicted this move to pump money into the stock market back in 1998 although I thought Clinton would do it.</p><p>*<em>This is not to say that the French economy was in good shape, however.  But the reason for the massive, deflationary debts of the French crown were not “libertarian economics” but its precise opposite, namely, government spending.  One wonders if the clueless of the future will one day attempt to likewise blame the current U.S. government debts on libertarians.  If the governments are still running the schools then, one has to assume that will be the case.</em></p></div>",
  "content_text": "Datadave demonstrates his near-complete ignorance of history and economics:\nYou don’t know your history, The last King of France Louie #? practiced Libertarian market economics to his nation’s disaster.\nOh, you poor, wildly ignorant thing.  You openly admit that you don’t know that Louis XVI was the last crowned king of pre-Revolutionary France, while simultaneously claiming that others don’t know history?  I strongly suggest you read Andrew Dickson White’s THE HISTORY OF FIAT MONEY IN FRANCE so that you can begin to understand the historical scenario.  You can download a free copy\nhere\n.   THE OLD REGIME AND THE FRENCH REVOLUTION by Tocqueville would certainly be in order, though you might wish to start with an easier read, CITIZENS, by Simon Schama, first.  Although given your apparent level of ignorance, even a little Dickens and Dumas would likely prove more than a little enlightening.\nThe irony of conflating monarchical rule with libertarianism is amusing enough, but the ahistorical assertion that the French economy was totally ruined prior to the Revolution* is almost as bad, considering how much worse the National Assembly managed to exacerbate the situation in a matter of months.\nAs for Krugman, I’ll post an amusing example of his typically disastrous predictions later today.  And likely one dealing with his “truthfulness” as well.  And no, I am not a fan of Bush’s “privatization” plan either; I predicted this move to pump money into the stock market back in 1998 although I thought Clinton would do it.\n*\nThis is not to say that the French economy was in good shape, however.  But the reason for the massive, deflationary debts of the French crown were not “libertarian economics” but its precise opposite, namely, government spending.  One wonders if the clueless of the future will one day attempt to likewise blame the current U.S. government debts on libertarians.  If the governments are still running the schools then, one has to assume that will be the case.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-20T12:07:00+00:00"
}