{
  "url": "https://voxday.net/2005/02/11/god-and-governments/",
  "scraped_at": "2026-01-08T19:52:46.226508",
  "title": "God and governments",
  "date_display": "February 11, 2005",
  "date_iso": "2005-02-11T08:04:00+00:00",
  "date_from_url": "2005-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Farmer combines ideology with theology:</p><blockquote><p>As a Christian I am subject to all three systems of law, the family, the natural law and the church. The arguments today are over who enforces the natural law. If God sets up human governments, and he clearly does. Then how will those governments enforce the natural law….  Some of you seem to be saying that no law or system would be preferable to what we have here in the US of A now. God did not create that kind of a system and some distorted kind of government would naturally form to fill the void</p></blockquote><p>I’m curious to know if Farmer Tom supports the war on Iraq.  After all, if God is setting up human governments, then there’s no more reason for the American people to wage war on the God-given Iraqi government of Saddam Hussein than there is for libertarian Americans to disdain their current federal government in favor of one that respects individual rights.</p><p>A major flaw in this submission-to-the-state argument is that it applies as equally to the murderous Khmer Rouge regime as to our former Constitutional Republic.  I further note that it was in Satan’s power to give all the kingdoms of Man to Jesus.  Either Christians have the authority – and the responsibility – to act in ALL circumstances or we lack it in every one.  Most Christians lionize men of faith such as Dietrich Bonhoeffer; shall we criticize him instead for violating the laws of God-given Nazi Germany?</p><blockquote><p>A better idea would be to fix the now corrupted system that the founders established . They set up a triune system of government. A constitutional representative republic. All three are necessary for the system to work. Both the people and the representatives must obey the law. The law cannot be changed with out consent of the governed.</p></blockquote><p>What Farmer Tom appears to be missing is that most libertarians would be quite happy with a genuine constitutional republic.  What we have today is the form without the substance; given the failure of the previous model, libertarians are focused on devising conceptual schemes to ensure that Leviathan is sufficiently crippled so as not to escape his bonds the next time around.  What must be kept in mind is that the leaders of the Republican and Democratic parties do not believe the system is corrupted as they are quite happy with their bifactional ruling party.</p><p>Libertarianism is, <em>sopratutto</em>, a reaction to government corruption and tyranny.  Libertarians will support almost ANY system that genuinely reduces the power of the central state.  The primary difference between libertarians and fraudulent advocates of “small government” is that libertarians do not covet control over other individuals.  This is not inherent to libertarianism per se, but it is the essence of the libertarian spirit and dates back, I would argue, not only to Cincinnatus, but to the stayed hand of the Almighty.</p></div>",
  "content_text": "The Farmer combines ideology with theology:\nAs a Christian I am subject to all three systems of law, the family, the natural law and the church. The arguments today are over who enforces the natural law. If God sets up human governments, and he clearly does. Then how will those governments enforce the natural law….  Some of you seem to be saying that no law or system would be preferable to what we have here in the US of A now. God did not create that kind of a system and some distorted kind of government would naturally form to fill the void\nI’m curious to know if Farmer Tom supports the war on Iraq.  After all, if God is setting up human governments, then there’s no more reason for the American people to wage war on the God-given Iraqi government of Saddam Hussein than there is for libertarian Americans to disdain their current federal government in favor of one that respects individual rights.\nA major flaw in this submission-to-the-state argument is that it applies as equally to the murderous Khmer Rouge regime as to our former Constitutional Republic.  I further note that it was in Satan’s power to give all the kingdoms of Man to Jesus.  Either Christians have the authority – and the responsibility – to act in ALL circumstances or we lack it in every one.  Most Christians lionize men of faith such as Dietrich Bonhoeffer; shall we criticize him instead for violating the laws of God-given Nazi Germany?\nA better idea would be to fix the now corrupted system that the founders established . They set up a triune system of government. A constitutional representative republic. All three are necessary for the system to work. Both the people and the representatives must obey the law. The law cannot be changed with out consent of the governed.\nWhat Farmer Tom appears to be missing is that most libertarians would be quite happy with a genuine constitutional republic.  What we have today is the form without the substance; given the failure of the previous model, libertarians are focused on devising conceptual schemes to ensure that Leviathan is sufficiently crippled so as not to escape his bonds the next time around.  What must be kept in mind is that the leaders of the Republican and Democratic parties do not believe the system is corrupted as they are quite happy with their bifactional ruling party.\nLibertarianism is,\nsopratutto\n, a reaction to government corruption and tyranny.  Libertarians will support almost ANY system that genuinely reduces the power of the central state.  The primary difference between libertarians and fraudulent advocates of “small government” is that libertarians do not covet control over other individuals.  This is not inherent to libertarianism per se, but it is the essence of the libertarian spirit and dates back, I would argue, not only to Cincinnatus, but to the stayed hand of the Almighty.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-11T08:04:00+00:00"
}