{
  "url": "https://voxday.net/2005/02/23/i-hope-hes-not-right-bu/",
  "scraped_at": "2026-01-08T19:54:29.744945",
  "title": "I hope he’s not right, but….",
  "date_display": "February 23, 2005",
  "date_iso": "2005-02-23T10:35:00+00:00",
  "date_from_url": "2005-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I don’t always agree with Paul Craig Roberts, I do suspect that <a href=\"http://www.antiwar.com/roberts/?articleid=4854\">his condemnation of conservative media whores</a> may prove prescient.  When conservatives finally figure out Bush’s true globalist colors and realize that much of the so-called conservative media is in fact indistinguishable from big government Wilsonian Democrats, they will either flee from the Republican party or there will be a decades-long interparty political war that will see the neocons return to the Democratic fold.</p><blockquote><p>The conservative media will never recover from its role as Chief Sycophant for the Bush administration. Journalists who demanded that Clinton be held accountable for a minor sex scandal (Monica Lewinsky) and a minor financial scandal (Whitewater) now serve as apologists and propagandists for the Bush administration’s major war scandals….</p><p>Conservative journalists and Republican politicians not only lie through their teeth, but also seek to destroy everyone who utters a word of dissent or truth. For example, Tom Frank of The New Republic (once considered to be part of the hated “liberal press”) recently expressed his thoughts in that unfortunate magazine. Frank wrote that dissenters from Bush’s gratuitous war should be beaten and even killed….</p><p>[From a previous column]  The Bush administration is not establishing any democracies. It is starting a war that will last a generation. That is the neocon plan. They have put their intentions in writing just as Hitler did. It is no protection that their plan is detached from reality. Robespierre was detached from reality, and that did not stop him. So were Hitler, Lenin, Stalin, Mao, and Pol Pot. People with power in their hands who are detached from reality are the most dangerous people of all. The delusional quality of their rantings disarms people from taking them seriously: “Oh, they couldn’t mean that.” But they do.</p></blockquote><p>One would think that the mere fact that The New Republic supports the Bush administration so strongly would give conservatives pause.  But the word “liberal” was claimed by the Left two generations ago and I think we have witnessed the word “conservative” being subsumed by it as well.  This is the inevitable result of compromise and the decision to pursue pragmatism instead of principle.  Sure, you may win elections, but what is the use of winning elections when you govern precisely as your ideological enemies were governing fifty years ago?  The modern pro-Bush “conservative Republican” is now almost ideologically indistinguishable from the pro-FDR “progressive Democrat”.</p><p>Perhaps people are fine with the president being a liar as long as he’s a Republican.  There are numerous regulars here who have stated outright that they have no problem with him lying to the American people about his intentions in the Middle East.  I don’t know why anyone would even doubt that President Bush lied in the lead-up to the current conflict and is continuing to lie, simply  because every American president has demonstrably lied to the public about his martial intentions prior to every war but one dating back to the Spanish-American War.  Lincoln, for all his faults, is the exception, as he was fairly forthright about his desire to keep the Union together by force.</p><p>Remember, when you read about the inevitable Republican electoral domination, that triumphalism often marks a peak of sorts.  Reasons for the subsequent decline are often quite clear, but only in hindsight.</p><p>As for Ward Churchill, I don’t understand the outrage myself.  I have no doubt that he’s a wild-eyed, intellectually dishonest leftist prone to telling ahistorical lies; he is a college professor after all.  But mendacious leftists in academia are hardly news, I mean, didn’t Ben Shapiro ferret this out and explain it to a stunned American public in last year’s groundbreaking book, BRAINWASHED?</p><p>I hope Roberts is not correct but I am increasingly concerned that he might be.  The prophets who warn of those who play the “order from chaos” are seldom heeded before it is too late.</p></div>",
  "content_text": "While I don’t always agree with Paul Craig Roberts, I do suspect that\nhis condemnation of conservative media whores\nmay prove prescient.  When conservatives finally figure out Bush’s true globalist colors and realize that much of the so-called conservative media is in fact indistinguishable from big government Wilsonian Democrats, they will either flee from the Republican party or there will be a decades-long interparty political war that will see the neocons return to the Democratic fold.\nThe conservative media will never recover from its role as Chief Sycophant for the Bush administration. Journalists who demanded that Clinton be held accountable for a minor sex scandal (Monica Lewinsky) and a minor financial scandal (Whitewater) now serve as apologists and propagandists for the Bush administration’s major war scandals….\nConservative journalists and Republican politicians not only lie through their teeth, but also seek to destroy everyone who utters a word of dissent or truth. For example, Tom Frank of The New Republic (once considered to be part of the hated “liberal press”) recently expressed his thoughts in that unfortunate magazine. Frank wrote that dissenters from Bush’s gratuitous war should be beaten and even killed….\n[From a previous column]  The Bush administration is not establishing any democracies. It is starting a war that will last a generation. That is the neocon plan. They have put their intentions in writing just as Hitler did. It is no protection that their plan is detached from reality. Robespierre was detached from reality, and that did not stop him. So were Hitler, Lenin, Stalin, Mao, and Pol Pot. People with power in their hands who are detached from reality are the most dangerous people of all. The delusional quality of their rantings disarms people from taking them seriously: “Oh, they couldn’t mean that.” But they do.\nOne would think that the mere fact that The New Republic supports the Bush administration so strongly would give conservatives pause.  But the word “liberal” was claimed by the Left two generations ago and I think we have witnessed the word “conservative” being subsumed by it as well.  This is the inevitable result of compromise and the decision to pursue pragmatism instead of principle.  Sure, you may win elections, but what is the use of winning elections when you govern precisely as your ideological enemies were governing fifty years ago?  The modern pro-Bush “conservative Republican” is now almost ideologically indistinguishable from the pro-FDR “progressive Democrat”.\nPerhaps people are fine with the president being a liar as long as he’s a Republican.  There are numerous regulars here who have stated outright that they have no problem with him lying to the American people about his intentions in the Middle East.  I don’t know why anyone would even doubt that President Bush lied in the lead-up to the current conflict and is continuing to lie, simply  because every American president has demonstrably lied to the public about his martial intentions prior to every war but one dating back to the Spanish-American War.  Lincoln, for all his faults, is the exception, as he was fairly forthright about his desire to keep the Union together by force.\nRemember, when you read about the inevitable Republican electoral domination, that triumphalism often marks a peak of sorts.  Reasons for the subsequent decline are often quite clear, but only in hindsight.\nAs for Ward Churchill, I don’t understand the outrage myself.  I have no doubt that he’s a wild-eyed, intellectually dishonest leftist prone to telling ahistorical lies; he is a college professor after all.  But mendacious leftists in academia are hardly news, I mean, didn’t Ben Shapiro ferret this out and explain it to a stunned American public in last year’s groundbreaking book, BRAINWASHED?\nI hope Roberts is not correct but I am increasingly concerned that he might be.  The prophets who warn of those who play the “order from chaos” are seldom heeded before it is too late.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-23T10:35:00+00:00"
}