{
  "url": "https://voxday.net/2005/02/05/republicans-are-smarter-proof/",
  "scraped_at": "2026-01-08T19:52:12.493421",
  "title": "Republicans are smarter: the proof",
  "date_display": "February 5, 2005",
  "date_iso": "2005-02-05T13:05:00+00:00",
  "date_from_url": "2005-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Liberal Democrats very much love to embrace the notion that they are more intelligent, despite the obvious flaw in their logic that the less money and education you have, the more likely you are to vote Democrat for president.  And as you might expect, they prefer to stick to vague generalities and baseless assertions instead of actually attempting to put together any evidence to support the concept.</p><p>While doing some research for my column on Monday – on a tangentially related topic that should spark some interesting hate mail – I happened to stumble across <a href=\"http://nces.ed.gov/programs/digest/d03/tables/dt134.asp\">SAT results listed by state</a>.  Now, the SAT is no longer the IQ test it once was, but it is certainly a reasonable starting point for a discussion about intelligence and general intellectual competence, and one much more tangible than any rationale previously cited on the matter.</p><p>If one troubles to break down the data by adding up the average SAT score for the 19 states, (including DC) that supported Kerry in 2004, one sees that the average “blue” state SAT score is 518 verbal and 523 math.  Converting it to pre-1996 SAT scores makes that 438 verbal and 503 math for a cumulative score of 941 which equates to an IQ of 100.</p><p>Meanwhile, the average score for the 32 “red” states that voted for Bush in 2004 is 544 verbal and 545 math.  Converting to pre-1996 scores gives 464 verbal and 525 math, for a cumulative SAT score of 989.  This equates to an IQ of 105.  Therefore, based on a statistically significant amount of hard data, it’s quite clear that Republican states are, on average, more intelligent than Democratic states, which supports the exit poll data which previously indicated that Republicans are smarter.</p><p>This is only marginally less nonsensical than the ridiculous Democratic mythology, of course, since the smartest Democratic state, (Wisconsin at 1179 combined), only had 7 percent of its graduates taking the SAT, while the smartest state – North Dakota’s combined score was 1215 – was represented by precisely 4 percent of its grads.  Thus, our data is woefully incomplete and inadequate to make a firm conclusion.</p><p>And yet, the fact is that based on all of the relevant data available to us at this juncture, Republicans are indubitably smarter than Democrats.<br/></p></div>",
  "content_text": "Liberal Democrats very much love to embrace the notion that they are more intelligent, despite the obvious flaw in their logic that the less money and education you have, the more likely you are to vote Democrat for president.  And as you might expect, they prefer to stick to vague generalities and baseless assertions instead of actually attempting to put together any evidence to support the concept.\nWhile doing some research for my column on Monday – on a tangentially related topic that should spark some interesting hate mail – I happened to stumble across\nSAT results listed by state\n.  Now, the SAT is no longer the IQ test it once was, but it is certainly a reasonable starting point for a discussion about intelligence and general intellectual competence, and one much more tangible than any rationale previously cited on the matter.\nIf one troubles to break down the data by adding up the average SAT score for the 19 states, (including DC) that supported Kerry in 2004, one sees that the average “blue” state SAT score is 518 verbal and 523 math.  Converting it to pre-1996 SAT scores makes that 438 verbal and 503 math for a cumulative score of 941 which equates to an IQ of 100.\nMeanwhile, the average score for the 32 “red” states that voted for Bush in 2004 is 544 verbal and 545 math.  Converting to pre-1996 scores gives 464 verbal and 525 math, for a cumulative SAT score of 989.  This equates to an IQ of 105.  Therefore, based on a statistically significant amount of hard data, it’s quite clear that Republican states are, on average, more intelligent than Democratic states, which supports the exit poll data which previously indicated that Republicans are smarter.\nThis is only marginally less nonsensical than the ridiculous Democratic mythology, of course, since the smartest Democratic state, (Wisconsin at 1179 combined), only had 7 percent of its graduates taking the SAT, while the smartest state – North Dakota’s combined score was 1215 – was represented by precisely 4 percent of its grads.  Thus, our data is woefully incomplete and inadequate to make a firm conclusion.\nAnd yet, the fact is that based on all of the relevant data available to us at this juncture, Republicans are indubitably smarter than Democrats.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-05T13:05:00+00:00"
}