{
  "url": "https://voxday.net/2005/02/23/rule-43b-token-fig/",
  "scraped_at": "2026-01-08T19:54:27.811726",
  "title": "Rule 43B: The token fight",
  "date_display": "February 23, 2005",
  "date_iso": "2005-02-23T09:51:00+00:00",
  "date_from_url": "2005-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Sports Guy’s chronicles:</p><blockquote><p>The Sports Gal drives me to LAX and starts the token “Fight on the way to the airport,” as required in Rule 43B in the “Code Of Females” guidebook.</p></blockquote><p>What is that about, anyhow?  Can any of the women here explain this?  The Perfect Aryan Male once asked me why none of his married friends ever leave the house, and I explained that I have yet to met the couple that can get it together to go somewhere without engaging in minor hostilities at some point along the way.</p><p>Before too long, it just becomes easier for the male half to stay home and fire up “Total War: Aliens vs. Vice City” while the female half watches “Survivor: Desperate Sex in the Real World of Idol American Housewives” or whatever the show <em>di giorno</em> happens to be.  Adding children into the mix only adds to the potential for conflict, even if both parties could use a break from the pitter-patter of little feet, the thump of little bottoms hitting the floor and the full-throated cry of little lungs.</p><p>Don’t get me wrong, I’m quite happy to stay home attached to my electronic umbilical cord. <em>/positive feedback/ The Borg Mother loves you, little one, she loves you the most of all…./end feedback/</em> But, like the Sports Guy, I do often wonder what it is about a car that seems to inspire such negativity in women.</p><p>TPAM should have been able to figure this one out on his own, though.  I seem to recall the Bolivian Bombshell starting fights with him when picking him up at the airport.  Needless to say, he was not inclined to discover whether marriage would solve this problem or worsen it.</p><p>By the way, this is appropos of nothing, but made me laugh out loud.  From <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/050222\">the same column</a>:</p><blockquote><p>10:35 a.m. — Just spent the last hour plowing through USA Today and the annual S.I. Swimsuit Issue, which has been diluted significantly by Maxim, FHM and everyone else. It used to be the seminal event of February for every guy between the ages of 13 and 35 … now it’s something that keeps your attention for about 12 minutes in an airport. How the mighty have fallen. Pretty soon, they’ll be giving us a Venus Williams photo spread.</p><p>10:36 a.m.– Wait a second …</p></blockquote><p>Why doesn’t ESPN just give the keys to this man?  Why?  The people demand it!</p></div>",
  "content_text": "From the Sports Guy’s chronicles:\nThe Sports Gal drives me to LAX and starts the token “Fight on the way to the airport,” as required in Rule 43B in the “Code Of Females” guidebook.\nWhat is that about, anyhow?  Can any of the women here explain this?  The Perfect Aryan Male once asked me why none of his married friends ever leave the house, and I explained that I have yet to met the couple that can get it together to go somewhere without engaging in minor hostilities at some point along the way.\nBefore too long, it just becomes easier for the male half to stay home and fire up “Total War: Aliens vs. Vice City” while the female half watches “Survivor: Desperate Sex in the Real World of Idol American Housewives” or whatever the show\ndi giorno\nhappens to be.  Adding children into the mix only adds to the potential for conflict, even if both parties could use a break from the pitter-patter of little feet, the thump of little bottoms hitting the floor and the full-throated cry of little lungs.\nDon’t get me wrong, I’m quite happy to stay home attached to my electronic umbilical cord.\n/positive feedback/ The Borg Mother loves you, little one, she loves you the most of all…./end feedback/\nBut, like the Sports Guy, I do often wonder what it is about a car that seems to inspire such negativity in women.\nTPAM should have been able to figure this one out on his own, though.  I seem to recall the Bolivian Bombshell starting fights with him when picking him up at the airport.  Needless to say, he was not inclined to discover whether marriage would solve this problem or worsen it.\nBy the way, this is appropos of nothing, but made me laugh out loud.  From\nthe same column\n:\n10:35 a.m. — Just spent the last hour plowing through USA Today and the annual S.I. Swimsuit Issue, which has been diluted significantly by Maxim, FHM and everyone else. It used to be the seminal event of February for every guy between the ages of 13 and 35 … now it’s something that keeps your attention for about 12 minutes in an airport. How the mighty have fallen. Pretty soon, they’ll be giving us a Venus Williams photo spread.\n10:36 a.m.– Wait a second …\nWhy doesn’t ESPN just give the keys to this man?  Why?  The people demand it!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-23T09:51:00+00:00"
}