{
  "url": "https://voxday.net/2005/02/19/someones-estrogen-prescription-needs/",
  "scraped_at": "2026-01-08T19:53:56.569844",
  "title": "Someone’s estrogen prescription needs a refill",
  "date_display": "February 19, 2005",
  "date_iso": "2005-02-19T17:39:00+00:00",
  "date_from_url": "2005-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NB highlights a recent discussion about feminism:</p><blockquote><p>Ms. Allen <a href=\"http://www.latimes.com/news/opinion/sunday/editorials/la-op-femintellectuals13feb13,0,438376.story\">states</a>: “As a successful ideology, it [feminism] has foreclosed debate and debate is the hallmark of the public intellectual.”</p><p>Ms. Estrich testily replies: “Usually, it takes an insult — a tough one — to provoke us. But when provoked, watch out. Just ask Harvard President Larry Summers. His days are numbered.”</p><p>In other words, “disagree with us, and we’ll have you fired”.</p><p>Is there any possible way to get it through Ms. E’s thick feminist skull that this sort of behavior is exactly the problem? Ms. Allen grasps it. Ms. Estrich blows right past it and targets the boss who<br>picked the story.</br></p><p>Men don’t want to work with women? It MUST be the men! It can’t <b>possibly</b> be the fact that women can’t hack disagreement, and the first sign of it either go for the throat (if they see the chance to destroy) or they go off in a huff.</p></blockquote><p>Yes, it reminds me of the recent Maureen Dowd article in which she finally noticed that since men don’t give a damn about SAT scores, diplomas or resumes, perhaps re-education camps are in order.  It’s worth noting that Susan Estrich <a href=\"http://www.dcexaminer.com/articles/2005/02/19//opinion/op-ed/01aaaoped19estrich.txt\">appears to be completely losing it</a>.  Wherever the great women thinkers are, they certainly aren’t signing stupid letters written by Susan Estrich.</p><p>As a general rule, never trust anyone who says “we” in place of “I”.</p></div>",
  "content_text": "NB highlights a recent discussion about feminism:\nMs. Allen\nstates\n: “As a successful ideology, it [feminism] has foreclosed debate and debate is the hallmark of the public intellectual.”\nMs. Estrich testily replies: “Usually, it takes an insult — a tough one — to provoke us. But when provoked, watch out. Just ask Harvard President Larry Summers. His days are numbered.”\nIn other words, “disagree with us, and we’ll have you fired”.\nIs there any possible way to get it through Ms. E’s thick feminist skull that this sort of behavior is exactly the problem? Ms. Allen grasps it. Ms. Estrich blows right past it and targets the boss who\npicked the story.\nMen don’t want to work with women? It MUST be the men! It can’t\npossibly\nbe the fact that women can’t hack disagreement, and the first sign of it either go for the throat (if they see the chance to destroy) or they go off in a huff.\nYes, it reminds me of the recent Maureen Dowd article in which she finally noticed that since men don’t give a damn about SAT scores, diplomas or resumes, perhaps re-education camps are in order.  It’s worth noting that Susan Estrich\nappears to be completely losing it\n.  Wherever the great women thinkers are, they certainly aren’t signing stupid letters written by Susan Estrich.\nAs a general rule, never trust anyone who says “we” in place of “I”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-19T17:39:00+00:00"
}