{
  "url": "https://voxday.net/2005/02/17/syndication-scam-or-survival-of/",
  "scraped_at": "2026-01-08T19:53:47.387070",
  "title": "Syndication: scam or survival of the fittest?",
  "date_display": "February 17, 2005",
  "date_iso": "2005-02-17T20:57:00+00:00",
  "date_from_url": "2005-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As many of you know, I’m a data junkie.  Since one’s data is often incomplete, it is a mistake to assume perfect knowledge and understanding based on interpretations of what one has, but some data is almost always better than none.  For example, it would be reasonable to assume that since Ben Shapiro, Michelle Malkin and Hugh Hewitt, (just to add a third recognizable name to those mentioned in the previous discussion), are all much more widely distributed and quoted in the legacy media than I am, their WND readerships would be expected to be correspondingly larger.</p><p>While one could try to make the precisely opposite case based on that very broader distribution, the fact that the two biggest names on WND, Ann Coulter and Patrick Buchanan, have dependably maintained the two largest column readerships* there for the last three years, tends to indicate that broader exposure should lead to larger readerships on WND.</p><p>One of the nice things about hard data, however, is that it exposes the underlying flaws inherent in one’s assumptions.  The “explosion” of country music in the early 90’s was no such thing, all that happened was that Musicscan started tracking actual CD sales instead of depending on a few influential music stores to report what was selling well.  Bookscan has begun to do the same thing, although the New York Times bestseller list is still a statistically unreliable poll of a surprisingly small number of stores.</p><p>I suspect the same thing will likely happen with regards to political and sports commentary over the next decade.  For five years, I wrote a video game column that appeared in as many as 14 newspapers around the country, (including Boston, Atlanta and St. Paul), but the small amount of email I received led me to believe at the time that not very many people were actually reading it.  The fact that Craig Westover’s <a href=\"http://craigwestover.blogspot.com/\">very good blog</a> has only a few more readers than any other random no-name blog despite his holding a regular spot on the St. Paul Pioneer Press op/ed page tends to support my theory that a only fraction of the people who subscribe to the newspaper actually read it, in contradiction to the self-serving theory advanced by newspaper ad sellers that there is a multiple involved.</p><p>So, what is the hard data available to us?  Well, I can’t give out actual WND numbers since that is confidential to their business, but I can express them in comparative percentages.  Over 2004, Ms Malkin averaged a column readership that was 97.8 percent of mine.  Mr. Hewitt averaged 57.4 percent, and Mr. Shapiro averaged 48.5 percent.</p><p>These figures also hold up for the first six weeks of 2005, except for Mr. Shapiro, who has been declining precipitously, down to 19.7 percent, as his recitation of Bush administration talking points apparently grows tiresome in a post-election environment.  The gold standard, as you might expect, is Ann Coulter.  You could say that I am her bitch, since my column readership is only 62.1 percent of hers.</p><p>Still, the readership numbers are interesting when you consider the fact that my writing has been found to be completely undesirable by the newspaper editors who serve as legacy gatekeepers.  This would appear to suggest that if I wished to pursue a career in editorial commentary, I would do well to either convert to Judaism or undergo gender transformation surgery.  Needless to say, I’m not considering either.**</p><p>Now, keep in mind that none of this proves that I’m not a terrible writer.  Popularity is not synonymous with quality.  But what it should demonstrate that a proven ability to maintain a respectable readership is only one factor out of many that go into the saleability of a column.  Syndication likely is more survival of the fittest than a scam, but the determining factors are not necessarily what you might assume them to be.</p><p>*<em>Only WND’s regular weekly columnists were included in this little investigation.  Neither Mr. Farah’s daily column nor the occasional one-shot were included.</em></p><p>**<em>While I <a href=\"http://www.blackfive.net/main/2005/02/vox_rocks.html\">very much appreciate his gung-ho support for my column</a>, I must reassure BLACKFIVE that WND has no intention of dropping me.  It is Universal Press Syndicate that has done so, but since they hadn’t sold the column to anyone, this has precisely zero effect on anything.</em></p></div>",
  "content_text": "As many of you know, I’m a data junkie.  Since one’s data is often incomplete, it is a mistake to assume perfect knowledge and understanding based on interpretations of what one has, but some data is almost always better than none.  For example, it would be reasonable to assume that since Ben Shapiro, Michelle Malkin and Hugh Hewitt, (just to add a third recognizable name to those mentioned in the previous discussion), are all much more widely distributed and quoted in the legacy media than I am, their WND readerships would be expected to be correspondingly larger.\nWhile one could try to make the precisely opposite case based on that very broader distribution, the fact that the two biggest names on WND, Ann Coulter and Patrick Buchanan, have dependably maintained the two largest column readerships* there for the last three years, tends to indicate that broader exposure should lead to larger readerships on WND.\nOne of the nice things about hard data, however, is that it exposes the underlying flaws inherent in one’s assumptions.  The “explosion” of country music in the early 90’s was no such thing, all that happened was that Musicscan started tracking actual CD sales instead of depending on a few influential music stores to report what was selling well.  Bookscan has begun to do the same thing, although the New York Times bestseller list is still a statistically unreliable poll of a surprisingly small number of stores.\nI suspect the same thing will likely happen with regards to political and sports commentary over the next decade.  For five years, I wrote a video game column that appeared in as many as 14 newspapers around the country, (including Boston, Atlanta and St. Paul), but the small amount of email I received led me to believe at the time that not very many people were actually reading it.  The fact that Craig Westover’s\nvery good blog\nhas only a few more readers than any other random no-name blog despite his holding a regular spot on the St. Paul Pioneer Press op/ed page tends to support my theory that a only fraction of the people who subscribe to the newspaper actually read it, in contradiction to the self-serving theory advanced by newspaper ad sellers that there is a multiple involved.\nSo, what is the hard data available to us?  Well, I can’t give out actual WND numbers since that is confidential to their business, but I can express them in comparative percentages.  Over 2004, Ms Malkin averaged a column readership that was 97.8 percent of mine.  Mr. Hewitt averaged 57.4 percent, and Mr. Shapiro averaged 48.5 percent.\nThese figures also hold up for the first six weeks of 2005, except for Mr. Shapiro, who has been declining precipitously, down to 19.7 percent, as his recitation of Bush administration talking points apparently grows tiresome in a post-election environment.  The gold standard, as you might expect, is Ann Coulter.  You could say that I am her bitch, since my column readership is only 62.1 percent of hers.\nStill, the readership numbers are interesting when you consider the fact that my writing has been found to be completely undesirable by the newspaper editors who serve as legacy gatekeepers.  This would appear to suggest that if I wished to pursue a career in editorial commentary, I would do well to either convert to Judaism or undergo gender transformation surgery.  Needless to say, I’m not considering either.**\nNow, keep in mind that none of this proves that I’m not a terrible writer.  Popularity is not synonymous with quality.  But what it should demonstrate that a proven ability to maintain a respectable readership is only one factor out of many that go into the saleability of a column.  Syndication likely is more survival of the fittest than a scam, but the determining factors are not necessarily what you might assume them to be.\n*\nOnly WND’s regular weekly columnists were included in this little investigation.  Neither Mr. Farah’s daily column nor the occasional one-shot were included.\n**\nWhile I\nvery much appreciate his gung-ho support for my column\n, I must reassure BLACKFIVE that WND has no intention of dropping me.  It is Universal Press Syndicate that has done so, but since they hadn’t sold the column to anyone, this has precisely zero effect on anything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-02-17T20:57:00+00:00"
}