{
  "url": "https://voxday.net/2006/04/27/and-baptists-head-for-showers/",
  "scraped_at": "2026-01-08T21:05:59.571738",
  "title": "And the Baptists head for the showers",
  "date_display": "April 27, 2006",
  "date_iso": "2006-04-27T16:12:00+00:00",
  "date_from_url": "2006-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Baptist Center for Ethics<br>Nashville, TN<br>April 21, 2006</br></br></p><p>Dear Fellow Baptists:</p><p>The time has come for Baptists to speak positively about public education and to take proactive initiatives that advance a constructive future for America’s public school system.<br>We recognize the need for reforms in public schools, as all organizations need reformation, including churches and corporations. Reforms to improve all facets of public education should be a constant goal of our nation. <br>While every family is free to decide the course of their children’s education, we believe it is wrong for Baptist leaders to urge Baptists to exit the nation’s public school system for homeschools and Christian academies and to equip that cause. <br>We decry the anti-public school statements that identify public schools as “the enemies of God,” that label the nation’s school system as “a dark and decaying government school system” and that claim public schools are converting Christian children “to an anti-Christian worldview.” We urge a halt to the demonization of public schools. <br>We believe Baptists should recommit themselves to public education, not as a means toward converting school children, but because it is the right thing to do. We believe public school children are God’s children who deserve the nurture of a good society, the prospect for a good education and the equal opportunity for a good life.<br>We call on Baptists to recommit themselves to the separation of church and state, which will keep public schools free from coercive pressure to promote sectarian faith, such as state-written school prayers and the teaching of neo-creationism (intelligent design). <br>We call on Baptists to recommit themselves to a just society. A just society will ensure that every American child has an opportunity for a good education and that public schools have the resources necessary to provide such an opportunity, achieving the highest standards possible. <br>We call on Baptists to recommit themselves to the nation’s founding principle of “E Pluribus Unum.” A society based on unity out of diversity will embrace every child and recognize the vital role public schools play in achieving national unity. <br>We, the undersigned, pledge therefore to</br></br></br></br></br></br></br></br></p><p>pray for public schools;</p><p>show our support for public schools through worship services that affirm all school-related personnel;</p><p>advocate for a high wall of separation between church and state that is critical to good public education;</p><p>pursue a just society that benefits every child;</p><p>speak up for the role public education plays in democracy, especially the unity it creates in the midst of diversity so necessary in our society;</p><p>challenge religious voices who demonize public education; and</p><p>share this letter with others.</p></blockquote><p>Well, it’s nice to see that the Episcopalians, Methodists and Lutherans will have some company in their slouch towards total cultural irrelevance.  And for the record, I think it is unnecessary to demonize the public schools, as they already contain no shortage of evil and destructive spiritual beings also known as “teachers”.</p></div>",
  "content_text": "Baptist Center for Ethics\nNashville, TN\nApril 21, 2006\nDear Fellow Baptists:\nThe time has come for Baptists to speak positively about public education and to take proactive initiatives that advance a constructive future for America’s public school system.\nWe recognize the need for reforms in public schools, as all organizations need reformation, including churches and corporations. Reforms to improve all facets of public education should be a constant goal of our nation.\nWhile every family is free to decide the course of their children’s education, we believe it is wrong for Baptist leaders to urge Baptists to exit the nation’s public school system for homeschools and Christian academies and to equip that cause.\nWe decry the anti-public school statements that identify public schools as “the enemies of God,” that label the nation’s school system as “a dark and decaying government school system” and that claim public schools are converting Christian children “to an anti-Christian worldview.” We urge a halt to the demonization of public schools.\nWe believe Baptists should recommit themselves to public education, not as a means toward converting school children, but because it is the right thing to do. We believe public school children are God’s children who deserve the nurture of a good society, the prospect for a good education and the equal opportunity for a good life.\nWe call on Baptists to recommit themselves to the separation of church and state, which will keep public schools free from coercive pressure to promote sectarian faith, such as state-written school prayers and the teaching of neo-creationism (intelligent design).\nWe call on Baptists to recommit themselves to a just society. A just society will ensure that every American child has an opportunity for a good education and that public schools have the resources necessary to provide such an opportunity, achieving the highest standards possible.\nWe call on Baptists to recommit themselves to the nation’s founding principle of “E Pluribus Unum.” A society based on unity out of diversity will embrace every child and recognize the vital role public schools play in achieving national unity.\nWe, the undersigned, pledge therefore to\npray for public schools;\nshow our support for public schools through worship services that affirm all school-related personnel;\nadvocate for a high wall of separation between church and state that is critical to good public education;\npursue a just society that benefits every child;\nspeak up for the role public education plays in democracy, especially the unity it creates in the midst of diversity so necessary in our society;\nchallenge religious voices who demonize public education; and\nshare this letter with others.\nWell, it’s nice to see that the Episcopalians, Methodists and Lutherans will have some company in their slouch towards total cultural irrelevance.  And for the record, I think it is unnecessary to demonize the public schools, as they already contain no shortage of evil and destructive spiritual beings also known as “teachers”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-27T15:12:00+00:00"
}