{
  "url": "https://voxday.net/2006/04/29/announcing-vpf/",
  "scraped_at": "2026-01-08T21:06:10.730844",
  "title": "Announcing the VPFL",
  "date_display": "April 29, 2006",
  "date_iso": "2006-04-29T10:25:00+00:00",
  "date_from_url": "2006-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After listening to the preening and boasting of various individuals who shall remain nameless, I have decided that it is time to give some of them an opportunity to demonstrate their perspicacity against the reigning 2005 MFL Champion, the White Buffalo, and a perennial playoff powerhouse who has yet to claim a league title, Mr. Vox Day.</p><p>The VPFL will be a keeper league, but the only permanent owners will be the WB and me.  In the unlikely event that the season champion is not one of us, the winner will also return to defend his title.  Team owners will be selected with help from the WB and the OC, as I will run a contest every other week and the winner will be awarded the right to run a team for the 2006 season or to choose a coach from among the regulars here.</p><p>The league will be a Yahoo free league with from 8 to 12 teams, depending on the level of interest.  Please comment if you’re interested, but note that previous fantasy football experience is a must.  I have not yet decided on the number of keepers, but I am open to suggestion although I’m leaning towards somewhere between 2 and 5 players.  As league commissioner, I’d be tempted to award myself the first pick in the draft, but as I wish to give myself a slight advantage this year, I have decided to award it to the White Buffalo, whose first pick in the 1999 MFL draft remains legendary. <em>(Between who he’s sure to pick and the Madden’s Curse, there’s no way Sean Alexander makes it until Week Five this season.)</em></p><p>Scoring is conventional, but halved, with lower yardage points than are common in many leagues.  Team names are to be of the city / nickname style and will remain the same from season to season barring a league-approved team move.  VD will be managing the Mounds View Marauders, the WB has not yet announced the name of his team although it is rumored that the Big Walleye will be involved in front office operations.</p><p>As the idea for this league was inspired by a certain Tennessee Titans fan, the Pan Gargler is invited to manage a VPFL team in the inaugural 2006 season, assuming that he is not afraid to have his dearth of NFL expertise stripped bare for all to see this autumn.</p></div>",
  "content_text": "After listening to the preening and boasting of various individuals who shall remain nameless, I have decided that it is time to give some of them an opportunity to demonstrate their perspicacity against the reigning 2005 MFL Champion, the White Buffalo, and a perennial playoff powerhouse who has yet to claim a league title, Mr. Vox Day.\nThe VPFL will be a keeper league, but the only permanent owners will be the WB and me.  In the unlikely event that the season champion is not one of us, the winner will also return to defend his title.  Team owners will be selected with help from the WB and the OC, as I will run a contest every other week and the winner will be awarded the right to run a team for the 2006 season or to choose a coach from among the regulars here.\nThe league will be a Yahoo free league with from 8 to 12 teams, depending on the level of interest.  Please comment if you’re interested, but note that previous fantasy football experience is a must.  I have not yet decided on the number of keepers, but I am open to suggestion although I’m leaning towards somewhere between 2 and 5 players.  As league commissioner, I’d be tempted to award myself the first pick in the draft, but as I wish to give myself a slight advantage this year, I have decided to award it to the White Buffalo, whose first pick in the 1999 MFL draft remains legendary.\n(Between who he’s sure to pick and the Madden’s Curse, there’s no way Sean Alexander makes it until Week Five this season.)\nScoring is conventional, but halved, with lower yardage points than are common in many leagues.  Team names are to be of the city / nickname style and will remain the same from season to season barring a league-approved team move.  VD will be managing the Mounds View Marauders, the WB has not yet announced the name of his team although it is rumored that the Big Walleye will be involved in front office operations.\nAs the idea for this league was inspired by a certain Tennessee Titans fan, the Pan Gargler is invited to manage a VPFL team in the inaugural 2006 season, assuming that he is not afraid to have his dearth of NFL expertise stripped bare for all to see this autumn.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-29T09:25:00+00:00"
}