{
  "url": "https://voxday.net/2006/04/11/another-rape-that-wasn/",
  "scraped_at": "2026-01-08T21:04:37.847371",
  "title": "Another rape that wasn’t",
  "date_display": "April 11, 2006",
  "date_iso": "2006-04-11T07:11:00+00:00",
  "date_from_url": "2006-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Drudge:</p><blockquote><p>DNA testing failed to connect any members of the Duke University lacrosse team to the alleged rape of a stripper, attorneys for the athletes said Monday.</p><p>Citing DNA test results delivered by the state crime lab to police and prosecutors a few hours earlier, the attorneys said the test results prove their clients did not sexually assault and beat a stripper hired to perform at a March 13 team party.</p><p>No charges have been filed in the case.</p><p>“There is no DNA evidence that shows she was touched by any of these boys,” said Attorney Joe Cheshire, who represents one of the team’s captains.</p></blockquote><p>But… but… but women NEVER LIE about RAPE!  Don’t you know that there are BILLIONS and BILLIONS of unreported rapes in the USA every year?  And it’s a MYTH that more false claims of RAPE are made than ANY OTHER crime, I mean, haven’t you seen that TWO PERCENT number derived from the same place that it was proven how 450 MILLION American women are BEATEN to DEATH by their husbands every Super Bowl Sunday?</p><p>To think of all that outrage wasted at places like Pandagon, Feministe and the multitude of Angry Grrrl blogs.  They’re “<a href=\"http://www.feministe.us/blog/archives/2006/04/09/those-duke-boys-just-needed-a-dose-of-chivalry/\">quite literally shaking with rage</a>” while <a href=\"http://pandagon.net/2006/04/10/breaking/#comments\">remaining convinced that there is only a remote chance that the woman is lying</a>.  I, on the other hand, am merely shaking with laughter.</p><p>A reminder.  If a gay man, a “minority” or a woman at a college makes an accusation of a crime that is outrageous enough to make the national news, it will almost always prove to be a complete fiction.  I have yet to lose a bet based on this principle.</p><p>Yes, people do commit crimes.  Even rich young white guys.  But the real world isn’t a mirror of the movies, the bad guy is seldom the good-looking blond guy with a Porsche and one should never underestimate the desire of a 18-22 year old woman for public attention of any kind.  The Duke lacrosse story demonstrates how there are few things that will command as much attention as crying rape or hate crime, or better yet, both, especially given <a href=\"http://communities.ninemsn.com/TheHabaib/general.msnw?action=get_message&amp;mview=0&amp;ID_Message=11949&amp;LastModified=4675566247674080026\">a media so determined to find such stories that it will manufacture them</a> if necessary.</p></div>",
  "content_text": "From Drudge:\nDNA testing failed to connect any members of the Duke University lacrosse team to the alleged rape of a stripper, attorneys for the athletes said Monday.\nCiting DNA test results delivered by the state crime lab to police and prosecutors a few hours earlier, the attorneys said the test results prove their clients did not sexually assault and beat a stripper hired to perform at a March 13 team party.\nNo charges have been filed in the case.\n“There is no DNA evidence that shows she was touched by any of these boys,” said Attorney Joe Cheshire, who represents one of the team’s captains.\nBut… but… but women NEVER LIE about RAPE!  Don’t you know that there are BILLIONS and BILLIONS of unreported rapes in the USA every year?  And it’s a MYTH that more false claims of RAPE are made than ANY OTHER crime, I mean, haven’t you seen that TWO PERCENT number derived from the same place that it was proven how 450 MILLION American women are BEATEN to DEATH by their husbands every Super Bowl Sunday?\nTo think of all that outrage wasted at places like Pandagon, Feministe and the multitude of Angry Grrrl blogs.  They’re “\nquite literally shaking with rage\n” while\nremaining convinced that there is only a remote chance that the woman is lying\n.  I, on the other hand, am merely shaking with laughter.\nA reminder.  If a gay man, a “minority” or a woman at a college makes an accusation of a crime that is outrageous enough to make the national news, it will almost always prove to be a complete fiction.  I have yet to lose a bet based on this principle.\nYes, people do commit crimes.  Even rich young white guys.  But the real world isn’t a mirror of the movies, the bad guy is seldom the good-looking blond guy with a Porsche and one should never underestimate the desire of a 18-22 year old woman for public attention of any kind.  The Duke lacrosse story demonstrates how there are few things that will command as much attention as crying rape or hate crime, or better yet, both, especially given\na media so determined to find such stories that it will manufacture them\nif necessary.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-11T06:11:00+00:00"
}