{
  "url": "https://voxday.net/2006/04/01/isaac-asimov-wep/",
  "scraped_at": "2026-01-08T21:03:37.241452",
  "title": "Isaac Asimov wept",
  "date_display": "April 1, 2006",
  "date_iso": "2006-04-01T08:57:00+00:00",
  "date_from_url": "2006-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the SFWA:</p><blockquote><p>The 13th annual RITA Awards will be announced on July 29, 2006 at the Romance Writers of America’s 26th National Conference, which will be held in Atlanta, Georgia. The award catagories include Best Paranormal (Science Fiction and Fantasy) Romance.</p><p>Best Paranormal (Science Fiction and Fantasy) Romance Finalists: <br>The Misted Cliffs by Catherine Asaro <br>Ghost Walk by Heather Graham <br>My Shadow Warrior by Jen Holling <br>Spirited Away by Pamela Labud <br>A Taste of Crimson by Marjorie Liu <br>After Midnight by Teresa Medeiros <br>Gabriel’s Ghost by Linnea Sinclair <br>Dark Lover by J. R. Ward</br></br></br></br></br></br></br></br></p></blockquote><p>The frightening thing is that Asaro actually won the Nebula award a few years ago.  Fortunately, it was just a popularity contest that year – she also won the Presidency – but it’s not a good sign for the future that publishers – and readers – have so enthusiastically embraced the romance novelization of the genre.</p><p>Speaking of real science fiction, I’m sorry to learn that <a href=\"http://www.sfwa.org/news/2006/dfeintuch.htm\">David Feintuch has died</a>.  While I did not know him well, I met him at my first book signing; we sat next to each other all day and he was kind enough to give me signed copies of four of his books.  As others have described him, he was a big, gentle man and a decent human being.  His Nicholas Seafort books are worth checking out if you haven’t read them yet, a sort of Aubrey-Maturin in space, albeit minus the Maturin.</p></div>",
  "content_text": "From the SFWA:\nThe 13th annual RITA Awards will be announced on July 29, 2006 at the Romance Writers of America’s 26th National Conference, which will be held in Atlanta, Georgia. The award catagories include Best Paranormal (Science Fiction and Fantasy) Romance.\nBest Paranormal (Science Fiction and Fantasy) Romance Finalists:\nThe Misted Cliffs by Catherine Asaro\nGhost Walk by Heather Graham\nMy Shadow Warrior by Jen Holling\nSpirited Away by Pamela Labud\nA Taste of Crimson by Marjorie Liu\nAfter Midnight by Teresa Medeiros\nGabriel’s Ghost by Linnea Sinclair\nDark Lover by J. R. Ward\nThe frightening thing is that Asaro actually won the Nebula award a few years ago.  Fortunately, it was just a popularity contest that year – she also won the Presidency – but it’s not a good sign for the future that publishers – and readers – have so enthusiastically embraced the romance novelization of the genre.\nSpeaking of real science fiction, I’m sorry to learn that\nDavid Feintuch has died\n.  While I did not know him well, I met him at my first book signing; we sat next to each other all day and he was kind enough to give me signed copies of four of his books.  As others have described him, he was a big, gentle man and a decent human being.  His Nicholas Seafort books are worth checking out if you haven’t read them yet, a sort of Aubrey-Maturin in space, albeit minus the Maturin.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-01T07:57:00+00:00"
}