{
  "url": "https://voxday.net/2006/04/17/mocking-scott-adams/",
  "scraped_at": "2026-01-08T21:04:58.396499",
  "title": "Mocking Scott Adams",
  "date_display": "April 17, 2006",
  "date_iso": "2006-04-17T08:45:00+00:00",
  "date_from_url": "2006-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Adams is a very successful and amusing cartoonist.  On his blog, he occasionally writes about philosophy, science and religion, <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2006/04/respecting_the_.html\">wherein he demonstrates that he is… an amusing cartoonist</a>:</p><blockquote><p>I also wonder if showing respect for all beliefs is causing more problems than it’s avoiding. The only thing that keeps most people from acting on their absurd beliefs is the fear that other people will treat them like frickin’ retards. Mockery is an important social tool for squelching stupidity. At least that’s what I tell people after I mock them. Or to put it another way, I’ve never seen anyone change his mind because of the power of a superior argument or the acquisition of new facts. But I’ve seen plenty of people change behavior to avoid being mocked.</p><p>Many of our biggest world problems are caused by different religious views. But it’s not socially acceptable to even discuss whether those views originate from the almighty or a drunken guy wizzing on a tree stump. At a bare minimum, just to pick one example, either Christianity or Islam is completely and utterly wrong. The beliefs are mutually exclusive. Muslims believe all Christians will burn in Hell. Christians believe that the Koran is fiction. They can’t both be right. (They could obviously both be wrong if the Heaven’s Gate guys turn out to have it right.)</p></blockquote><p>First, I note that Mr. Adams must not associate with many intellectually curious individuals, because nearly every individual I know has changed his mind based on the acquisition of new facts.  The public school advocate who now homeschools, the former Republican Inner Circle member who is now a libertarian anarchist, the girl with the Pro-Choice checks who now opposes abortion, the career girl with an MBA turned wife and stay-at-home mother, the staunch liberal Democrat turned Reaganite Republican… why, I even know of an agnostic hedonist turned Southern Baptist.</p><p>Like many maleducated atheists, Mr. Adams substitutes parroting a few false “truisms” he has heard and foolishly found compelling for original thinking.  This is easily demonstrated, only consider this statement: “Many of our biggest world problems are caused by different religious views.”</p><p>Very well, what are those problems?  Mr. Adams himself is apparently concerned about Global Warming.  We can probably assume that War would make the list, along with Hunger, Disease, and, according to Mr. Seth Blatter of FIFA, Diving in International Football is a global issue as well.  Interestingly enough, one can probably make a better religious case for Diving than for any of the other four “biggest world problems”.</p><p>Global Warming, if it exists at all, is caused by carbon emissions.  According to the Natural Resources Defense Council, <em>Carbon dioxide and other air pollution that is collecting in the atmosphere like a thickening blanket, trapping the sun’s heat and causing the planet to warm up. Coal-burning power plants are the largest U.S. source of carbon dioxide pollution — they produce 2.5 billion tons every year. Automobiles, the second largest source, create nearly 1.5 billion tons of CO2 annually.</em></p><p>Which religion is responsible for coal-burning power plants and automobiles, Mr. Adams?  Is solar power banned in the Book of Exodus?  The Islamic Republic of Iran’s pursuit of uranium processing would seem to make it clear that the Koran is okay with nuclear power.  And while there are those who preach against the internal combustion engine, they seldom do so from a position of authority within a church, mosque, synagogue or temple.</p><p>War, as I have demonstrated in the past, predates every existing religion.  Of the 500 wars chronicled in Wikipedia, only 11 percent have any relation to religion at all and leaving out Islam – a religion of the sword – drops that percentage to less than 3 percent.  Which of America’s wars were caused by religion, Mr. Adams, the Revolutionary War, the War of 1812, the Spanish-American War, the Civil War, World War I, World War II, the Korean War, the Vietnam War, the Gulf War or the present Iraqi Occupation?</p><p>Hunger, as Mr. PJ O’Rourke proved so conclusively in “All the Trouble in the World” is a primarily a political phenomenon.  Specifically, it is a socialist political phenomenon and a LACK of religion is more correctly considered a causal factor here.  While it is possible for a socialist to be religious, (there are no shortage of Christian and Muslim socialists), the specific form of socialism dominant in nearly all of the famine-struck countries of the last eighty years, from the former Soviet Union to modern Zimbabwe, was an atheist one.  It is not a coincidence that most of the socialist dictators who presided over the various African mass starvations were educated at Patrice Lumumba University in Moscow.</p><p>Disease, insasmuch as it has any relation to religion at all, is negatively correlated with religion.  This is true on the individual level, as New Scientist magazine reports that religious individuals get sick less often than non-believers, and on the societal level as well.  In Uganda, for example, the abstinence-based ABC program has been far more successful in reducing the incidence of AIDS than the condom-based “safe sex” progams used in Kenya, Zimbabwe and other African countries. Does Mr. Adams argue that there would be less disease without the hundreds of thousands of Christian charity workers active around the world?  Has the rejection of religious doctrine reduced or increased the incidence of STDs in America’s heterosexual and homosexual communities alike?</p><p>Diving in International Football, on the other hand, is at its worst in Italy, a Catholic country where footballers often cross themselves upon entering the game.  Here, and only here, Mr. Adams just might have a point.  Whether Diving is as serious a global problem as Global Warming, War, Hunger and Disease I leave to the reader to decide.  And perhaps readers might be able to suggest other “biggest world problems” I have neglected to address here, so that we can consider whether or not religion is the primary cause of them.</p><p>As far as the contradictions between Islam and Christianity are concerned, I merely recommend to Mr. Adams a literary criticism of the two foundational documents by the atheist Christopher Hitchens as a useful starting point.</p></div>",
  "content_text": "Scott Adams is a very successful and amusing cartoonist.  On his blog, he occasionally writes about philosophy, science and religion,\nwherein he demonstrates that he is… an amusing cartoonist\n:\nI also wonder if showing respect for all beliefs is causing more problems than it’s avoiding. The only thing that keeps most people from acting on their absurd beliefs is the fear that other people will treat them like frickin’ retards. Mockery is an important social tool for squelching stupidity. At least that’s what I tell people after I mock them. Or to put it another way, I’ve never seen anyone change his mind because of the power of a superior argument or the acquisition of new facts. But I’ve seen plenty of people change behavior to avoid being mocked.\nMany of our biggest world problems are caused by different religious views. But it’s not socially acceptable to even discuss whether those views originate from the almighty or a drunken guy wizzing on a tree stump. At a bare minimum, just to pick one example, either Christianity or Islam is completely and utterly wrong. The beliefs are mutually exclusive. Muslims believe all Christians will burn in Hell. Christians believe that the Koran is fiction. They can’t both be right. (They could obviously both be wrong if the Heaven’s Gate guys turn out to have it right.)\nFirst, I note that Mr. Adams must not associate with many intellectually curious individuals, because nearly every individual I know has changed his mind based on the acquisition of new facts.  The public school advocate who now homeschools, the former Republican Inner Circle member who is now a libertarian anarchist, the girl with the Pro-Choice checks who now opposes abortion, the career girl with an MBA turned wife and stay-at-home mother, the staunch liberal Democrat turned Reaganite Republican… why, I even know of an agnostic hedonist turned Southern Baptist.\nLike many maleducated atheists, Mr. Adams substitutes parroting a few false “truisms” he has heard and foolishly found compelling for original thinking.  This is easily demonstrated, only consider this statement: “Many of our biggest world problems are caused by different religious views.”\nVery well, what are those problems?  Mr. Adams himself is apparently concerned about Global Warming.  We can probably assume that War would make the list, along with Hunger, Disease, and, according to Mr. Seth Blatter of FIFA, Diving in International Football is a global issue as well.  Interestingly enough, one can probably make a better religious case for Diving than for any of the other four “biggest world problems”.\nGlobal Warming, if it exists at all, is caused by carbon emissions.  According to the Natural Resources Defense Council,\nCarbon dioxide and other air pollution that is collecting in the atmosphere like a thickening blanket, trapping the sun’s heat and causing the planet to warm up. Coal-burning power plants are the largest U.S. source of carbon dioxide pollution — they produce 2.5 billion tons every year. Automobiles, the second largest source, create nearly 1.5 billion tons of CO2 annually.\nWhich religion is responsible for coal-burning power plants and automobiles, Mr. Adams?  Is solar power banned in the Book of Exodus?  The Islamic Republic of Iran’s pursuit of uranium processing would seem to make it clear that the Koran is okay with nuclear power.  And while there are those who preach against the internal combustion engine, they seldom do so from a position of authority within a church, mosque, synagogue or temple.\nWar, as I have demonstrated in the past, predates every existing religion.  Of the 500 wars chronicled in Wikipedia, only 11 percent have any relation to religion at all and leaving out Islam – a religion of the sword – drops that percentage to less than 3 percent.  Which of America’s wars were caused by religion, Mr. Adams, the Revolutionary War, the War of 1812, the Spanish-American War, the Civil War, World War I, World War II, the Korean War, the Vietnam War, the Gulf War or the present Iraqi Occupation?\nHunger, as Mr. PJ O’Rourke proved so conclusively in “All the Trouble in the World” is a primarily a political phenomenon.  Specifically, it is a socialist political phenomenon and a LACK of religion is more correctly considered a causal factor here.  While it is possible for a socialist to be religious, (there are no shortage of Christian and Muslim socialists), the specific form of socialism dominant in nearly all of the famine-struck countries of the last eighty years, from the former Soviet Union to modern Zimbabwe, was an atheist one.  It is not a coincidence that most of the socialist dictators who presided over the various African mass starvations were educated at Patrice Lumumba University in Moscow.\nDisease, insasmuch as it has any relation to religion at all, is negatively correlated with religion.  This is true on the individual level, as New Scientist magazine reports that religious individuals get sick less often than non-believers, and on the societal level as well.  In Uganda, for example, the abstinence-based ABC program has been far more successful in reducing the incidence of AIDS than the condom-based “safe sex” progams used in Kenya, Zimbabwe and other African countries. Does Mr. Adams argue that there would be less disease without the hundreds of thousands of Christian charity workers active around the world?  Has the rejection of religious doctrine reduced or increased the incidence of STDs in America’s heterosexual and homosexual communities alike?\nDiving in International Football, on the other hand, is at its worst in Italy, a Catholic country where footballers often cross themselves upon entering the game.  Here, and only here, Mr. Adams just might have a point.  Whether Diving is as serious a global problem as Global Warming, War, Hunger and Disease I leave to the reader to decide.  And perhaps readers might be able to suggest other “biggest world problems” I have neglected to address here, so that we can consider whether or not religion is the primary cause of them.\nAs far as the contradictions between Islam and Christianity are concerned, I merely recommend to Mr. Adams a literary criticism of the two foundational documents by the atheist Christopher Hitchens as a useful starting point.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-17T07:45:00+00:00"
}