{
  "url": "https://voxday.net/2006/04/25/one-nil-to-arsena/",
  "scraped_at": "2026-01-08T21:05:54.101877",
  "title": "One-nil to the Arsenal",
  "date_display": "April 25, 2006",
  "date_iso": "2006-04-25T18:28:00+00:00",
  "date_from_url": "2006-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A quick Champions League primer for the uninitiated:  the semifinals are a tie, wherein home and away matches are played and the winner on aggregate goals goes to the final.  In the event of a tie tie, away goals are given priority.  So, if Villereal wins 1-0, the aggregate score will be 1-1 with no away goals and the tie will go to penalties to settle the matter.  If Villereal wins by one goal by any other score or today’s match is tied, Arsenal will win by virtue of what will have been (wioll haven been?) their away goal(s).  Thus, Villareal either have to shut out the Gunners or score at least three goals to win.  Since Arsenal features the most aesthetically perfect attack in the world and no one has scored on Arsenal in 11 straight Champions League games, this would appear to be a very difficult task indeed.</p><p>1:25 – Reyes is back, and Henry learns that the assistant referees have a quick trigger on the offsides flag</p><p>3:00 – Hleb taken down, free kick.  Arsenal passes around the perimeter, finally into Henry in the center but it’s a bad first touch.</p><p>5:06 – Arsenal mysteriously leaves Guille Franco alone outside the box, but his pathetic effort explains why.  It might have scared a pigeon passing somewhere over the stadium, but the defenders are unconcerned.  They’re dealing with every attack with almost negligent ease.</p><p>7:30 – Dangerous chip into Forlan, but Toure shoulders him off the ball and out for a corner.  Strange pass to Senna lying deep, the player taking the corner simply stands there and is called offside when Senna sends the ball back to him.</p><p>9:00 – Flamini pulls a hamstring and has to go out.  Clichie, who is only 20, comes in as an early substitute for Arsenal.  Hmmmm….</p><p>11:00 – The keepers take turns punting the ball back and forth until Lehman punts it out of bounds.  Henry yells something to the tune of “knock it off, ya dumb Kraut.”  Villareal is controlling the midfield, Arsenal seems to be holding something in reserve.</p><p>13:25 – Toure is off a step and allows a Villareal striker to cut in and take a nice crack from the top center of the box.  Only the pigeons are alarmed, the shot is a good ten meters high.  Villareal is looking the more dangerous of the sides, however.</p><p>15:58 – Gilberto makes a “hey, start thinking” gesture at someone.  Can’t see who it’s at, but I’m guessing Toure.  Arsenal gives up a corner, but it’s harmless.  More pressure from Villareal and someone goes down under pressure from Gilberto but it’s a complete dive.</p><p>18:00 – Nice pullback pass from Forlan right into the center of the box but it’s weakly struck and Lehman picks it up.  Good chance, Arsenal can’t just sit back like this.  Arsenal finally counterattacks but Henry is offsides.</p><p>21:45 – Little reversal from Reyes on the left, one of his first touches of the game and he’s taken down.  Nice free kick across headed in, Henry heads back perfectly across to the spot but no one is there.  Dennis would have been there….</p><p>25:00 – Henry is completely alone up top, the four midfielders are all playing reaction ball and no one is making any runs even when they have possession in the Villareal half.  I don’t like seeing them play Italian style like this, it’s not their game to sit back and defend.  I hope Wenger is trying to lull them to sleep before a storm at the end of the half, because I don’t see any wisdom in trying to defend for the whole 90 minutes.</p><p>30:00 – Troy Polamalu’s evil twin loses Eboue but his entry pass is stuffed.  Foul and a free kick from 35, but the lob misses its intended target and Lehman scoops it up.  Bad cross intended for Forlan, who is moving around more than Arsenal’s front five.  Even the English announcers are getting critical of Arsenal’s complete unwillingness to attack.</p><p>36:30 – Sorry, phone call.  Random blondes keep calling me, it’s a hard life.  Finally some pressure from Arsenal but nothing.  Villareal sends a vicious low ball right through the box but miraculously there’s no one there.  Villareal dives in the box, they do go down easily, these Spaniards, then another collision, Villareal appeals for a yellow, but it’s only a free kick.  Poor cross but Arsenal has some trouble clearing.  Finally a free kick to Arsenal when Hleb is taken down.</p><p>40:00 – Yikes!  Great low cross from the right, Guille Franco beats Toure and puts a header right on goal but Lehman instinctively reacts and blocks it with his chest.  Toure quickly clears but it was a very dangerous ball.</p><p>41:30: – Arsenal is staggering.  Bad blunder in front of goal by Campbell or Toure but no one sees and Lehman boots it clear.  Gilberto takes down Forlan, I have to say, he’s rather indelicate for a Brazilian.</p><p>44:00 – One minute injury time.  Arsenal can’t seem to get the ball past midfield.  Henry is compltely unused.  Reyes goes down, gets up and goes down again, having fallen squarely on both knees.  Meanwhile, Fabregas kicks a Villareal player in the face… no, it’s a replay of an earlier foul.  Free kick for Villareal to end the half from 40, it’s a nice shot right at a teammate, who ducks, but Lehman is right there to catch it on the bounce.  All in all, a very underwhelming half from the Gunners.</p><p>Cool Nike commercial with the Brazilian national team in the locker room before a game.  The players are juggling the ball, passing it around in the air and generally making absurdly difficult things look simple.  Interestingly, right before the game, they gather in a circle with their arms around each other and pray.  But isn’t that illegal?</p><p>45:00 – Last week there was a squirrel, these week it’s a crazy Argentine waving a Barcelona flag running across the field.  I’m guessing he’s pulling for Villareal tonight judging by the way he waves it at Henry.  Security tackles him and we kickoff….</p><p>48:30 – Senna drives and shoots, but Lehman deals with it.    Arsenal appears to be pushing Reyes and Hleb forward a bit more – YOWZA – great deep cross from Villareal and Guille Franco demonstrates about a 50-inch vertical and nearly puts the ball in the net.  Just wide, fortunately.  I need more Amaretto….</p><p>50:00 – Everyone but Henry is in or around the penalty box.  This isnt working.  Finally there is the slowest counterattack in Arsenal history.  The problem is that when they’re not attacking, they’re not playing.  Henry is just going through the motions.</p><p>55:00 – Ouch.  Guille Franco just took Gilberto’s skull squarely in the back of his head.  Obviously he’s fine, though.  Early cross and while Sol Campbell just stands there like an Unfrozen Caveman Lawyer still in the deep freeze, Guille Franco flashes past him and puts a vicious header just wide.  Ref stops play, Campbell is bleeding and is forced to receive treatment while Villareal takes a corner.</p><p>60:00 – Lovely flickback from Villareal and a long run down the right.  Entry pass goes right to Eboue and he clears.  Arsenal counterattacks with 2 on 5, which goes about as well as you’d expect.  The defenders leisurely stroll up past midfield as the midfielders control, but Crici finally loses the ball.  Free kick to Villareal from 40.  Nice chip but Lehman comes out and punches it clear.    Arsenal counterattacks but Eboue muffs the ball when it comes to him in the box, Arsenal corner.</p><p>65:00 – Freddie looks like he’s ready to punch out the Villareal captain, who is following him around prior to the corner. Gilberto puts a header wide left of goal.  Josico is off is replaced by a striker, Jose Mari, for Villareal.  Arsenal should see some opportunity to counterattack soon.  They’re finally pressuring the ball now, but Villareal sends Jose Mari deep down the right side.  The entry is stuffed, but Arsenal can’t clear midfield.  DOUBLE YIKES!  Nice chip from Forlan into the box, Franco gets a nice first touch, Lehman has to come out and Franco passes to Forlan, who gets a little cute and misses the empty net.</p><p>69:00 – Arsena<br> l controlling, but the last pass is always lacking.  Henry still looking lacksadaisical, manages to lose the ball twice.  Villareal goes long, Guille Franco controls beautifully and scores, but he’s offsides by a good three meters, so clearly that the crowd doesn’t even bother to cheer when it goes in the net.  Pires comes in for Reyes, who has done very little today.</br></p><p>72:00 – Villareal’s defenders practically require condoms, as they’re all but raping Henry and Ljungberg on corners.  The referee is turning a blind eye, which outrages the announcers.  I can see why he’s not going to give a penalty, but a yellow card would be reasonable.  Nice attack from Villareal, but Freddie zooms across, clears the ball and is fouled.</p><p>75:00 – Gilberto steals the ball and Riquellme’s shoe from the Villareal striker.  Reyes is watching from the sideline, nervously kissing his crucifix.  Villareal is starting to get a bit chippy, starting to look tired and a little frustrated.  Gilberto makes the sort of move that only a Brazilian can make, reversing the ball and splitting two Villareal players, leaving them behind him wondering where he went.</p><p>78:30 – Villareal ratches up the pressure, and Arsenal is allowing in the first pass to the top center of the box, then closing the passing lanes, a very dangerous defensive tactic.  It’s working, but it’s very tenses in here.  Ah see OJ!  Arsenal pulls six or seven passes in a slick counterattack and a Villareal player immediately goes down.  Rather cynical, if you ask me.  He’s up as soon as the ball goes out of bounds… screw this fair play, I say, it’s too easily abused.</p><p>82:00 – Fabregas and Hleb put some nice passes together and Fabregas nearly goes clear on goal but makes a wrong turn on the last defender and loses the ball.  Alverez takes down Henry after blocking a through ball to Pires.  Villareal makes a change, Arsenal free kick from 30.  Straight into the wall, back to Henry and he promptly loses the ball again.  Just rest him already, Arsene.</p><p>85:00 – Finally, a nice slashing attack from Arsenal.  Henry’s header on the cross from Hleb falls just short and the defender heads it clear before it drops clear for Pires in the box.  Questionable ball back to Lehman, but he sees it and boots it to midfield.    The problem with these reactive tactics is that no one is ready to attack when the opportunity presents itself.</p><p>88:00 – Possession must be 80% to Villareal.  Franco goes penalty-hunting by jumping into Campbell and falling down but the referee just rolls his eyes, should have been a yellow.  Freddie is the only Gunner still running hard forward.  Forlan has a nice opportunity but Toure makes an athletic block with a leg.</p><p>88:15 – Total insanity!  Jose Mari takes a massive dive as if he’s been shot in the lower back and the idiot ref gives a penalty.  Sometimes I hate this game.</p><p>89:20 – JUSTICE IS SERVED!  Lehman guesses right, dives left and blocks the penalty from Riquelme, who can’t believe it.  Neither can anyone else in the stadium.  Lots of shots of cute Spanish women looking as if they were just informed that they can’t bear children.</p><p>90:15 – Thierry Henry is completely off tonight.  He makes a long run, beats the last defender and for once doesn’t beat the goalie.  I’m actually astonished.  Three minutes injury time, but the announcers are already talking about everlasting glory, England and the sun never setting.  It looks like they’re through to Paris.</p><p>93:00 – “It is Paris in the springtime for Arsenal!”  Lehman is getting rightly mobbed by the team, the Young Dennis hugs him so enthusiastically it looks as if he wants to get a room.  0-0, 1-0 on aggregate.  It’s enough to get through, but they’ll have to do better against Barca or Milan.  I’d be cheering for Milan anyhow, but I think Arsenal matches up much better against the team that doesn’t have Ronaldinho.</p></div>",
  "content_text": "A quick Champions League primer for the uninitiated:  the semifinals are a tie, wherein home and away matches are played and the winner on aggregate goals goes to the final.  In the event of a tie tie, away goals are given priority.  So, if Villereal wins 1-0, the aggregate score will be 1-1 with no away goals and the tie will go to penalties to settle the matter.  If Villereal wins by one goal by any other score or today’s match is tied, Arsenal will win by virtue of what will have been (wioll haven been?) their away goal(s).  Thus, Villareal either have to shut out the Gunners or score at least three goals to win.  Since Arsenal features the most aesthetically perfect attack in the world and no one has scored on Arsenal in 11 straight Champions League games, this would appear to be a very difficult task indeed.\n1:25 – Reyes is back, and Henry learns that the assistant referees have a quick trigger on the offsides flag\n3:00 – Hleb taken down, free kick.  Arsenal passes around the perimeter, finally into Henry in the center but it’s a bad first touch.\n5:06 – Arsenal mysteriously leaves Guille Franco alone outside the box, but his pathetic effort explains why.  It might have scared a pigeon passing somewhere over the stadium, but the defenders are unconcerned.  They’re dealing with every attack with almost negligent ease.\n7:30 – Dangerous chip into Forlan, but Toure shoulders him off the ball and out for a corner.  Strange pass to Senna lying deep, the player taking the corner simply stands there and is called offside when Senna sends the ball back to him.\n9:00 – Flamini pulls a hamstring and has to go out.  Clichie, who is only 20, comes in as an early substitute for Arsenal.  Hmmmm….\n11:00 – The keepers take turns punting the ball back and forth until Lehman punts it out of bounds.  Henry yells something to the tune of “knock it off, ya dumb Kraut.”  Villareal is controlling the midfield, Arsenal seems to be holding something in reserve.\n13:25 – Toure is off a step and allows a Villareal striker to cut in and take a nice crack from the top center of the box.  Only the pigeons are alarmed, the shot is a good ten meters high.  Villareal is looking the more dangerous of the sides, however.\n15:58 – Gilberto makes a “hey, start thinking” gesture at someone.  Can’t see who it’s at, but I’m guessing Toure.  Arsenal gives up a corner, but it’s harmless.  More pressure from Villareal and someone goes down under pressure from Gilberto but it’s a complete dive.\n18:00 – Nice pullback pass from Forlan right into the center of the box but it’s weakly struck and Lehman picks it up.  Good chance, Arsenal can’t just sit back like this.  Arsenal finally counterattacks but Henry is offsides.\n21:45 – Little reversal from Reyes on the left, one of his first touches of the game and he’s taken down.  Nice free kick across headed in, Henry heads back perfectly across to the spot but no one is there.  Dennis would have been there….\n25:00 – Henry is completely alone up top, the four midfielders are all playing reaction ball and no one is making any runs even when they have possession in the Villareal half.  I don’t like seeing them play Italian style like this, it’s not their game to sit back and defend.  I hope Wenger is trying to lull them to sleep before a storm at the end of the half, because I don’t see any wisdom in trying to defend for the whole 90 minutes.\n30:00 – Troy Polamalu’s evil twin loses Eboue but his entry pass is stuffed.  Foul and a free kick from 35, but the lob misses its intended target and Lehman scoops it up.  Bad cross intended for Forlan, who is moving around more than Arsenal’s front five.  Even the English announcers are getting critical of Arsenal’s complete unwillingness to attack.\n36:30 – Sorry, phone call.  Random blondes keep calling me, it’s a hard life.  Finally some pressure from Arsenal but nothing.  Villareal sends a vicious low ball right through the box but miraculously there’s no one there.  Villareal dives in the box, they do go down easily, these Spaniards, then another collision, Villareal appeals for a yellow, but it’s only a free kick.  Poor cross but Arsenal has some trouble clearing.  Finally a free kick to Arsenal when Hleb is taken down.\n40:00 – Yikes!  Great low cross from the right, Guille Franco beats Toure and puts a header right on goal but Lehman instinctively reacts and blocks it with his chest.  Toure quickly clears but it was a very dangerous ball.\n41:30: – Arsenal is staggering.  Bad blunder in front of goal by Campbell or Toure but no one sees and Lehman boots it clear.  Gilberto takes down Forlan, I have to say, he’s rather indelicate for a Brazilian.\n44:00 – One minute injury time.  Arsenal can’t seem to get the ball past midfield.  Henry is compltely unused.  Reyes goes down, gets up and goes down again, having fallen squarely on both knees.  Meanwhile, Fabregas kicks a Villareal player in the face… no, it’s a replay of an earlier foul.  Free kick for Villareal to end the half from 40, it’s a nice shot right at a teammate, who ducks, but Lehman is right there to catch it on the bounce.  All in all, a very underwhelming half from the Gunners.\nCool Nike commercial with the Brazilian national team in the locker room before a game.  The players are juggling the ball, passing it around in the air and generally making absurdly difficult things look simple.  Interestingly, right before the game, they gather in a circle with their arms around each other and pray.  But isn’t that illegal?\n45:00 – Last week there was a squirrel, these week it’s a crazy Argentine waving a Barcelona flag running across the field.  I’m guessing he’s pulling for Villareal tonight judging by the way he waves it at Henry.  Security tackles him and we kickoff….\n48:30 – Senna drives and shoots, but Lehman deals with it.    Arsenal appears to be pushing Reyes and Hleb forward a bit more – YOWZA – great deep cross from Villareal and Guille Franco demonstrates about a 50-inch vertical and nearly puts the ball in the net.  Just wide, fortunately.  I need more Amaretto….\n50:00 – Everyone but Henry is in or around the penalty box.  This isnt working.  Finally there is the slowest counterattack in Arsenal history.  The problem is that when they’re not attacking, they’re not playing.  Henry is just going through the motions.\n55:00 – Ouch.  Guille Franco just took Gilberto’s skull squarely in the back of his head.  Obviously he’s fine, though.  Early cross and while Sol Campbell just stands there like an Unfrozen Caveman Lawyer still in the deep freeze, Guille Franco flashes past him and puts a vicious header just wide.  Ref stops play, Campbell is bleeding and is forced to receive treatment while Villareal takes a corner.\n60:00 – Lovely flickback from Villareal and a long run down the right.  Entry pass goes right to Eboue and he clears.  Arsenal counterattacks with 2 on 5, which goes about as well as you’d expect.  The defenders leisurely stroll up past midfield as the midfielders control, but Crici finally loses the ball.  Free kick to Villareal from 40.  Nice chip but Lehman comes out and punches it clear.    Arsenal counterattacks but Eboue muffs the ball when it comes to him in the box, Arsenal corner.\n65:00 – Freddie looks like he’s ready to punch out the Villareal captain, who is following him around prior to the corner. Gilberto puts a header wide left of goal.  Josico is off is replaced by a striker, Jose Mari, for Villareal.  Arsenal should see some opportunity to counterattack soon.  They’re finally pressuring the ball now, but Villareal sends Jose Mari deep down the right side.  The entry is stuffed, but Arsenal can’t clear midfield.  DOUBLE YIKES!  Nice chip from Forlan into the box, Franco gets a nice first touch, Lehman has to come out and Franco passes to Forlan, who gets a little cute and misses the empty net.\n69:00 – Arsena\nl controlling, but the last pass is always lacking.  Henry still looking lacksadaisical, manages to lose the ball twice.  Villareal goes long, Guille Franco controls beautifully and scores, but he’s offsides by a good three meters, so clearly that the crowd doesn’t even bother to cheer when it goes in the net.  Pires comes in for Reyes, who has done very little today.\n72:00 – Villareal’s defenders practically require condoms, as they’re all but raping Henry and Ljungberg on corners.  The referee is turning a blind eye, which outrages the announcers.  I can see why he’s not going to give a penalty, but a yellow card would be reasonable.  Nice attack from Villareal, but Freddie zooms across, clears the ball and is fouled.\n75:00 – Gilberto steals the ball and Riquellme’s shoe from the Villareal striker.  Reyes is watching from the sideline, nervously kissing his crucifix.  Villareal is starting to get a bit chippy, starting to look tired and a little frustrated.  Gilberto makes the sort of move that only a Brazilian can make, reversing the ball and splitting two Villareal players, leaving them behind him wondering where he went.\n78:30 – Villareal ratches up the pressure, and Arsenal is allowing in the first pass to the top center of the box, then closing the passing lanes, a very dangerous defensive tactic.  It’s working, but it’s very tenses in here.  Ah see OJ!  Arsenal pulls six or seven passes in a slick counterattack and a Villareal player immediately goes down.  Rather cynical, if you ask me.  He’s up as soon as the ball goes out of bounds… screw this fair play, I say, it’s too easily abused.\n82:00 – Fabregas and Hleb put some nice passes together and Fabregas nearly goes clear on goal but makes a wrong turn on the last defender and loses the ball.  Alverez takes down Henry after blocking a through ball to Pires.  Villareal makes a change, Arsenal free kick from 30.  Straight into the wall, back to Henry and he promptly loses the ball again.  Just rest him already, Arsene.\n85:00 – Finally, a nice slashing attack from Arsenal.  Henry’s header on the cross from Hleb falls just short and the defender heads it clear before it drops clear for Pires in the box.  Questionable ball back to Lehman, but he sees it and boots it to midfield.    The problem with these reactive tactics is that no one is ready to attack when the opportunity presents itself.\n88:00 – Possession must be 80% to Villareal.  Franco goes penalty-hunting by jumping into Campbell and falling down but the referee just rolls his eyes, should have been a yellow.  Freddie is the only Gunner still running hard forward.  Forlan has a nice opportunity but Toure makes an athletic block with a leg.\n88:15 – Total insanity!  Jose Mari takes a massive dive as if he’s been shot in the lower back and the idiot ref gives a penalty.  Sometimes I hate this game.\n89:20 – JUSTICE IS SERVED!  Lehman guesses right, dives left and blocks the penalty from Riquelme, who can’t believe it.  Neither can anyone else in the stadium.  Lots of shots of cute Spanish women looking as if they were just informed that they can’t bear children.\n90:15 – Thierry Henry is completely off tonight.  He makes a long run, beats the last defender and for once doesn’t beat the goalie.  I’m actually astonished.  Three minutes injury time, but the announcers are already talking about everlasting glory, England and the sun never setting.  It looks like they’re through to Paris.\n93:00 – “It is Paris in the springtime for Arsenal!”  Lehman is getting rightly mobbed by the team, the Young Dennis hugs him so enthusiastically it looks as if he wants to get a room.  0-0, 1-0 on aggregate.  It’s enough to get through, but they’ll have to do better against Barca or Milan.  I’d be cheering for Milan anyhow, but I think Arsenal matches up much better against the team that doesn’t have Ronaldinho.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-25T17:28:00+00:00"
}