{
  "url": "https://voxday.net/2006/04/05/onward-arsena/",
  "scraped_at": "2026-01-08T21:04:01.074191",
  "title": "Onward the Arsenal",
  "date_display": "April 5, 2006",
  "date_iso": "2006-04-05T18:36:00+00:00",
  "date_from_url": "2006-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’ll excuse me, I’m just going to hit the couch to read some Flaubert and watch Arsenal finish off Juventus.  Have a good afternoon….</p><p>Not a bad result at all.  Arsenal ran the hateful <em>bianconeri</em> right out of the Stadio delle Alpe with but three moments of danger, all of which Herr Lehman dealt with forthrightly.  Freddie missed a good chance, young gun Fabregas missed a great one by drilling the ball right at Buffon and Alexander Hleb ran out of steam or he probably would have put one away.</p><p>It’s been a good week for soccer.  Last night we beat the bottom-dwellers, (who for some reason always give us trouble), by a score of 3-1 to take a 11-point lead in the league, but I’m hobbling around today thanks to the injury to our left winger.  He couldn’t run and we had no substitutions left, so I switched positions with him, (the manager had me in at forward even though I’m usually on the wings now), and ended up trying to cover both positions.</p><p>The good news was that the manager moved me up from number 15 to number 13 before the game, which means I’m guaranteed a full half of play instead of just cleanup and injury duty.  I’m simply not good enough to crack the starting 11 nor do I have the stamina to last the full 90 minutes on the wing, but I earned us a penalty last night and stole the ball that created another goal, so I’ll hold my spot and maybe move up to 12 if I can manage another decent game on Friday.  We’re playing the #2 team on the table, so a win will put us 14 points up and pretty much lock in the title.</p><p>UPDATE: No, I’m not a diver.  I loathe the likes of Juve’s Nedved, who tried to fake his own injury immediately after taking down Toure from behind and justly earning his second yellow on the night.  I earned the penalty by moving into position for a pass from our other striker; when he slipped the ball across the box to me, the defender threw himself to the ground in an impossible attempt to block the pass and only managed to deflect it with his outstretched arms.</p></div>",
  "content_text": "If you’ll excuse me, I’m just going to hit the couch to read some Flaubert and watch Arsenal finish off Juventus.  Have a good afternoon….\nNot a bad result at all.  Arsenal ran the hateful\nbianconeri\nright out of the Stadio delle Alpe with but three moments of danger, all of which Herr Lehman dealt with forthrightly.  Freddie missed a good chance, young gun Fabregas missed a great one by drilling the ball right at Buffon and Alexander Hleb ran out of steam or he probably would have put one away.\nIt’s been a good week for soccer.  Last night we beat the bottom-dwellers, (who for some reason always give us trouble), by a score of 3-1 to take a 11-point lead in the league, but I’m hobbling around today thanks to the injury to our left winger.  He couldn’t run and we had no substitutions left, so I switched positions with him, (the manager had me in at forward even though I’m usually on the wings now), and ended up trying to cover both positions.\nThe good news was that the manager moved me up from number 15 to number 13 before the game, which means I’m guaranteed a full half of play instead of just cleanup and injury duty.  I’m simply not good enough to crack the starting 11 nor do I have the stamina to last the full 90 minutes on the wing, but I earned us a penalty last night and stole the ball that created another goal, so I’ll hold my spot and maybe move up to 12 if I can manage another decent game on Friday.  We’re playing the #2 team on the table, so a win will put us 14 points up and pretty much lock in the title.\nUPDATE: No, I’m not a diver.  I loathe the likes of Juve’s Nedved, who tried to fake his own injury immediately after taking down Toure from behind and justly earning his second yellow on the night.  I earned the penalty by moving into position for a pass from our other striker; when he slipped the ball across the box to me, the defender threw himself to the ground in an impossible attempt to block the pass and only managed to deflect it with his outstretched arms.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-05T17:36:00+00:00"
}