{
  "url": "https://voxday.net/2006/04/12/perhaps-because-it-isnt-fake/",
  "scraped_at": "2026-01-08T21:04:41.669111",
  "title": "Perhaps because it isn’t a fake",
  "date_display": "April 12, 2006",
  "date_iso": "2006-04-12T10:26:00+00:00",
  "date_from_url": "2006-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dustin Hawkins engages in <a href=\"http://www.townhall.com/opinion/columns/DustinHawkins/2006/04/12/193287.html\">some wishful thinking on Townhall</a>:</p><blockquote><p>But the pretend-conservative act is being carried onto a whole new playing field, one that has become wildly influential over the past few years and one that does not stand to be instantly recognized as a fake. That playing field is the blogosphere, which is then used in conjunction with massive e-mailings to “spread the word” (as one e-mailer insisted I do to my readers/e-mail list) to other conservatives.</p><p>The concept is the same: the blog or e-mail claims, first, that the said writer has been a conservative for years and that they have “had it with Republicans.” They then point to an issue that conservatives would likely be upset about such as excessive spending, immigration, or the expansion of government. Their supposed rage over the issue has convinced them to either not show up to vote in 2006, or, in order to really show Republicans, vote for the Democrat instead.</p></blockquote><p>I am not a conservative and have not been for many years, but I don’t think anyone, on the Right or Left, would deny that I am a hard-core right winger.  But I am a former Reagan Youth with fond memories of the Gipper and I despise Dear Jorge and the Bush Republicans every bit as much as I loathe Hillary Clinton and the UN-First Democrats.</p><p>There are many people here who voted for Bush in 2000 and did not vote Republican in 2004.  (Raise your hand, you know who you are.)  I suspect there are even more who voted Bush in 2000 and 2004 who will be sitting out 2006 or voting third party.  (Another show of hands.)</p><p>This Three Monkey engages in some petty dishonesty of his own, by the way. <em>“In general, my acquaintances take the position that it is better to vote for someone who is good on 8 out of 10 issues than bad on 9 out of ten.”</em> I’m sure they do, but how does that apply here?  If the Democrats are bad on 9 out of ten issues – I’d give them a ten myself – the Republicans are bad on at least 7 out of ten to anyone genuinely holding to conservative principles.</p><p>I’ll email the results to Mr. Hawkins at the end of the day.</p><p>UPDATE: I wonder if Mr. Hawkins also sees Tony Blankley as a fake.</p><blockquote><p>I admit that it is hard to find a political professional who doesn’t see public opinion trending toward a decisive Republican defeat in November. On the other hand, nothing in those public surveys suggests that Republican and conservative ideas have lost their popularity. What the public is turning sour on is the Republican Party as an effective vehicle for delivering those ideas.</p></blockquote><p>Occam’s Razor strongly suggests the public has reached this conclusion because it isn’t.</p></div>",
  "content_text": "Dustin Hawkins engages in\nsome wishful thinking on Townhall\n:\nBut the pretend-conservative act is being carried onto a whole new playing field, one that has become wildly influential over the past few years and one that does not stand to be instantly recognized as a fake. That playing field is the blogosphere, which is then used in conjunction with massive e-mailings to “spread the word” (as one e-mailer insisted I do to my readers/e-mail list) to other conservatives.\nThe concept is the same: the blog or e-mail claims, first, that the said writer has been a conservative for years and that they have “had it with Republicans.” They then point to an issue that conservatives would likely be upset about such as excessive spending, immigration, or the expansion of government. Their supposed rage over the issue has convinced them to either not show up to vote in 2006, or, in order to really show Republicans, vote for the Democrat instead.\nI am not a conservative and have not been for many years, but I don’t think anyone, on the Right or Left, would deny that I am a hard-core right winger.  But I am a former Reagan Youth with fond memories of the Gipper and I despise Dear Jorge and the Bush Republicans every bit as much as I loathe Hillary Clinton and the UN-First Democrats.\nThere are many people here who voted for Bush in 2000 and did not vote Republican in 2004.  (Raise your hand, you know who you are.)  I suspect there are even more who voted Bush in 2000 and 2004 who will be sitting out 2006 or voting third party.  (Another show of hands.)\nThis Three Monkey engages in some petty dishonesty of his own, by the way.\n“In general, my acquaintances take the position that it is better to vote for someone who is good on 8 out of 10 issues than bad on 9 out of ten.”\nI’m sure they do, but how does that apply here?  If the Democrats are bad on 9 out of ten issues – I’d give them a ten myself – the Republicans are bad on at least 7 out of ten to anyone genuinely holding to conservative principles.\nI’ll email the results to Mr. Hawkins at the end of the day.\nUPDATE: I wonder if Mr. Hawkins also sees Tony Blankley as a fake.\nI admit that it is hard to find a political professional who doesn’t see public opinion trending toward a decisive Republican defeat in November. On the other hand, nothing in those public surveys suggests that Republican and conservative ideas have lost their popularity. What the public is turning sour on is the Republican Party as an effective vehicle for delivering those ideas.\nOccam’s Razor strongly suggests the public has reached this conclusion because it isn’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-12T09:26:00+00:00"
}