{
  "url": "https://voxday.net/2006/04/21/you-have-right-to-be-stupid/",
  "scraped_at": "2026-01-08T21:05:28.069320",
  "title": "You have the right to be stupid",
  "date_display": "April 21, 2006",
  "date_iso": "2006-04-21T12:33:00+00:00",
  "date_from_url": "2006-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Feministe <a href=\"http://www.feministe.us/blog/archives/2006/04/20/how-to-stop-rape/\">dreams of a world where unicorns all play nicely</a>:</p><blockquote><p>Thank you, Ann Coulter, for this wonderful insight:</p><p><em>And if you are a girl in Aruba or New York City, among the best ways to avoid being the victim of a horrible crime is to not get drunk in public or go off in a car with men you just met. While we’re on the subject of things every 5-year-old should know, I also recommend against dousing yourself in gasoline and striking a match.</em></p><p>That’s right: If only these women wouldn’t go out in public and drink, they wouldn’t be physically harmed.  Now, obviously, all people should do what they can to prevent themselves from being the victim of a crime. In fact, the vast majority of us already do that. But how come when a guy gets killed, no one is saying, “Well, he really shouldn’t have gone to a bar”? Because men are entitled to live their lives like normal human beings, in the public sphere. Women, apparently, are not.</p></blockquote><p>Yes, my dear darling feminista, if you don’t go out in public and drink yourself silly, the probability of bad things happening to you is significantly reduced.  If you avoid doing it in a city, alone, in the early morning, that helps too.  If you can somehow manage to avoid doing that, you are far less likely to find yourself in jail, in the hospital or in a tasteful wooden box.  But probability management is difficult, to be sure, and I suppose we can’t expect most women to understand such very complex matters since, as Barbie tells us, math is hard.</p><p>Sure, if a woman insists upon follow her urge to embrace the bad boy, she may well end up with these unpleasantries inside her home as well, but at least she won’t be bored.  That’s always a nice consolation while she’s waiting in the emergency room.</p><p>This post demonstrates the complete fixation of feminists on white middle America, since “he deserved it” is EXACTLY what is said when most young men are killed.  Of course, most male murder victims are black gangbangers, so of course they deserve it since it is a young white woman’s right to get drunk by herself at 3 AM in a city bar, but it is not a young black man’s right to engage in business transactions in broad daylight.</p><p>In case she hasn’t noticed it yet, men are bigger and stronger.  Evidence suggests that they also possess more common sense, because they are more prone to be armed despite the fact that women have a greater need for weapons that negate their physical disadvantages.  It’s every woman’s right to walk unarmed into a hungry lion’s cage, and it’s everyone else’s right to shake their heads at her stupidity when she gets messily devoured.</p><p>The odds of something bad happening are always small, but that does not mean they are nonexistent.  It is typical that women would rather attempt to tear down all of society and rebuild it in a totalitarian manner instead of simply accepting responsibility for themselves and either a) avoiding situations where the risk of danger is higher than normal, or, b) preparing themselves to deal with such elevated risks.</p><p>It staggers me that it is so often necessary to remind adults of two simple things:</p><p>1.  Sometimes people say things that aren’t true.<br>2.  Some people are bad and want to hurt other people.</br></p><p>No ideology, religion, philosophy or system of government that has ever existed, exists today or will exist in the future will eliminate those two facts of human existence.  The sooner feminists stop clinging to their rainbow-colored fantasies of unicorn equality and begin contemplating the realities of life on this planet, the better off they and the silly young women who take them seriously will be.</p><p><a href=\"http://www.nytimes.com/2006/04/19/nyregion/19nun.html\">Sister Karen Klimczak</a>, the murdered nun, had more in common with the gangbangers than she does with la feminista or whatever dead white girl inspired Ann Coulter’s column in the first place.  She knew the risks and she accepted them.   But in her case, she did so in the service of God, not greed, and she should be honored for her loving sacrifice.</p></div>",
  "content_text": "Feministe\ndreams of a world where unicorns all play nicely\n:\nThank you, Ann Coulter, for this wonderful insight:\nAnd if you are a girl in Aruba or New York City, among the best ways to avoid being the victim of a horrible crime is to not get drunk in public or go off in a car with men you just met. While we’re on the subject of things every 5-year-old should know, I also recommend against dousing yourself in gasoline and striking a match.\nThat’s right: If only these women wouldn’t go out in public and drink, they wouldn’t be physically harmed.  Now, obviously, all people should do what they can to prevent themselves from being the victim of a crime. In fact, the vast majority of us already do that. But how come when a guy gets killed, no one is saying, “Well, he really shouldn’t have gone to a bar”? Because men are entitled to live their lives like normal human beings, in the public sphere. Women, apparently, are not.\nYes, my dear darling feminista, if you don’t go out in public and drink yourself silly, the probability of bad things happening to you is significantly reduced.  If you avoid doing it in a city, alone, in the early morning, that helps too.  If you can somehow manage to avoid doing that, you are far less likely to find yourself in jail, in the hospital or in a tasteful wooden box.  But probability management is difficult, to be sure, and I suppose we can’t expect most women to understand such very complex matters since, as Barbie tells us, math is hard.\nSure, if a woman insists upon follow her urge to embrace the bad boy, she may well end up with these unpleasantries inside her home as well, but at least she won’t be bored.  That’s always a nice consolation while she’s waiting in the emergency room.\nThis post demonstrates the complete fixation of feminists on white middle America, since “he deserved it” is EXACTLY what is said when most young men are killed.  Of course, most male murder victims are black gangbangers, so of course they deserve it since it is a young white woman’s right to get drunk by herself at 3 AM in a city bar, but it is not a young black man’s right to engage in business transactions in broad daylight.\nIn case she hasn’t noticed it yet, men are bigger and stronger.  Evidence suggests that they also possess more common sense, because they are more prone to be armed despite the fact that women have a greater need for weapons that negate their physical disadvantages.  It’s every woman’s right to walk unarmed into a hungry lion’s cage, and it’s everyone else’s right to shake their heads at her stupidity when she gets messily devoured.\nThe odds of something bad happening are always small, but that does not mean they are nonexistent.  It is typical that women would rather attempt to tear down all of society and rebuild it in a totalitarian manner instead of simply accepting responsibility for themselves and either a) avoiding situations where the risk of danger is higher than normal, or, b) preparing themselves to deal with such elevated risks.\nIt staggers me that it is so often necessary to remind adults of two simple things:\n1.  Sometimes people say things that aren’t true.\n2.  Some people are bad and want to hurt other people.\nNo ideology, religion, philosophy or system of government that has ever existed, exists today or will exist in the future will eliminate those two facts of human existence.  The sooner feminists stop clinging to their rainbow-colored fantasies of unicorn equality and begin contemplating the realities of life on this planet, the better off they and the silly young women who take them seriously will be.\nSister Karen Klimczak\n, the murdered nun, had more in common with the gangbangers than she does with la feminista or whatever dead white girl inspired Ann Coulter’s column in the first place.  She knew the risks and she accepted them.   But in her case, she did so in the service of God, not greed, and she should be honored for her loving sacrifice.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-04-21T11:33:00+00:00"
}