{
  "url": "https://voxday.net/2025/01/02/a-false-and-retarded-god/",
  "scraped_at": "2026-01-08T19:34:10.759613",
  "title": "A False and Retarded God",
  "date_display": "January 2, 2025",
  "date_iso": "2025-01-02T10:47:31+00:00",
  "date_from_url": "2025-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the tragedies of the Boomers is that they gave up the faith of their fathers for an absolutely impossible lie, as evidenced by ESR’s attempt to defend the societal devastation that has been left in the wake of the wicked generation of the Boomers.</p><p><em>Religion failed us… I don’t think it could have gone differently; it’s a failure that had been on the cards ever since the mechanistic worldview reached effective completion by Darwin.</em><br/>– Eric S. Raymond</p><p>But as <a href=\"https://voxday.net/2019/02/07/maximal-mutations/\">I have conclusively and comprehensively proven</a>, the mechanistic worldview is obviously false due to the mathematical falsification of not only Darwin, but the very mechanism of evolution by natural selection. If you still believe that species turn into other species due to natural selection, you are not only ignorant, you are <em>observably innumerate and scientifically outdated.</em></p><p>The complete scientific falsification of the neo-Darwinian synthesis <em>has already been accomplished</em>, it simply hasn’t been widely recognized because biologists are too mathematically challenged and insufficiently skilled at pattern recognition to put the various pieces together yet. Consider the following pieces:</p><ul class=\"wp-block-list\"><li>The fastest observed genetic fixation in a species required 1,600 generations.</li><li>This 1,600-generations-per-fixation rate included parallel fixations.</li><li>The fastest observed spread of a genetic line in humans occurred at a rate that would require at least 8,170 generations per fixation.</li><li>Chinese scientists have asserted that genes in complex species such as humans change at a rate that is approximately one-fiftieth the rate of genetic change in simple species like bacteria. This implies at least 80,000 generations per genetic fixation.</li><li>The genetic difference between a modern <em>Homo sapiens sapiens</em> and a modern <em>Pan troglodytes</em> required around 30 million genetic fixations between the two species.</li><li>The estimated 9 million years since the Chimpanzee-Human Last Common Ancestor permits for somewhere between 282 and 55 genetic fixations per species. This is less than 0.000000006 percent of the observed genetic difference between modern chimpanzees and modern humans. It is also less than one percent of the observed genetic differences between two genetically divergent modern humans.</li></ul><p>It should be absolutely obvious to any rational analyst that a mechanism which cannot even account for a small fraction of one percent of the observed differences between two things cannot possibly be the causal factor explaining those differences. Not in a million years, not in nine million years, not in nine billion years. No amount of <em>argumentum ab magnis numeris</em> is going to salvage even the smallest vestige of the neo-Darwinian synthesis, the theory of evolution by natural selection, or, for those who are still clinging by faith to the evolutionary epicycles being produced by the final generation of evolutionary biologists, the Theorum of Evolution by (probably) Natural Selection, Sexual Selection, Biased Mutation, Genetic Drift, and Gene Flow.</p><p>Not only is there not one single piece of evidence ever produced that supports the idea that evolution by natural selection is sufficient to explain the observed genetic differences between one species and another, there is not one single hypothetical argument or explanation in defense of evolution by natural selection that is capable of standing up to the combination of math, logic, and the available scientific evidence.</p><p>If you rejected religion on the basis of mechanistic materialism, you abandoned the faith of your fathers for an obvious untruth. Darwin was not only a false intellectual god, he was a false and retarded one.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-65832\" decoding=\"async\" fetchpriority=\"high\" height=\"501\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/01/image-1.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/01/image-1.png 512w, https://voxday.net/wp-content/uploads/2025/01/image-1-300x294.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/cfad623c-11f5-47b2-ae83-519262ac5799\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One of the tragedies of the Boomers is that they gave up the faith of their fathers for an absolutely impossible lie, as evidenced by ESR’s attempt to defend the societal devastation that has been left in the wake of the wicked generation of the Boomers.\nReligion failed us… I don’t think it could have gone differently; it’s a failure that had been on the cards ever since the mechanistic worldview reached effective completion by Darwin.\n– Eric S. Raymond\nBut as\nI have conclusively and comprehensively proven\n, the mechanistic worldview is obviously false due to the mathematical falsification of not only Darwin, but the very mechanism of evolution by natural selection. If you still believe that species turn into other species due to natural selection, you are not only ignorant, you are\nobservably innumerate and scientifically outdated.\nThe complete scientific falsification of the neo-Darwinian synthesis\nhas already been accomplished\n, it simply hasn’t been widely recognized because biologists are too mathematically challenged and insufficiently skilled at pattern recognition to put the various pieces together yet. Consider the following pieces:\nThe fastest observed genetic fixation in a species required 1,600 generations.\nThis 1,600-generations-per-fixation rate included parallel fixations.\nThe fastest observed spread of a genetic line in humans occurred at a rate that would require at least 8,170 generations per fixation.\nChinese scientists have asserted that genes in complex species such as humans change at a rate that is approximately one-fiftieth the rate of genetic change in simple species like bacteria. This implies at least 80,000 generations per genetic fixation.\nThe genetic difference between a modern\nHomo sapiens sapiens\nand a modern\nPan troglodytes\nrequired around 30 million genetic fixations between the two species.\nThe estimated 9 million years since the Chimpanzee-Human Last Common Ancestor permits for somewhere between 282 and 55 genetic fixations per species. This is less than 0.000000006 percent of the observed genetic difference between modern chimpanzees and modern humans. It is also less than one percent of the observed genetic differences between two genetically divergent modern humans.\nIt should be absolutely obvious to any rational analyst that a mechanism which cannot even account for a small fraction of one percent of the observed differences between two things cannot possibly be the causal factor explaining those differences. Not in a million years, not in nine million years, not in nine billion years. No amount of\nargumentum ab magnis numeris\nis going to salvage even the smallest vestige of the neo-Darwinian synthesis, the theory of evolution by natural selection, or, for those who are still clinging by faith to the evolutionary epicycles being produced by the final generation of evolutionary biologists, the Theorum of Evolution by (probably) Natural Selection, Sexual Selection, Biased Mutation, Genetic Drift, and Gene Flow.\nNot only is there not one single piece of evidence ever produced that supports the idea that evolution by natural selection is sufficient to explain the observed genetic differences between one species and another, there is not one single hypothetical argument or explanation in defense of evolution by natural selection that is capable of standing up to the combination of math, logic, and the available scientific evidence.\nIf you rejected religion on the basis of mechanistic materialism, you abandoned the faith of your fathers for an obvious untruth. Darwin was not only a false intellectual god, he was a false and retarded one.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "evolution",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-02T11:16:45+00:00"
}