{
  "url": "https://voxday.net/2025/01/28/an-intrinsically-uncompetitive-society/",
  "scraped_at": "2026-01-08T19:36:58.040030",
  "title": "An Intrinsically Uncompetitive Society",
  "date_display": "January 28, 2025",
  "date_iso": "2025-01-28T12:40:24+00:00",
  "date_from_url": "2025-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The cost of having your society run by nepotistic foreign socio-cultural parasites is <a href=\"https://www.anonymousconservative.com/blog/news-briefs-01-27-2025/\">the inevitable loss of competitiveness.</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It is not surprising really. I am an innovative psychology. You can see how I synthesize stuff here, bringing together Google Streetview and surveillance camera footage, and reveal the surveillance in America as few could. Politics and biology, psychology, I come up with interesting stuff. And when I was just a young lad, I was identified by US Domestic intelligence’s grade school monitoring units as innovative, and their response was to supply me with massive amounts of pornography to try and make me a degenerate. When that was ineffective, they decided to flood in the kids of agents, acting as kid spies to try and beat me down. When that failed, they rolled out honeypots. And when I proved resistant to it all, I believe they rolled out an early version of the Havana Weapon to degrade my health physically.</p><p>I do not think I am unique in that regard. I even think there was another kid, maybe brighter than me, and certainly more disciplined and dedicated to academics, who they also beamed into chronic illness to try and clip his wings as well. I would assume that has been going on across the nation, with every young kid who showed an innovative potential, for the last thirty to forty years, as domestic intelligence has tried to make sure nobody could rise too high in society, and maybe oppose it. My guess is, given the granularity of the surveillance, if you ever have a child with real potential, the single biggest threat they will ever face in life will be US domestic intelligence, because the American Stasi will find them, it will view them as a threat, and it will try to destroy them using all the most advanced tools of the CIA. It is just how it works in America now.</p><p>As a result, at present, the only chance America has to compete lies with the rubes and imbeciles of the insecure surveillance, and there just are not enough innovators there to keep up with nations like China.</p></blockquote><p>After six decades of fake science, fake literature, fake art, fake genuises, fake 115-average IQs, the financialization of the economy, and the moral and intellectual degradation of the workforce, it is absolutely no surprise that the USA is losing on every side to its global rivals in China and Russia. The fetishization of frauds from Charles Darwin, Albert Einstein, Saul Bellow, and Philip Roth to Jordan Peterson and Ben Shapiro, combined with the suppression and sidelining of the genuine American creative class, has been sufficient to render the USA a global also-ran.</p><p>Someone once asked: “Where is America’s Wang Hunin?” Wang, arguably the most observant individual of the 20th Century, rose from a complete nobody who wasn’t even a member of the Chinese Communist Party to the CCP’s chief ideologist solely on the basis of the merit of his prescient observations. Someone else answered: “Living in Europe making comic books.” And while I’m not the equal of Wang Hunin, who saw things 20 years before I did despite being only 13 years older than me, the difference between the way he was embraced and elevated by the Chinese political elite versus the way I was explicitly banished from even the editorial pages at the age of 23 by the US political elite is telling.</p><p>The irony is that I’ve been treated with far more respect by the Chinese and Russian state medias than by the ostensibly private medias in the USA and Europe. <em>Pravda </em>used to occasionally run the very syndicated Universal Press column that the newspapers in the USA refused to touch, back when I was warning everyone about the coming financial crisis in 2002. Note that I’m not at all bitter. I caught enough of a glimpse into the US political elite at a young age that I wanted nothing to do with it and I’m quite content with having been sidelined. I like what I’m doing and I harbor zero desire to get involved with The Great Game. But that doesn’t change the effect the sidelining of me and others more talented than me have inevitably had for the last six decades.</p><p>So now we have corrupt second-generation mediocrities like Donald Kagan and complete frauds like Elon Musk establishing US geopolitical strategies instead of anyone setting them in the national interests of the American people. As long as we do, China’s triumph is absolutely 100-percent certain no matter what economic or demographic vagaries it might be facing. It’s like seeing one NFL team building a historic staff with Ron Wolf at GM, Bill Belichick as head coach and Andy Reid as the offensive coordinator and the other being run by the historically awful combination of GM Matt Millen, head coach Marty Mornhinweg, and the immortal Brad Childress not calling plays as the offensive coordinator.</p><p>The truth always and inevitably wins out over time because the longer the parasitical pretenders have influence in a society, the further from objective reality their policies will reliably guide it. It’s not an accident that everything across the West from AI to zoology has become fake and gay, because convergence toward entropy is the objective. The latest iteration of The Empire That Never Ended will fall again, because it celebrates falsehood and worships evil.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-66207\" decoding=\"async\" fetchpriority=\"high\" height=\"498\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/01/image-39.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/01/image-39.png 512w, https://voxday.net/wp-content/uploads/2025/01/image-39-300x292.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/d3a5367f-2632-4288-8ed8-786245b6d424\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The cost of having your society run by nepotistic foreign socio-cultural parasites is\nthe inevitable loss of competitiveness.\nIt is not surprising really. I am an innovative psychology. You can see how I synthesize stuff here, bringing together Google Streetview and surveillance camera footage, and reveal the surveillance in America as few could. Politics and biology, psychology, I come up with interesting stuff. And when I was just a young lad, I was identified by US Domestic intelligence’s grade school monitoring units as innovative, and their response was to supply me with massive amounts of pornography to try and make me a degenerate. When that was ineffective, they decided to flood in the kids of agents, acting as kid spies to try and beat me down. When that failed, they rolled out honeypots. And when I proved resistant to it all, I believe they rolled out an early version of the Havana Weapon to degrade my health physically.\nI do not think I am unique in that regard. I even think there was another kid, maybe brighter than me, and certainly more disciplined and dedicated to academics, who they also beamed into chronic illness to try and clip his wings as well. I would assume that has been going on across the nation, with every young kid who showed an innovative potential, for the last thirty to forty years, as domestic intelligence has tried to make sure nobody could rise too high in society, and maybe oppose it. My guess is, given the granularity of the surveillance, if you ever have a child with real potential, the single biggest threat they will ever face in life will be US domestic intelligence, because the American Stasi will find them, it will view them as a threat, and it will try to destroy them using all the most advanced tools of the CIA. It is just how it works in America now.\nAs a result, at present, the only chance America has to compete lies with the rubes and imbeciles of the insecure surveillance, and there just are not enough innovators there to keep up with nations like China.\nAfter six decades of fake science, fake literature, fake art, fake genuises, fake 115-average IQs, the financialization of the economy, and the moral and intellectual degradation of the workforce, it is absolutely no surprise that the USA is losing on every side to its global rivals in China and Russia. The fetishization of frauds from Charles Darwin, Albert Einstein, Saul Bellow, and Philip Roth to Jordan Peterson and Ben Shapiro, combined with the suppression and sidelining of the genuine American creative class, has been sufficient to render the USA a global also-ran.\nSomeone once asked: “Where is America’s Wang Hunin?” Wang, arguably the most observant individual of the 20th Century, rose from a complete nobody who wasn’t even a member of the Chinese Communist Party to the CCP’s chief ideologist solely on the basis of the merit of his prescient observations. Someone else answered: “Living in Europe making comic books.” And while I’m not the equal of Wang Hunin, who saw things 20 years before I did despite being only 13 years older than me, the difference between the way he was embraced and elevated by the Chinese political elite versus the way I was explicitly banished from even the editorial pages at the age of 23 by the US political elite is telling.\nThe irony is that I’ve been treated with far more respect by the Chinese and Russian state medias than by the ostensibly private medias in the USA and Europe.\nPravda\nused to occasionally run the very syndicated Universal Press column that the newspapers in the USA refused to touch, back when I was warning everyone about the coming financial crisis in 2002. Note that I’m not at all bitter. I caught enough of a glimpse into the US political elite at a young age that I wanted nothing to do with it and I’m quite content with having been sidelined. I like what I’m doing and I harbor zero desire to get involved with The Great Game. But that doesn’t change the effect the sidelining of me and others more talented than me have inevitably had for the last six decades.\nSo now we have corrupt second-generation mediocrities like Donald Kagan and complete frauds like Elon Musk establishing US geopolitical strategies instead of anyone setting them in the national interests of the American people. As long as we do, China’s triumph is absolutely 100-percent certain no matter what economic or demographic vagaries it might be facing. It’s like seeing one NFL team building a historic staff with Ron Wolf at GM, Bill Belichick as head coach and Andy Reid as the offensive coordinator and the other being run by the historically awful combination of GM Matt Millen, head coach Marty Mornhinweg, and the immortal Brad Childress not calling plays as the offensive coordinator.\nThe truth always and inevitably wins out over time because the longer the parasitical pretenders have influence in a society, the further from objective reality their policies will reliably guide it. It’s not an accident that everything across the West from AI to zoology has become fake and gay, because convergence toward entropy is the objective. The latest iteration of The Empire That Never Ended will fall again, because it celebrates falsehood and worships evil.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "conspiracy",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-28T12:43:33+00:00"
}