{
  "url": "https://voxday.net/2025/01/22/arkhaven-the-legend-and-levon-cade/",
  "scraped_at": "2026-01-08T19:36:14.825302",
  "title": "Arkhaven, The Legend, and Levon Cade",
  "date_display": "January 22, 2025",
  "date_iso": "2025-01-22T14:10:58+00:00",
  "date_from_url": "2025-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fandom Pulse has an exclusive <a href=\"https://fandompulse.substack.com/p/exclusive-chuck-dixon-to-produce\">on Arkhaven Comics and Chuck Dixon</a> getting the crew back together to turn <em>Levon’s Trade</em>, aka <em>A Working Man</em> starring Jason Statham, into a graphic novel.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Chuck Dixon wowed the world in early January when the trailer or <em>A Working Man</em> dropped, a new film based on his Levon Cade novels. Now, he’s partnering with Arkhaven Comics to adapt the first novel, <em>Levon’s Trade</em> into a graphic novel.</p><p>While Chuck Dixon is well known for his comic book work as a legendary creator of Bane in the <em>Batman </em>lore, and as one of if not the most prolific writers of all time, until Jasom Statham was announced as Levon Cade for the new film, A Working Man, many didn’t know that Dixon was also an accomplished novelist with several works, including a twelve-book series with Levon Cade.</p><p>The first book, Levon’s Trade <a href=\"https://amzn.to/40HK7Uu\">boasts a 4.4 star average rating on Amazon with more than 700 reviews</a>, a very popular installment for the author. <a href=\"https://educationforensics.substack.com/p/levons-want\">A new review by Douglas Marolla</a> calls the series “great” and highlights the character work Dixon put into not only Cade, but several of the supporting characters.</p><p><em>A Working Man </em>has so much buzz already that comedians are incorporating the film into their routines, with poignant commentary on Jason Statham’s past roles combined with this one.</p></blockquote><p>Arkhaven will announce a crowdfunding campaign for this and another much-anticipated Chuck Dixon project, but not until after the standard <em>Hypergamouse </em>books ship out to the backers.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-66119\" decoding=\"async\" fetchpriority=\"high\" height=\"191\" sizes=\"(max-width: 420px) 100vw, 420px\" src=\"https://voxday.net/wp-content/uploads/2025/01/image-31.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/01/image-31.png 420w, https://voxday.net/wp-content/uploads/2025/01/image-31-300x136.png 300w\" width=\"420\"><figcaption class=\"wp-element-caption\"><em>A working man’s life is often hard.</em></figcaption></img></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/ffb07368-5f64-4743-bc95-a1c5af4cd87b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fandom Pulse has an exclusive\non Arkhaven Comics and Chuck Dixon\ngetting the crew back together to turn\nLevon’s Trade\n, aka\nA Working Man\nstarring Jason Statham, into a graphic novel.\nChuck Dixon wowed the world in early January when the trailer or\nA Working Man\ndropped, a new film based on his Levon Cade novels. Now, he’s partnering with Arkhaven Comics to adapt the first novel,\nLevon’s Trade\ninto a graphic novel.\nWhile Chuck Dixon is well known for his comic book work as a legendary creator of Bane in the\nBatman\nlore, and as one of if not the most prolific writers of all time, until Jasom Statham was announced as Levon Cade for the new film, A Working Man, many didn’t know that Dixon was also an accomplished novelist with several works, including a twelve-book series with Levon Cade.\nThe first book, Levon’s Trade\nboasts a 4.4 star average rating on Amazon with more than 700 reviews\n, a very popular installment for the author.\nA new review by Douglas Marolla\ncalls the series “great” and highlights the character work Dixon put into not only Cade, but several of the supporting characters.\nA Working Man\nhas so much buzz already that comedians are incorporating the film into their routines, with poignant commentary on Jason Statham’s past roles combined with this one.\nArkhaven will announce a crowdfunding campaign for this and another much-anticipated Chuck Dixon project, but not until after the standard\nHypergamouse\nbooks ship out to the backers.\nA working man’s life is often hard.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "comics",
    "Fandom Pulse",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-22T14:11:01+00:00"
}