{
  "url": "https://voxday.net/2025/01/21/beginning-with-a-bang/",
  "scraped_at": "2026-01-08T19:36:08.642574",
  "title": "Beginning with a Bang",
  "date_display": "January 21, 2025",
  "date_iso": "2025-01-21T09:06:18+00:00",
  "date_from_url": "2025-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dark Herald has taken his talents <a href=\"https://arkhaven.substack.com/p/book-discussion-nights-master-by\">to the Arkhaven substack</a>, and he’s gotten off to a blistering start with a comparison of Neil Gaiman’s derivative work to the woman from whose work he derived it:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>One is the real deal and the other is a cheap knockoff of the original. </p><p>There is a Swiss Rolex and there is a Bangkok Rolex. There is Classic Coke and there is Sam’s Cola.  There is the Mona Lisa in the Louvre and the one on Cousin Jimbo’s velvet blanket.</p><p>There is Tannith Lee and there is Neil Gaiman. </p><p>This has become vastly apparent to me this weekend while reading Night’s Master. It’s a funny thing about writers, we all have that one writer that made us want to write for a living.  While learning the craft we discover our strengths and limitations.  Some of us will eventually discover that we have surpassed our masters.  In bitter truth, most of us will discover that we can’t due to the limitations of our innate talents but those who face this unpleasant realization do not resent the writer who inspired us. </p><p>Mostly. </p><p>Gamma males, on the other hand, live in a world blanketed by their resentments and can never bring themselves to give credit where it’s due. It’s too painful a truth to acknowledge.  <em>How can I be the secret king when there is all too obviously a real king? </em>John Scalzi has never given credit to Joe Haldeman for his influence on his early work, although it’s clearly there. Neil Gaiman’s disdain for Tanith Lee went all the way back to when he was doing literary reviews. By Lee’s account, (which I will take over Gaiman’s in a heartbeat), he was pleasant, fawning and even obsequious during his interview of her for the Guardian.  When he published his interview, Lee discovered that Gaiman had described her as “formerly attractive.”</p></blockquote><p>On top of which, reportedly and according to Lee’s belief, he directly plagiarized entire paragraphs from her. I haven’t seen the direct evidence of the truth of the plagiarism yet, but I suspect that between the Dark Herald and me, we should be able to find it if, in fact, it exists. While I’m very familiar with the various tales of the Flat Earth, including the Secret Books of Paradys, which I own and have read repeatedly, and also own her Secret Books of Venus series, I’d never read a single Neil Gaiman work until after we launched Arkhaven and I was encouraged to read Sandman.</p><p>Which, you may recall from the streams I was doing at the time, struck me immediately as mediocre and derivative, as well as more than a little off-putting.</p><p>Anyhow, it’s no surprise that the Dark Herald is off to an excellent start at the Arkhaven substack. He’ll be blogging there henceforth, so if you’re accustomed to reading him at the store site, I’d encourage you to sign up for a free subscription there.</p><p>In other Arkhaven news, we received the test print of JDA’s <em>Overmind</em> omnibus from the new printer this weekend. The quality of the color printing is excellent, indeed, one could quite credibly say superlative. We’re placing an order for the initial print run of 75 leatherbound copies, so there will be a few extras available for sale when they’re ready. The <em>Hypergamouse</em> printing will soon follow. And two additional bonuses; the leatherbound comics will be sewn, and somewhat to my surprise, color edge printed.</p><p><a href=\"https://socialgalactic.com/micropost/6c34d49b-1b6e-4839-a22f-2388da5373fe\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "The Dark Herald has taken his talents\nto the Arkhaven substack\n, and he’s gotten off to a blistering start with a comparison of Neil Gaiman’s derivative work to the woman from whose work he derived it:\nOne is the real deal and the other is a cheap knockoff of the original.\nThere is a Swiss Rolex and there is a Bangkok Rolex. There is Classic Coke and there is Sam’s Cola.  There is the Mona Lisa in the Louvre and the one on Cousin Jimbo’s velvet blanket.\nThere is Tannith Lee and there is Neil Gaiman.\nThis has become vastly apparent to me this weekend while reading Night’s Master. It’s a funny thing about writers, we all have that one writer that made us want to write for a living.  While learning the craft we discover our strengths and limitations.  Some of us will eventually discover that we have surpassed our masters.  In bitter truth, most of us will discover that we can’t due to the limitations of our innate talents but those who face this unpleasant realization do not resent the writer who inspired us.\nMostly.\nGamma males, on the other hand, live in a world blanketed by their resentments and can never bring themselves to give credit where it’s due. It’s too painful a truth to acknowledge.\nHow can I be the secret king when there is all too obviously a real king?\nJohn Scalzi has never given credit to Joe Haldeman for his influence on his early work, although it’s clearly there. Neil Gaiman’s disdain for Tanith Lee went all the way back to when he was doing literary reviews. By Lee’s account, (which I will take over Gaiman’s in a heartbeat), he was pleasant, fawning and even obsequious during his interview of her for the Guardian.  When he published his interview, Lee discovered that Gaiman had described her as “formerly attractive.”\nOn top of which, reportedly and according to Lee’s belief, he directly plagiarized entire paragraphs from her. I haven’t seen the direct evidence of the truth of the plagiarism yet, but I suspect that between the Dark Herald and me, we should be able to find it if, in fact, it exists. While I’m very familiar with the various tales of the Flat Earth, including the Secret Books of Paradys, which I own and have read repeatedly, and also own her Secret Books of Venus series, I’d never read a single Neil Gaiman work until after we launched Arkhaven and I was encouraged to read Sandman.\nWhich, you may recall from the streams I was doing at the time, struck me immediately as mediocre and derivative, as well as more than a little off-putting.\nAnyhow, it’s no surprise that the Dark Herald is off to an excellent start at the Arkhaven substack. He’ll be blogging there henceforth, so if you’re accustomed to reading him at the store site, I’d encourage you to sign up for a free subscription there.\nIn other Arkhaven news, we received the test print of JDA’s\nOvermind\nomnibus from the new printer this weekend. The quality of the color printing is excellent, indeed, one could quite credibly say superlative. We’re placing an order for the initial print run of 75 leatherbound copies, so there will be a few extras available for sale when they’re ready. The\nHypergamouse\nprinting will soon follow. And two additional bonuses; the leatherbound comics will be sewn, and somewhat to my surprise, color edge printed.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "Book Review",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-21T13:32:52+00:00"
}