{
  "url": "https://voxday.net/2025/01/15/calling-out-the-publishers/",
  "scraped_at": "2026-01-08T19:35:26.030681",
  "title": "Calling Out the Publishers",
  "date_display": "January 15, 2025",
  "date_iso": "2025-01-15T11:30:08+00:00",
  "date_from_url": "2025-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A <em>New York Times</em> article about Neil Gaiman’s first public response to his accusers draws some much-needed attention <a href=\"https://archive.is/CH1bd#selection-923.0-923.246\">to the non-response</a> from his various publishers:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>HarperCollins, which has published many of his most notable works, and Marvel, the comic book publisher, have no new books forthcoming with Gaiman, according to representatives from the companies.</p><p>His literary agent at Writers House, which represents blockbuster authors like Dav Pilkey, Nora Roberts and Ally Condie, did not respond to requests for comment about whether the agency would continue to represent him. Norton, which published an illustrated edition of Gaiman’s “Norse Mythology” last November, did not respond when asked whether the company would publish Gaiman’s works in the future. DC Comics, which published his blockbuster comic book “The Sandman,” along with other works, declined to comment when asked whether DC would continue to publish him.</p><p>For some of the women who have accused Gaiman of misconduct, the muted responses from his publishers and collaborators are a bitter disappointment…</p><p>In an interview with The Times, Kendall described the “culture of secrecy” around Gaiman. “Neil’s works were his bait, and promotional events were his hunting ground,” she said. “As long as his publishers and professional collaborators remain silent, Neil will continue to have unrestricted access to vulnerable women.”</p><p>“The silence of the community around him — his fandom, his publishers — is loud and disturbing,” Stout said in an interview with The Times. “I’ve heard that it was an open secret that he was a predator, but that whisper network did not reach me.”</p></blockquote><p>I think it is unfair, unreasonable, and wrong for anyone to fault the bookshops for ordering books that their customers come in and request. The books are published, they are in the system, and the whole purpose of the bookstore is to satisfy their customer’s preferences. And as one executive at a very large book distributor once told an SJW employee who was complaining that they were distributing Milo Yiannopoulos’s books: “seeing how we carry 50 different editions of <em>Mein Kampf</em>, where do you propose we draw the line? We’re a distributor, we’re not the Book Police.”</p><p>However, it is absolutely fair, reasonable, and correct for people to be holding the book publishers accountable. The publishers make it very clear that they stand for certain principles and oppose other principles; unlike Castalia, most of them even have mission statements that they claim defines their very purpose. And precisely none of those statements are in line with publishing an author who is quite credibly accused of having committed a series of rapes and sexual assaults over a period of more than 25 years.</p><p>When publishers are deplatforming and refusing to publish authors whose politics they don’t like, they really have absolutely no room for continuing to publish serial sexual assailants and sexual harassers simply because they approve of their politics. This isn’t something that is simply going to blow over and go away because the alleged crimes are too serious and the hypocrisy is too blatant.</p><p>We’ll be holding an early Arkhaven Nights tonight to discuss both the latest developments in #GaimanGate and the bankruptcy of Diamond, the comics distributor.</p><p><em><a href=\"https://socialgalactic.com/micropost/fc640db6-b0ba-41b1-9843-9da588e78e00\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A\nNew York Times\narticle about Neil Gaiman’s first public response to his accusers draws some much-needed attention\nto the non-response\nfrom his various publishers:\nHarperCollins, which has published many of his most notable works, and Marvel, the comic book publisher, have no new books forthcoming with Gaiman, according to representatives from the companies.\nHis literary agent at Writers House, which represents blockbuster authors like Dav Pilkey, Nora Roberts and Ally Condie, did not respond to requests for comment about whether the agency would continue to represent him. Norton, which published an illustrated edition of Gaiman’s “Norse Mythology” last November, did not respond when asked whether the company would publish Gaiman’s works in the future. DC Comics, which published his blockbuster comic book “The Sandman,” along with other works, declined to comment when asked whether DC would continue to publish him.\nFor some of the women who have accused Gaiman of misconduct, the muted responses from his publishers and collaborators are a bitter disappointment…\nIn an interview with The Times, Kendall described the “culture of secrecy” around Gaiman. “Neil’s works were his bait, and promotional events were his hunting ground,” she said. “As long as his publishers and professional collaborators remain silent, Neil will continue to have unrestricted access to vulnerable women.”\n“The silence of the community around him — his fandom, his publishers — is loud and disturbing,” Stout said in an interview with The Times. “I’ve heard that it was an open secret that he was a predator, but that whisper network did not reach me.”\nI think it is unfair, unreasonable, and wrong for anyone to fault the bookshops for ordering books that their customers come in and request. The books are published, they are in the system, and the whole purpose of the bookstore is to satisfy their customer’s preferences. And as one executive at a very large book distributor once told an SJW employee who was complaining that they were distributing Milo Yiannopoulos’s books: “seeing how we carry 50 different editions of\nMein Kampf\n, where do you propose we draw the line? We’re a distributor, we’re not the Book Police.”\nHowever, it is absolutely fair, reasonable, and correct for people to be holding the book publishers accountable. The publishers make it very clear that they stand for certain principles and oppose other principles; unlike Castalia, most of them even have mission statements that they claim defines their very purpose. And precisely none of those statements are in line with publishing an author who is quite credibly accused of having committed a series of rapes and sexual assaults over a period of more than 25 years.\nWhen publishers are deplatforming and refusing to publish authors whose politics they don’t like, they really have absolutely no room for continuing to publish serial sexual assailants and sexual harassers simply because they approve of their politics. This isn’t something that is simply going to blow over and go away because the alleged crimes are too serious and the hypocrisy is too blatant.\nWe’ll be holding an early Arkhaven Nights tonight to discuss both the latest developments in #GaimanGate and the bankruptcy of Diamond, the comics distributor.\nDISCUSS ON SG",
  "tags": [
    "#GaimanGate",
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-15T14:48:55+00:00"
}