{
  "url": "https://voxday.net/2025/01/16/considerable-disdain-for-him/",
  "scraped_at": "2026-01-08T19:35:31.604043",
  "title": "“Considerable Disdain for Him”",
  "date_display": "January 16, 2025",
  "date_iso": "2025-01-16T09:30:11+00:00",
  "date_from_url": "2025-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am, and have been for decades, a fan of Tanith Lee. I absolutely adore Tanith Lee. Her tales of Paradys and the Flat Earth are solidly entrenched in my top ten fantasy series, and while I wasn’t unaware that her work was a major stylistic influence on Neil Gaiman, due to what I observed to be his unoriginal mediocrity, I simply wasn’t well-read enough in Gaiman’s work to realize that Gaiman wasn’t just heavily influenced by Tanith Lee, he appears to have done little more than steal her characters and world-building without attribution in lieu of creating anything himself, <a href=\"https://www.facebook.com/matthew.boroson/posts/pfbid0yReZ19YkqoD28JR5k3pkFq28ZJCoM4YcBwjsF1zXwdCSDRvFNRvmv1ax3m7i9e8Xl\">as one fan of Lee’s noted</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Neil Gaiman’s THE SANDMAN is a great comic book series. Gaiman modeled his series on Tanith Lee’s TALES FROM THE FLAT EARTH. But you wouldn’t know this, because Gaiman has never given her any credit. Despite the fact that the main character — a byronic, pale, otherworldly, deity-like character — is the prince of night and dreams. Despite the fact that every time people see art depicting Tanith Lee’s main character Azhrarn, they think it’s Morpheus from the Sandman. (How bad is this? When people see depictions of her character, they say SHE must have ripped HIM off.)</p><p>Despite the fact that the dream lord’s younger sibling is Death.</p><p>Despite the fact that other members of his family include Delusion, Delirium…. They are not gods but beings older than gods, and when the gods die, Dream, Death, Delusion, and Delirium will remain. This family of immortal, eternal, unchanging beings, who each embody an eternal abstraction starting with the letter D.</p><p>Someone else on the internet, noticing the similarities, flipped open the third book in Tanith Lee’s series to a random page, and lo and behold, there’s a description of a character who was clearly the inspiration for Gaiman’s Mazikeen. The prose, the characters, the narrative strategies, the mythology, the story structure, all of it: Gaiman found it all in Tanith Lee‘s writing and never gave her any credit.</p><p>He became rich and famous profiting from her ideas. People effused over his amazing imagination, when the ideas they praised him for were actually created by Tanith Lee. And, while he was building his name and fame, she was struggling. In the 1990s, toward the end of her life, she complained in an interview that magazines weren’t buying her stories anymore.</p><p>A simple “If you like The Sandman, you should really read Tanith Lee’s books!” from Neil Gaiman would have meant so much to her career. To the livelihood of a struggling, less-privileged writer, whose amazing imagination Gaiman was actively ripping off. People praised The Sandman comics for their depiction of gay and trans identities. But in the original material, Tanith Lee was far more progressive about lgbtq+ identities, and that was twenty years earlier.</p><p>I first read Tanith Lee’s book NIGHT’S MASTER (the first in the FLAT EARTH series) in maybe 2005, about 10 years after first reading The Sandman. I looked to see if Gaiman had credited her for “his” ideas; as far as I could tell, he never had. And for the subsequent 19 years, whenever I see a new Neil Gaiman interview, the first thing I do is ctrl-F to search to see if he mentioned Tanith Lee. And he never has, that I’ve seen.</p><p>I have no difficulty believing the accusations against him.</p><p>Because I know — KNOW — that he has felt entitled to take what he wants from a woman, without her permission, and without any acknowledgement of her contributions.</p><p>And, finally: If you loved Neil Gaiman’s stories, if you are heartbroken to learn the storyteller you loved is apparently an abuser, here is my suggestion: track down Tanith Lee’s TALES FROM THE FLAT EARTH books. Her prose is more exquisite and imaginative, her ideas more original, her empathy real.</p></blockquote><p>Not only that, but a personal acquaintance of Lee, Liz Williams, points out that Lee herself believed Gaiman plagiarised her work and had “considerable disdain for him.”</p><p><em>Tanith was my friend, as many writers in the UK will attest, especially on the south coast. I did know this, because she told me. We were at a convention – IIRC Orbital 8, in 2008 – at which both Neil and Tanith were guests. She told me that she was trying to avoid him because he’d plagiarised a large chunk of her work: not just a bit, but entire paragraphs. She didn’t say which book it was from. And she had considerable disdain for him.</em></p><p>A well-read reader on r/neilgaimanuncovered <a href=\"https://www.reddit.com/r/neilgaimanuncovered/comments/1i2alsv/comment/m7czrts/\">confirmed the charge.</a></p><p><em>He basically stole Sandman from Tanith Lee’s “Tales of the Flat Earth“ and his “Snow, Glass, Apples” from her “Red as Blood” with zero credit whatsoever, never even a recommendation that others read her work (a major sign of insecurity and guilt, right there). He also stole Coraline from Clive Barker’s ”The Thief of Always.” He’s a fraud as well as a monster.</em></p><p>I never read <em>Snow, Glass Apples </em>but I do recall thinking its description sounded an awful lot like <em>Red as Blood</em>. All of his revised fairy tale stories struck me as very similar to Lee’s <em>White as Snow</em>, but again, I never bothered reading any of Gaiman’s short stories until very recently. And since I’ve never read <em>Coraline</em> or anything by Clive Barker, I wasn’t aware of the relationship between those two works either.</p><p>But it is very satisfying to see the literary world finally coming out and telling the public the obvious truth about Neil Gaiman’s mediocrity and total lack of creativity. He’s never been a great writer, he’s never been a great storyteller, he is instead, as Terry Pratchett suggested, “an incredible actor” playing the role of a great storyteller. In my opinion, these charges of stealing without attribution and plagiarism tend to further support my hypothesis that “Neil Gaiman, Bestselling Author” was a literary fraud manufactured by the much the same people who made L. Ron Hubbard a bestselling author.</p><p>The conclusion appears to be as apt as it is succinct. <em>“He’s a fraud as well as a monster.”</em></p><p>So finally, we have the answer that <a href=\"https://preview.redd.it/terry-pratchett-knew-v0-gp5o2ndeo4td1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=c66bb83720f6d5e74c8719994e716ddec7746070\">we’ve suspected for months</a>. Robert Rankin indicates that Terry Pratchett had more than an inkling that his <em>Good Omens</em> co-writer and supposed good friend was not “a very nice, approachable guy” but an actor hiding his true self.</p><p><em>“Terry told me he wished he’d never worked with him, but I never found out why.”</em></p><p><em><a href=\"https://socialgalactic.com/micropost/342f6641-fe92-4c4b-b27a-b77b59bffd2d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I am, and have been for decades, a fan of Tanith Lee. I absolutely adore Tanith Lee. Her tales of Paradys and the Flat Earth are solidly entrenched in my top ten fantasy series, and while I wasn’t unaware that her work was a major stylistic influence on Neil Gaiman, due to what I observed to be his unoriginal mediocrity, I simply wasn’t well-read enough in Gaiman’s work to realize that Gaiman wasn’t just heavily influenced by Tanith Lee, he appears to have done little more than steal her characters and world-building without attribution in lieu of creating anything himself,\nas one fan of Lee’s noted\n:\nNeil Gaiman’s THE SANDMAN is a great comic book series. Gaiman modeled his series on Tanith Lee’s TALES FROM THE FLAT EARTH. But you wouldn’t know this, because Gaiman has never given her any credit. Despite the fact that the main character — a byronic, pale, otherworldly, deity-like character — is the prince of night and dreams. Despite the fact that every time people see art depicting Tanith Lee’s main character Azhrarn, they think it’s Morpheus from the Sandman. (How bad is this? When people see depictions of her character, they say SHE must have ripped HIM off.)\nDespite the fact that the dream lord’s younger sibling is Death.\nDespite the fact that other members of his family include Delusion, Delirium…. They are not gods but beings older than gods, and when the gods die, Dream, Death, Delusion, and Delirium will remain. This family of immortal, eternal, unchanging beings, who each embody an eternal abstraction starting with the letter D.\nSomeone else on the internet, noticing the similarities, flipped open the third book in Tanith Lee’s series to a random page, and lo and behold, there’s a description of a character who was clearly the inspiration for Gaiman’s Mazikeen. The prose, the characters, the narrative strategies, the mythology, the story structure, all of it: Gaiman found it all in Tanith Lee‘s writing and never gave her any credit.\nHe became rich and famous profiting from her ideas. People effused over his amazing imagination, when the ideas they praised him for were actually created by Tanith Lee. And, while he was building his name and fame, she was struggling. In the 1990s, toward the end of her life, she complained in an interview that magazines weren’t buying her stories anymore.\nA simple “If you like The Sandman, you should really read Tanith Lee’s books!” from Neil Gaiman would have meant so much to her career. To the livelihood of a struggling, less-privileged writer, whose amazing imagination Gaiman was actively ripping off. People praised The Sandman comics for their depiction of gay and trans identities. But in the original material, Tanith Lee was far more progressive about lgbtq+ identities, and that was twenty years earlier.\nI first read Tanith Lee’s book NIGHT’S MASTER (the first in the FLAT EARTH series) in maybe 2005, about 10 years after first reading The Sandman. I looked to see if Gaiman had credited her for “his” ideas; as far as I could tell, he never had. And for the subsequent 19 years, whenever I see a new Neil Gaiman interview, the first thing I do is ctrl-F to search to see if he mentioned Tanith Lee. And he never has, that I’ve seen.\nI have no difficulty believing the accusations against him.\nBecause I know — KNOW — that he has felt entitled to take what he wants from a woman, without her permission, and without any acknowledgement of her contributions.\nAnd, finally: If you loved Neil Gaiman’s stories, if you are heartbroken to learn the storyteller you loved is apparently an abuser, here is my suggestion: track down Tanith Lee’s TALES FROM THE FLAT EARTH books. Her prose is more exquisite and imaginative, her ideas more original, her empathy real.\nNot only that, but a personal acquaintance of Lee, Liz Williams, points out that Lee herself believed Gaiman plagiarised her work and had “considerable disdain for him.”\nTanith was my friend, as many writers in the UK will attest, especially on the south coast. I did know this, because she told me. We were at a convention – IIRC Orbital 8, in 2008 – at which both Neil and Tanith were guests. She told me that she was trying to avoid him because he’d plagiarised a large chunk of her work: not just a bit, but entire paragraphs. She didn’t say which book it was from. And she had considerable disdain for him.\nA well-read reader on r/neilgaimanuncovered\nconfirmed the charge.\nHe basically stole Sandman from Tanith Lee’s “Tales of the Flat Earth“ and his “Snow, Glass, Apples” from her “Red as Blood” with zero credit whatsoever, never even a recommendation that others read her work (a major sign of insecurity and guilt, right there). He also stole Coraline from Clive Barker’s ”The Thief of Always.” He’s a fraud as well as a monster.\nI never read\nSnow, Glass Apples\nbut I do recall thinking its description sounded an awful lot like\nRed as Blood\n. All of his revised fairy tale stories struck me as very similar to Lee’s\nWhite as Snow\n, but again, I never bothered reading any of Gaiman’s short stories until very recently. And since I’ve never read\nCoraline\nor anything by Clive Barker, I wasn’t aware of the relationship between those two works either.\nBut it is very satisfying to see the literary world finally coming out and telling the public the obvious truth about Neil Gaiman’s mediocrity and total lack of creativity. He’s never been a great writer, he’s never been a great storyteller, he is instead, as Terry Pratchett suggested, “an incredible actor” playing the role of a great storyteller. In my opinion, these charges of stealing without attribution and plagiarism tend to further support my hypothesis that “Neil Gaiman, Bestselling Author” was a literary fraud manufactured by the much the same people who made L. Ron Hubbard a bestselling author.\nThe conclusion appears to be as apt as it is succinct.\n“He’s a fraud as well as a monster.”\nSo finally, we have the answer that\nwe’ve suspected for months\n. Robert Rankin indicates that Terry Pratchett had more than an inkling that his\nGood Omens\nco-writer and supposed good friend was not “a very nice, approachable guy” but an actor hiding his true self.\n“Terry told me he wished he’d never worked with him, but I never found out why.”\nDISCUSS ON SG",
  "tags": [
    "#GaimanGate",
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-16T09:46:15+00:00"
}