{
  "url": "https://voxday.net/2025/01/12/denmark-turns-to-russia/",
  "scraped_at": "2026-01-08T19:35:09.541226",
  "title": "Denmark Turns to Russia",
  "date_display": "January 12, 2025",
  "date_iso": "2025-01-12T14:39:30+00:00",
  "date_from_url": "2025-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fake Trump’s bizarre rantings about acquiring Greenland has sufficiently scared the Danes to the point that some of their politicians <a href=\"https://smoothiex12.blogspot.com/2025/01/no-or-rather-hell-no.html\">want to seek Russian assistance</a> in defending their territory.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Danish parliament is discussing the possibility of asking Russia for help in the event of aggressive actions by the United States towards Greenland. MP from the Socialist People’s Party Karsten Henge expressed confidence in the need for such measures. “In a situation of extreme escalation and tension, we need to take extreme measures and ask Russia for help to solve this problem. I am sure that our request will be heard, because Russia will not allow Greenland to become part of the United States. It is as disadvantageous for Russia as it is for us,” MK.RU reports him as saying. However, Henge did not specify how Russia could protect Greenland from American influence.</p></blockquote><p>All of this talk of North American Union with Canada and Mexico, and acquiring Greenland by finance or by force, is nothing more than Clown World theater. First, I don’t think the short Trump at Mar-al-Lago is the real Donald Trump, he’s the body double being used by Clown World to try to negotiate a deal with the forces behind the real Trump. Second, all of the talk about merging with Canada and Mexico is part of the same NAU-NAFTA madness that was pushed hard by the Bush-Clinton regime before the neocons took control and shifted the US focus toward establishing Greater Israel. It’s a longstanding Clown World project, so either a) Donald Trump has completely betrayed both America and his base or b) the Trump who is advocating it is not the real Donald Trump.</p><p>The fact that the media keeps quoting the fake Trump’s absurdities and does so in mostly favorable terms is the best indication, other than the obvious height issue, that he isn’t the real Donald Trump. The whole point of noticing anomalies is that there should not be any anomalies. Nor is the fake Trump alone; in addition to the six Bidens, the “Hillary Clinton” who received a medal from one of the Bidens quite obviously wasn’t the real Hillary; she was too young, too healthy, and insufficiently overweight to be the real individual.</p><p>I understand that it’s very hard to accept that everything that is presented to you by the mainstream Narrative is false, but you have to learn to trust the evidence of your eyes. Don’t take my word for it, just take a close look for yourself and pay attention to the details. If <em>every single detail</em> is not correct, then you can be certain that things are not what they are publicly reported to be.</p><p>As for what’s actually going on with regards to Greenland, Occam’s Razor suggests that Clown World is trying to establish a bargaining chip that it can trade Putin in order to convince him to accept a deal where Russia establishes a new border that leaves Odessa with Ukraine. It’s not going to work, but it is an original and creative effort to substitute for the fact that Clown World has nothing else to trade because the Kursk invasion failed and Russia has already taken most of what it wanted in the first place.</p><p>And if Andrei Martynov is any guide, the Russians will not lift a finger to defend the Danes or anyone else in Europe.</p><p><em><a href=\"https://socialgalactic.com/micropost/20583d96-e051-4554-8b9a-874daa968932\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The fake Trump’s bizarre rantings about acquiring Greenland has sufficiently scared the Danes to the point that some of their politicians\nwant to seek Russian assistance\nin defending their territory.\nThe Danish parliament is discussing the possibility of asking Russia for help in the event of aggressive actions by the United States towards Greenland. MP from the Socialist People’s Party Karsten Henge expressed confidence in the need for such measures. “In a situation of extreme escalation and tension, we need to take extreme measures and ask Russia for help to solve this problem. I am sure that our request will be heard, because Russia will not allow Greenland to become part of the United States. It is as disadvantageous for Russia as it is for us,” MK.RU reports him as saying. However, Henge did not specify how Russia could protect Greenland from American influence.\nAll of this talk of North American Union with Canada and Mexico, and acquiring Greenland by finance or by force, is nothing more than Clown World theater. First, I don’t think the short Trump at Mar-al-Lago is the real Donald Trump, he’s the body double being used by Clown World to try to negotiate a deal with the forces behind the real Trump. Second, all of the talk about merging with Canada and Mexico is part of the same NAU-NAFTA madness that was pushed hard by the Bush-Clinton regime before the neocons took control and shifted the US focus toward establishing Greater Israel. It’s a longstanding Clown World project, so either a) Donald Trump has completely betrayed both America and his base or b) the Trump who is advocating it is not the real Donald Trump.\nThe fact that the media keeps quoting the fake Trump’s absurdities and does so in mostly favorable terms is the best indication, other than the obvious height issue, that he isn’t the real Donald Trump. The whole point of noticing anomalies is that there should not be any anomalies. Nor is the fake Trump alone; in addition to the six Bidens, the “Hillary Clinton” who received a medal from one of the Bidens quite obviously wasn’t the real Hillary; she was too young, too healthy, and insufficiently overweight to be the real individual.\nI understand that it’s very hard to accept that everything that is presented to you by the mainstream Narrative is false, but you have to learn to trust the evidence of your eyes. Don’t take my word for it, just take a close look for yourself and pay attention to the details. If\nevery single detail\nis not correct, then you can be certain that things are not what they are publicly reported to be.\nAs for what’s actually going on with regards to Greenland, Occam’s Razor suggests that Clown World is trying to establish a bargaining chip that it can trade Putin in order to convince him to accept a deal where Russia establishes a new border that leaves Odessa with Ukraine. It’s not going to work, but it is an original and creative effort to substitute for the fact that Clown World has nothing else to trade because the Kursk invasion failed and Russia has already taken most of what it wanted in the first place.\nAnd if Andrei Martynov is any guide, the Russians will not lift a finger to defend the Danes or anyone else in Europe.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "conspiracy",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-12T14:39:32+00:00"
}