{
  "url": "https://voxday.net/2025/01/14/neil-gaiman-doesnt-believe-all-women/",
  "scraped_at": "2026-01-08T19:35:24.193610",
  "title": "Neil Gaiman Doesn’t Believe All Women",
  "date_display": "January 14, 2025",
  "date_iso": "2025-01-14T20:28:06+00:00",
  "date_from_url": "2025-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The man accused of sexually assaulting and/or raping 8 women and counting finally breaks cover to issue a denial that directly contradicts his previous dictate to believe all women. Fandom Pulse provides <a href=\"https://fandompulse.substack.com/p/neil-gaiman-denies-sexual-abuse-allegations\">the text and the context</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Over the past many months, I have watched the stories circulating the internet about me with horror and dismay. I’ve stayed quiet until now, both out of respect for the people who were sharing their stories and out of a desire not to draw even more attention to a lot of misinformation. I’ve always tried to be a private person, and felt increasingly that social media was the wrong place to talk about important personal matters. I’ve now reached the point where I feel that I should say something.</p><p>As I read through this latest collection of accounts, there are moments I half-recognise and moments I don’t, descriptions of things that happened sitting beside things that emphatically did not happen. I’m far from a perfect person, but I have never engaged in non-consensual sexual activity with anyone. Ever.</p><p>I went back to read the messages I exchanged with the women around and following the occasions that have subsequently been reported as being abusive. These messages read now as they did when I received them – of two people enjoying entirely consensual sexual relationships and wanting to see one another again. At the time I was in those relationships, they seemed positive and happy on both sides.</p><p>And I also realise, looking through them, years later, that I could have and should have done so much better. I was emotionally unavailable while being sexually available, self-focused and not as thoughtful as I could or should have been. I was obviously careless with people’s hearts and feelings, and that’s something that I really, deeply regret. It was selfish of me. I was caught up in my own story and I ignored other people’s.</p><p>I’ve spent some months now taking a long, hard look at who I have been and how I have made people feel.</p><p>Like most of us, I’m learning, and I’m trying to do the work needed, and I know that that’s not an overnight process. I hope that with the help of good people, I’ll continue to grow. I understand that not everyone will believe me or even care what I say but I’ll be doing the work anyway, for myself, my family and the people I love. I will be doing my very best to deserve their trust, as well as the trust of my readers.</p><p>At the same time, as I reflect on my past – and as I re-review everything that actually happened as opposed to what is being alleged – I don’t accept there was any abuse. To repeat, I have never engaged in non-consensual sexual activity with anyone.</p><p>Some of the horrible stories now being told simply never happened, while others have been so distorted from what actually took place that they bear no relationship to reality. I am prepared to take responsibility for any missteps I made. I’m not willing to turn my back on the truth, and I can’t accept being described as someone I am not, and cannot and will not admit to doing things I didn’t do.</p></blockquote><p>And once more, we see conclusive evidence that Neil Gaiman is a mediocre writer of fiction. I very much hope that some of his accusers will take him to court for defamation, because his absurd statement literally stinks of evasiveness, Machiavellianism, spin, ex post facto revisionism, and lies.</p><p>Perhaps the most amusing claim is that the objectively biggest fame-whore in BOTH comics and science fiction over the last four decades has <em>“always tried to be a private person”</em>. Think about the massive scope and scale of that obvious and so easily disproven lie, think about the <em>chutzpah </em>required to conclude that your naked assertion will outweigh the literally tens of thousands of items of evidence to the contrary, and then consider the probability that he is telling the truth about anything else.</p><p>I think Reddit might actually melt down in response to this. I cannot believe either his legal team or his PR team thought this was a good idea, no matter how completely the news of his alleged crimes has broken contain.</p><p><strong>UPDATE: </strong>Even his biggest fans from the subreddit devoted to him aren’t buying this. They’re not buying ANY of it at all.</p><p><em><a href=\"https://socialgalactic.com/micropost/c72042e0-4c27-420a-8f43-9048cd58bd6e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The man accused of sexually assaulting and/or raping 8 women and counting finally breaks cover to issue a denial that directly contradicts his previous dictate to believe all women. Fandom Pulse provides\nthe text and the context\n:\nOver the past many months, I have watched the stories circulating the internet about me with horror and dismay. I’ve stayed quiet until now, both out of respect for the people who were sharing their stories and out of a desire not to draw even more attention to a lot of misinformation. I’ve always tried to be a private person, and felt increasingly that social media was the wrong place to talk about important personal matters. I’ve now reached the point where I feel that I should say something.\nAs I read through this latest collection of accounts, there are moments I half-recognise and moments I don’t, descriptions of things that happened sitting beside things that emphatically did not happen. I’m far from a perfect person, but I have never engaged in non-consensual sexual activity with anyone. Ever.\nI went back to read the messages I exchanged with the women around and following the occasions that have subsequently been reported as being abusive. These messages read now as they did when I received them – of two people enjoying entirely consensual sexual relationships and wanting to see one another again. At the time I was in those relationships, they seemed positive and happy on both sides.\nAnd I also realise, looking through them, years later, that I could have and should have done so much better. I was emotionally unavailable while being sexually available, self-focused and not as thoughtful as I could or should have been. I was obviously careless with people’s hearts and feelings, and that’s something that I really, deeply regret. It was selfish of me. I was caught up in my own story and I ignored other people’s.\nI’ve spent some months now taking a long, hard look at who I have been and how I have made people feel.\nLike most of us, I’m learning, and I’m trying to do the work needed, and I know that that’s not an overnight process. I hope that with the help of good people, I’ll continue to grow. I understand that not everyone will believe me or even care what I say but I’ll be doing the work anyway, for myself, my family and the people I love. I will be doing my very best to deserve their trust, as well as the trust of my readers.\nAt the same time, as I reflect on my past – and as I re-review everything that actually happened as opposed to what is being alleged – I don’t accept there was any abuse. To repeat, I have never engaged in non-consensual sexual activity with anyone.\nSome of the horrible stories now being told simply never happened, while others have been so distorted from what actually took place that they bear no relationship to reality. I am prepared to take responsibility for any missteps I made. I’m not willing to turn my back on the truth, and I can’t accept being described as someone I am not, and cannot and will not admit to doing things I didn’t do.\nAnd once more, we see conclusive evidence that Neil Gaiman is a mediocre writer of fiction. I very much hope that some of his accusers will take him to court for defamation, because his absurd statement literally stinks of evasiveness, Machiavellianism, spin, ex post facto revisionism, and lies.\nPerhaps the most amusing claim is that the objectively biggest fame-whore in BOTH comics and science fiction over the last four decades has\n“always tried to be a private person”\n. Think about the massive scope and scale of that obvious and so easily disproven lie, think about the\nchutzpah\nrequired to conclude that your naked assertion will outweigh the literally tens of thousands of items of evidence to the contrary, and then consider the probability that he is telling the truth about anything else.\nI think Reddit might actually melt down in response to this. I cannot believe either his legal team or his PR team thought this was a good idea, no matter how completely the news of his alleged crimes has broken contain.\nUPDATE:\nEven his biggest fans from the subreddit devoted to him aren’t buying this. They’re not buying ANY of it at all.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-14T21:02:18+00:00"
}