{
  "url": "https://voxday.net/2025/01/13/no-safe-words-with-neil-gaiman/",
  "scraped_at": "2026-01-08T19:35:15.034304",
  "title": "No Safe Words with Neil Gaiman",
  "date_display": "January 13, 2025",
  "date_iso": "2025-01-13T13:16:12+00:00",
  "date_from_url": "2025-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>New York Magazine</em> publishes <a href=\"https://archive.md/2n1F6\">a cover article going into copious detail</a> on Neil Gaiman’s alleged sex crimes. There is only one new accuser, and the article abruptly shies away from the obvious question about his current relationship to Scientology and how that has benefited his career, but the details of the existing accusations are worse than even those of us with longtime suspicious about the man had imagined. Note that the quoted section below is about as innocuous as it gets, be warned that Gaiman’s described behavior isn’t merely immoral, illegal, and offensive, but very literally disgusting.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Around four in the afternoon on February 4, Pavlovich took the ferry from Auckland to Waiheke, then sat on a bus and walked through the woods until she arrived at Gaiman’s house, an asymmetrical A-frame of dark burnished wood with picture windows overlooking the sea. Palmer had arranged a playdate for the child, so not long after Pavlovich arrived, she found herself alone in the house with the author. For a little while, Gaiman worked in his office while she read on the couch. Then he emerged and offered her a tour of the grounds. A striking figure at 61, his wild black curls threaded with strands of silver, the author picked a fig — her favorite fruit — and handed it to her. Around 8 p.m., they sat down for pizza. Gaiman poured Pavlovich a glass of rosé and then another. He drank only water. They made awkward conversation about New Zealand, about COVID. Pavlovich had never read any of his work, but she was anxious to make a good impression. After she’d cleaned up their plates, Gaiman noted that there was still time before they would have to pick up his son from the playdate. “‘I’ve had a thought,’” she recalls him saying. “‘Why don’t you have a bath in the beautiful claw bathtub in the garden? It’s absolutely enchanting.’” Pavlovich told Gaiman that she was fine as she was but ultimately agreed. He needed to make a work call, he said, and didn’t want Pavlovich to be bored.</p><p>Gaiman led Pavlovich down a stone path into the garden to an old-fashioned tub with a roll top and walked away. She got undressed and sank into the bath, looking up at the furry magenta blossoms of the pohutukawa tree overhead. A few minutes later, she was surprised to hear Gaiman’s footsteps on the stones in the dark. She tried to cover her breasts with her arms. When he arrived at the bath, she saw that he was naked. Gaiman put out a couple of citronella candles, lit them, and got into the bath. He stretched out, facing her, and, for a few minutes, made small talk. He bitched about Palmer’s schedule. He talked about his kid’s school. Then he told her to stretch her legs out and “get comfortable.”</p><p>“I said ‘no.’ I said, ‘I’m not confident with my body,’” Pavlovich recalls. “He said, ‘It’s okay — it’s only me. Just relax. Just have a chat.’” She didn’t move. He looked at her again and said, “Don’t ruin the moment.” She did as instructed, and he began to stroke her feet. At that point, she recalls, she felt “a subtle terror.”</p></blockquote><p>Now that a mainstream magazine is willing to directly address the issue, and now that it’s apparent from the details provided that this guy is not merely bumping up against the borders of consent, but is a full-fledged predator and rapist, it’s going to be a lot harder for publishers like <a href=\"https://www.harpercollins.com/collections/books-by-neil-gaiman\">Harper Collins</a>, <a href=\"https://www.foliosociety.com/usa/authors/neil-gaiman\">Folio Society</a>, <a href=\"https://www.eastonpress.com/signed-editions/neil-gaiman-american-gods-a-signed-edition-2820.html\">Easton Press</a>, and <a href=\"https://www.penguinrandomhouse.com/authors/68959/neil-gaiman/\">Penguin Random House</a> to blithely continue publishing his work while simultaneously asserting their dedication to social justice.</p><p>In fact, I was reliably informed that the Folio Society didn’t want to have anything to do with me because their executives believe I am a Very Bad Man, and yet they continue to market and sell Neil Gaiman’s books despite the fact that <em>they know perfectly well</em> multiple women have been publicly accusing Gaiman of raping them for more than six months.<br/><br/>I suggest that Folio Society executives like <a href=\"https://www.linkedin.com/in/ACoAAAVyrvoB_6YzqzX3EIu1rwISoRQYhjZb-zU\"></a><a href=\"https://www.linkedin.com/in/lauren-juster-7b673a26/\">Lauren Juster</a> and <a href=\"https://www.linkedin.com/in/ACoAAAHvndEBPW0gkyhFZ49F14k1zWI2VMFSKPM\"></a><a href=\"https://www.linkedin.com/in/joannapreynolds/\">Joanna Reynolds</a> take the time to read today’s New York Magazine article which details, at great length, their publishing partner’s crimes against women. And there is absolutely no way that there isn’t more, and quite possibly worse, forthcoming.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.vulture.com/article/neil-gaiman-allegations-controversy-amanda-palmer-sandman-madoc.html\"><img alt=\"\" class=\"wp-image-65977\" decoding=\"async\" fetchpriority=\"high\" height=\"319\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/01/image-20.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/01/image-20.png 512w, https://voxday.net/wp-content/uploads/2025/01/image-20-300x187.png 300w\" width=\"512\"/></a></figure></div><p>That picture is both apt and hysterical, especially after decades of media images seeking to present him as some sort of dweeby neo-rock star. How the foul are fallen! But the physiognomy was warning us all along. And even though there isn’t much in the way of new accusations, the sheer volume of detail is apparently proving enough to convince some of Gaiman’s most stubborn defenders, such as this disappointed fan.</p><p><em>Neil Gaiman has been one of my favorite creators since I first picked up The Sandman with issue #7. His work has been a constant in my life since, and I treasured everything the man has written. He seemed like a truly decent human being. I even got to interact with him once on Tumblr, that felt like a really great moment in my life. Since the allegations of SA surfaced last year, I have been quietly hoping against hope, that my impression of his decency would survive. Now that I’ve taken the plunge, reading this article, and diving into this rabbit hole with other sources, I have to admit to myself that Gaiman is likely guilty of what he’s accused of. And while it’s disappointing to learn the awful truth about an artist you respected (adored), my deeper sorrow lies with these women he most likely assaulted and abused. And I feel more than a touch of shame for burying my head in the sand because I didn’t want to be dissapointed in yet another person.</em></p><p>It’s also remarkable to see the pictures of his accusers and observe how all the women upon whom he allegedly preyed look so much alike. If you were a Gaiman fan who was young, plain, insecure, brown-haired, and weren’t overweight, you were in trouble.</p><p><strong>UPDATE:</strong> /pol/ has taken notice. If the weaponized autists get rolling on the subject, a lot of things will be learned that the investigative journalists haven’t uncovered yet.</p><p><strong>UPDATE: </strong>Fandom Pulse <a href=\"https://fandompulse.substack.com/p/neil-gaiman-abuse-victim-scarlett\">is on it</a> as well. Please note that they were a little less delicate with regards to the quotes from the article regarding Gaiman’s alleged violent perversions.</p><p><strong>UPDATE:</strong> JK Rowling calls out the SJWs who are normally so quick to denounce people, but have been uncharacteristically reticent to call for Gaiman’s cancellation and deplatforming.</p><p><em>The literary crowd that had a hell of a lot to say about Harvey Weinstein before he was convicted has been strangely muted in its responses to multiple accusations against Neil Gaiman from young women who’d never met, yet – as with Weinstein – tell remarkably similar stories.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/2bbfd099-e0da-4650-8427-bb83e0a2bf71\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "New York Magazine\npublishes\na cover article going into copious detail\non Neil Gaiman’s alleged sex crimes. There is only one new accuser, and the article abruptly shies away from the obvious question about his current relationship to Scientology and how that has benefited his career, but the details of the existing accusations are worse than even those of us with longtime suspicious about the man had imagined. Note that the quoted section below is about as innocuous as it gets, be warned that Gaiman’s described behavior isn’t merely immoral, illegal, and offensive, but very literally disgusting.\nAround four in the afternoon on February 4, Pavlovich took the ferry from Auckland to Waiheke, then sat on a bus and walked through the woods until she arrived at Gaiman’s house, an asymmetrical A-frame of dark burnished wood with picture windows overlooking the sea. Palmer had arranged a playdate for the child, so not long after Pavlovich arrived, she found herself alone in the house with the author. For a little while, Gaiman worked in his office while she read on the couch. Then he emerged and offered her a tour of the grounds. A striking figure at 61, his wild black curls threaded with strands of silver, the author picked a fig — her favorite fruit — and handed it to her. Around 8 p.m., they sat down for pizza. Gaiman poured Pavlovich a glass of rosé and then another. He drank only water. They made awkward conversation about New Zealand, about COVID. Pavlovich had never read any of his work, but she was anxious to make a good impression. After she’d cleaned up their plates, Gaiman noted that there was still time before they would have to pick up his son from the playdate. “‘I’ve had a thought,’” she recalls him saying. “‘Why don’t you have a bath in the beautiful claw bathtub in the garden? It’s absolutely enchanting.’” Pavlovich told Gaiman that she was fine as she was but ultimately agreed. He needed to make a work call, he said, and didn’t want Pavlovich to be bored.\nGaiman led Pavlovich down a stone path into the garden to an old-fashioned tub with a roll top and walked away. She got undressed and sank into the bath, looking up at the furry magenta blossoms of the pohutukawa tree overhead. A few minutes later, she was surprised to hear Gaiman’s footsteps on the stones in the dark. She tried to cover her breasts with her arms. When he arrived at the bath, she saw that he was naked. Gaiman put out a couple of citronella candles, lit them, and got into the bath. He stretched out, facing her, and, for a few minutes, made small talk. He bitched about Palmer’s schedule. He talked about his kid’s school. Then he told her to stretch her legs out and “get comfortable.”\n“I said ‘no.’ I said, ‘I’m not confident with my body,’” Pavlovich recalls. “He said, ‘It’s okay — it’s only me. Just relax. Just have a chat.’” She didn’t move. He looked at her again and said, “Don’t ruin the moment.” She did as instructed, and he began to stroke her feet. At that point, she recalls, she felt “a subtle terror.”\nNow that a mainstream magazine is willing to directly address the issue, and now that it’s apparent from the details provided that this guy is not merely bumping up against the borders of consent, but is a full-fledged predator and rapist, it’s going to be a lot harder for publishers like\nHarper Collins\n,\nFolio Society\n,\nEaston Press\n, and\nPenguin Random House\nto blithely continue publishing his work while simultaneously asserting their dedication to social justice.\nIn fact, I was reliably informed that the Folio Society didn’t want to have anything to do with me because their executives believe I am a Very Bad Man, and yet they continue to market and sell Neil Gaiman’s books despite the fact that\nthey know perfectly well\nmultiple women have been publicly accusing Gaiman of raping them for more than six months.\nI suggest that Folio Society executives like\nLauren Juster\nand\nJoanna Reynolds\ntake the time to read today’s New York Magazine article which details, at great length, their publishing partner’s crimes against women. And there is absolutely no way that there isn’t more, and quite possibly worse, forthcoming.\nThat picture is both apt and hysterical, especially after decades of media images seeking to present him as some sort of dweeby neo-rock star. How the foul are fallen! But the physiognomy was warning us all along. And even though there isn’t much in the way of new accusations, the sheer volume of detail is apparently proving enough to convince some of Gaiman’s most stubborn defenders, such as this disappointed fan.\nNeil Gaiman has been one of my favorite creators since I first picked up The Sandman with issue #7. His work has been a constant in my life since, and I treasured everything the man has written. He seemed like a truly decent human being. I even got to interact with him once on Tumblr, that felt like a really great moment in my life. Since the allegations of SA surfaced last year, I have been quietly hoping against hope, that my impression of his decency would survive. Now that I’ve taken the plunge, reading this article, and diving into this rabbit hole with other sources, I have to admit to myself that Gaiman is likely guilty of what he’s accused of. And while it’s disappointing to learn the awful truth about an artist you respected (adored), my deeper sorrow lies with these women he most likely assaulted and abused. And I feel more than a touch of shame for burying my head in the sand because I didn’t want to be dissapointed in yet another person.\nIt’s also remarkable to see the pictures of his accusers and observe how all the women upon whom he allegedly preyed look so much alike. If you were a Gaiman fan who was young, plain, insecure, brown-haired, and weren’t overweight, you were in trouble.\nUPDATE:\n/pol/ has taken notice. If the weaponized autists get rolling on the subject, a lot of things will be learned that the investigative journalists haven’t uncovered yet.\nUPDATE:\nFandom Pulse\nis on it\nas well. Please note that they were a little less delicate with regards to the quotes from the article regarding Gaiman’s alleged violent perversions.\nUPDATE:\nJK Rowling calls out the SJWs who are normally so quick to denounce people, but have been uncharacteristically reticent to call for Gaiman’s cancellation and deplatforming.\nThe literary crowd that had a hell of a lot to say about Harvey Weinstein before he was convicted has been strangely muted in its responses to multiple accusations against Neil Gaiman from young women who’d never met, yet – as with Weinstein – tell remarkably similar stories.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "law",
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-13T17:56:22+00:00"
}