{
  "url": "https://voxday.net/2025/01/11/on-the-topic-of-foreign-sex-criminals/",
  "scraped_at": "2026-01-08T19:35:05.848485",
  "title": "GaimanGate: The Next Chapter",
  "date_display": "January 11, 2025",
  "date_iso": "2025-01-11T16:25:14+00:00",
  "date_from_url": "2025-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears the next chapter in the ongoing Neil Gaiman sexual assault scandal is about to begin. From r/NeilGaimanUncovered:</p><p><em>This is a heads-up as promised (and the <strong>last update</strong>) before the long-awaited article. We are only a few days away from publication. The article will be posted in this sub as soon as it’s out and we’ll include trigger warnings so vulnerable members can engage with highly disturbing content on their terms.</em></p><p>Rest assured, the memewarriors <a href=\"https://www.reddit.com/r/neilgaimanmemes/\">at Neil Gaiman Memes</a> are ready and will be memeing up a storm on the basis of the new information once it is revealed. And as can be seen in the meme below, it’s not exactly a mystery as to why Gaiman did what he is accused of doing, why his purported “success” was manufactured for him, or why he has seemingly been protected for so long. As with the British politician mentioned in the prior post, he makes it very clear who and what he serves.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-65964\" decoding=\"async\" fetchpriority=\"high\" height=\"384\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/01/image-19.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/01/image-19.png 512w, https://voxday.net/wp-content/uploads/2025/01/image-19-300x225.png 300w\" width=\"512\"/></figure></div><p>One Gaiman fan on Reddit was skeptical that anyone could possibly have had any idea about Gaiman prior to the allegations going public last year:</p><p><em>Can anyone point me to some threads or posts where people shared their feelings of ick about Gaiman from before the allegations went public? So many people here were feeling the same thing, surely there are documented cases of people speaking out.</em></p><p>Here are three from this blog alone. The posts from 2017 and 2018 are mine, the one from 2013 is from a reviewer I was quoting. But my disdain for Gaiman as a writer and novelist is well-documented, and while I didn’t read enough of his work to be certain that he was a bad person prior to the 2024 allegations of sexual assault, much less the manufactured creature he now appears to be, he was most definitely in the “yeah, this guy is probably off” category after reading <em>American Gods</em> and a few issues of <em>Sandman</em>, after which I stopped reading him. Although, to be fair, it was the mediocrity that was the reason, not the probability that he was what he turned out to be.</p><ul class=\"wp-block-list\"><li><strong>2018: </strong>If you think Neil Gaiman is a great novelist, or even a great SF/F novelist, you are simply wrong. He is a successful, talented and much-loved SF/F author, and understandably so, but he is also little more than a very successful stunt writer with two or three tricks in his bag. There is a reason that all of his notable books involve mythology of one sort or another; his true gift is translating ancient myth into a form that pleases postmodern palates.</li><li><strong>2017</strong>: It is right and proper to judge the artist on the basis of the art. More often than not, the art created by the artist provides relevant insight into his psyche; it is very difficult to write the opposite sex well and it is also very difficult for a man to write characters who are different than his own socio-sexual rank. Read Louis L’Amour and Robert Ludlum. Then read John Scalzi and Neil Gaiman. The difference is readily observable. Then read Piers Anthony and Marion Zimmer Bradley. Notice the creep factor? Exactly. This is one area where you can reliably trust your feelings.</li><li><strong>2013:</strong> <em>Neverwhere</em>, <em>Stardust</em>, <em>American Gods</em> and <em>Anansi Boys</em> are written by the exact same man. It’s that Mr. Stock Type shows up for all four, each iteration as dull and insufferable as the last, distinguishable only faintly by his name. Leaving <em>American Gods</em> and <em>Stardust </em>alone for now, this isn’t so much a matter of “oh you could do this to any fantasy book,” itself an asinine proposition, because not all fantasy books feature a timid Londoner devoid of ambition who has relationship troubles with a demanding sweetheart/fiancee. The sweethearts in question(respectively Rosie Noah, Jessica, and Victoria Forrester) are likewise identical: thinly written, demanding, henpecking, and not the brightest. Really Gaiman kind of sucks at writing women, and apart from this one incredibly tertiary character in American Gods I don’t think he’s particularly comfortable with gay men–certainly not enough to write them as protagonists. Similarly, the catalyst to “finding the secret magic world” is always more or less the same: through colliding with one of said secret world’s inhabitants.</li></ul><p><em><a href=\"https://socialgalactic.com/micropost/2f0cb5d9-8c4d-4387-82f2-3b8cbc1f353c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It appears the next chapter in the ongoing Neil Gaiman sexual assault scandal is about to begin. From r/NeilGaimanUncovered:\nThis is a heads-up as promised (and the\nlast update\n) before the long-awaited article. We are only a few days away from publication. The article will be posted in this sub as soon as it’s out and we’ll include trigger warnings so vulnerable members can engage with highly disturbing content on their terms.\nRest assured, the memewarriors\nat Neil Gaiman Memes\nare ready and will be memeing up a storm on the basis of the new information once it is revealed. And as can be seen in the meme below, it’s not exactly a mystery as to why Gaiman did what he is accused of doing, why his purported “success” was manufactured for him, or why he has seemingly been protected for so long. As with the British politician mentioned in the prior post, he makes it very clear who and what he serves.\nOne Gaiman fan on Reddit was skeptical that anyone could possibly have had any idea about Gaiman prior to the allegations going public last year:\nCan anyone point me to some threads or posts where people shared their feelings of ick about Gaiman from before the allegations went public? So many people here were feeling the same thing, surely there are documented cases of people speaking out.\nHere are three from this blog alone. The posts from 2017 and 2018 are mine, the one from 2013 is from a reviewer I was quoting. But my disdain for Gaiman as a writer and novelist is well-documented, and while I didn’t read enough of his work to be certain that he was a bad person prior to the 2024 allegations of sexual assault, much less the manufactured creature he now appears to be, he was most definitely in the “yeah, this guy is probably off” category after reading\nAmerican Gods\nand a few issues of\nSandman\n, after which I stopped reading him. Although, to be fair, it was the mediocrity that was the reason, not the probability that he was what he turned out to be.\n2018:\nIf you think Neil Gaiman is a great novelist, or even a great SF/F novelist, you are simply wrong. He is a successful, talented and much-loved SF/F author, and understandably so, but he is also little more than a very successful stunt writer with two or three tricks in his bag. There is a reason that all of his notable books involve mythology of one sort or another; his true gift is translating ancient myth into a form that pleases postmodern palates.\n2017\n: It is right and proper to judge the artist on the basis of the art. More often than not, the art created by the artist provides relevant insight into his psyche; it is very difficult to write the opposite sex well and it is also very difficult for a man to write characters who are different than his own socio-sexual rank. Read Louis L’Amour and Robert Ludlum. Then read John Scalzi and Neil Gaiman. The difference is readily observable. Then read Piers Anthony and Marion Zimmer Bradley. Notice the creep factor? Exactly. This is one area where you can reliably trust your feelings.\n2013:\nNeverwhere\n,\nStardust\n,\nAmerican Gods\nand\nAnansi Boys\nare written by the exact same man. It’s that Mr. Stock Type shows up for all four, each iteration as dull and insufferable as the last, distinguishable only faintly by his name. Leaving\nAmerican Gods\nand\nStardust\nalone for now, this isn’t so much a matter of “oh you could do this to any fantasy book,” itself an asinine proposition, because not all fantasy books feature a timid Londoner devoid of ambition who has relationship troubles with a demanding sweetheart/fiancee. The sweethearts in question(respectively Rosie Noah, Jessica, and Victoria Forrester) are likewise identical: thinly written, demanding, henpecking, and not the brightest. Really Gaiman kind of sucks at writing women, and apart from this one incredibly tertiary character in American Gods I don’t think he’s particularly comfortable with gay men–certainly not enough to write them as protagonists. Similarly, the catalyst to “finding the secret magic world” is always more or less the same: through colliding with one of said secret world’s inhabitants.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "media",
    "MemeWars",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-12T01:44:39+00:00"
}