{
  "url": "https://voxday.net/2025/01/04/she-has-to-go-back-2/",
  "scraped_at": "2026-01-08T19:34:21.725878",
  "title": "She Has to Go Back",
  "date_display": "January 4, 2025",
  "date_iso": "2025-01-04T11:52:18+00:00",
  "date_from_url": "2025-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fat Portuguese mediocrity who actually claims to have been “born American in Portugal” is literally willing <a href=\"https://accordingtohoyt.com/2025/01/03/blood-and-bullshit/\">to redefine the very concept of “nation” and deny it to Americans</a> rather than admit that she is not part of the American Posterity for whom the U.S. Constitution was written, whose rights it was supposed to protect, and to whose Blessings of Liberty <a href=\"https://voxday.net/2017/06/25/posterity-tk-vs-vd/\">she has absolutely no legitimate claim</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>What? Again? Why are we on this topic again?</p><p>Good Lord. I too am sick and tired of it. Trust me.</p><p>And yet there is a growing drumbeat for “America is a blood and soil nation.”</p><p>It’s ludicrous and laughable. I’ll be honest, it’s ludicrous and laughable even for other countries, but for the US it would be laughable, if it didn’t make me pull out all my hair and cry.</p><p>If you pursue that “blood” thing — and as an idea of how crazy this is, my husband thought blood referred to blood spilled in battle, which to be fair makes a ton more sense than “blood is genetic relationship” for our country — with its proponents, you get incoherent moaning and groaning alternately about how the founders meant the nation only for their “progeny” (but this is invalidated by the progeny reproducing with newcomers, which means they were only supposed to marry each other for 250 years now. Well. I guess they’d have eight toes per hand, but they’d play the banjo a treat.) Or we get moaning and eructations about “Anglo Saxon ancestry” or–</p><p>This is not just bullsthit. It is complete, utter, smelly scrapings of the filthiest stable you can imagine.</p><p>Look, guys, no nation is blood-and-soil. Not really. Even the nations of old Europe with their chest beating about the “French race” or the “Portuguese race” or heaven help us “the German race” are basically full of shit.</p></blockquote><p>Blood is not “bullsthit”. Nations are nothing but blood; the soil is merely the ground they happen to have conquered and hold. Civic nationalism, which is based on substituting “ideas” for blood, is pure satanic evil, a self-serving inversion that allows late-coming minorities to redefine themselves as the legitimate heirs to the people they have dispossessed.</p><p>The complete absurdity of the civic nationalist position can be seen in Hoyt’s own words.</p><p><em>We are a credal nation. No, we’re not going door to door and examine our citizen’s consciences and understanding. We’re going to assume they’re Americans and believe as Americans UNTIL AND UNLESS THEY PROVE OTHERWISE. And then we’ll deal with it. Preferably in the courts of law. Meanwhile, we’ll teach and we’ll behave and we’ll be AMERICAN.</em></p><p>In other words, this “credal nation” has no intellectual borders to replace the physical borders for which it purports to be a substitute. It’s not only a false and manufactured substitute, it’s an entirely ineffective one. Sarah Hoyt is clearly triggered by the fact that real Americans are sick and tired of fake paper Americans like her claiming that they don’t even exist and of having to see their way of life comprehensively and systematically destroyed in order to better suit the invaders like her; she can’t even spell “creedal” correctly. And America is not, and never was, “a creedal nation”, and “idea nation” or a “melting pot”. Those are self-serving concepts created by early 20th century immigrants.</p><p>It’s more than a bit ironic for Hoyt to turn around and claim that there is no Portuguese nation after subjecting her readers to more than a decade of her pontifications on what life in Portugal is like, not that anyone ever asked. But here’s the thing: if America is nothing more than an idea, and if a nation isn’t blood or soil, then what was it that prevented her from being American <em>while remaining in Portugal</em>? As Moammar Qaddafi once observed, if America is an idea, then it belongs to the entire world, not just those who happen to be resident in a portion of the North American continent.</p><p>Hoyt very clearly demonstrates why they have to go back. Because they will never, ever, be Americans nor do they have any loyalty whatsoever to the American nation. To the contrary, they will deny that the American nation ever existed at all. So there will be fire, and there will be blood, and it will be due in large part to the wicked Babelist propaganda of the civic nationalists that was utilized to erase the borders of the various nations of the West in order to destroy them.</p><p>But despite their best efforts, many nations will survive to the end, and new nations will arise from the ashes of the heterogeneous empires, as they always do. What God hath put asunder, let not man attempt to join together. And for those who don’t realize how deeply and fundamentally evil the position asserted by Sarah Hoyt and her fellow civic nationalists is, consider the words of John Locke on the subject.</p><p><em>No damage therefore, that men in the state of nature suffer from one another, can give a conqueror power to dispossess the posterity of the vanquished, and turn them out of that inheritance, which ought to be the possession of them and their descendants to all generations. The conqueror indeed will be apt to think himself master: and it is the very condition of the subdued not to be able to dispute their right. But if that be all, it gives no other title than what bare force gives to the stronger over the weaker: and, by this reason, he that is strongest will have a right to whatever he pleases to seize on. </em><br/>– John Locke, Of Conquest, Second Treatise on Civil Government, 1690</p><p>The civic nationalist conservatives aren’t merely wrong and stupid, they are outright evil. They are the secular version of the Churchians, and like the Churchians, they have substituted the perception of niceness for the pursuit of the truth. Also like the Churchians, they have actively worked to destroy the very institution that they profess to love.</p><p><em><a href=\"https://socialgalactic.com/micropost/061179c5-03ee-4022-bb11-dc776a23e437\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The fat Portuguese mediocrity who actually claims to have been “born American in Portugal” is literally willing\nto redefine the very concept of “nation” and deny it to Americans\nrather than admit that she is not part of the American Posterity for whom the U.S. Constitution was written, whose rights it was supposed to protect, and to whose Blessings of Liberty\nshe has absolutely no legitimate claim\n.\nWhat? Again? Why are we on this topic again?\nGood Lord. I too am sick and tired of it. Trust me.\nAnd yet there is a growing drumbeat for “America is a blood and soil nation.”\nIt’s ludicrous and laughable. I’ll be honest, it’s ludicrous and laughable even for other countries, but for the US it would be laughable, if it didn’t make me pull out all my hair and cry.\nIf you pursue that “blood” thing — and as an idea of how crazy this is, my husband thought blood referred to blood spilled in battle, which to be fair makes a ton more sense than “blood is genetic relationship” for our country — with its proponents, you get incoherent moaning and groaning alternately about how the founders meant the nation only for their “progeny” (but this is invalidated by the progeny reproducing with newcomers, which means they were only supposed to marry each other for 250 years now. Well. I guess they’d have eight toes per hand, but they’d play the banjo a treat.) Or we get moaning and eructations about “Anglo Saxon ancestry” or–\nThis is not just bullsthit. It is complete, utter, smelly scrapings of the filthiest stable you can imagine.\nLook, guys, no nation is blood-and-soil. Not really. Even the nations of old Europe with their chest beating about the “French race” or the “Portuguese race” or heaven help us “the German race” are basically full of shit.\nBlood is not “bullsthit”. Nations are nothing but blood; the soil is merely the ground they happen to have conquered and hold. Civic nationalism, which is based on substituting “ideas” for blood, is pure satanic evil, a self-serving inversion that allows late-coming minorities to redefine themselves as the legitimate heirs to the people they have dispossessed.\nThe complete absurdity of the civic nationalist position can be seen in Hoyt’s own words.\nWe are a credal nation. No, we’re not going door to door and examine our citizen’s consciences and understanding. We’re going to assume they’re Americans and believe as Americans UNTIL AND UNLESS THEY PROVE OTHERWISE. And then we’ll deal with it. Preferably in the courts of law. Meanwhile, we’ll teach and we’ll behave and we’ll be AMERICAN.\nIn other words, this “credal nation” has no intellectual borders to replace the physical borders for which it purports to be a substitute. It’s not only a false and manufactured substitute, it’s an entirely ineffective one. Sarah Hoyt is clearly triggered by the fact that real Americans are sick and tired of fake paper Americans like her claiming that they don’t even exist and of having to see their way of life comprehensively and systematically destroyed in order to better suit the invaders like her; she can’t even spell “creedal” correctly. And America is not, and never was, “a creedal nation”, and “idea nation” or a “melting pot”. Those are self-serving concepts created by early 20th century immigrants.\nIt’s more than a bit ironic for Hoyt to turn around and claim that there is no Portuguese nation after subjecting her readers to more than a decade of her pontifications on what life in Portugal is like, not that anyone ever asked. But here’s the thing: if America is nothing more than an idea, and if a nation isn’t blood or soil, then what was it that prevented her from being American\nwhile remaining in Portugal\n? As Moammar Qaddafi once observed, if America is an idea, then it belongs to the entire world, not just those who happen to be resident in a portion of the North American continent.\nHoyt very clearly demonstrates why they have to go back. Because they will never, ever, be Americans nor do they have any loyalty whatsoever to the American nation. To the contrary, they will deny that the American nation ever existed at all. So there will be fire, and there will be blood, and it will be due in large part to the wicked Babelist propaganda of the civic nationalists that was utilized to erase the borders of the various nations of the West in order to destroy them.\nBut despite their best efforts, many nations will survive to the end, and new nations will arise from the ashes of the heterogeneous empires, as they always do. What God hath put asunder, let not man attempt to join together. And for those who don’t realize how deeply and fundamentally evil the position asserted by Sarah Hoyt and her fellow civic nationalists is, consider the words of John Locke on the subject.\nNo damage therefore, that men in the state of nature suffer from one another, can give a conqueror power to dispossess the posterity of the vanquished, and turn them out of that inheritance, which ought to be the possession of them and their descendants to all generations. The conqueror indeed will be apt to think himself master: and it is the very condition of the subdued not to be able to dispute their right. But if that be all, it gives no other title than what bare force gives to the stronger over the weaker: and, by this reason, he that is strongest will have a right to whatever he pleases to seize on.\n– John Locke, Of Conquest, Second Treatise on Civil Government, 1690\nThe civic nationalist conservatives aren’t merely wrong and stupid, they are outright evil. They are the secular version of the Churchians, and like the Churchians, they have substituted the perception of niceness for the pursuit of the truth. Also like the Churchians, they have actively worked to destroy the very institution that they profess to love.\nDISCUSS ON SG",
  "tags": [
    "immigration",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-04T13:15:23+00:00"
}