{
  "url": "https://voxday.net/2025/01/05/the-self-destruction-of-brandon-sanderson/",
  "scraped_at": "2026-01-08T19:34:25.381757",
  "title": "The Self-Destruction of Brandon Sanderson",
  "date_display": "January 5, 2025",
  "date_iso": "2025-01-05T12:24:10+00:00",
  "date_from_url": "2025-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fandom Pulse has chronicled Brandon Sanderson’s descent into ticket-taking and social justice convergence, but Sanderson <a href=\"https://fandompulse.substack.com/p/brandon-sanderson-admits-story-scope\">has been creating some additional problems</a> for his fiction writing as well, technical problems that no one but a better epic fantasy author is likely to notice.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Re: Brandon needs to be edited more. I assure you, I’m edited more now than I ever have been–so I don’t believe editing isn’t the issue some people are having. Tress and Sunlit, for example, were written not long ago, and are both quite tight as a narrative. Both were edited less than Stormlight 5. Writing speed isn’t the problem either, as the fastest I’ve ever been required to write was during the Gathering Storm / Way of Kings era, and those are books that are generally (by comparison) not talked about the same way as (say) Rhythm of War.</p><p>The issue is story scope expansion–Stormlight in particular has a LOT going on. I can see some people wishing for the tighter narratives of the first two books, but there are things I can do with this kind of story I couldn’t do with those. I like a variety, and this IS the story I want to tell here, despite being capable of doing it other ways. Every scene was one I wanted in the book, and sometimes I like to do different things, for different readers. I got the same complaints about the way I did the Bridge Four individual viewpoints in Oathbringer, for example. There were lots of suggestions I cut them during editorial and early reads, and I refused not because there is no validity to these ideas, but because this was the story I legitimately wanted to tell.</p></blockquote><p>This is more than a little ironic, given the way in which Sanderson was brought in to fix a similar problem that the late Robert Jordan had created for himself, and especially in light of how George R. R. Martin has apparently facing the end of his literary career without finishing <em>A Song of Ice and Fire</em> for the very same self-indulgent reason that Sanderson gives for the way in which his readers have perceived a decline in the quality of his books.</p><p>The reason that Sanderson gives, story scope expansion, is correct, but it is too general for the average reader or writer to understand the true root of the problem. Now, this is just a surmise, because I have only read two Sanderson novels and part of another, and I regard him as the epitome of boring mediocrity when it comes to epic fantasy. I’d rather read <em>The Sword of Shannara</em>, the most incoherent of Erikson’s Malazan books, or anything by Joel Abercrombie than another chapter of Sanderson’s tedious meandering.</p><p>But if any Sanderson fans here would like to check, I am confident that if you count up the number of perspective characters he’s utilizing, you will find that they are increasing from book to book. Just as George Martin did before him, Sanderson has been expanding the scope of the story by introducing new perspective characters and promoting minor characters to perspective characters, and that means he has been getting distracted by tangents taking his focus away from the larger story. By doing so, he is running a very serious risk of not only rendering his story incoherent and unreadable, but impossible to finish in a manner that will be reasonably satisfying to the reader. If anyone would care to count up the number of perspective characters in each book and report them to me via email or on SG, I will update the post with the perspective character count by book. That should tell us how grave the problem is.</p><p><strong>UPDATE:</strong> It will probably surprise no one here to learn that the diagnosis was correct. An SG reader provided a perspective character count for the Stormlight Archives, in which he bundled a few small group perspectives that appear in the last three books into one for the purposes of comparison. Anyhow, Sanderson has clearly committed the same technical blunder that Martin did in expanding the scope of his story.</p><ul class=\"wp-block-list\"><li>SA1: 6</li><li>SA2: 6</li><li>SA3: 14</li><li>SA4: 14</li><li>SA5: 23</li></ul><p>This is the sort of thing of which the average novelist or editor isn’t aware, because writing an epic, be it fantasy or science fiction, is a very, very different thing than writing a novel. An epic bears about the same relationship to a novel that a novel does to a short story or a novelette. Indeed, each chapter of <em>A Throne of Bones</em> and <em>A Sea of Skulls</em>, essentially functions as a novelette and many of them could be reasonably published as stand-alones without the average reader noticing it was part of a larger work.</p><p>I described the way in which story scope expansion creates <a href=\"https://voxday.net/2024/09/06/an-incorrect-theory/\">the technical problem faced by Martin</a> in a post last year.</p><p><em>Consider the POV breakdown of A Game of Thrones, the first book of ASOIAF. Eight perspective characters, with Ned accounting for 15 chapters and 18.3 percent of the focus. Only Ned was eliminated by the end of the book, so Martin entered the second book of the series with a very manageable seven characters. He adds three characters to reach 10, then two more in the third for 12, however, he only continues the stories of three of those 12 characters as he introduces 10 more in the fourth book. By the end of A Dance with Dragons, Martin had divided up his increasingly out-of-control story amidst 18 perspective characters and entered The Winds of Winter with up to 30(!) potential perspective characters whose stories require at least some degree of resolution!</em></p><p>Dividing 300k words among thirty characters means devoting the equivalent of one novelette to each character’s perspective, while somehow trying to tie them all together in a coherent manner. While it’s theoretically possible, I’ve never seen anyone accomplish anything even close to that degree of literary difficulty. Some readers might find it interesting to know that in addition to predicting Martin’s inability to finish his series, last year I also pointed out that Brandon Sanderson <a href=\"https://voxday.net/2024/07/26/how-to-wreck-an-epic-fantasy/\">would not be able to fix the technical problem</a> with ASOIAF and bring it to a proper conclusion.</p><p>Given that Sanderson has blundered into the same problem that did in Martin’s series, it appears that my observation was correct. And it also tends to confirm my opinion that despite his massive sales success, Sanderson is not in my league as an author of epic fantasy; that may well sound arrogant, but it’s not as if the sample size of works that, while unfinished, exceed the length of <em>The Lord of the Rings</em>, are insufficient for a determinative comparison.</p><p>As any look at the forgotten bestsellers of 100 years ago will tell you, the best books are the ones that survive to be read by future generations, not those that sell best in their own day. And as Deng Xiaoping once said of the French Revolution, it’s just too soon for us to tell.</p><p><em><a href=\"https://socialgalactic.com/micropost/4899819e-78ee-40dc-a344-b41eb1a4df71\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fandom Pulse has chronicled Brandon Sanderson’s descent into ticket-taking and social justice convergence, but Sanderson\nhas been creating some additional problems\nfor his fiction writing as well, technical problems that no one but a better epic fantasy author is likely to notice.\nRe: Brandon needs to be edited more. I assure you, I’m edited more now than I ever have been–so I don’t believe editing isn’t the issue some people are having. Tress and Sunlit, for example, were written not long ago, and are both quite tight as a narrative. Both were edited less than Stormlight 5. Writing speed isn’t the problem either, as the fastest I’ve ever been required to write was during the Gathering Storm / Way of Kings era, and those are books that are generally (by comparison) not talked about the same way as (say) Rhythm of War.\nThe issue is story scope expansion–Stormlight in particular has a LOT going on. I can see some people wishing for the tighter narratives of the first two books, but there are things I can do with this kind of story I couldn’t do with those. I like a variety, and this IS the story I want to tell here, despite being capable of doing it other ways. Every scene was one I wanted in the book, and sometimes I like to do different things, for different readers. I got the same complaints about the way I did the Bridge Four individual viewpoints in Oathbringer, for example. There were lots of suggestions I cut them during editorial and early reads, and I refused not because there is no validity to these ideas, but because this was the story I legitimately wanted to tell.\nThis is more than a little ironic, given the way in which Sanderson was brought in to fix a similar problem that the late Robert Jordan had created for himself, and especially in light of how George R. R. Martin has apparently facing the end of his literary career without finishing\nA Song of Ice and Fire\nfor the very same self-indulgent reason that Sanderson gives for the way in which his readers have perceived a decline in the quality of his books.\nThe reason that Sanderson gives, story scope expansion, is correct, but it is too general for the average reader or writer to understand the true root of the problem. Now, this is just a surmise, because I have only read two Sanderson novels and part of another, and I regard him as the epitome of boring mediocrity when it comes to epic fantasy. I’d rather read\nThe Sword of Shannara\n, the most incoherent of Erikson’s Malazan books, or anything by Joel Abercrombie than another chapter of Sanderson’s tedious meandering.\nBut if any Sanderson fans here would like to check, I am confident that if you count up the number of perspective characters he’s utilizing, you will find that they are increasing from book to book. Just as George Martin did before him, Sanderson has been expanding the scope of the story by introducing new perspective characters and promoting minor characters to perspective characters, and that means he has been getting distracted by tangents taking his focus away from the larger story. By doing so, he is running a very serious risk of not only rendering his story incoherent and unreadable, but impossible to finish in a manner that will be reasonably satisfying to the reader. If anyone would care to count up the number of perspective characters in each book and report them to me via email or on SG, I will update the post with the perspective character count by book. That should tell us how grave the problem is.\nUPDATE:\nIt will probably surprise no one here to learn that the diagnosis was correct. An SG reader provided a perspective character count for the Stormlight Archives, in which he bundled a few small group perspectives that appear in the last three books into one for the purposes of comparison. Anyhow, Sanderson has clearly committed the same technical blunder that Martin did in expanding the scope of his story.\nSA1: 6\nSA2: 6\nSA3: 14\nSA4: 14\nSA5: 23\nThis is the sort of thing of which the average novelist or editor isn’t aware, because writing an epic, be it fantasy or science fiction, is a very, very different thing than writing a novel. An epic bears about the same relationship to a novel that a novel does to a short story or a novelette. Indeed, each chapter of\nA Throne of Bones\nand\nA Sea of Skulls\n, essentially functions as a novelette and many of them could be reasonably published as stand-alones without the average reader noticing it was part of a larger work.\nI described the way in which story scope expansion creates\nthe technical problem faced by Martin\nin a post last year.\nConsider the POV breakdown of A Game of Thrones, the first book of ASOIAF. Eight perspective characters, with Ned accounting for 15 chapters and 18.3 percent of the focus. Only Ned was eliminated by the end of the book, so Martin entered the second book of the series with a very manageable seven characters. He adds three characters to reach 10, then two more in the third for 12, however, he only continues the stories of three of those 12 characters as he introduces 10 more in the fourth book. By the end of A Dance with Dragons, Martin had divided up his increasingly out-of-control story amidst 18 perspective characters and entered The Winds of Winter with up to 30(!) potential perspective characters whose stories require at least some degree of resolution!\nDividing 300k words among thirty characters means devoting the equivalent of one novelette to each character’s perspective, while somehow trying to tie them all together in a coherent manner. While it’s theoretically possible, I’ve never seen anyone accomplish anything even close to that degree of literary difficulty. Some readers might find it interesting to know that in addition to predicting Martin’s inability to finish his series, last year I also pointed out that Brandon Sanderson\nwould not be able to fix the technical problem\nwith ASOIAF and bring it to a proper conclusion.\nGiven that Sanderson has blundered into the same problem that did in Martin’s series, it appears that my observation was correct. And it also tends to confirm my opinion that despite his massive sales success, Sanderson is not in my league as an author of epic fantasy; that may well sound arrogant, but it’s not as if the sample size of works that, while unfinished, exceed the length of\nThe Lord of the Rings\n, are insufficient for a determinative comparison.\nAs any look at the forgotten bestsellers of 100 years ago will tell you, the best books are the ones that survive to be read by future generations, not those that sell best in their own day. And as Deng Xiaoping once said of the French Revolution, it’s just too soon for us to tell.\nDISCUSS ON SG",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-05T14:57:58+00:00"
}