{
  "url": "https://voxday.net/2025/01/13/the-conservative-rock-star/",
  "scraped_at": "2026-01-08T19:35:16.877231",
  "title": "The Conservative Rock Star",
  "date_display": "January 13, 2025",
  "date_iso": "2025-01-13T22:11:35+00:00",
  "date_from_url": "2025-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>L’il Benny has come a long way from his days as the openly imperialist Littlest Chickenhawk, and as the <em>Hollywood Reporter</em> – which is famous for its panegyrics to conservatives and Republicans – <a href=\"https://www.hollywoodreporter.com/news/politics-news/how-ben-shapiro-conquered-maga-verse-trump-1236104674/\">breathlessly reports</a>, his massive success is totally real, totally organic, and not at all fake and manufactured:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Shapiro admits that, yes, he was once a Never Trumper. “In 2016, I didn’t vote for either candidate because I didn’t know if President Trump was going to be conservative,” he says in a bit of self-serving revisionism. Like many other right wing media figures at the time, he eloquently spoke about Trump’s many moral failures and called him a joke — but eventually caved. He maintains, however, that his take on Trump as a person is basically the same. As he puts it to me on the plane, “My opinion of Trump characterologically has not changed.”</p><p>But once Trump was in office, “right away he nominated Justice [Neil] Gorsuch, and I put on a MAGA hat,” says Shapiro. “In 2020, obviously, I backed him. And in 2024, I gave money to his campaign, I fundraised for him. I campaigned in six states. If we back him and if he does the right things, which I think he will, then America will be great.”</p></blockquote><p>It’s mildly amusing that even a puff-piece article about Ben Shapiro can’t help but show what a complete fraud he is. The thing is, I knew Ben Shapiro back when he had a conscience. He made a conscious, informed decision to sell his soul and his mind for fame and money. And I can assure you, he knows better than anyone else what an intellectual imposter he is.</p><p>As for the so-called “fastest-growing conservative empire”, <em>the Daily Wire</em>, well, conservative Boomers have always been suckers for those who despise them pretending to be one of them. But <em>the Daily Wire</em> has never been able to conserve its professed positions and principles any more than conservatives managed to conserve marriage or the Ladies Room.</p><p>Universal Press Syndicate signed my WND column because they thought I was the intellectual heir to William F. Buckley. As it turns out, it’s Ben Shapiro who was his true heir. In more ways than one..</p><p><em><a href=\"https://socialgalactic.com/micropost/102eae43-9a78-40e0-8903-e790ae9a3c45\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "L’il Benny has come a long way from his days as the openly imperialist Littlest Chickenhawk, and as the\nHollywood Reporter\n– which is famous for its panegyrics to conservatives and Republicans –\nbreathlessly reports\n, his massive success is totally real, totally organic, and not at all fake and manufactured:\nShapiro admits that, yes, he was once a Never Trumper. “In 2016, I didn’t vote for either candidate because I didn’t know if President Trump was going to be conservative,” he says in a bit of self-serving revisionism. Like many other right wing media figures at the time, he eloquently spoke about Trump’s many moral failures and called him a joke — but eventually caved. He maintains, however, that his take on Trump as a person is basically the same. As he puts it to me on the plane, “My opinion of Trump characterologically has not changed.”\nBut once Trump was in office, “right away he nominated Justice [Neil] Gorsuch, and I put on a MAGA hat,” says Shapiro. “In 2020, obviously, I backed him. And in 2024, I gave money to his campaign, I fundraised for him. I campaigned in six states. If we back him and if he does the right things, which I think he will, then America will be great.”\nIt’s mildly amusing that even a puff-piece article about Ben Shapiro can’t help but show what a complete fraud he is. The thing is, I knew Ben Shapiro back when he had a conscience. He made a conscious, informed decision to sell his soul and his mind for fame and money. And I can assure you, he knows better than anyone else what an intellectual imposter he is.\nAs for the so-called “fastest-growing conservative empire”,\nthe Daily Wire\n, well, conservative Boomers have always been suckers for those who despise them pretending to be one of them. But\nthe Daily Wire\nhas never been able to conserve its professed positions and principles any more than conservatives managed to conserve marriage or the Ladies Room.\nUniversal Press Syndicate signed my WND column because they thought I was the intellectual heir to William F. Buckley. As it turns out, it’s Ben Shapiro who was his true heir. In more ways than one..\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "judeo-christianity",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-13T22:11:36+00:00"
}