{
  "url": "https://voxday.net/2025/01/16/the-real-victim-is-john-scalzi/",
  "scraped_at": "2026-01-08T19:35:35.237466",
  "title": "The Real Victim is John Scalzi",
  "date_display": "January 16, 2025",
  "date_iso": "2025-01-16T16:48:14+00:00",
  "date_from_url": "2025-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s truly remarkable how John Scalzi manages to take one of the most serious sexual assault scandals in the science fiction and fantasy world since the Breendoggle of 1954, and on the basis of his nodding acquaintance with a more successful and more famous colleague, <a href=\"https://whatever.scalzi.com/2025/01/15/taking-leave/\">make it all about himself</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>If you want to know when I pretty much drew a line though my friendship with Neil Gaiman, it was when Neil acknowledged that he made moves on his early-20s nanny on her first day of employment. This meant that the absolute best case scenario of this whole situation was that he didn’t have the sense or wisdom to understand that making a move on a woman 40 years his junior, economically dependent on him, and whom he had met just literally hours before, was an extremely questionable idea. And by extremely questionable I mean dude what the fuck how do you not understand the actual consent issues involved here. The answer I came to is he probably did understand, and that when all was said and done, the “absolute best case scenario,” which is still very terrible, was not where we would end up. And indeed, that’s not where we are today.</p></blockquote><p>Just what everyone wanted to know, right? Two paragraphs later, and surely he’s going to get to the point, right? Yeah, not so much.</p><p><em>Here are two things about me, one which you know and one which you may not…</em></p><p>Or not. However, he saves what is definitely the funniest part for the end.</p><p><em>Neil’s been a friend, and an important person to me, and someone I’ve been happy to know. But the friendship has been drawn down and done, and at this point, given everything I’ve written above, I don’t think he’ll complain much about that.</em></p><p>More to the point, I don’t think he’ll even notice. Here’s the thing. If you’ve got a friend, an important person to you, someone you consider a pretty good friend, don’t you have their phone number? And if they’re very publicly accused of criminal acts that you believe to be out of character, wouldn’t you, you know, <em>give them a call and talk to them?</em></p><p>This is a nice illustration of the dangers of clout-chasing. Scalzi pursued his nonexistent “friendship” with Gaiman with far more vigor and ardor than he ever pursued his wife. And now that his supposed friendship puts him directly in the line of suspicion – even Gaiman only wrote rapturously and rapaciously about raping nubile young women still in their teens, unlike Scalzi, Gaiman never publicly declared himself to be a rapist(1) – that very important friendship is over, whether the very important ex-friend realizes it or not.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“I’m a rapist. I’m one of those men who likes to force myself on women without their consent or desire and then batter them sexually. The details of how I do this are not particularly important at the moment — although I love when you try to make distinctions about “forcible rape” or “legitimate rape” because that gives me all sorts of wiggle room — but I will tell you one of the details about why I do it: I like to control women and, also and independently, I like to remind them how little control they have.”</p><p>– John Scalzi, 25 October 2012</p></blockquote><p><em>(1) Scalzi and his defenders are quick to point out that when Scalzi was declaring that he was a rapist, that he was only doing so satirically. Which not only misses the first point, it misses the second one as well. Because, first, the correct response to satire is more satire. He says something reprehensibly stupid, we pretend to take it seriously. Second, precisely what planet was Scalzi orbiting when he decided that writing rape satire as political commentary was either a) amusing or b) appropriate? What he and his fans believe to be a defense of one offense strikes most normal people as a public confession of guilt concerning a lesser one.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/55025a91-4125-4354-8665-6e2b83f357ec\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s truly remarkable how John Scalzi manages to take one of the most serious sexual assault scandals in the science fiction and fantasy world since the Breendoggle of 1954, and on the basis of his nodding acquaintance with a more successful and more famous colleague,\nmake it all about himself\n.\nIf you want to know when I pretty much drew a line though my friendship with Neil Gaiman, it was when Neil acknowledged that he made moves on his early-20s nanny on her first day of employment. This meant that the absolute best case scenario of this whole situation was that he didn’t have the sense or wisdom to understand that making a move on a woman 40 years his junior, economically dependent on him, and whom he had met just literally hours before, was an extremely questionable idea. And by extremely questionable I mean dude what the fuck how do you not understand the actual consent issues involved here. The answer I came to is he probably did understand, and that when all was said and done, the “absolute best case scenario,” which is still very terrible, was not where we would end up. And indeed, that’s not where we are today.\nJust what everyone wanted to know, right? Two paragraphs later, and surely he’s going to get to the point, right? Yeah, not so much.\nHere are two things about me, one which you know and one which you may not…\nOr not. However, he saves what is definitely the funniest part for the end.\nNeil’s been a friend, and an important person to me, and someone I’ve been happy to know. But the friendship has been drawn down and done, and at this point, given everything I’ve written above, I don’t think he’ll complain much about that.\nMore to the point, I don’t think he’ll even notice. Here’s the thing. If you’ve got a friend, an important person to you, someone you consider a pretty good friend, don’t you have their phone number? And if they’re very publicly accused of criminal acts that you believe to be out of character, wouldn’t you, you know,\ngive them a call and talk to them?\nThis is a nice illustration of the dangers of clout-chasing. Scalzi pursued his nonexistent “friendship” with Gaiman with far more vigor and ardor than he ever pursued his wife. And now that his supposed friendship puts him directly in the line of suspicion – even Gaiman only wrote rapturously and rapaciously about raping nubile young women still in their teens, unlike Scalzi, Gaiman never publicly declared himself to be a rapist(1) – that very important friendship is over, whether the very important ex-friend realizes it or not.\n“I’m a rapist. I’m one of those men who likes to force myself on women without their consent or desire and then batter them sexually. The details of how I do this are not particularly important at the moment — although I love when you try to make distinctions about “forcible rape” or “legitimate rape” because that gives me all sorts of wiggle room — but I will tell you one of the details about why I do it: I like to control women and, also and independently, I like to remind them how little control they have.”\n– John Scalzi, 25 October 2012\n(1) Scalzi and his defenders are quick to point out that when Scalzi was declaring that he was a rapist, that he was only doing so satirically. Which not only misses the first point, it misses the second one as well. Because, first, the correct response to satire is more satire. He says something reprehensibly stupid, we pretend to take it seriously. Second, precisely what planet was Scalzi orbiting when he decided that writing rape satire as political commentary was either a) amusing or b) appropriate? What he and his fans believe to be a defense of one offense strikes most normal people as a public confession of guilt concerning a lesser one.\nDISCUSS ON SG",
  "tags": [
    "#GaimanGate",
    "McRapey",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-16T16:59:41+00:00"
}