{
  "url": "https://voxday.net/2025/01/14/the-bad-road-not-taken/",
  "scraped_at": "2026-01-08T19:35:22.367753",
  "title": "The Bad Road Not Taken",
  "date_display": "January 14, 2025",
  "date_iso": "2025-01-14T18:36:47+00:00",
  "date_from_url": "2025-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When Arkhaven Comics launched, we made a non-obvious decision to stay out of the comic stores and the traditional distribution system. This significantly slowed our growth and our exposure to potential customers, but it has proven, over time, to have been the right decision. The reason we can say that is because, as Fandom Pulse reports, the primary distributor of comics to the comics stores, Diamond Comic Distributors, <a href=\"https://fandompulse.substack.com/p/diamond-comic-distributors-declares\">filed for bankruptcy today</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Diamond Comic Distributors has been on the decline for years as the former monolith in comic book store distribution, but now a message from their CEO revealed the company is filing chapter 11 bankruptcy.</p><p><em>Dear Valued Customer, I’m writing to share one of the most challenging messages of my career. Earlier today, Diamond made the difficult but necessary decision to file for Chapter 11 bankruptcy. This step is intended to stabilize our financial foundation and protect the most vital aspects of our business. This decision was not made lightly, and I understand that this news may be as difficult to hear as it is for me to share. The Diamond leadership team and I have worked tirelessly to avoid this outcome but the financial challenges we face have left us with no other viable option. Chapter 11 will provide us with the opportunity to restructure and address our financial obligations. This process will likely include the sale of key assets of Diamond Comic Distributors.</em></p></blockquote><p>This means that there are a lot of publishers who are wondering if they are going to get paid for the comics they delivered to Diamond over the last six months. Fortunately, Arkhaven is not one of them.</p><p><em><a href=\"https://socialgalactic.com/micropost/ac1df37a-dad3-462b-90db-d4dea45799a4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "When Arkhaven Comics launched, we made a non-obvious decision to stay out of the comic stores and the traditional distribution system. This significantly slowed our growth and our exposure to potential customers, but it has proven, over time, to have been the right decision. The reason we can say that is because, as Fandom Pulse reports, the primary distributor of comics to the comics stores, Diamond Comic Distributors,\nfiled for bankruptcy today\n:\nDiamond Comic Distributors has been on the decline for years as the former monolith in comic book store distribution, but now a message from their CEO revealed the company is filing chapter 11 bankruptcy.\nDear Valued Customer, I’m writing to share one of the most challenging messages of my career. Earlier today, Diamond made the difficult but necessary decision to file for Chapter 11 bankruptcy. This step is intended to stabilize our financial foundation and protect the most vital aspects of our business. This decision was not made lightly, and I understand that this news may be as difficult to hear as it is for me to share. The Diamond leadership team and I have worked tirelessly to avoid this outcome but the financial challenges we face have left us with no other viable option. Chapter 11 will provide us with the opportunity to restructure and address our financial obligations. This process will likely include the sale of key assets of Diamond Comic Distributors.\nThis means that there are a lot of publishers who are wondering if they are going to get paid for the comics they delivered to Diamond over the last six months. Fortunately, Arkhaven is not one of them.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-14T18:36:48+00:00"
}