{
  "url": "https://voxday.net/2025/01/01/they-didnt-have-to-take-the-bait/",
  "scraped_at": "2026-01-08T19:34:07.044323",
  "title": "They Didn’t Have to Take the Bait",
  "date_display": "January 1, 2025",
  "date_iso": "2025-01-01T18:45:02+00:00",
  "date_from_url": "2025-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ESR tries, and fails, <a href=\"https://x.com/esrtweet/status/1874211838193447125\">to defend his fellow Boomers</a> for their role in destroying America and wrecking the culture, economy, and demographics of the United States.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“Boomers and their crusade to tear down the entire past, resent to year zero, and reinvent culture. That’s what happened.” </em></p><p>Oh, no, Devon. It wasn’t that simple. You’re excused for not understanding this, because you weren’t there. I was. I’m a late Boomer, born in ’57. I can dimly remember the day JFK was shot. I watched the moon landing. My teens and early twenties coincided with the 1970s. I was there for it all. And even then, even in the 1970s, feeling a sense of subtle disintegration all around me, I already dimly grasped that we weren’t just falling. We were being <em>pushed</em>. But I was very young then; I wouldn’t come to fully understand why, and by whom, for almost another 30 years We Boomers didn’t burn down our heritage in a fit of thoughtless hedonism. I mean, we did some thoughtless hedonism, yeah, but that’s not where the real damage came from.</p><p>If you want to know where the damage came from, look up Yuri Bezmenov. Listen to him explain “demoralization” and the long game of Soviet culture-jamming against the West in general and the U.S. in particular. Reset to year zero was a <em>Marxist</em> idea. It was part of a suite of memetic weapons, infectious propaganda bombs deployed against the social and cultural cohesion of the “main enemy”. Often, they were successful in damaging us by leveraging not our vices but our virtues. Valorizing tolerance and liberality until they became helplessness in the face of more and more extreme forms of deviance was one of their attacks. We didn’t fall on our own. We were <em>pushed</em>. The Boomer fault wasn’t that we were hedonists or nihilists, it’s that we didn’t have sufficient cultural immune defenses against what was being done to us.</p><p>Why that is exactly is a long sad story that I’m still not sure I completely understand. But I can hit some highlights. One is that religion failed us. This is nobody’s fault and I don’t think it could have gone differently; it’s a failure that had been on the cards ever since the mechanistic worldview reached effective completion by Darwin. One of the things the Marxists did was work to accelerate the inevitable decay of religious authority. Secular conservatives failed us, too. They had one job – just <em>one</em> <em>job</em> – which was to explain why all those Chesterton’s fences shouldn’t be torn down. They utterly flubbed that on all three levels of awareness, analysis, and persuasion. <em>That</em> could have gone differently. It didn’t help that after the Army-McCarthy hearings in 1954 conservatives developed a severe case of cowardice about calling out Communist subversion. That may have been their single greatest dereliction of duty. The result was that over the next 50 years Communist institutional capture of academia and other institutions went almost unopposed.</p><p>Which is why today we struggle with “woke”. Most of us Boomers weren’t wreckers, even by accident. Most of us were <em>duped</em>. It’s easy to say in hindsight we should have done better, but the enemy was very clever and determined. Try not to judge us too harshly, kids. It’s nice to think that a later generation might have done better, but…I haven’t seen it happen yet.</p></blockquote><p>That excuse didn’t work for Eve and it won’t work for the Boomers. It’s true, there were iniquitous forces at work, but even at this late stage, ESR refuses to call out either the spiritual forces or the material forces responsible. Communism was certainly ONE of the ideologies that served those forces well, but it was far from the only one and it is about the only one that most Boomers reject now. Which, of course, is why they call it out while still rejecting Christianity, denouncing racism, and slavering over “our greatest ally”.</p><p>The Boomers were not pushed. They were lured into selling their souls for what they believed was a shiny, sexy, secular society that would be an improvement on the boring, restrictive, traditional Christian American society into which they were born. So they sold their souls and they wrecked their society. Is it their fault? Absolutely.</p><p>Is it only their fault? Absolutely not.</p><p>But the most damning thing about the Boomers isn’t what they did when they were young, it’s what they’re still doing now, by refusing to help the younger generations get out of debt, repair their demographics, and help make America what it was before the Boomers fell en masse, not some perverted foreigner’s delusional vision of greatness.</p><p>And yes, Generation X is already doing better, despite our flaws, weaknesses, and abortion-decimated numbers. Just ask our children.</p><p>Have you asked yours?</p><p><em><a href=\"https://socialgalactic.com/micropost/31affe8b-bfe2-4f46-a136-3fb73787db86\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "ESR tries, and fails,\nto defend his fellow Boomers\nfor their role in destroying America and wrecking the culture, economy, and demographics of the United States.\n“Boomers and their crusade to tear down the entire past, resent to year zero, and reinvent culture. That’s what happened.”\nOh, no, Devon. It wasn’t that simple. You’re excused for not understanding this, because you weren’t there. I was. I’m a late Boomer, born in ’57. I can dimly remember the day JFK was shot. I watched the moon landing. My teens and early twenties coincided with the 1970s. I was there for it all. And even then, even in the 1970s, feeling a sense of subtle disintegration all around me, I already dimly grasped that we weren’t just falling. We were being\npushed\n. But I was very young then; I wouldn’t come to fully understand why, and by whom, for almost another 30 years We Boomers didn’t burn down our heritage in a fit of thoughtless hedonism. I mean, we did some thoughtless hedonism, yeah, but that’s not where the real damage came from.\nIf you want to know where the damage came from, look up Yuri Bezmenov. Listen to him explain “demoralization” and the long game of Soviet culture-jamming against the West in general and the U.S. in particular. Reset to year zero was a\nMarxist\nidea. It was part of a suite of memetic weapons, infectious propaganda bombs deployed against the social and cultural cohesion of the “main enemy”. Often, they were successful in damaging us by leveraging not our vices but our virtues. Valorizing tolerance and liberality until they became helplessness in the face of more and more extreme forms of deviance was one of their attacks. We didn’t fall on our own. We were\npushed\n. The Boomer fault wasn’t that we were hedonists or nihilists, it’s that we didn’t have sufficient cultural immune defenses against what was being done to us.\nWhy that is exactly is a long sad story that I’m still not sure I completely understand. But I can hit some highlights. One is that religion failed us. This is nobody’s fault and I don’t think it could have gone differently; it’s a failure that had been on the cards ever since the mechanistic worldview reached effective completion by Darwin. One of the things the Marxists did was work to accelerate the inevitable decay of religious authority. Secular conservatives failed us, too. They had one job – just\none\njob\n– which was to explain why all those Chesterton’s fences shouldn’t be torn down. They utterly flubbed that on all three levels of awareness, analysis, and persuasion.\nThat\ncould have gone differently. It didn’t help that after the Army-McCarthy hearings in 1954 conservatives developed a severe case of cowardice about calling out Communist subversion. That may have been their single greatest dereliction of duty. The result was that over the next 50 years Communist institutional capture of academia and other institutions went almost unopposed.\nWhich is why today we struggle with “woke”. Most of us Boomers weren’t wreckers, even by accident. Most of us were\nduped\n. It’s easy to say in hindsight we should have done better, but the enemy was very clever and determined. Try not to judge us too harshly, kids. It’s nice to think that a later generation might have done better, but…I haven’t seen it happen yet.\nThat excuse didn’t work for Eve and it won’t work for the Boomers. It’s true, there were iniquitous forces at work, but even at this late stage, ESR refuses to call out either the spiritual forces or the material forces responsible. Communism was certainly ONE of the ideologies that served those forces well, but it was far from the only one and it is about the only one that most Boomers reject now. Which, of course, is why they call it out while still rejecting Christianity, denouncing racism, and slavering over “our greatest ally”.\nThe Boomers were not pushed. They were lured into selling their souls for what they believed was a shiny, sexy, secular society that would be an improvement on the boring, restrictive, traditional Christian American society into which they were born. So they sold their souls and they wrecked their society. Is it their fault? Absolutely.\nIs it only their fault? Absolutely not.\nBut the most damning thing about the Boomers isn’t what they did when they were young, it’s what they’re still doing now, by refusing to help the younger generations get out of debt, repair their demographics, and help make America what it was before the Boomers fell en masse, not some perverted foreigner’s delusional vision of greatness.\nAnd yes, Generation X is already doing better, despite our flaws, weaknesses, and abortion-decimated numbers. Just ask our children.\nHave you asked yours?\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-01T18:45:06+00:00"
}