{
  "url": "https://voxday.net/2025/01/04/we-are-the-elendilans/",
  "scraped_at": "2026-01-08T19:34:23.552674",
  "title": "We are the Elendilans",
  "date_display": "January 4, 2025",
  "date_iso": "2025-01-04T17:41:42+00:00",
  "date_from_url": "2025-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contemplations on the Tree of Woe <a href=\"https://treeofwoe.substack.com/p/goethe-and-faust-for-a-new-age\">contemplates the possibility</a> that JRR Tolkien is the Johann Wolfgang von Goethe of our Aenean Age.</p><p>The defining conflict of Elendil’s era, the Second Age of Middle Earth, is fought by the Last Alliance of Elves and Men. The Last Alliance is a coalition of the remnants of great powers, united in the aftermath of Númenor’s fall to resist the rising darkness of Sauron. After decades of brutal struggle, The Last Alliance of Elves and Men achieves its purpose: Sauron is defeated and the One Ring is taken from him. Yet the victory is bittersweet. Elendil falls in battle and his sword Narsil shattered. His son Isildur chooses to keep rather destroy the One Ring, ensuring that the seeds of future conflict are sown. The Elves, diminished by their sacrifice, begin their long retreat into the West, and the kingdoms of Men, though triumphant, are fractured and weakened. Thus begins the Third Age.</p><p>Tolkien’s Third Age is marked by many moments of heroism and beauty, but even at its height it is a shadow of the glorious Second Age. By the time of <em>The Lord of the Rings, </em>the Elves have faded, Númenor has become a memory, Arnor has been conquered, and Gondor has been reduced to a pale reflection of its former strength.</p><p>If what was true of Middle-Earth is true of our own era, then what lies ahead is neither the dawn of a golden age or the night of a dark age, but rather a long twilight—an era where the remnants of greatness, having averted or avoided total annihilation, nevertheless must struggle to resist an ever-encroaching darkness at great cost. The civilization, while noble, will bear terrible scars from this struggle. Its grandeur will be tempered by humility and its ambitions will be limited by necessity.</p><p>I thus finish this essay with an unsettled heart. Tolkien, I am convinced, is truly a cultural mythmaker as influential as Goethe; and Elendil, I am certain, is a hero cut from the same cloth as Aeneas.</p><p>But Aeneas’s cloth is the purple cloak worn to an emperor’s coronation; and Elendil’s cloth is the shroud worn to a king’s funeral. Rome was greater than Troy, but neither Arnor nor Gondor was as great as Númenor. Thus an Elendilian Age would not be as bright as an Aenean Age. Its destiny would be somewhere between the inspiring future of my original essay and the hellish future anticipated by my essay’s critics.</p><p>Yet this ought be no cause for despair. If the Aenean spirit or Tolkien’s northern courage means anything, it means that the fight must be fought regardless of the likelihood of success. And Tolkien’s myths remind us that even in decline, there is beauty, heroism, and meaning. The Elendilian Age, if it were to come, might not shine as brightly as the Faustian, or even the Aenean; but it would still carry forward the light of what came before. And in the end, that light—however faint—will be enough to illuminate the path for those who follow.</p><p>When one reads a book like <em>Brideshead Revisited</em>, one can’t help but be struck by the way its elegaic melancholy almost perfectly expresses the mood of the end of the American empire. Evelyn Waugh was writing at, and about, the end of the British Empire, which is why the emotional tone of his literary work is so familiar to the modern American reader. The Tree of Woe is, in my opinion, to observe that we are at the end of one age and entering into a new one; whether it is as dark and challenging as he anticipates is yet to be determined, but on the basis of the panopoly of known facts, certainly appears to be correct.</p><p>Read the whole thing there. It’s well worth it. And remember that the light of Christian civilization will survive so long as at least one of us possesses the courage to stand against the rising Dark.</p><p><em><a href=\"https://socialgalactic.com/micropost/0f2c57b1-407a-4d93-9332-724fdd194f54\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Contemplations on the Tree of Woe\ncontemplates the possibility\nthat JRR Tolkien is the Johann Wolfgang von Goethe of our Aenean Age.\nThe defining conflict of Elendil’s era, the Second Age of Middle Earth, is fought by the Last Alliance of Elves and Men. The Last Alliance is a coalition of the remnants of great powers, united in the aftermath of Númenor’s fall to resist the rising darkness of Sauron. After decades of brutal struggle, The Last Alliance of Elves and Men achieves its purpose: Sauron is defeated and the One Ring is taken from him. Yet the victory is bittersweet. Elendil falls in battle and his sword Narsil shattered. His son Isildur chooses to keep rather destroy the One Ring, ensuring that the seeds of future conflict are sown. The Elves, diminished by their sacrifice, begin their long retreat into the West, and the kingdoms of Men, though triumphant, are fractured and weakened. Thus begins the Third Age.\nTolkien’s Third Age is marked by many moments of heroism and beauty, but even at its height it is a shadow of the glorious Second Age. By the time of\nThe Lord of the Rings,\nthe Elves have faded, Númenor has become a memory, Arnor has been conquered, and Gondor has been reduced to a pale reflection of its former strength.\nIf what was true of Middle-Earth is true of our own era, then what lies ahead is neither the dawn of a golden age or the night of a dark age, but rather a long twilight—an era where the remnants of greatness, having averted or avoided total annihilation, nevertheless must struggle to resist an ever-encroaching darkness at great cost. The civilization, while noble, will bear terrible scars from this struggle. Its grandeur will be tempered by humility and its ambitions will be limited by necessity.\nI thus finish this essay with an unsettled heart. Tolkien, I am convinced, is truly a cultural mythmaker as influential as Goethe; and Elendil, I am certain, is a hero cut from the same cloth as Aeneas.\nBut Aeneas’s cloth is the purple cloak worn to an emperor’s coronation; and Elendil’s cloth is the shroud worn to a king’s funeral. Rome was greater than Troy, but neither Arnor nor Gondor was as great as Númenor. Thus an Elendilian Age would not be as bright as an Aenean Age. Its destiny would be somewhere between the inspiring future of my original essay and the hellish future anticipated by my essay’s critics.\nYet this ought be no cause for despair. If the Aenean spirit or Tolkien’s northern courage means anything, it means that the fight must be fought regardless of the likelihood of success. And Tolkien’s myths remind us that even in decline, there is beauty, heroism, and meaning. The Elendilian Age, if it were to come, might not shine as brightly as the Faustian, or even the Aenean; but it would still carry forward the light of what came before. And in the end, that light—however faint—will be enough to illuminate the path for those who follow.\nWhen one reads a book like\nBrideshead Revisited\n, one can’t help but be struck by the way its elegaic melancholy almost perfectly expresses the mood of the end of the American empire. Evelyn Waugh was writing at, and about, the end of the British Empire, which is why the emotional tone of his literary work is so familiar to the modern American reader. The Tree of Woe is, in my opinion, to observe that we are at the end of one age and entering into a new one; whether it is as dark and challenging as he anticipates is yet to be determined, but on the basis of the panopoly of known facts, certainly appears to be correct.\nRead the whole thing there. It’s well worth it. And remember that the light of Christian civilization will survive so long as at least one of us possesses the courage to stand against the rising Dark.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-04T17:41:45+00:00"
}