{
  "url": "https://voxday.net/2025/01/19/why-the-nfl-fixes-games/",
  "scraped_at": "2026-01-08T19:35:53.769762",
  "title": "Why the NFL Fixes Games",
  "date_display": "January 19, 2025",
  "date_iso": "2025-01-19T12:04:13+00:00",
  "date_from_url": "2025-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it genuinely amusing that the NFL expects us to believe that the Aaron Glenn-coached defense that supposedly played “lights out” and completely dominated the 14-2 Vikings, who supposedly didn’t show up at all for their biggest game of the year, just happened to be blown off their home field by giving up 45 points to a rookie quarterback playing in his second playoff game.</p><ul class=\"wp-block-list\"><li><strong>31 December: </strong><em>The Detroit Lions defensed was gashed throughout their Week 17 tilt with San Francisco. Though they were able to generate a pair of takeaways and ultimately win the game, the porous effort at times raises concerns about how the Lions’ defense will hold up in the postseason.</em></li><li><strong>11 January: </strong><em>Lions’ defense rewrites narrative in domination of Vikings. What more can you say about these Lions, who do not care what you say in the first place. But if you want their honest opinion, “it’s bulls**t,” said Alex Anzalone, the idea that the defense isn’t good enough for the team to win the Super Bowl. That was on Thursday. Three days later, Anzalone returned from a broken forearm and the Lions broke the Vikings, holding them to their fewest points of the season in the biggest game of the year.</em></li><li><strong>18 January: </strong><em>The truth is that what happened to the Lions against Washington was probably going to happen eventually. Their defense was cooked. Starters Aidan Hutchinson, Alim McNeill, Carlton Davis and Derrick Barnes were already out with injuries, and against Washington, cornerback Amik Robertson and safety Ifeatu Melifonwu left with injuries. On one of the last meaningful plays of the game, Commanders tight end Zach Ertz caught a pass for a first down and cornerback Morice Norris tackled him. Norris did not have a single tackle all year. He barely played.</em></li></ul><p>The Vikings and the Redskins (aka Commanders) have similarly high-powered offenses; the reason the Vikings finished with two more wins than Washington is because the Vikings had the #5 defense in the league while the Redskins were #18. But we’re supposed to believe that the heavily-injured Lions defense magically pulled it together for one week, in between poor showings against San Francisco and Washington.</p><p>Now compare the reactions of the two NFC North coaches after their big playoff upsets. Or, in the case of the Vikings-Rams game, “upset”. One coach was calm and unfazed in the face of league-dictated defeat, the other was near-distraught after experiencing the real thing.</p><ul class=\"wp-block-list\"><li><em>“I’ve got 100 percent confidence in our players, our coaches. We’ve got the right kind of things going on in this organization, but we’ve gotta find a way to play better as a team and complement each other and do the things we need to do to win games against the class of the NFL.”</em></li><li><em>“The whole point of doing what you is to get to the show, man. It’s why you play this game. And we fell. We fell short. It just hurts to lose. I don’t care if you’re the seventh seed, five seed, one seed, cause I’ve lost as all of them. And it stings and it hurts. It hurts.” Campbell was so emotional that his voice cracked as he spoke of his players.</em></li></ul><p>Translation: KOC knew the Vikings weren’t going to be permitted to win either game before kickoff. Campbell knew the divisional playoff was a real game, even if it was one in which <a href=\"https://x.com/NFL_Crazy_/status/1880815922212155755\">the refs were favoring them</a>, and the Lions still couldn’t get it done.</p><p><em>Dante Fowler Jr. nearly had a clutch tackle for loss against running back David Montgomery on third-and-2, but the officials nullified it due to a phantom face mask call.</em></p><p>Note to the NFL refs: we can see that a shoulder pad is not a face mask. This is why it it is so stupid for the NFL to fix the occasional game to try to setup its ideal matchups. Because they will eventually have to go full WWE to reliably get the results they prefer, or stop trying to play puppet master and simply let the games be played. Needless to say, the latter would be preferable, as the declining TV ratings for the playoff games tend to demonstrate.</p><p>The game that was fixed last night was the Chiefs-Texans game and everyone knows it. The thumb on the scale is simply getting too heavy to avoid noticing.</p><ul class=\"wp-block-list\"><li><strong>Sports Illustrated:</strong> <em>Patrick Mahomes followed up an absolute joke of a drawn personal foul penalty in Saturday’s 23–14 divisional round win over the Houston Texans—he wandered around the Kansas City Chiefs’ backfield like a lost old man on the beach wielding a metal detector before collapsing to the ground late, causing two defenders who were unable to redirect themselves to fall over him at the last second—with a second attempt to bait Texans defenders into a flag-worthy hit eight plays later… This isn’t just conspiratorial trash can banging by the way. The Associated Press noted that, since the 2022 postseason began, the Chiefs have gotten five roughing the passer calls in critical loser-goes-home games. Their opponents have not gotten one. This is enabling at its finest.</em>.. <em>After the game was over, Texans coach DeMeco Ryans said his team knew coming into the game that it was them against <span style=\"text-decoration: underline;\">everybody.</span> </em></li><li><strong>Outkick the Coverage: </strong><em>The Kansas City Chiefs are easy to like for a lot of different reasons, but when NFL officiating gets involved it ruins things for a lot of people. It adds legitimacy to the conspiracy theory that the Chiefs have allies wearing stripes in every game.</em></li><li><a href=\"https://x.com/WillKunkelFOX/status/1880787613105422723\">Will Anderson, Texans</a>: <em>“We knew it was going to be us versus the refs going into this game.”</em></li></ul><p>You know what they say about conspiracy theories: they’re just spoiler alerts from people who pay closer attention than most. The NFL appears to take four approaches to its games:</p><ol class=\"wp-block-list\"><li><strong>Let them play. </strong>This is how most games appear to go.</li><li><strong>Keep it close. </strong>When one team gets a big lead, the winning team is informed that the game is de facto over, then both teams put on a display as the losing team comes back, makes it close, but falls short in the end. This is excusable interference due to the unwillingness of about half the viewership to watch games that are not close. It’s a business, after all. Both Vikings-Packers games were good examples of this; after going up 28-0 at halftime, the Vikings did nothing for the last two quarters until their final possession, when they closed out a 31-29 win.</li><li><strong>Thumb on the scale.</strong> This is the sort of game that we saw with the 49ers and Patriots for years, and now with the Chiefs. One team gets all the calls at all the crucial moments, and while the other team is permitted to try to overcome them, it doesn’t happen very often. Last night’s game was an obvious example of this. The Lions also benefited from the referee’s calls, but it wasn’t enough.</li><li><strong>The straight fix.</strong> Both the Vikings-Lions and the Vikings-Rams games were clear-cut examples of this; I suspect the complete inability of the Vikings to keep either game close was a passive protest by KOC. The Rams appear to have replaced the Lions as the league’s preference this year due to the LA fires. If the 2009 narrative is any guide, we’ll see a Rams victory in the Super Bowl, presumably over the Chiefs or Ravens.</li></ol><p>The NFL is an entertainment product run by a very smart business enterprise. Which is why I have every confidence that the league’s strategists will realize that the optimal level of influence is minimal, and its interference with the organic results should be focused on maximizing viewers on a game-by-game basis, not a seasonal narrative one.</p><p>UPDATE: Mike Florio is concerned that the 45-point debacle might cost Aaron Glenn a shot at being hired as a head coach.</p><p><em>Yes, the Lions gave up 481 yards. Yes, Washington’s average gain was 6.6 yards per play. But the Lions’ defense was besieged with injuries, all season long. It was one after another after another, after another. And Glenn did a masterful job in Week 18, holding the Vikings to nine measly points.</em></p><p>Yeah, so, about that “masterful job”…</p><p><em><a href=\"https://socialgalactic.com/micropost/5a5616ee-76db-4d7a-95ab-9bfda9d97038\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I find it genuinely amusing that the NFL expects us to believe that the Aaron Glenn-coached defense that supposedly played “lights out” and completely dominated the 14-2 Vikings, who supposedly didn’t show up at all for their biggest game of the year, just happened to be blown off their home field by giving up 45 points to a rookie quarterback playing in his second playoff game.\n31 December:\nThe Detroit Lions defensed was gashed throughout their Week 17 tilt with San Francisco. Though they were able to generate a pair of takeaways and ultimately win the game, the porous effort at times raises concerns about how the Lions’ defense will hold up in the postseason.\n11 January:\nLions’ defense rewrites narrative in domination of Vikings. What more can you say about these Lions, who do not care what you say in the first place. But if you want their honest opinion, “it’s bulls**t,” said Alex Anzalone, the idea that the defense isn’t good enough for the team to win the Super Bowl. That was on Thursday. Three days later, Anzalone returned from a broken forearm and the Lions broke the Vikings, holding them to their fewest points of the season in the biggest game of the year.\n18 January:\nThe truth is that what happened to the Lions against Washington was probably going to happen eventually. Their defense was cooked. Starters Aidan Hutchinson, Alim McNeill, Carlton Davis and Derrick Barnes were already out with injuries, and against Washington, cornerback Amik Robertson and safety Ifeatu Melifonwu left with injuries. On one of the last meaningful plays of the game, Commanders tight end Zach Ertz caught a pass for a first down and cornerback Morice Norris tackled him. Norris did not have a single tackle all year. He barely played.\nThe Vikings and the Redskins (aka Commanders) have similarly high-powered offenses; the reason the Vikings finished with two more wins than Washington is because the Vikings had the #5 defense in the league while the Redskins were #18. But we’re supposed to believe that the heavily-injured Lions defense magically pulled it together for one week, in between poor showings against San Francisco and Washington.\nNow compare the reactions of the two NFC North coaches after their big playoff upsets. Or, in the case of the Vikings-Rams game, “upset”. One coach was calm and unfazed in the face of league-dictated defeat, the other was near-distraught after experiencing the real thing.\n“I’ve got 100 percent confidence in our players, our coaches. We’ve got the right kind of things going on in this organization, but we’ve gotta find a way to play better as a team and complement each other and do the things we need to do to win games against the class of the NFL.”\n“The whole point of doing what you is to get to the show, man. It’s why you play this game. And we fell. We fell short. It just hurts to lose. I don’t care if you’re the seventh seed, five seed, one seed, cause I’ve lost as all of them. And it stings and it hurts. It hurts.” Campbell was so emotional that his voice cracked as he spoke of his players.\nTranslation: KOC knew the Vikings weren’t going to be permitted to win either game before kickoff. Campbell knew the divisional playoff was a real game, even if it was one in which\nthe refs were favoring them\n, and the Lions still couldn’t get it done.\nDante Fowler Jr. nearly had a clutch tackle for loss against running back David Montgomery on third-and-2, but the officials nullified it due to a phantom face mask call.\nNote to the NFL refs: we can see that a shoulder pad is not a face mask. This is why it it is so stupid for the NFL to fix the occasional game to try to setup its ideal matchups. Because they will eventually have to go full WWE to reliably get the results they prefer, or stop trying to play puppet master and simply let the games be played. Needless to say, the latter would be preferable, as the declining TV ratings for the playoff games tend to demonstrate.\nThe game that was fixed last night was the Chiefs-Texans game and everyone knows it. The thumb on the scale is simply getting too heavy to avoid noticing.\nSports Illustrated:\nPatrick Mahomes followed up an absolute joke of a drawn personal foul penalty in Saturday’s 23–14 divisional round win over the Houston Texans—he wandered around the Kansas City Chiefs’ backfield like a lost old man on the beach wielding a metal detector before collapsing to the ground late, causing two defenders who were unable to redirect themselves to fall over him at the last second—with a second attempt to bait Texans defenders into a flag-worthy hit eight plays later… This isn’t just conspiratorial trash can banging by the way. The Associated Press noted that, since the 2022 postseason began, the Chiefs have gotten five roughing the passer calls in critical loser-goes-home games. Their opponents have not gotten one. This is enabling at its finest.\n..\nAfter the game was over, Texans coach DeMeco Ryans said his team knew coming into the game that it was them against\neverybody.\nOutkick the Coverage:\nThe Kansas City Chiefs are easy to like for a lot of different reasons, but when NFL officiating gets involved it ruins things for a lot of people. It adds legitimacy to the conspiracy theory that the Chiefs have allies wearing stripes in every game.\nWill Anderson, Texans\n:\n“We knew it was going to be us versus the refs going into this game.”\nYou know what they say about conspiracy theories: they’re just spoiler alerts from people who pay closer attention than most. The NFL appears to take four approaches to its games:\nLet them play.\nThis is how most games appear to go.\nKeep it close.\nWhen one team gets a big lead, the winning team is informed that the game is de facto over, then both teams put on a display as the losing team comes back, makes it close, but falls short in the end. This is excusable interference due to the unwillingness of about half the viewership to watch games that are not close. It’s a business, after all. Both Vikings-Packers games were good examples of this; after going up 28-0 at halftime, the Vikings did nothing for the last two quarters until their final possession, when they closed out a 31-29 win.\nThumb on the scale.\nThis is the sort of game that we saw with the 49ers and Patriots for years, and now with the Chiefs. One team gets all the calls at all the crucial moments, and while the other team is permitted to try to overcome them, it doesn’t happen very often. Last night’s game was an obvious example of this. The Lions also benefited from the referee’s calls, but it wasn’t enough.\nThe straight fix.\nBoth the Vikings-Lions and the Vikings-Rams games were clear-cut examples of this; I suspect the complete inability of the Vikings to keep either game close was a passive protest by KOC. The Rams appear to have replaced the Lions as the league’s preference this year due to the LA fires. If the 2009 narrative is any guide, we’ll see a Rams victory in the Super Bowl, presumably over the Chiefs or Ravens.\nThe NFL is an entertainment product run by a very smart business enterprise. Which is why I have every confidence that the league’s strategists will realize that the optimal level of influence is minimal, and its interference with the organic results should be focused on maximizing viewers on a game-by-game basis, not a seasonal narrative one.\nUPDATE: Mike Florio is concerned that the 45-point debacle might cost Aaron Glenn a shot at being hired as a head coach.\nYes, the Lions gave up 481 yards. Yes, Washington’s average gain was 6.6 yards per play. But the Lions’ defense was besieged with injuries, all season long. It was one after another after another, after another. And Glenn did a masterful job in Week 18, holding the Vikings to nine measly points.\nYeah, so, about that “masterful job”…\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-01-19T16:08:06+00:00"
}