{
  "url": "https://voxday.net/2011/12/29/bachmans-chairman-endorses-pau/",
  "scraped_at": "2025-12-14T04:43:06.885386",
  "title": "Bachman’s chairman endorses Paul",
  "date_display": "December 29, 2011",
  "date_iso": "2011-12-29T09:10:00+00:00",
  "date_from_url": "2011-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Iowa chairman for Michele Bachmann’s campaign, Iowa State Senator Kent Sorenson (R-Indianola), leaves her campaign in order to endorse Ron Paul.</i></p><p>“The decision I am making today is one of the most difficult I have made in my life. But given what’s at stake for our country, I have decided I must take this action.</p><p>Today, I am switching my support from Michele Bachmann to Ron Paul for the 2012 Iowa Caucuses and the presidency of the United States.</p><p>I still maintain an immense amount of respect for Michele. The reasons are many. She’s never betrayed conservatives on issues like taxes, the Right to Life, and the Second Amendment. So over the past few months, I have been saddened at the dismissive way she’s been treated among some conservatives especially after winning the Iowa Straw Poll.</p><p>But the fact is, there is a clear top tier in the race for the Republican nomination for President, both here in Iowa and nationally. Ron Paul is easily the most conservative of this group.</p><p>The truth is, it was an excruciatingly difficult decision for me to decide between supporting Michele Bachmann and Ron Paul at the beginning of this campaign. Dr. Paul and his supporters were a major help in my successful campaigns for Iowa House and Senate even when I couldn’t count on the support of the Republican establishment here in Iowa.</p><p>Of course, battling the establishment is nothing new for Dr. Paul or for myself. During my time in the General Assembly, I’ve established myself as a leader in the fights for traditional marriage, the Right to Life, and the protection of the Second Amendment – sometimes even against the wishes of my own party.</p><p>Since my election, I’ve learned that doing the right thing isn’t always easy. It’s easy to see why so many legislators “sell out” once elected. The pressure to do so is immense.</p><p>But what America needs now is a President who will not just “go along to get along.” Instead, we must send someone who puts doing what is right above all else to the White House. That candidate is Ron Paul.</p><p>Ron Paul is the only candidate to predict the current mess we find ourselves in economically, and he’s the only candidate to offer a true plan to cut spending and balance our budget.</p><p>He’s also consistently spoken out against government spending, assaults on individual liberties, and unnecessary trillion-dollar military adventurism for over 30 years. Polls show he is the Republican candidate that can take on and defeat President Obama in November 2012.</p><p>Like all true conservatives, I wholeheartedly agree with Ron Paul that government is too big, and both parties share in the blame. We agree that it is immoral to print money and pass on mounds of debt to the next generation. We agree that life begins at conception and must be protected. We both believe that the Second Amendment must be defended unwaveringly, and that there are too many wars being fought with no end in sight and no obvious path to a defined victory.</p><p>Of course, as a state legislator, I recognize that Dr. Paul’s strong views on the 10th Amendment will enable me to fight for what I believe in right in my own backyard instead of having to constantly wait on one-size-fits-all “solutions” from Washington, D.C.</p><p>With the entire Republican establishment intent on smearing Ron Paul and his dedicated supporters, I understand this decision could impact the way people see me and my entire political career. But this is the right decision, and one in which I proudly stand behind.</p><p>To the truly wonderful people I met on the Bachmann campaign, I look forward to working with them in the future as we further the fights for the Right to Life, traditional marriage, and the restoration of our Second Amendment rights here in Iowa. I personally wish her all the best as she continues to battle in Congress.</p><p>As for conservatives who are rightly concerned with defeating establishment Republicans Mitt Romney, Newt Gingrich and – even more importantly – Barack Obama in 2012, Ron Paul has established himself as the clear choice.</p><p>If you are as frustrated as I am with what’s been done by the ruling class, I urge you to join me in supporting Dr. Paul. We can send the national big government political establishment a message they will never forget by voting for Ron Paul for President in the January 3 Iowa Caucuses.”</p><p>It turns out that <a href=\"http://libertymaven.com/2011/12/29/michelle-bachmanns-own-political-director-claims-she-lied-about-ron-paul-defection/12051/\">Michele Bachman is a liar</a>, as her own political director has come out and stated that Iowa campaign manager did not quit due to financial incentives: <i>“I won’t say much about the situation or the conflicting statements beyond this; I can say unequivocally that Kent Sorenson’s decision was, in no way financially motivated. His decision had more to do with the fact that the Ron Paul supporters have been something of a family to him since he was first elected in 2008 and here in the end, as it becomes more and more apparent that the caucus cycle is coming to an end, Kent believed that he needed to be with them as they stand on the cusp of a potential caucus upset. While I personally disagree with Kent’s decision, and plan to stay with Michele Bachmann because I truly believe in her, I cannot, in good conscious watch a good man like Kent Sorenson be attacked as a ‘sell-out’ ….That is simply not the case, and it was not the basis of his decision,” said Mr. Enos.”</i></p><p>It surprised some that I was so contemptuous of Bachmann.  But you see, she’s from Minnesota and I am very well acquainted with a few people who know her.  And it doesn’t surprise me at all that she has shown herself to be untrustworthy, because I had already heard that about her.</p></div>",
  "content_text": "The Iowa chairman for Michele Bachmann’s campaign, Iowa State Senator Kent Sorenson (R-Indianola), leaves her campaign in order to endorse Ron Paul.\n“The decision I am making today is one of the most difficult I have made in my life. But given what’s at stake for our country, I have decided I must take this action.\nToday, I am switching my support from Michele Bachmann to Ron Paul for the 2012 Iowa Caucuses and the presidency of the United States.\nI still maintain an immense amount of respect for Michele. The reasons are many. She’s never betrayed conservatives on issues like taxes, the Right to Life, and the Second Amendment. So over the past few months, I have been saddened at the dismissive way she’s been treated among some conservatives especially after winning the Iowa Straw Poll.\nBut the fact is, there is a clear top tier in the race for the Republican nomination for President, both here in Iowa and nationally. Ron Paul is easily the most conservative of this group.\nThe truth is, it was an excruciatingly difficult decision for me to decide between supporting Michele Bachmann and Ron Paul at the beginning of this campaign. Dr. Paul and his supporters were a major help in my successful campaigns for Iowa House and Senate even when I couldn’t count on the support of the Republican establishment here in Iowa.\nOf course, battling the establishment is nothing new for Dr. Paul or for myself. During my time in the General Assembly, I’ve established myself as a leader in the fights for traditional marriage, the Right to Life, and the protection of the Second Amendment – sometimes even against the wishes of my own party.\nSince my election, I’ve learned that doing the right thing isn’t always easy. It’s easy to see why so many legislators “sell out” once elected. The pressure to do so is immense.\nBut what America needs now is a President who will not just “go along to get along.” Instead, we must send someone who puts doing what is right above all else to the White House. That candidate is Ron Paul.\nRon Paul is the only candidate to predict the current mess we find ourselves in economically, and he’s the only candidate to offer a true plan to cut spending and balance our budget.\nHe’s also consistently spoken out against government spending, assaults on individual liberties, and unnecessary trillion-dollar military adventurism for over 30 years. Polls show he is the Republican candidate that can take on and defeat President Obama in November 2012.\nLike all true conservatives, I wholeheartedly agree with Ron Paul that government is too big, and both parties share in the blame. We agree that it is immoral to print money and pass on mounds of debt to the next generation. We agree that life begins at conception and must be protected. We both believe that the Second Amendment must be defended unwaveringly, and that there are too many wars being fought with no end in sight and no obvious path to a defined victory.\nOf course, as a state legislator, I recognize that Dr. Paul’s strong views on the 10th Amendment will enable me to fight for what I believe in right in my own backyard instead of having to constantly wait on one-size-fits-all “solutions” from Washington, D.C.\nWith the entire Republican establishment intent on smearing Ron Paul and his dedicated supporters, I understand this decision could impact the way people see me and my entire political career. But this is the right decision, and one in which I proudly stand behind.\nTo the truly wonderful people I met on the Bachmann campaign, I look forward to working with them in the future as we further the fights for the Right to Life, traditional marriage, and the restoration of our Second Amendment rights here in Iowa. I personally wish her all the best as she continues to battle in Congress.\nAs for conservatives who are rightly concerned with defeating establishment Republicans Mitt Romney, Newt Gingrich and – even more importantly – Barack Obama in 2012, Ron Paul has established himself as the clear choice.\nIf you are as frustrated as I am with what’s been done by the ruling class, I urge you to join me in supporting Dr. Paul. We can send the national big government political establishment a message they will never forget by voting for Ron Paul for President in the January 3 Iowa Caucuses.”\nIt turns out that\nMichele Bachman is a liar\n, as her own political director has come out and stated that Iowa campaign manager did not quit due to financial incentives:\n“I won’t say much about the situation or the conflicting statements beyond this; I can say unequivocally that Kent Sorenson’s decision was, in no way financially motivated. His decision had more to do with the fact that the Ron Paul supporters have been something of a family to him since he was first elected in 2008 and here in the end, as it becomes more and more apparent that the caucus cycle is coming to an end, Kent believed that he needed to be with them as they stand on the cusp of a potential caucus upset. While I personally disagree with Kent’s decision, and plan to stay with Michele Bachmann because I truly believe in her, I cannot, in good conscious watch a good man like Kent Sorenson be attacked as a ‘sell-out’ ….That is simply not the case, and it was not the basis of his decision,” said Mr. Enos.”\nIt surprised some that I was so contemptuous of Bachmann.  But you see, she’s from Minnesota and I am very well acquainted with a few people who know her.  And it doesn’t surprise me at all that she has shown herself to be untrustworthy, because I had already heard that about her.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-29T09:10:00+00:00"
}