{
  "url": "https://voxday.net/2011/12/19/book-review-embassytown/",
  "scraped_at": "2025-12-14T04:42:15.613517",
  "title": "Book Review –Embassytown",
  "date_display": "December 19, 2011",
  "date_iso": "2011-12-19T00:21:00+00:00",
  "date_from_url": "2011-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Embassytown </em>by China Mieville<br> Del Rey (368 pages, $26.00, May 2011)</br></p><p><em>Embassytown </em>is an excellent and astonishingly original science fiction novel.  It is also a clever subversion of C.S. Lewis’s <em>Perelandra</em>, defending as it does a literally Satanic theme in its rationalization of the intentional corruption of innocence.  As such, it could be considered to be a philosophical novel of the sort that Umberto Eco writes; this is the sole aspect of the book that is both weak and unoriginal.  But the trivial nature of the philosophical aspect does not detract from the novel in the slightest, as very few readers indeed will be aware of either the subversion or the subtext despite the relatively clear suggestions provided by Mieville.</p><p>The story concerns a human colony of the future that is established on a very distant planet inhabited by a strange and sentient alien race that speaks a unique language that involves two simultaneous voices.  In order to communicate with the aliens, it is necessary for humans to speak in specially trained, genetically identical pairs because the alien’s link between Language and mind is such that the aliens cannot understand the sounds even if they are reproduced accurately by machines or unrelated human pairs.  These trained pairs, called Ambassadors, are the colony’s only means of communicating with the aliens, whose biotechnology is required for them to survive given their very limited support from the human empire to which they owe a rather tenuous allegiance.</p><p>Read the rest at <a href=\"http://www.blackgate.com/2011/12/18/review-embassytown/\">The Black Gate</a>.</p></div>",
  "content_text": "Embassytown\nby China Mieville\nDel Rey (368 pages, $26.00, May 2011)\nEmbassytown\nis an excellent and astonishingly original science fiction novel.  It is also a clever subversion of C.S. Lewis’s\nPerelandra\n, defending as it does a literally Satanic theme in its rationalization of the intentional corruption of innocence.  As such, it could be considered to be a philosophical novel of the sort that Umberto Eco writes; this is the sole aspect of the book that is both weak and unoriginal.  But the trivial nature of the philosophical aspect does not detract from the novel in the slightest, as very few readers indeed will be aware of either the subversion or the subtext despite the relatively clear suggestions provided by Mieville.\nThe story concerns a human colony of the future that is established on a very distant planet inhabited by a strange and sentient alien race that speaks a unique language that involves two simultaneous voices.  In order to communicate with the aliens, it is necessary for humans to speak in specially trained, genetically identical pairs because the alien’s link between Language and mind is such that the aliens cannot understand the sounds even if they are reproduced accurately by machines or unrelated human pairs.  These trained pairs, called Ambassadors, are the colony’s only means of communicating with the aliens, whose biotechnology is required for them to survive given their very limited support from the human empire to which they owe a rather tenuous allegiance.\nRead the rest at\nThe Black Gate\n.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-19T00:21:00+00:00"
}