{
  "url": "https://voxday.net/2011/12/28/discredited-campaign/",
  "scraped_at": "2025-12-14T04:43:01.422040",
  "title": "The “discredited” campaign",
  "date_display": "December 28, 2011",
  "date_iso": "2011-12-28T11:05:00+00:00",
  "date_from_url": "2011-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times unintentionally recognizes <a href=\"http://www.nytimes.com/2011/12/28/opinion/mr-pauls-discredited-campaign.html?hpw\">the legitimacy of Ron Paul’s presidential campaign</a>:</p><blockquote><p>Ron Paul long ago disqualified himself for the presidency by peddling claptrap proposals like abolishing the Federal Reserve, returning to the gold standard, cutting a third of the federal budget and all foreign aid and opposing the Civil Rights Act of 1964.  Now, making things worse, he has failed to convincingly repudiate racist remarks that were published under his name for years — or the enthusiastic support he is getting from racist groups.</p></blockquote><p>I find it extremely encouraging that both the Democratic and Republican establishments are training their biggest guns on Ron Paul while simultaneously attempting to play down the results of the Iowa caucuses.  They never would have bothered to do so if Paul’s message was not resonating with Americans across the political and ideological divides.  We are learning a lot here as a result of the various reactions to the Paul campaign, whether it is the willingness of Republicans to play the race card about which they so often complain, the remarkable extent to which Newt Gingrich is big government moderate rather than the conservative flamethrower he feigned to be in 1994, and the way in which many Republicans who pretend to revere the Constitution do not, in fact, harbor any real respect for it at all.</p><p>In short, Ron Paul has successfully opened the eyes of millions of Americans to the corruption and anti-conservate, anti-constitutional ideology of the Republican Party.  This is the first step in helping them understand that the Republicans and Democrats are merely two barely distinguishable factions in the one party that has ruled America for over a century.</p><p>It is also interesting to note the Communist-style ideological lockstep demanded by Republicans.  In the same way that some readers here cannot understand that I permit commenters here to post comments they find offensive without that permission indicating my position on the matter – even though they know I disgree with, but permit, their own comments – the demands that Paul denounce any of his supporters reveals a fundamentally totalitarian mindset of the sort that has pervaded the conservative media since William F. Buckley was seduced by the Wilsonian neocons.</p><p>One thing I found particularly informative in this regard was John Hinderaker’s endorsement of Mitt Romney.  I’ve known that the former Hindrocket of the Northern Alliance Radio Show was an ideologically squishy political creature since appearing on that show, and <a href=\"http://www.powerlineblog.com/archives/2011/12/for-president-in-2012-mitt-romney.php\">his endorsement of Mitt Romney</a> is the full flowering of what has historically been known as “growth”.</p><blockquote><p>The “anybody but Romney” mentality that grips many Republicans is, in my view, illogical. It led them to embrace Rick Perry, who turned out to be unable to articulate a conservative thought; Newt Gingrich, whose record is far more checkered than Romney’s; Ron Paul, whose foreign policy views–indistinguishable from those of the far left–and forays into racial intolerance make him unfit to be president; and Michele Bachmann, whom I like very much, but who is more qualified to be a rabble-rouser than a chief executive.</p></blockquote><p>It is deeply amusing indeed to see Hindrocket assert that Paul’s foreign policy views are “indistinguishable from those of the far left” on the very day that the New York Times is publishing an editorial that could easily bear his byline, given the remarkably similar language; for example, Hinderaker says Paul is “unfit” versus the NTY’s “discredited”.  And Hinderaker’s statement about Paul’s foreign policy is astonishingly deceitful, as far left foreign policy is not the least bit isolationist, but is the exact same world revolution approach that is presently favored by Hinderaker and the Republican establishment, only its focus is world <i>socialist </i>revolution rather than world <i>democratic </i>revolution.</p><p>And Hinderaker is as wrong about Romney’s ability to beat Obama as all the usual suspects in the conservative media were wrong about McCain’s ability to win in 2008.  John Hawkins <a href=\"http://townhall.com/columnists/johnhawkins/2011/12/27/7_reasons_why_mitt_romneys_electability_is_a_myth\">list seven reasons</a> why Romney’s supposed electability is a myth.  I’ll add another reason: after the way he is being treated by the Republican Party establishment and the way the Tea Party-elected House Republicans have proven themselves to be the same fiscally irresponsible rollover Republicans their historical predecessors were, Ron Paul has absolutely no reason not to run in the general election as a third party candidate, ideally as the endorsed candidate of the Constitution and Libertarian Parties.</p><p>I very much hope he will do so.  As the Bush family has taught us, better an openly declared enemy in power than a false and fraudulent “friend”.</p></div>",
  "content_text": "The New York Times unintentionally recognizes\nthe legitimacy of Ron Paul’s presidential campaign\n:\nRon Paul long ago disqualified himself for the presidency by peddling claptrap proposals like abolishing the Federal Reserve, returning to the gold standard, cutting a third of the federal budget and all foreign aid and opposing the Civil Rights Act of 1964.  Now, making things worse, he has failed to convincingly repudiate racist remarks that were published under his name for years — or the enthusiastic support he is getting from racist groups.\nI find it extremely encouraging that both the Democratic and Republican establishments are training their biggest guns on Ron Paul while simultaneously attempting to play down the results of the Iowa caucuses.  They never would have bothered to do so if Paul’s message was not resonating with Americans across the political and ideological divides.  We are learning a lot here as a result of the various reactions to the Paul campaign, whether it is the willingness of Republicans to play the race card about which they so often complain, the remarkable extent to which Newt Gingrich is big government moderate rather than the conservative flamethrower he feigned to be in 1994, and the way in which many Republicans who pretend to revere the Constitution do not, in fact, harbor any real respect for it at all.\nIn short, Ron Paul has successfully opened the eyes of millions of Americans to the corruption and anti-conservate, anti-constitutional ideology of the Republican Party.  This is the first step in helping them understand that the Republicans and Democrats are merely two barely distinguishable factions in the one party that has ruled America for over a century.\nIt is also interesting to note the Communist-style ideological lockstep demanded by Republicans.  In the same way that some readers here cannot understand that I permit commenters here to post comments they find offensive without that permission indicating my position on the matter – even though they know I disgree with, but permit, their own comments – the demands that Paul denounce any of his supporters reveals a fundamentally totalitarian mindset of the sort that has pervaded the conservative media since William F. Buckley was seduced by the Wilsonian neocons.\nOne thing I found particularly informative in this regard was John Hinderaker’s endorsement of Mitt Romney.  I’ve known that the former Hindrocket of the Northern Alliance Radio Show was an ideologically squishy political creature since appearing on that show, and\nhis endorsement of Mitt Romney\nis the full flowering of what has historically been known as “growth”.\nThe “anybody but Romney” mentality that grips many Republicans is, in my view, illogical. It led them to embrace Rick Perry, who turned out to be unable to articulate a conservative thought; Newt Gingrich, whose record is far more checkered than Romney’s; Ron Paul, whose foreign policy views–indistinguishable from those of the far left–and forays into racial intolerance make him unfit to be president; and Michele Bachmann, whom I like very much, but who is more qualified to be a rabble-rouser than a chief executive.\nIt is deeply amusing indeed to see Hindrocket assert that Paul’s foreign policy views are “indistinguishable from those of the far left” on the very day that the New York Times is publishing an editorial that could easily bear his byline, given the remarkably similar language; for example, Hinderaker says Paul is “unfit” versus the NTY’s “discredited”.  And Hinderaker’s statement about Paul’s foreign policy is astonishingly deceitful, as far left foreign policy is not the least bit isolationist, but is the exact same world revolution approach that is presently favored by Hinderaker and the Republican establishment, only its focus is world\nsocialist\nrevolution rather than world\ndemocratic\nrevolution.\nAnd Hinderaker is as wrong about Romney’s ability to beat Obama as all the usual suspects in the conservative media were wrong about McCain’s ability to win in 2008.  John Hawkins\nlist seven reasons\nwhy Romney’s supposed electability is a myth.  I’ll add another reason: after the way he is being treated by the Republican Party establishment and the way the Tea Party-elected House Republicans have proven themselves to be the same fiscally irresponsible rollover Republicans their historical predecessors were, Ron Paul has absolutely no reason not to run in the general election as a third party candidate, ideally as the endorsed candidate of the Constitution and Libertarian Parties.\nI very much hope he will do so.  As the Bush family has taught us, better an openly declared enemy in power than a false and fraudulent “friend”.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-28T11:05:00+00:00"
}