{
  "url": "https://voxday.net/2011/12/18/drug-war-against-economy/",
  "scraped_at": "2025-12-14T04:42:11.933364",
  "title": "The drug war against the economy",
  "date_display": "December 18, 2011",
  "date_iso": "2011-12-18T12:14:00+00:00",
  "date_from_url": "2011-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed chronicles one effective way for G to GDP:</p><blockquote><p>When I arrived in Mexico going on ten years ago, it was a mildly sleepy upper-Third World country, whatever that means—corrupt but not dangerous, not rich but hardly poor, barely middle-class overall and climbing, the mañana thing seldom noticeable, and women pouring into the professions. I parodied the American conception of Mexico as perilous hell-hole because it wasn’t. Not even close.</p><p>Then in 2006 Felipe Calderón became president, and declared war on the drug cartels. Mexicans I talk to think he did it under pressure from Washington, but I don’t know. Certainly Washington has done everything in its power to encourage it.</p><p>The war failed, as anyone with even a vague understanding of the world would have predicted. A war on drugs—foolish phrase—may be said to succeed if the price of drugs rises on the American street. It didn’t. It won’t.</p><p>Things happened that were touted as successes against the traficantes. A fair number of bosses of important cartels were killed or caught. Since Americans confuse leaders with movements and countries, this sounded like progress. Of course if, for example, you kill a leader of the “Taliban,” his second takes over within hours and all goes on as before. And if you kill the leader of a cartel, his underlings fight among themselves for the pieces, thousainds die, and law breaks down. Mexicans know this. The State Department apparently doesn’t.</p><p>Meanwhile, as always, drugs remain everywhere available in America.</p><p>At first the killing remained largely in the northern states, Chihuahua, Sonora, Sinaloa, Tamaulipas, and such, with patches south in Jalisco and, especially, Michoacan. The gringos who lived around Lake Chapala, an hour south of Guadalajara, were not much affected.</p><p>Then the mayhem arrived here at Lakeside. In recent months the gringo havens along the lake have seen firefights with automatic weapons and grenades. Bodies are frequently found. Very frequently. Until recently no gringos were killed. The narcos were fighting among themselves and against the police. Expats didn’t, and so far don’t, interest them.</p><p>A few days ago an American was killed in Ajijic, the epicenter of gringolandia. It was just an armed robbery gone bad. The narcos had nothing to do with it. Thing is, when the country falls into chaos because ofthe war against drugs, every other kind of crime follows.</p><p>The expats have begun moving out. Realtors report large numbers of houses going on the block. If this continues, and I see no reason why it won’t, restaurants will continue to close, maids and gardeners will lose their jobs, and the doctors and dentists that serve the expatriates will leave. Today a local Spanish website reports a fall of fifty percent in trade at eateries. If this continues, tourism, a crucial business in Mexico, will disappear. Already, we hear, the cruise ships have stopped going to Puerto Vallarta.</p></blockquote><p>Prohibition never works very well and often the costs significantly exceed the benefits.  And creating crime <i>ex nihilo</i> only serves to turn law-abiding citizens into criminals, it seldom significantly modifies their behavior.  Just as you won’t stop reading the Bible or playing chess if such activities were made illegal, most people won’t stop drinking or doing drugs.  Perhaps if pro-drug war Americans are unconcerned about the loss of Constitutional rights, the immorality, or the foreign instability created by the drug war, they will be more responsive to the way in which it is obviously serving as a negative fiscal multiplier now that the global economy is in contraction.</p></div>",
  "content_text": "Fred Reed chronicles one effective way for G to GDP:\nWhen I arrived in Mexico going on ten years ago, it was a mildly sleepy upper-Third World country, whatever that means—corrupt but not dangerous, not rich but hardly poor, barely middle-class overall and climbing, the mañana thing seldom noticeable, and women pouring into the professions. I parodied the American conception of Mexico as perilous hell-hole because it wasn’t. Not even close.\nThen in 2006 Felipe Calderón became president, and declared war on the drug cartels. Mexicans I talk to think he did it under pressure from Washington, but I don’t know. Certainly Washington has done everything in its power to encourage it.\nThe war failed, as anyone with even a vague understanding of the world would have predicted. A war on drugs—foolish phrase—may be said to succeed if the price of drugs rises on the American street. It didn’t. It won’t.\nThings happened that were touted as successes against the traficantes. A fair number of bosses of important cartels were killed or caught. Since Americans confuse leaders with movements and countries, this sounded like progress. Of course if, for example, you kill a leader of the “Taliban,” his second takes over within hours and all goes on as before. And if you kill the leader of a cartel, his underlings fight among themselves for the pieces, thousainds die, and law breaks down. Mexicans know this. The State Department apparently doesn’t.\nMeanwhile, as always, drugs remain everywhere available in America.\nAt first the killing remained largely in the northern states, Chihuahua, Sonora, Sinaloa, Tamaulipas, and such, with patches south in Jalisco and, especially, Michoacan. The gringos who lived around Lake Chapala, an hour south of Guadalajara, were not much affected.\nThen the mayhem arrived here at Lakeside. In recent months the gringo havens along the lake have seen firefights with automatic weapons and grenades. Bodies are frequently found. Very frequently. Until recently no gringos were killed. The narcos were fighting among themselves and against the police. Expats didn’t, and so far don’t, interest them.\nA few days ago an American was killed in Ajijic, the epicenter of gringolandia. It was just an armed robbery gone bad. The narcos had nothing to do with it. Thing is, when the country falls into chaos because ofthe war against drugs, every other kind of crime follows.\nThe expats have begun moving out. Realtors report large numbers of houses going on the block. If this continues, and I see no reason why it won’t, restaurants will continue to close, maids and gardeners will lose their jobs, and the doctors and dentists that serve the expatriates will leave. Today a local Spanish website reports a fall of fifty percent in trade at eateries. If this continues, tourism, a crucial business in Mexico, will disappear. Already, we hear, the cruise ships have stopped going to Puerto Vallarta.\nProhibition never works very well and often the costs significantly exceed the benefits.  And creating crime\nex nihilo\nonly serves to turn law-abiding citizens into criminals, it seldom significantly modifies their behavior.  Just as you won’t stop reading the Bible or playing chess if such activities were made illegal, most people won’t stop drinking or doing drugs.  Perhaps if pro-drug war Americans are unconcerned about the loss of Constitutional rights, the immorality, or the foreign instability created by the drug war, they will be more responsive to the way in which it is obviously serving as a negative fiscal multiplier now that the global economy is in contraction.",
  "tags": [
    "economics",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-18T12:14:00+00:00"
}