{
  "url": "https://voxday.net/2011/12/22/explaining-economics-to-epj/",
  "scraped_at": "2025-12-14T04:42:33.930213",
  "title": "Explaining economics to the EPJ",
  "date_display": "December 22, 2011",
  "date_iso": "2011-12-22T11:22:00+00:00",
  "date_from_url": "2011-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even in response to public criticism, it seems a little strange to have to explain what is quite literally textbook economics doctrine to someone writing for the Economic Policy Journal.  Yesterday, Robert Wenzel claimed <a href=\"http://www.economicpolicyjournal.com/2011/12/vox-popoli-gets-caught-in-denninger.html\">“Vox Popoli is caught in the quicksand hailing Denninger nonsense”</a> and attempted to explain himself thusly:</p><blockquote><p>First off, credit is not money. Money in the United States at present is the dollar. The Federal Reserve can create more money by buying credit instruments, but they could buy anything.  First off, credit is not money. Money in the United States at present is the dollar. The Federal Reserve can create more money by buying credit instruments, but they could buy anything.  It is also true that because of the fractional reserve system, banks create money in Fed orchestrated fashion by issuing credit, but again the banks could buy any asset, including, Salavdor Dali paintings or stock equity,  and expand the money supply. The key factor to understand is that it is not credit creation, but the money creation that is at the heart of an expanding money supply. If the Treasury borrowed money but it was bought by investors, without any involvement by the Fed, the money supply wouldn’t expand at all.</p></blockquote><p>And what is a “dollar”?  A dollar is presently a credit instrument, specifically, a credit instrument known as a Federal Reserve Note.  This is what Mises defines as “credit money”, and not, as is commonly assumed, “fiat money”, nor is it “commodity money”, as was the case with the historical dollar, which was defined in 1792 as 24.056 grams of silver.  Wenzel clearly doesn’t realize that the entire inflation/deflation discussion revolves around the very question he ignores, namely, <i>the current nature of the dollar</i>.   Further to this point, as I have repeatedly pointed out, most purchases are not made by currency, but by credit.  That is why the inflationary effect of the rapid increase in the M2 money stock, 9.65% in the last year alone, is not showing up in prices to the extent one would normally tend to expect, thus leading to dubious claims of a sudden and simultaneous fall in monetary velocity.  The real reason for the unexpectedly moderate effect of this rapid M2 expansion is that the $9.5 trillion increase in the money supply is dwarfed by the $53 trillion in outstanding credit, which has remained stubbornly flat since 2008.  To be fair to the inflationistas, however, it should be pointed out that we’re not seeing any significant price deflation yet because the Federal Reserve and the federal government have been fighting deflation to a standstill over the last three years with the combination of the large increase in M2 and the 92% increase ($4.8 trillion) in the federal debt.  Note that since 2008, this expansion in federal credit is more than twice the size of the expansion in the M2 money stock.</p><blockquote><p>Second, the interest rate maintained by the Fed is not “zero-percent…presently” and it never has been during the crisis. The current effective Fed Funds rate is 0.07%.</p></blockquote><p>This is technically correct… and also happens to be silly and misleading pedantry.  The 0.07% Fed Funds rate is <i>effectively </i>free money, especially since the rate was historically over 5%, going as high as 20% in the early 1980s.  I also note that the $640 billion that was loaned to 532 European banks yesterday was generally considered to be free money although it has <a href=\"http://www.nytimes.com/2011/12/22/business/a-central-bank-doing-what-central-banks-do.html?_r=1&amp;hp\">a nominal interest rate of 1%</a>.  To put it into practical terms, Best Buy selling new PlayStation 3 consoles for $4.20 instead of $299.99 isn’t quite free, but it is perfectly reasonable to describe it that way.</p><blockquote><p>I have no idea where Denninger or Vox Popoli get the idea that credit “shifts demand forward”.  Credit transfers money from one person to another. If someone invests, say, in a newly issued Treasury Bill, he is foregoing consumption but the money ends up with the government which then spends it. Money invested in a capital good creates future consumer goods, but that doesn’t mean that there is no current demand. It merely means that the current demand is for the capital goods.</p></blockquote><p>This is an astonishing admission and reveals that Wenzel quite literally does not know basic economic theory.  One finds numerous references to the way in which credit time-shifts consumption by pushing the demand curve outward in various economic textbooks ranging from old ones like Paul Samuelson’s 1948 <i>Economics </i>to Greg Mankiw’s 2009 <i>Principles of Economics</i>.</p><p>For example, Samuelson writes about the time-shifting aspects of credit when he wrongly attempts to distinguish between internal and external debts:</p><p><i><b>Borrowing and Shifting Economic Burdens Through Time.</b> Still another confusion between an external and internal debt is involved in the often-met statement: “When we borrow rather than tax in order to fight a war, then the true economic burden is really being shifted to the future generations who will have to pay interest and principal on the debt.”  As applied to an external debt, this shift of burden through time might be true….  If we borrow munitions from some neutral country and pledge our children and grandchildren to repay them in goods and services, then it may truly be said that external borrowing represents a shift of economic burden between present and future generations.</i><br> – <i>Economics</i>, p. 424 (1948)</br></p><p>If one realizes that Samuelson’s distinction between internal and external debt is only meaningful in a nationalistic context, it should be obvious that the distinction is irrelevant with regards to the question of whether demand is being pulled forward or not.  Another example can be seen in a textbook published 61 years later, as Greg Mankiw first references the concept of pulling demand forward in an indirect manner:</p><p><i>[T]he political response to rising inequality—whether carefully planned or the path of least resistance—was to expand lending to households, especially low income households. The benefits—growing consumption and more jobs—were immediate, whereas paying the inevitable bill could be postponed into the future. Cynical as it might seem, easy credit has been used throughout history as a palliative by governments that are unable to address the deeper anxieties of the middle class directly. Politicians, however, prefer to couch the objective in more uplifting and persuasive terms than that of crassly increasing consumption. In the U.S., the expansion of home ownership—a key element of the American dream—to low- and middle- income households was the defensible linchpin for the broader aims of expanding credit and consumption….</i></p><p>In the end, though, the misguided attempt to push home ownership through credit has left the U.S. with houses that no one can afford and households drowning in debt Ironically, since 2004, the home ownership rate has been in decline.<br> – <i>Principles of Economics</i>, p. 431 (2009)</br></p><p>It’s not ironic in the slightest, though, since this is precisely what economic theory dictates and was, in fact, the basis of my own 2002 prediction of the coming collapse of the real estate markets.  The demand curve was shifted outwards by the extension of easy credit, pricse rose and home sales increased for a period of time, after which both prices and home sales crashed.  Many readers will recall that exactly same thing happened – and that I predicted it at the time – with the automotive and home-buying incentive programs pushed by the Obama administration in 2009.  Mankiw eventually proceeds to present the explicit mainstream doctrine to which Denninger referred in his original post:</p><p><i><b>Why Credit Cards Aren’t Money</b> It might seem natural to include credit cards as part of the economy’s stock of money. After all, people use credit cards to make many of their purchases. Aren’t credit cards, therefore, a medium of exchange?</i></p><p>At first this argument may seem persuasive, but credit cards are excluded from all measures of the quantity of money. The reason is that credit cards are not really a method of payment but a method of deferring payment. When you buy a meal with a credit card, the bank that issued the card pays the restaurant what it is due. At a later date, you will have to repay the bank (perhaps with interest). When the time comes to pay your credit card bill, you will probably do so by writing a check against your checking account. The balance in this checking account is part of the economy’s stock of money.</p><p>Notice that credit cards are very different from debit cards, which automatically withdraw funds from a bank account to pay for items bought. Rather than allowing the user to postpone payment for a purchase, a debit card allows the user immediate access to deposits in a bank account. In this sense, a debit card is more similar to a check than to a credit card. The account balances that lie behind debit cards are included in measures of the quantity of money.<br> – <i>Principles of Economics</i>, p. 624 (2009)</br></p><p>Note that it doesn’t matter if the concept is described as “deferring payment”, “pulling demand forward”, “shifting the demand curve outward”, or “time-shifting economic burdens”.  These are four different ways to describe the same phenomenon, and regardless of how it is phrased, it has long been used to attempt to justify the economically incorrect juristic claim that credit is not money.</p><blockquote><p>Finally, defaults, in and of themselves, have nothing to do with deflation/inflation in the system. If the Fed buys Treasury bills and creates money to do so, the money is out in the system. If the Treasury defaults on the Bills issued that doesn’t mean the amount of money in the system shrinks. A credit default is thus not “the equivalent of burning paper currency.”</p></blockquote><p>This statement merely shows that Wenzel has no understanding of how the monetary system actually works.  He clearly pays no attention to the Federal Reserve’s Z1 report, otherwise he would recognize that the 19.6% reduction ($3.3 trillion) in financial sector debt and 4.8% reduction ($663 billion) in household sector debt are a) the result of defaults and b) have had a profound effect on the deflation/inflation in the system being the reason behind the massive increase in federal debt and the expansion of the money supply.</p><blockquote><p>Denninger nonsense, and apparently Vox Popoli’s, is complex, but when pulled apart at any strand, it doesn’t hold up. It has taken six paragraphs to refute two Vox Popoli confused paragraphs. Denninger and Vox Popoli make bold statements without the logic to back them up. It takes many statements to refute their bold ones because the foundation has to be  established.</p><p>As I said, I am not going to debate these characters on every point. They shift too much without consistency or substance, you could spend decades trying to refute them and they will simply come out with some new statement that doesn’t reference their earlier points.</p><p>I will only refute them when I see major whoppers or new major characters spouting their nonsense. Just know that their arguments in general are disjointed, tend to ignore reality and tend to use technical terms and/or themes in a manner not used by anyone else on the planet—thus adding even more layers of complexity and confusion to their arguments.</p></blockquote><p>It is more than a little amusing to see someone who neither knows nor understands Keynes, Samuelson, or even Mankiw, let alone Mises, attempt to claim that Karl Denninger and I, two of the very few observers who correctly predicted the present crisis, are spouting nonsense or presenting disjointed arguments.  The fact that he doesn’t understand them does not make them nonsensical.  And his genuine belief that we are using “technical terms and/or themes in a manner not used by anyone else on the planet” only serves to conclusively prove his ignorance of economic theory.  While I’m tempted to cut Wenzel some slack due to his support of Ron Paul, that is unfortunately not my idiom.  So, to end my response with all the tender mercy of Van Helsing driving home a stake, I shall conclude by quoting Ludwig von Mises:</p><p><i>In a developed monetary system, on the other hand, we find commodity money, of which large quantities remain constantly in circulation and are never consumed or used in industry; <b>credit money, whose foundation, the claim to payment, is never made use of</b>;* and possibly even fiat money, which has no use at all except as money.</i><br> – <i>The Theory of Money and Credit</i>, p. 103 (1953)</br></p><p> <i>*I emphasize the bolded text for the benefit of those who may have forgotten the central point of <a href=\"http://market-ticker.org/akcs-www?post=199428\">Karl’s original post</a>.</i></p></div>",
  "content_text": "Even in response to public criticism, it seems a little strange to have to explain what is quite literally textbook economics doctrine to someone writing for the Economic Policy Journal.  Yesterday, Robert Wenzel claimed\n“Vox Popoli is caught in the quicksand hailing Denninger nonsense”\nand attempted to explain himself thusly:\nFirst off, credit is not money. Money in the United States at present is the dollar. The Federal Reserve can create more money by buying credit instruments, but they could buy anything.  First off, credit is not money. Money in the United States at present is the dollar. The Federal Reserve can create more money by buying credit instruments, but they could buy anything.  It is also true that because of the fractional reserve system, banks create money in Fed orchestrated fashion by issuing credit, but again the banks could buy any asset, including, Salavdor Dali paintings or stock equity,  and expand the money supply. The key factor to understand is that it is not credit creation, but the money creation that is at the heart of an expanding money supply. If the Treasury borrowed money but it was bought by investors, without any involvement by the Fed, the money supply wouldn’t expand at all.\nAnd what is a “dollar”?  A dollar is presently a credit instrument, specifically, a credit instrument known as a Federal Reserve Note.  This is what Mises defines as “credit money”, and not, as is commonly assumed, “fiat money”, nor is it “commodity money”, as was the case with the historical dollar, which was defined in 1792 as 24.056 grams of silver.  Wenzel clearly doesn’t realize that the entire inflation/deflation discussion revolves around the very question he ignores, namely,\nthe current nature of the dollar\n.   Further to this point, as I have repeatedly pointed out, most purchases are not made by currency, but by credit.  That is why the inflationary effect of the rapid increase in the M2 money stock, 9.65% in the last year alone, is not showing up in prices to the extent one would normally tend to expect, thus leading to dubious claims of a sudden and simultaneous fall in monetary velocity.  The real reason for the unexpectedly moderate effect of this rapid M2 expansion is that the $9.5 trillion increase in the money supply is dwarfed by the $53 trillion in outstanding credit, which has remained stubbornly flat since 2008.  To be fair to the inflationistas, however, it should be pointed out that we’re not seeing any significant price deflation yet because the Federal Reserve and the federal government have been fighting deflation to a standstill over the last three years with the combination of the large increase in M2 and the 92% increase ($4.8 trillion) in the federal debt.  Note that since 2008, this expansion in federal credit is more than twice the size of the expansion in the M2 money stock.\nSecond, the interest rate maintained by the Fed is not “zero-percent…presently” and it never has been during the crisis. The current effective Fed Funds rate is 0.07%.\nThis is technically correct… and also happens to be silly and misleading pedantry.  The 0.07% Fed Funds rate is\neffectively\nfree money, especially since the rate was historically over 5%, going as high as 20% in the early 1980s.  I also note that the $640 billion that was loaned to 532 European banks yesterday was generally considered to be free money although it has\na nominal interest rate of 1%\n.  To put it into practical terms, Best Buy selling new PlayStation 3 consoles for $4.20 instead of $299.99 isn’t quite free, but it is perfectly reasonable to describe it that way.\nI have no idea where Denninger or Vox Popoli get the idea that credit “shifts demand forward”.  Credit transfers money from one person to another. If someone invests, say, in a newly issued Treasury Bill, he is foregoing consumption but the money ends up with the government which then spends it. Money invested in a capital good creates future consumer goods, but that doesn’t mean that there is no current demand. It merely means that the current demand is for the capital goods.\nThis is an astonishing admission and reveals that Wenzel quite literally does not know basic economic theory.  One finds numerous references to the way in which credit time-shifts consumption by pushing the demand curve outward in various economic textbooks ranging from old ones like Paul Samuelson’s 1948\nEconomics\nto Greg Mankiw’s 2009\nPrinciples of Economics\n.\nFor example, Samuelson writes about the time-shifting aspects of credit when he wrongly attempts to distinguish between internal and external debts:\nBorrowing and Shifting Economic Burdens Through Time.\nStill another confusion between an external and internal debt is involved in the often-met statement: “When we borrow rather than tax in order to fight a war, then the true economic burden is really being shifted to the future generations who will have to pay interest and principal on the debt.”  As applied to an external debt, this shift of burden through time might be true….  If we borrow munitions from some neutral country and pledge our children and grandchildren to repay them in goods and services, then it may truly be said that external borrowing represents a shift of economic burden between present and future generations.\n–\nEconomics\n, p. 424 (1948)\nIf one realizes that Samuelson’s distinction between internal and external debt is only meaningful in a nationalistic context, it should be obvious that the distinction is irrelevant with regards to the question of whether demand is being pulled forward or not.  Another example can be seen in a textbook published 61 years later, as Greg Mankiw first references the concept of pulling demand forward in an indirect manner:\n[T]he political response to rising inequality—whether carefully planned or the path of least resistance—was to expand lending to households, especially low income households. The benefits—growing consumption and more jobs—were immediate, whereas paying the inevitable bill could be postponed into the future. Cynical as it might seem, easy credit has been used throughout history as a palliative by governments that are unable to address the deeper anxieties of the middle class directly. Politicians, however, prefer to couch the objective in more uplifting and persuasive terms than that of crassly increasing consumption. In the U.S., the expansion of home ownership—a key element of the American dream—to low- and middle- income households was the defensible linchpin for the broader aims of expanding credit and consumption….\nIn the end, though, the misguided attempt to push home ownership through credit has left the U.S. with houses that no one can afford and households drowning in debt Ironically, since 2004, the home ownership rate has been in decline.\n–\nPrinciples of Economics\n, p. 431 (2009)\nIt’s not ironic in the slightest, though, since this is precisely what economic theory dictates and was, in fact, the basis of my own 2002 prediction of the coming collapse of the real estate markets.  The demand curve was shifted outwards by the extension of easy credit, pricse rose and home sales increased for a period of time, after which both prices and home sales crashed.  Many readers will recall that exactly same thing happened – and that I predicted it at the time – with the automotive and home-buying incentive programs pushed by the Obama administration in 2009.  Mankiw eventually proceeds to present the explicit mainstream doctrine to which Denninger referred in his original post:\nWhy Credit Cards Aren’t Money\nIt might seem natural to include credit cards as part of the economy’s stock of money. After all, people use credit cards to make many of their purchases. Aren’t credit cards, therefore, a medium of exchange?\nAt first this argument may seem persuasive, but credit cards are excluded from all measures of the quantity of money. The reason is that credit cards are not really a method of payment but a method of deferring payment. When you buy a meal with a credit card, the bank that issued the card pays the restaurant what it is due. At a later date, you will have to repay the bank (perhaps with interest). When the time comes to pay your credit card bill, you will probably do so by writing a check against your checking account. The balance in this checking account is part of the economy’s stock of money.\nNotice that credit cards are very different from debit cards, which automatically withdraw funds from a bank account to pay for items bought. Rather than allowing the user to postpone payment for a purchase, a debit card allows the user immediate access to deposits in a bank account. In this sense, a debit card is more similar to a check than to a credit card. The account balances that lie behind debit cards are included in measures of the quantity of money.\n–\nPrinciples of Economics\n, p. 624 (2009)\nNote that it doesn’t matter if the concept is described as “deferring payment”, “pulling demand forward”, “shifting the demand curve outward”, or “time-shifting economic burdens”.  These are four different ways to describe the same phenomenon, and regardless of how it is phrased, it has long been used to attempt to justify the economically incorrect juristic claim that credit is not money.\nFinally, defaults, in and of themselves, have nothing to do with deflation/inflation in the system. If the Fed buys Treasury bills and creates money to do so, the money is out in the system. If the Treasury defaults on the Bills issued that doesn’t mean the amount of money in the system shrinks. A credit default is thus not “the equivalent of burning paper currency.”\nThis statement merely shows that Wenzel has no understanding of how the monetary system actually works.  He clearly pays no attention to the Federal Reserve’s Z1 report, otherwise he would recognize that the 19.6% reduction ($3.3 trillion) in financial sector debt and 4.8% reduction ($663 billion) in household sector debt are a) the result of defaults and b) have had a profound effect on the deflation/inflation in the system being the reason behind the massive increase in federal debt and the expansion of the money supply.\nDenninger nonsense, and apparently Vox Popoli’s, is complex, but when pulled apart at any strand, it doesn’t hold up. It has taken six paragraphs to refute two Vox Popoli confused paragraphs. Denninger and Vox Popoli make bold statements without the logic to back them up. It takes many statements to refute their bold ones because the foundation has to be  established.\nAs I said, I am not going to debate these characters on every point. They shift too much without consistency or substance, you could spend decades trying to refute them and they will simply come out with some new statement that doesn’t reference their earlier points.\nI will only refute them when I see major whoppers or new major characters spouting their nonsense. Just know that their arguments in general are disjointed, tend to ignore reality and tend to use technical terms and/or themes in a manner not used by anyone else on the planet—thus adding even more layers of complexity and confusion to their arguments.\nIt is more than a little amusing to see someone who neither knows nor understands Keynes, Samuelson, or even Mankiw, let alone Mises, attempt to claim that Karl Denninger and I, two of the very few observers who correctly predicted the present crisis, are spouting nonsense or presenting disjointed arguments.  The fact that he doesn’t understand them does not make them nonsensical.  And his genuine belief that we are using “technical terms and/or themes in a manner not used by anyone else on the planet” only serves to conclusively prove his ignorance of economic theory.  While I’m tempted to cut Wenzel some slack due to his support of Ron Paul, that is unfortunately not my idiom.  So, to end my response with all the tender mercy of Van Helsing driving home a stake, I shall conclude by quoting Ludwig von Mises:\nIn a developed monetary system, on the other hand, we find commodity money, of which large quantities remain constantly in circulation and are never consumed or used in industry;\ncredit money, whose foundation, the claim to payment, is never made use of\n;* and possibly even fiat money, which has no use at all except as money.\n–\nThe Theory of Money and Credit\n, p. 103 (1953)\n*I emphasize the bolded text for the benefit of those who may have forgotten the central point of\nKarl’s original post\n.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-22T11:22:00+00:00"
}