{
  "url": "https://voxday.net/2011/12/03/exposing-injectors/",
  "scraped_at": "2025-12-13T23:28:58.086384",
  "title": "Exposing the injectors",
  "date_display": "December 3, 2011",
  "date_iso": "2011-12-03T12:11:00+00:00",
  "date_from_url": "2011-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The rabid “vaccinate everyone for everything” crowd likes to mock the vaccine realists as “anti-vaxxers” and “anti-science”, but the dishonesty and hollowness of their position is exposed every time <a href=\"http://therefusers.com/refusers-newsroom/australian-journalist-wins-prestigious-award-for-exposing-flu-vaccine-scandal/\">the facts about vaccination manage to leak out into the mainstream</a>:</p><blockquote><p>Natasha Bita, a journalist for The Australian has just won a Walkley Award (the Australian equivalent of a Pulitzer Prize) for an in-depth article series on the CSL Afluria flu vaccine, a shot that caused convulsions in one percent of Australian infants who received it.</p><p>To put this vaccine scandal in perspective, the CDC states that ‘seizures can occur after vaccination,’ 33% of infants who have a first seizure will have more seizures and 10% of infants who have one seizure can develop epilepsy. According to the Merck Manual (the largest-selling medical textbook), seizures are a symptom of encephalitis, which the Merck Manual defines as a vaccine adverse reaction. Vaccine-induced encephalitis can leave a spectrum of permanent brain damage in its wake – post-encephalitic syndrome (aka epilepsy and autism). In other words, kids that have convulsions from Afluria can have lifelong neurological disabilities.</p><p>Incredibly, the defective CSL flu vaccine Afluria is still on the market in the US: FDA-approved and CDC-recommended. The only concession US vaccine authorities have made to this Afluria scandal is to raise the recommended age for this vaccine, but even that feeble response is colored by a direction to give Afluria to young kids anyway if no other flu vaccine is available.</p></blockquote><p>One thing that few American pro-vaxxers understand is the extent to which their pro-vaccine enthusiasm is viewed as lunacy by the rest of the medical world.  For example, the US vaccine schedule involves 2.4 times more vaccines before the age of two than the UK schedule.  In the period in which infectious diseases were all but eliminated, children received ONE-FIFTH as many vaccines as they do now.  It is profoundly and shamefully dishonest to pretend that it is in any way necessary to give FIVE TIMES MORE vaccines to children in order to accomplish what was already accomplished with a much more limited vaccine schedule.</p><p>What the irrational pro-vaxxers fail to realize, in their futile and stupid attempts to launch deceptive, emotion-based attacks on those who demonstrably know more about the relevant facts of the matter than they do, is that their efforts are counterproductive.  Instead of engaging in reasoned discussion, they simply point and shriek like the global warming crowd.  Not only are they completely unconvincing, but they are losing, as vaccination rates continue to fall.</p><p>When intelligent and concerned parents are told they are stupid and anti-science when they are merely asking intelligent and relevant questions instead of having their questions answered in a respectful manner, they are not going to obediently fall in line and get their kid injected.  Instead, they are quite correctly going to conclude that there is no chance in Hell that they are going to pay any attention to what the hysterical pro-vaxxers say in the future.</p><p>Most pro-vaxxers simply haven’t thought through the costs and benefits to the average family.  Nor have they ever considered that many families that don’t adhere to the vaccine schedule <i>are doing so with the medical approval of their pediatricians who have seen one of their children have an adverse reaction</i>.  Once you’ve seen one child collapse unconscious or have a seizure, how completely and utterly stupid do you have to be to blindly proceed with the recommended vaccine schedule with that child or any of your other children?</p><p>Some vaccines make sense.  Others don’t.  That is the reality that the pro-vaxxers will have to get their heads around before anyone in the vaccine reality camp will pay any attention whatsoever to their emotion-laden rantings.  Consider this: the fact that children need water in order to live is not a rational basis for drowning them on behalf of their health.</p><p>And just to be clear, I think it makes sense to vaccinate for tetanus, polio, and after the age of four, measles.  It may make sense to vaccinate for some influenzas if a sufficiently deadly variant were to arise and begin spreading.  But it makes no sense to vaccinate against most of the other diseases which are so seldom fatal and are so easily treated without hospitalization.   I am not an “anti-vaxxer”, I am simply a vaccine realist.  If the rabid vaxxers were as genuinely concerned about saving lives as they claim, they would occupy themselves with banning automobiles, not injecting children with various toxic substances.</p></div>",
  "content_text": "The rabid “vaccinate everyone for everything” crowd likes to mock the vaccine realists as “anti-vaxxers” and “anti-science”, but the dishonesty and hollowness of their position is exposed every time\nthe facts about vaccination manage to leak out into the mainstream\n:\nNatasha Bita, a journalist for The Australian has just won a Walkley Award (the Australian equivalent of a Pulitzer Prize) for an in-depth article series on the CSL Afluria flu vaccine, a shot that caused convulsions in one percent of Australian infants who received it.\nTo put this vaccine scandal in perspective, the CDC states that ‘seizures can occur after vaccination,’ 33% of infants who have a first seizure will have more seizures and 10% of infants who have one seizure can develop epilepsy. According to the Merck Manual (the largest-selling medical textbook), seizures are a symptom of encephalitis, which the Merck Manual defines as a vaccine adverse reaction. Vaccine-induced encephalitis can leave a spectrum of permanent brain damage in its wake – post-encephalitic syndrome (aka epilepsy and autism). In other words, kids that have convulsions from Afluria can have lifelong neurological disabilities.\nIncredibly, the defective CSL flu vaccine Afluria is still on the market in the US: FDA-approved and CDC-recommended. The only concession US vaccine authorities have made to this Afluria scandal is to raise the recommended age for this vaccine, but even that feeble response is colored by a direction to give Afluria to young kids anyway if no other flu vaccine is available.\nOne thing that few American pro-vaxxers understand is the extent to which their pro-vaccine enthusiasm is viewed as lunacy by the rest of the medical world.  For example, the US vaccine schedule involves 2.4 times more vaccines before the age of two than the UK schedule.  In the period in which infectious diseases were all but eliminated, children received ONE-FIFTH as many vaccines as they do now.  It is profoundly and shamefully dishonest to pretend that it is in any way necessary to give FIVE TIMES MORE vaccines to children in order to accomplish what was already accomplished with a much more limited vaccine schedule.\nWhat the irrational pro-vaxxers fail to realize, in their futile and stupid attempts to launch deceptive, emotion-based attacks on those who demonstrably know more about the relevant facts of the matter than they do, is that their efforts are counterproductive.  Instead of engaging in reasoned discussion, they simply point and shriek like the global warming crowd.  Not only are they completely unconvincing, but they are losing, as vaccination rates continue to fall.\nWhen intelligent and concerned parents are told they are stupid and anti-science when they are merely asking intelligent and relevant questions instead of having their questions answered in a respectful manner, they are not going to obediently fall in line and get their kid injected.  Instead, they are quite correctly going to conclude that there is no chance in Hell that they are going to pay any attention to what the hysterical pro-vaxxers say in the future.\nMost pro-vaxxers simply haven’t thought through the costs and benefits to the average family.  Nor have they ever considered that many families that don’t adhere to the vaccine schedule\nare doing so with the medical approval of their pediatricians who have seen one of their children have an adverse reaction\n.  Once you’ve seen one child collapse unconscious or have a seizure, how completely and utterly stupid do you have to be to blindly proceed with the recommended vaccine schedule with that child or any of your other children?\nSome vaccines make sense.  Others don’t.  That is the reality that the pro-vaxxers will have to get their heads around before anyone in the vaccine reality camp will pay any attention whatsoever to their emotion-laden rantings.  Consider this: the fact that children need water in order to live is not a rational basis for drowning them on behalf of their health.\nAnd just to be clear, I think it makes sense to vaccinate for tetanus, polio, and after the age of four, measles.  It may make sense to vaccinate for some influenzas if a sufficiently deadly variant were to arise and begin spreading.  But it makes no sense to vaccinate against most of the other diseases which are so seldom fatal and are so easily treated without hospitalization.   I am not an “anti-vaxxer”, I am simply a vaccine realist.  If the rabid vaxxers were as genuinely concerned about saving lives as they claim, they would occupy themselves with banning automobiles, not injecting children with various toxic substances.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-03T12:11:00+00:00"
}