{
  "url": "https://voxday.net/2011/12/09/failing-stupid-tes/",
  "scraped_at": "2025-12-14T04:41:22.173932",
  "title": "Failing the stupid test",
  "date_display": "December 9, 2011",
  "date_iso": "2011-12-09T22:08:00+00:00",
  "date_from_url": "2011-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not quite as dumb as buying a lottery ticket, but I’d be disinclined to hire someone who went and got <a href=\"http://blogs.the-american-interest.com/wrm/2011/12/08/thinking-of-a-masters-degree-think-again/\">a master’s degree</a> instead of working because it reveals both a lack of foresight and an inability to understand basic economics:</p><blockquote><p>I advise my own students, employees and relations to think carefully before signing up for expensive masters’ degrees.  Most of the successful journalists, NGO leaders and authors I run across don’t have masters’ degrees and when the subject comes up they don’t recommend them to young people interested in these fields.  There are exceptions where top teachers who are also leading people in a given field can become your mentor and help you enter a challenging and rewarding profession, but you have to look hard to find these.</p></blockquote><p>I’m sure there must be some published authors with fancy literary degrees, but the strange thing is that barely any of the actual authors I know studied any form of writing in college whereas none of the English majors with advanced degrees I know have actually published anything.</p><p>And of the hundreds of guys I know in the game industry, I can’t think of a single one who has one of those ridiculous game development-related degrees.</p><p>Then there is this: <i>“About one-third of people with master’s degrees make less money on average than a typical bachelor’s degree holder, said Stephen J. Rose, a labor economist with Georgetown University’s Center on Education and the Workforce, citing U.S. Census data.”</i></p></div>",
  "content_text": "It’s not quite as dumb as buying a lottery ticket, but I’d be disinclined to hire someone who went and got\na master’s degree\ninstead of working because it reveals both a lack of foresight and an inability to understand basic economics:\nI advise my own students, employees and relations to think carefully before signing up for expensive masters’ degrees.  Most of the successful journalists, NGO leaders and authors I run across don’t have masters’ degrees and when the subject comes up they don’t recommend them to young people interested in these fields.  There are exceptions where top teachers who are also leading people in a given field can become your mentor and help you enter a challenging and rewarding profession, but you have to look hard to find these.\nI’m sure there must be some published authors with fancy literary degrees, but the strange thing is that barely any of the actual authors I know studied any form of writing in college whereas none of the English majors with advanced degrees I know have actually published anything.\nAnd of the hundreds of guys I know in the game industry, I can’t think of a single one who has one of those ridiculous game development-related degrees.\nThen there is this:\n“About one-third of people with master’s degrees make less money on average than a typical bachelor’s degree holder, said Stephen J. Rose, a labor economist with Georgetown University’s Center on Education and the Workforce, citing U.S. Census data.”",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-09T22:08:00+00:00"
}