{
  "url": "https://voxday.net/2011/12/02/hide-decline/",
  "scraped_at": "2025-12-13T23:28:54.411608",
  "title": "Hide the decline",
  "date_display": "December 2, 2011",
  "date_iso": "2011-12-02T14:18:00+00:00",
  "date_from_url": "2011-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Economic statisticians <a href=\"http://www.bloomberg.com/news/2011-12-02/u-s-jobless-rate-unexpectedly-declines-to-8-6-payrolls-rise-by-120-000.html\">can utilize the climate scientists’ trick</a> too:</p><blockquote><p>The jobless rate declined to 8.6 percent, the lowest since March 2009, from 9 percent, Labor Department figures showed today in Washington. Payrolls climbed 120,000, with more than half the hiring coming from retailers and temporary help agencies, after a revised 100,000 rise in October. The median estimate in a Bloomberg News survey called for a 125,000 gain…..</p><p>The decrease in the jobless rate reflected a 278,000 gain in employment at the same time 315,000 Americans left the labor force.  The labor participation rate declined to 64 percent from 64.2 percent.</p></blockquote><p>This appears to be nothing more than the usual statistical shenanigans.  By claiming that the labor force is shrinking, those who have left it are not counted as jobless, therefore unemployment is considered to have fallen, therefore more people are employed <i>even though a smaller percentage of the growing population has jobs than before</i>.</p><p>However, the more important number, the EPR, did continue to tick upwards to an unadjusted 58.7 percent, the same as last month.  This means that the jobs situation is marginally better than one year ago, when it was 58.4 percent.</p></div>",
  "content_text": "Economic statisticians\ncan utilize the climate scientists’ trick\ntoo:\nThe jobless rate declined to 8.6 percent, the lowest since March 2009, from 9 percent, Labor Department figures showed today in Washington. Payrolls climbed 120,000, with more than half the hiring coming from retailers and temporary help agencies, after a revised 100,000 rise in October. The median estimate in a Bloomberg News survey called for a 125,000 gain…..\nThe decrease in the jobless rate reflected a 278,000 gain in employment at the same time 315,000 Americans left the labor force.  The labor participation rate declined to 64 percent from 64.2 percent.\nThis appears to be nothing more than the usual statistical shenanigans.  By claiming that the labor force is shrinking, those who have left it are not counted as jobless, therefore unemployment is considered to have fallen, therefore more people are employed\neven though a smaller percentage of the growing population has jobs than before\n.\nHowever, the more important number, the EPR, did continue to tick upwards to an unadjusted 58.7 percent, the same as last month.  This means that the jobs situation is marginally better than one year ago, when it was 58.4 percent.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-02T14:18:00+00:00"
}