{
  "url": "https://voxday.net/2011/12/03/homeschool-or-die/",
  "scraped_at": "2025-12-13T23:28:59.966786",
  "title": "Homeschool or die",
  "date_display": "December 3, 2011",
  "date_iso": "2011-12-03T16:30:00+00:00",
  "date_from_url": "2011-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m about as cynical about the basic concept of public schooling as it is possible to be.  And yet, the American “education” system still regularly manages to surprise me <a href=\"http://boston.cbslocal.com/2011/12/02/7-year-old-accused-of-possible-sexual-harassment-for-kicking-boy-in-groin/\">to the downside</a>:</p><blockquote><p>A 7-year-old boy is being investigated by his South Boston elementary school for possible sexual harassment after kicking another boy in the crotch.  The first grader’s mother, Tasha Lynch, says she was shocked by the school’s decision.</p><p>“He’s 7 years old. He doesn’t know anything about sexual harassment,” she said.</p><p>Lynch’s son, Mark Curran, said the boy that he kicked had been bullying him on the school bus ride home from Tynan Elementary last week.</p><p>“He just all of a sudden came up to him, choked him. He wanted to take his gloves, and my son said, ‘I couldn’t breathe, so I kicked him in the testicles,’” said his mother.</p><p>Lynch described a phone call she received from the school explaining that the case will be treated like sexual harassment, due to what it considers inappropriate touching.</p><p>“‘Your son kicked a little boy in the testicles. We call that sexual harassment,’” Lynch said the school told her.</p></blockquote><p>Apparently the schools wish parents to teach their children to die when they are being choked.  Or something.  In any event, it does suggest an alternative strategy for kids who are being bullied.  The moment that a bully lays so much as a finger on you, charge him with sexual harassment.  That should keep him and his parents busy for the next few weeks… and if he dares to say anything about it later, it’s a simple trip down to the counselor’s office to lay a second charge.</p><p>Of course, if you’re a parent, what on Earth are you thinking to leave your children in what has clearly become a complete madhouse?  I know, I know, your school is different.  The teachers are excellent.  Your kids are more than fine.  And you know absolutely everything that goes on inside their school building for 36 hours every week, right?</p><p>Parents of kids in public school are almost uniformly idiots, at least in this one regard.  They always claim to know everything about their children’s schools, and yet I’ve never met a single one who could even tell me the ratio of teachers to administrative staff or the average number of children in a classroom.  Most of them can’t even tell me what classes their kid has, let alone his daily schedule.  Yeah, you <i>totally</i> know what’s going on there.</p></div>",
  "content_text": "I’m about as cynical about the basic concept of public schooling as it is possible to be.  And yet, the American “education” system still regularly manages to surprise me\nto the downside\n:\nA 7-year-old boy is being investigated by his South Boston elementary school for possible sexual harassment after kicking another boy in the crotch.  The first grader’s mother, Tasha Lynch, says she was shocked by the school’s decision.\n“He’s 7 years old. He doesn’t know anything about sexual harassment,” she said.\nLynch’s son, Mark Curran, said the boy that he kicked had been bullying him on the school bus ride home from Tynan Elementary last week.\n“He just all of a sudden came up to him, choked him. He wanted to take his gloves, and my son said, ‘I couldn’t breathe, so I kicked him in the testicles,’” said his mother.\nLynch described a phone call she received from the school explaining that the case will be treated like sexual harassment, due to what it considers inappropriate touching.\n“‘Your son kicked a little boy in the testicles. We call that sexual harassment,’” Lynch said the school told her.\nApparently the schools wish parents to teach their children to die when they are being choked.  Or something.  In any event, it does suggest an alternative strategy for kids who are being bullied.  The moment that a bully lays so much as a finger on you, charge him with sexual harassment.  That should keep him and his parents busy for the next few weeks… and if he dares to say anything about it later, it’s a simple trip down to the counselor’s office to lay a second charge.\nOf course, if you’re a parent, what on Earth are you thinking to leave your children in what has clearly become a complete madhouse?  I know, I know, your school is different.  The teachers are excellent.  Your kids are more than fine.  And you know absolutely everything that goes on inside their school building for 36 hours every week, right?\nParents of kids in public school are almost uniformly idiots, at least in this one regard.  They always claim to know everything about their children’s schools, and yet I’ve never met a single one who could even tell me the ratio of teachers to administrative staff or the average number of children in a classroom.  Most of them can’t even tell me what classes their kid has, let alone his daily schedule.  Yeah, you\ntotally\nknow what’s going on there.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-03T16:30:00+00:00"
}