{
  "url": "https://voxday.net/2011/12/28/mailvox-true-or-false/",
  "scraped_at": "2025-12-14T04:43:05.066485",
  "title": "Mailvox: true or false",
  "date_display": "December 28, 2011",
  "date_iso": "2011-12-28T20:41:00+00:00",
  "date_from_url": "2011-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Puacon has four questions:</p><blockquote><p> 1) True/False: Ron Paul is a political Leninist, i.e. an admirer of Lenin’s “salami tactics” via Rockwell/Rothbard (see Rothbard’s Ethics of Liberty for more…)</p><p>2) True/False: You (Vox) support this political Leninism, based on your support of Dr. Paul</p><p>3) True/False: Leninism is based on deception and dishonesty…lying about being a racist to infiltrate and control racist groups, etc. This is considered pragmatic, benefits outweighing costs (more liberty vs. associating with racists).</p><p>4) True/False: Dr. Paul isn’t a racist. He just lied about being a racist in order to get money, support, etc. as per point 3.</p><p>These are not trick questions. I’m not judging you either way, just trying to get a handle on your positions on above.</p></blockquote><p>1.  False.  A Leninist is not someone who admires, embraces, or uses any tactic that Vladimir Lenin happened to historically utilize.  Also, the addition of the adjective “political” is redundant, as Leninism is an intrinsically political ideology.  Since a Leninist is someone who subscribes to “the body of political theory for the democratic organisation of a revolutionary vanguard party, and the achievement of a direct-democracy dictatorship of the proletariat, as political prelude to the establishment of socialism”, it is patently obvious that Ron Paul is not a Leninist of any kind.</p><p>2.  False.  I do not support the establishment of socialism.  Nor does Ron Paul, Lew Rockwell, or Murray Rothbard.</p><p>3.  False.  Puacon is confusing a tactic which was historically used by Leninists and other groups with Leninism itself.  You might as reasonably claim that Ron Paul is a “political Muslim”, as the tactic you are describing is known in Islamic theology as <i>taqiyya</i>.  Moreover, Puacon is committing a second error in assuming that because Rothbard believe the tactic was useful, Ron Paul is therefore utilizing it.</p><p>4.  I can’t answer this question due to the erroneous assumptions implicit in it.  I believe that all human beings who are science-literate or conscious of race could be considered racist, myself included, and there is no shortage of empirical evidence and scientific studies demonstrating that this is the case.  If Ron Paul, like most people, has said that he is not racist, he is mistaken <i>in that sense</i>.  But that does not mean he is lying about it.</p><p>I note with some amusement that Puacon’s mischaracterization and misidentification of his target on the political spectrum could, by his own erroneous metric, be accurately described as “Stalinist”.</p></div>",
  "content_text": "Puacon has four questions:\n1) True/False: Ron Paul is a political Leninist, i.e. an admirer of Lenin’s “salami tactics” via Rockwell/Rothbard (see Rothbard’s Ethics of Liberty for more…)\n2) True/False: You (Vox) support this political Leninism, based on your support of Dr. Paul\n3) True/False: Leninism is based on deception and dishonesty…lying about being a racist to infiltrate and control racist groups, etc. This is considered pragmatic, benefits outweighing costs (more liberty vs. associating with racists).\n4) True/False: Dr. Paul isn’t a racist. He just lied about being a racist in order to get money, support, etc. as per point 3.\nThese are not trick questions. I’m not judging you either way, just trying to get a handle on your positions on above.\n1.  False.  A Leninist is not someone who admires, embraces, or uses any tactic that Vladimir Lenin happened to historically utilize.  Also, the addition of the adjective “political” is redundant, as Leninism is an intrinsically political ideology.  Since a Leninist is someone who subscribes to “the body of political theory for the democratic organisation of a revolutionary vanguard party, and the achievement of a direct-democracy dictatorship of the proletariat, as political prelude to the establishment of socialism”, it is patently obvious that Ron Paul is not a Leninist of any kind.\n2.  False.  I do not support the establishment of socialism.  Nor does Ron Paul, Lew Rockwell, or Murray Rothbard.\n3.  False.  Puacon is confusing a tactic which was historically used by Leninists and other groups with Leninism itself.  You might as reasonably claim that Ron Paul is a “political Muslim”, as the tactic you are describing is known in Islamic theology as\ntaqiyya\n.  Moreover, Puacon is committing a second error in assuming that because Rothbard believe the tactic was useful, Ron Paul is therefore utilizing it.\n4.  I can’t answer this question due to the erroneous assumptions implicit in it.  I believe that all human beings who are science-literate or conscious of race could be considered racist, myself included, and there is no shortage of empirical evidence and scientific studies demonstrating that this is the case.  If Ron Paul, like most people, has said that he is not racist, he is mistaken\nin that sense\n.  But that does not mean he is lying about it.\nI note with some amusement that Puacon’s mischaracterization and misidentification of his target on the political spectrum could, by his own erroneous metric, be accurately described as “Stalinist”.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-28T20:41:00+00:00"
}