{
  "url": "https://voxday.net/2011/12/15/mailvox-caught-ou/",
  "scraped_at": "2025-12-14T04:41:53.174205",
  "title": "Mailvox: this is not the multiplier you’re looking for",
  "date_display": "December 15, 2011",
  "date_iso": "2011-12-15T08:56:00+00:00",
  "date_from_url": "2011-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Albatross gets caught attempting to pull the old switcheroo:</p><blockquote><p>There are two senses in which the multiplier is used. In one sense, the multiplier is used as a statistic about government spending (i.e. suppose the government spends one dollar more, if GDP increases by 1 dollar, you have a multiplier of one). In this case, you wouldn’t understand my point. In another case, the multiplier refers to a theoretically posited increase in private sector activity because the government enables an “injection” into the economy (this is the sense in which the money multiplier exists). I meant the second sense and most Keynesians mean the second sense. You can’t understand Keynes’s thought experiment vis a vis burying money (since no gov’t money need be spent) unless you understand the injection multiplier as opposed to the statistical multiplier. I can go into further details if you’d like but I this is enough for you to understand why we came to different extensions from your conclusion.</p></blockquote><p>Albatross failed to recognize which multiplier was the subject at hand.  The entire 2008-2009 debate over the multiplier, and the context of the ECB study to which the linked article was referring, solely concerned the “fiscal multiplier”, which does not render Albatross’s point difficult to understand so much as entirely irrelevant.  For example, here is <a href=\"http://www.economist.com/node/14505361?story_id=14505361\">The Economist’s article</a> on it, to which Paul Krugman subsequently responded in his post entitled <a href=\"http://krugman.blogs.nytimes.com/2009/10/01/multiplying-multipliers/\">“Multiplying Multipliers”</a>.</p><p><i>The debate hinges on the scale of the “fiscal multiplier”. This measure, first formalised in 1931 by Richard Kahn, a student of John Maynard Keynes, captures how effectively tax cuts or increases in government spending stimulate output. A multiplier of one means that a $1 billion increase in government spending will increase a country’s GDP by $1 billion.</i></p><p>The size of the multiplier is bound to vary according to economic conditions. For an economy operating at full capacity, the fiscal multiplier should be zero. Since there are no spare resources, any increase in government demand would just replace spending elsewhere. But in a recession, when workers and factories lie idle, a fiscal boost can increase overall demand. And if the initial stimulus triggers a cascade of expenditure among consumers and businesses, the multiplier can be well above one.</p><p>The multiplier is also likely to vary according to the type of fiscal action. Government spending on building a bridge may have a bigger multiplier than a tax cut if consumers save a portion of their tax windfall. A tax cut targeted at poorer people may have a bigger impact on spending than one for the affluent, since poorer folk tend to spend a higher share of their income.</p><p>Crucially, the overall size of the fiscal multiplier also depends on how people react to higher government borrowing. If the government’s actions bolster confidence and revive animal spirits, the multiplier could rise as demand goes up and private investment is “crowded in”. But if interest rates climb in response to government borrowing then some private investment that would otherwise have occurred could get “crowded out”. And if consumers expect higher future taxes in order to finance new government borrowing, they could spend less today. All that would reduce the fiscal multiplier, potentially to below zero.</p><p>However, it must be noted that the notion of potentially reducing the fiscal multiplier below zero is practically – I should not have said theoretically – unthinkable, for the obvious reason that there has never been a time since the original publication of <i>The General Theory</i> that any of the developed economies has come anywhere close to reaching <i>full employment</i>, except for revised definitions of “full employment” that all fell well short of an economy operating at full capacity.  No Keynesian or Neo-Keynesian spends any time whatsoever considering theoretical sub-zero stimuli, for the obvious reason that they tend to render the entire Keynesian perspective either unnecessary or counterproductive.  The usual Keynesian claim is that fiscal multipliers reliably range from 1.5 to 3x… which has been shown empirically to be untrue.</p><p>Furthermore, Albatross not only erroneously attempted to apply the “injection multiplier” to a discussion that explicitly concerned the “fiscal multiplier”, but also defined the injection multiplier incorrectly.  The injection multiplier is not “a theoretically posited increase in private sector activity because the government enables an “injection” into the economy” but rather “any injection into the economy via investment capital, government spending or the like [that] will result in a proportional increase in overall income at a national level.”  It includes, but is not limited to, the definition he provided.</p><p>Returning to the orginal point, it’s not at all surprising that the fiscal multiplier has been determined to reliably be less than one.  As I noted in RGD, Robert Barro’s study of federal spending in WWII demonstrated that even in the most commonly cited Keynesian success story, “the estimated multiplier for defense spending is 0.6-0.7”.</p></div>",
  "content_text": "Albatross gets caught attempting to pull the old switcheroo:\nThere are two senses in which the multiplier is used. In one sense, the multiplier is used as a statistic about government spending (i.e. suppose the government spends one dollar more, if GDP increases by 1 dollar, you have a multiplier of one). In this case, you wouldn’t understand my point. In another case, the multiplier refers to a theoretically posited increase in private sector activity because the government enables an “injection” into the economy (this is the sense in which the money multiplier exists). I meant the second sense and most Keynesians mean the second sense. You can’t understand Keynes’s thought experiment vis a vis burying money (since no gov’t money need be spent) unless you understand the injection multiplier as opposed to the statistical multiplier. I can go into further details if you’d like but I this is enough for you to understand why we came to different extensions from your conclusion.\nAlbatross failed to recognize which multiplier was the subject at hand.  The entire 2008-2009 debate over the multiplier, and the context of the ECB study to which the linked article was referring, solely concerned the “fiscal multiplier”, which does not render Albatross’s point difficult to understand so much as entirely irrelevant.  For example, here is\nThe Economist’s article\non it, to which Paul Krugman subsequently responded in his post entitled\n“Multiplying Multipliers”\n.\nThe debate hinges on the scale of the “fiscal multiplier”. This measure, first formalised in 1931 by Richard Kahn, a student of John Maynard Keynes, captures how effectively tax cuts or increases in government spending stimulate output. A multiplier of one means that a $1 billion increase in government spending will increase a country’s GDP by $1 billion.\nThe size of the multiplier is bound to vary according to economic conditions. For an economy operating at full capacity, the fiscal multiplier should be zero. Since there are no spare resources, any increase in government demand would just replace spending elsewhere. But in a recession, when workers and factories lie idle, a fiscal boost can increase overall demand. And if the initial stimulus triggers a cascade of expenditure among consumers and businesses, the multiplier can be well above one.\nThe multiplier is also likely to vary according to the type of fiscal action. Government spending on building a bridge may have a bigger multiplier than a tax cut if consumers save a portion of their tax windfall. A tax cut targeted at poorer people may have a bigger impact on spending than one for the affluent, since poorer folk tend to spend a higher share of their income.\nCrucially, the overall size of the fiscal multiplier also depends on how people react to higher government borrowing. If the government’s actions bolster confidence and revive animal spirits, the multiplier could rise as demand goes up and private investment is “crowded in”. But if interest rates climb in response to government borrowing then some private investment that would otherwise have occurred could get “crowded out”. And if consumers expect higher future taxes in order to finance new government borrowing, they could spend less today. All that would reduce the fiscal multiplier, potentially to below zero.\nHowever, it must be noted that the notion of potentially reducing the fiscal multiplier below zero is practically – I should not have said theoretically – unthinkable, for the obvious reason that there has never been a time since the original publication of\nThe General Theory\nthat any of the developed economies has come anywhere close to reaching\nfull employment\n, except for revised definitions of “full employment” that all fell well short of an economy operating at full capacity.  No Keynesian or Neo-Keynesian spends any time whatsoever considering theoretical sub-zero stimuli, for the obvious reason that they tend to render the entire Keynesian perspective either unnecessary or counterproductive.  The usual Keynesian claim is that fiscal multipliers reliably range from 1.5 to 3x… which has been shown empirically to be untrue.\nFurthermore, Albatross not only erroneously attempted to apply the “injection multiplier” to a discussion that explicitly concerned the “fiscal multiplier”, but also defined the injection multiplier incorrectly.  The injection multiplier is not “a theoretically posited increase in private sector activity because the government enables an “injection” into the economy” but rather “any injection into the economy via investment capital, government spending or the like [that] will result in a proportional increase in overall income at a national level.”  It includes, but is not limited to, the definition he provided.\nReturning to the orginal point, it’s not at all surprising that the fiscal multiplier has been determined to reliably be less than one.  As I noted in RGD, Robert Barro’s study of federal spending in WWII demonstrated that even in the most commonly cited Keynesian success story, “the estimated multiplier for defense spending is 0.6-0.7”.",
  "tags": [
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-15T08:56:00+00:00"
}