{
  "url": "https://voxday.net/2011/12/12/mailvox-new-gop-foreign-policy/",
  "scraped_at": "2025-12-14T04:41:38.530039",
  "title": "Mailvox: A new GOP foreign policy",
  "date_display": "December 12, 2011",
  "date_iso": "2011-12-12T21:00:00+00:00",
  "date_from_url": "2011-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A VP reader who writes at Policymic recommends the GOP <a href=\"http://www.policymic.com/articles/2832/gop-should-adopt-ron-paul-s-foreign-policy/stream\">adopt Ron Paul’s foreign policy</a>:</p><blockquote><p>Republicans love to wax poetic about America’s founding documents. Read anything by popular conservative pundits to get up to speed on how our precious Constitution has been shredded by liberals and why America desperately needs to return to the principles contained therein.</p><p>The major Republican presidential contenders all share that view as well. Newt Gingrich’s website, for example, tells readers that religious liberty and life are unalienable rights “contained in the Declaration of Independence.” Mitt Romney has similarly ripped on “advocates of “secularism” for taking the idea of separation of church and state “…well beyond its original meaning.”</p><p>The problem, however, is that Republicans don’t endorse their own back to basics argument when it comes to foreign policy. Conservatives, historically speaking, don’t a endorse the idea that America is the world’s police force, and for the sake of consistency and the good of the country, today’s Republicans need to abandoned this interventionist mindset.</p><p>This may sound like a strange argument if you don’t know your history, so let’s briefly put it context. The idea that America should cross the globe solving every nation’s problems is a progressive one. And it makes sense when you think about it. The left generally accepts that the government ought to have a very active role in society, alleviating poverty, ensuring a level playing field or the little guy, and so on. So why wouldn’t the same be true of foreign policy as well?</p></blockquote><p>It’s all quite true.  Unfortunately, it’s all quite irrelevant.  The observable fact of the matter is that most Republicans, including many who call themselves conservatives, are now progressives on the foreign policy front.  There is literally <i>nothing</i> conservative about the Republican Party’s mainstream anymore, and they are at their most left-wing and pro-government intervention with regards to foreign policy.</p><p>What they should do and what they can reasonably be expected to do are two completely different things.  Which is why they are so often called, quite correctly, the Stupid Party.</p></div>",
  "content_text": "A VP reader who writes at Policymic recommends the GOP\nadopt Ron Paul’s foreign policy\n:\nRepublicans love to wax poetic about America’s founding documents. Read anything by popular conservative pundits to get up to speed on how our precious Constitution has been shredded by liberals and why America desperately needs to return to the principles contained therein.\nThe major Republican presidential contenders all share that view as well. Newt Gingrich’s website, for example, tells readers that religious liberty and life are unalienable rights “contained in the Declaration of Independence.” Mitt Romney has similarly ripped on “advocates of “secularism” for taking the idea of separation of church and state “…well beyond its original meaning.”\nThe problem, however, is that Republicans don’t endorse their own back to basics argument when it comes to foreign policy. Conservatives, historically speaking, don’t a endorse the idea that America is the world’s police force, and for the sake of consistency and the good of the country, today’s Republicans need to abandoned this interventionist mindset.\nThis may sound like a strange argument if you don’t know your history, so let’s briefly put it context. The idea that America should cross the globe solving every nation’s problems is a progressive one. And it makes sense when you think about it. The left generally accepts that the government ought to have a very active role in society, alleviating poverty, ensuring a level playing field or the little guy, and so on. So why wouldn’t the same be true of foreign policy as well?\nIt’s all quite true.  Unfortunately, it’s all quite irrelevant.  The observable fact of the matter is that most Republicans, including many who call themselves conservatives, are now progressives on the foreign policy front.  There is literally\nnothing\nconservative about the Republican Party’s mainstream anymore, and they are at their most left-wing and pro-government intervention with regards to foreign policy.\nWhat they should do and what they can reasonably be expected to do are two completely different things.  Which is why they are so often called, quite correctly, the Stupid Party.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-12T21:00:00+00:00"
}