{
  "url": "https://voxday.net/2011/12/06/no-skepticism-in-science/",
  "scraped_at": "2025-12-13T23:29:14.575237",
  "title": "No skepticism in science",
  "date_display": "December 6, 2011",
  "date_iso": "2011-12-06T11:31:00+00:00",
  "date_from_url": "2011-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An illuminating admission in <a href=\"http://www.universetoday.com/91520/astronomy-without-a-telescope-could-dark-matter-not-matter/\">the contemplation of a potential explanation</a> for all that missing “dark matter”:</p><blockquote><p>You probably want to put on your skeptical goggles and set them to maximum for this one. An Italian mathematician has come up with some complex formulae that can, with remarkable similarity, mimic the rotation curves of spiral galaxies without the need for dark matter.</p><p>Currently, these galactic rotation curves represent key evidence for the existence of dark matter – since the outer stars of spinning galaxies often move around a galactic disk so fast that they should fly off into intergalactic space – unless there is an additional ‘invisible’ mass present in the galaxy to gravitationally hold them in their orbits….</p><p>Conceptually the idea makes little sense. Positioning gravitationally significant mass outside of the orbit of stars might draw them out into wider orbits, but it’s difficult to see why this would add to their orbital velocity. Drawing an object into a wider orbit should result in it taking longer to orbit the galaxy since it will have more circumference to cover. What we generally see in spiral galaxies is that the outer stars orbit the galaxy within much the same time period as more inward stars.</p><p>But although the proposed mechanism seems a little implausible, what is remarkable about Carati’s claim is that the math apparently deliver galactic rotation curves that closely fit the observed values of at least four known galaxies. Indeed, the math delivers an extraordinarily close fit.</p></blockquote><p>For me the most interesting thing isn’t the idea itself, about which I have no opinion, it is the way the Slashdot submitter <a href=\"http://science.slashdot.org/story/11/12/05/2016258/new-theory-challenges-need-for-dark-matter\">described it</a>: “As usual, these are extraordinary claims that divert from the consensus, so keep a healthy skepticism.”</p><p>This permits us to infer something that we have previously observed on many occasions: <i>scientists and science fetishists do not maintain a healthy skepticism about claims that concur with the consensus.</i> And the fascinating thing is that it is quite easy to factually demonstrate that scientists place more and blinder faith in the various scientific consensuses than religious people do in the tenets of their various faiths.  Once more, we are given evidence that the false claims of atheists who subscribe to the cult of science are based on psychological projection.</p><p>Speaking of which, I found this Slashdot comment to be amusing: <i>“The creationists trail real science and keep changing their story, but never, ever, ever admit error. What they believe is always the absolute truth and always has been and if you remember having hours long arguments with them over something which they now believe to be the case but didn’t then, your memory is faulty!”</i></p><p>Sounds familiar, doesn’t it!  As for dark matter, at this point, logic dictates that it most likely will turn out to be a spectacular example of the classic theoretical epicycles to which scientists have been increasingly given ever since medieval astronomers noticed that the observed planetary orbits didn’t correspond well with their Ptolamaic theories.</p><p>UPDATE: Fascinating to see that physicists now appear to be making the same mistake as economists: <i>“Not sure about the summary, but the paper is extremely simple. I’ll summarize it:  It is commonly assumed that galaxies are evenly distributed. This would mean that if you picked any galaxy at random, you could pick other galaxies whose gravitational pull totally balanced out the effect of the first one. So, overall, no distant galaxy would ever affect anything.  What is observed is that galaxies are NOT evenly distributed. There is, indeed, left-over gravitational pull.”</i></p><p>And that, my dear and Dread Ilk, is precisely why anyone schooled in picking apart the flaws of one discipline is actually very well suited to pick apart the flaws of another discipline, <i>even when he knows virtually nothing about that other discipline</i>.  Human error tends to follow readily identifiable patterns.</p></div>",
  "content_text": "An illuminating admission in\nthe contemplation of a potential explanation\nfor all that missing “dark matter”:\nYou probably want to put on your skeptical goggles and set them to maximum for this one. An Italian mathematician has come up with some complex formulae that can, with remarkable similarity, mimic the rotation curves of spiral galaxies without the need for dark matter.\nCurrently, these galactic rotation curves represent key evidence for the existence of dark matter – since the outer stars of spinning galaxies often move around a galactic disk so fast that they should fly off into intergalactic space – unless there is an additional ‘invisible’ mass present in the galaxy to gravitationally hold them in their orbits….\nConceptually the idea makes little sense. Positioning gravitationally significant mass outside of the orbit of stars might draw them out into wider orbits, but it’s difficult to see why this would add to their orbital velocity. Drawing an object into a wider orbit should result in it taking longer to orbit the galaxy since it will have more circumference to cover. What we generally see in spiral galaxies is that the outer stars orbit the galaxy within much the same time period as more inward stars.\nBut although the proposed mechanism seems a little implausible, what is remarkable about Carati’s claim is that the math apparently deliver galactic rotation curves that closely fit the observed values of at least four known galaxies. Indeed, the math delivers an extraordinarily close fit.\nFor me the most interesting thing isn’t the idea itself, about which I have no opinion, it is the way the Slashdot submitter\ndescribed it\n: “As usual, these are extraordinary claims that divert from the consensus, so keep a healthy skepticism.”\nThis permits us to infer something that we have previously observed on many occasions:\nscientists and science fetishists do not maintain a healthy skepticism about claims that concur with the consensus.\nAnd the fascinating thing is that it is quite easy to factually demonstrate that scientists place more and blinder faith in the various scientific consensuses than religious people do in the tenets of their various faiths.  Once more, we are given evidence that the false claims of atheists who subscribe to the cult of science are based on psychological projection.\nSpeaking of which, I found this Slashdot comment to be amusing:\n“The creationists trail real science and keep changing their story, but never, ever, ever admit error. What they believe is always the absolute truth and always has been and if you remember having hours long arguments with them over something which they now believe to be the case but didn’t then, your memory is faulty!”\nSounds familiar, doesn’t it!  As for dark matter, at this point, logic dictates that it most likely will turn out to be a spectacular example of the classic theoretical epicycles to which scientists have been increasingly given ever since medieval astronomers noticed that the observed planetary orbits didn’t correspond well with their Ptolamaic theories.\nUPDATE: Fascinating to see that physicists now appear to be making the same mistake as economists:\n“Not sure about the summary, but the paper is extremely simple. I’ll summarize it:  It is commonly assumed that galaxies are evenly distributed. This would mean that if you picked any galaxy at random, you could pick other galaxies whose gravitational pull totally balanced out the effect of the first one. So, overall, no distant galaxy would ever affect anything.  What is observed is that galaxies are NOT evenly distributed. There is, indeed, left-over gravitational pull.”\nAnd that, my dear and Dread Ilk, is precisely why anyone schooled in picking apart the flaws of one discipline is actually very well suited to pick apart the flaws of another discipline,\neven when he knows virtually nothing about that other discipline\n.  Human error tends to follow readily identifiable patterns.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-06T11:31:00+00:00"
}