{
  "url": "https://voxday.net/2011/12/22/pz-myers-attempts-economics/",
  "scraped_at": "2025-12-14T04:42:35.755234",
  "title": "PZ Myers attempts economics",
  "date_display": "December 22, 2011",
  "date_iso": "2011-12-22T15:00:00+00:00",
  "date_from_url": "2011-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://freethoughtblogs.com/pharyngula/2011/12/22/the-fanatically-irrational-ron-paul-and-his-fanbase/\">Bemusement ensues</a>.  I haven’t thought much of PZ Myers ever since I was under the mistaken impression that he was a strange woman producing nonsensical criticisms of my WND columns.  What I have come to find uniquely amusing about him is the way he applies his intellectually inexcusable Courtier’s Reply as a general intellectual principle; the man never allows complete ignorance to prevent him from spouting a ludicrous and uninformed opinion:</p><blockquote><p>It reminds me why I detest Libertarians, and Ron Paul in particular. The man would be a total disaster for the economy, in addition to being a poisonous social regressive.</p></blockquote><p>Just to be clear, PZ Myer’s believes Ron Paul would be <i>a total disaster for the economy</i>.  What is so insane about this is that even neocons and moderate Republicans who absolutely loathe Ron Paul and are pulling out all the stops to prevent his nomination will readily admit that Ron Paul is the only national American politician who knows the first thing about economics, being the only one who repeatedly, for literal decades, warned about the evils of an economy built on credit.</p><p>Statements like this offer conclusive proof that self-styled champions of science often don’t give a damn about science or empirical evidence, they are merely using the patina of science to further their philosophical and political ideologies.</p></div>",
  "content_text": "Bemusement ensues\n.  I haven’t thought much of PZ Myers ever since I was under the mistaken impression that he was a strange woman producing nonsensical criticisms of my WND columns.  What I have come to find uniquely amusing about him is the way he applies his intellectually inexcusable Courtier’s Reply as a general intellectual principle; the man never allows complete ignorance to prevent him from spouting a ludicrous and uninformed opinion:\nIt reminds me why I detest Libertarians, and Ron Paul in particular. The man would be a total disaster for the economy, in addition to being a poisonous social regressive.\nJust to be clear, PZ Myer’s believes Ron Paul would be\na total disaster for the economy\n.  What is so insane about this is that even neocons and moderate Republicans who absolutely loathe Ron Paul and are pulling out all the stops to prevent his nomination will readily admit that Ron Paul is the only national American politician who knows the first thing about economics, being the only one who repeatedly, for literal decades, warned about the evils of an economy built on credit.\nStatements like this offer conclusive proof that self-styled champions of science often don’t give a damn about science or empirical evidence, they are merely using the patina of science to further their philosophical and political ideologies.",
  "tags": [
    "economics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-22T15:00:00+00:00"
}