{
  "url": "https://voxday.net/2011/12/26/redefining-reality/",
  "scraped_at": "2025-12-14T04:42:52.203581",
  "title": "Redefining reality",
  "date_display": "December 26, 2011",
  "date_iso": "2011-12-26T15:30:00+00:00",
  "date_from_url": "2011-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing we see here again and again, primarily from evangelical atheists, but not infrequently from other ideologues of various strains, is redefining clearly defined, well-understood terms in order <a href=\"http://www.zerohedge.com/news/china-insolvency-wave-begins-nations-biggest-provincal-borrowers-defer-loan-payments\">to protect their subjective reality from the objective one</a>.  Thus, we see absurdities such as an atheist state redefined as “religious” state while a state with an official state church is redefined as “secular” and so forth.</p><p>Now, we’re seeing a similar concept, which is basically the progressive language which Orwell described as Newspeak, being utilized in the financial world:</p><blockquote><p>“China’s biggest provincial borrowers are deferring payment on their loans just two months after the country’s regulator said some local government companies would be allowed to do so….Hunan Provincial Expressway Construction Group is delaying payment on 3.11 billion yuan in interest, documents governing the securities show this month. Guangdong Provincial Communications Group Co, the second-largest debtor, is following suit. So are two others among the biggest 11 debtors, for a total of 30.16 billion yuan, according to bond prospectuses from 55 local authorities that have raised money in capital markets since the beginning of November.” So not even two months in and companies are already becoming serial defaulters, pardon, “loan payment deferrers?” And China is supposed to bail out the world? Ironically, in a world in which can kicking is now an art form, China will show everyone just how it is done, by effectively upturning the capital structure and saying that paying interest is, well, optional.</p></blockquote><p>These sorts of linguistic gymnastics and redefinitions are going to serve the financial world little better than it has the argumentative atheists.  It might fool a few of the more gullible for a short period of time, but sooner or later, objective reality will reassert itself.  Unless the name of the game is simply to buy a little more time in order to allow the responsible parties to prepare for the consequences, this strikes me rather as an NFL team calling a timeout it doesn’t have in a futile attempt to buy time.</p></div>",
  "content_text": "One thing we see here again and again, primarily from evangelical atheists, but not infrequently from other ideologues of various strains, is redefining clearly defined, well-understood terms in order\nto protect their subjective reality from the objective one\n.  Thus, we see absurdities such as an atheist state redefined as “religious” state while a state with an official state church is redefined as “secular” and so forth.\nNow, we’re seeing a similar concept, which is basically the progressive language which Orwell described as Newspeak, being utilized in the financial world:\n“China’s biggest provincial borrowers are deferring payment on their loans just two months after the country’s regulator said some local government companies would be allowed to do so….Hunan Provincial Expressway Construction Group is delaying payment on 3.11 billion yuan in interest, documents governing the securities show this month. Guangdong Provincial Communications Group Co, the second-largest debtor, is following suit. So are two others among the biggest 11 debtors, for a total of 30.16 billion yuan, according to bond prospectuses from 55 local authorities that have raised money in capital markets since the beginning of November.” So not even two months in and companies are already becoming serial defaulters, pardon, “loan payment deferrers?” And China is supposed to bail out the world? Ironically, in a world in which can kicking is now an art form, China will show everyone just how it is done, by effectively upturning the capital structure and saying that paying interest is, well, optional.\nThese sorts of linguistic gymnastics and redefinitions are going to serve the financial world little better than it has the argumentative atheists.  It might fool a few of the more gullible for a short period of time, but sooner or later, objective reality will reassert itself.  Unless the name of the game is simply to buy a little more time in order to allow the responsible parties to prepare for the consequences, this strikes me rather as an NFL team calling a timeout it doesn’t have in a futile attempt to buy time.",
  "tags": [
    "banks",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-26T15:30:00+00:00"
}