{
  "url": "https://voxday.net/2011/12/12/tebow-goes-vira/",
  "scraped_at": "2025-12-14T04:41:36.695855",
  "title": "Tebow goes viral",
  "date_display": "December 12, 2011",
  "date_iso": "2011-12-12T18:00:00+00:00",
  "date_from_url": "2011-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sports Illustrated correctly notes <a href=\"http://nfl.si.com/2011/12/11/broncos-spectacular-improble-run-continues/\">a new aspect to the phenomenon</a>:</p><blockquote><p>Before, when Tebow pulled rabbit after rabbit out of his hat, it was easy enough to chalk it up to Denver’s new quarterback giving the entire team a jolt — more confidence that, no matter what, the game was never out of reach. That’s all still true, but the reason this Broncos run has continued goes beyond that.</p><p>What’s happening now is that opposing teams are starting to buy in, too. No one will ever admit to it, of course, but Tebow is in the league’s head.</p></blockquote><p>I noticed this last night too.  The faces of the Bears players, and especially their coaches, showed something between concern and outright fear during the fourth quarter.  What Tebow has done is transformed the Broncos into something like the NFL version of the Terminator; they simply will not give up even when the game is <i>obviously</i> over.</p><p>Consider Marion Barber.  He isn’t a stupid player or a bad one.  The one thing he is known for is his hard running and he even made a great catch in overtime.  The mistake he made at the end of regulation time when he didn’t go down soon enough and was forced out of bounds wasn’t indicative of stupidity, but desperation.  The only way to be absolutely sure of victory was to get the first down, and so he foolishly decided to go for it.</p><p>And the way the Broncos defense was swarming to the ball and attacking even in overtime when the Bears were in field goal range is simply not normal.  In most cases, a team in that position gives up and allows the running back or receiver go for the score.  Those who try to distinguish between Tebow and the Denver defense are completely missing the point.  A great quarterback will lead an offense.  A great inspirational leader will inspire <i>the entire team</i>.</p><p>I remember when a mediocre team had a truly dreadful quarterback situation.  The Baltimore Ravens didn’t score an offensive touchdown for FIVE STRAIGHT GAMES, but still managed to win two of them on the strength of their epic defense.  When asked to make a distinction between their great defense and awful offense, Ray Lewis refused.  They were one team, he explained, and if the offense couldn’t manage to get it done for one reason or another, all that meant was that the defense would simply have to step up its game.</p><p>And behind the inspirational leadership provided by Lewis and the powerful team spirit forged by that month of adversity, the Ravens didn’t merely win the Super Bowl, they smashed their way through the AFC playoffs by forcing other teams to quit.  I remember seeing Eddie George almost cringing in front of Lewis and receivers pulling up their slants rather than go over the middle.  NFL football requires such an intense effort that a mentally defeated team will find it difficult to beat even an inferior opponent.</p><p>That’s why Tebow and the Broncos outperform in the 4th quarter.  It’s no longer that they don’t stop giving 100 percent, it’s that the other team knows they won’t stop giving 100 percent.  What gives Tebow his uncanny ability to win isn’t his belief in God, his belief that God wants him to win (which he doesn’t actually believe anyhow), or even his teammates’ belief in him.  What gives Tebow his uncanny ability to win is his unusual ability to maintain hope, even in the face of certain failure.</p><p>Peter King spoke with Denver’s kicker: <i>The 51-yard winner looked like it was a Tiger Woods tee shot on a par-5 hole. It almost drilled a hole through the net behind the goalpost.</i></p><p>“You know what’s fun about this?” said Prater. “Everyone keeps saying what Tim can’t do. And he goes out every week and we win. We love the guy. He’s so real. Now we just feel like anything’s possible.”</p><p>Of course, Tebow isn’t the only quarterback whose deeds are looking divinely inspired this season.  He may be less outspoken, and his religious beliefs are much less discussed, but Aaron Rodgers is also an evangelical Christian.  Tom Brady, on the other hand, quite clearly sold his soul to the Devil, aka Bill Belichick, some years ago.</p></div>",
  "content_text": "Sports Illustrated correctly notes\na new aspect to the phenomenon\n:\nBefore, when Tebow pulled rabbit after rabbit out of his hat, it was easy enough to chalk it up to Denver’s new quarterback giving the entire team a jolt — more confidence that, no matter what, the game was never out of reach. That’s all still true, but the reason this Broncos run has continued goes beyond that.\nWhat’s happening now is that opposing teams are starting to buy in, too. No one will ever admit to it, of course, but Tebow is in the league’s head.\nI noticed this last night too.  The faces of the Bears players, and especially their coaches, showed something between concern and outright fear during the fourth quarter.  What Tebow has done is transformed the Broncos into something like the NFL version of the Terminator; they simply will not give up even when the game is\nobviously\nover.\nConsider Marion Barber.  He isn’t a stupid player or a bad one.  The one thing he is known for is his hard running and he even made a great catch in overtime.  The mistake he made at the end of regulation time when he didn’t go down soon enough and was forced out of bounds wasn’t indicative of stupidity, but desperation.  The only way to be absolutely sure of victory was to get the first down, and so he foolishly decided to go for it.\nAnd the way the Broncos defense was swarming to the ball and attacking even in overtime when the Bears were in field goal range is simply not normal.  In most cases, a team in that position gives up and allows the running back or receiver go for the score.  Those who try to distinguish between Tebow and the Denver defense are completely missing the point.  A great quarterback will lead an offense.  A great inspirational leader will inspire\nthe entire team\n.\nI remember when a mediocre team had a truly dreadful quarterback situation.  The Baltimore Ravens didn’t score an offensive touchdown for FIVE STRAIGHT GAMES, but still managed to win two of them on the strength of their epic defense.  When asked to make a distinction between their great defense and awful offense, Ray Lewis refused.  They were one team, he explained, and if the offense couldn’t manage to get it done for one reason or another, all that meant was that the defense would simply have to step up its game.\nAnd behind the inspirational leadership provided by Lewis and the powerful team spirit forged by that month of adversity, the Ravens didn’t merely win the Super Bowl, they smashed their way through the AFC playoffs by forcing other teams to quit.  I remember seeing Eddie George almost cringing in front of Lewis and receivers pulling up their slants rather than go over the middle.  NFL football requires such an intense effort that a mentally defeated team will find it difficult to beat even an inferior opponent.\nThat’s why Tebow and the Broncos outperform in the 4th quarter.  It’s no longer that they don’t stop giving 100 percent, it’s that the other team knows they won’t stop giving 100 percent.  What gives Tebow his uncanny ability to win isn’t his belief in God, his belief that God wants him to win (which he doesn’t actually believe anyhow), or even his teammates’ belief in him.  What gives Tebow his uncanny ability to win is his unusual ability to maintain hope, even in the face of certain failure.\nPeter King spoke with Denver’s kicker:\nThe 51-yard winner looked like it was a Tiger Woods tee shot on a par-5 hole. It almost drilled a hole through the net behind the goalpost.\n“You know what’s fun about this?” said Prater. “Everyone keeps saying what Tim can’t do. And he goes out every week and we win. We love the guy. He’s so real. Now we just feel like anything’s possible.”\nOf course, Tebow isn’t the only quarterback whose deeds are looking divinely inspired this season.  He may be less outspoken, and his religious beliefs are much less discussed, but Aaron Rodgers is also an evangelical Christian.  Tom Brady, on the other hand, quite clearly sold his soul to the Devil, aka Bill Belichick, some years ago.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-12T18:00:00+00:00"
}