{
  "url": "https://voxday.net/2011/12/16/three-critics-three-letters/",
  "scraped_at": "2025-12-14T04:42:03.795340",
  "title": "Three critics, three letters",
  "date_display": "December 16, 2011",
  "date_iso": "2011-12-16T18:00:00+00:00",
  "date_from_url": "2011-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Matthew David Surridge writes <a href=\"http://www.blackgate.com/2011/12/13/the-enjoyment-of-fantasy-open-letters-to-adam-gopnik-mur-lafferty-and-john-c-wright/\">three intelligent responses</a> to critics of the fantasy genre:</p><blockquote><p>Dear Mr. Gopnik,</p><p>I read your recent article in The New Yorker, “The Dragon’s Egg,” with some interest. I haven’t read Christopher Paolini’s work; my interest is less in Young-Adult literature than in fantasy fiction. From that perspective I found your piece intriguing for what was left unsaid, or what you chose not to investigate. Specifically, I thought there were two major lacunae in the thinking underlying your approach to fantasy.</p><p>The first is apparent fairly early on, when you write that Ossian, The Silmarillion, and The Children of Húrin are boring. Later, you say: “And the truth is that most actual mythologies and epics and sacred books are dull. Nothing is more wearying, for readers whose tastes have been formed by the realist novel, than the Elder Edda.” This may well be so, though I’d like to think the enigmatic poems of the Edda can intrigue most readers. At any rate, true as what you say may be, the reverse is true as well. If you’re a reader whose tastes were shaped by mythology, the realist novel is pretty weak sauce. Surely, though, there’s more to be said about either form.</p><p>I’d like to draw upon our shared heritage as Montrealers to illustrate what I’m saying. Imagine, one early April night as the NHL season nears its end and the baseball season gets underway, a hockey fan and baseball fan change sports for one game. The baseball fan watches a hockey game, the hockey fan a baseball game. Leaving aside issues of team loyalty, and assuming both games put the best elements of their sports on display, what are the fans going to see?</p><p>The baseball fan’s going to look at a hockey game and think it’s ridiculous. Where’s the stillness, the reflection, the carefully-unfolding rhythm of baseball? Hockey just keeps moving, at ludicrous speeds to boot. It’s crude, players blocking other players with their bodies, and there’s clearly no strategy; players race back and forth and back and forth along the ice surface, in frantic pursuit of a round black Mcguffin. It’s wearying. And the violence — what on earth is the need for that? Don’t these people realise how ridiculous this sport is?</p><p>The Children of HúrinThe hockey fan, meanwhile, finds the baseball game dull. The thing just goes on and on, and nothing happens, and nothing keeps happening at length. There’re no real battles in the game, outside of a few footraces; nobody physically struggles against anyone else. Not one body check. And no flow; a pitcher throws a ball, and then something happens or, most often, doesn’t. There’s no structure of one play constantly organically developing into another. No plot. (There’s also a ludicrous structural imbalance favouring big-market teams, but admittedly that’s really something separate from my metaphor.)</p><p>Neither hypothetical fan really understands the game they’re unfamiliar with. They can’t see the structures of the sport, and don’t appreciate the gamesmanship involved. More than that, neither fan appreciates the long traditions of the other’s game. Their tastes have been shaped by the sport they love to the point where the virtues of the other sport simply seem nonsensical, or at best an entertainment of a lower order.</p><p>Which is what I found lacking in your article. Your perception of Tolkien and of mythology as boring is, I feel, not a particularly useful critical judgement. All it really tells me is that you as a critic are not likely to be particularly sensitive to the techniques and processes of fantasy fiction. That you do not understand the work you’re talking about.</p><p>Which in turn leads me to the second problem I found in the way you approached fantasy: a lack of awareness of traditions within the genre. You didn’t seem to appreciate the diversity of forms within fantasy, nor did you seem to understand that fantasy represents a tradition (or group of traditions) that reaches back at least to William Morris — I’d argue well before him. I felt that weakened your piece in a number of ways.</p></blockquote><p>It’s a very interesting post and I highly recommend you read it if you have any interest in the SF/F genre.  I don’t agree with everything Surridge says, of course,* but the core of his theme is exactly right.  I would find it hard to agree more with Surridge when he writes: <i>[I]t’s possible to love a book and still disagree with it. This possibility, I think, increases with the greatness of the book. I don’t agree with Dante Alighieri that gays and non-Christians ought to be handed an eternal afterlife of punishment, but I think <i>The Divine Comedy</i> is a great book. And it’s one that I like, even love, beyond my appreciation of Dante’s poetic technique, and intricate structure, and brilliant fusion of reality and imagery and allegory. Because it is a great book, one’s affirmation or rejection of is able to go beyond the affirmation or rejection of the writer’s beliefs.”</i></p><p>Surridge has it exactly right here.  I recently finished reading China Mieville’s <i>Embassytown</i>, which I will review sometime in the next few weeks, and while it is a quite literally Satanic novel, it is a very good novel and one that is well worth reading for precisely that reason alone.  (And other reasons too, to be sure.)  The key point is that the greatness of a literary work is not in any way determined by the degree to which it corresponds with the reader’s beliefs and opinions.</p><p>*<i>I will state that it is a grotesque insult to the language to insist that the “transgendered” are not perverse, i.e. “disposed to go counter to what is expected or desired”, no matter how “hateful” or “insensitive” they or anyone else might happen to find the description.  One thing I refuse to tolerate is the ideological corruption of language.</i></p></div>",
  "content_text": "Matthew David Surridge writes\nthree intelligent responses\nto critics of the fantasy genre:\nDear Mr. Gopnik,\nI read your recent article in The New Yorker, “The Dragon’s Egg,” with some interest. I haven’t read Christopher Paolini’s work; my interest is less in Young-Adult literature than in fantasy fiction. From that perspective I found your piece intriguing for what was left unsaid, or what you chose not to investigate. Specifically, I thought there were two major lacunae in the thinking underlying your approach to fantasy.\nThe first is apparent fairly early on, when you write that Ossian, The Silmarillion, and The Children of Húrin are boring. Later, you say: “And the truth is that most actual mythologies and epics and sacred books are dull. Nothing is more wearying, for readers whose tastes have been formed by the realist novel, than the Elder Edda.” This may well be so, though I’d like to think the enigmatic poems of the Edda can intrigue most readers. At any rate, true as what you say may be, the reverse is true as well. If you’re a reader whose tastes were shaped by mythology, the realist novel is pretty weak sauce. Surely, though, there’s more to be said about either form.\nI’d like to draw upon our shared heritage as Montrealers to illustrate what I’m saying. Imagine, one early April night as the NHL season nears its end and the baseball season gets underway, a hockey fan and baseball fan change sports for one game. The baseball fan watches a hockey game, the hockey fan a baseball game. Leaving aside issues of team loyalty, and assuming both games put the best elements of their sports on display, what are the fans going to see?\nThe baseball fan’s going to look at a hockey game and think it’s ridiculous. Where’s the stillness, the reflection, the carefully-unfolding rhythm of baseball? Hockey just keeps moving, at ludicrous speeds to boot. It’s crude, players blocking other players with their bodies, and there’s clearly no strategy; players race back and forth and back and forth along the ice surface, in frantic pursuit of a round black Mcguffin. It’s wearying. And the violence — what on earth is the need for that? Don’t these people realise how ridiculous this sport is?\nThe Children of HúrinThe hockey fan, meanwhile, finds the baseball game dull. The thing just goes on and on, and nothing happens, and nothing keeps happening at length. There’re no real battles in the game, outside of a few footraces; nobody physically struggles against anyone else. Not one body check. And no flow; a pitcher throws a ball, and then something happens or, most often, doesn’t. There’s no structure of one play constantly organically developing into another. No plot. (There’s also a ludicrous structural imbalance favouring big-market teams, but admittedly that’s really something separate from my metaphor.)\nNeither hypothetical fan really understands the game they’re unfamiliar with. They can’t see the structures of the sport, and don’t appreciate the gamesmanship involved. More than that, neither fan appreciates the long traditions of the other’s game. Their tastes have been shaped by the sport they love to the point where the virtues of the other sport simply seem nonsensical, or at best an entertainment of a lower order.\nWhich is what I found lacking in your article. Your perception of Tolkien and of mythology as boring is, I feel, not a particularly useful critical judgement. All it really tells me is that you as a critic are not likely to be particularly sensitive to the techniques and processes of fantasy fiction. That you do not understand the work you’re talking about.\nWhich in turn leads me to the second problem I found in the way you approached fantasy: a lack of awareness of traditions within the genre. You didn’t seem to appreciate the diversity of forms within fantasy, nor did you seem to understand that fantasy represents a tradition (or group of traditions) that reaches back at least to William Morris — I’d argue well before him. I felt that weakened your piece in a number of ways.\nIt’s a very interesting post and I highly recommend you read it if you have any interest in the SF/F genre.  I don’t agree with everything Surridge says, of course,* but the core of his theme is exactly right.  I would find it hard to agree more with Surridge when he writes:\n[I]t’s possible to love a book and still disagree with it. This possibility, I think, increases with the greatness of the book. I don’t agree with Dante Alighieri that gays and non-Christians ought to be handed an eternal afterlife of punishment, but I think\nThe Divine Comedy\nis a great book. And it’s one that I like, even love, beyond my appreciation of Dante’s poetic technique, and intricate structure, and brilliant fusion of reality and imagery and allegory. Because it is a great book, one’s affirmation or rejection of is able to go beyond the affirmation or rejection of the writer’s beliefs.”\nSurridge has it exactly right here.  I recently finished reading China Mieville’s\nEmbassytown\n, which I will review sometime in the next few weeks, and while it is a quite literally Satanic novel, it is a very good novel and one that is well worth reading for precisely that reason alone.  (And other reasons too, to be sure.)  The key point is that the greatness of a literary work is not in any way determined by the degree to which it corresponds with the reader’s beliefs and opinions.\n*\nI will state that it is a grotesque insult to the language to insist that the “transgendered” are not perverse, i.e. “disposed to go counter to what is expected or desired”, no matter how “hateful” or “insensitive” they or anyone else might happen to find the description.  One thing I refuse to tolerate is the ideological corruption of language.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-16T18:00:00+00:00"
}