{
  "url": "https://voxday.net/2011/12/02/true-and-obscure-history-of-psykosonik-2/",
  "scraped_at": "2025-12-13T23:28:52.594164",
  "title": "The true and obscure history of Psykosonik, part I",
  "date_display": "December 2, 2011",
  "date_iso": "2011-12-02T09:03:00+00:00",
  "date_from_url": "2011-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Among the very small number of people still interested in Psykosonik, there is a fair amount of confusion as to what actually happened concerning the band’s beginnings as well as its end.  It was an interesting, and I would have to say, generally positive experience even if we never realized our potential, never put too much effort into it, and basically demonstrated how far one could expect to go without seriously trying.</p><p>Psykosonik began with a small, personable guy named Gordie, who was determined to be a nightclub impresario.  He got his start with a little place in Minneapolis called The Upper Level, in partnership with a rich kid from Minnetonka named John something or other.  John was a short, good-looking blond guy who, if he had been taller, could have played the villain in every 80’s movie.  He could have defined the term “douchebag”.  The featured attraction at The Upper Level was a band called Smilehouse, which in addition to John and Gordie, featured the music, singing, guitar, and keyboard programming of a tall, handsome, diffident musician named Paul Skrowaczewski.</p><p>Paul came by his skills naturally, being the son of <a href=\"http://en.wikipedia.org/wiki/Stanis%C5%82aw_Skrowaczewski\">Stanislau Skrowaczewski</a>, who at the time was the conductor of the Minnesota Orchestra.  His younger brother Nick was also in Smilehouse, (more about him later), and played the drums.  They had a very 80’s sound and were really rather good, although I was always skeptical about whether Gordie and John were actually playing anything on keyboards and bass.  I think the Smilehouse name was meant to trade on the Acid House that had been big in the UK around that time, but there was nothing either Acid or House about the music, which was straightforward dance pop written by Paul.  Their most popular song was “All Night Party”, an upbeat dance number, but I really liked the more subdued and mysterious “Perfect Stranger”.</p><p>The summer before, in 1987, Big Chilly and I had formed a cover band called NoBoys with his brother Sharp and our friend Horn, which wasn’t particularly serious and was more devoted to figuring out how to program the electronics of the songs we liked than anything.  We learned how to play songs by Depeche Mode, New Order, Shriekback, Erasure, and Information Society, whose singer, Kurt Harland, happened to be from the next suburb over.  More about him later too.  The name was a bit of a joke, standing for North Oaks Boys, which was about as far from “the street” as you could get without going to an East Coast prep school.  Had we started it just a little later, after Straight Outta Compton was released, (we were huge PE and NWA fans from the start), I have no doubt we would have called it NoBoyz….</p><p>Right before we all went back to college in the summer of 1988, I played a tape to Gordie and we discussed NoBoys playing at The Upper Level.  He was excited, because at the time, with the exception of Prince and the various Prince-related bands, all the live bands played rock and roll, not dance music.  He came out to my parents’ house where we practiced in the exercise room in the basement, liked the song selections and the fact that all four of us could sing, and hired us for what turned out to be NoBoys second and final live performance.  So, we got The Upper Level gig in return for a percentage of the evening take.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-260_ud-OU_Q/TtjBreK7QpI/AAAAAAAAAQk/6DbfNfwkeJM/s1600/noboys.png\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"222\" src=\"http://www.milobookclub.com/wp-content/uploads/2011/12/noboys.png\" width=\"320\"/></a></div><p><i>This was the picture used in the flyer that Gordie distributed.  From left: Big Chilly, Vox, Sharp, Horn.</i></p><p>As would happen later a few blocks away, with Psykosonik, the crowd completely abandoned the floor once the DJ stopped and the stage lights went on, only to return with delight once they heard the electronics kick in and everyone realized we weren’t going to play music that was 20 years out of date.  We played for an hour and the set went over well, extremely well.  So well, in fact, that John, Gordie’s partner, was furious that the crowd was so much more enthusiastic than it had been lately about Smilehouse.  (This was because Smilehouse had been playing there all summer, not because their songs were bad.  Also, when it comes to dancing, people tend to prefer covers to original music by unknown bands, live crowds never want to hear anything new even if it is U2 or Springsteen that is introducing it.  Although in the latter case, that will seldom stop them from bragging about it later….)</p><p>John was so jealous that he not only pulled the plug on us once we’d hit precisely the one hour allotted, (we were just about to kick into our big closing number, a rocked-up version of <a href=\"http://www.youtube.com/watch?v=JDfST_pk6rA\">Malaria by Shriekback</a>(1), he actually had the DJ play “Blue Monday” by New Order, the last song we’d been permitted to finish.  This was a mistake, because our programming was very good and thus our version sounded almost precisely the same, (except for the vocals)(3), and he just about lost it when people kept asking him why it was being repeated.  The four of us were so indignant about being prevented from finishing our set when it was going so well that we refused to accept the few hundred dollars we were due from Gordie, who was a nice guy and extremely embarrassed by his partner’s behavior.  I also met a pretty blonde waitress that evening who was very sympathetic to us, which eventually proved to be of minor significance, as shall be seen later.</p><p>But Gordie and I stayed in touch, and the following winter, he invited me to see his new club, an all-ages place called The Underground, near the University of Minnesota campus in Dinkytown.  He had the most ridiculous little “VIP” section roped off, with just enough room for about ten people and invited me to come sit with him in there.(2)  As it happened, that evening there was already one other “VIP” sitting there smoking a cigarette behind the ropes, a guy that I recognized right away as the lead singer of Smilehouse.  Gordie introduced us, and that was how I met Paul Sebastien.</p><p> <i><a href=\"http://www.milobookclub.com/2011/12/31/true-and-obscure-history-of-psykosonik_31/\">The true and obscure history of Psykosonik part II</a></i></p><p> <i>(1)  Man, we loved that Shriekback song.  And everyone went nuts when we played it, Malaria was the one big exception to the rule about live crowds not liking songs they hadn’t heard before.  With his big bass voice, Big Chilly just ripped it up, both vocally and on guitar.  And how can you not respect a band that not only incorporates the word “parthenogenesis”, but does so <i>in the freaking chorus</i>!  If you haven’t heard Shriekback’s <i>Oil and Gold</i> CD, you really owe it to yourself to check it out.</i></p><p>(2)  I was tremendously amused to see that for the dance floor, Gordie had used the same black-and-white linoleum tile at that he had admired so in my parent’s basement exercise room.</p><p>(3) “Blue Monday” was one of the two songs on which I sang lead, because the other three were all talented vocalists who didn’t sound plugged-up and drugged-out enough for New Order.  And by talented vocalists, I mean <a href=\"http://www.facevocalband.com/video.html\">genuinely talented</a>.</p></div>",
  "content_text": "Among the very small number of people still interested in Psykosonik, there is a fair amount of confusion as to what actually happened concerning the band’s beginnings as well as its end.  It was an interesting, and I would have to say, generally positive experience even if we never realized our potential, never put too much effort into it, and basically demonstrated how far one could expect to go without seriously trying.\nPsykosonik began with a small, personable guy named Gordie, who was determined to be a nightclub impresario.  He got his start with a little place in Minneapolis called The Upper Level, in partnership with a rich kid from Minnetonka named John something or other.  John was a short, good-looking blond guy who, if he had been taller, could have played the villain in every 80’s movie.  He could have defined the term “douchebag”.  The featured attraction at The Upper Level was a band called Smilehouse, which in addition to John and Gordie, featured the music, singing, guitar, and keyboard programming of a tall, handsome, diffident musician named Paul Skrowaczewski.\nPaul came by his skills naturally, being the son of\nStanislau Skrowaczewski\n, who at the time was the conductor of the Minnesota Orchestra.  His younger brother Nick was also in Smilehouse, (more about him later), and played the drums.  They had a very 80’s sound and were really rather good, although I was always skeptical about whether Gordie and John were actually playing anything on keyboards and bass.  I think the Smilehouse name was meant to trade on the Acid House that had been big in the UK around that time, but there was nothing either Acid or House about the music, which was straightforward dance pop written by Paul.  Their most popular song was “All Night Party”, an upbeat dance number, but I really liked the more subdued and mysterious “Perfect Stranger”.\nThe summer before, in 1987, Big Chilly and I had formed a cover band called NoBoys with his brother Sharp and our friend Horn, which wasn’t particularly serious and was more devoted to figuring out how to program the electronics of the songs we liked than anything.  We learned how to play songs by Depeche Mode, New Order, Shriekback, Erasure, and Information Society, whose singer, Kurt Harland, happened to be from the next suburb over.  More about him later too.  The name was a bit of a joke, standing for North Oaks Boys, which was about as far from “the street” as you could get without going to an East Coast prep school.  Had we started it just a little later, after Straight Outta Compton was released, (we were huge PE and NWA fans from the start), I have no doubt we would have called it NoBoyz….\nRight before we all went back to college in the summer of 1988, I played a tape to Gordie and we discussed NoBoys playing at The Upper Level.  He was excited, because at the time, with the exception of Prince and the various Prince-related bands, all the live bands played rock and roll, not dance music.  He came out to my parents’ house where we practiced in the exercise room in the basement, liked the song selections and the fact that all four of us could sing, and hired us for what turned out to be NoBoys second and final live performance.  So, we got The Upper Level gig in return for a percentage of the evening take.\nThis was the picture used in the flyer that Gordie distributed.  From left: Big Chilly, Vox, Sharp, Horn.\nAs would happen later a few blocks away, with Psykosonik, the crowd completely abandoned the floor once the DJ stopped and the stage lights went on, only to return with delight once they heard the electronics kick in and everyone realized we weren’t going to play music that was 20 years out of date.  We played for an hour and the set went over well, extremely well.  So well, in fact, that John, Gordie’s partner, was furious that the crowd was so much more enthusiastic than it had been lately about Smilehouse.  (This was because Smilehouse had been playing there all summer, not because their songs were bad.  Also, when it comes to dancing, people tend to prefer covers to original music by unknown bands, live crowds never want to hear anything new even if it is U2 or Springsteen that is introducing it.  Although in the latter case, that will seldom stop them from bragging about it later….)\nJohn was so jealous that he not only pulled the plug on us once we’d hit precisely the one hour allotted, (we were just about to kick into our big closing number, a rocked-up version of\nMalaria by Shriekback\n(1), he actually had the DJ play “Blue Monday” by New Order, the last song we’d been permitted to finish.  This was a mistake, because our programming was very good and thus our version sounded almost precisely the same, (except for the vocals)(3), and he just about lost it when people kept asking him why it was being repeated.  The four of us were so indignant about being prevented from finishing our set when it was going so well that we refused to accept the few hundred dollars we were due from Gordie, who was a nice guy and extremely embarrassed by his partner’s behavior.  I also met a pretty blonde waitress that evening who was very sympathetic to us, which eventually proved to be of minor significance, as shall be seen later.\nBut Gordie and I stayed in touch, and the following winter, he invited me to see his new club, an all-ages place called The Underground, near the University of Minnesota campus in Dinkytown.  He had the most ridiculous little “VIP” section roped off, with just enough room for about ten people and invited me to come sit with him in there.(2)  As it happened, that evening there was already one other “VIP” sitting there smoking a cigarette behind the ropes, a guy that I recognized right away as the lead singer of Smilehouse.  Gordie introduced us, and that was how I met Paul Sebastien.\nThe true and obscure history of Psykosonik part II\n(1)  Man, we loved that Shriekback song.  And everyone went nuts when we played it, Malaria was the one big exception to the rule about live crowds not liking songs they hadn’t heard before.  With his big bass voice, Big Chilly just ripped it up, both vocally and on guitar.  And how can you not respect a band that not only incorporates the word “parthenogenesis”, but does so\nin the freaking chorus\n!  If you haven’t heard Shriekback’s\nOil and Gold\nCD, you really owe it to yourself to check it out.\n(2)  I was tremendously amused to see that for the dance floor, Gordie had used the same black-and-white linoleum tile at that he had admired so in my parent’s basement exercise room.\n(3) “Blue Monday” was one of the two songs on which I sang lead, because the other three were all talented vocalists who didn’t sound plugged-up and drugged-out enough for New Order.  And by talented vocalists, I mean\ngenuinely talented\n.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-12-02T09:03:00+00:00"
}