{
  "url": "https://voxday.net/2019/04/12/book-interview-with-bic/",
  "scraped_at": "2025-12-20T05:37:30.818523",
  "title": "Book Interview with BIC",
  "date_display": "April 12, 2019",
  "date_iso": "2019-04-12T17:00:03+00:00",
  "date_from_url": "2019-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I spoke briefly with John Trent of <i>Bounding Into Comics</i> <a href=\"https://boundingintocomics.com/2019/04/12/milo-yiannopoulos-launches-new-book-how-to-be-poor/\">about Milo’s new book</a>:</p><blockquote><p>Not only is the book for sale on Amazon, but it’s also for sale on Arkhaven Comics’ website given the book was edited by Arkhaven Comics publisher Vox Day.</p><p>I got the opportunity to chat with Vox about the book and he lauded it’s usefulness and noted it “underlines the importance of self-responsibility.”</p><p><b>BIC: The book is described as a guide for people who have been deplatformed, do you expect it be common reading in the near future as social media platforms continue to ban people for writing things like “learn to code?”</b></p><p><b>Vox:</b> “I think HOW TO BE POOR will be useful for anyone who finds themselves in difficult circumstances, even those that are not necessarily related to poverty. Milo’s book is surprisingly stoic and underlines the importance of self-responsibility even when those circumstances are beyond one’s control. But I think HOW TO BE POOR will be very popular, and indeed, the Kindle version is already an Amazon bestseller in all of its categories, because the subject matter is so relevant to an increasing number of people these days. And, of course, because it’s hilarious.”</p></blockquote><p>Read the whole interview there to see what is coming next for Milo.</p></div>",
  "content_text": "I spoke briefly with John Trent of\nBounding Into Comics\nabout Milo’s new book\n:\nNot only is the book for sale on Amazon, but it’s also for sale on Arkhaven Comics’ website given the book was edited by Arkhaven Comics publisher Vox Day.\nI got the opportunity to chat with Vox about the book and he lauded it’s usefulness and noted it “underlines the importance of self-responsibility.”\nBIC: The book is described as a guide for people who have been deplatformed, do you expect it be common reading in the near future as social media platforms continue to ban people for writing things like “learn to code?”\nVox:\n“I think HOW TO BE POOR will be useful for anyone who finds themselves in difficult circumstances, even those that are not necessarily related to poverty. Milo’s book is surprisingly stoic and underlines the importance of self-responsibility even when those circumstances are beyond one’s control. But I think HOW TO BE POOR will be very popular, and indeed, the Kindle version is already an Amazon bestseller in all of its categories, because the subject matter is so relevant to an increasing number of people these days. And, of course, because it’s hilarious.”\nRead the whole interview there to see what is coming next for Milo.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-12T16:00:03+00:00"
}