{
  "url": "https://voxday.net/2019/04/02/but-but-judeo-christian-values/",
  "scraped_at": "2025-12-20T05:36:24.365789",
  "title": "But, but, Judeo-Christian values!",
  "date_display": "April 2, 2019",
  "date_iso": "2019-04-02T19:12:37+00:00",
  "date_from_url": "2019-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s informative how the Neo-Palestinians all babble about “Judeo-Christian values” and “melting pot” whenever they’re trying to win support for themselves from Christians, but <a href=\"https://reason.com/volokh/2019/04/02/republican-senators-are-skating-awfully\">they switch to “racism”, “white Christian identity”, and “anti-semitism”</a> the moment that any conservative actually indicates a preference for white Christians to liberals in sheep’s clothing from foreign identity groups. Unsurprisingly, David Bernstein overtly practices identity politics while he decries the perceived possibility of Republicans practicing identity politics.</p><blockquote><p>Unfortunately, in both situations it’s all-too-easy to come up with bad reasons. Rao is the daughter of Indian Parsi immigrants, and Liu is the daughter of Chinese immigrants. It seems as though their minority background may at least subconsciously raise suspicions that they aren’t on “the team.” I suspect that such suspicions might have been quelled if they belonged to “appropriate” churches–the Mormon church, a conservative Protestant congregation, a Catholic parish known for being actively pro-life. As it happens, while I can’t speak to either woman’s personal religious beliefs, I understand that their families are members of Jewish congregations.</p><p>Please note that I’m not accusing the Senators in question of antisemitism. Nor am I accusing them of conscious racism. But I do suspect that in certain conservative circles, people have an image in their head of what a “trustworthy” conservative looks like, and that person is white, likely male, and a religious Christian. Those who don’t fit that mold are more likely to have their conservative credentials questioned.</p><p>This is both unfair and a disaster for the Republican Party. Imagine you are a conservative-leaning Indian-American Hindu, or Thai-American Buddhist, or Iranian-American Muslim, or African American agnostic. You are attending Yale (Liu’s alma mater) or Chicago (Rao’s) law school and you have nascent but indeterminate political ambitions. You are trying to decide whether to “come out” as a Federalist-type, or keep your head down and avoid politics. You know if you do the former, you will be the subject of special derision and social sanction from your liberal classmates, who will openly question how a person of color can hang out in Fed Soc circles.</p><p>Given that dynamic, Republicans should be especially welcoming to such individuals. Instead, the Rao and Liu situations suggest the opposite. It comes awfully close to looking like implicit white Christian identity politics, and it’s a bad look for the GOP.</p><p>CONFLICT OF INTEREST WATCH: Liu’s husband and Rao are friends and former colleagues of mine.</p></blockquote><p>Notice that the Neo-Palestinian is advocating for two individuals to whom he is personally connected by identity politics while simultaneously decrying “implicit white Christian identity politics” as “a bad look” for Republicans.</p><p>Just as the great battle of the Democratic Party is the struggle between rival identity groups for the helm of the Not-American Party, the great battle of the Republican Party is going to be between Neo-Palestinians desperately trying to convince the American Party to ignore the political realities imposed by the post-1965 demographic changes and Americans who would like to have their party actually advocate for their national interests.</p><p>Republicans have nearly destroyed both their party and their country due to their support for immigration and neocon foreign policy. It’s astonishing that any Republican or conservative still pays any attention whatsoever to these utterly shameless deceivers.</p></div>",
  "content_text": "It’s informative how the Neo-Palestinians all babble about “Judeo-Christian values” and “melting pot” whenever they’re trying to win support for themselves from Christians, but\nthey switch to “racism”, “white Christian identity”, and “anti-semitism”\nthe moment that any conservative actually indicates a preference for white Christians to liberals in sheep’s clothing from foreign identity groups. Unsurprisingly, David Bernstein overtly practices identity politics while he decries the perceived possibility of Republicans practicing identity politics.\nUnfortunately, in both situations it’s all-too-easy to come up with bad reasons. Rao is the daughter of Indian Parsi immigrants, and Liu is the daughter of Chinese immigrants. It seems as though their minority background may at least subconsciously raise suspicions that they aren’t on “the team.” I suspect that such suspicions might have been quelled if they belonged to “appropriate” churches–the Mormon church, a conservative Protestant congregation, a Catholic parish known for being actively pro-life. As it happens, while I can’t speak to either woman’s personal religious beliefs, I understand that their families are members of Jewish congregations.\nPlease note that I’m not accusing the Senators in question of antisemitism. Nor am I accusing them of conscious racism. But I do suspect that in certain conservative circles, people have an image in their head of what a “trustworthy” conservative looks like, and that person is white, likely male, and a religious Christian. Those who don’t fit that mold are more likely to have their conservative credentials questioned.\nThis is both unfair and a disaster for the Republican Party. Imagine you are a conservative-leaning Indian-American Hindu, or Thai-American Buddhist, or Iranian-American Muslim, or African American agnostic. You are attending Yale (Liu’s alma mater) or Chicago (Rao’s) law school and you have nascent but indeterminate political ambitions. You are trying to decide whether to “come out” as a Federalist-type, or keep your head down and avoid politics. You know if you do the former, you will be the subject of special derision and social sanction from your liberal classmates, who will openly question how a person of color can hang out in Fed Soc circles.\nGiven that dynamic, Republicans should be especially welcoming to such individuals. Instead, the Rao and Liu situations suggest the opposite. It comes awfully close to looking like implicit white Christian identity politics, and it’s a bad look for the GOP.\nCONFLICT OF INTEREST WATCH: Liu’s husband and Rao are friends and former colleagues of mine.\nNotice that the Neo-Palestinian is advocating for two individuals to whom he is personally connected by identity politics while simultaneously decrying “implicit white Christian identity politics” as “a bad look” for Republicans.\nJust as the great battle of the Democratic Party is the struggle between rival identity groups for the helm of the Not-American Party, the great battle of the Republican Party is going to be between Neo-Palestinians desperately trying to convince the American Party to ignore the political realities imposed by the post-1965 demographic changes and Americans who would like to have their party actually advocate for their national interests.\nRepublicans have nearly destroyed both their party and their country due to their support for immigration and neocon foreign policy. It’s astonishing that any Republican or conservative still pays any attention whatsoever to these utterly shameless deceivers.",
  "tags": [
    "NeoCon"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-02T18:12:37+00:00"
}