{
  "url": "https://voxday.net/2019/04/19/more-thought-policing-at-google/",
  "scraped_at": "2025-12-20T05:38:24.475613",
  "title": "More thought policing at Google",
  "date_display": "April 19, 2019",
  "date_iso": "2019-04-19T15:00:03+00:00",
  "date_from_url": "2019-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The situation <a href=\"https://www.breitbart.com/tech/2019/04/18/exclusive-google-leftists-panic-about-leaks-threaten-employment-of-colleagues/\">is much, much worse at Google</a> than the average American understands even following the James Damore disclosures. I’ve had intermittent access to their internal communications for years and you would not believe how completely out of control the SJW employees there are. They have even the highest executives at the company intimidated and police literally all the activity and communications, professional and personal, taking place inside and outside the company by the employees:</p><blockquote><p>Left-wing employees at Google are threatening the employment of their colleagues amid a panic about frequent leaks revealing political bias in the company’s products and working atmosphere. Leaked internal discussion threads from Google provided exclusively to Breitbart News show left-wing Google employees reporting one of their colleagues for alleged “leaks,” while worrying about the legal implications of cracking down on a conservative at the company over his public complaints about working conditions.</p><p>The discussion took place last week on the “transparency and ethics” discussion group, from which the alleged leaker had recently been ejected – a failed attempt to stem the tide of leaks showing political bias at the tech giant.</p></blockquote><p>People ask me why I’m not concerned about Google shutting down this blog given their obvious antipathy for me. First, I’ve had live backups running for over a decade and Google knows it. Second, given the amount of inside material I have assembled over the years, I suspect that one of the very last thing Google wants to do is give me an opportunity to do discovery in a European court of law, especially considering the fact that it is publicly known that I am personally banned from setting foot on their Mountain View campus.</p><p>European courts love, Love, LOVE fining Google massive amounts of money. So, creating any reasonable opportunity for a legal dispute would be tantamount to printing a winning lottery ticket.</p></div>",
  "content_text": "The situation\nis much, much worse at Google\nthan the average American understands even following the James Damore disclosures. I’ve had intermittent access to their internal communications for years and you would not believe how completely out of control the SJW employees there are. They have even the highest executives at the company intimidated and police literally all the activity and communications, professional and personal, taking place inside and outside the company by the employees:\nLeft-wing employees at Google are threatening the employment of their colleagues amid a panic about frequent leaks revealing political bias in the company’s products and working atmosphere. Leaked internal discussion threads from Google provided exclusively to Breitbart News show left-wing Google employees reporting one of their colleagues for alleged “leaks,” while worrying about the legal implications of cracking down on a conservative at the company over his public complaints about working conditions.\nThe discussion took place last week on the “transparency and ethics” discussion group, from which the alleged leaker had recently been ejected – a failed attempt to stem the tide of leaks showing political bias at the tech giant.\nPeople ask me why I’m not concerned about Google shutting down this blog given their obvious antipathy for me. First, I’ve had live backups running for over a decade and Google knows it. Second, given the amount of inside material I have assembled over the years, I suspect that one of the very last thing Google wants to do is give me an opportunity to do discovery in a European court of law, especially considering the fact that it is publicly known that I am personally banned from setting foot on their Mountain View campus.\nEuropean courts love, Love, LOVE fining Google massive amounts of money. So, creating any reasonable opportunity for a legal dispute would be tantamount to printing a winning lottery ticket.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-19T14:00:03+00:00"
}