{
  "url": "https://voxday.net/2019/04/11/not-american-by-definition/",
  "scraped_at": "2025-12-20T05:37:21.645707",
  "title": "Not-American by definition",
  "date_display": "April 11, 2019",
  "date_iso": "2019-04-11T17:11:28+00:00",
  "date_from_url": "2019-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On his recent stream, Owen directed us to <a href=\"http://webstersdictionary1828.com/\">the 1828 Webster’s Dictionary online</a>. And if you happen to consult it, one thing you’ll notice is the indisputable fact is that if you’re not a descendant of the American Indians or the European nations, <i>you are not an American</i>. Literally and <a href=\"http://webstersdictionary1828.com/Dictionary/American\">by definition</a>.</p><blockquote><p>AMER’ICAN, <i>adjective </i>Pertaining to America.</p><p>AMER’ICAN, <i>noun </i>A native of America; originally applied to the aboriginals, or copper-colored races, found here by the Europeans; but now applied to the descendants of Europeans born in America.</p></blockquote><p>Notice there is nothing said about propositions, ideas, citizenship, or Judeo-Christian values. Those ideas are Fake History concocted as 20th-century immigrant propaganda. This is why the falsifiers and revisionists always attack history. This is why liars attack the truth and those who tell it. This is why evil always attempts to claim that whatever year it actually is, today is always Year Zero.</p><p>And to those who might be inclined to argue that the definition has simply changed again, I encourage you to think all the way through <i>exactly what that implies</i>.</p></div>",
  "content_text": "On his recent stream, Owen directed us to\nthe 1828 Webster’s Dictionary online\n. And if you happen to consult it, one thing you’ll notice is the indisputable fact is that if you’re not a descendant of the American Indians or the European nations,\nyou are not an American\n. Literally and\nby definition\n.\nAMER’ICAN,\nadjective\nPertaining to America.\nAMER’ICAN,\nnoun\nA native of America; originally applied to the aboriginals, or copper-colored races, found here by the Europeans; but now applied to the descendants of Europeans born in America.\nNotice there is nothing said about propositions, ideas, citizenship, or Judeo-Christian values. Those ideas are Fake History concocted as 20th-century immigrant propaganda. This is why the falsifiers and revisionists always attack history. This is why liars attack the truth and those who tell it. This is why evil always attempts to claim that whatever year it actually is, today is always Year Zero.\nAnd to those who might be inclined to argue that the definition has simply changed again, I encourage you to think all the way through\nexactly what that implies\n.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-11T16:11:28+00:00"
}