{
  "url": "https://voxday.net/2019/04/16/of-friends-and-vampires/",
  "scraped_at": "2025-12-20T05:37:55.789009",
  "title": "Of friends and vampires",
  "date_display": "April 16, 2019",
  "date_iso": "2019-04-16T12:00:00+00:00",
  "date_from_url": "2019-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his bestselling new book, <b><i><a href=\"https://www.amazon.com/How-Be-Poor-Milo-Yiannopoulos/dp/9527303532\">HOW TO BE POOR</a></i></b>, Milo Yiannopoulos explained how his strategy for selecting friends backfired on him:</p><blockquote><p>The sad fact is your friends helped you end up where you are today, just like they did for me.</p><p>Even before my rise to intergalactic fame, my life was overflowing with friends and prospective friends desperate to break into my social circle. This exploded as I entered the American stage in full force starting in 2014. My ego, which is larger than several of Jupiter’s moons, convinced me that these people wanted to be my friend because of my stunning looks, dazzling charm, and devotion to defending those without a voice in the mainstream media.</p><p>I learned the hard way that I was blinded by vanity. As my stock shot up, the friends I attracted came to me with largely selfish intentions. They wanted to attach themselves to my fame. They wanted to live off my credit cards. Many of them, above all else, simply wanted access and social cachet. They wanted my stamp of approval on their products and services and they wanted their websites shared with my audience. By 2017, as an established superstar in the political world, I attracted more old-fashioned grifters eager to suck money out however they could. Some of the friends I’d gained in recent years converted into this type of monster as well—even some long-term friends from Europe ended up this way. They were all vampires draining my blood bank.</p><p>If my life were a horror movie—which it feels like much of the time—the plot would center around me being a carrier of the vampire virus, yet immune to it. Anyone who touched my finances would turn into a heartless monster whose thirst could only be slaked by MILO’s money, and I wouldn’t figure out how to detect these vampires until it was too late. You must admit, me being a disease carrier really lends some credibility to the scenario—whether my haters are on the control-left or the alt-right, they are all convinced by my gravity-defying cheekbones that I am pozzed, which is gay slang for “too poor to buy rubbers and too lazy to go to the clinic.”</p><p>In <i>Dangerous</i>, I reflected on the support I received from friends during one of the many times my enemies thought they had killed me. What feels like a million years ago, I wrote: “These have been trying times and I have been tested. There were a few days when I almost gave up on my mission. But thousands of fans reached out, my friends and family had my back, and the people of this world I respect the most kept taking my calls. I couldn’t let you all down. My enemies thought I had been vanquished, that I would go into hiding in the hills of Dartmoor with my dick between my legs like some weak ass pussy faggot. They couldn’t be more wrong. All they’ve done is piss me off.”</p><p>That passage has remained true for some of my more recent problems, including my financial fall from grace. For my sincere fans and friends, I thank you for sticking with me, and for purchasing this book. One thing is for sure, going broke absolutely separates those out for a quick buck from one’s actual mates. To understand my relationship with friends, and how it got me into trouble, you have to grasp my system. The old saying goes, “Make new friends, but keep the old, one is silver and the other gold,” which I adapted slightly into my own credo: “Make new friends, then rank them according to their personal qualities and let them fight to earn your favor.”</p><p>The end result of following my spreadsheet was a devotion to the worst people in my life. The best-dressed people led me into an arms race of $20,000 handmade jackets and accessories. The troublemakers blew through my money in repair bills. The hard luck cases got cars and rent payments and everything under the sun. The gourmands joined my fabulous (and fabulously expensive) chef’s tables in the finest restaurants. The best looking got all this and more. And I got a top rank of friends, my elite praetorian guard, who disappeared when the money ran out. If only I had tracked “likelihood to turn against MILO at the drop of a hat.”</p></blockquote><p>As a general rule, if you have anything that passes for an “entourage”, there is a high probability you are destined for destitude. The entourage is a descendant of the pagan king and the uncivilized Big Man, where the alpha male’s greatness is measured by his largesse, and it is simply not viable in these days of income and capital gains taxes.</p><p>And never mistake an employee for a friend. If you’re paying someone to spend time with you, he is either an employee, a therapist, or a prostitute.</p></div>",
  "content_text": "In his bestselling new book,\nHOW TO BE POOR\n, Milo Yiannopoulos explained how his strategy for selecting friends backfired on him:\nThe sad fact is your friends helped you end up where you are today, just like they did for me.\nEven before my rise to intergalactic fame, my life was overflowing with friends and prospective friends desperate to break into my social circle. This exploded as I entered the American stage in full force starting in 2014. My ego, which is larger than several of Jupiter’s moons, convinced me that these people wanted to be my friend because of my stunning looks, dazzling charm, and devotion to defending those without a voice in the mainstream media.\nI learned the hard way that I was blinded by vanity. As my stock shot up, the friends I attracted came to me with largely selfish intentions. They wanted to attach themselves to my fame. They wanted to live off my credit cards. Many of them, above all else, simply wanted access and social cachet. They wanted my stamp of approval on their products and services and they wanted their websites shared with my audience. By 2017, as an established superstar in the political world, I attracted more old-fashioned grifters eager to suck money out however they could. Some of the friends I’d gained in recent years converted into this type of monster as well—even some long-term friends from Europe ended up this way. They were all vampires draining my blood bank.\nIf my life were a horror movie—which it feels like much of the time—the plot would center around me being a carrier of the vampire virus, yet immune to it. Anyone who touched my finances would turn into a heartless monster whose thirst could only be slaked by MILO’s money, and I wouldn’t figure out how to detect these vampires until it was too late. You must admit, me being a disease carrier really lends some credibility to the scenario—whether my haters are on the control-left or the alt-right, they are all convinced by my gravity-defying cheekbones that I am pozzed, which is gay slang for “too poor to buy rubbers and too lazy to go to the clinic.”\nIn\nDangerous\n, I reflected on the support I received from friends during one of the many times my enemies thought they had killed me. What feels like a million years ago, I wrote: “These have been trying times and I have been tested. There were a few days when I almost gave up on my mission. But thousands of fans reached out, my friends and family had my back, and the people of this world I respect the most kept taking my calls. I couldn’t let you all down. My enemies thought I had been vanquished, that I would go into hiding in the hills of Dartmoor with my dick between my legs like some weak ass pussy faggot. They couldn’t be more wrong. All they’ve done is piss me off.”\nThat passage has remained true for some of my more recent problems, including my financial fall from grace. For my sincere fans and friends, I thank you for sticking with me, and for purchasing this book. One thing is for sure, going broke absolutely separates those out for a quick buck from one’s actual mates. To understand my relationship with friends, and how it got me into trouble, you have to grasp my system. The old saying goes, “Make new friends, but keep the old, one is silver and the other gold,” which I adapted slightly into my own credo: “Make new friends, then rank them according to their personal qualities and let them fight to earn your favor.”\nThe end result of following my spreadsheet was a devotion to the worst people in my life. The best-dressed people led me into an arms race of $20,000 handmade jackets and accessories. The troublemakers blew through my money in repair bills. The hard luck cases got cars and rent payments and everything under the sun. The gourmands joined my fabulous (and fabulously expensive) chef’s tables in the finest restaurants. The best looking got all this and more. And I got a top rank of friends, my elite praetorian guard, who disappeared when the money ran out. If only I had tracked “likelihood to turn against MILO at the drop of a hat.”\nAs a general rule, if you have anything that passes for an “entourage”, there is a high probability you are destined for destitude. The entourage is a descendant of the pagan king and the uncivilized Big Man, where the alpha male’s greatness is measured by his largesse, and it is simply not viable in these days of income and capital gains taxes.\nAnd never mistake an employee for a friend. If you’re paying someone to spend time with you, he is either an employee, a therapist, or a prostitute.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-16T11:00:00+00:00"
}