{
  "url": "https://voxday.net/2019/04/14/psychopaths-without-the-laugh-track/",
  "scraped_at": "2025-12-20T05:37:39.908462",
  "title": "Psychopaths without the laugh track",
  "date_display": "April 14, 2019",
  "date_iso": "2019-04-14T17:33:17+00:00",
  "date_from_url": "2019-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Owen Benjamin points out that the four characters of Seinfeld are genuinely worse, <a href=\"https://www.unauthorized.tv/programs/satans-punchline\">from a moral perspective</a>, than any inner-city gang banger or motorcycle gang.</p><blockquote><p>Okay, this is a preyed-upon woman, but the laugh track, that makes this scene normal and everyday. That if a woman is in this scenario, that somehow it’s funny. In reality, if you read <i>The Gift of Fear</i> by Gavin Becker, this man will inevitably murder this woman. They always, always, escalate. And there is no one to protect her! Law enforcement, even though there’s a bunch of good cops, there’s not really a way of enforcing the situation if he just takes down the pictures and denies it. This woman without family is absolutely uvulnerable. And that’s what causes her pathology, to make sure that the Soup Nazi lost everything because he wouldn’t capitulate to her self-hatred.</p><p>Why wouldn’t she be creeped out, someone asked? Because the modern women is trained not to listen to her instincts. If a Muslim, dressed like a homeless person and staring at you, gets on your elevator, your gut that says “get off” you immediately say “no, you’re being bigoted and Islamophobic, and so you get raped and killed.</p><p>When your instincts say, “don’t murder your unborn child,” and then all the media, all your social cues say, “no, that’s the Patriarchy telling you that,” you go on that road long enough, you don’t have instincts, you’re literally a docile cow for the slaughter. You’re domesticated beef!</p><p>The self-entitled whore is the product of a society that doesn’t have strong men to lead them into a safe and productive life.</p></blockquote></div>",
  "content_text": "Owen Benjamin points out that the four characters of Seinfeld are genuinely worse,\nfrom a moral perspective\n, than any inner-city gang banger or motorcycle gang.\nOkay, this is a preyed-upon woman, but the laugh track, that makes this scene normal and everyday. That if a woman is in this scenario, that somehow it’s funny. In reality, if you read\nThe Gift of Fear\nby Gavin Becker, this man will inevitably murder this woman. They always, always, escalate. And there is no one to protect her! Law enforcement, even though there’s a bunch of good cops, there’s not really a way of enforcing the situation if he just takes down the pictures and denies it. This woman without family is absolutely uvulnerable. And that’s what causes her pathology, to make sure that the Soup Nazi lost everything because he wouldn’t capitulate to her self-hatred.\nWhy wouldn’t she be creeped out, someone asked? Because the modern women is trained not to listen to her instincts. If a Muslim, dressed like a homeless person and staring at you, gets on your elevator, your gut that says “get off” you immediately say “no, you’re being bigoted and Islamophobic, and so you get raped and killed.\nWhen your instincts say, “don’t murder your unborn child,” and then all the media, all your social cues say, “no, that’s the Patriarchy telling you that,” you go on that road long enough, you don’t have instincts, you’re literally a docile cow for the slaughter. You’re domesticated beef!\nThe self-entitled whore is the product of a society that doesn’t have strong men to lead them into a safe and productive life.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-14T16:33:17+00:00"
}