{
  "url": "https://voxday.net/2019/04/03/replacement-history/",
  "scraped_at": "2025-12-20T05:36:29.953616",
  "title": "Replacement history",
  "date_display": "April 3, 2019",
  "date_iso": "2019-04-03T15:30:17+00:00",
  "date_from_url": "2019-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, (((Ben Shapiro))) <a href=\"https://townhall.com/columnists/benshapiro/2019/04/03/when-you-dont-appreciate-your-civilization-n2544160\">is lying about Western civilization</a>. This is no surprise, since completely redefining “Western civilization” as a Jewish-Greek collaboration is the objective of his latest book.</p><blockquote><p>Ironically, reduction of Western civilization to racial supremacy isn’t just a strategy of the intersectional left; it’s a strategy of the despicable alt-right, which champions Western civilization as white civilization and then seeks to rip away the universalism of its principles from nonwhite people. Thus, the very term “Western civilization” is under assault by a variety of political forces seeking to tear out eternal truths and natural rights in the name of tribalism.</p><p>But that’s not what Western civilization is about at all. Western civilization was built on Judeo-Christian values and Greek reason, culminating in a perspective on natural rights that is preserved by institutions like English jurisprudence. It is thanks to those philosophical principles that free markets, free speech and free association have grown and flourished. Only if we re-enshrine those principles, rather than undermine them, will our prosperity and freedoms be preserved.</p></blockquote><p>Ben Shapiro’s case doesn’t even rise to the level of Wikipedia. Western civilization is synonymous with both “European civilization” and “Occidental civilization”. And, as I have repeatedly pointed out, there is no such thing as “Judeo-Christian values”. Judaism’s values are <i>intrinsically </i>opposed to Christian values; one might as reasonably declare that “Satano-Christian values” and Confucian philosophy provided the foundation of the West.</p><p>Second, (((Michael Ledeen))) inadvertently makes <a href=\"https://pjmedia.com/michaelledeen/the-failed-spanish-inquisition-offers-an-important-lesson-to-modern-anti-semites/\">a strong case on behalf of anti-semitism </a>thanks to his near-complete ignorance of Spanish history.</p><blockquote><p>March 31 marks the anniversary of the date on which, in 1492, Spanish Jews were faced with the choice of converting to Catholicism or leaving.  The edict was driven by the queen, “Isabella the Catholic,” and was issued despite widespread opposition throughout the kingdom, including Sicily, where most of the Italian Jews lived and which was ruled by a Spanish viceroy.  Some converted, some pretended to convert and maintained Jewish practices in secrecy for centuries, but the bulk shipped out, many to the Ottoman Empire, some to Amsterdam (which became known as the “second Jerusalem”), a much smaller number to Palestine.  Henceforth the Spanish Kingdom was firmly under the brutal hand of the Inquisition, whose chief was the infamous Torquemada.</p><p>It was a colossal blunder.  Spain never recovered from the loss of one of the most productive and creative elements of its population.  As for the Jews of the realm, 1492 started the saga of the wandering diaspora very shortly thereafter. The Spanish and Portuguese Jews spread all over the continent, and the new world as well.  It initiated a melodrama that is one of history’s most fascinating tales.</p><p>Jews were important to the Spanish economy, and to Spanish culture.  Spain steadily weakened without its Jews, who made major contributions to Ottoman lands and to Muslim countries across North Africa, especially Tunisia.  Their commercial skills included trade in spices, at the time very important for the continent…. Queen Isabella’s brutal oppression of the Jews totally backfired.  She purged her country of the descendants of the great Maimonides, only to have Spain sink into irrelevancy on the world stage. </p></blockquote><p>100 years after the Spaniards kicked out the Jews, they ruled over the wealthiest, most powerful empire on Earth. Irrelevancy on the world stage? The Spanish empire didn’t even reach its apogee for <i><a href=\"https://www.youtube.com/watch?v=ueu5yohTBek\">another 300 years!</a></i> To the contrary, barely 100 years after the USA first permitted mass Jewish immigration, it has lost its global power, it is deeply in debt, it is demoralized in literally every sense of the term, it has been invaded by tens of millions of foreigners, and is now on the verge of complete political collapse.</p><p>Ledeen is not merely lying. Being a servant of the Father of Lies in good standing he presents an entirely backwards picture, one that is completely antithetical to the easily verified historical facts. Were the Jews good for the Egyptians or the Canaanites? Did the Romans and Greeks consider them to be beneficial to their empires? Have they been a boon to the inhabitants of Palestine? And has the post-Holocaust German economy suffered for its lack of Jews?</p><blockquote class=\"tr_bq\"><p>Modern Jew-haters come from two failed traditions, radical Islam and radical leftism. Like the Iberians of the 14th century, their tyrannical regimes have all failed, and they have driven out their Jews. Meanwhile, the countries that built their futures on religious toleration, countries with substantial Jewish populations, countries like the United States, Canada, Australia, Israel, are, we can hope, the future of mankind.</p></blockquote><p>The USA, Canada, and Australia are all likely to collapse or be conquered within 20 years. And when those things happen, remember that Michael Ledeen credited their fate to having built their futures “on religious toleration” and “substantial Jewish populations.”</p><p>What Shapiro and Ledeen are doing is consciously responding to so-called “replacement theology” with “replacement history”. They’re attempting to redefine Europeans and Christianity out of Western civilization in order to claim it for themselves.</p></div>",
  "content_text": "First, (((Ben Shapiro)))\nis lying about Western civilization\n. This is no surprise, since completely redefining “Western civilization” as a Jewish-Greek collaboration is the objective of his latest book.\nIronically, reduction of Western civilization to racial supremacy isn’t just a strategy of the intersectional left; it’s a strategy of the despicable alt-right, which champions Western civilization as white civilization and then seeks to rip away the universalism of its principles from nonwhite people. Thus, the very term “Western civilization” is under assault by a variety of political forces seeking to tear out eternal truths and natural rights in the name of tribalism.\nBut that’s not what Western civilization is about at all. Western civilization was built on Judeo-Christian values and Greek reason, culminating in a perspective on natural rights that is preserved by institutions like English jurisprudence. It is thanks to those philosophical principles that free markets, free speech and free association have grown and flourished. Only if we re-enshrine those principles, rather than undermine them, will our prosperity and freedoms be preserved.\nBen Shapiro’s case doesn’t even rise to the level of Wikipedia. Western civilization is synonymous with both “European civilization” and “Occidental civilization”. And, as I have repeatedly pointed out, there is no such thing as “Judeo-Christian values”. Judaism’s values are\nintrinsically\nopposed to Christian values; one might as reasonably declare that “Satano-Christian values” and Confucian philosophy provided the foundation of the West.\nSecond, (((Michael Ledeen))) inadvertently makes\na strong case on behalf of anti-semitism\nthanks to his near-complete ignorance of Spanish history.\nMarch 31 marks the anniversary of the date on which, in 1492, Spanish Jews were faced with the choice of converting to Catholicism or leaving.  The edict was driven by the queen, “Isabella the Catholic,” and was issued despite widespread opposition throughout the kingdom, including Sicily, where most of the Italian Jews lived and which was ruled by a Spanish viceroy.  Some converted, some pretended to convert and maintained Jewish practices in secrecy for centuries, but the bulk shipped out, many to the Ottoman Empire, some to Amsterdam (which became known as the “second Jerusalem”), a much smaller number to Palestine.  Henceforth the Spanish Kingdom was firmly under the brutal hand of the Inquisition, whose chief was the infamous Torquemada.\nIt was a colossal blunder.  Spain never recovered from the loss of one of the most productive and creative elements of its population.  As for the Jews of the realm, 1492 started the saga of the wandering diaspora very shortly thereafter. The Spanish and Portuguese Jews spread all over the continent, and the new world as well.  It initiated a melodrama that is one of history’s most fascinating tales.\nJews were important to the Spanish economy, and to Spanish culture.  Spain steadily weakened without its Jews, who made major contributions to Ottoman lands and to Muslim countries across North Africa, especially Tunisia.  Their commercial skills included trade in spices, at the time very important for the continent…. Queen Isabella’s brutal oppression of the Jews totally backfired.  She purged her country of the descendants of the great Maimonides, only to have Spain sink into irrelevancy on the world stage.\n100 years after the Spaniards kicked out the Jews, they ruled over the wealthiest, most powerful empire on Earth. Irrelevancy on the world stage? The Spanish empire didn’t even reach its apogee for\nanother 300 years!\nTo the contrary, barely 100 years after the USA first permitted mass Jewish immigration, it has lost its global power, it is deeply in debt, it is demoralized in literally every sense of the term, it has been invaded by tens of millions of foreigners, and is now on the verge of complete political collapse.\nLedeen is not merely lying. Being a servant of the Father of Lies in good standing he presents an entirely backwards picture, one that is completely antithetical to the easily verified historical facts. Were the Jews good for the Egyptians or the Canaanites? Did the Romans and Greeks consider them to be beneficial to their empires? Have they been a boon to the inhabitants of Palestine? And has the post-Holocaust German economy suffered for its lack of Jews?\nModern Jew-haters come from two failed traditions, radical Islam and radical leftism. Like the Iberians of the 14th century, their tyrannical regimes have all failed, and they have driven out their Jews. Meanwhile, the countries that built their futures on religious toleration, countries with substantial Jewish populations, countries like the United States, Canada, Australia, Israel, are, we can hope, the future of mankind.\nThe USA, Canada, and Australia are all likely to collapse or be conquered within 20 years. And when those things happen, remember that Michael Ledeen credited their fate to having built their futures “on religious toleration” and “substantial Jewish populations.”\nWhat Shapiro and Ledeen are doing is consciously responding to so-called “replacement theology” with “replacement history”. They’re attempting to redefine Europeans and Christianity out of Western civilization in order to claim it for themselves.",
  "tags": [
    "NeoCon"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-03T14:30:17+00:00"
}