{
  "url": "https://voxday.net/2019/04/28/spin-spin-and-more-spin/",
  "scraped_at": "2025-12-20T05:39:15.564477",
  "title": "Spin, spin, and more spin",
  "date_display": "April 28, 2019",
  "date_iso": "2019-04-28T12:36:48+00:00",
  "date_from_url": "2019-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see that the media covering the <i>Jawbreakers</i> case are engaging in precisely <a href=\"https://www.bleedingcool.com/2019/04/23/antarctic-publisher-oath-mark-waid-jawbreakers\">the same sort of definitional spin</a> that we are seeing on a regular basis in our current legal dispute:</p><p><b><i>Antarctic Publisher States Under Oath That Mark Waid Didn’t Prevent Them from Publishing Jawbreakers</i></b></p><p>So what? As Richard Meyer’s lawyer has correctly pointed out, the name of the tort <a href=\"https://boundingintocomics.com/2019/04/26/richard-c-meyer-and-mark-waid-respond-to-media-coverage-of-recent-developments-in-their-ongoing-legal-case/\">is “tortious interference” not “tortious prevention”</a>. Waid was not involved in the relationship, so obviously he had no ability to “prevent” Antarctic from publishing anything.</p><p>The basic elements of a tortious interference claim <a href=\"https://smallbusiness.findlaw.com/liability-and-insurance/tortious-interference.html\">are as follows</a>:</p><ul><li><i>A valid contract or economic expectancy between the plaintiff and a third person;</i></li><li><i>Knowledge of the contract or expectancy by the defendant;</i></li><li><i>Intent by the defendant to interfere with the contract or expectancy;</i></li><li><i>Actual interference;</i></li><ul><li><i>The interference is improper; and</i></li><li><i>The plaintiff suffers damage.</i></li></ul></ul><p>The sworn testimony that the defendant did not <i>prevent </i>the third person from fulfilling the contract or economic expectancy obviously does not mean that he did not <i>interfere</i> with it. Now, it would certainly be more helpful to Meyer’s case if Antarctic was willing to swear that being contacted by Waid played a role in their decision, but not proving Meyer’s case is not tantamount to bolstering Waid’s defense. Only binary thinkers could fail to grasp that distinction.</p><p>As far as I can tell, the only fact yet to be determined, and upon which the Meyer v. Waid case revolves, is if telephoning someone and telling them to break a contract with someone else with which you are not involved in any way is improper interference or not. And I simply don’t know if that is the case in Texas or not.</p><p>Speaking of legal disputes, an email <strike>will be going</strike> has gone out to Alt-Hero and original Alt-Hero:Q backers<strike> later today</strike>. If you fit the specified bill with ease and without any exaggeration, please respond to it as this information will be very helpful to us. If you receive a separate, similar email from someone else, please be sure to respond to both of them.</p><p>Things are heating up considerably on that front, so there could be some fireworks soon. I look forward to being able to tell you all about it, but that may take a while as there is the possibility of at least one element of the dispute stretching into the fall of 2020.</p></div>",
  "content_text": "It’s interesting to see that the media covering the\nJawbreakers\ncase are engaging in precisely\nthe same sort of definitional spin\nthat we are seeing on a regular basis in our current legal dispute:\nAntarctic Publisher States Under Oath That Mark Waid Didn’t Prevent Them from Publishing Jawbreakers\nSo what? As Richard Meyer’s lawyer has correctly pointed out, the name of the tort\nis “tortious interference” not “tortious prevention”\n. Waid was not involved in the relationship, so obviously he had no ability to “prevent” Antarctic from publishing anything.\nThe basic elements of a tortious interference claim\nare as follows\n:\nA valid contract or economic expectancy between the plaintiff and a third person;\nKnowledge of the contract or expectancy by the defendant;\nIntent by the defendant to interfere with the contract or expectancy;\nActual interference;\nThe interference is improper; and\nThe plaintiff suffers damage.\nThe sworn testimony that the defendant did not\nprevent\nthe third person from fulfilling the contract or economic expectancy obviously does not mean that he did not\ninterfere\nwith it. Now, it would certainly be more helpful to Meyer’s case if Antarctic was willing to swear that being contacted by Waid played a role in their decision, but not proving Meyer’s case is not tantamount to bolstering Waid’s defense. Only binary thinkers could fail to grasp that distinction.\nAs far as I can tell, the only fact yet to be determined, and upon which the Meyer v. Waid case revolves, is if telephoning someone and telling them to break a contract with someone else with which you are not involved in any way is improper interference or not. And I simply don’t know if that is the case in Texas or not.\nSpeaking of legal disputes, an email\nwill be going\nhas gone out to Alt-Hero and original Alt-Hero:Q backers\nlater today\n. If you fit the specified bill with ease and without any exaggeration, please respond to it as this information will be very helpful to us. If you receive a separate, similar email from someone else, please be sure to respond to both of them.\nThings are heating up considerably on that front, so there could be some fireworks soon. I look forward to being able to tell you all about it, but that may take a while as there is the possibility of at least one element of the dispute stretching into the fall of 2020.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-28T11:36:48+00:00"
}