{
  "url": "https://voxday.net/2019/04/21/the-empire-is-already-over/",
  "scraped_at": "2025-12-20T05:38:39.080250",
  "title": "The Empire is already over",
  "date_display": "April 21, 2019",
  "date_iso": "2019-04-21T12:00:06+00:00",
  "date_from_url": "2019-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dmitry Orlov asserts that the US empire <a href=\"http://www.unz.com/tsaker/the-saker-interviews-dmitry-orlov/\">has already ended</a>:</p><blockquote><p><b>Dmitry Orlov: </b>I think that the American empire is very much over already, but it hasn’t been put to any sort of serious stress test yet, and so nobody realizes that this is the case. Some event will come along which will leave the power center utterly humiliated and unable to countenance this humiliation and make adjustments. Things will go downhill from there as everyone in government in media does their best to pretend that the problem doesn’t exist. My hope is that the US military personnel currently scattered throughout the planet will not be simply abandoned once the money runs out, but I wouldn’t be too surprised if that is what happens.</p><p><b>The Saker: </b>Lastly, a similar but fundamentally different question: can the US (as opposed to the Empire) survive Trump and, if so, how? Will there be a civil war? A military coup? Insurrection? Strikes? A US version of the Yellow Vests?</p><p><b>Dmitry Orlov: </b>The US, as some set of institutions that serves the interests of some dwindling number of people, is likely to continue functioning for quite some time. The question is: who is going to be included and who isn’t? There is little doubt that retirees, as a category, have nothing to look forward to from the US: their retirements, whether public or private, have already been spent. There is little doubt that young people, who have already been bled dry by poor job prospects and ridiculous student loans, have nothing to look forward to either.</p><p>But, as I’ve said before, the US isn’t so much a country as a country club. Membership has its privileges, and members don’t care at all what life is like for those who are in the country but aren’t members of the club. The recent initiatives to let everyone in and to let non-citizens vote amply demonstrates that US citizenship, by itself, counts for absolutely nothing. The only birthright of a US citizen is to live as a bum on the street, surrounded by other bums, many of them foreigners from what Trump has termed “shithole countries.”</p><p>It will be interesting to see how public and government workers, as a group, react to the realization that the retirements they have been promised no longer exist; perhaps that will tip the entire system into a defunct state. And once the fracking bubble is over and another third of the population finds that it can no longer afford to drive, that might force through some sort of reset as well. But then the entire system of militarized police is designed to crush any sort of rebellion, and most people know that. Given the choice between certain death and just sitting on the sidewalk doing drugs, most people will choose the latter….</p><p>At this rate, when the end of the US finally arrives, most of the people won’t be in a position to notice while the rest won’t be capable of absorbing that sort of upsetting information and will choose to ignore it. Everybody wants to know how the story ends, but that sort of information probably isn’t good for anyone’s sanity.</p></blockquote><p>I wouldn’t bet on the militarized police myself. When even proper militaries can’t defeat lightly armed insurgencies, no matter how cool their black tactical gear may be, the police don’t stand a chance. These questions will be determined, as always, by the side that has the higher and more resilient morale.</p></div>",
  "content_text": "Dmitry Orlov asserts that the US empire\nhas already ended\n:\nDmitry Orlov:\nI think that the American empire is very much over already, but it hasn’t been put to any sort of serious stress test yet, and so nobody realizes that this is the case. Some event will come along which will leave the power center utterly humiliated and unable to countenance this humiliation and make adjustments. Things will go downhill from there as everyone in government in media does their best to pretend that the problem doesn’t exist. My hope is that the US military personnel currently scattered throughout the planet will not be simply abandoned once the money runs out, but I wouldn’t be too surprised if that is what happens.\nThe Saker:\nLastly, a similar but fundamentally different question: can the US (as opposed to the Empire) survive Trump and, if so, how? Will there be a civil war? A military coup? Insurrection? Strikes? A US version of the Yellow Vests?\nDmitry Orlov:\nThe US, as some set of institutions that serves the interests of some dwindling number of people, is likely to continue functioning for quite some time. The question is: who is going to be included and who isn’t? There is little doubt that retirees, as a category, have nothing to look forward to from the US: their retirements, whether public or private, have already been spent. There is little doubt that young people, who have already been bled dry by poor job prospects and ridiculous student loans, have nothing to look forward to either.\nBut, as I’ve said before, the US isn’t so much a country as a country club. Membership has its privileges, and members don’t care at all what life is like for those who are in the country but aren’t members of the club. The recent initiatives to let everyone in and to let non-citizens vote amply demonstrates that US citizenship, by itself, counts for absolutely nothing. The only birthright of a US citizen is to live as a bum on the street, surrounded by other bums, many of them foreigners from what Trump has termed “shithole countries.”\nIt will be interesting to see how public and government workers, as a group, react to the realization that the retirements they have been promised no longer exist; perhaps that will tip the entire system into a defunct state. And once the fracking bubble is over and another third of the population finds that it can no longer afford to drive, that might force through some sort of reset as well. But then the entire system of militarized police is designed to crush any sort of rebellion, and most people know that. Given the choice between certain death and just sitting on the sidewalk doing drugs, most people will choose the latter….\nAt this rate, when the end of the US finally arrives, most of the people won’t be in a position to notice while the rest won’t be capable of absorbing that sort of upsetting information and will choose to ignore it. Everybody wants to know how the story ends, but that sort of information probably isn’t good for anyone’s sanity.\nI wouldn’t bet on the militarized police myself. When even proper militaries can’t defeat lightly armed insurgencies, no matter how cool their black tactical gear may be, the police don’t stand a chance. These questions will be determined, as always, by the side that has the higher and more resilient morale.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-21T11:00:06+00:00"
}