{
  "url": "https://voxday.net/2019/04/13/the-virtues-of-vibrancy/",
  "scraped_at": "2025-12-20T05:37:32.627329",
  "title": "The virtues of vibrancy",
  "date_display": "April 13, 2019",
  "date_iso": "2019-04-13T18:19:33+00:00",
  "date_from_url": "2019-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given the increasing number of <a href=\"http://www.startribune.com/dispatch-audio-man-threw-child-from-3rd-floor-balcony-at-mall-of-america/508496192/\">attacks like this</a>, it won’t be long before the vast majority of Americans conclude that the Civil Rights Movement was the most evil and deleterious attack on the nation since the 1965 Naturalization Act.</p><blockquote><p>A Twin Cities man accused of throwing a child over a third-floor railing at the Mall of America has a history of mental health problems and had twice been ordered to stay away from the mall, court records show.</p><p>In a previous criminal case, Emmanuel Deshawn Aranda told police that “he has some anger issues” after being arrested for smashing computers at a Minneapolis public library.</p><p>Aranda, 24, is being held by Bloomington police on suspicion of attempted homicide after he threw or pushed a 5-year-old boy from a third-floor balcony at the mall Friday morning, police said.</p><p>Aranda was arrested in the mall transit station after fleeing the scene.</p></blockquote><p>And yes, this is yet another example of an unprovoked black-on-white attempted murder. <strike>The charges have been upgraded</strike>. It doesn’t matter if “you don’t see color,” not that anyone takes your sanctimonious pretense seriously. The point is, those who hate you do.</p><p>There isn’t much of a mystery surrounding the death of the shopping mall. Who wants to go shopping in public when it means putting your small children at the risk of murderous vibrants.</p><p><b>UPDATE: </b>Twitter jumped the gun. The boy is hanging in there.</p><blockquote class=\"tr_bq\"><p>The boy, whose first name is Landen, “is still very much with us and fighting,” he said in a Facebook message.</p></blockquote></div>",
  "content_text": "Given the increasing number of\nattacks like this\n, it won’t be long before the vast majority of Americans conclude that the Civil Rights Movement was the most evil and deleterious attack on the nation since the 1965 Naturalization Act.\nA Twin Cities man accused of throwing a child over a third-floor railing at the Mall of America has a history of mental health problems and had twice been ordered to stay away from the mall, court records show.\nIn a previous criminal case, Emmanuel Deshawn Aranda told police that “he has some anger issues” after being arrested for smashing computers at a Minneapolis public library.\nAranda, 24, is being held by Bloomington police on suspicion of attempted homicide after he threw or pushed a 5-year-old boy from a third-floor balcony at the mall Friday morning, police said.\nAranda was arrested in the mall transit station after fleeing the scene.\nAnd yes, this is yet another example of an unprovoked black-on-white attempted murder.\nThe charges have been upgraded\n. It doesn’t matter if “you don’t see color,” not that anyone takes your sanctimonious pretense seriously. The point is, those who hate you do.\nThere isn’t much of a mystery surrounding the death of the shopping mall. Who wants to go shopping in public when it means putting your small children at the risk of murderous vibrants.\nUPDATE:\nTwitter jumped the gun. The boy is hanging in there.\nThe boy, whose first name is Landen, “is still very much with us and fighting,” he said in a Facebook message.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-04-13T17:19:33+00:00"
}