{
  "url": "https://voxday.net/2004/01/16/admitting-his-desirousness/",
  "scraped_at": "2025-12-13T15:43:44.682395",
  "title": "Admitting his desirousness",
  "date_display": "January 16, 2004",
  "date_iso": "2004-01-16T08:37:00+00:00",
  "date_from_url": "2004-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://sportsillustrated.cnn.com/2004/writers/michael_silver/01/15/open_mike/index.html\">Michael Silver</a> writes: <em> So here were are, with Indy’s Tony Dungy one victory away from becoming the first African-American coach to guide his team to the Super Bowl, and still the overall football landscape seems nearly as backward as ever. And for you Limbaugh-philes out there, realize that it’s not just liberal, desirous me fretting over this. Every single African-American coach I know shares this frustration, as do a whole lot of players. White players, too. The lack of African-Americans in positions of authority in the NFL is just wrong and people on the inside of the football world understand this better than anyone.</em></p><p>I’m sure there’s plenty of white basketball players who believe that the lack of white basketball players on the NBA court is just wrong too.  Does that mean that the NBA should require every team to work out a white player before it makes a first-round draft choice?  For that matter, are more than 12 percent of the players on the football field black?  Talk about overrepresentation!  Not that I’m saying that I’d want Jason Sehorn as my safety, you understand.</p><p>Note that Silver is openly admitting that he wants a) more blacks in positions of authority, and b) he wants blacks in positions of authority to succeed.  We’re also supposed to believe that neither he, nor all these other people he mentions, have had any interest in the success of black quarterbacks in the past.  But does anyone believe that McNair would have been co-MVP with Peyton Manning if Manning had been black?  I don’t.  McNair is an excellent quarterback – much better than Donovan McNabb – but Manning beat him head-to-head in both meetings this year, had much better stats, and didn’t need his backups to win two games down the stretch.  And to underline the point, Manning is playing in the AFC championship game, while McNair isn’t.</p><p>Sure, the Marino hiring is bizarre.  I thought the Millen hiring would be a disaster from day one.  Callahan to Nebraska I don’t get, although Pete Carroll and Steve Spurrier both show that college coaching is a different, easier kettle of fish.   Interesting to note that Ty Willingham’s name didn’t get mentioned at all….  I’m also curious to know just how many black coaches Mike Silver believes is the right number.  How many black head coaches would not “be a disgrace”?  And, since we’re into racial math, how many is too many?  6?  12?  32?  Why are there no Hispanic or Asian coaches?  Racism!  Racism!  How many head coaches are gay?  Jewish?  Bi-lingual and trans-gendered?  And we haven’t even begun to get into the shocking absence of women coaches!</p><p>Please.  Silver is a typical left-liberal racist who fails to realize his own racism.  Furthermore, he clearly has no regard for the Constitutional right of free association.  If a team owner wants to hire a dumb white coach who will sink his team like a stone, that is his right.  It’s stupid, sure, but so are a lot of things that are not illegal.</p><p>Furthermore, this isn’t the first time that Tony Dungy has been one victory away etc etc.  Denny Green’s been one victory away twice.  What a dishonest little turn of rhetoric.  CNN/SI has some great sportswriters.  Michael Silver isn’t one of them.</p></div>",
  "content_text": "Michael Silver\nwrites:\nSo here were are, with Indy’s Tony Dungy one victory away from becoming the first African-American coach to guide his team to the Super Bowl, and still the overall football landscape seems nearly as backward as ever. And for you Limbaugh-philes out there, realize that it’s not just liberal, desirous me fretting over this. Every single African-American coach I know shares this frustration, as do a whole lot of players. White players, too. The lack of African-Americans in positions of authority in the NFL is just wrong and people on the inside of the football world understand this better than anyone.\nI’m sure there’s plenty of white basketball players who believe that the lack of white basketball players on the NBA court is just wrong too.  Does that mean that the NBA should require every team to work out a white player before it makes a first-round draft choice?  For that matter, are more than 12 percent of the players on the football field black?  Talk about overrepresentation!  Not that I’m saying that I’d want Jason Sehorn as my safety, you understand.\nNote that Silver is openly admitting that he wants a) more blacks in positions of authority, and b) he wants blacks in positions of authority to succeed.  We’re also supposed to believe that neither he, nor all these other people he mentions, have had any interest in the success of black quarterbacks in the past.  But does anyone believe that McNair would have been co-MVP with Peyton Manning if Manning had been black?  I don’t.  McNair is an excellent quarterback – much better than Donovan McNabb – but Manning beat him head-to-head in both meetings this year, had much better stats, and didn’t need his backups to win two games down the stretch.  And to underline the point, Manning is playing in the AFC championship game, while McNair isn’t.\nSure, the Marino hiring is bizarre.  I thought the Millen hiring would be a disaster from day one.  Callahan to Nebraska I don’t get, although Pete Carroll and Steve Spurrier both show that college coaching is a different, easier kettle of fish.   Interesting to note that Ty Willingham’s name didn’t get mentioned at all….  I’m also curious to know just how many black coaches Mike Silver believes is the right number.  How many black head coaches would not “be a disgrace”?  And, since we’re into racial math, how many is too many?  6?  12?  32?  Why are there no Hispanic or Asian coaches?  Racism!  Racism!  How many head coaches are gay?  Jewish?  Bi-lingual and trans-gendered?  And we haven’t even begun to get into the shocking absence of women coaches!\nPlease.  Silver is a typical left-liberal racist who fails to realize his own racism.  Furthermore, he clearly has no regard for the Constitutional right of free association.  If a team owner wants to hire a dumb white coach who will sink his team like a stone, that is his right.  It’s stupid, sure, but so are a lot of things that are not illegal.\nFurthermore, this isn’t the first time that Tony Dungy has been one victory away etc etc.  Denny Green’s been one victory away twice.  What a dishonest little turn of rhetoric.  CNN/SI has some great sportswriters.  Michael Silver isn’t one of them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-16T08:37:00+00:00"
}