{
  "url": "https://voxday.net/2004/01/21/another-big-government-conservative/",
  "scraped_at": "2025-12-13T15:44:42.403918",
  "title": "Another big government conservative disaster",
  "date_display": "January 21, 2004",
  "date_iso": "2004-01-21T10:55:00+00:00",
  "date_from_url": "2004-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Washington Times: <em>President Bush last night proposed an ambitious package of domestic spending that will drive up discretionary expenditures far more rapidly than his recent predecessors.  The State of the Union initiatives that he wants passed this year include more spending for the Department of Education, a new assistance fund to help manufacturers recover from their recession and funding for a major, long-term expansion of NASA’s space budget.  Early projections indicate passage of Mr. Bush’s proposals will increase non-defense spending well beyond the 4 percent to 5 percent the administration has budgeted for the current fiscal year, nearly double the average annual increases of about 2.5 percent by President Clinton during his two terms.</em></p><p>Why are Republicans supporting this man?  He’s a Clintonite Democrat in conservative clothing, except that even Clinton never dared anything like the Patriot Act.  Just wait until the next Democrat gets into office and starts wielding the expanded central power that this Republican Congress and Administration have created.  Then, I expect conservatives will start crying foul.  The president rightly compared the Patriot Act to the drug war last night… how much more clear does he have to make his intentions to violate civil rights and American liberties before those who profess to care deeply about such things will disavow his actions?  Yes, he’s a better Commander-in-Chief – did you really doubt that our military forces could beat Iraq and the Taliban?</p><p>Does being a Republican truly mean never have to say you’re sorry for reducing American freedom?  Clinton would never have gotten a pass on this from conservatives.  Bush shouldn’t either.</p></div>",
  "content_text": "From the Washington Times:\nPresident Bush last night proposed an ambitious package of domestic spending that will drive up discretionary expenditures far more rapidly than his recent predecessors.  The State of the Union initiatives that he wants passed this year include more spending for the Department of Education, a new assistance fund to help manufacturers recover from their recession and funding for a major, long-term expansion of NASA’s space budget.  Early projections indicate passage of Mr. Bush’s proposals will increase non-defense spending well beyond the 4 percent to 5 percent the administration has budgeted for the current fiscal year, nearly double the average annual increases of about 2.5 percent by President Clinton during his two terms.\nWhy are Republicans supporting this man?  He’s a Clintonite Democrat in conservative clothing, except that even Clinton never dared anything like the Patriot Act.  Just wait until the next Democrat gets into office and starts wielding the expanded central power that this Republican Congress and Administration have created.  Then, I expect conservatives will start crying foul.  The president rightly compared the Patriot Act to the drug war last night… how much more clear does he have to make his intentions to violate civil rights and American liberties before those who profess to care deeply about such things will disavow his actions?  Yes, he’s a better Commander-in-Chief – did you really doubt that our military forces could beat Iraq and the Taliban?\nDoes being a Republican truly mean never have to say you’re sorry for reducing American freedom?  Clinton would never have gotten a pass on this from conservatives.  Bush shouldn’t either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-21T10:55:00+00:00"
}