{
  "url": "https://voxday.net/2004/01/30/at-least-stuttaford-remains-sane/",
  "scraped_at": "2025-12-13T15:46:08.464772",
  "title": "At least Stuttaford remains sane",
  "date_display": "January 30, 2004",
  "date_iso": "2004-01-30T19:44:00+00:00",
  "date_from_url": "2004-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andrew Stuttaford preserves the conservative flame at NRO thusly: <em>Catching up after a trip to yet another undisclosed location… More cash for the NEA? Good grief. Everytime you think that it’s impossible for George W Bush to spring another rat from his hat, he goes and does it again, but, to take some recent instances, what else can you expect from a president who signs laws he believes to be unconstitutional, proposes a vast guestworker program in the middle of difficult times for blue collar America, recruits Jules Verne as a science advisor, squanders a SOTU driveling on about steroids, and as for the budget…  As one seems to be saying more and more these days: thanks for nothing, Mr. President.</em></p><p>There is, of course, the notion that the president is simply acting this way to save the economy through Keynesian spending injections.  It won’t work, of course, but it would explain his apparent desperation to spend money on anything and everything.  M3 has been dropping despite rock-bottom interest rates and the printing presses working in overdrive, which, as economic historians know, is a Very Bad Sign.</p></div>",
  "content_text": "Andrew Stuttaford preserves the conservative flame at NRO thusly:\nCatching up after a trip to yet another undisclosed location… More cash for the NEA? Good grief. Everytime you think that it’s impossible for George W Bush to spring another rat from his hat, he goes and does it again, but, to take some recent instances, what else can you expect from a president who signs laws he believes to be unconstitutional, proposes a vast guestworker program in the middle of difficult times for blue collar America, recruits Jules Verne as a science advisor, squanders a SOTU driveling on about steroids, and as for the budget…  As one seems to be saying more and more these days: thanks for nothing, Mr. President.\nThere is, of course, the notion that the president is simply acting this way to save the economy through Keynesian spending injections.  It won’t work, of course, but it would explain his apparent desperation to spend money on anything and everything.  M3 has been dropping despite rock-bottom interest rates and the printing presses working in overdrive, which, as economic historians know, is a Very Bad Sign.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-30T19:44:00+00:00"
}