{
  "url": "https://voxday.net/2004/01/13/at-least-he-favors-legalizing-drugs/",
  "scraped_at": "2025-12-13T15:43:13.836842",
  "title": "At least he favors legalizing drugs",
  "date_display": "January 13, 2004",
  "date_iso": "2004-01-13T21:01:00+00:00",
  "date_from_url": "2004-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rich Lowry writes: <em>[Gen. Clark] accuses the Republican party of a lack of true Christianity, saying that “there’s only one party that lives that faith in America, and that’s our party, the Democratic party.”</em></p><p>Don’t most Democrats who aren’t nominal once-a-year-won’t-kill-me Christians hate Christians who actually take the tenets of the faith seriously, or at the very least wish that they would stay out of politics altogether?   Otherwise, what’s with all the cracks about Bible thumpers, the virulent antipathy for Catholic and evangelical judges, and the desire to eradicate all signs of Christmas from public view.</p><p>One wonders what in the seventh secret name of Gehenna the general is smoking.  Clark must have the notion that playing Robin Hood with other people’s money is the same thing as charity – of course, Jesus said to give to Caesar what is Caesar’s, not what belongs toJoseph, Mary, Simon Peter and Paul.  And he also said to suffer the little children to go unto him, not to stick a fork in their brains because “mommy” hasn’t finished her International Relations degree yet.</p><p>Seriously, what does the Democratic Party stand for, <em>sopratutto</em>:</p><p>Higher taxes<br> <br>Abortion<br> <br>Entitlements<br> <br>Affirmative action<br> <br>Eradicating religion<br> <br>Globalism<br> <br>Gay rights</br></br></br></br></br></br></br></br></br></br></br></br></p><p>The only one that correlates with Christian teaching at all is – maybe- entititlements, and that only because Jesus did say that the poor would be with us always, and entitlements are one way to make sure of that.  Is it any wonder that the evangelicals all left that building?  Of course, if George Bush keeps it up, my Christian Libertarian party will be the de facto third party.</p><p>UPDATE: DG contributes another Clark gem: <em>“Now, there’s one party in America that’s made the United Nations the enemy. And I don’t know how many of you have ever read that series of books that’s published by the Christian right that’s called the “Left Behind” series?  Probably nobody’s read it up here. But don’t feel bad, I’m not recommending it to you. I’m just telling you that according to the book cover that I saw in the airport, 55 million copies have been printed. And in it, the Antichrist is the United Nations. And so there’s this huge, ill-informed body of sentiment out there that’s just grinding away against the United Nations.” (Jan. 7, Fuller Elementary School, Keene.)</em></p><p>And there’s 55 million uninformed people who won’t be voting for General Clark.  The United Nations certainly is the enemy, as dictated by basic logic and behavior as well as apocalyptic Christian <em>fiction</em>.  Anyone else surprised that the good general has trouble separating fact from fantasy?  But given the president’s amnesty plan, Republicans will find it hard to attack Democrats on giving away the national sovereignty store.</p></div>",
  "content_text": "Rich Lowry writes:\n[Gen. Clark] accuses the Republican party of a lack of true Christianity, saying that “there’s only one party that lives that faith in America, and that’s our party, the Democratic party.”\nDon’t most Democrats who aren’t nominal once-a-year-won’t-kill-me Christians hate Christians who actually take the tenets of the faith seriously, or at the very least wish that they would stay out of politics altogether?   Otherwise, what’s with all the cracks about Bible thumpers, the virulent antipathy for Catholic and evangelical judges, and the desire to eradicate all signs of Christmas from public view.\nOne wonders what in the seventh secret name of Gehenna the general is smoking.  Clark must have the notion that playing Robin Hood with other people’s money is the same thing as charity – of course, Jesus said to give to Caesar what is Caesar’s, not what belongs toJoseph, Mary, Simon Peter and Paul.  And he also said to suffer the little children to go unto him, not to stick a fork in their brains because “mommy” hasn’t finished her International Relations degree yet.\nSeriously, what does the Democratic Party stand for,\nsopratutto\n:\nHigher taxes\nAbortion\nEntitlements\nAffirmative action\nEradicating religion\nGlobalism\nGay rights\nThe only one that correlates with Christian teaching at all is – maybe- entititlements, and that only because Jesus did say that the poor would be with us always, and entitlements are one way to make sure of that.  Is it any wonder that the evangelicals all left that building?  Of course, if George Bush keeps it up, my Christian Libertarian party will be the de facto third party.\nUPDATE: DG contributes another Clark gem:\n“Now, there’s one party in America that’s made the United Nations the enemy. And I don’t know how many of you have ever read that series of books that’s published by the Christian right that’s called the “Left Behind” series?  Probably nobody’s read it up here. But don’t feel bad, I’m not recommending it to you. I’m just telling you that according to the book cover that I saw in the airport, 55 million copies have been printed. And in it, the Antichrist is the United Nations. And so there’s this huge, ill-informed body of sentiment out there that’s just grinding away against the United Nations.” (Jan. 7, Fuller Elementary School, Keene.)\nAnd there’s 55 million uninformed people who won’t be voting for General Clark.  The United Nations certainly is the enemy, as dictated by basic logic and behavior as well as apocalyptic Christian\nfiction\n.  Anyone else surprised that the good general has trouble separating fact from fantasy?  But given the president’s amnesty plan, Republicans will find it hard to attack Democrats on giving away the national sovereignty store.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-13T21:01:00+00:00"
}