{
  "url": "https://voxday.net/2004/01/06/beating-their-heads-against-wa/",
  "scraped_at": "2025-12-13T15:41:53.419772",
  "title": "Beating their heads against a wall",
  "date_display": "January 6, 2004",
  "date_iso": "2004-01-06T12:12:00+00:00",
  "date_from_url": "2004-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know how long it will be before CNN offers me a television show – I’m not interested in one – but it’s only a matter of time.  I said for years that the left-liberal media would get slaughtered if anyone ever put together an even moderately conservative channel; sure enough, it’s happening.  Fox isn’t even particularly conservative and most of its hosts aren’t very bright, but they are at least likable and in sync with the American mainstream, unlike the talking heads of the ABCNNBCBS cartel.  You can’t simultanously be a vanguard and a part of the mainstream, after all.</p><p>Instead of pulling their moussed heads out of their posteriors, though, the media executives seem to think that finger-pointing and calling their potential audiences stupid is the way to bring in more viewers.  Right, that’ll probably work.  CNN needs to go overboard to the right if it wants to seriously take on Fox, dabbling in Fox Light will never do.  They probably won’t start to do this until Fox has three times their viewers and they’re desperate enough, though.</p><p>As for MSNBC, <em>a distant third among cable news networks, slipped in most categories….  MSNBC is expected this week to announce a new prime-time show featuring Georgia native Deborah Norville as the host.</em> More of what already isn’t working seldom turns things around.  But she is cuter than either Pat Buchanan or Bill Press, so they have that going for them.  I give MSNBC three more years before they go technology channel.  One must give them credit for trying Alan Keyes and Michael Savage, but Keyes was never comfortable on camera and Howard Stern had already proved that radio shock jocks don’t make for decent television.  And Jesse… please.  The man can barely talk.  It doesn’t really matter, as three minutes of cursory discussion and a quick move on to the next subject just doesn’t work for me.  I’d rather watch ESPN or MTV anyhow.</p><p>So, <a href=\"http://ajc.printthis.clickability.com/pt/cpt?action=cpt&amp;title=ajc.com+%7C+Business+%7C+Fox+fattens+lead+on+CNN+in+peak+year+for+cable+news&amp;expire=&amp;urlID=8712173&amp;fb=Y&amp;url=http%3A%2F%2Fwww.ajc.com%2Fbusiness%2Fcontent%2Fbusiness%2Fcnn%2F0104%2F06ratings.html&amp;partnerID=550\">the ratings massacre continues</a>.  Fox not only has a bigger viewership already,  it’s growing faster too.  At current rates of growth, Fox will double CNN in 2005 and triple them in 2006.</p><p>If I had to guess, I figure that 2006 is when CNN gives me a call.   I really don’t like the medium, though.  Never have, never will.</p></div>",
  "content_text": "I don’t know how long it will be before CNN offers me a television show – I’m not interested in one – but it’s only a matter of time.  I said for years that the left-liberal media would get slaughtered if anyone ever put together an even moderately conservative channel; sure enough, it’s happening.  Fox isn’t even particularly conservative and most of its hosts aren’t very bright, but they are at least likable and in sync with the American mainstream, unlike the talking heads of the ABCNNBCBS cartel.  You can’t simultanously be a vanguard and a part of the mainstream, after all.\nInstead of pulling their moussed heads out of their posteriors, though, the media executives seem to think that finger-pointing and calling their potential audiences stupid is the way to bring in more viewers.  Right, that’ll probably work.  CNN needs to go overboard to the right if it wants to seriously take on Fox, dabbling in Fox Light will never do.  They probably won’t start to do this until Fox has three times their viewers and they’re desperate enough, though.\nAs for MSNBC,\na distant third among cable news networks, slipped in most categories….  MSNBC is expected this week to announce a new prime-time show featuring Georgia native Deborah Norville as the host.\nMore of what already isn’t working seldom turns things around.  But she is cuter than either Pat Buchanan or Bill Press, so they have that going for them.  I give MSNBC three more years before they go technology channel.  One must give them credit for trying Alan Keyes and Michael Savage, but Keyes was never comfortable on camera and Howard Stern had already proved that radio shock jocks don’t make for decent television.  And Jesse… please.  The man can barely talk.  It doesn’t really matter, as three minutes of cursory discussion and a quick move on to the next subject just doesn’t work for me.  I’d rather watch ESPN or MTV anyhow.\nSo,\nthe ratings massacre continues\n.  Fox not only has a bigger viewership already,  it’s growing faster too.  At current rates of growth, Fox will double CNN in 2005 and triple them in 2006.\nIf I had to guess, I figure that 2006 is when CNN gives me a call.   I really don’t like the medium, though.  Never have, never will.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-06T12:12:00+00:00"
}