{
  "url": "https://voxday.net/2004/01/10/big-media-blogfamy/",
  "scraped_at": "2025-12-13T15:42:43.544886",
  "title": "Big media blogfamy",
  "date_display": "January 10, 2004",
  "date_iso": "2004-01-10T09:12:00+00:00",
  "date_from_url": "2004-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.evangelicaloutpost.com\">The Evangelical Outpost</a> writes: <em>Must Read List: Vox Popoli — Normally the last thing I want to promote is a “big media” writer who enters the world of blogging. But for a writer as talented and as interesting as Vox Day I’ll make an exception. He’s a syndicated writer and contributor to WorldNetDaily. (I found out today that we have something in common. His column is carried in The Dallas Morning News, which has the ninth largest circulation in the country. I myself used to write a column for a Texas newspaper that had a circulation of nine.)</em></p><p>I also recommend checking out <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36447\">his latest column</a> which deconstructs the false claim that Marine general Anthony Zinni made an anti-Semitic remark. He also has what is still my favorite line of the week. In response to Howard Dean’s claim that his decision to support gay civil unions was informed by his “religious faith,” Vox writes, “Well, in fairness, Howard only said he’d be talking about God. He didn’t say he’d be listening to Him.” </p><p>Actually, Joe and I have more in common than that.  We are both massive fans of the man Tom Clancy once described as the Warrior Prince of the Marine Corps, former USMC Commandant Charles Krulak.  I should probably mention that my column hasn’t started running in the DMN yet, but it will in a week or two.  I also think “big media” is probably overstating it by an order of magnitude at this point, but  we’ll get there soon enough.</p><p>Now that I think about it, this would be a good time to start pestering your local newspaper if you’d like to see my column start appearing in it.  Unless they’ve already filled their quota of sardonic Christian libertarian techno-adepts <a href=\"http://www.basicpleasuremodel.com\">with pop star potential</a>.</p></div>",
  "content_text": "The Evangelical Outpost\nwrites:\nMust Read List: Vox Popoli — Normally the last thing I want to promote is a “big media” writer who enters the world of blogging. But for a writer as talented and as interesting as Vox Day I’ll make an exception. He’s a syndicated writer and contributor to WorldNetDaily. (I found out today that we have something in common. His column is carried in The Dallas Morning News, which has the ninth largest circulation in the country. I myself used to write a column for a Texas newspaper that had a circulation of nine.)\nI also recommend checking out\nhis latest column\nwhich deconstructs the false claim that Marine general Anthony Zinni made an anti-Semitic remark. He also has what is still my favorite line of the week. In response to Howard Dean’s claim that his decision to support gay civil unions was informed by his “religious faith,” Vox writes, “Well, in fairness, Howard only said he’d be talking about God. He didn’t say he’d be listening to Him.”\nActually, Joe and I have more in common than that.  We are both massive fans of the man Tom Clancy once described as the Warrior Prince of the Marine Corps, former USMC Commandant Charles Krulak.  I should probably mention that my column hasn’t started running in the DMN yet, but it will in a week or two.  I also think “big media” is probably overstating it by an order of magnitude at this point, but  we’ll get there soon enough.\nNow that I think about it, this would be a good time to start pestering your local newspaper if you’d like to see my column start appearing in it.  Unless they’ve already filled their quota of sardonic Christian libertarian techno-adepts\nwith pop star potential\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-10T09:12:00+00:00"
}