{
  "url": "https://voxday.net/2004/01/09/britney-whore-of-babylon/",
  "scraped_at": "2025-12-13T15:42:35.100293",
  "title": "Britney, whore of Babylon",
  "date_display": "January 9, 2004",
  "date_iso": "2004-01-09T14:25:00+00:00",
  "date_from_url": "2004-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nationalreview.com/derbyshire/derbyshire200401090845.asp\">John Derbyshire</a> cracks me up: <em>It is a given that one generation doesn’t like another generation’s pleasures. As Dr. Johnson put it in his straightforward way: “Why, Sir, our tastes greatly alter. The lad does not care for the child’s rattle, and the old man does not care for the young man’s whore.” Giving all possible benefit of the doubt to Britney Spears, though, I see nothing redeeming in her act. You can’t even sing the songs yourself, or play them on air guitar. For this Buddy Holly died?</em></p><p>An awful suspicion forms in my mind. The empty lewdness of the stage act; the bottomless nothingness in Britney’s eyes and words; all that emptiness and nothingness and purposelessness; the trashing of our culture’s most hallowed ceremony… for what? Can it be…? Yes! I only hope I can get the word out before they track me down.</p><p>Listen: Britney Spears is an instrument of Satan. The poor girl has sold her soul, or had it stolen from her. That travesty of a marriage was not for nothing — it was a union in evil! Its issue will be the Antichrist, and the world will be his dominion. These are the Last Times. You have been warned.</p><p>Exit stage left, pursued by a dragon….</p></div>",
  "content_text": "John Derbyshire\ncracks me up:\nIt is a given that one generation doesn’t like another generation’s pleasures. As Dr. Johnson put it in his straightforward way: “Why, Sir, our tastes greatly alter. The lad does not care for the child’s rattle, and the old man does not care for the young man’s whore.” Giving all possible benefit of the doubt to Britney Spears, though, I see nothing redeeming in her act. You can’t even sing the songs yourself, or play them on air guitar. For this Buddy Holly died?\nAn awful suspicion forms in my mind. The empty lewdness of the stage act; the bottomless nothingness in Britney’s eyes and words; all that emptiness and nothingness and purposelessness; the trashing of our culture’s most hallowed ceremony… for what? Can it be…? Yes! I only hope I can get the word out before they track me down.\nListen: Britney Spears is an instrument of Satan. The poor girl has sold her soul, or had it stolen from her. That travesty of a marriage was not for nothing — it was a union in evil! Its issue will be the Antichrist, and the world will be his dominion. These are the Last Times. You have been warned.\nExit stage left, pursued by a dragon….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-09T14:25:00+00:00"
}