{
  "url": "https://voxday.net/2004/01/23/che-cazzara-stupida/",
  "scraped_at": "2025-12-13T15:45:05.250778",
  "title": "Che cazzara stupida",
  "date_display": "January 23, 2004",
  "date_iso": "2004-01-23T23:49:00+00:00",
  "date_from_url": "2004-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Maureen Dowd writes: <em>The Philippines. Thailand. Italy. Spain. Poland. Denmark. Bulgaria. Ukraine. Romania. The Netherlands. Norway. El Salvador.  Can you believe President Bush is still pushing the cockamamie claim that we went to war in Iraq with a real coalition rather than a gaggle of poodles and lackeys?</em></p><p>I know I can speak for my friend, the Italian tank commander who served in Afghanistan and was stationed until recently at Nassiriyah where he lost a schoolmate, in saying <em>va fanculo, puttana di merde</em>.  He and his boys were good enough for the USMC, so they’re good enough for me and they’re bloody well good enough for a clueless old has-been who hasn’t written a single thing worth reading since Monica was getting her kneepads and Dowd was wishing she could.  Well, maybe she has written something worthwhile in the intervening years, but I wouldn’t know because I quit reading her trite and boring attempts at wit long ago.</p><p>Dowd is a moron, but even her extreme level of vacuity doesn’t excuse this.  I’d like to see Maureen and her fat thighs thundering along one of the mountain runs that the Alpini do for training.  The Italians may not be the world’s finest fighting force, but here’s some news for her: neither are the bloody French!  I notice she just happened to leave the Brits and the Aussies off her list.</p><p>Blackfive calls BS on her, comparing the <a href=\"http://www.blackfive.net/main/2004/01/attention_democ.html#more\">coalition in Korea</a> to the one in Iraq.  Citizen Smash <a href=\"http://www.lt-smash.us/archives/002562.html#002562\">draws a picture</a> that even Dowd should be able to grasp.  Don’t you just love how liberal New Yorkers like to pose as being worldly and sophisticated, when truly they’re some of the most insular examples of Americanus Uglicus.  I’ll bet she just <em>adores</em> Florence.</p></div>",
  "content_text": "Maureen Dowd writes:\nThe Philippines. Thailand. Italy. Spain. Poland. Denmark. Bulgaria. Ukraine. Romania. The Netherlands. Norway. El Salvador.  Can you believe President Bush is still pushing the cockamamie claim that we went to war in Iraq with a real coalition rather than a gaggle of poodles and lackeys?\nI know I can speak for my friend, the Italian tank commander who served in Afghanistan and was stationed until recently at Nassiriyah where he lost a schoolmate, in saying\nva fanculo, puttana di merde\n.  He and his boys were good enough for the USMC, so they’re good enough for me and they’re bloody well good enough for a clueless old has-been who hasn’t written a single thing worth reading since Monica was getting her kneepads and Dowd was wishing she could.  Well, maybe she has written something worthwhile in the intervening years, but I wouldn’t know because I quit reading her trite and boring attempts at wit long ago.\nDowd is a moron, but even her extreme level of vacuity doesn’t excuse this.  I’d like to see Maureen and her fat thighs thundering along one of the mountain runs that the Alpini do for training.  The Italians may not be the world’s finest fighting force, but here’s some news for her: neither are the bloody French!  I notice she just happened to leave the Brits and the Aussies off her list.\nBlackfive calls BS on her, comparing the\ncoalition in Korea\nto the one in Iraq.  Citizen Smash\ndraws a picture\nthat even Dowd should be able to grasp.  Don’t you just love how liberal New Yorkers like to pose as being worldly and sophisticated, when truly they’re some of the most insular examples of Americanus Uglicus.  I’ll bet she just\nadores\nFlorence.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-23T23:49:00+00:00"
}