{
  "url": "https://voxday.net/2004/01/22/crudeness-of-oz/",
  "scraped_at": "2025-12-13T15:44:53.427747",
  "title": "The crudeness of Oz",
  "date_display": "January 22, 2004",
  "date_iso": "2004-01-22T13:08:00+00:00",
  "date_from_url": "2004-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One Kiwi commenter reminded me of my Ozzie friend, Firestarter.  I was exploring the Lombard interior with a pair of Australian couples in search of the mythical Zegna outlet, which gave me the opportunity to observe the species up close and personal.  Firestarter was trying to figure out if an associate of his brother’s, who worked with the other guy’s wife, was the jerk he suspected him to be.  The woman was reluctant to be forthcoming, which finally prompted her husband to burst out: “look, is he a wanker or is he a mate?”</p><p>But the women can hold their own.  Both the guys were rhapsodizing all morning about a statue they’d seen the day before entitled <em>Primavera,</em> which, naturally, was a scantily-clad, barely pubescent, beautiful young girl.  After listening to a long and monotonous duet on the aesthetic charms of youthful pulchritude, one of the women finally gestured to a young boy walking by and snapped: “You know, I’d really like to suck his d—!”</p><p>The other woman and I burst out laughing, while the two Ozzies looked suitably chastened for all of about five seconds, then cracked up themselves.  Ozzies are great; they’re the only aliens I know who fully grok the fullness of American humor.  And speaking of Firestarter, it’s been too long since we’ve talked.  Give me a call, mate.</p></div>",
  "content_text": "One Kiwi commenter reminded me of my Ozzie friend, Firestarter.  I was exploring the Lombard interior with a pair of Australian couples in search of the mythical Zegna outlet, which gave me the opportunity to observe the species up close and personal.  Firestarter was trying to figure out if an associate of his brother’s, who worked with the other guy’s wife, was the jerk he suspected him to be.  The woman was reluctant to be forthcoming, which finally prompted her husband to burst out: “look, is he a wanker or is he a mate?”\nBut the women can hold their own.  Both the guys were rhapsodizing all morning about a statue they’d seen the day before entitled\nPrimavera,\nwhich, naturally, was a scantily-clad, barely pubescent, beautiful young girl.  After listening to a long and monotonous duet on the aesthetic charms of youthful pulchritude, one of the women finally gestured to a young boy walking by and snapped: “You know, I’d really like to suck his d—!”\nThe other woman and I burst out laughing, while the two Ozzies looked suitably chastened for all of about five seconds, then cracked up themselves.  Ozzies are great; they’re the only aliens I know who fully grok the fullness of American humor.  And speaking of Firestarter, it’s been too long since we’ve talked.  Give me a call, mate.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-22T13:08:00+00:00"
}