{
  "url": "https://voxday.net/2004/01/19/curse-of-intelligence-2/",
  "scraped_at": "2025-12-13T15:44:19.032541",
  "title": "The curse of intelligence",
  "date_display": "January 19, 2004",
  "date_iso": "2004-01-19T10:52:00+00:00",
  "date_from_url": "2004-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the reasons I felt pretty comfortable making the assertions I did in <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36662\">today’s column</a> is that I am not only in the high-powered intellectual range myself, but I have three close acquaintances and two extended-family members who also are.  The brightest of the bunch, interestingly enough, is the one who would almost certainly be accounted the biggest failure in social, career and societal contribution terms.  Horn lived in the basement of the Digital Ghetto for about two years, taking a low-level tech job only when he ran out of money – usually being promoted twice within the first three months.  He would also almost always make some simple, but astoundingly brilliant suggestion to modify the company’s procedures that would be immediately enacted by a surprised and happy management.</p><p>Then, as soon as he’d stashed a bit of money in the bank, he’d lose interest and stop showing up for work.  Most people who knew him blamed his behavior on the copious amount of chemicals he added to his bloodstream, but that wasn’t it at all.  He always knew what he was doing – indeed, he had a far better idea than most people I know – he simply didn’t have much interest in the trappings of a normal life.  I also saw, first-hand, how his irrepressible curiosity prevented him from accomplishing much, as he’d spend an evening writing a lovely, melodic song on the synthesizers, then not bother to save the MIDI file because he’d thought up an interesting new synthetic chemical formula or conceived a design for a monstrous superbong that required two men to move.  That one, he actually built.  “The filtration is excellent!”  Yeah, and if the police come, we can just push it over and drown them.</p><p>It was always interesting to live with him, though.  And it certainly does sharpen the intellect to have someone walk into your room at three in the morning and lead off with “So what do you think Kant meant  when….” <em>Please, please, tell me this is a nightmare….</em></p><p>I’m not in Horn’s league where raw upstairs firepower is concerned, but Space Bunny would probably tell you that I have the same distaste for focus, even though chemicals don’t figure into my interests.  My next company could quite reasonably justify a ten-digit market cap in five years, assuming that I don’t get too distracted with writing my next fantasy novel or designing the multi-level stratego-tactical historical wargame I’ve been pondering since 1992.  That will sound ridiculous to most people, of course, and yet I’m truly as interested in the third concept as the first.  I’ve certainly put more time into it.</p><p>What’s frightening, to me, is the notion of intelligent people who are able to focus because they so slaver after power over others.  That is why I think that anyone who is willing to put themselves through the grueling rigor of the campaign process should be barred as being psychologically unfit for office.</p></div>",
  "content_text": "One of the reasons I felt pretty comfortable making the assertions I did in\ntoday’s column\nis that I am not only in the high-powered intellectual range myself, but I have three close acquaintances and two extended-family members who also are.  The brightest of the bunch, interestingly enough, is the one who would almost certainly be accounted the biggest failure in social, career and societal contribution terms.  Horn lived in the basement of the Digital Ghetto for about two years, taking a low-level tech job only when he ran out of money – usually being promoted twice within the first three months.  He would also almost always make some simple, but astoundingly brilliant suggestion to modify the company’s procedures that would be immediately enacted by a surprised and happy management.\nThen, as soon as he’d stashed a bit of money in the bank, he’d lose interest and stop showing up for work.  Most people who knew him blamed his behavior on the copious amount of chemicals he added to his bloodstream, but that wasn’t it at all.  He always knew what he was doing – indeed, he had a far better idea than most people I know – he simply didn’t have much interest in the trappings of a normal life.  I also saw, first-hand, how his irrepressible curiosity prevented him from accomplishing much, as he’d spend an evening writing a lovely, melodic song on the synthesizers, then not bother to save the MIDI file because he’d thought up an interesting new synthetic chemical formula or conceived a design for a monstrous superbong that required two men to move.  That one, he actually built.  “The filtration is excellent!”  Yeah, and if the police come, we can just push it over and drown them.\nIt was always interesting to live with him, though.  And it certainly does sharpen the intellect to have someone walk into your room at three in the morning and lead off with “So what do you think Kant meant  when….”\nPlease, please, tell me this is a nightmare….\nI’m not in Horn’s league where raw upstairs firepower is concerned, but Space Bunny would probably tell you that I have the same distaste for focus, even though chemicals don’t figure into my interests.  My next company could quite reasonably justify a ten-digit market cap in five years, assuming that I don’t get too distracted with writing my next fantasy novel or designing the multi-level stratego-tactical historical wargame I’ve been pondering since 1992.  That will sound ridiculous to most people, of course, and yet I’m truly as interested in the third concept as the first.  I’ve certainly put more time into it.\nWhat’s frightening, to me, is the notion of intelligent people who are able to focus because they so slaver after power over others.  That is why I think that anyone who is willing to put themselves through the grueling rigor of the campaign process should be barred as being psychologically unfit for office.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-19T10:52:00+00:00"
}