{
  "url": "https://voxday.net/2004/01/13/different-governing-ideology/",
  "scraped_at": "2025-12-13T15:43:10.155839",
  "title": "A different governing ideology",
  "date_display": "January 13, 2004",
  "date_iso": "2004-01-13T18:34:00+00:00",
  "date_from_url": "2004-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Podhoretz writes: <em>The Bush administration and the GOP Congress have put it all on the line these past years – from the tough line in the War on Terror to the tax cuts to the Big Government solutions on health care and education.  A loss would destroy Republican self-confidence and indicate that the American people are eager for a different kind of governing ideology. </em></p><p>Yes, I suggest that perhaps the American people would be interested in one that doesn’t involve Big Government solutions.  We can get them from the Democrats, now we get them from the Republicans as well.  We can also get them from the Greens and the Socialists.  This is why I never vote for any of these parties.</p><p>Eliminate the Department of Education, like Ronald Reagan promised.  End all Medicare/Medicaid entitlements and ban HMOs.  Eliminate all laws requiring a state-sanctioned license to practice medicine – if you want an AMA-certified doctor, great.  If you can’t afford one, hire whoever you want.  This may come as a big shock to some, but state permission has never been a guarantor of quality.</p></div>",
  "content_text": "John Podhoretz writes:\nThe Bush administration and the GOP Congress have put it all on the line these past years – from the tough line in the War on Terror to the tax cuts to the Big Government solutions on health care and education.  A loss would destroy Republican self-confidence and indicate that the American people are eager for a different kind of governing ideology.\nYes, I suggest that perhaps the American people would be interested in one that doesn’t involve Big Government solutions.  We can get them from the Democrats, now we get them from the Republicans as well.  We can also get them from the Greens and the Socialists.  This is why I never vote for any of these parties.\nEliminate the Department of Education, like Ronald Reagan promised.  End all Medicare/Medicaid entitlements and ban HMOs.  Eliminate all laws requiring a state-sanctioned license to practice medicine – if you want an AMA-certified doctor, great.  If you can’t afford one, hire whoever you want.  This may come as a big shock to some, but state permission has never been a guarantor of quality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-13T18:34:00+00:00"
}