{
  "url": "https://voxday.net/2004/01/04/dont-drink-and-fly/",
  "scraped_at": "2025-12-13T15:41:34.258303",
  "title": "Don’t drink and fly",
  "date_display": "January 4, 2004",
  "date_iso": "2004-01-04T12:34:00+00:00",
  "date_from_url": "2004-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GH has a few beers and writes: <em>Every time there’s an accident the non-aviation media print more misconceptions then the truth.   I do not consider myself an aviation expert, for the subject areas of aviation are too vast for any one individual to claim themselves an expert. I have 36 years of experience in aviation. I have license and certificates that say I have the knowledge and skill to perform the task required by the law.  I define my knowledge of aviation to my students by this comparison. I am only a case of beer in the vastness of all the beer and you are the empty cup waiting to be filled. Some have called me a keg. I’ll drink to that.</em></p><p>The press is a half empty shot glass, the other half is 99.999% misconception.  My experience is that it takes a minimum of eight months with a big emphases on minimum to find out the truth. The press is too impatient to wait that long. They need closure. They will find individuals with a six pack of more or less knowledge than me.  They give them their fifteen minutes of fame and the title of expert. The conclusion is based on opinion, not fact. When the truth does come out a year later it is a non-story.</p><p>I was on the light side when I said a million hits. It’s election year, I have no doubt that you will.  Blast your political foes. People are going to say did you read Vox Day blog today. </p><p>Being a libertarian is never having to fear dearth of political targets.</p></div>",
  "content_text": "GH has a few beers and writes:\nEvery time there’s an accident the non-aviation media print more misconceptions then the truth.   I do not consider myself an aviation expert, for the subject areas of aviation are too vast for any one individual to claim themselves an expert. I have 36 years of experience in aviation. I have license and certificates that say I have the knowledge and skill to perform the task required by the law.  I define my knowledge of aviation to my students by this comparison. I am only a case of beer in the vastness of all the beer and you are the empty cup waiting to be filled. Some have called me a keg. I’ll drink to that.\nThe press is a half empty shot glass, the other half is 99.999% misconception.  My experience is that it takes a minimum of eight months with a big emphases on minimum to find out the truth. The press is too impatient to wait that long. They need closure. They will find individuals with a six pack of more or less knowledge than me.  They give them their fifteen minutes of fame and the title of expert. The conclusion is based on opinion, not fact. When the truth does come out a year later it is a non-story.\nI was on the light side when I said a million hits. It’s election year, I have no doubt that you will.  Blast your political foes. People are going to say did you read Vox Day blog today.\nBeing a libertarian is never having to fear dearth of political targets.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-04T12:34:00+00:00"
}