{
  "url": "https://voxday.net/2004/01/21/embarassment-of-ignorance-2/",
  "scraped_at": "2025-12-13T15:44:39.078842",
  "title": "The embarassment of ignorance",
  "date_display": "January 21, 2004",
  "date_iso": "2004-01-21T00:05:00+00:00",
  "date_from_url": "2004-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TBOGG tries, unsuccessfully, <a href=\"http://tbogg.blogspot.com/2004_01_01_tbogg_archive.html#107423838425107905\">to get on Instapundit</a> for the misuse of military terminology, arguing that Wesley Clark wasn’t “fired by Bill Clinton”, he was only rotated out of his assignment.  This is what happens when you try to substitute a dictionary for actual knowledge.  High-ranking officers are seldom openly relieved, but a rotation in the middle of an assignment is an unmistakable slap in the face and an obvious declaration of incompetence in this context.  That is why the term firing is absolutely appropriate, and it was something for which Bill Clinton, as Commander-in-Chief was ultimately responsible.  But the real issue isn’t whether Clinton liked Clark or not, but if Clark is an incompetent and arrogant buffoon masquerading as a victorious general.  Anyone who has read what passed for his notion of a ground invasion already knows the truth.</p><p>As DG points out: “Clark’s plan to invade Kosovo through Albania, thankfully killed by the Joint Chiefs, was stunning in its lack of basic military judgment. It called for 200,000 troops to invade through Albania over a single road which was only partly paved and had few bridges able to support our tanks and Bradleys. One defense expert said the plan called to mind Gallipoli.”  One road through difficult terrain… hmmm, I was thinking more of Teutoburger Wald.</p><p>In fact, <a href=\"http://slate.msn.com/id/2091194/\">the very column</a> upon which TBOGG relies second-hand, states: <em>Gen. Hugh Shelton, then the chairman of the Joint Chiefs, is another matter. Shelton has recently and famously said, in a public forum, that Clark’s firing “had to do with integrity and character issues,” adding that, for that reason, “Wes won’t get my vote.” Shelton has since refused to elaborate. If there’s a story behind his claim, he should tell it, in the interests of the country. If there isn’t, he should apologize.</em></p><p>So, if you refer to something that no one in the know contradicts, it doesn’t exist if you don’t spell it out for the ignorant?  How ridiculous!  The case against Clark may be unmade for the military know-nothings in the media, but there are many people for whom Clark’s buffoonery has long been an open secret.  The dirty laundry of the services is very seldom aired, especially not at the top levels, and it won’t be aired simply because Fred Kaplan is upset that he isn’t in on it.  Nor, I strongly suspect, is General Shelton the only member of that elite group of five generals who won’t be supporting Wesley Clark in any way shape or form, because they know him much better than his foolish, clueless supporters.</p><p>UPDATE: Here’s the Rev. Paul Mojzes on the Kosovo air war: <em>What the bombing did was exactly the opposite of what its intentions were. It was supposed to stop the expulsion of Albanians from Kosovo but it resulted in a greater expulsion.  This turned out to be a miserable failure. The expulsion of Albanians from Kosovo is vastly greater after the attack by NATO than before, some due to bombing and some due to the activities of the Serb military and paramilitary units….  Before the bombing, there was no mass expulsion.  It was in trickles.  Now, 600,000 people have been expelled. </em></p><p>Furthermore, Milosevic wasn’t captured by US or NATO forces.  He was arrested by Yugoslavian police on domestic charges of corruption almost two years after the war had ended.  Only after intense lobbying by the UN and others was he turned over to the War Crimes Tribunal at the Hague.  Hardly a <em>military</em> success.</p></div>",
  "content_text": "TBOGG tries, unsuccessfully,\nto get on Instapundit\nfor the misuse of military terminology, arguing that Wesley Clark wasn’t “fired by Bill Clinton”, he was only rotated out of his assignment.  This is what happens when you try to substitute a dictionary for actual knowledge.  High-ranking officers are seldom openly relieved, but a rotation in the middle of an assignment is an unmistakable slap in the face and an obvious declaration of incompetence in this context.  That is why the term firing is absolutely appropriate, and it was something for which Bill Clinton, as Commander-in-Chief was ultimately responsible.  But the real issue isn’t whether Clinton liked Clark or not, but if Clark is an incompetent and arrogant buffoon masquerading as a victorious general.  Anyone who has read what passed for his notion of a ground invasion already knows the truth.\nAs DG points out: “Clark’s plan to invade Kosovo through Albania, thankfully killed by the Joint Chiefs, was stunning in its lack of basic military judgment. It called for 200,000 troops to invade through Albania over a single road which was only partly paved and had few bridges able to support our tanks and Bradleys. One defense expert said the plan called to mind Gallipoli.”  One road through difficult terrain… hmmm, I was thinking more of Teutoburger Wald.\nIn fact,\nthe very column\nupon which TBOGG relies second-hand, states:\nGen. Hugh Shelton, then the chairman of the Joint Chiefs, is another matter. Shelton has recently and famously said, in a public forum, that Clark’s firing “had to do with integrity and character issues,” adding that, for that reason, “Wes won’t get my vote.” Shelton has since refused to elaborate. If there’s a story behind his claim, he should tell it, in the interests of the country. If there isn’t, he should apologize.\nSo, if you refer to something that no one in the know contradicts, it doesn’t exist if you don’t spell it out for the ignorant?  How ridiculous!  The case against Clark may be unmade for the military know-nothings in the media, but there are many people for whom Clark’s buffoonery has long been an open secret.  The dirty laundry of the services is very seldom aired, especially not at the top levels, and it won’t be aired simply because Fred Kaplan is upset that he isn’t in on it.  Nor, I strongly suspect, is General Shelton the only member of that elite group of five generals who won’t be supporting Wesley Clark in any way shape or form, because they know him much better than his foolish, clueless supporters.\nUPDATE: Here’s the Rev. Paul Mojzes on the Kosovo air war:\nWhat the bombing did was exactly the opposite of what its intentions were. It was supposed to stop the expulsion of Albanians from Kosovo but it resulted in a greater expulsion.  This turned out to be a miserable failure. The expulsion of Albanians from Kosovo is vastly greater after the attack by NATO than before, some due to bombing and some due to the activities of the Serb military and paramilitary units….  Before the bombing, there was no mass expulsion.  It was in trickles.  Now, 600,000 people have been expelled.\nFurthermore, Milosevic wasn’t captured by US or NATO forces.  He was arrested by Yugoslavian police on domestic charges of corruption almost two years after the war had ended.  Only after intense lobbying by the UN and others was he turned over to the War Crimes Tribunal at the Hague.  Hardly a\nmilitary\nsuccess.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-21T00:05:00+00:00"
}