{
  "url": "https://voxday.net/2004/01/31/episcopal-republicans/",
  "scraped_at": "2025-12-13T15:46:15.843945",
  "title": "Episcopal Republicans",
  "date_display": "January 31, 2004",
  "date_iso": "2004-01-31T11:55:00+00:00",
  "date_from_url": "2004-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Washington Times: <em>“If you must make a choice between heresy and schism, always choose heresy,” said the Rt. Rev. Peter J. Lee to 500 Episcopalians meeting for the annual diocesan council at the Hyatt Regency in Reston.  “For as a heretic, you are only guilty of a wrong opinion,” Bishop Lee said, quoting Presbyterian scholar James McCord. “As a schismatic, you have torn and divided the body of Christ. Choose heresy every time.” … However, there appeared to be pain on both sides of the theological divide yesterday afternoon as church conservatives and liberals hashed out resolutions ranging from blessing same-sex unions to condemning the pro-Robinson votes cast by diocesan representatives in Minneapolis.  Final votes will be this morning. Many argued that church unity is more important than theological uniformity. </em></p><p>It sounds like homosexual Episcopalians and political-relativist Republicans are singing from the same choirbook.  Why don’t they run off and form their own party… wait a minute, they’ve already got one.  It’s called the Democratic Party.</p></div>",
  "content_text": "From the Washington Times:\n“If you must make a choice between heresy and schism, always choose heresy,” said the Rt. Rev. Peter J. Lee to 500 Episcopalians meeting for the annual diocesan council at the Hyatt Regency in Reston.  “For as a heretic, you are only guilty of a wrong opinion,” Bishop Lee said, quoting Presbyterian scholar James McCord. “As a schismatic, you have torn and divided the body of Christ. Choose heresy every time.” … However, there appeared to be pain on both sides of the theological divide yesterday afternoon as church conservatives and liberals hashed out resolutions ranging from blessing same-sex unions to condemning the pro-Robinson votes cast by diocesan representatives in Minneapolis.  Final votes will be this morning. Many argued that church unity is more important than theological uniformity.\nIt sounds like homosexual Episcopalians and political-relativist Republicans are singing from the same choirbook.  Why don’t they run off and form their own party… wait a minute, they’ve already got one.  It’s called the Democratic Party.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-31T11:55:00+00:00"
}