{
  "url": "https://voxday.net/2004/01/19/fred-on-america/",
  "scraped_at": "2025-12-13T15:44:26.407864",
  "title": "Fred on America",
  "date_display": "January 19, 2004",
  "date_iso": "2004-01-19T18:23:00+00:00",
  "date_from_url": "2004-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred <a href=\"http://www.fredoneverything.net/FOE_Frame_Column.htm\">brilliantly expounds</a>: <em>The US government consists of five branches which are, in rough order of importance, the Supreme Court, the media, the presidency, the bureaucracy, and Congress.  The function of the Supreme Court, which is both unanswerable and unaccountable, is to impose things that the congress fears to touch. That is, it establishes programs desired by the ruling political class which could not possibly be democratically enacted. While formally a judicial organ, the Court is in reality our Ministry of Culture and Morals. It determines policy regarding racial integration, abortion, pornography, immigration, the practice of religion, which groups receive special privilege, and what forms of speech shall be punished. </em></p><p>Interesting to see the depth of insight of a man who is, as near as I can tell, not a Christian, but nevertheless has great respect for the primary fount of Western values.  Most Christians, let alone secular humanists, would vociferously argue that there’s no ongoing abolition of Christianity in America.  They’d also be completely wrong.<br> <br><em><br> <br>…the two-party system prevents expression of any ideas the two parties agree to suppress. How much open discussion do you hear during presidential elections of, for example, race, immigration, abortion, gun control, and the continuing abolition of Christianity? These are the issues most important to most people, yet are quashed.</br></br></em></br></br></p><p>Unlike most, Fred puts his money where his mouth is.  He doesn’t like the direction America is going, so he left.  The truth is that America is not the most free country in the world, among other things, the Heritage Foundation puts it tenth in economic freedom.  I’d put it even lower in comparison with some of the countries of New Europe who have no taste for our creeping socialism, so I imagine that our rank will be dropping in the next decade.</p></div>",
  "content_text": "Fred\nbrilliantly expounds\n:\nThe US government consists of five branches which are, in rough order of importance, the Supreme Court, the media, the presidency, the bureaucracy, and Congress.  The function of the Supreme Court, which is both unanswerable and unaccountable, is to impose things that the congress fears to touch. That is, it establishes programs desired by the ruling political class which could not possibly be democratically enacted. While formally a judicial organ, the Court is in reality our Ministry of Culture and Morals. It determines policy regarding racial integration, abortion, pornography, immigration, the practice of religion, which groups receive special privilege, and what forms of speech shall be punished.\nInteresting to see the depth of insight of a man who is, as near as I can tell, not a Christian, but nevertheless has great respect for the primary fount of Western values.  Most Christians, let alone secular humanists, would vociferously argue that there’s no ongoing abolition of Christianity in America.  They’d also be completely wrong.\n…the two-party system prevents expression of any ideas the two parties agree to suppress. How much open discussion do you hear during presidential elections of, for example, race, immigration, abortion, gun control, and the continuing abolition of Christianity? These are the issues most important to most people, yet are quashed.\nUnlike most, Fred puts his money where his mouth is.  He doesn’t like the direction America is going, so he left.  The truth is that America is not the most free country in the world, among other things, the Heritage Foundation puts it tenth in economic freedom.  I’d put it even lower in comparison with some of the countries of New Europe who have no taste for our creeping socialism, so I imagine that our rank will be dropping in the next decade.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-19T18:23:00+00:00"
}