{
  "url": "https://voxday.net/2004/01/31/ha-i-suspected-as-muc/",
  "scraped_at": "2025-12-13T15:46:12.169613",
  "title": "Ha!  I suspected as much",
  "date_display": "January 31, 2004",
  "date_iso": "2004-01-31T09:02:00+00:00",
  "date_from_url": "2004-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Fleming writes: <em>Wednesday was just as nuts. While we talked Smith unwrapped, plugged in and began practicing for a video-game showdown with Patriots Troy Brown that night. Smith usually plays another version of video football and so he was unfamiliar and clumsy at the controls of this game. After only a few moments, Smith and his video Panthers were trailing the Pats 14-0 and he was muttering to himself while frantically scanning the instructions for help before a knock at the door shook him out of his video coma.</em></p><p>I’m not surprised.  Smith normally plays Maddens, I’ll bet, not GameDay.  I only switched over during The Black Years, from 1996 to 1999 when Maddens hadn’t really gotten the hang of three-dimensional technology.  But The Sports Guy’s description of the Super Bowl showdown made it pretty clear that the game was played on a Rookie level, or level two at most, and playing run, run, run the ball is indicative of a player who isn’t much of an expert.</p><p>Yes, this in-depth analysis of events of earth-shaking proportions can only be found here, gentle reader.  You know, it occurs to me that since Maddens probably outsells Michael Jackson by 20 to 1 these days, maybe I should devote every other column to Maddens minutiae.  “Going For it on 4th and Inches”, “Jam and the Eight-Yard Out”, and “First Down, Lifetime to Go”.</p><p>Trivia question: what song should one of the above titles bring to mind without looking anything up?  And I’m not talking about <em>Attenchun!</em> either.</p></div>",
  "content_text": "David Fleming writes:\nWednesday was just as nuts. While we talked Smith unwrapped, plugged in and began practicing for a video-game showdown with Patriots Troy Brown that night. Smith usually plays another version of video football and so he was unfamiliar and clumsy at the controls of this game. After only a few moments, Smith and his video Panthers were trailing the Pats 14-0 and he was muttering to himself while frantically scanning the instructions for help before a knock at the door shook him out of his video coma.\nI’m not surprised.  Smith normally plays Maddens, I’ll bet, not GameDay.  I only switched over during The Black Years, from 1996 to 1999 when Maddens hadn’t really gotten the hang of three-dimensional technology.  But The Sports Guy’s description of the Super Bowl showdown made it pretty clear that the game was played on a Rookie level, or level two at most, and playing run, run, run the ball is indicative of a player who isn’t much of an expert.\nYes, this in-depth analysis of events of earth-shaking proportions can only be found here, gentle reader.  You know, it occurs to me that since Maddens probably outsells Michael Jackson by 20 to 1 these days, maybe I should devote every other column to Maddens minutiae.  “Going For it on 4th and Inches”, “Jam and the Eight-Yard Out”, and “First Down, Lifetime to Go”.\nTrivia question: what song should one of the above titles bring to mind without looking anything up?  And I’m not talking about\nAttenchun!\neither.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-31T09:02:00+00:00"
}