{
  "url": "https://voxday.net/2004/01/15/i-thought-as-muc/",
  "scraped_at": "2025-12-13T15:43:29.362705",
  "title": "I thought as much",
  "date_display": "January 15, 2004",
  "date_iso": "2004-01-15T08:06:00+00:00",
  "date_from_url": "2004-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mark comments: <em>I, as one of the indoctrinated (now recovered), still have many friends and relatives who are so repulsed by anything Republican and/or Christian that they would literally vote to have themselves exterminated, rather than vote conservative….   Fortunately, I think it’s turning around. Myself and many of my friends, mainly due to exposure from talk radio and sites like WND, are doing the proverbial forehead-slap saying “What the hell was I thinking?”</em></p><p>I’ll say this Vox. I’ve switched teams. The secular elites had their shot and they blew it because they have no regard for truth, economic or otherwise. I, as a Jew, would rather live in a nation teeming with evangelical Christians than in the nation that the leftists would produce. Six years ago, I never would have made, nor even remotely entertained, such a statement.</p><p>Mark’s comments are significant, and demontrate precisely was why I was wondering what percentage of Jews supported the National Socialists prior to their coming to power.  Contrary to what most people think, the NASDAP was not a single issue party, and for all their open <em>judenhassen</em>, the Final Solution was not their first idea with regards to handling “the Jewish question” nor was it even under discussion for most of the party’s history.  Read their Munich Manfesto; except for the Versailles Treaty references it reads like the 2000 Democratic Partly platform.</p><p>It is ironic, of course, that Jew should turn to the intellectual left, since collectivist philosophies have literally and repeatedly been the death of them.  Given that conservatives have not supported the divine right of kings for at least 200 years – longer than the Republican party has existed – it seems a little strange to hold them responsible for what happened five hundred years ago in Spain and other medieval kingdoms.  Such collective historical guilt assignation would justify the medieval Christian prejudice against them for killing Jesus, after all.  Which, as a Christian, I abjure, since Jesus Christ’s very intention was to be a sacrifice for Man.</p><p>Anyhow, Mark’s comments may prove the power of the media and academic institutions, but they also show that the Internet and publications like WorldNetDaily and the many blogs of the blogosphere are changing things.  If there is one lesson from history that is dependable, it is that the status quo never persists.  And if Jews can be Christian Democrats (as in Europe), they can certainly be Christian libertarians.</p><p>I think Pieter’s comments are perceptive too.  I have to admit, I fail to see why Jews often get bent out of shape when Christians refer to their “false” religion and try to convert them.  A solid quarter of my friends think my religion is false and occasionally try to “convert” me to their atheist or agnostic point of view.  It doesn’t bother me in the least.  Actually, “false” would be putting it nicely.  “Fairy tales”, “imitative agrarian myth” and “stupid s—” would be more par for the course.</p></div>",
  "content_text": "Mark comments:\nI, as one of the indoctrinated (now recovered), still have many friends and relatives who are so repulsed by anything Republican and/or Christian that they would literally vote to have themselves exterminated, rather than vote conservative….   Fortunately, I think it’s turning around. Myself and many of my friends, mainly due to exposure from talk radio and sites like WND, are doing the proverbial forehead-slap saying “What the hell was I thinking?”\nI’ll say this Vox. I’ve switched teams. The secular elites had their shot and they blew it because they have no regard for truth, economic or otherwise. I, as a Jew, would rather live in a nation teeming with evangelical Christians than in the nation that the leftists would produce. Six years ago, I never would have made, nor even remotely entertained, such a statement.\nMark’s comments are significant, and demontrate precisely was why I was wondering what percentage of Jews supported the National Socialists prior to their coming to power.  Contrary to what most people think, the NASDAP was not a single issue party, and for all their open\njudenhassen\n, the Final Solution was not their first idea with regards to handling “the Jewish question” nor was it even under discussion for most of the party’s history.  Read their Munich Manfesto; except for the Versailles Treaty references it reads like the 2000 Democratic Partly platform.\nIt is ironic, of course, that Jew should turn to the intellectual left, since collectivist philosophies have literally and repeatedly been the death of them.  Given that conservatives have not supported the divine right of kings for at least 200 years – longer than the Republican party has existed – it seems a little strange to hold them responsible for what happened five hundred years ago in Spain and other medieval kingdoms.  Such collective historical guilt assignation would justify the medieval Christian prejudice against them for killing Jesus, after all.  Which, as a Christian, I abjure, since Jesus Christ’s very intention was to be a sacrifice for Man.\nAnyhow, Mark’s comments may prove the power of the media and academic institutions, but they also show that the Internet and publications like WorldNetDaily and the many blogs of the blogosphere are changing things.  If there is one lesson from history that is dependable, it is that the status quo never persists.  And if Jews can be Christian Democrats (as in Europe), they can certainly be Christian libertarians.\nI think Pieter’s comments are perceptive too.  I have to admit, I fail to see why Jews often get bent out of shape when Christians refer to their “false” religion and try to convert them.  A solid quarter of my friends think my religion is false and occasionally try to “convert” me to their atheist or agnostic point of view.  It doesn’t bother me in the least.  Actually, “false” would be putting it nicely.  “Fairy tales”, “imitative agrarian myth” and “stupid s—” would be more par for the course.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-15T08:06:00+00:00"
}