{
  "url": "https://voxday.net/2004/01/09/if-it-isnt-in-print-it-must-not-be/",
  "scraped_at": "2025-12-13T15:42:28.005145",
  "title": "If it isn’t in print it must not be true",
  "date_display": "January 9, 2004",
  "date_iso": "2004-01-09T10:46:00+00:00",
  "date_from_url": "2004-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are times when I have serious sympathy for my fellow elitists who don’t believe that the Great Unwashed should be permitted to decide anything but which channel to watch.</p><p><a href=\"http://www.foxnews.com/story/0,2933,107274,00.html\">John Lott writes</a>: <em>With the avalanche of horrific news stories about guns over the years, it’s no wonder people find it hard to believe that, according to surveys there are about two million defensive gun uses each year; guns are used defensively four times more frequently than they are to commit crimes.</em></p><p>The rebuttal to this claim always is: If these events were really happening, wouldn’t we hear about them on the news? </p><p>And when would that be, when there’s so much celebrity porn that requires indulging?  I’m surprised the television media even bothered to report on the Iraqi war, considering that a celebrity somewhere did something during that time.  Oh, I’m an elitist all right, I’m just an Aristotelian libertarian Christian instead of a secular Platonist collectivist.  Anyhow, it’s a good article.  Lott seems to know his stuff, although I wish he wasn’t so reticent about his research records.  He’s no fantasist like Bellesiles, but he’s not as transparent and solid as he should be either.</p></div>",
  "content_text": "There are times when I have serious sympathy for my fellow elitists who don’t believe that the Great Unwashed should be permitted to decide anything but which channel to watch.\nJohn Lott writes\n:\nWith the avalanche of horrific news stories about guns over the years, it’s no wonder people find it hard to believe that, according to surveys there are about two million defensive gun uses each year; guns are used defensively four times more frequently than they are to commit crimes.\nThe rebuttal to this claim always is: If these events were really happening, wouldn’t we hear about them on the news?\nAnd when would that be, when there’s so much celebrity porn that requires indulging?  I’m surprised the television media even bothered to report on the Iraqi war, considering that a celebrity somewhere did something during that time.  Oh, I’m an elitist all right, I’m just an Aristotelian libertarian Christian instead of a secular Platonist collectivist.  Anyhow, it’s a good article.  Lott seems to know his stuff, although I wish he wasn’t so reticent about his research records.  He’s no fantasist like Bellesiles, but he’s not as transparent and solid as he should be either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-09T10:46:00+00:00"
}