{
  "url": "https://voxday.net/2004/01/15/im-rape-victim-too/",
  "scraped_at": "2025-12-13T15:43:39.519381",
  "title": "I’m a rape victim too!",
  "date_display": "January 15, 2004",
  "date_iso": "2004-01-15T18:26:00+00:00",
  "date_from_url": "2004-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Jackson’s biggest defender writes: <em>A book by Robin Warshaw, <em>I Never Called It Rape</em>, cites a study of 6,000 college students at 32 colleges and universities. They reported: 1 in 4 college women has been a victim of rape or of an attempted rape. 84 percent knew their attacker. 42 percent told no one about the assault, and only 5 percent reported it to the police. 98 percent of rapes were men assaulting women. 75 percent of the men and at least 55 percent of the women involved in acquaintance rapes had been drinking and/or taking drugs before the attack. (Other statistics report this figure is closer to 90 percent.) </em></p><p>Picture Val Kilmer coughing.  In Top Gun.  You know what I mean.</p><p>Such precise science too!  55 percent.  Or 90 percent.  Whatever.</p><p>What a load of victimological garbage.  By the “rape” standard used here, I’ve been raped by a woman.  Several women, in fact, as on more than one occasion, I was subjected to uninvited sexual contact initiated without my consent while I was incapacited by alchohol.  -SOB-  Hold me Ralph!</p><p>Boo-freaking-hoo.  I’ll bet 1 in 4 college men have been a victim of such “rape” too.  We didn’t call it rape either.  Of course, the reason it isn’t called that, or reported or prosecuted, for that matter, is because it isn’t rape.  It’s called irresponsible sex.</p></div>",
  "content_text": "Michael Jackson’s biggest defender writes:\nA book by Robin Warshaw,\nI Never Called It Rape\n, cites a study of 6,000 college students at 32 colleges and universities. They reported: 1 in 4 college women has been a victim of rape or of an attempted rape. 84 percent knew their attacker. 42 percent told no one about the assault, and only 5 percent reported it to the police. 98 percent of rapes were men assaulting women. 75 percent of the men and at least 55 percent of the women involved in acquaintance rapes had been drinking and/or taking drugs before the attack. (Other statistics report this figure is closer to 90 percent.)\nPicture Val Kilmer coughing.  In Top Gun.  You know what I mean.\nSuch precise science too!  55 percent.  Or 90 percent.  Whatever.\nWhat a load of victimological garbage.  By the “rape” standard used here, I’ve been raped by a woman.  Several women, in fact, as on more than one occasion, I was subjected to uninvited sexual contact initiated without my consent while I was incapacited by alchohol.  -SOB-  Hold me Ralph!\nBoo-freaking-hoo.  I’ll bet 1 in 4 college men have been a victim of such “rape” too.  We didn’t call it rape either.  Of course, the reason it isn’t called that, or reported or prosecuted, for that matter, is because it isn’t rape.  It’s called irresponsible sex.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-15T18:26:00+00:00"
}