{
  "url": "https://voxday.net/2004/01/31/innocence-of-lamb/",
  "scraped_at": "2025-12-13T15:46:14.026207",
  "title": "Innocence of the Lamb",
  "date_display": "January 31, 2004",
  "date_iso": "2004-01-31T09:42:00+00:00",
  "date_from_url": "2004-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Henry Lamb <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36863\">writes on WND</a>: <em>The Patriot Act, the prescription drug program, the “guest worker” program, the so-called “free trade” programs and a half-trillion dollar deficit have left conservatives reeling, wondering why a Republican administration and Congress have produced results that look so much like what they would expect from a Democrat administration and Congress.Consequently, many, many Republicans have thrown up their hands and have decided to either join some doomed third-party movement or simply stay home.  While this reaction may be understandable, it is not only self-defeating, it violates the first law of true believers: Never, never, never, never give up! </em></p><p>The point, Henry, is that we’re true conservative and libertarian believers, not true believers in George Delano or the Republican Party.  A party is just a vehicle, and once it demonstrates a lack of commitment to its principles, it is dead.  Politicians don’t think long term.  The theory that governing like a Democrat will bring the party enough seats to override filibusters, at which point conservative small government will begin is a total mirage, a crack-pipe dream.  Not a single mock-conservative leader has EVER promised this, it’s a fantasy scenario dreamed up by conservative political junkies who can’t face the reality that they’ve been betrayed… again.</p><p><em>Conservatives who truly believe that freedom is better than socialism, those who want freedom for their children rather than a world socialist government, will never, never, never, never give up. They will show up in November.</em></p><p>Not voting for a socialist in conservative’s clothing does not amount to giving up.  Those with the courage to deal with reality and face the hard task of pushing the Sisyphean rock up the mountain again are the only ones showing a real dedication to the truth and to freedom.  If Karl Rove and company are waking up to the fact that they’re cutting their own candidates throat, then let me tell them the only way that George Delano will be able to gain a modicum of my trust and get my vote:</p><p>1. Announce that he is ordering an audit of all Federal programs to conform with the Constitution.  Those that don’t will be killed by executive order.  Is this so outrageous for someone sworn to defend and uphold it?</p><p>2.  Announce the immediate withdrawal of the United States from the UN and all other supranational organizations that in any way infringe on US national sovereignty, again by executive order.</p><p>3.   Announce an in-depth, open-to-the-public investigation of the Constitutional legitimacy of the Federal income tax and the immediate suspension of all illegal and fraudulent activities of the IRS.  There is no question, zero, that the IRS is a law-breaking fraud <em>even if</em> I’m wrong and the income tax passes legal and Constitutional muster with flying colors.  He doesn’t even need an executive order for this one.</p><p>There is nothing preventing the president from doing these three things.  If he does them, I’m willing to take the future on faith.  But invading a few countries while ignoring the only one that attacked us and withdrawing from a protocol that the Europeans were never going to ratify hardly lends any credence to the notion that George Delano has a secret plan to save the Constitution by destroying it.</p><p>On a tangential note, mark that FDR invaded countries.  LBJ invaded countries.  George Bush I invaded countries.  If you know anything about history, you don’t make a conservative argument for a president by pointing out that he successfully invaded other countries – Henry Lamb doesn’t argue this, of course, but it’s the only argument that many deluded conservatives who agree with Lamb are making.</p><p>UPDATE: Chuck Baldwin has a great column on George Delano and political-relativist conservatives, in which he charges conservatives with “willingly surrendering their independent thinking as well as their American heritage” and cites TR: “To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Nothing but the truth should be spoken about him or anyone else. But it is even more important to tell the truth, pleasant or unpleasant, about him than about any one else.”</p></div>",
  "content_text": "Henry Lamb\nwrites on WND\n:\nThe Patriot Act, the prescription drug program, the “guest worker” program, the so-called “free trade” programs and a half-trillion dollar deficit have left conservatives reeling, wondering why a Republican administration and Congress have produced results that look so much like what they would expect from a Democrat administration and Congress.Consequently, many, many Republicans have thrown up their hands and have decided to either join some doomed third-party movement or simply stay home.  While this reaction may be understandable, it is not only self-defeating, it violates the first law of true believers: Never, never, never, never give up!\nThe point, Henry, is that we’re true conservative and libertarian believers, not true believers in George Delano or the Republican Party.  A party is just a vehicle, and once it demonstrates a lack of commitment to its principles, it is dead.  Politicians don’t think long term.  The theory that governing like a Democrat will bring the party enough seats to override filibusters, at which point conservative small government will begin is a total mirage, a crack-pipe dream.  Not a single mock-conservative leader has EVER promised this, it’s a fantasy scenario dreamed up by conservative political junkies who can’t face the reality that they’ve been betrayed… again.\nConservatives who truly believe that freedom is better than socialism, those who want freedom for their children rather than a world socialist government, will never, never, never, never give up. They will show up in November.\nNot voting for a socialist in conservative’s clothing does not amount to giving up.  Those with the courage to deal with reality and face the hard task of pushing the Sisyphean rock up the mountain again are the only ones showing a real dedication to the truth and to freedom.  If Karl Rove and company are waking up to the fact that they’re cutting their own candidates throat, then let me tell them the only way that George Delano will be able to gain a modicum of my trust and get my vote:\n1. Announce that he is ordering an audit of all Federal programs to conform with the Constitution.  Those that don’t will be killed by executive order.  Is this so outrageous for someone sworn to defend and uphold it?\n2.  Announce the immediate withdrawal of the United States from the UN and all other supranational organizations that in any way infringe on US national sovereignty, again by executive order.\n3.   Announce an in-depth, open-to-the-public investigation of the Constitutional legitimacy of the Federal income tax and the immediate suspension of all illegal and fraudulent activities of the IRS.  There is no question, zero, that the IRS is a law-breaking fraud\neven if\nI’m wrong and the income tax passes legal and Constitutional muster with flying colors.  He doesn’t even need an executive order for this one.\nThere is nothing preventing the president from doing these three things.  If he does them, I’m willing to take the future on faith.  But invading a few countries while ignoring the only one that attacked us and withdrawing from a protocol that the Europeans were never going to ratify hardly lends any credence to the notion that George Delano has a secret plan to save the Constitution by destroying it.\nOn a tangential note, mark that FDR invaded countries.  LBJ invaded countries.  George Bush I invaded countries.  If you know anything about history, you don’t make a conservative argument for a president by pointing out that he successfully invaded other countries – Henry Lamb doesn’t argue this, of course, but it’s the only argument that many deluded conservatives who agree with Lamb are making.\nUPDATE: Chuck Baldwin has a great column on George Delano and political-relativist conservatives, in which he charges conservatives with “willingly surrendering their independent thinking as well as their American heritage” and cites TR: “To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Nothing but the truth should be spoken about him or anyone else. But it is even more important to tell the truth, pleasant or unpleasant, about him than about any one else.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-31T09:42:00+00:00"
}