{
  "url": "https://voxday.net/2004/01/14/jews-sans-clues/",
  "scraped_at": "2025-12-13T15:43:24.176629",
  "title": "Jews sans clues",
  "date_display": "January 14, 2004",
  "date_iso": "2004-01-14T17:26:00+00:00",
  "date_from_url": "2004-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The conspiratorial Volokh writes: <em>Several readers questioned whether Jews really give half of all money raised by the Democratic Party. I’ve seen this figure quoted for years, and it seems well-accepted. Here, for example, is the Washington Post in December: “Jews provided at least half the money donated to the DNC in the 1998 and 2000 election cycles”.  Another Post article, however, qualifies this by noting this refers solely to donations by individual donors, and does not take into account corporate and labor union donations, which have been, to say the least, substantial.  Some of the readers who wrote to me fear that mentioning such figures will stoke anti-Semitism. </em></p><p>Those fearful readers must be left-wingers.  Yes, let’s hide the truth, because if people learn it, maybe they’ll use the data to conclude something we don’t like!  This is not only wrong-headed, it is diametrically opposed to the position of the man who said the truth will set you free.  It’s an interesting fact, given that the Democratic Party is increasingly opposed to Israel, Jews and religion in general.</p><p>Like many evangelical Christians, I’m an outspoken defender of both Jews and Israel.  That being said, I think the crack about the Jewish tendency to vote like Puerto Ricans is amusing, arguably true and completely inexplicable.  Then again, it could also be argued that Jews are, by and large, clueless.  The results of an <a href=\"http://www.ajc.org/InTheMedia/Publications.asp?did=1030\">American Jewish Congress poll</a> showed that 56 percent of American Jews believed that “most” or “many” Muslims are anti-Semitic, while 41 percent believed that “most” or “many” Religious Right Christians are.</p><p>Right.  The people who give millions of dollars to Israel and believe that God will bless those who bless Israel rank as second-class Jew-haters only when compared with those trying to blow up innocent Jewish children and preaching the destruction of Israel.  Seriously, it makes me wonder if a significant percentage of the German Jewish vote went to the National Socialists in 1933.  Sigh.</p></div>",
  "content_text": "The conspiratorial Volokh writes:\nSeveral readers questioned whether Jews really give half of all money raised by the Democratic Party. I’ve seen this figure quoted for years, and it seems well-accepted. Here, for example, is the Washington Post in December: “Jews provided at least half the money donated to the DNC in the 1998 and 2000 election cycles”.  Another Post article, however, qualifies this by noting this refers solely to donations by individual donors, and does not take into account corporate and labor union donations, which have been, to say the least, substantial.  Some of the readers who wrote to me fear that mentioning such figures will stoke anti-Semitism.\nThose fearful readers must be left-wingers.  Yes, let’s hide the truth, because if people learn it, maybe they’ll use the data to conclude something we don’t like!  This is not only wrong-headed, it is diametrically opposed to the position of the man who said the truth will set you free.  It’s an interesting fact, given that the Democratic Party is increasingly opposed to Israel, Jews and religion in general.\nLike many evangelical Christians, I’m an outspoken defender of both Jews and Israel.  That being said, I think the crack about the Jewish tendency to vote like Puerto Ricans is amusing, arguably true and completely inexplicable.  Then again, it could also be argued that Jews are, by and large, clueless.  The results of an\nAmerican Jewish Congress poll\nshowed that 56 percent of American Jews believed that “most” or “many” Muslims are anti-Semitic, while 41 percent believed that “most” or “many” Religious Right Christians are.\nRight.  The people who give millions of dollars to Israel and believe that God will bless those who bless Israel rank as second-class Jew-haters only when compared with those trying to blow up innocent Jewish children and preaching the destruction of Israel.  Seriously, it makes me wonder if a significant percentage of the German Jewish vote went to the National Socialists in 1933.  Sigh.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-14T17:26:00+00:00"
}