{
  "url": "https://voxday.net/2004/01/01/like-rain-on-your-wedding-day/",
  "scraped_at": "2025-12-13T15:41:03.910291",
  "title": "Like rain on your wedding day",
  "date_display": "January 1, 2004",
  "date_iso": "2004-01-01T13:50:00+00:00",
  "date_from_url": "2004-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mensa sends the following: <em>Hello, American Mensa has a technical inconstancy with their bylaws and need your help. We are collecting proxies for this vote at the Annual Business Meeting in July 2004. Your proxy will be used for this matter and this manner only. Either call 1-877-MYPROXY (1-877-697-7690) or use your computer and go to: http://proxy.us.mensa.org – you’ll need your membership number and password issued at the last dues renewal for this process. </em></p><p>Intelligence, it seems, is not to be considered synonymous with mastery of grammar.  One would be disappointed if one’s wife was inconstant, even if she were only technical or inconsistent about it.  Also, being singular, American Mensa would conventionally be expected to use the third person singular conjugation of the verb “to need”, which is to say he/she/it <em>needs</em>.</p><p>There are many reasons why the intellectual elite should not be permitted to run society as in <em>The Republic</em>.  This isn’t one of them, but it does strike me as amusing.  Thank goodness I’m only “claiming” to be a member of Mensa, so I can safely ignore this nonsense.  In any case, a small, but vital component of my philosophy is to ignore any sentence that contains the words “proxy” or “bylaw”.</p><p>UPDATE: PM corrects MY grammar: <em>Yep, you’ve got it.  The subjunctive…the forgotten tense. I actually smiled when I read your posting in question and thought it wouldhave warmed the very soul of Reinhold Niebuhr (perhaps my very favorite American theologian – but then I’m an agnostic gnostic so I probably shouldn’t be trusted) – a man long obsessed with the overarching irony of American history and religion.</em></p><p>There were so many levels of irony in that post of yours that I very nearly had a transcendent spiritual experience myself! But then, seeing as I’m a self-proclaimed agnostic gnostic, I probably would have discounted said experience (had it actually occurred) as the unknowable forced heresy of unseen and malicious powers, chalked the whole experience up to the effects of day-old asparagus, and written a secretive and rambling discourse on the TRUE meaning of the 4-3 defensive set.  Anyway, other than an occasional ‘the’ or ‘it’ (and on rarer occasions,’his’) I seldom agree with a word you say.  But you keep me reading…I’ll give you that.  I never miss a column!</p><p>Now, you see, THAT’S an ideal critique!  I don’t know about the true meaning of the 4-3, but I did nearly burst something laughing this week when one of the Sports Illustrated writers retroactively defended, on the grounds of a shoddy Buffalo offense, Buddy Ryan’s punching of Kevin Gilbride.  Anyhow, the sentence should have been written: “One would be disappointed if one’s wife <em>were to be</em> inconstant….”  Guilty as charged – in pleading for clemency, however, I suggest that such an offense is minor in comparison with a) not knowing the difference between inconsistent and inconstant; and b) improperly conjugating “to need”.  Clearly this blog need an editor.</p></div>",
  "content_text": "Mensa sends the following:\nHello, American Mensa has a technical inconstancy with their bylaws and need your help. We are collecting proxies for this vote at the Annual Business Meeting in July 2004. Your proxy will be used for this matter and this manner only. Either call 1-877-MYPROXY (1-877-697-7690) or use your computer and go to: http://proxy.us.mensa.org – you’ll need your membership number and password issued at the last dues renewal for this process.\nIntelligence, it seems, is not to be considered synonymous with mastery of grammar.  One would be disappointed if one’s wife was inconstant, even if she were only technical or inconsistent about it.  Also, being singular, American Mensa would conventionally be expected to use the third person singular conjugation of the verb “to need”, which is to say he/she/it\nneeds\n.\nThere are many reasons why the intellectual elite should not be permitted to run society as in\nThe Republic\n.  This isn’t one of them, but it does strike me as amusing.  Thank goodness I’m only “claiming” to be a member of Mensa, so I can safely ignore this nonsense.  In any case, a small, but vital component of my philosophy is to ignore any sentence that contains the words “proxy” or “bylaw”.\nUPDATE: PM corrects MY grammar:\nYep, you’ve got it.  The subjunctive…the forgotten tense. I actually smiled when I read your posting in question and thought it wouldhave warmed the very soul of Reinhold Niebuhr (perhaps my very favorite American theologian – but then I’m an agnostic gnostic so I probably shouldn’t be trusted) – a man long obsessed with the overarching irony of American history and religion.\nThere were so many levels of irony in that post of yours that I very nearly had a transcendent spiritual experience myself! But then, seeing as I’m a self-proclaimed agnostic gnostic, I probably would have discounted said experience (had it actually occurred) as the unknowable forced heresy of unseen and malicious powers, chalked the whole experience up to the effects of day-old asparagus, and written a secretive and rambling discourse on the TRUE meaning of the 4-3 defensive set.  Anyway, other than an occasional ‘the’ or ‘it’ (and on rarer occasions,’his’) I seldom agree with a word you say.  But you keep me reading…I’ll give you that.  I never miss a column!\nNow, you see, THAT’S an ideal critique!  I don’t know about the true meaning of the 4-3, but I did nearly burst something laughing this week when one of the Sports Illustrated writers retroactively defended, on the grounds of a shoddy Buffalo offense, Buddy Ryan’s punching of Kevin Gilbride.  Anyhow, the sentence should have been written: “One would be disappointed if one’s wife\nwere to be\ninconstant….”  Guilty as charged – in pleading for clemency, however, I suggest that such an offense is minor in comparison with a) not knowing the difference between inconsistent and inconstant; and b) improperly conjugating “to need”.  Clearly this blog need an editor.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-01T13:50:00+00:00"
}