{
  "url": "https://voxday.net/2004/01/15/mailbox-big-ten/",
  "scraped_at": "2025-12-13T15:43:31.193557",
  "title": "Mailbox: The big tent",
  "date_display": "January 15, 2004",
  "date_iso": "2004-01-15T09:13:00+00:00",
  "date_from_url": "2004-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JM writes: <em>You state that your Christian Libertarianism is not compatible with Calvinistic theology. You are simply wrong. Although I am not a Calvinist, I do tend very strongly towards a Reformed view of the will. And although I have never proclaimed myself to be a libertarian I am not at all hostile to the philosophy.Where you slip up is in your suggestion that the Reformed or Calvinist view denies man all freedom and that when he acts he is compelled to act. This is simply false. Man is free to do exactly and whatever he wills (within the bounds of logic and physics); but his will is to do evil and do it consistently.</em></p><p>Calvin himself says in Book 2, Chapter 2, Section 7 of The Institutes:”In this way, then, man is said to have free will, not because he has a free choice of good and evil, but because he acts voluntarily, and not by compulsion. This is perfectly true: but why should so small a matter have been dignified with so proud a title? An admirable freedom! that man is not forced to be the servant of sin, while he is, however, <em>ejthelodou’lo</em> (a voluntary slave); his will being bound by the fetters of sin.” Calvin did not deny that man has a free will in the sense that he is not compelled to act. He did deny man the freedom to choose between good and evil, not because he is externally restrained from choosing good, but because he has already chosen evil! He corrupted himself and willfully became the slave of sin.</p><p>If I’m wrong, I’m glad to hear it.  If Calvinists are down with de facto free will, great.  That’s not at all what I’ve generally heard from Calvinists in the past, but that signifies nothing as I’ve heard plenty of nonsense from Marxists who’ve never read Marx too.  If what JM is saying is accurate – and I have no reason to believe that it isn’t – then this intellectual tradition is fully compatible with Christian libertarianism too.  God does not compel ergo we do not compel, unless it is absolutely necessary because fundamental rights granted by God are being violated.  The big tent!  Only platonists, collectivists and those more concerned about the specks in others’ eyes need not apply.</p></div>",
  "content_text": "JM writes:\nYou state that your Christian Libertarianism is not compatible with Calvinistic theology. You are simply wrong. Although I am not a Calvinist, I do tend very strongly towards a Reformed view of the will. And although I have never proclaimed myself to be a libertarian I am not at all hostile to the philosophy.Where you slip up is in your suggestion that the Reformed or Calvinist view denies man all freedom and that when he acts he is compelled to act. This is simply false. Man is free to do exactly and whatever he wills (within the bounds of logic and physics); but his will is to do evil and do it consistently.\nCalvin himself says in Book 2, Chapter 2, Section 7 of The Institutes:”In this way, then, man is said to have free will, not because he has a free choice of good and evil, but because he acts voluntarily, and not by compulsion. This is perfectly true: but why should so small a matter have been dignified with so proud a title? An admirable freedom! that man is not forced to be the servant of sin, while he is, however,\nejthelodou’lo\n(a voluntary slave); his will being bound by the fetters of sin.” Calvin did not deny that man has a free will in the sense that he is not compelled to act. He did deny man the freedom to choose between good and evil, not because he is externally restrained from choosing good, but because he has already chosen evil! He corrupted himself and willfully became the slave of sin.\nIf I’m wrong, I’m glad to hear it.  If Calvinists are down with de facto free will, great.  That’s not at all what I’ve generally heard from Calvinists in the past, but that signifies nothing as I’ve heard plenty of nonsense from Marxists who’ve never read Marx too.  If what JM is saying is accurate – and I have no reason to believe that it isn’t – then this intellectual tradition is fully compatible with Christian libertarianism too.  God does not compel ergo we do not compel, unless it is absolutely necessary because fundamental rights granted by God are being violated.  The big tent!  Only platonists, collectivists and those more concerned about the specks in others’ eyes need not apply.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-15T09:13:00+00:00"
}