{
  "url": "https://voxday.net/2004/01/19/mailbox-what-about-you-stupid/",
  "scraped_at": "2025-12-13T15:44:22.751694",
  "title": "Mailbox: What about you, stupid?",
  "date_display": "January 19, 2004",
  "date_iso": "2004-01-19T15:29:00+00:00",
  "date_from_url": "2004-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BP asks: <em> First, I thank you for your Worldnetdaily commentaries. Yours is one of the few columns I always read.  But I do have a question about your last column. How is it that you, a Mensa member, consistently writes a thought-provoking  column, soundly grounded in reality, despite being cursed with a high intelligence? You need a column to explain the success of highly intelligent people.  Interestingly enough, In my close circle of friends, personal and economic success seems to have a small negative correlation with intelligence. But at the subnormal levels life is definite difficulty among those I know.<br> <br/></br></em><br> <br>You are, of course, quite welcome.  As confusing as life can be for the super-bright, there’s no question that it’s much tougher for the stupid.  They deserve our pity, <em>our respect </em>and our help, though never our contempt, and there is no justification to proclaim ourselves a self-selected elite worthy to rule over them, however distasteful their aesthetics and appalling leisures may be to we happy arrogant few.  However, I suggest that you could argue my column is anything but successful.  There are plenty of columns written by the less-than-brilliant that appear in hundreds of papers around the country, while mine is dismissed by editors – even those open to my political ideology – as being over the heads of their readers, which may be why it only appears in precisely two places.  I’ve been told by numerous parties to dumb it down, (excuse me, make it more accessible), if I wish to increase the odds of my success.  A columnist more focused on the financial success and fame of his column would certainly do so.  I considered it for about a week.</br></br></p><p>And, I won’t.  Why not?  Not out of some prideful quasi-artistic pique, but because as a conventionally unfocused megabrain, I have other interests that claim my attention, some of which are significantly more lucrative than mediahood, some of which are orders of magnitude less so.  I’ve concluded that my media career, such as it is, is nothing more than a hobby so I’m free to write as I please.  For example, these last two columns are about as close as I’ll get to the political horse race that will dominate 80 percent of everyone else’s columns for the rest of the year; how many variations on “why Bush is bad” and “why Clark is stupid” do we really need to read?  A lot more than I want to write, I’m sure.</p><p>So, you see, I can be just as functionally-stupid in my own way.  But at least I know it.  General Clark doesn’t.</p></div>",
  "content_text": "BP asks:\nFirst, I thank you for your Worldnetdaily commentaries. Yours is one of the few columns I always read.  But I do have a question about your last column. How is it that you, a Mensa member, consistently writes a thought-provoking  column, soundly grounded in reality, despite being cursed with a high intelligence? You need a column to explain the success of highly intelligent people.  Interestingly enough, In my close circle of friends, personal and economic success seems to have a small negative correlation with intelligence. But at the subnormal levels life is definite difficulty among those I know.\nYou are, of course, quite welcome.  As confusing as life can be for the super-bright, there’s no question that it’s much tougher for the stupid.  They deserve our pity,\nour respect\nand our help, though never our contempt, and there is no justification to proclaim ourselves a self-selected elite worthy to rule over them, however distasteful their aesthetics and appalling leisures may be to we happy arrogant few.  However, I suggest that you could argue my column is anything but successful.  There are plenty of columns written by the less-than-brilliant that appear in hundreds of papers around the country, while mine is dismissed by editors – even those open to my political ideology – as being over the heads of their readers, which may be why it only appears in precisely two places.  I’ve been told by numerous parties to dumb it down, (excuse me, make it more accessible), if I wish to increase the odds of my success.  A columnist more focused on the financial success and fame of his column would certainly do so.  I considered it for about a week.\nAnd, I won’t.  Why not?  Not out of some prideful quasi-artistic pique, but because as a conventionally unfocused megabrain, I have other interests that claim my attention, some of which are significantly more lucrative than mediahood, some of which are orders of magnitude less so.  I’ve concluded that my media career, such as it is, is nothing more than a hobby so I’m free to write as I please.  For example, these last two columns are about as close as I’ll get to the political horse race that will dominate 80 percent of everyone else’s columns for the rest of the year; how many variations on “why Bush is bad” and “why Clark is stupid” do we really need to read?  A lot more than I want to write, I’m sure.\nSo, you see, I can be just as functionally-stupid in my own way.  But at least I know it.  General Clark doesn’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-19T15:29:00+00:00"
}