{
  "url": "https://voxday.net/2004/01/09/mailbox-everything-is-everyones/",
  "scraped_at": "2025-12-13T15:42:22.874379",
  "title": "Mailbox: Everything is everyone’s business",
  "date_display": "January 9, 2004",
  "date_iso": "2004-01-09T08:05:00+00:00",
  "date_from_url": "2004-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SC writes: <em>I accept the idea that each individual should have the freedom to do anything that does not diminish the freedoms of another without the other’s permission.  I would make the argument that not wearing a seat belt or motorcycle helmet does diminish the freedoms of others.  If you are driving without your seat belt and I cause an accident that would not have caused you injury with a seat belt, but did cause sever injury because your head struck the windshield, I would be liable for your medical bills.  With the seat belt law in place, I could argue that the injuries were a result of your choice to break the seat belt law and therefore not my fault.  What say you?</em></p><p>With all due respect, I say that shows a failure to think things through.  If we’re talking about hypotheticals – which we are – then in a libertarian society you would not be liable for anyone else’s medical bills.  This is why neo-socialist medical systems like we have now in the United States are so pernicious.  One bit of government involvement always justifies the next.</p><p>Using this reasoning, you have a perfect right to insist that I have my body injected with chemicals I don’t want in my body because if I get the flu, you have to pay for my treatment.  And in any event, you are not responsible for another’s bad choices regardless of whether a behavior-controlling law is in place or not.  Everything ultimately boils down to one question.  Either the State is supreme (Plato) or the individual is supreme (Aristotle, Jesus Christ).  I’m down with the latter, and will brook no compromise.</p></div>",
  "content_text": "SC writes:\nI accept the idea that each individual should have the freedom to do anything that does not diminish the freedoms of another without the other’s permission.  I would make the argument that not wearing a seat belt or motorcycle helmet does diminish the freedoms of others.  If you are driving without your seat belt and I cause an accident that would not have caused you injury with a seat belt, but did cause sever injury because your head struck the windshield, I would be liable for your medical bills.  With the seat belt law in place, I could argue that the injuries were a result of your choice to break the seat belt law and therefore not my fault.  What say you?\nWith all due respect, I say that shows a failure to think things through.  If we’re talking about hypotheticals – which we are – then in a libertarian society you would not be liable for anyone else’s medical bills.  This is why neo-socialist medical systems like we have now in the United States are so pernicious.  One bit of government involvement always justifies the next.\nUsing this reasoning, you have a perfect right to insist that I have my body injected with chemicals I don’t want in my body because if I get the flu, you have to pay for my treatment.  And in any event, you are not responsible for another’s bad choices regardless of whether a behavior-controlling law is in place or not.  Everything ultimately boils down to one question.  Either the State is supreme (Plato) or the individual is supreme (Aristotle, Jesus Christ).  I’m down with the latter, and will brook no compromise.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-09T08:05:00+00:00"
}