{
  "url": "https://voxday.net/2004/01/27/mailvox-capitalism-and-christianity/",
  "scraped_at": "2025-12-13T15:45:29.809877",
  "title": "Mailvox: Capitalism and Christianity",
  "date_display": "January 27, 2004",
  "date_iso": "2004-01-27T10:33:00+00:00",
  "date_from_url": "2004-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vroom passes on a note: <em>“People who claim that Christ can free us from sin, including greed, shouldn’t advocate for themselves and for their spiritual brothers a system that, as y’all are so fond of saying, “actually requires human greed to function”. Believe in capitalism if you want, just quit calling yourself a Christian.”</em></p><p>This doesn’t require much in the way of reply.  Capitalism doesn’t require greed to function.  All it requires is that people place varying degrees of value  on material goods and the freedom to exchange them as they see fit.  The reason that socialism is always doomed to failure is that it posits the existence of absolute objective value as a basis for justifying its labor theory of value, which is required to justify a need to rectify distributive inquities as well as the existence of a party to provide such rectifications.</p><p>The notion that capitalism requires greed to function is not only trite, it demonstrates a high level of ignorance with regards to capitalism, human nature and history.  The fact that some individuals may have latched onto a shallow Hollywood sound bite in a superficial defense of capitalism is irrelevant.  Capitalism is not Wall Street, regardless of whether you are talking about the movie or the industry.  Modern financial state imperialism can hardly be called capitalism, as it egregiously violates the freedom of exchange concept in a myriad of ways.  Try buying a car with gold coins – or cash, for that matter –  if you doubt me.</p></div>",
  "content_text": "Vroom passes on a note:\n“People who claim that Christ can free us from sin, including greed, shouldn’t advocate for themselves and for their spiritual brothers a system that, as y’all are so fond of saying, “actually requires human greed to function”. Believe in capitalism if you want, just quit calling yourself a Christian.”\nThis doesn’t require much in the way of reply.  Capitalism doesn’t require greed to function.  All it requires is that people place varying degrees of value  on material goods and the freedom to exchange them as they see fit.  The reason that socialism is always doomed to failure is that it posits the existence of absolute objective value as a basis for justifying its labor theory of value, which is required to justify a need to rectify distributive inquities as well as the existence of a party to provide such rectifications.\nThe notion that capitalism requires greed to function is not only trite, it demonstrates a high level of ignorance with regards to capitalism, human nature and history.  The fact that some individuals may have latched onto a shallow Hollywood sound bite in a superficial defense of capitalism is irrelevant.  Capitalism is not Wall Street, regardless of whether you are talking about the movie or the industry.  Modern financial state imperialism can hardly be called capitalism, as it egregiously violates the freedom of exchange concept in a myriad of ways.  Try buying a car with gold coins – or cash, for that matter –  if you doubt me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-27T10:33:00+00:00"
}