{
  "url": "https://voxday.net/2004/01/23/mailbox-steampunk/",
  "scraped_at": "2025-12-13T15:45:03.375527",
  "title": "Mailbox: Steampunk",
  "date_display": "January 23, 2004",
  "date_iso": "2004-01-23T20:02:00+00:00",
  "date_from_url": "2004-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Witrack asks: <em>Any chance we’ll see you write/release any books in the steampunk genre?  I love that style of sci-fi.  The whole idea of advanced technology in the 19th and 18th century.  The whole Jules Verne, Wild Wild West, League of Extraordinary genre.  Very cool. It’s why I liked the Thief video game series.  The hybrid of swords and sorcery and 19th century technology.  The game even had 19th century motion detectors, etc.  I didn’t know what to call the genre until I heard the recently coined term steampunk.</em></p><p>Thief was good, but you’ll have to hit up the <a href=\"http://www.spedro.com\">Original Cyberpunk</a> if you’re into steam… heh heh heh.  I don’t read much of it, and as one who is neither skilled nor interested in things mechanical, I wouldn’t make much of a writer of it either.  I suppose this is as good a time as any to mention that yesterday I was asked to write the text for three comic books in a popular series that has sold about a million copies, which should be an interesting new format for me.  I also turned in a novel to my publisher a few months ago that I wrote with another fellow entitled <em>Stalking the Beast</em>; it’s about two centuries-old secret societies that are tracking the development of the Antichrist, one with an eye to “know the season” and the other with an eye to profiting from it.  Think of it as pre-apocalyptic Christian fiction.</p><p>Fortunately or unfortunately, I will not be writing <em>The Red Hand of Government</em> for WND Books as Joseph Farah previously announced, since one of the execs decided that the premise was ridiculous.  Everyone knows, apparently, that governments don’t kill their own people.  Right, whatever, Mr. History Expert.   As it was the third concept of mine that they rejected, I think I’ll stick with fiction and leave them to publish essays by radio personalities.  It’s a formula, and quite clearly it works for them, but since I’m not a talk show host it just doesn’t apply to me.  Also, being a novelist, I prefer to delve more deeply into a single subject instead of dancing from one to the next.</p><p>The one nonfiction book I thought would be particularly amusing to write was <em>Screwing Themselves: why no one wants to marry 30-something women</em>, based on the Spiting Their Pretty Faces column.  The proposal was pretty funny, especially the chapter devoted to line-by-line exegeses of feminist anthems such as You Oughtta Know and Bitch.  That didn’t go over particularly well with the Oprah fans on the pub board, believe it or not.  I suppose this is what basing your media career on the WWCDD principle gets you: What Would Chuck D Do?</p><p>I don’t mind.  I write for pleasure, not profit, and with two novels due this year and two next year, I’m already pushing my maximum output level.  Novels are more amusing and challenging than nonfiction anyhow.</p></div>",
  "content_text": "Witrack asks:\nAny chance we’ll see you write/release any books in the steampunk genre?  I love that style of sci-fi.  The whole idea of advanced technology in the 19th and 18th century.  The whole Jules Verne, Wild Wild West, League of Extraordinary genre.  Very cool. It’s why I liked the Thief video game series.  The hybrid of swords and sorcery and 19th century technology.  The game even had 19th century motion detectors, etc.  I didn’t know what to call the genre until I heard the recently coined term steampunk.\nThief was good, but you’ll have to hit up the\nOriginal Cyberpunk\nif you’re into steam… heh heh heh.  I don’t read much of it, and as one who is neither skilled nor interested in things mechanical, I wouldn’t make much of a writer of it either.  I suppose this is as good a time as any to mention that yesterday I was asked to write the text for three comic books in a popular series that has sold about a million copies, which should be an interesting new format for me.  I also turned in a novel to my publisher a few months ago that I wrote with another fellow entitled\nStalking the Beast\n; it’s about two centuries-old secret societies that are tracking the development of the Antichrist, one with an eye to “know the season” and the other with an eye to profiting from it.  Think of it as pre-apocalyptic Christian fiction.\nFortunately or unfortunately, I will not be writing\nThe Red Hand of Government\nfor WND Books as Joseph Farah previously announced, since one of the execs decided that the premise was ridiculous.  Everyone knows, apparently, that governments don’t kill their own people.  Right, whatever, Mr. History Expert.   As it was the third concept of mine that they rejected, I think I’ll stick with fiction and leave them to publish essays by radio personalities.  It’s a formula, and quite clearly it works for them, but since I’m not a talk show host it just doesn’t apply to me.  Also, being a novelist, I prefer to delve more deeply into a single subject instead of dancing from one to the next.\nThe one nonfiction book I thought would be particularly amusing to write was\nScrewing Themselves: why no one wants to marry 30-something women\n, based on the Spiting Their Pretty Faces column.  The proposal was pretty funny, especially the chapter devoted to line-by-line exegeses of feminist anthems such as You Oughtta Know and Bitch.  That didn’t go over particularly well with the Oprah fans on the pub board, believe it or not.  I suppose this is what basing your media career on the WWCDD principle gets you: What Would Chuck D Do?\nI don’t mind.  I write for pleasure, not profit, and with two novels due this year and two next year, I’m already pushing my maximum output level.  Novels are more amusing and challenging than nonfiction anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-23T20:02:00+00:00"
}