{
  "url": "https://voxday.net/2004/01/18/mailbox-god-without-hands/",
  "scraped_at": "2025-12-13T15:44:13.534313",
  "title": "Mailbox: A God without hands",
  "date_display": "January 18, 2004",
  "date_iso": "2004-01-18T12:47:00+00:00",
  "date_from_url": "2004-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JD writes: <em>Here’s the quote from you with which I take issue: “since God refrains from using his omnipotence to enforce virtue, the human polity should do likewise and refrain from using its power to the greatest extent possible.”   To the absolute contrary, God DOES enforce virtue.   God describes His approach as such: “visiting the iniquity of the fathers upon the children, and upon the children’s children, unto the third and to the fourth generation.” (EXO. 34: 7)  You may not immediately see it right in the instance that virtue is broken, but He most certainly DOES enforce virtue.  You can bet your eternal life on it!  If He doesn’t enforce virtue, then explain death.</em></p><p>I see no need to explain death.  What I do see is the need for JD to explain that if God is enforcing virtue in the sense that I used the term “enforce”, how is it possible for man to sin?  I never argued that nonvirtuous behavior has no consequences, nor did I argue that society must accept nonvirtuous behavior in others, I stated that society must stop most of its efforts to prevent by force.  JD does not, I think, seriously mean to suggest that God is doing his utmost to prevent nonvirtuous behavior by force, that since it exists he is therefore helpless to prevent nonvirtuous behavior, and yet that is what JD ends up implying here.  Society, on the other hand, is actually helpless in this regard; while it can certainly try to enforce virtue; history suggests that it will not only fail miserably, but will also sacrifice individual freedom and ultimately destroy itself in the process.<br> <br><em><br> <br>I suggest you rethink your stance on this suddenly popular notion of God as a “hands off” God.  If God is our example of how to live, and the Bible is His only given word for us to reference, then we must also be hands on in our approach.  I’m not saying we should be a theocracy.  God’s laws are Spiritual, and you can’t enforce a Spiritual law with a physical one.  But I am saying the Founding Fathers built their law as best as they could on what they read in the Bible, and so we should continue with that.</br></br></em></br></br></p><p>I do wish people would learn to read with precision and in context.  How is a failure to use every means at one’s disposal synonymous with doing nothing?  It isn’t.  By JD’s description, you’d think I was a deist, not a Southern Baptist, although he does hint at some understanding at where I’m coming from in stating that Spiritual and physical laws are not identical.  There is nothing “hands off” about placing the responsibility for enforcing virtue in the hands of the people instead of relying on their government to do it for them; quite the contrary.  It is truly amazing to me how many people seem to equate the government doing nothing with nothing happening.  The government isn’t providing the nation with any football games today, and yet I suspect more than a few people will be paying attention to a pair of sporting events taking place nevertheless in Philadelpha and Foxboro.</p><p>Furthermore, I submit that my notion of Christian Libertarianism is much closer to how the Founding Fathers built their law than how modern liberals and conservatives interpret Constitutional philosopy as they together continue to assemble the leviathanic monstrosity of state-enforced virtue.  JD’s heart is clearly in the right place, but I conclude that, like most conservatives, he has not fully comprehended the implications of his position and the assumptions from which it is necessarily derived.</p></div>",
  "content_text": "JD writes:\nHere’s the quote from you with which I take issue: “since God refrains from using his omnipotence to enforce virtue, the human polity should do likewise and refrain from using its power to the greatest extent possible.”   To the absolute contrary, God DOES enforce virtue.   God describes His approach as such: “visiting the iniquity of the fathers upon the children, and upon the children’s children, unto the third and to the fourth generation.” (EXO. 34: 7)  You may not immediately see it right in the instance that virtue is broken, but He most certainly DOES enforce virtue.  You can bet your eternal life on it!  If He doesn’t enforce virtue, then explain death.\nI see no need to explain death.  What I do see is the need for JD to explain that if God is enforcing virtue in the sense that I used the term “enforce”, how is it possible for man to sin?  I never argued that nonvirtuous behavior has no consequences, nor did I argue that society must accept nonvirtuous behavior in others, I stated that society must stop most of its efforts to prevent by force.  JD does not, I think, seriously mean to suggest that God is doing his utmost to prevent nonvirtuous behavior by force, that since it exists he is therefore helpless to prevent nonvirtuous behavior, and yet that is what JD ends up implying here.  Society, on the other hand, is actually helpless in this regard; while it can certainly try to enforce virtue; history suggests that it will not only fail miserably, but will also sacrifice individual freedom and ultimately destroy itself in the process.\nI suggest you rethink your stance on this suddenly popular notion of God as a “hands off” God.  If God is our example of how to live, and the Bible is His only given word for us to reference, then we must also be hands on in our approach.  I’m not saying we should be a theocracy.  God’s laws are Spiritual, and you can’t enforce a Spiritual law with a physical one.  But I am saying the Founding Fathers built their law as best as they could on what they read in the Bible, and so we should continue with that.\nI do wish people would learn to read with precision and in context.  How is a failure to use every means at one’s disposal synonymous with doing nothing?  It isn’t.  By JD’s description, you’d think I was a deist, not a Southern Baptist, although he does hint at some understanding at where I’m coming from in stating that Spiritual and physical laws are not identical.  There is nothing “hands off” about placing the responsibility for enforcing virtue in the hands of the people instead of relying on their government to do it for them; quite the contrary.  It is truly amazing to me how many people seem to equate the government doing nothing with nothing happening.  The government isn’t providing the nation with any football games today, and yet I suspect more than a few people will be paying attention to a pair of sporting events taking place nevertheless in Philadelpha and Foxboro.\nFurthermore, I submit that my notion of Christian Libertarianism is much closer to how the Founding Fathers built their law than how modern liberals and conservatives interpret Constitutional philosopy as they together continue to assemble the leviathanic monstrosity of state-enforced virtue.  JD’s heart is clearly in the right place, but I conclude that, like most conservatives, he has not fully comprehended the implications of his position and the assumptions from which it is necessarily derived.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-18T12:47:00+00:00"
}