{
  "url": "https://voxday.net/2004/01/29/mailvox-too-much-fun-in-oval-office/",
  "scraped_at": "2025-12-13T15:45:53.036572",
  "title": "Mailvox: Too much fun in the Oval Office",
  "date_display": "January 29, 2004",
  "date_iso": "2004-01-29T10:15:00+00:00",
  "date_from_url": "2004-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Witrack writes: <em>Bush is officially a bleeding heart liberal!  Did you read in the news how he wants to INCREASE funding for the National Endowment for the Arts?  What in the Sam hell?  Karl Rove is giving Dubya seriously dumbass advice with this!  Does Dubya want to alienate more of his conservative base?  Has Dubya forgotten the offensive art from years past funded by the NEA?  Does he realize how the right wing media pundits will hammer him for this? I guess he must have really knocked something loose when he hit his head on that table while munching that pretzel!  Dubya is officially as spacey as a Spice Girl.  What was your favorite Spice Girl, Vox?  I’m a Ginger man, m’self.</em></p><p>Color me cynical, but I can’t help imagining Karl Rove and George Delano kicking back in the Oval Office with their boots on the table, snickering and chuckling about the many conservatives who have been dumb/naive/desperate/corrupt enough to repeatedly conjure up cockamamie defenses of the administration’s overtly anti-conservative actions based on the crack-smoking concept of My Republican Party, Right Or Wrong.</p><p>KR: “Mars?  Can you believe Krauthammer jumped all over that one?  I thought he was gonna hump your leg!  ‘Mars!  I ate a Mars bar once, I thought of it first!'”</p><p>GD: “Ya’ll ain’t seen nuthin’ yet.  Ah say we should mess with their heads some more.  They gotta be down with me, I’m com – PASH- nit, G!  How’s about I marry that Sullivan guy to, I don’t know, maybe that baseball pitcher kid.  We can do it raht here!  That’d be the limit.  Cal Thomas’ head’d explode trying to come up with a deefense for that ‘un.”</p><p>KR: “Naw, the pitcher says he ain’t queer. (looks skeptical, but shrugs.)  Said so on ESPN, it must be true.  Hey, I got it!”</p><p>GD:  “What’s that?  How’s about I declare next Monday Jenna Jameson day?  I bet she’ll be honored to kick it off with an Executive lap dance!  You know Fox’d love to cover that one.  And O’Reilly’ll be first in line, with a fistful of twenties.”</p><p>KR: “No, no, check this out!  We’ll jack up the NEA’s funding.  I bet I can get at least four of the National Review gang, plus ten Townhallers, to get your back even if Danny Gioia hands over a couple hundred large to some moron takin’ a picture of a crucifix stickin’ out of his beehind.”</p><p>GD:  “Only ten?  Dang, I’ll take the over!  What, should we double it?”</p><p>… and so our little scene closes with the two men chortling gleefully as they contemplate George Delano’s inevitable re-election, which will, no doubt, mark the triumphant return to Constitution-friendly small government for which conservatives have been pining since 1980.</p><p>Ladies and gentleman of the conservative movement, I respectfully submit that George Delano Bush is no conservative, he has never been a conservative and he told you so from the very beginning.  Compassionate conservative = not a conservative.  Wake up and smell the politically-pragmatic, principle-free, Mars-bound, NEA-funded red ink!  I grew up reading a lot of these conservative and Republican columnists who continue to defend this administration, and as much as I admire them, I have to say that their cognitive dissonance is starting to approach levels of high parody not seen since op/edsters on the other side were defending the clown prince of politics from the devil in the blue dress.</p><p>As for favorite Spice Girls, I have been vocal in this very space about my prediliction for Posh.</p></div>",
  "content_text": "Witrack writes:\nBush is officially a bleeding heart liberal!  Did you read in the news how he wants to INCREASE funding for the National Endowment for the Arts?  What in the Sam hell?  Karl Rove is giving Dubya seriously dumbass advice with this!  Does Dubya want to alienate more of his conservative base?  Has Dubya forgotten the offensive art from years past funded by the NEA?  Does he realize how the right wing media pundits will hammer him for this? I guess he must have really knocked something loose when he hit his head on that table while munching that pretzel!  Dubya is officially as spacey as a Spice Girl.  What was your favorite Spice Girl, Vox?  I’m a Ginger man, m’self.\nColor me cynical, but I can’t help imagining Karl Rove and George Delano kicking back in the Oval Office with their boots on the table, snickering and chuckling about the many conservatives who have been dumb/naive/desperate/corrupt enough to repeatedly conjure up cockamamie defenses of the administration’s overtly anti-conservative actions based on the crack-smoking concept of My Republican Party, Right Or Wrong.\nKR: “Mars?  Can you believe Krauthammer jumped all over that one?  I thought he was gonna hump your leg!  ‘Mars!  I ate a Mars bar once, I thought of it first!'”\nGD: “Ya’ll ain’t seen nuthin’ yet.  Ah say we should mess with their heads some more.  They gotta be down with me, I’m com – PASH- nit, G!  How’s about I marry that Sullivan guy to, I don’t know, maybe that baseball pitcher kid.  We can do it raht here!  That’d be the limit.  Cal Thomas’ head’d explode trying to come up with a deefense for that ‘un.”\nKR: “Naw, the pitcher says he ain’t queer. (looks skeptical, but shrugs.)  Said so on ESPN, it must be true.  Hey, I got it!”\nGD:  “What’s that?  How’s about I declare next Monday Jenna Jameson day?  I bet she’ll be honored to kick it off with an Executive lap dance!  You know Fox’d love to cover that one.  And O’Reilly’ll be first in line, with a fistful of twenties.”\nKR: “No, no, check this out!  We’ll jack up the NEA’s funding.  I bet I can get at least four of the National Review gang, plus ten Townhallers, to get your back even if Danny Gioia hands over a couple hundred large to some moron takin’ a picture of a crucifix stickin’ out of his beehind.”\nGD:  “Only ten?  Dang, I’ll take the over!  What, should we double it?”\n… and so our little scene closes with the two men chortling gleefully as they contemplate George Delano’s inevitable re-election, which will, no doubt, mark the triumphant return to Constitution-friendly small government for which conservatives have been pining since 1980.\nLadies and gentleman of the conservative movement, I respectfully submit that George Delano Bush is no conservative, he has never been a conservative and he told you so from the very beginning.  Compassionate conservative = not a conservative.  Wake up and smell the politically-pragmatic, principle-free, Mars-bound, NEA-funded red ink!  I grew up reading a lot of these conservative and Republican columnists who continue to defend this administration, and as much as I admire them, I have to say that their cognitive dissonance is starting to approach levels of high parody not seen since op/edsters on the other side were defending the clown prince of politics from the devil in the blue dress.\nAs for favorite Spice Girls, I have been vocal in this very space about my prediliction for Posh.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-29T10:15:00+00:00"
}