{
  "url": "https://voxday.net/2004/01/08/mailbox-protected-against-yourself/",
  "scraped_at": "2025-12-13T15:42:19.547840",
  "title": "Mailbox: Protected against yourself",
  "date_display": "January 8, 2004",
  "date_iso": "2004-01-08T15:39:00+00:00",
  "date_from_url": "2004-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DW writes: <em>I read your blog with interest.  Much of it is well-reasoned (NFL allegiances aside, although I certainly can claim no better!).  And want to or not, one leaves the blog thinking.  Certainly I did not expect to bethinking about cannibalism this morning.  Regarding Brandes consent, what about codes that are in place to preventone from inflicting serious harm on oneself?</em></p><p>I do not know the laws pertaining to this in Germany, but that’s not the point of my question.  Are codes like this an example of state interference in individual choice and morality?  If not, could such a principle be applied to Brandes, and if so, would you prefer to see these laws eliminated?</p><p>Yes, they absolutely are.  Seat belt laws and helmet laws are good examples of this.  Such an example certainly applies, and I would absolutely prefer to see these laws eliminated.  If the State has the power to tell you to wear a helmet on a bicycle, they also have the power to tell a woman to wear the chador.</p></div>",
  "content_text": "DW writes:\nI read your blog with interest.  Much of it is well-reasoned (NFL allegiances aside, although I certainly can claim no better!).  And want to or not, one leaves the blog thinking.  Certainly I did not expect to bethinking about cannibalism this morning.  Regarding Brandes consent, what about codes that are in place to preventone from inflicting serious harm on oneself?\nI do not know the laws pertaining to this in Germany, but that’s not the point of my question.  Are codes like this an example of state interference in individual choice and morality?  If not, could such a principle be applied to Brandes, and if so, would you prefer to see these laws eliminated?\nYes, they absolutely are.  Seat belt laws and helmet laws are good examples of this.  Such an example certainly applies, and I would absolutely prefer to see these laws eliminated.  If the State has the power to tell you to wear a helmet on a bicycle, they also have the power to tell a woman to wear the chador.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-08T15:39:00+00:00"
}