{
  "url": "https://voxday.net/2004/01/08/mailbox-no-taste-for-freedo/",
  "scraped_at": "2025-12-13T15:42:15.870526",
  "title": "Mailbox: No taste for freedom",
  "date_display": "January 8, 2004",
  "date_iso": "2004-01-08T08:58:00+00:00",
  "date_from_url": "2004-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JM writes: <em>Your answer to the question freaked me out.  What about the people in the society?  Don’t they have the right to be protected from such an act happening in their midst?  If there were the possibility of a man murdering and eating another man next door to me, and it was a common practice (who knows where we will be in 30 years?), I would not be able to live in peace. I would never even consider bringing children into the world.  Such acts cannot simply happen “behind doors”, their very presence in a society effects every member of the society.  The act is so reviling to basic human nature that everyone is effected.</em></p><p>For some reason the consent makes it far more bone-chilling than your run of the mill “jungle cannibalism”.  It is as if you get a glimpse of hell.  And by your logic you could have this sort of stuff on pay-per-view.  I would rather be persecuted under a tyrant than to live in such a society.  Personal freedom in this life is only so valuable, it is not to be idolized, which is exactly what you border on doing.</p><p>I think this is absolutely a glimpse of Hell.  This is what happens when people turn from God.  And legal or no, the possibility already exists.  But instead of expecting the government to stop it, I would say that the correct response is social ostracism and a refusal to do business or have dealings with such a person.  Sans a government that violates the right to freedom of association, you would be very unlikely to have such a person living next door for long; he would not be able to do so in a town where no one would have anything to do with him.  Ostracism is a very powerful force, unfortunately Americans have lost the ability to use it.</p><p>Otherwise, you have a society where the government has the power to prevent people from worshipping God next door.  You can’t have things both ways.  I don’t idolize personal freedom.  God, who has far more power than any government, decided to give it to us as a gift.  Who are you to attempt to take away what He has chosen to give?  Private property and a philosophy of my rights ending where yours begin is the only reasonable foundation for secular law.  I would say, however, that it is foolish to think that it would be better to live under a tyrant – there have been tyrants in the past thirty years who have practiced such abominations themselves.  You would prefer to allow them the power to force you to do the same?</p><p>Neither governments nor people can be controlled for long.  Not for good, not for evil.  This is the great lesson of history.</p><p><strong>JM responds: </strong> <em>This is a very good argument.  I gladly submit to it.  I never considered the effect two seemingly disconnected freedoms can have on one another.  My nightmare scenario was actually a form of tyranny because we would be forced to “get along” with persons who engage in such behavior in the name of respecting their liberty.  It is not really a respect of liberty, [though], it is a respect of sin.</em></p><p>Indeed.</p></div>",
  "content_text": "JM writes:\nYour answer to the question freaked me out.  What about the people in the society?  Don’t they have the right to be protected from such an act happening in their midst?  If there were the possibility of a man murdering and eating another man next door to me, and it was a common practice (who knows where we will be in 30 years?), I would not be able to live in peace. I would never even consider bringing children into the world.  Such acts cannot simply happen “behind doors”, their very presence in a society effects every member of the society.  The act is so reviling to basic human nature that everyone is effected.\nFor some reason the consent makes it far more bone-chilling than your run of the mill “jungle cannibalism”.  It is as if you get a glimpse of hell.  And by your logic you could have this sort of stuff on pay-per-view.  I would rather be persecuted under a tyrant than to live in such a society.  Personal freedom in this life is only so valuable, it is not to be idolized, which is exactly what you border on doing.\nI think this is absolutely a glimpse of Hell.  This is what happens when people turn from God.  And legal or no, the possibility already exists.  But instead of expecting the government to stop it, I would say that the correct response is social ostracism and a refusal to do business or have dealings with such a person.  Sans a government that violates the right to freedom of association, you would be very unlikely to have such a person living next door for long; he would not be able to do so in a town where no one would have anything to do with him.  Ostracism is a very powerful force, unfortunately Americans have lost the ability to use it.\nOtherwise, you have a society where the government has the power to prevent people from worshipping God next door.  You can’t have things both ways.  I don’t idolize personal freedom.  God, who has far more power than any government, decided to give it to us as a gift.  Who are you to attempt to take away what He has chosen to give?  Private property and a philosophy of my rights ending where yours begin is the only reasonable foundation for secular law.  I would say, however, that it is foolish to think that it would be better to live under a tyrant – there have been tyrants in the past thirty years who have practiced such abominations themselves.  You would prefer to allow them the power to force you to do the same?\nNeither governments nor people can be controlled for long.  Not for good, not for evil.  This is the great lesson of history.\nJM responds:\nThis is a very good argument.  I gladly submit to it.  I never considered the effect two seemingly disconnected freedoms can have on one another.  My nightmare scenario was actually a form of tyranny because we would be forced to “get along” with persons who engage in such behavior in the name of respecting their liberty.  It is not really a respect of liberty, [though], it is a respect of sin.\nIndeed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-08T08:58:00+00:00"
}