{
  "url": "https://voxday.net/2004/01/14/mailbox-why-christian-libertarian/",
  "scraped_at": "2025-12-13T15:43:26.019206",
  "title": "Mailbox:  Why Christian libertarian?",
  "date_display": "January 14, 2004",
  "date_iso": "2004-01-14T19:51:00+00:00",
  "date_from_url": "2004-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.evangelicaloutpost.com/archives/000157.html\">The Evangelical Outpost</a> writes: <em>When it comes to Christian libertarianism, though, I’m a bit baffled. Its not that I dont think that Christians can be libertarian. In fact, I think that by applying Christian ethics to the political philosophy it would solve many of the criticisms I have with the libertarian position. Im just a bit vague on how Christian thought is applied to libertarianism in order to transform it into a unique political stance. (Im assuming, of course, that the term Christian isnt simply being used as a generic modifier.)Id be interested in hearing the thoughts of those who apply this label to their own beliefs. In particular, Im curious to know how it differs from conservatism and/or liberalism.</em></p><p>The important thing to understand first is that although the term “Christian libertarian” is a political term, the philosophy has strong roots in conventional Christian theology.  Christian libertarianism is derived from the postulate that God places a strong inherent value on free will.  Since God, who has infinite power, elects not to use such power to control individual behavior, humans and human law should do likewise in imitation of the Divine, drawing a firm line at where one individual’s behavior exerts a direct and inarguable effect on another individual.</p><p>It is thus contrary to the Calvinist theology, but is also distinct from the conservative tradition in that it rejects the notion that moral behavior can be instilled in a society through legal force.  Christian libertarians recognize that not even the most totalitarian state has been successful in imposing moral behavior on its citizens, and therefore insist that the forces of social ostracism and free association must be utilized for such purposes instead.  We also reject the notion that legality is synonymous with morality, and insist that the State play no role whatsoever in matters of religion, marriage or financial well-being.  Conservatives recognize that state-imposed distribution is not charity, they do not, however, recognize that state-imposed moral behavior is not morality, it is nothing more than fear.  Which, we are told, does not come from God.</p><p>Christian libertarianism is different from conventional Libertarianism in that it is not purely utilitarian, but shares some of the same roots in Natural Law as conservativism.  For example, it does not equivocate on abortion, but steadfastly opposes it as an infringement upon the right to life of the unborn child.   In short, it recognizes the importance of moral law, but sees this on the order of a natural law such as the law of gravity, not a basis for societal law enforced by the state.</p><p>To be sure, there are verses which suggest that the earthly authorities have been given their authority by God.  However, it is worth noting that the apostles, who surely understood the Gospel better than we do, were constantly in trouble with the law, and indeed, most of them were executed by the legal authorities, as was Jesus Christ himself.  This would seem to support the notion that earthly law and moral law are not one and the same.</p><p>Needless to say, Christian libertarianism has very little sympathy for left-liberalism, which elevates the State to earthly godhood.</p></div>",
  "content_text": "The Evangelical Outpost\nwrites:\nWhen it comes to Christian libertarianism, though, I’m a bit baffled. Its not that I dont think that Christians can be libertarian. In fact, I think that by applying Christian ethics to the political philosophy it would solve many of the criticisms I have with the libertarian position. Im just a bit vague on how Christian thought is applied to libertarianism in order to transform it into a unique political stance. (Im assuming, of course, that the term Christian isnt simply being used as a generic modifier.)Id be interested in hearing the thoughts of those who apply this label to their own beliefs. In particular, Im curious to know how it differs from conservatism and/or liberalism.\nThe important thing to understand first is that although the term “Christian libertarian” is a political term, the philosophy has strong roots in conventional Christian theology.  Christian libertarianism is derived from the postulate that God places a strong inherent value on free will.  Since God, who has infinite power, elects not to use such power to control individual behavior, humans and human law should do likewise in imitation of the Divine, drawing a firm line at where one individual’s behavior exerts a direct and inarguable effect on another individual.\nIt is thus contrary to the Calvinist theology, but is also distinct from the conservative tradition in that it rejects the notion that moral behavior can be instilled in a society through legal force.  Christian libertarians recognize that not even the most totalitarian state has been successful in imposing moral behavior on its citizens, and therefore insist that the forces of social ostracism and free association must be utilized for such purposes instead.  We also reject the notion that legality is synonymous with morality, and insist that the State play no role whatsoever in matters of religion, marriage or financial well-being.  Conservatives recognize that state-imposed distribution is not charity, they do not, however, recognize that state-imposed moral behavior is not morality, it is nothing more than fear.  Which, we are told, does not come from God.\nChristian libertarianism is different from conventional Libertarianism in that it is not purely utilitarian, but shares some of the same roots in Natural Law as conservativism.  For example, it does not equivocate on abortion, but steadfastly opposes it as an infringement upon the right to life of the unborn child.   In short, it recognizes the importance of moral law, but sees this on the order of a natural law such as the law of gravity, not a basis for societal law enforced by the state.\nTo be sure, there are verses which suggest that the earthly authorities have been given their authority by God.  However, it is worth noting that the apostles, who surely understood the Gospel better than we do, were constantly in trouble with the law, and indeed, most of them were executed by the legal authorities, as was Jesus Christ himself.  This would seem to support the notion that earthly law and moral law are not one and the same.\nNeedless to say, Christian libertarianism has very little sympathy for left-liberalism, which elevates the State to earthly godhood.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-14T19:51:00+00:00"
}