{
  "url": "https://voxday.net/2004/01/23/mailbox-intelligence-irony-and-bias/",
  "scraped_at": "2025-12-13T15:44:56.739809",
  "title": "Mailbox: Intelligence, irony and bias",
  "date_display": "January 23, 2004",
  "date_iso": "2004-01-23T09:51:00+00:00",
  "date_from_url": "2004-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MM writes: <em>I was skimming a group of links yesterday on one of my favorite news sites yesterday, and I happened across your article, in which you, basically, say that a high IQ leads to a clouded, disillusioned mindset. I thought that it was very interesting, considering the content of your article, that your blurb at the end of the piece mentions your membership to Mensa, an organization for those with IQs in the top 2% of the population. I would think that this invalidates your argument comepletely. I mean, considering that you juxtapose a high IQ with a distorted worldview, and you must have a rather high IQ to be a member of Mensa, doesn’t that imply that you have a twisted perspective as well? Forgive me if I’m misinterpreting something, but it seems like you’re being a bit hypocritical.</em></p><p>Far from being hypocritical, I am speaking from both direct personal experience as well as firsthand observation.  First, Mensa is a floor, not a ceiling, and many Mensans do not fit the very high IQ profile I was describing.  It would be absurd, however, to suggest that a strong tendency to think in the abstract is always tantamount to disillusionment, twisted perspective or a distorted worldview.  It is a tendency, and as such can be successfully controlled, although Wesley Clark’s actions suggest that he has made no effort to do so.  Or do you seriously wish to argue that the highly intelligent don’t think differently than those of average or subnormal intelligence?<br> <br><em><br> <br>Then there’s the fact that Mensa itself states that one of its goals is to create a society that is non-political, while your very article is written for WorldNetDaily, one of the most notorious extreme-right news sites around. Just so you know that I have a bit of a bias, I’m pretty liberal, but I’m not judging your article on the fact that you go off on the Democratic candadites, I’m rather dissatisfied with them this year too. I just thought you’d want to be aware of the irony of the fact that you not only disparage those with high IQs whilst belonging to Mensa, but also write for one of the most politically bent news organizations ever.</br></br></em></br></br></p><p>Mensa wishes the organization to be non-political, not to eradicate politics from society.  And WND is far from being, as you say, “one of the most politically bent news organizations ever”.  Our weekly commentators hail from a far broader range of the political spectrum than any major news organization, featuring left-liberal Democrats such as Bill Press, Ellen Ratner and Marilyn Polak to conventional Republicans like Pat Buchanan, David Limbaugh and Michelle Malkin, independents such as Joseph Farah and Libertarians such as Harry Browne, Ilana Mercer, and myself.  WND also features a daily piece selected from the middle to extreme Left, which is far more than any left-liberal rag dares to do.  (Okay, one of my pieces did appear in Pravda once, but I don’t think it’s left-wing anymore.)  In any case, your statement is not only hopelessly incorrect, it borders on silly.  Do you honestly believe the New York Times features a more balanced view than WND, devoid as it is of everything to the right of John Maynard Keynes with the exception of two moderate Republican editorialists?</p><p>I was not disparaging high intelligence, I was only warning of some of its inherent dangers.  There has to be some reason that the intersection of intellectuals and government power tends to have a high body count, after all.  I am suggesting a partial explanation.</p></div>",
  "content_text": "MM writes:\nI was skimming a group of links yesterday on one of my favorite news sites yesterday, and I happened across your article, in which you, basically, say that a high IQ leads to a clouded, disillusioned mindset. I thought that it was very interesting, considering the content of your article, that your blurb at the end of the piece mentions your membership to Mensa, an organization for those with IQs in the top 2% of the population. I would think that this invalidates your argument comepletely. I mean, considering that you juxtapose a high IQ with a distorted worldview, and you must have a rather high IQ to be a member of Mensa, doesn’t that imply that you have a twisted perspective as well? Forgive me if I’m misinterpreting something, but it seems like you’re being a bit hypocritical.\nFar from being hypocritical, I am speaking from both direct personal experience as well as firsthand observation.  First, Mensa is a floor, not a ceiling, and many Mensans do not fit the very high IQ profile I was describing.  It would be absurd, however, to suggest that a strong tendency to think in the abstract is always tantamount to disillusionment, twisted perspective or a distorted worldview.  It is a tendency, and as such can be successfully controlled, although Wesley Clark’s actions suggest that he has made no effort to do so.  Or do you seriously wish to argue that the highly intelligent don’t think differently than those of average or subnormal intelligence?\nThen there’s the fact that Mensa itself states that one of its goals is to create a society that is non-political, while your very article is written for WorldNetDaily, one of the most notorious extreme-right news sites around. Just so you know that I have a bit of a bias, I’m pretty liberal, but I’m not judging your article on the fact that you go off on the Democratic candadites, I’m rather dissatisfied with them this year too. I just thought you’d want to be aware of the irony of the fact that you not only disparage those with high IQs whilst belonging to Mensa, but also write for one of the most politically bent news organizations ever.\nMensa wishes the organization to be non-political, not to eradicate politics from society.  And WND is far from being, as you say, “one of the most politically bent news organizations ever”.  Our weekly commentators hail from a far broader range of the political spectrum than any major news organization, featuring left-liberal Democrats such as Bill Press, Ellen Ratner and Marilyn Polak to conventional Republicans like Pat Buchanan, David Limbaugh and Michelle Malkin, independents such as Joseph Farah and Libertarians such as Harry Browne, Ilana Mercer, and myself.  WND also features a daily piece selected from the middle to extreme Left, which is far more than any left-liberal rag dares to do.  (Okay, one of my pieces did appear in Pravda once, but I don’t think it’s left-wing anymore.)  In any case, your statement is not only hopelessly incorrect, it borders on silly.  Do you honestly believe the New York Times features a more balanced view than WND, devoid as it is of everything to the right of John Maynard Keynes with the exception of two moderate Republican editorialists?\nI was not disparaging high intelligence, I was only warning of some of its inherent dangers.  There has to be some reason that the intersection of intellectuals and government power tends to have a high body count, after all.  I am suggesting a partial explanation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-23T09:51:00+00:00"
}