{
  "url": "https://voxday.net/2004/01/28/mailvox-assessing-odds/",
  "scraped_at": "2025-12-13T15:45:45.633916",
  "title": "Mailvox: Assessing the odds",
  "date_display": "January 28, 2004",
  "date_iso": "2004-01-28T15:37:00+00:00",
  "date_from_url": "2004-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LW writes: <em>What is your honest assessment of the prospect of a Libertarian becoming president, senator, or congressman in the next nine years?  Be honest.  If the prospect of obtaining even a one third minority in congress is nil, then isn’t the party really only about pulling the political environment to the right (the real right, lean government, reduced or abandoned regulation, reducing and removing forms of taxation, eliminating welfare in all forms, free trade, and true individual rights) than about anything else.  If so, then the Republican is the only individual to elect unless the Republican is going to lose the race anyway.  Then vote every time for the Libertarian to get the point across to Republicans.  I hope, one day, that the Libertarian Party will be the center of the Republican party.</em></p><p>First, a Libertarian is already in Congress.  Representative Ron Paul is a Republican, but he is also a Libertarian, being its former candidate for president.  His popularity is such that I have no doubt he could win his seat as a Libertarian – the Texas Republican party, to its shame, has tried to unseat him in the primary before – and I hope that one day he will do so, or at least make the switch in office.  Second, the only way that the Libertarian Party will become the center of the Republican Party is for enough people to put principle over pragmatism.  Only when they fear losing the Right entirely will the unprincipled Republican strategists cease their wooing of the Left.</p><p>If you vote for a leftward-moving Republican party, you are an enabler, and as such, you are part of the problem.  You cannot be part of the solution until you are willing to cease the enabling.  I have no problem with voting for principled Republicans; the problem is that there are very few of them left.  But no one gets my vote simply because his name is preceded by an (R).  Conservatives, YOU voted for a man that is rapidly expanding central government.  YOU put George Delano into power.  The responsibility for all of this is YOURS.  Do you honestly believe that continuing to support him as he panders to the Left is going to change any of that?</p><p>It is always hard to envision anything but the status quo.  But if history teaches us anything, it is that the status quo never remains so for long.  Will we still be discussing Republicans vs. Democrats in 5,000 years?  500?  50?  No one can say.  All we know with certainty is that one day it will change, probably for reasons that will surprise everyone.  I do not need to wait for it to happen in order to stand by my principles, nor, I argue, do you.</p></div>",
  "content_text": "LW writes:\nWhat is your honest assessment of the prospect of a Libertarian becoming president, senator, or congressman in the next nine years?  Be honest.  If the prospect of obtaining even a one third minority in congress is nil, then isn’t the party really only about pulling the political environment to the right (the real right, lean government, reduced or abandoned regulation, reducing and removing forms of taxation, eliminating welfare in all forms, free trade, and true individual rights) than about anything else.  If so, then the Republican is the only individual to elect unless the Republican is going to lose the race anyway.  Then vote every time for the Libertarian to get the point across to Republicans.  I hope, one day, that the Libertarian Party will be the center of the Republican party.\nFirst, a Libertarian is already in Congress.  Representative Ron Paul is a Republican, but he is also a Libertarian, being its former candidate for president.  His popularity is such that I have no doubt he could win his seat as a Libertarian – the Texas Republican party, to its shame, has tried to unseat him in the primary before – and I hope that one day he will do so, or at least make the switch in office.  Second, the only way that the Libertarian Party will become the center of the Republican Party is for enough people to put principle over pragmatism.  Only when they fear losing the Right entirely will the unprincipled Republican strategists cease their wooing of the Left.\nIf you vote for a leftward-moving Republican party, you are an enabler, and as such, you are part of the problem.  You cannot be part of the solution until you are willing to cease the enabling.  I have no problem with voting for principled Republicans; the problem is that there are very few of them left.  But no one gets my vote simply because his name is preceded by an (R).  Conservatives, YOU voted for a man that is rapidly expanding central government.  YOU put George Delano into power.  The responsibility for all of this is YOURS.  Do you honestly believe that continuing to support him as he panders to the Left is going to change any of that?\nIt is always hard to envision anything but the status quo.  But if history teaches us anything, it is that the status quo never remains so for long.  Will we still be discussing Republicans vs. Democrats in 5,000 years?  500?  50?  No one can say.  All we know with certainty is that one day it will change, probably for reasons that will surprise everyone.  I do not need to wait for it to happen in order to stand by my principles, nor, I argue, do you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-28T15:37:00+00:00"
}