{
  "url": "https://voxday.net/2004/01/20/mailbox-wesley-died-for-you/",
  "scraped_at": "2025-12-13T15:44:30.116668",
  "title": "Mailbox: Wesley died for you",
  "date_display": "January 20, 2004",
  "date_iso": "2004-01-20T08:39:00+00:00",
  "date_from_url": "2004-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Westcott whines: <em>Just thought your comments about Wesley Clark were ill advised. He does not have an abstract view of the world, he has had to keep the world together in order to prevent almost a million muslims from being slaughtered by Serbia. BTW My IQ is 141 and you are an idiot. Why? because I said so.</em></p><p>A.  Wesley Clark doesn’t keep the world together, even if he believes so.<br> <br>B.  Wesley Clark certainly has an abstract view of the world, which is why he is a UN-worshipper.  This is true of all UN-worshippers, except those starry-eyed few who would seriously argue that the UN has significant practical relevance today as opposed to theoretical potential in a globalist vision for the future.<br> <br>C.  Wesley Clark and his ill-advised bombing campaign did little damage to the Serbian army and significantly worsened the ethnic cleansing that took place there.<br> <br>D.  You’ll have to do better than 141, wannabee.</br></br></br></br></br></br></p></div>",
  "content_text": "Westcott whines:\nJust thought your comments about Wesley Clark were ill advised. He does not have an abstract view of the world, he has had to keep the world together in order to prevent almost a million muslims from being slaughtered by Serbia. BTW My IQ is 141 and you are an idiot. Why? because I said so.\nA.  Wesley Clark doesn’t keep the world together, even if he believes so.\nB.  Wesley Clark certainly has an abstract view of the world, which is why he is a UN-worshipper.  This is true of all UN-worshippers, except those starry-eyed few who would seriously argue that the UN has significant practical relevance today as opposed to theoretical potential in a globalist vision for the future.\nC.  Wesley Clark and his ill-advised bombing campaign did little damage to the Serbian army and significantly worsened the ethnic cleansing that took place there.\nD.  You’ll have to do better than 141, wannabee.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-20T08:39:00+00:00"
}