{
  "url": "https://voxday.net/2004/01/26/mailvox-anti-life-libertarians/",
  "scraped_at": "2025-12-13T15:45:25.029110",
  "title": "Mailvox: anti-life Libertarians",
  "date_display": "January 26, 2004",
  "date_iso": "2004-01-26T15:11:00+00:00",
  "date_from_url": "2004-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB writes: <em>I’ll promise you that the CP and LP (as it is now) will never merge!  We can work together on some things, but LP platform is pro-abortion among other things that would prohibit this.</em></p><p>The Libertarian party is not actually pro-abortion, although this is a common misconception.  It is officially agnostic on the issue, which for all intents and purposes, is the functional equivalent of the Republican party.   Saying that government should be kept out of the question is not tantamount to saying that abortion is a right, and leaving the matter up to the states is far preferable to allowing the Federal government to be involved.  The Libertarian Party’s only specific platform position on the matter is that no government funding of any abortions should be permitted, which is actual superior to the de facto Republican position that allows for the funding of abortions in this country and abroad.  I do not believe that the Republican Party is any more serious about ending abortion than they are about reducing the size of government, so abortion is no reason to stay away from the Libertarians if your principles otherwise lead you to support them.</p><p>Not to mention the fact that the Pro-Life movement is much larger than the current Libertarian Party, which is already 40 percent pro-life.</p><p>I am a pro-life extremist myself, but this is the actual Libertarian Party position: <em>Recognizing that abortion is a very sensitive issue and that people, including libertarians, can hold good-faith views on both sides, we believe the government should be kept out of the question.  We condemn state-funded and state-mandated abortions. It is particularly harsh to force someone who believes that abortion is murder to pay for another’s abortion.  It is the right and obligation of the pregnant woman, not the state, to decide the desirability or appropriateness of prenatal testing, Caesarean births, fetal surgery, voluntary surrogacy arrangements, and/or home births. </em></p></div>",
  "content_text": "JB writes:\nI’ll promise you that the CP and LP (as it is now) will never merge!  We can work together on some things, but LP platform is pro-abortion among other things that would prohibit this.\nThe Libertarian party is not actually pro-abortion, although this is a common misconception.  It is officially agnostic on the issue, which for all intents and purposes, is the functional equivalent of the Republican party.   Saying that government should be kept out of the question is not tantamount to saying that abortion is a right, and leaving the matter up to the states is far preferable to allowing the Federal government to be involved.  The Libertarian Party’s only specific platform position on the matter is that no government funding of any abortions should be permitted, which is actual superior to the de facto Republican position that allows for the funding of abortions in this country and abroad.  I do not believe that the Republican Party is any more serious about ending abortion than they are about reducing the size of government, so abortion is no reason to stay away from the Libertarians if your principles otherwise lead you to support them.\nNot to mention the fact that the Pro-Life movement is much larger than the current Libertarian Party, which is already 40 percent pro-life.\nI am a pro-life extremist myself, but this is the actual Libertarian Party position:\nRecognizing that abortion is a very sensitive issue and that people, including libertarians, can hold good-faith views on both sides, we believe the government should be kept out of the question.  We condemn state-funded and state-mandated abortions. It is particularly harsh to force someone who believes that abortion is murder to pay for another’s abortion.  It is the right and obligation of the pregnant woman, not the state, to decide the desirability or appropriateness of prenatal testing, Caesarean births, fetal surgery, voluntary surrogacy arrangements, and/or home births.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-26T15:11:00+00:00"
}