{
  "url": "https://voxday.net/2004/01/17/masculinity-and-attraction/",
  "scraped_at": "2025-12-13T15:44:00.600778",
  "title": "Masculinity and attraction",
  "date_display": "January 17, 2004",
  "date_iso": "2004-01-17T08:23:00+00:00",
  "date_from_url": "2004-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amber Pawlik writes: <em>A man’s sexual attraction to a woman is largely physical in nature; a woman’s sexual attraction to a man is largely spiritual. A man is sexually aroused predominantly by the female figure. A man’s sexual attraction to a woman is seeing a woman with a great body, with healthy hair, a pretty face. For a woman, her sexual attraction is fundamentally different. A woman is not predominantly attracted to particular physical attributes of a man, but rather is attracted to masculinity, i.e. his ability to behave as a hero. As such, when a man or a woman rejects heterosexuality, for the man, it will be physical in nature and for the woman, it will be spiritual in nature.</em></p><p>A homosexual man will be someone repulsed by the female figure. Instead, he admires the male figure. Indeed, he likes it so much that he demands his partner be very good-looking. This is why gay men are often highly attractive. For a homosexual woman, however, it is not that she is attracted or repulsed by the male figure — she is repulsed by masculinity. Indeed, no woman is particularly attracted to the male physique — a woman’s attraction to a man is the ability to admire him.</p><p>I think that women’s attaction to masculinity is more primal than Amber suggests.  It’s not just the ability to behave as a hero, it’s raw power, be it revealed in character, wealth, physical strength, intelligence or fame.  She’s on to something here, though, as one thing I learned from my time in the software industry is that if you’re a straight man and you’re picky about who you date, move to the Bay Area.  The women there are so starved for masculinity – even the straight men are over-metrosexualized – that a Midwesterner can silence an entire Adobe department filled with women simply by walking in the room.  Big Chilly married a pretty cheerleader from Monterrey and except for his exceptional intelligence, he’s a normal Minnesota Swedegian.  So we all burst out laughing when one of the Chilliette’s Bay Area bridemaids met him, and said: “he’s nice, but isn’t he a little, I don’t know, macho?”</p><p>Right, everyone knows that Swedish-Norwegian Lutherans are reknowned for their touchy Latin machismo.  I think it was his walking through the room, nodding to the women, then slapping Chilliette on the butt as he walked by and saying nothing more than “what’s up, babe” that struck the Bay Area girl as utterly alien behavior.  But that’s a lack of diffidence, not puffed-up insecurity.</p><p>It’s always strange, too, to see how many lesbians literally cringe in fear from nothing more than the presence of a masculine man.  You feel as if simply saying “boo” will cause them to die of heart failure on the spot.  No loud noises… no sudden movements….  Amber’s point about the male physique thing is interesting too.  There’s nothing more depressing for a weightlifter than to have a woman tell him that he’s too big, and that he’d look better if he’d  just chill out on the muscle thing.</p></div>",
  "content_text": "Amber Pawlik writes:\nA man’s sexual attraction to a woman is largely physical in nature; a woman’s sexual attraction to a man is largely spiritual. A man is sexually aroused predominantly by the female figure. A man’s sexual attraction to a woman is seeing a woman with a great body, with healthy hair, a pretty face. For a woman, her sexual attraction is fundamentally different. A woman is not predominantly attracted to particular physical attributes of a man, but rather is attracted to masculinity, i.e. his ability to behave as a hero. As such, when a man or a woman rejects heterosexuality, for the man, it will be physical in nature and for the woman, it will be spiritual in nature.\nA homosexual man will be someone repulsed by the female figure. Instead, he admires the male figure. Indeed, he likes it so much that he demands his partner be very good-looking. This is why gay men are often highly attractive. For a homosexual woman, however, it is not that she is attracted or repulsed by the male figure — she is repulsed by masculinity. Indeed, no woman is particularly attracted to the male physique — a woman’s attraction to a man is the ability to admire him.\nI think that women’s attaction to masculinity is more primal than Amber suggests.  It’s not just the ability to behave as a hero, it’s raw power, be it revealed in character, wealth, physical strength, intelligence or fame.  She’s on to something here, though, as one thing I learned from my time in the software industry is that if you’re a straight man and you’re picky about who you date, move to the Bay Area.  The women there are so starved for masculinity – even the straight men are over-metrosexualized – that a Midwesterner can silence an entire Adobe department filled with women simply by walking in the room.  Big Chilly married a pretty cheerleader from Monterrey and except for his exceptional intelligence, he’s a normal Minnesota Swedegian.  So we all burst out laughing when one of the Chilliette’s Bay Area bridemaids met him, and said: “he’s nice, but isn’t he a little, I don’t know, macho?”\nRight, everyone knows that Swedish-Norwegian Lutherans are reknowned for their touchy Latin machismo.  I think it was his walking through the room, nodding to the women, then slapping Chilliette on the butt as he walked by and saying nothing more than “what’s up, babe” that struck the Bay Area girl as utterly alien behavior.  But that’s a lack of diffidence, not puffed-up insecurity.\nIt’s always strange, too, to see how many lesbians literally cringe in fear from nothing more than the presence of a masculine man.  You feel as if simply saying “boo” will cause them to die of heart failure on the spot.  No loud noises… no sudden movements….  Amber’s point about the male physique thing is interesting too.  There’s nothing more depressing for a weightlifter than to have a woman tell him that he’s too big, and that he’d look better if he’d  just chill out on the muscle thing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-17T08:23:00+00:00"
}