{
  "url": "https://voxday.net/2004/01/30/mogambo-on-job-re-training/",
  "scraped_at": "2025-12-13T15:46:10.312914",
  "title": "Mogambo on job re-training",
  "date_display": "January 30, 2004",
  "date_iso": "2004-01-30T21:59:00+00:00",
  "date_from_url": "2004-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The inimitable Mogambo Guru writes: <em>So that brings me back to the original question, which is; what is this magical education and re-training that is supposed to alleviate our plight? Nobody ever says. Even Alan Greenspan is sure that jobs will be created in the future, but he can’t think of what they could be.  Well, most of you came here today to hear what I have to say about the Bush plan to allow you to get a tax credit for health insurance. My initial response: Wow! It is the kind of irresponsible two-fisted giveaway that I laughingly suggested, in a previous MoGu, that they do. I never actually thought they would do it!</em></p><p>Under the old plan, which is the current plan, you get to deduct your health insurance premiums from income. As an aside, it looks like the premiums are 100% deductible this year, which means you don’t pay tax on the money you spent. You still pay the damn premiums, of course, it is just that you don’t pay income tax on it, too. Example; if you pay six grand year for health insurance, you do not pay tax on the money. Total out-of-pocket: $6,000. Last year, for you historians out there, you got to deduct only half the premiums from income, and you paid income tax on the rest. Total out-of-pocket last year; the $6,000 in premiums, and, at a 25% tax rate, another $750 in income taxes on the other $3,000, for a total of $6,750.</p><p>The new plan, the Bush plan, the tax credit plan, is better yet. The new example works like this: if you pay six grand a year for health insurance, you get back the money (currently estimated to be a maximum of $3,000) by claiming a tax credit! This tax credit section is at the end of the 1040 Income Tax Return, not the beginning! This is a big difference! So, the credit comes AFTER you have figured out how much tax you owe, and you deduct your premiums from that figure! Wow!</p><p>So, the example is now; total premiums are $6,000 per year. Total-out-of-pocket: $3,000, thanks to a $3,000 tax credit. Of course, this assumes that you have $3,000 of taxes due. If you don’t, then you are a piece of trash, and you don’t get the full deduction, and why should I care about you, you pathetic loser?  And as the benefit gradually escalates through the coming years, because dispensing higher and higher government benefits is what the government sees at its duty nowadays, (“Working for America by bankrupting us all through the wonders of communism and re-distribution of income!”) it will surely go to a 100% credit, which is, at the bottom line, free health insurance! You pay the premiums, and when you file your taxes, you get it all back!</p><p>So perhaps this answers my original question: What are these jobs that we are supposed to re-train to do? Health care workers and income tax form filler-outers.</p><p>Alternatively, there’s always the option of moving to India.  There are some ominous signs out there.  I spoke with a former employee of mine two days ago, someone who used to make $45,000 a year + bonuses to create 3D game art.  He wasn’t a star, but he was a solid, dependable guy with a very marketable skill.  After we closed shop following the simultaneous failure of our two publishers – both software giants – he went from full-time employment to contract work paying $30/hour, then $19/hour, and now there’s not enough work to be had so he’s working night shift security.  He’s not complaining, just doing what needs to be done, but I see his situation as anecdotal evidence that even highly trained professional computer jobs are not coming back, regardless of what the rosy-spectacled stock market watchers argue.</p></div>",
  "content_text": "The inimitable Mogambo Guru writes:\nSo that brings me back to the original question, which is; what is this magical education and re-training that is supposed to alleviate our plight? Nobody ever says. Even Alan Greenspan is sure that jobs will be created in the future, but he can’t think of what they could be.  Well, most of you came here today to hear what I have to say about the Bush plan to allow you to get a tax credit for health insurance. My initial response: Wow! It is the kind of irresponsible two-fisted giveaway that I laughingly suggested, in a previous MoGu, that they do. I never actually thought they would do it!\nUnder the old plan, which is the current plan, you get to deduct your health insurance premiums from income. As an aside, it looks like the premiums are 100% deductible this year, which means you don’t pay tax on the money you spent. You still pay the damn premiums, of course, it is just that you don’t pay income tax on it, too. Example; if you pay six grand year for health insurance, you do not pay tax on the money. Total out-of-pocket: $6,000. Last year, for you historians out there, you got to deduct only half the premiums from income, and you paid income tax on the rest. Total out-of-pocket last year; the $6,000 in premiums, and, at a 25% tax rate, another $750 in income taxes on the other $3,000, for a total of $6,750.\nThe new plan, the Bush plan, the tax credit plan, is better yet. The new example works like this: if you pay six grand a year for health insurance, you get back the money (currently estimated to be a maximum of $3,000) by claiming a tax credit! This tax credit section is at the end of the 1040 Income Tax Return, not the beginning! This is a big difference! So, the credit comes AFTER you have figured out how much tax you owe, and you deduct your premiums from that figure! Wow!\nSo, the example is now; total premiums are $6,000 per year. Total-out-of-pocket: $3,000, thanks to a $3,000 tax credit. Of course, this assumes that you have $3,000 of taxes due. If you don’t, then you are a piece of trash, and you don’t get the full deduction, and why should I care about you, you pathetic loser?  And as the benefit gradually escalates through the coming years, because dispensing higher and higher government benefits is what the government sees at its duty nowadays, (“Working for America by bankrupting us all through the wonders of communism and re-distribution of income!”) it will surely go to a 100% credit, which is, at the bottom line, free health insurance! You pay the premiums, and when you file your taxes, you get it all back!\nSo perhaps this answers my original question: What are these jobs that we are supposed to re-train to do? Health care workers and income tax form filler-outers.\nAlternatively, there’s always the option of moving to India.  There are some ominous signs out there.  I spoke with a former employee of mine two days ago, someone who used to make $45,000 a year + bonuses to create 3D game art.  He wasn’t a star, but he was a solid, dependable guy with a very marketable skill.  After we closed shop following the simultaneous failure of our two publishers – both software giants – he went from full-time employment to contract work paying $30/hour, then $19/hour, and now there’s not enough work to be had so he’s working night shift security.  He’s not complaining, just doing what needs to be done, but I see his situation as anecdotal evidence that even highly trained professional computer jobs are not coming back, regardless of what the rosy-spectacled stock market watchers argue.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-30T21:59:00+00:00"
}