{
  "url": "https://voxday.net/2004/01/07/on-neocons-letter-to-jonah-goldberg/",
  "scraped_at": "2025-12-13T15:42:02.627346",
  "title": "On Neocons – a letter to Jonah Goldberg",
  "date_display": "January 7, 2004",
  "date_iso": "2004-01-07T09:32:00+00:00",
  "date_from_url": "2004-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonah Goldberg of NRO writes: <em>I would love for a critic of the neocons to give me a serviceable definition of what one is.  A few self-described neocons — Irving Kristol, Max Boot, Adam Wolfson — are invested in imbuing neocons with a lot more meaning than I believe it has in part because they are leaders of what they see as the distinct political faction Drum’s talking about. But on specific public policy issues, I am at a loss to understand what exactly neocons believe to the exclusion of plain old conservatives.</em></p><p>My short definition is that a neoconservative is a big government conservative.  This includes numerous politicians and commentators who would probably not consider themselves anything but conservatives.  As the Republican party has grown, it has attracted more and more people who are more devoted to being on the winning team than they are to conservative Republican priniciples.  Add to this the pragmatic Republicans, who will sell out every conservative principle in order to win an election, and you have the foundation for what increasingly appears to be a transformation into a full-blown neoconservative party.</p><p>Neoconservativism rejects conservative isolationism in favor of Wilsonian adventurism.  It rejects republicanism in favor of fostering democracy, both here and abroad.  It consistently favors favors the acceptance of federalism over battling for states rights.  It rejects tradition and what you call the democracy of the dead in favor of building a new world order.  It does not respect national sovereignty, and uses left-liberal language of human rights to justify this lack of respect.  It rejects the Christian principle of being in but not of a fallen world and imitates the architects of the secular Left in attempting to construct Man’s paradise here on Earth.  There are different strains to this neoconservativism, but the common theme is a willingness to embrace the expansion of government power for a particular end.</p><p>I think there is a strong case for describing President Bush as a neoconservative.  He ran away from conservativism with his “compassionate conservative” rhetoric, has twice refused to follow the Constitution in properly declaring war and has instituted a new government entitlement as well as increasing government spending at rate that puts past Democrats to shame.</p><p>I am a libertarian, not a conservative, but I don’t find it hard to understand why many conservatives are dismayed with both President Bush and his neoconservative administration.  I’m somewhat acquainted with the non-official Bush coterie – I once dated the daughter of one of his major supporters – and these were not conservatives offended by the notion of big government, so long as the sum total of its interventions were in their favor.</p></div>",
  "content_text": "Jonah Goldberg of NRO writes:\nI would love for a critic of the neocons to give me a serviceable definition of what one is.  A few self-described neocons — Irving Kristol, Max Boot, Adam Wolfson — are invested in imbuing neocons with a lot more meaning than I believe it has in part because they are leaders of what they see as the distinct political faction Drum’s talking about. But on specific public policy issues, I am at a loss to understand what exactly neocons believe to the exclusion of plain old conservatives.\nMy short definition is that a neoconservative is a big government conservative.  This includes numerous politicians and commentators who would probably not consider themselves anything but conservatives.  As the Republican party has grown, it has attracted more and more people who are more devoted to being on the winning team than they are to conservative Republican priniciples.  Add to this the pragmatic Republicans, who will sell out every conservative principle in order to win an election, and you have the foundation for what increasingly appears to be a transformation into a full-blown neoconservative party.\nNeoconservativism rejects conservative isolationism in favor of Wilsonian adventurism.  It rejects republicanism in favor of fostering democracy, both here and abroad.  It consistently favors favors the acceptance of federalism over battling for states rights.  It rejects tradition and what you call the democracy of the dead in favor of building a new world order.  It does not respect national sovereignty, and uses left-liberal language of human rights to justify this lack of respect.  It rejects the Christian principle of being in but not of a fallen world and imitates the architects of the secular Left in attempting to construct Man’s paradise here on Earth.  There are different strains to this neoconservativism, but the common theme is a willingness to embrace the expansion of government power for a particular end.\nI think there is a strong case for describing President Bush as a neoconservative.  He ran away from conservativism with his “compassionate conservative” rhetoric, has twice refused to follow the Constitution in properly declaring war and has instituted a new government entitlement as well as increasing government spending at rate that puts past Democrats to shame.\nI am a libertarian, not a conservative, but I don’t find it hard to understand why many conservatives are dismayed with both President Bush and his neoconservative administration.  I’m somewhat acquainted with the non-official Bush coterie – I once dated the daughter of one of his major supporters – and these were not conservatives offended by the notion of big government, so long as the sum total of its interventions were in their favor.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-07T09:32:00+00:00"
}