{
  "url": "https://voxday.net/2004/01/17/rose-by-any-other-name/",
  "scraped_at": "2025-12-13T15:44:03.923593",
  "title": "A rose by any other name",
  "date_display": "January 17, 2004",
  "date_iso": "2004-01-17T12:37:00+00:00",
  "date_from_url": "2004-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What to call the “War on Terror”?  It’s nothing of the kind, of course, being neither a Constitutionally-declared war nor an action consistently opposed to terrorism.  No country that funds Arafat’s gang of thugs can call itself anti-terror, regardless of what else it does.  So whatever we’re fighting, it isn’t “terror”.  I’m all for fighting wars against those who have already declared war on us… but I’d like to see the our leaders -ahem- <em>obey their oaths to follow the bloody Constitution</em> before I offer my unqualified support for their actions.</p><p>I think “police action” sounds about right, hearkening as it does back to the good old days of UN leadership – very appropriate in light of how everything has continued to revolve around the UN one way or another since the very beginning.  The Police Action on Baathist Dictatorships?  Well, we invaded Afghanistan and left Syria alone, so that won’t work.  The Police Action on Officially Disapproved Anti-Humanists?  That sounds like we’re going to invade the Liberty University and the 700 Club, which isn’t happening no matter how much the Deenie-weenies would like to make it so.</p><p>The Police Action on Declared Enemies?  But we haven’t declared anyone to be the enemy, except for the Axis of Evil, two-thirds of which we’re ignoring while we invade other countries.  The Police Action on Self-Declared Enemies?  We’re not invading Iran or Saudi Arabia.  Then again, when you’re thinking language, you’ve really got to think Rummy.  The Police Action on Doable Enemies?  It’s a good start.</p><p>If anyone has any better suggestions, let me know.</p></div>",
  "content_text": "What to call the “War on Terror”?  It’s nothing of the kind, of course, being neither a Constitutionally-declared war nor an action consistently opposed to terrorism.  No country that funds Arafat’s gang of thugs can call itself anti-terror, regardless of what else it does.  So whatever we’re fighting, it isn’t “terror”.  I’m all for fighting wars against those who have already declared war on us… but I’d like to see the our leaders -ahem-\nobey their oaths to follow the bloody Constitution\nbefore I offer my unqualified support for their actions.\nI think “police action” sounds about right, hearkening as it does back to the good old days of UN leadership – very appropriate in light of how everything has continued to revolve around the UN one way or another since the very beginning.  The Police Action on Baathist Dictatorships?  Well, we invaded Afghanistan and left Syria alone, so that won’t work.  The Police Action on Officially Disapproved Anti-Humanists?  That sounds like we’re going to invade the Liberty University and the 700 Club, which isn’t happening no matter how much the Deenie-weenies would like to make it so.\nThe Police Action on Declared Enemies?  But we haven’t declared anyone to be the enemy, except for the Axis of Evil, two-thirds of which we’re ignoring while we invade other countries.  The Police Action on Self-Declared Enemies?  We’re not invading Iran or Saudi Arabia.  Then again, when you’re thinking language, you’ve really got to think Rummy.  The Police Action on Doable Enemies?  It’s a good start.\nIf anyone has any better suggestions, let me know.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-17T12:37:00+00:00"
}