{
  "url": "https://voxday.net/2004/01/27/scalia-trumps-sullivan/",
  "scraped_at": "2025-12-13T15:45:33.462821",
  "title": "Scalia trumps Sullivan",
  "date_display": "January 27, 2004",
  "date_iso": "2004-01-27T13:23:00+00:00",
  "date_from_url": "2004-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have little respect for what these days passes for public homosexual intellectuals.  Andrew Sullivan is hopeless on anything that involves his personal preferences – on such matters, he’s the personification of the feminist stereotype of the man who thinks with his genitalia.  Sullivan, like many other homosexual advocates, <a href=\"http://slate.msn.com/id/3642/entry/23844/\">furiously denied</a> that homosexual marriage advocacy would lead to efforts to legalize polygamy, mocking the notion as “intellectually laughable” and saying: “The slope, in fact, is not slippery at all. It isn’t even a slope.”  So, naturally, it was only a matter of months before events, predictably, proved him to be completely and utterly wrong.  If anyone has become intellectually laughable, it’s Sullivan, who once argued that because something was a matter life and death for him, it was not a conflict of interest.</p><p><em> Utah Attorney General Mark Shurtleff filed a friend-of-the-court brief in the Lawrence case, arguing that overturning the Texas law would open the door to challenges of Utah’s polygamy ban.  Shurtleff said he believes Barnard’s case is headed for the Supreme Court, and predicted the justices would uphold the polygamy ban.  “We have a long line of cases saying that the institute of marriage is the bedrock of society. Therefore, states have a compelling interest in regulating and controlling marriage,” he said.</em></p><p>But at least one legal expert said Lawrence’s logic leads to the legalization of polygamy, since the high court held that morality is not a strong enough justification for the state to ban a practice deemed unpopular or immoral by the majority.  “It’s not a case people can sniff at,” said Richard G. Wilkins, a law professor at Brigham Young University. “If you can’t require monogamy, how in the world can you deny the claims of the polygamists, particularly when it’s buttressed by the claim of religion?”</p><p>The case for polygamy, being rooted in Judaic, Islamic,  and Mormon religious traditions, is far stronger than the feeble case for homosexual marriage.  It is even arguably within the Biblical Christian tradition as well, even if it does not represent the ideal.  The Supreme Court could still deny it, of course, given that they are governed by nothing more than the social whims of six or seven individuals, but the justices can’t deny it based on their recent “reasoning”.</p><p>This, social conservatives, is only the latest proof of why it is foolish to rely on the state.  It is a two-edged sword that will always end up turning on you in the end.</p></div>",
  "content_text": "I have little respect for what these days passes for public homosexual intellectuals.  Andrew Sullivan is hopeless on anything that involves his personal preferences – on such matters, he’s the personification of the feminist stereotype of the man who thinks with his genitalia.  Sullivan, like many other homosexual advocates,\nfuriously denied\nthat homosexual marriage advocacy would lead to efforts to legalize polygamy, mocking the notion as “intellectually laughable” and saying: “The slope, in fact, is not slippery at all. It isn’t even a slope.”  So, naturally, it was only a matter of months before events, predictably, proved him to be completely and utterly wrong.  If anyone has become intellectually laughable, it’s Sullivan, who once argued that because something was a matter life and death for him, it was not a conflict of interest.\nUtah Attorney General Mark Shurtleff filed a friend-of-the-court brief in the Lawrence case, arguing that overturning the Texas law would open the door to challenges of Utah’s polygamy ban.  Shurtleff said he believes Barnard’s case is headed for the Supreme Court, and predicted the justices would uphold the polygamy ban.  “We have a long line of cases saying that the institute of marriage is the bedrock of society. Therefore, states have a compelling interest in regulating and controlling marriage,” he said.\nBut at least one legal expert said Lawrence’s logic leads to the legalization of polygamy, since the high court held that morality is not a strong enough justification for the state to ban a practice deemed unpopular or immoral by the majority.  “It’s not a case people can sniff at,” said Richard G. Wilkins, a law professor at Brigham Young University. “If you can’t require monogamy, how in the world can you deny the claims of the polygamists, particularly when it’s buttressed by the claim of religion?”\nThe case for polygamy, being rooted in Judaic, Islamic,  and Mormon religious traditions, is far stronger than the feeble case for homosexual marriage.  It is even arguably within the Biblical Christian tradition as well, even if it does not represent the ideal.  The Supreme Court could still deny it, of course, given that they are governed by nothing more than the social whims of six or seven individuals, but the justices can’t deny it based on their recent “reasoning”.\nThis, social conservatives, is only the latest proof of why it is foolish to rely on the state.  It is a two-edged sword that will always end up turning on you in the end.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-27T13:23:00+00:00"
}