{
  "url": "https://voxday.net/2004/01/30/sfwa-aler/",
  "scraped_at": "2025-12-13T15:46:06.979434",
  "title": "SFWA alert",
  "date_display": "January 30, 2004",
  "date_iso": "2004-01-30T19:26:00+00:00",
  "date_from_url": "2004-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the SFWA Board of Directors: <em>SFWA has received the following alert from the Romance Writers of America, which they have distributed to their membership. Note that while the warning from RWA only refers to “at least one agency”, members of SFWA have heard unconfirmed reports that some other agencies may also now be attempting to insert this same type of clause into their clients’ book contracts.The lesson is clear:  no matter who your agent is, check your contracts before signing.</em></p><p>Following is the text of the RWA alert: “RWA has recently learned that at least one major literary agency has inserted in publisher/author contracts negotiated by the agency a clause which we feel could be detrimental to authors.   This clause is a deviation from agency norms.  It appoints the agency “as the author’s sole and exclusive agent with respect to the work for the life of the copyright (and all renewals and extensions thereof) and authorizes and directs the publisher to make all payments due or to become due to the author.”It additionally states that as sole and exclusive agent, the agent is “hereby irrevocably authorized and empowered by the author to act on the author’s behalf in all matters arising from and pertaining to this agreement . . .”</p><p>Traditionally, this clause has appointed agencies/agent as the sole and exclusive agent for the life of the agreement, not the life of the copyright.  What does it mean to the author?  It means that even if you leave that particular agent, and the rights to your book revert back to you from the publisher, you will still be obligated to pay that agent a commission for as long as the copyright lasts (copyright of a work generally lasts for the life of the author plus an additional seventy years).  This includes foreign sales, movie sales, or resale of the book, even if the agency does nothing to cause that sale.  It could mean you will be paying two agency commissions, which could amount to thirty percent or more.  This also would apply to the author’s heirs.   We have been informed that this clause is being inserted into some contracts without notification to the authors with whom the agency has established fiduciary relationships. This situation highlights just how important it is for authors to scrutinize their contracts, particularly the agency clauses. </p><p>I never recommend starting out with a literary agent.  I’ve successfully negotiated better deals, much faster, than when I mistakenly used an agent simply because everyone else does.  They don’t have anywhere near the influence with publishers that they claim they do, they pump up expectations before getting a signature, then immediately begin trying to reduce them.  They may have been useful once; they are a detriment to the author who takes the time to learn what he is doing.</p><p>I was briefly represented by an agency that is tops in its genre.  They’re good people, but they were unable to bring me a single offer of a book contract.  Since then, working on my own, I’ve gotten three, plus unsolicited interest from other publishers.  Depending on the performance of others for your success almost always leads to massive disappointment.</p></div>",
  "content_text": "From the SFWA Board of Directors:\nSFWA has received the following alert from the Romance Writers of America, which they have distributed to their membership. Note that while the warning from RWA only refers to “at least one agency”, members of SFWA have heard unconfirmed reports that some other agencies may also now be attempting to insert this same type of clause into their clients’ book contracts.The lesson is clear:  no matter who your agent is, check your contracts before signing.\nFollowing is the text of the RWA alert: “RWA has recently learned that at least one major literary agency has inserted in publisher/author contracts negotiated by the agency a clause which we feel could be detrimental to authors.   This clause is a deviation from agency norms.  It appoints the agency “as the author’s sole and exclusive agent with respect to the work for the life of the copyright (and all renewals and extensions thereof) and authorizes and directs the publisher to make all payments due or to become due to the author.”It additionally states that as sole and exclusive agent, the agent is “hereby irrevocably authorized and empowered by the author to act on the author’s behalf in all matters arising from and pertaining to this agreement . . .”\nTraditionally, this clause has appointed agencies/agent as the sole and exclusive agent for the life of the agreement, not the life of the copyright.  What does it mean to the author?  It means that even if you leave that particular agent, and the rights to your book revert back to you from the publisher, you will still be obligated to pay that agent a commission for as long as the copyright lasts (copyright of a work generally lasts for the life of the author plus an additional seventy years).  This includes foreign sales, movie sales, or resale of the book, even if the agency does nothing to cause that sale.  It could mean you will be paying two agency commissions, which could amount to thirty percent or more.  This also would apply to the author’s heirs.   We have been informed that this clause is being inserted into some contracts without notification to the authors with whom the agency has established fiduciary relationships. This situation highlights just how important it is for authors to scrutinize their contracts, particularly the agency clauses.\nI never recommend starting out with a literary agent.  I’ve successfully negotiated better deals, much faster, than when I mistakenly used an agent simply because everyone else does.  They don’t have anywhere near the influence with publishers that they claim they do, they pump up expectations before getting a signature, then immediately begin trying to reduce them.  They may have been useful once; they are a detriment to the author who takes the time to learn what he is doing.\nI was briefly represented by an agency that is tops in its genre.  They’re good people, but they were unable to bring me a single offer of a book contract.  Since then, working on my own, I’ve gotten three, plus unsolicited interest from other publishers.  Depending on the performance of others for your success almost always leads to massive disappointment.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-30T19:26:00+00:00"
}