{
  "url": "https://voxday.net/2004/01/25/short-term-media-memory/",
  "scraped_at": "2025-12-13T15:45:12.906749",
  "title": "Short-term media memory",
  "date_display": "January 25, 2004",
  "date_iso": "2004-01-25T16:20:00+00:00",
  "date_from_url": "2004-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite an increased willingness by elected officials to consider ways to build stadiums for the Twins and Vikings, most Minnesotans don’t think the two pro sports teams need new facilities and nearly two-thirds oppose paying for them with their taxes, the latest <a href=\"http://startribune.com/stories/784/4337106.html\">Star Tribune Minnesota Poll </a>shows.</p><p>And here only three weeks ago, they were talking about how things had changed and how people were surprisingly open to funding a new stadium… again.  I hated the Metrodome from the beginning, of course, so while I’d like nothing better than to see it nuked and replaced with a decent stadium that is open to the winter elements, the state should not fund it.</p><p>It would be simple for the NFL to fund such stadiums, of course, if they would allow teams to go public like the Packers or any ordinary corporation.  But the league won’t do that, because they’ll lose the ability to extort communities into building them free facilities by threatening them with losing their team.  One benefit of this is that it illustrates very well how big business and big government work hand in hand against the people; any notion of fundamental conflict between them is utterly misguided.</p></div>",
  "content_text": "Despite an increased willingness by elected officials to consider ways to build stadiums for the Twins and Vikings, most Minnesotans don’t think the two pro sports teams need new facilities and nearly two-thirds oppose paying for them with their taxes, the latest\nStar Tribune Minnesota Poll\nshows.\nAnd here only three weeks ago, they were talking about how things had changed and how people were surprisingly open to funding a new stadium… again.  I hated the Metrodome from the beginning, of course, so while I’d like nothing better than to see it nuked and replaced with a decent stadium that is open to the winter elements, the state should not fund it.\nIt would be simple for the NFL to fund such stadiums, of course, if they would allow teams to go public like the Packers or any ordinary corporation.  But the league won’t do that, because they’ll lose the ability to extort communities into building them free facilities by threatening them with losing their team.  One benefit of this is that it illustrates very well how big business and big government work hand in hand against the people; any notion of fundamental conflict between them is utterly misguided.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-25T16:20:00+00:00"
}