{
  "url": "https://voxday.net/2004/01/02/simkanin-charade/",
  "scraped_at": "2025-12-13T15:41:07.651990",
  "title": "The Simkanin Charade",
  "date_display": "January 2, 2004",
  "date_iso": "2004-01-02T09:02:00+00:00",
  "date_from_url": "2004-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, you’re really confident that you owe those federal income taxes?  That the law requires your employer to withhold them from your paycheck?  Then it might trouble you to know that Texas businessman Dick Simkanin has been indicted four separate times by grand juries that have not heard ANY testimony from him, he’s had one jury vote 11-1 not guilty, and he’s STILL in jail after seven months of being convicted of nothing.  You can rape a woman and get less time.  Somebody is worried….</p><p><em><a href=\"http://www.givemeliberty.org/RTPLawsuit/Update04-Jan-01.htm\">In that trial</a>, an IRS legal expert had to recant his prior testimony regarding the definition of the critical legal term “employee” and the judge refused, after a specific request by the jurors, to provide them with a copy of the law that required Simkanin to withhold.</em></p><p>This week, Judge McBryde granted a DOJ motion to deny Dick the ability to present any of the evidentiary exhibits upon which he relied to form his beliefs about the tax code. This ruling by Judge McBryde effectively denies Dick the ability to defend against one of the separate, foundational elements of the alleged crimes, i.e., “willfulness.”</p><p>McBryde also granted a DOJ motion regarding “Jury Security” in effect, keeping the jury in complete isolation from the public during (and before) jury selection and during Simkanin’s trial. The order included provisions to conduct the jury selection process in private, with no public witnesses. Potential jurors are being directed to meet at a “secret location” and will then be bussed to the federal courthouse in downtown Fort Worth, and ushered inside for the proceedings. According to the order, jurors will not even be able to use the same hallways or bathrooms used by the general public during the trial. </p><p>Here’s a pretty simple question.  If the government’s case is so strong, so <em>obvious</em>, why are they forced to resort to such monstrous and unjust shenanigans?  Apply Occam’s Razor and the answer is clear.  The law is not what you think it is, nor what the government pretends it to be.  Our forefathers didn’t stand for such injustice, and certainly neither can we.</p><p>Considering the deception, violations of the Constitution and federal rules of court procedure, a railroaded guilty verdict won’t change my opinion in the least.  But the vindication of a not guilty verdict in the face of a stacked deck should make a real difference to the average American.</p></div>",
  "content_text": "So, you’re really confident that you owe those federal income taxes?  That the law requires your employer to withhold them from your paycheck?  Then it might trouble you to know that Texas businessman Dick Simkanin has been indicted four separate times by grand juries that have not heard ANY testimony from him, he’s had one jury vote 11-1 not guilty, and he’s STILL in jail after seven months of being convicted of nothing.  You can rape a woman and get less time.  Somebody is worried….\nIn that trial\n, an IRS legal expert had to recant his prior testimony regarding the definition of the critical legal term “employee” and the judge refused, after a specific request by the jurors, to provide them with a copy of the law that required Simkanin to withhold.\nThis week, Judge McBryde granted a DOJ motion to deny Dick the ability to present any of the evidentiary exhibits upon which he relied to form his beliefs about the tax code. This ruling by Judge McBryde effectively denies Dick the ability to defend against one of the separate, foundational elements of the alleged crimes, i.e., “willfulness.”\nMcBryde also granted a DOJ motion regarding “Jury Security” in effect, keeping the jury in complete isolation from the public during (and before) jury selection and during Simkanin’s trial. The order included provisions to conduct the jury selection process in private, with no public witnesses. Potential jurors are being directed to meet at a “secret location” and will then be bussed to the federal courthouse in downtown Fort Worth, and ushered inside for the proceedings. According to the order, jurors will not even be able to use the same hallways or bathrooms used by the general public during the trial.\nHere’s a pretty simple question.  If the government’s case is so strong, so\nobvious\n, why are they forced to resort to such monstrous and unjust shenanigans?  Apply Occam’s Razor and the answer is clear.  The law is not what you think it is, nor what the government pretends it to be.  Our forefathers didn’t stand for such injustice, and certainly neither can we.\nConsidering the deception, violations of the Constitution and federal rules of court procedure, a railroaded guilty verdict won’t change my opinion in the least.  But the vindication of a not guilty verdict in the face of a stacked deck should make a real difference to the average American.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-02T09:02:00+00:00"
}