{
  "url": "https://voxday.net/2004/01/03/sports-guy-knows/",
  "scraped_at": "2025-12-13T15:41:16.803306",
  "title": "The Sports Guy knows",
  "date_display": "January 3, 2004",
  "date_iso": "2004-01-03T00:17:00+00:00",
  "date_from_url": "2004-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>When the NFL Channel counts down “The Top 500 Toughest Regular-Season Losses” this summer, the Vikes probably clinched the No. 1 spot with that Arizona loss. Seriously, what was worse? Minutes away from a playoff berth, they gave up a touchdown, onside kick, wacky pass interference penalty, then a pseudo-Hail Mary on the final play … and they lost to a team with a rookie QB and a lame-duck coach, a team that was one more incompletion away from drafting first in April. And it was a bogus call to boot — really, does anyone think Poole would have gotten that second foot in?</em></p><p>Throw in their tragic history — Nate Wright, Gary Anderson, Darrin Nelson, four Super Bowl losses and everything else, and, yes, I’m well aware of this stuff since the best friend is a die-hard Vikes fan — and this was a Second-Degree Stomach Punch Game for the poor Minnesota fans</p><p>The Sports Guy is right.  It wasn’t a <a href=\"http://espn.go.com/page2/s/simmons/020528.html\">Third-Degree</a> deal.  Our expectations were way too low this season  Like Big Chilly said, there was no way we were going to do anything in the playoffs anyhow.  It’s technically worthy of a Stomach Punch because of how it all came about but it felt more like the 2001 NFC championship game when we were destroyed by the Giants 41-0; we were just surprised the team was in the hunt at all.  I would argue that the Dallas game was a That Game, however.  I’m still upset about it.  I’m more upset about that then I am about the stupid Arizona game.  I’m upset right now.  The Darrin Nelson drop against the Redskins was up there too.  I don’t know.  Go away.  I can’t talk about it right now.</p><p><em>More importantly, that was the fourth Stomach Punch game for the Vikes in less than 30 years. Even the Sox didn’t have that many over that same span. And yet you would never see a documentary about Vikings fans, a passionate group who have to rank among the most tortured fans in sports. Apparently media-related curses and sweeping self-importance is much more interesting on a national level.</em></p><p>Vikings fans are great fans, if not in the same league as Green Bay fans, who we love to hate, except we really don’t.  Of course, we actually have other options besides ice fishing and counting up all the different kinds of cheese we’ve eaten.  (Relax – Space Bunny’s mom is a Packers owner.)  The gang knows all the words to two of the Vikings three fight songs – the one Denny wrote is hopelessly cheesy, so no point.  We sing it after every touchdown, in bars, at football parties, on trans-Atlantic phone calls together.  The White Buffalo once taught an entire bar in Denver to sing “Vikings… the men of football fame” during a Monday Night football game against the 49ers, then called us so we hear it.  The sports media suck.  TV may revolve around New York City and Los Angeles, but the world of sports most emphatically does not.</p></div>",
  "content_text": "When the NFL Channel counts down “The Top 500 Toughest Regular-Season Losses” this summer, the Vikes probably clinched the No. 1 spot with that Arizona loss. Seriously, what was worse? Minutes away from a playoff berth, they gave up a touchdown, onside kick, wacky pass interference penalty, then a pseudo-Hail Mary on the final play … and they lost to a team with a rookie QB and a lame-duck coach, a team that was one more incompletion away from drafting first in April. And it was a bogus call to boot — really, does anyone think Poole would have gotten that second foot in?\nThrow in their tragic history — Nate Wright, Gary Anderson, Darrin Nelson, four Super Bowl losses and everything else, and, yes, I’m well aware of this stuff since the best friend is a die-hard Vikes fan — and this was a Second-Degree Stomach Punch Game for the poor Minnesota fans\nThe Sports Guy is right.  It wasn’t a\nThird-Degree\ndeal.  Our expectations were way too low this season  Like Big Chilly said, there was no way we were going to do anything in the playoffs anyhow.  It’s technically worthy of a Stomach Punch because of how it all came about but it felt more like the 2001 NFC championship game when we were destroyed by the Giants 41-0; we were just surprised the team was in the hunt at all.  I would argue that the Dallas game was a That Game, however.  I’m still upset about it.  I’m more upset about that then I am about the stupid Arizona game.  I’m upset right now.  The Darrin Nelson drop against the Redskins was up there too.  I don’t know.  Go away.  I can’t talk about it right now.\nMore importantly, that was the fourth Stomach Punch game for the Vikes in less than 30 years. Even the Sox didn’t have that many over that same span. And yet you would never see a documentary about Vikings fans, a passionate group who have to rank among the most tortured fans in sports. Apparently media-related curses and sweeping self-importance is much more interesting on a national level.\nVikings fans are great fans, if not in the same league as Green Bay fans, who we love to hate, except we really don’t.  Of course, we actually have other options besides ice fishing and counting up all the different kinds of cheese we’ve eaten.  (Relax – Space Bunny’s mom is a Packers owner.)  The gang knows all the words to two of the Vikings three fight songs – the one Denny wrote is hopelessly cheesy, so no point.  We sing it after every touchdown, in bars, at football parties, on trans-Atlantic phone calls together.  The White Buffalo once taught an entire bar in Denver to sing “Vikings… the men of football fame” during a Monday Night football game against the 49ers, then called us so we hear it.  The sports media suck.  TV may revolve around New York City and Los Angeles, but the world of sports most emphatically does not.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-03T00:17:00+00:00"
}