{
  "url": "https://voxday.net/2004/01/25/strategic-brilliance-of-wesley-clark/",
  "scraped_at": "2025-12-13T15:45:18.059250",
  "title": "The strategic brilliance of Wesley Clark",
  "date_display": "January 25, 2004",
  "date_iso": "2004-01-25T19:32:00+00:00",
  "date_from_url": "2004-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s one for Boggie and all the leftist military experts who know squat about the military.  From NRO’s Corner: <em>“I worked for Gen. Shelton [chairman of the joint chiefs at the time of the Kosovo conflict], but not for Gen. Clark. My specialty was the transition from the Deep Fight to the Close Fight which is where the Apache [helicopters] operate….</em></p><p>“My comments about Gen Clark’s remarks center on his comment about the offer for the Apaches from JCS: The doctrinal use of that weapon system is well defined and the planners for that part of the battlefield are among the best in the world. (They are referred to as ‘Jedi Knights’ among the staff). I assisted in that kind of planning for General Shelton when he was commander of XVIII Corp. He is very capable of understanding a concept paper unless it departs from doctrine or [is] very poorly written.</p><p>“Furthermore, it is odd that General Clark would not have initiated the request for the Apaches BEFORE being asked if he could use them only days out from the Line of Departure, especially if, as he implies, they were so important to his success. It appears to me that he did not understand the use of those systems and was ignoring his planning staff until prompted by the JCS.</p><p>“Finally, I recall the most disturbing sight of that conflict, aside from the human horrors, was the footage of a Maverick missile destroying a [light] truck. This was paraded for the media as the success our technology could give us. Using that weapon to destroy a parked truck was not only a waste, but evidence that they did not have a target matrix worth a tinker’s dam.  In summary, I expect General Clark is more [of an] expert on gay marriage….” </p><p>This was clearly written in response to Clark’s bizarre explanation of the Apache fiasco in an interview.  As I wrote previously, more and more evidence of Clark’s character flaws and general incompetence will be forthcoming over the next few weeks.  I myself recall hearing that the same Serbian tank was destroyed on multiple occasions, as the Serbs moved it around to give our high-altitude fighter-bombers something harmless to hit.  There are many officers from every branch, some at the highest ranks, who have zero desire to serve under him as Commander-in-Chief.</p><p>UPDATE:  Newsweek piles on: <em>The problem may have been partly a matter of Clark’s tone and manner. As an ambitious officer, Clark gained a reputation among his peers for telling different people what they wanted to hear, without seeming to realize that his listeners might later compare notes and accuse Clark of being two-faced.</em></p><p>That’s not a problem of tone and manner.  That shows a weakness of character and an extremely short-sighted point of view.  In other words, exactly what Shelton was warning about and then some.</p></div>",
  "content_text": "Here’s one for Boggie and all the leftist military experts who know squat about the military.  From NRO’s Corner:\n“I worked for Gen. Shelton [chairman of the joint chiefs at the time of the Kosovo conflict], but not for Gen. Clark. My specialty was the transition from the Deep Fight to the Close Fight which is where the Apache [helicopters] operate….\n“My comments about Gen Clark’s remarks center on his comment about the offer for the Apaches from JCS: The doctrinal use of that weapon system is well defined and the planners for that part of the battlefield are among the best in the world. (They are referred to as ‘Jedi Knights’ among the staff). I assisted in that kind of planning for General Shelton when he was commander of XVIII Corp. He is very capable of understanding a concept paper unless it departs from doctrine or [is] very poorly written.\n“Furthermore, it is odd that General Clark would not have initiated the request for the Apaches BEFORE being asked if he could use them only days out from the Line of Departure, especially if, as he implies, they were so important to his success. It appears to me that he did not understand the use of those systems and was ignoring his planning staff until prompted by the JCS.\n“Finally, I recall the most disturbing sight of that conflict, aside from the human horrors, was the footage of a Maverick missile destroying a [light] truck. This was paraded for the media as the success our technology could give us. Using that weapon to destroy a parked truck was not only a waste, but evidence that they did not have a target matrix worth a tinker’s dam.  In summary, I expect General Clark is more [of an] expert on gay marriage….”\nThis was clearly written in response to Clark’s bizarre explanation of the Apache fiasco in an interview.  As I wrote previously, more and more evidence of Clark’s character flaws and general incompetence will be forthcoming over the next few weeks.  I myself recall hearing that the same Serbian tank was destroyed on multiple occasions, as the Serbs moved it around to give our high-altitude fighter-bombers something harmless to hit.  There are many officers from every branch, some at the highest ranks, who have zero desire to serve under him as Commander-in-Chief.\nUPDATE:  Newsweek piles on:\nThe problem may have been partly a matter of Clark’s tone and manner. As an ambitious officer, Clark gained a reputation among his peers for telling different people what they wanted to hear, without seeming to realize that his listeners might later compare notes and accuse Clark of being two-faced.\nThat’s not a problem of tone and manner.  That shows a weakness of character and an extremely short-sighted point of view.  In other words, exactly what Shelton was warning about and then some.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-25T19:32:00+00:00"
}