{
  "url": "https://voxday.net/2004/01/06/sunyata-im-moving-on/",
  "scraped_at": "2025-12-13T15:41:51.582195",
  "title": "Sunyata… I’m moving on",
  "date_display": "January 6, 2004",
  "date_iso": "2004-01-06T01:29:00+00:00",
  "date_from_url": "2004-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I got an email from a former member of my old band this weekend.  He saw that there was a bit of a revival happening under a different name and wondered if I was involved.  I wasn’t, (or so I thought), but I went to check out the web site for <a href=\"http://www.basicpleasuremodel.com/\">Basic Pleasure Model</a>.    I was surprised to see that the first single had the same name as one of the last songs I wrote for Psykosonik before dropping out of the group – only the lyrics, that’s all I ever wrote – but that’s cool, it’s a good name.</p><p>Holy cats!  It’s exactly the same song, updated for the new millenium with a garage beat underneath the melody.  It sounds great, and it looks like you can <a href=\"http://www.cdbaby.com/cd/bpmodel\">buy the CD single</a> already, so definitely check it out.  I’m  quite pleased that they recorded it, as I’ve always considered it the prettiest song that Paul Sebastien and I ever wrote together.  Here’s hoping for a future release of “Cosmic Trigger”, a technodance ode to Robert Anton Wilson that didn’t quite make the first CD.</p><p>Anyhow, there’s previews of five different mixes of the Sunyata single at the BPM web site in the music page.  Love the new bass in the chorus of the Album Version.  Good to see that Paul’s kept up the old tradition of having at least 50 completely different remixes for every single.  I mean, you wouldn’t want leave any blank space on the CD now, would you?  Man, I’d forgotten how much I love his voice.   I’d also forgotten how the verses went:</p><p><em>Feast your eyes on beauty surrounding, step outside it and see<br> <br>The central shining void, for that’s where you will be<br> <br>You’ll never find the meaning hidden under it all<br> <br>In every drop of rain, in every tear that’ll fall</br></br></br></br></br></br></em></p><p>The centuries they will fly, kingdoms they will fall<br> <br>You’re just a link in a chain, just a crack in the wall<br> <br>In a hundred years it will all be the same<br> <br>Your life is little more than ephemeral flame</br></br></br></br></br></br></p><p>The words are a little melancholy, but there’s a spirit of timelessness to the music that I find quite beautiful.</p><p>UPDATE – Just talked via email with Paul.  He’s very up for some lyrical collaboration like we used to do in the old days, which will be a lot of fun.  Paul is too humble, though.  I looked at his bio, and he forgot both our Minnesota Music Award for Best Dance Record – a small, but not insignificant award since Prince is from Minneapolis and releases something like twelve singles every year  – as well as his four Billboard Top 40 Dance chartings.</p></div>",
  "content_text": "I got an email from a former member of my old band this weekend.  He saw that there was a bit of a revival happening under a different name and wondered if I was involved.  I wasn’t, (or so I thought), but I went to check out the web site for\nBasic Pleasure Model\n.    I was surprised to see that the first single had the same name as one of the last songs I wrote for Psykosonik before dropping out of the group – only the lyrics, that’s all I ever wrote – but that’s cool, it’s a good name.\nHoly cats!  It’s exactly the same song, updated for the new millenium with a garage beat underneath the melody.  It sounds great, and it looks like you can\nbuy the CD single\nalready, so definitely check it out.  I’m  quite pleased that they recorded it, as I’ve always considered it the prettiest song that Paul Sebastien and I ever wrote together.  Here’s hoping for a future release of “Cosmic Trigger”, a technodance ode to Robert Anton Wilson that didn’t quite make the first CD.\nAnyhow, there’s previews of five different mixes of the Sunyata single at the BPM web site in the music page.  Love the new bass in the chorus of the Album Version.  Good to see that Paul’s kept up the old tradition of having at least 50 completely different remixes for every single.  I mean, you wouldn’t want leave any blank space on the CD now, would you?  Man, I’d forgotten how much I love his voice.   I’d also forgotten how the verses went:\nFeast your eyes on beauty surrounding, step outside it and see\nThe central shining void, for that’s where you will be\nYou’ll never find the meaning hidden under it all\nIn every drop of rain, in every tear that’ll fall\nThe centuries they will fly, kingdoms they will fall\nYou’re just a link in a chain, just a crack in the wall\nIn a hundred years it will all be the same\nYour life is little more than ephemeral flame\nThe words are a little melancholy, but there’s a spirit of timelessness to the music that I find quite beautiful.\nUPDATE – Just talked via email with Paul.  He’s very up for some lyrical collaboration like we used to do in the old days, which will be a lot of fun.  Paul is too humble, though.  I looked at his bio, and he forgot both our Minnesota Music Award for Best Dance Record – a small, but not insignificant award since Prince is from Minneapolis and releases something like twelve singles every year  – as well as his four Billboard Top 40 Dance chartings.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-06T01:29:00+00:00"
}