{
  "url": "https://voxday.net/2004/01/19/susan-you-ignorant-slu/",
  "scraped_at": "2025-12-13T15:44:24.597424",
  "title": "Susan, you ignorant slut",
  "date_display": "January 19, 2004",
  "date_iso": "2004-01-19T15:38:00+00:00",
  "date_from_url": "2004-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Susan comments (tongue-in-cheek, I do hope): <em>To borrow a pharse- What’s frightening, to me, is the notion of intelligent people who are able to focus because they so slaver after power over others. That is why I think that anyone who is willing to put themselves in the position to alliance others by espousing their superior thoughts should be at least considered as suffering from perhaps being somewhat psychologically narcissistic.</em></p><p>“Pharse” may indeed describe this blog from time to time, but I do excuse typos here.  I do not, however, excuse the confusion of ‘alliance” and “influence”.  As for psychological narcissism, come on, Susan, it’s a blog!  It’s psychologically narcissistic by definition!  How on earth would you explain the popularity of the phenomenon otherwise?</p><p>As for power over others, I don’t slaver after it.  Quite the opposite.  I try to avoid getting saddled with it as best I can.</p></div>",
  "content_text": "Susan comments (tongue-in-cheek, I do hope):\nTo borrow a pharse- What’s frightening, to me, is the notion of intelligent people who are able to focus because they so slaver after power over others. That is why I think that anyone who is willing to put themselves in the position to alliance others by espousing their superior thoughts should be at least considered as suffering from perhaps being somewhat psychologically narcissistic.\n“Pharse” may indeed describe this blog from time to time, but I do excuse typos here.  I do not, however, excuse the confusion of ‘alliance” and “influence”.  As for psychological narcissism, come on, Susan, it’s a blog!  It’s psychologically narcissistic by definition!  How on earth would you explain the popularity of the phenomenon otherwise?\nAs for power over others, I don’t slaver after it.  Quite the opposite.  I try to avoid getting saddled with it as best I can.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-19T15:38:00+00:00"
}