{
  "url": "https://voxday.net/2004/01/06/tax-trial-update-ii/",
  "scraped_at": "2025-12-13T15:42:00.755278",
  "title": "Tax trial update II",
  "date_display": "January 6, 2004",
  "date_iso": "2004-01-06T23:59:00+00:00",
  "date_from_url": "2004-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Looks like Doug Kenline is back online <a href=\"http://dougkenline.blogspot.com\">audioblogging from the trial</a> in Fort Worth.  The courthouse is packed, so much so that Doug couldn’t get into the afternoon session.  According to Robert Engle, who managed to find a seat, Larkin Rose, Bob Schultz and Ed Rivera were testifying for the defense and Rose particularly had the jury paying close attention to his presentation.  Some interesting information on the right to withhold tax money when petitions have not been addressed by the government was presented by Schultz too.  Engle’s opinion was that it was a good day for the defense, but since he’s not on the jury, we’ll just have to wait and see.</p><p>The informative audio posts are time-stamped 4:37 PM on Tuesday and 5:33 PM and 5:37 PM on Monday.  The others should be skipped.  Closing statements in the final session still to come, followed by deliberations and the verdict.</p><p>Audblog is tres cool.</p></div>",
  "content_text": "Looks like Doug Kenline is back online\naudioblogging from the trial\nin Fort Worth.  The courthouse is packed, so much so that Doug couldn’t get into the afternoon session.  According to Robert Engle, who managed to find a seat, Larkin Rose, Bob Schultz and Ed Rivera were testifying for the defense and Rose particularly had the jury paying close attention to his presentation.  Some interesting information on the right to withhold tax money when petitions have not been addressed by the government was presented by Schultz too.  Engle’s opinion was that it was a good day for the defense, but since he’s not on the jury, we’ll just have to wait and see.\nThe informative audio posts are time-stamped 4:37 PM on Tuesday and 5:33 PM and 5:37 PM on Monday.  The others should be skipped.  Closing statements in the final session still to come, followed by deliberations and the verdict.\nAudblog is tres cool.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-06T23:59:00+00:00"
}