{
  "url": "https://voxday.net/2004/01/03/this-should-be-interesting/",
  "scraped_at": "2025-12-13T15:41:22.360853",
  "title": "This should be interesting",
  "date_display": "January 3, 2004",
  "date_iso": "2004-01-03T09:36:00+00:00",
  "date_from_url": "2004-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Robert Novak reports: <em>The Bush administration is bracing for the first hostile book written by a former official in January when Paul O’Neill publishes an account of his two years as secretary of the treasury.  Pittsburgh industrialist O’Neill left Washington angrily after being fired Dec. 6, 2002, and began work on a book. The White House fears the worst from his insider’s account. </em></p><p>They have something to fear.  This economic boomlet of the last six months has the same cause as most modern booms – expansion of the money supply, which is also known as inflation.  According to the Fed, M1 is up 7.2 percent in 2003 and M3 is up 4.6 percent, while the economy grew 2.9 percent in the last year.  There’s all of your GDP “growth” right there, and then some, the literally unbelievable Q3 jump notwithstanding.   Cliff Droke writes: <em>The dominant theme in 2003, especially the last nine months of the year, was inflation.  Not inflation in the economic sense but inflation in the sense of rising prices across-the-board for equities, commodities, and real estate due to massive injections of liquidity into the U.S. financial system. </em></p><p>It’s strange, considering the championing of this so-called “inflation free” boom, that cattle prices have risen 36% in the last 12 months, scrap steel is up 42 percent and gold is up from $278 to $416 in only two years.</p><p>I’ll be checking out O’Neill’s book.  I suspect he knows what the inevitable consequences of this insane monetary policy is, even if Larry Kudlow doesn’t.  Consider this:  after two years of bear action followed by an almost unprecedented bull run, the NASDAQ is up 1.3 percent.  But the dollar is down 40 percent in that same period.  It may not matter to the US investor, but I don’t think a lot of foreign investors are excited with that performance.  Richard Russell suggests that the US economy will be continued to be propped up as China buys time by continuing to purchase dollars until its infrastructure is in place to replace the USA as the global economic center.</p><p>This is a credible scenario – it mirrors one that I’d separately developed for a novel I’m currently writing – far more so than those who worry about competition from a moribund and dying Europe or believe that the current financial regime can be sustained indefinitely.  What is ominous is that China is starting to permit and encourage both individual gold accumulation and entrepeneurialism – someone’s been reading the Austrians, I suspect.  Once you begin to hear noises about an official abjuring of the Communist creed, be prepared for fireworks of several kinds.  Empires, financial and otherwise, don’t tend to go peacefully into the gentle night of history.</p></div>",
  "content_text": "Robert Novak reports:\nThe Bush administration is bracing for the first hostile book written by a former official in January when Paul O’Neill publishes an account of his two years as secretary of the treasury.  Pittsburgh industrialist O’Neill left Washington angrily after being fired Dec. 6, 2002, and began work on a book. The White House fears the worst from his insider’s account.\nThey have something to fear.  This economic boomlet of the last six months has the same cause as most modern booms – expansion of the money supply, which is also known as inflation.  According to the Fed, M1 is up 7.2 percent in 2003 and M3 is up 4.6 percent, while the economy grew 2.9 percent in the last year.  There’s all of your GDP “growth” right there, and then some, the literally unbelievable Q3 jump notwithstanding.   Cliff Droke writes:\nThe dominant theme in 2003, especially the last nine months of the year, was inflation.  Not inflation in the economic sense but inflation in the sense of rising prices across-the-board for equities, commodities, and real estate due to massive injections of liquidity into the U.S. financial system.\nIt’s strange, considering the championing of this so-called “inflation free” boom, that cattle prices have risen 36% in the last 12 months, scrap steel is up 42 percent and gold is up from $278 to $416 in only two years.\nI’ll be checking out O’Neill’s book.  I suspect he knows what the inevitable consequences of this insane monetary policy is, even if Larry Kudlow doesn’t.  Consider this:  after two years of bear action followed by an almost unprecedented bull run, the NASDAQ is up 1.3 percent.  But the dollar is down 40 percent in that same period.  It may not matter to the US investor, but I don’t think a lot of foreign investors are excited with that performance.  Richard Russell suggests that the US economy will be continued to be propped up as China buys time by continuing to purchase dollars until its infrastructure is in place to replace the USA as the global economic center.\nThis is a credible scenario – it mirrors one that I’d separately developed for a novel I’m currently writing – far more so than those who worry about competition from a moribund and dying Europe or believe that the current financial regime can be sustained indefinitely.  What is ominous is that China is starting to permit and encourage both individual gold accumulation and entrepeneurialism – someone’s been reading the Austrians, I suspect.  Once you begin to hear noises about an official abjuring of the Communist creed, be prepared for fireworks of several kinds.  Empires, financial and otherwise, don’t tend to go peacefully into the gentle night of history.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-03T09:36:00+00:00"
}