{
  "url": "https://voxday.net/2004/01/17/trusted-computing/",
  "scraped_at": "2025-12-13T15:43:56.923653",
  "title": "Trusted computing",
  "date_display": "January 17, 2004",
  "date_iso": "2004-01-17T08:14:00+00:00",
  "date_from_url": "2004-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is what you will be able to see happening more and more often as Microsoft moves towards trusted computing.  It’s a hardware issue, you see, so if you don’t have the approved hardware, you’ll be out of luck if your software “requires” it.  In this case, Microsoft just <a href=\"http://12.108.175.91/ebookweb/stories/storyReader$154\">blew off everyone</a> who was dumb enough to go with the Microsoft Reader format instead of Palm’s.  Surprise, surprise.  Doesn’t anyone ever learn?</p><p>Never use Microsoft if you have any choice in the matter.  The decision will usually come back to haunt you.  Big Chilly and I made over a million dollars one year based on our philosophy that Microsoft is dependably full of <em>merde</em> and sticking with third-party software libraries instead of doing what all of our competitors were doing and waiting for Microsoft’s promised solution.  Which, of course, was not ready in time for the mission-critical deadline.</p><p><em>“[Jason] Dunn could not be reached for comment on Microsoft’s response, but in his weblog article he called the company’s decision “a slap in the face” for Pocket PC owners, adding that the company must take responsibility for its decision. “I still use Reader daily, and there’s some excellent free content out there, but Microsoft didn’t deliver on it’s commitment to give you an upgrade and that’s something they’re going to have to live with,” Dunn wrote.”</em></p><p>Somehow, I imagine they’ll survive.  They have a lot of experience with this sort of thing.</p></div>",
  "content_text": "This is what you will be able to see happening more and more often as Microsoft moves towards trusted computing.  It’s a hardware issue, you see, so if you don’t have the approved hardware, you’ll be out of luck if your software “requires” it.  In this case, Microsoft just\nblew off everyone\nwho was dumb enough to go with the Microsoft Reader format instead of Palm’s.  Surprise, surprise.  Doesn’t anyone ever learn?\nNever use Microsoft if you have any choice in the matter.  The decision will usually come back to haunt you.  Big Chilly and I made over a million dollars one year based on our philosophy that Microsoft is dependably full of\nmerde\nand sticking with third-party software libraries instead of doing what all of our competitors were doing and waiting for Microsoft’s promised solution.  Which, of course, was not ready in time for the mission-critical deadline.\n“[Jason] Dunn could not be reached for comment on Microsoft’s response, but in his weblog article he called the company’s decision “a slap in the face” for Pocket PC owners, adding that the company must take responsibility for its decision. “I still use Reader daily, and there’s some excellent free content out there, but Microsoft didn’t deliver on it’s commitment to give you an upgrade and that’s something they’re going to have to live with,” Dunn wrote.”\nSomehow, I imagine they’ll survive.  They have a lot of experience with this sort of thing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-17T08:14:00+00:00"
}