{
  "url": "https://voxday.net/2004/01/14/union-of-americas/",
  "scraped_at": "2025-12-13T15:43:15.349346",
  "title": "Union of the Americas",
  "date_display": "January 14, 2004",
  "date_iso": "2004-01-14T08:08:00+00:00",
  "date_from_url": "2004-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since the radio show last night, I’ve been thinking about why the amnesty is being pushed by the Bush administration.  It makes zero political sense.  Then it occurred to me that the USA and other governments of North, Central and South America are simply following the example set by Europe.  Just as the sovereign political nation that is the EU began as a “free trade” zone, a course has been set to create an American superstate.</p><p>This will take time, probably on the order of 30-40 years.  But the outlines have been sketched and the structure is starting to become apparent to the most astute observers.  Almost everyone will deny this, of course, just as they were denying that the EU could <em>ever </em>be a political entity as recently as 18 months ago.  You won’t hear any such objections now, since it’s undeniable by even the most skeptical at this point.  But the <a href=\"http://moneycentral.msn.com/content/P64848.asp\">skeleton for the current EU</a> was created with the Treaty of Paris in 1951, then given flesh with the 1957 Treaty of Rome.  The Union of the Americas is still at a point somewhere between Paris and Rome, which is why I conclude it will be another 40 years before NAFTA is expanded and transformed into monetary and political union.</p><p>Flooding the country with people who will support such a concept is vital, so we can expect the massive immigration to continue unabated, just like the Swiss government – eager to join the EU despite the failure of two national referendums on potential membership – has ramped up immigration from EU countries.  The best argument for immigration is that our Mexican <em>gastarbeiten</em> are taking jobs that lazy Americans are unwilling to take.  But a recent debate in the Dallas Morning News showed that the Hispanic population of Dallas County increased from 30 percent to 40 percent from 2000 to 2002.  I find it very difficult to imagine that the economic growth of that area is such that the increase stemmed from a dearth of employable workers.  It’s a theoretical argument that sounds good until one examines the facts required to support it.</p></div>",
  "content_text": "Since the radio show last night, I’ve been thinking about why the amnesty is being pushed by the Bush administration.  It makes zero political sense.  Then it occurred to me that the USA and other governments of North, Central and South America are simply following the example set by Europe.  Just as the sovereign political nation that is the EU began as a “free trade” zone, a course has been set to create an American superstate.\nThis will take time, probably on the order of 30-40 years.  But the outlines have been sketched and the structure is starting to become apparent to the most astute observers.  Almost everyone will deny this, of course, just as they were denying that the EU could\never\nbe a political entity as recently as 18 months ago.  You won’t hear any such objections now, since it’s undeniable by even the most skeptical at this point.  But the\nskeleton for the current EU\nwas created with the Treaty of Paris in 1951, then given flesh with the 1957 Treaty of Rome.  The Union of the Americas is still at a point somewhere between Paris and Rome, which is why I conclude it will be another 40 years before NAFTA is expanded and transformed into monetary and political union.\nFlooding the country with people who will support such a concept is vital, so we can expect the massive immigration to continue unabated, just like the Swiss government – eager to join the EU despite the failure of two national referendums on potential membership – has ramped up immigration from EU countries.  The best argument for immigration is that our Mexican\ngastarbeiten\nare taking jobs that lazy Americans are unwilling to take.  But a recent debate in the Dallas Morning News showed that the Hispanic population of Dallas County increased from 30 percent to 40 percent from 2000 to 2002.  I find it very difficult to imagine that the economic growth of that area is such that the increase stemmed from a dearth of employable workers.  It’s a theoretical argument that sounds good until one examines the facts required to support it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-14T08:08:00+00:00"
}