{
  "url": "https://voxday.net/2004/01/10/wherefore-art-thou-ralp/",
  "scraped_at": "2025-12-13T15:42:48.763297",
  "title": "Wherefore art thou, Ralph?",
  "date_display": "January 10, 2004",
  "date_iso": "2004-01-10T12:26:00+00:00",
  "date_from_url": "2004-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I love <a href=\"http://msn.espn.go.com/page2/s/wiley/040109.html\">Ralph Wiley</a>.  He is a writer’s writer.  I don’t always agree with him, but his fearless approach to his art is a major influence on my own approach to commentary.  But I have to address his analysis of the Green Bay – Philadelpha matchup, as I suspect his desire to champion Donovan McNabb may have led him a little astray here.  Of course, the beautiful thing about sports is that, unlike politics, we’ll know who is right this weekend.</p><p>RW: <em>Do you really think Ahman Green, the most beautiful running back in ball right now, is going to rush for 150 yards? Are you insane? With the skill of Philly’s corners, Troy Vincent and Bobby Taylor? They can easily single-cover Green Bay’s wide receivers and bring Brian Dawkins down into the box like an extra linebacker — only Dawkins hits harder than most LBs. It’s simply a matter of bringing one more than the Pack O-line can block, much as the McTites did to Baltimore’s Jamal Lewis.</em></p><p>I don’t know if he’ll rush for 150.  But I don’t see a defense that couldn’t stop Kevan Barlow shutting him down either.  And Donald Driver, Javon Walker and Bubba Franks are not exactly the Baltimore Ravens receiving corps.  Philadelphia gives up 130 rushing yards per game, and ranks 8 spots and 20 yard per game worse than Seattle.  Green will get his yards, and two TDs as well.</p><p>RW: <em>As for waiting for McNabb to nut up, well, you may as well pass the Chunky Soup, be-atch. I seriously doubt that Andy Reid will make the same mistake he made last year with that ultra-conservative game plan, put in maybe because McNabb was coming off that broken leg and limping around. I expect the Eagles to play wide-open; and the Green Bay secondary, as Matt Hasselbeck proved until the last play, is available. McNabb knows what Hasselbeck didn’t (though it was nice to see what the Sea-Dogs had, finally — they’ve got a squad). McNabb knows full well that corner Al Harris likes to sit on routes. He’ll get double-moved in this one.</em></p><p>Matt Hasselbeck: 61 percent completions, 26 TD, 15 INT<br> <br>Donovan McNabb: 57.5 percent completions, 16 TD, 11 INT</br></br></p><p>McNabb probably does know it.  The problem isn’t his experience or a tendency to choke, the problem is his lack of accuracy.  After the double-pump, he’ll overthrow Thrash, then, on the next play, sail one high over the middle right into Darren Sharper’s chest.</p></div>",
  "content_text": "I love\nRalph Wiley\n.  He is a writer’s writer.  I don’t always agree with him, but his fearless approach to his art is a major influence on my own approach to commentary.  But I have to address his analysis of the Green Bay – Philadelpha matchup, as I suspect his desire to champion Donovan McNabb may have led him a little astray here.  Of course, the beautiful thing about sports is that, unlike politics, we’ll know who is right this weekend.\nRW:\nDo you really think Ahman Green, the most beautiful running back in ball right now, is going to rush for 150 yards? Are you insane? With the skill of Philly’s corners, Troy Vincent and Bobby Taylor? They can easily single-cover Green Bay’s wide receivers and bring Brian Dawkins down into the box like an extra linebacker — only Dawkins hits harder than most LBs. It’s simply a matter of bringing one more than the Pack O-line can block, much as the McTites did to Baltimore’s Jamal Lewis.\nI don’t know if he’ll rush for 150.  But I don’t see a defense that couldn’t stop Kevan Barlow shutting him down either.  And Donald Driver, Javon Walker and Bubba Franks are not exactly the Baltimore Ravens receiving corps.  Philadelphia gives up 130 rushing yards per game, and ranks 8 spots and 20 yard per game worse than Seattle.  Green will get his yards, and two TDs as well.\nRW:\nAs for waiting for McNabb to nut up, well, you may as well pass the Chunky Soup, be-atch. I seriously doubt that Andy Reid will make the same mistake he made last year with that ultra-conservative game plan, put in maybe because McNabb was coming off that broken leg and limping around. I expect the Eagles to play wide-open; and the Green Bay secondary, as Matt Hasselbeck proved until the last play, is available. McNabb knows what Hasselbeck didn’t (though it was nice to see what the Sea-Dogs had, finally — they’ve got a squad). McNabb knows full well that corner Al Harris likes to sit on routes. He’ll get double-moved in this one.\nMatt Hasselbeck: 61 percent completions, 26 TD, 15 INT\nDonovan McNabb: 57.5 percent completions, 16 TD, 11 INT\nMcNabb probably does know it.  The problem isn’t his experience or a tendency to choke, the problem is his lack of accuracy.  After the double-pump, he’ll overthrow Thrash, then, on the next play, sail one high over the middle right into Darren Sharper’s chest.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-10T12:26:00+00:00"
}