{
  "url": "https://voxday.net/2004/01/09/where-were-heading/",
  "scraped_at": "2025-12-13T15:42:24.714003",
  "title": "Where we’re heading",
  "date_display": "January 9, 2004",
  "date_iso": "2004-01-09T08:16:00+00:00",
  "date_from_url": "2004-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>A British television talk-show host for BBC1 is under fire for a newspaper column he wrote criticizing Arabs. <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36517\">Robert Kilroy-Silk faces a possible police investigation</a> after referring to Arabs as “suicide bombers, limb amputators, women repressors,” reports Sky News.  The comments, which included a charge that Arabs “murdered” 3,000 civilians on September 11, were published in a weekend column in the Sunday Express. </em></p><p>Apparently the truth is no defense.  Are the suicide bombers Arab?  Yes.  Is the amputation of limbs a normal punishment in Arab countries?  Yes.  Are women repressed in Arab countries?  Yes, by Western standards.  But apparently it’s a crime to mention any of this in Britain.</p><p>Good thing we have a 1st Amendment to protect our right to free speech… well, we did until the Supreme Court decided that we didn’t last month.</p></div>",
  "content_text": "A British television talk-show host for BBC1 is under fire for a newspaper column he wrote criticizing Arabs.\nRobert Kilroy-Silk faces a possible police investigation\nafter referring to Arabs as “suicide bombers, limb amputators, women repressors,” reports Sky News.  The comments, which included a charge that Arabs “murdered” 3,000 civilians on September 11, were published in a weekend column in the Sunday Express.\nApparently the truth is no defense.  Are the suicide bombers Arab?  Yes.  Is the amputation of limbs a normal punishment in Arab countries?  Yes.  Are women repressed in Arab countries?  Yes, by Western standards.  But apparently it’s a crime to mention any of this in Britain.\nGood thing we have a 1st Amendment to protect our right to free speech… well, we did until the Supreme Court decided that we didn’t last month.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-09T08:16:00+00:00"
}