{
  "url": "https://voxday.net/2004/01/05/why-joel-why/",
  "scraped_at": "2025-12-13T15:41:44.558885",
  "title": "Why, Joel, why?",
  "date_display": "January 5, 2004",
  "date_iso": "2004-01-05T11:35:00+00:00",
  "date_from_url": "2004-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m still kind of at a loss as to why Mowbray went after General Zinni like that.  (see CURRENT COLUMN  on the left for details)  He wasn’t that vicious about the State Department, even though they actually had it coming to them.  I don’t think he seriously believes Zinni is a Jew-hater, so I suspect that he’s simply trying to defend the term “neocon”, which is coming into increasingly bad odor among leftists, conservatives and libertarians alike.</p><p>The neocons in the press seem to be getting pretty jumpy.  Michael Ledeen just about had an aneurysm <a href=\"http://www.nationalreview.com/ledeen/ledeen091003.asp\">going off on Ron Paul</a>, who is the only member of Congress for whom I have any respect regardless of how poorly read he happens to be on Ledeen’s ouvre.  And speaking poor reading comprehension, Ledeen himself ignored the very substantive points that Paul correctly made with regards to the failure of Republicanism.</p><p>If Ledeen’s strange overreaction is typical, the neocons are also kind of girly.  “His attack… incitements to personal violence.”  Eeek!  It’s a slow week that I don’t get at least one direct threat of something unpleasant.  BFD.  Maybe if Ledeen and the other neocons hit the gym once in a while they wouldn’t wet themselves every time someone said something less than flattering about them.  And perhapsJoel Mowbray wouldn’t feel the need to stand up for them either.</p><p>I mean, I’m from Minnesota.  We have something like eight Jews in the state.  Growing up there, I thought I was ethnic because I’m of English descent with dark brown hair.  Since I have little interest in the media circles, I have no idea who is and who isn’t a Jew except for Jonah Goldberg and Rabbi Boteach.  What I do know, however, is that I like very little of what I hear from the neocons, who seem to use conservative language to defend left-liberal actions and policies.</p><p>Just for the record, I like much of what Joel Mowbray and Michael Ledeen have to say.  They’re not the bad guys.</p></div>",
  "content_text": "I’m still kind of at a loss as to why Mowbray went after General Zinni like that.  (see CURRENT COLUMN  on the left for details)  He wasn’t that vicious about the State Department, even though they actually had it coming to them.  I don’t think he seriously believes Zinni is a Jew-hater, so I suspect that he’s simply trying to defend the term “neocon”, which is coming into increasingly bad odor among leftists, conservatives and libertarians alike.\nThe neocons in the press seem to be getting pretty jumpy.  Michael Ledeen just about had an aneurysm\ngoing off on Ron Paul\n, who is the only member of Congress for whom I have any respect regardless of how poorly read he happens to be on Ledeen’s ouvre.  And speaking poor reading comprehension, Ledeen himself ignored the very substantive points that Paul correctly made with regards to the failure of Republicanism.\nIf Ledeen’s strange overreaction is typical, the neocons are also kind of girly.  “His attack… incitements to personal violence.”  Eeek!  It’s a slow week that I don’t get at least one direct threat of something unpleasant.  BFD.  Maybe if Ledeen and the other neocons hit the gym once in a while they wouldn’t wet themselves every time someone said something less than flattering about them.  And perhapsJoel Mowbray wouldn’t feel the need to stand up for them either.\nI mean, I’m from Minnesota.  We have something like eight Jews in the state.  Growing up there, I thought I was ethnic because I’m of English descent with dark brown hair.  Since I have little interest in the media circles, I have no idea who is and who isn’t a Jew except for Jonah Goldberg and Rabbi Boteach.  What I do know, however, is that I like very little of what I hear from the neocons, who seem to use conservative language to defend left-liberal actions and policies.\nJust for the record, I like much of what Joel Mowbray and Michael Ledeen have to say.  They’re not the bad guys.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-05T11:35:00+00:00"
}