{
  "url": "https://voxday.net/2004/01/16/worlds-apar/",
  "scraped_at": "2025-12-13T15:43:49.846856",
  "title": "Worlds apart",
  "date_display": "January 16, 2004",
  "date_iso": "2004-01-16T16:04:00+00:00",
  "date_from_url": "2004-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VDH writes: <em>Anwar Sadat, by his own admission, went to war in 1973 not to liberate outright the Sinai (that was militarily impossible), but to show the Arab world he could surprise — and for three to four days even stun — the Israelis, and thereby restore the wounded “pride” of the Egyptians. We think that the total encirclement of his Third Army was a terrible defeat — saved from abject annihilation by American diplomacy and Soviet threat. Egyptians saw it instead as a source of honor that it even got across the canal.</em></p><p>I have the advantage of being acquainted, to varying degrees, with three distinct non-American cultures.  Thus, it always surprises me when Americans are surprised when people from other cultures do not analyze things as we do.  A victory-obsessed culture such as the United States can barely relate to the blase Europeans, much less a culture excited about the military equivalent of kicking the ball off and tackling the return man.</p><p>Some of my Italian friends were shocked when I told them the day after 9/11 that more than one Arab country was certain to be conquered.  Right or wrong, it was inevitable.  (I don’t have a problem with warring on terrorists; I do have a problem with a) not following the Constitution; b) encroaching on American liberties while simultaneously opening borders; and c) invading countries while ignoring the country responsible for the attack.)  Now, I imagine they’d be surprised when I say that I don’t believe we’re done yet, either.</p><p>It’s important to keep in mind Nazi Germany never attacked us either, and yet we fought them until they were crushed.  Americans are fat, lazy and irresponsible.  But the same determination to win that pervades American culture, that once transformed Jewish accountants and Midwest farmboys into some of the most lethal warriors in history, is still alive and today it applies to fat suburban video gamers and fatherless inner city petty criminals as it once did to their grandfathers.  I am not saying this is a universally good thing; it poses its own dangers as we are led too easily into war and domineering hubris.  But this national trait does not bode well for the enemy within or without.</p><p>Consider this.  The Taliban is fallen.  Saddam Hussein is a captive.  And yet, in all sincerity, many of us – myself included- are not even sure that we’ve accomplished much of anything at all.  No wonder the Arabs think we’re crazy.  By their standards, we are.</p></div>",
  "content_text": "VDH writes:\nAnwar Sadat, by his own admission, went to war in 1973 not to liberate outright the Sinai (that was militarily impossible), but to show the Arab world he could surprise — and for three to four days even stun — the Israelis, and thereby restore the wounded “pride” of the Egyptians. We think that the total encirclement of his Third Army was a terrible defeat — saved from abject annihilation by American diplomacy and Soviet threat. Egyptians saw it instead as a source of honor that it even got across the canal.\nI have the advantage of being acquainted, to varying degrees, with three distinct non-American cultures.  Thus, it always surprises me when Americans are surprised when people from other cultures do not analyze things as we do.  A victory-obsessed culture such as the United States can barely relate to the blase Europeans, much less a culture excited about the military equivalent of kicking the ball off and tackling the return man.\nSome of my Italian friends were shocked when I told them the day after 9/11 that more than one Arab country was certain to be conquered.  Right or wrong, it was inevitable.  (I don’t have a problem with warring on terrorists; I do have a problem with a) not following the Constitution; b) encroaching on American liberties while simultaneously opening borders; and c) invading countries while ignoring the country responsible for the attack.)  Now, I imagine they’d be surprised when I say that I don’t believe we’re done yet, either.\nIt’s important to keep in mind Nazi Germany never attacked us either, and yet we fought them until they were crushed.  Americans are fat, lazy and irresponsible.  But the same determination to win that pervades American culture, that once transformed Jewish accountants and Midwest farmboys into some of the most lethal warriors in history, is still alive and today it applies to fat suburban video gamers and fatherless inner city petty criminals as it once did to their grandfathers.  I am not saying this is a universally good thing; it poses its own dangers as we are led too easily into war and domineering hubris.  But this national trait does not bode well for the enemy within or without.\nConsider this.  The Taliban is fallen.  Saddam Hussein is a captive.  And yet, in all sincerity, many of us – myself included- are not even sure that we’ve accomplished much of anything at all.  No wonder the Arabs think we’re crazy.  By their standards, we are.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-16T16:04:00+00:00"
}