{
  "url": "https://voxday.net/2004/01/29/you-thought-i-was-kidding/",
  "scraped_at": "2025-12-13T15:45:54.882849",
  "title": "You thought I was kidding",
  "date_display": "January 29, 2004",
  "date_iso": "2004-01-29T19:59:00+00:00",
  "date_from_url": "2004-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Heck, I thought I was kidding.</p><p>Mike Potemra of NRO writes: <em>I’M HEARTENED BY CONSERVATIVES… and how they are responding to the Bush NEA announcement. Jonah says that most of the e-mail he’s getting-by something like a three-to-one margin-gives Bush a pass on this issue. This is a very important signal, because it shows a certain maturity of outlook on the part of conservatives: a dogged insistence on focusing on the Big Picture. </em></p><p>It’s not that they’re getting played that amuses me so.  It’s the fact that they think they’re being wise and cunning for their sheeplike acceptance of it.  So, that’s one of the four I predicted in jest.  Maybe Bush will declare Jenna Jameson day soon, and be lauded for it by these leading conservative “intellectuals”.  Or is it “conservative” intellectuals.  At this point, it’s hard to say.</p><p>Conservatives are supporting George Delano increasing the NEA budget by historic levels!   Conservative Republicans, is there ANYTHING that Bush can’t do to lose your support?  Not even if he begins running a gay porn site from the Oval Office?  Not even if he begins dressing as a woman, goes in for breast implants and insists on being addressed as Madam President?   Not even if he pulls a Sinead and tears up the Constitution during his next State of the Union address?  Even if he did all of these things, I’m starting to suspect that some NRO writer would argue that they were nothing more than a clever attempt to marginalize Democrats and build a strong conservative base for the future.</p></div>",
  "content_text": "Heck, I thought I was kidding.\nMike Potemra of NRO writes:\nI’M HEARTENED BY CONSERVATIVES… and how they are responding to the Bush NEA announcement. Jonah says that most of the e-mail he’s getting-by something like a three-to-one margin-gives Bush a pass on this issue. This is a very important signal, because it shows a certain maturity of outlook on the part of conservatives: a dogged insistence on focusing on the Big Picture.\nIt’s not that they’re getting played that amuses me so.  It’s the fact that they think they’re being wise and cunning for their sheeplike acceptance of it.  So, that’s one of the four I predicted in jest.  Maybe Bush will declare Jenna Jameson day soon, and be lauded for it by these leading conservative “intellectuals”.  Or is it “conservative” intellectuals.  At this point, it’s hard to say.\nConservatives are supporting George Delano increasing the NEA budget by historic levels!   Conservative Republicans, is there ANYTHING that Bush can’t do to lose your support?  Not even if he begins running a gay porn site from the Oval Office?  Not even if he begins dressing as a woman, goes in for breast implants and insists on being addressed as Madam President?   Not even if he pulls a Sinead and tears up the Constitution during his next State of the Union address?  Even if he did all of these things, I’m starting to suspect that some NRO writer would argue that they were nothing more than a clever attempt to marginalize Democrats and build a strong conservative base for the future.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-01-29T19:59:00+00:00"
}