{
  "url": "https://voxday.net/2013/09/01/a-bi-blogular-landmark/",
  "scraped_at": "2025-12-14T22:40:42.766911",
  "title": "A bi-blogular landmark",
  "date_display": "September 1, 2013",
  "date_iso": "2013-09-01T09:08:00+00:00",
  "date_from_url": "2013-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In March 2011, I created Alpha Game in order to provide a separate space to discuss intersexual relations, a subject that was of great interest to part of the readership here, and virtually no interest to a larger part of it.  At the time, the monthly VP traffic, measured in Google pageviews, was 387,043.  Things didn’t go quite as I planned; Alpha Game was originally conceived as a group blog, but as often happens, the other bloggers stopped posting in a matter of weeks. After two months of very sporadic posting and wondering whether to simply let it die out or not, I ended up deciding that there was sufficient interest in it to keep it going.</p><p>And, in retrospect, I’m glad I did.  In August, Google reported AG’s monthly traffic to be 387,707 pageviews.  VP’s monthly traffic is now considerably more than that; how much more can be roughly estimated by comparing the open Sitemeter statistics.  (Unlike <a href=\"https://heartiste.wordpress.com/2013/08/30/beta-of-the-month-epic-showdown/\">some bloggers</a> who lock down their stats and repeatedly claim to have considerably more readers than they actually do, I have never seen any point in attempting to pretend I am the prettiest and most popular girl in the room.)  I find it rather encouraging to observe that Alpha Game has not only developed its own community, but is already as well-trafficked as Vox Popoli was at the time of AG’s founding.</p><p>And I find it even more encouraging to see that AG still has considerable ground to cover before it catches up with VP in either regard.  I appreciate the fact that through your visits and your comments here, you have made that possible.  By every statistical standard, there is a remarkable level of engagement here and that is your doing, not mine.</p><p>Of course, it probably helps that Bane isn’t around to scare everyone away anymore.</p><p>From the beginning, I expected that AG would eventually surpass VP, because the human interest in intersexual relations generally exceeds the human interest in nearly everything else combined.  Especially because, in VP terms, everything else quite often happens to be esoteric, controversial, or occasionally, both. The inevitable ascendancy of AG will probably take place when, one of these days, I finally do as some readers have long demanded and finally “write the book”.  And I’m contemplating doing precisely that, although not necessarily in the way anyone would likely imagine.</p><p>But that is for the future, as for now I find myself sufficiently occupied with a certain game, a certain book two in a certain epic fantasy series, and a certain little something called <i>Quantum Mortis</i> that I will explain in due time.</p><table border=\"0\" cellspacing=\"0\" cols=\"1\"><tbody><tr><td align=\"CENTER\" height=\"17\"></td></tr></tbody></table></div>",
  "content_text": "In March 2011, I created Alpha Game in order to provide a separate space to discuss intersexual relations, a subject that was of great interest to part of the readership here, and virtually no interest to a larger part of it.  At the time, the monthly VP traffic, measured in Google pageviews, was 387,043.  Things didn’t go quite as I planned; Alpha Game was originally conceived as a group blog, but as often happens, the other bloggers stopped posting in a matter of weeks. After two months of very sporadic posting and wondering whether to simply let it die out or not, I ended up deciding that there was sufficient interest in it to keep it going.\nAnd, in retrospect, I’m glad I did.  In August, Google reported AG’s monthly traffic to be 387,707 pageviews.  VP’s monthly traffic is now considerably more than that; how much more can be roughly estimated by comparing the open Sitemeter statistics.  (Unlike\nsome bloggers\nwho lock down their stats and repeatedly claim to have considerably more readers than they actually do, I have never seen any point in attempting to pretend I am the prettiest and most popular girl in the room.)  I find it rather encouraging to observe that Alpha Game has not only developed its own community, but is already as well-trafficked as Vox Popoli was at the time of AG’s founding.\nAnd I find it even more encouraging to see that AG still has considerable ground to cover before it catches up with VP in either regard.  I appreciate the fact that through your visits and your comments here, you have made that possible.  By every statistical standard, there is a remarkable level of engagement here and that is your doing, not mine.\nOf course, it probably helps that Bane isn’t around to scare everyone away anymore.\nFrom the beginning, I expected that AG would eventually surpass VP, because the human interest in intersexual relations generally exceeds the human interest in nearly everything else combined.  Especially because, in VP terms, everything else quite often happens to be esoteric, controversial, or occasionally, both. The inevitable ascendancy of AG will probably take place when, one of these days, I finally do as some readers have long demanded and finally “write the book”.  And I’m contemplating doing precisely that, although not necessarily in the way anyone would likely imagine.\nBut that is for the future, as for now I find myself sufficiently occupied with a certain game, a certain book two in a certain epic fantasy series, and a certain little something called\nQuantum Mortis\nthat I will explain in due time.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-01T08:08:00+00:00"
}