{
  "url": "https://voxday.net/2013/09/03/a-cure-for-gay/",
  "scraped_at": "2025-12-14T22:40:59.052633",
  "title": "A cure for gay?",
  "date_display": "September 3, 2013",
  "date_iso": "2013-09-03T17:00:00+00:00",
  "date_from_url": "2013-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would appear that publicly <a href=\"http://americablog.com/2013/09/russian-gay-activist-alexeyev-huge-new-anti-semitic-meltdown-facebook-twitter.html\">taking a certain political position</a> is sufficient to render an internationally famous gay activist the equivalent of a straight white conservative Christian  male in the eyes of the mainstream media, an evil to neither be heard, seen, or spoken of.</p><blockquote class=\"tr_bq\"><p> Russian gay activist Nikolai Alexeyev, who until now was considered<br> Russia’s top lesbian, gay, bisexual and transgender (LGBT) advocate,<br> appears to have ended his political career tonight in a series of<br> anti-Semitic Facebook and Twitter posts that have even his most ardent<br> supporters calling out his ongoing anti-Semitism….</br></br></br></br></p><p>In apparent anger over cancellation of his participation in a<br> conference call hosted by human rights group Human Rights First<br> tomorrow, Alexeyev responded via Twitter and <a href=\"https://www.facebook.com/nikolai.alekseev.5\">Facebook with a slew of hateful anti-Jewish comments</a>, since he is now convinced that “the Jewish mafia” did him in, rather than his own rank prejudice….</br></br></p><p>He had an illustrious career.  And it’s now finished.</p></blockquote><p>Let me see if I have this straight. It is now observably safer for an activist to criticize Vladimir Putin and the KGB than to criticize a non-existent mafia that has no influence with the media. Furthermore, if one’s career is forcibly ended as a result of criticizing something that does not exist and has no influence with the media, that should not be considered evidence that said mafia does, in fact, exist, but rather, as the inevitable karmic consequences of one’s prejudice.</p><p>I find this puzzling. How would the end of the gay activist’s career, such as it is, prove that he is wrong? And what color is the logic in your world?</p></div>",
  "content_text": "It would appear that publicly\ntaking a certain political position\nis sufficient to render an internationally famous gay activist the equivalent of a straight white conservative Christian  male in the eyes of the mainstream media, an evil to neither be heard, seen, or spoken of.\nRussian gay activist Nikolai Alexeyev, who until now was considered\nRussia’s top lesbian, gay, bisexual and transgender (LGBT) advocate,\nappears to have ended his political career tonight in a series of\nanti-Semitic Facebook and Twitter posts that have even his most ardent\nsupporters calling out his ongoing anti-Semitism….\nIn apparent anger over cancellation of his participation in a\nconference call hosted by human rights group Human Rights First\ntomorrow, Alexeyev responded via Twitter and\nFacebook with a slew of hateful anti-Jewish comments\n, since he is now convinced that “the Jewish mafia” did him in, rather than his own rank prejudice….\nHe had an illustrious career.  And it’s now finished.\nLet me see if I have this straight. It is now observably safer for an activist to criticize Vladimir Putin and the KGB than to criticize a non-existent mafia that has no influence with the media. Furthermore, if one’s career is forcibly ended as a result of criticizing something that does not exist and has no influence with the media, that should not be considered evidence that said mafia does, in fact, exist, but rather, as the inevitable karmic consequences of one’s prejudice.\nI find this puzzling. How would the end of the gay activist’s career, such as it is, prove that he is wrong? And what color is the logic in your world?",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-03T16:00:00+00:00"
}