{
  "url": "https://voxday.net/2013/09/24/a-foretaste-of-he/",
  "scraped_at": "2025-12-14T22:43:16.768845",
  "title": "A foretaste of Hell",
  "date_display": "September 24, 2013",
  "date_iso": "2013-09-24T19:31:00+00:00",
  "date_from_url": "2013-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tom Simon <a href=\"http://bondwine.com/2013/09/13/sayers-on-hell/\">draws attention</a> to an important Dorothy Sayers quote:</p><div class=\"entry-content\"><blockquote><p> If we refuse assent to reality: if we rebel against<br> the nature of things and choose to think that what we at the moment want<br> is the centre of the universe to which everything else ought to<br> accommodate itself, the first effect on us will be that the whole<br> universe will seem to be filled with an inexplicable hostility. We shall<br> begin to feel that everything has a down on us, and that, being so<br> badly treated, we have a just grievance against things in general. That<br> is the knowledge of good and evil and the fall into illusion. If we<br> cherish and fondle that grievance, and would rather wallow in it and<br> vent our irritation in spite and malice than humbly admit we are in the<br> wrong and try to amend our behaviour so as to get back to reality, that<br> is, while it lasts, the deliberate choice, and a foretaste of the<br> experience of Hell.</br></br></br></br></br></br></br></br></br></br></br></br></p><div style=\"text-align: right;\"> —Dorothy L. Sayers, <i>Introductory Papers on Dante</i></div></blockquote><p>I leave it to the reader to decide to what sort of all-too-familiar figure Sayers is describing here.</p></div></div>",
  "content_text": "Tom Simon\ndraws attention\nto an important Dorothy Sayers quote:\nIf we refuse assent to reality: if we rebel against\nthe nature of things and choose to think that what we at the moment want\nis the centre of the universe to which everything else ought to\naccommodate itself, the first effect on us will be that the whole\nuniverse will seem to be filled with an inexplicable hostility. We shall\nbegin to feel that everything has a down on us, and that, being so\nbadly treated, we have a just grievance against things in general. That\nis the knowledge of good and evil and the fall into illusion. If we\ncherish and fondle that grievance, and would rather wallow in it and\nvent our irritation in spite and malice than humbly admit we are in the\nwrong and try to amend our behaviour so as to get back to reality, that\nis, while it lasts, the deliberate choice, and a foretaste of the\nexperience of Hell.\n—Dorothy L. Sayers,\nIntroductory Papers on Dante\nI leave it to the reader to decide to what sort of all-too-familiar figure Sayers is describing here.",
  "tags": [
    "anklebiters",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-24T18:31:00+00:00"
}