{
  "url": "https://voxday.net/2013/09/19/a-lesson-in-channe/",
  "scraped_at": "2025-12-14T22:42:45.932801",
  "title": "A lesson in channel",
  "date_display": "September 19, 2013",
  "date_iso": "2013-09-19T14:00:00+00:00",
  "date_from_url": "2013-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ilya Somin doesn’t appear to understand <a href=\"http://www.volokh.com/2013/09/18/amazon-bleg/\">how distribution and retail prices work</a>:</p><blockquote class=\"tr_bq\"><p> This is a request to readers who may have contacts at Amazon, or<br> work there. Amazon recently inexplicably raised the price for the<br> Kindle version of my book <a href=\"http://www.amazon.com/exec/obidos/ASIN/0804786615/thevolocons0d-20/\"><i>Democracy<br> and Political Ignorance</br></i></a> from the initial $15.37 to<br> 20.19, even though (judging by Amazon’s own rankings) the Kindle<br> version was doing well at the initial price. The new price is way<br> too high, relative to the Kindle prices for comparable books. It<br> is in neither Amazon’s interest nor mine to charge a price so high<br> that hardly anyone will buy the Kindle version.</br></br></br></br></br></br></br></p><p>I have tried to contact Amazon about this. But it seems<br> impossible to reach anyone in authority through their website for<br> authors. I suspect that among our intrepid readers there could be<br> some who have contacts at Amazon who may be able to help. All I<br> need is to speak to a person who has the power to lower the price<br> for as little as 10-15 minutes or even just exchange e-mails with<br> him or her. The case for lowering the price is strong enough that<br> it won’t require any more time than that to explain it. However,<br> the issue does need to be addressed relatively quickly because the<br> official publication date for the book is approaching. </br></br></br></br></br></br></br></br></br></p></blockquote><p>I took a look at the book.  The issue is immediately apparent:</p><p>Digital List Price: $27.95 <br> Kindle Price: $20.19<br> Print List Price: $90.00<br>         <br> Somin’s actual problem is that his publisher has set the list price too high.  Amazon has the right to decide whatever discount it wants to set below the list price; if Somin wants the price to the consumer to be around $15, then he should set the price around $17.99.  It’s simply not any of his business what Amazon’s margin is; since Amazon is trying to get their margins up, it should come as no surprise that they are not offering discounts quite as steep as they have historically offered.</br></br></br></br></p><p>And it’s ridiculous for him to complain that Amazon should be decreasing its profit margin while he and his publisher refuse to reduce their own.  If the case for lowering the price is strong, then he should be asking his publisher to lower its price, not expecting Amazon to slash its margins.</p></div>",
  "content_text": "Ilya Somin doesn’t appear to understand\nhow distribution and retail prices work\n:\nThis is a request to readers who may have contacts at Amazon, or\nwork there. Amazon recently inexplicably raised the price for the\nKindle version of my book\nDemocracy\nand Political Ignorance\nfrom the initial $15.37 to\n20.19, even though (judging by Amazon’s own rankings) the Kindle\nversion was doing well at the initial price. The new price is way\ntoo high, relative to the Kindle prices for comparable books. It\nis in neither Amazon’s interest nor mine to charge a price so high\nthat hardly anyone will buy the Kindle version.\nI have tried to contact Amazon about this. But it seems\nimpossible to reach anyone in authority through their website for\nauthors. I suspect that among our intrepid readers there could be\nsome who have contacts at Amazon who may be able to help. All I\nneed is to speak to a person who has the power to lower the price\nfor as little as 10-15 minutes or even just exchange e-mails with\nhim or her. The case for lowering the price is strong enough that\nit won’t require any more time than that to explain it. However,\nthe issue does need to be addressed relatively quickly because the\nofficial publication date for the book is approaching.\nI took a look at the book.  The issue is immediately apparent:\nDigital List Price: $27.95\nKindle Price: $20.19\nPrint List Price: $90.00\nSomin’s actual problem is that his publisher has set the list price too high.  Amazon has the right to decide whatever discount it wants to set below the list price; if Somin wants the price to the consumer to be around $15, then he should set the price around $17.99.  It’s simply not any of his business what Amazon’s margin is; since Amazon is trying to get their margins up, it should come as no surprise that they are not offering discounts quite as steep as they have historically offered.\nAnd it’s ridiculous for him to complain that Amazon should be decreasing its profit margin while he and his publisher refuse to reduce their own.  If the case for lowering the price is strong, then he should be asking his publisher to lower its price, not expecting Amazon to slash its margins.",
  "tags": [
    "books",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-19T13:00:00+00:00"
}