{
  "url": "https://voxday.net/2013/09/06/a-list-of-false-flags_6/",
  "scraped_at": "2025-12-14T22:41:24.212888",
  "title": "A list of false flags",
  "date_display": "September 6, 2013",
  "date_iso": "2013-09-06T20:00:00+00:00",
  "date_from_url": "2013-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zerohedge supplies <a href=\"http://www.zerohedge.com/news/2013-09-05/these-false-flags-were-used-start-war\">a partial list</a>:</p><blockquote class=\"tr_bq\"><p> <b>Winter War</b><br> In  1939 the Red Army shelled Mainila, a Russian town near the<br> Finnish  border. Soviet authorities blamed Finland for the attack and<br> used the  incident as a pretext to start the Winter War four days later.</br></br></br></p><p><b>Kassa attack</b><br> The  Kassa attack in 1941 involved the city of Kassa, today Košice<br> (Slovakia), which was then part of Hungary, being bombed by three<br> unidentified planes of apparently Soviet origin. This attack became the<br> pretext for the government of Hungary to declare war on the Soviet<br> Union.</br></br></br></br></br></p><p><b>Operation Ajax</b><br> The  replacement of Iran’s Anglo-Persian Oil Company with five<br> American oil  companies and the 1953 Iranian coup d’état was the<br> consequence of the  U.S. and British-orchestrated false flag operation,<br> Operation Ajax.  Operation Ajax used political intrigue, propaganda, and<br> agreements with  Qashqai tribal leaders to depose the democratically<br> elected leader of  Iran, Mohammed Mosaddeq. Information regarding the<br> CIA-sponsored coup  d’etat has been <a href=\"http://en.wikipedia.org/wiki/File:NorthwoodsMemorandum.jpg\">largely declassified and is available in the CIA archives</a>.</br></br></br></br></br></br></br></p><p><b>Operation Northwoods</b><br> The planned, but never  executed, 1962 Operation Northwoods plot by<br> the U.S. Department of  Defense for a war with Cuba involved scenarios<br> such as fabricating the  hijacking or shooting down of passenger and<br> military planes, sinking a  U.S. ship in the vicinity of Cuba, burning<br> crops, sinking a boat filled  with Cuban refugees, attacks by alleged<br> Cuban infiltrators inside the  United States, and harassment of U.S.<br> aircraft and shipping and the  destruction of aerial drones by aircraft<br> disguised as Cuban MiGs. These  actions would be blamed on Cuba, and<br> would be a pretext for an invasion  of Cuba and the overthrow of Fidel<br> Castro’s communist government. It was  authored by the Joint Chiefs of<br> Staff, but then rejected by President  John F. Kennedy. The surprise<br> discovery of the documents relating to  Operation Northwoods was a<br> result of the comprehensive search for  records related to the<br> assassination of President John F. Kennedy by the  Assassination Records<br> Review Board in the mid-1990s. Information about  Operation Northwoods<br> was later publicized by James Bamford.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Keep these in<br> mind as you consider the current casus belli being bruited about by<br> Obama and the bi-factional ruling party’s representatives in Congress. <br> The logic they are presenting is really rather impressive when combined<br> with the apparent facts. Because al-Qaida affiliated rebels losing the<br> civil war in Syria mishandled chemical weapons provided by Saudi Arabia,<br> America must act as al-Qaida’s air force and attack the Assad regime.</br></br></br></br></br></br></p><p>How<br> does this make any sense?  My feeling is that the ruling party is going<br> to have to come up with a more emotionally appealing false flag before<br> they can get the votes in Congress.  If I were in charge of designing<br> it, I’d give the Syrian rebels a poison gas missile or three, preferably<br> loaded with Zyklon B, have them launch it at an Israeli kindergarten,<br> then blame it on the Assad regime.</br></br></br></br></br></br></p><p>The fact that it<br> would make absolutely no sense whatsoever for Assad to suddenly attack<br> Jewish children with poison gas reminiscent of The Very Baddest Thing To<br> Happen To Anyone Ever In Human History wouldn’t even slow down the<br> Christian Zionists and Anti-antisemitic White Liberals in their<br> frothing-mad rush to nuke Damascus.</br></br></br></br></br></p><p>There is certainly no shortage of evidence that the situation currently being presented to the public <a href=\"http://www.usnews.com/news/blogs/washington-whispers/2013/09/05/alan-grayson-syria-intelligence-manipulated\">is a false one</a>:</p><p><i>“Rep. Alan Grayson, D-Fla., who is aggressively lobbying against a<br> military strike on Syria, says the Obama administration has manipulated<br> intelligence to push its case for U.S. involvement in the country’s<br> two-year civil war. Grayson made the accusation in an <a href=\"http://www.theatlantic.com/politics/archive/2013/09/the-democratic-congressman-who-thinks-he-can-stop-the-syria-war/279309/\">interview</a> published<br> Wednesday by The Atlantic and offered more detail in a Thursday<br> discussion with U.S. News. He says members of Congress are being given<br> intelligence briefings without any evidence to support administration<br> claims that Syrian leader Bashar Assad ordered the use of chemical<br> weapons.”</br></br></br></br></br></br></br></br></i></p><p>And while it could be more of the usual Middle East bluffoonery, as per Saddam “The Mother of All Battles” Hussein,  there appear to be indications that the Iranians <a href=\"http://dailycaller.com/2013/09/05/iran-threatens-brutal-attacks-on-americans-obama-family-if-us-hits-syria/\">aren’t necessarily going to play according to the rules</a> of the Great Game according to the Great Powers.</p><blockquote class=\"tr_bq\"><p> Alireza Forghani, the former governor of southern Iran’s Kish<br> Province, threw down the gauntlet last week. Forghani is an analyst and<br> strategy specialist in the supreme leader’s camp and closely aligned<br> with Mehdi Taeb, who heads the regime’s Ammar Strategic Base, a radical<br> think thank, and thus speaks with the blessing of the Islamic regime.</br></br></br></br></p><p>“Hopefully Obama will be pigheaded enough to attack Syria, and then<br> we will see the … loss of U.S. interests [through terrorist attacks],”<br> he threatened. “In just 21 hours [after the attack on Syria], a family<br> member of every U.S. minister [department secretary], U.S. ambassadors,<br> U.S. military commanders around the world will be abducted. And then 18<br> hours later, videos of their amputation will be spread [around the<br/> world].”</br></br></br></br></br></p></blockquote><p>I’d be a little more skeptical if it weren’t for the fact that there are as many Iranian agents in the USA as Iran felt like putting in place, thanks to the insane immigration policies.</p></div>",
  "content_text": "Zerohedge supplies\na partial list\n:\nWinter War\nIn  1939 the Red Army shelled Mainila, a Russian town near the\nFinnish  border. Soviet authorities blamed Finland for the attack and\nused the  incident as a pretext to start the Winter War four days later.\nKassa attack\nThe  Kassa attack in 1941 involved the city of Kassa, today Košice\n(Slovakia), which was then part of Hungary, being bombed by three\nunidentified planes of apparently Soviet origin. This attack became the\npretext for the government of Hungary to declare war on the Soviet\nUnion.\nOperation Ajax\nThe  replacement of Iran’s Anglo-Persian Oil Company with five\nAmerican oil  companies and the 1953 Iranian coup d’état was the\nconsequence of the  U.S. and British-orchestrated false flag operation,\nOperation Ajax.  Operation Ajax used political intrigue, propaganda, and\nagreements with  Qashqai tribal leaders to depose the democratically\nelected leader of  Iran, Mohammed Mosaddeq. Information regarding the\nCIA-sponsored coup  d’etat has been\nlargely declassified and is available in the CIA archives\n.\nOperation Northwoods\nThe planned, but never  executed, 1962 Operation Northwoods plot by\nthe U.S. Department of  Defense for a war with Cuba involved scenarios\nsuch as fabricating the  hijacking or shooting down of passenger and\nmilitary planes, sinking a  U.S. ship in the vicinity of Cuba, burning\ncrops, sinking a boat filled  with Cuban refugees, attacks by alleged\nCuban infiltrators inside the  United States, and harassment of U.S.\naircraft and shipping and the  destruction of aerial drones by aircraft\ndisguised as Cuban MiGs. These  actions would be blamed on Cuba, and\nwould be a pretext for an invasion  of Cuba and the overthrow of Fidel\nCastro’s communist government. It was  authored by the Joint Chiefs of\nStaff, but then rejected by President  John F. Kennedy. The surprise\ndiscovery of the documents relating to  Operation Northwoods was a\nresult of the comprehensive search for  records related to the\nassassination of President John F. Kennedy by the  Assassination Records\nReview Board in the mid-1990s. Information about  Operation Northwoods\nwas later publicized by James Bamford.\nKeep these in\nmind as you consider the current casus belli being bruited about by\nObama and the bi-factional ruling party’s representatives in Congress.\nThe logic they are presenting is really rather impressive when combined\nwith the apparent facts. Because al-Qaida affiliated rebels losing the\ncivil war in Syria mishandled chemical weapons provided by Saudi Arabia,\nAmerica must act as al-Qaida’s air force and attack the Assad regime.\nHow\ndoes this make any sense?  My feeling is that the ruling party is going\nto have to come up with a more emotionally appealing false flag before\nthey can get the votes in Congress.  If I were in charge of designing\nit, I’d give the Syrian rebels a poison gas missile or three, preferably\nloaded with Zyklon B, have them launch it at an Israeli kindergarten,\nthen blame it on the Assad regime.\nThe fact that it\nwould make absolutely no sense whatsoever for Assad to suddenly attack\nJewish children with poison gas reminiscent of The Very Baddest Thing To\nHappen To Anyone Ever In Human History wouldn’t even slow down the\nChristian Zionists and Anti-antisemitic White Liberals in their\nfrothing-mad rush to nuke Damascus.\nThere is certainly no shortage of evidence that the situation currently being presented to the public\nis a false one\n:\n“Rep. Alan Grayson, D-Fla., who is aggressively lobbying against a\nmilitary strike on Syria, says the Obama administration has manipulated\nintelligence to push its case for U.S. involvement in the country’s\ntwo-year civil war. Grayson made the accusation in an\ninterview\npublished\nWednesday by The Atlantic and offered more detail in a Thursday\ndiscussion with U.S. News. He says members of Congress are being given\nintelligence briefings without any evidence to support administration\nclaims that Syrian leader Bashar Assad ordered the use of chemical\nweapons.”\nAnd while it could be more of the usual Middle East bluffoonery, as per Saddam “The Mother of All Battles” Hussein,  there appear to be indications that the Iranians\naren’t necessarily going to play according to the rules\nof the Great Game according to the Great Powers.\nAlireza Forghani, the former governor of southern Iran’s Kish\nProvince, threw down the gauntlet last week. Forghani is an analyst and\nstrategy specialist in the supreme leader’s camp and closely aligned\nwith Mehdi Taeb, who heads the regime’s Ammar Strategic Base, a radical\nthink thank, and thus speaks with the blessing of the Islamic regime.\n“Hopefully Obama will be pigheaded enough to attack Syria, and then\nwe will see the … loss of U.S. interests [through terrorist attacks],”\nhe threatened. “In just 21 hours [after the attack on Syria], a family\nmember of every U.S. minister [department secretary], U.S. ambassadors,\nU.S. military commanders around the world will be abducted. And then 18\nhours later, videos of their amputation will be spread [around the\nworld].”\nI’d be a little more skeptical if it weren’t for the fact that there are as many Iranian agents in the USA as Iran felt like putting in place, thanks to the insane immigration policies.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-06T19:00:00+00:00"
}