{
  "url": "https://voxday.net/2013/09/30/a-parody-of-scientody/",
  "scraped_at": "2025-12-14T22:43:53.066084",
  "title": "A parody of scientody",
  "date_display": "September 30, 2013",
  "date_iso": "2013-09-30T05:56:00+00:00",
  "date_from_url": "2013-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://dailycaller.com/2013/09/29/top-mit-scientist-un-climate-report-is-hilariously-flawed/\">“Hilarious incoherence”</a> in the latest IPCC report summary:</p><blockquote class=\"tr_bq\"><p> A top climate scientist from the Massachusetts Institute of Technology lambasted a new report by the UN’s climate bureaucracy that blamed mankind as the main cause of global warming and whitewashed the fact that there has been a hiatus in warming for the last 15 years.</p><p>“I think that the latest IPCC report has truly sunk to level of hilarious incoherence,” Dr. Richard Lindzen told Climate Depot, a global warming skeptic news site. “They are proclaiming increased confidence in their models as the discrepancies between their models and observations increase.”</p></blockquote><p>Real scientists don’t think much of the scientistry that is an obvious parody of scientody. Nor does Nigel Lawson, Chairman of the Global Warming Policy Foundation, as <a href=\"http://www.telegraph.co.uk/earth/environment/climatechange/10340408/Climate-change-this-is-not-science-its-mumbo-jumbo.html\">he declares it to be “mumbo-jumbo”</a>:</p><blockquote class=\"tr_bq\"><p> The Intergovernmental Panel on Climate Change, which published on Friday the<br> first instalment of its latest report, is a deeply discredited organisation.<br> Presenting itself as the voice of science on this important issue, it is a<br> politically motivated pressure group that brings the good name of science<br> into disrepute.</br></br></br></br></p><p>Its previous report, in 2007, was so grotesquely flawed that the leading<br> scientific body in the United States, the InterAcademy Council, decided that<br> an investigation was warranted. The IAC duly reported in 2010, and concluded<br> that there were “significant shortcomings in each major step of [the] IPCC’s<br> assessment process”, and that “significant improvements” were needed. It<br> also chastised the IPCC for claiming to have “high confidence in<br> some statements for which there is little evidence”.</br></br></br></br></br></br></p><p>Since then, little seems to have changed, and the latest report is flawed like<br> its predecessor.</br></p></blockquote></div>",
  "content_text": "“Hilarious incoherence”\nin the latest IPCC report summary:\nA top climate scientist from the Massachusetts Institute of Technology lambasted a new report by the UN’s climate bureaucracy that blamed mankind as the main cause of global warming and whitewashed the fact that there has been a hiatus in warming for the last 15 years.\n“I think that the latest IPCC report has truly sunk to level of hilarious incoherence,” Dr. Richard Lindzen told Climate Depot, a global warming skeptic news site. “They are proclaiming increased confidence in their models as the discrepancies between their models and observations increase.”\nReal scientists don’t think much of the scientistry that is an obvious parody of scientody. Nor does Nigel Lawson, Chairman of the Global Warming Policy Foundation, as\nhe declares it to be “mumbo-jumbo”\n:\nThe Intergovernmental Panel on Climate Change, which published on Friday the\nfirst instalment of its latest report, is a deeply discredited organisation.\nPresenting itself as the voice of science on this important issue, it is a\npolitically motivated pressure group that brings the good name of science\ninto disrepute.\nIts previous report, in 2007, was so grotesquely flawed that the leading\nscientific body in the United States, the InterAcademy Council, decided that\nan investigation was warranted. The IAC duly reported in 2010, and concluded\nthat there were “significant shortcomings in each major step of [the] IPCC’s\nassessment process”, and that “significant improvements” were needed. It\nalso chastised the IPCC for claiming to have “high confidence in\nsome statements for which there is little evidence”.\nSince then, little seems to have changed, and the latest report is flawed like\nits predecessor.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-30T04:56:00+00:00"
}