{
  "url": "https://voxday.net/2013/09/12/adios-gun-grabbing-bastards/",
  "scraped_at": "2025-12-14T22:41:54.305837",
  "title": "Adios, gun-grabbing bastards",
  "date_display": "September 12, 2013",
  "date_iso": "2013-09-12T04:00:00+00:00",
  "date_from_url": "2013-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Two Colorado gun grabbers <a href=\"http://www.nytimes.com/2013/09/11/us/colorado-lawmaker-concedes-defeat-in-recall-over-gun-law.html?hp\">are booted out of office</a> in recall elections:</p><blockquote class=\"tr_bq\"><p> Two Colorado Democrats who provided crucial support for a slate of tough new gun-control laws were voted out of office on Tuesday in a recall vote widely seen as a test of popular support for gun restrictions after mass shootings in a Colorado movie theater and a Connecticut elementary school.</p><p>The election, which came five months after the United States Senate defeated several<br> gun restrictions, handed another loss to gun-control supporters. It<br> also gave moderate lawmakers across the country a warning about the<br> political risks of voting for tougher gun laws.</br></br></br></p><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> The recall elections ousted two Democratic state senators, John Morse<br> and Angela Giron, and replaced them with Republicans. Both defeats were<br> painful for Democrats – Mr. Morse’s because he had been Senate<br> president, and Ms. Giron’s because she represented a heavily Democratic,<br> working-class slice of southern Colorado.</br></br></br></br></div></blockquote><p>Molon labe, motherfuckers. Every politician who even THINKS about voting for a gun control law, no matter how “reasonable” should be booted out of office. Then tried for treason.</p><p>And note that in a two-page article, the New York Times neglected to mention the actual vote totals, probably because they weren’t all that close.  The Senate president Morse lost 51 to 49 percent and Giron was defeated 56 to 44 percent.</p><div style=\"text-align: center;\"> MOLON LABE</div></div>",
  "content_text": "Two Colorado gun grabbers\nare booted out of office\nin recall elections:\nTwo Colorado Democrats who provided crucial support for a slate of tough new gun-control laws were voted out of office on Tuesday in a recall vote widely seen as a test of popular support for gun restrictions after mass shootings in a Colorado movie theater and a Connecticut elementary school.\nThe election, which came five months after the United States Senate defeated several\ngun restrictions, handed another loss to gun-control supporters. It\nalso gave moderate lawmakers across the country a warning about the\npolitical risks of voting for tougher gun laws.\nThe recall elections ousted two Democratic state senators, John Morse\nand Angela Giron, and replaced them with Republicans. Both defeats were\npainful for Democrats – Mr. Morse’s because he had been Senate\npresident, and Ms. Giron’s because she represented a heavily Democratic,\nworking-class slice of southern Colorado.\nMolon labe, motherfuckers. Every politician who even THINKS about voting for a gun control law, no matter how “reasonable” should be booted out of office. Then tried for treason.\nAnd note that in a two-page article, the New York Times neglected to mention the actual vote totals, probably because they weren’t all that close.  The Senate president Morse lost 51 to 49 percent and Giron was defeated 56 to 44 percent.\nMOLON LABE",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-12T03:00:00+00:00"
}