{
  "url": "https://voxday.net/2013/09/08/again/",
  "scraped_at": "2025-12-14T22:41:31.486186",
  "title": "Again?",
  "date_display": "September 8, 2013",
  "date_iso": "2013-09-08T08:26:00+00:00",
  "date_from_url": "2013-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama’s proposed Syrian adventure is turning out to be, as some suspected, yet <a href=\"http://www.thenation.com/blog/176040/obamas-syria-war-really-about-iran-and-israel#axzz2eFYXl9MD\">another war on behalf of Israel</a>:</p><blockquote class=\"tr_bq\"><p> The dirty little not-so-secret behind President Obama’s much-lobbied-for, illegal and strategically incompetent war against Syria is that it’s not about Syria at all. It’s about Iran—and Israel. And it has been from the start.</p><p>By “the start,” I mean 2011, when the Obama administration gradually became convinced that it could deal Iran a mortal blow by toppling President Bashar al-Assad of Syria, a secular, Baathist strongman who is, despite all, an ally of Iran’s. Since then, taking Iran down a peg has been the driving force behind Obama’s Syria policy.</p><p>Not coincidentally, the White House plans to scare members of Congress into supporting the ill-conceived war plan by waving the Iranian flag in their faces. Even liberal Democrats, some of whom are opposing or questioning war with Syria, blanch at the prospect of opposing Obama and the Israel lobby over Iran.</p></blockquote><p>In light of the overwhelming public opposition to any military attacks on Syria, it looks as if we’ll soon find out if Congress is truly Israeli-occupied territory or not.  At some point, I hope more reasonable Jews will point out to their elite counterparts that being seen to have ruined the US monetary system and attempting to turn the US military into the world’s largest mercenary force is really not “good for the Jews”.</p><p>Watching the elite Jews go about methodically overplaying their hand in the United States strikes me rather like reading the Bible and reaching the part where the Israelites go whoring after pagan gods again despite getting their posteriors very soundly and violently smacked as God allows the Assyrians or whoever to invade them and slaughter their armies. You find yourself thinking<i>: again</i>? Seriously, you’re going to do this again? What is wrong with you?</p><p>It’s not that I don’t understand the temptation. Israel’s leaders quite reasonably see this as a win-no lose situation. If the great military power defeats Syria on Israel’s behalf, Iran is weakened and Israel wins. If it screws up and loses, then Israel isn’t any worse off than it was… in military terms.</p><p>But what they’re failing to enter into the equation is that American tolerance for being used in this manner is going to run out eventually.  The Jews have already worn out their welcome in Western Europe and Russia. (Seriously, the level of anti-semitism I have observed from the UK to Eastern Europe is off the charts by US standards and that’s not even counting the Muslims.) Neither China nor Japan appear to be susceptible to their patented form of influence-peddling. And yet, many elite Jews appear to be determined to treat their safe haven of America with all the care and respect that a wildcat mining company with 25-year mineral rights to national parkland treats the environment.</p></div>",
  "content_text": "Obama’s proposed Syrian adventure is turning out to be, as some suspected, yet\nanother war on behalf of Israel\n:\nThe dirty little not-so-secret behind President Obama’s much-lobbied-for, illegal and strategically incompetent war against Syria is that it’s not about Syria at all. It’s about Iran—and Israel. And it has been from the start.\nBy “the start,” I mean 2011, when the Obama administration gradually became convinced that it could deal Iran a mortal blow by toppling President Bashar al-Assad of Syria, a secular, Baathist strongman who is, despite all, an ally of Iran’s. Since then, taking Iran down a peg has been the driving force behind Obama’s Syria policy.\nNot coincidentally, the White House plans to scare members of Congress into supporting the ill-conceived war plan by waving the Iranian flag in their faces. Even liberal Democrats, some of whom are opposing or questioning war with Syria, blanch at the prospect of opposing Obama and the Israel lobby over Iran.\nIn light of the overwhelming public opposition to any military attacks on Syria, it looks as if we’ll soon find out if Congress is truly Israeli-occupied territory or not.  At some point, I hope more reasonable Jews will point out to their elite counterparts that being seen to have ruined the US monetary system and attempting to turn the US military into the world’s largest mercenary force is really not “good for the Jews”.\nWatching the elite Jews go about methodically overplaying their hand in the United States strikes me rather like reading the Bible and reaching the part where the Israelites go whoring after pagan gods again despite getting their posteriors very soundly and violently smacked as God allows the Assyrians or whoever to invade them and slaughter their armies. You find yourself thinking\n: again\n? Seriously, you’re going to do this again? What is wrong with you?\nIt’s not that I don’t understand the temptation. Israel’s leaders quite reasonably see this as a win-no lose situation. If the great military power defeats Syria on Israel’s behalf, Iran is weakened and Israel wins. If it screws up and loses, then Israel isn’t any worse off than it was… in military terms.\nBut what they’re failing to enter into the equation is that American tolerance for being used in this manner is going to run out eventually.  The Jews have already worn out their welcome in Western Europe and Russia. (Seriously, the level of anti-semitism I have observed from the UK to Eastern Europe is off the charts by US standards and that’s not even counting the Muslims.) Neither China nor Japan appear to be susceptible to their patented form of influence-peddling. And yet, many elite Jews appear to be determined to treat their safe haven of America with all the care and respect that a wildcat mining company with 25-year mineral rights to national parkland treats the environment.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-08T07:26:00+00:00"
}