{
  "url": "https://voxday.net/2013/09/21/always-fight-back/",
  "scraped_at": "2025-12-14T22:43:00.671872",
  "title": "Always fight back",
  "date_display": "September 21, 2013",
  "date_iso": "2013-09-21T21:00:00+00:00",
  "date_from_url": "2013-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Badger considers <a href=\"http://badgerhut.wordpress.com/2013/09/16/deploying-bjj-against-schoolyard-bullying/\">two means of addressing bullies</a>:</p><blockquote class=\"tr_bq\"><p> I was in elementary school when the educational ministers began<br> preaching that fighting back against bullies was not to be tolerated. It<br> was insisted that responsive violence only begat more violence and that<br> the way to stop bullying was to “not respond” and to “demand the bully<br> respect you,” or some horseshit like this. This went along with a bunch<br> of programming about creating an “inclusive environment” and a bunch of<br> other malarkey that imagined if we could all listen to <a href=\"http://theredpillroom.blogspot.com/2012/10/free-to-be-man.html\">“Free To Be You And Me”</a> together nobody would get picked on when we went out for recess.</br></br></br></br></br></br></p><p>To this day, I want to know what they were smoking. These folks spent<br> their entire adult careers allegedly studying the social behavior of<br> young children and yet never realized that “Lord of the Flies” was a lot<br> more than a fictional fantasy novella. They went about fighting<br> bullying in exactly the wrong way – by criminalizing the physical<br> aspects rather than disincentivizing the psychological aspects of<br> bullying, they ensured the “negotiating” between bully and victim took<br> place in the psychosocial realm where the bully had already secured an<br> advantage, and imposed a moral equivalence that shamed victim for daring<br> to fight back. The establishment seems to want to think of bullies as<br> the fat stupid kid who has no other way than his fists to express<br> himself (a la Moe from Calvin &amp; Hobbes), however the bullies I dealt<br> with had great social savvy and were able to bamboozle the teachers<br> into believing they were the victim instead of me. Thus, any one-on-one<br> verbal discussions that were supposed to “resolve conflict” were simply<br> an extension of the bullying process – just as, for example, a<br> negotiation with a corrupt businessman is itself structurally corrupted….</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The frame I’ve come to believe in with regard to bullying is that,<br> yes, a bully is trying to exploit a power differential, and that the<br> faster you demonstrate strength to close the differential, the more<br> quickly the bully will leave you alone and find someone else to<br> victimize (if the demonstration of strength wasn’t enough to humiliate<br> them entirely). Generally speaking, that means you’re going to have to<br> get physical at the middle or high school level. Once you’ve shown<br> you’re not going to be fucked with, the spell of dominance is broken and<br> the bully no longer sees you as someone to victimize.</br></br></br></br></br></br></br></br></p></blockquote><p>As the smallest and smartest kid in my grade most years, I had to put up with a fair amount of bullying from first through eighth grade. My first pair of glasses were broken on the playground by getting punched off my face; I got in a shot or two but was whipped pretty conclusively by a kid nearly twice my size. I was a good athlete, so as I reached junior high age, I was protected to a certain extent by my teammates, but I still had to deal with the occasional hallway attack as well as the incessant shoving and verbal threats. The other thing that helped was my ready willingness to stand up for myself; in both seventh and eighth grade I accepted challenges from bigger guys more than capable of beating me up and “went outside”; on both occasions, the other boy decided it wasn’t worth the risk of losing once we were out there with the usual circle of boys and girls around us.</p><p>But the low-grade stuff didn’t stop until I broke one boy’s ribs after he shoved me into a locker, and smashed another boy’s face into the floor when he tried to tackle me.  After that, only one kid, a persistent troublemaker, was ever a problem, and he gave up after he saw me go through the open window of a moving bus to break the nose of a kid from another school who tried to spit at me. After that, he wouldn’t even try to pick on other kids in front of me since I made it clear that I was more than ready to pay him back for cracking one of my ribs after soccer practice one year.</p><p>Ender has had to deal with some attempted tormentors over the years, but no one even tries to mess with him anymore, not since he put down the star of the soccer club and the kid’s best friend at the same time when they tried to play dominance games with him. Of course, he’s been doing judo for years and he plays outside defender with a controlled fury that his coach and all the other dads appreciate, so even the biggest kids are openly respectful despite him being the weird smart kid.</p><p>Badger is right. Negotiation and seeking to understand bullies is irrelevant or even counterproductive. There is only one answer: hit back and hit back harder.  I’m not saying you shouldn’t turn the other cheek, I’m saying you can’t choose to turn the other cheek if violence is not even an option. I forgo retaliation on the soccer field on a regular basis. But it’s my choice to do so, it’s not a necessary consequence of either cowardice or an inability to respond.</p></div>",
  "content_text": "Badger considers\ntwo means of addressing bullies\n:\nI was in elementary school when the educational ministers began\npreaching that fighting back against bullies was not to be tolerated. It\nwas insisted that responsive violence only begat more violence and that\nthe way to stop bullying was to “not respond” and to “demand the bully\nrespect you,” or some horseshit like this. This went along with a bunch\nof programming about creating an “inclusive environment” and a bunch of\nother malarkey that imagined if we could all listen to\n“Free To Be You And Me”\ntogether nobody would get picked on when we went out for recess.\nTo this day, I want to know what they were smoking. These folks spent\ntheir entire adult careers allegedly studying the social behavior of\nyoung children and yet never realized that “Lord of the Flies” was a lot\nmore than a fictional fantasy novella. They went about fighting\nbullying in exactly the wrong way – by criminalizing the physical\naspects rather than disincentivizing the psychological aspects of\nbullying, they ensured the “negotiating” between bully and victim took\nplace in the psychosocial realm where the bully had already secured an\nadvantage, and imposed a moral equivalence that shamed victim for daring\nto fight back. The establishment seems to want to think of bullies as\nthe fat stupid kid who has no other way than his fists to express\nhimself (a la Moe from Calvin & Hobbes), however the bullies I dealt\nwith had great social savvy and were able to bamboozle the teachers\ninto believing they were the victim instead of me. Thus, any one-on-one\nverbal discussions that were supposed to “resolve conflict” were simply\nan extension of the bullying process – just as, for example, a\nnegotiation with a corrupt businessman is itself structurally corrupted….\nThe frame I’ve come to believe in with regard to bullying is that,\nyes, a bully is trying to exploit a power differential, and that the\nfaster you demonstrate strength to close the differential, the more\nquickly the bully will leave you alone and find someone else to\nvictimize (if the demonstration of strength wasn’t enough to humiliate\nthem entirely). Generally speaking, that means you’re going to have to\nget physical at the middle or high school level. Once you’ve shown\nyou’re not going to be fucked with, the spell of dominance is broken and\nthe bully no longer sees you as someone to victimize.\nAs the smallest and smartest kid in my grade most years, I had to put up with a fair amount of bullying from first through eighth grade. My first pair of glasses were broken on the playground by getting punched off my face; I got in a shot or two but was whipped pretty conclusively by a kid nearly twice my size. I was a good athlete, so as I reached junior high age, I was protected to a certain extent by my teammates, but I still had to deal with the occasional hallway attack as well as the incessant shoving and verbal threats. The other thing that helped was my ready willingness to stand up for myself; in both seventh and eighth grade I accepted challenges from bigger guys more than capable of beating me up and “went outside”; on both occasions, the other boy decided it wasn’t worth the risk of losing once we were out there with the usual circle of boys and girls around us.\nBut the low-grade stuff didn’t stop until I broke one boy’s ribs after he shoved me into a locker, and smashed another boy’s face into the floor when he tried to tackle me.  After that, only one kid, a persistent troublemaker, was ever a problem, and he gave up after he saw me go through the open window of a moving bus to break the nose of a kid from another school who tried to spit at me. After that, he wouldn’t even try to pick on other kids in front of me since I made it clear that I was more than ready to pay him back for cracking one of my ribs after soccer practice one year.\nEnder has had to deal with some attempted tormentors over the years, but no one even tries to mess with him anymore, not since he put down the star of the soccer club and the kid’s best friend at the same time when they tried to play dominance games with him. Of course, he’s been doing judo for years and he plays outside defender with a controlled fury that his coach and all the other dads appreciate, so even the biggest kids are openly respectful despite him being the weird smart kid.\nBadger is right. Negotiation and seeking to understand bullies is irrelevant or even counterproductive. There is only one answer: hit back and hit back harder.  I’m not saying you shouldn’t turn the other cheek, I’m saying you can’t choose to turn the other cheek if violence is not even an option. I forgo retaliation on the soccer field on a regular basis. But it’s my choice to do so, it’s not a necessary consequence of either cowardice or an inability to respond.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-21T20:00:00+00:00"
}