{
  "url": "https://voxday.net/2013/09/26/an-astonishing-coincidence/",
  "scraped_at": "2025-12-14T22:43:31.500440",
  "title": "An astonishing coincidence",
  "date_display": "September 26, 2013",
  "date_iso": "2013-09-26T17:09:00+00:00",
  "date_from_url": "2013-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s still so easy. Golf Pro, aka Tad, mocks the idea that Minnesotans have anything to worry about from the Somali jihadists in Minnesota:</p><blockquote class=\"tr_bq\"><p> I’m positive that comparing Minneapolis to Kenya is a bad idea. They<br> aren’t really the same place, same culture, same institutions, same<br> history. Really, there is no similarity. The good folks in Minneapolis<br> have nothing to worry about.</br></br></br></p></blockquote><p>Meanwhile, back on Planet Reason, the Mall of America <a href=\"http://www.twincities.com/news/ci_24171301/mall-america-tightens-security\">has jacked up its security measures</a>. For, we can assume, no particular reason at all.</p><p><i>BLOOMINGTON, Minn.—The Mall of<br> America has stepped up security after the deadly attack by the Somali<br> militant group al-Shabab at a mall in Nairobi, Kenya. </br></br></i><i>Officials at the Bloomington mall say some of the extra security<br> precautions will be noticeable and some won’t. Millions of people visit<br> the mall and its 500 stores each year. Mall of America says the safety<br> of its guests, tenants and employees is top priority. Minnesota is home to the largest Somali community in the United<br> States. At least 22 young men have traveled to Somalia since 2007 to<br> join al-Shabaab and the FBI says its investigation of the terror group’s<br> recruiting remains a priority. </br></br></br></br></br></br></i></p></div>",
  "content_text": "It’s still so easy. Golf Pro, aka Tad, mocks the idea that Minnesotans have anything to worry about from the Somali jihadists in Minnesota:\nI’m positive that comparing Minneapolis to Kenya is a bad idea. They\naren’t really the same place, same culture, same institutions, same\nhistory. Really, there is no similarity. The good folks in Minneapolis\nhave nothing to worry about.\nMeanwhile, back on Planet Reason, the Mall of America\nhas jacked up its security measures\n. For, we can assume, no particular reason at all.\nBLOOMINGTON, Minn.—The Mall of\nAmerica has stepped up security after the deadly attack by the Somali\nmilitant group al-Shabab at a mall in Nairobi, Kenya.\nOfficials at the Bloomington mall say some of the extra security\nprecautions will be noticeable and some won’t. Millions of people visit\nthe mall and its 500 stores each year. Mall of America says the safety\nof its guests, tenants and employees is top priority. Minnesota is home to the largest Somali community in the United\nStates. At least 22 young men have traveled to Somalia since 2007 to\njoin al-Shabaab and the FBI says its investigation of the terror group’s\nrecruiting remains a priority.",
  "tags": [
    "anklebiters",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-26T16:09:00+00:00"
}