{
  "url": "https://voxday.net/2013/09/10/book-review-tales-of-new-america-ii/",
  "scraped_at": "2025-12-14T22:41:47.295898",
  "title": "Book Review: Tales of a New America II",
  "date_display": "September 10, 2013",
  "date_iso": "2013-09-10T17:00:00+00:00",
  "date_from_url": "2013-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>DL provides a second look at Gunther Roosevelt’s <b><a href=\"http://www.amazon.com/Tales-of-New-America-ebook/dp/B00DGJ5EFI/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;sr=8-1&amp;qid=1378373967\">Tales of a New America</a></b>:</i></p><p>Tales of New America by Gunther Roosevelt is a<br> collection of short stories/vignettes set in a post-economic collapse<br> America where too many decades of an expanded welfare state and cultural<br> decline have taken it’s toll. The stories contain several recurring<br> characters, but they’re not intended to follow the stories of a set<br> group of individuals, but rather to communicate the process of the<br> transition from the USA to the NAR, or New American Republic. For me,<br> this fast paced style, and my own interest in the subject, made<br> compelling reading and I finished the book in short order.</br></br></br></br></br></br></br></br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://ecx.images-amazon.com/images/I/81D+wIyRjfL._SL1500_.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://ecx.images-amazon.com/images/I/81D+wIyRjfL._SL1500_.jpg\" width=\"201\"/></a></div><div> The book is set far enough in the future to avoid the<br> conflict that will arise when the government can’t pay for all of the<br> post-retirement benefits it’s promised to employees. As a resident of<br> Illinois, this is something that is of great concern to me. I work in<br> the private sector, but I wonder what the reaction will be from all of<br> those public employees who have not saved for their own retirement will<br> be when their employer can’t make good on promises made during boom<br> times.</br></br></br></br></br></br></br></div><div></div><p>I couldn’t help but compare this to another<br> post-collapse novel I’d recently read, <i>Flashback</i>, by Dan Simmons, an<br> excellent book by the author of Hyperion. <i>Tales of New America</i> charts<br> out what I would consider to be an absolute best case scenario for the<br> collapse of Progressive American Culture and the start of a new<br> culture–a culture aware that the previous culture was suicidal. <i><br> Flashback </br></i>on the other hand charts a much more pessimistic, and I’m<br> afraid to say, realistic scenario.</br></br></br></br></br></br></p><div> “Tales” charts the fall of the old and birth of the new<br> by a rich industrialist who is tired of dealing with the regulation<br> involved in the oil business. His circumvention of the law, and the lack<br> of reaction from the clapped-out regulatory agencies gets the ball<br> rolling. Others follow his lead by “going Galt” and the NAR is<br> established. It was quite easy to imagine this scenario based upon the<br> quite common concept of Diminished Responsibility that’s so common<br> amongst government workers.</br></br></br></br></br></br></br></div><div> Themes of the US Government in free fall are common, with<br> a good sense of “the body’s dead, but the head doesn’t know it yet”,<br> The old bureaucracies are established, nominally running, but they’re<br> running on fumes, only still moving at all because the personnel<br> involved are doing their work as part of a routine and not much else.</br></br></br></br></div><div></div><p>Scenarios of non-NAR citizens becoming aware of<br> untenable nature of how they lived in the past, and lessons being<br> learned are common, but not to the detriment of the story.</br></br></p><p>Some<br> of the things that touched me the most were the way this novel handled<br> race relations. It pointed out my own preconceived notions that in many<br> cases I didn’t know I had. My own life involved growing up in a tough<br> part of the south side of Chicago, followed by a move to a working class<br> suburb. My subsequent life has been a career in IT, and because of my<br> hard work I’ve always been able to live in areas that were safe, stable,<br> and less than vibrant. Virtually all of my contact with Vibrant<br> Americans has been work related, and positive. If I didn’t still live in<br> the Chicago area, with constant reminders of the dangers of vibrant<br> culture, my knee jerk reaction to this novels take on race relations<br> would have been “Racism!!”, but I was able to remember that this was a<br> novel, and within the confines of this novel and our current culture,<br> what was portrayed was understandable. I’m also familiar with the<br> concepts, which I first encountered in Peter F. Hamilton’s <i>Night’s Dawn<br> </br></i>trilogy when he introduced the concept of “Ethnic Streaming” for<br> off-world colonies.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><div> I did have some issues with the novel. It appeared to me<br> that every personality connected with the NAR was beyond temptation and<br> bribery–something I know never to be the case when human beings are<br> involved. As the NAR conquest of the west coast moved forward, there<br> were no major setbacks, no huge obstacles, and at every turn NAR<br> technology provided an almost magical advantage. The concept of “no<br> battle plan survives contact with the enemy” just never reared it’s ugly<br> head. All the NAR forces were good, incorruptible Boy Scouts, and the<br> enemy were simply rabble propped up to be knocked down. A semi-competent<br> enemy would have been nice.</br></br></br></br></br></br></br></br></br></div><div> Some of the characters stories were left to wither and<br> die, some went on in too much detail for my taste. A good editor might<br> have been helpful in this and other areas.</br></br></div><p>Overall, I<br> enjoyed the book, and it was compelling enough for me that I pretty much<br> read it straight through. Using the Amazon scale, I’d give it 3 stars.<br> I’d certainly be willing to give something by this author a try in the<br/> future. If you’re going to read this, I’d also recommend picking up <i><br/> Flashback </i>to compare and contrast life in Post-Obama America.</br></br></br></p></div>",
  "content_text": "DL provides a second look at Gunther Roosevelt’s\nTales of a New America\n:\nTales of New America by Gunther Roosevelt is a\ncollection of short stories/vignettes set in a post-economic collapse\nAmerica where too many decades of an expanded welfare state and cultural\ndecline have taken it’s toll. The stories contain several recurring\ncharacters, but they’re not intended to follow the stories of a set\ngroup of individuals, but rather to communicate the process of the\ntransition from the USA to the NAR, or New American Republic. For me,\nthis fast paced style, and my own interest in the subject, made\ncompelling reading and I finished the book in short order.\nThe book is set far enough in the future to avoid the\nconflict that will arise when the government can’t pay for all of the\npost-retirement benefits it’s promised to employees. As a resident of\nIllinois, this is something that is of great concern to me. I work in\nthe private sector, but I wonder what the reaction will be from all of\nthose public employees who have not saved for their own retirement will\nbe when their employer can’t make good on promises made during boom\ntimes.\nI couldn’t help but compare this to another\npost-collapse novel I’d recently read,\nFlashback\n, by Dan Simmons, an\nexcellent book by the author of Hyperion.\nTales of New America\ncharts\nout what I would consider to be an absolute best case scenario for the\ncollapse of Progressive American Culture and the start of a new\nculture–a culture aware that the previous culture was suicidal.\nFlashback\non the other hand charts a much more pessimistic, and I’m\nafraid to say, realistic scenario.\n“Tales” charts the fall of the old and birth of the new\nby a rich industrialist who is tired of dealing with the regulation\ninvolved in the oil business. His circumvention of the law, and the lack\nof reaction from the clapped-out regulatory agencies gets the ball\nrolling. Others follow his lead by “going Galt” and the NAR is\nestablished. It was quite easy to imagine this scenario based upon the\nquite common concept of Diminished Responsibility that’s so common\namongst government workers.\nThemes of the US Government in free fall are common, with\na good sense of “the body’s dead, but the head doesn’t know it yet”,\nThe old bureaucracies are established, nominally running, but they’re\nrunning on fumes, only still moving at all because the personnel\ninvolved are doing their work as part of a routine and not much else.\nScenarios of non-NAR citizens becoming aware of\nuntenable nature of how they lived in the past, and lessons being\nlearned are common, but not to the detriment of the story.\nSome\nof the things that touched me the most were the way this novel handled\nrace relations. It pointed out my own preconceived notions that in many\ncases I didn’t know I had. My own life involved growing up in a tough\npart of the south side of Chicago, followed by a move to a working class\nsuburb. My subsequent life has been a career in IT, and because of my\nhard work I’ve always been able to live in areas that were safe, stable,\nand less than vibrant. Virtually all of my contact with Vibrant\nAmericans has been work related, and positive. If I didn’t still live in\nthe Chicago area, with constant reminders of the dangers of vibrant\nculture, my knee jerk reaction to this novels take on race relations\nwould have been “Racism!!”, but I was able to remember that this was a\nnovel, and within the confines of this novel and our current culture,\nwhat was portrayed was understandable. I’m also familiar with the\nconcepts, which I first encountered in Peter F. Hamilton’s\nNight’s Dawn\ntrilogy when he introduced the concept of “Ethnic Streaming” for\noff-world colonies.\nI did have some issues with the novel. It appeared to me\nthat every personality connected with the NAR was beyond temptation and\nbribery–something I know never to be the case when human beings are\ninvolved. As the NAR conquest of the west coast moved forward, there\nwere no major setbacks, no huge obstacles, and at every turn NAR\ntechnology provided an almost magical advantage. The concept of “no\nbattle plan survives contact with the enemy” just never reared it’s ugly\nhead. All the NAR forces were good, incorruptible Boy Scouts, and the\nenemy were simply rabble propped up to be knocked down. A semi-competent\nenemy would have been nice.\nSome of the characters stories were left to wither and\ndie, some went on in too much detail for my taste. A good editor might\nhave been helpful in this and other areas.\nOverall, I\nenjoyed the book, and it was compelling enough for me that I pretty much\nread it straight through. Using the Amazon scale, I’d give it 3 stars.\nI’d certainly be willing to give something by this author a try in the\nfuture. If you’re going to read this, I’d also recommend picking up\nFlashback\nto compare and contrast life in Post-Obama America.",
  "tags": [
    "Book Review",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-10T16:00:00+00:00"
}