{
  "url": "https://voxday.net/2013/09/10/breivik-sets-political-trend/",
  "scraped_at": "2025-12-14T22:41:48.785647",
  "title": "Breivik sets the political trend",
  "date_display": "September 10, 2013",
  "date_iso": "2013-09-10T20:00:00+00:00",
  "date_from_url": "2013-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I believe <a href=\"http://www.nytimes.com/reuters/2013/09/10/world/europe/10reuters-norway-election.html?hp\">these election results confirm </a>I won my debate with a certain skeptical Finn concerning the electoral implications of the mass shooting of the Norwegian Labor Party’s larval quislings:</p><blockquote class=\"tr_bq\"><p> An anti-immigrant populist party laid claim to a major role in oil-rich<br> Norway’s government for the first time on Tuesday after a center-right<br> alliance won a landslide general election victory to oust a Labour<br> administration.        The Progress party, which once had among its members Anders Behring<br> Breivik, who killed 77 people in 2011 in a gun and bomb attack targeting<br> Labour, came third in Monday’s poll, giving it a kingmaker role in<br> coalition building.</br></br></br></br></br></br></p></blockquote><p>Breivik wasn’t a madman. He simply put into action on what many Norwegians were thinking and his murderous actions were a warning sign of what was to come if the current program of mass immigration was maintained.</p><p>The Norwegian people have turned against mass immigration precisely because they do not want more Breiviks. Nationalist resistance against invasion is inevitable; even the French were moved to it subsequent to their conquest and occupation by Nazi Germany. The only question, the only choice, is if resistance comes within the political process or outside of it.</p><p>And when that resistance is deemed out of bounds and forcibly expelled from the political process, it is not eliminated. It simply resorts to more extreme measures. If you want more violence, more Breiviks, even open civil war, then continue to support mass immigration, multiculturalism, and desegregation. If you want ethnic peace, you will have to oppose those things.</p><p>Both the Australian and the Norwegian people appear to be moving in the direction of peace. The American people, on the other hand, appear to be doing the precise opposite. As I said not long after the shootings, I will not be in the least bit surprised if Anders Breivik is one day regarded as a national hero in Norway, much like George Washington and William Tell, two men who also offered murderous resistance to their own governments.</p></div>",
  "content_text": "I believe\nthese election results confirm\nI won my debate with a certain skeptical Finn concerning the electoral implications of the mass shooting of the Norwegian Labor Party’s larval quislings:\nAn anti-immigrant populist party laid claim to a major role in oil-rich\nNorway’s government for the first time on Tuesday after a center-right\nalliance won a landslide general election victory to oust a Labour\nadministration.        The Progress party, which once had among its members Anders Behring\nBreivik, who killed 77 people in 2011 in a gun and bomb attack targeting\nLabour, came third in Monday’s poll, giving it a kingmaker role in\ncoalition building.\nBreivik wasn’t a madman. He simply put into action on what many Norwegians were thinking and his murderous actions were a warning sign of what was to come if the current program of mass immigration was maintained.\nThe Norwegian people have turned against mass immigration precisely because they do not want more Breiviks. Nationalist resistance against invasion is inevitable; even the French were moved to it subsequent to their conquest and occupation by Nazi Germany. The only question, the only choice, is if resistance comes within the political process or outside of it.\nAnd when that resistance is deemed out of bounds and forcibly expelled from the political process, it is not eliminated. It simply resorts to more extreme measures. If you want more violence, more Breiviks, even open civil war, then continue to support mass immigration, multiculturalism, and desegregation. If you want ethnic peace, you will have to oppose those things.\nBoth the Australian and the Norwegian people appear to be moving in the direction of peace. The American people, on the other hand, appear to be doing the precise opposite. As I said not long after the shootings, I will not be in the least bit surprised if Anders Breivik is one day regarded as a national hero in Norway, much like George Washington and William Tell, two men who also offered murderous resistance to their own governments.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-10T19:00:00+00:00"
}