{
  "url": "https://voxday.net/2013/09/02/correia-on-moral-imperative-of-public/",
  "scraped_at": "2025-12-14T22:40:48.366063",
  "title": "Correia on the moral imperative of public school attendance",
  "date_display": "September 2, 2013",
  "date_iso": "2013-09-02T08:43:00+00:00",
  "date_from_url": "2013-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which <a href=\"http://larrycorreia.wordpress.com/2013/08/30/fisking-slate-over-public-schools/\">he responds</a> to the much-discussed Slate article concerning it being evil <a href=\"http://www.slate.com/articles/double_x/doublex/2013/08/private_school_vs_public_school_only_bad_people_send_their_kids_to_private.html\">to send children to private school</a>:</p><blockquote class=\"tr_bq\"><p> <i>If You Send Your Kid to Private School, You Are a Bad Person</i><br> <i>A Manifesto</i></br></p><p><b>No kidding. It is actually subtitled “A Manifesto”. We’re off to a great start. </b></p><p><i>By Allison Benedikt</i><br> <i>You are a bad person if you send your children to private school. Not bad like murderer bad—</i></br></p><p><b>Wait… Are we talking actual bad murderer bad, or murderers that<br> liberals have the hots for bad, like Che Guevara? Or murderers that<br> liberals don’t like to own up to like Kermit Gosnell bad? Because you<br> know, liberals are into nuance and stuff. </br></br></br></b></p><p><i>but bad like ruining-one-of-our-nation’s-most-essential-institutions-in-order-to-get-what’s-best-for-your-kid bad. </i></p><p><b>So using a lot of unnecessary hyphens bad. </b></p><p><i>So, pretty bad.</i></p><p><b>Apparently. But please, Allison, educate us poor knuckle draggers<br> why we should put the future of failing liberal institutions based on<br> outdated philosophies dating back to the industrial revolution over the<br> welfare of our children. </br></br></br></b></p><p><i>I am not an education policy wonk: I’m just judgmental. </i></p><p><b>Well you’re a liberal, so that goes without saying. </b></p><p><i>But it seems to me that if every single parent sent every single child to public school, public schools would improve. </i></p><p><b>And I can’t wait to hear how you figured this part out. Especially<br> since everybody is always whining about overcrowded classrooms, so when<br> a kid gets pulled out and sent to private school, you just freed up<br> more public school resources, and *gasp* the parent paying for private<br> school is still paying taxes which pay for the dumpy public school… but<br> hey, I’m getting ahead of myself. </br></br></br></br></br></b></p><p><i>This would not happen immediately. It could take generations. Your<br> children and grandchildren might get mediocre educations in the<br> meantime, but it will be worth it, for the eventual common good. </br></br></i></p><p><b>Wait… Let me get this right… I need to needlessly screw up my<br> children and grandchildren’s chances in the hope that maybe, just maybe,<br> our shitty public schools might be decent in forty or fifty years. And<br> this is the high note she picked to open her essay with. Holy shit. </br></br></br></b></p></blockquote><p>I have to admit, I find it a bit difficult to get worked up over something this obviously stupid.  In addition to the fact that argumentum ad sensum is so logically fallacious that it isn’t even listed as a formal logical fallacy because so few people are dumb enough to try making it, there is a fundamental flaw in the idea that increased patronage will improve a failing product.</p><p>Think about it.  When a restaurant’s food or service is sub-par, does expanding the size of its clientele tend to improve either or make them worse? When a retail store doesn’t have anything people want to buy, does an increase in customers tend to improve what is found on offer? When a government is corrupt and awful, does its governance tend to improve with the number of citizens over which it holds authority?</p><p>We can readily observe that the opposite is reliably true.  Therefore, by her own dubious measure, the moral imperative of improving the quality of the public schools, we can only conclude that it is evil to send one’s child to a public school.  In fact, since positive change tends to be inspired by people abandoning an institution and thereby forcing the institution to respond, there is a moral imperative for parents to improve the public schools by taking their children out of them.</p><p>It’s a pretty hapless argument when, by one’s own self-selected metric, one somehow manages to make the case for the exact opposite.  While the article may be little more than Slate attempting to troll the sane public for linkbait, remember that there are no shortage of white progressives who genuinely believe what this woman is writing.</p><p>However, while I very much disagree with the idea that private school attendance is evil, I will say that it is suboptimal. Private school is still subject to the group education speed limit on learning, and while there is more accountability than with public schools, the parent is still putting primary responsibility for the child’s education into the hands of strangers. Homeschooling offers more of the positive benefits of private education while being subject to none of the disadvantages.</p></div>",
  "content_text": "In which\nhe responds\nto the much-discussed Slate article concerning it being evil\nto send children to private school\n:\nIf You Send Your Kid to Private School, You Are a Bad Person\nA Manifesto\nNo kidding. It is actually subtitled “A Manifesto”. We’re off to a great start.\nBy Allison Benedikt\nYou are a bad person if you send your children to private school. Not bad like murderer bad—\nWait… Are we talking actual bad murderer bad, or murderers that\nliberals have the hots for bad, like Che Guevara? Or murderers that\nliberals don’t like to own up to like Kermit Gosnell bad? Because you\nknow, liberals are into nuance and stuff.\nbut bad like ruining-one-of-our-nation’s-most-essential-institutions-in-order-to-get-what’s-best-for-your-kid bad.\nSo using a lot of unnecessary hyphens bad.\nSo, pretty bad.\nApparently. But please, Allison, educate us poor knuckle draggers\nwhy we should put the future of failing liberal institutions based on\noutdated philosophies dating back to the industrial revolution over the\nwelfare of our children.\nI am not an education policy wonk: I’m just judgmental.\nWell you’re a liberal, so that goes without saying.\nBut it seems to me that if every single parent sent every single child to public school, public schools would improve.\nAnd I can’t wait to hear how you figured this part out. Especially\nsince everybody is always whining about overcrowded classrooms, so when\na kid gets pulled out and sent to private school, you just freed up\nmore public school resources, and *gasp* the parent paying for private\nschool is still paying taxes which pay for the dumpy public school… but\nhey, I’m getting ahead of myself.\nThis would not happen immediately. It could take generations. Your\nchildren and grandchildren might get mediocre educations in the\nmeantime, but it will be worth it, for the eventual common good.\nWait… Let me get this right… I need to needlessly screw up my\nchildren and grandchildren’s chances in the hope that maybe, just maybe,\nour shitty public schools might be decent in forty or fifty years. And\nthis is the high note she picked to open her essay with. Holy shit.\nI have to admit, I find it a bit difficult to get worked up over something this obviously stupid.  In addition to the fact that argumentum ad sensum is so logically fallacious that it isn’t even listed as a formal logical fallacy because so few people are dumb enough to try making it, there is a fundamental flaw in the idea that increased patronage will improve a failing product.\nThink about it.  When a restaurant’s food or service is sub-par, does expanding the size of its clientele tend to improve either or make them worse? When a retail store doesn’t have anything people want to buy, does an increase in customers tend to improve what is found on offer? When a government is corrupt and awful, does its governance tend to improve with the number of citizens over which it holds authority?\nWe can readily observe that the opposite is reliably true.  Therefore, by her own dubious measure, the moral imperative of improving the quality of the public schools, we can only conclude that it is evil to send one’s child to a public school.  In fact, since positive change tends to be inspired by people abandoning an institution and thereby forcing the institution to respond, there is a moral imperative for parents to improve the public schools by taking their children out of them.\nIt’s a pretty hapless argument when, by one’s own self-selected metric, one somehow manages to make the case for the exact opposite.  While the article may be little more than Slate attempting to troll the sane public for linkbait, remember that there are no shortage of white progressives who genuinely believe what this woman is writing.\nHowever, while I very much disagree with the idea that private school attendance is evil, I will say that it is suboptimal. Private school is still subject to the group education speed limit on learning, and while there is more accountability than with public schools, the parent is still putting primary responsibility for the child’s education into the hands of strangers. Homeschooling offers more of the positive benefits of private education while being subject to none of the disadvantages.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-02T07:43:00+00:00"
}