{
  "url": "https://voxday.net/2013/09/25/discernment-and-sexual-perspectives/",
  "scraped_at": "2025-12-14T22:43:24.159025",
  "title": "Discernment and sexual perspectives",
  "date_display": "September 25, 2013",
  "date_iso": "2013-09-25T20:00:00+00:00",
  "date_from_url": "2013-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is really an Alpha Game subject and I generally prefer to keep such things separate, but the concept has sufficiently broad implications that I thought it might be worth mentioning over here:</p><blockquote class=\"tr_bq\"><p> Think about the amount of discernment that is required for work in a<br> caring or nurturing capacity. Discernment is actually a negative; the<br> good doctor is not influenced by the personal merits of the person he is<br> treating. The good mother does not shower love and attention upon the<br> duly obedient child and withhold it from the unruly and disobedient one.<br> The feminine perspective, insofar as it is formed by maternal<br> responsibilities and nurturing instincts, is therefore intrinsically<br> anti-discernment.</br></br></br></br></br></br></br></p></blockquote><p> Read the rest <a href=\"http://alphagameplan.blogspot.com/2013/09/discernment-and-sexes.html\">at Alpha Game</a>.</p></div>",
  "content_text": "This is really an Alpha Game subject and I generally prefer to keep such things separate, but the concept has sufficiently broad implications that I thought it might be worth mentioning over here:\nThink about the amount of discernment that is required for work in a\ncaring or nurturing capacity. Discernment is actually a negative; the\ngood doctor is not influenced by the personal merits of the person he is\ntreating. The good mother does not shower love and attention upon the\nduly obedient child and withhold it from the unruly and disobedient one.\nThe feminine perspective, insofar as it is formed by maternal\nresponsibilities and nurturing instincts, is therefore intrinsically\nanti-discernment.\nRead the rest\nat Alpha Game\n.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-25T19:00:00+00:00"
}