{
  "url": "https://voxday.net/2013/09/09/dissent-and-godless-lef/",
  "scraped_at": "2025-12-14T22:41:36.987128",
  "title": "Dissent and the godless Left",
  "date_display": "September 9, 2013",
  "date_iso": "2013-09-09T08:07:00+00:00",
  "date_from_url": "2013-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dissent and disagreement with dogma are two things the godless <a href=\"http://skepchick.org/2013/09/my-time-with-richard-dawkins-or-why-you-should-never-meet-your-idols/\">simply will not tolerate</a>:</p><blockquote class=\"tr_bq\"><p> At this time (September of 2011), Dave Silverman was heading up the Reason Rally Committee. There was still quite a bit of planning and promotion that needed to be done, so Dave asked Richard, Elizabeth, and Sean to make videos to promote the Reason Rally. (The video Richard ended up making is still viewable.) Richard was standing behind the podium, and he asked Dave something along the lines of, “What exactly is the Reason Rally?” Dave started explaining it, and as he did, someone who was waiting in the line outside opened the door to peek inside and we could all hear a lot of noise. I rushed up the aisle and made frantic “shut the door” gestures at the people peeking inside, and they did. As I walked the ten feet back, I couldn’t hear everything Dave was saying, but I heard the name “Rebecca Watson.” Richard suddenly had a very angry look on his face and I heard him almost shout, “No, absolutely not! If she’s going to be there, I won’t be there. I don’t want her speaking.” and then Dave immediately replied, “You’re absolutely right, we’ll take her off the roster. It’s done.” Richard huffed for a moment, Dave continued to placate him, and then he made the video.</p><p>I was crushed. I couldn’t believe it. Richard Dawkins was my hero. I looked up to him as a beacon of truth and reason in a world of irrationality. I couldn’t believe he would act this way toward Rebecca. Before I left for the tour, I truly, honestly thought that the whole “Elevatorgate” thing was a miscommunication, and if someone (and I was willing to be that someone) would sit down with Dawkins, they could explain to him why it’s uncomfortable to be propositioned in an elevator by a stranger, and then Dawkins could apologize for the whole thing and everyone could move on. I really just thought it was just ignorance, not malice, that caused Dawkins to act that way.</p><p>I think it says a lot about the atheist movement, that a famous speaker can use his position in order to keep someone else off the lineup, and the movement willingly obliges…. I spent two years working for the atheist movement (or to borrow Ashley Paramore‘s term, Big Atheism). I saw a lot of things that made me disappointed in a movement that claims it is dedicated to truth and critical inquiry. I made a lot of excuses for supporting things that I ordinarily wouldn’t have, claiming it all was for the greater good– for the movement, but also for the world.</p></blockquote><p>PZ’s response is downright funny; to understand why, you have to keep in mind that he publicly <a href=\"http://freethoughtblogs.com/pharyngula/2012/05/24/there-is-no-blacklist/\">declared this back in 2012</a>: “For instance, <b>I will not participate in any conference in which Abbie Smith is a speaker</b>. If I’m invited, and later discover that she is also invited, I will politely turn down the offer.”</p><p>But now that the atheist feminists are lined up against Dawkins, PZ <a href=\"http://freethoughtblogs.com/pharyngula/2013/09/05/time-to-make-a-promise/\">has changed his tune</a> and claims he will only attempt to impose a speaker’s veto on conferences that are a) insufficiently vibrant, b) lack a sexual harassment policy, or c) “treats attendees poorly”, in his opinion.  Now, PZ has a perfect right to attend, or not attend, any conference he likes for any reason, but this public posturing is simply ludicrous.</p><p>To his credit, PZ admits that there is no qualitative difference<br> between his position towards Ms Smith and Dawkins position towards Ms<br> Watson and he has abandoned the former. However, he still doesn’t grasp that if it is wrong for Richard Dawkins to use his influence to impose his personal preferences, whatever they might be, then it is wrong for PZ and the SFWA’s pinkshirts to do the same.  This applies to policies and speaker lists as well as people. Of course, few atheists have ever been terribly sound on logic or the concept of universally applied standards.</br></br></p></div>",
  "content_text": "Dissent and disagreement with dogma are two things the godless\nsimply will not tolerate\n:\nAt this time (September of 2011), Dave Silverman was heading up the Reason Rally Committee. There was still quite a bit of planning and promotion that needed to be done, so Dave asked Richard, Elizabeth, and Sean to make videos to promote the Reason Rally. (The video Richard ended up making is still viewable.) Richard was standing behind the podium, and he asked Dave something along the lines of, “What exactly is the Reason Rally?” Dave started explaining it, and as he did, someone who was waiting in the line outside opened the door to peek inside and we could all hear a lot of noise. I rushed up the aisle and made frantic “shut the door” gestures at the people peeking inside, and they did. As I walked the ten feet back, I couldn’t hear everything Dave was saying, but I heard the name “Rebecca Watson.” Richard suddenly had a very angry look on his face and I heard him almost shout, “No, absolutely not! If she’s going to be there, I won’t be there. I don’t want her speaking.” and then Dave immediately replied, “You’re absolutely right, we’ll take her off the roster. It’s done.” Richard huffed for a moment, Dave continued to placate him, and then he made the video.\nI was crushed. I couldn’t believe it. Richard Dawkins was my hero. I looked up to him as a beacon of truth and reason in a world of irrationality. I couldn’t believe he would act this way toward Rebecca. Before I left for the tour, I truly, honestly thought that the whole “Elevatorgate” thing was a miscommunication, and if someone (and I was willing to be that someone) would sit down with Dawkins, they could explain to him why it’s uncomfortable to be propositioned in an elevator by a stranger, and then Dawkins could apologize for the whole thing and everyone could move on. I really just thought it was just ignorance, not malice, that caused Dawkins to act that way.\nI think it says a lot about the atheist movement, that a famous speaker can use his position in order to keep someone else off the lineup, and the movement willingly obliges…. I spent two years working for the atheist movement (or to borrow Ashley Paramore‘s term, Big Atheism). I saw a lot of things that made me disappointed in a movement that claims it is dedicated to truth and critical inquiry. I made a lot of excuses for supporting things that I ordinarily wouldn’t have, claiming it all was for the greater good– for the movement, but also for the world.\nPZ’s response is downright funny; to understand why, you have to keep in mind that he publicly\ndeclared this back in 2012\n: “For instance,\nI will not participate in any conference in which Abbie Smith is a speaker\n. If I’m invited, and later discover that she is also invited, I will politely turn down the offer.”\nBut now that the atheist feminists are lined up against Dawkins, PZ\nhas changed his tune\nand claims he will only attempt to impose a speaker’s veto on conferences that are a) insufficiently vibrant, b) lack a sexual harassment policy, or c) “treats attendees poorly”, in his opinion.  Now, PZ has a perfect right to attend, or not attend, any conference he likes for any reason, but this public posturing is simply ludicrous.\nTo his credit, PZ admits that there is no qualitative difference\nbetween his position towards Ms Smith and Dawkins position towards Ms\nWatson and he has abandoned the former. However, he still doesn’t grasp that if it is wrong for Richard Dawkins to use his influence to impose his personal preferences, whatever they might be, then it is wrong for PZ and the SFWA’s pinkshirts to do the same.  This applies to policies and speaker lists as well as people. Of course, few atheists have ever been terribly sound on logic or the concept of universally applied standards.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-09T07:07:00+00:00"
}