{
  "url": "https://voxday.net/2013/09/14/diversity-and-collapse/",
  "scraped_at": "2025-12-14T22:42:10.699228",
  "title": "Diversity and collapse",
  "date_display": "September 14, 2013",
  "date_iso": "2013-09-14T14:41:00+00:00",
  "date_from_url": "2013-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Most people who have paid any attention to the financial crisis know the Bush administration’s pathological fixation on expanding homeownership among Hispanics played a contributing role in blowing the housing bubble, but I didn’t realize that diversity dogma also played a part in the collapse of Lehman Bros. Steve Sailer quotes from <i><a href=\"http://davidsn.com/drupalnew/files/A%20Colossal%20Failure%20of%20Common%20Sense%20The%20Inside%20Story%20of%20the%20Collapse%20of%20Lehman%20Brothers.pdf\">A Colossal Failure of Common Sense</a></i>, a book by an ex-Lehman executive, describing how<a href=\"http://isteve.blogspot.com/2013/09/lehman-brothers-5.html\"> the president of Lehman was more interested in diversity</a> and inclusion than in risk management.</p><blockquote class=\"tr_bq\"><p> One of these was our corporate president, Joe Gregory, the right-hand<br> man of the reclusive CEO, Dick Fuld. … But Joe Gregory was a regular,<br> run-of-the-mill, ho-hum financial sycophant, devoted to his master,<br> Richard Fuld, … Joe’s fixation was a subject called diversity. He was<br> consumed with it. His aim was the mission of inclusion. He had an entire<br> department devoted to it, headed up by a managing director. Great<br> rallies were staged in New York’s auditoriums, with free cocktails and<br> hors d’oeuvres served for up to six hundred people, all listening to Joe<br> or one of his henchmen pontificating. “Inclusion! That must be our<br> aim!” he would yell, as if we were running a friggin’ prayer meeting.<br> … Which was all very well, but down in the trenches, where a trader<br>  might sweat blood to make a couple of million dollars, most of us were a<br> bit tetchy about Joe Gregory going off and spending it on a cocktail<br> party for six hundred people..</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>… Especially when it emerged that the top dog in diversity was earning<br> well over $2 million a year and that the diversity division had a<br> bigger budget and more people than risk management!</br></br></p><p>Joe’s mission for diversity drove [Christine Daley, head of<br> distressed-debt research] mad. She had no time for any of it, but Joe<br> Gregory had us all over a barrel: he had major control over our bonus<br> compensation, and he made it clear there would be extra money for those<br> who rallied to his cause. Most of us did not care about the cause, but<br> the prospect of this thirty-first-floor sycophant lopping a couple of<br> hundred thousand off our annual check because we weren’t in there<br> pitching for the cause of the day was seriously irritating. Harsher<br> judges than I considered Joe hid behind his unusual fixation,<br> appearing to fight the world’s woes while staying well clear of the<br> gundeck.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>As go corporations, so go nations. The ongoing fixation of the USA’s politicians and body politic on diversity and inclusion means that the country is unlikely to sustain itself any more successfully than Lehman Bros. did.</p></div>",
  "content_text": "Most people who have paid any attention to the financial crisis know the Bush administration’s pathological fixation on expanding homeownership among Hispanics played a contributing role in blowing the housing bubble, but I didn’t realize that diversity dogma also played a part in the collapse of Lehman Bros. Steve Sailer quotes from\nA Colossal Failure of Common Sense\n, a book by an ex-Lehman executive, describing how\nthe president of Lehman was more interested in diversity\nand inclusion than in risk management.\nOne of these was our corporate president, Joe Gregory, the right-hand\nman of the reclusive CEO, Dick Fuld. … But Joe Gregory was a regular,\nrun-of-the-mill, ho-hum financial sycophant, devoted to his master,\nRichard Fuld, … Joe’s fixation was a subject called diversity. He was\nconsumed with it. His aim was the mission of inclusion. He had an entire\ndepartment devoted to it, headed up by a managing director. Great\nrallies were staged in New York’s auditoriums, with free cocktails and\nhors d’oeuvres served for up to six hundred people, all listening to Joe\nor one of his henchmen pontificating. “Inclusion! That must be our\naim!” he would yell, as if we were running a friggin’ prayer meeting.\n… Which was all very well, but down in the trenches, where a trader\nmight sweat blood to make a couple of million dollars, most of us were a\nbit tetchy about Joe Gregory going off and spending it on a cocktail\nparty for six hundred people..\n… Especially when it emerged that the top dog in diversity was earning\nwell over $2 million a year and that the diversity division had a\nbigger budget and more people than risk management!\nJoe’s mission for diversity drove [Christine Daley, head of\ndistressed-debt research] mad. She had no time for any of it, but Joe\nGregory had us all over a barrel: he had major control over our bonus\ncompensation, and he made it clear there would be extra money for those\nwho rallied to his cause. Most of us did not care about the cause, but\nthe prospect of this thirty-first-floor sycophant lopping a couple of\nhundred thousand off our annual check because we weren’t in there\npitching for the cause of the day was seriously irritating. Harsher\njudges than I considered Joe hid behind his unusual fixation,\nappearing to fight the world’s woes while staying well clear of the\ngundeck.\nAs go corporations, so go nations. The ongoing fixation of the USA’s politicians and body politic on diversity and inclusion means that the country is unlikely to sustain itself any more successfully than Lehman Bros. did.",
  "tags": [
    "corpocracy",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-14T13:41:00+00:00"
}