{
  "url": "https://voxday.net/2013/09/08/dumbing-it-down-and-calling-it-success/",
  "scraped_at": "2025-12-14T22:41:33.314234",
  "title": "Dumbing it down and calling it success",
  "date_display": "September 8, 2013",
  "date_iso": "2013-09-08T13:30:00+00:00",
  "date_from_url": "2013-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Prediction: having embraced the <a href=\"http://www.nytimes.com/2013/09/08/education/harvard-case-study-gender-equity.html?hp&amp;_r=0\">“success is defined by female participation”</a> metric, Harvard Business School will lose its elevated cachet within a decade:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> Of all the ceremonies and receptions during graduation week, the most<br> venerated was the George F. Baker Scholar Luncheon, for the top 5<br> percent of the class, held in a sunny dining room crowded with parents<br> who looked alternately thrilled and intimidated by what their offspring<br> had achieved. </br></br></br></br></div><div itemprop=\"articleBody\"></div><div class=\"nytmm-ss-target graphic-performance-gap\"><div class=\"freeform medium left\"></div></div><div itemprop=\"articleBody\"> In recent years, the glory of the luncheon had been dimmed by discomfort<br> at the low number of female honorees. But this year, almost 40 percent<br> of the Baker scholars were women. It was a remarkable rise that no one<br> could precisely explain. Had the professors rid themselves of<br> unconscious biases? Were the women performing better because of the<br> improved environment? Or was the faculty easing up in grading women<br> because they knew the desired outcome? </br></br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> “To my head, all three happened,” Professor Piskorski said. But Mr.<br> Nohria said he had no cause to think the professors had used the new<br> software, and the subjective participation scores, to avoid gender gaps.<br> “Sunshine is the best disinfectant,” he said, a phrase that he said had<br> guided him throughout his project.</br></br></br></br></div></blockquote><p>Consider how fast the question of “is college worth it” has rapidly followed the rise of women with college degrees. Credentialists never understand that pieces of paper are only indicative of an ability to sit in class and follow orders and that no amount of degrees will ever be an adequate substitute for intellectual horsepower, curiosity, and testosterone-fueled risk-taking.</p><p>The primary female psychological objective is risk-reduction.  This is why societies with too much female influence rapidly become not only static, but anti-dynamic, and rapidly begin to decline. It’s also why an amount of female influence is a societal survival trait.</p></div>",
  "content_text": "Prediction: having embraced the\n“success is defined by female participation”\nmetric, Harvard Business School will lose its elevated cachet within a decade:\nOf all the ceremonies and receptions during graduation week, the most\nvenerated was the George F. Baker Scholar Luncheon, for the top 5\npercent of the class, held in a sunny dining room crowded with parents\nwho looked alternately thrilled and intimidated by what their offspring\nhad achieved.\nIn recent years, the glory of the luncheon had been dimmed by discomfort\nat the low number of female honorees. But this year, almost 40 percent\nof the Baker scholars were women. It was a remarkable rise that no one\ncould precisely explain. Had the professors rid themselves of\nunconscious biases? Were the women performing better because of the\nimproved environment? Or was the faculty easing up in grading women\nbecause they knew the desired outcome?\n“To my head, all three happened,” Professor Piskorski said. But Mr.\nNohria said he had no cause to think the professors had used the new\nsoftware, and the subjective participation scores, to avoid gender gaps.\n“Sunshine is the best disinfectant,” he said, a phrase that he said had\nguided him throughout his project.\nConsider how fast the question of “is college worth it” has rapidly followed the rise of women with college degrees. Credentialists never understand that pieces of paper are only indicative of an ability to sit in class and follow orders and that no amount of degrees will ever be an adequate substitute for intellectual horsepower, curiosity, and testosterone-fueled risk-taking.\nThe primary female psychological objective is risk-reduction.  This is why societies with too much female influence rapidly become not only static, but anti-dynamic, and rapidly begin to decline. It’s also why an amount of female influence is a societal survival trait.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-08T12:30:00+00:00"
}