{
  "url": "https://voxday.net/2013/09/29/fascist-anti-fascists/",
  "scraped_at": "2025-12-14T22:43:47.872291",
  "title": "Fascist “anti-fascists”",
  "date_display": "September 29, 2013",
  "date_iso": "2013-09-29T11:43:00+00:00",
  "date_from_url": "2013-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The government has taken several steps toward open civil war in Greece by <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/greece/10341146/Greece-arrests-Golden-Dawn-leader-in-crackdown-on-far-right.html\">attempting to criminalize the political opposition</a>:</p><blockquote class=\"tr_bq\"><p> Nikos Michaloliakos, 56, was arrested on Saturday morning on charges of<br> founding a criminal organisation, with arrest warrants issued for dozens<br> more party members and lawmakers, officials said.  The arrest of Michaloliakos, along with 13 other party members including<br> spokesman Ilias Kasidiaris, comes as part of a wider crackdown on the<br> far-right group following the murder of anti-fascist rapper Pavlos Fyssas by<br> an alleged Golden Dawn member, which sparked riots across the country.</br></br></br></br></br></p><p>Pavlos Fyssas – known by his stage name of Killah P – was stabbed to death in<br> an Athens commuter town on September 17, triggering violent anti-fascist<br> protests across the country.</br></br></p><p>At least 10,000 people demonstrated in Athens on Wednesday in a protest<br> organised by left-wing political parties and unions. Golden Dawn has denied it had anything to do with the killing, but he was<br> stabbed to death by a self-proclaimed supporter.</br></br></p></blockquote><p>The so-called “anti-fascist” protests are tiny compared to the general strike with which the Greeks have been protesting the government. To put it in perspective, this is as if Bill Clinton and twelve Congressional Republicans were arrested because Tupac’s killer was a self-proclaimed Democrat.</p><p>Both the Egyptian and the Greek governments are making the mistake of forcing their populist political opposition to turn to violence. The popularity of Golden Dawn and the Muslim Brotherhood are only going to increase as a result of this shamelessly political stunt, especially in contrast with openly anti-democratic governments that are shamelessly robbing the people on behalf of the IMF, the EU, and other globalist institutions.</p><p>The irony is that the Eurofascists are attacking their critics as fascists while operating in an observably fascist manner in cooperation with the international corporate megabanks. Meanwhile, in Italy, <a href=\"http://www.theguardian.com/world/2013/sep/28/italy-berlusconi-withdraws-ministers-coalition\">the resignation of Berlusconi’s alllies</a> appear to have brought the Letta government down and made it likely that the anti-Euro Movimento 5 Stelle will soon come to power.</p><blockquote class=\"tr_bq\"><p> All five ministers from <a href=\"http://www.blogger.com/null\" title=\"More from guardian.co.uk on Silvio Berlusconi\">Silvio Berlusconi</a>‘s centre-right party said on Saturday night they were resigning from <a href=\"http://www.blogger.com/null\" title=\"More from guardian.co.uk on Italy\">Italy</a>‘s<br> grand coalition government in a dramatic move that plunged the country<br> back into political uncertainty and raised the possibility of fresh<br> elections.</br></br></br></p></blockquote><p>Note that Berlusconi’s action was the direct and predictable consequence of prosecutorial actions directed against him by his political foes.</p></div>",
  "content_text": "The government has taken several steps toward open civil war in Greece by\nattempting to criminalize the political opposition\n:\nNikos Michaloliakos, 56, was arrested on Saturday morning on charges of\nfounding a criminal organisation, with arrest warrants issued for dozens\nmore party members and lawmakers, officials said.  The arrest of Michaloliakos, along with 13 other party members including\nspokesman Ilias Kasidiaris, comes as part of a wider crackdown on the\nfar-right group following the murder of anti-fascist rapper Pavlos Fyssas by\nan alleged Golden Dawn member, which sparked riots across the country.\nPavlos Fyssas – known by his stage name of Killah P – was stabbed to death in\nan Athens commuter town on September 17, triggering violent anti-fascist\nprotests across the country.\nAt least 10,000 people demonstrated in Athens on Wednesday in a protest\norganised by left-wing political parties and unions. Golden Dawn has denied it had anything to do with the killing, but he was\nstabbed to death by a self-proclaimed supporter.\nThe so-called “anti-fascist” protests are tiny compared to the general strike with which the Greeks have been protesting the government. To put it in perspective, this is as if Bill Clinton and twelve Congressional Republicans were arrested because Tupac’s killer was a self-proclaimed Democrat.\nBoth the Egyptian and the Greek governments are making the mistake of forcing their populist political opposition to turn to violence. The popularity of Golden Dawn and the Muslim Brotherhood are only going to increase as a result of this shamelessly political stunt, especially in contrast with openly anti-democratic governments that are shamelessly robbing the people on behalf of the IMF, the EU, and other globalist institutions.\nThe irony is that the Eurofascists are attacking their critics as fascists while operating in an observably fascist manner in cooperation with the international corporate megabanks. Meanwhile, in Italy,\nthe resignation of Berlusconi’s alllies\nappear to have brought the Letta government down and made it likely that the anti-Euro Movimento 5 Stelle will soon come to power.\nAll five ministers from\nSilvio Berlusconi\n‘s centre-right party said on Saturday night they were resigning from\nItaly\n‘s\ngrand coalition government in a dramatic move that plunged the country\nback into political uncertainty and raised the possibility of fresh\nelections.\nNote that Berlusconi’s action was the direct and predictable consequence of prosecutorial actions directed against him by his political foes.",
  "tags": [
    "EU",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-29T10:43:00+00:00"
}