{
  "url": "https://voxday.net/2013/09/02/fun-with-atheists-2/",
  "scraped_at": "2025-12-14T22:40:50.193497",
  "title": "Fun with atheists",
  "date_display": "September 2, 2013",
  "date_iso": "2013-09-02T13:00:00+00:00",
  "date_from_url": "2013-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is amusing for several reasons, particularly the way in which the atheist clearly has no sense of the extent to which he is overreacting.  Barry posted the following review of TIA <a href=\"http://www.goodreads.com/review/show/562692083\">on GoodReads</a>:</p><blockquote class=\"tr_bq\"><div> <i><a class=\"staticStars stars_5\" href=\"http://www.blogger.com/null\" title=\"it was amazing\">“5 of 5 stars</a></i></div><p><i><br> Very good, provided logical and philosophical arguments<br> against atheism rather than the general apologetics which rely on<br> historical records and such.” </br></br></br></i></p><p>That’s it. Positive, descriptive, and succinct.  And it inspired the following response from an atheist named abc.</p><p><i>“well i tend to disagree i didnt find it logical,it was more lying by<br> omission and selective use of imformation with no acknowledgement of the<br> contrast.”</br></br></i></p><p>To which Barry, quite reasonably, responded:<br> <i> </i><br> <i>“Really, what parts do you think were actually ‘lying by omission?  Or<br> did you actually read the book.  I have heard this over and over from<br> evangelical atheists.  What was misrepresented?  What was lying?  I<br> think this is just a drive by posting.”</br></br></br></i></br></br></p><p>Thereby inspiring the following response, which is so over-the-top it almost sounds more like an agnostic with a sense of humor trolling Goodreads than the usual socially autistic atheist.<i>  </i>Especially the bit about the burger.  But whether it is real or not, it is funny.</p><p><i>“Do not label.You have no right what so ever to label people,no<br> bullying.None what so ever.Do you know what ‘evangelist’ means?’A person<br> who seeks to convert other people to christian faith,especially by preaching’ (source:wikipedia) And what is an atheist:someone who doesn’t<br> believe in existence of god.Now an evangelist in his nature can’t be an<br> atheist and an atheist not a christian.it’s like saying ‘a guilty<br> innocent’.Now that having been said i’ll come to the other part,the fact<br> that writer chose to dismiss the argument of Dawkins etc,by picking up<br> parts he wanted to and not trying to provide a complete analysis of<br> their work.He should also have acknowledged where they pointed out<br> religion sanctioned violence.For he knew it to be true he failed to<br> acknowledge it.That is not what i believe unbiased and<br> comprehensive.Being critical of it or not he should have mentioned it.he<br> omitted stuff that he thought he couldn’t argue with.Now that’s<br> injustice to the writers as that’s not all they said and Vox Day has not<br> refuted their argument.What about those he hasn’t taken up?That’s<br> ‘omission to me and lying he was by implying that he had completely<br> refuted the argument of these writers or that his work was complete or<br> comprehensive.Leaving out stuff he has  failed to acknowledge he did no<br> allow the writers work a fair analysis.For omitting stuff and implying<br> to have refuted all the work of theses writers is lying buy omission to<br> me.The writer using modes and interpretations he wanted to constituted<br> to me as ‘omission’.When he makes comparisons with today’s world and<br> statistics he fails to acknowledge sectranian issues that have<br> perpetuated and bred violence.Abuse of women sanctioned by religion,the<br> writers may not have highlighted that but if Vox Day was setting about<br> to do what was logical he should have included that.And called black<br> ,black and white ,white(no racism)What he fails to say is that<br> islam,christanity,jewism etc all allow violence in many forms.he chose<br> to focus on statistic of his choice and i which i believe not to be<br> independent  related to crime,now pray forgive me,were we talking about<br> that?No.So he choses what to say and what to say it about.another thing<br> if the writers(Dawkins etc.) were talking about the criminality of a<br> religious person,that is entirely different from whether religion<br> sanctions criminal behaviour or not.Well i couldn’t understand what you<br> have heard over and  over from whom ever you have heard it from.Hearing<br> something over and over does not make it wrong.i dont know what you have<br> heard so i cant begin  to decide on what it is but if a black person<br> were to campaign over and over racism was wrong,that dosen’t discredit<br> the truth of his actions.and if this book has all the flaws that it is<br> accused of ‘over and over’ they wont descredit that that is what it<br> is.(P.S the term writer/writers is used for Dawkins etc. unless implied<br> otherwise)That is my opinion and i wont want to take this any further.I<br> am going to go have a burger,i am feeling light headed.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></i>“</p></blockquote><p>Sometimes, when dealing with this sort of atheist, it is best to simply back slowly away and be sure to make no sudden movements.</p></div>",
  "content_text": "This is amusing for several reasons, particularly the way in which the atheist clearly has no sense of the extent to which he is overreacting.  Barry posted the following review of TIA\non GoodReads\n:\n“5 of 5 stars\nVery good, provided logical and philosophical arguments\nagainst atheism rather than the general apologetics which rely on\nhistorical records and such.”\nThat’s it. Positive, descriptive, and succinct.  And it inspired the following response from an atheist named abc.\n“well i tend to disagree i didnt find it logical,it was more lying by\nomission and selective use of imformation with no acknowledgement of the\ncontrast.”\nTo which Barry, quite reasonably, responded:\n“Really, what parts do you think were actually ‘lying by omission?  Or\ndid you actually read the book.  I have heard this over and over from\nevangelical atheists.  What was misrepresented?  What was lying?  I\nthink this is just a drive by posting.”\nThereby inspiring the following response, which is so over-the-top it almost sounds more like an agnostic with a sense of humor trolling Goodreads than the usual socially autistic atheist.\nEspecially the bit about the burger.  But whether it is real or not, it is funny.\n“Do not label.You have no right what so ever to label people,no\nbullying.None what so ever.Do you know what ‘evangelist’ means?’A person\nwho seeks to convert other people to christian faith,especially by preaching’ (source:wikipedia) And what is an atheist:someone who doesn’t\nbelieve in existence of god.Now an evangelist in his nature can’t be an\natheist and an atheist not a christian.it’s like saying ‘a guilty\ninnocent’.Now that having been said i’ll come to the other part,the fact\nthat writer chose to dismiss the argument of Dawkins etc,by picking up\nparts he wanted to and not trying to provide a complete analysis of\ntheir work.He should also have acknowledged where they pointed out\nreligion sanctioned violence.For he knew it to be true he failed to\nacknowledge it.That is not what i believe unbiased and\ncomprehensive.Being critical of it or not he should have mentioned it.he\nomitted stuff that he thought he couldn’t argue with.Now that’s\ninjustice to the writers as that’s not all they said and Vox Day has not\nrefuted their argument.What about those he hasn’t taken up?That’s\n‘omission to me and lying he was by implying that he had completely\nrefuted the argument of these writers or that his work was complete or\ncomprehensive.Leaving out stuff he has  failed to acknowledge he did no\nallow the writers work a fair analysis.For omitting stuff and implying\nto have refuted all the work of theses writers is lying buy omission to\nme.The writer using modes and interpretations he wanted to constituted\nto me as ‘omission’.When he makes comparisons with today’s world and\nstatistics he fails to acknowledge sectranian issues that have\nperpetuated and bred violence.Abuse of women sanctioned by religion,the\nwriters may not have highlighted that but if Vox Day was setting about\nto do what was logical he should have included that.And called black\n,black and white ,white(no racism)What he fails to say is that\nislam,christanity,jewism etc all allow violence in many forms.he chose\nto focus on statistic of his choice and i which i believe not to be\nindependent  related to crime,now pray forgive me,were we talking about\nthat?No.So he choses what to say and what to say it about.another thing\nif the writers(Dawkins etc.) were talking about the criminality of a\nreligious person,that is entirely different from whether religion\nsanctions criminal behaviour or not.Well i couldn’t understand what you\nhave heard over and  over from whom ever you have heard it from.Hearing\nsomething over and over does not make it wrong.i dont know what you have\nheard so i cant begin  to decide on what it is but if a black person\nwere to campaign over and over racism was wrong,that dosen’t discredit\nthe truth of his actions.and if this book has all the flaws that it is\naccused of ‘over and over’ they wont descredit that that is what it\nis.(P.S the term writer/writers is used for Dawkins etc. unless implied\notherwise)That is my opinion and i wont want to take this any further.I\nam going to go have a burger,i am feeling light headed.\n“\nSometimes, when dealing with this sort of atheist, it is best to simply back slowly away and be sure to make no sudden movements.",
  "tags": [
    "atheism",
    "TIA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-02T12:00:00+00:00"
}