{
  "url": "https://voxday.net/2013/09/27/greek-military-union-challenges/",
  "scraped_at": "2025-12-14T22:43:33.836148",
  "title": "Greek military union challenges government",
  "date_display": "September 27, 2013",
  "date_iso": "2013-09-27T05:00:00+00:00",
  "date_from_url": "2013-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A statement released by the Special Forces Reserve Union demands the resignation of the government. <a href=\"http://www.zerohedge.com/news/2013-09-26/greece-verge-military-special-forces-have-15-demands-or-else\">From Zerohedge</a>:</p><blockquote class=\"tr_bq\"><p> Greek government authorities are on alert after a <a href=\"http://keed-hellas.blogspot.com/\">union of Greek army reservists of Special Forces</a> issued a statement urging the Greek administration to step down and make way for a national unity government. As <a href=\"http://www.keeptalkinggreece.com/2013/09/26/with-15-demands-greek-army-reservists-want-immediate-resignation-of-government/\">Keep Talking Greece notes</a>, the statement on the union’ website included <b>15 demands – including the resignation of the Greek President</b> – and urged people to gather at the infamous Syntagma Square on Saturday. The <b>statement was interpreted by some as a call to a “coup d’etat”</b> – denied by the union – but prompted Greece’s Supreme Court to meet to discuss it.</p><p><b>The 15 Demands…</b><br> <b><br/></b><br> “OUR PRIMARY PURPOSE DEFENSE OF OUR COUNTRY.<br> Reservists Special Forces and the Greek people to implementation of Article 120 of the Constitution requires:</br></br></br></p><p>1. IMMEDIATE RESIGNATION OF GOVERNMENT of the impossibility of<br> providing the people as provided in the Constitution at Work (Article<br> 22), health, education, justice, security.<br> Two. ESTABLISHING A NATIONAL GOVERNMENT PLANS chaired by Supreme<br> Court of personalities on proven outside politics and consultants from<br> the Academy of Athens.<br> Three. SUSPENSION OF APPLICATION NOTICE MNIMONIAKON laws and within<br> two months, with a ban on participation of all citizens who participated<br> in the governments responsible for the current economic situation.<br> 4. EXAMINING BOARD of the supreme court and accountability for the<br> HOW and WHO led us to Catastrophic Agreement Memorandum. Establishment<br> of Constitutional Court Effective power impose its will.<br> 5. Immediate suspension of dismissal from the State.<br> 6. SUSPENSION further TAX for Family Income up to 25.000 €.<br> 7. SUSPENSION auctions and bank claims until the Completion Audit of Banks of Certified Public Accountants and accountability.<br> 8. Complaint EPACHTHOUS DEBT.<br> 9. PROHIBITION OF SALE PUBLIC PROPERTY, Resume Defence Industries.<br> 10. DIRECT confiscation German (Retail / Business / Office) FULL<br> COMPENSATION until the Greek government for war reparations and<br> occupation loan.<br> 11. BREAK THE LAW ON LIABILITY minister and VOULEFTIKIS ASYLIAS.<br> Regardless of all “THE GREEKS ARE EQUAL BEFORE THE LAW” (Article 4).<br> 12. CONTROL assets of those involved in economic positions of<br> government, prosecute illicit enrichment and Efficiency to the State.<br> 13. OPERATIONAL CONTROL – LICENSING LEGALITY broadcasters and immediate return to the Greek government debts.<br> 14. Protection from Hostile Elongation at AEGEAN, Macedonia, Epirus,<br> Thrace and Cyprus, while suppressing the various groups that see inside.<br> 15. REMOVE ILLEGAL IMMIGRANTS with a similar promotion in European<br> countries and the server. EXPORT BAN MONEY Over 20% of the taxable<br> income of such.<br> • The KK PRESIDENT OF THE REPUBLIC INVITED WAIVED as an appropriate time to facilitate desired development of the Greek people.<br> • THESMOS WARRANTOR all of the above may be the ARMED FORCES OF THE COUNTRY AS POWERFUL ANIDIOTELIS ENTITY TO ANY THREAT.<br> • Bodies SECURITY REQUIRED TO SECURING THE IMPLEMENTATION OF THE<br> ABOVE AND SMOOTH MIGRATION IN ACTUAL constitutional legality. ”</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It should be fascinating to see the High Officials of the EU babbling about the need to respect democracy after they initiated post-democratic coups in Greece and Italy. There is no reason why the various national militaries shouldn’t follow their example… and they’ve got the guns.</p><p>There isn’t much question that nationalist military governments would be vastly preferable to unelected Eurofascist rule. It is looking like the government’s attempt to crack down on the increasingly popular Golden Dawn was a very, very bad idea that is likely to backfire.</p></div>",
  "content_text": "A statement released by the Special Forces Reserve Union demands the resignation of the government.\nFrom Zerohedge\n:\nGreek government authorities are on alert after a\nunion of Greek army reservists of Special Forces\nissued a statement urging the Greek administration to step down and make way for a national unity government. As\nKeep Talking Greece notes\n, the statement on the union’ website included\n15 demands – including the resignation of the Greek President\n– and urged people to gather at the infamous Syntagma Square on Saturday. The\nstatement was interpreted by some as a call to a “coup d’etat”\n– denied by the union – but prompted Greece’s Supreme Court to meet to discuss it.\nThe 15 Demands…\n“OUR PRIMARY PURPOSE DEFENSE OF OUR COUNTRY.\nReservists Special Forces and the Greek people to implementation of Article 120 of the Constitution requires:\n1. IMMEDIATE RESIGNATION OF GOVERNMENT of the impossibility of\nproviding the people as provided in the Constitution at Work (Article\n22), health, education, justice, security.\nTwo. ESTABLISHING A NATIONAL GOVERNMENT PLANS chaired by Supreme\nCourt of personalities on proven outside politics and consultants from\nthe Academy of Athens.\nThree. SUSPENSION OF APPLICATION NOTICE MNIMONIAKON laws and within\ntwo months, with a ban on participation of all citizens who participated\nin the governments responsible for the current economic situation.\n4. EXAMINING BOARD of the supreme court and accountability for the\nHOW and WHO led us to Catastrophic Agreement Memorandum. Establishment\nof Constitutional Court Effective power impose its will.\n5. Immediate suspension of dismissal from the State.\n6. SUSPENSION further TAX for Family Income up to 25.000 €.\n7. SUSPENSION auctions and bank claims until the Completion Audit of Banks of Certified Public Accountants and accountability.\n8. Complaint EPACHTHOUS DEBT.\n9. PROHIBITION OF SALE PUBLIC PROPERTY, Resume Defence Industries.\n10. DIRECT confiscation German (Retail / Business / Office) FULL\nCOMPENSATION until the Greek government for war reparations and\noccupation loan.\n11. BREAK THE LAW ON LIABILITY minister and VOULEFTIKIS ASYLIAS.\nRegardless of all “THE GREEKS ARE EQUAL BEFORE THE LAW” (Article 4).\n12. CONTROL assets of those involved in economic positions of\ngovernment, prosecute illicit enrichment and Efficiency to the State.\n13. OPERATIONAL CONTROL – LICENSING LEGALITY broadcasters and immediate return to the Greek government debts.\n14. Protection from Hostile Elongation at AEGEAN, Macedonia, Epirus,\nThrace and Cyprus, while suppressing the various groups that see inside.\n15. REMOVE ILLEGAL IMMIGRANTS with a similar promotion in European\ncountries and the server. EXPORT BAN MONEY Over 20% of the taxable\nincome of such.\n• The KK PRESIDENT OF THE REPUBLIC INVITED WAIVED as an appropriate time to facilitate desired development of the Greek people.\n• THESMOS WARRANTOR all of the above may be the ARMED FORCES OF THE COUNTRY AS POWERFUL ANIDIOTELIS ENTITY TO ANY THREAT.\n• Bodies SECURITY REQUIRED TO SECURING THE IMPLEMENTATION OF THE\nABOVE AND SMOOTH MIGRATION IN ACTUAL constitutional legality. ”\nIt should be fascinating to see the High Officials of the EU babbling about the need to respect democracy after they initiated post-democratic coups in Greece and Italy. There is no reason why the various national militaries shouldn’t follow their example… and they’ve got the guns.\nThere isn’t much question that nationalist military governments would be vastly preferable to unelected Eurofascist rule. It is looking like the government’s attempt to crack down on the increasingly popular Golden Dawn was a very, very bad idea that is likely to backfire.",
  "tags": [
    "EU",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-27T04:00:00+00:00"
}