{
  "url": "https://voxday.net/2013/09/25/gun-control-dichotomy/",
  "scraped_at": "2025-12-14T22:43:25.975987",
  "title": "Gun control: the dichotomy",
  "date_display": "September 25, 2013",
  "date_iso": "2013-09-25T23:55:00+00:00",
  "date_from_url": "2013-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama wants to take Americans’ guns because Sandy Hook <a href=\"http://market-ticker.org/akcs-www?post=224626\">while distributing advanced weaponry</a> to the Islamic jihad:</p><blockquote class=\"tr_bq\"><p> According to State Department and military sources,<br> dozens of highly armored vehicles called GMV’s, provided by the United<br> States, are now missing. The vehicles feature GPS navigation as well as<br> various sets of weapon mounts and can be outfitted with smoke-grenade<br> launchers. U.S. Special Forces undergo significant training to operate<br> these vehicles. Fox News is told the vehicles provided to the Libyans<br> are now gone.</br></br></br></br></br></br></p><p>Along with the GMV’s, hundreds of weapons are now<br> missing, including roughly 100 Glock pistols and more than 100 M4<br> rifles. More disturbing, according to the sources, is that it seems<br> almost every set of night-vision goggles has also been taken. This is<br> advanced technology that gives very few war fighters an advantage on the<br> battlefield.</br></br></br></br></br></p></blockquote><p>Missing. Right. You know, Obama would probably be a lot more popular if he’d stick to giving out free Glocks and NV goggles to Americans.</p></div>",
  "content_text": "Obama wants to take Americans’ guns because Sandy Hook\nwhile distributing advanced weaponry\nto the Islamic jihad:\nAccording to State Department and military sources,\ndozens of highly armored vehicles called GMV’s, provided by the United\nStates, are now missing. The vehicles feature GPS navigation as well as\nvarious sets of weapon mounts and can be outfitted with smoke-grenade\nlaunchers. U.S. Special Forces undergo significant training to operate\nthese vehicles. Fox News is told the vehicles provided to the Libyans\nare now gone.\nAlong with the GMV’s, hundreds of weapons are now\nmissing, including roughly 100 Glock pistols and more than 100 M4\nrifles. More disturbing, according to the sources, is that it seems\nalmost every set of night-vision goggles has also been taken. This is\nadvanced technology that gives very few war fighters an advantage on the\nbattlefield.\nMissing. Right. You know, Obama would probably be a lot more popular if he’d stick to giving out free Glocks and NV goggles to Americans.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-25T22:55:00+00:00"
}