{
  "url": "https://voxday.net/2013/09/03/how-gay-marriage-harms-you/",
  "scraped_at": "2025-12-14T22:40:55.377873",
  "title": "How “gay marriage” harms you",
  "date_display": "September 3, 2013",
  "date_iso": "2013-09-03T08:05:00+00:00",
  "date_from_url": "2013-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember when we were all assured that homogamy was about expanding human rights, not denying them?  Yeah, so it turns out <a href=\"http://www.kgw.com/news/Gresham-bakery-that-denied-same-sex-wedding-cake-closes--222004711.html\">that was a lie</a>.</p><blockquote class=\"tr_bq\"><p> A Gresham bakery that refused to make a wedding cake for a same-sex couple, prompting a state investigation, shut its doors. On Sunday, KGW stopped by Sweet Cakes by Melissa and found the bakery<br> completely empty. All counter tops, display cases and decorations were<br> gone. Hanging in the window was a sign from the Oregon Family Council that read “Religious freedom is under attack in Gresham.”</br></br></p></blockquote><p>So, we now know that in addition to being bad for marriage – in Britain a woman will soon no longer legally <a href=\"http://voiceofrussia.com/2012_03_16/68661011/\">become a “wife”</a> while in France women can no longer <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/france/9563543/France-set-to-ban-the-words-mother-and-father-from-official-documents.html\">become “mothers”</a> – we know that homogamy is bad for jobs and the economy. This is precisely why free association – or as its opponents call it, discrimination – is a Constitutional right.</p><p>It is a sign of considerable societal decline that such a fundamental human right is no longer recognized in the USA.</p><p>UPDATE: This isn’t a theoretical matter.  It is a dangerous anti-civilizational abuse of human rights quite literally sweeping the Western USA:</p><blockquote class=\"tr_bq\"><p> A commercial photography business owned by opponents of same-sex<br> marriage violated New Mexico’s anti-discrimination law by refusing to<br> take pictures of a gay couple’s commitment ceremony, the state’s highest<br> court ruled unanimously Thursday. Elaine Huguenin, who owns Elane Photography with her<br> husband and is the business’s principal photographer, refused to<br> photograph the ceremony because it violated her religious beliefs.</br></br></br></br></br></p><p>The court held that “a commercial photography<br> business that offers its services to the public, thereby increasing its<br> visibility to potential clients” is bound by the New Mexico Human Rights<br> Act “and must serve same-sex couples on the same basis that it serves<br> opposite-sex couples.”</br></br></br></br></p><p>“Therefore, when Elane Photography refused to<br> photograph a same-sex commitment ceremony,” the court concluded, the<br> photographer “violated the NMHRA in the same way as if it had refused to<br> photograph a wedding between people of different races.”</br></br></br></p></blockquote><p>This should make it clear that “anti-discrimination” laws are the foundation of human rights abuses.  They serve as justifiation for involuntary government-imposed servitude.</p></div>",
  "content_text": "Remember when we were all assured that homogamy was about expanding human rights, not denying them?  Yeah, so it turns out\nthat was a lie\n.\nA Gresham bakery that refused to make a wedding cake for a same-sex couple, prompting a state investigation, shut its doors. On Sunday, KGW stopped by Sweet Cakes by Melissa and found the bakery\ncompletely empty. All counter tops, display cases and decorations were\ngone. Hanging in the window was a sign from the Oregon Family Council that read “Religious freedom is under attack in Gresham.”\nSo, we now know that in addition to being bad for marriage – in Britain a woman will soon no longer legally\nbecome a “wife”\nwhile in France women can no longer\nbecome “mothers”\n– we know that homogamy is bad for jobs and the economy. This is precisely why free association – or as its opponents call it, discrimination – is a Constitutional right.\nIt is a sign of considerable societal decline that such a fundamental human right is no longer recognized in the USA.\nUPDATE: This isn’t a theoretical matter.  It is a dangerous anti-civilizational abuse of human rights quite literally sweeping the Western USA:\nA commercial photography business owned by opponents of same-sex\nmarriage violated New Mexico’s anti-discrimination law by refusing to\ntake pictures of a gay couple’s commitment ceremony, the state’s highest\ncourt ruled unanimously Thursday. Elaine Huguenin, who owns Elane Photography with her\nhusband and is the business’s principal photographer, refused to\nphotograph the ceremony because it violated her religious beliefs.\nThe court held that “a commercial photography\nbusiness that offers its services to the public, thereby increasing its\nvisibility to potential clients” is bound by the New Mexico Human Rights\nAct “and must serve same-sex couples on the same basis that it serves\nopposite-sex couples.”\n“Therefore, when Elane Photography refused to\nphotograph a same-sex commitment ceremony,” the court concluded, the\nphotographer “violated the NMHRA in the same way as if it had refused to\nphotograph a wedding between people of different races.”\nThis should make it clear that “anti-discrimination” laws are the foundation of human rights abuses.  They serve as justifiation for involuntary government-imposed servitude.",
  "tags": [
    "law",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-03T07:05:00+00:00"
}