{
  "url": "https://voxday.net/2013/09/04/how-oc-spent-his-summer-vacation/",
  "scraped_at": "2025-12-14T22:41:08.307872",
  "title": "How the OC spent his summer vacation",
  "date_display": "September 4, 2013",
  "date_iso": "2013-09-04T20:30:00+00:00",
  "date_from_url": "2013-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The OC <a href=\"http://stupefyingstoriesshowcase.com/0130826/0130826-90.html\">provides an update</a> on the current Rampant Loon publications:</p><blockquote class=\"tr_bq\"><p> If you’ve been following <i>Stupefying Stories</i> on facebook, you<br> know that slightly more than two months ago, as we were in the throes of<br> releasing the July issue, I was diagnosed with Type 2 diabetes. This<br> apparently was why I seemed to have boundless energy. My blood sugars<br> were five times higher than normal. I had the metabolism of a<br> hummingbird.</br></br></br></br></br></p><p>My doctors immediately put me on an aggressive treatment plan, which<br> immediately made things much worse. By the time a month later when we<br> were trying to finish up both the August issue and the long-delayed<br> zombie anthology, and just as the aforementioned soap opera was reaching<br> its dramatic climax for the season, the diagnosis was revised to<br> full-blown Type 1. Apparently my endocrine system was not merely out of<br> adjustment. My pancreas had just plain packed up and quit.</br></br></br></br></br></br></p><p>Something had to give, and as it turned out, it was our August release schedule.</p><p>Things have begun to stabilize since then. I’m now on a treatment<br> regimen consisting of two different types of insulin and five injections<br> daily, with each dose being calculated based on my latest blood glucose<br> reading and then adjusted by a variety of fudge factors—all things my<br> pancreas used to do autonomically. A remarkable organ, the pancreas;<br> terribly underappreciated. As Joni Mitchell said, “You don’t know what<br> you got ‘til it’s gone.”</br></br></br></br></br></br></p></blockquote><p>Fortunately, he’s doing much better now and is working on both Headcrash 2.0 and the sequel to Rebel Moon, entitled Rebel Moon Rising.  No, I cruelly jest, while he is doing better, he is doing nothing of the kind. But there is <a href=\"http://stupefyingstoriesshowcase.com/0130826/0130826-10.html\">the new Showcase </a>and new Stupefying Stories on the way soon.</p></div>",
  "content_text": "The OC\nprovides an update\non the current Rampant Loon publications:\nIf you’ve been following\nStupefying Stories\non facebook, you\nknow that slightly more than two months ago, as we were in the throes of\nreleasing the July issue, I was diagnosed with Type 2 diabetes. This\napparently was why I seemed to have boundless energy. My blood sugars\nwere five times higher than normal. I had the metabolism of a\nhummingbird.\nMy doctors immediately put me on an aggressive treatment plan, which\nimmediately made things much worse. By the time a month later when we\nwere trying to finish up both the August issue and the long-delayed\nzombie anthology, and just as the aforementioned soap opera was reaching\nits dramatic climax for the season, the diagnosis was revised to\nfull-blown Type 1. Apparently my endocrine system was not merely out of\nadjustment. My pancreas had just plain packed up and quit.\nSomething had to give, and as it turned out, it was our August release schedule.\nThings have begun to stabilize since then. I’m now on a treatment\nregimen consisting of two different types of insulin and five injections\ndaily, with each dose being calculated based on my latest blood glucose\nreading and then adjusted by a variety of fudge factors—all things my\npancreas used to do autonomically. A remarkable organ, the pancreas;\nterribly underappreciated. As Joni Mitchell said, “You don’t know what\nyou got ‘til it’s gone.”\nFortunately, he’s doing much better now and is working on both Headcrash 2.0 and the sequel to Rebel Moon, entitled Rebel Moon Rising.  No, I cruelly jest, while he is doing better, he is doing nothing of the kind. But there is\nthe new Showcase\nand new Stupefying Stories on the way soon.",
  "tags": [
    "Stupefying Stories"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-04T19:30:00+00:00"
}