{
  "url": "https://voxday.net/2013/09/01/impaler-review-i/",
  "scraped_at": "2025-12-14T22:40:46.454586",
  "title": "Book Review: Impaler I",
  "date_display": "September 1, 2013",
  "date_iso": "2013-09-01T17:55:00+00:00",
  "date_from_url": "2013-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2013/09/Impaler_Cover_Small.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/09/Impaler_Cover_Small.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/09/Impaler_Cover_Small.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Impaler is a well written alternate history, marred with some<br> unfortunate anachronistic insertions of modern sensibilities.  I would<br> also add that it is not for the faint of heart; fight sequences are<br> brutal and gory, torture is a regular occurrence, and pederasty forms a<br> foundational portion of the story.</br></br></br></br></p><p>Paulk effectively captures the<br> feeling of the time period for the most part, both its religiousness as<br> well as its savagery.  She makes Vlad an understandable character,<br> while not shying away from the reality of of the violence of the times<br> and what was necessary for the man who would be king.</br></br></br></br></p><p>The primary<br> criticisms I have of this book is that while it for the most part aims<br> to be a gritty, historically based tale, it has a few elements that<br> break the willing suspension of disbelief.  First, Vlad forbids the rape<br> and pillaging that regular accompanies a conquering army.  This is<br> almost believable, and I would have given it a pass, had not other<br> issues come into play.</br></br></br></br></br></br></p><p>Towards the end of the book, some of the child<br> victims of pederasty engage in homosexual behavior.  Not only does Vlad<br> give them a free pass, but he actively argues both an Orthodox priest<br> and a Catholic priest into submission.  This is so absurd it is beyond<br> description.  Further, he references in his arguments with the priests<br> his well-read nature in the Scriptures as well as having compared<br> translation notes.  It is unlikely that most priests were even so<br> conversant in the Scriptures at that time, let alone the nobles (who<br> were in turn taught by the priests).  A well educated noble would have<br> been able to read and perhaps do his own accounts, but not engage in<br> Scriptural debates.  Similarly, a little later, he also reveals he is<br> conversant in Jewish treatises as well.  Simply put, this is laughable<br> for the time.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Those criticisms not withstanding, Impaler was an<br> interesting read and cleverly written.  I would not recommend it for<br> the tender hearted due to the violent content, but fans of historical<br> fiction and alternate histories will likely enjoy it.</br></br></br></p><p><i>NB: This is the first of the three volunteer reviews.  This one was written by DK.</i></p></div>",
  "content_text": "Impaler is a well written alternate history, marred with some\nunfortunate anachronistic insertions of modern sensibilities.  I would\nalso add that it is not for the faint of heart; fight sequences are\nbrutal and gory, torture is a regular occurrence, and pederasty forms a\nfoundational portion of the story.\nPaulk effectively captures the\nfeeling of the time period for the most part, both its religiousness as\nwell as its savagery.  She makes Vlad an understandable character,\nwhile not shying away from the reality of of the violence of the times\nand what was necessary for the man who would be king.\nThe primary\ncriticisms I have of this book is that while it for the most part aims\nto be a gritty, historically based tale, it has a few elements that\nbreak the willing suspension of disbelief.  First, Vlad forbids the rape\nand pillaging that regular accompanies a conquering army.  This is\nalmost believable, and I would have given it a pass, had not other\nissues come into play.\nTowards the end of the book, some of the child\nvictims of pederasty engage in homosexual behavior.  Not only does Vlad\ngive them a free pass, but he actively argues both an Orthodox priest\nand a Catholic priest into submission.  This is so absurd it is beyond\ndescription.  Further, he references in his arguments with the priests\nhis well-read nature in the Scriptures as well as having compared\ntranslation notes.  It is unlikely that most priests were even so\nconversant in the Scriptures at that time, let alone the nobles (who\nwere in turn taught by the priests).  A well educated noble would have\nbeen able to read and perhaps do his own accounts, but not engage in\nScriptural debates.  Similarly, a little later, he also reveals he is\nconversant in Jewish treatises as well.  Simply put, this is laughable\nfor the time.\nThose criticisms not withstanding, Impaler was an\ninteresting read and cleverly written.  I would not recommend it for\nthe tender hearted due to the violent content, but fans of historical\nfiction and alternate histories will likely enjoy it.\nNB: This is the first of the three volunteer reviews.  This one was written by DK.",
  "tags": [
    "books",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-01T16:55:00+00:00"
}