{
  "url": "https://voxday.net/2013/09/23/its-just-too-easy/",
  "scraped_at": "2025-12-14T22:43:07.967850",
  "title": "It’s just too easy",
  "date_display": "September 23, 2013",
  "date_iso": "2013-09-23T05:00:00+00:00",
  "date_from_url": "2013-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Golf Pro, aka Tad, mocks the idea that Minnesotans have anything to worry about from the Somali jihadists in Minnesota:</p><blockquote class=\"tr_bq\"><p> I’m positive that comparing Minneapolis to Kenya is a bad idea. They<br> aren’t really the same place, same culture, same institutions, same<br> history. Really, there is no similarity. The good folks in Minneapolis<br> have nothing to worry about.</br></br></br></p><p>It’s ‘kinda like the members at<br> Augusta National Golf Course worrying that they may have to play in the<br> same conditions as west Texas. Not the same place.</br></br></p><p>But carry that gun!</p></blockquote><p>Meanwhile, the jihadist organization that has both claimed responsibility for the attack and been identified as the responsible party by the government of Kenya reports <a href=\"http://pjmedia.com/tatler/2013/09/22/al-shabaab-three-americans-among-gunmen-in-kenya-mall/\">there are several “Minnesotans”</a> among the jihadists who slaughtered more than 60 mallgoers in Kenya.</p><p><i>Al-Shabaab is claiming that there are American gunmen among those<br> still holed up in the Westgate mall in a standoff with Kenyan and<br> Israeli special forces. The Somali al-Qaeda affiliate tweeted a series of names on its latest<br> account before Twitter against suspended the group. Al-Shabaab has been<br> creating new accounts each time they get shut down but a movement of<br> pro-Kenyan tweeters has been tracking down the new accounts and<br> complaining to Twitter.</br></br></br></br></br></br></i></p><p><i>“We received permission to disclose the names of our mujahideen inside #Westgate,” their latest account tweeted.  They proceeded to tweet the names one by one, including Ahmed Mohamed<br> Isse, 22, “native” of St. Paul, Minn., Abdifatah Osman Keenadiid, 24,<br> of Minneapolis, and Gen Mustafe Noorudiin, 27, of Kansas City, Mo.</br></br></i></p><p><i><br> </br></i><i>Al-Shabaab recently released a PR video targeted at Somali-Americans in Minnesota, trying to lure them to jihad as more than two dozen have already done so through the state’s “terror pipeline.” Three Americans — Abdisalan Hussein Ali, Farah Mohamed Beledi and Shirwa Ahmed — from Minnesota have been suicide bombers for Al-Shabaab in a series of attacks in Mogadishu over the past few years.</i></p><p>Notice that this sort of less-intelligent critic bases their arguments on absolutely nothing. Not on the observable facts, not on the easily confirmed reality, just snark and empty posturing.  Which, of course, is why it is so easy to expose them as inept and their positions as incorrect.</p></div>",
  "content_text": "Golf Pro, aka Tad, mocks the idea that Minnesotans have anything to worry about from the Somali jihadists in Minnesota:\nI’m positive that comparing Minneapolis to Kenya is a bad idea. They\naren’t really the same place, same culture, same institutions, same\nhistory. Really, there is no similarity. The good folks in Minneapolis\nhave nothing to worry about.\nIt’s ‘kinda like the members at\nAugusta National Golf Course worrying that they may have to play in the\nsame conditions as west Texas. Not the same place.\nBut carry that gun!\nMeanwhile, the jihadist organization that has both claimed responsibility for the attack and been identified as the responsible party by the government of Kenya reports\nthere are several “Minnesotans”\namong the jihadists who slaughtered more than 60 mallgoers in Kenya.\nAl-Shabaab is claiming that there are American gunmen among those\nstill holed up in the Westgate mall in a standoff with Kenyan and\nIsraeli special forces. The Somali al-Qaeda affiliate tweeted a series of names on its latest\naccount before Twitter against suspended the group. Al-Shabaab has been\ncreating new accounts each time they get shut down but a movement of\npro-Kenyan tweeters has been tracking down the new accounts and\ncomplaining to Twitter.\n“We received permission to disclose the names of our mujahideen inside #Westgate,” their latest account tweeted.  They proceeded to tweet the names one by one, including Ahmed Mohamed\nIsse, 22, “native” of St. Paul, Minn., Abdifatah Osman Keenadiid, 24,\nof Minneapolis, and Gen Mustafe Noorudiin, 27, of Kansas City, Mo.\nAl-Shabaab recently released a PR video targeted at Somali-Americans in Minnesota, trying to lure them to jihad as more than two dozen have already done so through the state’s “terror pipeline.” Three Americans — Abdisalan Hussein Ali, Farah Mohamed Beledi and Shirwa Ahmed — from Minnesota have been suicide bombers for Al-Shabaab in a series of attacks in Mogadishu over the past few years.\nNotice that this sort of less-intelligent critic bases their arguments on absolutely nothing. Not on the observable facts, not on the easily confirmed reality, just snark and empty posturing.  Which, of course, is why it is so easy to expose them as inept and their positions as incorrect.",
  "tags": [
    "anklebiters",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-23T04:00:00+00:00"
}