{
  "url": "https://voxday.net/2013/09/05/john-ringo-on-2013-hugo-winner/",
  "scraped_at": "2025-12-14T22:41:10.134078",
  "title": "John Ringo on a 2013 Hugo winner",
  "date_display": "September 5, 2013",
  "date_iso": "2013-09-05T08:26:00+00:00",
  "date_from_url": "2013-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Baen Books author wonders how much longer conservative and libertarian readers are going to continue to buy derivative books written <a href=\"https://www.facebook.com/notes/john-ringo/politics-culture-and-market/10151615965422055\">by a progressive male demi-feminist who openly despises them</a>:</p><blockquote class=\"tr_bq\"><p> So about the whole Scalzi ‘thing.’</p><p>Scalzi was pissing<br> me off even before getting a Hugo for a novel so remarkably unremarkable<br> it would barely have made it to paperback in the 1970s. Nothing against<br> it, it’s a fun, simple, mindless, read from all I’ve gathered. But it’s<br> not exactly Stranger in a Strange Land or Nightfall.</br></br></br></br></p><p>Scalzi<br> is president of SFWA (sort of the writer’s union for SF authors) or<br> whatever they’re calling it this week. As president instead of, oh, I<br> dunno, working to get better generalized terms for new authors, ensuring<br> contracts are upheld with publishers, maybe, someday, getting a fucking<br> health care insurer for all us authors who don’t have health insurance,<br> he’d been concentrating on IMPORTANT matters like making sure all<br> characters were called s/he and women weren’t being harassed at cons<br> (which happens and is up to the convention people to manage) and… The<br> list of ‘not-core-issue’ kerfuffles he’s been involved in as president<br> makes you think he’s president of ACORN not an SF union. And it was not<br> only driving out members (or they were expelling members for<br> ‘bad-speak’) it was making the group as irrelevant as the opinion of an<br> abyssal nematode.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>But I wasn’t the only one that Scalzi was pissing off. And that’s sort of the important point for Scalzi….</p><p>Which is where we start to see the issues with Scalzi suddenly not so<br> much ‘coming out of the closet’ but making a splash on a variety of<br> hot-button issues that really don’t sit well with his RETAIL market. The<br> people who actually BUY the books over the counter as opposed to<br> market, sell and even buy them for distribution. The more books you can<br> get a bookstore to buy, the more likely you are to sell them. So being<br> the poster child for your commercial people is a good thing.<br> Pissing off the people who in the end have to actually buy the books to read…. Not so much.</br></br></br></br></br></br></br></p><p>And the market fraction of true ‘Modern Progressives’ who read combat SF is HYSTERICALLY low.</p></blockquote><p>Many people who used to be fans of the 2013 Best Novel winner are beginning to figure out that Scalzi is a fraud, not so much because he exaggerates his daily blog readership by a mere 46,000 readers (or, if you prefer, 1,150 percent), but in terms of him being an original writer or one who is even remotely considerate of conservative or libertarian perspectives.  It’s possible, I suppose, that the all-seeing eye of Instapundit, who used to push Scalzi’s books on a regular basis, happens to be totally unaware of the Hugo awards, which he has not seen fit to mention.</p><p>Or perhaps the libertarian opinion leader has, like Mr. Ringo, gradually had his eyes opened to the real Scalzi, to the man’s increasingly vocal support for insane left-wing policies, to his hatred for free association, and to his complete flip-flop on free speech.  Remember, back in 2005, before he was established in the science fiction world, Scalzi was claiming that he wouldn’t want to see anyone expelled from SFWA for their beliefs. In 2013, he quit paying his SFWA dues and threatened to quit the organization entirely if someone wasn’t expelled from the SFWA for their beliefs.</p><p>How things change once a man feels he can afford to reveal his true character.</p><p>Unlike Mr. Ringo, I’m genuinely pleased that McRapey won the Hugo for a mediocre and derivative novel. That isn’t false magnanimity, it is merely that I am publicly on record as stating that the awards in the SF field became a hopelessly politicized joke when incoming SFWA president Catharine Asaro won <a href=\"http://nwhyte.livejournal.com/1984726.html\">the Nebula for <i>The Quantum Rose</i></a> in 2002. I drew considerable ire from many SFWA members for pointing that out on Black Gate last year, and I view three-time SFWA president John Scalzi’s Hugo for <i>Redshirts </i>as conclusive evidence in support of my hypothesis.</p><p>I also found it amusing that even McRapey’s little Twitter friend at the Guardian <a href=\"http://www.theguardian.com/books/booksblog/2013/sep/02/hugo-awards-2013-science-fiction\">wrote about the Hugo awards</a> with a distinct damned-by-faint-praise air to the article.</p><p>There is something else too, something darker. I once accidentally won a drawing award when I was six. I can’t draw at all and so I traced an image of a wood duck for a homework assignment. I had absolutely no idea that the teacher would send it into the Star as part of a big state-wide school competition, still less that I would win it for my 5-7 age group. That bloody duck was even featured in the Minneapolis newspaper. I don’t think my mother realized I wasn’t an artist until after I had graduated from college and she never figured out why both the newspaper clippings and the award disappeared.</p><p>So I speak from experience when I say that the only thing that rankles the soul more than merit that goes unrecognized is recognition that the receiver knows is unmerited. As writers, we know very well where our books stand in comparison with the greats as well as which of our contemporaries merit being numbered among them. That is why there are few things I could do to more cruelly scar the hypersensitive McRapey over time than the voting WorldCon membership has now done. Once the excitement from his long-sought Sally Field moment fades and the inevitable self-doubts creep in – for the narcissistic gamma male is ever prone to self-doubts as well as grandiose delusions – well, that’s when it should get interesting.</p><p>At least he’ll always have his lawn.</p><p>On the other hand, there are still those, like Professor Bainbridge, who not only don’t know mediocre science fiction when they see it, but are from <a href=\"http://www.professorbainbridge.com/professorbainbridgecom/2013/09/a-pat-on-the-back-for-john-scalzi-and-a-spanking-for-john-ringo.html\">the short-sighted conservative school of thought</a> that is proud to materially support the very progressives, socialists and Trotskyites who seek to destroy it.  I can’t say I blame him, as I used to be inclined to a libertarian view of that perspective until the creation of Fox News made it very clear what a severe price had been paid over time for the privilege of feeling open-minded.</p><p>Another discussion of Ringo’s observations of John Scalzi’s achievement in left-liberal politicking, including an appearance by the Toad of Tor herself, <a href=\"https://www.facebook.com/john.ringo.90857/posts/10151560891450887\">can be found here</a>. Note that you have to turn off NoScript to see the comments.</p></div>",
  "content_text": "The Baen Books author wonders how much longer conservative and libertarian readers are going to continue to buy derivative books written\nby a progressive male demi-feminist who openly despises them\n:\nSo about the whole Scalzi ‘thing.’\nScalzi was pissing\nme off even before getting a Hugo for a novel so remarkably unremarkable\nit would barely have made it to paperback in the 1970s. Nothing against\nit, it’s a fun, simple, mindless, read from all I’ve gathered. But it’s\nnot exactly Stranger in a Strange Land or Nightfall.\nScalzi\nis president of SFWA (sort of the writer’s union for SF authors) or\nwhatever they’re calling it this week. As president instead of, oh, I\ndunno, working to get better generalized terms for new authors, ensuring\ncontracts are upheld with publishers, maybe, someday, getting a fucking\nhealth care insurer for all us authors who don’t have health insurance,\nhe’d been concentrating on IMPORTANT matters like making sure all\ncharacters were called s/he and women weren’t being harassed at cons\n(which happens and is up to the convention people to manage) and… The\nlist of ‘not-core-issue’ kerfuffles he’s been involved in as president\nmakes you think he’s president of ACORN not an SF union. And it was not\nonly driving out members (or they were expelling members for\n‘bad-speak’) it was making the group as irrelevant as the opinion of an\nabyssal nematode.\nBut I wasn’t the only one that Scalzi was pissing off. And that’s sort of the important point for Scalzi….\nWhich is where we start to see the issues with Scalzi suddenly not so\nmuch ‘coming out of the closet’ but making a splash on a variety of\nhot-button issues that really don’t sit well with his RETAIL market. The\npeople who actually BUY the books over the counter as opposed to\nmarket, sell and even buy them for distribution. The more books you can\nget a bookstore to buy, the more likely you are to sell them. So being\nthe poster child for your commercial people is a good thing.\nPissing off the people who in the end have to actually buy the books to read…. Not so much.\nAnd the market fraction of true ‘Modern Progressives’ who read combat SF is HYSTERICALLY low.\nMany people who used to be fans of the 2013 Best Novel winner are beginning to figure out that Scalzi is a fraud, not so much because he exaggerates his daily blog readership by a mere 46,000 readers (or, if you prefer, 1,150 percent), but in terms of him being an original writer or one who is even remotely considerate of conservative or libertarian perspectives.  It’s possible, I suppose, that the all-seeing eye of Instapundit, who used to push Scalzi’s books on a regular basis, happens to be totally unaware of the Hugo awards, which he has not seen fit to mention.\nOr perhaps the libertarian opinion leader has, like Mr. Ringo, gradually had his eyes opened to the real Scalzi, to the man’s increasingly vocal support for insane left-wing policies, to his hatred for free association, and to his complete flip-flop on free speech.  Remember, back in 2005, before he was established in the science fiction world, Scalzi was claiming that he wouldn’t want to see anyone expelled from SFWA for their beliefs. In 2013, he quit paying his SFWA dues and threatened to quit the organization entirely if someone wasn’t expelled from the SFWA for their beliefs.\nHow things change once a man feels he can afford to reveal his true character.\nUnlike Mr. Ringo, I’m genuinely pleased that McRapey won the Hugo for a mediocre and derivative novel. That isn’t false magnanimity, it is merely that I am publicly on record as stating that the awards in the SF field became a hopelessly politicized joke when incoming SFWA president Catharine Asaro won\nthe Nebula for\nThe Quantum Rose\nin 2002. I drew considerable ire from many SFWA members for pointing that out on Black Gate last year, and I view three-time SFWA president John Scalzi’s Hugo for\nRedshirts\nas conclusive evidence in support of my hypothesis.\nI also found it amusing that even McRapey’s little Twitter friend at the Guardian\nwrote about the Hugo awards\nwith a distinct damned-by-faint-praise air to the article.\nThere is something else too, something darker. I once accidentally won a drawing award when I was six. I can’t draw at all and so I traced an image of a wood duck for a homework assignment. I had absolutely no idea that the teacher would send it into the Star as part of a big state-wide school competition, still less that I would win it for my 5-7 age group. That bloody duck was even featured in the Minneapolis newspaper. I don’t think my mother realized I wasn’t an artist until after I had graduated from college and she never figured out why both the newspaper clippings and the award disappeared.\nSo I speak from experience when I say that the only thing that rankles the soul more than merit that goes unrecognized is recognition that the receiver knows is unmerited. As writers, we know very well where our books stand in comparison with the greats as well as which of our contemporaries merit being numbered among them. That is why there are few things I could do to more cruelly scar the hypersensitive McRapey over time than the voting WorldCon membership has now done. Once the excitement from his long-sought Sally Field moment fades and the inevitable self-doubts creep in – for the narcissistic gamma male is ever prone to self-doubts as well as grandiose delusions – well, that’s when it should get interesting.\nAt least he’ll always have his lawn.\nOn the other hand, there are still those, like Professor Bainbridge, who not only don’t know mediocre science fiction when they see it, but are from\nthe short-sighted conservative school of thought\nthat is proud to materially support the very progressives, socialists and Trotskyites who seek to destroy it.  I can’t say I blame him, as I used to be inclined to a libertarian view of that perspective until the creation of Fox News made it very clear what a severe price had been paid over time for the privilege of feeling open-minded.\nAnother discussion of Ringo’s observations of John Scalzi’s achievement in left-liberal politicking, including an appearance by the Toad of Tor herself,\ncan be found here\n. Note that you have to turn off NoScript to see the comments.",
  "tags": [
    "McRapey",
    "W:AWCAAWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-05T07:26:00+00:00"
}