{
  "url": "https://voxday.net/2013/09/16/lions-den-v-brad-torgersen/",
  "scraped_at": "2025-12-14T22:42:27.463906",
  "title": "Lions Den V: Brad Torgersen",
  "date_display": "September 16, 2013",
  "date_iso": "2013-09-16T18:00:00+00:00",
  "date_from_url": "2013-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Brad Torgersen is an award-winning author who was nominated for the Campbell, Hugo, and Nebula awards in 2012.  Due to his failure to be sufficiently vibrant, irreligious, or other adjective indicative of the Left’s various totems, he found himself <a href=\"http://www.michaelzwilliamson.com/blog/item/sfwa--boldly-snatching-obscurity-from-the-jaws-of-relevance\">the subject of an SFWA hate campaign</a> to deny him the awards which bore certain similarities to my own experience with that organization. Review volunteers are now in, thank you.</i></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Lights-in-the-Deep-ebook/dp/B00EUF37KG/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.bradrtorgersen.com/store/covers/lights_in_the_deep_medium.jpg\" width=\"207\"/></a></div><p><i><a href=\"http://www.amazon.com/Lights-in-the-Deep-ebook/dp/B00EUF37KG/\"><b>Lights in the Deep</b></a></i> is the product of three years of effort, plus one long summer of editing, proofing, packaging, and wrap-up.  It contains ten different pieces of short science fiction, all previously published in either <i>Analog </i>magazine, Orson Scott Card’s <i>InterGalactic Medicine Show</i> magazine, or <i>L. Ron Hubbard Presents Writers and Illustrators of the Future, vol. XXVI.</i> This collection is my first “best of” album, and features my Writers of the Future award winner, my <i>Analog</i> readers’ choice award winner, and my Hugo and Nebula nominee.</p><p>I believe my job is to entertain the reader, and provide the reader with a worthwhile, uplifting experience.  I don’t write stories to shock, challenge, make the reader squirm, or (Lord help us) raise awareness.  I <i>do </i>write stories with the idea that “scientifiction” is about the science as much as it is about the fiction.  Since Larry Niven was perhaps my most influential template in this regard, I try to tell interesting stories featuring engaging characters, set in universes which are plausibly founded on science as we know it.  And if I stray from science as we know it, I work hard to keep my extrapolations consistent, and only bend the rules if it makes sense for them to be bent.</p><p>In related news, <a href=\"http://larrycorreia.wordpress.com/2013/09/16/book-bomb-lights-in-the-deep-by-brad-torgersen/\">Larry Correia is lighting a fuse</a> for a book bomb on Mr. Torgersen’s behalf. He explains:</p><p><i>“Why does Brad deserve a Book Bomb?</i></p><p><i><br> </br></i><i>“First off, he’s actually an extremely good writer. Brad is the guy<br> who was nominated for the Hugo, Campbell, and Nebula award, all at the<br> same time, and who was then swiftly attacked, maligned, and sabotaged by<br> the inner clique of literati douchebags because he was 1. Military. 2.<br> An outspoken conservative. 3. Openly religious. 4. White and thus<br> incapable of being a ”real” writer.” </br></br></br></br></br></i></p></div>",
  "content_text": "Brad Torgersen is an award-winning author who was nominated for the Campbell, Hugo, and Nebula awards in 2012.  Due to his failure to be sufficiently vibrant, irreligious, or other adjective indicative of the Left’s various totems, he found himself\nthe subject of an SFWA hate campaign\nto deny him the awards which bore certain similarities to my own experience with that organization. Review volunteers are now in, thank you.\nLights in the Deep\nis the product of three years of effort, plus one long summer of editing, proofing, packaging, and wrap-up.  It contains ten different pieces of short science fiction, all previously published in either\nAnalog\nmagazine, Orson Scott Card’s\nInterGalactic Medicine Show\nmagazine, or\nL. Ron Hubbard Presents Writers and Illustrators of the Future, vol. XXVI.\nThis collection is my first “best of” album, and features my Writers of the Future award winner, my\nAnalog\nreaders’ choice award winner, and my Hugo and Nebula nominee.\nI believe my job is to entertain the reader, and provide the reader with a worthwhile, uplifting experience.  I don’t write stories to shock, challenge, make the reader squirm, or (Lord help us) raise awareness.  I\ndo\nwrite stories with the idea that “scientifiction” is about the science as much as it is about the fiction.  Since Larry Niven was perhaps my most influential template in this regard, I try to tell interesting stories featuring engaging characters, set in universes which are plausibly founded on science as we know it.  And if I stray from science as we know it, I work hard to keep my extrapolations consistent, and only bend the rules if it makes sense for them to be bent.\nIn related news,\nLarry Correia is lighting a fuse\nfor a book bomb on Mr. Torgersen’s behalf. He explains:\n“Why does Brad deserve a Book Bomb?\n“First off, he’s actually an extremely good writer. Brad is the guy\nwho was nominated for the Hugo, Campbell, and Nebula award, all at the\nsame time, and who was then swiftly attacked, maligned, and sabotaged by\nthe inner clique of literati douchebags because he was 1. Military. 2.\nAn outspoken conservative. 3. Openly religious. 4. White and thus\nincapable of being a ”real” writer.”",
  "tags": [
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-16T17:00:00+00:00"
}