{
  "url": "https://voxday.net/2013/09/12/mailvox-run-in-with-mcrapey/",
  "scraped_at": "2025-12-14T22:41:56.127628",
  "title": "Mailvox: a run-in with McRapey",
  "date_display": "September 12, 2013",
  "date_iso": "2013-09-12T13:00:00+00:00",
  "date_from_url": "2013-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Agathis’s initial experience with John Scalzi’s self-vaunted debate skills was quite similar to my own back in 2005:</p><blockquote class=\"tr_bq\"><p> Way back when, I had a blog and posted about Scalzi. He had made some<br> ridiculous argument about those that were all “het up” about<br> homosexuality–that they were, probably, homosexuals themselves. I asked<br> a rhetorical question–“Is Scalzi a bigot?” I answered no, then,<br> because I didn’t know him well. Anyway, he came by the blog and argued<br> with me. Now, at the time, I had quite a bit of respect for him. I liked<br> <i>Old Man’s War</i>, as a fan of Heinlein, and though it didn’t reach that<br> level of quality, it was entertaining.</br></br></br></br></br></br></br></p><p>What resulted was a long<br> conversation where he insulted me over and over again, never read a<br> single post I’d made, argued against strawmen, and showed a disturbing<br> ignorance of what people actually believe. And yes, I do believe he<br> threw around his education credentials. I didn’t bother telling him<br> that I have an MA in a philosophical field as well, because it wouldn’t<br> have mattered to him.</br></br></br></br></br></br></p><p>He tried to argue that it wasn’t insulting<br> to call people gay because he didn’t think there was anything wrong<br> with being gay. So I say, what if I went around saying that all Jews<br> were greedy money-grubbers. He got really offended by that and started<br> insulting me again. I said, hey, I don’t think there’s anything wrong<br> with being a greedy money-grubber. I’m a capitalist. I think that’s when<br> he gave up and went away.</br></br></br></br></br></br></p><p>But after that exchange, I never bought another of his books. I’ve read a few, but I’m not giving this guy money. He’s an idiot.</p><p>He’s<br> got an ego that’s a few times too large for his actual talent. Like<br> those A students who get to college and realize they aren’t actually as<br> good as everyone says, or those singers who go on American Idol and make<br> fools of themselves all the while thinking they’re great. It’s a sad,<br> sad, thing. But after my exchange with him, nothing that’s happened in<br> SFWA since he became president as been any surprise to me.</br></br></br></br></br></br></p></blockquote><p>Agathis picked up on something that a surprising number of people don’t realize about McRapey.  The man is less intelligent than most people assume.  He is considerably less intelligent than most of the people with whom I habitually engage.  He’s not as smart as PZ Myers, Sam Harris, or Richard Dawkins, and you are all familiar with how easily I have dismantled their arguments.  The difficulty in dealing with McRapey is that he seldom presents any actual arguments, he usually just presents assertions sans any logical or evidential support.  Then, when pressed, he makes a credentialist appeal to his college degree.  Not even a PhD or a Masters, just a simple liberal arts BA, as if that’s supposed to impress people who have more advanced or more difficult degrees. And then he flees from public debate while openly banning dissent and criticism from his blog, all to the thunderous foot-thumping approval of his fellow rabbits.</p><p>For those who find it hard to believe that Scalzi isn’t highly intelligent, I suggest asking him for evidence of his National Merit scholarship or his qualification for Mensa.  It seems a little odd that someone who doesn’t hesitate to trumpet his credentials would fail to mention such achievements, and surely someone who asserts a “Scalzi family tradition of blowing the   doors off standardized tests” would have qualified for both, right?</p><p>McRapey’s heavy reliance on his minor academic credential tells us another important thing about him: he is from an environment where going to university was not considered par for the course, so he places a ludicrous amount of importance on it. Once I finish <i>On Sophistical Refutations</i>, I will show that to the extent McRapey learned anything while majoring in philosophy, it was to resort to sophistry rather than genuinely refuting an argument.</p><p>His behavior is fairly typical of men who are raised by women. If such men don’t turn entirely feral, they are taught to believe that the winner of a dispute is the one who comes off as looking better to the crowd rather than the one whose arguments are more closely in line with facts, logic, and reality. </p><p>Also, since he appears to have run out of ideas, I’ve created a template that should save Phoenician a little time in commenting on these regularly scheduled McRapey posts.<br> <i><br/></i><br> <i>“______ mancrush ______ obsession _______ laughing at _______ Dipshit ______ your father_______ jealous ________ self-made ______ lawn ______”</i></br></br></p><p>Speaking of which, does anyone have a reference count?  Have we hit 200 yet?</p></div>",
  "content_text": "Agathis’s initial experience with John Scalzi’s self-vaunted debate skills was quite similar to my own back in 2005:\nWay back when, I had a blog and posted about Scalzi. He had made some\nridiculous argument about those that were all “het up” about\nhomosexuality–that they were, probably, homosexuals themselves. I asked\na rhetorical question–“Is Scalzi a bigot?” I answered no, then,\nbecause I didn’t know him well. Anyway, he came by the blog and argued\nwith me. Now, at the time, I had quite a bit of respect for him. I liked\nOld Man’s War\n, as a fan of Heinlein, and though it didn’t reach that\nlevel of quality, it was entertaining.\nWhat resulted was a long\nconversation where he insulted me over and over again, never read a\nsingle post I’d made, argued against strawmen, and showed a disturbing\nignorance of what people actually believe. And yes, I do believe he\nthrew around his education credentials. I didn’t bother telling him\nthat I have an MA in a philosophical field as well, because it wouldn’t\nhave mattered to him.\nHe tried to argue that it wasn’t insulting\nto call people gay because he didn’t think there was anything wrong\nwith being gay. So I say, what if I went around saying that all Jews\nwere greedy money-grubbers. He got really offended by that and started\ninsulting me again. I said, hey, I don’t think there’s anything wrong\nwith being a greedy money-grubber. I’m a capitalist. I think that’s when\nhe gave up and went away.\nBut after that exchange, I never bought another of his books. I’ve read a few, but I’m not giving this guy money. He’s an idiot.\nHe’s\ngot an ego that’s a few times too large for his actual talent. Like\nthose A students who get to college and realize they aren’t actually as\ngood as everyone says, or those singers who go on American Idol and make\nfools of themselves all the while thinking they’re great. It’s a sad,\nsad, thing. But after my exchange with him, nothing that’s happened in\nSFWA since he became president as been any surprise to me.\nAgathis picked up on something that a surprising number of people don’t realize about McRapey.  The man is less intelligent than most people assume.  He is considerably less intelligent than most of the people with whom I habitually engage.  He’s not as smart as PZ Myers, Sam Harris, or Richard Dawkins, and you are all familiar with how easily I have dismantled their arguments.  The difficulty in dealing with McRapey is that he seldom presents any actual arguments, he usually just presents assertions sans any logical or evidential support.  Then, when pressed, he makes a credentialist appeal to his college degree.  Not even a PhD or a Masters, just a simple liberal arts BA, as if that’s supposed to impress people who have more advanced or more difficult degrees. And then he flees from public debate while openly banning dissent and criticism from his blog, all to the thunderous foot-thumping approval of his fellow rabbits.\nFor those who find it hard to believe that Scalzi isn’t highly intelligent, I suggest asking him for evidence of his National Merit scholarship or his qualification for Mensa.  It seems a little odd that someone who doesn’t hesitate to trumpet his credentials would fail to mention such achievements, and surely someone who asserts a “Scalzi family tradition of blowing the   doors off standardized tests” would have qualified for both, right?\nMcRapey’s heavy reliance on his minor academic credential tells us another important thing about him: he is from an environment where going to university was not considered par for the course, so he places a ludicrous amount of importance on it. Once I finish\nOn Sophistical Refutations\n, I will show that to the extent McRapey learned anything while majoring in philosophy, it was to resort to sophistry rather than genuinely refuting an argument.\nHis behavior is fairly typical of men who are raised by women. If such men don’t turn entirely feral, they are taught to believe that the winner of a dispute is the one who comes off as looking better to the crowd rather than the one whose arguments are more closely in line with facts, logic, and reality.\nAlso, since he appears to have run out of ideas, I’ve created a template that should save Phoenician a little time in commenting on these regularly scheduled McRapey posts.\n“______ mancrush ______ obsession _______ laughing at _______ Dipshit ______ your father_______ jealous ________ self-made ______ lawn ______”\nSpeaking of which, does anyone have a reference count?  Have we hit 200 yet?",
  "tags": [
    "mailvox",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-12T12:00:00+00:00"
}