{
  "url": "https://voxday.net/2013/09/04/mailvox-changing-marke/",
  "scraped_at": "2025-12-14T22:41:02.745453",
  "title": "Mailvox: the changing writer’s market",
  "date_display": "September 4, 2013",
  "date_iso": "2013-09-04T12:15:00+00:00",
  "date_from_url": "2013-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NA writes about his perception of the current hole in the fantasy market:</p><blockquote class=\"tr_bq\"><p> Part of the reason I bought your books, along with Stephen King’s Dark<br> Tower series, was that I got burned by the last two fantasy series I<br> bought.  By which I mean Raymond Feist and George R. R. Martin.  I’ve<br> been looking for a good fantasy series to read and so far yours does not<br> disappoint. Another reason is that I want to write my own.  I figured I should get acquainted with others’ work before I get started.</br></br></br></br></p><p>Since I’ve last been a part of this hobby, there was no such thing as<br> e-books.  I’m way out of touch with the market and where it’s headed, as<br> far as it would concern a writer.  I’m also not aiming to become the<br> Next Big Thing in fantasy, but I’d still like to get published. I know it’s kind of an open ended question, but is<br> there anything I can do to help myself before I start putting words on<br> the screen?  </br></br></br></br></br></p><p>A lot of people like Martin’s<br> work, though I can barely understand why, so I know there’s a market out<br> there for fantasy.  In fact, if A Game of Thrones is considered some of<br> the best right now, then that market still has a gaping hole in it.<br>  People are hungry for fantasy fiction, but as far as I can tell they’re<br> willing to settle for McDonald’s because there’s no Cheesecake Factory<br> in sight. </br></br></br></br></br></br></p><p>If you have a minute, I appreciate your insight.</p></blockquote><p>My primary feeling is that the SF/F market is at a fascinating technologically imposed crossroads.  On the one hand, we have a narrow spectrum professionally published market that is shrinking, where the average advances are considerably smaller than they were, where the stakes are increasingly winner-takes-all, and books such as<i> Redshirts </i>and <i>A Dance with Dragons</i> represent the very best it has to offer.</p><p>And on the other, we have the rise of a broad spectrum independent digital scene where books are of wildly varying quality, the prices are better and many of them are free, there are no gatekeepers, distribution is limited, and it is very difficult for the average author to even let the average reader know his book exists.</p><p>Let’s put some basic facts before the reader. <a href=\"http://whatever.scalzi.com/2013/01/16/the-state-of-a-genre-title-2013/\">John Scalzi reported</a> that Redshirts, the eventual Hugo Award winner written by the industry’s foremost self-promoter and pushed heavily by the biggest publisher in SF/F, sold 35,667 ebooks in its first eight months of release.  That represented 45 percent of the 79,279 sales-to-that-date; the rest were hardcover (34 percent) and audiobook (21 percent).  That’s pretty much the high water mark these days for anyone whose name does not begin with JK, EL, or GRR.  McRapey’s post is uncharacteristically understated, as that is not the state of A genre title, but in terms of 2013, THE genre title.</p><p><i>A Throne of Bones</i> and its satellites, on the other hand, sold 3,865 ebooks in their first eight months of release.  Not bad for a book that has never seen the inside of a bookstore, on the other hand, at barely more than 10 percent of <i>Redshirts </i>ebook sales, it is a comparatively minor blip that is of no possible concern to the mainstream publishers, right?  Well, here is the problem for the publishers.  On a grand total of 13 free Kindle Select days, another 20,274 copies were downloaded from Amazon.</p><p>Now, there isn’t a lot of overlap between the SF reader interested in <i>Redshirts </i>and the EF reader interested in <i>A Throne of Bones</i>.  They are two fairly different markets. But there are probably 10 independent books that are to <i>Redshirts </i>what ATOB is to <i>A Dance with Dragons</i>.  The problem isn’t that the independents are necessarily a threat to the established bestsellers, but that they are standing in the way of the midlist writers as well as the mainstream writers of tomorrow.  And, of course, they are absolutely devastating the average margins.</p><p>If you simply run the numbers, it becomes apparent that the only thing keeping the mainstream publishers alive these days is the fact that Amazon now voluntarily limits its Kindle Select program to five free days per quarter. Readers are readers, after all, their ability to consume books is not infinite, and due to the relative price-elasticity of books, ATOB and its satellites are now reaching one-third as many readers as <i>Redshirts </i>without any marketing, without any press, and without any bookstore distribution.  In fact, were it not for Amazon’s Kindle Select limits, Selenoth could quite reasonably have reached 378,154 readers in the first eight months, nearly five times MORE than <i>Redshirts</i> did.</p><p>This is a game-changer.</p><p>Now, you can certainly point out that I have made considerably less money on my 24,139 copies sold/downloaded than McRapey did on his 79,279 copies sold in the first eight months. But that’s irrelevant and those are just today’s profits anyhow; as Facebook and Twitter have shown, there is considerable value in free users.  The point is that if you’re just getting into the writing game, there is virtually no reason in trying to work within the mainstream publishing model.</p><p>Consider: I did literally nothing to market my book except for publishing the Selenoth satellites. No ads. No billboards. No push from Audible. You can’t buy them anywhere but Amazon. The audiobook doesn’t even exist yet and there will never be a paperback. And yet, all it would take is an easily changed policy on the part of Amazon to permit me to reach more readers than the most relentlessly marketed writer in SF/F today. To cite a concept from Nassim Taleb’s excellent <i>Antifragile</i>, the mainstream publishing industry is EXCEEDINGLY fragile and is totally dependent upon the willingness of Amazon to avoid <i>inadvertently </i>wiping them out. Unless one is already tied to the world of professional publishing for contractual reasons, I see no reason whatsoever to waste any time or effort attempting to enter it.  For all practical intents and purposes, it may not even be there in a few years, so don’t be caught up in thought processes that were last valid three years ago.</p><p>As for the hole in the fantasy market, don’t be misled.  That is an artificial one caused primarily by the ideological biases of the professional publishing gatekeepers and it is being rapidly filled by the independents. In my opinion, NA’s best strategy is to publish as an independent and become a part of that process.  Remember, this is the situation today and future changes look to favor the independents, not the mainstream publishers.</p></div>",
  "content_text": "NA writes about his perception of the current hole in the fantasy market:\nPart of the reason I bought your books, along with Stephen King’s Dark\nTower series, was that I got burned by the last two fantasy series I\nbought.  By which I mean Raymond Feist and George R. R. Martin.  I’ve\nbeen looking for a good fantasy series to read and so far yours does not\ndisappoint. Another reason is that I want to write my own.  I figured I should get acquainted with others’ work before I get started.\nSince I’ve last been a part of this hobby, there was no such thing as\ne-books.  I’m way out of touch with the market and where it’s headed, as\nfar as it would concern a writer.  I’m also not aiming to become the\nNext Big Thing in fantasy, but I’d still like to get published. I know it’s kind of an open ended question, but is\nthere anything I can do to help myself before I start putting words on\nthe screen?\nA lot of people like Martin’s\nwork, though I can barely understand why, so I know there’s a market out\nthere for fantasy.  In fact, if A Game of Thrones is considered some of\nthe best right now, then that market still has a gaping hole in it.\nPeople are hungry for fantasy fiction, but as far as I can tell they’re\nwilling to settle for McDonald’s because there’s no Cheesecake Factory\nin sight.\nIf you have a minute, I appreciate your insight.\nMy primary feeling is that the SF/F market is at a fascinating technologically imposed crossroads.  On the one hand, we have a narrow spectrum professionally published market that is shrinking, where the average advances are considerably smaller than they were, where the stakes are increasingly winner-takes-all, and books such as\nRedshirts\nand\nA Dance with Dragons\nrepresent the very best it has to offer.\nAnd on the other, we have the rise of a broad spectrum independent digital scene where books are of wildly varying quality, the prices are better and many of them are free, there are no gatekeepers, distribution is limited, and it is very difficult for the average author to even let the average reader know his book exists.\nLet’s put some basic facts before the reader.\nJohn Scalzi reported\nthat Redshirts, the eventual Hugo Award winner written by the industry’s foremost self-promoter and pushed heavily by the biggest publisher in SF/F, sold 35,667 ebooks in its first eight months of release.  That represented 45 percent of the 79,279 sales-to-that-date; the rest were hardcover (34 percent) and audiobook (21 percent).  That’s pretty much the high water mark these days for anyone whose name does not begin with JK, EL, or GRR.  McRapey’s post is uncharacteristically understated, as that is not the state of A genre title, but in terms of 2013, THE genre title.\nA Throne of Bones\nand its satellites, on the other hand, sold 3,865 ebooks in their first eight months of release.  Not bad for a book that has never seen the inside of a bookstore, on the other hand, at barely more than 10 percent of\nRedshirts\nebook sales, it is a comparatively minor blip that is of no possible concern to the mainstream publishers, right?  Well, here is the problem for the publishers.  On a grand total of 13 free Kindle Select days, another 20,274 copies were downloaded from Amazon.\nNow, there isn’t a lot of overlap between the SF reader interested in\nRedshirts\nand the EF reader interested in\nA Throne of Bones\n.  They are two fairly different markets. But there are probably 10 independent books that are to\nRedshirts\nwhat ATOB is to\nA Dance with Dragons\n.  The problem isn’t that the independents are necessarily a threat to the established bestsellers, but that they are standing in the way of the midlist writers as well as the mainstream writers of tomorrow.  And, of course, they are absolutely devastating the average margins.\nIf you simply run the numbers, it becomes apparent that the only thing keeping the mainstream publishers alive these days is the fact that Amazon now voluntarily limits its Kindle Select program to five free days per quarter. Readers are readers, after all, their ability to consume books is not infinite, and due to the relative price-elasticity of books, ATOB and its satellites are now reaching one-third as many readers as\nRedshirts\nwithout any marketing, without any press, and without any bookstore distribution.  In fact, were it not for Amazon’s Kindle Select limits, Selenoth could quite reasonably have reached 378,154 readers in the first eight months, nearly five times MORE than\nRedshirts\ndid.\nThis is a game-changer.\nNow, you can certainly point out that I have made considerably less money on my 24,139 copies sold/downloaded than McRapey did on his 79,279 copies sold in the first eight months. But that’s irrelevant and those are just today’s profits anyhow; as Facebook and Twitter have shown, there is considerable value in free users.  The point is that if you’re just getting into the writing game, there is virtually no reason in trying to work within the mainstream publishing model.\nConsider: I did literally nothing to market my book except for publishing the Selenoth satellites. No ads. No billboards. No push from Audible. You can’t buy them anywhere but Amazon. The audiobook doesn’t even exist yet and there will never be a paperback. And yet, all it would take is an easily changed policy on the part of Amazon to permit me to reach more readers than the most relentlessly marketed writer in SF/F today. To cite a concept from Nassim Taleb’s excellent\nAntifragile\n, the mainstream publishing industry is EXCEEDINGLY fragile and is totally dependent upon the willingness of Amazon to avoid\ninadvertently\nwiping them out. Unless one is already tied to the world of professional publishing for contractual reasons, I see no reason whatsoever to waste any time or effort attempting to enter it.  For all practical intents and purposes, it may not even be there in a few years, so don’t be caught up in thought processes that were last valid three years ago.\nAs for the hole in the fantasy market, don’t be misled.  That is an artificial one caused primarily by the ideological biases of the professional publishing gatekeepers and it is being rapidly filled by the independents. In my opinion, NA’s best strategy is to publish as an independent and become a part of that process.  Remember, this is the situation today and future changes look to favor the independents, not the mainstream publishers.",
  "tags": [
    "mailvox",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-04T11:15:00+00:00"
}