{
  "url": "https://voxday.net/2013/09/14/mailvox-i-want-to-homeschool-bu/",
  "scraped_at": "2025-12-14T22:42:12.530868",
  "title": "Mailvox: I want to homeschool, but….",
  "date_display": "September 14, 2013",
  "date_iso": "2013-09-14T17:25:00+00:00",
  "date_from_url": "2013-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>WK has a problem getting his boy to listen and obey:</p><blockquote class=\"tr_bq\"><p>  I have a 5 year old boy in a private Montessori school<br> because I failed to produce results at home.  I and my wife worked with<br> him using a montessori type home method. We spent quite a bit of time<br> and money getting the tools and setup right for him.  What is obvious to<br> me now is that he listens and pays more attention to other teachers in<br> his life other than us, the parents.  For example, I had been trying all<br> summer last year and this year to teach hold his breath underwater.  I<br> signed him up for swimming lessons with the schools in August.  He met<br> his teacher, an 18 year old girl, for about a minute.  She jumped in and<br> had my son jumping in the pool and holding his breath underwater in<br> about 10 seconds.  Talking with other parents I know, what I experienced<br> appears to be fairly common.  I am not sure if there is word for what I<br> described above, but there should be for this concept.  I quick search<br> through the homeschool blogs looking for answers and the most common<br> answer appears to be a shaming of the parent that they can’t get their<br> child to listen to them.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>I quote: <i>“You are the parent and it is your responsibility to<br> train your children to listen to you. Whether you homeschool or not,<br> they should be respectful and attentive to you.”</br></br></i></p><p>That’s<br> all fine and dandy, but I can’t be accused of not putting enough time,<br> research, love and effort into getting my child to listen to me and<br> homeschool.  I don’t have results from my work with my son.  You can’t<br> help but notice that at his montessori school he listens to his teacher<br> and does his work great.  (The school has an open door policy with<br> parents to come and see how their kids are doing).  I think that the<br> above must be a common problem for homoeschooled kids based on my limited experience.  How am I to get my kids to homeschool effectively? <br> Otherwise I am going to be school poor sending my kids to private<br> school to avoid the slaughter at public school.  Quite honestly, a<br> private montessori school will still have its problems too.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I’m going to have to turn it over to the Dread Ilk on this one. I have no problem getting my kids to listen to me and neither does Spacebunny. Of course, I never had any problem getting 35 kids between 6-8 to do exactly what I told them to do at soccer practice either.<br> Since the kid is only five, it seems unlikely that rebellion is the issue.  My guess is that the boy knows his parents love him and he has reason to believe that he has veto on anything they tell him. For example, if my kids had resisted jumping in the pool, I’d simply have thrown them in. I don’t know if WK tried that or not, but I find it hard to imagine that anyone could spend months trying, and failing, to get a kid to jump in the pool unless he never just threw the kid in.</br></p><p>In most cases, a parental inability to command obedience is a parental failure to demand it.  I say this, not to shame, but to point out that the problem is likely related to expectations and communication. As long as the father offers the child a choice, he can’t fault the kid for choosing the option that the father doesn’t want. If it’s not your intention to let the child choose, then don’t pretend to give him an option.</p><p>And the correct response to “But I don’t want to” is “I didn’t ask for your opinion, I told you what to do.  Now do it.”</p></div>",
  "content_text": "WK has a problem getting his boy to listen and obey:\nI have a 5 year old boy in a private Montessori school\nbecause I failed to produce results at home.  I and my wife worked with\nhim using a montessori type home method. We spent quite a bit of time\nand money getting the tools and setup right for him.  What is obvious to\nme now is that he listens and pays more attention to other teachers in\nhis life other than us, the parents.  For example, I had been trying all\nsummer last year and this year to teach hold his breath underwater.  I\nsigned him up for swimming lessons with the schools in August.  He met\nhis teacher, an 18 year old girl, for about a minute.  She jumped in and\nhad my son jumping in the pool and holding his breath underwater in\nabout 10 seconds.  Talking with other parents I know, what I experienced\nappears to be fairly common.  I am not sure if there is word for what I\ndescribed above, but there should be for this concept.  I quick search\nthrough the homeschool blogs looking for answers and the most common\nanswer appears to be a shaming of the parent that they can’t get their\nchild to listen to them.\nI quote:\n“You are the parent and it is your responsibility to\ntrain your children to listen to you. Whether you homeschool or not,\nthey should be respectful and attentive to you.”\nThat’s\nall fine and dandy, but I can’t be accused of not putting enough time,\nresearch, love and effort into getting my child to listen to me and\nhomeschool.  I don’t have results from my work with my son.  You can’t\nhelp but notice that at his montessori school he listens to his teacher\nand does his work great.  (The school has an open door policy with\nparents to come and see how their kids are doing).  I think that the\nabove must be a common problem for homoeschooled kids based on my limited experience.  How am I to get my kids to homeschool effectively?\nOtherwise I am going to be school poor sending my kids to private\nschool to avoid the slaughter at public school.  Quite honestly, a\nprivate montessori school will still have its problems too.\nI’m going to have to turn it over to the Dread Ilk on this one. I have no problem getting my kids to listen to me and neither does Spacebunny. Of course, I never had any problem getting 35 kids between 6-8 to do exactly what I told them to do at soccer practice either.\nSince the kid is only five, it seems unlikely that rebellion is the issue.  My guess is that the boy knows his parents love him and he has reason to believe that he has veto on anything they tell him. For example, if my kids had resisted jumping in the pool, I’d simply have thrown them in. I don’t know if WK tried that or not, but I find it hard to imagine that anyone could spend months trying, and failing, to get a kid to jump in the pool unless he never just threw the kid in.\nIn most cases, a parental inability to command obedience is a parental failure to demand it.  I say this, not to shame, but to point out that the problem is likely related to expectations and communication. As long as the father offers the child a choice, he can’t fault the kid for choosing the option that the father doesn’t want. If it’s not your intention to let the child choose, then don’t pretend to give him an option.\nAnd the correct response to “But I don’t want to” is “I didn’t ask for your opinion, I told you what to do.  Now do it.”",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-14T16:25:00+00:00"
}