{
  "url": "https://voxday.net/2013/09/18/more-gasoline/",
  "scraped_at": "2025-12-14T22:42:42.259997",
  "title": "More gasoline",
  "date_display": "September 18, 2013",
  "date_iso": "2013-09-18T20:10:00+00:00",
  "date_from_url": "2013-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>With the flames threatening to die down, Ben Bernanke decides to <a href=\"http://finance.yahoo.com/news/fed-delays-bond-tapering-wants-180106376.html\">pour more on the fire</a>:</p><blockquote class=\"tr_bq\"><p> The Federal Reserve has decided against reducing its stimulus for the<br> U.S. economy, saying it will continue to buy $85 billion a month in<br> bonds because it thinks the economy still needs the support. The Fed said in a statement Wednesday that it held off on tapering<br> because it wants to see more conclusive evidence that the recovery will<br> be sustained. Stocks spiked after the Fed released the statement at the end of its two-day policy meeting.</br></br></br></br></p></blockquote><p>(laughs) Apparently the Fed lost their nerve when they saw stocks plunging in anticipation of the end of QE IV. The Fed knows deflation and credit collapse is lurking right around the corner and they are desperately attempting to stave it off. What they think will save them, I don’t know, but we appear to be rapidly approaching a potentially critical nexus with prospective war in Syria, yet another debt ceiling showdown with the Republicans running the risk of looking even more foolish than they usually do when they cave for a third straight year, and the possibility of a Hultgreen-Curie scenario at the Fed.</p></div>",
  "content_text": "With the flames threatening to die down, Ben Bernanke decides to\npour more on the fire\n:\nThe Federal Reserve has decided against reducing its stimulus for the\nU.S. economy, saying it will continue to buy $85 billion a month in\nbonds because it thinks the economy still needs the support. The Fed said in a statement Wednesday that it held off on tapering\nbecause it wants to see more conclusive evidence that the recovery will\nbe sustained. Stocks spiked after the Fed released the statement at the end of its two-day policy meeting.\n(laughs) Apparently the Fed lost their nerve when they saw stocks plunging in anticipation of the end of QE IV. The Fed knows deflation and credit collapse is lurking right around the corner and they are desperately attempting to stave it off. What they think will save them, I don’t know, but we appear to be rapidly approaching a potentially critical nexus with prospective war in Syria, yet another debt ceiling showdown with the Republicans running the risk of looking even more foolish than they usually do when they cave for a third straight year, and the possibility of a Hultgreen-Curie scenario at the Fed.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-18T19:10:00+00:00"
}