{
  "url": "https://voxday.net/2013/09/13/nsa-treason/",
  "scraped_at": "2025-12-14T22:42:07.125239",
  "title": "NSA treason",
  "date_display": "September 13, 2013",
  "date_iso": "2013-09-13T17:00:00+00:00",
  "date_from_url": "2013-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It should be interesting to see how deeply <a href=\"http://arstechnica.com/tech-policy/2013/09/nsa-hands-over-data-on-signals-intelligence-data-to-israel/\">the latest Snowden revelation</a> concerning systemic Israeli spying on US citizens gets buried by the mainstream media:</p><blockquote class=\"tr_bq\"><p> Since 2009, the National Security Agency (NSA) has been sharing raw signals intelligence (SIGINT), including information about specific US people, directly with Israel’s counterpart to the NSA, The Guardian reported on Wednesday. The British newspaper’s revelation comes once again from the documents provided by former NSA contractor Edward Snowden to American journalists Glenn Greenwald and Laura Poitras.</p><p>According to the five-page memorandum of understanding, the agreement appears to be a one-way street. Israel, at least as far as this document is concerned, is not obligated to reciprocate….</p><p>The NSA knew that the Israelis might be looking at information about<br> US citizens—but they wanted to make sure that US government employees<br> weren’t snooped on. According to the document, Israel must immediately destroy any<br> communication that is “to or from an official of the US Government,”<br> including anyone from the executive, legislative, or judicial system,<br> “independent of seniority or position.”</br></br></br></br></br></p><p>Despite the cooperation, Israel is viewed as more of a “frenemey” than a close ally. <em>The Guardian</em><br> also quoted from, but did not publish, what it described as “another<br> top secret document” from 2008, where a “senior NSA official points out<br> that Israel aggressively spies on the US.”</br></br></br></p></blockquote><p>It should be informative to learn precisely who at the NSA was responsible for producing this memorandum of understanding. I expect it’s probably a group of Scots-Irish employees who are completely and singularly loyal to the American national interest.</p><p>And I’m certain the Israelis have been fastidious about destroying every email to or from a U.S. politician.</p></div>",
  "content_text": "It should be interesting to see how deeply\nthe latest Snowden revelation\nconcerning systemic Israeli spying on US citizens gets buried by the mainstream media:\nSince 2009, the National Security Agency (NSA) has been sharing raw signals intelligence (SIGINT), including information about specific US people, directly with Israel’s counterpart to the NSA, The Guardian reported on Wednesday. The British newspaper’s revelation comes once again from the documents provided by former NSA contractor Edward Snowden to American journalists Glenn Greenwald and Laura Poitras.\nAccording to the five-page memorandum of understanding, the agreement appears to be a one-way street. Israel, at least as far as this document is concerned, is not obligated to reciprocate….\nThe NSA knew that the Israelis might be looking at information about\nUS citizens—but they wanted to make sure that US government employees\nweren’t snooped on. According to the document, Israel must immediately destroy any\ncommunication that is “to or from an official of the US Government,”\nincluding anyone from the executive, legislative, or judicial system,\n“independent of seniority or position.”\nDespite the cooperation, Israel is viewed as more of a “frenemey” than a close ally.\nThe Guardian\nalso quoted from, but did not publish, what it described as “another\ntop secret document” from 2008, where a “senior NSA official points out\nthat Israel aggressively spies on the US.”\nIt should be informative to learn precisely who at the NSA was responsible for producing this memorandum of understanding. I expect it’s probably a group of Scots-Irish employees who are completely and singularly loyal to the American national interest.\nAnd I’m certain the Israelis have been fastidious about destroying every email to or from a U.S. politician.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-13T16:00:00+00:00"
}