{
  "url": "https://voxday.net/2013/09/17/obama-openly-aiding-muslim-terrorists/",
  "scraped_at": "2025-12-14T22:42:32.971102",
  "title": "Obama openly aiding Muslim terrorists",
  "date_display": "September 17, 2013",
  "date_iso": "2013-09-17T13:00:00+00:00",
  "date_from_url": "2013-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This action <a href=\"http://washingtonexaminer.com/obama-waives-ban-on-arming-terrorists-to-allow-aid-to-syrian-opposition/article/2535885\">is unlikely to help</a> convince those who believe the man is still a secret Muslim that they are incorrect:</p><blockquote class=\"tr_bq\"><p> President Obama waived a provision of federal law designed to prevent<br> the supply of arms to terrorist groups to clear the way for the U.S. to<br> provide military assistance to “vetted” opposition groups fighting<br> Syrian dictator Bashar Assad.</br></br></br></p><p>Some elements of the Syrian opposition are associated with radical<br> Islamic terrorist groups, including al Qaeda, which was responsible for<br> the Sept. 11 attacks in New York, Washington, D.C., and Shanksville,<br> Pa., in 2001. Assad’s regime is backed by Iran and Hezbollah.</br></br></br></p><p>The president, citing his authority under the Arms Export Control<br> Act, announced today that he would “waive the prohibitions in sections<br> 40 and 40A of the AECA related to such a transaction.”  Those two<br> sections prohibit sending weaponry to countries described in section<br> 40(d): “The prohibitions contained in this section apply with respect to<br> a country if the Secretary of State determines that the government of<br> that country has repeatedly provided support for acts of international<br> terrorism,” Congress stated in the Arms Control Export Act.</br></br></br></br></br></br></br></p><p>“For purposes of this subsection, such acts shall include all<br> activities that the Secretary determines willfully aid or abet the<br> international proliferation of nuclear explosive devices to individuals<br> or groups or willfully aid or abet an individual or groups in acquiring<br> unsafeguarded special nuclear material,” the law continues.</br></br></br></br></p></blockquote><p> “The law allows the president to waive those prohibitions if he<br> “determines that the transaction is essential to the national security<br> interests of the United States.”” Either Obama is lying and arming terrorists is not in the national security interests of the United States, or worse, those interests are in direct opposition to the national security interests of the American people.</br></br></p></div>",
  "content_text": "This action\nis unlikely to help\nconvince those who believe the man is still a secret Muslim that they are incorrect:\nPresident Obama waived a provision of federal law designed to prevent\nthe supply of arms to terrorist groups to clear the way for the U.S. to\nprovide military assistance to “vetted” opposition groups fighting\nSyrian dictator Bashar Assad.\nSome elements of the Syrian opposition are associated with radical\nIslamic terrorist groups, including al Qaeda, which was responsible for\nthe Sept. 11 attacks in New York, Washington, D.C., and Shanksville,\nPa., in 2001. Assad’s regime is backed by Iran and Hezbollah.\nThe president, citing his authority under the Arms Export Control\nAct, announced today that he would “waive the prohibitions in sections\n40 and 40A of the AECA related to such a transaction.”  Those two\nsections prohibit sending weaponry to countries described in section\n40(d): “The prohibitions contained in this section apply with respect to\na country if the Secretary of State determines that the government of\nthat country has repeatedly provided support for acts of international\nterrorism,” Congress stated in the Arms Control Export Act.\n“For purposes of this subsection, such acts shall include all\nactivities that the Secretary determines willfully aid or abet the\ninternational proliferation of nuclear explosive devices to individuals\nor groups or willfully aid or abet an individual or groups in acquiring\nunsafeguarded special nuclear material,” the law continues.\n“The law allows the president to waive those prohibitions if he\n“determines that the transaction is essential to the national security\ninterests of the United States.”” Either Obama is lying and arming terrorists is not in the national security interests of the United States, or worse, those interests are in direct opposition to the national security interests of the American people.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-17T12:00:00+00:00"
}