{
  "url": "https://voxday.net/2013/09/10/obama-unleashes-jews/",
  "scraped_at": "2025-12-14T22:41:45.816493",
  "title": "Obama turns to the Jews",
  "date_display": "September 10, 2013",
  "date_iso": "2013-09-10T14:18:00+00:00",
  "date_from_url": "2013-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times reports that because the American people have made their opposition to the war clear, <a href=\"http://www.nytimes.com/2013/09/10/world/middleeast/lobbying-group-for-israel-to-press-congress-on-syria.html?hp\">Obama is using the Jewish lobby</a> to lean upon Congress:</p><blockquote class=\"tr_bq\"><p> The American Israel Public Affairs Committee, the powerful pro-Israel<br> lobby in Washington, plans to dispatch 300 of its members to Capitol<br> Hill on Tuesday as part of a broad campaign to press Congress to back<br> President Obama’s proposed strike on Syria, the group said Monday….</br></br></br></p><p> Mr. Obama and his secretary of state have repeatedly invoked Israel in their arguments for a strike. The White House has reached out to Aipac, as well as to the Anti-Defamation League and the Conference of Presidents of Major American Jewish Organizations, who held a conference call on Monday to discuss lobbying strategy.</p><p>Alon Pinkas, a former Israeli consul general in New York, said five members of Congress had called to consult with him in the past four days.</p><p>“There’s nothing sinister, nothing conspiratorial, nothing wrong with the lobbying arm relating to Israel and the Middle East supporting the president on this issue,” said Abraham H. Foxman, the Anti-Defamation League’s national director. “You don’t need a phone call from the prime minister to understand that Israel’s interest is with the United States taking military action because it’s a message to Iran. You don’t have to be a nuclear physicist to figure out where Israel stands.”</p></blockquote><p>Abe Foxman can tell himself that there is nothing wrong if he likes. But the fact remains that Obama is openly attempting to use the Jewish lobby to supersede the clearly expressed will of the American people to leave Syria alone. And my impression is that it would not be good for the Jews in America for that lobby to demonstrate that Congress is, as some observers have put it, Israeli-occupied territory.</p><p>Israeli diplomat Zvi Rafiah is correct to be concerned: “We should not be the one that pushes the American people to do or not do anything they want or don’t want.”</p><p>The ADL’s Foxman may be right to say  “Israel’s interest is with the United States taking military action”. The problem is that it is clearly not in the American interest, and AIPAC, the ADL, and the Conference of Presidents are demonstrating that organized Jewish opinion cannot be trusted to put American interests ahead of Israeli ones.</p></div>",
  "content_text": "The New York Times reports that because the American people have made their opposition to the war clear,\nObama is using the Jewish lobby\nto lean upon Congress:\nThe American Israel Public Affairs Committee, the powerful pro-Israel\nlobby in Washington, plans to dispatch 300 of its members to Capitol\nHill on Tuesday as part of a broad campaign to press Congress to back\nPresident Obama’s proposed strike on Syria, the group said Monday….\nMr. Obama and his secretary of state have repeatedly invoked Israel in their arguments for a strike. The White House has reached out to Aipac, as well as to the Anti-Defamation League and the Conference of Presidents of Major American Jewish Organizations, who held a conference call on Monday to discuss lobbying strategy.\nAlon Pinkas, a former Israeli consul general in New York, said five members of Congress had called to consult with him in the past four days.\n“There’s nothing sinister, nothing conspiratorial, nothing wrong with the lobbying arm relating to Israel and the Middle East supporting the president on this issue,” said Abraham H. Foxman, the Anti-Defamation League’s national director. “You don’t need a phone call from the prime minister to understand that Israel’s interest is with the United States taking military action because it’s a message to Iran. You don’t have to be a nuclear physicist to figure out where Israel stands.”\nAbe Foxman can tell himself that there is nothing wrong if he likes. But the fact remains that Obama is openly attempting to use the Jewish lobby to supersede the clearly expressed will of the American people to leave Syria alone. And my impression is that it would not be good for the Jews in America for that lobby to demonstrate that Congress is, as some observers have put it, Israeli-occupied territory.\nIsraeli diplomat Zvi Rafiah is correct to be concerned: “We should not be the one that pushes the American people to do or not do anything they want or don’t want.”\nThe ADL’s Foxman may be right to say  “Israel’s interest is with the United States taking military action”. The problem is that it is clearly not in the American interest, and AIPAC, the ADL, and the Conference of Presidents are demonstrating that organized Jewish opinion cannot be trusted to put American interests ahead of Israeli ones.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-10T13:18:00+00:00"
}