{
  "url": "https://voxday.net/2013/09/26/racism-in-israe/",
  "scraped_at": "2025-12-14T22:43:27.794383",
  "title": "Racism in Israel",
  "date_display": "September 26, 2013",
  "date_iso": "2013-09-26T08:43:00+00:00",
  "date_from_url": "2013-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thoughts on <a href=\"http://972mag.com/thoughts-on-an-attack-by-a-jewish-mob/46684/\">an attack by a Jewish mob</a>:</p><blockquote class=\"tr_bq\"><p> I went to a demonstration led by MK Michael Ben-Ari two<br> days ago (Tuesday), and was joined by my girlfriend, Galina. Ben-Ari, a<br> Kahanist, was inciting the crowd against the African refugees in a<br> distinctly anti-Semitic manner, peppering his talk with incessant<br> references to excrement and urine. At some point, Galina couldn’t take<br> it any longer, and shouted something back.</br></br></br></br></br></p><p>Within minutes we were surrounded by an angry mob of about<br> 20 people, composed mostly of women, who hurled curses at her. Someone<br> pulled out a tear gas canister and waved it at her face.</br></br></p><p>Racist and sexual slurs filled the air repeatedly. Time and time again,<br> people expressed the wish she would be raped by Sudanese, and asked her<br> if she was bedding them. A boy, between 10 and 11 years old, screamed at<br> her point blank that what she needs is a “nigger’s cock.” <a href=\"https://twitter.com/#%21/davidsheen\">David Sheen</a> videotaped much of it….</br></br></br></p><p>We tried to get out of the market. The mob was screaming with glee that<br> she was being arrested. More spitting and curses. A woman aimed a kick<br> at Galina’s head from behind her, I blocked the kick with a snarl. She<br> was smiling. On the way to the train station we were attacked,<br> physically, by a hoodlum, and as I was trying to get in between him and<br> Galina after he hit me in the back, I decided that if he attacks me<br> again, I’d take the metal part of the camera and smash it into his jaw,<br> and take my chances with the police later.</br></br></br></br></br></br></br></p></blockquote><p>Perhaps someone should alert the Southern Poverty Law Council about this violently racist, anti-semitic hate mob.  I find it telling how differently many Jews feel when it is their own country that is a migratory destination for African refugees than when it is America or other countries in the West that are serving as the migratory destination.</p><p>Whatever happened to diversity being Israel’s strength, the importance of multiculturalism, and the manifold ways in which African and Arab immigrants will strengthen and enrich Israel? Whatever happened to the melting pot – a Jewish concept, not an American one, as it happens – to say nothing of the moral imperative of embracing the poor and downtrodden immigrants?</p><p>Do not the Sudanese refugees have precisely the same right to live in Israel that Jews do to live in America, Germany, France, England, and every other country into which they have migrated in the past?</p><p>Now, being a sovereign nation, Israel has the right to bar non-Jews from residing in their country. However, this necessarily requires that non-Jewish countries have the right to bar Jews from residing in their countries.</p></div>",
  "content_text": "Thoughts on\nan attack by a Jewish mob\n:\nI went to a demonstration led by MK Michael Ben-Ari two\ndays ago (Tuesday), and was joined by my girlfriend, Galina. Ben-Ari, a\nKahanist, was inciting the crowd against the African refugees in a\ndistinctly anti-Semitic manner, peppering his talk with incessant\nreferences to excrement and urine. At some point, Galina couldn’t take\nit any longer, and shouted something back.\nWithin minutes we were surrounded by an angry mob of about\n20 people, composed mostly of women, who hurled curses at her. Someone\npulled out a tear gas canister and waved it at her face.\nRacist and sexual slurs filled the air repeatedly. Time and time again,\npeople expressed the wish she would be raped by Sudanese, and asked her\nif she was bedding them. A boy, between 10 and 11 years old, screamed at\nher point blank that what she needs is a “nigger’s cock.”\nDavid Sheen\nvideotaped much of it….\nWe tried to get out of the market. The mob was screaming with glee that\nshe was being arrested. More spitting and curses. A woman aimed a kick\nat Galina’s head from behind her, I blocked the kick with a snarl. She\nwas smiling. On the way to the train station we were attacked,\nphysically, by a hoodlum, and as I was trying to get in between him and\nGalina after he hit me in the back, I decided that if he attacks me\nagain, I’d take the metal part of the camera and smash it into his jaw,\nand take my chances with the police later.\nPerhaps someone should alert the Southern Poverty Law Council about this violently racist, anti-semitic hate mob.  I find it telling how differently many Jews feel when it is their own country that is a migratory destination for African refugees than when it is America or other countries in the West that are serving as the migratory destination.\nWhatever happened to diversity being Israel’s strength, the importance of multiculturalism, and the manifold ways in which African and Arab immigrants will strengthen and enrich Israel? Whatever happened to the melting pot – a Jewish concept, not an American one, as it happens – to say nothing of the moral imperative of embracing the poor and downtrodden immigrants?\nDo not the Sudanese refugees have precisely the same right to live in Israel that Jews do to live in America, Germany, France, England, and every other country into which they have migrated in the past?\nNow, being a sovereign nation, Israel has the right to bar non-Jews from residing in their country. However, this necessarily requires that non-Jewish countries have the right to bar Jews from residing in their countries.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-26T07:43:00+00:00"
}