{
  "url": "https://voxday.net/2013/09/17/rapeshirts/",
  "scraped_at": "2025-12-14T22:42:34.806763",
  "title": "Rapeshirts",
  "date_display": "September 17, 2013",
  "date_iso": "2013-09-17T17:00:00+00:00",
  "date_from_url": "2013-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><i>Rapeshirts</i></b><br> <i>A novel with three convictions</i><br> By Rose Lapin Troupe</br></br></p><p>Call me Cismale.</p><p>You see, I exemplify the enlightened form of next-generation post-masculine manliness that is superior to even that exhibited by our starship’s captain, James Tiberius Squick, whose galactic fame with women precedes him. As for me, everyone calls me Andee Doll. That’s because despite my gender handicap I can rock a dress like no trans-male’s business. And also, I have some really cute red heels that match the uniform.</p><p>I enlisted in Starfleet after crushing a military<br> recruitment vocational examination. The Dolls have a long tradition of<br> absolutely blowing the doors off vocational assessments and<br> psychological profiles. I’ve only ever failed one, and without going<br> into the details, suffice it to say that little episode was my mother’s<br> fault.</br></br></br></br></br></p><p>Up to 50,000 people per day apply for military enlistment, but only three or four thousand are admitted based on a number of rigorous<br> criteria, not the least of which is a willingness to enlist. That alone<br> puts me in the upper ten percent.</br></br></p><p>My field of training and expertise, as you can surely tell, is<br> statistics, which had a lot to do with how I scored on the vocational<br> test, and also because unfortunately, I washed out of the elite astrology<br> course required for officers. There’s no shame in that, of course. 95 percent of applicants fail, if<br> you include those who don’t apply, and the two percent who do pass it<br> obviously buy their way through, utilizing their straight white male privilege courtesy of intact white families free<br> of the burden of poverty.</br></br></br></br></br></br></p><p>Or maybe it was astronomy. It is a very technical field. Anyway, I mean the one that teaches you about stars.</p><p>Even<br> my best friend, Squeequeg, didn’t make it through astrology or whatever<br> it is called, and he’s a huge, huge, huge science fiction fan. He’s<br> read everything, I swear, even some of that Asimov guy. In fact, no one<br> knows more about science fiction books than Squeequeg, and he taught<br> me everything I know about the subject.</br></br></br></br></br></p><p>“Vance is overrated,” says Squeequeg, “his women are two-dimensional.”</p><p>See? He’s read a lot of books. I had never even heard of Jeff Vance before I met Squeequeg.</p><p>That might be because I didn’t enlist for the literary enlightenment. I didn’t enlist for the exploration, the honor, or the money.</p><p>I signed up to boldly go where no Man has consensually gone before.</p><p>The details of how I do this are not particularly important at the moment, but I will say that it can get pretty damn boring<br> in all those advanced landing parties, doing our level best to advance the Female Imperative, police all mixed-gender gatherings, and empower women throughout the galaxy, whether they want empowerment or not.</br></p><p>Unfortunately, the Female Imperative has no bearing on Captain Squick, as alien cis-females seem to have this habit of falling naked onto his thick, massive, sweat-beaded, throbbing<br> member, (or so I imagine when I’m in my bunk), but, because he’s so damned dudebroish about<br> things, he gets away with it without so much as a reprimand from the Admiral, who will flip out and kick a lesser cis-male’s ass without even thinking twice about it. She’s so crazy and full of pure awesome that she totally uppercut some lieutenant just because the kid opened a window.</br></br></p><p>(Granted, it’s dangerous to open a window in space, which I know because I asked some people who have a bachelor’s degree in astrophysics about it, but even so, it was totally sweet. I’m not afraid to admit it; I squeed just watching her.)</p><p>Me and my group of enlisted chums have an entirely different perspective than the<br> dudebros who think they are running the ship. They don’t know it yet, but we are totally going to upset the<br> order of things, in the name of equality, in the name of justice, in the<br> name of empowerment, and in the name of finding our rightful place in the social order which doesn’t exist at the very<br> tippy top, as our intelligence, and degrees and purity of mind dictate.</br></br></br></br></p><p>This is our story.</p></div>",
  "content_text": "Rapeshirts\nA novel with three convictions\nBy Rose Lapin Troupe\nCall me Cismale.\nYou see, I exemplify the enlightened form of next-generation post-masculine manliness that is superior to even that exhibited by our starship’s captain, James Tiberius Squick, whose galactic fame with women precedes him. As for me, everyone calls me Andee Doll. That’s because despite my gender handicap I can rock a dress like no trans-male’s business. And also, I have some really cute red heels that match the uniform.\nI enlisted in Starfleet after crushing a military\nrecruitment vocational examination. The Dolls have a long tradition of\nabsolutely blowing the doors off vocational assessments and\npsychological profiles. I’ve only ever failed one, and without going\ninto the details, suffice it to say that little episode was my mother’s\nfault.\nUp to 50,000 people per day apply for military enlistment, but only three or four thousand are admitted based on a number of rigorous\ncriteria, not the least of which is a willingness to enlist. That alone\nputs me in the upper ten percent.\nMy field of training and expertise, as you can surely tell, is\nstatistics, which had a lot to do with how I scored on the vocational\ntest, and also because unfortunately, I washed out of the elite astrology\ncourse required for officers. There’s no shame in that, of course. 95 percent of applicants fail, if\nyou include those who don’t apply, and the two percent who do pass it\nobviously buy their way through, utilizing their straight white male privilege courtesy of intact white families free\nof the burden of poverty.\nOr maybe it was astronomy. It is a very technical field. Anyway, I mean the one that teaches you about stars.\nEven\nmy best friend, Squeequeg, didn’t make it through astrology or whatever\nit is called, and he’s a huge, huge, huge science fiction fan. He’s\nread everything, I swear, even some of that Asimov guy. In fact, no one\nknows more about science fiction books than Squeequeg, and he taught\nme everything I know about the subject.\n“Vance is overrated,” says Squeequeg, “his women are two-dimensional.”\nSee? He’s read a lot of books. I had never even heard of Jeff Vance before I met Squeequeg.\nThat might be because I didn’t enlist for the literary enlightenment. I didn’t enlist for the exploration, the honor, or the money.\nI signed up to boldly go where no Man has consensually gone before.\nThe details of how I do this are not particularly important at the moment, but I will say that it can get pretty damn boring\nin all those advanced landing parties, doing our level best to advance the Female Imperative, police all mixed-gender gatherings, and empower women throughout the galaxy, whether they want empowerment or not.\nUnfortunately, the Female Imperative has no bearing on Captain Squick, as alien cis-females seem to have this habit of falling naked onto his thick, massive, sweat-beaded, throbbing\nmember, (or so I imagine when I’m in my bunk), but, because he’s so damned dudebroish about\nthings, he gets away with it without so much as a reprimand from the Admiral, who will flip out and kick a lesser cis-male’s ass without even thinking twice about it. She’s so crazy and full of pure awesome that she totally uppercut some lieutenant just because the kid opened a window.\n(Granted, it’s dangerous to open a window in space, which I know because I asked some people who have a bachelor’s degree in astrophysics about it, but even so, it was totally sweet. I’m not afraid to admit it; I squeed just watching her.)\nMe and my group of enlisted chums have an entirely different perspective than the\ndudebros who think they are running the ship. They don’t know it yet, but we are totally going to upset the\norder of things, in the name of equality, in the name of justice, in the\nname of empowerment, and in the name of finding our rightful place in the social order which doesn’t exist at the very\ntippy top, as our intelligence, and degrees and purity of mind dictate.\nThis is our story.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-17T16:00:00+00:00"
}