{
  "url": "https://voxday.net/2013/09/28/rebelling-against-academic-tyranny/",
  "scraped_at": "2025-12-14T22:43:41.237238",
  "title": "Rebelling against academic tyranny",
  "date_display": "September 28, 2013",
  "date_iso": "2013-09-28T08:43:00+00:00",
  "date_from_url": "2013-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A graduate student at the University of Wisconsin-Madison rejects the university’s right <a href=\"http://www.thecollegefix.com/post/14698/\">to subject him to mandatory re-education sessions</a>. It’s encouraging to note that more and more people are becoming inured to being labeled by the Left and are no longer bothering to engage in the popular conservative appeasement dance of “but I’m not, I’m really not!”</p><p><i>    Dear Graduate Director Prof. Kantrowitz,</i></p><p>    Please forgive this sudden e-mail. I am writing to you today about the “diversity” training that new teaching assistants (TAs) are required to undergo. In keeping with the spirit of the Wisconsin Idea, I am also blind-copying on this e-mail several journalistic outlets and state government officials, because the taxpayers who support this university deserve to know how their money is being spent.</p><p>    As you are probably aware, all new TAs in the History Department are required to attend one orientation session, two TA training sessions, and two diversity sessions. Yesterday (Friday, September 20th), we new TAs attended the first of the diversity sessions. To be quite blunt, I was appalled. What we were given, under the rubric of “diversity,” was an avalanche of insinuations, outright accusations, and suffocating political indoctrination (or, as some of the worksheets revealingly put it, “re-education”) entirely unbecoming a university of our stature.</p><p>    Students at the University of Wisconsin-Madison, and students at probably every other public institution of higher education in this country, have long since grown accustomed to incessant leftism. It is in the very air that we breathe. Bascom Hill, for example, is roped off and the university is shut down so that Barack Obama (D), Mark Pocan (D), and Tammy Baldwin (D) can deliver campaign speeches before election day. (The university kindly helped direct student traffic to these campaign events by sending out a mass e-mail encouraging the student body to go to the Barack Obama for President website and click “I’m In for Barack!” in order to attend.) Marxist diatribes denouncing Christianity, Christians, the United States, and conservatives (I am happy to provide as many examples of this as might be required) are assigned as serious scholarship in seminars. The Teaching Assistants Association (TAA)–which sent out mass e-mails, using History Department list-servs, during the attempt to recall Governor Scott Walker, accusing Gov. Walker of, among other things, being “Nero”–is allowed to address TA and graduate student sessions as a “non-partisan organization”. The History Department sponsors a leftist political rally, along with the Socialist Party of Wisconsin, and advertises for the rally via a departmental e-mail (sent, one presumes, using state computers by employees drawing salaries from a state institution). In short, this university finds it convenient to pretend that it is an apolitical entity, but one need not be particularly astute to perceive that the Madison campus is little more than a think tank for the hard left. Even those who wholeheartedly support this political agenda might in all candor admit that the contours of the leftism here are somewhat less than subtle.</p><p>    At the “diversity” training yesterday, though, even this fig leaf of apoliticism was discarded. In an utterly unprofessional way, the overriding presumption of the session was that the people whom the History Department has chosen to employ as teaching assistants are probably racists. In true “diversity” style, the language in which the presentation was couched was marbled with words like “inclusive”, “respect”, and “justice”. But the tone was unmistakably accusatory and radical. Our facilitator spoke openly of politicizing her classrooms in order to right (take revenge for?) past wrongs. We opened the session with chapter-and-verse quotes from diversity theorists who rehearsed the same tired “power and privilege” cant that so dominates seminar readings and official university hand-wringing over unmet race quotas. Indeed, one mild-mannered Korean woman yesterday felt compelled to insist that she wasn’t a racist. I never imagined that she was, but the atmosphere of the meeting had been so poisoned that even we traditional quarries of the diversity Furies were forced to share our collective guilt with those from continents far across the wine-dark sea.</p><p>    It is hardly surprising that any of us hectorees would feel thusly. For example, in one of the handouts that our facilitator asked us to read (“Detour-Spotting: for white anti-racists,” by joan olsson [sic]), we learned things like, “As white infants we were fed a pabulum of racist propaganda,” “…there was no escaping the daily racist propaganda,” and, perhaps most even-handed of all, “Racism continues in the name of all white people.” Perhaps the Korean woman did not read carefully enough to realize that only white people (all of them, in fact) are racist. Nevertheless, in a manner stunningly redolent of “self-criticism” during the Cultural Revolution in communist China, the implication of the entire session was that everyone was suspect, and everyone had some explaining to do.</p><p>    You have always been very kind to me, Prof. Kantrowitz, so it pains me to ask you this, but is this really what the History Department thinks of me? Is this what you think of me? I am not sure who selected the readings or crafted the itinerary for the diversity session, but, as they must have done so with the full sanction of the History Department, one can only conclude that the Department agrees with such wild accusations, and supports them. Am I to understand that this is how the white people who work in this Department are viewed? If so, I cannot help but wonder why in the world the Department hired any of us in the first place. Would not anyone be better?</p><p>    There is one further issue. At the end of yesterday’s diversity “re-education,” we were told that our next session would include a presentation on “Trans Students”. At that coming session, according to the handout we were given, we will learn how to let students ‘choose their own pronouns’, how to correct other students who mistakenly use the wrong pronouns, and how to ask people which pronouns they prefer (“I use the pronouns he/him/his. I want to make sure I address you correctly. What pronouns do you use?”). Also on the agenda for next week are “important trans struggles, as well as those of the intersexed and other gender-variant communities,” “stand[ing] up to the rules of gender,” and a very helpful glossary of related terms and acronyms, to wit: “Trans”: for those who “identify along the gender-variant spectrum,” and “Genderqueer”: “for those who consider their gender outside the binary gender system”. I hasten to reiterate that I am quoting from diversity handouts; I am not making any of this up.</p><p>    Please allow me to be quite frank. My job, which I love, is to teach students Japanese history. This week, for example, I have been busy explaining the intricacies of the Genpei War (1180-1185), during which time Japan underwent a transition from an earlier, imperial-rule system under regents and cloistered emperors to a medieval, feudal system run by warriors and estate managers. It is an honor and a great joy to teach students the history of Japan. I take my job very seriously, and I look forward to coming to work each day.</p><p>    It is most certainly not my job, though, to cheer along anyone, student or otherwise, in their psychological confusion. I am not in graduate school to learn how to encourage poor souls in their sexual experimentation, nor am I receiving generous stipends of taxpayer monies from the good people of the Great State of Wisconsin to play along with fantasies or accommodate public cross-dressing. To all and sundry alike I explicate, as best I can, such things as the clash between the Taira and the Minamoto, the rise of the Kamakura shogunate, and the decline of the imperial house in twelfth-century Japan. Everyone is welcome in my classroom, but, whether directly or indirectly, I will not implicate myself in my students’ fetishes, whatever those might be. What they do on their own t<br> ime is their business; I will not be a party to it. I am exercising my right here to say, “Enough is enough.” One grows used to being thought a snarling racist–after all, others’ opinions are not my affair–but one draws the line at assisting students in their private proclivities. That is a bridge too far, and one that I, at least, will not cross.</br></p><p>    I regret that this leaves us in an awkward situation. After having been accused of virulent racism and, now, assured that I will next learn how to parse the taxonomy of “Genderqueers”, I am afraid that I will disappoint those who expect me to attend any further diversity sessions. When a Virginia-based research firm came to campus a couple of years ago to present findings from their study of campus diversity, then-Diversity Officer Damon Williams sent a gaggle of shouting, sign-waving undergraduates to the meeting, disrupting the proceedings so badly that the meeting was cancelled. In a final break with such so-called “diversity”, I will not be storming your office or shouting into a megaphone outside your window. Instead, I respectfully inform you hereby that I am disinclined to join in any more mandatory radicalism. I have, thank God, many more important things to do. I also request that diversity training be made optional for all TAs, effective immediately. In my humble opinion, neither the Department nor the university has any right to subject anyone to such intellectual tyranny.</p><p>    Thank you for your patience in reading this long e-mail.</p><p>    Sincerely,</p><p>    Jason Morgan </p></div>",
  "content_text": "A graduate student at the University of Wisconsin-Madison rejects the university’s right\nto subject him to mandatory re-education sessions\n. It’s encouraging to note that more and more people are becoming inured to being labeled by the Left and are no longer bothering to engage in the popular conservative appeasement dance of “but I’m not, I’m really not!”\nDear Graduate Director Prof. Kantrowitz,\nPlease forgive this sudden e-mail. I am writing to you today about the “diversity” training that new teaching assistants (TAs) are required to undergo. In keeping with the spirit of the Wisconsin Idea, I am also blind-copying on this e-mail several journalistic outlets and state government officials, because the taxpayers who support this university deserve to know how their money is being spent.\nAs you are probably aware, all new TAs in the History Department are required to attend one orientation session, two TA training sessions, and two diversity sessions. Yesterday (Friday, September 20th), we new TAs attended the first of the diversity sessions. To be quite blunt, I was appalled. What we were given, under the rubric of “diversity,” was an avalanche of insinuations, outright accusations, and suffocating political indoctrination (or, as some of the worksheets revealingly put it, “re-education”) entirely unbecoming a university of our stature.\nStudents at the University of Wisconsin-Madison, and students at probably every other public institution of higher education in this country, have long since grown accustomed to incessant leftism. It is in the very air that we breathe. Bascom Hill, for example, is roped off and the university is shut down so that Barack Obama (D), Mark Pocan (D), and Tammy Baldwin (D) can deliver campaign speeches before election day. (The university kindly helped direct student traffic to these campaign events by sending out a mass e-mail encouraging the student body to go to the Barack Obama for President website and click “I’m In for Barack!” in order to attend.) Marxist diatribes denouncing Christianity, Christians, the United States, and conservatives (I am happy to provide as many examples of this as might be required) are assigned as serious scholarship in seminars. The Teaching Assistants Association (TAA)–which sent out mass e-mails, using History Department list-servs, during the attempt to recall Governor Scott Walker, accusing Gov. Walker of, among other things, being “Nero”–is allowed to address TA and graduate student sessions as a “non-partisan organization”. The History Department sponsors a leftist political rally, along with the Socialist Party of Wisconsin, and advertises for the rally via a departmental e-mail (sent, one presumes, using state computers by employees drawing salaries from a state institution). In short, this university finds it convenient to pretend that it is an apolitical entity, but one need not be particularly astute to perceive that the Madison campus is little more than a think tank for the hard left. Even those who wholeheartedly support this political agenda might in all candor admit that the contours of the leftism here are somewhat less than subtle.\nAt the “diversity” training yesterday, though, even this fig leaf of apoliticism was discarded. In an utterly unprofessional way, the overriding presumption of the session was that the people whom the History Department has chosen to employ as teaching assistants are probably racists. In true “diversity” style, the language in which the presentation was couched was marbled with words like “inclusive”, “respect”, and “justice”. But the tone was unmistakably accusatory and radical. Our facilitator spoke openly of politicizing her classrooms in order to right (take revenge for?) past wrongs. We opened the session with chapter-and-verse quotes from diversity theorists who rehearsed the same tired “power and privilege” cant that so dominates seminar readings and official university hand-wringing over unmet race quotas. Indeed, one mild-mannered Korean woman yesterday felt compelled to insist that she wasn’t a racist. I never imagined that she was, but the atmosphere of the meeting had been so poisoned that even we traditional quarries of the diversity Furies were forced to share our collective guilt with those from continents far across the wine-dark sea.\nIt is hardly surprising that any of us hectorees would feel thusly. For example, in one of the handouts that our facilitator asked us to read (“Detour-Spotting: for white anti-racists,” by joan olsson [sic]), we learned things like, “As white infants we were fed a pabulum of racist propaganda,” “…there was no escaping the daily racist propaganda,” and, perhaps most even-handed of all, “Racism continues in the name of all white people.” Perhaps the Korean woman did not read carefully enough to realize that only white people (all of them, in fact) are racist. Nevertheless, in a manner stunningly redolent of “self-criticism” during the Cultural Revolution in communist China, the implication of the entire session was that everyone was suspect, and everyone had some explaining to do.\nYou have always been very kind to me, Prof. Kantrowitz, so it pains me to ask you this, but is this really what the History Department thinks of me? Is this what you think of me? I am not sure who selected the readings or crafted the itinerary for the diversity session, but, as they must have done so with the full sanction of the History Department, one can only conclude that the Department agrees with such wild accusations, and supports them. Am I to understand that this is how the white people who work in this Department are viewed? If so, I cannot help but wonder why in the world the Department hired any of us in the first place. Would not anyone be better?\nThere is one further issue. At the end of yesterday’s diversity “re-education,” we were told that our next session would include a presentation on “Trans Students”. At that coming session, according to the handout we were given, we will learn how to let students ‘choose their own pronouns’, how to correct other students who mistakenly use the wrong pronouns, and how to ask people which pronouns they prefer (“I use the pronouns he/him/his. I want to make sure I address you correctly. What pronouns do you use?”). Also on the agenda for next week are “important trans struggles, as well as those of the intersexed and other gender-variant communities,” “stand[ing] up to the rules of gender,” and a very helpful glossary of related terms and acronyms, to wit: “Trans”: for those who “identify along the gender-variant spectrum,” and “Genderqueer”: “for those who consider their gender outside the binary gender system”. I hasten to reiterate that I am quoting from diversity handouts; I am not making any of this up.\nPlease allow me to be quite frank. My job, which I love, is to teach students Japanese history. This week, for example, I have been busy explaining the intricacies of the Genpei War (1180-1185), during which time Japan underwent a transition from an earlier, imperial-rule system under regents and cloistered emperors to a medieval, feudal system run by warriors and estate managers. It is an honor and a great joy to teach students the history of Japan. I take my job very seriously, and I look forward to coming to work each day.\nIt is most certainly not my job, though, to cheer along anyone, student or otherwise, in their psychological confusion. I am not in graduate school to learn how to encourage poor souls in their sexual experimentation, nor am I receiving generous stipends of taxpayer monies from the good people of the Great State of Wisconsin to play along with fantasies or accommodate public cross-dressing. To all and sundry alike I explicate, as best I can, such things as the clash between the Taira and the Minamoto, the rise of the Kamakura shogunate, and the decline of the imperial house in twelfth-century Japan. Everyone is welcome in my classroom, but, whether directly or indirectly, I will not implicate myself in my students’ fetishes, whatever those might be. What they do on their own t\nime is their business; I will not be a party to it. I am exercising my right here to say, “Enough is enough.” One grows used to being thought a snarling racist–after all, others’ opinions are not my affair–but one draws the line at assisting students in their private proclivities. That is a bridge too far, and one that I, at least, will not cross.\nI regret that this leaves us in an awkward situation. After having been accused of virulent racism and, now, assured that I will next learn how to parse the taxonomy of “Genderqueers”, I am afraid that I will disappoint those who expect me to attend any further diversity sessions. When a Virginia-based research firm came to campus a couple of years ago to present findings from their study of campus diversity, then-Diversity Officer Damon Williams sent a gaggle of shouting, sign-waving undergraduates to the meeting, disrupting the proceedings so badly that the meeting was cancelled. In a final break with such so-called “diversity”, I will not be storming your office or shouting into a megaphone outside your window. Instead, I respectfully inform you hereby that I am disinclined to join in any more mandatory radicalism. I have, thank God, many more important things to do. I also request that diversity training be made optional for all TAs, effective immediately. In my humble opinion, neither the Department nor the university has any right to subject anyone to such intellectual tyranny.\nThank you for your patience in reading this long e-mail.\nSincerely,\nJason Morgan",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-28T07:43:00+00:00"
}