{
  "url": "https://voxday.net/2013/09/09/rules-of-writing-iv/",
  "scraped_at": "2025-12-14T22:41:38.465973",
  "title": "Rules of Writing IV",
  "date_display": "September 9, 2013",
  "date_iso": "2013-09-09T13:00:00+00:00",
  "date_from_url": "2013-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>4. Thou shalt make thy plots and thy characters mutually consistent </b></p><p>Most writers understand the need to make their plots coherent and to keep the dialogue and actions of their characters self-consistent. However, a surprisingly common error is to fail to understand the necessity to make the intersections of plot and character consistent with both as well.</p><p>Let me provide an explanatory example. In Piers Anthony’s <i>Split Infinity</i>, the protagonist Stile is a serf and master gamesman who has been lurking just out of the top rankings for his age group because he did not wish to rank highly enough to qualify for the big annual tournament that will lead to either citizen status or exile. However, circumstances change and Stile decides he has to compete in the tournament even though he has another year or two before his serfdom expires and he would be automatically exiled.</p><p>Stile rapidly defeats the first few competitors he challenges and moves up the ranks to challenge Hulk.  He has to beat Hulk and he is under severe time pressure to not only beat him and complete the next challenges quickly before the start of the tournament.</p><p>However, Hulk is a physical giant and Stile, being a jockey of small stature, has serious size issues. Through one of the more entertaining aspects of the book, the Game Grid, the two end up competing in a marathon. Stile is in bad shape physically, but it’s a lot easier for him to run long distances than the massive Hulk, so he literally runs Hulk into the ground.</p><p>Being a serious competitor, Hulk won’t quit but runs until he collapses. Despite his pressing need to win, despite the time pressure, Stile mysteriously offers Hulk a draw, even though doing so will cost him at least one critical day according to the rules, and possibly more depending upon the rules concerning injuries.</p><p>Why? The reason is that Stile is obviously Anthony’s Mary Sue, so much so that I concluded, before I’d even finished <i>Split Infinity</i>, that Anthony was very short himself.  (Sure enough, I looked it up and learned the following: “his physical development was also delayed, causing him to be unusually short into his college years.”) Because Stile is the Mary Sue, Anthony can’t resist the urge to portray Stile as the noblest of the noble, turning down a certain and well-merited victory out of sporting concern for his opponent, despite the way in which the noble gesture completely destroys both the plot as well as the reader’s view of Stile as a maniacal competitor.</p><p>In fact, this scene comes only a few pages after we’ve been treated to a strange little explication of what we are told is the notorious “Stile stare”, a gaze of such implacable hostility that it can cause an otherwise adept Gamesman to stumble and make basic mistakes in an intellectual contest.  So, we’re asked to believe, in less than 10 pages, that Stile is willing to throw away a victory just because his opponent is exhausted despite being as viciously competitive as Michael Jordan? This simply isn’t credible.</p><p>Anthony belatedly salvages the plot by having Hulk provide an ex post facto concession, which does nothing more than get Stile right back to where he had been before his inexplicably magnanimous gesture, the victor of the contest.  Only now, instead of knowing him to be a ruthless competitor and a hero trying to save two worlds, we have learned that he is also the ultimate good sport. Which, of course, turns out to be of absolutely no import whatsoever.</p><p>Injecting this sort of plot-character inconsistency isn’t necessarily related to Mary Sue characters, though. It can also stem from an attempt to generate artificial drama, or to provide the author with a chance to provide a little impromptu lecture. Robert Heinlein not infrequently indulged in the latter, writing scenes where the male protagonist would suddenly and inflexibly take a stand on some incredibly minor principle in a manner that would not only put his romantic relationship in doubt, but in some cases, jeopardize the character’s primary objective.</p><p>There are two problems with this sort of inconsistency.  First, the effect usually comes off as bathos because any drama created in this manner is observably artificial by the logic of the fictional world. Second, the inconsistency tends to jolt the reader out of the story because it forces him to question his previous conclusions about the character.</p><p>If you know who your characters are and you understand how they relate to your plot, there will be no need for them to come into conflict. Resist the urge to show off how wonderful your favorite characters are, in fact, I would encourage you to intentionally show them failing from time to time, or indulging in a genuine human weakness, just to combat the usual authorial tendency to always present his favorites in an unconvincingly rosy light.  It is better to exaggerate a character’s behavioral tendencies than to violate them, especially when the plot depends upon those tendencies.</p></div>",
  "content_text": "4. Thou shalt make thy plots and thy characters mutually consistent\nMost writers understand the need to make their plots coherent and to keep the dialogue and actions of their characters self-consistent. However, a surprisingly common error is to fail to understand the necessity to make the intersections of plot and character consistent with both as well.\nLet me provide an explanatory example. In Piers Anthony’s\nSplit Infinity\n, the protagonist Stile is a serf and master gamesman who has been lurking just out of the top rankings for his age group because he did not wish to rank highly enough to qualify for the big annual tournament that will lead to either citizen status or exile. However, circumstances change and Stile decides he has to compete in the tournament even though he has another year or two before his serfdom expires and he would be automatically exiled.\nStile rapidly defeats the first few competitors he challenges and moves up the ranks to challenge Hulk.  He has to beat Hulk and he is under severe time pressure to not only beat him and complete the next challenges quickly before the start of the tournament.\nHowever, Hulk is a physical giant and Stile, being a jockey of small stature, has serious size issues. Through one of the more entertaining aspects of the book, the Game Grid, the two end up competing in a marathon. Stile is in bad shape physically, but it’s a lot easier for him to run long distances than the massive Hulk, so he literally runs Hulk into the ground.\nBeing a serious competitor, Hulk won’t quit but runs until he collapses. Despite his pressing need to win, despite the time pressure, Stile mysteriously offers Hulk a draw, even though doing so will cost him at least one critical day according to the rules, and possibly more depending upon the rules concerning injuries.\nWhy? The reason is that Stile is obviously Anthony’s Mary Sue, so much so that I concluded, before I’d even finished\nSplit Infinity\n, that Anthony was very short himself.  (Sure enough, I looked it up and learned the following: “his physical development was also delayed, causing him to be unusually short into his college years.”) Because Stile is the Mary Sue, Anthony can’t resist the urge to portray Stile as the noblest of the noble, turning down a certain and well-merited victory out of sporting concern for his opponent, despite the way in which the noble gesture completely destroys both the plot as well as the reader’s view of Stile as a maniacal competitor.\nIn fact, this scene comes only a few pages after we’ve been treated to a strange little explication of what we are told is the notorious “Stile stare”, a gaze of such implacable hostility that it can cause an otherwise adept Gamesman to stumble and make basic mistakes in an intellectual contest.  So, we’re asked to believe, in less than 10 pages, that Stile is willing to throw away a victory just because his opponent is exhausted despite being as viciously competitive as Michael Jordan? This simply isn’t credible.\nAnthony belatedly salvages the plot by having Hulk provide an ex post facto concession, which does nothing more than get Stile right back to where he had been before his inexplicably magnanimous gesture, the victor of the contest.  Only now, instead of knowing him to be a ruthless competitor and a hero trying to save two worlds, we have learned that he is also the ultimate good sport. Which, of course, turns out to be of absolutely no import whatsoever.\nInjecting this sort of plot-character inconsistency isn’t necessarily related to Mary Sue characters, though. It can also stem from an attempt to generate artificial drama, or to provide the author with a chance to provide a little impromptu lecture. Robert Heinlein not infrequently indulged in the latter, writing scenes where the male protagonist would suddenly and inflexibly take a stand on some incredibly minor principle in a manner that would not only put his romantic relationship in doubt, but in some cases, jeopardize the character’s primary objective.\nThere are two problems with this sort of inconsistency.  First, the effect usually comes off as bathos because any drama created in this manner is observably artificial by the logic of the fictional world. Second, the inconsistency tends to jolt the reader out of the story because it forces him to question his previous conclusions about the character.\nIf you know who your characters are and you understand how they relate to your plot, there will be no need for them to come into conflict. Resist the urge to show off how wonderful your favorite characters are, in fact, I would encourage you to intentionally show them failing from time to time, or indulging in a genuine human weakness, just to combat the usual authorial tendency to always present his favorites in an unconvincingly rosy light.  It is better to exaggerate a character’s behavioral tendencies than to violate them, especially when the plot depends upon those tendencies.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-09T12:00:00+00:00"
}