{
  "url": "https://voxday.net/2013/09/06/snicker-snack/",
  "scraped_at": "2025-12-14T22:41:18.574289",
  "title": "The Moral Landscaperevisited",
  "date_display": "September 6, 2013",
  "date_iso": "2013-09-06T09:20:00+00:00",
  "date_from_url": "2013-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of you have sent me <a href=\"http://www.samharris.org/blog/item/the-moral-landscape-challenge1\">this public challenge</a> by Sam Harris:</p><blockquote class=\"tr_bq\"><p> It has been nearly three years since <i>The Moral Landscape</i> was<br> first published in English, and in that time it has been attacked by<br> readers and nonreaders alike. Many seem to have judged from the<br> resulting cacophony that the book’s central thesis was easily refuted.<br> However, I have yet to encounter a substantial criticism that I feel was<br> not adequately answered in the book itself (and in subsequent <a href=\"https://www.youtube.com/watch?v=Mm2Jrr0tRXk\">talks</a>).</br></br></br></br></br></p><p>So I would like to issue a public challenge. Anyone who believes that<br> my case for a scientific understanding of morality is mistaken is<br> invited to prove it in 1,000 words or less. (You must address the<br> central argument of the book—not peripheral issues.) The best response<br> will be published on this website, and its author will receive $2,000.<br> If any essay actually persuades me, however, its author will receive<br> $20,000,* and I will publicly recant my view.</br></br></br></br></br></br></p><p>Submissions will be accepted <a href=\"http://www.samharris.org/contact\">here</a> the week of February 2-9, 2014.</p></blockquote><p>Needless to say, I will be submitting an entry. I’ve read the book and I’m very familiar with his approach. Sam Harris makes a regular habit of claiming he has answered his critics by way of anticipating them; he did the same in <i>The End of Faith</i>.  Let’s just say I don’t anticipate any trouble convincing anyone else that his thesis has been refuted, although convincing Mr. Harris himself may be considerably more difficult, especially considering the way he tried to weasel out of his perfectly straightforward statement on his belief in the ethical nature of killing people who subscribe to propositions considered to be sufficiently dangerous.</p><p>For those who are interested, here were <a href=\"http://www.milobookclub.com/2010/11/13/initial-impressions-of-moral-landscape/\">my initial impressions</a> after reading <i>The Moral Landscape</i>; my subsequent review of it, published on WorldNetDaily in November 2010, was as follows:</p><p><i><b>The Moral Landscape</b></i><br> <i>Vox Day reviews Sam Harris’ case for using science to define morality </i></br></p><p>Sam Harris’ first two books were commercial successes and<br> intellectual failures. Riddled with basic factual and logical errors,<br> “The End of Faith” and “Letter to a Christian Nation” served as  little<br> more than godless red meat snapped up by unthinking atheists around the<br> English-speaking world. His third book, “The Moral Landscape,” is also a<br> challenge to established wisdom, but it is a much more sober, serious<br> and interesting book than its predecessors.</br></br></br></br></br></br></p><p>The basis for the book is Harris’ own neuroscience experiments, in<br> which he tested his hypothesis that when hooked up to an fMRI scanner,<br> the human brain would produce an observable difference in its activity<br> when contemplating non-religious beliefs than when considering religious<br> beliefs. As it happens, the hypothesis was found to be incorrect, as<br> the same responses were elicited from both the believing group and the<br> non-believing group for religious and nonreligious stimuli alike. (Full<br> disclosure: I was one of the Christians asked by Mr. Harris to review<br> the religious stimuli to ensure their theological verisimilitude. In my<br> opinion, the questions utilized were both reasonable and fair.)</br></br></br></br></br></br></br></br></br></p><div class=\"left_ad_160\"><div id=\"div-gpt-ad-story160LeftSide\"></div></div><p>In “The Moral Landscape,” Sam Harris courageously attempts to address<br> the Problem of Morality that has plagued atheist philosophers since<br> Jean Meslier failed to realize the obvious consequences of his<br> declaration that every rational man could imagine better moral precepts<br> than Christianity possessed. As Harris notes, in the absence of a<br> morality derived from a religion, scientists and other secularists have<br> concluded that all morals are relative and there is therefore no<br> objective basis for preferring the moral precepts asserted by one<br> individual to those put forth by another, regardless of how monstrous<br> they might appear to a third party. This is why, aside from few<br> irrelevant rhetorical flourishes and one inexplicable personal jihad,<br> Harris’ arguments in the book are predominantly directed against his<br> fellow non-believers rather than theistic targets.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>To his credit, Harris explicitly recognizes that he is making a<br> philosophical case, not a scientific one. This is a significant<br> improvement upon the first wave of New Atheist books, including Harris’<br> own pair, in which the various authors presented their intrinsically<br> philosophical cases in pseudo-scientific guise. However, there are three<br> argumentative flaws that pervade the book. Unfortunately, Harris<br> appears to have adopted Richard Dawkins’ favorite device of presenting a<br> bait-and-switch definition in lieu of a logically substantive argument.<br> He repeatedly utilizes the following technique:</br></br></br></br></br></br></br></br></p><p>1) Admittedly, X is not Y.<br> <br> 2) But can’t we say that X could be considered Z?<br> <br> 3) And Z is Y.<br> <br> 4) Therefore, X can be Y.</br></br></br></br></br></br></p><p>For example, in an attempt to get around Hume’s is/ought dichotomy,<br> Harris readily admits that “good” in the sense of “morally correct” is<br> not objectively definable and that what one individual perceives as good<br> can differ substantially from that which another person declares to be<br> “good.” So, he suggests the substitution of “well-being” for “good”<br> because there are numerous measures of “well-being,” such as life<br> expectancy, GDP per capita and daily caloric intake, that can be reduced<br> to numbers and are therefore measurable. After all, everyone<br> understands what it means to be in good health despite the fact that<br> “health” is not perfectly defined in an objective and scientific manner.<br> Right?</br></br></br></br></br></br></br></br></br></br></p><p>However, even if we set aside the obvious fact that the proposed<br> measures of well-being are of dubious utility – life expectancy does not<br> account for quality of life, GDP does not account for debt and more<br/> calories are not always desirable – the problem is that Harris simply<br/> ignores the way in which his case falls completely apart when it is<br/> answered in the negative. No, we cannot simply accept that “moral” can<br/> reasonably be considered “well-being” because it is not true to say that<br/> which is “of, pertaining to, or concerned with the principles or rules<br/> of right conduct or the distinction between right and wrong” is more<br/> than remotely synonymous with “that which fosters well-being in one or<br/> more human beings.”</br></br></p><p>Harris’ second habitual flaw is one that was seen in his previous<br/> books. That is to act as if admitting that a problem with his reasoning<br/> exists is somehow tantamount to resolving the problem in his favor. He<br/> appears to grasp that his philosophical consequentialism suffers from<br/> the same democratic problem that caused philosophers to abandon<br/> Benthamite utilitarianism as a prospective substitute for morality –<br/> nine out of 10 individuals agree that gang rape enhances their<br/> well-being – but he simply chooses to ignore the problem. In the notes,<br/> he justifies this gaping hole in his argument by declaring that the<br/> conceptual developments that have taken place since John Stuart Mill<br/> died in 1873 “are generally of interest only to academic philosophers.”<br/> That’s likely true, but it doesn’t excuse such a blatant evasion of a<br/> known criticism nor does it help the self-confessed consequentialist<br/> deal with the potentially nightmarish consequences of utilitarian<br/> totalitarianism.</p><p>The third pervasive flaw is what after three books has become<br/> recognizable as Harris’ customary intellectual carelessness. Time and<br/> time again, he makes statements of fact that are easily disproved by the<br/> first page of a Google search. For example, in an attempt to explain<br/> that all opinions need not be equally respected and that not all<br/> competing responses to moral dilemmas are equally valid, he brings up<br/> the subject of corporal punishment:</p><blockquote><p> <i>“There are, for instance, twenty-one U.S. states that<br/> still allow corporal punishment in their schools. … However, if we are<br/> actually concerned about human well-being, and would treat children in<br/> such a way as to promote it,  we wonder whether it is generally wise to<br/> subject little boys and girls to pain, terror, and public humiliation as<br/> a means of encouraging their cognitive and emotional development. Is<br/> there any doubt that this question has an answer? Is there any doubt<br/> that it matters that we get it right? In fact, all the research<br/> indicates that corporal punishment is a disastrous practice, leading to<br/> more violence and social pathology – and, perversely, to greater support<br/> for corporal punishment.”</i><br/> <br/> <i> – </i>Sam Harris, “The Moral Landscape”</p></blockquote><p>But “all the research” shows nothing of the kind. Sweden’s rate of<br/> child abuse increased nearly 500 percent after spanking ban was<br/> instituted in 1979 and is significantly higher than that of the United<br/> States. In Trinidad, a paper titled “Benchmarking Violence and<br/> Delinquency in the Secondary School: Towards a Culture of Peace and<br/> Civility” concluded that a ban on corporal punishment in school had led<br/> to indiscipline and even physical attacks on teachers. Dr. Robert E.<br/> Larzelere of Oklahoma State has even <a href=\"http://ches.okstate.edu/facultystaff/Larzelere/nztabconts.47.pdf\">published annotated studies</a><br/> showing that what little scientific evidence has been produced to<br/> support anti-spanking bans is not sound. One need not have a position on<br/> corporal punishment to recognize that Harris did not, in fact, actually<br/> look into the relevant research he cites so blithely.</p><p>This failure to<br/> correctly establish a factual premise and build from it is found<br/> throughout the book; Harris makes a habit of beginning with a conclusion<br/> and belatedly attempting to support it with a statement of fact that is<br/> often dubious and occasionally downright in error.</p><p>Still, Sam Harris is to be lauded for taking the moral bull by the<br/> horns and bravely attempting to make the case for the possibility of a<br/> secular and scientific morality. “The Moral Landscape” raises some<br/> interesting questions and provides the reader with more than a little<br/> material for thought. On the downside, Harris’ repeated attacks on Dr.<br/> Francis Collins are unseemly as well as irrelevant to his topic; one<br/> wonders what his editor was thinking to permit such a lengthy tangent<br/> that is more indicative of a Victor Hugo novel than a serious scientific<br/> work. And in the end, the reader is forced to conclude the argument for<br/> a science-based morality presented in “The Moral Landscape” is even<br/> more demonstrably incorrect than was the scientific hypothesis that<br/> served as the original inspiration for the book.</p></div>",
  "content_text": "A number of you have sent me\nthis public challenge\nby Sam Harris:\nIt has been nearly three years since\nThe Moral Landscape\nwas\nfirst published in English, and in that time it has been attacked by\nreaders and nonreaders alike. Many seem to have judged from the\nresulting cacophony that the book’s central thesis was easily refuted.\nHowever, I have yet to encounter a substantial criticism that I feel was\nnot adequately answered in the book itself (and in subsequent\ntalks\n).\nSo I would like to issue a public challenge. Anyone who believes that\nmy case for a scientific understanding of morality is mistaken is\ninvited to prove it in 1,000 words or less. (You must address the\ncentral argument of the book—not peripheral issues.) The best response\nwill be published on this website, and its author will receive $2,000.\nIf any essay actually persuades me, however, its author will receive\n$20,000,* and I will publicly recant my view.\nSubmissions will be accepted\nhere\nthe week of February 2-9, 2014.\nNeedless to say, I will be submitting an entry. I’ve read the book and I’m very familiar with his approach. Sam Harris makes a regular habit of claiming he has answered his critics by way of anticipating them; he did the same in\nThe End of Faith\n.  Let’s just say I don’t anticipate any trouble convincing anyone else that his thesis has been refuted, although convincing Mr. Harris himself may be considerably more difficult, especially considering the way he tried to weasel out of his perfectly straightforward statement on his belief in the ethical nature of killing people who subscribe to propositions considered to be sufficiently dangerous.\nFor those who are interested, here were\nmy initial impressions\nafter reading\nThe Moral Landscape\n; my subsequent review of it, published on WorldNetDaily in November 2010, was as follows:\nThe Moral Landscape\nVox Day reviews Sam Harris’ case for using science to define morality\nSam Harris’ first two books were commercial successes and\nintellectual failures. Riddled with basic factual and logical errors,\n“The End of Faith” and “Letter to a Christian Nation” served as  little\nmore than godless red meat snapped up by unthinking atheists around the\nEnglish-speaking world. His third book, “The Moral Landscape,” is also a\nchallenge to established wisdom, but it is a much more sober, serious\nand interesting book than its predecessors.\nThe basis for the book is Harris’ own neuroscience experiments, in\nwhich he tested his hypothesis that when hooked up to an fMRI scanner,\nthe human brain would produce an observable difference in its activity\nwhen contemplating non-religious beliefs than when considering religious\nbeliefs. As it happens, the hypothesis was found to be incorrect, as\nthe same responses were elicited from both the believing group and the\nnon-believing group for religious and nonreligious stimuli alike. (Full\ndisclosure: I was one of the Christians asked by Mr. Harris to review\nthe religious stimuli to ensure their theological verisimilitude. In my\nopinion, the questions utilized were both reasonable and fair.)\nIn “The Moral Landscape,” Sam Harris courageously attempts to address\nthe Problem of Morality that has plagued atheist philosophers since\nJean Meslier failed to realize the obvious consequences of his\ndeclaration that every rational man could imagine better moral precepts\nthan Christianity possessed. As Harris notes, in the absence of a\nmorality derived from a religion, scientists and other secularists have\nconcluded that all morals are relative and there is therefore no\nobjective basis for preferring the moral precepts asserted by one\nindividual to those put forth by another, regardless of how monstrous\nthey might appear to a third party. This is why, aside from few\nirrelevant rhetorical flourishes and one inexplicable personal jihad,\nHarris’ arguments in the book are predominantly directed against his\nfellow non-believers rather than theistic targets.\nTo his credit, Harris explicitly recognizes that he is making a\nphilosophical case, not a scientific one. This is a significant\nimprovement upon the first wave of New Atheist books, including Harris’\nown pair, in which the various authors presented their intrinsically\nphilosophical cases in pseudo-scientific guise. However, there are three\nargumentative flaws that pervade the book. Unfortunately, Harris\nappears to have adopted Richard Dawkins’ favorite device of presenting a\nbait-and-switch definition in lieu of a logically substantive argument.\nHe repeatedly utilizes the following technique:\n1) Admittedly, X is not Y.\n2) But can’t we say that X could be considered Z?\n3) And Z is Y.\n4) Therefore, X can be Y.\nFor example, in an attempt to get around Hume’s is/ought dichotomy,\nHarris readily admits that “good” in the sense of “morally correct” is\nnot objectively definable and that what one individual perceives as good\ncan differ substantially from that which another person declares to be\n“good.” So, he suggests the substitution of “well-being” for “good”\nbecause there are numerous measures of “well-being,” such as life\nexpectancy, GDP per capita and daily caloric intake, that can be reduced\nto numbers and are therefore measurable. After all, everyone\nunderstands what it means to be in good health despite the fact that\n“health” is not perfectly defined in an objective and scientific manner.\nRight?\nHowever, even if we set aside the obvious fact that the proposed\nmeasures of well-being are of dubious utility – life expectancy does not\naccount for quality of life, GDP does not account for debt and more\ncalories are not always desirable – the problem is that Harris simply\nignores the way in which his case falls completely apart when it is\nanswered in the negative. No, we cannot simply accept that “moral” can\nreasonably be considered “well-being” because it is not true to say that\nwhich is “of, pertaining to, or concerned with the principles or rules\nof right conduct or the distinction between right and wrong” is more\nthan remotely synonymous with “that which fosters well-being in one or\nmore human beings.”\nHarris’ second habitual flaw is one that was seen in his previous\nbooks. That is to act as if admitting that a problem with his reasoning\nexists is somehow tantamount to resolving the problem in his favor. He\nappears to grasp that his philosophical consequentialism suffers from\nthe same democratic problem that caused philosophers to abandon\nBenthamite utilitarianism as a prospective substitute for morality –\nnine out of 10 individuals agree that gang rape enhances their\nwell-being – but he simply chooses to ignore the problem. In the notes,\nhe justifies this gaping hole in his argument by declaring that the\nconceptual developments that have taken place since John Stuart Mill\ndied in 1873 “are generally of interest only to academic philosophers.”\nThat’s likely true, but it doesn’t excuse such a blatant evasion of a\nknown criticism nor does it help the self-confessed consequentialist\ndeal with the potentially nightmarish consequences of utilitarian\ntotalitarianism.\nThe third pervasive flaw is what after three books has become\nrecognizable as Harris’ customary intellectual carelessness. Time and\ntime again, he makes statements of fact that are easily disproved by the\nfirst page of a Google search. For example, in an attempt to explain\nthat all opinions need not be equally respected and that not all\ncompeting responses to moral dilemmas are equally valid, he brings up\nthe subject of corporal punishment:\n“There are, for instance, twenty-one U.S. states that\nstill allow corporal punishment in their schools. … However, if we are\nactually concerned about human well-being, and would treat children in\nsuch a way as to promote it,  we wonder whether it is generally wise to\nsubject little boys and girls to pain, terror, and public humiliation as\na means of encouraging their cognitive and emotional development. Is\nthere any doubt that this question has an answer? Is there any doubt\nthat it matters that we get it right? In fact, all the research\nindicates that corporal punishment is a disastrous practice, leading to\nmore violence and social pathology – and, perversely, to greater support\nfor corporal punishment.”\n–\nSam Harris, “The Moral Landscape”\nBut “all the research” shows nothing of the kind. Sweden’s rate of\nchild abuse increased nearly 500 percent after spanking ban was\ninstituted in 1979 and is significantly higher than that of the United\nStates. In Trinidad, a paper titled “Benchmarking Violence and\nDelinquency in the Secondary School: Towards a Culture of Peace and\nCivility” concluded that a ban on corporal punishment in school had led\nto indiscipline and even physical attacks on teachers. Dr. Robert E.\nLarzelere of Oklahoma State has even\npublished annotated studies\nshowing that what little scientific evidence has been produced to\nsupport anti-spanking bans is not sound. One need not have a position on\ncorporal punishment to recognize that Harris did not, in fact, actually\nlook into the relevant research he cites so blithely.\nThis failure to\ncorrectly establish a factual premise and build from it is found\nthroughout the book; Harris makes a habit of beginning with a conclusion\nand belatedly attempting to support it with a statement of fact that is\noften dubious and occasionally downright in error.\nStill, Sam Harris is to be lauded for taking the moral bull by the\nhorns and bravely attempting to make the case for the possibility of a\nsecular and scientific morality. “The Moral Landscape” raises some\ninteresting questions and provides the reader with more than a little\nmaterial for thought. On the downside, Harris’ repeated attacks on Dr.\nFrancis Collins are unseemly as well as irrelevant to his topic; one\nwonders what his editor was thinking to permit such a lengthy tangent\nthat is more indicative of a Victor Hugo novel than a serious scientific\nwork. And in the end, the reader is forced to conclude the argument for\na science-based morality presented in “The Moral Landscape” is even\nmore demonstrably incorrect than was the scientific hypothesis that\nserved as the original inspiration for the book.",
  "tags": [
    "debate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-06T08:20:00+00:00"
}