{
  "url": "https://voxday.net/2013/09/22/so-facebook-is-child-rape/",
  "scraped_at": "2025-12-14T22:43:02.496714",
  "title": "So Facebook is child rape",
  "date_display": "September 22, 2013",
  "date_iso": "2013-09-22T08:35:00+00:00",
  "date_from_url": "2013-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just when you thought “near-rape” and “regret rape” were as silly as it was going to get; now a woman desperate to escape the consequences of her actions is attempting to elevate “posting legal pictures online” <a href=\"http://www.foxnews.com/us/2013/09/12/florida-woman-victimized-by-nude-photos-fights-against-cyber-rape/\">to the status of rape</a>:</p><blockquote class=\"tr_bq\"><p> When Holly Jacobs sent nude photographs of herself to a long-distance<br> boyfriend she loved and trusted, the 23-year-old woman never imagined<br> the horror that would befall her. In August 2009, less than a year after the pair mutually ended their<br> three-year relationship, Jacobs did a Google search of her name and<br> discovered the naked photos on a so-called “revenge porn” website.</br></br></br></br></p><p>“I just went completely into shock,” said Jacobs, who hired a lawyer<br> and eventually changed her birth name from “Holli Thometz” to Holly<br> Jacobs.</br></br></p><p>“This is cyber-rape,” Jacobs, now 30, told FoxNews.com. “It’s all<br> about the guy having control over the woman and exploiting her in a<br> sexual way — the same way real-life rape does that. It violates you<br> over and over again.”</br></br></br></p><p>What came next was perhaps more shocking to Jacobs. Police in Miami,<br> where she lived at the time, took no action. They told her that “because<br> you are over 18 and you consented, technically they are his property<br> and he can do whatever he wants with them,” she recalled.</br></br></br></p></blockquote><p>It is sadly unsurprising that a woman would find centuries-old laws concerning private property to be shocking. Apparently we are in the process of entering the time of juris sensus, in which the way a woman feels about something, anything, is the primary legally determinative factor.</p><p>It is manifestly obvious that having naked pictures online does a woman no material harm at all. Tens of thousands, if not hundreds of thousands of women, actually profit from it. Hundreds of thousands more knowingly and intentionally post pictures of themselves for nothing more than the ego gratification. This whole campaign tends to strike me more as humblebrag than horror.</p><p>Moreover, it would be absolutely insane to try to make a law against this sort of thing. As usual, the woman desperate to erase the evidence of her past behavior and her white knights of both sexes aren’t even beginning to consider the consequences.  Think about it: we already have a problem with parents occasionally falling afoul of child pornography laws due to posting cute or funny pictures of bathtime on Facebook.</p><p>Now recall that children can’t consent. So, if posting pictures taken with consent is rape, how much worse is it to post pictures <i>taken without consent</i>? Of underage<i> children</i>! In one fell swoop, one woman with poor judgment in men is attempting to turn hundreds of thousands of American mothers into child rapists.</p></div>",
  "content_text": "Just when you thought “near-rape” and “regret rape” were as silly as it was going to get; now a woman desperate to escape the consequences of her actions is attempting to elevate “posting legal pictures online”\nto the status of rape\n:\nWhen Holly Jacobs sent nude photographs of herself to a long-distance\nboyfriend she loved and trusted, the 23-year-old woman never imagined\nthe horror that would befall her. In August 2009, less than a year after the pair mutually ended their\nthree-year relationship, Jacobs did a Google search of her name and\ndiscovered the naked photos on a so-called “revenge porn” website.\n“I just went completely into shock,” said Jacobs, who hired a lawyer\nand eventually changed her birth name from “Holli Thometz” to Holly\nJacobs.\n“This is cyber-rape,” Jacobs, now 30, told FoxNews.com. “It’s all\nabout the guy having control over the woman and exploiting her in a\nsexual way — the same way real-life rape does that. It violates you\nover and over again.”\nWhat came next was perhaps more shocking to Jacobs. Police in Miami,\nwhere she lived at the time, took no action. They told her that “because\nyou are over 18 and you consented, technically they are his property\nand he can do whatever he wants with them,” she recalled.\nIt is sadly unsurprising that a woman would find centuries-old laws concerning private property to be shocking. Apparently we are in the process of entering the time of juris sensus, in which the way a woman feels about something, anything, is the primary legally determinative factor.\nIt is manifestly obvious that having naked pictures online does a woman no material harm at all. Tens of thousands, if not hundreds of thousands of women, actually profit from it. Hundreds of thousands more knowingly and intentionally post pictures of themselves for nothing more than the ego gratification. This whole campaign tends to strike me more as humblebrag than horror.\nMoreover, it would be absolutely insane to try to make a law against this sort of thing. As usual, the woman desperate to erase the evidence of her past behavior and her white knights of both sexes aren’t even beginning to consider the consequences.  Think about it: we already have a problem with parents occasionally falling afoul of child pornography laws due to posting cute or funny pictures of bathtime on Facebook.\nNow recall that children can’t consent. So, if posting pictures taken with consent is rape, how much worse is it to post pictures\ntaken without consent\n? Of underage\nchildren\n! In one fell swoop, one woman with poor judgment in men is attempting to turn hundreds of thousands of American mothers into child rapists.",
  "tags": [
    "law",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-22T07:35:00+00:00"
}