{
  "url": "https://voxday.net/2013/09/18/that-was-easy-enoug/",
  "scraped_at": "2025-12-14T22:42:38.584436",
  "title": "That was easy enough",
  "date_display": "September 18, 2013",
  "date_iso": "2013-09-18T13:00:00+00:00",
  "date_from_url": "2013-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last week, Chelm Wiseman insisted that I and others <a href=\"http://www.milobookclub.com/2013/09/10/obama-unleashes-jews/\">were wrong about Israel’s support for American intervention in Syria</a> and repeatedly insinuated that our doubts about the supposed Israeli non-interest in American military action in Syria was somehow anti-semitic.</p><p>Here are some selections from his comments. The response to the third is mine:</p><ol><li><i>You have only supposition to support they accusation that Israel is in<br> favor of a Syria war. If Israel is not behind it then it follows that<br> the “elite Jews” are pursuing their own interest (like all elites<br> everywhere) not Israel’s. </br></br></br></i></li><li><i>You are seeing what you want to see here.  This supports my point.  The<br> fact that they even have to phrase it like this indicates that there is<br> not clear support from the Israel. They are not putting obstacles in the way of a US strike?  Not exactly an ringing endorsement. </br></br></i></li><li><i>Yes, but there is no source for that either and it comes after a<br> statement about Israel deliberately trying to stay on the sidelines of<br> the debate. NYT is not a friendly source for Netanyahu, so they can not<br> be relied upon to portray him accurately. Stop pretending that they are.<br> </br></br></br></br></i><p>“I caught you out blatantly misrepresenting the NYT article,<br> Chelm.  And I can, and will, easily find reports of the Netanyahu<br> government’s support for American military action in Syria from other<br> sources, so banking on the NYT misrepresenting the Israeli government’s<br> position was an unwise move on your part.”</br></br></br></br></p></li></ol><p>And here is <a href=\"http://www.reuters.com/article/2013/09/17/us-syria-crisis-israel-idUSBRE98G0DR20130917?feedType=RSS&amp;irpc=932\">a report from Reuters</a> on Tuesday:</p><blockquote class=\"tr_bq\"><p> Israel wants to<br> see Syrian President Bashar al-Assad toppled, its ambassador to the<br> United States said on Tuesday, in a shift from its non-committal public<br> stance on its neighbor’s civil war.</br></br></br></p><p>Even Assad’s defeat by al<br> Qaeda-aligned rebels would be preferable to Damascus’s current alliance<br> with Israel’s arch-foe Iran, Ambassador Michael Oren said in an<br> interview with the Jerusalem Post.</br></br></br></p><p>His comments marked a move in Israel’s public position on Syria’s two-and-1/2-year-old war….</p><p>“We<br> always wanted Bashar Assad to go, we always preferred the bad guys who<br> weren’t backed by Iran to the bad guys who were backed by Iran,” Oren<br> said in the interview, excerpted on Tuesday before its full publication<br> on Friday.</br></br></br></br></p></blockquote><p>Note that this is a move in Israel’s <i>public </i>position.  Its private position remains unchanged from before: it wants Bashar Assad to go and it wants America to make that happen. Now, there is nothing wrong with the Israeli position. It may well be in the Israeli national interest; I’m certainly not in any position to judge that. The problem is with those American Jews and their Christian Zionist allies who seek to elevate the Israeli national interest above the American one.</p><p>And if it is intrinsically anti-semitic to be pro-American, well, there are an awful lot more anti-semites out there than I had previously imagined.</p></div>",
  "content_text": "Last week, Chelm Wiseman insisted that I and others\nwere wrong about Israel’s support for American intervention in Syria\nand repeatedly insinuated that our doubts about the supposed Israeli non-interest in American military action in Syria was somehow anti-semitic.\nHere are some selections from his comments. The response to the third is mine:\nYou have only supposition to support they accusation that Israel is in\nfavor of a Syria war. If Israel is not behind it then it follows that\nthe “elite Jews” are pursuing their own interest (like all elites\neverywhere) not Israel’s.\nYou are seeing what you want to see here.  This supports my point.  The\nfact that they even have to phrase it like this indicates that there is\nnot clear support from the Israel. They are not putting obstacles in the way of a US strike?  Not exactly an ringing endorsement.\nYes, but there is no source for that either and it comes after a\nstatement about Israel deliberately trying to stay on the sidelines of\nthe debate. NYT is not a friendly source for Netanyahu, so they can not\nbe relied upon to portray him accurately. Stop pretending that they are.\n“I caught you out blatantly misrepresenting the NYT article,\nChelm.  And I can, and will, easily find reports of the Netanyahu\ngovernment’s support for American military action in Syria from other\nsources, so banking on the NYT misrepresenting the Israeli government’s\nposition was an unwise move on your part.”\nAnd here is\na report from Reuters\non Tuesday:\nIsrael wants to\nsee Syrian President Bashar al-Assad toppled, its ambassador to the\nUnited States said on Tuesday, in a shift from its non-committal public\nstance on its neighbor’s civil war.\nEven Assad’s defeat by al\nQaeda-aligned rebels would be preferable to Damascus’s current alliance\nwith Israel’s arch-foe Iran, Ambassador Michael Oren said in an\ninterview with the Jerusalem Post.\nHis comments marked a move in Israel’s public position on Syria’s two-and-1/2-year-old war….\n“We\nalways wanted Bashar Assad to go, we always preferred the bad guys who\nweren’t backed by Iran to the bad guys who were backed by Iran,” Oren\nsaid in the interview, excerpted on Tuesday before its full publication\non Friday.\nNote that this is a move in Israel’s\npublic\nposition.  Its private position remains unchanged from before: it wants Bashar Assad to go and it wants America to make that happen. Now, there is nothing wrong with the Israeli position. It may well be in the Israeli national interest; I’m certainly not in any position to judge that. The problem is with those American Jews and their Christian Zionist allies who seek to elevate the Israeli national interest above the American one.\nAnd if it is intrinsically anti-semitic to be pro-American, well, there are an awful lot more anti-semites out there than I had previously imagined.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-18T12:00:00+00:00"
}