{
  "url": "https://voxday.net/2013/09/20/the-left-wing-internet-checklis/",
  "scraped_at": "2025-12-14T22:42:55.136780",
  "title": "The left-wing internet checklist",
  "date_display": "September 20, 2013",
  "date_iso": "2013-09-20T20:00:00+00:00",
  "date_from_url": "2013-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Correia wants to be sure none of our favorite anklebiters <a href=\"http://larrycorreia.wordpress.com/2013/09/20/the-internet-arguing-checklist/\">are missing any steps</a>:</p><blockquote class=\"tr_bq\"><p> THE LEFT WING INTERNET ARGUING CHECKLIST</p><ol><li>Skim until Offended</li><li>Disqualify that Opinion</li><li>Attack, Attack, Attack</li><li>Disregard Inconvenient facts</li><li>Make Shit Up</li><li>Resort to Moral Equivalency</li><li>Concern Trolling</li><li>When all else fails, Racism!</li></ol><p>So let’s break this down so you know what to look for, and you can<br> have a good laugh as people who have zero substance, critical thinking<br> skills, or facts make fools of themselves!</br></br></p><p>DISQUALIFY THAT OPINION</p><p>This one is lots of fun. Liberals never want to argue ABOUT a topic.<br> They want to argue about why your opinion on that topic doesn’t count.<br> It doesn’t matter who or what you are, there is some reason that your<br> opinion doesn’t count, and it doesn’t have to make sense.</br></br></br></p><p>Say that you are a man who thinks abortion is murder, well your<br> opinion obviously doesn’t count because you’re a man! What if my wife<br> said that? Well, her opinion doesn’t count because she’s biased because<br> she has children. What if a childless woman said that? Well, her opinion<br> doesn’t count because she’s probably religious. What if she’s an<br> atheist libertarian who happens to believe that a fetus should be<br> considered a human being and thus receive the same rights and legal<br> protections as any other human being? Hurr… Derp… Don’t legislate my<br> vagina! War on women! Quick, switch to another item on the checklist!</br></br></br></br></br></br></br></br></p><p>There are several subcategories to this one, as it is the most common tactic on the checklist.</p><p>Race, sex, culture, economic status. Say you want to comment on any<br> social issue. Well your opinion doesn’t count because you’re not part of<br> that race or culture or economic group. Usually the liberal you are<br> arguing with isn’t part of that group either, but it doesn’t matter,<br> because white guilt liberals are automatically exempt, and their soft<br> racism allows them to feel good about themselves as they declare that<br> other groups are too stupid to survive without their benevolent<br> guidance.</br></br></br></br></br></br></br></p><p>How dare you say that gangster rap thug culture of single mothers on<br> welfare isn’t the way to go! Your opinion doesn’t count because you<br> didn’t grow up there. And if you did grow up there, well you’re not <i>“authentic” </i>or one of my personal favorites I’ve seen thrown around Twitter against black conservatives <i>“house negro” </i>which totally isn’t racist if it is said by a smug liberal.</br></br></p><p>The problem with that is that most poo flinging monkeys are white<br> suburbanites, and when they try to disqualify you, and you stop them and<br> say “but I’m not white” which is a problem for them. Obviously this is<br> going to happen more and more as race is an artificial construct that<br> really only matters so liberals can make you check a box on an EEOC form<br> so they can continue to foist social programs on us. Since the poo<br> flingers freak out when their opponent isn’t white, liberals invented<br> the ultimate disqualifier of <i>“privilege”</i>.</br></br></br></br></br></br></br></p><p>Privilege is amazing. It is the new race card, because pick any topic<br> and regardless of what it is or who you are, a liberal can say your<br> opinion doesn’t’ count because you have <i>privilege</i>. What does that<br> actually mean? Hell if I know. It is such a nebulous term that surely<br> everybody has some form. It means whatever the liberal wants it to mean.<br> It is the new Neo-Con.</br></br></br></br></br></p><p>So you are against some dipshit welfare program because you’ve seen<br> first-hand how that culture of government dependence destroys the human<br> spirit, well obviously you are privileged so your opinion doesn’t count.<br> So wait, even if I was born into a family with dark skin and super<br> crazy poor, and worked my way out of it rather than becoming a crack<br> whore, I’m now too privileged to have an opinion?</br></br></br></br></br></p><p>YES.  It doesn’t<br> matter if you were born in a 3rd world hell hole and were a<br> boat person refugee, if you disagree with liberal group think it can<br> only be because you have privilege.</br></br></br></p></blockquote><p>In my experience, disqualification is the primary left-wing argumentative tactic; that’s why my Mensa qualifications drive the left so crazy.  It’s also why the mere fact of mentioning my racial heritage sends them into spirals of mindless denial. Without being able to disqualify me as stupid, white, or irrelevant, (they seldom even bother with this one anymore thanks to you all outnumbering most of their readerships), most of them quite literally have no recourse except to go immediately to accusing me of being crazy.</p><p>Or, as in the case of our new blog shadow, “delusional”.</p><p>On what basis?  Apparently on the basis of they can’t think of any other auto-disqualifying attributes. I’ve actually come to appreciate those who skip the preceding disqualification steps and go right to the crazy card. But they never stop to think why they are so desperate to disqualify their interlocutors or to consider what that desperation says about their ability to actual present their own arguments or criticize the arguments they oppose.</p></div>",
  "content_text": "Larry Correia wants to be sure none of our favorite anklebiters\nare missing any steps\n:\nTHE LEFT WING INTERNET ARGUING CHECKLIST\nSkim until Offended\nDisqualify that Opinion\nAttack, Attack, Attack\nDisregard Inconvenient facts\nMake Shit Up\nResort to Moral Equivalency\nConcern Trolling\nWhen all else fails, Racism!\nSo let’s break this down so you know what to look for, and you can\nhave a good laugh as people who have zero substance, critical thinking\nskills, or facts make fools of themselves!\nDISQUALIFY THAT OPINION\nThis one is lots of fun. Liberals never want to argue ABOUT a topic.\nThey want to argue about why your opinion on that topic doesn’t count.\nIt doesn’t matter who or what you are, there is some reason that your\nopinion doesn’t count, and it doesn’t have to make sense.\nSay that you are a man who thinks abortion is murder, well your\nopinion obviously doesn’t count because you’re a man! What if my wife\nsaid that? Well, her opinion doesn’t count because she’s biased because\nshe has children. What if a childless woman said that? Well, her opinion\ndoesn’t count because she’s probably religious. What if she’s an\natheist libertarian who happens to believe that a fetus should be\nconsidered a human being and thus receive the same rights and legal\nprotections as any other human being? Hurr… Derp… Don’t legislate my\nvagina! War on women! Quick, switch to another item on the checklist!\nThere are several subcategories to this one, as it is the most common tactic on the checklist.\nRace, sex, culture, economic status. Say you want to comment on any\nsocial issue. Well your opinion doesn’t count because you’re not part of\nthat race or culture or economic group. Usually the liberal you are\narguing with isn’t part of that group either, but it doesn’t matter,\nbecause white guilt liberals are automatically exempt, and their soft\nracism allows them to feel good about themselves as they declare that\nother groups are too stupid to survive without their benevolent\nguidance.\nHow dare you say that gangster rap thug culture of single mothers on\nwelfare isn’t the way to go! Your opinion doesn’t count because you\ndidn’t grow up there. And if you did grow up there, well you’re not\n“authentic”\nor one of my personal favorites I’ve seen thrown around Twitter against black conservatives\n“house negro”\nwhich totally isn’t racist if it is said by a smug liberal.\nThe problem with that is that most poo flinging monkeys are white\nsuburbanites, and when they try to disqualify you, and you stop them and\nsay “but I’m not white” which is a problem for them. Obviously this is\ngoing to happen more and more as race is an artificial construct that\nreally only matters so liberals can make you check a box on an EEOC form\nso they can continue to foist social programs on us. Since the poo\nflingers freak out when their opponent isn’t white, liberals invented\nthe ultimate disqualifier of\n“privilege”\n.\nPrivilege is amazing. It is the new race card, because pick any topic\nand regardless of what it is or who you are, a liberal can say your\nopinion doesn’t’ count because you have\nprivilege\n. What does that\nactually mean? Hell if I know. It is such a nebulous term that surely\neverybody has some form. It means whatever the liberal wants it to mean.\nIt is the new Neo-Con.\nSo you are against some dipshit welfare program because you’ve seen\nfirst-hand how that culture of government dependence destroys the human\nspirit, well obviously you are privileged so your opinion doesn’t count.\nSo wait, even if I was born into a family with dark skin and super\ncrazy poor, and worked my way out of it rather than becoming a crack\nwhore, I’m now too privileged to have an opinion?\nYES.  It doesn’t\nmatter if you were born in a 3rd world hell hole and were a\nboat person refugee, if you disagree with liberal group think it can\nonly be because you have privilege.\nIn my experience, disqualification is the primary left-wing argumentative tactic; that’s why my Mensa qualifications drive the left so crazy.  It’s also why the mere fact of mentioning my racial heritage sends them into spirals of mindless denial. Without being able to disqualify me as stupid, white, or irrelevant, (they seldom even bother with this one anymore thanks to you all outnumbering most of their readerships), most of them quite literally have no recourse except to go immediately to accusing me of being crazy.\nOr, as in the case of our new blog shadow, “delusional”.\nOn what basis?  Apparently on the basis of they can’t think of any other auto-disqualifying attributes. I’ve actually come to appreciate those who skip the preceding disqualification steps and go right to the crazy card. But they never stop to think why they are so desperate to disqualify their interlocutors or to consider what that desperation says about their ability to actual present their own arguments or criticize the arguments they oppose.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-20T19:00:00+00:00"
}