{
  "url": "https://voxday.net/2013/09/24/the-feynman-lectures-online/",
  "scraped_at": "2025-12-14T22:43:12.835316",
  "title": "The Feynman Lectures online",
  "date_display": "September 24, 2013",
  "date_iso": "2013-09-24T09:55:00+00:00",
  "date_from_url": "2013-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For those who are interested in scientody rather than scientistry, the famous Feynman Lectures on physics <a href=\"http://www.feynmanlectures.caltech.edu/I_01.html\">are now online</a>. “The Feynman Lectures on Physics was based on a two-year introductory physics course that Richard Feynman taught at Caltech from 1961 to 1963; it was published in three volumes during the years 1963 to 1965, and used as the introductory physics textbook at Caltech for nearly two decades.” In reading them, it’s not hard to understand why he is quite rightly revered as a minor secular saint of Science:</p><blockquote class=\"tr_bq\"><div class=\"para\" id=\"Ch1-S1-p4\"> Each piece, or part, of the whole of nature is always merely an<br> <i class=\"emph\">approximation</i> to the complete truth, or the complete truth so far<br> as we know it. In fact, everything we know is only some kind of<br> approximation, because <i class=\"emph\">we know that we do not know all the laws</i><br> as yet. Therefore, things must be learned only to be unlearned again or,<br> more likely, to be corrected.</br></br></br></br></br></div><div class=\"para\" id=\"Ch1-S1-p4\"></div><div class=\"para\" id=\"Ch1-S1-p4\"> The principle of science, the definition, almost, is the following:<br> <i class=\"emph\">The test of all knowledge is experiment</i>. Experiment is the<br> <i class=\"emph\">sole judge</i> of scientific “truth.” But what is the source of<br> knowledge? Where do the laws that are to be tested come from?<br> Experiment, itself, helps to produce these laws, in the sense that it<br> gives us hints. But also needed is <i class=\"emph\">imagination</i> to create from<br> these hints the great generalizations—to guess at the wonderful,<br> simple, but very strange patterns beneath them all, and then to<br> experiment to check again whether we have made the right guess. This<br> imagining process is so difficult that there is a division of labor in<br> physics: there are <i class=\"emph\">theoretical</i> physicists who imagine, deduce,<br> and guess at new laws, but do not experiment; and then there are<br> <i class=\"emph\">experimental</i> physicists who experiment, imagine, deduce, and<br> guess.</br></br></br></br></br></br></br></br></br></br></br></br></br></div><div class=\"para\" id=\"Ch1-S1-p4\"></div><div class=\"para\" id=\"Ch1-S1-p4\"> We said that the laws of nature are approximate: that we first find the<br> “wrong” ones, and then we find the “right” ones. Now, how can an<br> experiment be “wrong”? First, in a trivial way: if something is wrong<br> with the apparatus that you did not notice. But these things are easily<br> fixed, and checked back and forth. So without snatching at such minor<br> things, how <i class=\"emph\">can</i> the results of an experiment be wrong.</br></br></br></br></br></div><div class=\"para\" id=\"Ch1-S1-p4\"></div><div class=\"para\" id=\"Ch1-S1-p4\"> Only by<br> being inaccurate. For example, the mass of an object never seems to<br> change: a spinning top has the same weight as a still one. So a “law”<br> was invented: mass is constant, independent of speed. That “law” is<br> now found to be incorrect. Mass is found to increase with velocity, but<br> appreciable increases require velocities near that of light. A<br> <i class=\"emph\">true</i> law is: if an object moves with a speed of less than one<br> hundred miles a second the mass is constant to within one part in a<br> million. In some such approximate form this is a correct law. So in<br> practice one might think that the new law makes no significant<br> difference. Well, yes and no. For ordinary speeds we can certainly<br> forget it and use the simple constant-mass law as a good approximation.<br> But for high speeds we are wrong, and the higher the speed, the more<br> wrong we are.</br></br></br></br></br></br></br></br></br></br></br></br></br></div><div class=\"para\" id=\"Ch1-S1-p4\"></div><div class=\"para\" id=\"Ch1-S1-p4\"> Finally, and most interesting, <i class=\"emph\">philosophically we are completely<br> wrong</br></i> with the approximate law. Our entire picture of the world has to<br> be altered even though the mass changes only by a little bit. This is a<br> very peculiar thing about the philosophy, or the ideas, behind the laws.<br> Even a very small effect sometimes requires profound changes in our<br> ideas.</br></br></br></br></div></blockquote><p>It’s always fascinating to see how far a cult departs from the ideas of its inspirations. I think Richard Feynman would be even more disappointed to see how far today’s science fetishists have drifted from scientody in favor of scientistry that Jesus Christ would be to see the grotesqueries and abominations that are so often justified in his name. Jesus knew Man was hellbound of his own volition; Feynman was usually a bit more of an optimist.</p><div class=\"para\" id=\"Ch1-S1-p7\"></div></div>",
  "content_text": "For those who are interested in scientody rather than scientistry, the famous Feynman Lectures on physics\nare now online\n. “The Feynman Lectures on Physics was based on a two-year introductory physics course that Richard Feynman taught at Caltech from 1961 to 1963; it was published in three volumes during the years 1963 to 1965, and used as the introductory physics textbook at Caltech for nearly two decades.” In reading them, it’s not hard to understand why he is quite rightly revered as a minor secular saint of Science:\nEach piece, or part, of the whole of nature is always merely an\napproximation\nto the complete truth, or the complete truth so far\nas we know it. In fact, everything we know is only some kind of\napproximation, because\nwe know that we do not know all the laws\nas yet. Therefore, things must be learned only to be unlearned again or,\nmore likely, to be corrected.\nThe principle of science, the definition, almost, is the following:\nThe test of all knowledge is experiment\n. Experiment is the\nsole judge\nof scientific “truth.” But what is the source of\nknowledge? Where do the laws that are to be tested come from?\nExperiment, itself, helps to produce these laws, in the sense that it\ngives us hints. But also needed is\nimagination\nto create from\nthese hints the great generalizations—to guess at the wonderful,\nsimple, but very strange patterns beneath them all, and then to\nexperiment to check again whether we have made the right guess. This\nimagining process is so difficult that there is a division of labor in\nphysics: there are\ntheoretical\nphysicists who imagine, deduce,\nand guess at new laws, but do not experiment; and then there are\nexperimental\nphysicists who experiment, imagine, deduce, and\nguess.\nWe said that the laws of nature are approximate: that we first find the\n“wrong” ones, and then we find the “right” ones. Now, how can an\nexperiment be “wrong”? First, in a trivial way: if something is wrong\nwith the apparatus that you did not notice. But these things are easily\nfixed, and checked back and forth. So without snatching at such minor\nthings, how\ncan\nthe results of an experiment be wrong.\nOnly by\nbeing inaccurate. For example, the mass of an object never seems to\nchange: a spinning top has the same weight as a still one. So a “law”\nwas invented: mass is constant, independent of speed. That “law” is\nnow found to be incorrect. Mass is found to increase with velocity, but\nappreciable increases require velocities near that of light. A\ntrue\nlaw is: if an object moves with a speed of less than one\nhundred miles a second the mass is constant to within one part in a\nmillion. In some such approximate form this is a correct law. So in\npractice one might think that the new law makes no significant\ndifference. Well, yes and no. For ordinary speeds we can certainly\nforget it and use the simple constant-mass law as a good approximation.\nBut for high speeds we are wrong, and the higher the speed, the more\nwrong we are.\nFinally, and most interesting,\nphilosophically we are completely\nwrong\nwith the approximate law. Our entire picture of the world has to\nbe altered even though the mass changes only by a little bit. This is a\nvery peculiar thing about the philosophy, or the ideas, behind the laws.\nEven a very small effect sometimes requires profound changes in our\nideas.\nIt’s always fascinating to see how far a cult departs from the ideas of its inspirations. I think Richard Feynman would be even more disappointed to see how far today’s science fetishists have drifted from scientody in favor of scientistry that Jesus Christ would be to see the grotesqueries and abominations that are so often justified in his name. Jesus knew Man was hellbound of his own volition; Feynman was usually a bit more of an optimist.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-24T08:55:00+00:00"
}