{
  "url": "https://voxday.net/2013/09/06/the-decivilization-of-america/",
  "scraped_at": "2025-12-14T22:41:22.402875",
  "title": "The decivilization of America",
  "date_display": "September 6, 2013",
  "date_iso": "2013-09-06T17:00:00+00:00",
  "date_from_url": "2013-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed reminds us of the civilized society we have lost and<a href=\"http://www.fredoneverything.net/Surrender.shtml\"> explains why we lost it</a>:</p><blockquote class=\"tr_bq\"><p> This is why  as cultures break down, or mix with less civilized<br> cultures, more and more  police become necessary. So do locks, bars,<br> alarms, cameras and, for the  remaining virile, carry permits. Hello.</br></br></p><p>Here is one  reason why multiculturalism seldom works.<br> Suppose that one culture has a strong  work ethic, fairly strict sexual<br> morality, low illegitimacy, low crime, respect  for study and proper use<br> of the national language. Suppose that another culture  is precisely<br> opposite, or approximately opposite, as for example the Moslems in<br> France. If the first group is truly dominant, and imposes its<br> standards—you will  do your homework, kid—the second group may<br> successfully assimilate.</br></br></br></br></br></br></br></p><p>But suppose  that the dominant group isn´t really that<br> dominant and can´t, or won´t, impose  its values. How—in a school,<br> say—do you mix the toilet-mouthed with the  well-spoken, girls who<br> expect to marry before giving birth with fifteen year  old single<br> mothers pushing strollers into class? Or if the courts have decided<br> that “motherfucker· is an entire language to itself, and that<br> eradication of  the word would constitute imperial culture-abuse? The<br> effect will always be to  lower the civilized group to the uncivilized.</br></br></br></br></br></br></br></p></blockquote><p>This multi-generational societal devastation is the cost of giving in to the multiculturalist dogma of half-savages like Jemisin and fatherless, clueless hypocrites like Scalzi. McRacist and McRapey don’t understand that what they call racism and bigotry was the basic foundation of advanced civilization.  Civilization depends, <i>it has always depended</i>, upon keeping down the half-civilized, keeping out the barbarians, and preventing both the half-savages and full savages from infesting, infecting, and ultimately destroying the civilized aspects of a society.</p><p>Instead of gradually welcoming into society those exceptional Africans who followed the lead of blue-bottomed Brits and naked Germans in graduating from cannibalistic savagery and expecting from them the same rights and responsibilities of a civilized citizen, the Civil Rights movement insanely declared all humanity to be the same, thereby eliminating the all-important distinction between civilized human population groups and savage ones. Once that happened, it was only a matter of time before the enwiggification of America took place.</p><p>The Civil Rights movement didn’t merely destroy Constitutional rights, but literally gave naked, albino-eating, baby-raping cannibals the same intrinsic legal rights as highly civilized, highly moral Christian Europeans and told the romantic equalitarian fools to expect even better results than before. The Greeks knew better than that. The Romans knew better than that. The Imperial British knew better than that. And America’s Founding Fathers knew better than that.</p><p>Was it an accident? Of course not. There have always been those with the will to power, those who wish to rule unopposed by the will of the people. The Ciceronian cycle predicts the rise of aristocracy across the democratic world, and that is precisely what we are seeing in the elevation of the international corporate executive class and their relative immunity to the laws to which the rest of the population are subject.</p><p>Seen from this perspective, multiculturalism and the subsequent decline into vibrant semi-barbarism is merely a demographic application of the ancient strategic principle: divide and conquer.</p></div>",
  "content_text": "Fred Reed reminds us of the civilized society we have lost and\nexplains why we lost it\n:\nThis is why  as cultures break down, or mix with less civilized\ncultures, more and more  police become necessary. So do locks, bars,\nalarms, cameras and, for the  remaining virile, carry permits. Hello.\nHere is one  reason why multiculturalism seldom works.\nSuppose that one culture has a strong  work ethic, fairly strict sexual\nmorality, low illegitimacy, low crime, respect  for study and proper use\nof the national language. Suppose that another culture  is precisely\nopposite, or approximately opposite, as for example the Moslems in\nFrance. If the first group is truly dominant, and imposes its\nstandards—you will  do your homework, kid—the second group may\nsuccessfully assimilate.\nBut suppose  that the dominant group isn´t really that\ndominant and can´t, or won´t, impose  its values. How—in a school,\nsay—do you mix the toilet-mouthed with the  well-spoken, girls who\nexpect to marry before giving birth with fifteen year  old single\nmothers pushing strollers into class? Or if the courts have decided\nthat “motherfucker· is an entire language to itself, and that\neradication of  the word would constitute imperial culture-abuse? The\neffect will always be to  lower the civilized group to the uncivilized.\nThis multi-generational societal devastation is the cost of giving in to the multiculturalist dogma of half-savages like Jemisin and fatherless, clueless hypocrites like Scalzi. McRacist and McRapey don’t understand that what they call racism and bigotry was the basic foundation of advanced civilization.  Civilization depends,\nit has always depended\n, upon keeping down the half-civilized, keeping out the barbarians, and preventing both the half-savages and full savages from infesting, infecting, and ultimately destroying the civilized aspects of a society.\nInstead of gradually welcoming into society those exceptional Africans who followed the lead of blue-bottomed Brits and naked Germans in graduating from cannibalistic savagery and expecting from them the same rights and responsibilities of a civilized citizen, the Civil Rights movement insanely declared all humanity to be the same, thereby eliminating the all-important distinction between civilized human population groups and savage ones. Once that happened, it was only a matter of time before the enwiggification of America took place.\nThe Civil Rights movement didn’t merely destroy Constitutional rights, but literally gave naked, albino-eating, baby-raping cannibals the same intrinsic legal rights as highly civilized, highly moral Christian Europeans and told the romantic equalitarian fools to expect even better results than before. The Greeks knew better than that. The Romans knew better than that. The Imperial British knew better than that. And America’s Founding Fathers knew better than that.\nWas it an accident? Of course not. There have always been those with the will to power, those who wish to rule unopposed by the will of the people. The Ciceronian cycle predicts the rise of aristocracy across the democratic world, and that is precisely what we are seeing in the elevation of the international corporate executive class and their relative immunity to the laws to which the rest of the population are subject.\nSeen from this perspective, multiculturalism and the subsequent decline into vibrant semi-barbarism is merely a demographic application of the ancient strategic principle: divide and conquer.",
  "tags": [
    "decline and fall",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-06T16:00:00+00:00"
}