{
  "url": "https://voxday.net/2013/09/16/the-short-answer-not-so-much-these-days/",
  "scraped_at": "2025-12-14T22:42:25.609346",
  "title": "The short answer: not so much these days",
  "date_display": "September 16, 2013",
  "date_iso": "2013-09-16T17:00:00+00:00",
  "date_from_url": "2013-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A PhD candidate quits academia and explains <a href=\"http://crypto.junod.info/2013/09/09/an-aspiring-scientists-frustration-with-modern-day-academia-a-resignation/\">how professional academics have ruined science</a>:</p><blockquote class=\"tr_bq\"><div> (1) Academia: It’s Not Science, It’s Business</div><div></div><div> I’m going to start with the supposition that the goal of “science”<br> is to search for truth, to improve our understanding of the universe<br> around us, and to somehow use this understanding to move the world<br> towards a better tomorrow. At least, this is the propaganda that we’ve<br> often been fed while still young, and this is generally the propaganda<br> that universities that do research use to put themselves on lofty moral<br> ground, to decorate their websites, and to recruit naïve youngsters like<br> myself.</br></br></br></br></br></br></br></div><div></div><div> I’m also going to suppose that in order to find truth, the basic<br> prerequisite is that you, as a researcher, have to be brutally honest –<br> first and foremost, with yourself and about the quality of your own<br> work. Here one immediately encounters a contradiction, as such honesty<br> appears to have a very minor role in many people’s agendas. Very quickly<br> after your initiation in the academic world, you learn that being “too<br> honest” about your work is a bad thing and that stating your research’s<br> shortcomings “too openly” is a big <i>faux pas</i>. Instead, you are<br> taught to “sell” your work, to worry about your “image”, and to be<br> strategic in your vocabulary and where you use it. Preference is given<br> to good presentation over good content – a priority that, though<br> understandable at times, has now gone overboard. The “evil” kind of<br> networking (see, e.g.,<a href=\"http://thoughtcatalog.com/2011/networking-good-vs-evil/\">http://thoughtcatalog.com/2011/networking-good-vs-evil/</a>)<br> seems to be openly encouraged. With so many business-esque things to<br> worry about, it’s actually surprising that *any* scientific research<br> still gets done these days. Or perhaps not, since it’s precisely the<br> naïve PhDs, still new to the ropes, who do almost all of it.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div></div><div> (2) Academia: Work Hard, Young Padawan, So That One Day You Too May Manage!</div><div></div><div> I sometimes find it both funny and frightening that the majority of<br> the world’s academic research is actually being done by people like me,<br> who don’t even have a PhD degree. Many advisors, whom you would expect<br> to truly be pushing science forward with their decades of experience, do<br> surprisingly little and only appear to manage the PhD students, who<br> slave away on papers that their advisors then put their names on as a<br> sort of “fee” for having taken the time to read the document (sometimes,<br> in particularly desperate cases, they may even try to steal first<br> authorship). Rarely do I hear of advisors who actually go through their<br> students’ work in full rigor and detail, with many apparently having<br> adopted the “if it looks fine, we can submit it for publication”<br> approach.</br></br></br></br></br></br></br></br></br></br></br></div><div></div><p>Apart from feeling the gross unfairness of the whole thing – the<br> students, who do the real work, are paid/rewarded amazingly little,<br> while those who manage it, however superficially, are paid/rewarded<br> amazingly much – the PhD student is often left wondering if they are<br> only doing science now so that they may themselves manage later. The<br> worst is when a PhD who wants to stay in academia accepts this and<br> begins to play on the other side of the table. Every PhD student reading<br> this will inevitably know someone unlucky enough to have fallen upon an<br> advisor who has accepted this sort of management and is now inflicting<br> it on their own students – forcing them to write paper after paper and<br> to work ridiculous hours so that the advisor may advance his/her career<br> or, as if often the case, obtain tenure. This is unacceptable and needs<br> to stop….</br></br></br></br></br></br></br></br></br></br></br></br></p><div> (8) Academia: The Greatest Trick It Ever Pulled was Convincing the World That It was Necessary</div><div></div><div> Perhaps the most crucial, piercing question that the people in<br> academia should ask themselves is this: “Are we really needed?” Year<br> after year, the system takes in tons of money via all sorts of grants.<br> Much of this money then goes to pay underpaid and underappreciated PhD<br> students who, with or without the help of their advisors, produce some<br> results. In many cases, these results are incomprehensible to all except<br> a small circle, which makes their value difficult to evaluate in any<br> sort of objective manner. In some rare cases, the incomprehensibility is<br> actually justified – the result may be very powerful but may, for<br> example, require a lot of mathematical development that you really do<br> need a PhD to understand. In many cases, however, the result, though<br> requiring a lot of very cool math, is close to useless in application.</br></br></br></br></br></br></br></br></br></br></br></div><div></div><p>This is fine, because real progress is slow. What’s bothersome,<br> however, is how long a purely theoretical result can be milked for<br> grants before the researchers decide to produce something practically<br> useful. Worse yet, there often does not appear to be a strong urge for<br> people in academia to go and apply their result, even when this becomes<br> possible, which most likely stems from the fear of failure – you are<br> morally comfortable researching your method as long as it works in<br> theory, but nothing would hurt more than to try to apply it and to learn<br> that it doesn’t work in reality.</br></br></br></br></br></br></br></br></p></blockquote><p>This is written by a PhD candidate at a European university, but the problems he cites are, for the most part, imported from American universities, in which the problems are reportedly even more severe.  It is worth recalling that most of the great scientific discoveries throughout history were made by amateur scientists, not the professional academic guild that tries to claim ownership of a method and a knowledge base that long pre-dated it.</p><p>And it’s not just sour grapes from a non-finisher either. One commenter adds: <i>“I agree with everything the author said and more. I am just extremely<br/> disappointed at myself for not having seen it all this clearly earlier.<br/> It took a Master’s degree, a Ph.D degree and a post-doc at the best<br/> institutions in the world, until I started to see academia for what it<br/> is: a paper publishing business driven mostly by people who care nothing<br/> for the advancement of knowledge.” </i></p><p>I think this is why it is helpful to think about science in the tripartite terms I labeled in TIA. One should never confuse scientage or scientody for scientistry.  “Science”, as it exists today, is something of a bait-and-switch. What the PhD candidate is describing is scientistry, the practitioners of which have tried to elevate themselves on the basis of the public’s high regard for scientage and scientody. This has led to observably absurd statements such as PZ Myers’s claiming that “science is what scientists do”.</p><p>The answer is simple. Defund scientistry. Get rid of the third-rate bureaucrats and managers that have increasingly replaced the first-rate minds that used to dominate science. Return science to the technicians and the amateurs of an earlier, more successful, age.</p><p>Another commenter adds an important observation: <i>“Science is NOT a business, science is a charitable venture funded by<br/> government. And government is famously incompetent at getting ANYTHING<br/> done efficiently or sensibly, because government is also not a business,<br/> it lives off the taxpayer, few of whom even follow what their money is<br/> being spent on. So science is a big charade where bureaucrats hire<br/> committees of “respected” academics to make collective judgments on<br/> distributing the government funds, so all the conniving and deal-making<br/> and back-stabbing are a natural part of the process. It happens wherever<br/> government spends money, not just in science.”</i></p><p>That also explains why so many scientists hate libertarians.  They know we see through their scam.<i> </i></p></div>",
  "content_text": "A PhD candidate quits academia and explains\nhow professional academics have ruined science\n:\n(1) Academia: It’s Not Science, It’s Business\nI’m going to start with the supposition that the goal of “science”\nis to search for truth, to improve our understanding of the universe\naround us, and to somehow use this understanding to move the world\ntowards a better tomorrow. At least, this is the propaganda that we’ve\noften been fed while still young, and this is generally the propaganda\nthat universities that do research use to put themselves on lofty moral\nground, to decorate their websites, and to recruit naïve youngsters like\nmyself.\nI’m also going to suppose that in order to find truth, the basic\nprerequisite is that you, as a researcher, have to be brutally honest –\nfirst and foremost, with yourself and about the quality of your own\nwork. Here one immediately encounters a contradiction, as such honesty\nappears to have a very minor role in many people’s agendas. Very quickly\nafter your initiation in the academic world, you learn that being “too\nhonest” about your work is a bad thing and that stating your research’s\nshortcomings “too openly” is a big\nfaux pas\n. Instead, you are\ntaught to “sell” your work, to worry about your “image”, and to be\nstrategic in your vocabulary and where you use it. Preference is given\nto good presentation over good content – a priority that, though\nunderstandable at times, has now gone overboard. The “evil” kind of\nnetworking (see, e.g.,\nhttp://thoughtcatalog.com/2011/networking-good-vs-evil/\n)\nseems to be openly encouraged. With so many business-esque things to\nworry about, it’s actually surprising that *any* scientific research\nstill gets done these days. Or perhaps not, since it’s precisely the\nnaïve PhDs, still new to the ropes, who do almost all of it.\n(2) Academia: Work Hard, Young Padawan, So That One Day You Too May Manage!\nI sometimes find it both funny and frightening that the majority of\nthe world’s academic research is actually being done by people like me,\nwho don’t even have a PhD degree. Many advisors, whom you would expect\nto truly be pushing science forward with their decades of experience, do\nsurprisingly little and only appear to manage the PhD students, who\nslave away on papers that their advisors then put their names on as a\nsort of “fee” for having taken the time to read the document (sometimes,\nin particularly desperate cases, they may even try to steal first\nauthorship). Rarely do I hear of advisors who actually go through their\nstudents’ work in full rigor and detail, with many apparently having\nadopted the “if it looks fine, we can submit it for publication”\napproach.\nApart from feeling the gross unfairness of the whole thing – the\nstudents, who do the real work, are paid/rewarded amazingly little,\nwhile those who manage it, however superficially, are paid/rewarded\namazingly much – the PhD student is often left wondering if they are\nonly doing science now so that they may themselves manage later. The\nworst is when a PhD who wants to stay in academia accepts this and\nbegins to play on the other side of the table. Every PhD student reading\nthis will inevitably know someone unlucky enough to have fallen upon an\nadvisor who has accepted this sort of management and is now inflicting\nit on their own students – forcing them to write paper after paper and\nto work ridiculous hours so that the advisor may advance his/her career\nor, as if often the case, obtain tenure. This is unacceptable and needs\nto stop….\n(8) Academia: The Greatest Trick It Ever Pulled was Convincing the World That It was Necessary\nPerhaps the most crucial, piercing question that the people in\nacademia should ask themselves is this: “Are we really needed?” Year\nafter year, the system takes in tons of money via all sorts of grants.\nMuch of this money then goes to pay underpaid and underappreciated PhD\nstudents who, with or without the help of their advisors, produce some\nresults. In many cases, these results are incomprehensible to all except\na small circle, which makes their value difficult to evaluate in any\nsort of objective manner. In some rare cases, the incomprehensibility is\nactually justified – the result may be very powerful but may, for\nexample, require a lot of mathematical development that you really do\nneed a PhD to understand. In many cases, however, the result, though\nrequiring a lot of very cool math, is close to useless in application.\nThis is fine, because real progress is slow. What’s bothersome,\nhowever, is how long a purely theoretical result can be milked for\ngrants before the researchers decide to produce something practically\nuseful. Worse yet, there often does not appear to be a strong urge for\npeople in academia to go and apply their result, even when this becomes\npossible, which most likely stems from the fear of failure – you are\nmorally comfortable researching your method as long as it works in\ntheory, but nothing would hurt more than to try to apply it and to learn\nthat it doesn’t work in reality.\nThis is written by a PhD candidate at a European university, but the problems he cites are, for the most part, imported from American universities, in which the problems are reportedly even more severe.  It is worth recalling that most of the great scientific discoveries throughout history were made by amateur scientists, not the professional academic guild that tries to claim ownership of a method and a knowledge base that long pre-dated it.\nAnd it’s not just sour grapes from a non-finisher either. One commenter adds:\n“I agree with everything the author said and more. I am just extremely\ndisappointed at myself for not having seen it all this clearly earlier.\nIt took a Master’s degree, a Ph.D degree and a post-doc at the best\ninstitutions in the world, until I started to see academia for what it\nis: a paper publishing business driven mostly by people who care nothing\nfor the advancement of knowledge.”\nI think this is why it is helpful to think about science in the tripartite terms I labeled in TIA. One should never confuse scientage or scientody for scientistry.  “Science”, as it exists today, is something of a bait-and-switch. What the PhD candidate is describing is scientistry, the practitioners of which have tried to elevate themselves on the basis of the public’s high regard for scientage and scientody. This has led to observably absurd statements such as PZ Myers’s claiming that “science is what scientists do”.\nThe answer is simple. Defund scientistry. Get rid of the third-rate bureaucrats and managers that have increasingly replaced the first-rate minds that used to dominate science. Return science to the technicians and the amateurs of an earlier, more successful, age.\nAnother commenter adds an important observation:\n“Science is NOT a business, science is a charitable venture funded by\ngovernment. And government is famously incompetent at getting ANYTHING\ndone efficiently or sensibly, because government is also not a business,\nit lives off the taxpayer, few of whom even follow what their money is\nbeing spent on. So science is a big charade where bureaucrats hire\ncommittees of “respected” academics to make collective judgments on\ndistributing the government funds, so all the conniving and deal-making\nand back-stabbing are a natural part of the process. It happens wherever\ngovernment spends money, not just in science.”\nThat also explains why so many scientists hate libertarians.  They know we see through their scam.",
  "tags": [
    "education",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-16T16:00:00+00:00"
}