{
  "url": "https://voxday.net/2013/09/20/the-bitterness-of-broken-ideals/",
  "scraped_at": "2025-12-14T22:42:51.474848",
  "title": "The bitterness of broken ideals",
  "date_display": "September 20, 2013",
  "date_iso": "2013-09-20T13:00:00+00:00",
  "date_from_url": "2013-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright pens <a href=\"http://www.scifiwright.com/2013/09/the-glory-game-or-the-bitterness-of-broken-ideals/\">a long, far-ranging, and insightful essay</a>, beginning, of all things, with a quasi-Noir SF novel written by Keith Laumer. This is the section I found to be of particular interest, defining as it does the four schools of modern applied philosophy.</p><blockquote class=\"tr_bq\"><p> Usually the books that have the profoundest effect on us are those<br> encountered in the green youth of early adulthood, in the late teens or<br> early twenties, which provide some schema or structural explanation of<br> the complexities of life young adults so dearly need to orient<br> themselves. In my case, however, there is at least one book I<br> encountered later in life which provided a framework of pellucid clarity<br> for understanding the relation of schools of thought one to another.<br> There is many a student who regards the description in Plato’s REPUBLIC<br> of the degrees of the degeneration of the state as just such an<br> epiphany. This was to me what the REPUBLIC was to them. It comes from a<br> tract called <a href=\"http://www.amazon.com/Nihilism-The-Root-Revolution-Modern/dp/1887904069\">NIHILISM</a> by a man who delights in the name Archmonk Brother Seraphim Rose, albeit he was born Eugene Rose.</br></br></br></br></br></br></br></br></br></br></p><p>Rose’s scheme groups the schools of thought of Western man as he falls away from Christianity into four general categories.</p><p>The first school of thought is the classical liberal position of the<br> pragmatic man, which says that religious opinion is a private matter<br> that ought not to disturb the public weal by insisting on any special or<br> central position in life. Instead of God as the source and center and<br> summit of civilized life, or precise theologically defined dogmas<br> addressed to the last nuance, we should have instead a rogue and vague<br> dogma saying only that each man should mind his own business.</br></br></br></br></br></br></p><p>In this school, each man is free to seek his own pleasures in his own<br> way, climb to the summit of his ambitions without necessarily stepping<br> on those below him (but not necessarily giving him a hand either). We<br> all must agree only on general rules of civility and good sportsmanship<br> needed for public order; we need encourage and obey the civic virtues of<br> teamwork and self sacrifice where needed to keep the family, the city,<br> and the market free from fraud, trespass, or invasion, and perhaps to<br> curb such gross immorality or bad taste as pollutes the public weal.<br> Each man must show respect for the religious opinions of others without<br> showing uncomely zeal for his own.</br></br></br></br></br></br></br></br></br></p><p>In this school, ideals are impractical, because the world is<br> imperfect and cannot be made perfect; but civic virtue and the prudent<br> exercise of liberty and civilized tolerance of the dissent of others,<br> which is their prudent exercise of their liberty, is crucial. A healthy<br> respect for what are called ‘Judeo-Christian Values’ is crucial to the<br> civil order. God is not crucial.</br></br></br></br></br></p><p>Ironically, this is the liberal position as classically understood,<br> characterized by Locke and other Enlightenment writers, what would now<br> be called conservative. To avoid confusion, let us call this pragmatic and man-centric school<br> of thought ‘Worldliness.’ They want to leave heaven alone and tend to<br> business here on earth. They are hard-headed and hard-hearted men,<br> idealistic only for ideals that work, impatient with theory, concerned<br> with results.</br></br></br></br></br></br></p><p>The second school of thought is the sharp rebellion against this.<br> Where the Worldly position seeks worldly wealth, civic peace, and the<br> comfort of conformity in opinion, the radical rebellion seeks Heaven on<br> Earth, Utopian visions made solid, and all pragmatism is rejected as<br> treason against the Great Dream of the great cause. Religion and<br> Worldliness are rejected with scorn in favor of Ideology. Ideals are<br> impractical, so this school holds, only because men are weak vessels too<br> selfish to practice them: all the world could be made perfect if only<br> sufficient force was used on weak men by a sufficiently enlightened and<br> despotic Glorious Leader.</br></br></br></br></br></br></br></br></br></p><p>The only Ideology to afflict the modern era is Socialism and its<br> various mild epigones, Fabianism, Leftism, Feminism, Environmentalism,<br> Political Correctness,  and other Marxist offshoots. Nowadays they are<br> accustomed to deny their Marxist roots, but gaily and liberally use<br> simplistic Marxist myths about oppressors and oppressed to analyze human<br> relations between man and workingman, man and women, man and nature,<br> man and ideas. The relation is one of a ruthless Darwinian struggle for<br> survival between man and fill-in-the-blank, and even saying “he” rather<br> than “he and she” is defined as an act of oppression.</br></br></br></br></br></br></br></br></p><p>In this school, freedom is dismissed as selfishness and sacrificed to<br> the common good or the Great Dream of the Utopian vision. Man lives for<br> his neighbor, or, to be precise, for the Utopian vision. The only rules<br> demanded are those of loyalty to the Great Dream; disobedience of civil<br> authority either peaceful or violent or manically bloodthirsty is<br> allowed or required. All institutions of the state and church and civil<br> society are to be smashed, or, in the less violent version of the<br> Ideology, subverted, suborned, and subordinated to the Utopian vision.<br> Only the Great Dream merits love, loyalty, respect, honesty, courtesy;<br> only the Great Dream has rights; anyone disloyal to the Great Dream is<br> an enemy. Life is crusade.</br></br></br></br></br></br></br></br></br></br></p><p>Hatred of God and Man, hatred of Judeo-Christian and indeed all<br> civilized values of any sort, is required in the long run, albeit a<br> pretense of respecting ideals such as compassion for the poor or the<br/> equality of man is needed during the initial subversive period, to gain<br/> the aid of useful idiots.</br></br></p><p>Because this school of thought changes its name and its public<br/> rationale as frequently as the fashion industry changes the height of<br/> skirt hems, and because this school is fundamentally subversive, that<br/> is, fundamentally based on an inner circle deceiving the useful idiots<br/> of an outer circle who believe the opposite of the movement’s true<br/> purpose, no unambiguous name can be assigned these ideologues.</p><p>They are Socialists in economic issues, feminists on family<br/> questions, Greens on questions of industrial policy, Race-baiters and<br/> Hatemongers on questions of face, absurdist in art and vulgarians in<br/> culture, totalitarians in politics but libertarians when it comes to<br/> questions of vice and victimless crimes. They are materialists on<br/> philosophical issues, secularists on religious issues, pacifists on<br/> military issues (unless the question is civil war and the overthrow of<br/> their own institutions, whereupon they are bloodthirsty warhawks and<br/> apologists, nay, groupie and shrieking bobbysoxers of the world’s<br/> filthiest dictators).</p><p>In sum, they are idolaters who substitute the worship of Caesar for<br/> the worship of Christ; they are Gnostics in the posture of eternal<br/> rebellion both against God in Heaven and civil society on Earth. They<br/> are chameleons who adopt any ideals or values or party lines needed for<br/> so long as needed to destroy them, including Pragmatism, including<br/> Worldliness. They are Politically Correct and factually incorrect.</p><p>They seek to destroy civilized institutions here on Earth and drag<br/> Utopia down from heaven to replace them, indifferent, or even glorying,<br/> in the bloodshed required.</p><p>To avoid confusion, let us call them Ideologues. They are utterly<br/> unworldly, rejecting the pragmatism of the Worldly Man as cold and<br/> loveless and unspiritual. The Ideologues are as nearly a pure evil as mankind has ever produced<br/> or can imagine, but please note that their motives are the highest and<br/> noblest imaginable: they seek things of the spirit, peace on earth, food<br/> for the poor, dignity given to all men, and all such things which are<br/> the only things, the holy things, that can electrify dull mankind and<br/> stir him to take up the banner and trumpet and shining lance of high and<br/> holy crusade.</p><p>The pure putrefaction of their evil springs from their materialist<br/> philosophy, which says that man can create Eden on Earth, and overthrow<br/> the Curse on Adam that he must labor for his bread, overthrow the Curse<br/> of Eve, that says she will be subject to her husband, and over throw the<br/> curse on the snake, that says he will be bruised. Merely reaching out<br/> one’s hand, breaking all the laws of reason and morality, will allow<br/> one’s eyes to be opened, and to be God.</p><p>The materialist philosophy says that in a godless world all we need<br/> do to overthrow the laws of economics and the limits of human nature is<br/> shed enough blood and make enough sacrifices of other innocent people,<br/> and the mouths of endless cornucopias will be opened. You cannot make an<br/> omelet without a genocide of innocent eggs, and without Walter Duranty<br/> to get a Pulitzer for lying his ass off about it.</p><p>The Ideologue is a revulsion of the Worldly Man and his civilized<br/> pragmatism. The Worldly Man accepts necessary evils. The Worldly Man is<br/> willing to go to war for peace, and willing to tolerate his neighbor for<br/> peace. The Ideologue tolerates no one and nothing, not even an unspoken<br/> thought, if it is against the Party, against the Program, against the<br/> Great Leader, or against the Great Dream. The Ideologue is a<br/> heresy-hunter. But he is also a coward, since he is not willing to go to<br/> war; it revolts him that reality makes war necessary. He thinks peace<br/> comes from placating enemies with gifts, or enlightening them through<br/> education to the wonders of the Great Dream.</p><p>A third school of thought is in sharp rebellion against the first<br/> two. These are Otherworldly types, Theosophists and Spiritualists and<br/> New Age gurus and believers in various Americanized forms of Buddhism or<br/> Witchcraft or Astrology who utterly reject both the materialistic<br/> worldliness of the Worldly Man, and the fanaticism and bloodlust of the<br/> Ideologue.</p><p>The Otherworldly Men seek peace through renunciation, and escape from<br/> the turmoil of life through the pursuit of inner tranquility, perhaps<br/> aided by mystic visions, meditations, or voices from the outer worlds,<br/> or hallucinogenic drugs. Not for them the looming smokestack of the scientifically planned<br/> socialist utopia of the Ideologues, nor the loud billboards and hungry<br/> strip malls of the Worldly. They want to live in Hobbiton, or Arcadia,<br/> of with the tribes that only exist in the imagination of Rousseau, noble<br/> savages in harmony with nature, or perhaps the movie DANCES WITH WOLVES<br/> or AVATAR (not the real one).</p><p>This movement has never been numerous enough to merit its own name,<br/> and although it often combined with the Ideologues their enemies against<br/> their mutual enemies the Worldly Men, the Otherworldly Men have no<br/> name. Call them Spiritualists.</p><p>The Spiritualists are utterly unpragmatic and irrational about their<br/> religious sentiments. They are the type of men who believe in angels but<br/> not in God. They have no use for theology or reasoning about spiritual<br/> or moral issues, much less metaphysics. They are the dilettante and<br/> aesthetes of the spirit world, seeking sensation rather than<br/> understanding, novelty rather than certainty, seeking a spiritual truth<br/> that will serve them and flatter them and provide for them, not a God<br/> whom they must serve.</p><p>They feel toward the things of the spirit what the Worldly Man feels<br/> towards worldly goods in the marketplace. The only thing the<br/> Spiritualist does not want is a final answer, an organized religion, a<br/> Church. They want to hear gossip from the Ghost of Cleopatra but not<br/> words of power from the Prophet Jeremiah. The only thing the spiritual<br/> seeker does not want is for the Holy Spirit to come to find him, and to<br/> find him out.</p><p>The Spiritualists are as nearly worthless in peace or war as it is<br/> possible for any warm bodies occupying space and breathing in otherwise<br/> useful oxygen can be, but their motive is noble and high and pure. They<br/> suffer the same revulsion about worldliness and the same yearning for<br/> something better than war as does a hermit standing on a pillar in the<br/> desert.</p><p>Their drive is indeed purely spiritual, but it does not drive them<br/> toward the only reality worth seeking in the spirit world, namely, the<br/> Holy Spirit. Hence the effort is self-centered, reaches nowhere,<br/> inspires no social revolutions, builds no observatories, erects no<br/> universities, opens no charity hospitals, captures no Holy Lands, kills<br/> no Saracens, galvanizes no missionaries to spread the Good News of<br/> Fashionable Theosophist Blither to the enlightened savages. Charity, the<br/> burning love of the Christian, is impossible in the Spiritualist<br/> framework because charity requires an objective standard of values, a<br/> living truth as terrible as unquenchable fire, and not merely a selfish<br/> seeking for truth.</p><p>Although much less violent and much, much, <i>much</i> less<br/> dishonest than the Ideologues, the Spiritualists are also, ironically,<br/> farther from God and farther from the truth. The Ideologue is at least<br/> willing to join a crusade, man a barricade, march in a protest, send<br/> money and mash notes to gangsters in Russia and sadists in Cuba, and<br/> falsify news reports about the murders and enormities of their fellow<br/> travelers.</p><p>The Ideologue has a perverted ideal of charity toward the poor and<br/> downtrodden in the same way that the homosexual has a perverted ideal of<br/> romantic love; and it is just as sterile and vile. But in the same way<br/> that the sodomite at least is a step above masturbation, in that his<br/> love at least turns outward toward another man, the Ideologue is at<br/> least concerned with destroying allegedly unjust social institutions<br/> such as church and state and marriage and sanity, whereas the<br/> Spiritualist wishes, like the shy cenobite, to withdraw from the shock<br/> and jar of the world and seek the ineffable in private. Spiritualism is<br/> the otherworldly version of the Sin of Onan.</p><p>The final school of thought is not a school of thought at all, but an<br/> exhausted rejection of thought. This is Nihilism, and it is the<br/> dominant philosophy of our age, and the unspoken assumption underlying<br/> nearly every major social policy debated or enacted today.</p><p>Nihilism is the metaphysical posture that no truth is actually true.<br/> If no truth is true, life is what you yourself have the strength of will<br/> to decree it to be, like God separating Light from Darkness at the dawn<br/> of time, by fiat. If no truth is true, no flag is truly worth dying for<br/> or fighting for or even arguing about, and no marriage is final and no<br/> contract is binding and your word of honor means nothing, and you owe<br/> your friends no loyalty.</p><p>If no truth is true, the only impermissible sin is to believe and preach and practice the truth.</p><p>Nihilism shares with Worldliness its patience for dissent. Since no<br/> truth is true, there is no point in disagreeing with another man, nor<br/> even having a deep conversation with him on any topic, not even to<br/> discover whether he disagrees or not.</p><p>Nihilism shares with Ideologues its contempt for worldly and material<br/> things, for ambition and self-made men. None of these things are worth<br/> seeking in and of themselves, but only if you, in your godlike<br/> self-sovereignty, deem or decree them to be worth seeking.</p><p>Nihilism shares with Spiritualism its distaste for theology or reason or organized religion.</p><p>The Nihilist lives in a formless void, and believes only in himself,<br/> his willpower, his self image and his self esteem. His motto is that<br/> life is what you make it.</p><p>He sees the long and tragic history of man, with all its kings and<br/> slaves and wars and empires and monarchs and democracies and despots and<br/> with all its philosophers and saints and sages, and sees that none of<br/> these things have brought peace.</p><p>And so he condemns all systems, all sagacity and all saintliness to<br/> oblivion, and promises that as soon as men realize that there is nothing<br/> in the universe, then nothing will be worth fighting for, and man will<br/> have peace.</p><p>The Nihilist does not mention that man will no longer be man in any<br/> recognizable sense of the word, merely a dull lump of meat seeking to<br/> beguile the hours with diversions both refined and profane until kindly<br/> death relieves him of the intolerable burden of an conscious existence<br/> he did not seek and does not use. Nihilism is the cult of death.</p><p>Unlike the Worldly Man, or the Ideologue, or the Spiritualist, the<br/> Nihilist seeks nothing but to bolster his self esteem and entertain<br/> himself to death. Nihilism is an end-state. There is no room for a<br/> rebellion away from Nihilism because there is nothing away from which to<br/> rebel.</p><p>The reason why I say the scheme of Seraphim Rose maps out the mental<br/> landscape from now until the end of the world is that Nihilism is a dead<br/> end. There is no further point of degeneration beneath which to fall.<br/> Once your philosophy tells you all philosophy is vain, you cannot erect a<br/> new philosophical variation on that foundation. There will never be<br/> such a thing as Neo-Nihilism or Post-Nihilism.</p><p>The reason why I say the scheme is complete is that there are no<br/> other major variations possible, once Christianity is abandoned, for a<br/> worldview.</p></blockquote><p>The whole essay is well worth the investment of time required.  Read it. His observation concerning Nihilism is particularly significant with regards to literature, especially SF/F literature. It is evident that we are in the process of seeing SF/F transform from the Ideologues like John Scalzi, Steven Gould, and their female acolytes who are far too trivial to bother naming, to the Nihilists such as George Martin and Joe Abercrombie, just as it previously transformed from the Worldly perspective of Heinlein, Clarke, and Asimov to the Ideologues.</p><p>Against these things stand the Traditionalists of the Empty Tomb. With MacDonald and Chesterton and Lewis and Tolkien we will stand, as unmoved and unimpressed by the Nihilists as we were by the Ideologues and the Spiritualists before them.  And while we can co-exist in mutual self-respect with the Worldly, we must recognize that our perspectives and philosophies are, in the end, fundamentally different, though not necessarily opposed.</p></div>",
  "content_text": "John C. Wright pens\na long, far-ranging, and insightful essay\n, beginning, of all things, with a quasi-Noir SF novel written by Keith Laumer. This is the section I found to be of particular interest, defining as it does the four schools of modern applied philosophy.\nUsually the books that have the profoundest effect on us are those\nencountered in the green youth of early adulthood, in the late teens or\nearly twenties, which provide some schema or structural explanation of\nthe complexities of life young adults so dearly need to orient\nthemselves. In my case, however, there is at least one book I\nencountered later in life which provided a framework of pellucid clarity\nfor understanding the relation of schools of thought one to another.\nThere is many a student who regards the description in Plato’s REPUBLIC\nof the degrees of the degeneration of the state as just such an\nepiphany. This was to me what the REPUBLIC was to them. It comes from a\ntract called\nNIHILISM\nby a man who delights in the name Archmonk Brother Seraphim Rose, albeit he was born Eugene Rose.\nRose’s scheme groups the schools of thought of Western man as he falls away from Christianity into four general categories.\nThe first school of thought is the classical liberal position of the\npragmatic man, which says that religious opinion is a private matter\nthat ought not to disturb the public weal by insisting on any special or\ncentral position in life. Instead of God as the source and center and\nsummit of civilized life, or precise theologically defined dogmas\naddressed to the last nuance, we should have instead a rogue and vague\ndogma saying only that each man should mind his own business.\nIn this school, each man is free to seek his own pleasures in his own\nway, climb to the summit of his ambitions without necessarily stepping\non those below him (but not necessarily giving him a hand either). We\nall must agree only on general rules of civility and good sportsmanship\nneeded for public order; we need encourage and obey the civic virtues of\nteamwork and self sacrifice where needed to keep the family, the city,\nand the market free from fraud, trespass, or invasion, and perhaps to\ncurb such gross immorality or bad taste as pollutes the public weal.\nEach man must show respect for the religious opinions of others without\nshowing uncomely zeal for his own.\nIn this school, ideals are impractical, because the world is\nimperfect and cannot be made perfect; but civic virtue and the prudent\nexercise of liberty and civilized tolerance of the dissent of others,\nwhich is their prudent exercise of their liberty, is crucial. A healthy\nrespect for what are called ‘Judeo-Christian Values’ is crucial to the\ncivil order. God is not crucial.\nIronically, this is the liberal position as classically understood,\ncharacterized by Locke and other Enlightenment writers, what would now\nbe called conservative. To avoid confusion, let us call this pragmatic and man-centric school\nof thought ‘Worldliness.’ They want to leave heaven alone and tend to\nbusiness here on earth. They are hard-headed and hard-hearted men,\nidealistic only for ideals that work, impatient with theory, concerned\nwith results.\nThe second school of thought is the sharp rebellion against this.\nWhere the Worldly position seeks worldly wealth, civic peace, and the\ncomfort of conformity in opinion, the radical rebellion seeks Heaven on\nEarth, Utopian visions made solid, and all pragmatism is rejected as\ntreason against the Great Dream of the great cause. Religion and\nWorldliness are rejected with scorn in favor of Ideology. Ideals are\nimpractical, so this school holds, only because men are weak vessels too\nselfish to practice them: all the world could be made perfect if only\nsufficient force was used on weak men by a sufficiently enlightened and\ndespotic Glorious Leader.\nThe only Ideology to afflict the modern era is Socialism and its\nvarious mild epigones, Fabianism, Leftism, Feminism, Environmentalism,\nPolitical Correctness,  and other Marxist offshoots. Nowadays they are\naccustomed to deny their Marxist roots, but gaily and liberally use\nsimplistic Marxist myths about oppressors and oppressed to analyze human\nrelations between man and workingman, man and women, man and nature,\nman and ideas. The relation is one of a ruthless Darwinian struggle for\nsurvival between man and fill-in-the-blank, and even saying “he” rather\nthan “he and she” is defined as an act of oppression.\nIn this school, freedom is dismissed as selfishness and sacrificed to\nthe common good or the Great Dream of the Utopian vision. Man lives for\nhis neighbor, or, to be precise, for the Utopian vision. The only rules\ndemanded are those of loyalty to the Great Dream; disobedience of civil\nauthority either peaceful or violent or manically bloodthirsty is\nallowed or required. All institutions of the state and church and civil\nsociety are to be smashed, or, in the less violent version of the\nIdeology, subverted, suborned, and subordinated to the Utopian vision.\nOnly the Great Dream merits love, loyalty, respect, honesty, courtesy;\nonly the Great Dream has rights; anyone disloyal to the Great Dream is\nan enemy. Life is crusade.\nHatred of God and Man, hatred of Judeo-Christian and indeed all\ncivilized values of any sort, is required in the long run, albeit a\npretense of respecting ideals such as compassion for the poor or the\nequality of man is needed during the initial subversive period, to gain\nthe aid of useful idiots.\nBecause this school of thought changes its name and its public\nrationale as frequently as the fashion industry changes the height of\nskirt hems, and because this school is fundamentally subversive, that\nis, fundamentally based on an inner circle deceiving the useful idiots\nof an outer circle who believe the opposite of the movement’s true\npurpose, no unambiguous name can be assigned these ideologues.\nThey are Socialists in economic issues, feminists on family\nquestions, Greens on questions of industrial policy, Race-baiters and\nHatemongers on questions of face, absurdist in art and vulgarians in\nculture, totalitarians in politics but libertarians when it comes to\nquestions of vice and victimless crimes. They are materialists on\nphilosophical issues, secularists on religious issues, pacifists on\nmilitary issues (unless the question is civil war and the overthrow of\ntheir own institutions, whereupon they are bloodthirsty warhawks and\napologists, nay, groupie and shrieking bobbysoxers of the world’s\nfilthiest dictators).\nIn sum, they are idolaters who substitute the worship of Caesar for\nthe worship of Christ; they are Gnostics in the posture of eternal\nrebellion both against God in Heaven and civil society on Earth. They\nare chameleons who adopt any ideals or values or party lines needed for\nso long as needed to destroy them, including Pragmatism, including\nWorldliness. They are Politically Correct and factually incorrect.\nThey seek to destroy civilized institutions here on Earth and drag\nUtopia down from heaven to replace them, indifferent, or even glorying,\nin the bloodshed required.\nTo avoid confusion, let us call them Ideologues. They are utterly\nunworldly, rejecting the pragmatism of the Worldly Man as cold and\nloveless and unspiritual. The Ideologues are as nearly a pure evil as mankind has ever produced\nor can imagine, but please note that their motives are the highest and\nnoblest imaginable: they seek things of the spirit, peace on earth, food\nfor the poor, dignity given to all men, and all such things which are\nthe only things, the holy things, that can electrify dull mankind and\nstir him to take up the banner and trumpet and shining lance of high and\nholy crusade.\nThe pure putrefaction of their evil springs from their materialist\nphilosophy, which says that man can create Eden on Earth, and overthrow\nthe Curse on Adam that he must labor for his bread, overthrow the Curse\nof Eve, that says she will be subject to her husband, and over throw the\ncurse on the snake, that says he will be bruised. Merely reaching out\none’s hand, breaking all the laws of reason and morality, will allow\none’s eyes to be opened, and to be God.\nThe materialist philosophy says that in a godless world all we need\ndo to overthrow the laws of economics and the limits of human nature is\nshed enough blood and make enough sacrifices of other innocent people,\nand the mouths of endless cornucopias will be opened. You cannot make an\nomelet without a genocide of innocent eggs, and without Walter Duranty\nto get a Pulitzer for lying his ass off about it.\nThe Ideologue is a revulsion of the Worldly Man and his civilized\npragmatism. The Worldly Man accepts necessary evils. The Worldly Man is\nwilling to go to war for peace, and willing to tolerate his neighbor for\npeace. The Ideologue tolerates no one and nothing, not even an unspoken\nthought, if it is against the Party, against the Program, against the\nGreat Leader, or against the Great Dream. The Ideologue is a\nheresy-hunter. But he is also a coward, since he is not willing to go to\nwar; it revolts him that reality makes war necessary. He thinks peace\ncomes from placating enemies with gifts, or enlightening them through\neducation to the wonders of the Great Dream.\nA third school of thought is in sharp rebellion against the first\ntwo. These are Otherworldly types, Theosophists and Spiritualists and\nNew Age gurus and believers in various Americanized forms of Buddhism or\nWitchcraft or Astrology who utterly reject both the materialistic\nworldliness of the Worldly Man, and the fanaticism and bloodlust of the\nIdeologue.\nThe Otherworldly Men seek peace through renunciation, and escape from\nthe turmoil of life through the pursuit of inner tranquility, perhaps\naided by mystic visions, meditations, or voices from the outer worlds,\nor hallucinogenic drugs. Not for them the looming smokestack of the scientifically planned\nsocialist utopia of the Ideologues, nor the loud billboards and hungry\nstrip malls of the Worldly. They want to live in Hobbiton, or Arcadia,\nof with the tribes that only exist in the imagination of Rousseau, noble\nsavages in harmony with nature, or perhaps the movie DANCES WITH WOLVES\nor AVATAR (not the real one).\nThis movement has never been numerous enough to merit its own name,\nand although it often combined with the Ideologues their enemies against\ntheir mutual enemies the Worldly Men, the Otherworldly Men have no\nname. Call them Spiritualists.\nThe Spiritualists are utterly unpragmatic and irrational about their\nreligious sentiments. They are the type of men who believe in angels but\nnot in God. They have no use for theology or reasoning about spiritual\nor moral issues, much less metaphysics. They are the dilettante and\naesthetes of the spirit world, seeking sensation rather than\nunderstanding, novelty rather than certainty, seeking a spiritual truth\nthat will serve them and flatter them and provide for them, not a God\nwhom they must serve.\nThey feel toward the things of the spirit what the Worldly Man feels\ntowards worldly goods in the marketplace. The only thing the\nSpiritualist does not want is a final answer, an organized religion, a\nChurch. They want to hear gossip from the Ghost of Cleopatra but not\nwords of power from the Prophet Jeremiah. The only thing the spiritual\nseeker does not want is for the Holy Spirit to come to find him, and to\nfind him out.\nThe Spiritualists are as nearly worthless in peace or war as it is\npossible for any warm bodies occupying space and breathing in otherwise\nuseful oxygen can be, but their motive is noble and high and pure. They\nsuffer the same revulsion about worldliness and the same yearning for\nsomething better than war as does a hermit standing on a pillar in the\ndesert.\nTheir drive is indeed purely spiritual, but it does not drive them\ntoward the only reality worth seeking in the spirit world, namely, the\nHoly Spirit. Hence the effort is self-centered, reaches nowhere,\ninspires no social revolutions, builds no observatories, erects no\nuniversities, opens no charity hospitals, captures no Holy Lands, kills\nno Saracens, galvanizes no missionaries to spread the Good News of\nFashionable Theosophist Blither to the enlightened savages. Charity, the\nburning love of the Christian, is impossible in the Spiritualist\nframework because charity requires an objective standard of values, a\nliving truth as terrible as unquenchable fire, and not merely a selfish\nseeking for truth.\nAlthough much less violent and much, much,\nmuch\nless\ndishonest than the Ideologues, the Spiritualists are also, ironically,\nfarther from God and farther from the truth. The Ideologue is at least\nwilling to join a crusade, man a barricade, march in a protest, send\nmoney and mash notes to gangsters in Russia and sadists in Cuba, and\nfalsify news reports about the murders and enormities of their fellow\ntravelers.\nThe Ideologue has a perverted ideal of charity toward the poor and\ndowntrodden in the same way that the homosexual has a perverted ideal of\nromantic love; and it is just as sterile and vile. But in the same way\nthat the sodomite at least is a step above masturbation, in that his\nlove at least turns outward toward another man, the Ideologue is at\nleast concerned with destroying allegedly unjust social institutions\nsuch as church and state and marriage and sanity, whereas the\nSpiritualist wishes, like the shy cenobite, to withdraw from the shock\nand jar of the world and seek the ineffable in private. Spiritualism is\nthe otherworldly version of the Sin of Onan.\nThe final school of thought is not a school of thought at all, but an\nexhausted rejection of thought. This is Nihilism, and it is the\ndominant philosophy of our age, and the unspoken assumption underlying\nnearly every major social policy debated or enacted today.\nNihilism is the metaphysical posture that no truth is actually true.\nIf no truth is true, life is what you yourself have the strength of will\nto decree it to be, like God separating Light from Darkness at the dawn\nof time, by fiat. If no truth is true, no flag is truly worth dying for\nor fighting for or even arguing about, and no marriage is final and no\ncontract is binding and your word of honor means nothing, and you owe\nyour friends no loyalty.\nIf no truth is true, the only impermissible sin is to believe and preach and practice the truth.\nNihilism shares with Worldliness its patience for dissent. Since no\ntruth is true, there is no point in disagreeing with another man, nor\neven having a deep conversation with him on any topic, not even to\ndiscover whether he disagrees or not.\nNihilism shares with Ideologues its contempt for worldly and material\nthings, for ambition and self-made men. None of these things are worth\nseeking in and of themselves, but only if you, in your godlike\nself-sovereignty, deem or decree them to be worth seeking.\nNihilism shares with Spiritualism its distaste for theology or reason or organized religion.\nThe Nihilist lives in a formless void, and believes only in himself,\nhis willpower, his self image and his self esteem. His motto is that\nlife is what you make it.\nHe sees the long and tragic history of man, with all its kings and\nslaves and wars and empires and monarchs and democracies and despots and\nwith all its philosophers and saints and sages, and sees that none of\nthese things have brought peace.\nAnd so he condemns all systems, all sagacity and all saintliness to\noblivion, and promises that as soon as men realize that there is nothing\nin the universe, then nothing will be worth fighting for, and man will\nhave peace.\nThe Nihilist does not mention that man will no longer be man in any\nrecognizable sense of the word, merely a dull lump of meat seeking to\nbeguile the hours with diversions both refined and profane until kindly\ndeath relieves him of the intolerable burden of an conscious existence\nhe did not seek and does not use. Nihilism is the cult of death.\nUnlike the Worldly Man, or the Ideologue, or the Spiritualist, the\nNihilist seeks nothing but to bolster his self esteem and entertain\nhimself to death. Nihilism is an end-state. There is no room for a\nrebellion away from Nihilism because there is nothing away from which to\nrebel.\nThe reason why I say the scheme of Seraphim Rose maps out the mental\nlandscape from now until the end of the world is that Nihilism is a dead\nend. There is no further point of degeneration beneath which to fall.\nOnce your philosophy tells you all philosophy is vain, you cannot erect a\nnew philosophical variation on that foundation. There will never be\nsuch a thing as Neo-Nihilism or Post-Nihilism.\nThe reason why I say the scheme is complete is that there are no\nother major variations possible, once Christianity is abandoned, for a\nworldview.\nThe whole essay is well worth the investment of time required.  Read it. His observation concerning Nihilism is particularly significant with regards to literature, especially SF/F literature. It is evident that we are in the process of seeing SF/F transform from the Ideologues like John Scalzi, Steven Gould, and their female acolytes who are far too trivial to bother naming, to the Nihilists such as George Martin and Joe Abercrombie, just as it previously transformed from the Worldly perspective of Heinlein, Clarke, and Asimov to the Ideologues.\nAgainst these things stand the Traditionalists of the Empty Tomb. With MacDonald and Chesterton and Lewis and Tolkien we will stand, as unmoved and unimpressed by the Nihilists as we were by the Ideologues and the Spiritualists before them.  And while we can co-exist in mutual self-respect with the Worldly, we must recognize that our perspectives and philosophies are, in the end, fundamentally different, though not necessarily opposed.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-20T12:00:00+00:00"
}