{
  "url": "https://voxday.net/2013/09/27/the-history-of-three-finger-salute/",
  "scraped_at": "2025-12-14T22:43:37.563004",
  "title": "The history of the three-finger salute",
  "date_display": "September 27, 2013",
  "date_iso": "2013-09-27T17:00:00+00:00",
  "date_from_url": "2013-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"secondPar\"> Bill Gates appears to have not infrequently gotten things right <a href=\"http://www.telegraph.co.uk/technology/microsoft/10337653/Bill-Gates-CtrlAltDel-was-a-mistake.html\">by accident</a>:<blockquote class=\"tr_bq\"><p> Speaking at a fundraising campaign at Harvard University, however, <a href=\"http://www.telegraph.co.uk/technology/bill-gates/\"><b>Gates</b></a><br> blamed IBM engineer David Bradley for the so-called “three-fingered<br> salute”, claiming that he had favoured a single button.</br></br></p><p>“We could have had a single button, but the guy who did the IBM keyboard<br> design didn’t want to give us our single button,” he said.</br></p><p>Bradley originally designed Ctrl+Alt+Esc to trigger a reboot, but he found it<br> was too easy to bump the left side of the keyboard and reboot the computer<br> accidentally. He switched the key combination to Ctrl+Alt+Del – a<br> combination that was impossible to press with just one hand on the original<br> IBM PC keyboard.</br></br></br></br></p></blockquote></div><p>One of the craziest things I ever saw was a programmer who designed a software program with a menu that you accessed by hitting Ctrl+Alt+F4+Del.  Intuitive and risk-free!</p></div>",
  "content_text": "Bill Gates appears to have not infrequently gotten things right\nby accident\n:\nSpeaking at a fundraising campaign at Harvard University, however,\nGates\nblamed IBM engineer David Bradley for the so-called “three-fingered\nsalute”, claiming that he had favoured a single button.\n“We could have had a single button, but the guy who did the IBM keyboard\ndesign didn’t want to give us our single button,” he said.\nBradley originally designed Ctrl+Alt+Esc to trigger a reboot, but he found it\nwas too easy to bump the left side of the keyboard and reboot the computer\naccidentally. He switched the key combination to Ctrl+Alt+Del – a\ncombination that was impossible to press with just one hand on the original\nIBM PC keyboard.\nOne of the craziest things I ever saw was a programmer who designed a software program with a menu that you accessed by hitting Ctrl+Alt+F4+Del.  Intuitive and risk-free!",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-27T16:00:00+00:00"
}