{
  "url": "https://voxday.net/2013/09/25/the-fundamental-human-right-of-self/",
  "scraped_at": "2025-12-14T22:43:20.462059",
  "title": "The fundamental human right of self-defense",
  "date_display": "September 25, 2013",
  "date_iso": "2013-09-25T13:00:00+00:00",
  "date_from_url": "2013-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is long past time for gun owners and human rights activists go on the offensive and proactively demand global recognition of <a href=\"http://www.foxnews.com/story/2002/10/17/next-international-right/\">the basic human right to own and carry firearms</a> everywhere for self-defense:</p><blockquote class=\"tr_bq\"><p> After World War II, the “international community” determined that the most important goal of the new international system created for the post-war era would be the prevention of genocide. “Never again,” we were told, and nations signed the Convention on the Prevention and Punishment of the Crime of Genocide in large numbers.</p><p>Among the nations who signed were Cambodia (1950), the Congo (1962) and Rwanda (1975), though Rwanda was originally covered by Belgium’s agreement in 1952, when Rwanda was a Trust Territory administered by Belgium. These three nations, of course, went on to become the greatest sites of genocide in the second half of the 20th century. (China’s mass murders and starvation under Mao are more properly called “democide,” as they did not single out a particular group or culture.)</p><p>In every case, the “international community” stood aside while the genocide took place unimpeded by the parchment barriers of international agreement….</p><p>It seems to me that the human rights community has things exactly<br> backward. Given that the efforts of the international community to<br> prevent and punish genocide over the past several decades have been, to<br> put it politely, a dismal failure, perhaps it is time to try a new<br> approach. International human rights law is supposed to be a “living”<br> body of law that changes with the needs of the times in order to secure<br> important goals — chief among which is the prevention of genocide.<br> Given that the traditional approaches of conventions and tribunals have<br> failed miserably, the human rights community should be prepared to<br> endorse a new international human right: the right of law-abiding<br> citizens to be armed.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I didn’t realize who wrote this until I reached the bottom. It may be the single most important thing Instapundit has ever written. This is the difference between the conservative and the libertarian. The conservative is always on the defensive. The libertarian, on the other hand, is capable of proactively demanding the expansion of human liberty.</p><p>In this day of massive and intrusive government prone to false flags, global spying, and gargantuan financial fraud, it is a human rights campaign on par with the historical campaign against the slave trade. The right to bear arms isn’t only for Americans. Bearing arms is a basic human right.</p></div>",
  "content_text": "It is long past time for gun owners and human rights activists go on the offensive and proactively demand global recognition of\nthe basic human right to own and carry firearms\neverywhere for self-defense:\nAfter World War II, the “international community” determined that the most important goal of the new international system created for the post-war era would be the prevention of genocide. “Never again,” we were told, and nations signed the Convention on the Prevention and Punishment of the Crime of Genocide in large numbers.\nAmong the nations who signed were Cambodia (1950), the Congo (1962) and Rwanda (1975), though Rwanda was originally covered by Belgium’s agreement in 1952, when Rwanda was a Trust Territory administered by Belgium. These three nations, of course, went on to become the greatest sites of genocide in the second half of the 20th century. (China’s mass murders and starvation under Mao are more properly called “democide,” as they did not single out a particular group or culture.)\nIn every case, the “international community” stood aside while the genocide took place unimpeded by the parchment barriers of international agreement….\nIt seems to me that the human rights community has things exactly\nbackward. Given that the efforts of the international community to\nprevent and punish genocide over the past several decades have been, to\nput it politely, a dismal failure, perhaps it is time to try a new\napproach. International human rights law is supposed to be a “living”\nbody of law that changes with the needs of the times in order to secure\nimportant goals — chief among which is the prevention of genocide.\nGiven that the traditional approaches of conventions and tribunals have\nfailed miserably, the human rights community should be prepared to\nendorse a new international human right: the right of law-abiding\ncitizens to be armed.\nI didn’t realize who wrote this until I reached the bottom. It may be the single most important thing Instapundit has ever written. This is the difference between the conservative and the libertarian. The conservative is always on the defensive. The libertarian, on the other hand, is capable of proactively demanding the expansion of human liberty.\nIn this day of massive and intrusive government prone to false flags, global spying, and gargantuan financial fraud, it is a human rights campaign on par with the historical campaign against the slave trade. The right to bear arms isn’t only for Americans. Bearing arms is a basic human right.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-25T12:00:00+00:00"
}