{
  "url": "https://voxday.net/2013/09/14/the-satire-defense/",
  "scraped_at": "2025-12-14T22:42:14.350697",
  "title": "Satire and statistical misrepresentation",
  "date_display": "September 14, 2013",
  "date_iso": "2013-09-14T19:00:00+00:00",
  "date_from_url": "2013-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>McRapey <a href=\"https://twitter.com/scalzi/status/378332763776352257\">explains himself</a>:</p><blockquote class=\"tr_bq\"><p> Call me old fashioned, but “satire” isn’t actually defined as “the excuse I use when I’m a racist, sexist asshole on Twitter.”</p></blockquote><p>That’s true, it’s the excuse he uses when he’s a rapey, sexual assailant <a href=\"http://www.milobookclub.com/2012/10/27/john-scalzi-is-rapis/\">on Whatever</a>. And because he’s still belatedly trying to cover the fact that I caught him out lying, yesterday he was spinning matters related to his site traffic again.</p><blockquote class=\"tr_bq\"><p> At some point yesterday the site passed the 30 million all time views, “all time” in this case defined as “visits recorded by the WordPress stats program since early October 2008,” which is when the site switched over to the WordPress VIP hosting service. Note that I would take all stat information with a grain of salt; here is my standard link to explain why. For all that, 30 million views in six years doesn’t suck.</p><p>This 30 million visit milestone happens whilst some folks out there are asserting foamily that I’m lying about my site’s visitorship; the bone of contention appears to be that I note the site gets up to 50,000 visitors a day, whilst the foamy folks complain that the daily traffic is in fact nowhere near that, so therefore, I am lying.</p></blockquote><p>Let’s look at the numbers he reported. 30 million WordPress page views in six years is, indeed, impressive.  However, if we simply do the math, which apparently Mr. Family Tradition of Crushing Standardized Tests couldn’t manage, we can see that 30,000,000 / (6×365) equals 13,699 WordPress pageviews per day.  And since Mr. Scalzi’s readers read about 5 daily pageviews apiece, he has averaged a grand total of <b>2,740 readers per day</b> since October 2008.</p><p>This is considerably short of his claim to get “50,000 readers per day”. Not “up to 50,000 readers”, but “50,000 readers per day”. 47,260 readers short, to be precise. It also shows that the numbers I previously provided concerning Whatever’s traffic were correct. So, it appears that he’s at least beginning to come clean.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://3.bp.blogspot.com/-EkFeeaK3eew/UhzVOH9b5wI/AAAAAAAAAhI/SJ10cWfvEjA/s1600/Whatever_pageviews_Jan09-Aug13.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/09/Whatever_pageviews_Jan09-Aug13.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/09/Whatever_pageviews_Jan09-Aug13.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>But not entirely. Note that Mr. Scalzi attempts to deceive his readers again as he falsely claims “the bone of contention appears to be that I note the site gets up to 50,000 visitors a day”, when I have repeatedly agreed that the claim of “up to 50,000 visitors a day” is true.  I even noted that he could correctly claim up to 100k visitors per day. Notice how Scalzi carefully uses the term “appears to be” when he knows perfectly well that the bone of contention is <a href=\"http://www.milobookclub.com/2013/08/12/a-minor-margin-of-error/\">his false claim that “my site gets 50K readers a day”</a> and “Promote your book to my 50K daily blog readers”.</p><p>There is no question that John Scalzi repeatedly lied about his traffic. He publicly lied about it by a factor of more than 18. And moreover, by choosing to repeatedly represent his traffic by its all-time highs rather than its averages, he is engaging in statistical misrepresentation in order to significantly exaggerate the popularity and influence of his blog.  And he is being risibly dishonest when he declares “I scale it down a bit because, you know. I don’t wish to oversell the site’s reach.”  If he didn’t wish to oversell the site’s reach, he wouldn’t hide his statistics and then selectively report them in a statistically misleading manner in the first place!</p><p>For those interested in the technical side of things, it’s worth noting that WordPress is modestly generous with its pageviews, about 5 percent more than Google. I tend to prefer Google’s metrics myself because they have smarter engineers and their business revolves around statistics. But regardless, if you click on the Sitemeter icon on the left sidebar, you’ll see that VP has had 25,464,336 pageviews. Adjusted for the 2013 WordPress/Sitemeter ratio, that corresponds to 49,464,473 pageviews.  Those 49.4 million pageviews date back to October 2003, so I have averaged 13,552 WordPress pageviews here since then and another 6,710 per day on Alpha Game since March 2011.  That’s a total of 20,062 daily WordPress pageviews, 46 percent more than Whatever. So I must have more readers, right?</p><p>Wrong. For various reasons, my readers average 10 pageviews per day. So, I’ve averaged 2,006 readers per day over the complete history of my sites, fewer than Mr. Scalzi’s 2,740 daily post-2008 readers.  The numbers more or less double on both sides if we limit the time period to 2013, but a similar ratio remains. I have more pageviews but Mr. Scalzi has more actual readers. That’s why, when you see people citing statistics without providing the raw data, you always have to consider them carefully in order to determine whether they are being used to mislead you or not.</p><p>It is informative to observe that despite his bestselling novels and his various literary awards, Mr. Scalzi is so insecure and relentlessly self-promoting that he still feels the need to lie, spin, and statistically misrepresent his site traffic. There are numerous widgets that allow him to display his traffic openly on his site, as I and many other bloggers have always done. (I don’t display the Google stats widget on this site as I do on AG because it doesn’t work with the old Blogger template utilized here.) Until Mr. Scalzi adds <a href=\"http://wordpress.org/plugins/google-analyticator/\">such a widget</a> to Whatever, it will be readily apparent to everyone that promulgating a false perception of popularity is more important to him than personal integrity.</p><p>UPDATE: Scalzi is still dissembling even when called on it.</p><blockquote class=\"tr_bq\"><p> <i>“I believe the problem several of your critics have with the<br> reporting of your site numbers was that you said you had 50k readers per<br> day, before you began saying you have ‘up to’ 50 k readers per day.”</br></br></i></p><p>Then several of my critics are either ignorant or mendacious trolls,<br> because I’ve had “up to” here for years, since at least the first post<br> on the subject in 2010, where I talked about the problem of accurate<br> stats reporting. If these folks are relying on the occasional comment on<br> the character-limited medium of Twitter as examples of me dissembling<br> when accurate, detailed information on the subject is easily accessible<br> on my personal site <i>at all times</i>, volunteered by <i>me</i>,<br> then we’re back into the “mendacious troll” category. Which is not at<br> all surprising, given the one particular  dipshit who is the most<br> exercised about it.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Isn’t John clever, leaping to capitalize on the questioner’s mistake in saying “before”.  Yes, Scalzi did previously refer to his traffic utilizing the misleading “up to” method; in fact he began doing so almost as soon as he had reached that level once.  The point, which McRapey specifically lied about in his statement concerning “the bone of contention”, is that for a nine-month period beginning in late 2012, Scalzi stopped claiming “up to 50k daily blog readers” and switched to claiming “50k daily blog readers”.  He went from statistically misrepresenting his traffic to straight-up lying about it.</p><p>With regards to “the character-limited medium of Twitter”, I note that McRapey had 21 spare characters in the one tweet, and 36 spare characters in the other.  I also note that “up_to_” requires all of 6 characters.  It appears he’ll throw any excuse out there without even stopping to think how easily it is demolished.</p><p>After I called him out, he retreated to mere statistical misrepresentation again.  And notice that despite his claim to provide “accurate, detailed information on the subject [that] is easily accessible<br> on my personal site <i>at all times</i>, volunteered by <i>me”</i>, there is still no traffic widget or Sitemeter link being displayed on Whatever.  The information McRapy provides is accurate and detailed, but it is also incomplete, misleading and observably susceptible to self-promotional spin by Mr. Scalzi.</br></p><p>I am pleased McRapey is finally indicating his willingness to provide accurate and detailed information.  I’m sure we all support him in that. All he has to do is <a href=\"http://wordpress.org/plugins/google-analyticator/\">display the Analytics widget for WordPress</a> and that will remove any reason to doubt his integrity concerning his site traffic in the future.  Of course, after he does that, he might want to consider getting a head start on coming clean concerning the historical “bestseller” status of “Fuzzy Nation”….</p><p>And for the benefit of Phoenician: <i>“______ mancrush ______ obsession _______ laughing at _______ Dipshit<br> ______ your father_______ jealous ________ self-made ______ lawn<br> ______”</br></br></i></p></div>",
  "content_text": "McRapey\nexplains himself\n:\nCall me old fashioned, but “satire” isn’t actually defined as “the excuse I use when I’m a racist, sexist asshole on Twitter.”\nThat’s true, it’s the excuse he uses when he’s a rapey, sexual assailant\non Whatever\n. And because he’s still belatedly trying to cover the fact that I caught him out lying, yesterday he was spinning matters related to his site traffic again.\nAt some point yesterday the site passed the 30 million all time views, “all time” in this case defined as “visits recorded by the WordPress stats program since early October 2008,” which is when the site switched over to the WordPress VIP hosting service. Note that I would take all stat information with a grain of salt; here is my standard link to explain why. For all that, 30 million views in six years doesn’t suck.\nThis 30 million visit milestone happens whilst some folks out there are asserting foamily that I’m lying about my site’s visitorship; the bone of contention appears to be that I note the site gets up to 50,000 visitors a day, whilst the foamy folks complain that the daily traffic is in fact nowhere near that, so therefore, I am lying.\nLet’s look at the numbers he reported. 30 million WordPress page views in six years is, indeed, impressive.  However, if we simply do the math, which apparently Mr. Family Tradition of Crushing Standardized Tests couldn’t manage, we can see that 30,000,000 / (6×365) equals 13,699 WordPress pageviews per day.  And since Mr. Scalzi’s readers read about 5 daily pageviews apiece, he has averaged a grand total of\n2,740 readers per day\nsince October 2008.\nThis is considerably short of his claim to get “50,000 readers per day”. Not “up to 50,000 readers”, but “50,000 readers per day”. 47,260 readers short, to be precise. It also shows that the numbers I previously provided concerning Whatever’s traffic were correct. So, it appears that he’s at least beginning to come clean.\nBut not entirely. Note that Mr. Scalzi attempts to deceive his readers again as he falsely claims “the bone of contention appears to be that I note the site gets up to 50,000 visitors a day”, when I have repeatedly agreed that the claim of “up to 50,000 visitors a day” is true.  I even noted that he could correctly claim up to 100k visitors per day. Notice how Scalzi carefully uses the term “appears to be” when he knows perfectly well that the bone of contention is\nhis false claim that “my site gets 50K readers a day”\nand “Promote your book to my 50K daily blog readers”.\nThere is no question that John Scalzi repeatedly lied about his traffic. He publicly lied about it by a factor of more than 18. And moreover, by choosing to repeatedly represent his traffic by its all-time highs rather than its averages, he is engaging in statistical misrepresentation in order to significantly exaggerate the popularity and influence of his blog.  And he is being risibly dishonest when he declares “I scale it down a bit because, you know. I don’t wish to oversell the site’s reach.”  If he didn’t wish to oversell the site’s reach, he wouldn’t hide his statistics and then selectively report them in a statistically misleading manner in the first place!\nFor those interested in the technical side of things, it’s worth noting that WordPress is modestly generous with its pageviews, about 5 percent more than Google. I tend to prefer Google’s metrics myself because they have smarter engineers and their business revolves around statistics. But regardless, if you click on the Sitemeter icon on the left sidebar, you’ll see that VP has had 25,464,336 pageviews. Adjusted for the 2013 WordPress/Sitemeter ratio, that corresponds to 49,464,473 pageviews.  Those 49.4 million pageviews date back to October 2003, so I have averaged 13,552 WordPress pageviews here since then and another 6,710 per day on Alpha Game since March 2011.  That’s a total of 20,062 daily WordPress pageviews, 46 percent more than Whatever. So I must have more readers, right?\nWrong. For various reasons, my readers average 10 pageviews per day. So, I’ve averaged 2,006 readers per day over the complete history of my sites, fewer than Mr. Scalzi’s 2,740 daily post-2008 readers.  The numbers more or less double on both sides if we limit the time period to 2013, but a similar ratio remains. I have more pageviews but Mr. Scalzi has more actual readers. That’s why, when you see people citing statistics without providing the raw data, you always have to consider them carefully in order to determine whether they are being used to mislead you or not.\nIt is informative to observe that despite his bestselling novels and his various literary awards, Mr. Scalzi is so insecure and relentlessly self-promoting that he still feels the need to lie, spin, and statistically misrepresent his site traffic. There are numerous widgets that allow him to display his traffic openly on his site, as I and many other bloggers have always done. (I don’t display the Google stats widget on this site as I do on AG because it doesn’t work with the old Blogger template utilized here.) Until Mr. Scalzi adds\nsuch a widget\nto Whatever, it will be readily apparent to everyone that promulgating a false perception of popularity is more important to him than personal integrity.\nUPDATE: Scalzi is still dissembling even when called on it.\n“I believe the problem several of your critics have with the\nreporting of your site numbers was that you said you had 50k readers per\nday, before you began saying you have ‘up to’ 50 k readers per day.”\nThen several of my critics are either ignorant or mendacious trolls,\nbecause I’ve had “up to” here for years, since at least the first post\non the subject in 2010, where I talked about the problem of accurate\nstats reporting. If these folks are relying on the occasional comment on\nthe character-limited medium of Twitter as examples of me dissembling\nwhen accurate, detailed information on the subject is easily accessible\non my personal site\nat all times\n, volunteered by\nme\n,\nthen we’re back into the “mendacious troll” category. Which is not at\nall surprising, given the one particular  dipshit who is the most\nexercised about it.\nIsn’t John clever, leaping to capitalize on the questioner’s mistake in saying “before”.  Yes, Scalzi did previously refer to his traffic utilizing the misleading “up to” method; in fact he began doing so almost as soon as he had reached that level once.  The point, which McRapey specifically lied about in his statement concerning “the bone of contention”, is that for a nine-month period beginning in late 2012, Scalzi stopped claiming “up to 50k daily blog readers” and switched to claiming “50k daily blog readers”.  He went from statistically misrepresenting his traffic to straight-up lying about it.\nWith regards to “the character-limited medium of Twitter”, I note that McRapey had 21 spare characters in the one tweet, and 36 spare characters in the other.  I also note that “up_to_” requires all of 6 characters.  It appears he’ll throw any excuse out there without even stopping to think how easily it is demolished.\nAfter I called him out, he retreated to mere statistical misrepresentation again.  And notice that despite his claim to provide “accurate, detailed information on the subject [that] is easily accessible\non my personal site\nat all times\n, volunteered by\nme”\n, there is still no traffic widget or Sitemeter link being displayed on Whatever.  The information McRapy provides is accurate and detailed, but it is also incomplete, misleading and observably susceptible to self-promotional spin by Mr. Scalzi.\nI am pleased McRapey is finally indicating his willingness to provide accurate and detailed information.  I’m sure we all support him in that. All he has to do is\ndisplay the Analytics widget for WordPress\nand that will remove any reason to doubt his integrity concerning his site traffic in the future.  Of course, after he does that, he might want to consider getting a head start on coming clean concerning the historical “bestseller” status of “Fuzzy Nation”….\nAnd for the benefit of Phoenician:\n“______ mancrush ______ obsession _______ laughing at _______ Dipshit\n______ your father_______ jealous ________ self-made ______ lawn\n______”",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-14T18:00:00+00:00"
}