{
  "url": "https://voxday.net/2013/09/23/the-sham-of-democracy/",
  "scraped_at": "2025-12-14T22:43:10.910775",
  "title": "The sham of democracy",
  "date_display": "September 23, 2013",
  "date_iso": "2013-09-23T17:00:00+00:00",
  "date_from_url": "2013-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.reuters.com/article/2013/09/23/us-egypt-brotherhood-urgent-idUSBRE98M0HL20130923\">The gloves are coming off</a> and faux democratic secularists around the world should expect no quarter or mercy from the next duly elected Muslim government to take power somewhere in the Arab world:</p><blockquote class=\"tr_bq\"><p> <br> An Egyptian court<br> on Monday banned the Muslim Brotherhood from carrying out any<br> activities in the country and ordered the seizure of the group’s funds,<br> widening a campaign to debilitate the Islamist movement of deposed<br> President Mohamed Mursi.</br></br></br></br></br></p><p>“The court bans the activities<br> of the Muslim Brotherhood organization and its non-governmental<br> organization and all the activities that it participates in and any<br> organization derived from it,” said the presiding judge Mohammed<br> al-Sayed.</br></br></br></br></p><p>The court ordered the government to seize the Brotherhood’s funds and administer its frozen assets. The<br> army-backed government is waging the toughest crackdown in decades on<br> the Islamist group, which says it has a million members. Security forces<br> killed hundreds of its supporters and rounded up thousands more since<br> Mursi was deposed by the army on July 3 after mass protests against his<br> rule.</br></br></br></br></br></p><p>The Brotherhood won parliamentary and presidential elections after veteran autocrat Hosni Mubarak was overthrown in 2011.</p></blockquote><p>So, what Turkey and Egypt have taught the Muslim fundamentalists is that if they play by the rules, win popular support, and get duly elected, the secular elite will utilize the military to overturn the elections, ban them, and deprive them of their accumulated assets.</p><p>But at the same time, that same secular elite is going to encourage them to settle all throughout the West. So now we have a large group of people who have learned that there is absolutely no point in being restrained by the laws and have no legal alternative to violence, and are being actively aided in spreading as far and wide as possible.</p><p>This should end well.</p><p>And it is an object lesson to everyone who asserts that the democratic system is the correct and proper way to manifest societal change. It isn’t.  Beyond a certain point, the will of the people is observably not permitted.  Now, I have no sympathy for the Muslim Brotherhood, but I have to question the idea that it is wise to make it so abundantly clear to everyone, particularly those who are quite willing to turn to violence, that there is absolutely no benefit to participating in a democratic system.</p></div>",
  "content_text": "The gloves are coming off\nand faux democratic secularists around the world should expect no quarter or mercy from the next duly elected Muslim government to take power somewhere in the Arab world:\nAn Egyptian court\non Monday banned the Muslim Brotherhood from carrying out any\nactivities in the country and ordered the seizure of the group’s funds,\nwidening a campaign to debilitate the Islamist movement of deposed\nPresident Mohamed Mursi.\n“The court bans the activities\nof the Muslim Brotherhood organization and its non-governmental\norganization and all the activities that it participates in and any\norganization derived from it,” said the presiding judge Mohammed\nal-Sayed.\nThe court ordered the government to seize the Brotherhood’s funds and administer its frozen assets. The\narmy-backed government is waging the toughest crackdown in decades on\nthe Islamist group, which says it has a million members. Security forces\nkilled hundreds of its supporters and rounded up thousands more since\nMursi was deposed by the army on July 3 after mass protests against his\nrule.\nThe Brotherhood won parliamentary and presidential elections after veteran autocrat Hosni Mubarak was overthrown in 2011.\nSo, what Turkey and Egypt have taught the Muslim fundamentalists is that if they play by the rules, win popular support, and get duly elected, the secular elite will utilize the military to overturn the elections, ban them, and deprive them of their accumulated assets.\nBut at the same time, that same secular elite is going to encourage them to settle all throughout the West. So now we have a large group of people who have learned that there is absolutely no point in being restrained by the laws and have no legal alternative to violence, and are being actively aided in spreading as far and wide as possible.\nThis should end well.\nAnd it is an object lesson to everyone who asserts that the democratic system is the correct and proper way to manifest societal change. It isn’t.  Beyond a certain point, the will of the people is observably not permitted.  Now, I have no sympathy for the Muslim Brotherhood, but I have to question the idea that it is wise to make it so abundantly clear to everyone, particularly those who are quite willing to turn to violence, that there is absolutely no benefit to participating in a democratic system.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-23T16:00:00+00:00"
}