{
  "url": "https://voxday.net/2013/09/12/vladimir-putin-on-syria/",
  "scraped_at": "2025-12-14T22:41:57.968915",
  "title": "Vladimir Putin on Syria",
  "date_display": "September 12, 2013",
  "date_iso": "2013-09-12T17:00:00+00:00",
  "date_from_url": "2013-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is tragic when the ruthless leader of Russia makes considerably more sense, and <a href=\"http://www.nytimes.com/2013/09/12/opinion/putin-plea-for-caution-from-russia-on-syria.html?hp\">better expresses American national interests</a>, than the President of the United States:</p><blockquote class=\"tr_bq\"><p> No one doubts that poison gas was used in Syria. But there is every<br> reason to believe it was used not by the Syrian Army, but by opposition<br> forces, to provoke intervention by their powerful foreign patrons, who<br> would be siding with the fundamentalists. Reports that militants are<br> preparing another attack — this time against Israel — cannot be ignored.</br></br></br></br></p><p>It is alarming that military intervention in internal conflicts in<br> foreign countries has become commonplace for the United States. Is it in<br> America’s long-term interest? I doubt it. Millions around the world<br> increasingly see America not as a model of democracy but as relying<br> solely on brute force, cobbling coalitions together under the slogan<br> “you’re either with us or against us.”</br></br></br></br></br></p><p>But force has proved ineffective and pointless. Afghanistan is reeling,<br> and no one can say what will happen after international forces withdraw.<br> Libya is divided into tribes and clans. In Iraq the civil war<br> continues, with dozens killed each day. In the United States, many draw<br> an analogy between Iraq and Syria, and ask why their government would<br> want to repeat recent mistakes.</br></br></br></br></br></p></blockquote><p>At least Mr. Putin has given us a head’s up on what could be the next international false flag: a highly improbable inflammatory attack on Israel by either Iran or the Assad regime that isn’t in response to a US assault on Syria.</p><p>Meanwhile, our elected leaders demonstrate that <i>Idiocracy </i>was, indeed, prophetic:</p><p><i>“I almost wanted to vomit,” Senate Foreign Relations Chairman Robert Menendez, (D-N.J.) told CNN. </i></p><p>He so totally wanted to hurl. So, we should, like, TOTALLY invade Syria. Because Holocaust. Duh.</p><p><i>“Putin’s NYT op-ed is an insult to the intelligence of every American”</i><br> <i>— John McCain (@SenJohnMcCain) <a href=\"https://twitter.com/SenJohnMcCain/statuses/378155208355745792\">September 12, 2013</a></i></br></p><p>No, Mr. McCain, your presidential campaign was an insult to the intelligence of every American. And the fact that you still have a political career at all is testimony to the corrupt nature of the U.S. political system.</p></div>",
  "content_text": "It is tragic when the ruthless leader of Russia makes considerably more sense, and\nbetter expresses American national interests\n, than the President of the United States:\nNo one doubts that poison gas was used in Syria. But there is every\nreason to believe it was used not by the Syrian Army, but by opposition\nforces, to provoke intervention by their powerful foreign patrons, who\nwould be siding with the fundamentalists. Reports that militants are\npreparing another attack — this time against Israel — cannot be ignored.\nIt is alarming that military intervention in internal conflicts in\nforeign countries has become commonplace for the United States. Is it in\nAmerica’s long-term interest? I doubt it. Millions around the world\nincreasingly see America not as a model of democracy but as relying\nsolely on brute force, cobbling coalitions together under the slogan\n“you’re either with us or against us.”\nBut force has proved ineffective and pointless. Afghanistan is reeling,\nand no one can say what will happen after international forces withdraw.\nLibya is divided into tribes and clans. In Iraq the civil war\ncontinues, with dozens killed each day. In the United States, many draw\nan analogy between Iraq and Syria, and ask why their government would\nwant to repeat recent mistakes.\nAt least Mr. Putin has given us a head’s up on what could be the next international false flag: a highly improbable inflammatory attack on Israel by either Iran or the Assad regime that isn’t in response to a US assault on Syria.\nMeanwhile, our elected leaders demonstrate that\nIdiocracy\nwas, indeed, prophetic:\n“I almost wanted to vomit,” Senate Foreign Relations Chairman Robert Menendez, (D-N.J.) told CNN.\nHe so totally wanted to hurl. So, we should, like, TOTALLY invade Syria. Because Holocaust. Duh.\n“Putin’s NYT op-ed is an insult to the intelligence of every American”\n— John McCain (@SenJohnMcCain)\nSeptember 12, 2013\nNo, Mr. McCain, your presidential campaign was an insult to the intelligence of every American. And the fact that you still have a political career at all is testimony to the corrupt nature of the U.S. political system.",
  "tags": [
    "conspiracy",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-12T16:00:00+00:00"
}