{
  "url": "https://voxday.net/2013/09/18/welcoming-blog-shadow/",
  "scraped_at": "2025-12-14T22:42:36.643079",
  "title": "Welcoming a blog shadow",
  "date_display": "September 18, 2013",
  "date_iso": "2013-09-18T08:54:00+00:00",
  "date_from_url": "2013-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought we should all extend a friendly welcome to my latest dedicated critic. I certainly have no objections to his attempts to further refine my thinking. He has launched Pox Vopoli, a blog intended to, in his words, “be a place for people to air grievances however they’d like without fear of backlash from those who oppose Vox.”  It seems “many other bloggers choose not to talk about Vox by name so that he doesn’t get any extra exposure”, a strategy which appears to be failing rather spectacularly in light of the fact that my traffic has not only grown steadily over the years, but is actually increasing at a faster rate than before in this, the ninth year of the blog.</p><p>PV has gotten off to <a href=\"http://poxvay.blogspot.com/2013/09/welcome-and-lets-get-started.html\">a bang-up start</a>. Setting aside the usual rhetoric about hate this and homophobiss that, he gets a few things factually incorrect.  I don’t constantly mention my Mensa membership.  In fact, I no longer mention Mensa at all with regards to myself now that I don’t have a weekly column at WND where the reference was part of my bio. It is usually my critics, like PV, who bring it up. Why this might be, I leave to the reader to determine, but my working theory is that my Mensa status makes them feel insecure about their comparative lack of intelligence.</p><p>Which, of course, is silly. Statistically speaking, it should be my National Merit Finalist status that makes them feel insecure, since the cutoffs are somewhat loftier than the Mensa qualifications.</p><p>I also don’t claim to be an Alpha Male per se. While I may happen to be an alpha according to the binary hierarchy of Roissy, I actually claim to be a sigma according to <a href=\"http://alphagameplan.blogspot.com/2011/03/socio-sexual-hierarchy.html\">the socio-sexual hierarchy</a>.  I made that distinction precisely because I am not a conventional alpha except in the most basic sense.  The correct technical designation would be ALPHA:sigma; the idea that alphas are secure or in any way disinclined to beat their own chests is an indication that PV has little understanding of socio-sexual hierarchies.</p><p>But his biggest blunder is a surprisingly common one. It’s one that I’ve seen it more and more often of late, most recently in a series of comments <a href=\"http://www.popehat.com/2013/09/13/i-love-it-when-john-scalzi-subtweets/\">by incompetent critics at Popehat</a>. PV writes:</p><blockquote class=\"tr_bq\"><p> What’s he up to recently? Well, he’s got a post about why he thinks a<br> woman will be the new Chairman of the Fed. In this post he also says<br> “women are less likely to feel they should be held responsible for<br> anything they do, much less for anything that happens on their watch”.  Not only is this clearly sexist, which he admits openly to being, but<br> also wrong. There’s no evidence to support the statement at all.</br></br></br></br></p></blockquote><p>PV forgets here that an absence of evidence is not evidence of absence. There is, as it happens, considerable evidence indicating that women are less likely to feel they should be held responsible for their actions than men. I simply didn’t happen to cite any of it. He is confusing the fact that I do not cite any evidence with the nonexistence of that evidence. However, it should be obvious that the existence or nonexistence of the relevant evidence is not contingent upon my citations.</p><p>I can very easily refute PV’s claim that I am wrong using his own metric. As it happens, his post contains no evidence to support his statement at all. Ergo, his claim that I am wrong must, by his own measure, be incorrect.  While one can certainly claim that an assertion remains unproven on the basis of a failure to present evidence in support of it, one cannot claim that the assertion is incorrect on the basis of that failure.  If I state that the Vikings lost on Sunday, but present no evidence to support my statement, such as a box score or a picture of the scoreboard, one cannot reasonably conclude that the Vikings must have won.</p><p>While I welcome this attempt to contemplate and criticize my blog posts, I have to say that the initial indications are not terribly promising. PV will have to considerably up his game if he is going to demonstrate that he is intellectually tall enough for the ride.</p></div>",
  "content_text": "I thought we should all extend a friendly welcome to my latest dedicated critic. I certainly have no objections to his attempts to further refine my thinking. He has launched Pox Vopoli, a blog intended to, in his words, “be a place for people to air grievances however they’d like without fear of backlash from those who oppose Vox.”  It seems “many other bloggers choose not to talk about Vox by name so that he doesn’t get any extra exposure”, a strategy which appears to be failing rather spectacularly in light of the fact that my traffic has not only grown steadily over the years, but is actually increasing at a faster rate than before in this, the ninth year of the blog.\nPV has gotten off to\na bang-up start\n. Setting aside the usual rhetoric about hate this and homophobiss that, he gets a few things factually incorrect.  I don’t constantly mention my Mensa membership.  In fact, I no longer mention Mensa at all with regards to myself now that I don’t have a weekly column at WND where the reference was part of my bio. It is usually my critics, like PV, who bring it up. Why this might be, I leave to the reader to determine, but my working theory is that my Mensa status makes them feel insecure about their comparative lack of intelligence.\nWhich, of course, is silly. Statistically speaking, it should be my National Merit Finalist status that makes them feel insecure, since the cutoffs are somewhat loftier than the Mensa qualifications.\nI also don’t claim to be an Alpha Male per se. While I may happen to be an alpha according to the binary hierarchy of Roissy, I actually claim to be a sigma according to\nthe socio-sexual hierarchy\n.  I made that distinction precisely because I am not a conventional alpha except in the most basic sense.  The correct technical designation would be ALPHA:sigma; the idea that alphas are secure or in any way disinclined to beat their own chests is an indication that PV has little understanding of socio-sexual hierarchies.\nBut his biggest blunder is a surprisingly common one. It’s one that I’ve seen it more and more often of late, most recently in a series of comments\nby incompetent critics at Popehat\n. PV writes:\nWhat’s he up to recently? Well, he’s got a post about why he thinks a\nwoman will be the new Chairman of the Fed. In this post he also says\n“women are less likely to feel they should be held responsible for\nanything they do, much less for anything that happens on their watch”.  Not only is this clearly sexist, which he admits openly to being, but\nalso wrong. There’s no evidence to support the statement at all.\nPV forgets here that an absence of evidence is not evidence of absence. There is, as it happens, considerable evidence indicating that women are less likely to feel they should be held responsible for their actions than men. I simply didn’t happen to cite any of it. He is confusing the fact that I do not cite any evidence with the nonexistence of that evidence. However, it should be obvious that the existence or nonexistence of the relevant evidence is not contingent upon my citations.\nI can very easily refute PV’s claim that I am wrong using his own metric. As it happens, his post contains no evidence to support his statement at all. Ergo, his claim that I am wrong must, by his own measure, be incorrect.  While one can certainly claim that an assertion remains unproven on the basis of a failure to present evidence in support of it, one cannot claim that the assertion is incorrect on the basis of that failure.  If I state that the Vikings lost on Sunday, but present no evidence to support my statement, such as a box score or a picture of the scoreboard, one cannot reasonably conclude that the Vikings must have won.\nWhile I welcome this attempt to contemplate and criticize my blog posts, I have to say that the initial indications are not terribly promising. PV will have to considerably up his game if he is going to demonstrate that he is intellectually tall enough for the ride.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-09-18T07:54:00+00:00"
}