{
  "url": "https://voxday.net/2015/08/21/40-years/",
  "scraped_at": "2025-12-17T17:23:49.825233",
  "title": "40 years",
  "date_display": "August 21, 2015",
  "date_iso": "2015-08-21T17:06:00+00:00",
  "date_from_url": "2015-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s <a href=\"http://www.unz.com/isteve/the-suburban-california-dream-in-compton/\">how long it took African-Americans to transform</a> excellent, oversized, newly constructed suburban housing into a community that became infamous worldwide for gangs, crime, and violence:</p><blockquote class=\"tr_bq\"><p> As late as 1948, fewer than fifty African Americans lived in among<br> Compton’s forty-five thousand residents. … Yet during the 1950s, Compton<br> underwent the most profound racial change of any city in Southern<br> California. Responding to the great demand for African American housing<br> outside the ghetto, a new group of tract home developers and real estate<br> brokers found a niche in the unrestricted housing market. … This<br> undeveloped property became a fertile area for the growth of the city’s<br> black population. Davenport builders, a large developer, quickly built<br> unrestricted tract homes on the western edge of Compton. … This was one<br> of the few places in Los Angeles County where blacks could buy new tract<br> housing. … “For once, the Negro did not move into slums; for once he<br> came into good housing.” Indeed, the 1960 census revealed that 93<br> percent of blacks in Compton lived in homes built since 1940, with more<br> than half residing in homes built since 1950. Compton’s houses were also<br> large: almost 75 percent of black households in Compton had four to<br> five rooms.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>From Wikipedia: <i>“For many years, Compton was a much sought after neighborhood for the black middle class of Los Angeles. Now, only some areas of Compton are still middle class communities. This past affluence is reflected in the area’s appearance—Compton’s streets are lined with relatively spacious and attractive single family houses. However, several factors have contributed to Compton’s decline. One of the most significant factors was a steady erosion of its tax base.”</i></p><p>How shocking it is to discover that despite the magic of geography and high quality infrastructure, African-Americans did not magically transform into 1950s-style tax-paying, economically sufficient white people. Interestingly enough, it has only taken my ruthless Aztec cousins 27 years to ethnically cleanse Compton of most of its African-Americans. What was a white city in 1948 and a black city in 1988 is now 65 percent La Raza, 32.9 percent black, and 0.8 percent white.</p><p>That’s what diversity in future America looks like, cuckservatives. One without white people. Good luck with that. It’s also why I think it is spectacularly funny that white SJWs believe one has to be a white supremacist in order to hate blacks. You’d think they never met an Arab, an Asian, or a Mexican.</p></div>",
  "content_text": "That’s\nhow long it took African-Americans to transform\nexcellent, oversized, newly constructed suburban housing into a community that became infamous worldwide for gangs, crime, and violence:\nAs late as 1948, fewer than fifty African Americans lived in among\nCompton’s forty-five thousand residents. … Yet during the 1950s, Compton\nunderwent the most profound racial change of any city in Southern\nCalifornia. Responding to the great demand for African American housing\noutside the ghetto, a new group of tract home developers and real estate\nbrokers found a niche in the unrestricted housing market. … This\nundeveloped property became a fertile area for the growth of the city’s\nblack population. Davenport builders, a large developer, quickly built\nunrestricted tract homes on the western edge of Compton. … This was one\nof the few places in Los Angeles County where blacks could buy new tract\nhousing. … “For once, the Negro did not move into slums; for once he\ncame into good housing.” Indeed, the 1960 census revealed that 93\npercent of blacks in Compton lived in homes built since 1940, with more\nthan half residing in homes built since 1950. Compton’s houses were also\nlarge: almost 75 percent of black households in Compton had four to\nfive rooms.\nFrom Wikipedia:\n“For many years, Compton was a much sought after neighborhood for the black middle class of Los Angeles. Now, only some areas of Compton are still middle class communities. This past affluence is reflected in the area’s appearance—Compton’s streets are lined with relatively spacious and attractive single family houses. However, several factors have contributed to Compton’s decline. One of the most significant factors was a steady erosion of its tax base.”\nHow shocking it is to discover that despite the magic of geography and high quality infrastructure, African-Americans did not magically transform into 1950s-style tax-paying, economically sufficient white people. Interestingly enough, it has only taken my ruthless Aztec cousins 27 years to ethnically cleanse Compton of most of its African-Americans. What was a white city in 1948 and a black city in 1988 is now 65 percent La Raza, 32.9 percent black, and 0.8 percent white.\nThat’s what diversity in future America looks like, cuckservatives. One without white people. Good luck with that. It’s also why I think it is spectacularly funny that white SJWs believe one has to be a white supremacist in order to hate blacks. You’d think they never met an Arab, an Asian, or a Mexican.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2015-08-21T16:06:00+00:00"
}