{
  "url": "https://voxday.net/2015/08/09/a-hero-for-men/",
  "scraped_at": "2025-12-17T17:22:18.195692",
  "title": "A hero for men",
  "date_display": "August 9, 2015",
  "date_iso": "2015-08-09T08:02:00+00:00",
  "date_from_url": "2015-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/ZtWYvUrzcpw?feature=player_embedded\" width=\"512\"></iframe></div><p> You may not like Roosh. You may not approve of him. You may not agree with him about much. But the next time you bite your tongue because you are afraid of saying something that a woman or an SJW might look at you funny for saying, or refrain from saying what you think out of fear that someone might confront you or call you a name, remember that this is a man who was denounced, falsely accused, publicly unwelcomed by the mayor of Montreal, protested, and physically attacked, and he still stood up and spoke out in public concerning his beliefs about the interests of men.</p><p>Before you dismiss Roosh for one reason or another, ask yourself ‘what am <i>I</i> doing? Why are the thought police not objecting to <i>my </i>presence? Why are the SJWs not seeking to silence and disqualify and discredit <i>me</i>?’</p><p>Roosh is so dangerous to the SJW cause, and is so effective in exploding their attempts to control the very thoughts and behavior of men, that the SJWs actually tried to play the “we’ll totally be your friend if only you’ll distance yourself from him and denounce him” game with <i>me</i>!</p><p>That should be sufficient to convince anyone who supports freedom of speech and freedom of thought to stand up for the man, regardless of any reservations you might have about pickup artistry or neomasculinity. After all, he’s standing up for you.</p><p>Heroes are seldom the fine upstanding well-respected individuals we wish them to be. Such people are usually too concerned with going along with the crowd and winning the good opinion of the world to speak the truth when the truth is despised. But when a man speaks the truth despite being condemned for it, he is more truly walking in the footsteps of Jesus Christ than many a decent, church-going Christian man.</p><p>We are better than them. We are smarter than them. We are more fearless than them. But more importantly, we are on the side of the truth. They have nothing to offer but lies.</p></div>",
  "content_text": "You may not like Roosh. You may not approve of him. You may not agree with him about much. But the next time you bite your tongue because you are afraid of saying something that a woman or an SJW might look at you funny for saying, or refrain from saying what you think out of fear that someone might confront you or call you a name, remember that this is a man who was denounced, falsely accused, publicly unwelcomed by the mayor of Montreal, protested, and physically attacked, and he still stood up and spoke out in public concerning his beliefs about the interests of men.\nBefore you dismiss Roosh for one reason or another, ask yourself ‘what am\nI\ndoing? Why are the thought police not objecting to\nmy\npresence? Why are the SJWs not seeking to silence and disqualify and discredit\nme\n?’\nRoosh is so dangerous to the SJW cause, and is so effective in exploding their attempts to control the very thoughts and behavior of men, that the SJWs actually tried to play the “we’ll totally be your friend if only you’ll distance yourself from him and denounce him” game with\nme\n!\nThat should be sufficient to convince anyone who supports freedom of speech and freedom of thought to stand up for the man, regardless of any reservations you might have about pickup artistry or neomasculinity. After all, he’s standing up for you.\nHeroes are seldom the fine upstanding well-respected individuals we wish them to be. Such people are usually too concerned with going along with the crowd and winning the good opinion of the world to speak the truth when the truth is despised. But when a man speaks the truth despite being condemned for it, he is more truly walking in the footsteps of Jesus Christ than many a decent, church-going Christian man.\nWe are better than them. We are smarter than them. We are more fearless than them. But more importantly, we are on the side of the truth. They have nothing to offer but lies.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-09T07:02:00+00:00"
}