{
  "url": "https://voxday.net/2015/08/30/adventures-in-rhetoric/",
  "scraped_at": "2025-12-17T17:24:48.522650",
  "title": "Adventures in rhetoric",
  "date_display": "August 30, 2015",
  "date_iso": "2015-08-30T00:30:00+00:00",
  "date_from_url": "2015-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s intriguing to see how a simple mention of an easily verified observation brings, shall we say, the <i>medicated</i>, out of the woodwork:</p><blockquote class=\"tr_bq\"><p> Vox Day ‏@voxday <br> It’s impossible to balance constant SJW claims of “laughing” and “hilarity” with how many of them are on anti-depressants and psychotropics.</br></p><p>Popehat ‏@Popehat<br> well, the world’s a meritocracy, innit? We can’t all be as sane as you and the other WorldNetDaily writers.</br></p><p>Vox Day ‏@voxday<br> And here I thought you believed in equality, Popey. Are you “laughing so hard” all the time too?</br></p><p>Popehat ‏@Popehat<br> Nah. Definitely sometimes though. Thanks!</br></p><p>Vox Day ‏@voxday<br> Are you trying to claim that people who need to take drugs to be mentally stable are more sane than those who don’t?</br></p><p>Popehat ‏@Popehat<br> I would never throw shade at your mental stability Vox. How can a crazy person like me question someone so sane?</br></p><p>Vox Day ‏@voxday<br> You didn’t answer the question. Are those who require drugs to be mentally stable more or less sane than those who don’t?</br></p><p>Popehat ‏@Popehat<br> Less, by most definitions. And that’s important. How can we aspire to your clarity of thought without getting sane first?</br></p><p>Vox Day ‏@voxday<br> By correctly applying sound logic to observed facts. Don’t you understand yet that your rhetorical antics accomplish nothing?</br></p><p>Popehat ‏@Popehat<br> How could they against an intellect like yours? I’m crazy, your sane. Let people value sanity accordingly.</br></p><p>Vox Day ‏@voxday<br> They would accomplish nothing against a stone  as well. You might as reasonably attempt to achieve your goals here by juggling.</br></p><p>Popehat ‏@Popehat<br> never! Juggling is part of the gutter culture of carnies and non-Europeans</br></p><p>Vox Day ‏@voxday <br> You’re doing a fine job of demonstrating the pointlessness of speaking dialectic to a rhetoric speaker. Please continue.</br></p><p>Popehat ‏@Popehat<br> I’ll agree you’re operating on an entirely different plane than I am.</br></p><p>Vox Day ‏@voxday <br> I’m delighted to hear we can reach an accord on something.</br></p></blockquote><p>As predicted in <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i><b>SJWs Always Lie</b></i></a>, speaking in dialectic to a rhetoric speaker is totally pointless. The information content is irrelevant. Popehat will continue in this vein, seeking to provoke an emotional response, or at least one that will permit him to play the victim, as long as he thinks there is a chance he can provoke something.</p><p>Another example. Notice how every comment is an attempt to provoke some kind of emotional reaction, combined with an amount of posturing.</p><blockquote class=\"tr_bq\"><p> Vox Day ‏@voxday <br> It’s impossible to balance constant SJW<br> claims of “laughing” and “hilarity” with how many of them are on<br> anti-depressants and psychotropics.</br></br></br></p><p>Jeff Fecke ‏@jkfecke<br> That is not how depression works, T. Pratt.</br></p><p>Vox Day @voxday<br> Are you the expert, then, Feckless? How many anti-depressants and psychotropics have you been on?</br></p><p>Jeff Fecke ‏@jkfecke<br> Oh, I do love when Ted “Theodore” Beale tweets me. How’s your dad doing?</br></p><p>Vox Day ‏@voxday<br> You didn’t answer the question, Jeff. How many anti-depressants and psychotropics have you been on?</br></p><p>Jeff Fecke ‏@jkfecke<br> I am currently on fluoxetine. I have also used Lexapro.</br></p><p>Vox Day ‏@voxday<br> I acknowledge your superior expertise on the subject. In answer to your question, my father is very well. Got an email 2 days ago.</br></p></blockquote></div>",
  "content_text": "It’s intriguing to see how a simple mention of an easily verified observation brings, shall we say, the\nmedicated\n, out of the woodwork:\nVox Day ‏@voxday\nIt’s impossible to balance constant SJW claims of “laughing” and “hilarity” with how many of them are on anti-depressants and psychotropics.\nPopehat ‏@Popehat\nwell, the world’s a meritocracy, innit? We can’t all be as sane as you and the other WorldNetDaily writers.\nVox Day ‏@voxday\nAnd here I thought you believed in equality, Popey. Are you “laughing so hard” all the time too?\nPopehat ‏@Popehat\nNah. Definitely sometimes though. Thanks!\nVox Day ‏@voxday\nAre you trying to claim that people who need to take drugs to be mentally stable are more sane than those who don’t?\nPopehat ‏@Popehat\nI would never throw shade at your mental stability Vox. How can a crazy person like me question someone so sane?\nVox Day ‏@voxday\nYou didn’t answer the question. Are those who require drugs to be mentally stable more or less sane than those who don’t?\nPopehat ‏@Popehat\nLess, by most definitions. And that’s important. How can we aspire to your clarity of thought without getting sane first?\nVox Day ‏@voxday\nBy correctly applying sound logic to observed facts. Don’t you understand yet that your rhetorical antics accomplish nothing?\nPopehat ‏@Popehat\nHow could they against an intellect like yours? I’m crazy, your sane. Let people value sanity accordingly.\nVox Day ‏@voxday\nThey would accomplish nothing against a stone  as well. You might as reasonably attempt to achieve your goals here by juggling.\nPopehat ‏@Popehat\nnever! Juggling is part of the gutter culture of carnies and non-Europeans\nVox Day ‏@voxday\nYou’re doing a fine job of demonstrating the pointlessness of speaking dialectic to a rhetoric speaker. Please continue.\nPopehat ‏@Popehat\nI’ll agree you’re operating on an entirely different plane than I am.\nVox Day ‏@voxday\nI’m delighted to hear we can reach an accord on something.\nAs predicted in\nSJWs Always Lie\n, speaking in dialectic to a rhetoric speaker is totally pointless. The information content is irrelevant. Popehat will continue in this vein, seeking to provoke an emotional response, or at least one that will permit him to play the victim, as long as he thinks there is a chance he can provoke something.\nAnother example. Notice how every comment is an attempt to provoke some kind of emotional reaction, combined with an amount of posturing.\nVox Day ‏@voxday\nIt’s impossible to balance constant SJW\nclaims of “laughing” and “hilarity” with how many of them are on\nanti-depressants and psychotropics.\nJeff Fecke ‏@jkfecke\nThat is not how depression works, T. Pratt.\nVox Day @voxday\nAre you the expert, then, Feckless? How many anti-depressants and psychotropics have you been on?\nJeff Fecke ‏@jkfecke\nOh, I do love when Ted “Theodore” Beale tweets me. How’s your dad doing?\nVox Day ‏@voxday\nYou didn’t answer the question, Jeff. How many anti-depressants and psychotropics have you been on?\nJeff Fecke ‏@jkfecke\nI am currently on fluoxetine. I have also used Lexapro.\nVox Day ‏@voxday\nI acknowledge your superior expertise on the subject. In answer to your question, my father is very well. Got an email 2 days ago.",
  "tags": [
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-29T23:30:00+00:00"
}