{
  "url": "https://voxday.net/2015/08/14/apparently-schools-were-closed-today/",
  "scraped_at": "2025-12-17T17:22:57.715661",
  "title": "Apparently the schools were closed today",
  "date_display": "August 14, 2015",
  "date_iso": "2015-08-14T12:00:00+00:00",
  "date_from_url": "2015-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Phil Sandifer found himself free to continue our previous debate, with about the same level of success as last time:</p><blockquote class=\"tr_bq\"><p> Phil Sandifer @PhilSandifer<br> Just because I feel like some issues have been unfortunately muddied in a debate about lines being crossed, some reiterated points.</br></p><p>Phil Sandifer @PhilSandifer<br> Lou Antonelli is a fascist dickbag and loathsome human being.</br></p><p>Phil Sandifer @PhilSandifer<br> John C. Wright is a fascist dickbag and loathsome human being.</br></p><p>Phil Sandifer @PhilSandifer<br> Vox Day is a fascist mega-dickbag and less a human being than one long sequence of junk DNA.</br></p><p>Phil Sandifer @PhilSandifer<br> Any other Sad/Rabid Puppies are at best fascist collaborators, and while loathsome might be too strong, definitely kinda suck as people.</br></p><p>Vox Day @voxday<br> That’s so meaningful coming from a pagan paedophile who really likes books about child abuse and gender confusion.</br></p><p>Vox Day @voxday<br> Phil Sandifer’s idea of “fascism” is “standing in opposition to the child molesters in science fiction”.</br></p><p>Vox Day @voxday<br> I have no doubt that one day Phil Sandifer’s name will be ranked among the big names in SF: Asimov, Bradley, Breen, Delaney, and Kramer.</br></p></blockquote><p>I’m sure all the Sad and Rabid Puppies will be as deeply concerned about what this creepy piece of human flotsam thinks about them as I am. However, of all his <a href=\"https://twitter.com/PhilSandifer\">increasingly furious subsequent tweets</a>, I think this one was my favorite:</p><p><i>Phil Sandifer ‏@PhilSandifer</i><br> <i>Honestly, I still have deeply mixed feelings about having been as courteous as I was. No platforming may well have been wiser. </i></br></p><p>Now, I know SJWs always lie, but even so, I continue to find it remarkable that they are willing to strike such ludicrously unconvincing poses in public. Do they seriously believe anyone finds them even remotely believable? Sandifer talking about “no platforming” me is about as credible as the free newspaper in Des Moines debating whether it should “no platform” Donald Trump or not. It’s simply not an option; Sandifer contacted me, he actively pushed for the interview with me, and as has so often been the case in the past, I had no idea who he was until he started attacking me.</p><p>Being an SJW, Phil “Lollipop” Sandifer couldn’t help doubling down:</p><blockquote class=\"tr_bq\"><p> Phil Sandifer ‏@PhilSandifer<br> Just like his pathetic father, who probably abused him.</br></p><p>Vox Day @voxday<br> No, Phil, my father loved me and treated me well. SJWs always project. Is that why you look like a creepy child molester?</br></p><p>Phil Sandifer ‏@PhilSandifer<br> To be clear, when I say Vox Day has the Innsmouth Look, I’m not saying he’s subhuman. Although we are not equally homo sapiens sapiens.</br></p><p>Vox Day ‏@voxday now<br>Better an aquatic heritage than the “there are four little boys buried in my garden” look that you’re sporting, Phil.</br></p></blockquote></div>",
  "content_text": "Phil Sandifer found himself free to continue our previous debate, with about the same level of success as last time:\nPhil Sandifer @PhilSandifer\nJust because I feel like some issues have been unfortunately muddied in a debate about lines being crossed, some reiterated points.\nPhil Sandifer @PhilSandifer\nLou Antonelli is a fascist dickbag and loathsome human being.\nPhil Sandifer @PhilSandifer\nJohn C. Wright is a fascist dickbag and loathsome human being.\nPhil Sandifer @PhilSandifer\nVox Day is a fascist mega-dickbag and less a human being than one long sequence of junk DNA.\nPhil Sandifer @PhilSandifer\nAny other Sad/Rabid Puppies are at best fascist collaborators, and while loathsome might be too strong, definitely kinda suck as people.\nVox Day @voxday\nThat’s so meaningful coming from a pagan paedophile who really likes books about child abuse and gender confusion.\nVox Day @voxday\nPhil Sandifer’s idea of “fascism” is “standing in opposition to the child molesters in science fiction”.\nVox Day @voxday\nI have no doubt that one day Phil Sandifer’s name will be ranked among the big names in SF: Asimov, Bradley, Breen, Delaney, and Kramer.\nI’m sure all the Sad and Rabid Puppies will be as deeply concerned about what this creepy piece of human flotsam thinks about them as I am. However, of all his\nincreasingly furious subsequent tweets\n, I think this one was my favorite:\nPhil Sandifer ‏@PhilSandifer\nHonestly, I still have deeply mixed feelings about having been as courteous as I was. No platforming may well have been wiser.\nNow, I know SJWs always lie, but even so, I continue to find it remarkable that they are willing to strike such ludicrously unconvincing poses in public. Do they seriously believe anyone finds them even remotely believable? Sandifer talking about “no platforming” me is about as credible as the free newspaper in Des Moines debating whether it should “no platform” Donald Trump or not. It’s simply not an option; Sandifer contacted me, he actively pushed for the interview with me, and as has so often been the case in the past, I had no idea who he was until he started attacking me.\nBeing an SJW, Phil “Lollipop” Sandifer couldn’t help doubling down:\nPhil Sandifer ‏@PhilSandifer\nJust like his pathetic father, who probably abused him.\nVox Day @voxday\nNo, Phil, my father loved me and treated me well. SJWs always project. Is that why you look like a creepy child molester?\nPhil Sandifer ‏@PhilSandifer\nTo be clear, when I say Vox Day has the Innsmouth Look, I’m not saying he’s subhuman. Although we are not equally homo sapiens sapiens.\nVox Day ‏@voxday now\nBetter an aquatic heritage than the “there are four little boys buried in my garden” look that you’re sporting, Phil.",
  "tags": [
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-14T11:00:00+00:00"
}