{
  "url": "https://voxday.net/2015/08/08/cuckservative-speech-police/",
  "scraped_at": "2025-12-17T17:22:12.686022",
  "title": "Cuckservative speech police",
  "date_display": "August 8, 2015",
  "date_iso": "2015-08-08T13:00:00+00:00",
  "date_from_url": "2015-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s increasingly clear that the <a href=\"http://www.washingtonpost.com/news/post-politics/wp/2015/08/08/donald-trump-disinvited-to-speak-at-redstate-event-megyn-kelly-invited/?postshare=9031439011928740\">cuckservatives are the SJWs of the Right</a>, being the self-appointed speech police:</p><blockquote class=\"tr_bq\"><p> Conservative commentator Erick Erickson on Friday night disinvited GOP presidential candidate Donald Trump from speaking at an activist conference he is hosting here this weekend, citing disparaging remarks Trump made hours earlier on CNN about Fox News Channel anchor Megyn Kelly.</p><p>In an interview with The Washington Post, Erickson said Trump had been scheduled to speak at his RedState gathering on Saturday at the College Football Hall of Fame, but he told Corey Lewandowski, Trump’s campaign manager, about an hour before midnight that Trump was no longer welcome….</p><p>Erickson, a Fox News regular and face of the popular RedState blog, has long been a foe congressional GOP leaders and an ally of conservative grass-roots organizers. He has also drawn criticism for saying impolitic things, once calling retired Supreme Court Justice David Souter an “[expletive] child molester” and First Lady Michelle Obama a “Marxist harpy.” He has since apologized for both comments.</p><p>Trump’s words about Kelly simply went too far, Erickson said Friday, making him, someone who enjoys and appreciates barbed political rhetoric, uncomfortable and queasy. And with his invited guest dominating the 2016 race, and few if any conservatives reining him in, Erickson thought he’d try.</p><p>The following is a transcript:</p><p><b>Why did you disinvite Trump?</b></p><p>I think there is a line of decency that even a non-professional politician can cross. Suggesting that a female journalist asking you a hostile question is hormone related, I think, is one of those lines.</p><p><b>Do you see yourself as a referee for the conservative movement to keep Trump from riling the race?</b></p><p>You<br> know, no. I’m trying to be lenient with him. I told his campaign<br> manager a few days ago that there have been a lot of people in the party<br> who refuse to treat him legitimately even though he’s the front-runner.<br> And I didn’t want to give him a hard time. I felt bad that one of<br> event’s agendas didn’t have his name on it and felt badly about that,<br> let him know. I don’t like that I have to disinvite him. But there are<br> bounds of what’s acceptable in our discourse and they’re not different<br> for you, or me, or someone else. I’m not going to have a guy on stage<br> with my wife and daughter in the crowd who thinks a tough question from a<br> woman is because of hormones.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>There is NO PLACE in cuckservatism for anyone who doesn’t kowtow before the feminist line. These guys are perma-losers both politically and socio-sexually. And like the SJWs and gamma males they are, they are hell-bent on keeping the more successful men in the same subservient place they are, at the base of the pedestal.</p><p>Look at how he reduces the American political process to an appeal to the emotional authority of his wife and daughter. What a pathetic excuse for what purports to be a man!</p><p>Greg from 108 ‏is right. For the cuckservative, as for the SJW, “appearing “not racist” or “not sexist” takes precedence over everything, even the Constitution and the rule of law.”</p></div>",
  "content_text": "It’s increasingly clear that the\ncuckservatives are the SJWs of the Right\n, being the self-appointed speech police:\nConservative commentator Erick Erickson on Friday night disinvited GOP presidential candidate Donald Trump from speaking at an activist conference he is hosting here this weekend, citing disparaging remarks Trump made hours earlier on CNN about Fox News Channel anchor Megyn Kelly.\nIn an interview with The Washington Post, Erickson said Trump had been scheduled to speak at his RedState gathering on Saturday at the College Football Hall of Fame, but he told Corey Lewandowski, Trump’s campaign manager, about an hour before midnight that Trump was no longer welcome….\nErickson, a Fox News regular and face of the popular RedState blog, has long been a foe congressional GOP leaders and an ally of conservative grass-roots organizers. He has also drawn criticism for saying impolitic things, once calling retired Supreme Court Justice David Souter an “[expletive] child molester” and First Lady Michelle Obama a “Marxist harpy.” He has since apologized for both comments.\nTrump’s words about Kelly simply went too far, Erickson said Friday, making him, someone who enjoys and appreciates barbed political rhetoric, uncomfortable and queasy. And with his invited guest dominating the 2016 race, and few if any conservatives reining him in, Erickson thought he’d try.\nThe following is a transcript:\nWhy did you disinvite Trump?\nI think there is a line of decency that even a non-professional politician can cross. Suggesting that a female journalist asking you a hostile question is hormone related, I think, is one of those lines.\nDo you see yourself as a referee for the conservative movement to keep Trump from riling the race?\nYou\nknow, no. I’m trying to be lenient with him. I told his campaign\nmanager a few days ago that there have been a lot of people in the party\nwho refuse to treat him legitimately even though he’s the front-runner.\nAnd I didn’t want to give him a hard time. I felt bad that one of\nevent’s agendas didn’t have his name on it and felt badly about that,\nlet him know. I don’t like that I have to disinvite him. But there are\nbounds of what’s acceptable in our discourse and they’re not different\nfor you, or me, or someone else. I’m not going to have a guy on stage\nwith my wife and daughter in the crowd who thinks a tough question from a\nwoman is because of hormones.\nThere is NO PLACE in cuckservatism for anyone who doesn’t kowtow before the feminist line. These guys are perma-losers both politically and socio-sexually. And like the SJWs and gamma males they are, they are hell-bent on keeping the more successful men in the same subservient place they are, at the base of the pedestal.\nLook at how he reduces the American political process to an appeal to the emotional authority of his wife and daughter. What a pathetic excuse for what purports to be a man!\nGreg from 108 ‏is right. For the cuckservative, as for the SJW, “appearing “not racist” or “not sexist” takes precedence over everything, even the Constitution and the rule of law.”",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-08T12:00:00+00:00"
}