{
  "url": "https://voxday.net/2015/08/17/devs-are-pro-gamergate/",
  "scraped_at": "2025-12-17T17:23:22.144313",
  "title": "Devs are pro-GamerGate",
  "date_display": "August 17, 2015",
  "date_iso": "2015-08-17T23:01:00+00:00",
  "date_from_url": "2015-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This interview with an anonymous AAA dev from a Sony studio <a href=\"http://techraptor.net/content/listening-another-interview-triple-developer\">expresses very much the same sentiments</a> that I have heard from more than a few other devs in the industry:</p><blockquote class=\"tr_bq\"><p> TechRaptor: What do you think about GamerGate the movement? The things they tend to tackle—corruption, censorship—are those big industry problems from your point of view?</p><p>Developer: I have always seen Gamergate as a group of passionate people rallying behind the platonic cause for honesty and accountability. While the Gamergate movement did have a rocky start to begin with, I feel the Gamergate movement has become quite clear with its intended mission. The video game industry has always been both a global community and very tight-knit. Because of how close we are and that we are an entertainment-based industry, it does allow of nepotism and corruption when money is on the line. These are large problems that I feel any entertainment-based industry has. But, what is unique about the video game industry is that we have consumers willing to speak up and demand that we strive for a better way.</p><p>Unfortunately, there are individuals who don’t feel comfortable about changing how they do things, especially when it works out so well for them in the past and the present. To those who fight against Gamergate, I can understand the feeling when a large amount of people are saying how you do your job is wrong. Within the game journalism part of our industry, it does seem like the Wild West. Media companies will make deals and write articles that help them grow and keep their employees. However, that stubbornness or misguided grandstanding doesn’t improve the industry or game journalism as a whole. The corruption and censorship that Gamergate is fighting against is after years of such “deals” and how some game journalists have their ingrained mindsets. It is an uphill battle, but it needs to be done.</p><p>TechRaptor: Does that corruption impact your ability to create or put undue limits on your projects?</p><p>Developer: I am blessed to be in a position where it mostly doesn’t affect our work. We don’t make games so that a gaming website will like it. We make a game so that our fans will like it. In truth, our biggest and most important critics will always be the people that buy and play our game, not the journalists that cover it. However, we always look at reviews and how it is received. If a review is biased against us from an ideological standpoint instead of the content of the game, then that can theoretically cause unnecessary issues for future projects.</p><p>TechRaptor: Something that has come up a lot in recent months is the move towards political correctness, is that something that is considered a lot in AAA and taken seriously when making games?</p><p>Developer: Political correctness as an issue is mostly addressed on a project-to-project basis. I have seen projects that have bowed to the ideas of political correctness and others that have thrown caution to the wind. <b>Regardless of the project, its has to be considered in some fashion.</b> Ideally, a project can make systems and characters great enough that it doesn’t need hit against the political correctness attitude. In the projects I am been a part of, the political correctness has either been glanced over or it has tailored a project in some degree. Political correctness can become a balancing act, but an act we shouldn’t have to deal with. However, I have seen that affect the Indie scene alot more than the AAA scene. Political correctness has never stopped a project from making a great character or gameplay feature that I have been a part of, and it never should.</p></blockquote><p>Political correctness and thought policing have NO PLACE in the game industry. Neither do SJWs.</p></div>",
  "content_text": "This interview with an anonymous AAA dev from a Sony studio\nexpresses very much the same sentiments\nthat I have heard from more than a few other devs in the industry:\nTechRaptor: What do you think about GamerGate the movement? The things they tend to tackle—corruption, censorship—are those big industry problems from your point of view?\nDeveloper: I have always seen Gamergate as a group of passionate people rallying behind the platonic cause for honesty and accountability. While the Gamergate movement did have a rocky start to begin with, I feel the Gamergate movement has become quite clear with its intended mission. The video game industry has always been both a global community and very tight-knit. Because of how close we are and that we are an entertainment-based industry, it does allow of nepotism and corruption when money is on the line. These are large problems that I feel any entertainment-based industry has. But, what is unique about the video game industry is that we have consumers willing to speak up and demand that we strive for a better way.\nUnfortunately, there are individuals who don’t feel comfortable about changing how they do things, especially when it works out so well for them in the past and the present. To those who fight against Gamergate, I can understand the feeling when a large amount of people are saying how you do your job is wrong. Within the game journalism part of our industry, it does seem like the Wild West. Media companies will make deals and write articles that help them grow and keep their employees. However, that stubbornness or misguided grandstanding doesn’t improve the industry or game journalism as a whole. The corruption and censorship that Gamergate is fighting against is after years of such “deals” and how some game journalists have their ingrained mindsets. It is an uphill battle, but it needs to be done.\nTechRaptor: Does that corruption impact your ability to create or put undue limits on your projects?\nDeveloper: I am blessed to be in a position where it mostly doesn’t affect our work. We don’t make games so that a gaming website will like it. We make a game so that our fans will like it. In truth, our biggest and most important critics will always be the people that buy and play our game, not the journalists that cover it. However, we always look at reviews and how it is received. If a review is biased against us from an ideological standpoint instead of the content of the game, then that can theoretically cause unnecessary issues for future projects.\nTechRaptor: Something that has come up a lot in recent months is the move towards political correctness, is that something that is considered a lot in AAA and taken seriously when making games?\nDeveloper: Political correctness as an issue is mostly addressed on a project-to-project basis. I have seen projects that have bowed to the ideas of political correctness and others that have thrown caution to the wind.\nRegardless of the project, its has to be considered in some fashion.\nIdeally, a project can make systems and characters great enough that it doesn’t need hit against the political correctness attitude. In the projects I am been a part of, the political correctness has either been glanced over or it has tailored a project in some degree. Political correctness can become a balancing act, but an act we shouldn’t have to deal with. However, I have seen that affect the Indie scene alot more than the AAA scene. Political correctness has never stopped a project from making a great character or gameplay feature that I have been a part of, and it never should.\nPolitical correctness and thought policing have NO PLACE in the game industry. Neither do SJWs.",
  "tags": [
    "#GamerGate",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-17T22:01:00+00:00"
}