{
  "url": "https://voxday.net/2015/08/13/easton-ellis-on-foster-wallace/",
  "scraped_at": "2025-12-17T17:22:51.072913",
  "title": "Easton Ellis on Foster Wallace",
  "date_display": "August 13, 2015",
  "date_iso": "2015-08-13T16:38:00+00:00",
  "date_from_url": "2015-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brett Easton Ellis kind of likes the movie about David Foster Wallace, he just <a href=\"http://thetalkhouse.com/film/talks/novelist-and-screenwriter-bret-easton-ellis-the-canyons-talks-james-ponsoldts-the-end-of-the-tour/\">doesn’t recognize the character</a> in the movie:</p><blockquote class=\"tr_bq\"><p> For many of us who couldn’t get through the David Foster Wallace novel <i>Infinite Jest</i><br> (and tried a few times), and found the journalism bloated and minor-key<br> condescending and thought the puling Kenyon commencement speech was<br> pure BS, and resisted the coronation of Wallace since his suicide in<br> 2008 as St. David, based on a particular and very American brand of<br> sentimental narrative, the new film about Wallace, <i>The End of the Tour</i>, is surprisingly easy to take even though it’s reverential to a fault….</br></br></br></br></br></p><p>Wallace is presented as a guy who was just too sensitive for this world —<br> and that strikes a certain emotional chord, especially with younger<br> viewers and actors. The movie portrays Wallace as an angelic Pop<br> Tart-sharing schlub, a lovable populist, a tortured everyman and<br> ex-addict who loves dogs, loves kids, loves McDonalds, exudes “realness”<br> and “humanity,” and the movie completely ignores referencing the other<br> Wallace: the contemptuous man, the sometime-contrarian, the asshole with<br> an abusive side, the cruel critic — all the things some of us find<br> interesting about him. This is the movie that prefers the Wallace who<br> was knighted into sainthood with his Kenyon commencement speech called —<br> deep breath — “This Is Water: Some Thoughts Delivered on a Significant<br> Occasion About Living a Compassionate Life,” which even his staunchest<br> defenders and former editors have a hard time stomaching, arguing it’s<br> the worst thing he ever wrote, but which became a viral sensation as<br> well as a soggy self-help guide for lost souls.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>And the David in this movie is the voice of reason, a sage, and the movie succumbs to the cult of stressing likability. But the real David scolded people and probably craved fame — what writer isn’t both suspicious of literary fame and yet curious in seeing how that game is played out? It’s not that rare and — hey — it sells books. He was cranky and could be very mean and caustic and opportunistic, but this David Foster Wallace is completely erased.</p></blockquote><p>I never bought into the cult of DFW. Unlike Ellis, <a href=\"http://www.milobookclub.com/2013/04/25/book-review-infinite-jes/\">I actually read Infinite Jest</a>, and it struck me as one part genuine literary talent, one part imitation Irving, two parts literary posturing, and three parts unrealized ambition. He was hailed as great when he did nothing more than show potential, and I suspect that had more than a little to do with his self-inflicted demise.</p></div>",
  "content_text": "Brett Easton Ellis kind of likes the movie about David Foster Wallace, he just\ndoesn’t recognize the character\nin the movie:\nFor many of us who couldn’t get through the David Foster Wallace novel\nInfinite Jest\n(and tried a few times), and found the journalism bloated and minor-key\ncondescending and thought the puling Kenyon commencement speech was\npure BS, and resisted the coronation of Wallace since his suicide in\n2008 as St. David, based on a particular and very American brand of\nsentimental narrative, the new film about Wallace,\nThe End of the Tour\n, is surprisingly easy to take even though it’s reverential to a fault….\nWallace is presented as a guy who was just too sensitive for this world —\nand that strikes a certain emotional chord, especially with younger\nviewers and actors. The movie portrays Wallace as an angelic Pop\nTart-sharing schlub, a lovable populist, a tortured everyman and\nex-addict who loves dogs, loves kids, loves McDonalds, exudes “realness”\nand “humanity,” and the movie completely ignores referencing the other\nWallace: the contemptuous man, the sometime-contrarian, the asshole with\nan abusive side, the cruel critic — all the things some of us find\ninteresting about him. This is the movie that prefers the Wallace who\nwas knighted into sainthood with his Kenyon commencement speech called —\ndeep breath — “This Is Water: Some Thoughts Delivered on a Significant\nOccasion About Living a Compassionate Life,” which even his staunchest\ndefenders and former editors have a hard time stomaching, arguing it’s\nthe worst thing he ever wrote, but which became a viral sensation as\nwell as a soggy self-help guide for lost souls.\nAnd the David in this movie is the voice of reason, a sage, and the movie succumbs to the cult of stressing likability. But the real David scolded people and probably craved fame — what writer isn’t both suspicious of literary fame and yet curious in seeing how that game is played out? It’s not that rare and — hey — it sells books. He was cranky and could be very mean and caustic and opportunistic, but this David Foster Wallace is completely erased.\nI never bought into the cult of DFW. Unlike Ellis,\nI actually read Infinite Jest\n, and it struck me as one part genuine literary talent, one part imitation Irving, two parts literary posturing, and three parts unrealized ambition. He was hailed as great when he did nothing more than show potential, and I suspect that had more than a little to do with his self-inflicted demise.",
  "tags": [
    "books",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-13T15:38:00+00:00"
}