{
  "url": "https://voxday.net/2015/08/09/europe-prepares-for-mass-deportations/",
  "scraped_at": "2025-12-17T17:22:21.845613",
  "title": "Europe prepares for mass deportations",
  "date_display": "August 9, 2015",
  "date_iso": "2015-08-09T16:00:00+00:00",
  "date_from_url": "2015-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve known the Europeans were not going to tolerate American levels of immigration for a long time. Can you even imagine an American politican, let alone a Cabinet member, <a href=\"http://www.telegraph.co.uk/news/uknews/immigration/11792798/Millions-of-African-migrants-threaten-standard-of-living-Philip-Hammond-says.html\">saying anything like this</a>?</p><blockquote class=\"tr_bq\"><p> Millions of African migrants pose a threat to the standard of living and<br> social structure of the UK and the rest of Europe, the Foreign<br> Secretary has warned…. Speaking during a visit to Singapore, Mr Hammond said the gap in living standards between Europe and Africa meant there would always be an “economic motivation” for Africans to try to make it to the EU.</br></br></p><p>He told BBC News: “We have got to be able to resolve this problem ultimately by being able to return those who are not entitled to claim asylum back to their countries of origin. That’s our number one priority.</p><p>“As long as the Europe Union’s laws are the way they are, many of them will only have to set foot in Europe to be pretty confident that they will never be returned to their country of origin.</p><p>“Now, that is not a sustainable situation because Europe can’t protect itself and preserve its standard of living and social structure, if it has to absorb millions of migrants from Africa.”</p></blockquote><p>He’s absolutely right. As we’ve seen, even the USA has been unable to preserve its standard of living and social structure due to its failure to absorb millions of migrants from Central and South America.</p><p>The SJWs and cuckservatives celebrate diversity, but what they are also celebrating is poverty. America’s living standards have fallen considerably since 1973, but no one realizes it yet because the combination of technological advancement and debt-spending conceals that fact. But it gradually becomes obvious, as Americans become increasingly unable to afford houses or even college educations.</p><p>But at least they have iPhones, so they can look at the pretty pictures. Dirt doesn’t trump genetics and culture is not a consequence of geographic location. The Europeans understand, as most Americans still do not, that millions of migrants will destroy, not enhance, their standard of living and social structure.</p></div>",
  "content_text": "I’ve known the Europeans were not going to tolerate American levels of immigration for a long time. Can you even imagine an American politican, let alone a Cabinet member,\nsaying anything like this\n?\nMillions of African migrants pose a threat to the standard of living and\nsocial structure of the UK and the rest of Europe, the Foreign\nSecretary has warned…. Speaking during a visit to Singapore, Mr Hammond said the gap in living standards between Europe and Africa meant there would always be an “economic motivation” for Africans to try to make it to the EU.\nHe told BBC News: “We have got to be able to resolve this problem ultimately by being able to return those who are not entitled to claim asylum back to their countries of origin. That’s our number one priority.\n“As long as the Europe Union’s laws are the way they are, many of them will only have to set foot in Europe to be pretty confident that they will never be returned to their country of origin.\n“Now, that is not a sustainable situation because Europe can’t protect itself and preserve its standard of living and social structure, if it has to absorb millions of migrants from Africa.”\nHe’s absolutely right. As we’ve seen, even the USA has been unable to preserve its standard of living and social structure due to its failure to absorb millions of migrants from Central and South America.\nThe SJWs and cuckservatives celebrate diversity, but what they are also celebrating is poverty. America’s living standards have fallen considerably since 1973, but no one realizes it yet because the combination of technological advancement and debt-spending conceals that fact. But it gradually becomes obvious, as Americans become increasingly unable to afford houses or even college educations.\nBut at least they have iPhones, so they can look at the pretty pictures. Dirt doesn’t trump genetics and culture is not a consequence of geographic location. The Europeans understand, as most Americans still do not, that millions of migrants will destroy, not enhance, their standard of living and social structure.",
  "tags": [
    "EU",
    "immigration",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-09T15:00:00+00:00"
}