{
  "url": "https://voxday.net/2015/08/02/in-defense-of-ricardo/",
  "scraped_at": "2025-12-17T17:21:46.747454",
  "title": "In defense of Ricardo",
  "date_display": "August 2, 2015",
  "date_iso": "2015-08-02T07:46:00+00:00",
  "date_from_url": "2015-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Clark responds to <a href=\"http://www.milobookclub.com/2015/07/30/the-illusion-of-knowledge/\">my critique of his endorsement</a> of David Ricardo and Comparative Advantage. I will respond to it in detail soon, although the chief defects of his defense should be readily apparent to those with the eyes to see it.</i></p><p>Vox and I got in a disagreement on twitter about economics when I told someone “Read David Ricardo”. Vox replied that Ricardo was wrong on many things, and wrong about comparative advantage – at least when we take into account flows of population and capital.</p><p>Vox lays out <a href=\"http://www.milobookclub.com/2015/07/30/the-illusion-of-knowledge/\">his objections here</a></p><p>It’s true that I literally wrote the words “read Ricardo”, but the context makes it clear that I was using “Ricardo” as a metonym for the theory of comparative advantage.  Vox objected to several aspects of Ricardo’s writings, so let me take a quick detour and address some of Vox’s points.</p><p>Let’s set out the areas where Vox and I agree (or, at least, where I think we agree):</p><p><b>I do not back the labor theory of value.</b></p><p>I’ve considered labor theory of value a horrific joke since I first read Das Kapital decades ago. I disagree with Vox that Ricardo endorsed such a thing; I suggest that Ricardo merely said that a commodity will never be sold for less than its cost of production, which is absolutely true (if we talk only of steady states of markets in equilibrium, like corn being grown in England, and not weird cases like warehouses full of remaindered Apple Newtons).  Is there really anything objectionable in Ricardo’s sentence fragment “But suppose corn to rise in price because more labour is necessary to produce it”? I suggest not.  Additionally, it’s unfair to paint Ricardo, by lack of context, as some proto-Marxist, when in fact he was actually writing after Adam Smith, and in the same vein, helping to move us from a state of ignorance of the laws that govern the market to one of better understanding.  Do we criticize Newton for getting the rules of force and momentum mostly right, but failing to include a relativistic component in his equations?</p><p><b>I do not assert that unlimited immigration is a good idea. </b></p><p>Unlike the conservative stereotype of libertarians and free market economics as pie-in-the-sky dreamers who ignore cultural issues, I most certainly do NOT ignore such issues, and often debate such people, asking them “what do you think an America of 900 million people, 600 million of them being new immigrants, would be like?  How would it vote?”.</p><p>On what do Vox and I disagree?  I assert merely that comparative advantage is a real phenomena, and persists in being a real phenomena even in a world of mobile capital and mobile labor.  I’m not even 100% sure that Vox disagrees with this, because his post seems to conflate knock on effects of immigration with the core point of comparative advantage.</p><p>But assuming that we do disagree on the thesis “comparative advantage is a real phenomena, and persists in being a real phenomena even in a world of mobile capital and mobile labor”, I proceed.</p><p>Let us define our terms.  The <a href=\"https://en.wikipedia.org/wiki/Comparative_advantage\">law of comparative advantage</a> is this:</p><p>1) various producers are variously capable of producing different outputs at different costs.</p><p>2) therefore, in pure economic terms, it is to each producer’s advantage to concentrate his effort in what he’s best at and trade for much else…<i>even, in many cases, if the producer of X is better at Y in absolute terms than the person that they choose to engage to do that task for them</i>.</p><p>Examples often include lawn mowing, for whatever reason.  E.g.:</p><blockquote><p> Take a model who makes $10,000 a day modeling but who is also very efficient at mowing her large yard around her mansion. If she cuts her grass herself, she can do it in one day. Or she can hire a lawn service that takes 2 days to mow the lawn and charges $400. Thus, the model has an absolute advantage in both working as a model and mowing her own lawn, but, she would, nonetheless, still hire the lawn service, because if she mowed her own lawn, she would have to give up a day of modeling, which means her earnings would be $10,000 less. By hiring the lawn service, she earns $10,000 a day as a model and pays the lawn service $400, for a net gain of $9,600.</p></blockquote><p> Let us look at Ricardo’s original quote in context. First he defines the sorts of things that influence the productivity of a given population: natural resources and distribution of skills:</p><blockquote><p>     But in different stages of society, the proportions of the whole<br>     produce of the earth which will be allotted… depend[s] mainly on the<br>     actual fertility of the soil, on the accumulation of capital and<br>     population, and on the skill, ingenuity, and instruments employed in<br>     agriculture.</br></br></br></br></p></blockquote><p> Note that Ricardo is speaking here of the case within a given nation: imagine a world without trade between nations.  Given a high-IQ, high-conscientiousness, high-technology Japan, we would expect that a relatively small proportion of its population would be devoted to fishing.  The “skill, ingenuity, and instruments” and the Japanese people ensure that: there is no need for a million Japanese to stand in bamboo junks and throw lines into the water.  Instead, we’d expect a few thousand clever Japanese engineers to build massive ships, nets, etc.</p><p>On the other hand, in this theoretical world without foreign trade, we’d expect that a larger percentage of the population of Kenya, would be devoted to fishing, because the “skill, ingenuity, and instruments” of the Kenyan nation would require more labor to achieve a similar result.</p><p>Ricardo also notes that the natural resources of a country play into the calculation: a country blessed with relevant abundant resources is ahead of the game, and can generate more outputs with the same labor:</p><blockquote><p> The same remark may be made respecting two or more countries. In America and Poland, on the land last taken into cultivation, a year’s labour of any given number of men, will produce much more corn than on land similarly circumstanced in England.</p></blockquote><p> I see nothing objectionable here: Spain, with its sunny climate, is naturally better suited to making wine than is England.  North America is better suited to making beef than is Japan.  Etc.</p><p>Ricardo takes these two points and derives the concept of specialization:</p><blockquote><p> Under a system of perfectly free commerce, each country naturally devotes its capital and labour to such employments as are most beneficial to each. This pursuit of individual advantage is admirably connected with the universal good of the whole. By stimulating industry, by regarding ingenuity, and by using most efficaciously the peculiar powers bestowed by nature, it distributes labour most effectively and most economically</p></blockquote><p> As we look around the actual world, this is largely what we see. Japan, blessed with an intelligent population and hampered by a lack of oil, specializes in exporting electronics and buys oil with the proceeds.  Saudi Arabia, blessed with oil, and not much else, exports oil and purchases electronics.</p><p>So, this, then, is Ricardo’s concept of comparative advantage.</p><p>Vox raises two objections: mobile capital and mobile labor.</p><p>Let us inject mobile capital into our model first. Picture Saudi Arabia in 1950.  It is oil-rich, but technology- and dollar-poor.  It learns that there is oil underneath its sands, but has neither the technology nor the wealth to build the infrastructure to get it out.</p><p>Who has the comparative advantage in both lending money and in building oil refineries?  The West.  And we see that it is the West that, indeed, lent the capital and the technology to get the oil out.</p><p>(By the way, there’s a line of attack on this argument that I sadly predict: “yeah, well, how did making Saudi Arabia an exporter of oil work out for us? Remember 9/11 !”.  And perhaps my hypothetical interlocutor is correct – perhaps we’d be better off in a world of less available oil and also a poorer Saudi Arabia – but that debate has absolutely nothing to do with comparative advantage.  In fact, I chose Saudi Arabia as the example here specifically to trigger and<br> then discard this objection).</br></p><p>Anyway, what does the addition of mobile capital do to concept of comparative advantage?  It acts only as a lubricant, to allow the gears to turn a little more freely, and make the inevitable – and mutually beneficial – specialization happen more quickly.  Saudi Arabia could have husbanded its resources in 1950, invested in one early well and refinery, used the profits from that too bootstrap a second well, and so forth, but there is no difference in the inevitable outcome.</p><p>Q.E.D.: comparative advantage exists, even with mobile capital.</p><p>Now let us look at Vox’s second objection: mobile labor.</p><p>Let us picture a Japanese sushi chef.  In Japan, he creates more value per unit of labor by making sushi than he does by, say, driving a bus. If he immigrates to the United States, it is likely that he continues to create more value per unit of labor by making sushi than he does by driving a bus.  In Japan his smart strategy is to sell his sushi-making labor and buy his transportation.  After immigrating to the US his strategy is likely still the same.</p><p>Let us consider a second example: a Mexican farmer.  Let us posit that he has skills tied to the particular climate of Mexican farms (agave cactus farming, let us say).  This his smart strategy is to work as a farmer, and hire relatively unskilled labor to mow his lawn or take out his garbage.</p><p>If the farmer immigrates to the US, perhaps, North Dakota, the utility of his agave expertise diminishes, and his comparative advantage is now perhaps in unskilled labor.  Perhaps the former farmer now carries trash for others, and uses the proceeds to buy agave, in an exact reversal of his former situation.</p><p>Q.E.D.: comparative advantage exists, even with mobile labor.</p><p>Because so many people who discuss Ricardo also carry water for legal and social policies that are repugnant to the alt-right, it’s easy to conflate the two, so let me by clear:</p><p>In this essay I have not demonstrated, not have I claimed, that:</p><ol><li>unchecked immigration is a good thing for the culture of the receiving country</li><li>unchecked immigration is a good thing for the economy of the receiving country</li><li>immigration of unskilled labor benefits unskilled natives</li><li>unchecked importation of capital is good for the governance of the receiving country</li><li>unchecked importation of capital is good for the economy of the receiving country</li></ol><p>I believe that I have, however, demonstrated :</p><ol><li>that the law of comparative advantage exists</li><li>that the law of comparative advantage continues to exist even with mobile capital</li><li>that the law of comparative advantage continues to exist even with mobile labor</li></ol><p>If Vox’s objection is only to one or more of the first five items, we have no quarrel.</p><p>If Vox’s objection is to one or more of the latter three items, I’d like to hear him explain – not how populations flows interact poorly with the modern anarcho-tyranical welfare states of the West – but how the law of comparative advantage qua the law of comparative advantage does not exist.</p></div>",
  "content_text": "Clark responds to\nmy critique of his endorsement\nof David Ricardo and Comparative Advantage. I will respond to it in detail soon, although the chief defects of his defense should be readily apparent to those with the eyes to see it.\nVox and I got in a disagreement on twitter about economics when I told someone “Read David Ricardo”. Vox replied that Ricardo was wrong on many things, and wrong about comparative advantage – at least when we take into account flows of population and capital.\nVox lays out\nhis objections here\nIt’s true that I literally wrote the words “read Ricardo”, but the context makes it clear that I was using “Ricardo” as a metonym for the theory of comparative advantage.  Vox objected to several aspects of Ricardo’s writings, so let me take a quick detour and address some of Vox’s points.\nLet’s set out the areas where Vox and I agree (or, at least, where I think we agree):\nI do not back the labor theory of value.\nI’ve considered labor theory of value a horrific joke since I first read Das Kapital decades ago. I disagree with Vox that Ricardo endorsed such a thing; I suggest that Ricardo merely said that a commodity will never be sold for less than its cost of production, which is absolutely true (if we talk only of steady states of markets in equilibrium, like corn being grown in England, and not weird cases like warehouses full of remaindered Apple Newtons).  Is there really anything objectionable in Ricardo’s sentence fragment “But suppose corn to rise in price because more labour is necessary to produce it”? I suggest not.  Additionally, it’s unfair to paint Ricardo, by lack of context, as some proto-Marxist, when in fact he was actually writing after Adam Smith, and in the same vein, helping to move us from a state of ignorance of the laws that govern the market to one of better understanding.  Do we criticize Newton for getting the rules of force and momentum mostly right, but failing to include a relativistic component in his equations?\nI do not assert that unlimited immigration is a good idea.\nUnlike the conservative stereotype of libertarians and free market economics as pie-in-the-sky dreamers who ignore cultural issues, I most certainly do NOT ignore such issues, and often debate such people, asking them “what do you think an America of 900 million people, 600 million of them being new immigrants, would be like?  How would it vote?”.\nOn what do Vox and I disagree?  I assert merely that comparative advantage is a real phenomena, and persists in being a real phenomena even in a world of mobile capital and mobile labor.  I’m not even 100% sure that Vox disagrees with this, because his post seems to conflate knock on effects of immigration with the core point of comparative advantage.\nBut assuming that we do disagree on the thesis “comparative advantage is a real phenomena, and persists in being a real phenomena even in a world of mobile capital and mobile labor”, I proceed.\nLet us define our terms.  The\nlaw of comparative advantage\nis this:\n1) various producers are variously capable of producing different outputs at different costs.\n2) therefore, in pure economic terms, it is to each producer’s advantage to concentrate his effort in what he’s best at and trade for much else…\neven, in many cases, if the producer of X is better at Y in absolute terms than the person that they choose to engage to do that task for them\n.\nExamples often include lawn mowing, for whatever reason.  E.g.:\nTake a model who makes $10,000 a day modeling but who is also very efficient at mowing her large yard around her mansion. If she cuts her grass herself, she can do it in one day. Or she can hire a lawn service that takes 2 days to mow the lawn and charges $400. Thus, the model has an absolute advantage in both working as a model and mowing her own lawn, but, she would, nonetheless, still hire the lawn service, because if she mowed her own lawn, she would have to give up a day of modeling, which means her earnings would be $10,000 less. By hiring the lawn service, she earns $10,000 a day as a model and pays the lawn service $400, for a net gain of $9,600.\nLet us look at Ricardo’s original quote in context. First he defines the sorts of things that influence the productivity of a given population: natural resources and distribution of skills:\nBut in different stages of society, the proportions of the whole\nproduce of the earth which will be allotted… depend[s] mainly on the\nactual fertility of the soil, on the accumulation of capital and\npopulation, and on the skill, ingenuity, and instruments employed in\nagriculture.\nNote that Ricardo is speaking here of the case within a given nation: imagine a world without trade between nations.  Given a high-IQ, high-conscientiousness, high-technology Japan, we would expect that a relatively small proportion of its population would be devoted to fishing.  The “skill, ingenuity, and instruments” and the Japanese people ensure that: there is no need for a million Japanese to stand in bamboo junks and throw lines into the water.  Instead, we’d expect a few thousand clever Japanese engineers to build massive ships, nets, etc.\nOn the other hand, in this theoretical world without foreign trade, we’d expect that a larger percentage of the population of Kenya, would be devoted to fishing, because the “skill, ingenuity, and instruments” of the Kenyan nation would require more labor to achieve a similar result.\nRicardo also notes that the natural resources of a country play into the calculation: a country blessed with relevant abundant resources is ahead of the game, and can generate more outputs with the same labor:\nThe same remark may be made respecting two or more countries. In America and Poland, on the land last taken into cultivation, a year’s labour of any given number of men, will produce much more corn than on land similarly circumstanced in England.\nI see nothing objectionable here: Spain, with its sunny climate, is naturally better suited to making wine than is England.  North America is better suited to making beef than is Japan.  Etc.\nRicardo takes these two points and derives the concept of specialization:\nUnder a system of perfectly free commerce, each country naturally devotes its capital and labour to such employments as are most beneficial to each. This pursuit of individual advantage is admirably connected with the universal good of the whole. By stimulating industry, by regarding ingenuity, and by using most efficaciously the peculiar powers bestowed by nature, it distributes labour most effectively and most economically\nAs we look around the actual world, this is largely what we see. Japan, blessed with an intelligent population and hampered by a lack of oil, specializes in exporting electronics and buys oil with the proceeds.  Saudi Arabia, blessed with oil, and not much else, exports oil and purchases electronics.\nSo, this, then, is Ricardo’s concept of comparative advantage.\nVox raises two objections: mobile capital and mobile labor.\nLet us inject mobile capital into our model first. Picture Saudi Arabia in 1950.  It is oil-rich, but technology- and dollar-poor.  It learns that there is oil underneath its sands, but has neither the technology nor the wealth to build the infrastructure to get it out.\nWho has the comparative advantage in both lending money and in building oil refineries?  The West.  And we see that it is the West that, indeed, lent the capital and the technology to get the oil out.\n(By the way, there’s a line of attack on this argument that I sadly predict: “yeah, well, how did making Saudi Arabia an exporter of oil work out for us? Remember 9/11 !”.  And perhaps my hypothetical interlocutor is correct – perhaps we’d be better off in a world of less available oil and also a poorer Saudi Arabia – but that debate has absolutely nothing to do with comparative advantage.  In fact, I chose Saudi Arabia as the example here specifically to trigger and\nthen discard this objection).\nAnyway, what does the addition of mobile capital do to concept of comparative advantage?  It acts only as a lubricant, to allow the gears to turn a little more freely, and make the inevitable – and mutually beneficial – specialization happen more quickly.  Saudi Arabia could have husbanded its resources in 1950, invested in one early well and refinery, used the profits from that too bootstrap a second well, and so forth, but there is no difference in the inevitable outcome.\nQ.E.D.: comparative advantage exists, even with mobile capital.\nNow let us look at Vox’s second objection: mobile labor.\nLet us picture a Japanese sushi chef.  In Japan, he creates more value per unit of labor by making sushi than he does by, say, driving a bus. If he immigrates to the United States, it is likely that he continues to create more value per unit of labor by making sushi than he does by driving a bus.  In Japan his smart strategy is to sell his sushi-making labor and buy his transportation.  After immigrating to the US his strategy is likely still the same.\nLet us consider a second example: a Mexican farmer.  Let us posit that he has skills tied to the particular climate of Mexican farms (agave cactus farming, let us say).  This his smart strategy is to work as a farmer, and hire relatively unskilled labor to mow his lawn or take out his garbage.\nIf the farmer immigrates to the US, perhaps, North Dakota, the utility of his agave expertise diminishes, and his comparative advantage is now perhaps in unskilled labor.  Perhaps the former farmer now carries trash for others, and uses the proceeds to buy agave, in an exact reversal of his former situation.\nQ.E.D.: comparative advantage exists, even with mobile labor.\nBecause so many people who discuss Ricardo also carry water for legal and social policies that are repugnant to the alt-right, it’s easy to conflate the two, so let me by clear:\nIn this essay I have not demonstrated, not have I claimed, that:\nunchecked immigration is a good thing for the culture of the receiving country\nunchecked immigration is a good thing for the economy of the receiving country\nimmigration of unskilled labor benefits unskilled natives\nunchecked importation of capital is good for the governance of the receiving country\nunchecked importation of capital is good for the economy of the receiving country\nI believe that I have, however, demonstrated :\nthat the law of comparative advantage exists\nthat the law of comparative advantage continues to exist even with mobile capital\nthat the law of comparative advantage continues to exist even with mobile labor\nIf Vox’s objection is only to one or more of the first five items, we have no quarrel.\nIf Vox’s objection is to one or more of the latter three items, I’d like to hear him explain – not how populations flows interact poorly with the modern anarcho-tyranical welfare states of the West – but how the law of comparative advantage qua the law of comparative advantage does not exist.",
  "tags": [
    "debate",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-02T06:46:00+00:00"
}