{
  "url": "https://voxday.net/2015/08/22/in-which-tonights-events-are/",
  "scraped_at": "2025-12-17T17:23:53.496548",
  "title": "In which tonight’s events are contemplated",
  "date_display": "August 22, 2015",
  "date_iso": "2015-08-22T10:36:00+00:00",
  "date_from_url": "2015-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://2.bp.blogspot.com/-V7SjV1y_ObU/VdhE6IWQCAI/AAAAAAAABbI/HDrZ_Ue3zFY/s1600/SDL_sits.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"640\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/08/SDL_sits.jpg\" width=\"568\"/></a></div><p> Aaron sent over this cheerful meme of the Supreme Dark Lord at his ease. I just wish he’d sent it sooner, so I could have sent it in as my picture for the Awards ceremony.<i> C’est la vie.</i> I’m feeling more than a little optimistic today, although about what exactly I can’t say. Perhaps it is because I finished the final draft of <i>SJWS ALWAYS LIE: Taking Down the Thought Police</i> last night and will be able to deliver it on August 27th, the first anniversary of #GamerGate, as planned. Or perhaps because <i>Art of Sword</i> is coming along nicely, as we’ve finally got some of the powerups in and working. Or perhaps because we’ve got our gargantuan new project server coming on line this weekend.</p><p>I’m looking forward to tonight no matter what happens. Several media outlets have asked me for my take on the situation after the awards are announced, as there is considerably more interest in the outcome than usual, but the fact of the matter is that we achieved our objectives back in April. The Rabid Puppies outperformed my expectations, and if they do so again tonight, it won’t be for the first time. Regardless, we have broken the perceived power of the SJWs in science fiction once and for all; they are not frantically debating the best way to mitigate our growing influence in science fiction because they believe they are still in control of it.</p><p>I had to laugh when I read that some of the people at the business meeting wanted to postpone the vote on EPH until after the awards were announced because they wanted to see what the results were before taking a position on it. This indicates that they still have no idea what motivates us or what we expect to accomplish. They are too solipsistic to understand our goals even when we tell them straight out what they are. So to be clear, WorldCon, be informed that He Who Shall Only Be Named In Fearful Whispers supports E Pluribus Hugo 100 percent. As for the other anti-slate plan, X of Y, I am totally indifferent because it is structurally futile. Contra the purpose of its designers, it provides an even bigger advantage to disciplined slates than the current rules do. It’s irrelevant.</p><p>As the International Lord of Hate observed concerning EPH: <i>“So it rewards coordination between a group that is willing to focus<br> votes for one item per category. Did Vox write that proposal for them?”</br></i></p><p>George Martin is already frantically pre-spinning the Narrative, declaring that no awards being given out means the truefen win and the Puppies lose, except of course when it doesn’t because he’s totally against slates except when a slate nominates something he likes. It’s the usual SJW incoherence. But we don’t care if I win Best Editor or No Award does, we don’t care if Tom Kratman wins best novella or No Award does, the objective was to ensure that none of the usual SJWs did. And in that, we have already succeeded brilliantly. Sure, it would be amusing to see Jim or John or Rolf or Eric win a plastic rocket, but only because that would, somewhat to my surprise, upset the SJWs even more than the demise of the awards.</p><p>John C. Wright is one of science fiction’s greatest authors, Jim Butcher is one of fantasy’s most popular, and I truly did not expect that the SJWs would rather burn the awards to the ground than permit one of them to be recognized for their contributions to the field. But that is certainly an acceptable outcome.</p><p>What Martin and the other SJWs are hoping is that by establishing false objectives for us (and then praying that we don’t achieve them), we will be demoralized and go away with our tails tucked between our legs, chastened by the disapproval of the empty-handed, but victorious truefen. This is amusing, because it is not us, but them, who are demoralized. Consider the despairing lament of one SJW at io9.</p><div style=\"font-weight: normal; line-height: 100%; margin-bottom: 0.08in;\"> <i>I’m so WEARY of these assholes. This is supposed to be FUN. It<br> isn’t supposed to be a long, bitter war. I hope the Puppies are<br> fucking trounced in disgrace at the Hugo’s. I hope “no award”<br> wins for most of the categories they flooded. As wonderful as that<br> will be it will just make them more bloodthirsty, bigoted and<br> pigheaded. This drama won’t end with the Hugo’s.</br></br></br></br></br></i></div><p> No, it won’t. They’re weary and in despair because they thought they’d already won the cultural war. They didn’t realize that we were still mobilizing, that we were gearing up to blow them off the battlefield with weapons and dark forces they didn’t know existed. What demoralized us was seeing SJW crap fill the bookstore shelves. What demoralized us was seeing utterly forgettable romance novels in space being declared the best that science fiction had to offer. If that mediocre SJW-infested nonsense was the best that could make it past the publishing gatekeepers, then what was the point of reading it or writing it?</p><p>Compared to nearly three decades of that, what is one more year of not winning awards? We never won any before, so what the hell do we care?</p><p>Tonight will tell us one very important thing. It will give us the opportunity to see what their true numbers are and reveal the true extent of their fully mobilized strength. Last year, the maximum No Award vote was 1,100. This year it will be more, somewhere between 1,100 and 4,000.</p><p>Being SJWs, they doubled-down as per the Second Law, giving us the chance to break them once and for all. But even if we don’t, even if we only burn Munich instead of taking Berlin, even if they are successful in “sending a message”, what we hear will not be what they wish for us to hear. Because what we will hear is this: <i>Next year, bring more puppies.</i></p></div>",
  "content_text": "Aaron sent over this cheerful meme of the Supreme Dark Lord at his ease. I just wish he’d sent it sooner, so I could have sent it in as my picture for the Awards ceremony.\nC’est la vie.\nI’m feeling more than a little optimistic today, although about what exactly I can’t say. Perhaps it is because I finished the final draft of\nSJWS ALWAYS LIE: Taking Down the Thought Police\nlast night and will be able to deliver it on August 27th, the first anniversary of #GamerGate, as planned. Or perhaps because\nArt of Sword\nis coming along nicely, as we’ve finally got some of the powerups in and working. Or perhaps because we’ve got our gargantuan new project server coming on line this weekend.\nI’m looking forward to tonight no matter what happens. Several media outlets have asked me for my take on the situation after the awards are announced, as there is considerably more interest in the outcome than usual, but the fact of the matter is that we achieved our objectives back in April. The Rabid Puppies outperformed my expectations, and if they do so again tonight, it won’t be for the first time. Regardless, we have broken the perceived power of the SJWs in science fiction once and for all; they are not frantically debating the best way to mitigate our growing influence in science fiction because they believe they are still in control of it.\nI had to laugh when I read that some of the people at the business meeting wanted to postpone the vote on EPH until after the awards were announced because they wanted to see what the results were before taking a position on it. This indicates that they still have no idea what motivates us or what we expect to accomplish. They are too solipsistic to understand our goals even when we tell them straight out what they are. So to be clear, WorldCon, be informed that He Who Shall Only Be Named In Fearful Whispers supports E Pluribus Hugo 100 percent. As for the other anti-slate plan, X of Y, I am totally indifferent because it is structurally futile. Contra the purpose of its designers, it provides an even bigger advantage to disciplined slates than the current rules do. It’s irrelevant.\nAs the International Lord of Hate observed concerning EPH:\n“So it rewards coordination between a group that is willing to focus\nvotes for one item per category. Did Vox write that proposal for them?”\nGeorge Martin is already frantically pre-spinning the Narrative, declaring that no awards being given out means the truefen win and the Puppies lose, except of course when it doesn’t because he’s totally against slates except when a slate nominates something he likes. It’s the usual SJW incoherence. But we don’t care if I win Best Editor or No Award does, we don’t care if Tom Kratman wins best novella or No Award does, the objective was to ensure that none of the usual SJWs did. And in that, we have already succeeded brilliantly. Sure, it would be amusing to see Jim or John or Rolf or Eric win a plastic rocket, but only because that would, somewhat to my surprise, upset the SJWs even more than the demise of the awards.\nJohn C. Wright is one of science fiction’s greatest authors, Jim Butcher is one of fantasy’s most popular, and I truly did not expect that the SJWs would rather burn the awards to the ground than permit one of them to be recognized for their contributions to the field. But that is certainly an acceptable outcome.\nWhat Martin and the other SJWs are hoping is that by establishing false objectives for us (and then praying that we don’t achieve them), we will be demoralized and go away with our tails tucked between our legs, chastened by the disapproval of the empty-handed, but victorious truefen. This is amusing, because it is not us, but them, who are demoralized. Consider the despairing lament of one SJW at io9.\nI’m so WEARY of these assholes. This is supposed to be FUN. It\nisn’t supposed to be a long, bitter war. I hope the Puppies are\nfucking trounced in disgrace at the Hugo’s. I hope “no award”\nwins for most of the categories they flooded. As wonderful as that\nwill be it will just make them more bloodthirsty, bigoted and\npigheaded. This drama won’t end with the Hugo’s.\nNo, it won’t. They’re weary and in despair because they thought they’d already won the cultural war. They didn’t realize that we were still mobilizing, that we were gearing up to blow them off the battlefield with weapons and dark forces they didn’t know existed. What demoralized us was seeing SJW crap fill the bookstore shelves. What demoralized us was seeing utterly forgettable romance novels in space being declared the best that science fiction had to offer. If that mediocre SJW-infested nonsense was the best that could make it past the publishing gatekeepers, then what was the point of reading it or writing it?\nCompared to nearly three decades of that, what is one more year of not winning awards? We never won any before, so what the hell do we care?\nTonight will tell us one very important thing. It will give us the opportunity to see what their true numbers are and reveal the true extent of their fully mobilized strength. Last year, the maximum No Award vote was 1,100. This year it will be more, somewhere between 1,100 and 4,000.\nBeing SJWs, they doubled-down as per the Second Law, giving us the chance to break them once and for all. But even if we don’t, even if we only burn Munich instead of taking Berlin, even if they are successful in “sending a message”, what we hear will not be what they wish for us to hear. Because what we will hear is this:\nNext year, bring more puppies.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-22T09:36:00+00:00"
}