{
  "url": "https://voxday.net/2015/08/13/little-skeletons-in-close/",
  "scraped_at": "2025-12-17T17:22:54.766726",
  "title": "Little skeletons in the closet",
  "date_display": "August 13, 2015",
  "date_iso": "2015-08-13T23:26:00+00:00",
  "date_from_url": "2015-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Sasquan approaches, more of the File 770 SJWs are starting to lose it.</p><blockquote class=\"tr_bq\"><p> Patrick May: There is, however, a group within the non-Puppy set that has been making broad accusations of racism, misogyny, and homophobia against all Sad and Rabid Puppy supporters.</p><p>Matt Y: Eh, if you’re a supporter of a movement with a mission statement about how previous recent award winners only won because of affirmative action instead of quality work, without citation or evidence to back up that claim, I don’t think that’s a broad statement. There might be Puppy supporters that aren’t, but what they’re supporting certainly is.</p><p>Shao Ping: I would also add some of the works the Puppies supported add a great deal of credibility to charges of racism, misogyny, and homophobia.</p></blockquote><p>That makes no sense. Whether you have supported someone who has made a broad statement or not, it is still, by definition, a broad statement to accuse you and every other supporter of racism, misogyny, and homophobia. This attempt to create a distinction about Person X’s action on the basis of Person Y’s action isn’t logically valid; Person X’s action exists in its own right. And I would also add that by Shao Ping’s standard, many of the works supported by the science fiction SJWs add a great deal of credibility to charges of child molestation, child abuse, rape, sexual deviance, and pedophilia.</p><p>For example, there is considerably more solid evidence indicating that SFWA Grand Master and NAMBLA supporter Samuel Delaney is a criminal child molester than there is to indicate that <i>any </i>Sad or Rabid Puppy nominee, much less supporter, is racist, misogynistic, or homophobic, much less a Fascist, a neo-Nazi or a Nazi. I have repeatedly denied all of those charges myself and no one has ever been able to prove otherwise because they are all false. Whereas, to the best of my knowledge, Mr. Delaney has never once denied having had sex with a minor as an adult… and gay sex with minors, both voluntary and involuntary, is a frequent feature of his books. Among various and sundry other unpleasantries.</p><p>We know, beyond any shadow of a doubt, that many Puppy Kickers have direct personal ties to “Chip” Delaney, to convicted child molester and SFWA member Ed Kramer, and to the late child molester, Marion Zimmer Bradley, whose estate is listed in the SFWA directory. And they were not, they are not, the only child molesters in science fiction.</p><p>Listening to these criminal sex deviants and psychological train wrecks whine for months about what terrible people the Puppies are to steal their awards is surreal. It’s going to be amusing to see how they react when the media attention they have so assiduously courted starts looking in their direction and begins finding the many child-sized skeletons in their closets.</p></div>",
  "content_text": "As Sasquan approaches, more of the File 770 SJWs are starting to lose it.\nPatrick May: There is, however, a group within the non-Puppy set that has been making broad accusations of racism, misogyny, and homophobia against all Sad and Rabid Puppy supporters.\nMatt Y: Eh, if you’re a supporter of a movement with a mission statement about how previous recent award winners only won because of affirmative action instead of quality work, without citation or evidence to back up that claim, I don’t think that’s a broad statement. There might be Puppy supporters that aren’t, but what they’re supporting certainly is.\nShao Ping: I would also add some of the works the Puppies supported add a great deal of credibility to charges of racism, misogyny, and homophobia.\nThat makes no sense. Whether you have supported someone who has made a broad statement or not, it is still, by definition, a broad statement to accuse you and every other supporter of racism, misogyny, and homophobia. This attempt to create a distinction about Person X’s action on the basis of Person Y’s action isn’t logically valid; Person X’s action exists in its own right. And I would also add that by Shao Ping’s standard, many of the works supported by the science fiction SJWs add a great deal of credibility to charges of child molestation, child abuse, rape, sexual deviance, and pedophilia.\nFor example, there is considerably more solid evidence indicating that SFWA Grand Master and NAMBLA supporter Samuel Delaney is a criminal child molester than there is to indicate that\nany\nSad or Rabid Puppy nominee, much less supporter, is racist, misogynistic, or homophobic, much less a Fascist, a neo-Nazi or a Nazi. I have repeatedly denied all of those charges myself and no one has ever been able to prove otherwise because they are all false. Whereas, to the best of my knowledge, Mr. Delaney has never once denied having had sex with a minor as an adult… and gay sex with minors, both voluntary and involuntary, is a frequent feature of his books. Among various and sundry other unpleasantries.\nWe know, beyond any shadow of a doubt, that many Puppy Kickers have direct personal ties to “Chip” Delaney, to convicted child molester and SFWA member Ed Kramer, and to the late child molester, Marion Zimmer Bradley, whose estate is listed in the SFWA directory. And they were not, they are not, the only child molesters in science fiction.\nListening to these criminal sex deviants and psychological train wrecks whine for months about what terrible people the Puppies are to steal their awards is surreal. It’s going to be amusing to see how they react when the media attention they have so assiduously courted starts looking in their direction and begins finding the many child-sized skeletons in their closets.",
  "tags": [
    "freakshow",
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-13T22:26:00+00:00"
}