{
  "url": "https://voxday.net/2015/08/05/nazis-nazis-everywhere/",
  "scraped_at": "2025-12-17T17:21:54.060942",
  "title": "Nazis, Nazis everywhere!",
  "date_display": "August 5, 2015",
  "date_iso": "2015-08-05T16:54:00+00:00",
  "date_from_url": "2015-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJWs are extending their thought-policing <a href=\"http://sarahwendell.tumblr.com/post/125859299894/letter-to-the-rwa-board-regarding-for-such-a-time\">from SF to romance</a>:<br/></p><blockquote><p> <i>For Such a Time</i> by Kate Breslin is an inspirational historical romance between a Nazi concentration camp commander and a Jewish prisoner. It was nominated by the Romance Writers of America for Best First Book and Best Inspirational Romance in 2014. It won neither category, but the book’s presence as a nominee has upset a growing number of people.<br> At Smart Bitches, Trashy Books, we undertake a community review project to try to give every RITA_nominated book a review before the awards are announced. The review for this book was written by a guest reviewer named Rachel, and it is extraordinarily good in my opinion.<br> Rose Lerner and her BFF have compiled a collection of the 5-star reviews for this book, as well.<br> After the RITA awards, which were held on July 25, 2014, I wrote a letter to the Board of Directors of Romance Writers of America to explain (or try to explain) why this book’s nominations were so offensive and upsetting. I sent this letter via email and received a response from the president of RWA. But in the conversations I’ve had online over the last few weeks, I’ve suggested people let the board know about their feelings as well.</br></br></br></p></blockquote><p>You vill not read vat ve do not VANT you to read. Make no mistake, the SJWs are thought police and they have NO problem declaring that a book is unmeritorious on the basis of its content.</p></div>",
  "content_text": "The SJWs are extending their thought-policing\nfrom SF to romance\n:\nFor Such a Time\nby Kate Breslin is an inspirational historical romance between a Nazi concentration camp commander and a Jewish prisoner. It was nominated by the Romance Writers of America for Best First Book and Best Inspirational Romance in 2014. It won neither category, but the book’s presence as a nominee has upset a growing number of people.\nAt Smart Bitches, Trashy Books, we undertake a community review project to try to give every RITA_nominated book a review before the awards are announced. The review for this book was written by a guest reviewer named Rachel, and it is extraordinarily good in my opinion.\nRose Lerner and her BFF have compiled a collection of the 5-star reviews for this book, as well.\nAfter the RITA awards, which were held on July 25, 2014, I wrote a letter to the Board of Directors of Romance Writers of America to explain (or try to explain) why this book’s nominations were so offensive and upsetting. I sent this letter via email and received a response from the president of RWA. But in the conversations I’ve had online over the last few weeks, I’ve suggested people let the board know about their feelings as well.\nYou vill not read vat ve do not VANT you to read. Make no mistake, the SJWs are thought police and they have NO problem declaring that a book is unmeritorious on the basis of its content.",
  "tags": [
    "books",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-05T15:54:00+00:00"
}