{
  "url": "https://voxday.net/2015/08/30/no-one-ever-cared/",
  "scraped_at": "2025-12-17T17:24:51.850506",
  "title": "No one ever cared",
  "date_display": "August 30, 2015",
  "date_iso": "2015-08-30T14:00:00+00:00",
  "date_from_url": "2015-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unwitting testimonial evidence concerning Chapter Seven: What to do when SJWs attack <a href=\"http://accordingtohoyt.com/2015/08/29/ive-been-to-the-desert-on-a-horse-with-no-name/#comment-302201\">at Sarah Hoyt’s place</a>.</p><blockquote class=\"tr_bq\"><p> I can’t walk away anymore. I can’t stay on the sidelines anymore and pretend it doesn’t affect me.</p><p>Two reasons. First, thanks largely to you, Larry, Mad Mike, and Brad Torgersen, I’ve rediscovered great science fiction (mostly Baen authors, admittedly), and despite my best efforts, I seem to be turning into a science fiction author as well. I don’t want the Kickers to destroy the genre that I’m once again growing to love and am slowly becoming a part of</p><p>Second, and the main reason, is that I saw what the SJWs and CHORFs ad TruFans did to you and the rest of the Puppies. I was horrified and disgusted by their actions, but not in the least surprised. Because I’ve been there. It’s too long a story to post here, but back in college I found myself caught in the crosshairs of those so-called Right Thinking Moral Crusaders. I had my academic career, and very possibly my entire future put in jeopardy becausea small screaming minority of foaming at the mouth CHORFs took offense at something that was published in the student-run newspaper, of which I was one of the copy editors.</p><p>Nobody came to our defense. A few brave souls tried, only to abandon us when the Administration made clear that they would suffer the same extreme academic penalties that we were facing(read: loss of credits, possible suspension or expulsion) for doing so. The only reason they didn’t follow through with their threatened punishments was because the school’s lawyers pointed out that such actions would leave them wide open to a slew of bad publicity and – worse – a myriad of lawsuits.</p><p>I can’t do that. I can’t stand by and do nothing while the SJWs and CHORFs try to do the same thing to you.</p><p>What I’m trying to say is that I am with you. Through Sad Puppies 4<br> until the end, no matter how long that may be, I am with you. Come hell,<br> come high water, come an avalanche of sh*t flung by the Social Justice<br> Monkeys, I am with you, and I will do whatever I can to help the<br> puppies, though admittedly given my present situation that probably<br> won’t be much more than moral support and acting as a repeater on social<br> media. But win or lose, I’m with The Sad Puppies until the bitter end.</br></br></br></br></br></br></p></blockquote><p>From Chapter 7: <i>1. Rely on the Three Rs: RECOGNIZE it is happening. REMAIN calm. REALIZE no one cares.</i></p><p>This indifference on the part of bystanders is one reason why the SJWs have methodically proceeded from one victory to the next despite their relatively small numbers. They take out one Narrative skeptic and silence 100 others who henceforth fear to express doubt, let alone denial, of the most shameless falsehoods. The reason that Roosh, Mike, Milo and me, to name four, enrage them so greatly is that they have been unable to discredit us despite their best efforts, and as a result, ever so slowly, dozens, scores, hundreds, now THOUSANDS of people are beginning to understand what has been taking place and why our society is where it is.</p><p>And they are not happy.</p><p>I’m not saying you should care about the SJW war on truth and Western civilization because then you will be a good person. I’m not saying you should stand up the SJWs because it is a moral imperative. I’m saying you should care and you should stand up to the SJWs in your own naked self-interest and in the interest of salvaging and maintaining as much of Western civilization as possible.</p><p>Do you think either the Bolsheviks or the Russian people they conquered had any idea that the Impossibility of Socialist Calculation was going to leave them condemned to poverty and economic stagnation? If not, then it should be possible for you to understand that neither the SJWs nor the average individual who sees no harm in them realizes that the Impossibility of Social Justice Convergence renders the SJWs a serious threat to the survival of Western civilization.</p><p>All of this stuff, from the universities to the churches to science fiction to games are the same evil, dyscivic, and dyscivilizational campaign. No aspect of it, however seemingly trivial, should be ignored.</p></div>",
  "content_text": "Unwitting testimonial evidence concerning Chapter Seven: What to do when SJWs attack\nat Sarah Hoyt’s place\n.\nI can’t walk away anymore. I can’t stay on the sidelines anymore and pretend it doesn’t affect me.\nTwo reasons. First, thanks largely to you, Larry, Mad Mike, and Brad Torgersen, I’ve rediscovered great science fiction (mostly Baen authors, admittedly), and despite my best efforts, I seem to be turning into a science fiction author as well. I don’t want the Kickers to destroy the genre that I’m once again growing to love and am slowly becoming a part of\nSecond, and the main reason, is that I saw what the SJWs and CHORFs ad TruFans did to you and the rest of the Puppies. I was horrified and disgusted by their actions, but not in the least surprised. Because I’ve been there. It’s too long a story to post here, but back in college I found myself caught in the crosshairs of those so-called Right Thinking Moral Crusaders. I had my academic career, and very possibly my entire future put in jeopardy becausea small screaming minority of foaming at the mouth CHORFs took offense at something that was published in the student-run newspaper, of which I was one of the copy editors.\nNobody came to our defense. A few brave souls tried, only to abandon us when the Administration made clear that they would suffer the same extreme academic penalties that we were facing(read: loss of credits, possible suspension or expulsion) for doing so. The only reason they didn’t follow through with their threatened punishments was because the school’s lawyers pointed out that such actions would leave them wide open to a slew of bad publicity and – worse – a myriad of lawsuits.\nI can’t do that. I can’t stand by and do nothing while the SJWs and CHORFs try to do the same thing to you.\nWhat I’m trying to say is that I am with you. Through Sad Puppies 4\nuntil the end, no matter how long that may be, I am with you. Come hell,\ncome high water, come an avalanche of sh*t flung by the Social Justice\nMonkeys, I am with you, and I will do whatever I can to help the\npuppies, though admittedly given my present situation that probably\nwon’t be much more than moral support and acting as a repeater on social\nmedia. But win or lose, I’m with The Sad Puppies until the bitter end.\nFrom Chapter 7:\n1. Rely on the Three Rs: RECOGNIZE it is happening. REMAIN calm. REALIZE no one cares.\nThis indifference on the part of bystanders is one reason why the SJWs have methodically proceeded from one victory to the next despite their relatively small numbers. They take out one Narrative skeptic and silence 100 others who henceforth fear to express doubt, let alone denial, of the most shameless falsehoods. The reason that Roosh, Mike, Milo and me, to name four, enrage them so greatly is that they have been unable to discredit us despite their best efforts, and as a result, ever so slowly, dozens, scores, hundreds, now THOUSANDS of people are beginning to understand what has been taking place and why our society is where it is.\nAnd they are not happy.\nI’m not saying you should care about the SJW war on truth and Western civilization because then you will be a good person. I’m not saying you should stand up the SJWs because it is a moral imperative. I’m saying you should care and you should stand up to the SJWs in your own naked self-interest and in the interest of salvaging and maintaining as much of Western civilization as possible.\nDo you think either the Bolsheviks or the Russian people they conquered had any idea that the Impossibility of Socialist Calculation was going to leave them condemned to poverty and economic stagnation? If not, then it should be possible for you to understand that neither the SJWs nor the average individual who sees no harm in them realizes that the Impossibility of Social Justice Convergence renders the SJWs a serious threat to the survival of Western civilization.\nAll of this stuff, from the universities to the churches to science fiction to games are the same evil, dyscivic, and dyscivilizational campaign. No aspect of it, however seemingly trivial, should be ignored.",
  "tags": [
    "decline and fall",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-30T13:00:00+00:00"
}