{
  "url": "https://voxday.net/2015/08/28/over-targe-2/",
  "scraped_at": "2025-12-17T17:24:38.987316",
  "title": "Directly over the target",
  "date_display": "August 28, 2015",
  "date_iso": "2015-08-28T12:06:00+00:00",
  "date_from_url": "2015-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We know SJW posteriors are burning like Dresden after Plate Rack passed overhead because their antics in response to the release of <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i><b>SJWs Always Lie</b></i></a> are off-the-charts crazy. There are, of course, the expected fake reviews, whose authors somehow seem to think that by illustrating the premise of the book in living color, they will somehow discredit it.</p><blockquote class=\"tr_bq\"><p> <b>Waaah! Nobody likes me!</b><br> By Paul Spencer on August 27, 2015<br> A pitiful rant by an intellectual weakling with a persecution complex. The literary equivalent of stealing a five year old’s favorite toy.<br> 16 of 63 people found the review helpful</br></br></br></p><p><b>One of the most loathsome people currently writing</b><br> By Alex on August 27, 2015<br> The author of this book has stated that the Taliban’s attempts to silence women’s education activist Malala Yousafzai was “perfectly rational and scientifically justifiable” – […] What more is there to say?<br> 17 of 58 people found the review helpful</br></br></br></p><p><b>One Star</b><br> By Kindly Sodoff “peripatetic”on August 27, 2015<br> An unintentionally amusing account of how a pudgy, angry, little boy grows up into a pudgy, angry, little man.<br> 32 of 129 people found the following review helpful</br></br></br></p><p><b>One Star</b><br> By Trouble O’Hara “iagorune”on August 27, 2015<br> Adorable whining from a guy with a hardon about losing at the Hugo’s<br> 37 of 152 people found the review helpful</br></br></br></p><p><b>He is the only person to be kicked out of the Science Fiction and Fantasy Writers of America in its nearly fifty year history.</b><br> By C. Buser on August 27, 2015<br> … as a fleshed-out rehashing of his blogspot posts, previous commentary and opinion stated by the author about his personal political philosophy serve as valid advertisement as to whether or not an impartial Amazon shopper would be interested in this product, and a review of his previous statements and blogspot posts serve as a review of this book, which is repackaged and expanded for your convenience for the cover charge.</br></br></p><p>The book itself is named after one of his “Three Laws of Social Justice Warriors”, a reference to Asimov’s Three Laws of Robotics:</p><p>#1 – SJWs always lie.<br> #2 – SJWs always double down.<br> #3 – SJWs always project.</br></br></p><p>Thus, if you like his blogspot, and the previous examples of his political philosophy, and admire him for his expulsion from the SFWA, then this is something you would enjoy reading. If you disagree with his three laws, you wouldn’t enjoy this book.<br> 56 of 188 people found the review helpful</br></p></blockquote><p>I’m not sure which I find more astonishing, the fact that a few SJWs actually took the time to post these “reviews”, the observation that nearly 60 SJWs showed up to pretend that they were helpful, or the idea that I got the idea for the three laws from <i>Asimov</i>. At least the latter does tend to explain why they prefer fantasy to SF. But what definitely takes the cake is Rainbow Brite Boy publishing a brief parody entitled<a href=\"http://www.amazon.com/Scalzi-Popular-Author-Myself-Quite-ebook/dp/B014JSBP7A\"><i> John Scalzi Is Not A Very Popular Author And I Myself Am Quite Popular: How SJWs Always Lie About Our Comparative Popularity Levels</i></a>, which has now reached #2 in Political Philosophy, right behind the book it is attempting to DISQUALIFY. And wait, there’s more! The SJWs are also engaged in a charity drive so that John Scalzi will read it for the audio version.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://2.bp.blogspot.com/-vUHSYfcY2vo/VeBObcA69rI/AAAAAAAABc4/JsApmRTc74U/s1600/SJW_parody.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"312\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/08/SJW_parody.jpg\" width=\"320\"/></a></div><p> As you can see, this is a masterful rhetorical response that totally proves the falsity of the Second Law of SJW: <i>SJWs Always Double Down</i>.</p><p>One of my friends sent me an email last night that I think aptly describes the situation. “WTF, are you PAYING these people or something?” And just to ice the crazy cake, we’ve now officially gone meta as there are now fake fake reviews being posted.</p><p>And while I’m not surprised by the nature of the reaction of the science fiction SJWs to the book, I am amazed by the vehemence behind it. They are absolutely <i>furious </i>to see that a book unmasking them was not only published by me, but is riding the very wave of media attention that they themselves created to success. That’s the importance of the parody in their minds; if it can become <i>even more popular</i> than <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i><b>SJWs Always Lie</b></i></a>, that will disqualify it and render it harmless, thereby relieving the stress they are presently feeling. As I said back in 2013, these people are cargo cultists; the concept of the way in which they have volunteered to serve as my de facto publicists doesn’t even cross their twisted little minds. Their priority is to wave the totem that will allow them to strike a superior pose and thereby make the feelbads go away.</p><blockquote class=\"tr_bq\"><p> <b>Totally Legit Review</b><br> ByEssJayDouble U “OppressedTumblrette”on August 27, 2015</br></p><p>I was told by my echo chamber to come post a nasty review here. I also have lots of time seeing as my job is being an internet activist. As you can tell I actually haven’t read this book but it was written by a white man. The era of the white man is over. It’s time for them to shut up and move over so that the muffled voices of their victims can speak up.</p><p>Now here comes the part where I’m suppose to tell you about the writer (which may or may not be true, but you better listen and believe what I say as a victim of this white man’s world) and why this should be reason enough not to buy the book even though me telling you about the writer gives you no actual details about the book and why it isn’t worth the purchase. Instead it’s me telling you why we must dismiss this horrible person all based upon his identity.</p><p>For starters he’s white. White men have oppressed us minorities for long enough. Secondly, I hear that this guy likes Chinese food. That’s offensive and oppressive to the Chinese. Those smart people can’t speak up for themselves so I’m doing it for them! I also hear that his wife loves wearing kimonos. Talk about being offensive and oppressive to the Japanese. And his son… My gosh I hear that his son calls ISIS a terrorist group. Looks like he’s daddy’s little islamophoic boy. Racist boy. And his daughter. Oh his daughter says she doesn’t need feminism. The poor thing must have internalized misogyny. How dare a woman claim not to need feminism. All women are feminists!</p><p>And then there’s that Milo guy. I hear he works for some right wing turd of a media outlet. RIGHT WING! I’ve also seen Milo going around proudly saying that he gives Donald Trump positive coverage all in exchange for strands of Trump’s own hair that he then uses as hair extensions. Did I mention RIGHT WING!</p><p>Do you really want to support horrible racist, oppressive right wingers? Instead take you 5 bucks and donate to one of the awesome women that these men have help to harass. By buying this book another poor oppressed child dies over in oppression land.</p><p>Oh did I mention that my reasons may or may not be true? Just listen and believe or a poor oppressed women of color will die over in oppression land.</p><p>Trust me, after reading this book it isn’t worth the money.</p></blockquote></div>",
  "content_text": "We know SJW posteriors are burning like Dresden after Plate Rack passed overhead because their antics in response to the release of\nSJWs Always Lie\nare off-the-charts crazy. There are, of course, the expected fake reviews, whose authors somehow seem to think that by illustrating the premise of the book in living color, they will somehow discredit it.\nWaaah! Nobody likes me!\nBy Paul Spencer on August 27, 2015\nA pitiful rant by an intellectual weakling with a persecution complex. The literary equivalent of stealing a five year old’s favorite toy.\n16 of 63 people found the review helpful\nOne of the most loathsome people currently writing\nBy Alex on August 27, 2015\nThe author of this book has stated that the Taliban’s attempts to silence women’s education activist Malala Yousafzai was “perfectly rational and scientifically justifiable” – […] What more is there to say?\n17 of 58 people found the review helpful\nOne Star\nBy Kindly Sodoff “peripatetic”on August 27, 2015\nAn unintentionally amusing account of how a pudgy, angry, little boy grows up into a pudgy, angry, little man.\n32 of 129 people found the following review helpful\nOne Star\nBy Trouble O’Hara “iagorune”on August 27, 2015\nAdorable whining from a guy with a hardon about losing at the Hugo’s\n37 of 152 people found the review helpful\nHe is the only person to be kicked out of the Science Fiction and Fantasy Writers of America in its nearly fifty year history.\nBy C. Buser on August 27, 2015\n… as a fleshed-out rehashing of his blogspot posts, previous commentary and opinion stated by the author about his personal political philosophy serve as valid advertisement as to whether or not an impartial Amazon shopper would be interested in this product, and a review of his previous statements and blogspot posts serve as a review of this book, which is repackaged and expanded for your convenience for the cover charge.\nThe book itself is named after one of his “Three Laws of Social Justice Warriors”, a reference to Asimov’s Three Laws of Robotics:\n#1 – SJWs always lie.\n#2 – SJWs always double down.\n#3 – SJWs always project.\nThus, if you like his blogspot, and the previous examples of his political philosophy, and admire him for his expulsion from the SFWA, then this is something you would enjoy reading. If you disagree with his three laws, you wouldn’t enjoy this book.\n56 of 188 people found the review helpful\nI’m not sure which I find more astonishing, the fact that a few SJWs actually took the time to post these “reviews”, the observation that nearly 60 SJWs showed up to pretend that they were helpful, or the idea that I got the idea for the three laws from\nAsimov\n. At least the latter does tend to explain why they prefer fantasy to SF. But what definitely takes the cake is Rainbow Brite Boy publishing a brief parody entitled\nJohn Scalzi Is Not A Very Popular Author And I Myself Am Quite Popular: How SJWs Always Lie About Our Comparative Popularity Levels\n, which has now reached #2 in Political Philosophy, right behind the book it is attempting to DISQUALIFY. And wait, there’s more! The SJWs are also engaged in a charity drive so that John Scalzi will read it for the audio version.\nAs you can see, this is a masterful rhetorical response that totally proves the falsity of the Second Law of SJW:\nSJWs Always Double Down\n.\nOne of my friends sent me an email last night that I think aptly describes the situation. “WTF, are you PAYING these people or something?” And just to ice the crazy cake, we’ve now officially gone meta as there are now fake fake reviews being posted.\nAnd while I’m not surprised by the nature of the reaction of the science fiction SJWs to the book, I am amazed by the vehemence behind it. They are absolutely\nfurious\nto see that a book unmasking them was not only published by me, but is riding the very wave of media attention that they themselves created to success. That’s the importance of the parody in their minds; if it can become\neven more popular\nthan\nSJWs Always Lie\n, that will disqualify it and render it harmless, thereby relieving the stress they are presently feeling. As I said back in 2013, these people are cargo cultists; the concept of the way in which they have volunteered to serve as my de facto publicists doesn’t even cross their twisted little minds. Their priority is to wave the totem that will allow them to strike a superior pose and thereby make the feelbads go away.\nTotally Legit Review\nByEssJayDouble U “OppressedTumblrette”on August 27, 2015\nI was told by my echo chamber to come post a nasty review here. I also have lots of time seeing as my job is being an internet activist. As you can tell I actually haven’t read this book but it was written by a white man. The era of the white man is over. It’s time for them to shut up and move over so that the muffled voices of their victims can speak up.\nNow here comes the part where I’m suppose to tell you about the writer (which may or may not be true, but you better listen and believe what I say as a victim of this white man’s world) and why this should be reason enough not to buy the book even though me telling you about the writer gives you no actual details about the book and why it isn’t worth the purchase. Instead it’s me telling you why we must dismiss this horrible person all based upon his identity.\nFor starters he’s white. White men have oppressed us minorities for long enough. Secondly, I hear that this guy likes Chinese food. That’s offensive and oppressive to the Chinese. Those smart people can’t speak up for themselves so I’m doing it for them! I also hear that his wife loves wearing kimonos. Talk about being offensive and oppressive to the Japanese. And his son… My gosh I hear that his son calls ISIS a terrorist group. Looks like he’s daddy’s little islamophoic boy. Racist boy. And his daughter. Oh his daughter says she doesn’t need feminism. The poor thing must have internalized misogyny. How dare a woman claim not to need feminism. All women are feminists!\nAnd then there’s that Milo guy. I hear he works for some right wing turd of a media outlet. RIGHT WING! I’ve also seen Milo going around proudly saying that he gives Donald Trump positive coverage all in exchange for strands of Trump’s own hair that he then uses as hair extensions. Did I mention RIGHT WING!\nDo you really want to support horrible racist, oppressive right wingers? Instead take you 5 bucks and donate to one of the awesome women that these men have help to harass. By buying this book another poor oppressed child dies over in oppression land.\nOh did I mention that my reasons may or may not be true? Just listen and believe or a poor oppressed women of color will die over in oppression land.\nTrust me, after reading this book it isn’t worth the money.",
  "tags": [
    "Book Review",
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-28T11:06:00+00:00"
}