{
  "url": "https://voxday.net/2015/08/20/race-is-in-politics-of-beholder/",
  "scraped_at": "2025-12-17T17:23:40.423374",
  "title": "Race is in the politics of the beholder",
  "date_display": "August 20, 2015",
  "date_iso": "2015-08-20T12:00:00+00:00",
  "date_from_url": "2015-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This makes for a fascinating juxstaposition. One of the nastiest SJWs at File 770 is actually dumb enough to try to play race police:</p><blockquote class=\"tr_bq\"><p> Aaron on <a href=\"http://file770.com/?p=24477&amp;cpage=1#comment-321650\">August 19, 2015 at 5:48 pm</a> said:<br> Also the comment that the Pups are led by “a latino, a white, and an indian”. They keep pushing that line of bullshit like they think it will convince anyone outside their little circle-jerk.</br></p></blockquote><p>I have to admit, it’s a line of argument I’d never considered. If I was Aaron, I would simply explain to critics that my “half-savage” remark about N.K. Jemisin could not possibly be considered racist because she is not black.</p><p>I have asked Mike Glyer to warn Aaron about his race-policing lies because “that line of bullshit” happens to be absolutely true. I am without question an American Indian. I have the family tree<i>, </i>the DNA results, and the tribal connections to prove it beyond any shadow of a doubt. I am not a one-sixteenth Cherokee princess, as the New Republic’s Jeet Heer and others have suggested.</p><p>Larry Correia is Portuguese, concerning which <i>“Brazilians, who do not speak Spanish, are Latinos, but<br> Portuguese who share the Iberian Peninsula with Spain may not want to be<br> called “Latino” or “Hispanic.” And the U.S. Department of Labor also<br> allows people to self-designate as a Hispanic, if they are Portuguese,<br> and it cannot be contested.” </br></br></br></br></i><br> <i><br/></i><br> So, our racial affiliations are being denied by self-appointed race police even as another fake African-American SJW <a href=\"http://www.breitbart.com/big-journalism/2015/08/19/international-media-go-nuts-over-shaun-kings-race-scandal/\">has been unmasked</a>, this time by Milo.</br></br></p><blockquote class=\"tr_bq\"><p> International media went nuts today when Breitbart revealed evidence suggesting that <a href=\"http://www.breitbart.com/big-government/2015/08/19/did-black-lives-matter-organiser-shaun-king-mislead-oprah-winfrey-by-pretending-to-be-biracial/\">prominent Black Lives Matter activist Shaun King is in fact white</a> — and that, when challenged, King did nothing to deny the allegations that he is Caucasian.</p><p>Over a hundred media outlets from all over the world, including the Daily Mail, the Daily Beast, the New York Daily News, Salon, Sky News and the New York Post, covered our explosive scoop, which also alleged that King misled media mogul Oprah Winfrey by applying for and accepting an “Oprah scholarship” to historically black Morehouse College.</p></blockquote><p>My favorite response is the ridiculous defense offered by vox.com, which is that <a href=\"http://www.vox.com/2015/8/19/9180389/the-shaun-king-controversy-explained\">race “isn’t derived by biology”</a>:</p><blockquote class=\"tr_bq\"><p> A person’s race isn’t derived by biology; it is instead set by society and a person’s own identity. As Jenée Desmond-Harris previously explained for Vox, Americans embraced the concept of race to justify treating some people better than others. And since race is arbitrary, different people can genuinely disagree over who counts as white, black, brown, or any other racial identity…. Although race may have no biological basis, social perceptions of race play a huge role in people’s lives — and could impact King’s place in the Black Lives Matter movement.</p></blockquote><p>Remember, SJWs not only think they’re morally superior to you, but they’re smarter and better-educated too. In fact, they’re delusional and operating in complete defiance of history, science and observable reality.</p><p>UPDATE: <a href=\"http://www.mediaite.com/tv/family-member-confirms-to-cnn-that-blacklivesmatter-activist-shaun-king-is-white/\">There goes the SJW Narrative</a>. Again:</p><blockquote class=\"tr_bq\"><p> Shaun KingDuring a segment on #BlackLivesMatters activist Shaun King and the allegation he isn’t black at all, CNN host Don Lemon revealed that he had spoken to a family member of King’s who confirmed he was white. “A family member tells CNN that both of King’s parents are white,”Lemon said on Wednesday night’s edition of CNN </p></blockquote><p>Go ahead and talk to my family members about whether I’m Indian and Mexican. Hell, you won’t even have to talk to them. </p></div>",
  "content_text": "This makes for a fascinating juxstaposition. One of the nastiest SJWs at File 770 is actually dumb enough to try to play race police:\nAaron on\nAugust 19, 2015 at 5:48 pm\nsaid:\nAlso the comment that the Pups are led by “a latino, a white, and an indian”. They keep pushing that line of bullshit like they think it will convince anyone outside their little circle-jerk.\nI have to admit, it’s a line of argument I’d never considered. If I was Aaron, I would simply explain to critics that my “half-savage” remark about N.K. Jemisin could not possibly be considered racist because she is not black.\nI have asked Mike Glyer to warn Aaron about his race-policing lies because “that line of bullshit” happens to be absolutely true. I am without question an American Indian. I have the family tree\n,\nthe DNA results, and the tribal connections to prove it beyond any shadow of a doubt. I am not a one-sixteenth Cherokee princess, as the New Republic’s Jeet Heer and others have suggested.\nLarry Correia is Portuguese, concerning which\n“Brazilians, who do not speak Spanish, are Latinos, but\nPortuguese who share the Iberian Peninsula with Spain may not want to be\ncalled “Latino” or “Hispanic.” And the U.S. Department of Labor also\nallows people to self-designate as a Hispanic, if they are Portuguese,\nand it cannot be contested.”\nSo, our racial affiliations are being denied by self-appointed race police even as another fake African-American SJW\nhas been unmasked\n, this time by Milo.\nInternational media went nuts today when Breitbart revealed evidence suggesting that\nprominent Black Lives Matter activist Shaun King is in fact white\n— and that, when challenged, King did nothing to deny the allegations that he is Caucasian.\nOver a hundred media outlets from all over the world, including the Daily Mail, the Daily Beast, the New York Daily News, Salon, Sky News and the New York Post, covered our explosive scoop, which also alleged that King misled media mogul Oprah Winfrey by applying for and accepting an “Oprah scholarship” to historically black Morehouse College.\nMy favorite response is the ridiculous defense offered by vox.com, which is that\nrace “isn’t derived by biology”\n:\nA person’s race isn’t derived by biology; it is instead set by society and a person’s own identity. As Jenée Desmond-Harris previously explained for Vox, Americans embraced the concept of race to justify treating some people better than others. And since race is arbitrary, different people can genuinely disagree over who counts as white, black, brown, or any other racial identity…. Although race may have no biological basis, social perceptions of race play a huge role in people’s lives — and could impact King’s place in the Black Lives Matter movement.\nRemember, SJWs not only think they’re morally superior to you, but they’re smarter and better-educated too. In fact, they’re delusional and operating in complete defiance of history, science and observable reality.\nUPDATE:\nThere goes the SJW Narrative\n. Again:\nShaun KingDuring a segment on #BlackLivesMatters activist Shaun King and the allegation he isn’t black at all, CNN host Don Lemon revealed that he had spoken to a family member of King’s who confirmed he was white. “A family member tells CNN that both of King’s parents are white,”Lemon said on Wednesday night’s edition of CNN\nGo ahead and talk to my family members about whether I’m Indian and Mexican. Hell, you won’t even have to talk to them.",
  "tags": [
    "media",
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-20T11:00:00+00:00"
}