{
  "url": "https://voxday.net/2015/08/10/romancegate/",
  "scraped_at": "2025-12-17T17:22:25.538680",
  "title": "RomanceGate",
  "date_display": "August 10, 2015",
  "date_iso": "2015-08-10T05:30:00+00:00",
  "date_from_url": "2015-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hardly a surprise to learn that the SJWs are <a href=\"http://mmc-news.com/news-the-bizarre-nazi-love-story-tearing-the-romance-lit-world-apart-85157.dbv\">attempting to thought-police the romance genre</a> as well as games, comics, and science fiction:</p><blockquote class=\"tr_bq\"><blockquote class=\"tr_bq\"><p> The Nazi romance novel For Such a Time, by bookseller-turned-author Kate Breslin, drew little attention outside of a small but passionate romance literature community when it was published in the spring of 2014.</p><p>Now, after being nominated for two major prizes at the Romance Writers of America’s annual conference in late July, the book’s Holocaust-set themes of Christian salvation are tearing the romance world apart—and roiling Gamergaters rushing to its defense….</p><p>The group took interest after outspoken science fiction writer and game designer Vox Day shared Wendell’s post on his blog. In an interview with Newsweek, Day—whose blog has previously compared feminists to Nazis—described Wendell as an “SJW” (code for “Social Justice Warrior”) and argued that “political correctness” is a “major problem” in the United States.</p><p>“It’s another example of SJW’s attempting to thought-police a particular industry or genre,” Day says of the Breslin outrage. He compares it to the scuffle over the 2015 Hugo Awards, while others have likened it to the #WeNeedDiverseBooks campaign that fought to diversify children’s literature.</p><p>“Obviously a lot of people liked the book, because they nominated it,” Day adds. “What they’re trying to do is disqualify all those people’s opinions because they disagree with them. It’s something that the SJWs are getting more and more blatant about, and I think people are getting more and more tired of their attempts to impose political correctness and impose thought-policing on everyone else. Donald Trump’s not having any of it, and I’m certainly not either.”</p><p>Day’s followers took the bait. Wendell was distressed to learn from a friend that his post had drawn dozens of comments, some denigrating her and mocking her blog by calling it “Cat-Lady Central.” One commenter went so far as to write that “as long as the SJWs support Moloch Worship (aka Planned Parenthood) that traffics in baby parts, they have no right to criticize the Nazis.”</p><p>Day says that abusive treatment is par for the course. “I have absolutely no concern for [Wendell]’s feelings about people speaking rudely about her. She is trying to thought-police people; she deserves every bit of criticism she gets.”</p></blockquote></blockquote><p>Much to my surprise, Newsweek actually soft-pedaled it a bit. They could have mentioned that I have compared feminists to Nazis… to the detriment of the feminists. I believe the exact quote is: “calling a feminist a feminazi is an insult to the German National Socialist Worker’s Party.”</p><p>Anyhow, what we’re seeing here is the SJWs attempts to utilize the power of the press to marginalize and discredit me backfiring on them. It was their running to every media outlet from <i>The Guardian</i> to the <i>New Zealand Herald</i>, from <i>NPR </i>to <i>Entertainment Weekly</i> that brought me to the attention of other media outlets that are not simply pushing their libel campaign, including publications such as <i>Newsweek</i>.</p><p>It is a little ironic, of course, that I have been interviewed half as many times by national publications concerning a story in which I am not at all involved as I have been about either of the actual stories in which I am directly involved, #GamerGate or Sad Puppies. But that simply demonstrates the utter corruption and ineptitude of the SJW-infested media. One must not speak to anyone who might disrupt the Narrative, after all.</p><p>Read the whole thing. Notice how simply calling the SJWs out puts them immediately on the defensive. They don’t like to be called thought police because that is exactly what they are. In every conflict, someone will end up advancing and someone will end up retreating. Shoot down their assertions as briefly as possible, then go right after them. Whenever you’re faced with an SJW, call them out for thought policing. Call them out for speech policing. Or call them out for the sheer absurdity of their statements.</p><p>For example, the next person to respond to one of Wendell’s attacks should hammer her for saying that “redeeming Nazis through the power of Christian salvation sounds like a bad idea.”  She doesn’t think Nazis should be redeemed, so what does she think, they should be <i>encouraged</i>?</p><p>The funny thing is that every time I read the word Wendell, <a href=\"http://www.milobookclub.com/2015/01/26/stop-ensaddening/\">our noble spokesmanatee</a> kept coming to mind. It made the whole experience that much more enjoyably surreal. <i>Meeewhooooo Hoooon! </i>And the reaction of the SJW twitterati is even funnier.<br> <i><br/></i><br> Megan Broderick ‏@megbrod12<br> I’m SO CONFUSED as to why Newsweek quoted vox day in that article. He literally has nothing to do with it at all?? #journalism I guess.</br></br></br></p><p>Lenore Tolcser ‏@LenoreTolcser<br> Oh. My. God. People need to stop giving Vox Day attention! It legitimizes him. NO. BAD.<i></i><br> <i><br/></i><br> Michele Mills ‏@mills_michele<br> I just checked with my 14 yo son – <br> “You’re not following a man named Vox Day on the internet, are you?” <br> “No!” <br> “Good. Don’t…Ever.”<i><br/></i></br></br></br></br></br></br></br></p></div>",
  "content_text": "It’s hardly a surprise to learn that the SJWs are\nattempting to thought-police the romance genre\nas well as games, comics, and science fiction:\nThe Nazi romance novel For Such a Time, by bookseller-turned-author Kate Breslin, drew little attention outside of a small but passionate romance literature community when it was published in the spring of 2014.\nNow, after being nominated for two major prizes at the Romance Writers of America’s annual conference in late July, the book’s Holocaust-set themes of Christian salvation are tearing the romance world apart—and roiling Gamergaters rushing to its defense….\nThe group took interest after outspoken science fiction writer and game designer Vox Day shared Wendell’s post on his blog. In an interview with Newsweek, Day—whose blog has previously compared feminists to Nazis—described Wendell as an “SJW” (code for “Social Justice Warrior”) and argued that “political correctness” is a “major problem” in the United States.\n“It’s another example of SJW’s attempting to thought-police a particular industry or genre,” Day says of the Breslin outrage. He compares it to the scuffle over the 2015 Hugo Awards, while others have likened it to the #WeNeedDiverseBooks campaign that fought to diversify children’s literature.\n“Obviously a lot of people liked the book, because they nominated it,” Day adds. “What they’re trying to do is disqualify all those people’s opinions because they disagree with them. It’s something that the SJWs are getting more and more blatant about, and I think people are getting more and more tired of their attempts to impose political correctness and impose thought-policing on everyone else. Donald Trump’s not having any of it, and I’m certainly not either.”\nDay’s followers took the bait. Wendell was distressed to learn from a friend that his post had drawn dozens of comments, some denigrating her and mocking her blog by calling it “Cat-Lady Central.” One commenter went so far as to write that “as long as the SJWs support Moloch Worship (aka Planned Parenthood) that traffics in baby parts, they have no right to criticize the Nazis.”\nDay says that abusive treatment is par for the course. “I have absolutely no concern for [Wendell]’s feelings about people speaking rudely about her. She is trying to thought-police people; she deserves every bit of criticism she gets.”\nMuch to my surprise, Newsweek actually soft-pedaled it a bit. They could have mentioned that I have compared feminists to Nazis… to the detriment of the feminists. I believe the exact quote is: “calling a feminist a feminazi is an insult to the German National Socialist Worker’s Party.”\nAnyhow, what we’re seeing here is the SJWs attempts to utilize the power of the press to marginalize and discredit me backfiring on them. It was their running to every media outlet from\nThe Guardian\nto the\nNew Zealand Herald\n, from\nNPR\nto\nEntertainment Weekly\nthat brought me to the attention of other media outlets that are not simply pushing their libel campaign, including publications such as\nNewsweek\n.\nIt is a little ironic, of course, that I have been interviewed half as many times by national publications concerning a story in which I am not at all involved as I have been about either of the actual stories in which I am directly involved, #GamerGate or Sad Puppies. But that simply demonstrates the utter corruption and ineptitude of the SJW-infested media. One must not speak to anyone who might disrupt the Narrative, after all.\nRead the whole thing. Notice how simply calling the SJWs out puts them immediately on the defensive. They don’t like to be called thought police because that is exactly what they are. In every conflict, someone will end up advancing and someone will end up retreating. Shoot down their assertions as briefly as possible, then go right after them. Whenever you’re faced with an SJW, call them out for thought policing. Call them out for speech policing. Or call them out for the sheer absurdity of their statements.\nFor example, the next person to respond to one of Wendell’s attacks should hammer her for saying that “redeeming Nazis through the power of Christian salvation sounds like a bad idea.”  She doesn’t think Nazis should be redeemed, so what does she think, they should be\nencouraged\n?\nThe funny thing is that every time I read the word Wendell,\nour noble spokesmanatee\nkept coming to mind. It made the whole experience that much more enjoyably surreal.\nMeeewhooooo Hoooon!\nAnd the reaction of the SJW twitterati is even funnier.\nMegan Broderick ‏@megbrod12\nI’m SO CONFUSED as to why Newsweek quoted vox day in that article. He literally has nothing to do with it at all?? #journalism I guess.\nLenore Tolcser ‏@LenoreTolcser\nOh. My. God. People need to stop giving Vox Day attention! It legitimizes him. NO. BAD.\nMichele Mills ‏@mills_michele\nI just checked with my 14 yo son –\n“You’re not following a man named Vox Day on the internet, are you?”\n“No!”\n“Good. Don’t…Ever.”",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-10T04:30:00+00:00"
}