{
  "url": "https://voxday.net/2015/08/18/sic-semper-sjw/",
  "scraped_at": "2025-12-17T17:23:27.309946",
  "title": "Sic semper SJW",
  "date_display": "August 18, 2015",
  "date_iso": "2015-08-18T16:00:00+00:00",
  "date_from_url": "2015-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wonder how many more SJWs will need to directly experience <a href=\"http://www.washingtonpost.com/local/crime/victim-in-metro-slaying-stabbed-repeatedly-during-robbery-on-train/2015/07/07/8dd09132-249b-11e5-b72c-2b7d516e1e0e_story.html\">the full consequences of Equality, Diversity, Tolerance, and Progress</a> before they finally come to their senses and abandon their mindless, unquestioning faith in the mirage of social justice:</p><blockquote class=\"tr_bq\"><p> A former congressional intern killed aboard a Metro train in Washington, D.C. on Independence Day was repeatedly punched and stabbed during a struggle with his attacker, witnesses told police, according to documents made public Tuesday.</p><p>Jasper Spires, 18, is charged with killing 24-year-old train passenger Kevin Joseph Sutherland.</p><p>According to CBS D.C., Sutherland was a recent graduate of American University and previously interned for Connecticut Congressman Jim Himes on Capitol Hill.</p><p>Spires appeared in court Tuesday and was ordered held in jail until at least his next court date on July 17.</p><p>Court documents say one witness saw Spires attempt to take something from Sutherland’s waist area and that they struggled over the item before Sutherland was punched and stabbed in his chest, back, sides and arms. The witness says Spires threw Sutherland’s cellphone at him as he lay bleeding on the train car’s floor.</p></blockquote><p><strike>Now, we don’t know for certain that Mr. Sutherland was an SJW, but the evidence points that way since</strike> The Democratic congressman for whom he interned certainly is one, as was Sutherland himself.</p><p><i>Civil Liberties and Civil Rights<br>In 2009-2010 the Human Rights Campaign gave Himes a rating of 100% due to his stance on human rights and liberties. This rating also extends to his position on sexual orientation and gender identity.</br></i><br> <i><br>Immigration<br>In 2009-2010 the American Immigration Lawyers Association gave Himes a rating of 100% due to his stance on the defense of immigrants in the U.S.</br></br></i></br></p><p>I’m sure you’ll be surprised to learn that Congressman Himes <a href=\"http://www.ontheissues.org/House/Jim_Himes.htm\">supports gun control</a>. Some might think this murder was a tragedy. It wasn’t, any more than it is when some lunatic decides to jump into a tiger’s cage. Only it was even more stupid.</p></div>",
  "content_text": "I wonder how many more SJWs will need to directly experience\nthe full consequences of Equality, Diversity, Tolerance, and Progress\nbefore they finally come to their senses and abandon their mindless, unquestioning faith in the mirage of social justice:\nA former congressional intern killed aboard a Metro train in Washington, D.C. on Independence Day was repeatedly punched and stabbed during a struggle with his attacker, witnesses told police, according to documents made public Tuesday.\nJasper Spires, 18, is charged with killing 24-year-old train passenger Kevin Joseph Sutherland.\nAccording to CBS D.C., Sutherland was a recent graduate of American University and previously interned for Connecticut Congressman Jim Himes on Capitol Hill.\nSpires appeared in court Tuesday and was ordered held in jail until at least his next court date on July 17.\nCourt documents say one witness saw Spires attempt to take something from Sutherland’s waist area and that they struggled over the item before Sutherland was punched and stabbed in his chest, back, sides and arms. The witness says Spires threw Sutherland’s cellphone at him as he lay bleeding on the train car’s floor.\nNow, we don’t know for certain that Mr. Sutherland was an SJW, but the evidence points that way since\nThe Democratic congressman for whom he interned certainly is one, as was Sutherland himself.\nCivil Liberties and Civil Rights\nIn 2009-2010 the Human Rights Campaign gave Himes a rating of 100% due to his stance on human rights and liberties. This rating also extends to his position on sexual orientation and gender identity.\nImmigration\nIn 2009-2010 the American Immigration Lawyers Association gave Himes a rating of 100% due to his stance on the defense of immigrants in the U.S.\nI’m sure you’ll be surprised to learn that Congressman Himes\nsupports gun control\n. Some might think this murder was a tragedy. It wasn’t, any more than it is when some lunatic decides to jump into a tiger’s cage. Only it was even more stupid.",
  "tags": [
    "SJW",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-18T15:00:00+00:00"
}