{
  "url": "https://voxday.net/2015/08/26/stick-to-rape-rape-fat-boy/",
  "scraped_at": "2025-12-17T17:24:22.582286",
  "title": "Stick to the rape rape, fat boy",
  "date_display": "August 26, 2015",
  "date_iso": "2015-08-26T09:11:00+00:00",
  "date_from_url": "2015-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Rape Rape Martin tries to put <a href=\"http://grrm.livejournal.com/439207.html\">a little SJW spin</a> on the Hugo Awards:</p><blockquote class=\"tr_bq\"><p> I had picked Mike Resnick in Short Form and Toni Weisskopf in Long Form, and indeed, each of them finished above all the other nominees in the first round of voting… but well behind No Award. This was a crushing defeat for the slates, and a big victory for the Puppy-Free ballot of Deirdre Moen. Honestly? I hated this. In my judgment the voters threw the babies out with bathwater in these two categories. Long Form had three nominees who are more than worthy of a Hugo (and one, Jim Minz, who will be in a few more years), and Short Form had some good candidates too. They were on the slates, yes, but some of them were put on there without their knowledge and consent. A victory by Resnick, Sowards, Gilbert, or Weisskopf would have done credit to the rocket, regardless of how they got on the ballot. (All four of these editors would almost certainly have been nominated anyway, even if there had been no slates).</p><p>((Some are saying that voting No Award over these editors was an insult to them. Maybe so, I can’t argue with that. But it should be added that there was a far far worse insult in putting them on the ballot with Vox Day, who was the fifth nominee in both categories. Even putting aside his bigotry and racism, Beale’s credential as an editor are laughable. Yet hundreds of Puppies chose to nominate him rather than, oh, Liz Gorinsky or Anne Lesley Groell or Beth Meacham (in Long Form) or Gardner Dozois or Ellen Datlow or John Joseph Adams (in Short Form). To pass over actual working editors of considerable accomplishment in order to nominate someone purely to ‘stick it to the SJWs’ strikes me as proof positive that the Rabid Puppies at least were more interested in saying ‘fuck you’ to fandom than in rewarding good work)).</p></blockquote><p>It’s amusing how the SJWs in science fiction are claiming five awardless categories as a win while simultaneously trying to figure out how to prevent it from happening again next year. And, Martin demonstrates the truth of the observation <i>SJWs Always Lie</i>, as he tells a whopper about Toni Weisskopf when he claims she would “almost certainly have been nominated anyway, even if there had been no slates”.</p><p>The fact is Toni Weisskopf never even came CLOSE to being nominated prior to Sad Puppies 1. In 2012, she finished in 14th place. In 2011, 10th. In 2010, 11th. She wasn’t even trending in the right direction! Without the Puppies, she would never, ever, have received a nomination and the data shows that the 2015 Long Form nominees would have been virtually identical to the pre-Puppy years, including the aforementioned Liz Gorinsky, Beth Meacham, to say nothing of the Torlock who lobbied for the creation the award so he and his fellow Tor editors could finally win something, Patrick Nielsen Hayden.</p><p>And it’s fascinating to hear this <i>particular </i>fat old white man speaking about the “bigotry and racism” of this <i>particular </i>American Indian. A few of you will know why. In any event, my <i>credentials </i>as an editor – the correct word is plural, Georgie, perhaps someone can explain that to you – are observably better than Rape Rape’s editor, considering how fat with filler his recent novels have become.</p><p>But here is a free piece of editorial advice for you, Rape Rape. I know you like it an awful lot, but even so, I recommend you include a little less rape and deviant hate sex in your next book and a little more conventional human affection between men and women who actually love one another. The world you have created is not grim and realistic, it is a cartoonish and nihilistic nightmare. And worse, it’s gotten really boring.</p><p>Martin is also lying about there not being any anti-Puppy party. <a href=\"https://chaoshorizon.wordpress.com/2015/08/25/2015-hugo-analysis-best-novel/\">As Chaos Horizon has demonstrated</a>, there were observably six different statistical factions voting in the 2015 awards.</p><blockquote class=\"tr_bq\"><p> Core Rabid Puppies: 550-525<br> Core Sad Puppies: 500-400<br> Sad Puppy leaning Neutrals: 800-400 (capable of voting a Puppy pick #1)<br> True Neutrals: 1000-600 (may have voted one or two Puppies; didn’t vote in all categories; No Awarded all picks, Puppy and Non-Alike)<br> Primarily No Awarders But Considered a Puppy Pick above No Award: 1000<br> Absolute No Awarders: 2500</br></br></br></br></br></p></blockquote><p>2,500 Absolute No Awarders, up from 600 in 2013. They exist, Rape Rape. Unlike you, statistics don’t lie. We know who the SJWs are. The maximum number of principled “No Slate” voters was 285; that’s how many people voted No Award over <i>Guardians of the Galaxy</i> compared to the 2496 who voted No Award over Toni Weisskopf, the 2350 who voted No Award over Kirk Douponce, and the 2672 who suddenly decided that 38-time nominee and 5-time winner Mike Resnick was no longer worthy.</p><p>The post-awards spin that the 2,500 SJWs in science fiction voted No Award on the basis of unmerited nominees simply doesn’t hold up to either statistical analysis or a comparison with past Hugo winners.</p></div>",
  "content_text": "George Rape Rape Martin tries to put\na little SJW spin\non the Hugo Awards:\nI had picked Mike Resnick in Short Form and Toni Weisskopf in Long Form, and indeed, each of them finished above all the other nominees in the first round of voting… but well behind No Award. This was a crushing defeat for the slates, and a big victory for the Puppy-Free ballot of Deirdre Moen. Honestly? I hated this. In my judgment the voters threw the babies out with bathwater in these two categories. Long Form had three nominees who are more than worthy of a Hugo (and one, Jim Minz, who will be in a few more years), and Short Form had some good candidates too. They were on the slates, yes, but some of them were put on there without their knowledge and consent. A victory by Resnick, Sowards, Gilbert, or Weisskopf would have done credit to the rocket, regardless of how they got on the ballot. (All four of these editors would almost certainly have been nominated anyway, even if there had been no slates).\n((Some are saying that voting No Award over these editors was an insult to them. Maybe so, I can’t argue with that. But it should be added that there was a far far worse insult in putting them on the ballot with Vox Day, who was the fifth nominee in both categories. Even putting aside his bigotry and racism, Beale’s credential as an editor are laughable. Yet hundreds of Puppies chose to nominate him rather than, oh, Liz Gorinsky or Anne Lesley Groell or Beth Meacham (in Long Form) or Gardner Dozois or Ellen Datlow or John Joseph Adams (in Short Form). To pass over actual working editors of considerable accomplishment in order to nominate someone purely to ‘stick it to the SJWs’ strikes me as proof positive that the Rabid Puppies at least were more interested in saying ‘fuck you’ to fandom than in rewarding good work)).\nIt’s amusing how the SJWs in science fiction are claiming five awardless categories as a win while simultaneously trying to figure out how to prevent it from happening again next year. And, Martin demonstrates the truth of the observation\nSJWs Always Lie\n, as he tells a whopper about Toni Weisskopf when he claims she would “almost certainly have been nominated anyway, even if there had been no slates”.\nThe fact is Toni Weisskopf never even came CLOSE to being nominated prior to Sad Puppies 1. In 2012, she finished in 14th place. In 2011, 10th. In 2010, 11th. She wasn’t even trending in the right direction! Without the Puppies, she would never, ever, have received a nomination and the data shows that the 2015 Long Form nominees would have been virtually identical to the pre-Puppy years, including the aforementioned Liz Gorinsky, Beth Meacham, to say nothing of the Torlock who lobbied for the creation the award so he and his fellow Tor editors could finally win something, Patrick Nielsen Hayden.\nAnd it’s fascinating to hear this\nparticular\nfat old white man speaking about the “bigotry and racism” of this\nparticular\nAmerican Indian. A few of you will know why. In any event, my\ncredentials\nas an editor – the correct word is plural, Georgie, perhaps someone can explain that to you – are observably better than Rape Rape’s editor, considering how fat with filler his recent novels have become.\nBut here is a free piece of editorial advice for you, Rape Rape. I know you like it an awful lot, but even so, I recommend you include a little less rape and deviant hate sex in your next book and a little more conventional human affection between men and women who actually love one another. The world you have created is not grim and realistic, it is a cartoonish and nihilistic nightmare. And worse, it’s gotten really boring.\nMartin is also lying about there not being any anti-Puppy party.\nAs Chaos Horizon has demonstrated\n, there were observably six different statistical factions voting in the 2015 awards.\nCore Rabid Puppies: 550-525\nCore Sad Puppies: 500-400\nSad Puppy leaning Neutrals: 800-400 (capable of voting a Puppy pick #1)\nTrue Neutrals: 1000-600 (may have voted one or two Puppies; didn’t vote in all categories; No Awarded all picks, Puppy and Non-Alike)\nPrimarily No Awarders But Considered a Puppy Pick above No Award: 1000\nAbsolute No Awarders: 2500\n2,500 Absolute No Awarders, up from 600 in 2013. They exist, Rape Rape. Unlike you, statistics don’t lie. We know who the SJWs are. The maximum number of principled “No Slate” voters was 285; that’s how many people voted No Award over\nGuardians of the Galaxy\ncompared to the 2496 who voted No Award over Toni Weisskopf, the 2350 who voted No Award over Kirk Douponce, and the 2672 who suddenly decided that 38-time nominee and 5-time winner Mike Resnick was no longer worthy.\nThe post-awards spin that the 2,500 SJWs in science fiction voted No Award on the basis of unmerited nominees simply doesn’t hold up to either statistical analysis or a comparison with past Hugo winners.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-26T08:11:00+00:00"
}