{
  "url": "https://voxday.net/2015/08/24/the-archmorlocks-curse/",
  "scraped_at": "2025-12-17T17:24:09.593708",
  "title": "The Archmorlock’s curse",
  "date_display": "August 24, 2015",
  "date_iso": "2015-08-24T08:53:00+00:00",
  "date_from_url": "2015-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright explains why <a href=\"http://www.scifiwright.com/2015/08/in-memoriam-of-the-hugo-awards/\">he will not write books for Tor</a> in the future:</p><blockquote class=\"tr_bq\"><p> I am sad to report that I was mistaken. The Archmorlock himself displayed his courage against the short and girlish figure of my meek and gentle wife.</p><p>At the reception just before the Awards Ceremony itself, my lovely and talented wife, who writes for Tor books under her maiden name of L Jagi Lamplighter, and who had been consistently a voice of reason and moderation during the whole silly kerfluffle, approached Mr. Patrick Nielsen Hayden at the party to extent to him the olive branch of peace and reconciliation.</p><p>Before she could finish her sentence, however, Mr. Hayden erupted into a swearing and cursing, and he shouted and bellowed at the tiny and cheerful woman I married.</p><p>I should mention that during the last few months of the Sad Puppies kerfluffle, I once upon a time accurately described him, Mr. Moshe Feder, and Mrs Irene Gallo of Tor Books as ‘Christ Haters.’ The support of abortion, sodomy, and euthanasia rather unambiguously put a soul into the position of open rebellion against Christian teachings. In addition, any man who bears false witness against his neighbor, delights in poison-tongued gossip, and destroys writing careers of anyone who does not support his politics not only disobeys Christ, but violates the ordinary decency of ordinary men of good will of any faith.</p><p>It seems that Mr. Hayden is a Roman Catholic and was so deeply moved to offense by my words that he could not retain a levelheaded and professional demeanor while speaking with my short little wife. He shouted filthy words at her and stormed off. I do not know if there were tears in his eyes.</p><p>Before I continue, I should explain to the reader that Mr. Hayden, and no one else, was the driving force behind the corruption of the Hugo Awards in these last fifteen to twenty years.</p></blockquote><p>One thing that Mr. Wright neglected to add: the only reason that the Best Hugo Editor (Long Form) category that was denied to Baen’s Toni Weisskopf even exists was so that Mr. Nielsen Hayden could finally win an award after years of whining about his inability to beat Gardner Dozois for Best Professional Editor. Chris M. Barkley claims sole responsibility for the addition of a new category, but even he admits that Patrick Nielsen Hayden <a href=\"http://file770.com/?p=24450\">was his co-conspirator</a>, publicly campaigned for the new award, and was the chief driving force behind the creation of the new category as well as the <i>completely coincidental</i> first winner of it.</p><blockquote class=\"tr_bq\"><p> I sought out Patrick Nielsen Hayden’s support for the Editor’s split and brought him into the fold; I needed a prominent editor to co-sponsor the amendment or it would never have been taken seriously by the Business Meeting. He was reluctant to do so at first but eventually, he concluded that a split of the category was the best option available at the time. Until I finally shook his hand at the LACon IV Business Meeting in 2006, I think he had doubts that it would ever pass. And, the very next year, it was he who was the recipient of the very first Long Form Editor Hugo Award. Was this a coincidence? Yes; Patrick Nielsen Hayden did not conspire to win his Hugo Award, he EARNED it from the voters for his superlative work.</p></blockquote><p>Seriously, the man worked to create a new Hugo award just so he could win one. Here is PNH himself in 2006 whining about how he and David Hartwell of Tor <a href=\"https://archive.is/DzUDZ\">never ever get to win a Hugo</a>:</p><blockquote class=\"tr_bq\"><p> In a post to his own weblog, Scalzi expresses regret that I personally didn’t make the “Best Professional Editor” ballot, despite the fact that I acquired three out of the five Best Novel nominees and personally shepherded two of them to publication. This is generous of John, and I wouldn’t have declined the nomination, but in fact as every book editor in our field knows, while the Best Professional Hugo is regularly awarded to high-profile magazine editors and anthologists, it only goes to book editors if we die. It’s for this reason that there’s a pending proposal to split the editorial award into “long form” and “short form” categories; whether this will be ratified by this year’s Worldcon Business Meeting is anyone’s guess. Personally, I note that David Hartwell has been a finalist for Best Professional Editor 15 times, leaving aside his 17 further nominations for the New York Review of Science Fiction, and that he’s never won a Hugo of any kind. Pretty shabby treatment for an individual who is by any measure one of the best and most influential editors in the eighty-year history of our field. Whether or not the World SF Convention decides to reform the editor award, it’s years past time one went to Hartwell.  </p></blockquote><p>The Best Tor Books Editor award was duly created, and the awards went to:<br> Patrick Nielsen Hayden, David Hartwell, David Hartwell, and Patrick<br> Nielsen Hayden for the first four years before before Hartwell talked PNH into turning down their nominations so Lou Anders of Pyr could have a chance to win. Hartwell, a gentlemanly individual who is John C. Wright’s editor at Tor, continued to decline nominations, but PNH has eagerly continued throwing his hat in the ring and likely would have won the award again this year if the Puppies had not prevented him from being nominated a 16th time.</br></br></p><p>And that is why he was shouting and swearing at Tor author L. Jagi Lamplighter. Patrick Nielsen Hayden is a vain, pompous little freak who is furious that his influence over science fiction has been broken and he’s not even being nominated for his own personal award. Here is his very professional comment after the ceremony.</p><p>#18 ::: Patrick Nielsen Hayden ::: (view all by) ::: August 23, 2015, 02:55 AM:<br> <i>I’ll have more to say later. Right now TNH and I are at GRRM’s Hugo Loser Party and all I have to say is, my, that is some tasty, tasty schadenfreude pie.  </i></br></p></div>",
  "content_text": "John C. Wright explains why\nhe will not write books for Tor\nin the future:\nI am sad to report that I was mistaken. The Archmorlock himself displayed his courage against the short and girlish figure of my meek and gentle wife.\nAt the reception just before the Awards Ceremony itself, my lovely and talented wife, who writes for Tor books under her maiden name of L Jagi Lamplighter, and who had been consistently a voice of reason and moderation during the whole silly kerfluffle, approached Mr. Patrick Nielsen Hayden at the party to extent to him the olive branch of peace and reconciliation.\nBefore she could finish her sentence, however, Mr. Hayden erupted into a swearing and cursing, and he shouted and bellowed at the tiny and cheerful woman I married.\nI should mention that during the last few months of the Sad Puppies kerfluffle, I once upon a time accurately described him, Mr. Moshe Feder, and Mrs Irene Gallo of Tor Books as ‘Christ Haters.’ The support of abortion, sodomy, and euthanasia rather unambiguously put a soul into the position of open rebellion against Christian teachings. In addition, any man who bears false witness against his neighbor, delights in poison-tongued gossip, and destroys writing careers of anyone who does not support his politics not only disobeys Christ, but violates the ordinary decency of ordinary men of good will of any faith.\nIt seems that Mr. Hayden is a Roman Catholic and was so deeply moved to offense by my words that he could not retain a levelheaded and professional demeanor while speaking with my short little wife. He shouted filthy words at her and stormed off. I do not know if there were tears in his eyes.\nBefore I continue, I should explain to the reader that Mr. Hayden, and no one else, was the driving force behind the corruption of the Hugo Awards in these last fifteen to twenty years.\nOne thing that Mr. Wright neglected to add: the only reason that the Best Hugo Editor (Long Form) category that was denied to Baen’s Toni Weisskopf even exists was so that Mr. Nielsen Hayden could finally win an award after years of whining about his inability to beat Gardner Dozois for Best Professional Editor. Chris M. Barkley claims sole responsibility for the addition of a new category, but even he admits that Patrick Nielsen Hayden\nwas his co-conspirator\n, publicly campaigned for the new award, and was the chief driving force behind the creation of the new category as well as the\ncompletely coincidental\nfirst winner of it.\nI sought out Patrick Nielsen Hayden’s support for the Editor’s split and brought him into the fold; I needed a prominent editor to co-sponsor the amendment or it would never have been taken seriously by the Business Meeting. He was reluctant to do so at first but eventually, he concluded that a split of the category was the best option available at the time. Until I finally shook his hand at the LACon IV Business Meeting in 2006, I think he had doubts that it would ever pass. And, the very next year, it was he who was the recipient of the very first Long Form Editor Hugo Award. Was this a coincidence? Yes; Patrick Nielsen Hayden did not conspire to win his Hugo Award, he EARNED it from the voters for his superlative work.\nSeriously, the man worked to create a new Hugo award just so he could win one. Here is PNH himself in 2006 whining about how he and David Hartwell of Tor\nnever ever get to win a Hugo\n:\nIn a post to his own weblog, Scalzi expresses regret that I personally didn’t make the “Best Professional Editor” ballot, despite the fact that I acquired three out of the five Best Novel nominees and personally shepherded two of them to publication. This is generous of John, and I wouldn’t have declined the nomination, but in fact as every book editor in our field knows, while the Best Professional Hugo is regularly awarded to high-profile magazine editors and anthologists, it only goes to book editors if we die. It’s for this reason that there’s a pending proposal to split the editorial award into “long form” and “short form” categories; whether this will be ratified by this year’s Worldcon Business Meeting is anyone’s guess. Personally, I note that David Hartwell has been a finalist for Best Professional Editor 15 times, leaving aside his 17 further nominations for the New York Review of Science Fiction, and that he’s never won a Hugo of any kind. Pretty shabby treatment for an individual who is by any measure one of the best and most influential editors in the eighty-year history of our field. Whether or not the World SF Convention decides to reform the editor award, it’s years past time one went to Hartwell.\nThe Best Tor Books Editor award was duly created, and the awards went to:\nPatrick Nielsen Hayden, David Hartwell, David Hartwell, and Patrick\nNielsen Hayden for the first four years before before Hartwell talked PNH into turning down their nominations so Lou Anders of Pyr could have a chance to win. Hartwell, a gentlemanly individual who is John C. Wright’s editor at Tor, continued to decline nominations, but PNH has eagerly continued throwing his hat in the ring and likely would have won the award again this year if the Puppies had not prevented him from being nominated a 16th time.\nAnd that is why he was shouting and swearing at Tor author L. Jagi Lamplighter. Patrick Nielsen Hayden is a vain, pompous little freak who is furious that his influence over science fiction has been broken and he’s not even being nominated for his own personal award. Here is his very professional comment after the ceremony.\n#18 ::: Patrick Nielsen Hayden ::: (view all by) ::: August 23, 2015, 02:55 AM:\nI’ll have more to say later. Right now TNH and I are at GRRM’s Hugo Loser Party and all I have to say is, my, that is some tasty, tasty schadenfreude pie.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-24T07:53:00+00:00"
}