{
  "url": "https://voxday.net/2015/08/26/the-trademark-family-incompetence/",
  "scraped_at": "2025-12-17T17:24:24.430958",
  "title": "The trademark family incompetence",
  "date_display": "August 26, 2015",
  "date_iso": "2015-08-26T12:56:00+00:00",
  "date_from_url": "2015-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are two ways to look at<a href=\"http://www.nytimes.com/2015/08/26/opinion/jeb-bush-visita-la-frontera.html?_r=0\"> this column by the entire NYT editorial board</a>. Either the New York Times really fears the Democratic Party candidate running against Jeb Bush, or he was simply so horrendous at his staged appearance at a Mexican restaurant that they actually had to address the facts for once:</p><blockquote class=\"tr_bq\"><p> Jeb Bush went to the border town of McAllen, Tex., on Monday to raise money and to talk about immigration, in English and fluent Spanish. Because the Republican presidential campaign has been so fixated on border security and the immigrant peril — thank you, Donald Trump — it was a chance to see how the supposed expert on this fraught subject handled it.</p><p>Short version: He was awful.</p><p>In less than 15 minutes, Mr. Bush managed to step on his message, to give Mr. Trump a boost and to offend Asian-Americans, a growing population that is every bit as important as Latinos in winning presidential elections. And he failed to give Latino voters any persuasive evidence that he had anything better to offer them than his opponents in a revoltingly xenophobic Republican campaign.</p><p>It may be time to offer this forlorn candidate some free advice. Although if he really is the smarter Bush, he knows these things already:</p><p>1. He should never let himself say the words “anchor babies” ever again. He got in trouble for using that derogatory reference to the children of unauthorized immigrants in passing, in an interview, then dug himself a hole by defending his use of it. On Monday, he dug deeper. He tried to explain that he had been talking about “Asian people” who arrive on tourist visas through organized schemes to give birth to American babies on American soil.</p><p>Though the phenomenon is real, Mr. Bush was blasted by Asian-American groups for repeating the slur. And, astoundingly, he handed Mr. Trump the opportunity to send out tweets like this: “In a clumsy move to get out of his ‘anchor babies’ dilemma, where he signed that he would not use the term and now uses it, he blamed ASIANS.”</p></blockquote><p>Speaking as a great-grandson of a Mexican revolutionary, Jeb Bush’s positions on immigration aren’t merely wrong, they are obscenely stupid. Trump is going to <i>crucify </i>him on this issue; the imbalance here could actually win Trump the nomination despite all of Bush’s structural advantages.</p></div>",
  "content_text": "There are two ways to look at\nthis column by the entire NYT editorial board\n. Either the New York Times really fears the Democratic Party candidate running against Jeb Bush, or he was simply so horrendous at his staged appearance at a Mexican restaurant that they actually had to address the facts for once:\nJeb Bush went to the border town of McAllen, Tex., on Monday to raise money and to talk about immigration, in English and fluent Spanish. Because the Republican presidential campaign has been so fixated on border security and the immigrant peril — thank you, Donald Trump — it was a chance to see how the supposed expert on this fraught subject handled it.\nShort version: He was awful.\nIn less than 15 minutes, Mr. Bush managed to step on his message, to give Mr. Trump a boost and to offend Asian-Americans, a growing population that is every bit as important as Latinos in winning presidential elections. And he failed to give Latino voters any persuasive evidence that he had anything better to offer them than his opponents in a revoltingly xenophobic Republican campaign.\nIt may be time to offer this forlorn candidate some free advice. Although if he really is the smarter Bush, he knows these things already:\n1. He should never let himself say the words “anchor babies” ever again. He got in trouble for using that derogatory reference to the children of unauthorized immigrants in passing, in an interview, then dug himself a hole by defending his use of it. On Monday, he dug deeper. He tried to explain that he had been talking about “Asian people” who arrive on tourist visas through organized schemes to give birth to American babies on American soil.\nThough the phenomenon is real, Mr. Bush was blasted by Asian-American groups for repeating the slur. And, astoundingly, he handed Mr. Trump the opportunity to send out tweets like this: “In a clumsy move to get out of his ‘anchor babies’ dilemma, where he signed that he would not use the term and now uses it, he blamed ASIANS.”\nSpeaking as a great-grandson of a Mexican revolutionary, Jeb Bush’s positions on immigration aren’t merely wrong, they are obscenely stupid. Trump is going to\ncrucify\nhim on this issue; the imbalance here could actually win Trump the nomination despite all of Bush’s structural advantages.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-26T11:56:00+00:00"
}