{
  "url": "https://voxday.net/2015/08/28/the-adjective-modifies-noun/",
  "scraped_at": "2025-12-17T17:24:40.817806",
  "title": "The adjective modifies the noun",
  "date_display": "August 28, 2015",
  "date_iso": "2015-08-28T16:00:00+00:00",
  "date_from_url": "2015-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wonder if all those people who were going on and on about how I hated and didn’t understand science are going to come back and apologize now that my skepticism about scientistry is being supported by <a href=\"http://www.nytimes.com/2015/08/28/science/many-social-science-findings-not-as-strong-as-claimed-study-says.html?_r=0\">dozens of failed attempts to confirm previously published studies</a>? I don’t think I’ll hold my breath.</p><blockquote class=\"tr_bq\"><p> The past several years have been bruising ones for the credibility of the social sciences. A star social psychologist was caught fabricating data, leading to more than 50 retracted papers. A top journal published a study supporting the existence of ESP that was widely criticized. The journal Science pulled a political science paper on the effect of gay canvassers on voters’ behavior because of concerns about faked data.</p><p>Now, a painstaking yearslong effort to reproduce 100 studies published in three leading psychology journals has found that more than half of the findings did not hold up when retested. The analysis was done by research psychologists, many of whom volunteered their time to double-check what they considered important work. Their conclusions, reported Thursday in the journal Science, have confirmed the worst fears of scientists who have long worried that the field needed a strong correction.</p><p>The vetted studies were considered part of the core knowledge by which scientists understand the dynamics of personality, relationships, learning and memory. Therapists and educators rely on such findings to help guide decisions, and the fact that so many of the studies were called into question could sow doubt in the scientific underpinnings of their work.</p><p>“I think we knew or suspected that the literature had problems, but to see it so clearly, on such a large scale — it’s unprecedented,” said Jelte Wicherts, an associate professor in the department of methodology and statistics at Tilburg University in the Netherlands.</p><p>More than 60 of the studies did not hold up. Among them was one on free will. It found that participants who read a passage arguing that their behavior is predetermined were more likely than those who had not read the passage to cheat on a subsequent test.</p></blockquote><p>Most “social science” is not science at all. It’s nothing more than science-flavored fiction concocted by people who look and talk like scientists, but are merely mimics.</p><p>Now, my dear critic, are you still <i>entirely </i>comfortable with your decision to dismiss out of hand my various other controversial statements about science? Are you still certain that your <i>feelings </i>trump my logical conclusions?</p></div>",
  "content_text": "I wonder if all those people who were going on and on about how I hated and didn’t understand science are going to come back and apologize now that my skepticism about scientistry is being supported by\ndozens of failed attempts to confirm previously published studies\n? I don’t think I’ll hold my breath.\nThe past several years have been bruising ones for the credibility of the social sciences. A star social psychologist was caught fabricating data, leading to more than 50 retracted papers. A top journal published a study supporting the existence of ESP that was widely criticized. The journal Science pulled a political science paper on the effect of gay canvassers on voters’ behavior because of concerns about faked data.\nNow, a painstaking yearslong effort to reproduce 100 studies published in three leading psychology journals has found that more than half of the findings did not hold up when retested. The analysis was done by research psychologists, many of whom volunteered their time to double-check what they considered important work. Their conclusions, reported Thursday in the journal Science, have confirmed the worst fears of scientists who have long worried that the field needed a strong correction.\nThe vetted studies were considered part of the core knowledge by which scientists understand the dynamics of personality, relationships, learning and memory. Therapists and educators rely on such findings to help guide decisions, and the fact that so many of the studies were called into question could sow doubt in the scientific underpinnings of their work.\n“I think we knew or suspected that the literature had problems, but to see it so clearly, on such a large scale — it’s unprecedented,” said Jelte Wicherts, an associate professor in the department of methodology and statistics at Tilburg University in the Netherlands.\nMore than 60 of the studies did not hold up. Among them was one on free will. It found that participants who read a passage arguing that their behavior is predetermined were more likely than those who had not read the passage to cheat on a subsequent test.\nMost “social science” is not science at all. It’s nothing more than science-flavored fiction concocted by people who look and talk like scientists, but are merely mimics.\nNow, my dear critic, are you still\nentirely\ncomfortable with your decision to dismiss out of hand my various other controversial statements about science? Are you still certain that your\nfeelings\ntrump my logical conclusions?",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-28T15:00:00+00:00"
}