{
  "url": "https://voxday.net/2015/08/31/the-sour-grapes-of-mensa/",
  "scraped_at": "2025-12-17T17:24:55.512568",
  "title": "The sour grapes of Mensa",
  "date_display": "August 31, 2015",
  "date_iso": "2015-08-31T08:33:00+00:00",
  "date_from_url": "2015-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Aesopean analogy doesn’t quite work, though, given that foxes are a symbol of intelligence. And it’s just so <i>hard </i>to maintain the pretense that you’re the smartest guy in the room when you didn’t even qualify for the high-IQ society with the lowest bar to membership. It doesn’t take a, well, a Mensa member, to figure out why Mensa is <a href=\"https://archive.is/C0bJ1\">such a sore spot for McRapey</a>.</p><blockquote class=\"tr_bq\"><p> <i>    Pro tip: Bragging about your Mensa card as an actual adult signals that while you may be “smart,” you almost certainly are not wise.</i><br>     — John Scalzi (@scalzi) August 31, 2015</br></p><p>In the various recent kerfuffles surrounding science fiction and its awards, there have been a couple of people (and their spouses, declaiming about their beloved) who have been slapping down Mensa cards as proof that they (or their spouse) are smart. Let me just say this about that:</p><p>Oh, my sweet summer children. Just don’t.</p><p>If you want to be in Mensa, that’s fine. Everyone needs hobbies and associations, and if this is the direction you want to go with yours, then you do you. Not my flavor, but then, lots of hobbies and associations aren’t my flavor.</p><p>That said:</p><p>1. Literally no one outside of Mensa gives a shit about your Mensa card. No one is impressed that you belong to an organization that has among its membership people who believe that because they can ace a test, they are therefore broadly intellectually superior to everyone else.</p><p>2. Your Mensa membership does not imply or suggest that you are the smartest person in the room. Leaving aside the point that the intelligence that Mensa values is a narrow and specialized sort, a large number of people who can join Mensa, don’t, for various reasons, including the idea that belonging to a group that glories in its supposed intellectual superiority is more than vaguely obnoxious.</p><p>3. Your need to bring up the fact you have a Mensa card suggests nothing other than it’s really really really important to you for people to know you’re smart, and that you believe external accreditation of this supposed top-tier intelligence is more persuasive than, say, the establishment of your intelligence through your actions, demeanor, or personality. Which is to say: It shows you’re insecure.</p><p>4. Your Mensa card does not mean you know how to argue. Your Mensa card does not mean you do not make errors or lapses in judgment. Your Mensa card is not a “get out of jail free” card when someone pokes holes in your thesis. Your Mensa card does not mean that you can’t be racist or sexist or otherwise bigoted. You may not say “I have a Mensa card, therefore my logic is irrefutable.” Your Mensa card will not save you from Dunning-Kruger syndrome, and if you think it will, then you are exactly who the Dunning-Kruger syndrome was meant to describe. You Mensa card will not keep you from being called out for acting stupidly, or doing stupid things.</p></blockquote><p>See, you’re not supposed to brag about your Mensa-qualifying IQ and having one doesn’t mean you know how to argue. What you’re supposed to do is brag about your <i>BACHELOR’S DEGREE in Philosophy of Language from the University of Chicago</i>, which institution we are reliably informed does <i>not </i>hand them out like gumballs, and appeal to the authority of that degree whenever someone happens to observe your incompetence at constructing syllogisms and formulating sound arguments. Which, as it happens, is practically every single time McRapey attempts to construct an actual argument rather than simply posturing about his assertions.</p><p>As I noted <a href=\"http://www.milobookclub.com/2013/12/11/mcrapey-on-rhetoric/\">back in 2013</a>, McRapey hasn’t changed what passes for his debating technique since at least 2005.</p><ul></ul><ol><li>Make an obviously questionable assertion.</li><li> When the assertion is questioned, appeal to bachelor’s degree.</li><li>When the appeal to the bachelor’s degree is questioned, question the questioner’s intellect and/or good will.</li><li>Avoid further questions.</li><li>Posture as if one has thoroughly proved one’s point.</li></ol><ul></ul><p>He even went so far as to claim that I had never bested him in any argument. <i>“As for besting me in argument, well, no, not at any point I can remember.”</i></p><p>SJWs always lie.</p><p>Sure you don’t remember, Johnny. Read <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i><b>SJWs Always Lie</b></i></a>, Amazon’s #1 bestseller in Political Philosophy. It will serve to refresh your memory in brutal and well-documented detail, and it even contains a chapter devoted to rhetoric that you will find educational.</p><p>Speaking of Dunning-Kruger, McRapey is a walking, talking example of the syndrome in action, particularly when it comes to rhetoric. For all that he majored in something that could be considered akin to it if you squint hard enough, <a href=\"http://www.milobookclub.com/2013/08/20/ensnaring-sophists/\">he clearly doesn’t know the first thing about it</a>. The rhetorical device to which he habitually resorts is a sophistical and dialectically illegitimate one called “ambiguity”, not that he could correctly identify or name it despite his famous bachelor’s degree. But then, as we know, we shouldn’t be too harsh on him considering that he’s not even smart enough for Mensa. Aristotle had Scalzi’s kind pegged more than 2,000 years ago.</p><p><i>“Now for some people it is better worth while to seem to be wise,<br> than to be wise without seeming to be (for the art of the sophist is the<br> semblance of wisdom without the reality, and the sophist is one who<br> makes money from an apparent but unreal wisdom); for them, then, it is<br> clearly essential also to seem to accomplish the task of a wise man<br> rather than to accomplish it without seeming to do so.”</br></br></br></br></br></i></p><p>As for me, I don’t brag about my Mensa membership. Why on Earth would I? The requirements for joining aren’t even within a standard deviation of my IQ or the three other residents of the Digital Ghetto back in the day. I joined Mensa after starting my WND column as an efficient and effective way to defang the inevitable “right-wing writer is stupid” disqualifications from the left. And that is precisely why some people on the right brandish it like a shield, because that is exactly what it is: a rhetorical shield that successfully blunts the left’s most frequently used rhetorical disqualification: “dey stupid, DISQUALIFY!”</p><p>And since we’re on the subject of SJWs lying, where, exactly, is the “bragging about your Mensa card” <a href=\"http://accordingtohoyt.com/2015/08/29/ive-been-to-the-desert-on-a-horse-with-no-name/\">in Sarah’s post</a>, to which, of course, McRapey does not link? Go ahead, see just how much importance she and her readers place on it and note the context in which it was mentioned.</p><p>But do tell us more about how it is actually membership in Mensa that is stupid and totally doesn’t matter and doesn’t mean that one is intelligent <i>at all</i>, Johnny. Let it all out. You’ll feel better after a good cry.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CM3LKRMVEAAOXTZ.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/CM3LKRMVEAAOXTZ.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CM3LKRMVEAAOXTZ.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> UPDATE: It turns out that Mr. “Bachelor’s Degree in Philosophy of Language from the University of Chicago” <a href=\"http://chicagomaroon.com/2013/04/30/uncommon-interview-john-scalzi-a-b-91/\">graduated with a 2.8 GPA</a>. See, obviously he was one of the cool party guys… <i>at the University of Chicago</i>.</p><blockquote class=\"tr_bq\"><p> I was not hugely grade-intensive. I didn’t stress out: I had a 2.8 GPA…. I did well in the classes that I liked, and I did very poorly in the classes that I did not care about.</p></blockquote><p>Apparently he didn’t care about his IQ test either, or he totally would have done well enough to qualify for Mensa.</p></div>",
  "content_text": "The Aesopean analogy doesn’t quite work, though, given that foxes are a symbol of intelligence. And it’s just so\nhard\nto maintain the pretense that you’re the smartest guy in the room when you didn’t even qualify for the high-IQ society with the lowest bar to membership. It doesn’t take a, well, a Mensa member, to figure out why Mensa is\nsuch a sore spot for McRapey\n.\nPro tip: Bragging about your Mensa card as an actual adult signals that while you may be “smart,” you almost certainly are not wise.\n— John Scalzi (@scalzi) August 31, 2015\nIn the various recent kerfuffles surrounding science fiction and its awards, there have been a couple of people (and their spouses, declaiming about their beloved) who have been slapping down Mensa cards as proof that they (or their spouse) are smart. Let me just say this about that:\nOh, my sweet summer children. Just don’t.\nIf you want to be in Mensa, that’s fine. Everyone needs hobbies and associations, and if this is the direction you want to go with yours, then you do you. Not my flavor, but then, lots of hobbies and associations aren’t my flavor.\nThat said:\n1. Literally no one outside of Mensa gives a shit about your Mensa card. No one is impressed that you belong to an organization that has among its membership people who believe that because they can ace a test, they are therefore broadly intellectually superior to everyone else.\n2. Your Mensa membership does not imply or suggest that you are the smartest person in the room. Leaving aside the point that the intelligence that Mensa values is a narrow and specialized sort, a large number of people who can join Mensa, don’t, for various reasons, including the idea that belonging to a group that glories in its supposed intellectual superiority is more than vaguely obnoxious.\n3. Your need to bring up the fact you have a Mensa card suggests nothing other than it’s really really really important to you for people to know you’re smart, and that you believe external accreditation of this supposed top-tier intelligence is more persuasive than, say, the establishment of your intelligence through your actions, demeanor, or personality. Which is to say: It shows you’re insecure.\n4. Your Mensa card does not mean you know how to argue. Your Mensa card does not mean you do not make errors or lapses in judgment. Your Mensa card is not a “get out of jail free” card when someone pokes holes in your thesis. Your Mensa card does not mean that you can’t be racist or sexist or otherwise bigoted. You may not say “I have a Mensa card, therefore my logic is irrefutable.” Your Mensa card will not save you from Dunning-Kruger syndrome, and if you think it will, then you are exactly who the Dunning-Kruger syndrome was meant to describe. You Mensa card will not keep you from being called out for acting stupidly, or doing stupid things.\nSee, you’re not supposed to brag about your Mensa-qualifying IQ and having one doesn’t mean you know how to argue. What you’re supposed to do is brag about your\nBACHELOR’S DEGREE in Philosophy of Language from the University of Chicago\n, which institution we are reliably informed does\nnot\nhand them out like gumballs, and appeal to the authority of that degree whenever someone happens to observe your incompetence at constructing syllogisms and formulating sound arguments. Which, as it happens, is practically every single time McRapey attempts to construct an actual argument rather than simply posturing about his assertions.\nAs I noted\nback in 2013\n, McRapey hasn’t changed what passes for his debating technique since at least 2005.\nMake an obviously questionable assertion.\nWhen the assertion is questioned, appeal to bachelor’s degree.\nWhen the appeal to the bachelor’s degree is questioned, question the questioner’s intellect and/or good will.\nAvoid further questions.\nPosture as if one has thoroughly proved one’s point.\nHe even went so far as to claim that I had never bested him in any argument.\n“As for besting me in argument, well, no, not at any point I can remember.”\nSJWs always lie.\nSure you don’t remember, Johnny. Read\nSJWs Always Lie\n, Amazon’s #1 bestseller in Political Philosophy. It will serve to refresh your memory in brutal and well-documented detail, and it even contains a chapter devoted to rhetoric that you will find educational.\nSpeaking of Dunning-Kruger, McRapey is a walking, talking example of the syndrome in action, particularly when it comes to rhetoric. For all that he majored in something that could be considered akin to it if you squint hard enough,\nhe clearly doesn’t know the first thing about it\n. The rhetorical device to which he habitually resorts is a sophistical and dialectically illegitimate one called “ambiguity”, not that he could correctly identify or name it despite his famous bachelor’s degree. But then, as we know, we shouldn’t be too harsh on him considering that he’s not even smart enough for Mensa. Aristotle had Scalzi’s kind pegged more than 2,000 years ago.\n“Now for some people it is better worth while to seem to be wise,\nthan to be wise without seeming to be (for the art of the sophist is the\nsemblance of wisdom without the reality, and the sophist is one who\nmakes money from an apparent but unreal wisdom); for them, then, it is\nclearly essential also to seem to accomplish the task of a wise man\nrather than to accomplish it without seeming to do so.”\nAs for me, I don’t brag about my Mensa membership. Why on Earth would I? The requirements for joining aren’t even within a standard deviation of my IQ or the three other residents of the Digital Ghetto back in the day. I joined Mensa after starting my WND column as an efficient and effective way to defang the inevitable “right-wing writer is stupid” disqualifications from the left. And that is precisely why some people on the right brandish it like a shield, because that is exactly what it is: a rhetorical shield that successfully blunts the left’s most frequently used rhetorical disqualification: “dey stupid, DISQUALIFY!”\nAnd since we’re on the subject of SJWs lying, where, exactly, is the “bragging about your Mensa card”\nin Sarah’s post\n, to which, of course, McRapey does not link? Go ahead, see just how much importance she and her readers place on it and note the context in which it was mentioned.\nBut do tell us more about how it is actually membership in Mensa that is stupid and totally doesn’t matter and doesn’t mean that one is intelligent\nat all\n, Johnny. Let it all out. You’ll feel better after a good cry.\nUPDATE: It turns out that Mr. “Bachelor’s Degree in Philosophy of Language from the University of Chicago”\ngraduated with a 2.8 GPA\n. See, obviously he was one of the cool party guys…\nat the University of Chicago\n.\nI was not hugely grade-intensive. I didn’t stress out: I had a 2.8 GPA…. I did well in the classes that I liked, and I did very poorly in the classes that I did not care about.\nApparently he didn’t care about his IQ test either, or he totally would have done well enough to qualify for Mensa.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-31T07:33:00+00:00"
}