{
  "url": "https://voxday.net/2015/08/16/the-sjws-think-they-can-outlast-us/",
  "scraped_at": "2025-12-17T17:23:10.335910",
  "title": "The SJWs think they can outlast us",
  "date_display": "August 16, 2015",
  "date_iso": "2015-08-16T09:45:00+00:00",
  "date_from_url": "2015-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An SJW whose tagline is “exploiting extroverts for personal gain” is demoralized, wants to ban people obeying all the rules as “harassers”, but nevertheless insists that <a href=\"https://archive.is/qV4E0\">they’re going to outlast us</a>:</p><blockquote class=\"tr_bq\"><p> Everyone says the Hugos will survive, and I tend to agree. I think the Puppy voters will get tired of throwing away their money in the name of making whatever statement they’re trying to make. They will also have a harder time maintaining the charade that their campaign is about anything other than self-promotion, because after this year there will be fewer neutral parties willing to appear on any slate. The nomination rules will probably be changed to make slates less effective, although I’m afraid that will make the whole process more confusing and could scare some potential nominators away. In the long run this will mostly be forgotten, but in the short term it probably means that at least two WorldCons are going to have their Hugos basically invalidated, and I don’t like that they have to make that sacrifice. <b>In my opinion the harassment policy should be invoked against the Puppy organizers and they should be banned from the convention and disqualified from the awards on that basis.</b> I get that the Hugo organizers won’t do this, they would argue that the integrity of the awards depends on strict adherence to the bylaws, not arbitrary decisions by administrators. I could make some counter arguments but I don’t want to go down that road right now. I will just say that when a group has a stated goal of disrupting the awards, it wouldn’t bother me at all if they were barred from participating.</p><p>I don’t think there’s any point in making predictions this year. With so many more voters than usual, anything is possible. The Puppies don’t seem to be expecting to win, but whether that means that non-Puppies win or it’s all no awards, who knows? Maybe there was a big influx of Chinese voters who wanted to support Cixin Liu and don’t know anything about Puppies. I’m not really invested in the results this year, I don’t have any favorites that I’m rooting for. I considered skipping this blog post too. But then I realized that’s what the Puppies would want. They want people, at least people who aren’t them, to lose interest. Well, voting this year was less fun and more of a chore, but I did it. Blogging about it wasn’t as much fun either, but blogging about the Hugos seems to be what I do, even if nobody ever sees it. If nothing else, it’s an affirmation that I’m still a part of the process. If I have to put up with a couple of down years before it becomes fun again, I can do that. So I’ll see you back here, same time next year.</p></blockquote><p>Yeah, the game journos thought they could outgrind #GamerGate too. I always enjoy the SJW gift for self-contradiction. Even as they make fun of me for not letting go of 10 years of vicious and unprovoked personal attacks made on me by the Torlings beginning in 2005, and as they lament the terrible feelbads that TWO WHOLE YEARS of effective Puppy campaigns have dealt them, they insist that we’re going to lose interest and relax the pressure on them Real Soon Now. That’s why they want to ban us.</p><p>Are they mad, delusional, or is it just wishful thinking? Some combination of the three, I suppose. Meanwhile, Tom Knighton is beginning to sound like a Vile Faceless Minion. <a href=\"http://tlknighton.com/?p=7282\">He just doesn’t care</a> what the SJWs in science fiction do anymore.</p><p><i> <a href=\"https://pbs.twimg.com/media/CMexaMqW8AECiuk.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"https://pbs.twimg.com/media/CMexaMqW8AECiuk.png\" width=\"320\"/></a>I’ve been one of those trying to argue that message fiction was a bad<br> idea.  I still think it is.  But now, I just don’t care what those<br> folks do.</br></br></i><i> I believe in free markets, and I think the market will slap some of<br> these publishers hard.  They’ll either learn from it, or not.  Either<br> way, new publishers will rise.  Baen can’t publish everything, after<br> all.</br></br></br></i><br> <i><br> </br></i><i> </i><br> <i>So, I just don’t care.  They can write what they want to write, and<br> they can bitch about what they want to bitch about.  These days, most of<br> those who are so vocal aren’t much more to me than an ant crawling<br> across the ground.  A couple are significant enough writers that I’d<br> actually heard of them and read some of their stuff, but most of them?</br></br></br></br></i><i> Nothings.  They’re the kind of thing I’d scape off of my shoe before stepping into my home, metaphorically speaking.</i></br></br></p><p>The Rabid Puppies are not going to stop because we’re just doing what we’ve always done. Grind until we level up, then grind some more. In the last six weeks I’ve edited two books, written a book, turned in four game designs, and none of those things were my top priority project. I don’t think I’ll have any trouble finding the time to put an annual list of Hugo recommendations together for the foreseeable future.</p><p>The SJWs don’t seem to be able to grasp that we can’t be intimidated or that every time they publish another <a href=\"http://www.yesmagazine.org/peace-justice/sad-puppies-2015-hugo-awards-20150814\">stupid, slanderous, and inaccurate article</a>, every time they libel us and call us names, they ensure that our morale and motivation stays at max. I don’t know about you, but at this point, I’m fired up and good for <i>at least </i>another decade<i>.</i></p></div>",
  "content_text": "An SJW whose tagline is “exploiting extroverts for personal gain” is demoralized, wants to ban people obeying all the rules as “harassers”, but nevertheless insists that\nthey’re going to outlast us\n:\nEveryone says the Hugos will survive, and I tend to agree. I think the Puppy voters will get tired of throwing away their money in the name of making whatever statement they’re trying to make. They will also have a harder time maintaining the charade that their campaign is about anything other than self-promotion, because after this year there will be fewer neutral parties willing to appear on any slate. The nomination rules will probably be changed to make slates less effective, although I’m afraid that will make the whole process more confusing and could scare some potential nominators away. In the long run this will mostly be forgotten, but in the short term it probably means that at least two WorldCons are going to have their Hugos basically invalidated, and I don’t like that they have to make that sacrifice.\nIn my opinion the harassment policy should be invoked against the Puppy organizers and they should be banned from the convention and disqualified from the awards on that basis.\nI get that the Hugo organizers won’t do this, they would argue that the integrity of the awards depends on strict adherence to the bylaws, not arbitrary decisions by administrators. I could make some counter arguments but I don’t want to go down that road right now. I will just say that when a group has a stated goal of disrupting the awards, it wouldn’t bother me at all if they were barred from participating.\nI don’t think there’s any point in making predictions this year. With so many more voters than usual, anything is possible. The Puppies don’t seem to be expecting to win, but whether that means that non-Puppies win or it’s all no awards, who knows? Maybe there was a big influx of Chinese voters who wanted to support Cixin Liu and don’t know anything about Puppies. I’m not really invested in the results this year, I don’t have any favorites that I’m rooting for. I considered skipping this blog post too. But then I realized that’s what the Puppies would want. They want people, at least people who aren’t them, to lose interest. Well, voting this year was less fun and more of a chore, but I did it. Blogging about it wasn’t as much fun either, but blogging about the Hugos seems to be what I do, even if nobody ever sees it. If nothing else, it’s an affirmation that I’m still a part of the process. If I have to put up with a couple of down years before it becomes fun again, I can do that. So I’ll see you back here, same time next year.\nYeah, the game journos thought they could outgrind #GamerGate too. I always enjoy the SJW gift for self-contradiction. Even as they make fun of me for not letting go of 10 years of vicious and unprovoked personal attacks made on me by the Torlings beginning in 2005, and as they lament the terrible feelbads that TWO WHOLE YEARS of effective Puppy campaigns have dealt them, they insist that we’re going to lose interest and relax the pressure on them Real Soon Now. That’s why they want to ban us.\nAre they mad, delusional, or is it just wishful thinking? Some combination of the three, I suppose. Meanwhile, Tom Knighton is beginning to sound like a Vile Faceless Minion.\nHe just doesn’t care\nwhat the SJWs in science fiction do anymore.\nI’ve been one of those trying to argue that message fiction was a bad\nidea.  I still think it is.  But now, I just don’t care what those\nfolks do.\nI believe in free markets, and I think the market will slap some of\nthese publishers hard.  They’ll either learn from it, or not.  Either\nway, new publishers will rise.  Baen can’t publish everything, after\nall.\nSo, I just don’t care.  They can write what they want to write, and\nthey can bitch about what they want to bitch about.  These days, most of\nthose who are so vocal aren’t much more to me than an ant crawling\nacross the ground.  A couple are significant enough writers that I’d\nactually heard of them and read some of their stuff, but most of them?\nNothings.  They’re the kind of thing I’d scape off of my shoe before stepping into my home, metaphorically speaking.\nThe Rabid Puppies are not going to stop because we’re just doing what we’ve always done. Grind until we level up, then grind some more. In the last six weeks I’ve edited two books, written a book, turned in four game designs, and none of those things were my top priority project. I don’t think I’ll have any trouble finding the time to put an annual list of Hugo recommendations together for the foreseeable future.\nThe SJWs don’t seem to be able to grasp that we can’t be intimidated or that every time they publish another\nstupid, slanderous, and inaccurate article\n, every time they libel us and call us names, they ensure that our morale and motivation stays at max. I don’t know about you, but at this point, I’m fired up and good for\nat least\nanother decade\n.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-16T08:45:00+00:00"
}