{
  "url": "https://voxday.net/2015/08/17/they-really-hate-classics/",
  "scraped_at": "2025-12-17T17:23:18.401253",
  "title": "They really hate the classics",
  "date_display": "August 17, 2015",
  "date_iso": "2015-08-17T12:36:00+00:00",
  "date_from_url": "2015-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When the pinkshirts in science fiction talk about wanting to destroy Campbellian SF, they’re not being ironic or kidding. They seriously believe that Pink SF is better and genuinely <a href=\"https://archive.is/z5Die#selection-1395.0-1395.290\">want to eradicate old school Blue SF/F</a> because it is too outdated, offensive, and problematic.</p><blockquote class=\"tr_bq\"><p> I read the 100 “best” fantasy and sci-fi novels – and they were shockingly offensive. Why are so many of NPR’s list of best science fiction books so misogynistic, and why can’t we move past our nostalgia for them?</p><div style=\"background-color: transparent; border-color: white; border-style: none; border-width: 0px; font-weight: 300; margin: 0.6em 0px 0.8em; padding: 0px; text-align: left;\"> When<br> it comes to the best of anything, what do you expect? If it’s science<br> fiction and fantasy novels you want epic adventures and getting out of<br> impossible situations. But what you often get is barely disguised sexism<br> and inability to imagine any world where women are involved in the<br> derring-do.</br></br></br></br></br></div><div style=\"background-color: transparent; border-color: white; border-style: none; border-width: 0px; font-weight: 300; margin: 0.6em 0px 0.8em; padding: 0px; text-align: left;\"> At<br> the end of 2013, after a year of reading very little, I decided to<br> embark on a challenge: read all the books I hadn’t yet read on<br> <a href=\"https://archive.is/o/z5Die/http://www.npr.org/2011/08/11/139085843/your-picks-top-100-science-fiction-fantasy-books\" style=\"background-color: transparent; border-color: white; border-style: none; border-width: 0px; color: #cb3848; font-weight: 300; margin: 0px; outline: invert none medium; padding: 0px; text-align: left; text-decoration: none;\">NPR’s list of 100 best sci-fi and fantasy novels</a>.<br> Nostalgia permeates the list. Of the books I read, there were more<br> books published before 1960 than after 2000. The vast majority were<br> published in the 1970s and 1980s. There were also many sci-fi<br> masterworks or what were groundbreaking novels. However, groundbreaking<br> 30, 40, 50 or 100 years ago can now seem horribly out of date and<br> shockingly offensive….</br></br></br></br></br></br></br></br></br></div><p>Recent controversy</p><p>I’ve been acutely aware of the ferocious debate in the science fiction and fantasy community about representation (the recent controversy over the Hugo awards is a case in point), so I should have been somewhat prepared for this relentlessly depressing string of disappointing novels. But with the dogged determination of reading through the list, it really grinds you down. How can people actually defend the status quo when it’s so obviously awful? Putting these books on a pedestal, given how problematic the portrayal of women and other minorities, is surely part of the problem?</p><p>Frankly, from my vantage in 2015, it was just plain weird to read books where there were hardly any women, no people of colour, no LGBT people. It seemed wholly unbelievable. I know what you could say: it’s science fiction and fantasy, believability isn’t one of the main criteria for such books. But it is relatively absurd that in the future people could discover faster-than-light travel, build massive empires and create artificial intelligences but somehow not crack gender equality or the space-faring glass ceiling.</p><p>The consequence of the lack of women and the obvious sexism is that the books became very much like one another. My book reviews contained more profanity and I became a much more harsh critic of the genres I most enjoyed reading. They were all the same story of white guys, going on an adventure….</p><p>I can understand how many of the books on the list may have once been<br> groundbreaking but that doesn’t mean that they are now the best examples<br> of the genre. They have been supplanted, hundreds of times over, by<br> other authors that took similar themes but made them better and more<br> inclusive.</br></br></br></br></p></blockquote><p>They genuinely believe throwing in a few men-with-tits and white men with colored skin – which is as far as their attempts at diversity generally go – somehow magically improves a book. Of course, the general public disagrees, as the continued decline in SF sales demonstrates.</p></div>",
  "content_text": "When the pinkshirts in science fiction talk about wanting to destroy Campbellian SF, they’re not being ironic or kidding. They seriously believe that Pink SF is better and genuinely\nwant to eradicate old school Blue SF/F\nbecause it is too outdated, offensive, and problematic.\nI read the 100 “best” fantasy and sci-fi novels – and they were shockingly offensive. Why are so many of NPR’s list of best science fiction books so misogynistic, and why can’t we move past our nostalgia for them?\nWhen\nit comes to the best of anything, what do you expect? If it’s science\nfiction and fantasy novels you want epic adventures and getting out of\nimpossible situations. But what you often get is barely disguised sexism\nand inability to imagine any world where women are involved in the\nderring-do.\nAt\nthe end of 2013, after a year of reading very little, I decided to\nembark on a challenge: read all the books I hadn’t yet read on\nNPR’s list of 100 best sci-fi and fantasy novels\n.\nNostalgia permeates the list. Of the books I read, there were more\nbooks published before 1960 than after 2000. The vast majority were\npublished in the 1970s and 1980s. There were also many sci-fi\nmasterworks or what were groundbreaking novels. However, groundbreaking\n30, 40, 50 or 100 years ago can now seem horribly out of date and\nshockingly offensive….\nRecent controversy\nI’ve been acutely aware of the ferocious debate in the science fiction and fantasy community about representation (the recent controversy over the Hugo awards is a case in point), so I should have been somewhat prepared for this relentlessly depressing string of disappointing novels. But with the dogged determination of reading through the list, it really grinds you down. How can people actually defend the status quo when it’s so obviously awful? Putting these books on a pedestal, given how problematic the portrayal of women and other minorities, is surely part of the problem?\nFrankly, from my vantage in 2015, it was just plain weird to read books where there were hardly any women, no people of colour, no LGBT people. It seemed wholly unbelievable. I know what you could say: it’s science fiction and fantasy, believability isn’t one of the main criteria for such books. But it is relatively absurd that in the future people could discover faster-than-light travel, build massive empires and create artificial intelligences but somehow not crack gender equality or the space-faring glass ceiling.\nThe consequence of the lack of women and the obvious sexism is that the books became very much like one another. My book reviews contained more profanity and I became a much more harsh critic of the genres I most enjoyed reading. They were all the same story of white guys, going on an adventure….\nI can understand how many of the books on the list may have once been\ngroundbreaking but that doesn’t mean that they are now the best examples\nof the genre. They have been supplanted, hundreds of times over, by\nother authors that took similar themes but made them better and more\ninclusive.\nThey genuinely believe throwing in a few men-with-tits and white men with colored skin – which is as far as their attempts at diversity generally go – somehow magically improves a book. Of course, the general public disagrees, as the continued decline in SF sales demonstrates.",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-17T11:36:00+00:00"
}