{
  "url": "https://voxday.net/2015/08/23/they-proved-larry-rig/",
  "scraped_at": "2025-12-17T17:24:07.756640",
  "title": "They proved Larry right",
  "date_display": "August 23, 2015",
  "date_iso": "2015-08-23T19:00:00+00:00",
  "date_from_url": "2015-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Milo offers <a href=\"http://www.breitbart.com/big-government/2015/08/23/set-phasers-to-kill-sjws-burn-down-the-hugo-awards-to-prove-how-tolerant-and-welcoming-they-are/\">a much more realistic take</a> on the Hugo Awards:</p><blockquote class=\"tr_bq\"><p> “I said the Hugos were dominated by<br> cliques that cared more about an author’s identity and politics than the<br> quality of their work,” Sad Puppies founder Larry Correia told<br> Breitbart. “Tonight they proved me right.”</br></br></br></p><p>Vox Day, an author and publisher who<br> assembled the Rabid Puppies slate, agreed. “The scorched earth strategy<br> being pursued by the SJWs in science fiction is evidence that we hold<br> the initiative and we are winning,” he said. “The fact that the SJWs would rather<br> give out no award rather than honor an influential editor like Toni<br> Weisskopf of Baen Books or science fiction grandmaster John C. Wright<br> demonstrates the extent to which science fiction has been politicized<br> and degraded by their far-left politics. The SJWs will try to portray this as<br> a victory – they would try to portray suicide by self-cannibalism as a<br> victory – but anyone who knows anything about history understands the<br> significance of one side resorting to burning down its own houses in<br> order to deny it to the enemy. That is a defensive tactic borne of<br> desperation.”</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Like the empire at the end of<i> The Empire Strikes Back</i>, the<br> forces of social justice believe they have the rebel puppy alliance on<br> their knees. What they don’t realize is that the puppies are already<br> plotting their approach to 2016, which may not include a large army of<br> Ewoks, but certainly will include many more pissed off fans.</br></br></br></br></p><p>Science fiction fans of all types are left, like the punters in Heinlein’s <i>Stranger in a Strange Land</i>,<br> unable to grok how their supposed fellow fans could choose to harm not<br> only the awards themselves but the wider industry with vindictive,<br> nihilistic self-immolation.</br></br></br></p></blockquote><p>It’s fascinating to see SJWs desperately trying to cling to their Narrative on Twitter and elsewhere. They’re insisting that we’re mad, that we’re crying, that we’re upset, when the fact is that I knew this would be the result this year prior to creating Rabid Puppies.</p><p>This is the difference between game designers and normal people. We think, we HAVE to think, in terms of consequences, both obvious and non-obvious. We started last year with 1,100 reliable anti-Puppy votes and 160 reliable pro-puppy votes. That meant we were 900 in the hole before we even got started.</p><p>That’s why I was urging everyone not to adopt the tactics of the other side and mass-mobilize. Last year wasn’t a good test because I wasn’t involved in the organizing and the Dread Ilk really didn’t get involved. There was no point in throwing the full weight of our effort into this year’s awards when we had the chance to see a) what our core forces looked like and b) what their maximal forces looked like. That’s why I told everyone that this year was about the nominations and the best we could reasonably hope for was to provoke them into voting No Award… which they dutifully did.</p><p>Our execution wasn’t flawless. I made two mistakes, one which was fortuitous as it permitted Three Body Problem to make the shortlist and win, and one which was stupid as it cost us a 6th category in novelette. Our discipline could also have been better, although I don’t see that it would have made any difference at all with regards to either the nominations or the awards. But I trust the moderate approach is now sufficiently discredited in everyone’s eyes.</p><p>As for what comes next, we’re going to be discussing RP plans for 2016 at a Closed Brainstorm session later this week; only Annual Members and Monthly Members who were registered before today will be permitted to attend. Suffice it to say that there will be plenty for everyone, VFM, Rabids, Dread Ilk, and new Rabid converts alike, to do in the coming year.</p><p>Meanwhile, the Beautiful but Evil Space Princess <a href=\"http://accordingtohoyt.com/2015/08/23/burning-down-the-field-in-order-to-save-it/\">gradually begins to grok</a> the Evil ways of the Supreme Dark Lord:</p><blockquote class=\"tr_bq\"><p> Until today I viewed him as a mirror of the SJW posturing.  I retract that and I give him full measure of applause.  Yes, his views are still repulsive and he still makes my skin crawl as often as the Marxists do, but you know what?  At least he has a brain and uses it.  Those of you celebrating might want to take a deep breath and wonder — for just a minute — if you did anything more than what Vox wanted.  Because from where I’m sitting, the man that set out to destroy the field and prove that everyone calling themselves its leadership were mannerless and brainless children not only won last night, he won walking away. He won without DOING anything.  He won by convincing yourselves to hit yourselves repeatedly with the obvious hammers of partisanship, lack of care for quality and INTEREST in the health of the field.  And before you died, you gloated you had won.  The mind boggles.</p><p>Well done, Vox Day.  My laughter is tinged with tears because I don’t know if the field I loved will ever recover from stupidity displayed in such an open manner. I think today I prove the Valentine Michael Smith adage that sometimes you laugh because it hurts too much to cry.</p></blockquote><p>I suspect last night was a lot harder for writers like Sarah and Brad, who once considered the morons blithely running around with matches their colleagues, friends, and peers, to witness their antics last night than it was for me. After my one visit to MiniCon, I never considered them anything more than psychologically damaged human wreckage, so it doesn’t surprise me in the slightest that they were dumb enough to play it that way. After all, SJWs always double down.</p></div>",
  "content_text": "Milo offers\na much more realistic take\non the Hugo Awards:\n“I said the Hugos were dominated by\ncliques that cared more about an author’s identity and politics than the\nquality of their work,” Sad Puppies founder Larry Correia told\nBreitbart. “Tonight they proved me right.”\nVox Day, an author and publisher who\nassembled the Rabid Puppies slate, agreed. “The scorched earth strategy\nbeing pursued by the SJWs in science fiction is evidence that we hold\nthe initiative and we are winning,” he said. “The fact that the SJWs would rather\ngive out no award rather than honor an influential editor like Toni\nWeisskopf of Baen Books or science fiction grandmaster John C. Wright\ndemonstrates the extent to which science fiction has been politicized\nand degraded by their far-left politics. The SJWs will try to portray this as\na victory – they would try to portray suicide by self-cannibalism as a\nvictory – but anyone who knows anything about history understands the\nsignificance of one side resorting to burning down its own houses in\norder to deny it to the enemy. That is a defensive tactic borne of\ndesperation.”\nLike the empire at the end of\nThe Empire Strikes Back\n, the\nforces of social justice believe they have the rebel puppy alliance on\ntheir knees. What they don’t realize is that the puppies are already\nplotting their approach to 2016, which may not include a large army of\nEwoks, but certainly will include many more pissed off fans.\nScience fiction fans of all types are left, like the punters in Heinlein’s\nStranger in a Strange Land\n,\nunable to grok how their supposed fellow fans could choose to harm not\nonly the awards themselves but the wider industry with vindictive,\nnihilistic self-immolation.\nIt’s fascinating to see SJWs desperately trying to cling to their Narrative on Twitter and elsewhere. They’re insisting that we’re mad, that we’re crying, that we’re upset, when the fact is that I knew this would be the result this year prior to creating Rabid Puppies.\nThis is the difference between game designers and normal people. We think, we HAVE to think, in terms of consequences, both obvious and non-obvious. We started last year with 1,100 reliable anti-Puppy votes and 160 reliable pro-puppy votes. That meant we were 900 in the hole before we even got started.\nThat’s why I was urging everyone not to adopt the tactics of the other side and mass-mobilize. Last year wasn’t a good test because I wasn’t involved in the organizing and the Dread Ilk really didn’t get involved. There was no point in throwing the full weight of our effort into this year’s awards when we had the chance to see a) what our core forces looked like and b) what their maximal forces looked like. That’s why I told everyone that this year was about the nominations and the best we could reasonably hope for was to provoke them into voting No Award… which they dutifully did.\nOur execution wasn’t flawless. I made two mistakes, one which was fortuitous as it permitted Three Body Problem to make the shortlist and win, and one which was stupid as it cost us a 6th category in novelette. Our discipline could also have been better, although I don’t see that it would have made any difference at all with regards to either the nominations or the awards. But I trust the moderate approach is now sufficiently discredited in everyone’s eyes.\nAs for what comes next, we’re going to be discussing RP plans for 2016 at a Closed Brainstorm session later this week; only Annual Members and Monthly Members who were registered before today will be permitted to attend. Suffice it to say that there will be plenty for everyone, VFM, Rabids, Dread Ilk, and new Rabid converts alike, to do in the coming year.\nMeanwhile, the Beautiful but Evil Space Princess\ngradually begins to grok\nthe Evil ways of the Supreme Dark Lord:\nUntil today I viewed him as a mirror of the SJW posturing.  I retract that and I give him full measure of applause.  Yes, his views are still repulsive and he still makes my skin crawl as often as the Marxists do, but you know what?  At least he has a brain and uses it.  Those of you celebrating might want to take a deep breath and wonder — for just a minute — if you did anything more than what Vox wanted.  Because from where I’m sitting, the man that set out to destroy the field and prove that everyone calling themselves its leadership were mannerless and brainless children not only won last night, he won walking away. He won without DOING anything.  He won by convincing yourselves to hit yourselves repeatedly with the obvious hammers of partisanship, lack of care for quality and INTEREST in the health of the field.  And before you died, you gloated you had won.  The mind boggles.\nWell done, Vox Day.  My laughter is tinged with tears because I don’t know if the field I loved will ever recover from stupidity displayed in such an open manner. I think today I prove the Valentine Michael Smith adage that sometimes you laugh because it hurts too much to cry.\nI suspect last night was a lot harder for writers like Sarah and Brad, who once considered the morons blithely running around with matches their colleagues, friends, and peers, to witness their antics last night than it was for me. After my one visit to MiniCon, I never considered them anything more than psychologically damaged human wreckage, so it doesn’t surprise me in the slightest that they were dumb enough to play it that way. After all, SJWs always double down.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-23T18:00:00+00:00"
}