{
  "url": "https://voxday.net/2015/08/12/two-out-of-three-isnt-bad/",
  "scraped_at": "2025-12-17T17:22:45.569159",
  "title": "Two out of three isn’t bad",
  "date_display": "August 12, 2015",
  "date_iso": "2015-08-12T19:00:00+00:00",
  "date_from_url": "2015-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At File 770, a glimpse of the Sasquan committee’s <a href=\"http://file770.com/?p=24337&amp;cpage=1#comment-316663\">view of the Puppies</a>, which is surprisingly accurate:</p><blockquote class=\"tr_bq\"><p> There’s been a lively discussion on my Facebook about this all. In particular an explanation of part of the thinking of the committee –</p><p>Glenn Glazer Christopher: I put three simple facts before you:<br> 1) The puppies have a strong tendency to _retaliatory_ action.<br> 2) The puppies are crazy, but they are not suicide terrorist crazy.<br> 3) Antonelli has a long history of being an online asshat, but no history of physical violence, including at Worldcon in San Antonio, which he was at.</br></br></br></p></blockquote><p>1) This is correct. Leave us alone, we’ll leave you alone. Attack us unprovoked, and we won’t let it go until either a) you publicly and unconditionally submit to the Supreme Dark Lord or b) the Vile Faceless Minions have lapped up your blood and devoured your corpse. Your call.</p><p>2) We’re not crazy at all. We simply have different motivations and different objectives, and we operate on a longer time scale than most. If you still think the goal of Rabid Puppies is to win science fiction awards, you’re the one who is observably crazy. We care as much about them every bit as much as #GamerGate cares who wins Kotaku’s Game of the Year.</p><p>3) Now, Lou Antonelli would appear to be crazy, or at the very least, stupid. We don’t support his letter to the police, we don’t support his apology, and we don’t support his subsequent attempt to make nice with his new BFF David Gerrold. We may be, in fact, we indubitably are, Evil, but we are not stupid. In any event, we don’t care whether Sasquan bans him or not. He is not, by his own account, a Sad Puppy, a Rabid Puppy, or an SJW, and therefore we’re no more interested in him than in Black Gate, Guardians of the Galaxy, or any other non-Puppy on our lists.</p><p>As for Sasquan, we have no interest in disrupting it, but we do expect our attendees to be prepared for any SJWs inclined to violate <a href=\"http://sasquan.org/code-of-conduct/\">the posted Sasquan harassment policy</a>. That is why I encourage every VFM, Puppy, and Dread Ilk attending Sasquan to keep a recorder running at all times on your Android or iOS phone. If you’re subsequently subject to any verbal or physical harassment, you’ll have material evidence on hand to bring to the relevant authorities. More importantly, you’ll also have a strong defense to present against the inevitable SJW lies concerning your own behavior.</p><p>This map <a href=\"https://camestrosfelapton.wordpress.com/\">by Camestros Felapton</a> is rather clever. I always pictured Rabidonia as being more northern, but he does a good job of placing the various relationships. Moreover, if Voxpopoli were in the upper right, it would be right where Lord Bane is in Illuria.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://camestrosfelapton.files.wordpress.com/2015/08/mapofthepuppykerfufflev0-2.png?w=545&amp;h=386\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://camestrosfelapton.files.wordpress.com/2015/08/mapofthepuppykerfufflev0-2.png?w=545&amp;h=386\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://camestrosfelapton.files.wordpress.com/2015/08/mapofthepuppykerfufflev0-2.png?w=545&amp;h=386\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p></p></div>",
  "content_text": "At File 770, a glimpse of the Sasquan committee’s\nview of the Puppies\n, which is surprisingly accurate:\nThere’s been a lively discussion on my Facebook about this all. In particular an explanation of part of the thinking of the committee –\nGlenn Glazer Christopher: I put three simple facts before you:\n1) The puppies have a strong tendency to _retaliatory_ action.\n2) The puppies are crazy, but they are not suicide terrorist crazy.\n3) Antonelli has a long history of being an online asshat, but no history of physical violence, including at Worldcon in San Antonio, which he was at.\n1) This is correct. Leave us alone, we’ll leave you alone. Attack us unprovoked, and we won’t let it go until either a) you publicly and unconditionally submit to the Supreme Dark Lord or b) the Vile Faceless Minions have lapped up your blood and devoured your corpse. Your call.\n2) We’re not crazy at all. We simply have different motivations and different objectives, and we operate on a longer time scale than most. If you still think the goal of Rabid Puppies is to win science fiction awards, you’re the one who is observably crazy. We care as much about them every bit as much as #GamerGate cares who wins Kotaku’s Game of the Year.\n3) Now, Lou Antonelli would appear to be crazy, or at the very least, stupid. We don’t support his letter to the police, we don’t support his apology, and we don’t support his subsequent attempt to make nice with his new BFF David Gerrold. We may be, in fact, we indubitably are, Evil, but we are not stupid. In any event, we don’t care whether Sasquan bans him or not. He is not, by his own account, a Sad Puppy, a Rabid Puppy, or an SJW, and therefore we’re no more interested in him than in Black Gate, Guardians of the Galaxy, or any other non-Puppy on our lists.\nAs for Sasquan, we have no interest in disrupting it, but we do expect our attendees to be prepared for any SJWs inclined to violate\nthe posted Sasquan harassment policy\n. That is why I encourage every VFM, Puppy, and Dread Ilk attending Sasquan to keep a recorder running at all times on your Android or iOS phone. If you’re subsequently subject to any verbal or physical harassment, you’ll have material evidence on hand to bring to the relevant authorities. More importantly, you’ll also have a strong defense to present against the inevitable SJW lies concerning your own behavior.\nThis map\nby Camestros Felapton\nis rather clever. I always pictured Rabidonia as being more northern, but he does a good job of placing the various relationships. Moreover, if Voxpopoli were in the upper right, it would be right where Lord Bane is in Illuria.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-12T18:00:00+00:00"
}