{
  "url": "https://voxday.net/2015/08/11/we-have-preceden/",
  "scraped_at": "2025-12-17T17:22:38.186101",
  "title": "We have precedent",
  "date_display": "August 11, 2015",
  "date_iso": "2015-08-11T20:28:00+00:00",
  "date_from_url": "2015-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sasquan deems Lou Antonelli <a href=\"https://www.facebook.com/sasquan/posts/880154438687988\">in violation</a> of their Code of Conduct:</p><blockquote class=\"tr_bq\"><p> The Executive Committee of Sasquan, the 73rd World Science Fiction<br> Convention, would like to address the matter of actions taken by Mr. Lou<br> Antonelli with regards to one of our Guests of Honor, Mr. David<br> Gerrold.  On August 1st, Mr. Antonelli participated in a podcast in<br> which he stated that he had written a letter to the Spokane Police<br> Department, in which he stated to them that Mr. Gerrold was “insane and a<br> public danger and needs to be watched when the convention is going on”.</br></br></br></br></br></br></p><p>Normally, online communications between members is not<br> something in Sasquan’s purview to referee.  However, Mr. Antonelli’s<br> letter, which requested police action against Mr. Gerrold during the<br> time of the convention, is within our purview.  As such, we found that<br> there was a strong possibility this act was a violation of <a href=\"http://sasquan.org/code-of-conduct/\">our posted harassment policy</a>[1], particularly if the letter had, in fact, been<br> sent.</br></br></br></br></br></p><p>The Executive Committee then turned the matter over to our<br> Operations Head, Ms. Robbie Bourget, who initiated formal proceedings in<br> accordance with that policy. During these proceedings, it came to light<br> that Mr. Antonelli had issued a formal apology to Mr. Gerrold and<br> admitted culpability: he actually sent the letter, not merely claimed to<br> have sent it.</br></br></br></br></br></p><p>We thoroughly reviewed all available data,<br> including email from both involved parties, social media postings,<br> discussions with key committee members, and so forth. The inescapable<br> conclusion was that Mr. Antonelli had violated our Code of Conduct in<br> this matter. The recommendation was to refund Mr. Antonelli’s membership<br> and prohibit his entry to any convention location or function. However, after the recommendation was made, Mr. Gerrold, as the<br> aggrieved party, specifically requested that the Executive Committee set<br> aside this recommendation on the grounds that Mr. Antonelli did<br> apologize, is sending a retraction to the Spokane Police Department and<br> because, as a Hugo Nominee, he deserves to attend the ceremony.</br></br></br></br></br></br></br></br></br></p><p>The Executive Committee has chosen to accept Mr. Gerrold’s request, and<br> considers the matter closed as of this time.  Ms. Bourget has spoken and<br> corresponded with the Spokane Police Department, and they also consider<br> the matter closed.  We would like to thank Ms. Bourget for the calm<br> professionalism she lent to the proceedings, and Mr. Antonelli and Mr.<br> Gerrold for coming to a settlement that benefits not just them, but the<br> Worldcon and its members.</br></br></br></br></br></br></p></blockquote><p>So, a single letter is sufficient to comprise code of conduct-violating harassment. This is good to know. Perhaps we should do a little looking into who contacted The Guardian, the New Zealand Herald, and other media outlets concerning Sad Puppies, as that most certainly constitutes harassment according to the Executive Committee.</p><p>Sad and Rabid Puppies, if you’re going to Sasquan, make sure you know the Code of Conduct cold, and if anyone so much as puts a toe across the line, shriek bloody murder. The precedent has now been set by the SJWs. Make use of it.</p><p>We already know that people have expressed similarly harassing concerns to Kevin Standlee, so keep your eyes open. Black knight them twice as hard. And for the love of all that is good, holy, and true, do NOT apologize to SJWs. Ever. Under any circumstances. How <i>hard </i>is this to understand?</p><p>I repeat: you never, ever, apologize to SJWs.</p><p>UPDATE: This comment at File 770 will likely amuse the VFM:</p><blockquote class=\"tr_bq\"><p> One of the things that has been so atrocious about Puppygate is the way<br> the Puppies seem not to give a damn about the collateral damage of their<br> actions.</br></br></p></blockquote><p>They’re just noticing this now? What part of “we don’t care” was hard to understand?</p></div>",
  "content_text": "Sasquan deems Lou Antonelli\nin violation\nof their Code of Conduct:\nThe Executive Committee of Sasquan, the 73rd World Science Fiction\nConvention, would like to address the matter of actions taken by Mr. Lou\nAntonelli with regards to one of our Guests of Honor, Mr. David\nGerrold.  On August 1st, Mr. Antonelli participated in a podcast in\nwhich he stated that he had written a letter to the Spokane Police\nDepartment, in which he stated to them that Mr. Gerrold was “insane and a\npublic danger and needs to be watched when the convention is going on”.\nNormally, online communications between members is not\nsomething in Sasquan’s purview to referee.  However, Mr. Antonelli’s\nletter, which requested police action against Mr. Gerrold during the\ntime of the convention, is within our purview.  As such, we found that\nthere was a strong possibility this act was a violation of\nour posted harassment policy\n[1], particularly if the letter had, in fact, been\nsent.\nThe Executive Committee then turned the matter over to our\nOperations Head, Ms. Robbie Bourget, who initiated formal proceedings in\naccordance with that policy. During these proceedings, it came to light\nthat Mr. Antonelli had issued a formal apology to Mr. Gerrold and\nadmitted culpability: he actually sent the letter, not merely claimed to\nhave sent it.\nWe thoroughly reviewed all available data,\nincluding email from both involved parties, social media postings,\ndiscussions with key committee members, and so forth. The inescapable\nconclusion was that Mr. Antonelli had violated our Code of Conduct in\nthis matter. The recommendation was to refund Mr. Antonelli’s membership\nand prohibit his entry to any convention location or function. However, after the recommendation was made, Mr. Gerrold, as the\naggrieved party, specifically requested that the Executive Committee set\naside this recommendation on the grounds that Mr. Antonelli did\napologize, is sending a retraction to the Spokane Police Department and\nbecause, as a Hugo Nominee, he deserves to attend the ceremony.\nThe Executive Committee has chosen to accept Mr. Gerrold’s request, and\nconsiders the matter closed as of this time.  Ms. Bourget has spoken and\ncorresponded with the Spokane Police Department, and they also consider\nthe matter closed.  We would like to thank Ms. Bourget for the calm\nprofessionalism she lent to the proceedings, and Mr. Antonelli and Mr.\nGerrold for coming to a settlement that benefits not just them, but the\nWorldcon and its members.\nSo, a single letter is sufficient to comprise code of conduct-violating harassment. This is good to know. Perhaps we should do a little looking into who contacted The Guardian, the New Zealand Herald, and other media outlets concerning Sad Puppies, as that most certainly constitutes harassment according to the Executive Committee.\nSad and Rabid Puppies, if you’re going to Sasquan, make sure you know the Code of Conduct cold, and if anyone so much as puts a toe across the line, shriek bloody murder. The precedent has now been set by the SJWs. Make use of it.\nWe already know that people have expressed similarly harassing concerns to Kevin Standlee, so keep your eyes open. Black knight them twice as hard. And for the love of all that is good, holy, and true, do NOT apologize to SJWs. Ever. Under any circumstances. How\nhard\nis this to understand?\nI repeat: you never, ever, apologize to SJWs.\nUPDATE: This comment at File 770 will likely amuse the VFM:\nOne of the things that has been so atrocious about Puppygate is the way\nthe Puppies seem not to give a damn about the collateral damage of their\nactions.\nThey’re just noticing this now? What part of “we don’t care” was hard to understand?",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-11T19:28:00+00:00"
}