{
  "url": "https://voxday.net/2015/08/25/what-will-vox-do/",
  "scraped_at": "2025-12-17T17:24:20.725279",
  "title": "What will Vox do?",
  "date_display": "August 25, 2015",
  "date_iso": "2015-08-25T16:00:00+00:00",
  "date_from_url": "2015-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJWs are worried:</p><p><i>“The real burning question is, ‘what will Vox Day attack next?’”</i><br> – Charles Stross</br></p><p><i>“What will happen in 2016. We both know the question is what will Vox Day<br> do? The Sad Puppy plans are secondary to what ever Vox Day does. I<br> assume he will try to run some kind of disruption campaign but what kind<br> we won’t know until next year.”</br></br></br></i><br> – Camestros Felapton</br></p><p><a href=\"https://pbs.twimg.com/media/CNQL0hBXAAA_qOn.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"https://pbs.twimg.com/media/CNQL0hBXAAA_qOn.jpg\" width=\"300\"/></a>Of course, I am not at liberty to reveal the Rabid Puppy 2 strategy, in part because we are still in the first two stages of the OODA loop, observing and orienting. (Sorry, Tom, I couldn’t resist.) But in the interest of further demoralizing the already-retreating enemy, I’m not reluctant to reveal one of the new weapons in our arsenal.</p><p>That’s right. The Evil Legion of Evil is training a corps of Amphibious Assault Otters. Armed with acid-filled squirt guns and supported by a crack squad of Attack Manatees, they will emerge from the rivers and literally melt the faces of the SJWs attempting to burn bridges as they continue to retreat. Good day, sir! <a href=\"https://40.media.tumblr.com/998e2257cbdd04feeb46a0556f0f499f/tumblr_ns5fzuuF3r1upo1beo1_1280.jpg\"><i>I said good day!</i></a></p><p>In other news, the International Lord of Hate has <a href=\"http://monsterhunternation.com/2015/08/24/sad-puppies-3-looking-at-the-results/\">pronounced his verdict</a> on the 2015 awards. He does not sound especially pleased with SF fandom. Consequences may never be the same.</p><blockquote class=\"tr_bq\"><p> Before Sad Puppies came along, Toni had never received a Hugo nomination. Zero. The above-mentioned Patrick Nielsen Hayden has <strike>8</strike> 15. Toni’s problem was that she just didn’t care and she didn’t play the WorldCon politics. Her only concern was making the fans happy. She publishes any author who can do that, regardless of their politics. She’s always felt that the real awards were in the royalty checks. Watching her get ignored was one of the things that spurred me into starting Sad Puppies. If anybody deserved the Hugo, it was her.</p><p>This year Toni got a whopping 1,216 first place votes for Best Editor. That isn’t just a record. That is FOUR TIMES higher than the previous record. Shelia Gilbert came in next with an amazing 754. I believe that Toni is such a class act that beforehand she even said she thought Shelia Gilbert deserved to win. Fans love Toni.</p><p>Logically you would think that she would be award worthy, since the only Baen books to be nominated for a Hugo prior to Sad Puppies were edited by her (Bujold) and none of those were No Awarded. Last year she had the most first place votes, and came in second only after the weird Australian Rules voting kicked in (don’t worry everybody, they just voted to make the system even more complicated), so she was apparently award worthy last year.</p><p>Toni Weisskopf has been part of organized Fandom (capital F) since she was a little kid, so all that bloviating about how Fandom is precious, and sacred, and your special home since the ‘70s which you need to keep as a safe space free of barbarians, blah, blah, blah, yeah, that applies to Toni just as much as it does to you CHORFs.  You know how you guys paid back her lifetime of involvement in Fandom?</p><p>By giving 2,496 votes to No Award….</p><p>The real winner this year was Vox Day and the Rabid Puppies. Yep. You<br> CHORFing idiots don’t seem to realize that Brad, Sarah, and I were the<br> reasonable ones who spent most of the summer talking Vox out of having<br> his people No Award the whole thing to burn it down, but then you did it<br> for him. He got the best of both worlds. Oh, but now you’re going to<br> say that Three Body Problem won, and that’s a victory for diversity! You<br> poor deluded fools… That was Vox’s pick for best novel. That’s the one<br> most of the Rabid Puppies voted for too.</br></br></br></br></br></br></br></p><p>Here’s something for you crowing imbeciles to think through, the only<br> reason Vox didn’t have Three Body Problem on his nomination slate was<br> that he read it a month too late. If he’d read it sooner, it would have<br> been an RP nomination… AND THEN YOU WOULD HAVE NO AWARDED IT.</br></br></br></p></blockquote><p>There is no question that the Rabid Puppies and I won this year. In addition to hand-picking Best Novel and burning five awards (we should have had seven, dammit), I received more votes for Best Editor than Patrick Nielsen Hayden ever has. Also, and perhaps more importantly, I’m not going to be fired for attacking a female Tor Books author in public at a professional venue.</p><p>Screaming about “blood libels” at a woman of Jewish descent, Patrick? Really?</p></div>",
  "content_text": "The SJWs are worried:\n“The real burning question is, ‘what will Vox Day attack next?’”\n– Charles Stross\n“What will happen in 2016. We both know the question is what will Vox Day\ndo? The Sad Puppy plans are secondary to what ever Vox Day does. I\nassume he will try to run some kind of disruption campaign but what kind\nwe won’t know until next year.”\n– Camestros Felapton\nOf course, I am not at liberty to reveal the Rabid Puppy 2 strategy, in part because we are still in the first two stages of the OODA loop, observing and orienting. (Sorry, Tom, I couldn’t resist.) But in the interest of further demoralizing the already-retreating enemy, I’m not reluctant to reveal one of the new weapons in our arsenal.\nThat’s right. The Evil Legion of Evil is training a corps of Amphibious Assault Otters. Armed with acid-filled squirt guns and supported by a crack squad of Attack Manatees, they will emerge from the rivers and literally melt the faces of the SJWs attempting to burn bridges as they continue to retreat. Good day, sir!\nI said good day!\nIn other news, the International Lord of Hate has\npronounced his verdict\non the 2015 awards. He does not sound especially pleased with SF fandom. Consequences may never be the same.\nBefore Sad Puppies came along, Toni had never received a Hugo nomination. Zero. The above-mentioned Patrick Nielsen Hayden has\n8\n15. Toni’s problem was that she just didn’t care and she didn’t play the WorldCon politics. Her only concern was making the fans happy. She publishes any author who can do that, regardless of their politics. She’s always felt that the real awards were in the royalty checks. Watching her get ignored was one of the things that spurred me into starting Sad Puppies. If anybody deserved the Hugo, it was her.\nThis year Toni got a whopping 1,216 first place votes for Best Editor. That isn’t just a record. That is FOUR TIMES higher than the previous record. Shelia Gilbert came in next with an amazing 754. I believe that Toni is such a class act that beforehand she even said she thought Shelia Gilbert deserved to win. Fans love Toni.\nLogically you would think that she would be award worthy, since the only Baen books to be nominated for a Hugo prior to Sad Puppies were edited by her (Bujold) and none of those were No Awarded. Last year she had the most first place votes, and came in second only after the weird Australian Rules voting kicked in (don’t worry everybody, they just voted to make the system even more complicated), so she was apparently award worthy last year.\nToni Weisskopf has been part of organized Fandom (capital F) since she was a little kid, so all that bloviating about how Fandom is precious, and sacred, and your special home since the ‘70s which you need to keep as a safe space free of barbarians, blah, blah, blah, yeah, that applies to Toni just as much as it does to you CHORFs.  You know how you guys paid back her lifetime of involvement in Fandom?\nBy giving 2,496 votes to No Award….\nThe real winner this year was Vox Day and the Rabid Puppies. Yep. You\nCHORFing idiots don’t seem to realize that Brad, Sarah, and I were the\nreasonable ones who spent most of the summer talking Vox out of having\nhis people No Award the whole thing to burn it down, but then you did it\nfor him. He got the best of both worlds. Oh, but now you’re going to\nsay that Three Body Problem won, and that’s a victory for diversity! You\npoor deluded fools… That was Vox’s pick for best novel. That’s the one\nmost of the Rabid Puppies voted for too.\nHere’s something for you crowing imbeciles to think through, the only\nreason Vox didn’t have Three Body Problem on his nomination slate was\nthat he read it a month too late. If he’d read it sooner, it would have\nbeen an RP nomination… AND THEN YOU WOULD HAVE NO AWARDED IT.\nThere is no question that the Rabid Puppies and I won this year. In addition to hand-picking Best Novel and burning five awards (we should have had seven, dammit), I received more votes for Best Editor than Patrick Nielsen Hayden ever has. Also, and perhaps more importantly, I’m not going to be fired for attacking a female Tor Books author in public at a professional venue.\nScreaming about “blood libels” at a woman of Jewish descent, Patrick? Really?",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-25T15:00:00+00:00"
}