{
  "url": "https://voxday.net/2015/08/05/what-passes-for-sjw-journalis/",
  "scraped_at": "2025-12-17T17:21:57.731733",
  "title": "What passes for SJW “journalism”",
  "date_display": "August 5, 2015",
  "date_iso": "2015-08-05T21:30:00+00:00",
  "date_from_url": "2015-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not just about ethics in science fiction journalism, it’s about the way SJWs regularly get the most basic facts completely wrong. Because – all together now – <i>SJWs always lie</i>:</p><blockquote class=\"tr_bq\"><p> Adam Roberts @arrroberts<br> In a nutshell, my thoughts on the 2015 Hugos kerfuffle.</br></p><p>“Nazis. I hate these guys.”</p><p>Metayahu@Metayahu <br> It’s even funnier because the white guy is married to a black woman.<br> NAZI</br></br></p><p>Adam Roberts @arrroberts<br> Since I nowhere call Torgerson (or anyone) a Nazi, I’m not sure of your point.</br></p><p>Peat Moss ‏@DrinkerOfScotch<br> Do you not see the picture included in your original tweet? The one that says “Nazis, I hate these guys”?</br></p><p>Adam Roberts @arrroberts<br> You were originally responding to my Guardian piece.</br></p><p>Peat Moss @DrinkerOfScotch<br> I wasn’t responding to anything previously. So you’re saying you just happened to mention Nazis and Hugos for no reason?</br></p><p>Adam Roberts @arrroberts<br> The ‘Nazis’ joke (from days before) was about Vox Day. Through to be accurate he’s not a Nazi: he’s a clerical fascist.</br></p><p>Peat Moss @DrinkerOfScotch<br> Thanks for the clarification. Good to know exactly what your biases are.</br></p><p>Adam Roberts @arrroberts<br> I have beliefs, predicated on principles, experience and thought. I’m sure you do too. Calling them ‘biases’ is merely rude</br></p><p>Peat Moss @DrinkerOfScotch<br> I think calling people fascists and misrepresenting the Sad Puppies as racist, sexist, and homophobic is just a bit more rude.</br></p><p>Adam Roberts @arrroberts<br> You are, perhaps, denying that Vox Day is a clerical fascist, or John C Wright a homophobe? We’ll have to agree to disagree</br></p><p>Peat Moss @DrinkerOfScotch<br> Vox Day is a libertarian. I disagree with many of his opinions, but he’s not trying to silence people or pass laws against them.</br></p><p>Filotto ‏@Filotto<br> no. We’ll have to agree you are an outrageous liar. @voxday is demonstarbly not fascist.</br></p><p>Adam Roberts @arrroberts<br> V.D. is a deeply religious Catholic with militaristic, racist and misogynistic views. He’s no common-garden libertarian.</br></p><p>Filotto ‏@Filotto<br> why do you lie so stupidly? @voxday is NOT a catholic. And you lie about the rest too.</br></p><p>Vox Day @voxday<br> You’re pig-ignorant, Roberts. I’m not a Catholic and never have been. I’m not racist or misogynistic either.</br></p><p>Vox Day @voxday<br> If you were an actual journalist, not an SJW parody of one, you’d talk to me, not to others about me.</br></p><p>Robert G Evans @drawncutlass<br> Well said.  The whole Sad Puppies controversy has been marked by unethical journalism.</br></p></blockquote><p>I’ll admit, I’m every bit as racist, sexist, misogynistic, homophobic, and white supremacist as I am Catholic. And Old Martian. The funny thing is that the most recent Catholics in my heritage are a) the Mexicans and b) the Native Americans, two basic facts about me that the SJWs are desperate to deny.</p><p>Isn’t it remarkable how they will so readily claim me to be that which I am not, while simultaneously omitting to mention that which I indisputably am?</p></div>",
  "content_text": "It’s not just about ethics in science fiction journalism, it’s about the way SJWs regularly get the most basic facts completely wrong. Because – all together now –\nSJWs always lie\n:\nAdam Roberts @arrroberts\nIn a nutshell, my thoughts on the 2015 Hugos kerfuffle.\n“Nazis. I hate these guys.”\nMetayahu@Metayahu\nIt’s even funnier because the white guy is married to a black woman.\nNAZI\nAdam Roberts @arrroberts\nSince I nowhere call Torgerson (or anyone) a Nazi, I’m not sure of your point.\nPeat Moss ‏@DrinkerOfScotch\nDo you not see the picture included in your original tweet? The one that says “Nazis, I hate these guys”?\nAdam Roberts @arrroberts\nYou were originally responding to my Guardian piece.\nPeat Moss @DrinkerOfScotch\nI wasn’t responding to anything previously. So you’re saying you just happened to mention Nazis and Hugos for no reason?\nAdam Roberts @arrroberts\nThe ‘Nazis’ joke (from days before) was about Vox Day. Through to be accurate he’s not a Nazi: he’s a clerical fascist.\nPeat Moss @DrinkerOfScotch\nThanks for the clarification. Good to know exactly what your biases are.\nAdam Roberts @arrroberts\nI have beliefs, predicated on principles, experience and thought. I’m sure you do too. Calling them ‘biases’ is merely rude\nPeat Moss @DrinkerOfScotch\nI think calling people fascists and misrepresenting the Sad Puppies as racist, sexist, and homophobic is just a bit more rude.\nAdam Roberts @arrroberts\nYou are, perhaps, denying that Vox Day is a clerical fascist, or John C Wright a homophobe? We’ll have to agree to disagree\nPeat Moss @DrinkerOfScotch\nVox Day is a libertarian. I disagree with many of his opinions, but he’s not trying to silence people or pass laws against them.\nFilotto ‏@Filotto\nno. We’ll have to agree you are an outrageous liar. @voxday is demonstarbly not fascist.\nAdam Roberts @arrroberts\nV.D. is a deeply religious Catholic with militaristic, racist and misogynistic views. He’s no common-garden libertarian.\nFilotto ‏@Filotto\nwhy do you lie so stupidly? @voxday is NOT a catholic. And you lie about the rest too.\nVox Day @voxday\nYou’re pig-ignorant, Roberts. I’m not a Catholic and never have been. I’m not racist or misogynistic either.\nVox Day @voxday\nIf you were an actual journalist, not an SJW parody of one, you’d talk to me, not to others about me.\nRobert G Evans @drawncutlass\nWell said.  The whole Sad Puppies controversy has been marked by unethical journalism.\nI’ll admit, I’m every bit as racist, sexist, misogynistic, homophobic, and white supremacist as I am Catholic. And Old Martian. The funny thing is that the most recent Catholics in my heritage are a) the Mexicans and b) the Native Americans, two basic facts about me that the SJWs are desperate to deny.\nIsn’t it remarkable how they will so readily claim me to be that which I am not, while simultaneously omitting to mention that which I indisputably am?",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-05T20:30:00+00:00"
}