{
  "url": "https://voxday.net/2015/08/23/wired-incorrectly/",
  "scraped_at": "2025-12-17T17:24:05.945643",
  "title": "A tale of two interviews",
  "date_display": "August 23, 2015",
  "date_iso": "2015-08-23T16:00:00+00:00",
  "date_from_url": "2015-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Once again, the Wall Street Journal did a much more equitable job of covering the Hugos than other media outlets as Michael Rapoport followed up his previous article on the nominations <a href=\"http://blogs.wsj.com/speakeasy/2015/08/23/no-puppy-love-at-science-fictions-hugo-awards/\">with one on the awards</a>:</p><blockquote class=\"tr_bq\"><p> Authors and fans who have opposed the Puppy campaigns said the results show that the science fiction fans who vote on the Hugos don’t want to see the field’s most prestigious award gamed.</p><p>“Good work was rewarded and bad action was penalized,” said novelist John Scalzi. “A small group of people tried to game the awards for their own gain, and a vastly larger group of people who valued the integrity of the awards responded by choosing ‘No Award’ over nominees they felt got on the ballot by gaming the system.”</p><p>But Theodore Beale, aka “Vox Day,” the writer and editor who organized the Rabid Puppies slate, characterized the results as a “scorched earth strategy,” and said liberals in science fiction “would rather burn down a historically prestigious award” than let the awards go to Puppy-backed nominees. It “demonstrates the extent to which science fiction has been politicized and degraded by their far left politics,” he said….</p><p>“This was the most optimal outcome with what we had to deal with,”<br> said author Kameron Hurley, another critic of the Puppies. “Really proud<br> of the community for rewarding deserving work and passing on so many of<br> the stacked categories.”</br></br></br></p><p>But Sarah Hoyt, a Sad Puppies organizer, said the “fury” of the<br> reaction to the Puppies has proven their point. “That is the reaction of<br> a small clique that has engaged in log rolling or years to reward its<br> followers and those they approved of,” she said before the Hugo<br> ceremony.</br></br></br></br></p><p>The Hugo ceremony mostly steered clear of direct references to the<br> controversy, apart from loud applause for some of the announcements of<br> “No Award.” “Please, God, let there be winners,” co-host David Gerrold<br> joked at one point, clutching a bunch of awards envelopes yet to be<br> opened.</br></br></br></br></p></blockquote><p> This <i>Wired </i>article<a href=\"http://www.wired.com/2015/08/won-science-fictions-hugo-awards-matters/\"> attempting to maintain the SJW Narrative</a> concerning the Hugos is mildly amusing for the author’s complete inability to keep up and follow the plot. It’s an example of Vox’s First Law in action, sprinkled with a few factual inaccuracies that appear to result from the writer’s attempt to maintain the narrative. But give Amy Wallace credit for at least talking to us:</p><blockquote class=\"tr_bq\"><p> Based on his voluminous writings, it can be said that Theodore Beale—who writes fiction as a hobby while working as a game designer—openly opposes racial diversity, homosexuality, and women’s suffrage. Beale quibbles with those assertions, as he did with me when I reached him at his home in Northern Italy. For example, he says he doesn’t oppose all women’s suffrage, just women (and most men) voting in a representative democracy, like the one we have, um, in America. The reason: “Women are very, very highly inclined to value security over liberty” and thus are “very, very easy to manipulate.” (He favors direct democracy—and, obviously, men). At one point, he emailed that he would be “very disappointed” if I failed to quote the Wall Street Journal’s label for him: “the most despised man in science fiction.”</p><p>A conversation with Beale feels sort of like walking around a room designed by MC Escher. It turns in on itself in unexpected and at times dizzying ways. A sampling: When I asked him why he once called noted fantasy author NK Jemisin an “educated, but ignorant half-savage” on his blog, he said it wasn’t because she is black, then launched into an explication of what he called “new” genetic research that he says he doesn’t expect very many people to understand (but which he claims supports his use of the term “half-savage”).</p><p>When I said that he was intentionally baiting a person of color with a word that has racial overtones, he acknowledged, “I’m calling her a half-savage because I know it’s going to offend the crap out of her, because she’s going to run around screaming, ‘Racist! Racist!’ for the next 10 years.”</p><p>A beat, and then he added: “I don’t consider all black people to be half-savages. I mean, some people are. Here in Europe, for example, we have actual proper Africans, not African-Americans. This leads to problems, like people shitting on top of the closed toilets. They don’t know how to use indoor plumbing, okay? This is not civilized behavior.”</p><p>Torgersen told me something that helped me understand Beale, which is that he believes Vox Day is a character Beale plays—“Performance art, like Andy Kaufman,” Torgersen said. “He embraces this nemesis role that he inhabits. He’s the dark star circling around the outer rim of the solar system. He’s Darth Vader breathing heavily into your phone. He wants people to be enraged and flipping out and tearing their hair and completely losing their minds. And he gets that every single time.”</p><p>Beale acknowledged as much: “I love chaos,” he says. “I am generally pretty destructive.”</p><p>Given this kind of incendiary rhetoric, it’s possible that the Sad Puppies were at best naïve when they let Beale piggyback on their idea. At worst, they have been accused of providing a politely moderate front for a shit-stirring provocateur. Certainly, both Correia and Torgersen have worked hard to distinguish themselves from Beale.</p><p>“Look at it like this,” Correia blogged at one point. “I’m Churchill, Brad is FDR. We wound up on the same side as Stalin.” But when I asked Torgersen whether he felt the Sad Puppies had been tarnished by their association with Beale, he said no. “If he went away, I don’t think it would have changed much. People would have been just as hacked off about Sad Puppies. They just would have found some other reason.”</p><p>For his part, Beale—who runs his own small publishing company, Castalia House, which got five of its writers and editors (including Beale himself) on this year’s Hugo ballot—has been outspoken about his goals. “I wanted to leave a big smoking hole where the Hugo Awards were,” he told me before the winners were announced. “All this has ever been is a giant Fuck You—one massive gesture of contempt.” Some nerds just want to watch the world burn.</p><p>Going forward, he said, no matter how the Hugo administrators modify the nominating process to try to prevent manipulation (and there are two proposals being considered), he will still have enough supporters to control future awards. Specifically, “I have 390 sworn and numbered vile faceless minions—the hardcore shock troops—who are sworn to mindless and perfect obedience,” he said, acknowledging that his army wasn’t made up solely of sci-fi fans. On the contrary, “the people who are very anti-SJW said, ‘Okay, we want to get in on this.’” When I asked him how he might deploy those people in the future, he continued, “It’s very simple. The dark lord speaks, the minion acts.”</p></blockquote><p>Corrections:</p><ol><li>I don’t favor direct democracy “and, obviously, men”, I favor direct democracy for all native-born adult citizens. Period.</li><li>I did not rely upon “genetic research” to justify my use of the term “half-savage” to describe NK Jemisin, I relied upon my Hypothesis of Time to Civilization, which is a combination of history and logic that the writer somehow managed to confuse with science. </li><li>I did not acknowledge the Torgersen’s claim of “performance art” but specifically denied it. </li><li>I have 400 Vile Faceless Minions, not 390, and the number is growing daily.</li><li>I am not a white male. I am a Red male. </li><li>Castalia House is not mine. I don’t own it, I’m just the lead editor. </li><li>GamerGate did not make a “political movement out of threatening with rape any woman who has the temerity to offer an opinion about a videogame.”</li></ol><p>Notice in particular the juxtaposition between “it can be said” and “quibbles with those assertions”. Translation: she said “Isn’t it true that….” to which I responded “No.” For crying out loud, as I explained to her, ANY support for direct democracy is intrinsically far MORE democratic than playing games about the specific limits on whom is permitted to choose between the two candidates offered by the bifactional ruling party.</p><p>My favorite part of the article was this: <i>“But even as Beale claimed victory, John Scalzi, a novelist and<br> three-time Hugo winner who has been among their most outspoken<br> opponents, said the war was over.”</br></br></i></p><p>SJWs always lie.</p><p>You may not like what I say one little bit, but it’s hard to argue that I don’t tell the truth. Granted, it’s only been just over two years as yet, but NK Jemisin is still running around screaming “racist, racist!” You’ll note that the writer didn’t see fit to quote Jemisin calling Robert Heinlein and “most of SF fandom” “racist as *fuck*”. And lest you think I was inventing Europe’s indoor plumbing problem, there is a reason you’ll now see these signs at the train stations when traveling through Switzerland and Germany.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://images.indianexpress.com/2015/07/toilet759.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"177\" src=\"http://images.indianexpress.com/2015/07/toilet759.jpg\" width=\"320\"/></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.dailymail.co.uk/i/pix/2015/07/03/21/2A36AA6D00000578-3148808-image-m-3_1435955913114.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"></a></div></div>",
  "content_text": "Once again, the Wall Street Journal did a much more equitable job of covering the Hugos than other media outlets as Michael Rapoport followed up his previous article on the nominations\nwith one on the awards\n:\nAuthors and fans who have opposed the Puppy campaigns said the results show that the science fiction fans who vote on the Hugos don’t want to see the field’s most prestigious award gamed.\n“Good work was rewarded and bad action was penalized,” said novelist John Scalzi. “A small group of people tried to game the awards for their own gain, and a vastly larger group of people who valued the integrity of the awards responded by choosing ‘No Award’ over nominees they felt got on the ballot by gaming the system.”\nBut Theodore Beale, aka “Vox Day,” the writer and editor who organized the Rabid Puppies slate, characterized the results as a “scorched earth strategy,” and said liberals in science fiction “would rather burn down a historically prestigious award” than let the awards go to Puppy-backed nominees. It “demonstrates the extent to which science fiction has been politicized and degraded by their far left politics,” he said….\n“This was the most optimal outcome with what we had to deal with,”\nsaid author Kameron Hurley, another critic of the Puppies. “Really proud\nof the community for rewarding deserving work and passing on so many of\nthe stacked categories.”\nBut Sarah Hoyt, a Sad Puppies organizer, said the “fury” of the\nreaction to the Puppies has proven their point. “That is the reaction of\na small clique that has engaged in log rolling or years to reward its\nfollowers and those they approved of,” she said before the Hugo\nceremony.\nThe Hugo ceremony mostly steered clear of direct references to the\ncontroversy, apart from loud applause for some of the announcements of\n“No Award.” “Please, God, let there be winners,” co-host David Gerrold\njoked at one point, clutching a bunch of awards envelopes yet to be\nopened.\nThis\nWired\narticle\nattempting to maintain the SJW Narrative\nconcerning the Hugos is mildly amusing for the author’s complete inability to keep up and follow the plot. It’s an example of Vox’s First Law in action, sprinkled with a few factual inaccuracies that appear to result from the writer’s attempt to maintain the narrative. But give Amy Wallace credit for at least talking to us:\nBased on his voluminous writings, it can be said that Theodore Beale—who writes fiction as a hobby while working as a game designer—openly opposes racial diversity, homosexuality, and women’s suffrage. Beale quibbles with those assertions, as he did with me when I reached him at his home in Northern Italy. For example, he says he doesn’t oppose all women’s suffrage, just women (and most men) voting in a representative democracy, like the one we have, um, in America. The reason: “Women are very, very highly inclined to value security over liberty” and thus are “very, very easy to manipulate.” (He favors direct democracy—and, obviously, men). At one point, he emailed that he would be “very disappointed” if I failed to quote the Wall Street Journal’s label for him: “the most despised man in science fiction.”\nA conversation with Beale feels sort of like walking around a room designed by MC Escher. It turns in on itself in unexpected and at times dizzying ways. A sampling: When I asked him why he once called noted fantasy author NK Jemisin an “educated, but ignorant half-savage” on his blog, he said it wasn’t because she is black, then launched into an explication of what he called “new” genetic research that he says he doesn’t expect very many people to understand (but which he claims supports his use of the term “half-savage”).\nWhen I said that he was intentionally baiting a person of color with a word that has racial overtones, he acknowledged, “I’m calling her a half-savage because I know it’s going to offend the crap out of her, because she’s going to run around screaming, ‘Racist! Racist!’ for the next 10 years.”\nA beat, and then he added: “I don’t consider all black people to be half-savages. I mean, some people are. Here in Europe, for example, we have actual proper Africans, not African-Americans. This leads to problems, like people shitting on top of the closed toilets. They don’t know how to use indoor plumbing, okay? This is not civilized behavior.”\nTorgersen told me something that helped me understand Beale, which is that he believes Vox Day is a character Beale plays—“Performance art, like Andy Kaufman,” Torgersen said. “He embraces this nemesis role that he inhabits. He’s the dark star circling around the outer rim of the solar system. He’s Darth Vader breathing heavily into your phone. He wants people to be enraged and flipping out and tearing their hair and completely losing their minds. And he gets that every single time.”\nBeale acknowledged as much: “I love chaos,” he says. “I am generally pretty destructive.”\nGiven this kind of incendiary rhetoric, it’s possible that the Sad Puppies were at best naïve when they let Beale piggyback on their idea. At worst, they have been accused of providing a politely moderate front for a shit-stirring provocateur. Certainly, both Correia and Torgersen have worked hard to distinguish themselves from Beale.\n“Look at it like this,” Correia blogged at one point. “I’m Churchill, Brad is FDR. We wound up on the same side as Stalin.” But when I asked Torgersen whether he felt the Sad Puppies had been tarnished by their association with Beale, he said no. “If he went away, I don’t think it would have changed much. People would have been just as hacked off about Sad Puppies. They just would have found some other reason.”\nFor his part, Beale—who runs his own small publishing company, Castalia House, which got five of its writers and editors (including Beale himself) on this year’s Hugo ballot—has been outspoken about his goals. “I wanted to leave a big smoking hole where the Hugo Awards were,” he told me before the winners were announced. “All this has ever been is a giant Fuck You—one massive gesture of contempt.” Some nerds just want to watch the world burn.\nGoing forward, he said, no matter how the Hugo administrators modify the nominating process to try to prevent manipulation (and there are two proposals being considered), he will still have enough supporters to control future awards. Specifically, “I have 390 sworn and numbered vile faceless minions—the hardcore shock troops—who are sworn to mindless and perfect obedience,” he said, acknowledging that his army wasn’t made up solely of sci-fi fans. On the contrary, “the people who are very anti-SJW said, ‘Okay, we want to get in on this.’” When I asked him how he might deploy those people in the future, he continued, “It’s very simple. The dark lord speaks, the minion acts.”\nCorrections:\nI don’t favor direct democracy “and, obviously, men”, I favor direct democracy for all native-born adult citizens. Period.\nI did not rely upon “genetic research” to justify my use of the term “half-savage” to describe NK Jemisin, I relied upon my Hypothesis of Time to Civilization, which is a combination of history and logic that the writer somehow managed to confuse with science.\nI did not acknowledge the Torgersen’s claim of “performance art” but specifically denied it.\nI have 400 Vile Faceless Minions, not 390, and the number is growing daily.\nI am not a white male. I am a Red male.\nCastalia House is not mine. I don’t own it, I’m just the lead editor.\nGamerGate did not make a “political movement out of threatening with rape any woman who has the temerity to offer an opinion about a videogame.”\nNotice in particular the juxtaposition between “it can be said” and “quibbles with those assertions”. Translation: she said “Isn’t it true that….” to which I responded “No.” For crying out loud, as I explained to her, ANY support for direct democracy is intrinsically far MORE democratic than playing games about the specific limits on whom is permitted to choose between the two candidates offered by the bifactional ruling party.\nMy favorite part of the article was this:\n“But even as Beale claimed victory, John Scalzi, a novelist and\nthree-time Hugo winner who has been among their most outspoken\nopponents, said the war was over.”\nSJWs always lie.\nYou may not like what I say one little bit, but it’s hard to argue that I don’t tell the truth. Granted, it’s only been just over two years as yet, but NK Jemisin is still running around screaming “racist, racist!” You’ll note that the writer didn’t see fit to quote Jemisin calling Robert Heinlein and “most of SF fandom” “racist as *fuck*”. And lest you think I was inventing Europe’s indoor plumbing problem, there is a reason you’ll now see these signs at the train stations when traveling through Switzerland and Germany.",
  "tags": [
    "Hugo Award",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-23T15:00:00+00:00"
}