{
  "url": "https://voxday.net/2015/08/01/xanatos-unveiled/",
  "scraped_at": "2025-12-17T17:21:42.322068",
  "title": "Xanatos unveiled",
  "date_display": "August 1, 2015",
  "date_iso": "2015-08-01T11:18:00+00:00",
  "date_from_url": "2015-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know, of all the SJWs in science fiction, I would have thought that John O’Neill would have known me well enough by now to understand that I am an accomplished player of games. I mean, I contributed to Black Gate for several years and a fair number of my posts were game-related. I thought he knew me better. But, in any event, <a href=\"https://www.blackgate.com/2015/07/31/i-voted-for-the-hugos/\">he explained his 2015 Hugo ballot</a> at Black Gate.</p><blockquote class=\"tr_bq\"><p> I’ve explained my rationale elsewhere, and I won’t rehash all that again, but in short — regardless of how the voting goes, the Puppies have made it abundantly clear that their primary goal is to have their ballot accepted. Having the bulk of fandom acknowledge their ballot as legitimate, and having their nominees read and voted on, paves the way for future Hugo ballots to be decided the same way: through the Puppies aggressive form of slate voting, which I feel drowns out far too much worthy fiction in favor of the Puppies extremely narrow selection process (dictated almost entirely by two individuals).</p><p>Or to put it another way: Any slate in which Vox Day puts eleven works from his own tiny publishing house on the Hugo ballot — and nominates himself for two Hugos — will have a hard time convincing me that it is anything other than a naked Hugo grab, poorly masquerading as a reactionary literary movement.</p></blockquote><p>Now that the voting is complete, I will simply quote Mr. Correia.</p><p><i>“Vox is off doing his own thing. You tried to shun a man who is<br> incapable of being shunned. He got kicked out of the market, so went and<br> built his own market. The more you go after him, the stronger he gets. I<br> don’t think you guys realize that most of me and Brad’s communication<br> with Vox consists of us asking him to be nice and not burn it all down<br> out of spite.”</br></br></br></br></br></i><b> </b></p><p>I like Larry. I like Brad. They’re good men. I respect them both. And out of my respect for them, I agreed to play it straight this year, support Sad Puppies, and refrain from nuking the Awards. (The VFM were champing at the bit to burn SOMETHING and there was a category that eminently had it coming, so I graciously acceded to their humble requests and unleashed them.) That is why I wish I was more surprised to observe that the science fiction SJWs were dumb enough <i>to do what the Dark Lord wanted</i> in order to teach <i>Brad and Larry</i> a lesson.</p><p>See, now <i>that’s</i> what a fucking Xanatos Gambit looks like, bitches.</p><p>Note to Richard Brandt: I am not the habit of keeping my self-appointed enemies informed of my true intentions at all times. I said I would support Sad Puppies. I supported Sad Puppies. I kept my word. That’s what I do, even if it means running the risk of delayed gratification. Fortunately, as I anticipated, the SJWs were almost as outraged by Brad’s recommendations as they were by mine.</p><p>My intentions were always right out there in the open for anyone with the wit to see it. Based on some of his wry commentary, I suspect Mike Glyer knew. The Dread Ilk certainly understood. I even warned the SJWs that if they went No Award this year on the basis of their disapproval of our award pimpage, they’d have no grounds to complain about our utilization of their tactics in the future, only not in revenge, but because that was the goal. In addition to not voting No Award across the board, we also didn’t respond to any of their shady tactics, not Mary Kowal’s vote-buying, not the various proposed rule changes, not the spurious disqualification of John C. Wright’s sixth Hugo nomination.</p><p>The reason is that I wanted our hands to remain entirely clean this year and to gauge the true strength of the motivated opposition. Why buy 500 votes when we’ve learned that <a href=\"https://archive.today/GiRUP\">Kowal only bought 75</a>?</p><p>Next year, we bring the noise. Sad Puppies won’t be led by the Cuddly Care Bear, but by Kate the Impaler. The VFM will grow in size and malice, and the GG-inspired counterattack will spread into new industries. Next year, Rabid Puppies will utilize every useful tactic, explore every potentially usable angle. Because we’re not here to win awards, we’re here to kick ass and chew SJWs. John O’Neill has never grasped that. For some reason, he still thinks we are craving the approval of the human wreckage that risibly deems itself a literary elite.</p><blockquote class=\"tr_bq\"><p> The last few months has been a remarkably dynamic and exciting time for fandom. The Sad Puppies and Rabid Puppies accomplished something absolutely incredible: joining together to make a resounding statement about the current state of science fiction awards, and forcing the entire industry to sit up and take notice. They have, without question, been the single largest story in fandom this year.</p><p>Unfortunately, the subsequent discussion has been a Public Relations disaster for the Puppies. When the eyes of the world were upon them (and while they were admittedly being unfairly criticized by people who misunderstood what they were really about), the Puppies responded by relentlessly going on the attack, hurling bombs at “SJWs,” liberals, secret cartels controlling the Hugos, and (especially, and rather senselessly) Tor, the publisher that has tirelessly promoted and sold many of the authors they championed.</p><p>In short, four months ago the Puppies grabbed the microphone and stood on stage in front of the entire industry. They seized the genre by the throat, and had a golden opportunity to make their point. And instead, they simply proved that they had nothing of any real value to say.</p><p>Today, the Sad Puppies are already seen as a spent force. Irrelevant, misguided, and not particularly very interesting. Perhaps I’ll be be proven wrong, and when the Hugo Winners are announced at Sasquan in Spokane, Washington, on August 22, the Puppies will sweep again, just as they swept the nominations.</p><p>But I don’t think so. I think the result will be quite the opposite, and the Puppies will be swept aside in a wave of NO AWARDs. When that happens, I’m sure there will be plenty of dark muttering about “next year.” But by then, the microphone will have been turned off, and the audience will be long gone. The Puppies are part of history; they just don’t know it.</p></blockquote><p>Yeah, they said much the same last year too. The problem is that John still thinks we seized the genre by the throat in order to make a point. We’re not making a point, we’re strangling an evil and obnoxious ideology. And we have only begun to squeeze.</p><p>Later this month, one of two things will happen. Either one-third of the Hugo Awards will be obliterated or the twenty-year dominance of the science fiction SJWs will be publicly shattered for the world to see. The former is a win for Rabid Puppies, the latter is a win for everyone except the SJWs, but in particular for the Sad Puppies. And if the former result is not quite as dramatic as I would have liked, well, we can always seek to do better next year.</p><p>On a tangential note, I appreciated this response to one of O’Neill’s sillier statements in the comments:</p><blockquote class=\"tr_bq\"><p> <i>“In short, the Puppy slate just doesn’t measure up.”</i></p><p>“<b><a href=\"http://www.amazon.com/Riding-Red-Horse-Vox-Day-ebook/dp/B00QZD9H5K/ref=sr_1_1?ie=UTF8&amp;qid=1438428537&amp;sr=8-1&amp;keywords=riding+the+red+horse\"><i>Riding the Red Horse</i></a></b> is the first great mil-sf anthology since Jerry Pournelle tapered off back in the 90′s.”</p></blockquote><p>To summarize: We are the reavers and the renegades, the rebels and the revolutionaries, and we<br> don’t give a quantum of a damn about pieces of plastic or the insider<br> approval they represent.</br></br></p></div>",
  "content_text": "You know, of all the SJWs in science fiction, I would have thought that John O’Neill would have known me well enough by now to understand that I am an accomplished player of games. I mean, I contributed to Black Gate for several years and a fair number of my posts were game-related. I thought he knew me better. But, in any event,\nhe explained his 2015 Hugo ballot\nat Black Gate.\nI’ve explained my rationale elsewhere, and I won’t rehash all that again, but in short — regardless of how the voting goes, the Puppies have made it abundantly clear that their primary goal is to have their ballot accepted. Having the bulk of fandom acknowledge their ballot as legitimate, and having their nominees read and voted on, paves the way for future Hugo ballots to be decided the same way: through the Puppies aggressive form of slate voting, which I feel drowns out far too much worthy fiction in favor of the Puppies extremely narrow selection process (dictated almost entirely by two individuals).\nOr to put it another way: Any slate in which Vox Day puts eleven works from his own tiny publishing house on the Hugo ballot — and nominates himself for two Hugos — will have a hard time convincing me that it is anything other than a naked Hugo grab, poorly masquerading as a reactionary literary movement.\nNow that the voting is complete, I will simply quote Mr. Correia.\n“Vox is off doing his own thing. You tried to shun a man who is\nincapable of being shunned. He got kicked out of the market, so went and\nbuilt his own market. The more you go after him, the stronger he gets. I\ndon’t think you guys realize that most of me and Brad’s communication\nwith Vox consists of us asking him to be nice and not burn it all down\nout of spite.”\nI like Larry. I like Brad. They’re good men. I respect them both. And out of my respect for them, I agreed to play it straight this year, support Sad Puppies, and refrain from nuking the Awards. (The VFM were champing at the bit to burn SOMETHING and there was a category that eminently had it coming, so I graciously acceded to their humble requests and unleashed them.) That is why I wish I was more surprised to observe that the science fiction SJWs were dumb enough\nto do what the Dark Lord wanted\nin order to teach\nBrad and Larry\na lesson.\nSee, now\nthat’s\nwhat a fucking Xanatos Gambit looks like, bitches.\nNote to Richard Brandt: I am not the habit of keeping my self-appointed enemies informed of my true intentions at all times. I said I would support Sad Puppies. I supported Sad Puppies. I kept my word. That’s what I do, even if it means running the risk of delayed gratification. Fortunately, as I anticipated, the SJWs were almost as outraged by Brad’s recommendations as they were by mine.\nMy intentions were always right out there in the open for anyone with the wit to see it. Based on some of his wry commentary, I suspect Mike Glyer knew. The Dread Ilk certainly understood. I even warned the SJWs that if they went No Award this year on the basis of their disapproval of our award pimpage, they’d have no grounds to complain about our utilization of their tactics in the future, only not in revenge, but because that was the goal. In addition to not voting No Award across the board, we also didn’t respond to any of their shady tactics, not Mary Kowal’s vote-buying, not the various proposed rule changes, not the spurious disqualification of John C. Wright’s sixth Hugo nomination.\nThe reason is that I wanted our hands to remain entirely clean this year and to gauge the true strength of the motivated opposition. Why buy 500 votes when we’ve learned that\nKowal only bought 75\n?\nNext year, we bring the noise. Sad Puppies won’t be led by the Cuddly Care Bear, but by Kate the Impaler. The VFM will grow in size and malice, and the GG-inspired counterattack will spread into new industries. Next year, Rabid Puppies will utilize every useful tactic, explore every potentially usable angle. Because we’re not here to win awards, we’re here to kick ass and chew SJWs. John O’Neill has never grasped that. For some reason, he still thinks we are craving the approval of the human wreckage that risibly deems itself a literary elite.\nThe last few months has been a remarkably dynamic and exciting time for fandom. The Sad Puppies and Rabid Puppies accomplished something absolutely incredible: joining together to make a resounding statement about the current state of science fiction awards, and forcing the entire industry to sit up and take notice. They have, without question, been the single largest story in fandom this year.\nUnfortunately, the subsequent discussion has been a Public Relations disaster for the Puppies. When the eyes of the world were upon them (and while they were admittedly being unfairly criticized by people who misunderstood what they were really about), the Puppies responded by relentlessly going on the attack, hurling bombs at “SJWs,” liberals, secret cartels controlling the Hugos, and (especially, and rather senselessly) Tor, the publisher that has tirelessly promoted and sold many of the authors they championed.\nIn short, four months ago the Puppies grabbed the microphone and stood on stage in front of the entire industry. They seized the genre by the throat, and had a golden opportunity to make their point. And instead, they simply proved that they had nothing of any real value to say.\nToday, the Sad Puppies are already seen as a spent force. Irrelevant, misguided, and not particularly very interesting. Perhaps I’ll be be proven wrong, and when the Hugo Winners are announced at Sasquan in Spokane, Washington, on August 22, the Puppies will sweep again, just as they swept the nominations.\nBut I don’t think so. I think the result will be quite the opposite, and the Puppies will be swept aside in a wave of NO AWARDs. When that happens, I’m sure there will be plenty of dark muttering about “next year.” But by then, the microphone will have been turned off, and the audience will be long gone. The Puppies are part of history; they just don’t know it.\nYeah, they said much the same last year too. The problem is that John still thinks we seized the genre by the throat in order to make a point. We’re not making a point, we’re strangling an evil and obnoxious ideology. And we have only begun to squeeze.\nLater this month, one of two things will happen. Either one-third of the Hugo Awards will be obliterated or the twenty-year dominance of the science fiction SJWs will be publicly shattered for the world to see. The former is a win for Rabid Puppies, the latter is a win for everyone except the SJWs, but in particular for the Sad Puppies. And if the former result is not quite as dramatic as I would have liked, well, we can always seek to do better next year.\nOn a tangential note, I appreciated this response to one of O’Neill’s sillier statements in the comments:\n“In short, the Puppy slate just doesn’t measure up.”\n“\nRiding the Red Horse\nis the first great mil-sf anthology since Jerry Pournelle tapered off back in the 90′s.”\nTo summarize: We are the reavers and the renegades, the rebels and the revolutionaries, and we\ndon’t give a quantum of a damn about pieces of plastic or the insider\napproval they represent.",
  "tags": [
    "Black Gate",
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-08-01T10:18:00+00:00"
}