{
  "url": "https://voxday.net/2016/05/01/all-ur-base-no-longer-belongs-2-u/",
  "scraped_at": "2025-12-17T17:56:06.844287",
  "title": "All ur base no longer belongs 2 u",
  "date_display": "May 1, 2016",
  "date_iso": "2016-05-01T15:30:00+00:00",
  "date_from_url": "2016-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jerry Pournelle reflects upon Peggy Noonan’s dawning horror that <a href=\"https://www.jerrypournelle.com/chaosmanor/noonan-on-trump-trump-and-america-first-conservatism-on-immigration-and-other-matters/\">the Republican base is no longer what passes for conservative</a>:</p><blockquote class=\"tr_bq\"><p> <i>“Those conservative writers and thinkers who have for nine months warned the base that Mr. Trump is not a conservative should consider the idea that a large portion of the Republican base no longer sees itself as conservative, at least as that term has been defined the past 15 years by Washington writers and thinkers.” </i></p><p>The Second Gulf War saw us invading Iraq in response to the al Qaeda attack on New York, although there was zero evidence that Saddam had anything to do with it. Then came Afghanistan. In each case we sent just enough to do the job, but not overwhelming force to achieve victory – likely impossible in Afghanistan unless we were prepared for decades of occupation, and given the Soviet experience even that was likely to be arduous. All of this seemed to be destroying monsters, not protecting the liberty of the American people.</p><p>Some of us said so at the time. The response from National Review, once (when under Bill Buckley) the voice of the American Conservative Movement, was to feature the Egregious Frum reading out of the Conservative Movement all those who did not enthusiastically support the invasion of Iraq. Since that time I have not been “a conservative”. Paleo-conservative, perhaps; one who believes Edmund Burke and Russell Kirk have much to teach us; yes. But officially not a conservative according to <i>National Review</i>. Since I am not one of them by their own account, having been read out of their movement, I have no obligation to defend their policies – not that I ever defended all of them; after all, they did read me out of their ranks because I opposed the long war in Mesopotamia, did not think we could build democracy in a “nation” composed of Kurds, Shia majority, and Sunni, and ruled by Baathists, and thought we had no business expending blood and treasure when we had no describable national interests.</p><p>Trump’s people think the same way: patriotism trumps ideology. That is, of course, a very conservative principle, or was when I was teaching political science; apparently it is not so now. Miss Noonan sees it; I doubt the neoconservatives who have become to leaders of the conservative Movement will understand, or care; but perhaps the American voters will. Reagan was no ideologue, and he won. True: Trump is no Reagan; but you know, Mr. Reagan was not always Ronald the Great either. But he was always a patriot.</p></blockquote><p>At 81, Dr. Pournelle is still far sharper than the average bear. He’s pointing out something very important that has escaped nearly every political commentator, including me, which is that for decades, beginning with the John Birch Society, conservatives have been reading people out of the conservative movement.</p><p>And now, they have read so many people out of conservatism that the movement is no longer, in any practical sense of the term, a popular movement anymore. I’m an alt right figurehead, but I’m no conservative. Jerry is an old school Cold Warrior, but he’s no conservative. From Ann Coulter to John Derbyshire to Mark Steyn to Paul Craig Roberts, the best intellects of the right are all ex-conservatives.</p><p>And now the Republican base, has realized that they, too, have been effectively read out. Just as the Democratic Party left Ronald Reagan, conservatism has left the Republican grass roots behind.</p></div>",
  "content_text": "Jerry Pournelle reflects upon Peggy Noonan’s dawning horror that\nthe Republican base is no longer what passes for conservative\n:\n“Those conservative writers and thinkers who have for nine months warned the base that Mr. Trump is not a conservative should consider the idea that a large portion of the Republican base no longer sees itself as conservative, at least as that term has been defined the past 15 years by Washington writers and thinkers.”\nThe Second Gulf War saw us invading Iraq in response to the al Qaeda attack on New York, although there was zero evidence that Saddam had anything to do with it. Then came Afghanistan. In each case we sent just enough to do the job, but not overwhelming force to achieve victory – likely impossible in Afghanistan unless we were prepared for decades of occupation, and given the Soviet experience even that was likely to be arduous. All of this seemed to be destroying monsters, not protecting the liberty of the American people.\nSome of us said so at the time. The response from National Review, once (when under Bill Buckley) the voice of the American Conservative Movement, was to feature the Egregious Frum reading out of the Conservative Movement all those who did not enthusiastically support the invasion of Iraq. Since that time I have not been “a conservative”. Paleo-conservative, perhaps; one who believes Edmund Burke and Russell Kirk have much to teach us; yes. But officially not a conservative according to\nNational Review\n. Since I am not one of them by their own account, having been read out of their movement, I have no obligation to defend their policies – not that I ever defended all of them; after all, they did read me out of their ranks because I opposed the long war in Mesopotamia, did not think we could build democracy in a “nation” composed of Kurds, Shia majority, and Sunni, and ruled by Baathists, and thought we had no business expending blood and treasure when we had no describable national interests.\nTrump’s people think the same way: patriotism trumps ideology. That is, of course, a very conservative principle, or was when I was teaching political science; apparently it is not so now. Miss Noonan sees it; I doubt the neoconservatives who have become to leaders of the conservative Movement will understand, or care; but perhaps the American voters will. Reagan was no ideologue, and he won. True: Trump is no Reagan; but you know, Mr. Reagan was not always Ronald the Great either. But he was always a patriot.\nAt 81, Dr. Pournelle is still far sharper than the average bear. He’s pointing out something very important that has escaped nearly every political commentator, including me, which is that for decades, beginning with the John Birch Society, conservatives have been reading people out of the conservative movement.\nAnd now, they have read so many people out of conservatism that the movement is no longer, in any practical sense of the term, a popular movement anymore. I’m an alt right figurehead, but I’m no conservative. Jerry is an old school Cold Warrior, but he’s no conservative. From Ann Coulter to John Derbyshire to Mark Steyn to Paul Craig Roberts, the best intellects of the right are all ex-conservatives.\nAnd now the Republican base, has realized that they, too, have been effectively read out. Just as the Democratic Party left Ronald Reagan, conservatism has left the Republican grass roots behind.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-01T14:30:00+00:00"
}