{
  "url": "https://voxday.net/2016/05/03/because-its-worked-so-well-so-far/",
  "scraped_at": "2025-12-17T17:56:18.298149",
  "title": "Because it’s worked so well so far",
  "date_display": "May 3, 2016",
  "date_iso": "2016-05-03T11:30:00+00:00",
  "date_from_url": "2016-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Secret Masters of Fandom are retreating to what appears to be the science fiction community’s one and only tactic even before they see the effects of their first round of rules changes. From a Facebook discussion:</p><blockquote class=\"tr_bq\"><p> Kevin Standlee<br> A factor regarding invoking the convention Code of Conduct against Griefers (I’m looking at Christopher J Garcia and Sean Wallace in particular) and disqualifying their ballots and revoking their memberships that only came to me this morning:</br></p><p>The current Worldcon in Kansas City does have the right to regulate its own membership. They could, if they so choose, decide to revoke the memberships of individuals for just about any reasons unless it was prohibited by law. So in theory they could revoke the memberships of individual members who they believed were violating their Code of Conduct by the way they cast their Hugo Award nominating ballots.</p><p>However, what about the members of the Spokane and Helsinki Worldcons? All of their members as of January 31, 2016 were also eligible to nominate. Kansas City is obliged to honor those nominations as part of the WSFS Constitution, which is the “contract” under which MidAmeriCon II was granted the right to hold the 2016 Worldcon. MAC2 does not have jurisdiction over the memberships of the 2015 and 2017 Worldcons. They don’t have the right to revoke the memberships of members of either of those two conventions. If, as seems likely to me, most of the Griefers are coasting along on the memberships they bought to Sasquan, MAC2 doesn’t seem to me to have the right to ignore those persons’ votes — not unless they could somehow get the legal remnant of the 2015 Worldcon committee to revoke those persons’ memberships.</p><p>Yes, I know I’m being legalistic. That’s what I do. Throwing out the rule of law just because you don’t like how some people voted is IMO giving the Griefers exactly what they want — a plausible legal excuse to hammer the Hugo Awards and Worldcon with. They’re trying to goad us into an extra-legal response.</p><p>David Dyer-Bennet<br> Lacking the Arisians to identify and certify a reliable supply of “philosopher kings”, I think rule of law is our best choice, however annoying some of the intermediate steps may be.</br></p><p>Christopher J Garcia<br> It’s not about the votes – it’s about the use of the Hugos as a platform for a hate group..</br></p><p>Kevin Standlee<br> You’d need to withdraw the nominating rights from the previous/subsequent years’ members in order to give a single legal entity (the current Worldcon) the right to revoke the memberships (and thus not count the ballots) of the people you consider unworthy of voting, for whatever reason, including being part of what you’ve decided is a hate group.</br></p><p>Christopher J Garcia<br> It’s not about the voting. It’s allowing members of a hate group (and the Rabid Puppies qualify as such under the SPLC, ADL, and FBI definitions) to opperate within the awards. We are implicitly accepting their presence by not acting to remove them.</br></p><p>Kevin Standlee<br> No. You are only a member of WSFS for the current “Worldcon Year,” which runs from end of Worldcon to end of Worldcon. There are, however, residual rights that attach to past and future Worldcons of which you may be a member.</br></p><p>Kevin Standlee<br> I don’t dispute that there is a de facto hate group acting here. What I’m saying is that while an individual Worldcon may choose to revoke the memberships of its members for any non-prohibited-by-law reason, they cannot IMO legally revoke. Incidentally, one of the “residual rights” is to inspect the accounts of the Worldcon of which you were a member. The “sunshine clause” is rarely invoked, but it is in there.</br></p><p>Christopher Carson<br> It’s not about the votes, it’s not about the nominations — so you’re mad at an abstract concept?</br></p><p>Michael Lee<br> I could make the case that the code of conduct applies to all participants in an activity of a particular convention, and that the nomination phase is an activity not of three conventions, but of one particular convention, so that individual convention’s code of conduct would apply. And it is the responsibility of an individual convention to administer the Hugo Awards.</br></p><p>Kevin Standlee<br> Michael Lee I can see your point; however, I can also see that if I were a member of the previous Worldcon who had my vote tossed by the current Worldcon, I would have standing to sue to the current Worldcon for failing to abide by the terms of their contract (the WSFS Constitution).</br></p><p>Kevin Standlee<br> Codes of conduct aren’t mentioned in the WSFS Constitution, so it’s unclear just how much any one convention’s CoC can have jurisdiction over another convention’s members. In particular, look at this section of the WSFS Constitution:</br></p><p>Section 1.6: Authority. Authority and responsibility for all matters concerning the Worldcon, except those reserved herein to WSFS, shall rest with the Worldcon Committee, which shall act in its own name and not in that of WSFS. And that seems to me to give a Worldcon to regulate its own members, but not any other convention’s members.</p><p>Linda Deneroff<br> I thought well prior to 2012 the WSFS Constitution permitted the prior year’s worldcon members to nominate, but back before computers it was nearly impossible to make it practical or viable.</br></p><p>Kevin Standlee<br> Prior years’ members have been eligible to nominate since 1989. The subsequent year’s members were only extended the nominating privilege effective in 2012 (ratified in 2011).</br></p><p>Christopher Hensley<br> Which is why I am a little miffed at Sasquan. They actually had the power to do it, but they did not.</br></p><p>Linda Deneroff<br> 20-20 hindsight is wonderful.</br></p><p>Christopher Hensley<br> To be fair, they are doing exactly what they said they would do since the nominating period opened last year.</br></p><p>Aaron Kashtan<br> Wouldn’t it be better to create a rule that the current Worldcon can, at its discretion, reject any Hugo nominee that threatens to bring the Hugos or Worldcon into disrepute? Like the rule that caused the rejection of the name Boaty McBoatface? I’m sure this idea has been suggested before.</br></p><p>Kevin Standlee<br> Such a rule would be legal, but it does not currently exist. And beware of rules that can be turned against you. However, if you want help crafting such a rule, contact me directly and I’ll help you write it. Convincing two consecutive WSFS Business Meetings to vote for it would be your problem.</br></p><p>Richard Man<br>  I think any NEW rule, would not help for 2016 (and of course not 2015) due to the ratification requirements. I think the WSFS charter founders are pretty crafty in makes things fairly democratic, within the limits of the charters. They just never expected influential arseholes.</br></p><p>Christopher Carson<br> Pretty sure fandom has never been short of “influential arseholes”.</br></p><p>Richard Man<br> … but ones that screw up the Hugos two years in a year ;-P?</br></p><p>Kevin Standlee<br> WSFS rules are designed with an assumption that people will act in good faith.</br></p><p>I’ve repeatedly said that WSFS operates much like the USA did for the first twenty years after it declared independence. The manifest flaws of the Articles of Confederation led to the adoption of the current much-stronger Constitution of 1787. But it took several years for that to happen, too, and the challenges facing the young USA were a lot worse than a bunch of bad actors trolling a literary award.</p><p>Dave O’Neill<br> I don’t think anybody expected any of the individual arseholes to actually have followers.</br></p><p>Kevin Standlee<br> True. And most of the individuals within Worldcon-attending fandom have been prepared to play within the _spirit_ of the rules as well as its letter. Heck, there were a couple of “puppy” sympathizers at the 2015 WSFS Business Meeting.</br></p><p>Dave O’Neill<br> I can assure you that his motion would have failed. There was no way it was going through. But yes, I recall him well. I also recall all the people of the opinion that this was a ‘one off’ and we shouldn’t do anything as they’ll get bored.</br></p><p>Kevin Standlee<br> That was only the second time that I’ve seen Adjourn moved in its debatable form in any situation other than routinely at the end of a day or of the session. The first time was when I made it myself many years ago (L.A. con III, as I recall) because I thought the people present didn’t want to go in to the nitty-gritty of a complex report I was presenting and wanted to put it off until the next day. I was wrong.</br></p><p>Mike Glyer<br> This kind of tortured logic undermines the much needed benefits of Codes of Conduct. Beware.</br></p><p>Christopher Hensley<br> The move away from a pure legalistic approach represents a major shift in the community over the last few years.</br></p><p>Kevin Standlee<br> Understood about the beware. Any committee wanting to invoke their Code of Conduct in this situation would have to consider balancing the harm done to itself by Griefers against the potential harm of dealing with a lawsuit from them.</br></p><p>Christopher Hensley<br> I also worry about the opposite. That they will try to nominate a work that while protected by the absolute speech protections inherent in US will run afoul libel or hate crime laws outside of it. If nothing else it would kill the packet, or require saying “we refuse to distribute this”. Possibly even cause problems with advertising the finalists. A certain title which make accusations about John Scalzi come to mind.</br></p><p>Kevin Standlee<br> Funny thing, that. Imagine such a case next year, in which Finnish and EU law applies. IMO, the committee would be totally justified in disqualifying such a work, because local law always trumps the WSFS Constitution.</br></p><p>Mike Glyer<br> It’s reasonable to anticipate that they will keep moving down the continuum, finding more transgressive works to nominate. They would do it anyway, and if EPH is effective in limiting their impact, would want to devote the slots they get to items that …</br></p><p>Kevin Standlee<br> Me, too, and it was one of the reasons I didn’t like trying to invoke it as a legitimate reason to disqualify nominations, members, or finalists.</br></p><p>Christopher Hensley<br> There are two questions in my mind. One are their actions, which are clearly an ongoing campaign of harassment. The other is the works themselves. It should be a much higher bar on that but not an impossible one. What happens when they nominate non-fiction works which promote violence against LGBT persons, racial minorities or Muslims?</br></p><p>Dave O’Neill<br> Surely the administrators have some wiggle room in those situations? If not then there does need to be a disrepute clause brought in.</br></p><p>Kevin Standlee<br> I don’t really see much room for maneuver by the Administrators. Every individual natural person is eligible to become a member by existing rules.</br></p><p>Dave O’Neill<br> I was thinking more if somebody nominated a hardcore porn SF parody or similar? Rather than dealing with members – I was under the impression the administrators had the final word in eligibility?</br></p><p>Christopher Hensley<br> Tingle’s stuff is more performance art then porn parody. He has a following that loves his over the top antics and hopelessly positive message. But yes, Tingle is absolutely backfiring on Day. He’ll say it was his plan all along but it is stealing his spotlight.</br></p><p>Dave O’Neill<br> well, I wasn’t actually thinking of Tingle then as, yes, it’s part of a gag. I was thinking more of a “Game of Boners” type stuff.</br></p><p>Mem Morman<br> What’s a “Griefer”?</br></p><p>Kevin Standlee<br> The people wanting to destroy the Hugo Awards by nominating a slate that includes a fair number of obviously awful things. In effect, the Rabid Puppies.</br></p><p>Dave O’Neill<br> Somebody who deliberately tries to spoil things for other players.</br></p><p>Dave O’Neill<br> Although I really think the Chuck Tingle thing is going to backfire spectacularly on Ted.</br></p><p>Christopher Hensley<br> “Griefing” originally a video gaming term referring to players who kill their own teammates in multiplayer.</br></p><p>Kevin Standlee<br> I like how it can be easily mistaken as Grifters, which seems appropriate to me given their Sooper Genius Evil Overlord.</br></p><p>Alfred Kruse<br> “And so it begins…”</br></p><p>Covert J Beach<br> I would consider canceling memberships based on nominations for the Hugo to be the Nuclear Option. I think this becomes a slippery slope to the point where the Cure will be worse than the Disease. This idea is another version of Strong Administrator, and should be invoked as a last resort and only in desperation. In theory bad ideas should be trampled in the free marketplace of ideas. The Griefers as you refer to them have found a mechanical way to make the marketplace less free (by packing the limited number of nominations.) Even if we can agree that this group needs to be dealt with, there comes the future time where someone with a hot button gets to make a well intentioned call that blows up in the convention’s face. The solution is to free up the marketplace of ideas. EPH+6/4 or Semi-final voting do this.</br></p></blockquote><p>What I find so interesting about the SJW-SF reaction is that they simply never stop to question their basic assumptions or the effectiveness of their tactics. This all started when Patrick Nielsen Hayden and Teresa Nielsen Hayden, <a href=\"http://www.wnd.com/2005/02/29022/\">appropos of a single syndicated op/ed column</a> about Susan Estrich’s attack on Michael Kinsley, broached the possibility excluding me from the Nebula jury back in 2005. Then Patrick Nielsen Hayden and John Scalzi joined forces to force the SFWA Board to exclude me in 2013 by threatening to quit, after which the Hugo voters did their best to exclude me in 2014.</p><p>How has that worked out for them?</p><p>The SJWs in science fiction couldn’t <i>imagine</i> that we would take over the 2015 nominations. They were <i>highly</i> confident that we couldn’t dominate the nominations this year. And I have no doubt that they are <i>absolutely certain</i> we can’t <i>possibly</i> take over the Business Meeting.</p><p>Want to bet the Hugo Awards on that?</p><p>Go ahead, Secret Masters, make a special rule aimed at me and the Rabid Puppies a legitimate tactic at my disposal if you dare. This is your fair warning.</p></div>",
  "content_text": "The Secret Masters of Fandom are retreating to what appears to be the science fiction community’s one and only tactic even before they see the effects of their first round of rules changes. From a Facebook discussion:\nKevin Standlee\nA factor regarding invoking the convention Code of Conduct against Griefers (I’m looking at Christopher J Garcia and Sean Wallace in particular) and disqualifying their ballots and revoking their memberships that only came to me this morning:\nThe current Worldcon in Kansas City does have the right to regulate its own membership. They could, if they so choose, decide to revoke the memberships of individuals for just about any reasons unless it was prohibited by law. So in theory they could revoke the memberships of individual members who they believed were violating their Code of Conduct by the way they cast their Hugo Award nominating ballots.\nHowever, what about the members of the Spokane and Helsinki Worldcons? All of their members as of January 31, 2016 were also eligible to nominate. Kansas City is obliged to honor those nominations as part of the WSFS Constitution, which is the “contract” under which MidAmeriCon II was granted the right to hold the 2016 Worldcon. MAC2 does not have jurisdiction over the memberships of the 2015 and 2017 Worldcons. They don’t have the right to revoke the memberships of members of either of those two conventions. If, as seems likely to me, most of the Griefers are coasting along on the memberships they bought to Sasquan, MAC2 doesn’t seem to me to have the right to ignore those persons’ votes — not unless they could somehow get the legal remnant of the 2015 Worldcon committee to revoke those persons’ memberships.\nYes, I know I’m being legalistic. That’s what I do. Throwing out the rule of law just because you don’t like how some people voted is IMO giving the Griefers exactly what they want — a plausible legal excuse to hammer the Hugo Awards and Worldcon with. They’re trying to goad us into an extra-legal response.\nDavid Dyer-Bennet\nLacking the Arisians to identify and certify a reliable supply of “philosopher kings”, I think rule of law is our best choice, however annoying some of the intermediate steps may be.\nChristopher J Garcia\nIt’s not about the votes – it’s about the use of the Hugos as a platform for a hate group..\nKevin Standlee\nYou’d need to withdraw the nominating rights from the previous/subsequent years’ members in order to give a single legal entity (the current Worldcon) the right to revoke the memberships (and thus not count the ballots) of the people you consider unworthy of voting, for whatever reason, including being part of what you’ve decided is a hate group.\nChristopher J Garcia\nIt’s not about the voting. It’s allowing members of a hate group (and the Rabid Puppies qualify as such under the SPLC, ADL, and FBI definitions) to opperate within the awards. We are implicitly accepting their presence by not acting to remove them.\nKevin Standlee\nNo. You are only a member of WSFS for the current “Worldcon Year,” which runs from end of Worldcon to end of Worldcon. There are, however, residual rights that attach to past and future Worldcons of which you may be a member.\nKevin Standlee\nI don’t dispute that there is a de facto hate group acting here. What I’m saying is that while an individual Worldcon may choose to revoke the memberships of its members for any non-prohibited-by-law reason, they cannot IMO legally revoke. Incidentally, one of the “residual rights” is to inspect the accounts of the Worldcon of which you were a member. The “sunshine clause” is rarely invoked, but it is in there.\nChristopher Carson\nIt’s not about the votes, it’s not about the nominations — so you’re mad at an abstract concept?\nMichael Lee\nI could make the case that the code of conduct applies to all participants in an activity of a particular convention, and that the nomination phase is an activity not of three conventions, but of one particular convention, so that individual convention’s code of conduct would apply. And it is the responsibility of an individual convention to administer the Hugo Awards.\nKevin Standlee\nMichael Lee I can see your point; however, I can also see that if I were a member of the previous Worldcon who had my vote tossed by the current Worldcon, I would have standing to sue to the current Worldcon for failing to abide by the terms of their contract (the WSFS Constitution).\nKevin Standlee\nCodes of conduct aren’t mentioned in the WSFS Constitution, so it’s unclear just how much any one convention’s CoC can have jurisdiction over another convention’s members. In particular, look at this section of the WSFS Constitution:\nSection 1.6: Authority. Authority and responsibility for all matters concerning the Worldcon, except those reserved herein to WSFS, shall rest with the Worldcon Committee, which shall act in its own name and not in that of WSFS. And that seems to me to give a Worldcon to regulate its own members, but not any other convention’s members.\nLinda Deneroff\nI thought well prior to 2012 the WSFS Constitution permitted the prior year’s worldcon members to nominate, but back before computers it was nearly impossible to make it practical or viable.\nKevin Standlee\nPrior years’ members have been eligible to nominate since 1989. The subsequent year’s members were only extended the nominating privilege effective in 2012 (ratified in 2011).\nChristopher Hensley\nWhich is why I am a little miffed at Sasquan. They actually had the power to do it, but they did not.\nLinda Deneroff\n20-20 hindsight is wonderful.\nChristopher Hensley\nTo be fair, they are doing exactly what they said they would do since the nominating period opened last year.\nAaron Kashtan\nWouldn’t it be better to create a rule that the current Worldcon can, at its discretion, reject any Hugo nominee that threatens to bring the Hugos or Worldcon into disrepute? Like the rule that caused the rejection of the name Boaty McBoatface? I’m sure this idea has been suggested before.\nKevin Standlee\nSuch a rule would be legal, but it does not currently exist. And beware of rules that can be turned against you. However, if you want help crafting such a rule, contact me directly and I’ll help you write it. Convincing two consecutive WSFS Business Meetings to vote for it would be your problem.\nRichard Man\nI think any NEW rule, would not help for 2016 (and of course not 2015) due to the ratification requirements. I think the WSFS charter founders are pretty crafty in makes things fairly democratic, within the limits of the charters. They just never expected influential arseholes.\nChristopher Carson\nPretty sure fandom has never been short of “influential arseholes”.\nRichard Man\n… but ones that screw up the Hugos two years in a year ;-P?\nKevin Standlee\nWSFS rules are designed with an assumption that people will act in good faith.\nI’ve repeatedly said that WSFS operates much like the USA did for the first twenty years after it declared independence. The manifest flaws of the Articles of Confederation led to the adoption of the current much-stronger Constitution of 1787. But it took several years for that to happen, too, and the challenges facing the young USA were a lot worse than a bunch of bad actors trolling a literary award.\nDave O’Neill\nI don’t think anybody expected any of the individual arseholes to actually have followers.\nKevin Standlee\nTrue. And most of the individuals within Worldcon-attending fandom have been prepared to play within the _spirit_ of the rules as well as its letter. Heck, there were a couple of “puppy” sympathizers at the 2015 WSFS Business Meeting.\nDave O’Neill\nI can assure you that his motion would have failed. There was no way it was going through. But yes, I recall him well. I also recall all the people of the opinion that this was a ‘one off’ and we shouldn’t do anything as they’ll get bored.\nKevin Standlee\nThat was only the second time that I’ve seen Adjourn moved in its debatable form in any situation other than routinely at the end of a day or of the session. The first time was when I made it myself many years ago (L.A. con III, as I recall) because I thought the people present didn’t want to go in to the nitty-gritty of a complex report I was presenting and wanted to put it off until the next day. I was wrong.\nMike Glyer\nThis kind of tortured logic undermines the much needed benefits of Codes of Conduct. Beware.\nChristopher Hensley\nThe move away from a pure legalistic approach represents a major shift in the community over the last few years.\nKevin Standlee\nUnderstood about the beware. Any committee wanting to invoke their Code of Conduct in this situation would have to consider balancing the harm done to itself by Griefers against the potential harm of dealing with a lawsuit from them.\nChristopher Hensley\nI also worry about the opposite. That they will try to nominate a work that while protected by the absolute speech protections inherent in US will run afoul libel or hate crime laws outside of it. If nothing else it would kill the packet, or require saying “we refuse to distribute this”. Possibly even cause problems with advertising the finalists. A certain title which make accusations about John Scalzi come to mind.\nKevin Standlee\nFunny thing, that. Imagine such a case next year, in which Finnish and EU law applies. IMO, the committee would be totally justified in disqualifying such a work, because local law always trumps the WSFS Constitution.\nMike Glyer\nIt’s reasonable to anticipate that they will keep moving down the continuum, finding more transgressive works to nominate. They would do it anyway, and if EPH is effective in limiting their impact, would want to devote the slots they get to items that …\nKevin Standlee\nMe, too, and it was one of the reasons I didn’t like trying to invoke it as a legitimate reason to disqualify nominations, members, or finalists.\nChristopher Hensley\nThere are two questions in my mind. One are their actions, which are clearly an ongoing campaign of harassment. The other is the works themselves. It should be a much higher bar on that but not an impossible one. What happens when they nominate non-fiction works which promote violence against LGBT persons, racial minorities or Muslims?\nDave O’Neill\nSurely the administrators have some wiggle room in those situations? If not then there does need to be a disrepute clause brought in.\nKevin Standlee\nI don’t really see much room for maneuver by the Administrators. Every individual natural person is eligible to become a member by existing rules.\nDave O’Neill\nI was thinking more if somebody nominated a hardcore porn SF parody or similar? Rather than dealing with members – I was under the impression the administrators had the final word in eligibility?\nChristopher Hensley\nTingle’s stuff is more performance art then porn parody. He has a following that loves his over the top antics and hopelessly positive message. But yes, Tingle is absolutely backfiring on Day. He’ll say it was his plan all along but it is stealing his spotlight.\nDave O’Neill\nwell, I wasn’t actually thinking of Tingle then as, yes, it’s part of a gag. I was thinking more of a “Game of Boners” type stuff.\nMem Morman\nWhat’s a “Griefer”?\nKevin Standlee\nThe people wanting to destroy the Hugo Awards by nominating a slate that includes a fair number of obviously awful things. In effect, the Rabid Puppies.\nDave O’Neill\nSomebody who deliberately tries to spoil things for other players.\nDave O’Neill\nAlthough I really think the Chuck Tingle thing is going to backfire spectacularly on Ted.\nChristopher Hensley\n“Griefing” originally a video gaming term referring to players who kill their own teammates in multiplayer.\nKevin Standlee\nI like how it can be easily mistaken as Grifters, which seems appropriate to me given their Sooper Genius Evil Overlord.\nAlfred Kruse\n“And so it begins…”\nCovert J Beach\nI would consider canceling memberships based on nominations for the Hugo to be the Nuclear Option. I think this becomes a slippery slope to the point where the Cure will be worse than the Disease. This idea is another version of Strong Administrator, and should be invoked as a last resort and only in desperation. In theory bad ideas should be trampled in the free marketplace of ideas. The Griefers as you refer to them have found a mechanical way to make the marketplace less free (by packing the limited number of nominations.) Even if we can agree that this group needs to be dealt with, there comes the future time where someone with a hot button gets to make a well intentioned call that blows up in the convention’s face. The solution is to free up the marketplace of ideas. EPH+6/4 or Semi-final voting do this.\nWhat I find so interesting about the SJW-SF reaction is that they simply never stop to question their basic assumptions or the effectiveness of their tactics. This all started when Patrick Nielsen Hayden and Teresa Nielsen Hayden,\nappropos of a single syndicated op/ed column\nabout Susan Estrich’s attack on Michael Kinsley, broached the possibility excluding me from the Nebula jury back in 2005. Then Patrick Nielsen Hayden and John Scalzi joined forces to force the SFWA Board to exclude me in 2013 by threatening to quit, after which the Hugo voters did their best to exclude me in 2014.\nHow has that worked out for them?\nThe SJWs in science fiction couldn’t\nimagine\nthat we would take over the 2015 nominations. They were\nhighly\nconfident that we couldn’t dominate the nominations this year. And I have no doubt that they are\nabsolutely certain\nwe can’t\npossibly\ntake over the Business Meeting.\nWant to bet the Hugo Awards on that?\nGo ahead, Secret Masters, make a special rule aimed at me and the Rabid Puppies a legitimate tactic at my disposal if you dare. This is your fair warning.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-03T10:30:00+00:00"
}