{
  "url": "https://voxday.net/2016/05/28/book-review-cuckservative/",
  "scraped_at": "2025-12-17T17:59:18.367821",
  "title": "Book review: Cuckservative",
  "date_display": "May 28, 2016",
  "date_iso": "2016-05-28T08:55:00+00:00",
  "date_from_url": "2016-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Essential Malady reviews <a href=\"http://amzn.to/1Wnka63\"><b><i>Cuckservative: How “Conservatives” Betrayed America</i></b></a>:</p><blockquote class=\"tr_bq\"><p> One of the most ferociously written (and critical) broadsides hits<br> what Day often calls “Churchianity”. It is well known by those who care<br> to find out that church groups have a huge hand in assisting mass<br> immigration – often absurdly of non-Christians that have no intention of<br> converting. This is facilitated by the state and as I understand it,<br> quite lucrative for all involved except the native population. This<br> chapter deals more with the perversion of Christianity towards earthly<br> ends than with this fraud though and the generally touchy, feely and<br> ultimately suicidal niceness of committed Christians especially of the<br> Evangelical persuasion. This has hopefully reached peak insanity with <a href=\"https://www.washingtonpost.com/news/acts-of-faith/wp/2016/04/21/my-wife-and-i-are-white-evangelicals-heres-why-we-chose-to-give-birth-to-black-triplets/?tid=sm_tw\">this couple </a>but I’m not so sure. Christ wants us to bring other nations to him not other nations to us.</br></br></br></br></br></br></br></br></br></p><p>On a personal level, I can relate to the term and I would say that<br> for a long time I was myself a “cuckservative”. I knew deep down in my<br> gut that what I wanted to preserve as a conservative was white Christian<br> society but knew that openly stating such would get me called a racist<br> and worse. Part of the reason for this is I was cultured to think so and<br> the only mainstream voices available tripped over themselves often<br> embarrassingly to avoid being called racist. Yet, if they’re honest with<br> themselves, that’s where the conservative instinct should lead.</br></br></br></br></br></br></br></p></blockquote><p>The racial equalitarians, particularly in the Christian churches, need to be called out and held accountable for their treason. If you’re going to claim “there is neither Greek nor Jew, neither American nor Chinese, in Jesus Christ” means that no one has any more right to live in the magic dirt of the United States than anyone else, that’s fine from a free speech perspective, but you should probably also be considered an open and avowed enemy of America and of the Christian church.</p><p>You’re also a liar. The Churchians who sell that line are perfectly happy to welcome the immigration of animists, Muslims, demon worshippers, Hindus, and every other form of religion under the guise of Christian equality. Like all deceivers, they rely on bait-and-switches, they hide behind rhetorical fogs, and they deny the obvious consequences of their actions.</p><p>If you are an elder in a Christian church, you must expel the churchians and cuckservatives from your midst whenever they reveal themselves. They are deceivers and destroyers, and they do not serve that which they claim to serve.</p></div>",
  "content_text": "The Essential Malady reviews\nCuckservative: How “Conservatives” Betrayed America\n:\nOne of the most ferociously written (and critical) broadsides hits\nwhat Day often calls “Churchianity”. It is well known by those who care\nto find out that church groups have a huge hand in assisting mass\nimmigration – often absurdly of non-Christians that have no intention of\nconverting. This is facilitated by the state and as I understand it,\nquite lucrative for all involved except the native population. This\nchapter deals more with the perversion of Christianity towards earthly\nends than with this fraud though and the generally touchy, feely and\nultimately suicidal niceness of committed Christians especially of the\nEvangelical persuasion. This has hopefully reached peak insanity with\nthis couple\nbut I’m not so sure. Christ wants us to bring other nations to him not other nations to us.\nOn a personal level, I can relate to the term and I would say that\nfor a long time I was myself a “cuckservative”. I knew deep down in my\ngut that what I wanted to preserve as a conservative was white Christian\nsociety but knew that openly stating such would get me called a racist\nand worse. Part of the reason for this is I was cultured to think so and\nthe only mainstream voices available tripped over themselves often\nembarrassingly to avoid being called racist. Yet, if they’re honest with\nthemselves, that’s where the conservative instinct should lead.\nThe racial equalitarians, particularly in the Christian churches, need to be called out and held accountable for their treason. If you’re going to claim “there is neither Greek nor Jew, neither American nor Chinese, in Jesus Christ” means that no one has any more right to live in the magic dirt of the United States than anyone else, that’s fine from a free speech perspective, but you should probably also be considered an open and avowed enemy of America and of the Christian church.\nYou’re also a liar. The Churchians who sell that line are perfectly happy to welcome the immigration of animists, Muslims, demon worshippers, Hindus, and every other form of religion under the guise of Christian equality. Like all deceivers, they rely on bait-and-switches, they hide behind rhetorical fogs, and they deny the obvious consequences of their actions.\nIf you are an elder in a Christian church, you must expel the churchians and cuckservatives from your midst whenever they reveal themselves. They are deceivers and destroyers, and they do not serve that which they claim to serve.",
  "tags": [
    "Book Review",
    "Christianity",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-28T07:55:00+00:00"
}