{
  "url": "https://voxday.net/2016/05/03/brainstorm-with-steve-keen/",
  "scraped_at": "2025-12-17T17:56:16.434290",
  "title": "Brainstorm with Steve Keen",
  "date_display": "May 3, 2016",
  "date_iso": "2016-05-03T08:42:00+00:00",
  "date_from_url": "2016-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am very pleased to be able to say that on Friday, May 6th, at 7 PM Eastern, we will be holding an Open Brainstorm with the most important economist working today, Dr. Steve Keen. Dr. Keen is the author of <i>Debunking Economics</i>, which is a work so fundamentally revolutionary that its implications will probably not be fully understood for at least another century.</p><p>He is the leading Post-Keynesian economist and he is one of the very few economists to have correctly anticipated both the 2008 financial crisis as well as what he describes as the Second Great Depression. (He is, of course, <i>completely</i> wrong; the correct term is Great Depression 2.0.) I will post an open registration link tomorrow after the Brainstorm members have had the chance to get their seats first, as I expect this will be a well-attended event. Invites to members will go out this evening along with a transcript of the recent William S. Lind event.</p><p>For those who attended the Lind event, I spoke with my ISP and it turned out there was a software-related problem in my connection on their end; they have fixed it and I don’t anticipate any further problems. But we will have a backup plan in place just in case similar problems present themselves.</p><p>Below is my 2012 review of <i>Debunking Economics</i>.</p><p><b>Stalking the Undead Economist</b></p><p>Since being presented with a copy of Milton Friedman’s “Free To Choose” as a schoolboy, I have read a considerable quantity of books devoted to economics. Unlike most socialists, I have read Marx, Veblen and Bakunin. Unlike most monetarists, I have read more than Friedman’s pop books focused on the mass audience, but his more scholarly works, too, as well as his massive ode to monetary policy, coauthored with Anna Jacobson Schwartz, titled, “A Monetary History of the United States, 1867-1960.” Unlike most neo-Keynesians, I have read both “The General Theory of Employment, Interest and Money” as well as Paul Samuelson’s landmark textbook, “Economics,” in its original 1948 edition. Unlike most free traders, I have read David Ricardo’s “The Principles of Political Economy and Taxation,” and while unlike most Austrians, I cannot quote chapter and verse of Ludwig von Mises’ “Human Action” from memory, I have read it.</p><p>I have no doubt this reading list would have astonished the late professor of my macroeconomics class, who was less bothered by my usual failure to attend class than by the fact that I never bothered to buy the textbook.</p><p>After nearly three decades of reading across a broad spectrum of economic thought, the two books on the subject I would most recommend are Joseph Schumpeter’s “History of Economic Analysis” and Murray Rothbard’s “An Austrian Perspective on the History of Economic Thought.” But now there is a third. After finishing “Debunking Economics: The Naked Emperor Dethroned?” I have to assert that Keen’s book is not only an absolute masterpiece, but may, in fact, represent the most important intellectual development in economics since “The General Theory” was published in 1936. And if some of Keen’s more controversial assertions hold up over time, it will be the most important contribution to the literature since “The Wealth of Nations.”</p><p>The title of the book is an appropriate one because Keen calls into very serious question some of the most basic assumptions that economists of all ideological strains have shared since 1776. This is not a book for the faint of heart, not due to the relatively sophisticated mathematics he utilizes in support of his arguments, but because it will be hard for anyone with even a modicum of education in economics to accept intrinsically revolutionary ideas such as the non-linear shape of a market demand curve or to believe that conventional economic models are absolutely reliant upon absurdities such as markets that consist of one solitary customer for a single commodity. And while it is one thing to notice that the conventional models don’t take into account factors such as time and debt (for I have written about these things myself), it is still eye-opening to witness Keen methodically explore the significance of such omissions and explicate the consequences of how these structural errors render the entire mainstream discipline fundamentally incapable of coherently describing, let alone predicting, economic activity in the real world.</p><p>Perhaps the most revelatory section of the book deals with the way the General Theory of John Maynard Keynes was converted into the practical neoclassical form that presently dominates mainstream economics in its two halves, Monetarist and Neo-Keynesian, by Paul Samuelson and J.R. Hicks. While it is no secret that Samuelson quantified many of the concepts introduced by Keynes, as one will search “The General Theory” in vain for gross domestic product or any of the macroeconomic terms that are so familiar today, I had always wondered about the basis for the IS/LM model that played such a central role in my macroeconomic class could be found in Keynes; none of my economics professors ever pointed out that it was provided in what was essentially a book review of Keynes’s magnum opus or admitted how this core function of “Keynesian” economics inherently contradicted what Keynes himself wrote.</p><p>Throughout the book, Keen proves himself to be an engaging writer who is able to break down and explain the most complex concepts in a manner that most interested readers will be able to follow without too much trouble. He wisely structures his arguments in such a way that if one does not wish to wrestle with the math or the more esoteric aspects of the subject, one can still understand the significance of the point that he is making and move on to the next issue.</p><p>One need not agree with all of Keen’s arguments or his conclusions to admire the serious and substantive challenge that he has posed here to neoclassical economics. The neoclassicals cannot ignore the divergence between their theories and the real world forever, and no amount of revisionist history from the likes of Brad DeLong will permit them to do so much longer in a world that is drowning in excessive public and private debt. If Keen convinces the reader of just one thing, it is that there is a dire need for a better economics. Consider the following statement in which he compares five alternative schools of economics, Austrian, Post-Keynesian, Sraffian, Econophysics and Evolutionary economics prior to describing the strengths and weaknesses of each:</p><p><i>“None of these is at present strong enough or complete enough to declare itself a contender for the title of ‘the’ economic theory of the twenty-first century. However, they all have strengths in areas where neoclassical economics is fundamentally flawed, and there is also a substantial degree of overlap and cross-fertilization between schools. It is possible that this century could finally see the development of a dominant economic theory which actually has some relevance to the dynamics of a modern capitalist economy. I would probably be regarded as partisan to the post-Keynesian approach. However, I can see varying degrees of merit in all five schools of thought, and I can imagine that a twenty-first-century economics could be a melange of all five.”</i></p><p>As can be seen by this quote, Keen is not a polemicist bent on defending his perspective, but a fair-minded inquirer after the truth. He may never be known as the father of whatever the future mainstream of economics turns out to be, but in driving this stake of a book through the heart of what can be reasonably characterized as the undead theory of neoclassical economics, he could rightly merit being described as its midwife.</p></div>",
  "content_text": "I am very pleased to be able to say that on Friday, May 6th, at 7 PM Eastern, we will be holding an Open Brainstorm with the most important economist working today, Dr. Steve Keen. Dr. Keen is the author of\nDebunking Economics\n, which is a work so fundamentally revolutionary that its implications will probably not be fully understood for at least another century.\nHe is the leading Post-Keynesian economist and he is one of the very few economists to have correctly anticipated both the 2008 financial crisis as well as what he describes as the Second Great Depression. (He is, of course,\ncompletely\nwrong; the correct term is Great Depression 2.0.) I will post an open registration link tomorrow after the Brainstorm members have had the chance to get their seats first, as I expect this will be a well-attended event. Invites to members will go out this evening along with a transcript of the recent William S. Lind event.\nFor those who attended the Lind event, I spoke with my ISP and it turned out there was a software-related problem in my connection on their end; they have fixed it and I don’t anticipate any further problems. But we will have a backup plan in place just in case similar problems present themselves.\nBelow is my 2012 review of\nDebunking Economics\n.\nStalking the Undead Economist\nSince being presented with a copy of Milton Friedman’s “Free To Choose” as a schoolboy, I have read a considerable quantity of books devoted to economics. Unlike most socialists, I have read Marx, Veblen and Bakunin. Unlike most monetarists, I have read more than Friedman’s pop books focused on the mass audience, but his more scholarly works, too, as well as his massive ode to monetary policy, coauthored with Anna Jacobson Schwartz, titled, “A Monetary History of the United States, 1867-1960.” Unlike most neo-Keynesians, I have read both “The General Theory of Employment, Interest and Money” as well as Paul Samuelson’s landmark textbook, “Economics,” in its original 1948 edition. Unlike most free traders, I have read David Ricardo’s “The Principles of Political Economy and Taxation,” and while unlike most Austrians, I cannot quote chapter and verse of Ludwig von Mises’ “Human Action” from memory, I have read it.\nI have no doubt this reading list would have astonished the late professor of my macroeconomics class, who was less bothered by my usual failure to attend class than by the fact that I never bothered to buy the textbook.\nAfter nearly three decades of reading across a broad spectrum of economic thought, the two books on the subject I would most recommend are Joseph Schumpeter’s “History of Economic Analysis” and Murray Rothbard’s “An Austrian Perspective on the History of Economic Thought.” But now there is a third. After finishing “Debunking Economics: The Naked Emperor Dethroned?” I have to assert that Keen’s book is not only an absolute masterpiece, but may, in fact, represent the most important intellectual development in economics since “The General Theory” was published in 1936. And if some of Keen’s more controversial assertions hold up over time, it will be the most important contribution to the literature since “The Wealth of Nations.”\nThe title of the book is an appropriate one because Keen calls into very serious question some of the most basic assumptions that economists of all ideological strains have shared since 1776. This is not a book for the faint of heart, not due to the relatively sophisticated mathematics he utilizes in support of his arguments, but because it will be hard for anyone with even a modicum of education in economics to accept intrinsically revolutionary ideas such as the non-linear shape of a market demand curve or to believe that conventional economic models are absolutely reliant upon absurdities such as markets that consist of one solitary customer for a single commodity. And while it is one thing to notice that the conventional models don’t take into account factors such as time and debt (for I have written about these things myself), it is still eye-opening to witness Keen methodically explore the significance of such omissions and explicate the consequences of how these structural errors render the entire mainstream discipline fundamentally incapable of coherently describing, let alone predicting, economic activity in the real world.\nPerhaps the most revelatory section of the book deals with the way the General Theory of John Maynard Keynes was converted into the practical neoclassical form that presently dominates mainstream economics in its two halves, Monetarist and Neo-Keynesian, by Paul Samuelson and J.R. Hicks. While it is no secret that Samuelson quantified many of the concepts introduced by Keynes, as one will search “The General Theory” in vain for gross domestic product or any of the macroeconomic terms that are so familiar today, I had always wondered about the basis for the IS/LM model that played such a central role in my macroeconomic class could be found in Keynes; none of my economics professors ever pointed out that it was provided in what was essentially a book review of Keynes’s magnum opus or admitted how this core function of “Keynesian” economics inherently contradicted what Keynes himself wrote.\nThroughout the book, Keen proves himself to be an engaging writer who is able to break down and explain the most complex concepts in a manner that most interested readers will be able to follow without too much trouble. He wisely structures his arguments in such a way that if one does not wish to wrestle with the math or the more esoteric aspects of the subject, one can still understand the significance of the point that he is making and move on to the next issue.\nOne need not agree with all of Keen’s arguments or his conclusions to admire the serious and substantive challenge that he has posed here to neoclassical economics. The neoclassicals cannot ignore the divergence between their theories and the real world forever, and no amount of revisionist history from the likes of Brad DeLong will permit them to do so much longer in a world that is drowning in excessive public and private debt. If Keen convinces the reader of just one thing, it is that there is a dire need for a better economics. Consider the following statement in which he compares five alternative schools of economics, Austrian, Post-Keynesian, Sraffian, Econophysics and Evolutionary economics prior to describing the strengths and weaknesses of each:\n“None of these is at present strong enough or complete enough to declare itself a contender for the title of ‘the’ economic theory of the twenty-first century. However, they all have strengths in areas where neoclassical economics is fundamentally flawed, and there is also a substantial degree of overlap and cross-fertilization between schools. It is possible that this century could finally see the development of a dominant economic theory which actually has some relevance to the dynamics of a modern capitalist economy. I would probably be regarded as partisan to the post-Keynesian approach. However, I can see varying degrees of merit in all five schools of thought, and I can imagine that a twenty-first-century economics could be a melange of all five.”\nAs can be seen by this quote, Keen is not a polemicist bent on defending his perspective, but a fair-minded inquirer after the truth. He may never be known as the father of whatever the future mainstream of economics turns out to be, but in driving this stake of a book through the heart of what can be reasonably characterized as the undead theory of neoclassical economics, he could rightly merit being described as its midwife.",
  "tags": [
    "Brainstorm",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-03T07:42:00+00:00"
}