{
  "url": "https://voxday.net/2016/05/02/gammas-never-lose/",
  "scraped_at": "2025-12-17T17:56:11.673524",
  "title": "Gammas never lose",
  "date_display": "May 2, 2016",
  "date_iso": "2016-05-02T12:00:00+00:00",
  "date_from_url": "2016-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But sometimes they win in ways no one else can see. This probably belongs on Alpha Game, but since everyone here is familiar with the entire discussion that led up to it, I’m posting it here. <a href=\"https://camestrosfelapton.wordpress.com/2016/05/01/cool-banned-by-vox/\">In his response</a> to my banning him, we learn that the recently-banned Camestros Felapton is not only an SJW, he is a Secret King Who Cannot Ever Lose Because Even When It Looks Like He’s Losing, He Is Really Winning, You See.</p><blockquote class=\"tr_bq\"><p> Cool! Banned by Vox! I had to give Vox a little lesson on Aristole and logic the other day and now he seems to have got a tad upset with me.</p></blockquote><p>Wow, how cool is that! See, Felapton <i>wanted</i> to be banned from the place that he had sought out on his own and where he was commenting repeatedly without invitation. That was his plan all along! The joke is on Vox! This is always the immediate reaction of the Gamma who has just been beaten in public; he immediately tries to spin the negative into a positive. And, of course, this spin requires an amount of historical revision; I clearly don’t understand the great Greasean philologist Aristole as well as he does. SJWs being SJWs, we also have all three Laws of SJW on display.</p><ol><li>SJWs Always Lie: there are four obvious lies in the first three sentences. To say nothing of a classic Gamma tell.</li><li>SJWs Always Double Down: instead of simply admitting that he was wrong and <a href=\"http://www.milobookclub.com/2016/05/01/of-enthymemes-and-false-erudition/\">had failed to correctly understand Aristotle’s distinction</a> between dialectic and rhetoric, he continues to posture as some sort of expert on philosophy and logic. But does he have a Bachelor’s Degree in the Philosophy of Science from the University of Chicago?</li><li>SJWs Always Project. I’m not even remotely upset with Felapton. Quite to the contrary, I am amused by his utterly predictable Gamma behavior. As one observer commented yesterday, he’s going to be looking for his chance to take a revenge shot for <i>years</i>.</li></ol><blockquote class=\"tr_bq\"><p> Oopsie! The rationalization is because of the point I made on File770 regarding the Castalia House published work on Gene Wolfe:</p></blockquote><p>This is close enough to the truth. Although “the lies I told” would have been a more accurate way for him to phrase it.</p><blockquote class=\"tr_bq\"><p> Vox claims this somehow ‘proves’ Larry Correia’s point about politics and the Hugos or something. Which is odd because the focus of my point was not Vox Day’s admittedly unpleasant and confused politics but his active campaign against the Hugo Awards and other science-fiction writers.</p></blockquote><p>It does prove Larry’s case. The focus of Felapton’s point is irrelevant in this regard. Felapton admitted that he would be voting on grounds other than the literary merit of the works concerned. That concedes Larry’s primary point. Larry argued, correctly, that the claims the Hugo Awards were awarded solely on the basis of merit were false, and moreover, that it was nothing but a popularity contest among a small group of people who leaned heavily to the political left. Although Felapton’s point is irrelevant, it also happens to be wrong since my active campaign is entirely the result of politics in science fiction. Their dislike of my politics is the only reason Patrick Nielsen Hayden, Teresa Nielsen Hayden, and John Scalzi started this conflict by publicly attacking me back in 2005.</p><blockquote class=\"tr_bq\"><p> Sigh. That isn’t the genetic fallacy.The genetic fallacy is a fallacy of IRRELEVANCE that confuses the SOURCE of a claim with its VERACITY. There isn’t a factual claim at stake here – I’m not saying a factual claim made by an author is false by virtue of his publisher (e.g. if somebody was to say that a claim about Gene Wolfe in the book was false purely on the basis that the book was a Castalia House book THAT would be the genetic fallacy).</p><p>My claim is that I can’t reward obnoxious behavior by Castalia House. Nothing to do with the genetic fallacy. Vox concedes that I raise one valid point, which is that “there is no way of separating what is published by Castalia from how Castalia promotes itself and its published works.” That is the ethical basis of my position and Vox concedes that it is valid and not fallacious.</p></blockquote><p>More posing. Felapton is trying to play fast and loose with both his claims and the applicability of the genetic fallacy here. As the tagline to his blog states, “even when we’re being honest we come across as being disingenuous” and he is not being honest here. We know that he believes the Puppy nominees to be low-quality; he has openly said as much in the past. Now he is pretending that he doesn’t <i>necessarily</i> believe that Castalia-published works are of insufficient quality to win awards, only that he “can’t reward obnoxious behavior by Castalia House.”</p><p>In other words, he is being disingenuous, and attempting to pretend that he is <i>not</i> claiming that a published work is not worthy of an award on the basis of its origins, it is simply that his pressing need to avoid rewarding what he believes to be obnoxious behavior just happens to justify precisely the same course of action. What a fortuitous coincidence!</p><p>However, he made a mistake. He did not merely say that he was not refusing to support Castalia-published works on the basis of their origins. He could have said, in response to my statement, “the genetic fallacy doesn’t apply and here is why”, but instead, he said “that isn’t the genetic fallacy” and then proceeded to adminster another of his little lessons. He tried to kill two birds with one stone and thus exposed his true intentions. Let’s break it down:</p><ol><li>My claim is that Felapton has concluded Castalia-published works lack merit due to their origins.</li><li>Felapton asserts that that is not his conclusion. Dubious, but possible.</li><li>Felapton asserts that is not the genetic fallacy. Wrong.</li></ol><p>He blundered because it wasn’t enough for him to simply state that I failed to understand his motivation for no-awarding Castalia publications, he also tried to pretend that I don’t understand the genetic fallacy because he is still smarting over my demonstration of his inability to understand rhetoric. Interesting word, smarting, in light of the typical gamma response to being intellectually bested.</p><p>As for Felapton’s veracity and how seriously one should take his claims, well, his closing statement alone should suffice to judge that.</p><blockquote class=\"tr_bq\"><p> What is more interesting is Vox losing his cool. That is a major departure from his play book and poor tactics. He is actually rattled? Surely not by me, so I assume it must be by Philip Sandifer’s campaign.</p></blockquote><p>As it is written, SJWs always lie. Felapton and others continue on that theme in the comments. Those in italics are his.</p><blockquote><ul><li>I suspect VD is completely panic stricken by Chuck Tingle</li><li><i>he tried the liberul-head-explody thing and then the liberul-heads didn’t explody</i></li><li><i>For a master of rhetoric, he has the debate strategy skills of a goldfish</i></li><li>He really can’t stand having people who know formal logic and rhetoric better than he does around</li><li>It’s also amusing to see him flailing around in his flop-sweat as you call him on being a serial bullshitter</li></ul></blockquote><p>The idea that I am “completely panic stricken by Chuck Tingle” is fascinating, considering that more than one journalist has contacted me this week to ask if I <i>am</i> Chuck Tingle. That “let’s make their heads explode” thing is a Sad tactic, not a Rabid one; I don’t care how SJWs feel about Chuck Tingle or anything else. Delenda est. As for my “debate strategy skills”, well, there is <a href=\"http://www.amazon.com/Question-Free-Trade-Economics-Discourse-ebook/dp/B01ETKDAXK\">this</a>. And <a href=\"http://www.amazon.com/Existence-Gods-Vox-Day-ebook/dp/B01D64CP6S\">this</a>.</p><p>UPDATE: Lunacy from one of the banned ones, Golden Flowers aka Micael Gustavsson. Talk about the Third Law!</p><blockquote class=\"tr_bq\"><p> Classic pathological narcissist – rubbing VD’s nose in the fact that he’s spouting crap threatens his identity as the Bestest Argumentarian EVAH, so he has to double down and come up with more bullshit on why his admirers should ignore his previous bullshit. I suspect VD is completely panic stricken by Chuck Tingle, and is flailing around trying to restore his feeling of being in control. He can’t; having opened Pandora’s box he is stuck with Tingle until the sun goes nova.. When VD is “amused” you know he is really upset.</p></blockquote><ul></ul></div>",
  "content_text": "But sometimes they win in ways no one else can see. This probably belongs on Alpha Game, but since everyone here is familiar with the entire discussion that led up to it, I’m posting it here.\nIn his response\nto my banning him, we learn that the recently-banned Camestros Felapton is not only an SJW, he is a Secret King Who Cannot Ever Lose Because Even When It Looks Like He’s Losing, He Is Really Winning, You See.\nCool! Banned by Vox! I had to give Vox a little lesson on Aristole and logic the other day and now he seems to have got a tad upset with me.\nWow, how cool is that! See, Felapton\nwanted\nto be banned from the place that he had sought out on his own and where he was commenting repeatedly without invitation. That was his plan all along! The joke is on Vox! This is always the immediate reaction of the Gamma who has just been beaten in public; he immediately tries to spin the negative into a positive. And, of course, this spin requires an amount of historical revision; I clearly don’t understand the great Greasean philologist Aristole as well as he does. SJWs being SJWs, we also have all three Laws of SJW on display.\nSJWs Always Lie: there are four obvious lies in the first three sentences. To say nothing of a classic Gamma tell.\nSJWs Always Double Down: instead of simply admitting that he was wrong and\nhad failed to correctly understand Aristotle’s distinction\nbetween dialectic and rhetoric, he continues to posture as some sort of expert on philosophy and logic. But does he have a Bachelor’s Degree in the Philosophy of Science from the University of Chicago?\nSJWs Always Project. I’m not even remotely upset with Felapton. Quite to the contrary, I am amused by his utterly predictable Gamma behavior. As one observer commented yesterday, he’s going to be looking for his chance to take a revenge shot for\nyears\n.\nOopsie! The rationalization is because of the point I made on File770 regarding the Castalia House published work on Gene Wolfe:\nThis is close enough to the truth. Although “the lies I told” would have been a more accurate way for him to phrase it.\nVox claims this somehow ‘proves’ Larry Correia’s point about politics and the Hugos or something. Which is odd because the focus of my point was not Vox Day’s admittedly unpleasant and confused politics but his active campaign against the Hugo Awards and other science-fiction writers.\nIt does prove Larry’s case. The focus of Felapton’s point is irrelevant in this regard. Felapton admitted that he would be voting on grounds other than the literary merit of the works concerned. That concedes Larry’s primary point. Larry argued, correctly, that the claims the Hugo Awards were awarded solely on the basis of merit were false, and moreover, that it was nothing but a popularity contest among a small group of people who leaned heavily to the political left. Although Felapton’s point is irrelevant, it also happens to be wrong since my active campaign is entirely the result of politics in science fiction. Their dislike of my politics is the only reason Patrick Nielsen Hayden, Teresa Nielsen Hayden, and John Scalzi started this conflict by publicly attacking me back in 2005.\nSigh. That isn’t the genetic fallacy.The genetic fallacy is a fallacy of IRRELEVANCE that confuses the SOURCE of a claim with its VERACITY. There isn’t a factual claim at stake here – I’m not saying a factual claim made by an author is false by virtue of his publisher (e.g. if somebody was to say that a claim about Gene Wolfe in the book was false purely on the basis that the book was a Castalia House book THAT would be the genetic fallacy).\nMy claim is that I can’t reward obnoxious behavior by Castalia House. Nothing to do with the genetic fallacy. Vox concedes that I raise one valid point, which is that “there is no way of separating what is published by Castalia from how Castalia promotes itself and its published works.” That is the ethical basis of my position and Vox concedes that it is valid and not fallacious.\nMore posing. Felapton is trying to play fast and loose with both his claims and the applicability of the genetic fallacy here. As the tagline to his blog states, “even when we’re being honest we come across as being disingenuous” and he is not being honest here. We know that he believes the Puppy nominees to be low-quality; he has openly said as much in the past. Now he is pretending that he doesn’t\nnecessarily\nbelieve that Castalia-published works are of insufficient quality to win awards, only that he “can’t reward obnoxious behavior by Castalia House.”\nIn other words, he is being disingenuous, and attempting to pretend that he is\nnot\nclaiming that a published work is not worthy of an award on the basis of its origins, it is simply that his pressing need to avoid rewarding what he believes to be obnoxious behavior just happens to justify precisely the same course of action. What a fortuitous coincidence!\nHowever, he made a mistake. He did not merely say that he was not refusing to support Castalia-published works on the basis of their origins. He could have said, in response to my statement, “the genetic fallacy doesn’t apply and here is why”, but instead, he said “that isn’t the genetic fallacy” and then proceeded to adminster another of his little lessons. He tried to kill two birds with one stone and thus exposed his true intentions. Let’s break it down:\nMy claim is that Felapton has concluded Castalia-published works lack merit due to their origins.\nFelapton asserts that that is not his conclusion. Dubious, but possible.\nFelapton asserts that is not the genetic fallacy. Wrong.\nHe blundered because it wasn’t enough for him to simply state that I failed to understand his motivation for no-awarding Castalia publications, he also tried to pretend that I don’t understand the genetic fallacy because he is still smarting over my demonstration of his inability to understand rhetoric. Interesting word, smarting, in light of the typical gamma response to being intellectually bested.\nAs for Felapton’s veracity and how seriously one should take his claims, well, his closing statement alone should suffice to judge that.\nWhat is more interesting is Vox losing his cool. That is a major departure from his play book and poor tactics. He is actually rattled? Surely not by me, so I assume it must be by Philip Sandifer’s campaign.\nAs it is written, SJWs always lie. Felapton and others continue on that theme in the comments. Those in italics are his.\nI suspect VD is completely panic stricken by Chuck Tingle\nhe tried the liberul-head-explody thing and then the liberul-heads didn’t explody\nFor a master of rhetoric, he has the debate strategy skills of a goldfish\nHe really can’t stand having people who know formal logic and rhetoric better than he does around\nIt’s also amusing to see him flailing around in his flop-sweat as you call him on being a serial bullshitter\nThe idea that I am “completely panic stricken by Chuck Tingle” is fascinating, considering that more than one journalist has contacted me this week to ask if I\nam\nChuck Tingle. That “let’s make their heads explode” thing is a Sad tactic, not a Rabid one; I don’t care how SJWs feel about Chuck Tingle or anything else. Delenda est. As for my “debate strategy skills”, well, there is\nthis\n. And\nthis\n.\nUPDATE: Lunacy from one of the banned ones, Golden Flowers aka Micael Gustavsson. Talk about the Third Law!\nClassic pathological narcissist – rubbing VD’s nose in the fact that he’s spouting crap threatens his identity as the Bestest Argumentarian EVAH, so he has to double down and come up with more bullshit on why his admirers should ignore his previous bullshit. I suspect VD is completely panic stricken by Chuck Tingle, and is flailing around trying to restore his feeling of being in control. He can’t; having opened Pandora’s box he is stuck with Tingle until the sun goes nova.. When VD is “amused” you know he is really upset.",
  "tags": [
    "Alpha Game",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-02T11:00:00+00:00"
}