{
  "url": "https://voxday.net/2016/05/15/how-to-guarantee-failure/",
  "scraped_at": "2025-12-17T17:57:44.148452",
  "title": "How to guarantee failure",
  "date_display": "May 15, 2016",
  "date_iso": "2016-05-15T10:36:00+00:00",
  "date_from_url": "2016-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s both amusing and a little annoying to see various AltRight figures freaking out about Heat Street running articles by me. Apparently the fear is that because it is a Dow Jones-owned outlet, it will somehow magically “coopt” the AltRight and make it disappear. Can you even imagine how <i>terrible</i> it would be if the New York Times gave me an op/ed column or if CNN gave Mike Cernovich a TV show?</p><p>This cooption concept is a fascinatingly stupid theory, in light of how the editor of Heat Street, Louise Mensch, has openly attacked the AltRight and is a card-carrying member of #NeverTrump. Heat Street is simply one of many media outlets, it isn’t the Tea Party 2.0. Unlike Dana Loesch, Dick Armey, and other conservatives who leaped to march in front of the Tea Party parade and were accepted as its public faces, literally no one, <i>including Louise herself</i>, is putting her or her site forward as an opinion leader of the Alt Right.</p><p>Here is the core problem with this cowardly paranoia: either the AltRight ideas can survive exposure to the mainstream or they cannot. There is only one way to find out, and that is to expose them to the mainstream. Therefore, those of us who are seen as “Alt Right figureheads” or influences of some kind should welcome every single outlet willing to consider them, whether it is friendly or hostile.</p><p>This really isn’t that difficult.</p><p>It is ironic that the Alt Right scolds worry rightly about SJW entryism while simultaneously refusing to dirty their delicate white hands by ever preaching to anyone who is not part of the choir, much less engaging in any entryism of their own. Apparently they prefer a purely defensive approach, which as every student of strategy or military history knows, virtually guarantees failure. This is also remarkably stupid, given that the Alt Right has seen how the determination of conservatives to remain solely on the defensive is one of the primary reasons for the catastrophic failure of conservatism.</p><p>It is a matter of public record that my articles and my interviews have appeared in everything from Pravda to the Guardian, from WorldNetDaily to the Wall Street Journal. Jews and SJWs condemn me for giving credibility to The Daily Shoah and Counter Currents. Alt Righters and white nationalists condemn me for giving credibility to Heat Street. Meanwhile, I have been reliably informed for 15 years now that I have no credibility of my own.</p><p>In case my position is not clear, let me state it outright: I reject the concept of credibility by association.</p><p>I am not a moderate, I am outlet-agnostic. No one owns me and no one dictates what I can and what I cannot say. And the Alt Right would do very well to learn from #GamerGate and stop trying to play tone-police or outlet-police.</p><p>Ideas stand alone, not on the basis of author, outlet, or association.</p><p> UPDATE: Some of these guys clearly don’t know me very well. I’m entirely happy to, as they suggest, GTFO of whatever they think their little movement happens to be. I’m not a joiner anyhow. Attempt to police me and I won’t hesitate to mute and ignore you.</p><p>And if you tell me I should not be contributing anywhere, then you will not be commenting here. Live by your professed principles, gentlemen. We wouldn’t want you being coopted by me, after all, and I can’t risk being coopted by you.</p></div>",
  "content_text": "It’s both amusing and a little annoying to see various AltRight figures freaking out about Heat Street running articles by me. Apparently the fear is that because it is a Dow Jones-owned outlet, it will somehow magically “coopt” the AltRight and make it disappear. Can you even imagine how\nterrible\nit would be if the New York Times gave me an op/ed column or if CNN gave Mike Cernovich a TV show?\nThis cooption concept is a fascinatingly stupid theory, in light of how the editor of Heat Street, Louise Mensch, has openly attacked the AltRight and is a card-carrying member of #NeverTrump. Heat Street is simply one of many media outlets, it isn’t the Tea Party 2.0. Unlike Dana Loesch, Dick Armey, and other conservatives who leaped to march in front of the Tea Party parade and were accepted as its public faces, literally no one,\nincluding Louise herself\n, is putting her or her site forward as an opinion leader of the Alt Right.\nHere is the core problem with this cowardly paranoia: either the AltRight ideas can survive exposure to the mainstream or they cannot. There is only one way to find out, and that is to expose them to the mainstream. Therefore, those of us who are seen as “Alt Right figureheads” or influences of some kind should welcome every single outlet willing to consider them, whether it is friendly or hostile.\nThis really isn’t that difficult.\nIt is ironic that the Alt Right scolds worry rightly about SJW entryism while simultaneously refusing to dirty their delicate white hands by ever preaching to anyone who is not part of the choir, much less engaging in any entryism of their own. Apparently they prefer a purely defensive approach, which as every student of strategy or military history knows, virtually guarantees failure. This is also remarkably stupid, given that the Alt Right has seen how the determination of conservatives to remain solely on the defensive is one of the primary reasons for the catastrophic failure of conservatism.\nIt is a matter of public record that my articles and my interviews have appeared in everything from Pravda to the Guardian, from WorldNetDaily to the Wall Street Journal. Jews and SJWs condemn me for giving credibility to The Daily Shoah and Counter Currents. Alt Righters and white nationalists condemn me for giving credibility to Heat Street. Meanwhile, I have been reliably informed for 15 years now that I have no credibility of my own.\nIn case my position is not clear, let me state it outright: I reject the concept of credibility by association.\nI am not a moderate, I am outlet-agnostic. No one owns me and no one dictates what I can and what I cannot say. And the Alt Right would do very well to learn from #GamerGate and stop trying to play tone-police or outlet-police.\nIdeas stand alone, not on the basis of author, outlet, or association.\nUPDATE: Some of these guys clearly don’t know me very well. I’m entirely happy to, as they suggest, GTFO of whatever they think their little movement happens to be. I’m not a joiner anyhow. Attempt to police me and I won’t hesitate to mute and ignore you.\nAnd if you tell me I should not be contributing anywhere, then you will not be commenting here. Live by your professed principles, gentlemen. We wouldn’t want you being coopted by me, after all, and I can’t risk being coopted by you.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-15T09:36:00+00:00"
}