{
  "url": "https://voxday.net/2016/05/18/how-to-save-science-fiction/",
  "scraped_at": "2025-12-17T17:58:13.722382",
  "title": "How to save science fiction",
  "date_display": "May 18, 2016",
  "date_iso": "2016-05-18T12:19:00+00:00",
  "date_from_url": "2016-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brad Torgersen explains how the Tor Cabal <a href=\"https://bradrtorgersen.wordpress.com/2016/05/17/panel-how-to-protect-science-fiction-awards-from-bad-people/\">is going to save science fiction</a> from the badthinkers:</p><blockquote class=\"tr_bq\"><p> GRUMPY OLD FAT RICH FAMOUS AUTHOR: Back when I didn’t have two nickels to rub together, the Hugos represented something special in this field. They were the yearly culmination of the collective Fannish spirit. Our communal celebration of what is best in this genre. We did this together — the many, come to unite as one.</p><p>AUDIENCE: (tepid applause, some straining forward in their seats, not quite sure where this is going)</p><p>GRUMPY OLD FAT RICH FAMOUS AUTHOR: Now, it’s all well and good to get rid of the Bad People™ because Lord knows I’m as sick of them as you all are.</p><p>AUDIENCE: (a spontaneous roar of agreement)</p><p>GRUMPY OLD FAT RICH FAMOUS AUTHOR: Our genre has never, ever been about Bad People™ nor should we ever be forced to tolerate the intolerant, who of course were never real Fans in the true meaning of Fannishness anyway, because we say so.</p><p>AUDIENCE: (collective orgasm of hearty ascent)</p><p>GRUMPY OLD FAT RICH FAMOUS AUTHOR: But this has to be done very politic-like. Why do you think all the great Socialist reformers of the past hundred years, have always staged elections? It didn’t matter if they were at the pinnacle of a one-party system, and gave themselves titles like “President.” What mattered is that their subjects — excuse me, citizens — were able to vote. That is the basis of the Republic — allowing people to pretend that there is actual democracy happening.</p><p>AUDIENCE: (murmurs, a few shouts, some scattered golf claps)</p><p>MODERATOR: (coughs nervously) But, sir, how are we to preserve and protect our glorious accolades?</p><p>SHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: I know nobody included me in this conversation, but I am going to include myself anyway, because everybody knows it’s all about me, in the end — me, me, and me. In fact, the only reason the Bad People™ exist at all, is because they are out to get me. That’s why there’s trouble in the Peoples Republic of Science Fiction. There are individuals who don’t like me, and have decided to get militant about it.</p><p>MODERATOR: (fawning over Shrimpy Famous-On-The-Internet Author) Well, please, by all means, have my chair! We would love to hear more.</p><p>AUDIENCE: (cheers, laughter)</p><p>SHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: I agree one hundred percent with my lovely and esteemed colleague, who is wealthier and more famous than me, so I will suck up to him at every opportunity — just like I do with that rock star Sandman guy. We of the pure and true fold, don’t need to tolerate the intolerant. Diversity means ensuring that a rainbow spectrum of ethnicities, genders, and sexualities — who all vote the same in national politics, have the same ideas on economics, and also literary taste — are afforded the opportunity to come celebrate with us, this most wonderful thing we call Science Fiction and Fantasy.</p><p>AUDIENCE: (massive, outlandish, squeeing approval)</p><p>SHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: But we have to be careful about how we go about ensuring that the Baen people, the FOX News viewers, the homophobes — did I tell you this hour how much I love and adore all gay people, for all time, everywhere? Because I, like, totally do! — and the transphobes, islamophobes, and other assorted Heinlein devotees, are kept out of the awards process. Do it too bluntly, and we risk sacrificing the public face of the field. We have to be sure we can say to the world — with straight faces — that Science Fiction and Fantasy is still a field that celebrates all ideas. Even though we want to make damned sure that SF/F’s power people and core literary prizes remain firmly on the side of the right ideas. Progressive ideas. For all definitions of Progressive which include, “Whatever Jon Stewart is being cute about this week.”</p><p>AUDIENCE: (murmuring wonderment at the great man’s epic intellect)</p><p>MODERATOR: (crying) My God, that was so beautiful . . . (reaches for tissue)</p><p>GRUMPY OLD FAT RICH FAMOUS AUTHOR: (steeples fingers) We’re kind of stating the obvious at this point. So, since we agree that we can’t be direct in addressing the problem of Bad People™ meddling in our business, what’s your proposal?</p><p>EDITOR TO THE SHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: (clears throat) Actually, it’s not his proposal, it’s mine. Because when it comes right down to it, we all know you writers would sell your souls for the right offer; from my house specifically. I can make or break any of you, any time I want. Same goes for people like that chump moderator over there, licking the hand of the caterer who’s putting out the lavish spread of food and treats — a spread my company is of course paying for, because the best way to win the hearts and minds of Fandom, is to give them free shit. Anyway, you all will rubber stamp whatever I want, in the end — just like when we split the editor category — so I’ll have my wife draft something on our blog later in the week. We can assume it will pass with flying colors at the business meeting, right?</p></blockquote><p>It’s funny because it’s true. A lot of people don’t realize that EPH is a mandate straight out of the Nielsen Hayden family blog, previously known for creating the Best Editor Long Form award so <strike>I could be nominated every year</strike> Patrick Nielsen Hayden would finally get a few Hugos and stop crying about always losing out to Gardner Dozois.</p><p>Meanwhile, the second stage of my master plan <a href=\"http://act.colorofchange.org/sign/publishers-increase-inclusion-equity/?sp_ref=196815888.176.162563.f.0.2&amp;referring_akid=5774.1511193.lhmHgs&amp;source=fb_sp\">is rapidly coming to fruition</a>.</p><blockquote class=\"tr_bq\"><p> To the CEOs of Penguin Random House, Macmillan, HarperCollins, Hachette and Simon &amp; Schuster</p><p>We, the undersigned, are writing on behalf of the Black community, which has long supported the publishing industry despite being shut out of it. College-educated Black women are the group most likely to read books in the U.S., and Black people read more of every type of book. People of color make up 37% of the US population. The publishing industry cannot continue to shut out and ignore the literary interests of communities of color.</p><p>Black authors, reviewers, and editors are being shut out of the publishing industry. Despite pledges and commitments from the most influential institutions to rectify this imbalance, little progress has been made. The 2015 Diversity Baseline Survey, conducted by Lee &amp; Low books, shows just how racially homogeneous the publishing industry is. 79% of publishing and review journal staffers are white. A full 86% of executives are white. The dearth of racial inclusion within the publishing industry is reflected in the books that are accepted, produced, and sold. Only 10% of children’s books published since 1994 have been by, or about, people of color.</p><p>Major publishers have been historically averse to publishing books by or about Black individuals, averaging fewer than four African-American biographies a year. Journalism outlets like the New York Times and NPR regularly publish reading lists comprised almost exclusively of white authors. In majority non-white cities like New York, more than 60% of the cultural sector, which includes museums, theaters and other organizations, are white. And lack of editorial insight into sensitive historical and cultural issues can lead to harmful, ignorant books by white authors being published despite protest from Black communities.</p><p>The reality is that people of color often come from low-income backgrounds and have less access to professional opportunities or mentorship networks within the publishing industry. Unless the publishing industry makes a concerted, well-resourced effort to lower barriers that keep out minorities, the status quo will never change. Participating in voluntary diversity surveys or pledging to pay more attention to racial demographics is only an acknowledgement of the diversity crisis. Large publishing institutions should fund initiatives that foster inclusion and create opportunities for authors, reviewers, and editors of color to thrive within the industry.</p><p>There have been myriad discussions on the necessity of diversity, on the importance of inclusion, on the value of equitable racial representation in not just publishing, but every industry. But we have come to a point where those words and sentiments must be matched with actions. When presidential candidates feel comfortable spewing hateful rhetoric to their supporters, it is a sign that all of us must do more to fight back against ideas and beliefs that divide or endanger people of color. Books shape our perceptions, give us insights into different experiences, and teach us lessons that we carry our entire lives.</p><p>Will you support a future that recognizes and values the literary voices and talents of Black people and people of color?</p></blockquote><p>Yes, yes, absolutely yes! I could not agree more and I signed the petition. I absolutely support it, in fact, I will go one step further and demand that the CEOs of Penguin, Random House, Macmillan, HarperCollins, Hachette, and Simon &amp; Schuster publish ONLY black WOMEN and women of color and/or diverse sexual orientations and identities. After all, “black people read more of every type of book.”</p><p>You can’t argue with that.</p><p>This year’s Nebula Awards, where 24 out of the 34 works nominated for the award were written by women from multiple racial and cultural backgrounds and a spectrum of sexual orientations, and only 5 works were written by straight white men, is a step in the right direction. But we’re not there yet! Not yet!</p><p>We must not stop until Pink SF is 100 percent SJW-converged, and 100 percent of the authors, editors, and awards are black women and women of color!</p><p>UPDATE: And you thought I was kidding.</p><blockquote class=\"tr_bq\"><p> Dear Vox,</p><p>Thank you for taking action and adding your voice to the demand that the “Big Five” publishing houses create internships specifically for Black people and people of color. With your help we can ensure that diversity is more than just a buzzword used by companies. We can ensure that racial inclusion and equity become a reality, and that we are included in the portrayal of our stories.</p><p>Sincerely,</p><p>Brandi, Rashad, Arisha, Bernard, Brittaney, Evan, and the rest of the ColorOfChange team </p></blockquote></div>",
  "content_text": "Brad Torgersen explains how the Tor Cabal\nis going to save science fiction\nfrom the badthinkers:\nGRUMPY OLD FAT RICH FAMOUS AUTHOR: Back when I didn’t have two nickels to rub together, the Hugos represented something special in this field. They were the yearly culmination of the collective Fannish spirit. Our communal celebration of what is best in this genre. We did this together — the many, come to unite as one.\nAUDIENCE: (tepid applause, some straining forward in their seats, not quite sure where this is going)\nGRUMPY OLD FAT RICH FAMOUS AUTHOR: Now, it’s all well and good to get rid of the Bad People™ because Lord knows I’m as sick of them as you all are.\nAUDIENCE: (a spontaneous roar of agreement)\nGRUMPY OLD FAT RICH FAMOUS AUTHOR: Our genre has never, ever been about Bad People™ nor should we ever be forced to tolerate the intolerant, who of course were never real Fans in the true meaning of Fannishness anyway, because we say so.\nAUDIENCE: (collective orgasm of hearty ascent)\nGRUMPY OLD FAT RICH FAMOUS AUTHOR: But this has to be done very politic-like. Why do you think all the great Socialist reformers of the past hundred years, have always staged elections? It didn’t matter if they were at the pinnacle of a one-party system, and gave themselves titles like “President.” What mattered is that their subjects — excuse me, citizens — were able to vote. That is the basis of the Republic — allowing people to pretend that there is actual democracy happening.\nAUDIENCE: (murmurs, a few shouts, some scattered golf claps)\nMODERATOR: (coughs nervously) But, sir, how are we to preserve and protect our glorious accolades?\nSHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: I know nobody included me in this conversation, but I am going to include myself anyway, because everybody knows it’s all about me, in the end — me, me, and me. In fact, the only reason the Bad People™ exist at all, is because they are out to get me. That’s why there’s trouble in the Peoples Republic of Science Fiction. There are individuals who don’t like me, and have decided to get militant about it.\nMODERATOR: (fawning over Shrimpy Famous-On-The-Internet Author) Well, please, by all means, have my chair! We would love to hear more.\nAUDIENCE: (cheers, laughter)\nSHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: I agree one hundred percent with my lovely and esteemed colleague, who is wealthier and more famous than me, so I will suck up to him at every opportunity — just like I do with that rock star Sandman guy. We of the pure and true fold, don’t need to tolerate the intolerant. Diversity means ensuring that a rainbow spectrum of ethnicities, genders, and sexualities — who all vote the same in national politics, have the same ideas on economics, and also literary taste — are afforded the opportunity to come celebrate with us, this most wonderful thing we call Science Fiction and Fantasy.\nAUDIENCE: (massive, outlandish, squeeing approval)\nSHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: But we have to be careful about how we go about ensuring that the Baen people, the FOX News viewers, the homophobes — did I tell you this hour how much I love and adore all gay people, for all time, everywhere? Because I, like, totally do! — and the transphobes, islamophobes, and other assorted Heinlein devotees, are kept out of the awards process. Do it too bluntly, and we risk sacrificing the public face of the field. We have to be sure we can say to the world — with straight faces — that Science Fiction and Fantasy is still a field that celebrates all ideas. Even though we want to make damned sure that SF/F’s power people and core literary prizes remain firmly on the side of the right ideas. Progressive ideas. For all definitions of Progressive which include, “Whatever Jon Stewart is being cute about this week.”\nAUDIENCE: (murmuring wonderment at the great man’s epic intellect)\nMODERATOR: (crying) My God, that was so beautiful . . . (reaches for tissue)\nGRUMPY OLD FAT RICH FAMOUS AUTHOR: (steeples fingers) We’re kind of stating the obvious at this point. So, since we agree that we can’t be direct in addressing the problem of Bad People™ meddling in our business, what’s your proposal?\nEDITOR TO THE SHRIMPY FAMOUS-ON-THE-INTERNET AUTHOR: (clears throat) Actually, it’s not his proposal, it’s mine. Because when it comes right down to it, we all know you writers would sell your souls for the right offer; from my house specifically. I can make or break any of you, any time I want. Same goes for people like that chump moderator over there, licking the hand of the caterer who’s putting out the lavish spread of food and treats — a spread my company is of course paying for, because the best way to win the hearts and minds of Fandom, is to give them free shit. Anyway, you all will rubber stamp whatever I want, in the end — just like when we split the editor category — so I’ll have my wife draft something on our blog later in the week. We can assume it will pass with flying colors at the business meeting, right?\nIt’s funny because it’s true. A lot of people don’t realize that EPH is a mandate straight out of the Nielsen Hayden family blog, previously known for creating the Best Editor Long Form award so\nI could be nominated every year\nPatrick Nielsen Hayden would finally get a few Hugos and stop crying about always losing out to Gardner Dozois.\nMeanwhile, the second stage of my master plan\nis rapidly coming to fruition\n.\nTo the CEOs of Penguin Random House, Macmillan, HarperCollins, Hachette and Simon & Schuster\nWe, the undersigned, are writing on behalf of the Black community, which has long supported the publishing industry despite being shut out of it. College-educated Black women are the group most likely to read books in the U.S., and Black people read more of every type of book. People of color make up 37% of the US population. The publishing industry cannot continue to shut out and ignore the literary interests of communities of color.\nBlack authors, reviewers, and editors are being shut out of the publishing industry. Despite pledges and commitments from the most influential institutions to rectify this imbalance, little progress has been made. The 2015 Diversity Baseline Survey, conducted by Lee & Low books, shows just how racially homogeneous the publishing industry is. 79% of publishing and review journal staffers are white. A full 86% of executives are white. The dearth of racial inclusion within the publishing industry is reflected in the books that are accepted, produced, and sold. Only 10% of children’s books published since 1994 have been by, or about, people of color.\nMajor publishers have been historically averse to publishing books by or about Black individuals, averaging fewer than four African-American biographies a year. Journalism outlets like the New York Times and NPR regularly publish reading lists comprised almost exclusively of white authors. In majority non-white cities like New York, more than 60% of the cultural sector, which includes museums, theaters and other organizations, are white. And lack of editorial insight into sensitive historical and cultural issues can lead to harmful, ignorant books by white authors being published despite protest from Black communities.\nThe reality is that people of color often come from low-income backgrounds and have less access to professional opportunities or mentorship networks within the publishing industry. Unless the publishing industry makes a concerted, well-resourced effort to lower barriers that keep out minorities, the status quo will never change. Participating in voluntary diversity surveys or pledging to pay more attention to racial demographics is only an acknowledgement of the diversity crisis. Large publishing institutions should fund initiatives that foster inclusion and create opportunities for authors, reviewers, and editors of color to thrive within the industry.\nThere have been myriad discussions on the necessity of diversity, on the importance of inclusion, on the value of equitable racial representation in not just publishing, but every industry. But we have come to a point where those words and sentiments must be matched with actions. When presidential candidates feel comfortable spewing hateful rhetoric to their supporters, it is a sign that all of us must do more to fight back against ideas and beliefs that divide or endanger people of color. Books shape our perceptions, give us insights into different experiences, and teach us lessons that we carry our entire lives.\nWill you support a future that recognizes and values the literary voices and talents of Black people and people of color?\nYes, yes, absolutely yes! I could not agree more and I signed the petition. I absolutely support it, in fact, I will go one step further and demand that the CEOs of Penguin, Random House, Macmillan, HarperCollins, Hachette, and Simon & Schuster publish ONLY black WOMEN and women of color and/or diverse sexual orientations and identities. After all, “black people read more of every type of book.”\nYou can’t argue with that.\nThis year’s Nebula Awards, where 24 out of the 34 works nominated for the award were written by women from multiple racial and cultural backgrounds and a spectrum of sexual orientations, and only 5 works were written by straight white men, is a step in the right direction. But we’re not there yet! Not yet!\nWe must not stop until Pink SF is 100 percent SJW-converged, and 100 percent of the authors, editors, and awards are black women and women of color!\nUPDATE: And you thought I was kidding.\nDear Vox,\nThank you for taking action and adding your voice to the demand that the “Big Five” publishing houses create internships specifically for Black people and people of color. With your help we can ensure that diversity is more than just a buzzword used by companies. We can ensure that racial inclusion and equity become a reality, and that we are included in the portrayal of our stories.\nSincerely,\nBrandi, Rashad, Arisha, Bernard, Brittaney, Evan, and the rest of the ColorOfChange team",
  "tags": [
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-18T11:19:00+00:00"
}