{
  "url": "https://voxday.net/2016/05/20/jonah-goldberg-and-end-of/",
  "scraped_at": "2025-12-17T17:58:23.759756",
  "title": "Jonah Goldberg and the end of Holocaustianity",
  "date_display": "May 20, 2016",
  "date_iso": "2016-05-20T06:00:00+00:00",
  "date_from_url": "2016-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A Twitter discourse:</i></p><p>Jonah Goldberg ‏@JonahNRO<br> 1. Apologize for racist &amp; Jew-hating, “kids” as they celebrate murder etc. 2. ????? 3. Total GOP victory. @Nero’s grand 2016 strategy.</br></p><p>Supreme Dark Lord ‏@voxday<br> Jonah, no one under the age of 40 gives a damn about Holocaustianity anymore than they do about the Sicilian Vespers.</br></p><p>Jonah Goldberg ‏@JonahNRO<br> Vox, 1. That’s horseshit 2. Even if it wasn’t, that’s not an argument for saying disgusting and bigoted things for laughs.</br></p><p>Supreme Dark Lord ‏@voxday<br> How much do you care about the Left calling you racist? That’s how much #AltRight cares about being called anti-semitic.</br></p><p>Supreme Dark Lord ‏@voxday<br> What do those called anti-semites for supporting Trump have to fear? They’ll be called anti-semites a second time? So what?</br></p><p>Hank Coates ‏@hankhank30<br> complete and utter horseshit. I went to school with holocaust survivor grandkids. Fuck that fascist.</br></p><p>Supreme Dark Lord ‏@voxday<br> Nobody cares. The Hispanics don’t care. The blacks don’t care. The Asians don’t care. Most whites don’t anymore.</br></p><p>Milo Yiannopoulos ✘ ‏@Nero<br> The left robbed racist, sexist and homophobic of meaning. The right did the same to anti-semitic. No one under 40 cares about any of them.</br></p><p>Nunuya Bizinizz ‏@wahrbear<br> I’m confirming @voxday’s assertion here. Early Millennail Jew and I really find holocaust whiners embarrassing.</br></p><p>AltRightJew ‏@AltRightJew<br> agreed. Unless you lived through it and endured it, not really interested in hearing you whine about it.</br></p><p>Jonah Goldberg ‏@JonahNRO<br> All day this crap. Thanks @nero and @voxday your friends get your back</br></p><p>Supreme Dark Lord ‏@voxday<br> Jonah, you know I respect you. But you did go after @nero…. and this was really nothing. I didn’t even call out the VFM.</br></p><p>Milo Yiannopoulos ✘ ‏@Nero<br> Guilt by association! A classic Leftist debate tactic. Also: you started it.</br></p></div>",
  "content_text": "A Twitter discourse:\nJonah Goldberg ‏@JonahNRO\n1. Apologize for racist & Jew-hating, “kids” as they celebrate murder etc. 2. ????? 3. Total GOP victory. @Nero’s grand 2016 strategy.\nSupreme Dark Lord ‏@voxday\nJonah, no one under the age of 40 gives a damn about Holocaustianity anymore than they do about the Sicilian Vespers.\nJonah Goldberg ‏@JonahNRO\nVox, 1. That’s horseshit 2. Even if it wasn’t, that’s not an argument for saying disgusting and bigoted things for laughs.\nSupreme Dark Lord ‏@voxday\nHow much do you care about the Left calling you racist? That’s how much #AltRight cares about being called anti-semitic.\nSupreme Dark Lord ‏@voxday\nWhat do those called anti-semites for supporting Trump have to fear? They’ll be called anti-semites a second time? So what?\nHank Coates ‏@hankhank30\ncomplete and utter horseshit. I went to school with holocaust survivor grandkids. Fuck that fascist.\nSupreme Dark Lord ‏@voxday\nNobody cares. The Hispanics don’t care. The blacks don’t care. The Asians don’t care. Most whites don’t anymore.\nMilo Yiannopoulos ✘ ‏@Nero\nThe left robbed racist, sexist and homophobic of meaning. The right did the same to anti-semitic. No one under 40 cares about any of them.\nNunuya Bizinizz ‏@wahrbear\nI’m confirming @voxday’s assertion here. Early Millennail Jew and I really find holocaust whiners embarrassing.\nAltRightJew ‏@AltRightJew\nagreed. Unless you lived through it and endured it, not really interested in hearing you whine about it.\nJonah Goldberg ‏@JonahNRO\nAll day this crap. Thanks @nero and @voxday your friends get your back\nSupreme Dark Lord ‏@voxday\nJonah, you know I respect you. But you did go after @nero…. and this was really nothing. I didn’t even call out the VFM.\nMilo Yiannopoulos ✘ ‏@Nero\nGuilt by association! A classic Leftist debate tactic. Also: you started it.",
  "tags": [
    "history",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-20T05:00:00+00:00"
}