{
  "url": "https://voxday.net/2016/05/06/kukuruyo-attacked-pedofilers-feign/",
  "scraped_at": "2025-12-17T17:56:39.586857",
  "title": "Kukuruyo attacked, pedofilers feign innocence",
  "date_display": "May 6, 2016",
  "date_iso": "2016-05-06T12:00:00+00:00",
  "date_from_url": "2016-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even as they chortle over Chuck Tingle, who they’re going to No Award despite their frantic insistence that they <i>totally</i> get his act and think he is <i>so</i> <i>very</i> funny, the pedofilers are pretending that the timing of the SJW attacks on Kukuruyo are pure coincidence.</p><blockquote class=\"tr_bq\"><p> “No one is targeting artists because of their politics”. That’s a line that i’ve heard a lot from the social justice circles every time an artist is censored, or is attacked so much that they self-censor. It’s a line i’ve read several times in the last week directed at me, when i have commented in social media about some new attack upon myself. I think my experiences over this last week are a clear example on how, yes, artists are being targeted because of their politics, everytime those politics diverge from the progressive ideology.</p><p>I’ve always been an artist who does adult content. My hentai creations have been placed on the internet for more than a decade, and i’ve never had any problems because of it. Yeah, sometimes i got a drawing banned from deviantart, but they were very sporadic things, and usualy deserved; one every 2-3 years at most. No one ever wrote anything about what a horrible person i was for doing erotic fanarts and such.</p><p>Since i publicy became a gamergate supporter, the ammount of reports i’ve gotten on art sites have increased, many times in very underserved cases (i got a drawing pulled because the characters had sweat. Yes, sweat…) as well as the amount of people lying about me on blogs and such. And i don’t mean making critiques of me, i mean outright lies (one guy even wrote about how i voted for some candidate in the past US elections, which is interesting considering i’m a spaniard living in Spain). Not only that, but my website began to have attemps to break in. At some point i was receiving more than 50 attempts to break in each day, until i upgraded my security.</p><p>But this broke into a new level when i was announced as a finalist for best Fan artist at the Hugo awards. Then people in the social justice circles discovered that i support gamergate, and since then, interesting things have been happening one after the other (aside from the wave of verbal attacks, of course).</p><p>First one of my gamergate related works got reported and banned from deviantart. Then someone picked a cheap fanart that i was commissioned to do, about a half nude Ms.marvel, and tried to frame me as a pedophile, because aparently the character has 16 in the original canon (something i even didn’t know), ignoring the fact that the character body was adult. This story was writen about in (as far as i know) a blog and then in a comic news article, expanding the idea that i’m a pedophile for an anime style fanart thats no different than the millions upon millions of anime character fanarts out there, and that i was somehow a terrible threat for teenagers out there who have their heroes destroyed by evil me. I was reported in devianart for “pedophilia” and the drawing was taken down. I got reported on twitter. The attemps to break into my website have come arround again. Then they contacted my advertising affiliates, telling them i was hosting child pornography, so they would cease to advertise with me. They acepted a middle ground solution at first, but then they changed their policies, and now i can no longer receive their service. Yes, and advertising website changed their policies just because of me… and just yesteday some guys where trying to get MARVEL to SUE ME because of a fanart!</p><p>But hey, i’m sure all of this is just a coincidence! this has nothing to do with the Hugo awards or gamergate. I’m sure it’s just that a whole lot of people randomly decided the same week to try to fuck me up in every way they could, right? this can’t possibly be related with people from a particular ideology, pissed off because someone with the wrong opinions got a Hugo nomination.</p></blockquote><p>As one pedofiler noted, both Kukuruyo and Chuck Tingle were nominated to further the Supreme Dark Lord’s evil agenda, but the two resulting stories are unfolding very differently indeed. Which, she fails to note, is exactly as anyone who has read the 2016 finalist for Best Related Work, <i>SJWs Always Lie</i>, would have been able to predict.</p><p>The fact is that in addition to always lying, SJWs always try to spin the narrative even as they always try to discredit, disemploy, and destroy those who refuse to submit to their social justice narrative. Kukuruyo is #GamerGate, so SJWs are doing the same thing they did from the very first day Castalia House endorsed #GamerGate; we have been under non-stop script kiddy attacks ever since. Fortunately, the SJW hackers are as incompetent as one would expect them to be; keeping them out has been a simple matter of practicing basic security.</p><p>Of course, being SJWs, the pedofilers have to do what SJWs always do.</p><ul><li><i>Hard to believe that getting his shitty, sleazy fanart suddenly thrust into the spotlight courtesy of a complete asshat could possibly have any negative consequences for the poor little troll. Actions something something consequences.</i></li><li><i>You lie down with assholes, you get up with shit on you, sonny. Also, like all Perritos, he conflates “wrong ideology” with “no talent” and “slating”. Actions have consequences.</i></li><li><i>Always amusing to see a GGer suddenly discover that “Holy Crap, I can be<br> held responsible for my actions?! I thought that only happened to<br> women!”</br></br></i></li><li><i>’My friend nominated my house for the best garden award and now the cops<br> are all over the meth lab in my garage. I blame literally anyone but my<br> friend.’</br></br></i></li><li><i>I remember at least one, possibly two, of the Meedium Geenyuses complaining that someone was trying to hack their Facebook accounts — and claiming that clearly puppykicker SJWs were behind this…. That people are egotistical enough to assume that they are always<br> deliberately targeted because of who or what they are, rather than<br> considering that they may just have been the noticed flavor of the day<br> by trolls and hackers… this is a thing that happens.</br></br></br></i></li></ul><p>So, if the SJWs are to be believed, the attacks on Kukuruyo are just a random thing that happens, but are also an obvious and well-merited consequence of his actions due to his being on the wrong side. Right.</p><p>Anyhow, Kukuruyo is  #GamerGate, he’s been active in the cultural war longer than the SF-SJWs were aware that anyone was shooting back, and he knows very well how it goes. Like Milo, like Cernovich, like Hulk Hogan, and like me, I have no doubt that he’ll come out of this latest SJW assault considerably better off than he was when they first went after him.</p><p>And as a result of witnessing it, dozens, perhaps hundreds more people who had previously been neutral will come to understand that no one, however liberal they might be, is ever safe from SJW mobbing.</p></div>",
  "content_text": "Even as they chortle over Chuck Tingle, who they’re going to No Award despite their frantic insistence that they\ntotally\nget his act and think he is\nso\nvery\nfunny, the pedofilers are pretending that the timing of the SJW attacks on Kukuruyo are pure coincidence.\n“No one is targeting artists because of their politics”. That’s a line that i’ve heard a lot from the social justice circles every time an artist is censored, or is attacked so much that they self-censor. It’s a line i’ve read several times in the last week directed at me, when i have commented in social media about some new attack upon myself. I think my experiences over this last week are a clear example on how, yes, artists are being targeted because of their politics, everytime those politics diverge from the progressive ideology.\nI’ve always been an artist who does adult content. My hentai creations have been placed on the internet for more than a decade, and i’ve never had any problems because of it. Yeah, sometimes i got a drawing banned from deviantart, but they were very sporadic things, and usualy deserved; one every 2-3 years at most. No one ever wrote anything about what a horrible person i was for doing erotic fanarts and such.\nSince i publicy became a gamergate supporter, the ammount of reports i’ve gotten on art sites have increased, many times in very underserved cases (i got a drawing pulled because the characters had sweat. Yes, sweat…) as well as the amount of people lying about me on blogs and such. And i don’t mean making critiques of me, i mean outright lies (one guy even wrote about how i voted for some candidate in the past US elections, which is interesting considering i’m a spaniard living in Spain). Not only that, but my website began to have attemps to break in. At some point i was receiving more than 50 attempts to break in each day, until i upgraded my security.\nBut this broke into a new level when i was announced as a finalist for best Fan artist at the Hugo awards. Then people in the social justice circles discovered that i support gamergate, and since then, interesting things have been happening one after the other (aside from the wave of verbal attacks, of course).\nFirst one of my gamergate related works got reported and banned from deviantart. Then someone picked a cheap fanart that i was commissioned to do, about a half nude Ms.marvel, and tried to frame me as a pedophile, because aparently the character has 16 in the original canon (something i even didn’t know), ignoring the fact that the character body was adult. This story was writen about in (as far as i know) a blog and then in a comic news article, expanding the idea that i’m a pedophile for an anime style fanart thats no different than the millions upon millions of anime character fanarts out there, and that i was somehow a terrible threat for teenagers out there who have their heroes destroyed by evil me. I was reported in devianart for “pedophilia” and the drawing was taken down. I got reported on twitter. The attemps to break into my website have come arround again. Then they contacted my advertising affiliates, telling them i was hosting child pornography, so they would cease to advertise with me. They acepted a middle ground solution at first, but then they changed their policies, and now i can no longer receive their service. Yes, and advertising website changed their policies just because of me… and just yesteday some guys where trying to get MARVEL to SUE ME because of a fanart!\nBut hey, i’m sure all of this is just a coincidence! this has nothing to do with the Hugo awards or gamergate. I’m sure it’s just that a whole lot of people randomly decided the same week to try to fuck me up in every way they could, right? this can’t possibly be related with people from a particular ideology, pissed off because someone with the wrong opinions got a Hugo nomination.\nAs one pedofiler noted, both Kukuruyo and Chuck Tingle were nominated to further the Supreme Dark Lord’s evil agenda, but the two resulting stories are unfolding very differently indeed. Which, she fails to note, is exactly as anyone who has read the 2016 finalist for Best Related Work,\nSJWs Always Lie\n, would have been able to predict.\nThe fact is that in addition to always lying, SJWs always try to spin the narrative even as they always try to discredit, disemploy, and destroy those who refuse to submit to their social justice narrative. Kukuruyo is #GamerGate, so SJWs are doing the same thing they did from the very first day Castalia House endorsed #GamerGate; we have been under non-stop script kiddy attacks ever since. Fortunately, the SJW hackers are as incompetent as one would expect them to be; keeping them out has been a simple matter of practicing basic security.\nOf course, being SJWs, the pedofilers have to do what SJWs always do.\nHard to believe that getting his shitty, sleazy fanart suddenly thrust into the spotlight courtesy of a complete asshat could possibly have any negative consequences for the poor little troll. Actions something something consequences.\nYou lie down with assholes, you get up with shit on you, sonny. Also, like all Perritos, he conflates “wrong ideology” with “no talent” and “slating”. Actions have consequences.\nAlways amusing to see a GGer suddenly discover that “Holy Crap, I can be\nheld responsible for my actions?! I thought that only happened to\nwomen!”\n’My friend nominated my house for the best garden award and now the cops\nare all over the meth lab in my garage. I blame literally anyone but my\nfriend.’\nI remember at least one, possibly two, of the Meedium Geenyuses complaining that someone was trying to hack their Facebook accounts — and claiming that clearly puppykicker SJWs were behind this…. That people are egotistical enough to assume that they are always\ndeliberately targeted because of who or what they are, rather than\nconsidering that they may just have been the noticed flavor of the day\nby trolls and hackers… this is a thing that happens.\nSo, if the SJWs are to be believed, the attacks on Kukuruyo are just a random thing that happens, but are also an obvious and well-merited consequence of his actions due to his being on the wrong side. Right.\nAnyhow, Kukuruyo is  #GamerGate, he’s been active in the cultural war longer than the SF-SJWs were aware that anyone was shooting back, and he knows very well how it goes. Like Milo, like Cernovich, like Hulk Hogan, and like me, I have no doubt that he’ll come out of this latest SJW assault considerably better off than he was when they first went after him.\nAnd as a result of witnessing it, dozens, perhaps hundreds more people who had previously been neutral will come to understand that no one, however liberal they might be, is ever safe from SJW mobbing.",
  "tags": [
    "#GamerGate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-06T11:00:00+00:00"
}