{
  "url": "https://voxday.net/2016/05/12/look-out-sf-fando/",
  "scraped_at": "2025-12-17T17:57:27.268767",
  "title": "Look out, SF fandom",
  "date_display": "May 12, 2016",
  "date_iso": "2016-05-12T12:09:00+00:00",
  "date_from_url": "2016-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Cernovich <a href=\"http://www.dangerandplay.com/2016/05/11/senator-ben-sasse-how-i-ended-a-presidential-campaign-before-it-started/\">is taking scalps</a>:</p><blockquote class=\"tr_bq\"><p> Senator Ben Sasse of Nebraska will not be running for President after his connection to pedophiles was revealed by Mike Cernovich of Danger &amp; Play Media. (Read: <a href=\"http://www.dangerandplay.com/2016/05/05/ben-sasse-and-nevertrumps-pedophile-problem/\">Ben Sasse and #NeverTrump’s Pedophile Problem</a>.)</p><p>This entire election season Sasse has building up his personal brand by attacking Trump. Sasse had not taken a principled stand against anyone else on the right, and thus he’s engaging in showmanship marketing in an effort to run for president.</p><p>His campaign for president began gaining momentum, with establishment conservatives hailing him as a hero. He was primed to run, and then I scalped him.</p><p>Sasse claimed to be a political outsider, so I began digging. Far<br> from being an everyman, Sasse was an insider’s insider, working at<br> companies like McKinsey and Company in between stints in Washington,<br> D.C. Yet what was not common knowledge was Sasse’s role as a tutor of<br> underage boys.</br></br></br></br></p><p>Sasse tutored and was sworn to protect underage boys working as<br> Congressional pages. Yet pages were constantly abused, and I suspected,<br> were abused under his watch. When I raise those concerns to Sasse, he<br> went radio silent.</br></br></br></p></blockquote><p>Radio silence is a good way to describe the science fiction’s response to the <i>considerable</i> amount of smoke surrounding Samuel Delaney, just to specifically name one oft-celebrated individual. Notice that despite the science fiction community’s retroactive distancing from H.P. Lovecraft, Marion Zimmer Bradley has not yet been stripped of a single award or honor, DAW still publishes her Darkover books, and Tor Books still publishes her “Light” series.</p><p>So why are DAW and Tor Books <a href=\"http://us.macmillan.com/series/light\">still publishing Marion Zimmer Bradley</a> in the full knowledge of her crimes? Do they endorse child abuse? It certainly puts a very dark spin on the title of Tor Books editor Patrick Nielsen Hayden’s blog, “Making Light”.</p></div>",
  "content_text": "Mike Cernovich\nis taking scalps\n:\nSenator Ben Sasse of Nebraska will not be running for President after his connection to pedophiles was revealed by Mike Cernovich of Danger & Play Media. (Read:\nBen Sasse and #NeverTrump’s Pedophile Problem\n.)\nThis entire election season Sasse has building up his personal brand by attacking Trump. Sasse had not taken a principled stand against anyone else on the right, and thus he’s engaging in showmanship marketing in an effort to run for president.\nHis campaign for president began gaining momentum, with establishment conservatives hailing him as a hero. He was primed to run, and then I scalped him.\nSasse claimed to be a political outsider, so I began digging. Far\nfrom being an everyman, Sasse was an insider’s insider, working at\ncompanies like McKinsey and Company in between stints in Washington,\nD.C. Yet what was not common knowledge was Sasse’s role as a tutor of\nunderage boys.\nSasse tutored and was sworn to protect underage boys working as\nCongressional pages. Yet pages were constantly abused, and I suspected,\nwere abused under his watch. When I raise those concerns to Sasse, he\nwent radio silent.\nRadio silence is a good way to describe the science fiction’s response to the\nconsiderable\namount of smoke surrounding Samuel Delaney, just to specifically name one oft-celebrated individual. Notice that despite the science fiction community’s retroactive distancing from H.P. Lovecraft, Marion Zimmer Bradley has not yet been stripped of a single award or honor, DAW still publishes her Darkover books, and Tor Books still publishes her “Light” series.\nSo why are DAW and Tor Books\nstill publishing Marion Zimmer Bradley\nin the full knowledge of her crimes? Do they endorse child abuse? It certainly puts a very dark spin on the title of Tor Books editor Patrick Nielsen Hayden’s blog, “Making Light”.",
  "tags": [
    "Pink SF",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-12T11:09:00+00:00"
}