{
  "url": "https://voxday.net/2016/05/13/milo-chooses-coulter-over-cathy/",
  "scraped_at": "2025-12-17T17:57:31.718789",
  "title": "Milo chooses Coulter over Cathy",
  "date_display": "May 13, 2016",
  "date_iso": "2016-05-13T12:00:00+00:00",
  "date_from_url": "2016-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s the nasty thing about cultural war. As with a civil war, sooner or later, whether one will or no, one is eventually <a href=\"http://www.breitbart.com/milo/2016/05/13/cathy-young-turning-into-social-justice-warrior/\">forced to choose sides</a>.</p><blockquote class=\"tr_bq\"><p> It’s dreadful when two people you admire start beating each other up. Sort of like childhood all over again!</p><p>But that’s primary season for you. Particularly this year, it has former allies at each others’ throats. It almost makes you miss the days when SJWs weren’t irrelevant! Almost.</p><p>The latest salvo in these internecine conflicts comes from Cathy Young, one of a growing number of libertarians and conservatives who are turning their guns on their own side. She’s gone after none other than Ann Coulter, my only rival for the throne as sassy blonde queen of conservative media.</p><p>This is a difficult column to write, as I know both women and enjoy them both in different ways. Both have grappled fearlessly with the worst elements of the left over the years. And now I have to take sides!</p><p>Still, it’s Cathy who was the aggressor in this instance, attacking Coulter with the disturbingly leftist tactic of guilt-by-association and unsubstantiated name-calling.</p><p>Because Coulter has written for VDARE, a website frequented by the alt-right, Cathy alleges that she must therefore endorse the worst of its authors’ opinions. A tired line of reasoning, one used by those who prefer to debate with shame and taboos instead of arguments.</p><p>I’m less interested in a lengthy rebuttal of Cathy’s allegations — so silly and overwrought that I won’t even say what they are! — as I am in understanding why she, and so many others in conservative and libertarian circles, have adopted the language and tactics of the left during this campaign season.</p><p>First, there are the obvious points. They’re in a panic because of the unstoppable rise of Donald Trump, who represents a serious risk to the influence of the DC think-tank set.</p><p>Then there’s the alternative right, who many mistakenly believe are as bad, if not worse, than the identitarians of the left.</p><p>Cathy Young probably shares both of these inclinations — she wrote a lengthy rebuttal last month after my colleague I decided to co-author an explainer on the alt-right that didn’t descend into meaningless virtue signalling.</p><p>But I think the problem runs deeper with Young. She’s often very sensible. But, ironically, that moderate impulse makes her susceptible to fallacies — in particular, her implicit assumption that the “extreme” of the regressive left’s opponents must be as bad as the extreme of the regressive left itself.</p><p>Coulter isn’t the first of Cathy’s targets, you see. There’s also Mike Cernovich, excommunicated in her Real Clear Politics column for “vile tweets,” and later blocked for using the word “cuck.” Then there’s Vox Day, an icon of the anti-SJW resistance, lambasted by Young as a racist and misogynist — a charge his wife no doubt stridently objects to.</p><p>None of these people is remotely so dreadful as the worst actors in the third-wave feminist movement or Black Lives Matter.</p><p>Anyone who has met Day or Cernovich in person — I have met both — knows that they harbour no animosity toward other races or genders. The same is true of almost everyone I’ve met in the much-lambasted alternative right.</p><p>Sure, they may be merrily outrageous in their blogs and on social media, but a few hours of conversation with them reveals none of the wild zealotry you see in the eyes of campus feminist or black activists. Yet, because Day and Cernovich also dabble in identity politics, Cathy treats them the same — if not worse.<br> The truth is, Cathy has never bothered to really get to know her targets, instead preferring to shame them with regressive-left buzzwords. I’m afraid that she isn’t really opposed to the left’s social ostracization machine: she just wants to choose where it’s aimed.</br></p><p>It’s a shame, because Cathy has frequently been a target of that machine herself. In the early 2010s, she was one of the few writers who dared to question the “rape culture” panic that was underway on American campuses.</p><p>Despite being vindicated in the wake of the UVA rape hoax and the collapse of the Columbia “mattress girl” case, she was repeatedly branded a “rape apologist” by her detractors on the left.</p><p>At the height of the new wave of sexual assault panic, the Federalist Society even dropped Cathy from their list of campus speakers, with a former president of the society citing pressure from feminist activists as the likely reason.</p><p>So it’s disappointing to see someone who has so often been a target of the irrational taboos that govern modern debate be so quick to use the same weapons in a vain attempt to appear balanced.</p><p>Because that, I suspect, is Cathy’s real motive — to be seen to be taking a stance that’s equidistant between the identitarians of the regressive left and the identitarians of the alternative right.</p><p>It’s a worthy goal, and Cathy is far from malicious. But there’s a problem. For her stance to be valid, you must first accept that both sides are equally powerful, equally dangerous and equally zealous. They’re simply not.</p><p>The rise of cultural libertarianism, the alt-right and Generation Trump is turning conservatives on each other like perhaps no other time in recent memory. At least there’s one glimmer of hope: history suggests that after their initial squabbles, American conservatives and libertarians tend to get over themselves and come together eventually.</p><p>It’s a uniquely American phenomenon, that, and one that terrifies the progressive left, which is more prone to permanent rifts. Let’s just hope the #NeverTrump types come to their senses soon…</p></blockquote><p>I’m not friends with Cathy Young, nor do I admire her, nor do I find her to be even remotely honest. So, it would be very easy for me to side with Ann Coulter, the most courageous female commentator on the Right, even if I did not agree with her with regards to Trump and the dire danger posed to America by immigration.</p><p>People sometimes ask me why I stand by Roosh, or why I stand by Milo. If you read that column, it should be easy enough to understand. We’re standing in this cultural war together, and we know better than to fall for the inevitable divide-and-conquer tactics that are thrown at us by moderates of the Right and extremists of the Left alike.</p><p>And as for being “an icon of the anti-SJW resistance”, that’s certainly something I am proud to be. Of course, I’m even more proud of the Evil Legion of Evil, the Ilk, the Dread Ilk, and, of course, the VFM.</p><p> UPDATE: Fascinating. Breitbart appears to have <a href=\"http://www.breitbart.com/milo/2016/05/13/cathy-young-ann-coulter-kiss-make-up/\">deleted the piece</a>. So, I’ve linked to the archive and reproduce the entire piece here.</p><p>UPDATE 2: Comments on the article are still up <a href=\"https://disqus.com/home/discussion/breitbartproduction/trump_is_turning_my_friends_into_social_justice_warriors_sad/#comment-2673539888\">at Disqus</a>.</p><p>UPDATE 3: It’s <a href=\"http://www.breitbart.com/milo/2016/05/13/cathy-young-turning-into-social-justice-warrior/\">back up again</a>.</p></div>",
  "content_text": "That’s the nasty thing about cultural war. As with a civil war, sooner or later, whether one will or no, one is eventually\nforced to choose sides\n.\nIt’s dreadful when two people you admire start beating each other up. Sort of like childhood all over again!\nBut that’s primary season for you. Particularly this year, it has former allies at each others’ throats. It almost makes you miss the days when SJWs weren’t irrelevant! Almost.\nThe latest salvo in these internecine conflicts comes from Cathy Young, one of a growing number of libertarians and conservatives who are turning their guns on their own side. She’s gone after none other than Ann Coulter, my only rival for the throne as sassy blonde queen of conservative media.\nThis is a difficult column to write, as I know both women and enjoy them both in different ways. Both have grappled fearlessly with the worst elements of the left over the years. And now I have to take sides!\nStill, it’s Cathy who was the aggressor in this instance, attacking Coulter with the disturbingly leftist tactic of guilt-by-association and unsubstantiated name-calling.\nBecause Coulter has written for VDARE, a website frequented by the alt-right, Cathy alleges that she must therefore endorse the worst of its authors’ opinions. A tired line of reasoning, one used by those who prefer to debate with shame and taboos instead of arguments.\nI’m less interested in a lengthy rebuttal of Cathy’s allegations — so silly and overwrought that I won’t even say what they are! — as I am in understanding why she, and so many others in conservative and libertarian circles, have adopted the language and tactics of the left during this campaign season.\nFirst, there are the obvious points. They’re in a panic because of the unstoppable rise of Donald Trump, who represents a serious risk to the influence of the DC think-tank set.\nThen there’s the alternative right, who many mistakenly believe are as bad, if not worse, than the identitarians of the left.\nCathy Young probably shares both of these inclinations — she wrote a lengthy rebuttal last month after my colleague I decided to co-author an explainer on the alt-right that didn’t descend into meaningless virtue signalling.\nBut I think the problem runs deeper with Young. She’s often very sensible. But, ironically, that moderate impulse makes her susceptible to fallacies — in particular, her implicit assumption that the “extreme” of the regressive left’s opponents must be as bad as the extreme of the regressive left itself.\nCoulter isn’t the first of Cathy’s targets, you see. There’s also Mike Cernovich, excommunicated in her Real Clear Politics column for “vile tweets,” and later blocked for using the word “cuck.” Then there’s Vox Day, an icon of the anti-SJW resistance, lambasted by Young as a racist and misogynist — a charge his wife no doubt stridently objects to.\nNone of these people is remotely so dreadful as the worst actors in the third-wave feminist movement or Black Lives Matter.\nAnyone who has met Day or Cernovich in person — I have met both — knows that they harbour no animosity toward other races or genders. The same is true of almost everyone I’ve met in the much-lambasted alternative right.\nSure, they may be merrily outrageous in their blogs and on social media, but a few hours of conversation with them reveals none of the wild zealotry you see in the eyes of campus feminist or black activists. Yet, because Day and Cernovich also dabble in identity politics, Cathy treats them the same — if not worse.\nThe truth is, Cathy has never bothered to really get to know her targets, instead preferring to shame them with regressive-left buzzwords. I’m afraid that she isn’t really opposed to the left’s social ostracization machine: she just wants to choose where it’s aimed.\nIt’s a shame, because Cathy has frequently been a target of that machine herself. In the early 2010s, she was one of the few writers who dared to question the “rape culture” panic that was underway on American campuses.\nDespite being vindicated in the wake of the UVA rape hoax and the collapse of the Columbia “mattress girl” case, she was repeatedly branded a “rape apologist” by her detractors on the left.\nAt the height of the new wave of sexual assault panic, the Federalist Society even dropped Cathy from their list of campus speakers, with a former president of the society citing pressure from feminist activists as the likely reason.\nSo it’s disappointing to see someone who has so often been a target of the irrational taboos that govern modern debate be so quick to use the same weapons in a vain attempt to appear balanced.\nBecause that, I suspect, is Cathy’s real motive — to be seen to be taking a stance that’s equidistant between the identitarians of the regressive left and the identitarians of the alternative right.\nIt’s a worthy goal, and Cathy is far from malicious. But there’s a problem. For her stance to be valid, you must first accept that both sides are equally powerful, equally dangerous and equally zealous. They’re simply not.\nThe rise of cultural libertarianism, the alt-right and Generation Trump is turning conservatives on each other like perhaps no other time in recent memory. At least there’s one glimmer of hope: history suggests that after their initial squabbles, American conservatives and libertarians tend to get over themselves and come together eventually.\nIt’s a uniquely American phenomenon, that, and one that terrifies the progressive left, which is more prone to permanent rifts. Let’s just hope the #NeverTrump types come to their senses soon…\nI’m not friends with Cathy Young, nor do I admire her, nor do I find her to be even remotely honest. So, it would be very easy for me to side with Ann Coulter, the most courageous female commentator on the Right, even if I did not agree with her with regards to Trump and the dire danger posed to America by immigration.\nPeople sometimes ask me why I stand by Roosh, or why I stand by Milo. If you read that column, it should be easy enough to understand. We’re standing in this cultural war together, and we know better than to fall for the inevitable divide-and-conquer tactics that are thrown at us by moderates of the Right and extremists of the Left alike.\nAnd as for being “an icon of the anti-SJW resistance”, that’s certainly something I am proud to be. Of course, I’m even more proud of the Evil Legion of Evil, the Ilk, the Dread Ilk, and, of course, the VFM.\nUPDATE: Fascinating. Breitbart appears to have\ndeleted the piece\n. So, I’ve linked to the archive and reproduce the entire piece here.\nUPDATE 2: Comments on the article are still up\nat Disqus\n.\nUPDATE 3: It’s\nback up again\n.",
  "tags": [
    "politics",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-13T11:00:00+00:00"
}