{
  "url": "https://voxday.net/2016/05/15/nobody-cares-anymore/",
  "scraped_at": "2025-12-17T17:57:49.644573",
  "title": "Nobody cares anymore",
  "date_display": "May 15, 2016",
  "date_iso": "2016-05-15T23:31:00+00:00",
  "date_from_url": "2016-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Much to its horror, the GOP establishment has realized that the American people <a href=\"http://www.zerohedge.com/news/2016-05-15/gop-finally-gets-it-people-just-dont-care-trump-rewrote-playbook\">no longer give a quantum of a damn</a> about the conventional political narratives:</p><blockquote class=\"tr_bq\"><p> In a shocking moment of clarity, that should also send shivers up the spine of the Democratic party, Republican chairman (and implicity voice of ‘the establishment’) Reince Priebus admitted on various Sunday talk-shows that campaign traditions don’t apply to the so-called Teflon Don noting that “the public just wasn’t interested” in his taxes or the various ‘stories’ that the Deep State is throwing at him. “I don’t think the traditional playbook applies.. We’ve been down this road for a year. And it doesn’t apply,” Priebus exclaimed, and why the Clinton campaign is likely scrambling, “He’s rewritten the playbook.”</p><p>Summing up the reality of the current situation – with attacks coming at presumotive GOP nominee Trump from all sides – NBC News reports that Priebus said…</p><p><i>“I’ve got to tell you, I think that all these stories that come out – and they come out every couple weeks – people just don’t care.”</i></p></blockquote><p>TL;DR: Trump, because fuck you!</p><p>We <i>really</i> don’t care about his myriad flaws. If Trump stripped naked in front of television cameras at the Washington monument, did a little pole dance, confessed to a daily cocaine-and-call-girl habit, then promised to put every Congressman and Senator on trial, he’d gain five points in the polls. Maybe ten.</p><p>We have watched the twin establishments of the bifactional ruling party methodically dismantle everything that the United States of America used to be for the last 24 years or more. They gave us Clinton, then Bush the Younger, and then the parody that is Soetoro/Obama. They could be selling the cure for cancer with one free Victoria’s Secret model in every box and the American public still wouldn’t buy it.</p><p>If all Donald Trump does is build a big beautiful wall and start sending Mexicans and Muslims back home, we don’t care if he gilds the White House, puts his logo on it, and turns it into a combination strip joint and head shop.</p></div>",
  "content_text": "Much to its horror, the GOP establishment has realized that the American people\nno longer give a quantum of a damn\nabout the conventional political narratives:\nIn a shocking moment of clarity, that should also send shivers up the spine of the Democratic party, Republican chairman (and implicity voice of ‘the establishment’) Reince Priebus admitted on various Sunday talk-shows that campaign traditions don’t apply to the so-called Teflon Don noting that “the public just wasn’t interested” in his taxes or the various ‘stories’ that the Deep State is throwing at him. “I don’t think the traditional playbook applies.. We’ve been down this road for a year. And it doesn’t apply,” Priebus exclaimed, and why the Clinton campaign is likely scrambling, “He’s rewritten the playbook.”\nSumming up the reality of the current situation – with attacks coming at presumotive GOP nominee Trump from all sides – NBC News reports that Priebus said…\n“I’ve got to tell you, I think that all these stories that come out – and they come out every couple weeks – people just don’t care.”\nTL;DR: Trump, because fuck you!\nWe\nreally\ndon’t care about his myriad flaws. If Trump stripped naked in front of television cameras at the Washington monument, did a little pole dance, confessed to a daily cocaine-and-call-girl habit, then promised to put every Congressman and Senator on trial, he’d gain five points in the polls. Maybe ten.\nWe have watched the twin establishments of the bifactional ruling party methodically dismantle everything that the United States of America used to be for the last 24 years or more. They gave us Clinton, then Bush the Younger, and then the parody that is Soetoro/Obama. They could be selling the cure for cancer with one free Victoria’s Secret model in every box and the American public still wouldn’t buy it.\nIf all Donald Trump does is build a big beautiful wall and start sending Mexicans and Muslims back home, we don’t care if he gilds the White House, puts his logo on it, and turns it into a combination strip joint and head shop.",
  "tags": [
    "decline and fall",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-15T22:31:00+00:00"
}