{
  "url": "https://voxday.net/2016/05/01/of-enthymemes-and-false-erudition/",
  "scraped_at": "2025-12-17T17:56:05.368627",
  "title": "Of enthymemes and false erudition",
  "date_display": "May 1, 2016",
  "date_iso": "2016-05-01T12:37:00+00:00",
  "date_from_url": "2016-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, Philalethes observes that my use of rhetoric was, indeed, effective:</p><blockquote class=\"tr_bq\"><p> VD’s original use of “Aztec” in the WND article was effective rhetoric, the Slate author’s snarky reference to it was at least attempted rhetoric, and then VD’s present response was also rhetoric, by the clever tactic of twisting the poignard out of her hand and stabbing her back with it. For me, it worked quite well, whether or not it was based on an enthymeme (about which I knew nothing until tonight).</p><p>Which is the point: either rhetoric draws blood, or it does not. Maybe for Mr. Camestros it did not, but that’s all he can legitimately say about it – though his effort to destroy the rhetoric by dialectic would appear to show that he is at least aware that this device did and would draw blood in the minds of most readers. So in sum I must agree that all Mr. Camestros has accomplished here is to make a fool of himself with his attempt to speak magisterially from the high seat on a subject about which he obviously knows less than does the person at whom he is aiming his barb.</p></blockquote><p>Second, I will explain how the now-banned Camestros Felapton either badly misrepresented, or simply failed to understand, Aristotle’s fundamental distinction between dialectic and rhetoric, as well as the purpose of the latter. He’s rather like a tactician who doesn’t grasp strategy, as he seems to have a basic knowledge of the technical aspects without understanding their basic purpose or how they can be utilized:</p><blockquote class=\"tr_bq\"><p> I know what an enthymeme is, thank you, which is why I re-expressed your enthymeme as a formal syllogism with premises. I do so to highlight what your un-expressed major premise was. Put another way, what was the underlying assumption that you were appealing to in your rhetorical device.</p><p>That assumption appears to be this:<br> “People who are part-X are not people who are paranoid about X” Which is best described using the technical term ‘bollocks’.</br></p><p>If your response is an ‘effective’ one then it is because your audience is accepting that assumption as being correct.</p><p>An enthymeme has UNSTATED premises (or conclusion). The premises and/or<br> conclusion are suggested or implied (in the non-logical sense of<br> ‘implied’). You seem to be thinking that ‘unstated’ means ‘logically do<br> not exist’. That is incorrect. With an enthymeme the reader is expected<br> to ‘fill in the gaps’. This is why I asked you what your premises were<br> so as to re-express your enthymeme as a formal syllogism.</br></br></br></br></br></p></blockquote><p>This initially made me suspect that Felapton was simply being dishonest. The reason he wanted me to translate the rhetoric into dialectic, and complete the formal syllogism, was so he could criticize it from a logical perspective and thereby discredit it in an attempt to persuade others to believe Slate’s claim that I am paranoid about Aztecs. (Which was, in itself, merely another step towards his real purpose.) He was pushing me to state the unstated because an enthymeme does not only contain unstated premises, but those premises are often incorrect from the purely logical perspective. This is why Aristotle gave this type of syllogism a different name and devoted considerable effort to defining and explaining how it worked, because otherwise it would be nothing more than an incomplete syllogism.</p><p>Consider one example provided by Wikipedia:</p><p><i>“Candide is a typical French novel, therefore it is vulgar.”</i></p><p>In this case, the missing term of the syllogism is “French novels are vulgar” and might be an assumption held by an audience that would make sense of the enthymematic argument.</p><p>Now, obviously not all French novels are vulgar, so therefore, Felapton would argue that the syllogism fails logically and is incorrect. That is why he was trying to get me to state the unstated premise of my Aztec enthymeme, so that he could attack it dialectically. But as I pointed out, the syllogism was an enthymematic argument, not a logical argument, and therefore his attempt to logically disqualify it was totally irrelevant. As I have repeatedly pointed out in the book he has not read, there is zero information content in rhetoric; it is not designed to inform and persuade, but emotionally convict and persuade, because, as Aristotle correctly informs us, many people cannot be persuaded by information.</p><p>This is the point that Felapton fails to grasp, and his subsequent comment tends to indicate that it is not merely dishonesty on his part, but also a genuine failure to understand the distinction between rhetoric and dialectic that underlies his incorrect statements on the subject.</p><blockquote class=\"tr_bq\"><p> A great place for you to start to get a better understanding of the role of enthymeme in general and its relationship with logic would be Aristotle’s rhetoric itself. I think you perhaps have misunderstood the distinction as somehow rhetoric (in Aristotle’s sense) as being utterly divorced from logic. If so then the word you are looking for is not ‘rhetoric’ but ‘bullshit’. Substituting the word ‘bullshit’ for ‘rhetoric’ in your response, renders it a better description for what you seem to be trying to say.</p><p>However, Aristotle did not advance the notion of rhetoric as BS or sophistry but as an art of persuasion but persuasion towards TRUTH by rational means.</p><p><i>“It is clear, then, that rhetorical study, in its strict sense, is concerned with the modes of persuasion. Persuasion is clearly a sort of demonstration, since we are most fully persuaded when we consider a thing to have been demonstrated.</i><br> <i><br>The orator’s demonstration is an enthymeme, and this is, in general, the most effective of the modes of persuasion. The enthymeme is a sort of syllogism, and the consideration of syllogisms of all kinds, without distinction, is the business of dialectic, either of dialectic as a whole or of one of its branches. It follows plainly, therefore, that he who is best able to see how and from what elements a syllogism is produced will also be best skilled in the enthymeme, when he has further learnt what its subject-matter is and in what respects it differs from the syllogism of strict logic.”</br></i></br></p></blockquote><p>What Felapton clearly fails to understand here is that the fact a highly skilled dialectician will also be skilled in the use of rhetoric only means that the best and most effective rhetoric is constructed in a similar manner and is in line with the truth. It absolutely does <i>not</i> mean that the use of enthymematic arguments that are not in line with the truth are not rhetoric, for the obvious reason that there would be no difference between a syllogism presented for dialectical purposes and an enthymeme presented for rhetorical purposes. But the two related concepts are intrinsically different and we know why. Consider Aristotle’s additional observations:</p><ul><li><i>Persuasion is effected through the speech itself when we have<br> proved a truth or an apparent truth by means of the persuasive<br> arguments suitable to the case in question. </br></br></i></li><li><i>The duty of rhetoric is to deal with such<br> matters as we deliberate upon without arts or systems to guide us, in<br> the hearing of persons who cannot take in at a glance a complicated<br> argument, or follow a long chain of reasoning. </br></br></br></i></li><li><i>It is evident, therefore, that the propositions<br> forming the basis of enthymemes, though some of them may be “necessary,” will<br> most of them be only usually true.</br></br></i></li><li><i>We must be able to employ persuasion, just as strict reasoning can be employed, on opposite sides<br> of a question, not in order that we may in practice employ it in both<br> ways (for we must not make people believe what is wrong), but in order<br> that we may see clearly what the facts are, and that, if another man<br> argues unfairly, we on our part may be able to confute him. No other of<br> the arts draws opposite conclusions:  dialectic and rhetoric alone do<br> this. Both these arts draw opposite conclusions impartially.<br> Nevertheless, the underlying facts do not lend themselves equally well<br> to the contrary views. No; things that are true and things that are<br> better are, by their nature, practically always easier to prove and<br> easier to believe in. </br></br></br></br></br></br></br></br></br></br></i></li></ul><p>In other words, Felapton has confused Aristotle’s admonition to use rhetoric in the service of the truth with Aristotle’s definitions of what rhetoric is as well as with his instructions on how to use rhetoric effectively. In fact, Aristotle makes it clear that <i>both</i> dialectic and rhetoric can be used impartially on either side of an argument, although it is much easier to identify the deceptive use of dialectic due to its reliance on complete syllogisms and strict logic than it is the deceptive use of rhetoric due to its incomplete structure and its reliance on apparent truths that are accepted by the audience.</p><p>What Felapton calls “bollocks” and “bullshit” is nothing more than what Aristotle calls “apparent truth”. But, as we have seen, rhetoric can rely upon these apparent truths just as readily as upon actual truths. And in this particular application, my rhetoric, even structurally reliant as it is upon apparent truth rather than actual truth, is more persuasive, and therefore more effective, than Slate’s rhetoric, in part for the obvious reason that it is absolutely true.</p></div>",
  "content_text": "First, Philalethes observes that my use of rhetoric was, indeed, effective:\nVD’s original use of “Aztec” in the WND article was effective rhetoric, the Slate author’s snarky reference to it was at least attempted rhetoric, and then VD’s present response was also rhetoric, by the clever tactic of twisting the poignard out of her hand and stabbing her back with it. For me, it worked quite well, whether or not it was based on an enthymeme (about which I knew nothing until tonight).\nWhich is the point: either rhetoric draws blood, or it does not. Maybe for Mr. Camestros it did not, but that’s all he can legitimately say about it – though his effort to destroy the rhetoric by dialectic would appear to show that he is at least aware that this device did and would draw blood in the minds of most readers. So in sum I must agree that all Mr. Camestros has accomplished here is to make a fool of himself with his attempt to speak magisterially from the high seat on a subject about which he obviously knows less than does the person at whom he is aiming his barb.\nSecond, I will explain how the now-banned Camestros Felapton either badly misrepresented, or simply failed to understand, Aristotle’s fundamental distinction between dialectic and rhetoric, as well as the purpose of the latter. He’s rather like a tactician who doesn’t grasp strategy, as he seems to have a basic knowledge of the technical aspects without understanding their basic purpose or how they can be utilized:\nI know what an enthymeme is, thank you, which is why I re-expressed your enthymeme as a formal syllogism with premises. I do so to highlight what your un-expressed major premise was. Put another way, what was the underlying assumption that you were appealing to in your rhetorical device.\nThat assumption appears to be this:\n“People who are part-X are not people who are paranoid about X” Which is best described using the technical term ‘bollocks’.\nIf your response is an ‘effective’ one then it is because your audience is accepting that assumption as being correct.\nAn enthymeme has UNSTATED premises (or conclusion). The premises and/or\nconclusion are suggested or implied (in the non-logical sense of\n‘implied’). You seem to be thinking that ‘unstated’ means ‘logically do\nnot exist’. That is incorrect. With an enthymeme the reader is expected\nto ‘fill in the gaps’. This is why I asked you what your premises were\nso as to re-express your enthymeme as a formal syllogism.\nThis initially made me suspect that Felapton was simply being dishonest. The reason he wanted me to translate the rhetoric into dialectic, and complete the formal syllogism, was so he could criticize it from a logical perspective and thereby discredit it in an attempt to persuade others to believe Slate’s claim that I am paranoid about Aztecs. (Which was, in itself, merely another step towards his real purpose.) He was pushing me to state the unstated because an enthymeme does not only contain unstated premises, but those premises are often incorrect from the purely logical perspective. This is why Aristotle gave this type of syllogism a different name and devoted considerable effort to defining and explaining how it worked, because otherwise it would be nothing more than an incomplete syllogism.\nConsider one example provided by Wikipedia:\n“Candide is a typical French novel, therefore it is vulgar.”\nIn this case, the missing term of the syllogism is “French novels are vulgar” and might be an assumption held by an audience that would make sense of the enthymematic argument.\nNow, obviously not all French novels are vulgar, so therefore, Felapton would argue that the syllogism fails logically and is incorrect. That is why he was trying to get me to state the unstated premise of my Aztec enthymeme, so that he could attack it dialectically. But as I pointed out, the syllogism was an enthymematic argument, not a logical argument, and therefore his attempt to logically disqualify it was totally irrelevant. As I have repeatedly pointed out in the book he has not read, there is zero information content in rhetoric; it is not designed to inform and persuade, but emotionally convict and persuade, because, as Aristotle correctly informs us, many people cannot be persuaded by information.\nThis is the point that Felapton fails to grasp, and his subsequent comment tends to indicate that it is not merely dishonesty on his part, but also a genuine failure to understand the distinction between rhetoric and dialectic that underlies his incorrect statements on the subject.\nA great place for you to start to get a better understanding of the role of enthymeme in general and its relationship with logic would be Aristotle’s rhetoric itself. I think you perhaps have misunderstood the distinction as somehow rhetoric (in Aristotle’s sense) as being utterly divorced from logic. If so then the word you are looking for is not ‘rhetoric’ but ‘bullshit’. Substituting the word ‘bullshit’ for ‘rhetoric’ in your response, renders it a better description for what you seem to be trying to say.\nHowever, Aristotle did not advance the notion of rhetoric as BS or sophistry but as an art of persuasion but persuasion towards TRUTH by rational means.\n“It is clear, then, that rhetorical study, in its strict sense, is concerned with the modes of persuasion. Persuasion is clearly a sort of demonstration, since we are most fully persuaded when we consider a thing to have been demonstrated.\nThe orator’s demonstration is an enthymeme, and this is, in general, the most effective of the modes of persuasion. The enthymeme is a sort of syllogism, and the consideration of syllogisms of all kinds, without distinction, is the business of dialectic, either of dialectic as a whole or of one of its branches. It follows plainly, therefore, that he who is best able to see how and from what elements a syllogism is produced will also be best skilled in the enthymeme, when he has further learnt what its subject-matter is and in what respects it differs from the syllogism of strict logic.”\nWhat Felapton clearly fails to understand here is that the fact a highly skilled dialectician will also be skilled in the use of rhetoric only means that the best and most effective rhetoric is constructed in a similar manner and is in line with the truth. It absolutely does\nnot\nmean that the use of enthymematic arguments that are not in line with the truth are not rhetoric, for the obvious reason that there would be no difference between a syllogism presented for dialectical purposes and an enthymeme presented for rhetorical purposes. But the two related concepts are intrinsically different and we know why. Consider Aristotle’s additional observations:\nPersuasion is effected through the speech itself when we have\nproved a truth or an apparent truth by means of the persuasive\narguments suitable to the case in question.\nThe duty of rhetoric is to deal with such\nmatters as we deliberate upon without arts or systems to guide us, in\nthe hearing of persons who cannot take in at a glance a complicated\nargument, or follow a long chain of reasoning.\nIt is evident, therefore, that the propositions\nforming the basis of enthymemes, though some of them may be “necessary,” will\nmost of them be only usually true.\nWe must be able to employ persuasion, just as strict reasoning can be employed, on opposite sides\nof a question, not in order that we may in practice employ it in both\nways (for we must not make people believe what is wrong), but in order\nthat we may see clearly what the facts are, and that, if another man\nargues unfairly, we on our part may be able to confute him. No other of\nthe arts draws opposite conclusions:  dialectic and rhetoric alone do\nthis. Both these arts draw opposite conclusions impartially.\nNevertheless, the underlying facts do not lend themselves equally well\nto the contrary views. No; things that are true and things that are\nbetter are, by their nature, practically always easier to prove and\neasier to believe in.\nIn other words, Felapton has confused Aristotle’s admonition to use rhetoric in the service of the truth with Aristotle’s definitions of what rhetoric is as well as with his instructions on how to use rhetoric effectively. In fact, Aristotle makes it clear that\nboth\ndialectic and rhetoric can be used impartially on either side of an argument, although it is much easier to identify the deceptive use of dialectic due to its reliance on complete syllogisms and strict logic than it is the deceptive use of rhetoric due to its incomplete structure and its reliance on apparent truths that are accepted by the audience.\nWhat Felapton calls “bollocks” and “bullshit” is nothing more than what Aristotle calls “apparent truth”. But, as we have seen, rhetoric can rely upon these apparent truths just as readily as upon actual truths. And in this particular application, my rhetoric, even structurally reliant as it is upon apparent truth rather than actual truth, is more persuasive, and therefore more effective, than Slate’s rhetoric, in part for the obvious reason that it is absolutely true.",
  "tags": [
    "philosophy",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-01T11:37:00+00:00"
}