{
  "url": "https://voxday.net/2016/05/26/of-sjws-and-saruman/",
  "scraped_at": "2025-12-17T17:59:05.862379",
  "title": "Of SJWs and Saruman",
  "date_display": "May 26, 2016",
  "date_iso": "2016-05-26T15:30:00+00:00",
  "date_from_url": "2016-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This tweet illustrates SJW posturing, incivility, and ignorance in a nutshell:</p><blockquote class=\"tr_bq\"><p> Supreme Dark Lord @voxday<br> The #cuckservative is Saruman. He counsels surrender and submission to Mordor because he despairs. The #AltRight are the Men of the West.</br></p><p>Richard GadsdIN R@po8c<br> *headdesk* Even granting the racist his premise, that’s Denethor, not Saruman.</br></p></blockquote><p>He’s completely wrong. Denethor despairs, to be sure, but even in his despair he neither surrenders nor submits to Mordor. You do recall the grand scene when Denethor ends the siege of Gondor by opening the gates to the army of the Witch King, right? Of course you don’t, because it never happened.</p><p>Denethor despairs and commits suicide. Saruman, on the other hand, despairs, submits, and surrenders to Sauron, with the idea that by doing so, he can eventually achieve some level of influence over Sauron. Consider his address to Gandalf, after revealing himself to be Saruman of Many Colors:</p><p><i>“A new Power is rising. Against it the old allies and policies will not avail us at all. There is no hope left in Elves or dying Numenor. This then is one choice before you, before us. We may join with that Power. It would be wise, Gandalf. There is hope that way. Its victory is at hand and there will be rich reward for those that aided it. As the Power grows, its proved friends will also grow; and the Wise, such as you and I, may with patience come at last to direct its courses, to control it. We can bide our time, we can keep our thoughts in our hearts, deploring maybe evils done by the way, but approving the high and ultimate purpose: Knowledge, Rule, Order; all the things that we have so far striven in vain to accomplish, hindered rather than helped by our weak or idle friends.” </i></p><blockquote class=\"tr_bq\"><p> Kunae ‏@Kinslaughterer<br> It’s worse: Saurman, after preaching moderation, turns on his erstwhile allies and attacks them with words, then armies.</br></p></blockquote><p> In other words, I was correct. Saruman is a true cuckservative.<br> <i><br/></i><br> The #AltRight will never join with that Power. We are the Men of the West and we will neither bow to Mordor nor listen to the mouths of its emissaries sent out to deceive the ignorant.</br></br></p><p>UPDATE: Give Richard some credit. Unlike many, he can admit when he is wrong.</p><blockquote class=\"tr_bq\"><p> Richard GadsdIN ‏@po8crg<br>I’ve read your blogpost and I owe you an apology. I’d forgotten the post-Helm’s Deep stuff and you were right.</br></p></blockquote><p>I’m not going to say there is absolutely no chance I will get something wrong about <i>The Lord of the Rings</i>, but let’s just say the odds are very, very, very low considering how many times I have read the books over the years. As a general rule, if it is a) Tolkien, b) economic theory, or c) computer games from 1980 to 2000, think twice, then think again before you call me out on what you think is an error.</p></div>",
  "content_text": "This tweet illustrates SJW posturing, incivility, and ignorance in a nutshell:\nSupreme Dark Lord @voxday\nThe #cuckservative is Saruman. He counsels surrender and submission to Mordor because he despairs. The #AltRight are the Men of the West.\nRichard GadsdIN R@po8c\n*headdesk* Even granting the racist his premise, that’s Denethor, not Saruman.\nHe’s completely wrong. Denethor despairs, to be sure, but even in his despair he neither surrenders nor submits to Mordor. You do recall the grand scene when Denethor ends the siege of Gondor by opening the gates to the army of the Witch King, right? Of course you don’t, because it never happened.\nDenethor despairs and commits suicide. Saruman, on the other hand, despairs, submits, and surrenders to Sauron, with the idea that by doing so, he can eventually achieve some level of influence over Sauron. Consider his address to Gandalf, after revealing himself to be Saruman of Many Colors:\n“A new Power is rising. Against it the old allies and policies will not avail us at all. There is no hope left in Elves or dying Numenor. This then is one choice before you, before us. We may join with that Power. It would be wise, Gandalf. There is hope that way. Its victory is at hand and there will be rich reward for those that aided it. As the Power grows, its proved friends will also grow; and the Wise, such as you and I, may with patience come at last to direct its courses, to control it. We can bide our time, we can keep our thoughts in our hearts, deploring maybe evils done by the way, but approving the high and ultimate purpose: Knowledge, Rule, Order; all the things that we have so far striven in vain to accomplish, hindered rather than helped by our weak or idle friends.”\nKunae ‏@Kinslaughterer\nIt’s worse: Saurman, after preaching moderation, turns on his erstwhile allies and attacks them with words, then armies.\nIn other words, I was correct. Saruman is a true cuckservative.\nThe #AltRight will never join with that Power. We are the Men of the West and we will neither bow to Mordor nor listen to the mouths of its emissaries sent out to deceive the ignorant.\nUPDATE: Give Richard some credit. Unlike many, he can admit when he is wrong.\nRichard GadsdIN ‏@po8crg\nI’ve read your blogpost and I owe you an apology. I’d forgotten the post-Helm’s Deep stuff and you were right.\nI’m not going to say there is absolutely no chance I will get something wrong about\nThe Lord of the Rings\n, but let’s just say the odds are very, very, very low considering how many times I have read the books over the years. As a general rule, if it is a) Tolkien, b) economic theory, or c) computer games from 1980 to 2000, think twice, then think again before you call me out on what you think is an error.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-26T14:30:00+00:00"
}