{
  "url": "https://voxday.net/2016/05/16/real-vs-imaginary-democracy/",
  "scraped_at": "2025-12-17T17:57:54.868751",
  "title": "Real vs imaginary democracy",
  "date_display": "May 16, 2016",
  "date_iso": "2016-05-16T13:30:00+00:00",
  "date_from_url": "2016-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another selection from my suffrage debate with Louise Mensch at Heat Street that <a href=\"http://heatst.com/culture-wars/should-women-vote-vox-day-vs-louise-mensch-conservative-feminism/\">I think is worth discussing</a>:</p><blockquote class=\"tr_bq\"><p> Louise: <i>Let’s start with the fact your argument is,  if women vote, it will have a given outcome that will move society to the left. On those grounds, you should surely object to voting of any description, including by men, because your argument appears to be that if the people vote a way that you don’t think that they should vote, this shouldn’t be allowed.</i></p><p><i>Your argument in fact, as logically stated just then, is not against women voting. It’s against democracy itself. You think that if people vote, in this case you think women should be banned because they’re more likely to vote left-wing. That is an argument saying that if somebody votes the wrong way, they should be banned from voting, which is of course itself an argument against democracy at all. What do you say to that?</i></p><p>Vox: I say that you are mis-applying it, because as I said, I support everyone voting in a direct democracy, because there everyone is directly expressing their own will, and whatever they get, they deserve. If we all vote to burn down our houses, and then we burn down our houses, yeah, there was no deception there. We all knew what we were getting in for, and we got it. What we’re talking about is representative democracy, which is by definition not democracy. We’ve already decided that we’re going to limit the will of the people.</p><p>Louise: <i>No, we haven’t. The will of the people in a representative democracy, for example the United States, is that they choose, they have realized en bloc that it is too much to vote on every single decision directly. You’d have a referendum for everything from your local dog catcher to gun control, abortion, et cetera, and you’d presumably have as many referenda as people wanted to make motions. It doesn’t work.</i></p><p><i>In a representative democracy, the decision that the people are taking is we are going to elect you to exercise judgment for us in this way, right?</i></p><p> Vox: No, but that was never made. This structure was imposed on us, and so no one has ever, there’s never been a referendum supporting this. There’s never been any votes for that, but the rules of the representative democracy are such that they are intentionally designed to limit and even eliminate democracy. For example, in California, when you saw Section 8 pass, and then it was overturned by the will of a single judge.</p><p>The whole system of representative democracy is to a certain extent a misnomer because it is actually entirely anti-democratic. The whole reason these structures, both on the parliamentary side and on the judicial side, is specifically designed to prevent democracy. Once you’ve accepted that principle of, “Okay, we’re going to limit democracy,” then it’s really a question of where you’re drawing the line. I’m just suggesting that a line should be drawn in a different place than it happens to be drawn today.</p><p> Louise: <i>But you are suggesting, you just said, which I don’t agree with, but you just said that representative democracy doesn’t equal to the will of the people, period, so you’re not really arguing against women having the vote. You’re arguing against anybody having the vote in representative democracy. You’re arguing for an anarchic … On the one hand you say you’d like to conserve things. On the other, you wish to tear down representative democracy, which would mean dismantling the entire United States’ constitution and system of government, because what you have just to women applies to everybody and everything.</i></p><p><i>If representative democracy is so bad, it can’t be okay, even if only men have the franchise.</i></p><p>Vox: But we’re talking about two different issues here. We’re talking about on the one hand a discussion within the context of representative democracy, and obviously it’s much more conceivable at this point in time to modify the rules of the existing system, and then we’re talking about completely trashing the system in favor of something else….</p><p>I would like to see the transition from representative democracy to a techno direct democracy simply because it’s possible now. Not only that, it’s actually entirely viable considering, at least in the United States, most of the so-called representative don’t even read the legislation that they vote on.</p><p>Louise: I can tell you, the fact is, again, just like I can speak to this, having been an elected representative. Those are incredibly complicated. It would in fact, while commentators often make this point, you rely on summations, as we all do, in order to understand what the bill is arguing. Otherwise, you would have to be a lawyer in order to be an effective politician, which I think it’s one of these canards.</p><p>“Oh, they didn’t read the bill.” The fact is that bills are written in highly legal language, and as a elected representative, the responsible thing to do is to read, understand, and familiarize yourself with a summary of a given bill, because only a lawyer can understand the ins and outs of the clauses in which legislation, and that’s why it’s called legislation, is written.</p></blockquote><p> Now, before you comment on this, read this article about the Montana Supreme Court striking down legislation that was a) passed by the Montana State legislature, then b) passed by 80 percent of the Montana electorate.</p><blockquote class=\"tr_bq\"><p> The Montana Supreme Court has barred state officials from reporting the immigration status of people seeking state services, striking down the last piece of a voter-approved law meant to deter people who are in the U.S. illegally from living and working in Montana.</p><p>The court’s unanimous decision on Tuesday upholds a Helena judge’s 2014 ruling in a lawsuit that the law denying unemployment benefits, university enrollment and other services to people who arrived in the country illegally was unconstitutional.</p><p>The justices went further, rejecting the one remaining provision that required state workers to report to federal immigration officials the names of applicants who are not in the U.S. legally.</p><p>“The risk of inconsistent and inaccurate judgments issuing from a multitude of state agents untrained in immigration law and unconstrained by any articulated standards is evident,” Justice Patricia Cotter wrote in the opinion.</p><p>The Montana Legislature sent the anti-immigrant measure to the 2012 ballot, where it was approved by 80 percent of voters. The new law required state officials to check the immigration status of applicants for unemployment insurance benefits, crime victim services, professional or trade licenses, university enrollment and financial aid and services for the disabled, among other things.</p></blockquote><p>Now, if you are so inclined, please attempt to defend “representative democracy”, which is observably neither representative nor democratic. And recall that you will receive neither points nor credit for citing the outdated “mob rule” objection which preceded these events by more than 200 years and quite clearly did not anticipate them.</p><p>The debate between direct democracy and so-called representative democracy is more accurately described as a debate between democracy and a deceptive parody thereof.</p></div>",
  "content_text": "Another selection from my suffrage debate with Louise Mensch at Heat Street that\nI think is worth discussing\n:\nLouise:\nLet’s start with the fact your argument is,  if women vote, it will have a given outcome that will move society to the left. On those grounds, you should surely object to voting of any description, including by men, because your argument appears to be that if the people vote a way that you don’t think that they should vote, this shouldn’t be allowed.\nYour argument in fact, as logically stated just then, is not against women voting. It’s against democracy itself. You think that if people vote, in this case you think women should be banned because they’re more likely to vote left-wing. That is an argument saying that if somebody votes the wrong way, they should be banned from voting, which is of course itself an argument against democracy at all. What do you say to that?\nVox: I say that you are mis-applying it, because as I said, I support everyone voting in a direct democracy, because there everyone is directly expressing their own will, and whatever they get, they deserve. If we all vote to burn down our houses, and then we burn down our houses, yeah, there was no deception there. We all knew what we were getting in for, and we got it. What we’re talking about is representative democracy, which is by definition not democracy. We’ve already decided that we’re going to limit the will of the people.\nLouise:\nNo, we haven’t. The will of the people in a representative democracy, for example the United States, is that they choose, they have realized en bloc that it is too much to vote on every single decision directly. You’d have a referendum for everything from your local dog catcher to gun control, abortion, et cetera, and you’d presumably have as many referenda as people wanted to make motions. It doesn’t work.\nIn a representative democracy, the decision that the people are taking is we are going to elect you to exercise judgment for us in this way, right?\nVox: No, but that was never made. This structure was imposed on us, and so no one has ever, there’s never been a referendum supporting this. There’s never been any votes for that, but the rules of the representative democracy are such that they are intentionally designed to limit and even eliminate democracy. For example, in California, when you saw Section 8 pass, and then it was overturned by the will of a single judge.\nThe whole system of representative democracy is to a certain extent a misnomer because it is actually entirely anti-democratic. The whole reason these structures, both on the parliamentary side and on the judicial side, is specifically designed to prevent democracy. Once you’ve accepted that principle of, “Okay, we’re going to limit democracy,” then it’s really a question of where you’re drawing the line. I’m just suggesting that a line should be drawn in a different place than it happens to be drawn today.\nLouise:\nBut you are suggesting, you just said, which I don’t agree with, but you just said that representative democracy doesn’t equal to the will of the people, period, so you’re not really arguing against women having the vote. You’re arguing against anybody having the vote in representative democracy. You’re arguing for an anarchic … On the one hand you say you’d like to conserve things. On the other, you wish to tear down representative democracy, which would mean dismantling the entire United States’ constitution and system of government, because what you have just to women applies to everybody and everything.\nIf representative democracy is so bad, it can’t be okay, even if only men have the franchise.\nVox: But we’re talking about two different issues here. We’re talking about on the one hand a discussion within the context of representative democracy, and obviously it’s much more conceivable at this point in time to modify the rules of the existing system, and then we’re talking about completely trashing the system in favor of something else….\nI would like to see the transition from representative democracy to a techno direct democracy simply because it’s possible now. Not only that, it’s actually entirely viable considering, at least in the United States, most of the so-called representative don’t even read the legislation that they vote on.\nLouise: I can tell you, the fact is, again, just like I can speak to this, having been an elected representative. Those are incredibly complicated. It would in fact, while commentators often make this point, you rely on summations, as we all do, in order to understand what the bill is arguing. Otherwise, you would have to be a lawyer in order to be an effective politician, which I think it’s one of these canards.\n“Oh, they didn’t read the bill.” The fact is that bills are written in highly legal language, and as a elected representative, the responsible thing to do is to read, understand, and familiarize yourself with a summary of a given bill, because only a lawyer can understand the ins and outs of the clauses in which legislation, and that’s why it’s called legislation, is written.\nNow, before you comment on this, read this article about the Montana Supreme Court striking down legislation that was a) passed by the Montana State legislature, then b) passed by 80 percent of the Montana electorate.\nThe Montana Supreme Court has barred state officials from reporting the immigration status of people seeking state services, striking down the last piece of a voter-approved law meant to deter people who are in the U.S. illegally from living and working in Montana.\nThe court’s unanimous decision on Tuesday upholds a Helena judge’s 2014 ruling in a lawsuit that the law denying unemployment benefits, university enrollment and other services to people who arrived in the country illegally was unconstitutional.\nThe justices went further, rejecting the one remaining provision that required state workers to report to federal immigration officials the names of applicants who are not in the U.S. legally.\n“The risk of inconsistent and inaccurate judgments issuing from a multitude of state agents untrained in immigration law and unconstrained by any articulated standards is evident,” Justice Patricia Cotter wrote in the opinion.\nThe Montana Legislature sent the anti-immigrant measure to the 2012 ballot, where it was approved by 80 percent of voters. The new law required state officials to check the immigration status of applicants for unemployment insurance benefits, crime victim services, professional or trade licenses, university enrollment and financial aid and services for the disabled, among other things.\nNow, if you are so inclined, please attempt to defend “representative democracy”, which is observably neither representative nor democratic. And recall that you will receive neither points nor credit for citing the outdated “mob rule” objection which preceded these events by more than 200 years and quite clearly did not anticipate them.\nThe debate between direct democracy and so-called representative democracy is more accurately described as a debate between democracy and a deceptive parody thereof.",
  "tags": [
    "debate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-16T12:30:00+00:00"
}