{
  "url": "https://voxday.net/2016/05/10/reviewers-wanted-2/",
  "scraped_at": "2025-12-17T17:57:07.367547",
  "title": "Reviewers wanted",
  "date_display": "May 10, 2016",
  "date_iso": "2016-05-10T09:36:00+00:00",
  "date_from_url": "2016-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Castalia has been publishing a lot of non-fiction of late. But over the next few months, we’re going to be getting back to our original mission, which is advancing the state of Blue SF, which is to say science fiction that is written in the spirit of the science fiction giants, particularly Robert Heinlein.</p><p>So, I’m looking for 10 volunteers who can review for Amazon a forthcoming book by an author we are billing as the New New Heinlein – he does Heinlein better, more respectfully, and in a much more original way than Scalzi ever did – as well as 10 volunteers who can review a novel that is written in the tradition of Louis L’Amour.</p><p>That’s right, in addition to the return to Blue SF, we’re bringing back the Western too.<strike> So, if you’re ready, able, and willing to read and review one of these books in short order, please email me with either BLUE SF or WESTERN in the title.</strike></p><p>UPDATE: We have enough reviewers, thank you!</p><p>In addition to TWO new John C. Wright novels we will be publishing this summer and fall, I’m particularly excited to publish a novel that I can only describe as written in the tradition of W. Somerset Maugham’s short stories. It’s intelligent, funny, and remarkably good.</p><p>Our range is becoming increasingly eclectic, but as I told David the Good after his second-straight book went #1 in Gardening, (the Kindle and Paperback editions of <b><i><a href=\"http://www.amazon.com/Grow-Die-Guide-Survival-Gardening-ebook/dp/B018BKK10E/ref=zg_bs_5241_3\">Grow or Die</a></i></b> are currently #3 AND #5 in the category) Castalia House has four major guidelines for the books we publish:</p><ul><li>Expected #1 category bestseller. If it’s not at least as popular as the most popular books in its category, it’s probably not for us. That doesn’t mean it’s a bad book, but we intend to not only maintain, but improve our level of quality as we grow. As more good authors exit the orbit of the failing major publishers, we expect more of them to come our way.</li><li>Intelligent. We don’t aim for the lowest common denominator. We’ll leave that to everyone else.</li><li>Different and original. As Marc Aramini openly informed his SJW critics at Making Light, no one else would have published <i>Between Light and Shadow</i>. No one, because it was a crazy, unprofitable thing to do. Even Gene Wolfe, though flattered, thought the project was completely insane. It is brilliant and unique and completely over the heads of everyone who isn’t a Wolfe fanatic, myself included. And that’s why we published it.</li><li>No SJWs. We publish science fiction. We publish fantasy. We publish science. We publish philosophy. We publish religion. We publish literary analysis. We publish gardening. We publish economics. We are in the process of publishing both Westerns and literary novels. But <i>we do not publish social justice</i> in any form.</li></ul><p>On a tangential note, I should note that later this year, there will be another debate on free trade. We’re still sorting out the timing and the details, but it appears Robert Murphy, Thomas Woods, and myself will be involved.</p></div>",
  "content_text": "Castalia has been publishing a lot of non-fiction of late. But over the next few months, we’re going to be getting back to our original mission, which is advancing the state of Blue SF, which is to say science fiction that is written in the spirit of the science fiction giants, particularly Robert Heinlein.\nSo, I’m looking for 10 volunteers who can review for Amazon a forthcoming book by an author we are billing as the New New Heinlein – he does Heinlein better, more respectfully, and in a much more original way than Scalzi ever did – as well as 10 volunteers who can review a novel that is written in the tradition of Louis L’Amour.\nThat’s right, in addition to the return to Blue SF, we’re bringing back the Western too.\nSo, if you’re ready, able, and willing to read and review one of these books in short order, please email me with either BLUE SF or WESTERN in the title.\nUPDATE: We have enough reviewers, thank you!\nIn addition to TWO new John C. Wright novels we will be publishing this summer and fall, I’m particularly excited to publish a novel that I can only describe as written in the tradition of W. Somerset Maugham’s short stories. It’s intelligent, funny, and remarkably good.\nOur range is becoming increasingly eclectic, but as I told David the Good after his second-straight book went #1 in Gardening, (the Kindle and Paperback editions of\nGrow or Die\nare currently #3 AND #5 in the category) Castalia House has four major guidelines for the books we publish:\nExpected #1 category bestseller. If it’s not at least as popular as the most popular books in its category, it’s probably not for us. That doesn’t mean it’s a bad book, but we intend to not only maintain, but improve our level of quality as we grow. As more good authors exit the orbit of the failing major publishers, we expect more of them to come our way.\nIntelligent. We don’t aim for the lowest common denominator. We’ll leave that to everyone else.\nDifferent and original. As Marc Aramini openly informed his SJW critics at Making Light, no one else would have published\nBetween Light and Shadow\n. No one, because it was a crazy, unprofitable thing to do. Even Gene Wolfe, though flattered, thought the project was completely insane. It is brilliant and unique and completely over the heads of everyone who isn’t a Wolfe fanatic, myself included. And that’s why we published it.\nNo SJWs. We publish science fiction. We publish fantasy. We publish science. We publish philosophy. We publish religion. We publish literary analysis. We publish gardening. We publish economics. We are in the process of publishing both Westerns and literary novels. But\nwe do not publish social justice\nin any form.\nOn a tangential note, I should note that later this year, there will be another debate on free trade. We’re still sorting out the timing and the details, but it appears Robert Murphy, Thomas Woods, and myself will be involved.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-10T08:36:00+00:00"
}