{
  "url": "https://voxday.net/2016/05/09/second-law/",
  "scraped_at": "2025-12-17T17:57:05.895459",
  "title": "Second Law",
  "date_display": "May 9, 2016",
  "date_iso": "2016-05-09T23:39:00+00:00",
  "date_from_url": "2016-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can almost <a href=\"http://nymag.com/selectall/2016/05/pounded-in-the-butt-literary-genius-trolls-right-wing-sci-fi-nerds.html\">hear the gritted teeth</a> at NY Mag. But he’s laughing. Oh, yes, indeed, he is <i>so</i> laughing:</p><blockquote class=\"tr_bq\"><p> Space Raptor Butt Invasion is about a man and a raptor who become romantically involved in space. “Soon enough,” according to its synopsis, “Lance becomes close with this mysterious new astronaut, a velociraptor. Together, they form an unlikely duo, which quickly begins to cross the boundaries of friendship into something much, much more sensual.”</p><p>But Tingle, who is pseudonymous and speaks on Twitter in a stilted, broken cadence, is having none of it. He spent much of this week trolling the Puppies and their ridiculous white-supremacist leader Vox Day on Twitter. He also released a new story, Slammed in the Butt by My Hugo Award Nomination.</p><p>Best of all, Tingle has appointed Zoe Quinn — the primary target of the Gamergate horde for the last couple of years — to serve as his proxy should he actually win. In other words, every Puppy vote for Chuck Tingle is also a vote to give Quinn more visibility and a platform to explicitly refute their bullshit.</p></blockquote><p>I sometimes wonder what planet these SJWs think they’re orbiting. Literally Who has been featured in fictional form in TV shows, has been the cause of the destruction of both 4chan and Gawker, and has even testified at the United Nations. But giving her <i>more</i> visibility and a <i>platform</i>, <i>well that just proves</i> that, um, Puppies are stupid white supremacist Gamerhaters!</p><p>That’s clearly the Narrative. Remember, SJWs must always claim victory. So, if “Space Raptor Butt Invasion” wins the Hugo for Best Short Story, then it’s me and the Rabid Puppies <a href=\"http://junkee.com/the-author-of-space-raptor-butt-invasion-is-trolling-gamergaters-in-the-best-possible-way/77670\">who will look ridiculous</a>. Got it? </p><blockquote class=\"tr_bq\"><p> Tingle has also been relentlessly owning Vox on Twitter by calling him “Voxman” and concocting bizarre memes using the movie Grandma’s Boy, which is about a 35-year-old manchild who works as a video game tester. So if Space Raptor Butt Invasion really does win an award, which is still pretty unlikely, it’s not going to look like the victory Vox Day and the Puppies wanted. They’re the ones who are going to look ridiculous, and if it’s a victory for gay space dinosaur erotica as well then that’s OK too.</p></blockquote><p>Owning. <i>Relentlessly</i>. As I’ve said, SJWs simply can’t maintain a coherent narrative. It’s going to be fascinating to hear them explain how the SF-SJWs no-awarded the super-funny, masterfully brilliant Shakespeare of our time. Just like, well, Mr. Sixth of Five himself.</p></div>",
  "content_text": "You can almost\nhear the gritted teeth\nat NY Mag. But he’s laughing. Oh, yes, indeed, he is\nso\nlaughing:\nSpace Raptor Butt Invasion is about a man and a raptor who become romantically involved in space. “Soon enough,” according to its synopsis, “Lance becomes close with this mysterious new astronaut, a velociraptor. Together, they form an unlikely duo, which quickly begins to cross the boundaries of friendship into something much, much more sensual.”\nBut Tingle, who is pseudonymous and speaks on Twitter in a stilted, broken cadence, is having none of it. He spent much of this week trolling the Puppies and their ridiculous white-supremacist leader Vox Day on Twitter. He also released a new story, Slammed in the Butt by My Hugo Award Nomination.\nBest of all, Tingle has appointed Zoe Quinn — the primary target of the Gamergate horde for the last couple of years — to serve as his proxy should he actually win. In other words, every Puppy vote for Chuck Tingle is also a vote to give Quinn more visibility and a platform to explicitly refute their bullshit.\nI sometimes wonder what planet these SJWs think they’re orbiting. Literally Who has been featured in fictional form in TV shows, has been the cause of the destruction of both 4chan and Gawker, and has even testified at the United Nations. But giving her\nmore\nvisibility and a\nplatform\n,\nwell that just proves\nthat, um, Puppies are stupid white supremacist Gamerhaters!\nThat’s clearly the Narrative. Remember, SJWs must always claim victory. So, if “Space Raptor Butt Invasion” wins the Hugo for Best Short Story, then it’s me and the Rabid Puppies\nwho will look ridiculous\n. Got it?\nTingle has also been relentlessly owning Vox on Twitter by calling him “Voxman” and concocting bizarre memes using the movie Grandma’s Boy, which is about a 35-year-old manchild who works as a video game tester. So if Space Raptor Butt Invasion really does win an award, which is still pretty unlikely, it’s not going to look like the victory Vox Day and the Puppies wanted. They’re the ones who are going to look ridiculous, and if it’s a victory for gay space dinosaur erotica as well then that’s OK too.\nOwning.\nRelentlessly\n. As I’ve said, SJWs simply can’t maintain a coherent narrative. It’s going to be fascinating to hear them explain how the SF-SJWs no-awarded the super-funny, masterfully brilliant Shakespeare of our time. Just like, well, Mr. Sixth of Five himself.",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-09T22:39:00+00:00"
}