{
  "url": "https://voxday.net/2016/05/01/sjws-strike-back/",
  "scraped_at": "2025-12-17T17:56:03.904262",
  "title": "SJWs strike back",
  "date_display": "May 1, 2016",
  "date_iso": "2016-05-01T09:17:00+00:00",
  "date_from_url": "2016-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In their own hapless and inimitably gamma way. First, Pedophil Sandifer makes a hash of the time-tested “I know you are but what am I” tactic and engages in the usual SJW projection in <a href=\"https://archive.is/tLI08#selection-305.1-305.53\">libeling the Hugo-nominated GamerGate artist Kukuruyo</a>:</p><blockquote class=\"tr_bq\"><p> Vox Day Put A Child Pornographer On The Hugo Ballot </p><p>For obvious reasons, I will not be providing links here, however I am happy to provide them privately to anyone with a legitimate interest in the information, including law enforcement.</p><p>It was brought to my attention today that “kukuruyo,” one of the artists that Vox Day put on the Rabid Puppies slate in Best Fan Artist and that made it onto the Hugo Ballot recently posted to his blog a commissioned drawing of comic book character Ms. Marvel in which her genitalia is clearly visible and provocatively displayed. Ms. Marvel – whose comic won last year’s Hugo for Best Graphic Story – is a sixteen-year-old girl in the comics. Under US law, this would seem to legally be child pornography.</p><p>Although the drawing post-dates Day’s placement of the artist on his slate, the hypocrisy of Vox Day endorsing the work of a child pornographer is particularly glaring given that he continues to throw childish insults like this around:</p><p> <i>   #SJW logic: Pedophil Sandifer complains that #RabidPuppies are “bullying fucks” while declaring that they are outnumbered “3,800 to 200”.</i><br>     — Supreme Dark Lord (@voxday) April 30, 2016</br></p><p>and has been vocal in accusing sci-fi fandom of harboring pedophiles, including slating two works with arguments to this effect in Best Related Work. </p></blockquote><p>He then proceeded to double down and <a href=\"http://archive.is/hck95\">do it again</a>. A few relevant points that collectively demonstrate the utter absurdity of Pedophil’s libel:</p><ol><li>Kukuruyo has stated that he didn’t know the fictitious age of the Marvel cartoon character, Ms Marvel, and drew her as a 20-year-old.</li><li>I am reliably informed that Ms Marvel was 16 when she was introduced in 2013. That makes her at least 18 now, possibly 19. </li><li>The age of consent in Spain is 16. Kukuruyo is Spanish, lives in Spain, and US law is not relevant to his activities.</li><li>The drawing cannot be child pornography regardless of what age the fictitious character is supposed to be. The U.S. Supreme Court has ruled that drawings and computer representations are not child pornography.</li><li>Phil Sandifer has admitted that he was aware of the Supreme Court ruling when he made the accusation.</li><li>The Ms Marvel drawing was drawn and posted well after I recommended Kukuruyo, who draws GamerGate Life, for the Hugo Award.</li><li>SJWs always project. This is more than a little alarming in this particular case.</li></ol><p>The most reprehensible aspect of Sandifer’s attack on GamerGate’s favorite artist is the way he is observably attempting to cast doubt on the undeniable fact that the science fiction fandom community has harbored pedophiles in the recent past, and the very reasonable suspicion that it is continuing to do so now.<br> In tangentially related news, while Camestros Felapton has gotten himself banned elsewhere in the Puppyverse, he’d always behaved himself here and never done worse than embarrass himself by demonstrating his inability to understand the core difference between rhetoric and dialectic, and between enthymemes and logical syllogisms. However, <a href=\"http://file770.com/?p=28616&amp;cpage=5#comment-424372\">he’s been blatantly lying</a> about both me and Castalia House at File 770, so he’s now permanently banned from commenting here as well.</br></p><blockquote class=\"tr_bq\"><p> I’ve been a fan of Gene Wolfe for a long time. I love the idea of the<br> work you are doing and from what I have seen the scale of work and<br> scholarship you have put into is impressive. However, I can’t vote for<br> your work when your publisher is promoting it by attempting to exploit<br> issues like child-sexual abuse. There isn’t some neat way of separating<br> ‘Castalia House’ from the actions and strategies of Theodore Beale/Vox<br> Day and there is a qualitative difference between authors who have been<br> unwillingly nominated by the Rabid slate and authors who have willingly<br> chosen to work with Castalia House. I understand that for you it was a<br> matter of getting your work published and promoted and I understand why<br> any author would want that for their work – but in the case of Castalia<br> “promoted” necessarily includes stunts like slating the Hugo awards and<br> attempts to trash whole categories, and it includes slurs and defamation<br> of *other authors* people who, like you, have poured sweat &amp;<br> scholarship and long days/nights into their work. However, I also get<br> that Vox Day perceives criticism as betrayal and that he has a tendency<br> to ‘punish’ what he perceives as betrayal. So I am certainly not asking<br> you denounce Day or withdraw from the awards or any other kind of<br> symbolic action, but I am saying I can’t vote for your work and I can’t<br> see it as a legitimate nomination because there is no way of seperating<br> what is published by Castalia from how Castalia promotes itself and its<br> published works.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p> To set the record straight:</p><ol><li>Castalia is not promoting our various works by exploiting issues like child sexual abuse. Being a father as well as the acquaintance of several adults who were abused as children, I take the matter very seriously and I am committed to identifying and exposing every abuser in the science fiction community, no matter how celebrated or protected they are. I do not view the Hugo Awards as a promotion, promoting Castalia’s books is not a primary, secondary, or even tertiary objective of the Rabid Puppies campaigns, and the only book we will be promoting on the subject is the one we are publishing by Moira Greyland about her experience growing up in the science fiction community.</li><li>I have not defamed any other authors, as the lawyers for John Scalzi, Samuel Delaney, and N.K. Jemisin, among others, will have informed them if they ever bothered to look into the matter. To the contrary, in the opinion of no less than three UK barristers, two of whom are experts on the subject and have won libel cases I have been legitimately and repeatedly libeled by a number of individuals in the media and the science fiction community.</li><li>I do not perceive criticism as betrayal, as pretty much every reader of this blog can testify, having criticized me at one time or another. I have no problem with criticism, what I object to is blatant falsehoods. Third Law. SJWs always project.</li></ol><p>Felapton does raise one valid point, which is that “there is no way of seperating what is published by Castalia from how Castalia promotes itself and its published works.”</p><p>However, in doing so, he only underlines Larry Correia’s original point about the Hugo Awards, which is that the awards are not given for merit, but rather are awarded on the basis of political approval. If the voters were solely, or even primarily, concerned with literary merit, as the SJWs in science fiction claim, this inability to separate the work from the publisher would not matter in the least.</p><p>But, as Felapton admits, since he can’t separate the work from the publisher, the merit of the work does not matter and he will not vote for any Castalia-published work on the basis of this genetic fallacy. That is certainly his prerogative, of course, but in explaining his reasoning, he has also proved the Sad Puppies original case about the Hugo Awards, which is that they are awards given out on the basis of political approval, not the pretense of literary merit the science fiction community presently affects.</p><p>Third, and more or less unrelated, but not meriting a separate post, Greg Hullender estimates the number of Rabid Puppies:</p><blockquote class=\"tr_bq\"><p> I’ve run the numbers using the power-law estimator, and from that I calculate that about 270 rabid puppies voted the slate this year, and that they kept fairly good slate discipline. I only get two anomalies:</p><p>“Hyperspace Demons,” by Jonathan Moeller should have been a finalist for Best Novelette. If we assume that he quietly declined the nomination, the numbers are a perfect fit.</p><p>Similarly, Bryan Thomas Schmidt should have been a finalist for Best Editor, Long Form. If we assume he too declined the nomination, those numbers are also a perfect fit.</p></blockquote><p>That sounds about 60 percent too low to me, although it’s higher than Felapton’s estimate of 200, but we’ll find out in due course. My guess, and it is nothing more than a logical extrapolation from last year’s vote, would be around 650, as I thought we’d need at least 750 to run the table this year. In any event, I’ll leave Kukuruyo with the last word, because the salt must flow.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i1.wp.com/kukuruyo.com/wp-content/uploads/2016/04/gamergate-76.png?fit=1240%2C563\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"180\" src=\"http://i1.wp.com/kukuruyo.com/wp-content/uploads/2016/04/gamergate-76.png?fit=1240%2C563\" width=\"400\"/></a></div><p></p></div>",
  "content_text": "In their own hapless and inimitably gamma way. First, Pedophil Sandifer makes a hash of the time-tested “I know you are but what am I” tactic and engages in the usual SJW projection in\nlibeling the Hugo-nominated GamerGate artist Kukuruyo\n:\nVox Day Put A Child Pornographer On The Hugo Ballot\nFor obvious reasons, I will not be providing links here, however I am happy to provide them privately to anyone with a legitimate interest in the information, including law enforcement.\nIt was brought to my attention today that “kukuruyo,” one of the artists that Vox Day put on the Rabid Puppies slate in Best Fan Artist and that made it onto the Hugo Ballot recently posted to his blog a commissioned drawing of comic book character Ms. Marvel in which her genitalia is clearly visible and provocatively displayed. Ms. Marvel – whose comic won last year’s Hugo for Best Graphic Story – is a sixteen-year-old girl in the comics. Under US law, this would seem to legally be child pornography.\nAlthough the drawing post-dates Day’s placement of the artist on his slate, the hypocrisy of Vox Day endorsing the work of a child pornographer is particularly glaring given that he continues to throw childish insults like this around:\n#SJW logic: Pedophil Sandifer complains that #RabidPuppies are “bullying fucks” while declaring that they are outnumbered “3,800 to 200”.\n— Supreme Dark Lord (@voxday) April 30, 2016\nand has been vocal in accusing sci-fi fandom of harboring pedophiles, including slating two works with arguments to this effect in Best Related Work.\nHe then proceeded to double down and\ndo it again\n. A few relevant points that collectively demonstrate the utter absurdity of Pedophil’s libel:\nKukuruyo has stated that he didn’t know the fictitious age of the Marvel cartoon character, Ms Marvel, and drew her as a 20-year-old.\nI am reliably informed that Ms Marvel was 16 when she was introduced in 2013. That makes her at least 18 now, possibly 19.\nThe age of consent in Spain is 16. Kukuruyo is Spanish, lives in Spain, and US law is not relevant to his activities.\nThe drawing cannot be child pornography regardless of what age the fictitious character is supposed to be. The U.S. Supreme Court has ruled that drawings and computer representations are not child pornography.\nPhil Sandifer has admitted that he was aware of the Supreme Court ruling when he made the accusation.\nThe Ms Marvel drawing was drawn and posted well after I recommended Kukuruyo, who draws GamerGate Life, for the Hugo Award.\nSJWs always project. This is more than a little alarming in this particular case.\nThe most reprehensible aspect of Sandifer’s attack on GamerGate’s favorite artist is the way he is observably attempting to cast doubt on the undeniable fact that the science fiction fandom community has harbored pedophiles in the recent past, and the very reasonable suspicion that it is continuing to do so now.\nIn tangentially related news, while Camestros Felapton has gotten himself banned elsewhere in the Puppyverse, he’d always behaved himself here and never done worse than embarrass himself by demonstrating his inability to understand the core difference between rhetoric and dialectic, and between enthymemes and logical syllogisms. However,\nhe’s been blatantly lying\nabout both me and Castalia House at File 770, so he’s now permanently banned from commenting here as well.\nI’ve been a fan of Gene Wolfe for a long time. I love the idea of the\nwork you are doing and from what I have seen the scale of work and\nscholarship you have put into is impressive. However, I can’t vote for\nyour work when your publisher is promoting it by attempting to exploit\nissues like child-sexual abuse. There isn’t some neat way of separating\n‘Castalia House’ from the actions and strategies of Theodore Beale/Vox\nDay and there is a qualitative difference between authors who have been\nunwillingly nominated by the Rabid slate and authors who have willingly\nchosen to work with Castalia House. I understand that for you it was a\nmatter of getting your work published and promoted and I understand why\nany author would want that for their work – but in the case of Castalia\n“promoted” necessarily includes stunts like slating the Hugo awards and\nattempts to trash whole categories, and it includes slurs and defamation\nof *other authors* people who, like you, have poured sweat &\nscholarship and long days/nights into their work. However, I also get\nthat Vox Day perceives criticism as betrayal and that he has a tendency\nto ‘punish’ what he perceives as betrayal. So I am certainly not asking\nyou denounce Day or withdraw from the awards or any other kind of\nsymbolic action, but I am saying I can’t vote for your work and I can’t\nsee it as a legitimate nomination because there is no way of seperating\nwhat is published by Castalia from how Castalia promotes itself and its\npublished works.\nTo set the record straight:\nCastalia is not promoting our various works by exploiting issues like child sexual abuse. Being a father as well as the acquaintance of several adults who were abused as children, I take the matter very seriously and I am committed to identifying and exposing every abuser in the science fiction community, no matter how celebrated or protected they are. I do not view the Hugo Awards as a promotion, promoting Castalia’s books is not a primary, secondary, or even tertiary objective of the Rabid Puppies campaigns, and the only book we will be promoting on the subject is the one we are publishing by Moira Greyland about her experience growing up in the science fiction community.\nI have not defamed any other authors, as the lawyers for John Scalzi, Samuel Delaney, and N.K. Jemisin, among others, will have informed them if they ever bothered to look into the matter. To the contrary, in the opinion of no less than three UK barristers, two of whom are experts on the subject and have won libel cases I have been legitimately and repeatedly libeled by a number of individuals in the media and the science fiction community.\nI do not perceive criticism as betrayal, as pretty much every reader of this blog can testify, having criticized me at one time or another. I have no problem with criticism, what I object to is blatant falsehoods. Third Law. SJWs always project.\nFelapton does raise one valid point, which is that “there is no way of seperating what is published by Castalia from how Castalia promotes itself and its published works.”\nHowever, in doing so, he only underlines Larry Correia’s original point about the Hugo Awards, which is that the awards are not given for merit, but rather are awarded on the basis of political approval. If the voters were solely, or even primarily, concerned with literary merit, as the SJWs in science fiction claim, this inability to separate the work from the publisher would not matter in the least.\nBut, as Felapton admits, since he can’t separate the work from the publisher, the merit of the work does not matter and he will not vote for any Castalia-published work on the basis of this genetic fallacy. That is certainly his prerogative, of course, but in explaining his reasoning, he has also proved the Sad Puppies original case about the Hugo Awards, which is that they are awards given out on the basis of political approval, not the pretense of literary merit the science fiction community presently affects.\nThird, and more or less unrelated, but not meriting a separate post, Greg Hullender estimates the number of Rabid Puppies:\nI’ve run the numbers using the power-law estimator, and from that I calculate that about 270 rabid puppies voted the slate this year, and that they kept fairly good slate discipline. I only get two anomalies:\n“Hyperspace Demons,” by Jonathan Moeller should have been a finalist for Best Novelette. If we assume that he quietly declined the nomination, the numbers are a perfect fit.\nSimilarly, Bryan Thomas Schmidt should have been a finalist for Best Editor, Long Form. If we assume he too declined the nomination, those numbers are also a perfect fit.\nThat sounds about 60 percent too low to me, although it’s higher than Felapton’s estimate of 200, but we’ll find out in due course. My guess, and it is nothing more than a logical extrapolation from last year’s vote, would be around 650, as I thought we’d need at least 750 to run the table this year. In any event, I’ll leave Kukuruyo with the last word, because the salt must flow.",
  "tags": [
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-01T08:17:00+00:00"
}