{
  "url": "https://voxday.net/2016/05/17/sjws-never-learn/",
  "scraped_at": "2025-12-17T17:58:01.590701",
  "title": "SJWs never learn",
  "date_display": "May 17, 2016",
  "date_iso": "2016-05-17T09:10:00+00:00",
  "date_from_url": "2016-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This brilliant and <a href=\"http://grrm.livejournal.com/487818.html?thread=24492682#t24492682\">totally new idea</a> that has never been thought before by anyone in the science fiction world amused me when it was broached on Rape Rape’s blog:</p><blockquote class=\"tr_bq\"><p> mrjoshuaspeaks<br> Is it not time for a simple “Bannishment” of the Pet Leech? I realize that nobody wants to open up a “BlackList” situation but why not just say “you are done” to V.D. and his publishing house and obvious cohort saboteurs. If that is to much at least cut out V.D..</br></p><p>As a diverse and open fanbase it is completely justified and to our collective benefit to say you are a problem and we do not acknowledge you. Let him prove his point on the web by spewing hate speech and gibberish, nobody but his little niche of followers would care. It may leave out a small sum of quality works that sadly will not be recognized but that is a small price to pay for the quality we lose with his contributors sweeping the votes.</p><p>Simply saying we do not want V.D. and his views and actions as a representation of fandom as a whole sounds “great” does it not? Let him slaver and spew from afar.</p></blockquote><p>Duly noted. I acknowledge SF fandom’s refusal to acknowledge me, accept it at face value, and for my part, promise to continue to ignore their opinions, feelings, and perspectives. As for “bannishment” that is a tactic that has clearly worked out very well for Teresa Nielsen Hayden, Patrick Nielsen Hayden, SFWA, and others. I would absolutely welcome another banishment, not because I am a gamma male engaging in the customary public posturing, but because the most recent one resulted in a one-million monthly increase in my average pageviews. I expect a Martin-inspired Worldcon banishment could prove even more productive in this regard than the Scalzi-driven SFWA “expulsion” was.</p><ol><li>Nielsen Haydens condemn VD’s presence on a Nebula jury </li><ul><li><i>Nebula juries canceled</i></li></ul><li>SF SJWs proclaim VD will never be published by mainstream SF publishing houses</li><ul><li><i>Castalia House launched.</i></li><li><i><i>Multiple bestselling authors join Castalia House.</i></i></li><li><i>VD writes and publishes four category bestsellers in nine months (with assistance from John Red Eagle, Dr. James Miller, and Dominic Saltarelli.)</i></li></ul><li>SFWA Board votes to expel VD from SFWA</li><ul><li><i>John Wright joins Castalia House</i></li><li><i>VD’s average monthly pageviews grow from 1.2 million to 2.2 million.</i></li><li><i>VD collects first Hugo nomination </i></li></ul><li>SF fandom votes to No Award “Opera Vita Aeterna” in 2014.</li><ul><li><i>Sad Puppies and Rabid Puppies take 57 nominations.</i></li><li><i>VD collects second and third Hugo nominations </i></li></ul><li>SF fandom No Awards the Puppies in 2015</li><ul><li><i>Rabid Puppies take 69 nominations (5 games DQ’d)</i></li><li><i>VD collects fourth and fifth Hugo nominations </i></li><li><i>Hugo rules changed: EPH and 4 of 6 pass.</i></li><li><i>“Space Raptor Butt Invasion” </i></li></ul></ol><p>Apparently SJWs aren’t gifted when it comes to pattern recognition. By all means, open up your hate and let it flow into me. Who could possibly doubt if they redouble their efforts one more time, <i>just this one more time</i>, their exclude-and-disapprove-and-refuse-to-acknowledge tactics will finally succeed!</p><p>Meanwhile, Yagathai not only confirms that Larry Correia was correct all along, but <a href=\"http://grrm.livejournal.com/487818.html?thread=24495242#t24495242\">justifies the ongoing campaign</a> against Tor Books:</p><blockquote class=\"tr_bq\"><p> yagathai<br> I have not read <i>Between Light and Shadow</i>. I do not plan to. I will nevertheless vote against it. Castalia House is the propaganda organ of an odious white supremacist and obscene misogynist, and I will fight to deny it even a breath of legitimacy.</br></p><p>That may not be all Castalia is. It may also publish serious works of scholarship, but that’s immaterial — lay down with puppies and you get fleas. Any work published by CH is tainted.</p><p>You can call this a “political reason” if you like. I don’t. I see it as a matter of common decency.</p></blockquote><p>He has a right to his opinion, as silly as it may be. As do we. Tor Books is the SJW-converged propaganda organ of an unreconstructed Stalinist, feminist, and dyscivilizationist, Patrick Nielsen Hayden, and while it may publish a few works that are not Pink SF, that is immaterial. Any work published by Tor Books is tainted.</p><p>It is a matter of common decency. Boycott Tor Books. Tor delenda est.</p><p>And finally, one of the authors of EPH shows his true colors. Remember, Worldcon kept going on and on about how impartial their very professional statisticians were, right up until those statisticians discovered that the Puppies were not the only slates in play and promptly buried the evidence by refusing to disclose the information they’d previously promised to disclose.</p><blockquote class=\"tr_bq\"><p> jamesonquinn<br> I’m the person who put together the ideas for EPH in the first place; a co-author of the analysis that prompted this post; and the person who first suggested a strengthened version of EPH (being called “EPH+” on File 770) for 2018. Clearly I’m not unbiased, but I am an expert on voting systems….</br></p><p>(VD is currently crowing about how GRRM is not a real hard science fiction writer like Piers Anthony was or else he would have realized that EPH wasn’t a panacea, and about how he will always have another plan and thus can never be foiled. As a voting theorist, I can say to him: I may also be no golden age SF author, but I do know how to shut you, and your innumerable plans, down. And what it looks like is exactly like what you’re seeing: an inexorable reduction of your ability to create the chaos you desire, step by carefully-considered consensus step.)</p></blockquote><p>All things are possible, <a href=\"http://statistics.fas.harvard.edu/people/jameson-arnold-quinn\">Mr. Quinn</a>. I will certainly welcome adding the scalp of a Harvard statistician to my growing collection. I note there is already one strike against you; I knew, as you did not, that EPH would fail from the start. And I take no small pleasure in being the first to inform you that EPH+ will as well, as you quite clearly do not understand its inevitable consequences.</p></div>",
  "content_text": "This brilliant and\ntotally new idea\nthat has never been thought before by anyone in the science fiction world amused me when it was broached on Rape Rape’s blog:\nmrjoshuaspeaks\nIs it not time for a simple “Bannishment” of the Pet Leech? I realize that nobody wants to open up a “BlackList” situation but why not just say “you are done” to V.D. and his publishing house and obvious cohort saboteurs. If that is to much at least cut out V.D..\nAs a diverse and open fanbase it is completely justified and to our collective benefit to say you are a problem and we do not acknowledge you. Let him prove his point on the web by spewing hate speech and gibberish, nobody but his little niche of followers would care. It may leave out a small sum of quality works that sadly will not be recognized but that is a small price to pay for the quality we lose with his contributors sweeping the votes.\nSimply saying we do not want V.D. and his views and actions as a representation of fandom as a whole sounds “great” does it not? Let him slaver and spew from afar.\nDuly noted. I acknowledge SF fandom’s refusal to acknowledge me, accept it at face value, and for my part, promise to continue to ignore their opinions, feelings, and perspectives. As for “bannishment” that is a tactic that has clearly worked out very well for Teresa Nielsen Hayden, Patrick Nielsen Hayden, SFWA, and others. I would absolutely welcome another banishment, not because I am a gamma male engaging in the customary public posturing, but because the most recent one resulted in a one-million monthly increase in my average pageviews. I expect a Martin-inspired Worldcon banishment could prove even more productive in this regard than the Scalzi-driven SFWA “expulsion” was.\nNielsen Haydens condemn VD’s presence on a Nebula jury\nNebula juries canceled\nSF SJWs proclaim VD will never be published by mainstream SF publishing houses\nCastalia House launched.\nMultiple bestselling authors join Castalia House.\nVD writes and publishes four category bestsellers in nine months (with assistance from John Red Eagle, Dr. James Miller, and Dominic Saltarelli.)\nSFWA Board votes to expel VD from SFWA\nJohn Wright joins Castalia House\nVD’s average monthly pageviews grow from 1.2 million to 2.2 million.\nVD collects first Hugo nomination\nSF fandom votes to No Award “Opera Vita Aeterna” in 2014.\nSad Puppies and Rabid Puppies take 57 nominations.\nVD collects second and third Hugo nominations\nSF fandom No Awards the Puppies in 2015\nRabid Puppies take 69 nominations (5 games DQ’d)\nVD collects fourth and fifth Hugo nominations\nHugo rules changed: EPH and 4 of 6 pass.\n“Space Raptor Butt Invasion”\nApparently SJWs aren’t gifted when it comes to pattern recognition. By all means, open up your hate and let it flow into me. Who could possibly doubt if they redouble their efforts one more time,\njust this one more time\n, their exclude-and-disapprove-and-refuse-to-acknowledge tactics will finally succeed!\nMeanwhile, Yagathai not only confirms that Larry Correia was correct all along, but\njustifies the ongoing campaign\nagainst Tor Books:\nyagathai\nI have not read\nBetween Light and Shadow\n. I do not plan to. I will nevertheless vote against it. Castalia House is the propaganda organ of an odious white supremacist and obscene misogynist, and I will fight to deny it even a breath of legitimacy.\nThat may not be all Castalia is. It may also publish serious works of scholarship, but that’s immaterial — lay down with puppies and you get fleas. Any work published by CH is tainted.\nYou can call this a “political reason” if you like. I don’t. I see it as a matter of common decency.\nHe has a right to his opinion, as silly as it may be. As do we. Tor Books is the SJW-converged propaganda organ of an unreconstructed Stalinist, feminist, and dyscivilizationist, Patrick Nielsen Hayden, and while it may publish a few works that are not Pink SF, that is immaterial. Any work published by Tor Books is tainted.\nIt is a matter of common decency. Boycott Tor Books. Tor delenda est.\nAnd finally, one of the authors of EPH shows his true colors. Remember, Worldcon kept going on and on about how impartial their very professional statisticians were, right up until those statisticians discovered that the Puppies were not the only slates in play and promptly buried the evidence by refusing to disclose the information they’d previously promised to disclose.\njamesonquinn\nI’m the person who put together the ideas for EPH in the first place; a co-author of the analysis that prompted this post; and the person who first suggested a strengthened version of EPH (being called “EPH+” on File 770) for 2018. Clearly I’m not unbiased, but I am an expert on voting systems….\n(VD is currently crowing about how GRRM is not a real hard science fiction writer like Piers Anthony was or else he would have realized that EPH wasn’t a panacea, and about how he will always have another plan and thus can never be foiled. As a voting theorist, I can say to him: I may also be no golden age SF author, but I do know how to shut you, and your innumerable plans, down. And what it looks like is exactly like what you’re seeing: an inexorable reduction of your ability to create the chaos you desire, step by carefully-considered consensus step.)\nAll things are possible,\nMr. Quinn\n. I will certainly welcome adding the scalp of a Harvard statistician to my growing collection. I note there is already one strike against you; I knew, as you did not, that EPH would fail from the start. And I take no small pleasure in being the first to inform you that EPH+ will as well, as you quite clearly do not understand its inevitable consequences.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-17T08:10:00+00:00"
}