{
  "url": "https://voxday.net/2016/05/25/sjws-are-worse-than-nazis/",
  "scraped_at": "2025-12-17T17:58:58.797147",
  "title": "SJWs are worse than Nazis",
  "date_display": "May 25, 2016",
  "date_iso": "2016-05-25T15:44:00+00:00",
  "date_from_url": "2016-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s what so many SJWs and neocons simply don’t understand.</p><blockquote class=\"tr_bq\"><p> Charlie McGregor ‏@CharlieMcGrego6<br> I am anti jew, never claimed not to be. Trump is who people are claiming is racist and xenophobic. Don’t strawman.</br></p><p>Jett Goldsmith ‏@JettGoldsmith<br> Oh my, and you live in the same state as me. Hold on while I capture your tweets and get you fired.</br></p><p>Jett Goldsmith ‏@JettGoldsmith<br> I’m trying to career police this guy, at this point. America doesn’t take kindly to Nazis.</br></p><p>Supreme Dark Lord ‏@voxday<br> That’s what you don’t understand. Most Americans prefer actual Nazis to you SJWs.</br></p></blockquote><p>Why are SJWs worse than Nazis? Because Nazis are authoritarian rather than totalitarian. Nazis are willing to leave most people alone. And Nazis actually support the national interest. Nazis are not dyscivilizational; a society founded on National Socialist principles may not be what you or I would prefer, but it is actually capable of functioning.</p><p>SJWs, on the other hand, are totalitarian, less tolerant than Nazis, unwilling to leave anyone alone, and are hostile to the national interest. SJWs are dyscivic and dyscivilizational; an SJW-converged society will collapse in disarray and demographic decline nearly as fast as any SJW-converged institution.</p><p>Now, I am not a Nazi. I am a nationalist, not a socialist, and I support far less of the National Socialist program outlined in the Munich Manifesto than the average Democrat does. As a student of military history, my mind boggles at the outrageous stupidity of both the Nazi and the EUzi attempts to imitate Napoleon and impose a continental system on the nations of Europe.</p><p>But if my choices are limited to choosing between SJWs and National Socialists, if I must choose between totalitarian globalists and National Socialists, like most Americans, like most Europeans, then I will choose the latter <i>every single time</i>.</p><p>It should go without saying that recognizing one devil is worse than another does not make one a devil-worshipper, although that won’t stop the usual suspects from falsely characterizing one’s preference. Because SJWs always lie.</p><p>Let them screech. The Freedom Party is on the rise. AfD is on the rise. The Swedish Democrats are on the rise. The Volkspartei is on the rise. Movimento 5 Stelle is on the rise. Golden Dawn is on the rise. The West is facing an existential crisis and we have much bigger concerns than those responsible for it calling us outdated and ludicrously inaccurate names.</p></div>",
  "content_text": "That’s what so many SJWs and neocons simply don’t understand.\nCharlie McGregor ‏@CharlieMcGrego6\nI am anti jew, never claimed not to be. Trump is who people are claiming is racist and xenophobic. Don’t strawman.\nJett Goldsmith ‏@JettGoldsmith\nOh my, and you live in the same state as me. Hold on while I capture your tweets and get you fired.\nJett Goldsmith ‏@JettGoldsmith\nI’m trying to career police this guy, at this point. America doesn’t take kindly to Nazis.\nSupreme Dark Lord ‏@voxday\nThat’s what you don’t understand. Most Americans prefer actual Nazis to you SJWs.\nWhy are SJWs worse than Nazis? Because Nazis are authoritarian rather than totalitarian. Nazis are willing to leave most people alone. And Nazis actually support the national interest. Nazis are not dyscivilizational; a society founded on National Socialist principles may not be what you or I would prefer, but it is actually capable of functioning.\nSJWs, on the other hand, are totalitarian, less tolerant than Nazis, unwilling to leave anyone alone, and are hostile to the national interest. SJWs are dyscivic and dyscivilizational; an SJW-converged society will collapse in disarray and demographic decline nearly as fast as any SJW-converged institution.\nNow, I am not a Nazi. I am a nationalist, not a socialist, and I support far less of the National Socialist program outlined in the Munich Manifesto than the average Democrat does. As a student of military history, my mind boggles at the outrageous stupidity of both the Nazi and the EUzi attempts to imitate Napoleon and impose a continental system on the nations of Europe.\nBut if my choices are limited to choosing between SJWs and National Socialists, if I must choose between totalitarian globalists and National Socialists, like most Americans, like most Europeans, then I will choose the latter\nevery single time\n.\nIt should go without saying that recognizing one devil is worse than another does not make one a devil-worshipper, although that won’t stop the usual suspects from falsely characterizing one’s preference. Because SJWs always lie.\nLet them screech. The Freedom Party is on the rise. AfD is on the rise. The Swedish Democrats are on the rise. The Volkspartei is on the rise. Movimento 5 Stelle is on the rise. Golden Dawn is on the rise. The West is facing an existential crisis and we have much bigger concerns than those responsible for it calling us outdated and ludicrously inaccurate names.",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-25T14:44:00+00:00"
}