{
  "url": "https://voxday.net/2016/05/08/so-angry/",
  "scraped_at": "2025-12-17T17:56:55.814111",
  "title": "So angry",
  "date_display": "May 8, 2016",
  "date_iso": "2016-05-08T17:32:00+00:00",
  "date_from_url": "2016-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amusing how the SJWs keep relying upon their primary tactic, which is to spin the Narrative no matter what relation it might have to the truth.</p><p>Michael Morlock ‏@RevWinfield<br> <i>The latest tantrum by @voxday has just gone to show that Buttpounding enthusiast @ChuckTingle is both a better man and a better writer.</i></br></p><p>Great. So vote “Space Raptor Butt Invasion” for Best Short Story. Perhaps I will too.</p><p><i>I am intrigued by Kevin Standlee’s proposal, for a three-stage process<br> (nomination as now, but leading to a list of up to 15 potential stories,<br> then an up-down vote on whether a story was worthy, by current Worldcon<br> members only, then the final ballot as now). The better solution would<br> be for Vox Day to abandon his childish games, but that seems unlikely in<br> the near future at least.</br></br></br></br></br></i><br> – Rich Horton, <a href=\"https://www.blackgate.com/2016/05/06/the-hugo-nominations-2016-or-sigh/\">Black Gate </a></br></p><p>Angry. Crying. Childish. Tantrum. Toddler.</p><p>Those who have read <i>SJW Always Lie</i> will, of course, recognize the tactic for what it is: a rhetorical attack. Their objective is no different than the objective of the fourth-grade girl who calls another girl ugly or fat. They’re simply playing Mean Girl Game, in which the rules are the first person to upset the other person and make them run off crying wins.</p><p>Now, you might ask yourself, what is the point of that? Even if I did feel devastated by people calling me names on the Internet and ran off crying, what would that change? In reality, nothing. But in their weird little delusion bubbles, they believe that just the right verbal sally will cause neutral parties to publicly acclaim them and enemies to submit. The fact that this has never, ever happened in their adult lives doesn’t prevent them from relying upon the tactic.</p><p>Anyhow, if an SJW someone else is slinging rhetoric at you, there is no need whatsoever to address it directly, to deny their ludicrous accusations, or to defend yourself in any way. Because what it means is that whatever you are doing is upsetting them and you should simply keep doing it. You can respond in kind if you feel like it, but there is no need to do so. The more they emote, the more they project, the more they will inform you where their vulnerabilities are.</p><p>For example, it should be readily apparent why so many of their preferred insults this year have a noticeable theme to them. They are projecting their emotional response to the accurate charge that as a community, they are harboring, defending, and celebrating pedophiles and child abusers. They very much dislike being referred to as pedofilers and pedophandom, because, as we know, the best and most effective rhetoric is that which has its basis in truth.</p></div>",
  "content_text": "It’s amusing how the SJWs keep relying upon their primary tactic, which is to spin the Narrative no matter what relation it might have to the truth.\nMichael Morlock ‏@RevWinfield\nThe latest tantrum by @voxday has just gone to show that Buttpounding enthusiast @ChuckTingle is both a better man and a better writer.\nGreat. So vote “Space Raptor Butt Invasion” for Best Short Story. Perhaps I will too.\nI am intrigued by Kevin Standlee’s proposal, for a three-stage process\n(nomination as now, but leading to a list of up to 15 potential stories,\nthen an up-down vote on whether a story was worthy, by current Worldcon\nmembers only, then the final ballot as now). The better solution would\nbe for Vox Day to abandon his childish games, but that seems unlikely in\nthe near future at least.\n– Rich Horton,\nBlack Gate\nAngry. Crying. Childish. Tantrum. Toddler.\nThose who have read\nSJW Always Lie\nwill, of course, recognize the tactic for what it is: a rhetorical attack. Their objective is no different than the objective of the fourth-grade girl who calls another girl ugly or fat. They’re simply playing Mean Girl Game, in which the rules are the first person to upset the other person and make them run off crying wins.\nNow, you might ask yourself, what is the point of that? Even if I did feel devastated by people calling me names on the Internet and ran off crying, what would that change? In reality, nothing. But in their weird little delusion bubbles, they believe that just the right verbal sally will cause neutral parties to publicly acclaim them and enemies to submit. The fact that this has never, ever happened in their adult lives doesn’t prevent them from relying upon the tactic.\nAnyhow, if an SJW someone else is slinging rhetoric at you, there is no need whatsoever to address it directly, to deny their ludicrous accusations, or to defend yourself in any way. Because what it means is that whatever you are doing is upsetting them and you should simply keep doing it. You can respond in kind if you feel like it, but there is no need to do so. The more they emote, the more they project, the more they will inform you where their vulnerabilities are.\nFor example, it should be readily apparent why so many of their preferred insults this year have a noticeable theme to them. They are projecting their emotional response to the accurate charge that as a community, they are harboring, defending, and celebrating pedophiles and child abusers. They very much dislike being referred to as pedofilers and pedophandom, because, as we know, the best and most effective rhetoric is that which has its basis in truth.",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-08T16:32:00+00:00"
}