{
  "url": "https://voxday.net/2016/05/28/still-not-past-i/",
  "scraped_at": "2025-12-17T17:59:21.395023",
  "title": "Still not past it",
  "date_display": "May 28, 2016",
  "date_iso": "2016-05-28T16:03:00+00:00",
  "date_from_url": "2016-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, the season is at an end, and it felt as if it went by remarkably fast. We started with a bang, defeating the new team 7-1, but we ended it by not only losing to them 3-2, but also finishing in second place behind them.</p><p>This was actually a better result than it sounds, since after that first game, they brought in reinforcements consisting of not one, but two, former Serie A players. Now, if you’ve ever competed against a world class athlete, you know that they are not merely better than the good ones, they are as much better than the good ones as the really good players are better than the bad ones. I’ve run track against Olympians and played basketball with an NCAA D1 power forward who made the Elite Eight, and it is just as hopeless going up against professional European soccer players.</p><p>They literally <i>scythe</i> through defenders, and pretty good defenders at that. Their technical skill is incredible, and had us back on our heels and defending desperately right from the start.The rest of their team is strong too, with a number of former second and third league players, four or five of whom played with us at one point or another.</p><p>I started at right wing, but was moved over to the left to shore up the defense after we went down 2-0, and in the midst of one attack, I could have sworn that we had their attack thwarted with myself and the left defender marking their right wing, and one central defender plus our defensive midfielder tightly marking the attacker with the ball.</p><p>He was one of the retired pros; I happen to be friendly acquaintances with him since we played together on an ad hoc tournament team two years ago, and while I didn’t know he was a pro then, I knew he was really freaking good. He wanted to pass to the wing, but I’d closed that option off, so somehow, he managed to create just enough space outside the box to rip off a shot that hit the bottom of the crossbar just inside the right post, then bounced down just inside the line. There was nothing the goalie could have done about it; there was nothing anyone could have done about it. The goalie and I just looked at each other and shrugged. <i>Va bene cosi.</i></p><p>I am proud of our team, though. Even down 3-0, we fought back, with one beautiful 40-meter cross getting headed just over the post before we caught a break when their goalie failed to hold onto a shot and our center mid, following it, tapped in the rebound. The captain moved me up to attacker after that, and about two minutes later, the center mid put a through ball past the defense, I ran onto it, and sent it left as the goalie went right. 3-2.</p><p>We almost had a shot at tying it when a long ball went past their defense and I beat their defenders to the ball, except the ball bounced just a little too high and I just missed being able to head it over the onrushing goalie. I was furious with myself, because if I’d slowed down just a little, or trusted our other attacker, who is 6’3″, to beat the defenders, we probably would have scored the equalizer.</p><p>Even though I started nearly every game this season, I’m a utility player now, only good enough to fill whatever hole we might have that week, or to come in as a sub when one of the better players runs out of steam. I can only control my wing against perhaps one-third of the opposing wings these days now that many of them are 10 to 15 years younger, but the captain trusts me to have the sense to stay back and help out the defender on my side if I can’t. In 20 games, I don’t think they’ve scored more than three goals attacking up my side all season.</p><p>After the game, I was congratulating two of their players on winning the championship when the former pro came over. I told him what a great goal he’d scored, he laughed, agreed, then put his arm around my shoulders and pointed accusingly to one of the defenders, with whom I was also acquainted. “I TOLD you to keep an eye on this guy,” he said. As I am ancient by veteran soccer standards, it’s reassuring to know that I’m not done yet. After all, the mark of a really dangerous team is one where even the lesser players are capable of hurting you.</p><p>So, it’s good to know that I can still contribute to the team from time to time. Six goals plus a few assists isn’t a bad finish, although it’s a little disappointing after having scored five of them in the fall half. And second place in the league is a very satisfactory result, if you consider that we finished ahead of all four teams that have been our rivals for the title over the last five seasons. Even though it is not our third title in five years, it very nearly feels like it.</p></div>",
  "content_text": "So, the season is at an end, and it felt as if it went by remarkably fast. We started with a bang, defeating the new team 7-1, but we ended it by not only losing to them 3-2, but also finishing in second place behind them.\nThis was actually a better result than it sounds, since after that first game, they brought in reinforcements consisting of not one, but two, former Serie A players. Now, if you’ve ever competed against a world class athlete, you know that they are not merely better than the good ones, they are as much better than the good ones as the really good players are better than the bad ones. I’ve run track against Olympians and played basketball with an NCAA D1 power forward who made the Elite Eight, and it is just as hopeless going up against professional European soccer players.\nThey literally\nscythe\nthrough defenders, and pretty good defenders at that. Their technical skill is incredible, and had us back on our heels and defending desperately right from the start.The rest of their team is strong too, with a number of former second and third league players, four or five of whom played with us at one point or another.\nI started at right wing, but was moved over to the left to shore up the defense after we went down 2-0, and in the midst of one attack, I could have sworn that we had their attack thwarted with myself and the left defender marking their right wing, and one central defender plus our defensive midfielder tightly marking the attacker with the ball.\nHe was one of the retired pros; I happen to be friendly acquaintances with him since we played together on an ad hoc tournament team two years ago, and while I didn’t know he was a pro then, I knew he was really freaking good. He wanted to pass to the wing, but I’d closed that option off, so somehow, he managed to create just enough space outside the box to rip off a shot that hit the bottom of the crossbar just inside the right post, then bounced down just inside the line. There was nothing the goalie could have done about it; there was nothing anyone could have done about it. The goalie and I just looked at each other and shrugged.\nVa bene cosi.\nI am proud of our team, though. Even down 3-0, we fought back, with one beautiful 40-meter cross getting headed just over the post before we caught a break when their goalie failed to hold onto a shot and our center mid, following it, tapped in the rebound. The captain moved me up to attacker after that, and about two minutes later, the center mid put a through ball past the defense, I ran onto it, and sent it left as the goalie went right. 3-2.\nWe almost had a shot at tying it when a long ball went past their defense and I beat their defenders to the ball, except the ball bounced just a little too high and I just missed being able to head it over the onrushing goalie. I was furious with myself, because if I’d slowed down just a little, or trusted our other attacker, who is 6’3″, to beat the defenders, we probably would have scored the equalizer.\nEven though I started nearly every game this season, I’m a utility player now, only good enough to fill whatever hole we might have that week, or to come in as a sub when one of the better players runs out of steam. I can only control my wing against perhaps one-third of the opposing wings these days now that many of them are 10 to 15 years younger, but the captain trusts me to have the sense to stay back and help out the defender on my side if I can’t. In 20 games, I don’t think they’ve scored more than three goals attacking up my side all season.\nAfter the game, I was congratulating two of their players on winning the championship when the former pro came over. I told him what a great goal he’d scored, he laughed, agreed, then put his arm around my shoulders and pointed accusingly to one of the defenders, with whom I was also acquainted. “I TOLD you to keep an eye on this guy,” he said. As I am ancient by veteran soccer standards, it’s reassuring to know that I’m not done yet. After all, the mark of a really dangerous team is one where even the lesser players are capable of hurting you.\nSo, it’s good to know that I can still contribute to the team from time to time. Six goals plus a few assists isn’t a bad finish, although it’s a little disappointing after having scored five of them in the fall half. And second place in the league is a very satisfactory result, if you consider that we finished ahead of all four teams that have been our rivals for the title over the last five seasons. Even though it is not our third title in five years, it very nearly feels like it.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-28T15:03:00+00:00"
}