{
  "url": "https://voxday.net/2016/05/14/the-country-left-hi/",
  "scraped_at": "2025-12-17T17:57:35.004408",
  "title": "The country left him",
  "date_display": "May 14, 2016",
  "date_iso": "2016-05-14T09:49:00+00:00",
  "date_from_url": "2016-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed observes that what passes for the United States of America today <a href=\"http://www.unz.com/freed/america-goes-away-fred-left-behind-in-mexico/\">is not the country he knew</a>:</p><blockquote class=\"tr_bq\"><p> Mail arrives in my inbox all the time, telling me that by going to Mexico I have sold out, fled, abandoned the United States. I’m a coward and a traitor, just like Lord Haw Haw, and Kim Philby, and probably hate America more than Barack Obama does.</p><p>It is is irrational. They think that just because I went to Mexico, I left the US. They don’t understand. I didn’t leave the United States. It left me. It was a bait-and-switch operation. I signed on to one country, and they slipped another in under me….</p><p>Now, I used to be fond of the United States. Granted, I wasn’t much<br> of a patriot. The word nowadays seems to mean one who doesn’t so much<br> love his country as to dislike other people’s. I figured live and let<br> live. A lot of other countries struck me as fine places. But America was<br> my favorite. It just suited me. I liked the people in their wild<br> variety and the countryside and the music and the brash independence. It<br> wasn’t perfect. Still, given the sorry baseline for comportment in<br> human agglomerations, it was about as good as you could get.</br></br></br></br></br></br></br></p><p>I’m still fond of the United States. I just can’t find it.</p></blockquote><p>Change the people, change the nation. That’s the real proposition. The irony, of course, is that the addition of all those people “yearning to breathe free” have turned the USA into a place that is considerably less free than many other countries. The extent to which this has taken place, and the way it was accomplished, <a href=\"http://amzn.to/1YrvN9F\">is documented in some detail here</a>.</p><p>The United States of America is now a triple misnomer. It is not united, the Several States are no longer sovereign states, and genuine Americans are now a minority. It should be no surprise that the country – it cannot be reasonably described as a nation – is no longer recognizable to an oldtimer like Fred.</p><p>I seldom get harassed in this way, probably because my story is pretty straightforward. I warned nearly everyone around me for nearly a decade about what was happening to no avail, and was frequently told that if I didn’t like it, I should just leave. So I did.</p><p>And nothing I have seen in the 20 years since has made me regret that decision.</p></div>",
  "content_text": "Fred Reed observes that what passes for the United States of America today\nis not the country he knew\n:\nMail arrives in my inbox all the time, telling me that by going to Mexico I have sold out, fled, abandoned the United States. I’m a coward and a traitor, just like Lord Haw Haw, and Kim Philby, and probably hate America more than Barack Obama does.\nIt is is irrational. They think that just because I went to Mexico, I left the US. They don’t understand. I didn’t leave the United States. It left me. It was a bait-and-switch operation. I signed on to one country, and they slipped another in under me….\nNow, I used to be fond of the United States. Granted, I wasn’t much\nof a patriot. The word nowadays seems to mean one who doesn’t so much\nlove his country as to dislike other people’s. I figured live and let\nlive. A lot of other countries struck me as fine places. But America was\nmy favorite. It just suited me. I liked the people in their wild\nvariety and the countryside and the music and the brash independence. It\nwasn’t perfect. Still, given the sorry baseline for comportment in\nhuman agglomerations, it was about as good as you could get.\nI’m still fond of the United States. I just can’t find it.\nChange the people, change the nation. That’s the real proposition. The irony, of course, is that the addition of all those people “yearning to breathe free” have turned the USA into a place that is considerably less free than many other countries. The extent to which this has taken place, and the way it was accomplished,\nis documented in some detail here\n.\nThe United States of America is now a triple misnomer. It is not united, the Several States are no longer sovereign states, and genuine Americans are now a minority. It should be no surprise that the country – it cannot be reasonably described as a nation – is no longer recognizable to an oldtimer like Fred.\nI seldom get harassed in this way, probably because my story is pretty straightforward. I warned nearly everyone around me for nearly a decade about what was happening to no avail, and was frequently told that if I didn’t like it, I should just leave. So I did.\nAnd nothing I have seen in the 20 years since has made me regret that decision.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-14T08:49:00+00:00"
}