{
  "url": "https://voxday.net/2016/05/30/the-ignorant-atheis/",
  "scraped_at": "2025-12-17T17:59:33.514148",
  "title": "The ignorant atheist",
  "date_display": "May 30, 2016",
  "date_iso": "2016-05-30T14:46:00+00:00",
  "date_from_url": "2016-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is why atheists remain so furiously ignorant. Once they are apprised of the relevant history and statistics, <a href=\"https://www.psychologytoday.com/blog/our-humanity-naturally/201103/misinformation-and-facts-about-secularism-and-religion\">their arguments vanish</a> into thin air:</p><blockquote class=\"tr_bq\"><p> The article, by Phil Zuckerman of Pitzer College, is entitled “Atheism, Secularity, and Well-Being: How the Findings of Social Science Counter Negative Stereotypes and Assumptions” and, unlike Plante’s article, it cites detailed studies of the areas in question.<br>Advertisement</br></p><p>Zuckerman analyzed a wide array of data comparing religious nations to less religious nations and also, interestingly, religious states within the United States (i.e. “Bible-belt” states) to less religious states. While I encourage readers to examine the article directly through the link above, here are just a few of the highlights:<br>Criminal Behavior:</br></p><p>Citing four different studies, Zuckerman states: “Murder rates are actually lower in more secular nations and higher in more religious nations where belief in God is widespread.” He also states: “Of the top 50 safest cities in the world, nearly all are in relatively non-religious countries.”</p><p>Within the United States, we see the same pattern. Citing census data, he writes: “And within America, the states with the highest murder rates tend to be the highly religious, such as Louisiana and Alabama, but the states with the lowest murder rates tend to be the among the least religious in the country, such as Vermont and Oregon.”</p><p>And these findings are not limited to murder rates, as rates of all violent crime tend to be higher in “religious” states. Zuckerman also points out that atheists are very much under-represented in the American prison population (only 0.2%).</p><p>Zuckerman cites a 1999 Barna study that finds that atheists and agnostics actually have lower divorce rates than religious Americans.</p></blockquote><p>I’ve dealt with most of these in The Irrational Atheist.</p><ol><li>The more secular vs more religious nation argument reflects on race, not religion.</li><li>The 50 safest cities are also a racial argument, not a religious one.</li><li>This is a variant of Sam Harris’s Red State argument. It’s also wrong at both the city and county level.</li><li>Again, a racial argument.</li><li>Atheists are actually overrepresented in prison if “No religion” is counted as atheist, as it usually is by atheists when they’re not trying to downplay the number of atheists.</li><li>It appears Zuckerman failed to correctly understand the relevant data or was not privy to it. While it is true that 3 percent more Baptists – who along with<br> Episcopals have the highest rate of Christian divorce – are divorced<br> than atheists, only 34 percent of atheists are married in the first<br> place.  In other words, 26.4 percent of atheist marriages fail compared<br> to 15.7 percent of Baptist marriages, even though a much lower<br> percentage of atheists ever get married.</br></br></br></br></br></li></ol></div>",
  "content_text": "This is why atheists remain so furiously ignorant. Once they are apprised of the relevant history and statistics,\ntheir arguments vanish\ninto thin air:\nThe article, by Phil Zuckerman of Pitzer College, is entitled “Atheism, Secularity, and Well-Being: How the Findings of Social Science Counter Negative Stereotypes and Assumptions” and, unlike Plante’s article, it cites detailed studies of the areas in question.\nAdvertisement\nZuckerman analyzed a wide array of data comparing religious nations to less religious nations and also, interestingly, religious states within the United States (i.e. “Bible-belt” states) to less religious states. While I encourage readers to examine the article directly through the link above, here are just a few of the highlights:\nCriminal Behavior:\nCiting four different studies, Zuckerman states: “Murder rates are actually lower in more secular nations and higher in more religious nations where belief in God is widespread.” He also states: “Of the top 50 safest cities in the world, nearly all are in relatively non-religious countries.”\nWithin the United States, we see the same pattern. Citing census data, he writes: “And within America, the states with the highest murder rates tend to be the highly religious, such as Louisiana and Alabama, but the states with the lowest murder rates tend to be the among the least religious in the country, such as Vermont and Oregon.”\nAnd these findings are not limited to murder rates, as rates of all violent crime tend to be higher in “religious” states. Zuckerman also points out that atheists are very much under-represented in the American prison population (only 0.2%).\nZuckerman cites a 1999 Barna study that finds that atheists and agnostics actually have lower divorce rates than religious Americans.\nI’ve dealt with most of these in The Irrational Atheist.\nThe more secular vs more religious nation argument reflects on race, not religion.\nThe 50 safest cities are also a racial argument, not a religious one.\nThis is a variant of Sam Harris’s Red State argument. It’s also wrong at both the city and county level.\nAgain, a racial argument.\nAtheists are actually overrepresented in prison if “No religion” is counted as atheist, as it usually is by atheists when they’re not trying to downplay the number of atheists.\nIt appears Zuckerman failed to correctly understand the relevant data or was not privy to it. While it is true that 3 percent more Baptists – who along with\nEpiscopals have the highest rate of Christian divorce – are divorced\nthan atheists, only 34 percent of atheists are married in the first\nplace.  In other words, 26.4 percent of atheist marriages fail compared\nto 15.7 percent of Baptist marriages, even though a much lower\npercentage of atheists ever get married.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-30T13:46:00+00:00"
}