{
  "url": "https://voxday.net/2016/05/24/the-rise-of-white-tribe/",
  "scraped_at": "2025-12-17T17:58:50.579123",
  "title": "The rise of the white tribe",
  "date_display": "May 24, 2016",
  "date_iso": "2016-05-24T08:49:00+00:00",
  "date_from_url": "2016-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Marcus is about a decade too late, but his observation that the Left and the various non-white American tribes <a href=\"http://thefederalist.com/2016/05/23/how-anti-white-rhetoric-is-fueling-white-nationalism/\">have created a growing white tribal consciousness</a> is correct, even though he foolishly laments it rather than celebrates it:</p><blockquote class=\"tr_bq\"><p> White people are being asked—or pushed—to take stock of their whiteness and identify with it more. This is a remarkably bad idea. The last thing our society needs is for white people to feel more tribal. The result of this tribalism will not be a catharsis of white identity, improving equality for non-whites. It will be resentment towards being the only tribe not given the special treatment bestowed by victimhood.</p><p>A big part of the reason white Americans have been willing to go along with policies that are prejudicial on their face, such as affirmative action, is that they do not view themselves as a tribe. Given the inequality of resources favoring whites in our society, it is a good thing that white people view themselves as the ones without an accent. Should that change, white privilege (whatever one views that to be) will not be eviscerated—it will be entrenched.</p><p>All of this comes at a time when the last immigrants from the great wave of white immigration from 1850-1920 have died off. In the past, most whites identified with their European ethnicity: Irish, Italian, German, etc. As white people gravitate away from such identities, many see themselves as a neutral, “non racial” population. The Left criticizes this refusal to see themselves as “white,” but it is far preferable to the alternative: an American white population that views itself as a special-interest group.</p></blockquote><p>There is no “white nationalism” in Europe. The EU was an attempt to create a merely continental consciousness – as opposed to the white racial consciousness of the white nationalists – and it has utterly failed. The various European nationalists consider each other allies against the continental globalists and the Arab and African invaders, of course, but there is no confusing the Soldiers of Odin with UKIP or La Lega Nord. Italian nationalism is very different than German or Swedish nationalism.</p><p>However, due to the replacement of European identities with a generic American one, combined with the anti-white tribalism of the blacks, Asians, Jews, Mexicans, and other self-identified tribes, a white tribal consciousness has been created. It falls well short of nationalism per se, but it has strong historical roots, as in fact, no other tribe has any historical claim to call itself American.</p><p>Let me repeat that: with two partial exceptions, American Indians belonging to Federally-recognized tribes and black slaves, no non-white tribe has any historical claim to be American. Americans are white, and this is a long-established matter of historical and legal record.</p><p><i>The original United States Naturalization Law of March 26, 1790 (1 Stat. 103) provided the first rules to be followed by the United States in the granting of national citizenship. This law limited naturalization to immigrants who were free white persons of good character.</i></p><p>Moreover, this remained the rule of American citizenship for more than half of the country’s history. As the Supreme Court unanimously declared in 1922 in <a href=\"http://caselaw.findlaw.com/us-supreme-court/260/178.html\">TAKAO OZAWA v. United States</a>, to be American was to be white.</p><blockquote class=\"tr_bq\"><p> In all of the naturalization acts from 1790 to 1906 the privilege of naturalization was confined to white persons [260 U.S. 178, 193], although the exact wording of the various statutes was not always the same. If Congress in 1906 desired to alter a rule so well and so long established it may be assumed that its purpose would have been definitely disclosed and its legislation to that end put in unmistakable terms….</p><p>If it be assumed that the opinion of the framers was that the only persons who would fall outside the designation ‘white’ were Negroes and Indians, this would go no farther than to demonstrate their lack of sufficient information to enable them to foresee precisely who would be excluded by that term in the subsequent administration of the statute. It is not important in construing their words to consider the extent of their ethnological knowledge or whether they thought that under the statute the only persons who would be denied naturalization would be Negroes and Indians. It is sufficient to ascertain whom they intended to include and having ascertained that it follows, as a necessary corollary, that all others are to be excluded.</p></blockquote><p>Now, you can argue “progress” and “things have changed” and “dual nationalities” and so forth. But that way lies incoherence and madness, to say nothing of the obvious fact that what has changed can be changed again. The simple fact of the matter is that if you are not white, your nationality is not American and you are not part of the posterity for whom the Constitution was written. (Of course, if you are a white immigrant, or descendant of immigrants, you are not part of that posterity either.)</p><p>You may be a United States citizen, you may be a resident of the United States, and you may be part-American in the sense that many individuals are part-German or part-Dutch, but you are not an American in any legitimate sense of the word, regardless of what ideas and ideals and propositions you happen to hold in your heart at the moment.</p><p>You may now commence the wailing and the gnashing of teeth. Do try to keep two things in mind. First, your argument is not with me, it is with history. The facts are what they are. It’s not my problem if you find them uncomfortable. Second, yes, I recognize that I am only part-American and I have absolutely no problem with that.</p><p>Tribalism begets tribalism. The rise of white nationalism, and eventually, white separatism, became inevitable once the minority population of the United States rose beyond a modest level. Once whites <i>realize</i> they have become a minority, they will rapidly become every bit as tribal as every other minority competing for wealth and political power. But neither white nationalism nor white separatism are synonymous with white supremacism, and anyone who attempts to equate the former two with the latter is, at best disingenuous.</p></div>",
  "content_text": "David Marcus is about a decade too late, but his observation that the Left and the various non-white American tribes\nhave created a growing white tribal consciousness\nis correct, even though he foolishly laments it rather than celebrates it:\nWhite people are being asked—or pushed—to take stock of their whiteness and identify with it more. This is a remarkably bad idea. The last thing our society needs is for white people to feel more tribal. The result of this tribalism will not be a catharsis of white identity, improving equality for non-whites. It will be resentment towards being the only tribe not given the special treatment bestowed by victimhood.\nA big part of the reason white Americans have been willing to go along with policies that are prejudicial on their face, such as affirmative action, is that they do not view themselves as a tribe. Given the inequality of resources favoring whites in our society, it is a good thing that white people view themselves as the ones without an accent. Should that change, white privilege (whatever one views that to be) will not be eviscerated—it will be entrenched.\nAll of this comes at a time when the last immigrants from the great wave of white immigration from 1850-1920 have died off. In the past, most whites identified with their European ethnicity: Irish, Italian, German, etc. As white people gravitate away from such identities, many see themselves as a neutral, “non racial” population. The Left criticizes this refusal to see themselves as “white,” but it is far preferable to the alternative: an American white population that views itself as a special-interest group.\nThere is no “white nationalism” in Europe. The EU was an attempt to create a merely continental consciousness – as opposed to the white racial consciousness of the white nationalists – and it has utterly failed. The various European nationalists consider each other allies against the continental globalists and the Arab and African invaders, of course, but there is no confusing the Soldiers of Odin with UKIP or La Lega Nord. Italian nationalism is very different than German or Swedish nationalism.\nHowever, due to the replacement of European identities with a generic American one, combined with the anti-white tribalism of the blacks, Asians, Jews, Mexicans, and other self-identified tribes, a white tribal consciousness has been created. It falls well short of nationalism per se, but it has strong historical roots, as in fact, no other tribe has any historical claim to call itself American.\nLet me repeat that: with two partial exceptions, American Indians belonging to Federally-recognized tribes and black slaves, no non-white tribe has any historical claim to be American. Americans are white, and this is a long-established matter of historical and legal record.\nThe original United States Naturalization Law of March 26, 1790 (1 Stat. 103) provided the first rules to be followed by the United States in the granting of national citizenship. This law limited naturalization to immigrants who were free white persons of good character.\nMoreover, this remained the rule of American citizenship for more than half of the country’s history. As the Supreme Court unanimously declared in 1922 in\nTAKAO OZAWA v. United States\n, to be American was to be white.\nIn all of the naturalization acts from 1790 to 1906 the privilege of naturalization was confined to white persons [260 U.S. 178, 193], although the exact wording of the various statutes was not always the same. If Congress in 1906 desired to alter a rule so well and so long established it may be assumed that its purpose would have been definitely disclosed and its legislation to that end put in unmistakable terms….\nIf it be assumed that the opinion of the framers was that the only persons who would fall outside the designation ‘white’ were Negroes and Indians, this would go no farther than to demonstrate their lack of sufficient information to enable them to foresee precisely who would be excluded by that term in the subsequent administration of the statute. It is not important in construing their words to consider the extent of their ethnological knowledge or whether they thought that under the statute the only persons who would be denied naturalization would be Negroes and Indians. It is sufficient to ascertain whom they intended to include and having ascertained that it follows, as a necessary corollary, that all others are to be excluded.\nNow, you can argue “progress” and “things have changed” and “dual nationalities” and so forth. But that way lies incoherence and madness, to say nothing of the obvious fact that what has changed can be changed again. The simple fact of the matter is that if you are not white, your nationality is not American and you are not part of the posterity for whom the Constitution was written. (Of course, if you are a white immigrant, or descendant of immigrants, you are not part of that posterity either.)\nYou may be a United States citizen, you may be a resident of the United States, and you may be part-American in the sense that many individuals are part-German or part-Dutch, but you are not an American in any legitimate sense of the word, regardless of what ideas and ideals and propositions you happen to hold in your heart at the moment.\nYou may now commence the wailing and the gnashing of teeth. Do try to keep two things in mind. First, your argument is not with me, it is with history. The facts are what they are. It’s not my problem if you find them uncomfortable. Second, yes, I recognize that I am only part-American and I have absolutely no problem with that.\nTribalism begets tribalism. The rise of white nationalism, and eventually, white separatism, became inevitable once the minority population of the United States rose beyond a modest level. Once whites\nrealize\nthey have become a minority, they will rapidly become every bit as tribal as every other minority competing for wealth and political power. But neither white nationalism nor white separatism are synonymous with white supremacism, and anyone who attempts to equate the former two with the latter is, at best disingenuous.",
  "tags": [
    "decline and fall",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-24T07:49:00+00:00"
}