{
  "url": "https://voxday.net/2016/05/22/the-decline-of-science-fiction/",
  "scraped_at": "2025-12-17T17:58:37.738607",
  "title": "The decline of science fiction literature",
  "date_display": "May 22, 2016",
  "date_iso": "2016-05-22T08:50:00+00:00",
  "date_from_url": "2016-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/kc1Ry7g5W6M\" width=\"504\"></iframe></div><p> He raises a significant question I haven’t seen: why is it that science fiction editors talk <i>so much</i> about politics, and <i>so little</i> about books they’ve read? He also hammers McRapey for his corrupt little arrangement with Cory Doctorow and BoingBoing.</p><p>He also found over a dozen voting slates and determined that there was only  one difference between the Puppy success and the lack of success of the rival slates: the Puppy slates – which, in the case of the Rabid Puppies were of course not even slates at all – <i>were put forth by more popular blogs</i>.</p><p>In other words, the only reason for all the fandom histrionics is that our writers are considerably more popular – or even worse, more influential – than theirs are. That is why they are constantly changing the rules and appealing to the media <a href=\"http://www.huffingtonpost.com/entry/women-sci-fi-writers_us_573e3f6ee4b045cc9a708295?\">in order to continue their affirmative action campaign</a> of destroying science fiction in order to improve it.</p><blockquote class=\"tr_bq\"><p> Earlier this week, a rousing headline shot at warp-speed across browsers and Twitter feeds: Women Swept The 2015 Nebula Awards, taking home the prestigious science-fiction and fantasy prizes in the categories of Novel, Novella, Novelette, Short Story and Young Adult Science Fiction and Fantasy work.</p><p>The news might’ve come as a surprise to — or, at least, to the chagrin of — a boisterous group of science fiction writers and fans who’ve taken up the cause of restoring the genre to its tenants of yore: lighthearted adventure that’s sleek, zippy, fun, and — oh yeah — comprised of shelves’ worth of white male writers.</p><p>The ostensible platform of the Sad and Rabid Puppies, whose name is meant to mock heartfelt liberalism, is meant to support action stories sans political or moral message. And the cost? Last year, they rigged the voting for a similarly lauded set of prizes, the Hugo Awards, favoring white male writers and effectively quelling women and authors of color. Unlike the Nebulas — which are voted on by the Science Fiction and Fantasy Writers of America, an organization comprised not just of writers but editors and publishers — the Hugos are controlled by readers, so the Puppies were able to leave their mark.</p><p>They didn’t succeed entirely. The categories they stocked with their own nominees received “No Award” due to voters rejecting their white male nominees. But for writers whose books were unfairly overlooked, the damage was done.</p><p>This year, the conversation howls on, especially in light of the woman-centered Nebula slate. Nnedi Okorafor, who won for her novella Binti, an interstellar story about a girl who leaves her people to attend the prestigious Oomza University, worlds away from her home, says she’s thankful that issues of prejudice in the industry are being discussed.</p><p>In an interview with The Huffington Post, Okorafor said, <i>“Honestly, I love hearing people arguing out in the open, not hidden away in their own echo chambers. That’s what I want to see more of: Dialogue. The issues swirling around the Hugos are merely manifestations of the growing pains this country is experiencing as a whole,” she added. “Growing pains are painful, awkward, annoying, sometimes destructive in order to create. What I hope will be the outcome of the Hugos is an airing out, an addressing, a debate, and a moving forward.”</i></p><p>Naomi Novik, who took home the 2016 Nebula for her novel Uprooted, a fantasy book about a girl whose taken from her beloved community by a seemingly harmless dragon, feels differently. For her, the Sad Puppies’ rhetoric has been damaging, manipulative and unreflective of true fandom.</p><p>“I am glad to trumpet my disdain for this loudly,” Novik told HuffPost. “What I very much hope will come out of this year’s Hugo Awards is that the rules will be changed. [The Puppies] need to just go away.”</p><p>Both women agree that prejudiced lines of thinking have been historically damaging to women and writers of color working in the genre, who have both been recognized in their time, but largely forgotten by history. Kate Wilhelm’s suspenseful speculative fiction has won multiple Nebulas and a Hugo; Vonda N. McIntyre, whose longstanding attachment to the “Star Trek” franchise rocketed her to acclaim, won both awards as well. Yet neither is discussed alongside Orson Scott Card or William Gibson.</p></blockquote><p>If Maddie Crum had ever read Kate Wilhelm’s or Vonda McIntyre’s books, or Card’s and Gibson’s, for that matter, she would know perfectly well why the former are not discussed alongside the latter. They’re neither as good nor as important and influential. They’re just not. It’s not even debatable.</p><p>It will be interesting to see how Novik’s disdain will be affected if we give her book Best Novel, just as we gave it to <i>Three-Body Problem</i> last year. <i>Uprooted</i> isn’t a great book, nor is it an important one, but it’s not a bad little fairy tale either. It’s a lightweight book more akin to <i>Among Others</i> than <i>Redshirts</i> or <i>The Quantum Rose</i>. It’s rather amusing that fendom is so caught up in the nominations game that they have failed to recognize that while they decide if anyone wins or not, the Rabid Puppies now decide who will win whenever there is more than one contestant in play.</p><p>The thing is, neither Novik nor Okorafor are bad writers. I generally like their works I’ve read. In historical terms, they write competent midlist fantasy and science fiction, respectively. But the fact that they are the best Pink SF has to offer is sufficient evidence of both the decline of the mainstream science fiction infrastructure as well as the general mediocrity of female SF/F writers.</p><p>What female SF/F writer today can compete with Tanith Lee at her best? If you compare Novik’s take on fairy tales to Lee’s, well, it’s not even close. There is still Lois McMaster Bujold, of course, but even she has lost her fastball when it comes to her novel-length works. Fat Seanan? N… K… Jemisin? Kameron “We Have Always Invented History” Hurley? Ann “Tea in Space” Leckie?</p><p>Please. There are better women writers working in the game industry than are getting nominated for awards in SF/F literature these days. Forget the awards, half these women couldn’t get published traditionally or self-publish and sell in the Amazon top 100,000 if they used a male pen name.</p><p>I’d very much like to see one of them try to prove me wrong. And as for the converse, well, <i>are you absolutely certain I haven’t already done so?</i></p></div>",
  "content_text": "He raises a significant question I haven’t seen: why is it that science fiction editors talk\nso much\nabout politics, and\nso little\nabout books they’ve read? He also hammers McRapey for his corrupt little arrangement with Cory Doctorow and BoingBoing.\nHe also found over a dozen voting slates and determined that there was only  one difference between the Puppy success and the lack of success of the rival slates: the Puppy slates – which, in the case of the Rabid Puppies were of course not even slates at all –\nwere put forth by more popular blogs\n.\nIn other words, the only reason for all the fandom histrionics is that our writers are considerably more popular – or even worse, more influential – than theirs are. That is why they are constantly changing the rules and appealing to the media\nin order to continue their affirmative action campaign\nof destroying science fiction in order to improve it.\nEarlier this week, a rousing headline shot at warp-speed across browsers and Twitter feeds: Women Swept The 2015 Nebula Awards, taking home the prestigious science-fiction and fantasy prizes in the categories of Novel, Novella, Novelette, Short Story and Young Adult Science Fiction and Fantasy work.\nThe news might’ve come as a surprise to — or, at least, to the chagrin of — a boisterous group of science fiction writers and fans who’ve taken up the cause of restoring the genre to its tenants of yore: lighthearted adventure that’s sleek, zippy, fun, and — oh yeah — comprised of shelves’ worth of white male writers.\nThe ostensible platform of the Sad and Rabid Puppies, whose name is meant to mock heartfelt liberalism, is meant to support action stories sans political or moral message. And the cost? Last year, they rigged the voting for a similarly lauded set of prizes, the Hugo Awards, favoring white male writers and effectively quelling women and authors of color. Unlike the Nebulas — which are voted on by the Science Fiction and Fantasy Writers of America, an organization comprised not just of writers but editors and publishers — the Hugos are controlled by readers, so the Puppies were able to leave their mark.\nThey didn’t succeed entirely. The categories they stocked with their own nominees received “No Award” due to voters rejecting their white male nominees. But for writers whose books were unfairly overlooked, the damage was done.\nThis year, the conversation howls on, especially in light of the woman-centered Nebula slate. Nnedi Okorafor, who won for her novella Binti, an interstellar story about a girl who leaves her people to attend the prestigious Oomza University, worlds away from her home, says she’s thankful that issues of prejudice in the industry are being discussed.\nIn an interview with The Huffington Post, Okorafor said,\n“Honestly, I love hearing people arguing out in the open, not hidden away in their own echo chambers. That’s what I want to see more of: Dialogue. The issues swirling around the Hugos are merely manifestations of the growing pains this country is experiencing as a whole,” she added. “Growing pains are painful, awkward, annoying, sometimes destructive in order to create. What I hope will be the outcome of the Hugos is an airing out, an addressing, a debate, and a moving forward.”\nNaomi Novik, who took home the 2016 Nebula for her novel Uprooted, a fantasy book about a girl whose taken from her beloved community by a seemingly harmless dragon, feels differently. For her, the Sad Puppies’ rhetoric has been damaging, manipulative and unreflective of true fandom.\n“I am glad to trumpet my disdain for this loudly,” Novik told HuffPost. “What I very much hope will come out of this year’s Hugo Awards is that the rules will be changed. [The Puppies] need to just go away.”\nBoth women agree that prejudiced lines of thinking have been historically damaging to women and writers of color working in the genre, who have both been recognized in their time, but largely forgotten by history. Kate Wilhelm’s suspenseful speculative fiction has won multiple Nebulas and a Hugo; Vonda N. McIntyre, whose longstanding attachment to the “Star Trek” franchise rocketed her to acclaim, won both awards as well. Yet neither is discussed alongside Orson Scott Card or William Gibson.\nIf Maddie Crum had ever read Kate Wilhelm’s or Vonda McIntyre’s books, or Card’s and Gibson’s, for that matter, she would know perfectly well why the former are not discussed alongside the latter. They’re neither as good nor as important and influential. They’re just not. It’s not even debatable.\nIt will be interesting to see how Novik’s disdain will be affected if we give her book Best Novel, just as we gave it to\nThree-Body Problem\nlast year.\nUprooted\nisn’t a great book, nor is it an important one, but it’s not a bad little fairy tale either. It’s a lightweight book more akin to\nAmong Others\nthan\nRedshirts\nor\nThe Quantum Rose\n. It’s rather amusing that fendom is so caught up in the nominations game that they have failed to recognize that while they decide if anyone wins or not, the Rabid Puppies now decide who will win whenever there is more than one contestant in play.\nThe thing is, neither Novik nor Okorafor are bad writers. I generally like their works I’ve read. In historical terms, they write competent midlist fantasy and science fiction, respectively. But the fact that they are the best Pink SF has to offer is sufficient evidence of both the decline of the mainstream science fiction infrastructure as well as the general mediocrity of female SF/F writers.\nWhat female SF/F writer today can compete with Tanith Lee at her best? If you compare Novik’s take on fairy tales to Lee’s, well, it’s not even close. There is still Lois McMaster Bujold, of course, but even she has lost her fastball when it comes to her novel-length works. Fat Seanan? N… K… Jemisin? Kameron “We Have Always Invented History” Hurley? Ann “Tea in Space” Leckie?\nPlease. There are better women writers working in the game industry than are getting nominated for awards in SF/F literature these days. Forget the awards, half these women couldn’t get published traditionally or self-publish and sell in the Amazon top 100,000 if they used a male pen name.\nI’d very much like to see one of them try to prove me wrong. And as for the converse, well,\nare you absolutely certain I haven’t already done so?",
  "tags": [
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-22T07:50:00+00:00"
}