{
  "url": "https://voxday.net/2016/05/05/trump2016-vs-nevertrump/",
  "scraped_at": "2025-12-17T17:56:34.124533",
  "title": "#Trump2016 vs #NeverTrump",
  "date_display": "May 5, 2016",
  "date_iso": "2016-05-05T16:35:00+00:00",
  "date_from_url": "2016-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://heatst.com/culture-wars/donald-trump-vs-nevertrump-gamergates-vox-day-debates-conservatism/\">A short debate</a> on Donald Trump’s victorious campaign for the Republican nomination and the nature of conservatism between me and Louise Mensch of Heat Street:</p><blockquote class=\"tr_bq\"><p> LM: <i>This is obviously a sad day for me and a terrific day for you as Donald Trump is crowned the presumptive nominee by the GOP establishment. Last night, while we were talking with each other, we were discussing the nature of conservatism.</i></p><p><i>To me, my duty as a conservative is to oppose Donald Trump because he’s not a conservative. I said that, to me, conservatism stands for equality of opportunity. You said in your view, it never had done. How do you define conservatism?</i></p><p>VD: I define conservatism as an attitude more than a coherent ideology. If you look at the history of conservatism, which you as a British individual will be aware, it really is something different to the ideas that underlie the British Conservative Party or the Tory Party. Russell Kirk attempted to turn that inherited tradition into a more coherent ideology, and he came up with the 10 foundational points of what he terms conservatism. So it’s less an ideology than an attitude – and a relative posture.</p><p> Equality of opportunity is merely something that fits that attitude more than it is a founding point of the ideology, in the way that the “labor theory of value” is something that underlies the ideology of socialism.</p><p>LM <i>You think that leftism is ideological, but conservatism is only an attitude?</i></p><p>VD: To a certain extent. Socialism is clearly a distinctive set of ideologies. There are of course different socialisms, from Fabianism to Marxism. Progressivism – today’s liberalism – is also a coherent ideology. Conservatism is intrinsically a reaction to other ideologies rather than an ideology of its own.</p><p>LM: <i>You don’t think Conservatism stands for anything apart from opposing Liberalism, to use that umbrella term for the left?</i></p><p>VD: Exactly correct. There’s a common saying that today’s conservative is yesterday’s liberal. Conservatism, if we look at the positions that it holds, is usually 20-25 years behind what yesterday’s liberals were. Today, John F. Kennedy would be regarded not only as a Republican – but one who was a little bit to the right.</p><p>LM: <i>To me, that seems defeatist for a guy that I see, though I may differ with you on many things, at the very least as an alpha male go-getter. You’re not behind any particular set of principles. You just want to oppose somebody else! Doesn’t that put all the power in their hands?</i></p><p>VD: It does, but it’s not defeatist for me because, as I have repeatedly told people for well over a decade, I am not a conservative. I am an extremist and I’m a radical. That’s why I don’t identify with this conservatism that  never conserves anything, that goes from one noble defeat to the next, and has completely failed to conserve anything, even the United States of America.</p></blockquote><p><a href=\"http://heatst.com/culture-wars/donald-trump-vs-nevertrump-gamergates-vox-day-debates-conservatism/\">Read the whole thing there</a>. It was an oral debate, not a written one, but I think I managed to avoid tripping over my convoluted sentence structures for the most part. The bet was funny; I don’t think she was quite expecting THAT!</p></div>",
  "content_text": "A short debate\non Donald Trump’s victorious campaign for the Republican nomination and the nature of conservatism between me and Louise Mensch of Heat Street:\nLM:\nThis is obviously a sad day for me and a terrific day for you as Donald Trump is crowned the presumptive nominee by the GOP establishment. Last night, while we were talking with each other, we were discussing the nature of conservatism.\nTo me, my duty as a conservative is to oppose Donald Trump because he’s not a conservative. I said that, to me, conservatism stands for equality of opportunity. You said in your view, it never had done. How do you define conservatism?\nVD: I define conservatism as an attitude more than a coherent ideology. If you look at the history of conservatism, which you as a British individual will be aware, it really is something different to the ideas that underlie the British Conservative Party or the Tory Party. Russell Kirk attempted to turn that inherited tradition into a more coherent ideology, and he came up with the 10 foundational points of what he terms conservatism. So it’s less an ideology than an attitude – and a relative posture.\nEquality of opportunity is merely something that fits that attitude more than it is a founding point of the ideology, in the way that the “labor theory of value” is something that underlies the ideology of socialism.\nLM\nYou think that leftism is ideological, but conservatism is only an attitude?\nVD: To a certain extent. Socialism is clearly a distinctive set of ideologies. There are of course different socialisms, from Fabianism to Marxism. Progressivism – today’s liberalism – is also a coherent ideology. Conservatism is intrinsically a reaction to other ideologies rather than an ideology of its own.\nLM:\nYou don’t think Conservatism stands for anything apart from opposing Liberalism, to use that umbrella term for the left?\nVD: Exactly correct. There’s a common saying that today’s conservative is yesterday’s liberal. Conservatism, if we look at the positions that it holds, is usually 20-25 years behind what yesterday’s liberals were. Today, John F. Kennedy would be regarded not only as a Republican – but one who was a little bit to the right.\nLM:\nTo me, that seems defeatist for a guy that I see, though I may differ with you on many things, at the very least as an alpha male go-getter. You’re not behind any particular set of principles. You just want to oppose somebody else! Doesn’t that put all the power in their hands?\nVD: It does, but it’s not defeatist for me because, as I have repeatedly told people for well over a decade, I am not a conservative. I am an extremist and I’m a radical. That’s why I don’t identify with this conservatism that  never conserves anything, that goes from one noble defeat to the next, and has completely failed to conserve anything, even the United States of America.\nRead the whole thing there\n. It was an oral debate, not a written one, but I think I managed to avoid tripping over my convoluted sentence structures for the most part. The bet was funny; I don’t think she was quite expecting THAT!",
  "tags": [
    "debate",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-05T15:35:00+00:00"
}