{
  "url": "https://voxday.net/2016/05/10/why-whitegenocide-doesnt-work/",
  "scraped_at": "2025-12-17T17:57:09.183799",
  "title": "Why #whitegenocide doesn’t work",
  "date_display": "May 10, 2016",
  "date_iso": "2016-05-10T12:00:00+00:00",
  "date_from_url": "2016-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The objectives of the white nationalists behind the #whitegenocide meme are laudable. They seek to defend the right of people of European descent to live, to maintain European cultures, and to preserve European nations. They seek to demonstrate that diversity is intrinsically anti-European. These are all very good, desirable, and for those of us who value Western civilization, true and <i>necessary</i> goals. Western civilization is a European construct.</p><p>But the #whitegenocide meme simply does not achieve its purpose, it does not work, because it is a misguided attempt to use dialectic in the place of rhetoric. This is obvious, because those who use that particular meme are always – always – having to rationally explain and justify it. And it can be justified rationally, at least to those with a reasonable grasp of history and sufficiently long time preferences. But that doesn’t make it good rhetoric.</p><p>As those who have read SJWAL know, the fact that something can be rationally justified is not only an entirely different question than whether something is rhetorically effective, it is a very strong indicator that the meme in question is not rhetorically effective due to the fact that it is clearly not rhetoric at all. One does not persuade the emotions through the use of logic.</p><p>When people think of “genocide”, of what do they think? What is the one single word that immediately springs to mind when someone says “genocide” to you? It’s not “Holocaust”, it’s not “Jews”, it’s not “Rwanda”, it is “bodies”. We are all programmed to think of stacks of bodies, limp and scrawny and robbed of all dignity, when we hear the word “genocide”.</p><p>Well, where are the white bodies? They don’t exist. So, to make the connection between the term “genocide” and the serious problem of the 50-year assault on the various European nations and cultures requires an abstract leap, and what is worse, an abstract leap that ignores the instinctive emotional connection. So, #whitegenocide fails because it is not rhetoric at all, it is pure dialectic that predictably fails to move the emotions.</p><p>Contrast, in comparison, this ad for <i>The Man in the High Castle</i> which was quickly pulled because it was inadvertently serving as effective propaganda for the very ideas and peoples it was attempting to denigrate. It was run with the hashtag #whatifwelost.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://cdn.tradyouth.org/uploads/2015/11/08213529/12212524_191062044563825_1196284812_n.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://cdn.tradyouth.org/uploads/2015/11/08213529/12212524_191062044563825_1196284812_n.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://cdn.tradyouth.org/uploads/2015/11/08213529/12212524_191062044563825_1196284812_n.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> What if we lost? That snapshot of a supposedly scary future looks like a <i>considerable</i> improvement on 21st century America, in which single white mothers raise irreligious, low-IQ, racially-mixed bastards in tenements without support from the children’s fathers, most people are up to their eyeballs in debt with less than $400 in savings, no one under the age of 40 can afford to buy a home, and it is illegal to fly the American flag lest it harm the tender sensibilities of young Aztec invaders.</p><p>Remember, the best rhetoric is based on truth. In this case, the effectiveness was rooted in the truths being communicated emotionally regardless of what the creator’s intentions were. With the rise of tribal politics, the Alt Right, and Trump shattering the Overton Window, something that looks very much like that, less the swastikas, will be a <i>successful</i> campaign ad within a decade.</p><p>As #GamerGate has demonstrated, the best memes are visual rather than verbal and they appeal to the emotions rather than to the intellect. They should be positive rather than negative, radiating confidence and certainty rather than fear and doubt. Some of the best memes I’ve seen are those produced by female white nationalists, which tend to feature pretty blonde white women in traditional dresses with white children; women respond to them with either palpable longing or instinctive rage.</p><p>The exact terminology doesn’t matter. Both #GamerGate and #NotYourShield were successful hashtags. The Young Swedish Democrats slogan <a href=\"https://www.youtube.com/watch?v=VR-lAGj_dlQ\">“Europe Belongs to Us”</a> is remarkably stirring. So, I would suggest that white nationalists use hashtags such as #WhiteAmerica, #WhiteWest, and #Whatifwewon, combined with positive imagery, if they want to gain more traction among those who value Western civilization and find white people attractive. Another option would be #WAGA, or White America Great America, which would be an effective spinoff of the Trumpean #MAGA.</p><p>Now, I think self-identified white nationalists have a challenge in front of them, in that only in America does a singular “white nationalism” really mean anything; in Europe the various white nationalisms are entirely distinct, and indeed, this is part of the problem that the many American Indian nations failed to surmount. That is why they would do well to endorse all nationalisms from America to Zion; I am an avowed Red Nationalist myself, and I suspect even the most rabid white nationalist has no problem with sovereign Indian reservations.</p><p>It is hard, after all, to argue with “France for the French, Israel for the Jews, America for the Americans.” The globalists can only win – assuming that is even possible, which it probably isn’t – if the various nationalists fail to ally against them. That is why “nationalism” is such a scary word to them, whereas they love nothing better than to accuse people of “white nationalism” or “white supremacy”.</p><p>The dank memes are important too, of course, and that is where the “Immigration is Rape Culture” sort of attacks are effective. But they are most effective when they attack undesirable consequences rather than specific groups of people. In general, when it comes to rhetoric, it is best to be direct in defense, indirect in attack. Consider how #GamerGate seldom aimed memes at Gawker or Kotaku or Polygon, but at the lack of ethics in game journalism, which everyone knew applied to Gawker, Kotaku, and Polygon.</p><p>White people have the unalienable right to live in white societies if they so choose. That right is called free association, and diversity, multiculturalism, and immigration are all anti-Constitutional, anti-American attacks on that. As an American Indian, I hope enough of them are wise enough to exercise that right before they, too, are forced upon their own Trail of Tears amidst the shattered remnants of Western Civilization.</p><p>If you want to learn more about the difference between dialectic and rhetoric, and how to make effective use of the latter, I strongly recommend reading my book <a href=\"http://www.amazon.com/gp/product/B014GMBUR4/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B014GMBUR4&amp;linkCode=as2&amp;tag=voxpop06-20&amp;linkId=RDJ6CQEKDJ5KKEL7\"><i><b>SJWs Always Lie: Taking Down the Thought Police</b></i></a>. It has an entire chapter devoted to the subject.</p></div>",
  "content_text": "The objectives of the white nationalists behind the #whitegenocide meme are laudable. They seek to defend the right of people of European descent to live, to maintain European cultures, and to preserve European nations. They seek to demonstrate that diversity is intrinsically anti-European. These are all very good, desirable, and for those of us who value Western civilization, true and\nnecessary\ngoals. Western civilization is a European construct.\nBut the #whitegenocide meme simply does not achieve its purpose, it does not work, because it is a misguided attempt to use dialectic in the place of rhetoric. This is obvious, because those who use that particular meme are always – always – having to rationally explain and justify it. And it can be justified rationally, at least to those with a reasonable grasp of history and sufficiently long time preferences. But that doesn’t make it good rhetoric.\nAs those who have read SJWAL know, the fact that something can be rationally justified is not only an entirely different question than whether something is rhetorically effective, it is a very strong indicator that the meme in question is not rhetorically effective due to the fact that it is clearly not rhetoric at all. One does not persuade the emotions through the use of logic.\nWhen people think of “genocide”, of what do they think? What is the one single word that immediately springs to mind when someone says “genocide” to you? It’s not “Holocaust”, it’s not “Jews”, it’s not “Rwanda”, it is “bodies”. We are all programmed to think of stacks of bodies, limp and scrawny and robbed of all dignity, when we hear the word “genocide”.\nWell, where are the white bodies? They don’t exist. So, to make the connection between the term “genocide” and the serious problem of the 50-year assault on the various European nations and cultures requires an abstract leap, and what is worse, an abstract leap that ignores the instinctive emotional connection. So, #whitegenocide fails because it is not rhetoric at all, it is pure dialectic that predictably fails to move the emotions.\nContrast, in comparison, this ad for\nThe Man in the High Castle\nwhich was quickly pulled because it was inadvertently serving as effective propaganda for the very ideas and peoples it was attempting to denigrate. It was run with the hashtag #whatifwelost.\nWhat if we lost? That snapshot of a supposedly scary future looks like a\nconsiderable\nimprovement on 21st century America, in which single white mothers raise irreligious, low-IQ, racially-mixed bastards in tenements without support from the children’s fathers, most people are up to their eyeballs in debt with less than $400 in savings, no one under the age of 40 can afford to buy a home, and it is illegal to fly the American flag lest it harm the tender sensibilities of young Aztec invaders.\nRemember, the best rhetoric is based on truth. In this case, the effectiveness was rooted in the truths being communicated emotionally regardless of what the creator’s intentions were. With the rise of tribal politics, the Alt Right, and Trump shattering the Overton Window, something that looks very much like that, less the swastikas, will be a\nsuccessful\ncampaign ad within a decade.\nAs #GamerGate has demonstrated, the best memes are visual rather than verbal and they appeal to the emotions rather than to the intellect. They should be positive rather than negative, radiating confidence and certainty rather than fear and doubt. Some of the best memes I’ve seen are those produced by female white nationalists, which tend to feature pretty blonde white women in traditional dresses with white children; women respond to them with either palpable longing or instinctive rage.\nThe exact terminology doesn’t matter. Both #GamerGate and #NotYourShield were successful hashtags. The Young Swedish Democrats slogan\n“Europe Belongs to Us”\nis remarkably stirring. So, I would suggest that white nationalists use hashtags such as #WhiteAmerica, #WhiteWest, and #Whatifwewon, combined with positive imagery, if they want to gain more traction among those who value Western civilization and find white people attractive. Another option would be #WAGA, or White America Great America, which would be an effective spinoff of the Trumpean #MAGA.\nNow, I think self-identified white nationalists have a challenge in front of them, in that only in America does a singular “white nationalism” really mean anything; in Europe the various white nationalisms are entirely distinct, and indeed, this is part of the problem that the many American Indian nations failed to surmount. That is why they would do well to endorse all nationalisms from America to Zion; I am an avowed Red Nationalist myself, and I suspect even the most rabid white nationalist has no problem with sovereign Indian reservations.\nIt is hard, after all, to argue with “France for the French, Israel for the Jews, America for the Americans.” The globalists can only win – assuming that is even possible, which it probably isn’t – if the various nationalists fail to ally against them. That is why “nationalism” is such a scary word to them, whereas they love nothing better than to accuse people of “white nationalism” or “white supremacy”.\nThe dank memes are important too, of course, and that is where the “Immigration is Rape Culture” sort of attacks are effective. But they are most effective when they attack undesirable consequences rather than specific groups of people. In general, when it comes to rhetoric, it is best to be direct in defense, indirect in attack. Consider how #GamerGate seldom aimed memes at Gawker or Kotaku or Polygon, but at the lack of ethics in game journalism, which everyone knew applied to Gawker, Kotaku, and Polygon.\nWhite people have the unalienable right to live in white societies if they so choose. That right is called free association, and diversity, multiculturalism, and immigration are all anti-Constitutional, anti-American attacks on that. As an American Indian, I hope enough of them are wise enough to exercise that right before they, too, are forced upon their own Trail of Tears amidst the shattered remnants of Western Civilization.\nIf you want to learn more about the difference between dialectic and rhetoric, and how to make effective use of the latter, I strongly recommend reading my book\nSJWs Always Lie: Taking Down the Thought Police\n. It has an entire chapter devoted to the subject.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-10T11:00:00+00:00"
}