{
  "url": "https://voxday.net/2016/05/10/wrath-of-rabid/",
  "scraped_at": "2025-12-17T17:57:11.016464",
  "title": "Wrath of the Rabid",
  "date_display": "May 10, 2016",
  "date_iso": "2016-05-10T15:00:00+00:00",
  "date_from_url": "2016-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hugos Vs Puppies IV: <a href=\"https://www.lewrockwell.com/2016/05/allan-davis/wrath-rabid/\">Wrath of the Rabid</a></p><blockquote class=\"tr_bq\"><p> Mere minutes after the nominations were announced, John Scalzi said that the Puppies were attempting to lead a parade that was already in motion, by nominating works of obvious quality that probably would have been nominated anyway.  George R. R. Martin made a similar observation:</p><p><i>    The Rabids used a new tactic this year. They nominated legitimate, quality works in addition to the dross. Works by writers like Stephen King, Neil Gaiman, Neal Stephenson, Alastair Reynolds,…Andy Weir, and several others. Some of these writers are apolitical (like Weir) while others are known to oppose everything that VD stands for (Gaiman, Stephenson, King).</i></p><p>This is a tacit admission that the Puppies are doing exactly what they claim to be doing–nominating “legitimate, quality works” based on “excellence in actual science fiction and fantasy,” regardless of the political stance of the nominated writer.</p><p>And while the bulk of the nominations are obviously for deserving works–Stephen King received his first nomination for over thirty years–several of them are…unique.</p><p>Two<br> Best Related Work nominations, however, are generally being overlooked<br> in the furor over My Little Ponies (and Chuck Tingle’s gay dinosaur<br> erotica in space), and those are much more problematic.  “The Story of<br> Moira Greyland” outs fantasy writer Marion Zimmer Bradley for abuse and<br> molestation, and “Safe Space as Rape Room” by Daniel Eness raises some<br> very uncomfortable questions about science fiction fandom.</br></br></br></br></br></br></p></blockquote><p>Uncomfortable questions indeed. Questions which pedophandom is desperate to avoid asking, or being answered.</p></div>",
  "content_text": "Hugos Vs Puppies IV:\nWrath of the Rabid\nMere minutes after the nominations were announced, John Scalzi said that the Puppies were attempting to lead a parade that was already in motion, by nominating works of obvious quality that probably would have been nominated anyway.  George R. R. Martin made a similar observation:\nThe Rabids used a new tactic this year. They nominated legitimate, quality works in addition to the dross. Works by writers like Stephen King, Neil Gaiman, Neal Stephenson, Alastair Reynolds,…Andy Weir, and several others. Some of these writers are apolitical (like Weir) while others are known to oppose everything that VD stands for (Gaiman, Stephenson, King).\nThis is a tacit admission that the Puppies are doing exactly what they claim to be doing–nominating “legitimate, quality works” based on “excellence in actual science fiction and fantasy,” regardless of the political stance of the nominated writer.\nAnd while the bulk of the nominations are obviously for deserving works–Stephen King received his first nomination for over thirty years–several of them are…unique.\nTwo\nBest Related Work nominations, however, are generally being overlooked\nin the furor over My Little Ponies (and Chuck Tingle’s gay dinosaur\nerotica in space), and those are much more problematic.  “The Story of\nMoira Greyland” outs fantasy writer Marion Zimmer Bradley for abuse and\nmolestation, and “Safe Space as Rape Room” by Daniel Eness raises some\nvery uncomfortable questions about science fiction fandom.\nUncomfortable questions indeed. Questions which pedophandom is desperate to avoid asking, or being answered.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-05-10T14:00:00+00:00"
}