{
  "url": "https://voxday.net/2006/02/02/called-ou/",
  "scraped_at": "2026-01-08T20:57:49.074888",
  "title": "Called out",
  "date_display": "February 2, 2006",
  "date_iso": "2006-02-02T14:48:00+00:00",
  "date_from_url": "2006-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joe Carter of the Evangelical Outpost <a href=\"http://www.evangelicaloutpost.com/archives/001813.html#more\">reflects on my answer to his question about blackmail</a>:</p><blockquote><p>How can blackmail be considered a sin that should not also be classified as a crime?</p><p>When I posed this question the first time I blackmailed these libertarians by threatening to expose their “dirty little secrets” unless they provided a quick response. Because they all answered the question, the compromising photos were returned to the safety deposit box. The following is a brief summation of their responses, though I recommend reading their posts in their entirety…</p><p>Vox’s response, contra Josh, is that to ban blackmail is to necessarily engage in “thought-policing” since it is the intentions, rather than the actions, which are being judged.  Your intention is to buy my silence; you are operating under the assumption that I intend to inform others if you do not pay. Blackmail is therefore inherently a thought crime since if it occurs, no action has actually been taken by the blackmailer.</p><p>As for the Christian side of the equation, he argues that “exposure is a virtuous act under Biblical principles, it cannot and should not be viewed as something negative, much less as the basis for a crime.” Exposing HS would, under Vox’s view, be a virtuous act.</p><p>All three are intriguing, though I think they all ultimately fail to be convincing. Josh’s appeal to the “right” to be free from forced labor appears to stretch the definition of both “forced” and “labor” in an attempt to cover blackmail. Under this application, moral suasion could also be deemed as “forced labor” if I try to convince a person that they should change their mind about an issue. Also, as Vox argues, blackmail laws allow the State to step on a person’s rights of privacy and freedom from forced labor.</p><p>I don’t think that Vox’s reason, however, is any sounder than that provided by Josh. If blackmail should not be criminalized because it is simply a “thought crime”, then we should also decriminalize all other forms of threat. Using this logic we could not arrest anyone for simply threatening to commit murder, they would have to actually commit an actual “physical” act (as opposed to a mental one) first. Does libertarianism really argue that the strong have an inherent political right to intimidate the weak?</p><p>The underlying problem with all three defenses appears to be how we apply the libertarian conception of “freedom.” In his excellent rebuttal to these original posts, Jeremy Pierce includes this insightful paragraph:</p><p>This is a real conflict in libertarian political thought, because it seems that anyone’s freedom will almost certainly end up restricting someone else’s. So when you try to figure out which freedoms you’re going to restrict, you have to decide it based on some factor other than the pure value of freedom, because freedom is what’s creating the conflict. We need a choice between freedoms, in particular between the freedom of one person and the freedom of another. Libertarians argue against slavery on the grounds that it’s an uncontroversial case of one person’s freedom restricting another’s, but isn’t the same sort of thing going on in all kinds of other social relationships?</p></blockquote><p>I will let Josh and John defend their own arguments; they’re certainly capable of doing so without my help.  The answer to Joe’s first rhetorical question is simple: since there are no shortage of sins that are not crimes (adultery) and crimes that are not sins (downloading a pirate MP3), it is not difficult to theorize that blackmail COULD be sinful without being criminal.</p><p>The first problem with Joe’s critique is that he equates the threat of committing a legal and virtuous act – letting the truth be publicly known – with the threat of committing an illegal and immoral one.  (Leave the question of gossip aside for now.)  I should think that to argue that a “threat” to buy an apple is in any way equivalent to making a threat to murder someone is an obvious <em>reductio ad absurdum</em>, and therefore obviously erroneous.</p><p>More later.</p></div>",
  "content_text": "Joe Carter of the Evangelical Outpost\nreflects on my answer to his question about blackmail\n:\nHow can blackmail be considered a sin that should not also be classified as a crime?\nWhen I posed this question the first time I blackmailed these libertarians by threatening to expose their “dirty little secrets” unless they provided a quick response. Because they all answered the question, the compromising photos were returned to the safety deposit box. The following is a brief summation of their responses, though I recommend reading their posts in their entirety…\nVox’s response, contra Josh, is that to ban blackmail is to necessarily engage in “thought-policing” since it is the intentions, rather than the actions, which are being judged.  Your intention is to buy my silence; you are operating under the assumption that I intend to inform others if you do not pay. Blackmail is therefore inherently a thought crime since if it occurs, no action has actually been taken by the blackmailer.\nAs for the Christian side of the equation, he argues that “exposure is a virtuous act under Biblical principles, it cannot and should not be viewed as something negative, much less as the basis for a crime.” Exposing HS would, under Vox’s view, be a virtuous act.\nAll three are intriguing, though I think they all ultimately fail to be convincing. Josh’s appeal to the “right” to be free from forced labor appears to stretch the definition of both “forced” and “labor” in an attempt to cover blackmail. Under this application, moral suasion could also be deemed as “forced labor” if I try to convince a person that they should change their mind about an issue. Also, as Vox argues, blackmail laws allow the State to step on a person’s rights of privacy and freedom from forced labor.\nI don’t think that Vox’s reason, however, is any sounder than that provided by Josh. If blackmail should not be criminalized because it is simply a “thought crime”, then we should also decriminalize all other forms of threat. Using this logic we could not arrest anyone for simply threatening to commit murder, they would have to actually commit an actual “physical” act (as opposed to a mental one) first. Does libertarianism really argue that the strong have an inherent political right to intimidate the weak?\nThe underlying problem with all three defenses appears to be how we apply the libertarian conception of “freedom.” In his excellent rebuttal to these original posts, Jeremy Pierce includes this insightful paragraph:\nThis is a real conflict in libertarian political thought, because it seems that anyone’s freedom will almost certainly end up restricting someone else’s. So when you try to figure out which freedoms you’re going to restrict, you have to decide it based on some factor other than the pure value of freedom, because freedom is what’s creating the conflict. We need a choice between freedoms, in particular between the freedom of one person and the freedom of another. Libertarians argue against slavery on the grounds that it’s an uncontroversial case of one person’s freedom restricting another’s, but isn’t the same sort of thing going on in all kinds of other social relationships?\nI will let Josh and John defend their own arguments; they’re certainly capable of doing so without my help.  The answer to Joe’s first rhetorical question is simple: since there are no shortage of sins that are not crimes (adultery) and crimes that are not sins (downloading a pirate MP3), it is not difficult to theorize that blackmail COULD be sinful without being criminal.\nThe first problem with Joe’s critique is that he equates the threat of committing a legal and virtuous act – letting the truth be publicly known – with the threat of committing an illegal and immoral one.  (Leave the question of gossip aside for now.)  I should think that to argue that a “threat” to buy an apple is in any way equivalent to making a threat to murder someone is an obvious\nreductio ad absurdum\n, and therefore obviously erroneous.\nMore later.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-02T14:48:00+00:00"
}