{
  "url": "https://voxday.net/2006/02/12/debating-war-drums/",
  "scraped_at": "2026-01-08T20:58:38.916592",
  "title": "Debating the war drums",
  "date_display": "February 12, 2006",
  "date_iso": "2006-02-12T19:24:00+00:00",
  "date_from_url": "2006-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Naron brings <a href=\"http://www.rightnation.us/forums/index.php?showtopic=96682\">an active debate to our attention</a>.  It’s pretty interesting, actually, if not unplagued by the same sort of thoughtless reactions that have infested the comments here of late.  I did find it somewhat amusing that some conservatives were so quick to accuse me of leftism for not blindly accepting the Dear Leader’s assertion that Iran is not only Hitler, but an imminent threat to the existence of <s>Israel</s> the United States.</p><p>For the record, I have never stated that I believe Iran’s pursuit of nuclear power is peaceful.  I don’t believe that at all.  I merely believe that it is not only impractical, but impossible, to prevent any nation or organization with sufficient resources from acquiring nuclear weapons, because, as Carroll Quigley so astutely predicted several decades ago, this is part of the age-old pattern of the development and spread of military technology.</p></div>",
  "content_text": "Chris Naron brings\nan active debate to our attention\n.  It’s pretty interesting, actually, if not unplagued by the same sort of thoughtless reactions that have infested the comments here of late.  I did find it somewhat amusing that some conservatives were so quick to accuse me of leftism for not blindly accepting the Dear Leader’s assertion that Iran is not only Hitler, but an imminent threat to the existence of\nIsrael\nthe United States.\nFor the record, I have never stated that I believe Iran’s pursuit of nuclear power is peaceful.  I don’t believe that at all.  I merely believe that it is not only impractical, but impossible, to prevent any nation or organization with sufficient resources from acquiring nuclear weapons, because, as Carroll Quigley so astutely predicted several decades ago, this is part of the age-old pattern of the development and spread of military technology.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-12T19:24:00+00:00"
}