{
  "url": "https://voxday.net/2006/02/21/i-think-im-in-love/",
  "scraped_at": "2026-01-08T20:59:46.270266",
  "title": "I think I’m in love",
  "date_display": "February 21, 2006",
  "date_iso": "2006-02-21T20:46:00+00:00",
  "date_from_url": "2006-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always resist upgrading utilities which are perfectly functional.  So, I’ve been ignoring Adobe’s blandishments ever since installing version 5.1 of its Reader on The Beast.  They caught me in a weak moment, however, and I inadvertantly upgraded to version 7.0.</p><p>It’s a pig, about five times larger than its predecessor, it managed to screw up opening automatically from Opera and about the only thing I noticed immediately were the <em>vital</em> XP-style icons.  Of course, they’ve moved things around, too, so I have to think about what is where.</p><p>But all these sins are forgiven, not because it wasn’t hard to fix the file associations, but because <em>Adobe Reader now exports PDF to raw text</em>!  Of course, it probably did this 1.5 versions ago, but since no one bothered to tell me, I’m telling you.  I’ll be busy for the next few weeks, of course, converting all those annoying PDF-format ebooks to PDB format for use on my dear, darling Treo.</p><p>So, make me wait, Mr. Department of Transportation Bureaucrat.  Force me to stand in line, Miss Bank Teller.  Take your time, Ms Seating Hostess.  I scoff at your paltry powers, for lo, though I walk through the valley of the shadow of tedium, I shall fear no boredom, for a one-gigabyte library is in my freaking pocket!</p></div>",
  "content_text": "I always resist upgrading utilities which are perfectly functional.  So, I’ve been ignoring Adobe’s blandishments ever since installing version 5.1 of its Reader on The Beast.  They caught me in a weak moment, however, and I inadvertantly upgraded to version 7.0.\nIt’s a pig, about five times larger than its predecessor, it managed to screw up opening automatically from Opera and about the only thing I noticed immediately were the\nvital\nXP-style icons.  Of course, they’ve moved things around, too, so I have to think about what is where.\nBut all these sins are forgiven, not because it wasn’t hard to fix the file associations, but because\nAdobe Reader now exports PDF to raw text\n!  Of course, it probably did this 1.5 versions ago, but since no one bothered to tell me, I’m telling you.  I’ll be busy for the next few weeks, of course, converting all those annoying PDF-format ebooks to PDB format for use on my dear, darling Treo.\nSo, make me wait, Mr. Department of Transportation Bureaucrat.  Force me to stand in line, Miss Bank Teller.  Take your time, Ms Seating Hostess.  I scoff at your paltry powers, for lo, though I walk through the valley of the shadow of tedium, I shall fear no boredom, for a one-gigabyte library is in my freaking pocket!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-21T20:46:00+00:00"
}