{
  "url": "https://voxday.net/2006/02/23/mailvox-more-on-air-war/",
  "scraped_at": "2026-01-08T21:00:05.421720",
  "title": "Mailvox: more on the air war",
  "date_display": "February 23, 2006",
  "date_iso": "2006-02-23T19:30:00+00:00",
  "date_from_url": "2006-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PC also takes exception:</p><blockquote><p>While are usually right on target and use logic to an extent I find amazing in most of your writing, I cannot agree with your analysis regarding air power and it’s use (2-20-06). In fact you remind me of the arguments used agains Gen. Billy Mitchell an advocate of air power who consistently proved his critics wrong. Do not confuse advanced analytical ability with pragmatical military assesments of who can be killed or destroyed by airpower!</p><p>First, our military is stretched thin, and the base closings and military cutbacks suggest something more sinister than what is being acknowledged, this is something you should examine more closely.</p></blockquote><p>I have wondered if there is a desire to stretch the US military thin and exhaust it, especially considering the help provided to the Chinese military by some of those responsible for the aforementioned stretching.</p><blockquote><p>Secondly, historically Arab and Persian armies have never been consistently viewed as sucessful against determined and well-armed western armies.</p></blockquote><p>Never is too strong a word there.  Arab armies conquered Spain, Suleiman I conquered Hungary in 1526 and very nearly took Vienna in 1529.  And while the US military is certainly well-armed, I don’t think it can be described as “determined” given how casualty-shy it is.  Certainly the American people are far from determined; most don’t consider that there is a war going on judging by the way they live.</p><blockquote><p>Thirdly, your under-evaluation of airpower is selectively untrue. Your historical examples are one sided and do not support the facts. Goering could not bomb England into submission as Germany never had a operational “heavy” bomber.</p></blockquote><p>That didn’t stop him from claiming he could.  One might as easily say that the USAF can’t bomb Iran into submission because it lacks an operational [fill-in-the-blank].  It is entirely possible – I would say highly probable – that those who say that it can are making the same mistake Goering did.</p><blockquote><p>Fourthly, North Vietnam lost three and a half million people primarily to bombing not counting seriously maimed and wounded. This hardly can be described as “not retarding their economic development”. Somebody BS’ed you!</p></blockquote><p>It seems that you didn’t read the study, which looked at the economic development of those regions that were bombed compared to those which weren’t.  It was surprising to find that there was no difference, except that in some cases, those areas that were bombed heavily were actually somewhat ahead of areas that were left unharmed.  Since North Vietnam was not a consumer-driven economy, the loss of potential consumers clearly didn’t affect them too much… and of course, they weren’t exactly at the top of the development curve in the first place.</p><blockquote><p>Fifthly, you are correct about German aircraft industry increasing throughout the war, primarily due to underground factories. Too bad there was no gas to fly them with, or experienced pilots to fly them! That was due to allied bombing. If you do not believe allied bombing in WWII was effective, interview a survivor of Dresden, if you can find one! Conversely, Japan’s aircraft industry was destroyed, along with it’s cities! Talk to the old bomber crews who could smell the burning human flesh at 20,000 feet above!</p></blockquote><p>Dresden killed a lot of people, it didn’t make one bit of difference with regards to ending the war.  Hitler shooting himself, on the other hand, did.  As for the lack of gas, the complete naval blockade by the Royal Navy had rather more to do with that.  The Allied Air Forces were tasked with destroying German military production – you can read the estimates of their ability to do so in AWPD-1 and AWPD-42 – and they completely failed in their objectives.  While the air force did do an excellent job of establishing air supremacy, that was the fighter jocks shooting them down one-by-one, it was not the strategic bombing campaign.</p><blockquote><p>I believe that a precision bombing campaign against Iran’s nuclear facilities would only be partially successful. Some are underground I believe. Others are hidden. This calls for “boots on the ground” (something most Americans may be against).</p></blockquote><p>I agree.  That’s pretty much my point, actually.  I would add that “partially successful” is the best we could hope for, and that we’d be opening a can of worms in doing so.</p><blockquote><p>However, Terhan Valley is particularly well suited to the use of a very large and dirty hydrogen warhead. Things are probably still on the table. Your assesments on this particular matter are shallow to say the least, regarding bombing capabilities. Your military knowledge is below par, compared to your brilliant analysis in other areas. When you rush, you get sloppy. I would say, slow down and talk to some good mainline military analysts before drawing intellectual conclusions on badly selected<br>paradiams. McNamara used to do that all the time in Vietnam! Generally, I really like your column.</br></p></blockquote><p>What makes you think I haven’t?  Of course, most of my sources are in the USMC and the US Navy, so it’s hardly surprising that I would look on the advocates of air power and their claims with a somewhat jaundiced eye.  But, as I have repeatedly stated, the gap between air power claims and air power results is very, very big if you take the time to examine the pre-war claims and the measurable post-war results.  Cherrypicking the past objectives and applying a little bait-and-switch in hindsight are only confusing to those unfamiliar with the pre-war claims.</p></div>",
  "content_text": "PC also takes exception:\nWhile are usually right on target and use logic to an extent I find amazing in most of your writing, I cannot agree with your analysis regarding air power and it’s use (2-20-06). In fact you remind me of the arguments used agains Gen. Billy Mitchell an advocate of air power who consistently proved his critics wrong. Do not confuse advanced analytical ability with pragmatical military assesments of who can be killed or destroyed by airpower!\nFirst, our military is stretched thin, and the base closings and military cutbacks suggest something more sinister than what is being acknowledged, this is something you should examine more closely.\nI have wondered if there is a desire to stretch the US military thin and exhaust it, especially considering the help provided to the Chinese military by some of those responsible for the aforementioned stretching.\nSecondly, historically Arab and Persian armies have never been consistently viewed as sucessful against determined and well-armed western armies.\nNever is too strong a word there.  Arab armies conquered Spain, Suleiman I conquered Hungary in 1526 and very nearly took Vienna in 1529.  And while the US military is certainly well-armed, I don’t think it can be described as “determined” given how casualty-shy it is.  Certainly the American people are far from determined; most don’t consider that there is a war going on judging by the way they live.\nThirdly, your under-evaluation of airpower is selectively untrue. Your historical examples are one sided and do not support the facts. Goering could not bomb England into submission as Germany never had a operational “heavy” bomber.\nThat didn’t stop him from claiming he could.  One might as easily say that the USAF can’t bomb Iran into submission because it lacks an operational [fill-in-the-blank].  It is entirely possible – I would say highly probable – that those who say that it can are making the same mistake Goering did.\nFourthly, North Vietnam lost three and a half million people primarily to bombing not counting seriously maimed and wounded. This hardly can be described as “not retarding their economic development”. Somebody BS’ed you!\nIt seems that you didn’t read the study, which looked at the economic development of those regions that were bombed compared to those which weren’t.  It was surprising to find that there was no difference, except that in some cases, those areas that were bombed heavily were actually somewhat ahead of areas that were left unharmed.  Since North Vietnam was not a consumer-driven economy, the loss of potential consumers clearly didn’t affect them too much… and of course, they weren’t exactly at the top of the development curve in the first place.\nFifthly, you are correct about German aircraft industry increasing throughout the war, primarily due to underground factories. Too bad there was no gas to fly them with, or experienced pilots to fly them! That was due to allied bombing. If you do not believe allied bombing in WWII was effective, interview a survivor of Dresden, if you can find one! Conversely, Japan’s aircraft industry was destroyed, along with it’s cities! Talk to the old bomber crews who could smell the burning human flesh at 20,000 feet above!\nDresden killed a lot of people, it didn’t make one bit of difference with regards to ending the war.  Hitler shooting himself, on the other hand, did.  As for the lack of gas, the complete naval blockade by the Royal Navy had rather more to do with that.  The Allied Air Forces were tasked with destroying German military production – you can read the estimates of their ability to do so in AWPD-1 and AWPD-42 – and they completely failed in their objectives.  While the air force did do an excellent job of establishing air supremacy, that was the fighter jocks shooting them down one-by-one, it was not the strategic bombing campaign.\nI believe that a precision bombing campaign against Iran’s nuclear facilities would only be partially successful. Some are underground I believe. Others are hidden. This calls for “boots on the ground” (something most Americans may be against).\nI agree.  That’s pretty much my point, actually.  I would add that “partially successful” is the best we could hope for, and that we’d be opening a can of worms in doing so.\nHowever, Terhan Valley is particularly well suited to the use of a very large and dirty hydrogen warhead. Things are probably still on the table. Your assesments on this particular matter are shallow to say the least, regarding bombing capabilities. Your military knowledge is below par, compared to your brilliant analysis in other areas. When you rush, you get sloppy. I would say, slow down and talk to some good mainline military analysts before drawing intellectual conclusions on badly selected\nparadiams. McNamara used to do that all the time in Vietnam! Generally, I really like your column.\nWhat makes you think I haven’t?  Of course, most of my sources are in the USMC and the US Navy, so it’s hardly surprising that I would look on the advocates of air power and their claims with a somewhat jaundiced eye.  But, as I have repeatedly stated, the gap between air power claims and air power results is very, very big if you take the time to examine the pre-war claims and the measurable post-war results.  Cherrypicking the past objectives and applying a little bait-and-switch in hindsight are only confusing to those unfamiliar with the pre-war claims.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-23T19:30:00+00:00"
}