{
  "url": "https://voxday.net/2006/02/21/mailvox-air-power-and-winning-wars/",
  "scraped_at": "2026-01-08T20:59:42.611719",
  "title": "Mailvox: air power and winning wars",
  "date_display": "February 21, 2006",
  "date_iso": "2006-02-21T10:55:00+00:00",
  "date_from_url": "2006-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AW has more than a few things to say:</p><blockquote><p>I appreciate your well thought articles and insight into a wide variety of subjects, and will continue to read anything you write. Once in a great while, I disagree but understand your perspective and position, and have learned to look at some issues differently. I figured I’d send you an email on your recent article (Air power and low probability). I was dismayed at your criticisms which were taken by me as being selective and one sided.</p><p>I was, for ten years, a US Army intelligence analyst from 1991 to 2000, with a primary training targeting Korean Ground Forces, but also specializing against Irregular Warfare, such as that we see happening in Iraq and Afganistan. My period of service additionallyinvolved me in the critical actions of our service actions in Bosnia and Kosovo, as well as other less known hot spots.</p><p>I was taken by your recalling the common military dictum tat airpower does not win a war, particularly your writing that ‘the history of strategic bombing is a history of complete failure’. I was also put out that you preferred to reach back to WWII and Vietnam, and criticized the air war v. Serbia for Kosovo.</p><p>First, air power does not win a war… alone. Nor do ground and naval forces… alone. Although I recall many missions in WWII were unsuccessful from the strategic stand, as you pointed out, from another position the attacks tore out the will to continue from a major portion of Germany’s society. Dresden comes to mind. Massive use of air was still in its infancy. To measure actions then to actions now as equal is foolish. Technology, target intelligence collection, force application, and knowledge gained through lessons learned from past air application make that air so much more deadly it is not measurable against WWII actions. It is absurd – like stating the use of a bicycle is equivalent to a Porsche 959 because they both have wheels, breaks, they go forward and stop – so the 959 will provide no better results than the bicycle.</p></blockquote><p>This misses the point, however, which is not that the Air Force cannot deliver significantly more explosive power in a significantly more precise manner than in WWII, but that there is no reason to believe that the gap between promised capability and actual results has been significantly reduced.  The results in all of the various past conflicts mentioned were massively short of what had been promised by the advocates of air power.  This trend seems quite likely to continue, indeed, until the air forces of the world demonstrate otherwise, it is the most logical position.</p><blockquote><p>Vietnam is completely non-contextual, having been a ‘low intensity’ war having nearly non-existent heavy industrial production sites, and receiving the bulk of its weapons and war material from Russia and China. It was a completely different war from WWII, as the US had to learn a different way to use air in support of ground, more tactically than strategically. Or political position at that time was restricted, and not Total War. If our government had supported Total War, we would have crippled the sources and severely impact the weapon production side of the Vietnam conflict – by attacking those production sites in China and USSR. That conflict, by political choice, became a Battalion-Company level conflict war-of-will, decided man-to-man, and required a inner commitment to<br>win US soldiers as a collective did not have, that our South Vietnam allies would not learn, and the North Vietnamese forces were infused down to their souls. In short, only one participant was willing to kill and die to win – and those were the guys that were going to win no matter what technology or weapons were tossed at them, as much as because of their convictions as our own.</br></p></blockquote><p>I find it difficult to believe that the Iranian people are any less willing to fight and absorb tremendous casualties than they were during the Iran-Iraq war when they took over a million casualties.  Is there any reason we should assume they aren’t?</p><blockquote><p>You mention Serbia, 78-days of air strikes. I helped manage those actions, and regardless of the press, those strikes were devastating and tore the will to fight out of the Serbian military and civilians. It culminated in the last major strike, B52s on Mount Pastric, the action which caused such a complete morale failure that it destabilized the Milosovic government and provoked the withdrawal Serb forces three days later. I point out Milosovic, and his party, are no longer running Serbia or making trouble with their neighbors or minorities.</p></blockquote><p>My understanding is that it was the threat of Russian ground forces that caused the Serbs to withdraw, not the air strikes which did not seriously degrade the Serbian military.  In any event, the stated purpose of the air war was to prevent the ethnic cleansing of Kosovo; it is now known that it not only did not prevent this, but stepped up the pace of it.  Given that the air war ended on 20 June, 1999, and Milosovic did not step down until losing a national election in September, 2000, this strikes me as very dubious assertion of cause-and-effect.</p><blockquote><p>Finally, 45 days or so of hammering Iraqi forces as well as military and civil sites prepared the collapse of the Iraqi military – as it did in the first Gulf Conflict. The same with Afghanistan.</p><p>In contemporary war, you find the enemy’s rally and supply points, food, ammunition, maintenance parts, fuel and water sources, and you eradicate them. This while you cause them to live with little sleep and numbing fear, in the knowledge they are impotent against an unending air assault. You use every means you can to destroy the will to fight, as our political or military will was destroyed in Korea, Vietnam, and Somalia.</p></blockquote><p>I have never argued that air power is anything but a vital tactical element in winning a war.  The point is that a war fought only by air cannot be won without using nuclear weapons.  Very, very few of the commentators currently calling for war with Iran are contemplating all-out invasion, they are operating under what I consider to be the delusion that Iran’s nuclear program can be stopped and its regime overturned with nothing more than air strikes and special forces.</p><blockquote><p>If, God forbid, we fight anywhere again, including Iran, you may be assured that if both our political and military will are committed to the action, the historical key component will be a massive conventional air action in the month prior to any ground deployment. What happens after is debatable.</p><p>There are three levels in modern day diplomacy driven conflict. For Iran, if the purpose of a potential conflict with is the elimination of nuclear related sites, the United States will be effective and accomplish its end purpose, by hammering those sites with air and missile strikes. If the US seeks to force a government change, the present Iranian administration and offices are targeted. If it is desired to force a cultural change (Western style Democracy, or a shadow thereof), it will have to be a deployment ground forces and accompanying casualties. I’m thinking the present administration would be positively inclined to do the first, a toss up on the second, and a distant possibility on the third.</p><p>So, air will be a critical tool, probably the primary tool, and maybe the only tool, of armed diplomacy to get what we desire. Further, it will be massively effective, as I have described it has been in the most recent conflicts.</p></blockquote><p>Obviously, I disagree.  It appears that we may get the chance to find out.  If I am wrong, I will certainly concede the point.  I wouldn’t mind being wrong at all, as the alternatives are rather ugly.</p><blockquote><p>As far as a more homogeneous political structure than Iraq making it difficult to act in Iran, I would point out that there are always groups of people at odds with each<br> other to fill a vacuum. Should the head be cut off in Iran, there is no doubt it will be the same. Things fall apart everywhere without leadership – add food rationing, no electricity or clean water, lack of food and a crippled economy and chaos and dependency are guaranteed. Somehow, I think that if a government is too busy trying to keep itself functioning and feeding its military and people, it’ll be much more difficult to cause mischief building nukes.</br></p></blockquote><p>The North Korean example should suffice to dismiss this.</p><blockquote><p>Nearly every discussion of Iran invariably uses Iraq as a point. I have great disdain for those who<br>continue to criticize our present position in Iraq, and use it for demagoguery or self-promotion, and to position themselves in a manner as to demean our forces and government, regardless of which political party runs the US. Especially if they have no experience in military matters (‘any man who in the interests of the commonwealth feels confident that he can give me good advice in the war which I am to conduct, let him not refuse to help his country, but go with me to Macedonia’). Some things, if you believe they will better you or your friends or the world, must be done. And those who criticize with bias rather than act with knowledge are fools.</br></p><p>My simple observation is this: there are 24 million Iraqis, and about 250,000 coalition forces. If<br>one-tenth (2.4 million) of the Iraqis really didn’t want anyone on their soil, they’d bury us under a pile of stones, and they wouldn’t give a damn about our tanks, air power, or whatever. It is apparent that probably one percent of the population is willing to act in a manner to make it hard for the new government and our forces, and probably only one percent of those rabble rousers are willing to conduct direct action.</br></p></blockquote><p>One need not be a military expert to remember what the actual military experts and politicians were saying previously, and comparing it to what they are saying after the shooting starts.  The Iraqi occupation has not been a cakewalk, the fact that the occupying forces are still being killed on a daily basis three years later shows that the German/Japan model does not apply – as I wrote two years ago, longtime readers will recall, you don’t hear that comparison made anymore, do you? – and I am skeptical that setting up a democratic Shiite government that would be perfectly happy electing the likes of Hamas is what the administration or the American people had in mind from the start.</p><p>As for the numbers argument, the “tiny minority of troublemakers” notion has obsessed occupiers for decades, if not millenia.  PJ O’Rourke famously poked fun at in “All The Trouble In The World” when he was visiting the Royal Ulster Constabulary in Northern Ireland.  Given that the Afghans waited ten years to kick out the Soviets, I think it is far too soon to conclude that the success of the occupation is a sure thing.</p><blockquote><p>I have tried to be as clear in my writing as you are in yours. Though I differ in the tone and content of your most recent editorial, I continue to admire your observations in other areas, and look forward to both your weekly opinions, as well as your blog site.</p></blockquote><p>This was an interesting and informative critique, and I’m always happy to post such criticisms here.  While we may disagree on the probability of air power being successful if utilized in Iran, I very much appreciate AW’s willingness to think things through and engage in a discussion of these matters.</p></div>",
  "content_text": "AW has more than a few things to say:\nI appreciate your well thought articles and insight into a wide variety of subjects, and will continue to read anything you write. Once in a great while, I disagree but understand your perspective and position, and have learned to look at some issues differently. I figured I’d send you an email on your recent article (Air power and low probability). I was dismayed at your criticisms which were taken by me as being selective and one sided.\nI was, for ten years, a US Army intelligence analyst from 1991 to 2000, with a primary training targeting Korean Ground Forces, but also specializing against Irregular Warfare, such as that we see happening in Iraq and Afganistan. My period of service additionallyinvolved me in the critical actions of our service actions in Bosnia and Kosovo, as well as other less known hot spots.\nI was taken by your recalling the common military dictum tat airpower does not win a war, particularly your writing that ‘the history of strategic bombing is a history of complete failure’. I was also put out that you preferred to reach back to WWII and Vietnam, and criticized the air war v. Serbia for Kosovo.\nFirst, air power does not win a war… alone. Nor do ground and naval forces… alone. Although I recall many missions in WWII were unsuccessful from the strategic stand, as you pointed out, from another position the attacks tore out the will to continue from a major portion of Germany’s society. Dresden comes to mind. Massive use of air was still in its infancy. To measure actions then to actions now as equal is foolish. Technology, target intelligence collection, force application, and knowledge gained through lessons learned from past air application make that air so much more deadly it is not measurable against WWII actions. It is absurd – like stating the use of a bicycle is equivalent to a Porsche 959 because they both have wheels, breaks, they go forward and stop – so the 959 will provide no better results than the bicycle.\nThis misses the point, however, which is not that the Air Force cannot deliver significantly more explosive power in a significantly more precise manner than in WWII, but that there is no reason to believe that the gap between promised capability and actual results has been significantly reduced.  The results in all of the various past conflicts mentioned were massively short of what had been promised by the advocates of air power.  This trend seems quite likely to continue, indeed, until the air forces of the world demonstrate otherwise, it is the most logical position.\nVietnam is completely non-contextual, having been a ‘low intensity’ war having nearly non-existent heavy industrial production sites, and receiving the bulk of its weapons and war material from Russia and China. It was a completely different war from WWII, as the US had to learn a different way to use air in support of ground, more tactically than strategically. Or political position at that time was restricted, and not Total War. If our government had supported Total War, we would have crippled the sources and severely impact the weapon production side of the Vietnam conflict – by attacking those production sites in China and USSR. That conflict, by political choice, became a Battalion-Company level conflict war-of-will, decided man-to-man, and required a inner commitment to\nwin US soldiers as a collective did not have, that our South Vietnam allies would not learn, and the North Vietnamese forces were infused down to their souls. In short, only one participant was willing to kill and die to win – and those were the guys that were going to win no matter what technology or weapons were tossed at them, as much as because of their convictions as our own.\nI find it difficult to believe that the Iranian people are any less willing to fight and absorb tremendous casualties than they were during the Iran-Iraq war when they took over a million casualties.  Is there any reason we should assume they aren’t?\nYou mention Serbia, 78-days of air strikes. I helped manage those actions, and regardless of the press, those strikes were devastating and tore the will to fight out of the Serbian military and civilians. It culminated in the last major strike, B52s on Mount Pastric, the action which caused such a complete morale failure that it destabilized the Milosovic government and provoked the withdrawal Serb forces three days later. I point out Milosovic, and his party, are no longer running Serbia or making trouble with their neighbors or minorities.\nMy understanding is that it was the threat of Russian ground forces that caused the Serbs to withdraw, not the air strikes which did not seriously degrade the Serbian military.  In any event, the stated purpose of the air war was to prevent the ethnic cleansing of Kosovo; it is now known that it not only did not prevent this, but stepped up the pace of it.  Given that the air war ended on 20 June, 1999, and Milosovic did not step down until losing a national election in September, 2000, this strikes me as very dubious assertion of cause-and-effect.\nFinally, 45 days or so of hammering Iraqi forces as well as military and civil sites prepared the collapse of the Iraqi military – as it did in the first Gulf Conflict. The same with Afghanistan.\nIn contemporary war, you find the enemy’s rally and supply points, food, ammunition, maintenance parts, fuel and water sources, and you eradicate them. This while you cause them to live with little sleep and numbing fear, in the knowledge they are impotent against an unending air assault. You use every means you can to destroy the will to fight, as our political or military will was destroyed in Korea, Vietnam, and Somalia.\nI have never argued that air power is anything but a vital tactical element in winning a war.  The point is that a war fought only by air cannot be won without using nuclear weapons.  Very, very few of the commentators currently calling for war with Iran are contemplating all-out invasion, they are operating under what I consider to be the delusion that Iran’s nuclear program can be stopped and its regime overturned with nothing more than air strikes and special forces.\nIf, God forbid, we fight anywhere again, including Iran, you may be assured that if both our political and military will are committed to the action, the historical key component will be a massive conventional air action in the month prior to any ground deployment. What happens after is debatable.\nThere are three levels in modern day diplomacy driven conflict. For Iran, if the purpose of a potential conflict with is the elimination of nuclear related sites, the United States will be effective and accomplish its end purpose, by hammering those sites with air and missile strikes. If the US seeks to force a government change, the present Iranian administration and offices are targeted. If it is desired to force a cultural change (Western style Democracy, or a shadow thereof), it will have to be a deployment ground forces and accompanying casualties. I’m thinking the present administration would be positively inclined to do the first, a toss up on the second, and a distant possibility on the third.\nSo, air will be a critical tool, probably the primary tool, and maybe the only tool, of armed diplomacy to get what we desire. Further, it will be massively effective, as I have described it has been in the most recent conflicts.\nObviously, I disagree.  It appears that we may get the chance to find out.  If I am wrong, I will certainly concede the point.  I wouldn’t mind being wrong at all, as the alternatives are rather ugly.\nAs far as a more homogeneous political structure than Iraq making it difficult to act in Iran, I would point out that there are always groups of people at odds with each\nother to fill a vacuum. Should the head be cut off in Iran, there is no doubt it will be the same. Things fall apart everywhere without leadership – add food rationing, no electricity or clean water, lack of food and a crippled economy and chaos and dependency are guaranteed. Somehow, I think that if a government is too busy trying to keep itself functioning and feeding its military and people, it’ll be much more difficult to cause mischief building nukes.\nThe North Korean example should suffice to dismiss this.\nNearly every discussion of Iran invariably uses Iraq as a point. I have great disdain for those who\ncontinue to criticize our present position in Iraq, and use it for demagoguery or self-promotion, and to position themselves in a manner as to demean our forces and government, regardless of which political party runs the US. Especially if they have no experience in military matters (‘any man who in the interests of the commonwealth feels confident that he can give me good advice in the war which I am to conduct, let him not refuse to help his country, but go with me to Macedonia’). Some things, if you believe they will better you or your friends or the world, must be done. And those who criticize with bias rather than act with knowledge are fools.\nMy simple observation is this: there are 24 million Iraqis, and about 250,000 coalition forces. If\none-tenth (2.4 million) of the Iraqis really didn’t want anyone on their soil, they’d bury us under a pile of stones, and they wouldn’t give a damn about our tanks, air power, or whatever. It is apparent that probably one percent of the population is willing to act in a manner to make it hard for the new government and our forces, and probably only one percent of those rabble rousers are willing to conduct direct action.\nOne need not be a military expert to remember what the actual military experts and politicians were saying previously, and comparing it to what they are saying after the shooting starts.  The Iraqi occupation has not been a cakewalk, the fact that the occupying forces are still being killed on a daily basis three years later shows that the German/Japan model does not apply – as I wrote two years ago, longtime readers will recall, you don’t hear that comparison made anymore, do you? – and I am skeptical that setting up a democratic Shiite government that would be perfectly happy electing the likes of Hamas is what the administration or the American people had in mind from the start.\nAs for the numbers argument, the “tiny minority of troublemakers” notion has obsessed occupiers for decades, if not millenia.  PJ O’Rourke famously poked fun at in “All The Trouble In The World” when he was visiting the Royal Ulster Constabulary in Northern Ireland.  Given that the Afghans waited ten years to kick out the Soviets, I think it is far too soon to conclude that the success of the occupation is a sure thing.\nI have tried to be as clear in my writing as you are in yours. Though I differ in the tone and content of your most recent editorial, I continue to admire your observations in other areas, and look forward to both your weekly opinions, as well as your blog site.\nThis was an interesting and informative critique, and I’m always happy to post such criticisms here.  While we may disagree on the probability of air power being successful if utilized in Iran, I very much appreciate AW’s willingness to think things through and engage in a discussion of these matters.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-21T10:55:00+00:00"
}