{
  "url": "https://voxday.net/2006/02/07/mailvox-please-revise/",
  "scraped_at": "2026-01-08T20:58:13.199270",
  "title": "Mailvox: please revise",
  "date_display": "February 7, 2006",
  "date_iso": "2006-02-07T10:51:00+00:00",
  "date_from_url": "2006-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LL has some suggestions:</p><blockquote><p>Please revise the Afro-Abortion article. The politically correct term is now known as <em>Afro-capable</em>. Please revise paragraphs 1 through 11, to reflect a sugar-coated version, more appropriate for those of us who can’t handle blunt truth. Tell us the numbers but not the meaning behind them, and most undoubtedly, you will have to ensure that it is unbiased in political thinking. If you could also find a way to point a finger at a few conservatives while making these needed changes, we may be able to publish the article.</p></blockquote><p>Actually, the mainstream media prefers not to provide the hard numbers, but rather the percentage change in the numbers, the better to avoid all possibility of comparison with past statistics.</p><p>Thus, “the economy grew x.y% in the fourth quarter” and “the American birthrate dropped 0.z% in 2005”.</p></div>",
  "content_text": "LL has some suggestions:\nPlease revise the Afro-Abortion article. The politically correct term is now known as\nAfro-capable\n. Please revise paragraphs 1 through 11, to reflect a sugar-coated version, more appropriate for those of us who can’t handle blunt truth. Tell us the numbers but not the meaning behind them, and most undoubtedly, you will have to ensure that it is unbiased in political thinking. If you could also find a way to point a finger at a few conservatives while making these needed changes, we may be able to publish the article.\nActually, the mainstream media prefers not to provide the hard numbers, but rather the percentage change in the numbers, the better to avoid all possibility of comparison with past statistics.\nThus, “the economy grew x.y% in the fourth quarter” and “the American birthrate dropped 0.z% in 2005”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-07T10:51:00+00:00"
}