{
  "url": "https://voxday.net/2006/02/22/mailvox-mommy-wars/",
  "scraped_at": "2026-01-08T20:59:57.373443",
  "title": "Mailvox: the Mommy Wars",
  "date_display": "February 22, 2006",
  "date_iso": "2006-02-22T14:39:00+00:00",
  "date_from_url": "2006-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>FD sends an email:</p><blockquote><p>The morning show Good Morning America on ABC is doing a 2 day segment called “The Mommy Wars” debating whether or not moms are making a mistake by staying home and giving up their careers.  Professor Linda Hirschman is being challenged for her article last year in a magazine touting moms leaving their careers are making a mistake.  The only statistic provided is 54% of women polled with college and graduate degrees would rather stay at home with their children because they think it is better for the child.  Hirschman thinks they are making a mistake because it is no better for the children and bad for the moms.</p><p>Hirschman says statistics show that stay at home moms are not giving their kids any advantage. – that the kids are well adjusted.  They are taking comments from people <a href=\"http://forums.go.com/abcnews/GMA/thread?threadID=312692\">on their message board</a>.</p></blockquote><p>Ah yes, the famous “statistics show”.  What statistics, precisely?  And how does one define this nebulous well-adjustedness of Ms Hirschmyn speaks so highly?  Does she take into account the increased likelihood of divorce, which was once similarly touted as good for children?  Does she take into account the greater number of days sick and illnesses enjoyed by the children abandoned to day care?  And what about the fact that every educationist insists that the prime determinant of scholastic success in the public schools is parental involvement?  Given the scholastic superiority of homeschooling over both public and private schools, it is obvious that a mother’s career condemns a child to second-class schooling, at best.</p><p>I suspect that Ms Hirschmyn is a typical abortionette for whom the personal is the scientific, who clings to her demonstrably errant beliefs in order to justify her own decisions.</p><p>UPDATE: The self-justifying moronics in the comments are hilarious: <em>I have a career outside of the home. I find it to be very fulfilling. As soon as I pick up my daughter after work, it’s our family time. I feel like I’m able to be more energetic and fulfilled at home, because I do have something outside of the home during the day.</em> Well, since the primary factor in a child’s development is obviously her mother’s self-fulfillment… what are the chances that she doesn’t one day hear the words “self-obsessed bitch” from her daughter?</p><p><em>I am so thankful that someone else realizes that both are possible. I am the mother of a 7 month old and I am both a full time mom and work full time.</em> Translation: I’m a half-assed mom and a half-assed employee, but if I keep repeating the have-it-all mantra, I’ll be able to delude myself until my kid grows up and calls me on it.</p><p><em>I’m a mother of a 3-year-old daughter and a research scientist with a Ph.D. in psychology. I know that my continuing to work is the right decision for our family but I struggle with feelings of being judged as somehow *less* of a mom.</em> Why should she struggle with them?  She IS less of a mom.  Turn it around… if she had her doctoral degree but was only helping out with someone else’s research for a few hours in the evening, would anyone see any controversy in considering her less of a research scientist than her counterparts who are working full-time?</p><p>UPDATE II: Yes, I am aware that some women have to work.  In fact, in 1950, 33.9 percent of women were already in the labor force; the feminist concept of “working women” refers solely to married middle-class white women, (and potential married, middle-class white women), who do not have to work in order to survive.  This should be obvious, given that the entire discussion revolves around those who face a “choice” between children and career; one seldom refers to the career of a waitress, janitor or retail clerk.</p></div>",
  "content_text": "FD sends an email:\nThe morning show Good Morning America on ABC is doing a 2 day segment called “The Mommy Wars” debating whether or not moms are making a mistake by staying home and giving up their careers.  Professor Linda Hirschman is being challenged for her article last year in a magazine touting moms leaving their careers are making a mistake.  The only statistic provided is 54% of women polled with college and graduate degrees would rather stay at home with their children because they think it is better for the child.  Hirschman thinks they are making a mistake because it is no better for the children and bad for the moms.\nHirschman says statistics show that stay at home moms are not giving their kids any advantage. – that the kids are well adjusted.  They are taking comments from people\non their message board\n.\nAh yes, the famous “statistics show”.  What statistics, precisely?  And how does one define this nebulous well-adjustedness of Ms Hirschmyn speaks so highly?  Does she take into account the increased likelihood of divorce, which was once similarly touted as good for children?  Does she take into account the greater number of days sick and illnesses enjoyed by the children abandoned to day care?  And what about the fact that every educationist insists that the prime determinant of scholastic success in the public schools is parental involvement?  Given the scholastic superiority of homeschooling over both public and private schools, it is obvious that a mother’s career condemns a child to second-class schooling, at best.\nI suspect that Ms Hirschmyn is a typical abortionette for whom the personal is the scientific, who clings to her demonstrably errant beliefs in order to justify her own decisions.\nUPDATE: The self-justifying moronics in the comments are hilarious:\nI have a career outside of the home. I find it to be very fulfilling. As soon as I pick up my daughter after work, it’s our family time. I feel like I’m able to be more energetic and fulfilled at home, because I do have something outside of the home during the day.\nWell, since the primary factor in a child’s development is obviously her mother’s self-fulfillment… what are the chances that she doesn’t one day hear the words “self-obsessed bitch” from her daughter?\nI am so thankful that someone else realizes that both are possible. I am the mother of a 7 month old and I am both a full time mom and work full time.\nTranslation: I’m a half-assed mom and a half-assed employee, but if I keep repeating the have-it-all mantra, I’ll be able to delude myself until my kid grows up and calls me on it.\nI’m a mother of a 3-year-old daughter and a research scientist with a Ph.D. in psychology. I know that my continuing to work is the right decision for our family but I struggle with feelings of being judged as somehow *less* of a mom.\nWhy should she struggle with them?  She IS less of a mom.  Turn it around… if she had her doctoral degree but was only helping out with someone else’s research for a few hours in the evening, would anyone see any controversy in considering her less of a research scientist than her counterparts who are working full-time?\nUPDATE II: Yes, I am aware that some women have to work.  In fact, in 1950, 33.9 percent of women were already in the labor force; the feminist concept of “working women” refers solely to married middle-class white women, (and potential married, middle-class white women), who do not have to work in order to survive.  This should be obvious, given that the entire discussion revolves around those who face a “choice” between children and career; one seldom refers to the career of a waitress, janitor or retail clerk.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-22T14:39:00+00:00"
}