{
  "url": "https://voxday.net/2006/02/21/mailvox-but-if-we-won-why-did-we-have/",
  "scraped_at": "2026-01-08T20:59:44.432957",
  "title": "Mailvox: but if we won, why did we have to go back?",
  "date_display": "February 21, 2006",
  "date_iso": "2006-02-21T11:12:00+00:00",
  "date_from_url": "2006-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>USAF Captain RS sees an excess of H2O:</p><blockquote><p>For the first time, I think you’re all wet. OK, so you’re a member of MENSA, but are you a veteran of Air Force service? I think not. Well, I am. 21 years, to be exact. And although I’m only a former public affairs officer, I served in Saudi Arabia during Operation Desert Storm in 1991.  I imagine you were just a lad back then, so I can forgive your ignorance.</p><p>That was a war which was indisputably won by airpower alone.  Even Army generals, strategists and tacticians will admit that. Even though my unit was air-to-air, we were the major contributors to the Iraqi air force’s decision to simply give up and go home. The Iraqis, led by Saddam Hussein, were entirely unprepared for the aerial onslaught they encountered. They thought they were prepared. Hussein had spent billions on “bomb-proof” bunkers and multiple redundant command and control systems. He had the world’s most highly developed and densely distributed anti-aircraft system. Yet all his anti-aircraft defenses were vaporized or rendered blind within 72 hours by coalition air forces. From then on, coalition aircraft roamed unopposed, owning the sky over all of Iraq. Hussein’s forces were rendered reliant only upon shoulder-fired weapons or vehicle-mounted automatic weapons. They hardly managed to fire a missile against coalition aircraft. By pure luck, they managed to down a handful out of the thousands ranging freely around their sky.</p></blockquote><p>“OPERATION DESERT STORM <br>Evaluation of the Air Campaign</br></p><p>the claim that the F-117s were responsible for collapsing the IADS on the first night appears open to question because (1) the F-117s did not hit 40 percent of their tasked targets on the first night and (2) of the 11 IADS-related targets attacked by F-117s and assessed by DIA, 8 were assessed as needing additional strikes….  Moreover, Air Force intelligence assessments of the extent to which the <br>IADS was operating in the first few days of the war do not support the assertion that the system was “collapsed” during the first few hours of the first night. Daily intelligence summaries prepared during the war, called DAISUMs, characterized the IADS on the third day of the campaign as “crippled but information is still being passed” and “evidence of degradation of the Iraqi C2 network is beginning to show.” The DAISUMs also described overall Iraqi electronic warfare activity as low but radar and SAM activity in Baghdad and KTO as heavy. By the fifth day of the air war, the DAISUMs described the situation as, “In general, the Iraqi IADS is down but <br>not out.””</br></br></p><p>So, what was that you said?  Particularly troubling is the fact that the Nighthawks missed 40 percent of their targets.  Sure, we’ve probably gotten better, but I think it would be a mistake to assume that the Iranians haven’t been paying attention to this either.</p><blockquote><p>On the ground, nothing Iraqi could move without becoming a target. Their bunkers were proven very vulnerable and were taken out methodically one after another until none remained intact.  We systematically destroyed every communication center, all power generation, all fuel distribution, all military transportation, all bridges and railroads, everything Hussein could use militarily. We did so with near surgical precision, only very occasionally hitting civilians, and then usually because Hussein had deliberately either hidden military hardware in civilian neighborhoods or facilities, or had grouped innocent civilians in military targets.</p><p>When our ground forces moved forward, Iraqis were so shattered from the sustained air war they were surrendering to unmanned aerial surveillance aircraft! (I’ve seen the tape.) There was no organized Iraqi resistance. They simply surrendered en masse. Even as we moved into Iraq, there was no real resistance.  I suggest you do some homework and revisit your topic. It is unique in the annals of warfare.</p></blockquote><p>But the war was not won, even so.  My point is not that air power is worthless, far from it!  Air supremacy is absolutely vital for the ground operations that are required to win a war, especially for a military that must be sensitive about accepting casualties.  But this does not mean that air power alone is sufficient, as many commentators and the more extreme advocates of air power believe.</p><blockquote><p>Otherwise, keep up your usually great work.</p><p>Respectfully,<br>RS<br>Captain, USAF (Ret.)</br></br></p></blockquote><p>Obviously, I disagree with some of the good captain’s conclusions, but I appreciate him lending us the benefit of his experience and expertise.  There’s nothing I like more than hearing from someone with direct practical information about the matters we are discussing theoretically.</p></div>",
  "content_text": "USAF Captain RS sees an excess of H2O:\nFor the first time, I think you’re all wet. OK, so you’re a member of MENSA, but are you a veteran of Air Force service? I think not. Well, I am. 21 years, to be exact. And although I’m only a former public affairs officer, I served in Saudi Arabia during Operation Desert Storm in 1991.  I imagine you were just a lad back then, so I can forgive your ignorance.\nThat was a war which was indisputably won by airpower alone.  Even Army generals, strategists and tacticians will admit that. Even though my unit was air-to-air, we were the major contributors to the Iraqi air force’s decision to simply give up and go home. The Iraqis, led by Saddam Hussein, were entirely unprepared for the aerial onslaught they encountered. They thought they were prepared. Hussein had spent billions on “bomb-proof” bunkers and multiple redundant command and control systems. He had the world’s most highly developed and densely distributed anti-aircraft system. Yet all his anti-aircraft defenses were vaporized or rendered blind within 72 hours by coalition air forces. From then on, coalition aircraft roamed unopposed, owning the sky over all of Iraq. Hussein’s forces were rendered reliant only upon shoulder-fired weapons or vehicle-mounted automatic weapons. They hardly managed to fire a missile against coalition aircraft. By pure luck, they managed to down a handful out of the thousands ranging freely around their sky.\n“OPERATION DESERT STORM\nEvaluation of the Air Campaign\nthe claim that the F-117s were responsible for collapsing the IADS on the first night appears open to question because (1) the F-117s did not hit 40 percent of their tasked targets on the first night and (2) of the 11 IADS-related targets attacked by F-117s and assessed by DIA, 8 were assessed as needing additional strikes….  Moreover, Air Force intelligence assessments of the extent to which the\nIADS was operating in the first few days of the war do not support the assertion that the system was “collapsed” during the first few hours of the first night. Daily intelligence summaries prepared during the war, called DAISUMs, characterized the IADS on the third day of the campaign as “crippled but information is still being passed” and “evidence of degradation of the Iraqi C2 network is beginning to show.” The DAISUMs also described overall Iraqi electronic warfare activity as low but radar and SAM activity in Baghdad and KTO as heavy. By the fifth day of the air war, the DAISUMs described the situation as, “In general, the Iraqi IADS is down but\nnot out.””\nSo, what was that you said?  Particularly troubling is the fact that the Nighthawks missed 40 percent of their targets.  Sure, we’ve probably gotten better, but I think it would be a mistake to assume that the Iranians haven’t been paying attention to this either.\nOn the ground, nothing Iraqi could move without becoming a target. Their bunkers were proven very vulnerable and were taken out methodically one after another until none remained intact.  We systematically destroyed every communication center, all power generation, all fuel distribution, all military transportation, all bridges and railroads, everything Hussein could use militarily. We did so with near surgical precision, only very occasionally hitting civilians, and then usually because Hussein had deliberately either hidden military hardware in civilian neighborhoods or facilities, or had grouped innocent civilians in military targets.\nWhen our ground forces moved forward, Iraqis were so shattered from the sustained air war they were surrendering to unmanned aerial surveillance aircraft! (I’ve seen the tape.) There was no organized Iraqi resistance. They simply surrendered en masse. Even as we moved into Iraq, there was no real resistance.  I suggest you do some homework and revisit your topic. It is unique in the annals of warfare.\nBut the war was not won, even so.  My point is not that air power is worthless, far from it!  Air supremacy is absolutely vital for the ground operations that are required to win a war, especially for a military that must be sensitive about accepting casualties.  But this does not mean that air power alone is sufficient, as many commentators and the more extreme advocates of air power believe.\nOtherwise, keep up your usually great work.\nRespectfully,\nRS\nCaptain, USAF (Ret.)\nObviously, I disagree with some of the good captain’s conclusions, but I appreciate him lending us the benefit of his experience and expertise.  There’s nothing I like more than hearing from someone with direct practical information about the matters we are discussing theoretically.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-21T11:12:00+00:00"
}