{
  "url": "https://voxday.net/2006/02/13/of-copyright-and-communis/",
  "scraped_at": "2026-01-08T20:58:46.679093",
  "title": "Of copyright and communism",
  "date_display": "February 13, 2006",
  "date_iso": "2006-02-13T09:01:00+00:00",
  "date_from_url": "2006-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Z.King misses the heart of the matter:</p><blockquote><p>Vox is not actually a commy, but the idea of anyone feeling entitled to the fruits of someone else’s labor is a commy/socialist idea.</p></blockquote><p>But the entire point of my argument is that copyright is not property.  In fact, I can use existing copyright law to demonstrate this concept, because if copyright were genuine property, it would not have a statute of limitations on it.  Putting the abomination of the <em>Kelo</em> decision aside for the moment, must your children give up your house to the public after a fixed number of years?  Your car?  How about your savings?</p><p>This clear distinction between the intellectual property of copyright and real property is sufficient to prove that copyright is not property.</p><p>Now, sticking with an example that has already been discussed here, there is far more to a book than the copyrighted element.  There is the physical material, the layout, the typeface, the cover art and the expense of printing… in fact, the text is usually one of the least expensive elements unless the author JK Rowlings or Stephen King.   So, if copyright is not property and the other labor elements outweigh that of the copyright holder’s labor in the end product, how can anyone possibly claim that skepticism about the benefits of copyright for innovation derives from one strain of Marxianism or another in any way?</p><p>As others have asked, why is it that only some ideas – often the least important ones – that can be protected in this manner?  Should we not have granted copyright to the inventor of the Internet?  Is not Z. therefore robbing him by not paying him a royalty for the benefit of reading this blog post?  If so, she can surely send him a penny each time she logs on in order to assuage her guilty conscience, lest we accuse her of being a thief, or worse, a Communist.</p></div>",
  "content_text": "Z.King misses the heart of the matter:\nVox is not actually a commy, but the idea of anyone feeling entitled to the fruits of someone else’s labor is a commy/socialist idea.\nBut the entire point of my argument is that copyright is not property.  In fact, I can use existing copyright law to demonstrate this concept, because if copyright were genuine property, it would not have a statute of limitations on it.  Putting the abomination of the\nKelo\ndecision aside for the moment, must your children give up your house to the public after a fixed number of years?  Your car?  How about your savings?\nThis clear distinction between the intellectual property of copyright and real property is sufficient to prove that copyright is not property.\nNow, sticking with an example that has already been discussed here, there is far more to a book than the copyrighted element.  There is the physical material, the layout, the typeface, the cover art and the expense of printing… in fact, the text is usually one of the least expensive elements unless the author JK Rowlings or Stephen King.   So, if copyright is not property and the other labor elements outweigh that of the copyright holder’s labor in the end product, how can anyone possibly claim that skepticism about the benefits of copyright for innovation derives from one strain of Marxianism or another in any way?\nAs others have asked, why is it that only some ideas – often the least important ones – that can be protected in this manner?  Should we not have granted copyright to the inventor of the Internet?  Is not Z. therefore robbing him by not paying him a royalty for the benefit of reading this blog post?  If so, she can surely send him a penny each time she logs on in order to assuage her guilty conscience, lest we accuse her of being a thief, or worse, a Communist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-13T09:01:00+00:00"
}