{
  "url": "https://voxday.net/2006/02/22/oh-come-all-ye-fascists/",
  "scraped_at": "2026-01-08T20:59:55.510582",
  "title": "Oh come, all ye fascists",
  "date_display": "February 22, 2006",
  "date_iso": "2006-02-22T11:31:00+00:00",
  "date_from_url": "2006-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tony Blankley calls for <a href=\"http://www.washingtontimes.com/op-ed/20060221-091200-1551r.htm\">a liberal-conservative totalitarian alliance</a>:</p><blockquote><p>Next week a vastly important book will be published: “Preemption, A Knife That Cuts Both Ways” by Alan Dershowitz. Yes, that Alan Dershowitz: the very liberal civil libertarian, anti-capital punishment Harvard Law School professor. And but for my lack of his legal scholarship, there is nary a sentence in the book that I — a very conservative editor of The Washington Times and former press secretary to Newt Gingrich — couldn’t have written.</p><p>The premise of his book is that in this age of terror, there is a potential need for such devices as profiling, preventive detention, anticipatory mass inoculation, prior restraint of dangerous speech, targeted extrajudicial executions of terrorists and preemptive military action, including full-scale preventive war.</p></blockquote><p>It seems that Dershowitz’s <s>central state worship</s> liberalism trumps his former civil libertarianism.  And to be “conservative” these days is, of course, to pray at the shrine of the central state as well.  So, it seems the cloak is finally being removed from the so-called rival factions, who can be united publicly at last in one totalitarian anti-terror party.</p><p>Yes, Mr. Blankley, ten “possibly preventable terrorist attacks” are preferable to abandoning the rule of law and developing “new standards for a new age”.  New standards?  New age?  Promising security in exchange for ruling power is the second-oldest con in the book.</p><p>Terrorist attacks cannot and will not destroy America.  Only America or an external power with a superior military can destroy America.  Mr. Blankley and Mr. Dershowitz represent an alliance designed to do precisely that.  As Arnold Toynbee astutely noted, <a href=\"http://www.myriobiblos.gr/texts/english/toynbee.html\">civilizations die from suicide, not murder</a>.</p><p><em>I think Gibbon’s initial error lies in supposing that the ancient civilization of the Graeco-Roman world began to decline in the second century after Christ and that the age of the Antonines was that civilization’s highest point. I think it really began to decline in the fifth century before Christ. It died not by murder, but by suicide; and that act of suicide was committed before the fifth century B.C. was out.</em></p></div>",
  "content_text": "Tony Blankley calls for\na liberal-conservative totalitarian alliance\n:\nNext week a vastly important book will be published: “Preemption, A Knife That Cuts Both Ways” by Alan Dershowitz. Yes, that Alan Dershowitz: the very liberal civil libertarian, anti-capital punishment Harvard Law School professor. And but for my lack of his legal scholarship, there is nary a sentence in the book that I — a very conservative editor of The Washington Times and former press secretary to Newt Gingrich — couldn’t have written.\nThe premise of his book is that in this age of terror, there is a potential need for such devices as profiling, preventive detention, anticipatory mass inoculation, prior restraint of dangerous speech, targeted extrajudicial executions of terrorists and preemptive military action, including full-scale preventive war.\nIt seems that Dershowitz’s\ncentral state worship\nliberalism trumps his former civil libertarianism.  And to be “conservative” these days is, of course, to pray at the shrine of the central state as well.  So, it seems the cloak is finally being removed from the so-called rival factions, who can be united publicly at last in one totalitarian anti-terror party.\nYes, Mr. Blankley, ten “possibly preventable terrorist attacks” are preferable to abandoning the rule of law and developing “new standards for a new age”.  New standards?  New age?  Promising security in exchange for ruling power is the second-oldest con in the book.\nTerrorist attacks cannot and will not destroy America.  Only America or an external power with a superior military can destroy America.  Mr. Blankley and Mr. Dershowitz represent an alliance designed to do precisely that.  As Arnold Toynbee astutely noted,\ncivilizations die from suicide, not murder\n.\nI think Gibbon’s initial error lies in supposing that the ancient civilization of the Graeco-Roman world began to decline in the second century after Christ and that the age of the Antonines was that civilization’s highest point. I think it really began to decline in the fifth century before Christ. It died not by murder, but by suicide; and that act of suicide was committed before the fifth century B.C. was out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-22T11:31:00+00:00"
}