{
  "url": "https://voxday.net/2006/02/13/press-freedom-and-slippery-slope/",
  "scraped_at": "2026-01-08T20:58:44.850148",
  "title": "Press freedom and the slippery slope",
  "date_display": "February 13, 2006",
  "date_iso": "2006-02-13T08:41:00+00:00",
  "date_from_url": "2006-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andrew Stuttaford of National Review Online underlines the point of today’s column with these studies in legal ignorance:</p><blockquote><p>“That’s right: they don’t particularly like the idea of the film, but they think that it should be made. That’s called freedom, or, as a number of EU governments prefer to call it, “provocation”.” – Andrew Stuttaford</p><p>“Dutch politician Ayaan Hirsi Ali rallies to Denmark’s defense, while faulting her own government: ‘I do not seek to offend religious sentiment, but I will not submit to tyranny. Demanding that people who do not accept Muhammad’s teachings should refrain from drawing him is not a request for respect but a demand for submission.’  In response, the Dutch prime minister has said that he does “not have much use” for Hirsi Ali’s views.  Shame on him.” – Stuttaford again</p><p>“According to Dagens Nyheter, the Swedish security services (Säpo), in collusion with Foreign Minister Leila Freivalds, have forced the website SD-Kuriren offline for publishing the Jyllands-Posten cartoons (SD-Kuriren is the house organ of the hard-right Swedish Democrats).” – Stuttaford, quoting the <em>Stockholm Spectator</em></p><p>“The EU’s foreign policy boss is setting out on a trip of the Middle East to discuss the cartoon saga. These comments, in an interview with Al Arabiya, suggest that free speech will take second place to a “respect” that “does not stop at countries’ borders and it includes all religions and specifically what concerns us here, our respect for the Islamic religion.”  Meanwhile, a preacher in Mecca is rejecting apologies and demanding a trial. With “stiff penalties” to follow, of course.” – Once more, the irrepressible Mr. Stuttaford</p></blockquote><p>The great irony here is that Andrew Stuttaford is British, and thus hails from a country which does not recognize American-style press freedom. <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=48799\">As I demonstrated using Swiss law</a>, most European countries ban public insults to officially-recognized religions – you can, for example, freely insult Scientologists in Germany since it is considered a cult, not a religion – and thus the Muslim call for trials and prosecutions of the offending media organizations is entirely reasonable in many, if not most of those countries.</p><p>It is a pity that these individuals so interested in protecting a non-existent press freedom in Europe are not equally exercised about the recent loss of genuine American press freedoms due to the McCain-Feingold campaign finance reform bill and the new violence against women act.</p></div>",
  "content_text": "Andrew Stuttaford of National Review Online underlines the point of today’s column with these studies in legal ignorance:\n“That’s right: they don’t particularly like the idea of the film, but they think that it should be made. That’s called freedom, or, as a number of EU governments prefer to call it, “provocation”.” – Andrew Stuttaford\n“Dutch politician Ayaan Hirsi Ali rallies to Denmark’s defense, while faulting her own government: ‘I do not seek to offend religious sentiment, but I will not submit to tyranny. Demanding that people who do not accept Muhammad’s teachings should refrain from drawing him is not a request for respect but a demand for submission.’  In response, the Dutch prime minister has said that he does “not have much use” for Hirsi Ali’s views.  Shame on him.” – Stuttaford again\n“According to Dagens Nyheter, the Swedish security services (Säpo), in collusion with Foreign Minister Leila Freivalds, have forced the website SD-Kuriren offline for publishing the Jyllands-Posten cartoons (SD-Kuriren is the house organ of the hard-right Swedish Democrats).” – Stuttaford, quoting the\nStockholm Spectator\n“The EU’s foreign policy boss is setting out on a trip of the Middle East to discuss the cartoon saga. These comments, in an interview with Al Arabiya, suggest that free speech will take second place to a “respect” that “does not stop at countries’ borders and it includes all religions and specifically what concerns us here, our respect for the Islamic religion.”  Meanwhile, a preacher in Mecca is rejecting apologies and demanding a trial. With “stiff penalties” to follow, of course.” – Once more, the irrepressible Mr. Stuttaford\nThe great irony here is that Andrew Stuttaford is British, and thus hails from a country which does not recognize American-style press freedom.\nAs I demonstrated using Swiss law\n, most European countries ban public insults to officially-recognized religions – you can, for example, freely insult Scientologists in Germany since it is considered a cult, not a religion – and thus the Muslim call for trials and prosecutions of the offending media organizations is entirely reasonable in many, if not most of those countries.\nIt is a pity that these individuals so interested in protecting a non-existent press freedom in Europe are not equally exercised about the recent loss of genuine American press freedoms due to the McCain-Feingold campaign finance reform bill and the new violence against women act.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-13T08:41:00+00:00"
}