{
  "url": "https://voxday.net/2006/02/11/women-work-and-self-fulfillmen/",
  "scraped_at": "2026-01-08T20:58:33.432793",
  "title": "Women, work and self-fulfillment",
  "date_display": "February 11, 2006",
  "date_iso": "2006-02-11T23:55:00+00:00",
  "date_from_url": "2006-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s something I’ve never quite understood about the working woman vs housewife issue.  The classic feminist argument is that women who stay at home won’t be satisfied and fulfilled, because they are stifled and oppressed by being limited to their roles as wives and mothers.  So, in order to find themselves, and presumably, satisfaction, they recommend that women go out and spend over a third of the day doing something that they enjoy so little that someone has to offer them money in order to get them to do it.</p><p>Meanwhile, the first thing that a wealthy and successful man does when he can afford to do so <em>is vacate the office!</em> True, he’s probably not cleaning any bathrooms, but then, the average woman’s distaste for cleaning bathrooms is clearly not so great that anyone has to give her money to get her to do it.  At least, not in the case of women with clean bathrooms….</p><p>This reminds me of the fable of the king and his general, wherein the general convinces the conquest-hungry king that even if they do go out and conquer the world, success will be crowned by their ability to sit peacefully in the sun and drink wine, exactly as they are doing already.</p><p>So, don’t expect to find much personal fulfillment in anything you wouldn’t do if someone wasn’t paying you money to do it.  This would seem to be pretty obvious, and yet it has apparently escaped the attention of three generations of women pining to join the workforce.</p></div>",
  "content_text": "Here’s something I’ve never quite understood about the working woman vs housewife issue.  The classic feminist argument is that women who stay at home won’t be satisfied and fulfilled, because they are stifled and oppressed by being limited to their roles as wives and mothers.  So, in order to find themselves, and presumably, satisfaction, they recommend that women go out and spend over a third of the day doing something that they enjoy so little that someone has to offer them money in order to get them to do it.\nMeanwhile, the first thing that a wealthy and successful man does when he can afford to do so\nis vacate the office!\nTrue, he’s probably not cleaning any bathrooms, but then, the average woman’s distaste for cleaning bathrooms is clearly not so great that anyone has to give her money to get her to do it.  At least, not in the case of women with clean bathrooms….\nThis reminds me of the fable of the king and his general, wherein the general convinces the conquest-hungry king that even if they do go out and conquer the world, success will be crowned by their ability to sit peacefully in the sun and drink wine, exactly as they are doing already.\nSo, don’t expect to find much personal fulfillment in anything you wouldn’t do if someone wasn’t paying you money to do it.  This would seem to be pretty obvious, and yet it has apparently escaped the attention of three generations of women pining to join the workforce.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-02-11T23:55:00+00:00"
}