{
  "url": "https://voxday.net/2016/10/13/actions-have-consequences/",
  "scraped_at": "2025-12-18T01:59:14.887967",
  "title": "Actions have consequences",
  "date_display": "October 13, 2016",
  "date_iso": "2016-10-13T15:44:00+00:00",
  "date_from_url": "2016-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jewish commentators are aghast that no one on the Left or the Right <a href=\"https://pjmedia.com/faith/2016/10/11/it-stinks-to-be-jewish-during-election-2016/2/\">gives a damn</a> about what they think or want anymore.</p><blockquote><p> In a 2011 article published by the Jewish Telegraphic Agency, politically conservative Jewish radio host Benyamin Korn reflected upon the scores of Jews populating conservative new media, concluding:<br> <i><br/></i><br> <i>Certainly there is another reason why Jews, per se, have attracted so little notice in the conservative new media: the change in American conservatism itself. Ethnically diverse and intellectually formidable, today’s conservatism is reliably pro-Israel, comfortably Judeo-Christian and for the most part promotes a nuanced social conservatism. In a movement that is credible and hospitable to American Jews, and from which the ethno-centrism of yore is largely absent, Jewish journalists will flourish.</i></br></br></p><p>At least until the rise of the alt-Right. Fast-forward five years and it would appear that conservative new media has turned on its own, with sites like Breitbart (whose former executive chairman now runs the Trump campaign) being used to weed out Jewish Republicans unwilling to toe the party line. Weird anti-Semitic memes like Pepe the Frog have trended among Trump supporters and an army of faceless anti-Semites has taken to Twitter and other social media outlets on Trump’s behalf. The anti-Semitism on the Right is so overwhelming in fact that many Jews have left the Republican Party altogether, receiving farewells that boil down to, Don’t let the door hit you in the tuchus on the way out.</p><p>Is the Alt-Right Borrowing Jihadist Propaganda Techniques? The Alt-Right and BLM are One and the Same</p><p>So, what of the political future of American Jewry? The one thing that 2016 has made clear is this: Jewish Americans are not welcome among the political elite on the Left or the Right. For the first time in my lifetime, Jewish Americans who make no bones about identifying as Jews, whether they are Orthodox in practice or Zionist in outlook, are being given the cold shoulder by the political establishment at large.</p></blockquote><p>What is fascinating here is the total inability to connect the action with the consequence. The Alt-Right has risen to replace the conservative media because the scores of entryist Jews who filled it after William F. Buckley’s purge of the Birchers transformed the conservative media into something that is close to the polar opposite of what it once was. And, of course, because so many of those (((conservatives))) are prone to writing propagandistic fiction, as (((Susan Goldberg))) repeatedly demonstrates in this short piece.</p><ol><li>The Alt-Right is not the same as Black Lives Matter. That’s an <i>insanely </i>stupid lie.</li><li>Pepe the Frog is not an anti-Semitic meme. Putting a swastika on Bugs Bunny doesn’t make Bugs Bunny an anti-Semitic meme. The medium is not the message.</li><li>78 percent of Jews voted for Obama in 2012. There weren’t “many Jews” in the Republican Party in the first place.</li><li>The anti-Semitism on the Right is not overwhelming by any measure. If Goldberg thinks it’s overwhelming now, just wait until the next financial crash. If Jews were really as smart as they like to advertise, they would never have allowed Jane Yellen to be appointed Fed chairman, but would have insisted on the former head of the Chinese central bank taking the job, and the eventual fall. And they would have kept very, very far away from non-Jewish crooks like John Corzine</li></ol><p> A conservatism that is pro-Israel instead of pro-American, “Judeo-Christian” instead of Christian, and “promotes a nuanced social conservatism” instead of promoting a staunch pro-life, pro-marriage, pro-child, pro-Western-civilization conservatism is of zero interest to pretty much everyone who isn’t named (((Goldberg))) or (((Shapiro))). Neither immigrants nor natives have any use for it.</p><p>Jews are no longer welcome among the political elite on the Left or the Right because both sides now realize that their primary motivation, “is it good for the Jews?”, is no longer of any benefit to the objectives of  either the Left or the Right. Perhaps more importantly in the long term, the transformation from ideology politics to identity politics means there is no longer any more place for Jews in the Christian American tribe than there is for Christian Americans in the Jewish tribe.</p><p>Judeo-Christianity was never anything more than propaganda, but even if you can’t understand that, you should be able to grasp that it is not a coherent political identity, being both <a href=\"http://www.milobookclub.com/2016/09/10/judeo-christian-is-antisemitic/\">anti-Semitic</a> and <a href=\"http://www.milobookclub.com/2016/08/26/judeo-christian-is-anti-christian/\">anti-Christian</a>.</p><p>However, it wasn’t until reading Fukuyama’s <i>The Origins of Political Order</i> that the fundamental problem of Jews in the West became clear to me. (This was a little ironic in that the book has not, in the first 300 pages, even discussed the Jews.) What happened is that the West abandoned the kinship rules that govern the rest of the world as a result of the Catholic Church’s actions in the early middle ages. But not being Christian, the Jews were unaffected by this transformation away from the extended family towards the nuclear family and the individual, and therefore they continued to play by the same kinship rules that the rest of the world has always played by.</p><p>These different rules, individual vs extended family, created an inevitable stress between the kinship and the non-kinship populations, which periodically flared up in the historical conflicts we all know. It may also explain the post-1965 attack on the nuclear family. So, the real problem now facing Jews in the West now is not anti-Semitism, the huge invasion of rival tribes that play by the same kinship rules, or even the way in which the non-kinship Westerners are beginning to abandon their traditional rules in favor of a synthetic kinship.</p><p>No, the real challenge for the Jews is going to be accepting the fact that their historical success primarily stems from playing the game on the easy coop level when everyone else with whom they were competing was going it more or less alone. In other words, what worked so effectively when the rivals were non-kinship Westerners is not going to work anywhere else in the world, and it is not going to work in a post-Christian West.</p><p>I’m not the first to figure this out, of course. The Learned Elders of Wye <a href=\"http://www.milobookclub.com/2014/01/07/protocols-of-learned-elders-of-wye/\">worked it out 10 years ago</a>. And there is absolutely nothing anyone can do to fix this state of affairs or return things to how they were perceived to be. Once the percentage of the kinship share of the population rose beyond a certain level, it created an absolute necessity for <i>everyone </i>to begin playing by the same kinship rules whether they want to do so or not.</p></div>",
  "content_text": "Jewish commentators are aghast that no one on the Left or the Right\ngives a damn\nabout what they think or want anymore.\nIn a 2011 article published by the Jewish Telegraphic Agency, politically conservative Jewish radio host Benyamin Korn reflected upon the scores of Jews populating conservative new media, concluding:\nCertainly there is another reason why Jews, per se, have attracted so little notice in the conservative new media: the change in American conservatism itself. Ethnically diverse and intellectually formidable, today’s conservatism is reliably pro-Israel, comfortably Judeo-Christian and for the most part promotes a nuanced social conservatism. In a movement that is credible and hospitable to American Jews, and from which the ethno-centrism of yore is largely absent, Jewish journalists will flourish.\nAt least until the rise of the alt-Right. Fast-forward five years and it would appear that conservative new media has turned on its own, with sites like Breitbart (whose former executive chairman now runs the Trump campaign) being used to weed out Jewish Republicans unwilling to toe the party line. Weird anti-Semitic memes like Pepe the Frog have trended among Trump supporters and an army of faceless anti-Semites has taken to Twitter and other social media outlets on Trump’s behalf. The anti-Semitism on the Right is so overwhelming in fact that many Jews have left the Republican Party altogether, receiving farewells that boil down to, Don’t let the door hit you in the tuchus on the way out.\nIs the Alt-Right Borrowing Jihadist Propaganda Techniques? The Alt-Right and BLM are One and the Same\nSo, what of the political future of American Jewry? The one thing that 2016 has made clear is this: Jewish Americans are not welcome among the political elite on the Left or the Right. For the first time in my lifetime, Jewish Americans who make no bones about identifying as Jews, whether they are Orthodox in practice or Zionist in outlook, are being given the cold shoulder by the political establishment at large.\nWhat is fascinating here is the total inability to connect the action with the consequence. The Alt-Right has risen to replace the conservative media because the scores of entryist Jews who filled it after William F. Buckley’s purge of the Birchers transformed the conservative media into something that is close to the polar opposite of what it once was. And, of course, because so many of those (((conservatives))) are prone to writing propagandistic fiction, as (((Susan Goldberg))) repeatedly demonstrates in this short piece.\nThe Alt-Right is not the same as Black Lives Matter. That’s an\ninsanely\nstupid lie.\nPepe the Frog is not an anti-Semitic meme. Putting a swastika on Bugs Bunny doesn’t make Bugs Bunny an anti-Semitic meme. The medium is not the message.\n78 percent of Jews voted for Obama in 2012. There weren’t “many Jews” in the Republican Party in the first place.\nThe anti-Semitism on the Right is not overwhelming by any measure. If Goldberg thinks it’s overwhelming now, just wait until the next financial crash. If Jews were really as smart as they like to advertise, they would never have allowed Jane Yellen to be appointed Fed chairman, but would have insisted on the former head of the Chinese central bank taking the job, and the eventual fall. And they would have kept very, very far away from non-Jewish crooks like John Corzine\nA conservatism that is pro-Israel instead of pro-American, “Judeo-Christian” instead of Christian, and “promotes a nuanced social conservatism” instead of promoting a staunch pro-life, pro-marriage, pro-child, pro-Western-civilization conservatism is of zero interest to pretty much everyone who isn’t named (((Goldberg))) or (((Shapiro))). Neither immigrants nor natives have any use for it.\nJews are no longer welcome among the political elite on the Left or the Right because both sides now realize that their primary motivation, “is it good for the Jews?”, is no longer of any benefit to the objectives of  either the Left or the Right. Perhaps more importantly in the long term, the transformation from ideology politics to identity politics means there is no longer any more place for Jews in the Christian American tribe than there is for Christian Americans in the Jewish tribe.\nJudeo-Christianity was never anything more than propaganda, but even if you can’t understand that, you should be able to grasp that it is not a coherent political identity, being both\nanti-Semitic\nand\nanti-Christian\n.\nHowever, it wasn’t until reading Fukuyama’s\nThe Origins of Political Order\nthat the fundamental problem of Jews in the West became clear to me. (This was a little ironic in that the book has not, in the first 300 pages, even discussed the Jews.) What happened is that the West abandoned the kinship rules that govern the rest of the world as a result of the Catholic Church’s actions in the early middle ages. But not being Christian, the Jews were unaffected by this transformation away from the extended family towards the nuclear family and the individual, and therefore they continued to play by the same kinship rules that the rest of the world has always played by.\nThese different rules, individual vs extended family, created an inevitable stress between the kinship and the non-kinship populations, which periodically flared up in the historical conflicts we all know. It may also explain the post-1965 attack on the nuclear family. So, the real problem now facing Jews in the West now is not anti-Semitism, the huge invasion of rival tribes that play by the same kinship rules, or even the way in which the non-kinship Westerners are beginning to abandon their traditional rules in favor of a synthetic kinship.\nNo, the real challenge for the Jews is going to be accepting the fact that their historical success primarily stems from playing the game on the easy coop level when everyone else with whom they were competing was going it more or less alone. In other words, what worked so effectively when the rivals were non-kinship Westerners is not going to work anywhere else in the world, and it is not going to work in a post-Christian West.\nI’m not the first to figure this out, of course. The Learned Elders of Wye\nworked it out 10 years ago\n. And there is absolutely nothing anyone can do to fix this state of affairs or return things to how they were perceived to be. Once the percentage of the kinship share of the population rose beyond a certain level, it created an absolute necessity for\neveryone\nto begin playing by the same kinship rules whether they want to do so or not.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-13T14:44:00+00:00"
}