{
  "url": "https://voxday.net/2016/10/12/an-interview-with-bbc/",
  "scraped_at": "2025-12-18T01:59:02.091898",
  "title": "An interview with the BBC",
  "date_display": "October 12, 2016",
  "date_iso": "2016-10-12T12:00:00+00:00",
  "date_from_url": "2016-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I decided to violate my usual no-interviews policy today because the interview requested didn’t concern me, but rather, Donald Trump. BBC World was looking for Americans outside the USA who support Donald Trump, and a producer discovered <a href=\"https://www.google.ch/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwiP1-Tg_tTPAhVC0RQKHVfBD3sQFggeMAA&amp;url=https%3A%2F%2Fheatst.com%2Fpolitics%2Fvox-day-of-gamergate-why-i-support-donald-trump%2F&amp;usg=AFQjCNEFBJfb6DAyW6bP6Zk-I0s4aTgOAw\">my debate with Louise Mensch</a> on Heat Street concerning the subject.</p><p>I don’t expect the interview to air, because if there is one thing the media does not want to hear right now, it is that a few remarks about women, however unpalatable, aren’t going to change any rational individual’s mind about Donald Trump. At worst, they indicate that Trump would be a president in the mode of Bill Clinton and Jack Kennedy rather than Ronald Reagan and Jimmy Carter.</p><p>And while it may be true that having a President who is prone to bawdy banter would be bad for women, do you know what is <i>really </i>bad for women? Being raped by immigrants. And do you know what is <i>even worse</i> for women? Being nuked by Russian missiles.</p><p>As I told the host, there are only two issues that matter in this presidential election:</p><ul><li>Immigration</li><li>War with Russia</li></ul><p>On both issues, Donald Trump is the much, much better candidate than Hillary Clinton, who as Secretary of State laid the groundwork for the current war-by-proxy the US military is waging against Russia in Syria and Ukraine.</p><p>As I told him, if you are a European, if you are British, regardless of what you think of the man personally, you should not be hoping that Donald Trump is the next U.S. President, you should be <i>praying </i>that he is. Because neither immigration nor war with Russia will be to your benefit either.</p><p>So, yeah, I tend to doubt it will ever see air.</p><p>On a tangentially-related note, someone mentioned on Monday that a comprehensive list of anti-Trump Republicans would be useful going forward. Lo and behold, there is now a comprehensive list of anti-Trump Republicans <a href=\"https://infogalactic.com/info/List_of_Republicans_opposing_Donald_Trump_presidential_campaign,_2016\">available on Infogalactic</a>.</p></div>",
  "content_text": "I decided to violate my usual no-interviews policy today because the interview requested didn’t concern me, but rather, Donald Trump. BBC World was looking for Americans outside the USA who support Donald Trump, and a producer discovered\nmy debate with Louise Mensch\non Heat Street concerning the subject.\nI don’t expect the interview to air, because if there is one thing the media does not want to hear right now, it is that a few remarks about women, however unpalatable, aren’t going to change any rational individual’s mind about Donald Trump. At worst, they indicate that Trump would be a president in the mode of Bill Clinton and Jack Kennedy rather than Ronald Reagan and Jimmy Carter.\nAnd while it may be true that having a President who is prone to bawdy banter would be bad for women, do you know what is\nreally\nbad for women? Being raped by immigrants. And do you know what is\neven worse\nfor women? Being nuked by Russian missiles.\nAs I told the host, there are only two issues that matter in this presidential election:\nImmigration\nWar with Russia\nOn both issues, Donald Trump is the much, much better candidate than Hillary Clinton, who as Secretary of State laid the groundwork for the current war-by-proxy the US military is waging against Russia in Syria and Ukraine.\nAs I told him, if you are a European, if you are British, regardless of what you think of the man personally, you should not be hoping that Donald Trump is the next U.S. President, you should be\npraying\nthat he is. Because neither immigration nor war with Russia will be to your benefit either.\nSo, yeah, I tend to doubt it will ever see air.\nOn a tangentially-related note, someone mentioned on Monday that a comprehensive list of anti-Trump Republicans would be useful going forward. Lo and behold, there is now a comprehensive list of anti-Trump Republicans\navailable on Infogalactic\n.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-12T11:00:00+00:00"
}