{
  "url": "https://voxday.net/2016/10/16/compare-and-contras/",
  "scraped_at": "2025-12-18T01:59:37.013048",
  "title": "Compare and contrast",
  "date_display": "October 16, 2016",
  "date_iso": "2016-10-16T13:00:00+00:00",
  "date_from_url": "2016-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The example of Mike Cernovich illustrates the fundamental difference between Infogalactic and Wikipedia. As one Gab commenter, @sak, observed this morning:</p><blockquote class=\"tr_bq\"><p> Infogalactic gives me facts that helps me to understand who Cernovich is and what he has achieved. Wikipedia makes sure I know he is a thought criminal against sjw orthodoxy. I know which one I will choose in future.</p></blockquote><p>Don’t take his word for it. Don’t take my word for it. See the current versions for yourself.</p><ul><li>Infogalactic: <a href=\"https://infogalactic.com/w/index.php?title=Mike_Cernovich&amp;oldid=723278719\">Mike Cernovich</a></li><li>Wikipedia: <a href=\"https://en.wikipedia.org/w/index.php?title=Mike_Cernovich&amp;oldid=744502634\">Mike Cernovich</a> </li></ul><div> In favor of Wikipedia, it must be said that this actually represents a big step forward for the Wikipedians. At least they’re admitting that the bestselling author of <i>Gorilla Mindset</i>, who has more than 133,000 followers on Twitter, exists. Between 16 July 2015 and 13 October, 2016, Wikipedians denied his notability, having previously deleted the page about him there.</div><div><ul><li><i>“Subject matter isn’t notable for anything other than their involvement in the Gamergate controversy.”</i></li><li><i>“Not only is this your typical case of BLP1E pretty much all reliable sources written about him are extremely negative. Absolutely no good can come from keeping this as an article.”</i></li><li><i>“It’s unlikely based on events thus far that Cernovich will ever be notable for any other efforts.”</i></li></ul><div> One unintended consequence of Infogalactic’s rise is likely to be a gradual reduction in Wikipedia’s shameless left-wing bias. That won’t be enough to save its preeminence, but it will still be an improvement.<p>Speaking of contrasts, an important note on the different speeds you’ll see on the two sites. Wikipedia utilizes an <i>incredibly </i>inefficient and outmoded approach that solves for its design inefficiencies by utilizing a tremendous amount of servers and storage to cover for them. We could do that, or we can use the resources it would require to fix the design inefficiencies and do it right.</p><p>For better or for worse, we have chosen the latter approach as we are more concerned about being competitive in the long haul than in the short run. That being said, a page should only take a really long time to load once, the first time it is accessed. After that, it’s in the cache and it will pop up much more quickly. The bigger the page, the more links, the more database queries, and therefore the inefficiencies will affect the load time.</p></div><div> <br> Anyhow, don’t worry about it. We’re very aware of the problem, and fixing it is one of our top priorities, but we’re going to fix it correctly and in a manner that doesn’t create more problems down the road.</br></div></div></div>",
  "content_text": "The example of Mike Cernovich illustrates the fundamental difference between Infogalactic and Wikipedia. As one Gab commenter, @sak, observed this morning:\nInfogalactic gives me facts that helps me to understand who Cernovich is and what he has achieved. Wikipedia makes sure I know he is a thought criminal against sjw orthodoxy. I know which one I will choose in future.\nDon’t take his word for it. Don’t take my word for it. See the current versions for yourself.\nInfogalactic:\nMike Cernovich\nWikipedia:\nMike Cernovich\nIn favor of Wikipedia, it must be said that this actually represents a big step forward for the Wikipedians. At least they’re admitting that the bestselling author of\nGorilla Mindset\n, who has more than 133,000 followers on Twitter, exists. Between 16 July 2015 and 13 October, 2016, Wikipedians denied his notability, having previously deleted the page about him there.\n“Subject matter isn’t notable for anything other than their involvement in the Gamergate controversy.”\n“Not only is this your typical case of BLP1E pretty much all reliable sources written about him are extremely negative. Absolutely no good can come from keeping this as an article.”\n“It’s unlikely based on events thus far that Cernovich will ever be notable for any other efforts.”\nOne unintended consequence of Infogalactic’s rise is likely to be a gradual reduction in Wikipedia’s shameless left-wing bias. That won’t be enough to save its preeminence, but it will still be an improvement.\nSpeaking of contrasts, an important note on the different speeds you’ll see on the two sites. Wikipedia utilizes an\nincredibly\ninefficient and outmoded approach that solves for its design inefficiencies by utilizing a tremendous amount of servers and storage to cover for them. We could do that, or we can use the resources it would require to fix the design inefficiencies and do it right.\nFor better or for worse, we have chosen the latter approach as we are more concerned about being competitive in the long haul than in the short run. That being said, a page should only take a really long time to load once, the first time it is accessed. After that, it’s in the cache and it will pop up much more quickly. The bigger the page, the more links, the more database queries, and therefore the inefficiencies will affect the load time.\nAnyhow, don’t worry about it. We’re very aware of the problem, and fixing it is one of our top priorities, but we’re going to fix it correctly and in a manner that doesn’t create more problems down the road.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-16T12:00:00+00:00"
}