{
  "url": "https://voxday.net/2016/10/23/he-has-opened-doors-to-demons-of-he/",
  "scraped_at": "2025-12-18T02:00:50.978571",
  "title": "“He has opened the doors to the demons of Hell”",
  "date_display": "October 23, 2016",
  "date_iso": "2016-10-23T17:00:00+00:00",
  "date_from_url": "2016-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why anyone would still pay any attention to <a href=\"http://www.the-american-interest.com/2016/10/20/as-obamas-clock-winds-down-revisionist-powers-pounce/\">an Obama-voting moron like Walter Russell Mead</a> is well beyond me:</p><blockquote><p> President Obama’s faltering foreign policy has taken another serious hit. It is hard to think of another American president whose foreign policy initiatives failed as badly or as widely as Obama’s. The reconciliation with the Sunni world? The reset with Russia? Stabilizing the Middle East by tilting toward Iran? The Libya invasion? The Syria abstention? The ‘pivot to Asia’ was supposed to be the centerpiece of Obama’s global strategy; instead the waning months of the Obama administration have seen an important U.S. ally pivot toward China in the most public and humiliating way possible.<br> Duterte clearly thinks that humiliating Obama in this way is a solid career move. He certainly believes that China will support him against the critics at home and abroad who will wring their hands over his shift. He presumably has had some assurances from his Chinese hosts that if he commits his cause to them, they will back him to the hilt.</br></p><p>This points to a broader problem: Obama’s tortuous efforts to balance a commitment to human rights and the niceties of American liberal ideology with a strong policy in defense of basic American security interests have made the world less safe for both human rights and for American security. As the revisionist powers (Russia, China, and Iran) gain ground, foreign leaders feel less and less need to pay attention to American sermons about human rights and the rule of law. Death squads and extra-judicial executions on a large scale: the Americans will lecture you but China will still be your friend. Barrel bombing hospitals in Aleppo? The Russians won’t just back you; they will help you to do it. Obama’s foreign policy is making the world safer for people who despise and trample on the very values that Obama hoped his presidency would advance. His lack of strategic insight and his inability to grasp the dynamics of world power politics have opened the door to a new generation of authoritarian figures in alliance with hostile great powers.</p><p>Unintentionally, and with the best of intentions, he has opened the doors to the demons of Hell, and the darkest forces in the human spirit have much greater scope and much more power today than they did when he took the oath of office back in 2009.</p></blockquote><p>Unintentionally? With the best of intentions? Is Mead talking about Obama or himself? Remember, as Mead excoriates Obama’s foreign policy, that he not only voted for Obama, but voted to re-elect him. But it’s not as if Obama’s foreign policy was any better from 2008 to 2012 than it has been from 2012 to 2016.</p><p>Moreover, the man quite obviously has learned nothing from his past mistakes. Juxtapose these two phrases from the same article.</p><ul><li>“Secretary Clinton is well aware of just how damaging the Filipino defection is in Asia; she helped develop the Obama administration’s Asia strategy.”</li><li>“Should Secretary Clinton make it to the White House, her first and biggest job will be to stop and then reverse the deterioration in America’s global position that her predecessor permitted.”</li></ul><p>So, Mead not only voted – twice – for the man who permitted the deterioration in America’s global position, but now advocates voting for the woman who helped develop that failed strategy.</p><p>Either Mead is incredibly stupid, or, as with Obama, we need to question whether he serves those very demons to whom the doors of Hell have been opened.</p><p>If there is not a Trumpslide on November 8th, there is a very good chance that the USA will find itself at war with a Russo-Chinese alliance. And that is a war that a USA saddled with the incompetent and unwell Hillary Clinton as Commander-in-Chief will almost certainly lose.</p></div>",
  "content_text": "Why anyone would still pay any attention to\nan Obama-voting moron like Walter Russell Mead\nis well beyond me:\nPresident Obama’s faltering foreign policy has taken another serious hit. It is hard to think of another American president whose foreign policy initiatives failed as badly or as widely as Obama’s. The reconciliation with the Sunni world? The reset with Russia? Stabilizing the Middle East by tilting toward Iran? The Libya invasion? The Syria abstention? The ‘pivot to Asia’ was supposed to be the centerpiece of Obama’s global strategy; instead the waning months of the Obama administration have seen an important U.S. ally pivot toward China in the most public and humiliating way possible.\nDuterte clearly thinks that humiliating Obama in this way is a solid career move. He certainly believes that China will support him against the critics at home and abroad who will wring their hands over his shift. He presumably has had some assurances from his Chinese hosts that if he commits his cause to them, they will back him to the hilt.\nThis points to a broader problem: Obama’s tortuous efforts to balance a commitment to human rights and the niceties of American liberal ideology with a strong policy in defense of basic American security interests have made the world less safe for both human rights and for American security. As the revisionist powers (Russia, China, and Iran) gain ground, foreign leaders feel less and less need to pay attention to American sermons about human rights and the rule of law. Death squads and extra-judicial executions on a large scale: the Americans will lecture you but China will still be your friend. Barrel bombing hospitals in Aleppo? The Russians won’t just back you; they will help you to do it. Obama’s foreign policy is making the world safer for people who despise and trample on the very values that Obama hoped his presidency would advance. His lack of strategic insight and his inability to grasp the dynamics of world power politics have opened the door to a new generation of authoritarian figures in alliance with hostile great powers.\nUnintentionally, and with the best of intentions, he has opened the doors to the demons of Hell, and the darkest forces in the human spirit have much greater scope and much more power today than they did when he took the oath of office back in 2009.\nUnintentionally? With the best of intentions? Is Mead talking about Obama or himself? Remember, as Mead excoriates Obama’s foreign policy, that he not only voted for Obama, but voted to re-elect him. But it’s not as if Obama’s foreign policy was any better from 2008 to 2012 than it has been from 2012 to 2016.\nMoreover, the man quite obviously has learned nothing from his past mistakes. Juxtapose these two phrases from the same article.\n“Secretary Clinton is well aware of just how damaging the Filipino defection is in Asia; she helped develop the Obama administration’s Asia strategy.”\n“Should Secretary Clinton make it to the White House, her first and biggest job will be to stop and then reverse the deterioration in America’s global position that her predecessor permitted.”\nSo, Mead not only voted – twice – for the man who permitted the deterioration in America’s global position, but now advocates voting for the woman who helped develop that failed strategy.\nEither Mead is incredibly stupid, or, as with Obama, we need to question whether he serves those very demons to whom the doors of Hell have been opened.\nIf there is not a Trumpslide on November 8th, there is a very good chance that the USA will find itself at war with a Russo-Chinese alliance. And that is a war that a USA saddled with the incompetent and unwell Hillary Clinton as Commander-in-Chief will almost certainly lose.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-23T16:00:00+00:00"
}