{
  "url": "https://voxday.net/2016/10/04/interview-with-economic-hit-man/",
  "scraped_at": "2025-12-18T01:57:38.152123",
  "title": "Interview with an economic hit man",
  "date_display": "October 4, 2016",
  "date_iso": "2016-10-04T07:05:00+00:00",
  "date_from_url": "2016-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.zerohedge.com/news/2016-10-03/more-confessions-economic-hit-man-time-they%E2%80%99re-coming-your-democracy\">John Perkins is interviewed</a> by Sarah van Gelder:</p><blockquote><p> Sarah van Gelder: <i>What’s changed in our world since you wrote the first Confessions of an Economic Hit Man?</i></p><p>John Perkins: Things have just gotten so much worse in the last 12 years since the first Confessions was written. Economic hit men and jackals have expanded tremendously, including the United States and Europe.</p><p>Back in my day we were pretty much limited to what we called the third world, or economically developing countries, but now it’s everywhere.</p><p>And in fact, the cancer of the corporate empire has metastasized into what I would call a failed global death economy. This is an economy that’s based on destroying the very resources upon which it depends, and upon the military. It’s become totally global, and it’s a failure.</p><p>van Gelder: <i>So how has this switched from us being the beneficiaries of this hit-man economy, perhaps in the past, to us now being more of the victims of it?</i></p><p>Perkins: It’s been interesting because, in the past, the economic hit man economy was being propagated in order to make America wealthier and presumably to make people here better off, but as this whole process has expanded in the U.S. and Europe, what we’ve seen is a tremendous growth in the very wealthy at the expense of everybody else.</p><p>On a global basis we now know that 62 individuals have as many assets as half the world’s population.</p><p>We of course in the U.S. have seen how our government is frozen, it’s just not working. It’s controlled by the big corporations and they’ve really taken over. They’ve understood that the new market, the new resource, is the U.S. and Europe, and the incredibly awful things that have happened to Greece and Ireland and Iceland, are now happening here in the U.S.</p><p>We’re seeing this situation where we can have what statistically shows economic growth, and at the same time increased foreclosures on homes and unemployment.</p><p>van Gelder: <i>Is this the same kind of dynamic about debt that leads to emergency managers who then turn over the reins of the economy to private enterprises? The same thing that you are seeing in third-world countries?</i></p><p>Perkins: Yes, when I was an economic hit man, one of the things that we did, we raised these huge loans for these countries, but the money never actually went to the countries, it went to our own corporations to build infrastructure in those countries. And when the countries could not pay off their debt, we insisted that they privatize their water systems, their sewage systems, their electric systems.</p><p>Now we’re seeing that same thing happen in the United States. Flint, Michigan, is a very good example of that. This is not a U.S. empire, it’s a corporate empire protected and supported by the U.S. military and the CIA. But it is not an American empire, it’s not helping Americans. It’s exploiting us in the same way that we used to exploit all these other countries around the world.</p></blockquote><p>It’s all about the debt. And debt that can’t be repaid has to be written off, somehow.</p></div>",
  "content_text": "John Perkins is interviewed\nby Sarah van Gelder:\nSarah van Gelder:\nWhat’s changed in our world since you wrote the first Confessions of an Economic Hit Man?\nJohn Perkins: Things have just gotten so much worse in the last 12 years since the first Confessions was written. Economic hit men and jackals have expanded tremendously, including the United States and Europe.\nBack in my day we were pretty much limited to what we called the third world, or economically developing countries, but now it’s everywhere.\nAnd in fact, the cancer of the corporate empire has metastasized into what I would call a failed global death economy. This is an economy that’s based on destroying the very resources upon which it depends, and upon the military. It’s become totally global, and it’s a failure.\nvan Gelder:\nSo how has this switched from us being the beneficiaries of this hit-man economy, perhaps in the past, to us now being more of the victims of it?\nPerkins: It’s been interesting because, in the past, the economic hit man economy was being propagated in order to make America wealthier and presumably to make people here better off, but as this whole process has expanded in the U.S. and Europe, what we’ve seen is a tremendous growth in the very wealthy at the expense of everybody else.\nOn a global basis we now know that 62 individuals have as many assets as half the world’s population.\nWe of course in the U.S. have seen how our government is frozen, it’s just not working. It’s controlled by the big corporations and they’ve really taken over. They’ve understood that the new market, the new resource, is the U.S. and Europe, and the incredibly awful things that have happened to Greece and Ireland and Iceland, are now happening here in the U.S.\nWe’re seeing this situation where we can have what statistically shows economic growth, and at the same time increased foreclosures on homes and unemployment.\nvan Gelder:\nIs this the same kind of dynamic about debt that leads to emergency managers who then turn over the reins of the economy to private enterprises? The same thing that you are seeing in third-world countries?\nPerkins: Yes, when I was an economic hit man, one of the things that we did, we raised these huge loans for these countries, but the money never actually went to the countries, it went to our own corporations to build infrastructure in those countries. And when the countries could not pay off their debt, we insisted that they privatize their water systems, their sewage systems, their electric systems.\nNow we’re seeing that same thing happen in the United States. Flint, Michigan, is a very good example of that. This is not a U.S. empire, it’s a corporate empire protected and supported by the U.S. military and the CIA. But it is not an American empire, it’s not helping Americans. It’s exploiting us in the same way that we used to exploit all these other countries around the world.\nIt’s all about the debt. And debt that can’t be repaid has to be written off, somehow.",
  "tags": [
    "decline and fall",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-04T06:05:00+00:00"
}