{
  "url": "https://voxday.net/2016/10/03/kim-kardashian-robbed-in-paris/",
  "scraped_at": "2025-12-18T01:57:30.867261",
  "title": "Kim Kardashian robbed in Paris!",
  "date_display": "October 3, 2016",
  "date_iso": "2016-10-03T12:00:00+00:00",
  "date_from_url": "2016-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yeah, right.</p><p>To return to matters of actual interest to me, it’s interesting to see how, despite authoring two volumes of a significant new book, Francis Fukuyama’s public relations efforts appears to have been sidelined into an ongoing defense of the indefensible, which are his collective attempts to defend and retroactively redefine <a href=\"https://www.theguardian.com/books/2014/mar/21/bring-back-ideology-fukuyama-end-history-25-years-on\">his increasingly ludicrous End of History thesis</a>:</p><blockquote><p> In the summer of 1989, the American magazine the National Interest published an essay with the strikingly bold title “The End of History?”. Its author, the political scientist Francis Fukuyama, announced that the great ideological battles between east and west were over, and that western liberal democracy had triumphed. With anti-communist protests sweeping across the former Soviet Union, the essay seemed right on the money. Fukuyama became an unlikely star of political science, dubbed the “court philosopher of global capitalism” by John Gray. When his book <i>The End of History and the Last Man</i> appeared three years later, the qualifying question mark was gone.</p><p>The “end of history” thesis has been repeated enough to acquire the ring of truth – though it has also, of course, been challenged. Some critics have cited 9/11 as a major counterexample. Others have pointed to the rise of Islamic fundamentalism and the Arab spring as proof that ideological contests remain.</p><p>But Fukuyama was careful to stress that he was not saying that nothing significant would happen any more, or that there would be no countries left in the world that did not conform to the liberal democratic model. “At the end of history,” he wrote, “it is not necessary that all societies become successful liberal societies, merely that they end their ideological pretensions of representing different and higher forms of human society.”</p><p>Fukuyama was talking about ideas rather than events. He believed that western liberal democracy, with its elegant balance of liberty and equality, could not be bettered; that its attainment would lead to a general calming in world affairs; and that in the long run it would be the only credible game in town. “What we are witnessing,” he wrote, “is not just the end of the cold war, or a passing of a particular period of postwar history, but the end of history as such: that is, the end point of mankind’s ideological evolution and the universalisation of western liberal democracy as the final form of human government.”</p><p>Fukuyama drew on the philosophy of Hegel, who defined history as a linear procession of epochs. Technological progress and the cumulative resolution of conflict allowed humans to advance from tribal to feudal to industrial society. For Marx, the journey ended with communism; Fukuyama was announcing a new destination.</p><p>For a long time his argument proved oddly resilient to challenges from the left. Neoliberalism has been pretty hegemonic. Over the last three years, however, in a belated reaction to the 2008 bank bailouts, cracks have started to appear. Global Occupy protests and demonstrations against austerity have led many commentators on the left – including the French philosopher Alain Badiou in The Rebirth of History and Seumas Milne in his collection of essays The Revenge of History – to wonder whether history is on the march once again. “What is going on?” asks Badiou. “The continuation, at all costs, of a weary world? A salutary crisis of that world, racked by its victorious expansion? The end of that world? The advent of a different world?” He tentatively regards the uprisings of 2011 as game-changing, with the potential to usher in a new political order. For Milne, likewise, developments such as the failure of the US to “democratise” Iraq and Afghanistan, the financial crash and the flowering of socialism in Latin America demonstrate the “passing of the unipolar moment”.</p><p>What remains an open question is whether these developments – dramatic as they are – will actually result in anything.</p></blockquote><p>Frankly, the whole thing is somewhat of a disappointment to me. To discover that Jesus Jones’s conception of “watching the world wake up from History” is both more sophisticated and accurate than Fukuyama’s is devastating to anyone who would fancy himself an intellectual.</p><p>Fukuyama’s mistake was to apply History’s end to liberal democracy rather than to Marxism, where it belonged.</p><p>Anyhow, both Fukuyama and Marx were wrong. They went full-Hegel. Never go full-Hegel. And you can’t bring back ideology in multicultural societies where identity politics are destined to rule until they are homogenous again.</p></div>",
  "content_text": "Yeah, right.\nTo return to matters of actual interest to me, it’s interesting to see how, despite authoring two volumes of a significant new book, Francis Fukuyama’s public relations efforts appears to have been sidelined into an ongoing defense of the indefensible, which are his collective attempts to defend and retroactively redefine\nhis increasingly ludicrous End of History thesis\n:\nIn the summer of 1989, the American magazine the National Interest published an essay with the strikingly bold title “The End of History?”. Its author, the political scientist Francis Fukuyama, announced that the great ideological battles between east and west were over, and that western liberal democracy had triumphed. With anti-communist protests sweeping across the former Soviet Union, the essay seemed right on the money. Fukuyama became an unlikely star of political science, dubbed the “court philosopher of global capitalism” by John Gray. When his book\nThe End of History and the Last Man\nappeared three years later, the qualifying question mark was gone.\nThe “end of history” thesis has been repeated enough to acquire the ring of truth – though it has also, of course, been challenged. Some critics have cited 9/11 as a major counterexample. Others have pointed to the rise of Islamic fundamentalism and the Arab spring as proof that ideological contests remain.\nBut Fukuyama was careful to stress that he was not saying that nothing significant would happen any more, or that there would be no countries left in the world that did not conform to the liberal democratic model. “At the end of history,” he wrote, “it is not necessary that all societies become successful liberal societies, merely that they end their ideological pretensions of representing different and higher forms of human society.”\nFukuyama was talking about ideas rather than events. He believed that western liberal democracy, with its elegant balance of liberty and equality, could not be bettered; that its attainment would lead to a general calming in world affairs; and that in the long run it would be the only credible game in town. “What we are witnessing,” he wrote, “is not just the end of the cold war, or a passing of a particular period of postwar history, but the end of history as such: that is, the end point of mankind’s ideological evolution and the universalisation of western liberal democracy as the final form of human government.”\nFukuyama drew on the philosophy of Hegel, who defined history as a linear procession of epochs. Technological progress and the cumulative resolution of conflict allowed humans to advance from tribal to feudal to industrial society. For Marx, the journey ended with communism; Fukuyama was announcing a new destination.\nFor a long time his argument proved oddly resilient to challenges from the left. Neoliberalism has been pretty hegemonic. Over the last three years, however, in a belated reaction to the 2008 bank bailouts, cracks have started to appear. Global Occupy protests and demonstrations against austerity have led many commentators on the left – including the French philosopher Alain Badiou in The Rebirth of History and Seumas Milne in his collection of essays The Revenge of History – to wonder whether history is on the march once again. “What is going on?” asks Badiou. “The continuation, at all costs, of a weary world? A salutary crisis of that world, racked by its victorious expansion? The end of that world? The advent of a different world?” He tentatively regards the uprisings of 2011 as game-changing, with the potential to usher in a new political order. For Milne, likewise, developments such as the failure of the US to “democratise” Iraq and Afghanistan, the financial crash and the flowering of socialism in Latin America demonstrate the “passing of the unipolar moment”.\nWhat remains an open question is whether these developments – dramatic as they are – will actually result in anything.\nFrankly, the whole thing is somewhat of a disappointment to me. To discover that Jesus Jones’s conception of “watching the world wake up from History” is both more sophisticated and accurate than Fukuyama’s is devastating to anyone who would fancy himself an intellectual.\nFukuyama’s mistake was to apply History’s end to liberal democracy rather than to Marxism, where it belonged.\nAnyhow, both Fukuyama and Marx were wrong. They went full-Hegel. Never go full-Hegel. And you can’t bring back ideology in multicultural societies where identity politics are destined to rule until they are homogenous again.",
  "tags": [
    "books",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-03T11:00:00+00:00"
}