{
  "url": "https://voxday.net/2016/10/26/let-them-laug/",
  "scraped_at": "2025-12-18T02:01:17.544194",
  "title": "Let them laugh",
  "date_display": "October 26, 2016",
  "date_iso": "2016-10-26T07:54:00+00:00",
  "date_from_url": "2016-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember when SJWs were laughing about how “Opera Vita Aeterna” finished behind No Award in the 2014 Hugo Awards? Then remember the shock and horror they expressed when the nominations for the 2015 awards were announced?</p><p>Let them laugh about Infogalactic now. Let them scoff and sneer, as is their usual wont. Not only is everything going according to plan, but the plan has been accelerated, we have more dev volunteers than were expected, after 16 days we are just three short of the 100 subscribers we hoped would <a href=\"http://infogalactic.com/info/Infogalactic:Donations\">sign up</a> in the first three months, and we’re already seeing third-party developers wanting to integrate with us. By this time next week, we should have add-on extensions for Firefox, Chrome, and Opera that will allow you to make Infogalactic your default search engine to go with the current redirect extensions.</p><p>It was not surprising to see our old pal Pedophil didn’t pass up the chance to strike the customary SJW pose.</p><p>Phil Sandifer ‏@PhilSandifer Oct 24<br> <i>Seriously, even for Vox Day, the Dumpster Fire that Walks Like a Man, Infogalactic is an amateur hour shitwreck.</i></br></p><p>If you had any doubt that Phil is totally clueless with regards to technology before, now you have confirmation. No one who knows anything about Wikipedia or MediaWiki would say we don’t know what we’re doing. One might not concur entirely with our priorities, or understand our objectives, but the combination of what we’ve accomplished to date, combined with the Roadmap, is sufficient to indicate that we are neither entirely incompetent nor amateur developers.</p><p>As it happens, we know the highest levels at Wikipedia are paying close attention to what we’re doing because they’ve already been in contact with us. I would describe their attitude as half-confused, half-concerned. They know they can’t do what we’re already in the process of doing, nor do they have a good grasp of why we’re doing it in the first place. So, don’t be surprised if, in the long run, they end up using <i>our </i>technology.</p><p>Phil Sandifer ‏@PhilSandifer Oct 24<br> <i>But if you want a detailed plot summary for an unreleased video game, well, someone definitely added that today.</i><br> <i><br/></i><br> And he thinks that is <i>a bad thing? </i>That is exactly the sort of thing I’d hoped to see Galaxians putting on Infogalactic. We’re not the Notable Knowledge From Sources Our Thought Police Deem Reliable Core, we’re the Planetary Knowledge Core.</br></br></br></p><p>Let them laugh. It will make their dawning horror all the more satisfying when Phase Three arrives.</p><p> UPDATE: Should have mentioned this: Safari users now have an extension that will redirect Wikipedia links to Infogalactic. <a href=\"http://www.peircecentral.com/infosextant.safariextz\">Download it here</a>. I am also informed that extensions adding Infogalactic as a default search engine option will be available next week.</p><p> UPDATE: One of the VFM explains why it is time to stick a fork in Wikipedia and <a href=\"https://hawaiianlibertarian.blogspot.com/2016/10/putting-fork-in-it.html\">why he is supporting Infogalactic</a>:</p><blockquote><p> Our Dark Lord of the Evil Legion of Evil is leading the way showing those of us who are awake, that we don’t have to take the continued SJW convergence of our institutions, social media and other mediums of thoughts and expressions lying down…that we CAN actually do something to fight back.</p><p>SJW’s converged Science Fiction? Our Dark Lord went and co-founded his own damn publishing house and is now producing literary works with themes and narratives that have been largely suppressed by the traditional publishing houses seeking to control the narrative.</p><p>Alt-Right folks getting shadow-banned or outright banned on Twitter? He’s one of the leading users and supporter for Gab, a new social media platform alternative, which unlike Twitter, is dedicated to upholding real free speech for it’s participants.</p><p>While leading thousands on an exodus from an SJW converged mainstream social media platform and founding a successful publishing house of best-selling, politically incorrect literature are both major accomplishments by our Dark Lord in the 21st Century culture wars in our Brave New World Order, it his latest act of counter-insurgency that I hope grows into his most successful venture to date.</p><p>It is the badly needed and long overdue answer to the SJWs attempted control of the narrative by manufacturing consensus with heavy handed and persistent  censorship and suppression of politically incorrect topics on Wikipedia.</p></blockquote></div>",
  "content_text": "Remember when SJWs were laughing about how “Opera Vita Aeterna” finished behind No Award in the 2014 Hugo Awards? Then remember the shock and horror they expressed when the nominations for the 2015 awards were announced?\nLet them laugh about Infogalactic now. Let them scoff and sneer, as is their usual wont. Not only is everything going according to plan, but the plan has been accelerated, we have more dev volunteers than were expected, after 16 days we are just three short of the 100 subscribers we hoped would\nsign up\nin the first three months, and we’re already seeing third-party developers wanting to integrate with us. By this time next week, we should have add-on extensions for Firefox, Chrome, and Opera that will allow you to make Infogalactic your default search engine to go with the current redirect extensions.\nIt was not surprising to see our old pal Pedophil didn’t pass up the chance to strike the customary SJW pose.\nPhil Sandifer ‏@PhilSandifer Oct 24\nSeriously, even for Vox Day, the Dumpster Fire that Walks Like a Man, Infogalactic is an amateur hour shitwreck.\nIf you had any doubt that Phil is totally clueless with regards to technology before, now you have confirmation. No one who knows anything about Wikipedia or MediaWiki would say we don’t know what we’re doing. One might not concur entirely with our priorities, or understand our objectives, but the combination of what we’ve accomplished to date, combined with the Roadmap, is sufficient to indicate that we are neither entirely incompetent nor amateur developers.\nAs it happens, we know the highest levels at Wikipedia are paying close attention to what we’re doing because they’ve already been in contact with us. I would describe their attitude as half-confused, half-concerned. They know they can’t do what we’re already in the process of doing, nor do they have a good grasp of why we’re doing it in the first place. So, don’t be surprised if, in the long run, they end up using\nour\ntechnology.\nPhil Sandifer ‏@PhilSandifer Oct 24\nBut if you want a detailed plot summary for an unreleased video game, well, someone definitely added that today.\nAnd he thinks that is\na bad thing?\nThat is exactly the sort of thing I’d hoped to see Galaxians putting on Infogalactic. We’re not the Notable Knowledge From Sources Our Thought Police Deem Reliable Core, we’re the Planetary Knowledge Core.\nLet them laugh. It will make their dawning horror all the more satisfying when Phase Three arrives.\nUPDATE: Should have mentioned this: Safari users now have an extension that will redirect Wikipedia links to Infogalactic.\nDownload it here\n. I am also informed that extensions adding Infogalactic as a default search engine option will be available next week.\nUPDATE: One of the VFM explains why it is time to stick a fork in Wikipedia and\nwhy he is supporting Infogalactic\n:\nOur Dark Lord of the Evil Legion of Evil is leading the way showing those of us who are awake, that we don’t have to take the continued SJW convergence of our institutions, social media and other mediums of thoughts and expressions lying down…that we CAN actually do something to fight back.\nSJW’s converged Science Fiction? Our Dark Lord went and co-founded his own damn publishing house and is now producing literary works with themes and narratives that have been largely suppressed by the traditional publishing houses seeking to control the narrative.\nAlt-Right folks getting shadow-banned or outright banned on Twitter? He’s one of the leading users and supporter for Gab, a new social media platform alternative, which unlike Twitter, is dedicated to upholding real free speech for it’s participants.\nWhile leading thousands on an exodus from an SJW converged mainstream social media platform and founding a successful publishing house of best-selling, politically incorrect literature are both major accomplishments by our Dark Lord in the 21st Century culture wars in our Brave New World Order, it his latest act of counter-insurgency that I hope grows into his most successful venture to date.\nIt is the badly needed and long overdue answer to the SJWs attempted control of the narrative by manufacturing consensus with heavy handed and persistent  censorship and suppression of politically incorrect topics on Wikipedia.",
  "tags": [
    "#AltTech",
    "Infogalactic",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-26T06:54:00+00:00"
}