{
  "url": "https://voxday.net/2016/10/20/maga-mindset-reviews/",
  "scraped_at": "2025-12-18T02:00:17.341507",
  "title": "MAGA Mindset reviews",
  "date_display": "October 20, 2016",
  "date_iso": "2016-10-20T09:36:00+00:00",
  "date_from_url": "2016-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, thanks to everyone who made <i><a href=\"http://amzn.to/2ergm0q\"><b>MAGA Mindset</b></a></i> Castalia’s second-most-successful book launch after <i>Cuckservative</i>. That was great; Mike noted that it was even more successful than his <i>Gorilla Mindset</i> launch. And more than a day after its launch, it is still in the Amazon top 250.</p><p>A couple of people have posted reviews I thought worth highlighting here, first of all, <a href=\"http://www.calebqwashington.com/2016/10/19/review-of-maga-mindset-by-mike-cernovich/\">Caleb Q. Washington</a>:</p><blockquote><p> If I had to describe the book in just a sentence, it is <i>SJWs Always Lie</i> meets <i>Gorilla Mindset</i> condensed to their core, with a unifying theme of Donald Trump.</p><p>The book is divided into three sections on culture, media and mindset. The first lays out, in brutal terms, the cultural landscape of modern America and how it paved the way for Trump’s rise. Cernovich does it in such a way that he won’t sound like a conspiracy theorist to uninitiated readers, which is really hard to do given the gulf between reality and the media created dreamworld most of America lives in. The first section is as good of a redpill as any I’ve seen. It will convert people to Alt-Right….</p><p>For people like me, who read Cernovich &amp; Vox Day blogs and books, who know the state of cultural rot in America, who already see the media as adversarial to the American nation, this book is going to feel like it’s preaching to the choir and telling you things you already agree with. This book was written to create more allies for us. You should read it, enjoy a well done work pushing your worldview and pass it on to people who it will impact greatly.</p></blockquote><p>He’s right. <i>MAGA Mindset</i> is a great starting point for young men and women who sense that there is something wrong with America, but would be overwhelmed by the likes of <a href=\"http://amzn.to/1sBYA10\">SJWAL </a>and <i><a href=\"http://amzn.to/1Wnka63\">Cuckservative</a></i>. It’s short, it’s succinct, and it’s straight to the point.</p><p>The notorious Charles C. Johnson took a break from his various nefarious plans to wreak havoc throughout the world <a href=\"http://gotnews.com/maga-mindset-review-mike-cernovichs-groundbreaking-new-book-realdonaldtrump-media-mindset/\">to write a review</a> as well:</p><blockquote><p> You may ask: are you really telling me Donald Trump fought the world and won just thanks to his mindset?</p><p>Yes. And Mike Cernovich makes that compelling case in MAGA Mindset, using Donald Trump’s boyhood pastor, who was also a best-selling author of “positive thinking” books, as evidence.</p><p>And it looks like he’s right. Trump never backs down, never stops fighting, and always wins in the end.</p><p>But it all begins in his head.</p></blockquote><p>I am genuinely alarmed. Chuck Johnson is a <i>serious </i>dark lord, and the idea of him applying even some of the lessons taught in MAGA Mindset is not only frightening, it is almost beyond imagining. He is the Dr. Evil of the Alt-Right. In other news, Mike Glyer of File 770 <a href=\"http://file770.com/?p=31413\">was amused</a> by the press release Castalia’s PR team sent out to the media concerning Mike’s latest book:</p><blockquote><p> Mike Cernovich’s new book, <i>MAGA MINDSET: Making YOU and America Great Again</i>, is the #1 bestseller in Amazon’s Politics &amp; Social Sciences&gt;Leadership category. That’s not surprising, as his prevous book, <i>Gorilla Mindset</i>, self-published in 2015, was also a bestseller</p><p>What is surprising, however, is that languishing behind the Donald Trump-supporting author’s latest bestseller is <i>Stronger Together</i>, a book published only last month, written by Democratic Party presidential candidate Hillary Clinton and her running mate, Sen. Tim Kaine. The Clinton-Kaine book, signed by Simon &amp; Schuster to $14 million advance, currently sits at 5th place in the category…..</p><p>The new Cernovich bestseller, signed to an advance that was, according to Day, “pretty close to $14 million less than Clinton and Kaine got,”….</p></blockquote><p>As always, the perspicacious commenters at File 770 didn’t hesitate to demonstrate <a href=\"http://file770.com/?p=31413#comment-492438\">their astuteness and keen powers of observation</a> in all matters even tangentially related to the Supreme Dark Lord.</p><p><i>“Teddy doesn’t mention it’s number one in that tiny subcategory because it was FREE, and listed prominently on ebook freebie sites. I follow a couple so I don’t remember which.”</i><br> <i><br/></i><br> One almost has to admire their determination to stick to the Narrative no matter what the actual, readily confirmable facts are. As it happens:</br></br></p><ul><li>The book is $7.99 for ebook, $9.99 for paperback.</li><li>The book ranked #226 on all of Amazon and #22 in Nonfiction.</li><li>The #2 book in the Media Studies category has 831 reviews and is ranked #3,425 on Amazon.</li><li>The #2 book in the Leadership category has 971 reviews and is ranked #803 on Amazon.</li></ul></div>",
  "content_text": "First, thanks to everyone who made\nMAGA Mindset\nCastalia’s second-most-successful book launch after\nCuckservative\n. That was great; Mike noted that it was even more successful than his\nGorilla Mindset\nlaunch. And more than a day after its launch, it is still in the Amazon top 250.\nA couple of people have posted reviews I thought worth highlighting here, first of all,\nCaleb Q. Washington\n:\nIf I had to describe the book in just a sentence, it is\nSJWs Always Lie\nmeets\nGorilla Mindset\ncondensed to their core, with a unifying theme of Donald Trump.\nThe book is divided into three sections on culture, media and mindset. The first lays out, in brutal terms, the cultural landscape of modern America and how it paved the way for Trump’s rise. Cernovich does it in such a way that he won’t sound like a conspiracy theorist to uninitiated readers, which is really hard to do given the gulf between reality and the media created dreamworld most of America lives in. The first section is as good of a redpill as any I’ve seen. It will convert people to Alt-Right….\nFor people like me, who read Cernovich & Vox Day blogs and books, who know the state of cultural rot in America, who already see the media as adversarial to the American nation, this book is going to feel like it’s preaching to the choir and telling you things you already agree with. This book was written to create more allies for us. You should read it, enjoy a well done work pushing your worldview and pass it on to people who it will impact greatly.\nHe’s right.\nMAGA Mindset\nis a great starting point for young men and women who sense that there is something wrong with America, but would be overwhelmed by the likes of\nSJWAL\nand\nCuckservative\n. It’s short, it’s succinct, and it’s straight to the point.\nThe notorious Charles C. Johnson took a break from his various nefarious plans to wreak havoc throughout the world\nto write a review\nas well:\nYou may ask: are you really telling me Donald Trump fought the world and won just thanks to his mindset?\nYes. And Mike Cernovich makes that compelling case in MAGA Mindset, using Donald Trump’s boyhood pastor, who was also a best-selling author of “positive thinking” books, as evidence.\nAnd it looks like he’s right. Trump never backs down, never stops fighting, and always wins in the end.\nBut it all begins in his head.\nI am genuinely alarmed. Chuck Johnson is a\nserious\ndark lord, and the idea of him applying even some of the lessons taught in MAGA Mindset is not only frightening, it is almost beyond imagining. He is the Dr. Evil of the Alt-Right. In other news, Mike Glyer of File 770\nwas amused\nby the press release Castalia’s PR team sent out to the media concerning Mike’s latest book:\nMike Cernovich’s new book,\nMAGA MINDSET: Making YOU and America Great Again\n, is the #1 bestseller in Amazon’s Politics & Social Sciences>Leadership category. That’s not surprising, as his prevous book,\nGorilla Mindset\n, self-published in 2015, was also a bestseller\nWhat is surprising, however, is that languishing behind the Donald Trump-supporting author’s latest bestseller is\nStronger Together\n, a book published only last month, written by Democratic Party presidential candidate Hillary Clinton and her running mate, Sen. Tim Kaine. The Clinton-Kaine book, signed by Simon & Schuster to $14 million advance, currently sits at 5th place in the category…..\nThe new Cernovich bestseller, signed to an advance that was, according to Day, “pretty close to $14 million less than Clinton and Kaine got,”….\nAs always, the perspicacious commenters at File 770 didn’t hesitate to demonstrate\ntheir astuteness and keen powers of observation\nin all matters even tangentially related to the Supreme Dark Lord.\n“Teddy doesn’t mention it’s number one in that tiny subcategory because it was FREE, and listed prominently on ebook freebie sites. I follow a couple so I don’t remember which.”\nOne almost has to admire their determination to stick to the Narrative no matter what the actual, readily confirmable facts are. As it happens:\nThe book is $7.99 for ebook, $9.99 for paperback.\nThe book ranked #226 on all of Amazon and #22 in Nonfiction.\nThe #2 book in the Media Studies category has 831 reviews and is ranked #3,425 on Amazon.\nThe #2 book in the Leadership category has 971 reviews and is ranked #803 on Amazon.",
  "tags": [
    "#AltRight",
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-20T08:36:00+00:00"
}