{
  "url": "https://voxday.net/2016/10/08/mailvox-category-error/",
  "scraped_at": "2025-12-18T01:58:23.560234",
  "title": "Mailvox: category error",
  "date_display": "October 8, 2016",
  "date_iso": "2016-10-08T12:18:00+00:00",
  "date_from_url": "2016-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Do you discuss ‘category error’ somewhere in your past blogs?</i></p><p>No, but <a href=\"https://infogalactic.com/info/Category_mistake\">here is a brief explanation</a>, although upon looking at it, it really could be considerably improved as the examples are rather pedantic.</p><p><i>A category mistake, or category error, is a semantic or ontological error in which things belonging to a particular category are presented as if they belong to a different category, or, alternatively, a property is ascribed to a thing that could not possibly have that property. An example is the metaphor “time crawled”, which if taken literally is not just false but a category mistake. To show that a category mistake has been committed one must typically show that once the phenomenon in question is properly understood, it becomes clear that the claim being made about it could not possibly be true.</i></p><p>Category errors are very common, particularly when engaged in discourse with intellectually sloppy or dishonest individuals. For example, after I pointed out that weakness combined with a request for help was not “true strength”, or even strength at all, Mark Butterworth responded by quoting a Psalm about David’s sacrifice to God.</p><p>He wasn’t merely wrong, by which I mean a failure to successfully make a point, he committed an error of category, because offering up one’s weaknesses to God in praise is fundamentally different in nature than determining if the characteristic one possesses is a weakness or a strength.</p><p>The abstract category under discussion was “the nature of human strength.” To respond by pointing out that God does not despise weakness offered up to Him as sacrifice is to shift the discussion to a different and tangential category, “things that God values”, which is a category that is simply not relevant to the matter being discussed.</p><p>So, to point out that someone has made a category error does not necessarily mean that one is saying their statement is intrinsically false or incorrect, only that it is <i>irrelevant</i>. People usually commit category errors out of carelessness or ignorance or a desire to virtue-signal; when they do so out of dishonesty it is often as part of a bait-and-switch technique to which they resort because they know they cannot defend their position within the bounds of the relevant category.</p></div>",
  "content_text": "Do you discuss ‘category error’ somewhere in your past blogs?\nNo, but\nhere is a brief explanation\n, although upon looking at it, it really could be considerably improved as the examples are rather pedantic.\nA category mistake, or category error, is a semantic or ontological error in which things belonging to a particular category are presented as if they belong to a different category, or, alternatively, a property is ascribed to a thing that could not possibly have that property. An example is the metaphor “time crawled”, which if taken literally is not just false but a category mistake. To show that a category mistake has been committed one must typically show that once the phenomenon in question is properly understood, it becomes clear that the claim being made about it could not possibly be true.\nCategory errors are very common, particularly when engaged in discourse with intellectually sloppy or dishonest individuals. For example, after I pointed out that weakness combined with a request for help was not “true strength”, or even strength at all, Mark Butterworth responded by quoting a Psalm about David’s sacrifice to God.\nHe wasn’t merely wrong, by which I mean a failure to successfully make a point, he committed an error of category, because offering up one’s weaknesses to God in praise is fundamentally different in nature than determining if the characteristic one possesses is a weakness or a strength.\nThe abstract category under discussion was “the nature of human strength.” To respond by pointing out that God does not despise weakness offered up to Him as sacrifice is to shift the discussion to a different and tangential category, “things that God values”, which is a category that is simply not relevant to the matter being discussed.\nSo, to point out that someone has made a category error does not necessarily mean that one is saying their statement is intrinsically false or incorrect, only that it is\nirrelevant\n. People usually commit category errors out of carelessness or ignorance or a desire to virtue-signal; when they do so out of dishonesty it is often as part of a bait-and-switch technique to which they resort because they know they cannot defend their position within the bounds of the relevant category.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-08T11:18:00+00:00"
}