{
  "url": "https://voxday.net/2016/10/18/mailvox-women-in-science/",
  "scraped_at": "2025-12-18T02:00:02.057454",
  "title": "Mailvox: women in science",
  "date_display": "October 18, 2016",
  "date_iso": "2016-10-18T15:30:00+00:00",
  "date_from_url": "2016-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It shouldn’t take a rocket scientist to figure out what is going to happen if you put a selection of intelligent, not very attractive women in amongst the biggest collection of gamma males in the known universe:</p><blockquote><p> I’m a STEM worker, at a research lab. Lots of females have come through here. Increasingly more over the years. I have to say that most of them are coasters. Let’s face it, I’m dealing with a LOT of socially challenged men here. This is NERD CENTRAL.</p><p>The girls are VERY adept at getting the guys to do the heavy lifting for them. And, they are even more adept at establishing social networks beyond the ken of anything your standard issue STEM male could possibly comprehend.</p><p>This has led to some very interesting situations.</p><p>But, on the whole, the women in my 17-year history with this lab have caused FAR more problems than they have solved.</p><p>Of course, there is the odd exception, when you find a female scientist or engineer who is an absolute treasure. They DO exist.</p><p>But they represent a very small percentage of the women coming through here. And the chaos caused by all the other women makes one wonder if they are worth it.</p><p>Sad to say. VERY sad to say. C’mon we WANT HOT SEXY BABES WORKING HERE! WE ARE A LEGION OF GEEKS!</p></blockquote><p>First, these women are naturally going to be inclined to make up for lost time in enjoying their high relative SMV for the first time in their lives. Second, it’s going to be the cheerleader/geek homework scenario writ large. Third, women are going to take over and rule the administration and HR, and promptly steer the organizations in the direction that happens to be of interest to them, which may or may not have anything to do with either a) science, or, b) the nominal purpose of the organization.</p><p>And it will happen <i>every single time</i>. No amount of education or professional training trumps the socio-sexual hierarchy.</p><p>The primary contribution any woman can make for science is to stay completely out of it. No matter how good she is, no matter how smart she is, she cannot <i>possibly </i>compensate for the complete devastation and distraction she is going to leave in her wake over the course of her career among the socially and sexually hapless gammas who might have otherwise happily spent decades slaving away in the laboratories.</p></div>",
  "content_text": "It shouldn’t take a rocket scientist to figure out what is going to happen if you put a selection of intelligent, not very attractive women in amongst the biggest collection of gamma males in the known universe:\nI’m a STEM worker, at a research lab. Lots of females have come through here. Increasingly more over the years. I have to say that most of them are coasters. Let’s face it, I’m dealing with a LOT of socially challenged men here. This is NERD CENTRAL.\nThe girls are VERY adept at getting the guys to do the heavy lifting for them. And, they are even more adept at establishing social networks beyond the ken of anything your standard issue STEM male could possibly comprehend.\nThis has led to some very interesting situations.\nBut, on the whole, the women in my 17-year history with this lab have caused FAR more problems than they have solved.\nOf course, there is the odd exception, when you find a female scientist or engineer who is an absolute treasure. They DO exist.\nBut they represent a very small percentage of the women coming through here. And the chaos caused by all the other women makes one wonder if they are worth it.\nSad to say. VERY sad to say. C’mon we WANT HOT SEXY BABES WORKING HERE! WE ARE A LEGION OF GEEKS!\nFirst, these women are naturally going to be inclined to make up for lost time in enjoying their high relative SMV for the first time in their lives. Second, it’s going to be the cheerleader/geek homework scenario writ large. Third, women are going to take over and rule the administration and HR, and promptly steer the organizations in the direction that happens to be of interest to them, which may or may not have anything to do with either a) science, or, b) the nominal purpose of the organization.\nAnd it will happen\nevery single time\n. No amount of education or professional training trumps the socio-sexual hierarchy.\nThe primary contribution any woman can make for science is to stay completely out of it. No matter how good she is, no matter how smart she is, she cannot\npossibly\ncompensate for the complete devastation and distraction she is going to leave in her wake over the course of her career among the socially and sexually hapless gammas who might have otherwise happily spent decades slaving away in the laboratories.",
  "tags": [
    "Alpha Game",
    "science",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-18T14:30:00+00:00"
}