{
  "url": "https://voxday.net/2016/10/02/obamacare-in-action/",
  "scraped_at": "2025-12-18T01:57:27.102167",
  "title": "Obamacare in action",
  "date_display": "October 2, 2016",
  "date_iso": "2016-10-02T23:04:00+00:00",
  "date_from_url": "2016-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Minnesota may not have any <a href=\"http://www.fox9.com/health/208893336-story\">insurance companies</a> soon:</p><blockquote><p> Minnesota’s top health insurance regulator says the state’s individual market is in “an emergency situation” amid big rate increases for next year.</p><p>Department of Commerce Commissioner Mike Rothman said Friday that the five companies offering plans through the state’s exchange or directly to consumers were prepared to leave the market for 2017. He said big rate increases were the tradeoff to convince all but one company to remain for now.</p><p>Rate increases finalized this week range from a 50 percent average hike for HealthPartners plans to a 67 percent jump on average on UCare.</p><p>But Rothman called it a temporary fix and called on lawmakers to make reforms before the market collapses.</p></blockquote><p>It’s rather fascinating to see how one institution after another is collapsing like dominoes while everyone wanders aimlessly around wringing their hands and wondering how this could have happened.</p><p>It tends to remind me a little of when a girl in my class and a boy the class below me died in separate, but similarly stupid, easily avoidable accidents. I kept my mouth shut out of respect for everyone else’s feelings, of course, but it was occasionally difficult when a plaintive “why?” would be uttered in conversation.</p><p>Now, there are certainly times when one genuinely wonders why something bad came to pass, believe me, it’s a question I have found myself asking from time to time. But there are also times when the answer is completely obvious and totally undeniable. I mean, if you absolutely must point an apparently gun at yourself and pull the trigger to impress your friends, maybe, <i>just maybe</i>, you might want to <i>check the chamber</i> as well as eject the magazine.</p><p>The USA is collapsing because it is not the United States of America anymore. Its human and military capital have been considerably drawn down. The people who are the posterity of the Founders have been invaded and overrun, the various propositions and creeds that made their culture exceptional have been rejected by nationals, citizens, and invaders alike, and the remnants of their religion is a watered-down, treasonous, pharisaical Judeo-Churchianity that is a pale shadow of the unadulterated Christianity that once fearlessly proclaimed “No King but Jesus” to the English Crown.</p><p>Now they are afraid to call abomination and adultery sin. Instead, they preach against masculinity and nationalism.</p><p>So, what else would you expect? I mean, seriously, what other outcome could there possibly be?</p><p>Do you not see that the pace of the financial rapine has increased as well? That’s the elite, desperately attempting to make hay while the setting sun still shines.</p></div>",
  "content_text": "Minnesota may not have any\ninsurance companies\nsoon:\nMinnesota’s top health insurance regulator says the state’s individual market is in “an emergency situation” amid big rate increases for next year.\nDepartment of Commerce Commissioner Mike Rothman said Friday that the five companies offering plans through the state’s exchange or directly to consumers were prepared to leave the market for 2017. He said big rate increases were the tradeoff to convince all but one company to remain for now.\nRate increases finalized this week range from a 50 percent average hike for HealthPartners plans to a 67 percent jump on average on UCare.\nBut Rothman called it a temporary fix and called on lawmakers to make reforms before the market collapses.\nIt’s rather fascinating to see how one institution after another is collapsing like dominoes while everyone wanders aimlessly around wringing their hands and wondering how this could have happened.\nIt tends to remind me a little of when a girl in my class and a boy the class below me died in separate, but similarly stupid, easily avoidable accidents. I kept my mouth shut out of respect for everyone else’s feelings, of course, but it was occasionally difficult when a plaintive “why?” would be uttered in conversation.\nNow, there are certainly times when one genuinely wonders why something bad came to pass, believe me, it’s a question I have found myself asking from time to time. But there are also times when the answer is completely obvious and totally undeniable. I mean, if you absolutely must point an apparently gun at yourself and pull the trigger to impress your friends, maybe,\njust maybe\n, you might want to\ncheck the chamber\nas well as eject the magazine.\nThe USA is collapsing because it is not the United States of America anymore. Its human and military capital have been considerably drawn down. The people who are the posterity of the Founders have been invaded and overrun, the various propositions and creeds that made their culture exceptional have been rejected by nationals, citizens, and invaders alike, and the remnants of their religion is a watered-down, treasonous, pharisaical Judeo-Churchianity that is a pale shadow of the unadulterated Christianity that once fearlessly proclaimed “No King but Jesus” to the English Crown.\nNow they are afraid to call abomination and adultery sin. Instead, they preach against masculinity and nationalism.\nSo, what else would you expect? I mean, seriously, what other outcome could there possibly be?\nDo you not see that the pace of the financial rapine has increased as well? That’s the elite, desperately attempting to make hay while the setting sun still shines.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-02T22:04:00+00:00"
}