{
  "url": "https://voxday.net/2016/10/26/recommended/",
  "scraped_at": "2025-12-18T02:01:24.911881",
  "title": "Recommended",
  "date_display": "October 26, 2016",
  "date_iso": "2016-10-26T21:00:00+00:00",
  "date_from_url": "2016-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of promoting Mike Cernovich, the Indy King, Vaughn Heppner, who with BV Larson and soon-to-be Castalia author David VanDyke is one of the three big dogs of military science fiction, recommends Mike Cernovich’s <i>GORILLA MINDSET</i> as <a href=\"https://www.amazon.com/b?ie=UTF8&amp;node=15426558011\">one of his three picks</a> for Amazon’s Powered by INDIE:</p><blockquote class=\"tr_bq\"><p> “<i>GORILLA MINDSET</i> is an awesome read for those who want to learn how to control their thoughts and thereby their actions. Mike Cernovich is a straight shooter who tells it like it is. In today’s world, that is a welcome relief.”</p></blockquote><p>If you liked <i>GORILLA MINDSET</i>, I can guarantee that you’re going to like <b><i><a href=\"http://amzn.to/2eHpwcJ\">MAGA MINDSET: Making YOU and America Great Again</a></i></b>. Now in paperback from Castalia House.</p><p>Also, I recommend Vaughn Heppner’s books, particularly if you happen to be inclined towards men with large quantities of futuristic weaponry at their disposal completely failing to abide by Gene Roddenberry’s ideal of non-violent interaction and achieving one’s objectives through diplomacy, communication, and mutual understanding.</p></div>",
  "content_text": "Speaking of promoting Mike Cernovich, the Indy King, Vaughn Heppner, who with BV Larson and soon-to-be Castalia author David VanDyke is one of the three big dogs of military science fiction, recommends Mike Cernovich’s\nGORILLA MINDSET\nas\none of his three picks\nfor Amazon’s Powered by INDIE:\n“\nGORILLA MINDSET\nis an awesome read for those who want to learn how to control their thoughts and thereby their actions. Mike Cernovich is a straight shooter who tells it like it is. In today’s world, that is a welcome relief.”\nIf you liked\nGORILLA MINDSET\n, I can guarantee that you’re going to like\nMAGA MINDSET: Making YOU and America Great Again\n. Now in paperback from Castalia House.\nAlso, I recommend Vaughn Heppner’s books, particularly if you happen to be inclined towards men with large quantities of futuristic weaponry at their disposal completely failing to abide by Gene Roddenberry’s ideal of non-violent interaction and achieving one’s objectives through diplomacy, communication, and mutual understanding.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-26T20:00:00+00:00"
}