{
  "url": "https://voxday.net/2016/10/02/safe-as-houses/",
  "scraped_at": "2025-12-18T01:57:23.790902",
  "title": "Safe as houses",
  "date_display": "October 2, 2016",
  "date_iso": "2016-10-02T16:00:00+00:00",
  "date_from_url": "2016-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://uploads.disquscdn.com/images/70e919c002f86d94cb38cff9ba6890b58de5a267234b13fdb6f62142cdf42632.jpg?w=600&amp;h=379\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://uploads.disquscdn.com/images/70e919c002f86d94cb38cff9ba6890b58de5a267234b13fdb6f62142cdf42632.jpg?w=600&amp;h=379\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://uploads.disquscdn.com/images/70e919c002f86d94cb38cff9ba6890b58de5a267234b13fdb6f62142cdf42632.jpg?w=600&amp;h=379\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>The cartoon above is a reasonable summary of the current state of the West. After finishing <a href=\"http://amzn.to/2dOdWfO\"><i>The Clash of Civilizations</i></a>, it is eminently clear to me that most people, from proposition-nation white conservatives to rainbow-haired, diversity-drunk, quad-gendered, genetically-vibrant multiculturalists, are as completely and absolutely clueless about what the future holds with regards to the ongoing remaking of the world order as the average rotisserie chicken. That’s not surprising. To me, the remarkable thing is how early, and how <i>clearly</i>, Huntington saw the civilizational trends developing. This just goes to show how useful a sound conceptual model is, and how pointless it is to stubbornly insist on retaining models that events or logic have proven to be observably false.</p><p>Which leads me to address a concern that was expressed by several people concerning the way in which certain specific individuals happen to disagree with me, such as John C. Wright, whose recent post entitled <a href=\"http://www.scifiwright.com/2016/10/hooey-and-phooey/\">Hooey and Phooey</a> takes serious exception to what could be described in general terms as my Alt-West thesis. From the comments:</p><blockquote><p> John C. Wright<br> <i>“As for Vox, I admire his fight against the enemies of civilization, he’s actually doing something about it. He can be wrong about an issue and right about the need to fight for something. An unintegrated horde of millions of people with a hostile ideology from one of the most violent places on earth should be opposed on the basis of common sense (no race-science needed).”</i></br></p><p>I agree.</p><p>This is a holy war, not a race war. The religion of secular leftism (and it is a religion in all but name) has made an alliance with the horrid and enduring heresy of the False Prophet, Mohammedanism, against the religion of the West, Christianity: those two are teamed up, and the Left are trying to use demographics to destroy us. He is right that it is an invasion: he is right that men who hate us cannot assimilate and certainly must be expelled from the nation.</p><p>Vox is dead wrong on the ultimate reasons and the ultimate cure for it. The ultimate reasons are spiritual, not genetic. The ultimate cure is revival of Christianity, a re-dedication to the founding principles of this nation, not the creation of a White Lives Matter movement coupled with an abolition of those principles.</p><p> Tom Simon<br> <i>Vox is dead wrong on the ultimate reasons and the ultimate cure for it.</i></br></p><p>Sir, I am very glad that you acknowledge this. I have sometimes been fearful lest your business dealings with Mr. Beale (conducted to mutual profit) might incline you to overlook his faults in politics and dialectic.</p><p> Camilla Cameo<br> At the same time, I for one hope that this disagreement does not cause any rift between! (Though I suggested debate earlier, it was with the acknowledgement that the possibility of ill feeling would be a good reason not to.)</br></p></blockquote><p>Let me be perfectly clear. I don’t expect anyone to agree with me on anything, let alone everything. I suspect – let me correct that, I KNOW – that every single Castalia House author disagrees with me with at least some aspect of my Alt-West thesis even if they tend to generally support its objectives. Not even the co-author of <i>Cuckservative </i>wholly agrees with me; he is not a Christian, for one thing. I think William S. Lind would probably come the closest of them all and <i>he does not even use computers</i>.</p><p>So, I have to assume that my idea of direct techno-democracy is right out with him.</p><p>Now, I do happen to think the estimable Mr. Wright is so vastly and utterly and risibly wrong on this particular subject that one day he will find it it hard to imagine that he ever genuinely believed what he now believes quite sincerely.</p><p>But so what? I have been every bit as wrong about other concepts myself in the past, such as free trade, just to give one example.</p><p>There is neither a rift nor any reason for one. I don’t edit and publish Mr. Wright’s books because I care what he thinks about the Alt-Right or Western civilization, but because he is one of the three best SF/F writers writing today. His novels are entertaining, important, and uplifting. I wouldn’t hesitate to publish China Mieville either even though Mr. Mieville’s ideas concerning political economy are considerably more frothing-at-the-mouth mad than Mr. Wright’s could ever be even if Mr. Wright were bitten by a rabid, syphilitic mongoose.</p><p>Nor do I admire Mr. Wright because I agree with him about one particular concept or another, but because he is a great writer and a good man. He is, without question, better than me on both counts. Although I think he is wrong with regards to American posterity, Aristotelian rhetoric, human intelligence, genetic science, and the art of war, just to name a few things concerning which we disagree, I enjoy reading his thoughts on those and other topics, and I do not mind his criticism in the least, as it is considerably more honest and substantive than most I receive. I consider it to be both an honor and a privilege to work with him.</p><p>The truth is immutable. But <i>none of us</i> have the capacity to see it clearly and fully. Perhaps time will help clarify who is correct and who is not, or perhaps not. In the meantime, all we can do is observe and reflect as honestly as we can.</p><p>Besides, if current events are any guide, I expect Mr. Wright and nearly everyone else to begin to come around to my way of thinking soon enough once the ongoing clash of civilizations strikes close enough to home to make an impression on them. Back in 2002, people were a lot more dubious about my opinion concerning a coming financial crisis than they are about anything I say these days. Frankly, I see “dead wrong” as a big step up from “seriously, what color is the sky in your world?”</p></div>",
  "content_text": "The cartoon above is a reasonable summary of the current state of the West. After finishing\nThe Clash of Civilizations\n, it is eminently clear to me that most people, from proposition-nation white conservatives to rainbow-haired, diversity-drunk, quad-gendered, genetically-vibrant multiculturalists, are as completely and absolutely clueless about what the future holds with regards to the ongoing remaking of the world order as the average rotisserie chicken. That’s not surprising. To me, the remarkable thing is how early, and how\nclearly\n, Huntington saw the civilizational trends developing. This just goes to show how useful a sound conceptual model is, and how pointless it is to stubbornly insist on retaining models that events or logic have proven to be observably false.\nWhich leads me to address a concern that was expressed by several people concerning the way in which certain specific individuals happen to disagree with me, such as John C. Wright, whose recent post entitled\nHooey and Phooey\ntakes serious exception to what could be described in general terms as my Alt-West thesis. From the comments:\nJohn C. Wright\n“As for Vox, I admire his fight against the enemies of civilization, he’s actually doing something about it. He can be wrong about an issue and right about the need to fight for something. An unintegrated horde of millions of people with a hostile ideology from one of the most violent places on earth should be opposed on the basis of common sense (no race-science needed).”\nI agree.\nThis is a holy war, not a race war. The religion of secular leftism (and it is a religion in all but name) has made an alliance with the horrid and enduring heresy of the False Prophet, Mohammedanism, against the religion of the West, Christianity: those two are teamed up, and the Left are trying to use demographics to destroy us. He is right that it is an invasion: he is right that men who hate us cannot assimilate and certainly must be expelled from the nation.\nVox is dead wrong on the ultimate reasons and the ultimate cure for it. The ultimate reasons are spiritual, not genetic. The ultimate cure is revival of Christianity, a re-dedication to the founding principles of this nation, not the creation of a White Lives Matter movement coupled with an abolition of those principles.\nTom Simon\nVox is dead wrong on the ultimate reasons and the ultimate cure for it.\nSir, I am very glad that you acknowledge this. I have sometimes been fearful lest your business dealings with Mr. Beale (conducted to mutual profit) might incline you to overlook his faults in politics and dialectic.\nCamilla Cameo\nAt the same time, I for one hope that this disagreement does not cause any rift between! (Though I suggested debate earlier, it was with the acknowledgement that the possibility of ill feeling would be a good reason not to.)\nLet me be perfectly clear. I don’t expect anyone to agree with me on anything, let alone everything. I suspect – let me correct that, I KNOW – that every single Castalia House author disagrees with me with at least some aspect of my Alt-West thesis even if they tend to generally support its objectives. Not even the co-author of\nCuckservative\nwholly agrees with me; he is not a Christian, for one thing. I think William S. Lind would probably come the closest of them all and\nhe does not even use computers\n.\nSo, I have to assume that my idea of direct techno-democracy is right out with him.\nNow, I do happen to think the estimable Mr. Wright is so vastly and utterly and risibly wrong on this particular subject that one day he will find it it hard to imagine that he ever genuinely believed what he now believes quite sincerely.\nBut so what? I have been every bit as wrong about other concepts myself in the past, such as free trade, just to give one example.\nThere is neither a rift nor any reason for one. I don’t edit and publish Mr. Wright’s books because I care what he thinks about the Alt-Right or Western civilization, but because he is one of the three best SF/F writers writing today. His novels are entertaining, important, and uplifting. I wouldn’t hesitate to publish China Mieville either even though Mr. Mieville’s ideas concerning political economy are considerably more frothing-at-the-mouth mad than Mr. Wright’s could ever be even if Mr. Wright were bitten by a rabid, syphilitic mongoose.\nNor do I admire Mr. Wright because I agree with him about one particular concept or another, but because he is a great writer and a good man. He is, without question, better than me on both counts. Although I think he is wrong with regards to American posterity, Aristotelian rhetoric, human intelligence, genetic science, and the art of war, just to name a few things concerning which we disagree, I enjoy reading his thoughts on those and other topics, and I do not mind his criticism in the least, as it is considerably more honest and substantive than most I receive. I consider it to be both an honor and a privilege to work with him.\nThe truth is immutable. But\nnone of us\nhave the capacity to see it clearly and fully. Perhaps time will help clarify who is correct and who is not, or perhaps not. In the meantime, all we can do is observe and reflect as honestly as we can.\nBesides, if current events are any guide, I expect Mr. Wright and nearly everyone else to begin to come around to my way of thinking soon enough once the ongoing clash of civilizations strikes close enough to home to make an impression on them. Back in 2002, people were a lot more dubious about my opinion concerning a coming financial crisis than they are about anything I say these days. Frankly, I see “dead wrong” as a big step up from “seriously, what color is the sky in your world?”",
  "tags": [
    "#AltWest",
    "Castalia House",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-02T15:00:00+00:00"
}