{
  "url": "https://voxday.net/2016/10/11/scientistry-vs-scientody/",
  "scraped_at": "2025-12-18T01:58:54.720580",
  "title": "Scientistry vs scientody",
  "date_display": "October 11, 2016",
  "date_iso": "2016-10-11T15:30:00+00:00",
  "date_from_url": "2016-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The profession <a href=\"http://www.sciencealert.com/study-warns-that-science-as-we-know-it-is-evolving-into-something-shoddy-and-unreliable\">is structurally incentivized</a> to fold, spindle, and neutralize the scientific method:</p><blockquote><p> There’s no shortage of warnings from the scientific community that science as we know it is being drastically affected by the commercial and institutional pressure to publish papers in high-profile journals – and now a new simulation shows that deteroriation actually happening.</p><p>To draw attention to the way good scientists are pressured into publishing bad science (read: sensational and surprising results), researchers in the US developed a computer model to simulate what happens when scientists compete for academic prestige and jobs.</p><p>In the model, devised by researchers at the University of California, Merced, all the simulated lab groups they put in these scenarios were honest – they didn’t intentionally cheat or fudge results.</p><p>But they received greater rewards if they published ‘novel’ findings – as happens in the real world. They also had to expend greater effort to be rigorous in their methods – which would improve the quality of their research, but lower their academic output.</p><p>“The result: Over time, effort decreased to its minimum value, and the rate of false discoveries skyrocketed,” lead researcher Paul Smaldino explains in The Conversation.</p><p>And what’s more, the model suggests that the ‘bad’ (if you will) scientists who take shortcuts in relation to the incentives on offer will end up passing on their methods to the next generation of scientists who work in their lab, creating in effect an evolutionary conundrum that the study authors call “the natural selection of bad science”.</p><p>“As long as the incentives are in place that reward publishing novel, surprising results, often and in high-visibility journals above other, more nuanced aspects of science, shoddy practices that maximise one’s ability to do so will run rampant,” Smaldino told Hannah Devlin at <i>The Guardian</i>.</p></blockquote><p>This isn’t even remotely a surprise. Scientists are people and people respond to economic incentives. To claim that scientists are “trained”, so they won’t be tempted to put a thumb on the scale is absurd; accountants are trained to do math correctly too and that doesn’t seem to stop a few of them from somehow failing to make the numbers add up right from time to time.</p><p>And keep in mind this doesn’t even account for the known quantity of <i>dishonest </i>scientists. The model was created to determine the extent of the effects the perverse incentives are expected to have on <i>honest </i>scientists.</p><p>I know some people think it is bizarre that I distinguish between science and science, and even give the three different aspects three funny names, but how do you expect to fix a conflict of this sort if you can’t even distinguish between the two parties, let alone determine how one influences the other? Clarity in articulation is the first step in clear thinking.</p></div>",
  "content_text": "The profession\nis structurally incentivized\nto fold, spindle, and neutralize the scientific method:\nThere’s no shortage of warnings from the scientific community that science as we know it is being drastically affected by the commercial and institutional pressure to publish papers in high-profile journals – and now a new simulation shows that deteroriation actually happening.\nTo draw attention to the way good scientists are pressured into publishing bad science (read: sensational and surprising results), researchers in the US developed a computer model to simulate what happens when scientists compete for academic prestige and jobs.\nIn the model, devised by researchers at the University of California, Merced, all the simulated lab groups they put in these scenarios were honest – they didn’t intentionally cheat or fudge results.\nBut they received greater rewards if they published ‘novel’ findings – as happens in the real world. They also had to expend greater effort to be rigorous in their methods – which would improve the quality of their research, but lower their academic output.\n“The result: Over time, effort decreased to its minimum value, and the rate of false discoveries skyrocketed,” lead researcher Paul Smaldino explains in The Conversation.\nAnd what’s more, the model suggests that the ‘bad’ (if you will) scientists who take shortcuts in relation to the incentives on offer will end up passing on their methods to the next generation of scientists who work in their lab, creating in effect an evolutionary conundrum that the study authors call “the natural selection of bad science”.\n“As long as the incentives are in place that reward publishing novel, surprising results, often and in high-visibility journals above other, more nuanced aspects of science, shoddy practices that maximise one’s ability to do so will run rampant,” Smaldino told Hannah Devlin at\nThe Guardian\n.\nThis isn’t even remotely a surprise. Scientists are people and people respond to economic incentives. To claim that scientists are “trained”, so they won’t be tempted to put a thumb on the scale is absurd; accountants are trained to do math correctly too and that doesn’t seem to stop a few of them from somehow failing to make the numbers add up right from time to time.\nAnd keep in mind this doesn’t even account for the known quantity of\ndishonest\nscientists. The model was created to determine the extent of the effects the perverse incentives are expected to have on\nhonest\nscientists.\nI know some people think it is bizarre that I distinguish between science and science, and even give the three different aspects three funny names, but how do you expect to fix a conflict of this sort if you can’t even distinguish between the two parties, let alone determine how one influences the other? Clarity in articulation is the first step in clear thinking.",
  "tags": [
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-11T14:30:00+00:00"
}