{
  "url": "https://voxday.net/2016/10/19/sjws-are-bitter-about-infogalactic/",
  "scraped_at": "2025-12-18T02:00:08.526603",
  "title": "SJWs are bitter about Infogalactic",
  "date_display": "October 19, 2016",
  "date_iso": "2016-10-19T10:00:00+00:00",
  "date_from_url": "2016-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One way you can be certain that Infogalactic already threatens the SJW’s control of the cultural high ground that is the online knowledge base is the reaction of SJWs to it. I am reliably informed our old acquaintance and master of rhetoric, Cameltoes Freckeltongue, is bent out of shape about the fact that our editors are removing the ideological graffiti that litters many, if not most, Wikipedia entries.</p><p><i>I thought that you might like to know about Camestros’s latest meltdown. He’s posted about infogalactic and the science article editing out the “women in science” section. He uses this to claim you are erasing women’s contributions to science, without of course the understanding that the inclusion of such would be motivated by feminist worldview, and irrelevant to science as practice and theory.</i><br> <i><br/></i><br> I do so love the smell of <a href=\"https://camestrosfelapton.wordpress.com/2016/10/16/voxopedia-where-information-about-women-goes-to-be-erased/\">SJW outrage</a> in the morning. Our email correspondent is correct, as it appears Cameltoes understands the difference between “science” and “political activism directed at science” about as well as he grasps the difference between “dialectic” and “rhetoric”.</br></br></p><blockquote><p> Voxopedia: where information about women goes to be erased</p><p>The erasure of women’s achievements in science is a known phenomenon, but it is rare that you get to see it happen in such a simple and direct way. Over at our new favourite train-wreck, Vox Day had been busy quite literally erasing women’s contribution to science.</p><p>This is the relevant Wikipedia page sub-section from the main ‘Science’ article: https://en.wikipedia.org/wiki/Science#Women_in_science</p><p>The Voxopedia, sorry Infogalactic page has had the section removed: https://infogalactic.com/info/Science#Science_and_society</p></blockquote><p>It’s true, the “women in science” section has been deleted from the Science page. Why? First, because there is absolutely no case whatsoever that justifies its inclusion there. Second, because there is already <a href=\"https://infogalactic.com/info/Women_in_science\">a separate and detailed Women in Science page</a> that is, quite correctly, devoted to the subject.</p><p>The topic “women in science” is an entirely separate subject than the topic of “science” for the same and obvious reason that the person sitting inside the car is not the car. Moreover, if “women in science” was a legitimate aspect of the topic “science”, then literally every topic would obviously need a similar “women in x” section.</p><p>Otherwise, it would quite clearly be sexism, historical discrimination, and thoughtcrime to fail to devote a section to women for every entry from Art to Zoology, including, but not limited to, the Battle of Borodino, the Sicilian Vespers, Sun Tzu’s <i>The Art of War</i>, and the page about Milo Yiannopoulos. Women were somehow involved in all those things, so there is no rational basis for which a “women in x” section can be justified for one topic and fail to be justified for another.</p><p>The real question is: Why was “women in science” ever part of the Science page in the first place? After all, there are no “Negroes in science” or “children in science” or “Native Americans in science” sections. There isn’t even a “men in science” page addressing the unique concerns of men as they relate to the method, the profession, and the knowledge base of science.</p><p>The answer, of course, is that “women in science” is nothing more than an ideological intrusion by SJWs attempting to converge the very description and summary of science toward “the highest abstract standard of social and distributive justice”. They aren’t genuinely concerned about either women or science. What concerns them is maintaining control of the flow of information and converging it to suit the Narrative as necessary, which is why Wikipedia’s 531 thought police patrol the encyclopedia so relentlessly.</p><p>Infogalactic threatens that control and the SJWs know it. They’re already past the Ignore phase and have entered the Mocking phase, which is remarkably fast considering that we only launched it one week ago. We’ll know Infogalactic is firmly established when they do a 180 and go from mocking it as “Voxopedia” to denying I had anything to do with its success. Anyhow, if you’d like to help us shatter their control entirely, as we intend to do within the next 36 months, <a href=\"https://infogalactic.com/info/Infogalactic:Donations\">sign up for a subscription</a>, buy <a href=\"https://crypto.fashion/collections/dark-lord-designs/products/official-infogalactic-t-shirt\">a Planetary Knowledge Core t-shirt</a>, or donate to Phase Two: Neapolitan Spoon.</p><p> <i>Note to Infogalactic supporters: we had a highly productive Techstars meeting Monday night with 19 volunteers, and as a result of the considerable technical talent now available, we have decided to significantly modify the Roadmap. The modified Roadmap will be posted later today; check out <a href=\"https://infogalactic.blogspot.com/\">Infogalaxians</a> this afternoon if you’re interested.</i></p></div>",
  "content_text": "One way you can be certain that Infogalactic already threatens the SJW’s control of the cultural high ground that is the online knowledge base is the reaction of SJWs to it. I am reliably informed our old acquaintance and master of rhetoric, Cameltoes Freckeltongue, is bent out of shape about the fact that our editors are removing the ideological graffiti that litters many, if not most, Wikipedia entries.\nI thought that you might like to know about Camestros’s latest meltdown. He’s posted about infogalactic and the science article editing out the “women in science” section. He uses this to claim you are erasing women’s contributions to science, without of course the understanding that the inclusion of such would be motivated by feminist worldview, and irrelevant to science as practice and theory.\nI do so love the smell of\nSJW outrage\nin the morning. Our email correspondent is correct, as it appears Cameltoes understands the difference between “science” and “political activism directed at science” about as well as he grasps the difference between “dialectic” and “rhetoric”.\nVoxopedia: where information about women goes to be erased\nThe erasure of women’s achievements in science is a known phenomenon, but it is rare that you get to see it happen in such a simple and direct way. Over at our new favourite train-wreck, Vox Day had been busy quite literally erasing women’s contribution to science.\nThis is the relevant Wikipedia page sub-section from the main ‘Science’ article: https://en.wikipedia.org/wiki/Science#Women_in_science\nThe Voxopedia, sorry Infogalactic page has had the section removed: https://infogalactic.com/info/Science#Science_and_society\nIt’s true, the “women in science” section has been deleted from the Science page. Why? First, because there is absolutely no case whatsoever that justifies its inclusion there. Second, because there is already\na separate and detailed Women in Science page\nthat is, quite correctly, devoted to the subject.\nThe topic “women in science” is an entirely separate subject than the topic of “science” for the same and obvious reason that the person sitting inside the car is not the car. Moreover, if “women in science” was a legitimate aspect of the topic “science”, then literally every topic would obviously need a similar “women in x” section.\nOtherwise, it would quite clearly be sexism, historical discrimination, and thoughtcrime to fail to devote a section to women for every entry from Art to Zoology, including, but not limited to, the Battle of Borodino, the Sicilian Vespers, Sun Tzu’s\nThe Art of War\n, and the page about Milo Yiannopoulos. Women were somehow involved in all those things, so there is no rational basis for which a “women in x” section can be justified for one topic and fail to be justified for another.\nThe real question is: Why was “women in science” ever part of the Science page in the first place? After all, there are no “Negroes in science” or “children in science” or “Native Americans in science” sections. There isn’t even a “men in science” page addressing the unique concerns of men as they relate to the method, the profession, and the knowledge base of science.\nThe answer, of course, is that “women in science” is nothing more than an ideological intrusion by SJWs attempting to converge the very description and summary of science toward “the highest abstract standard of social and distributive justice”. They aren’t genuinely concerned about either women or science. What concerns them is maintaining control of the flow of information and converging it to suit the Narrative as necessary, which is why Wikipedia’s 531 thought police patrol the encyclopedia so relentlessly.\nInfogalactic threatens that control and the SJWs know it. They’re already past the Ignore phase and have entered the Mocking phase, which is remarkably fast considering that we only launched it one week ago. We’ll know Infogalactic is firmly established when they do a 180 and go from mocking it as “Voxopedia” to denying I had anything to do with its success. Anyhow, if you’d like to help us shatter their control entirely, as we intend to do within the next 36 months,\nsign up for a subscription\n, buy\na Planetary Knowledge Core t-shirt\n, or donate to Phase Two: Neapolitan Spoon.\nNote to Infogalactic supporters: we had a highly productive Techstars meeting Monday night with 19 volunteers, and as a result of the considerable technical talent now available, we have decided to significantly modify the Roadmap. The modified Roadmap will be posted later today; check out\nInfogalaxians\nthis afternoon if you’re interested.",
  "tags": [
    "Infogalactic",
    "science",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-19T09:00:00+00:00"
}