{
  "url": "https://voxday.net/2016/10/11/sweden-stirs/",
  "scraped_at": "2025-12-18T01:58:52.784825",
  "title": "Sweden stirs",
  "date_display": "October 11, 2016",
  "date_iso": "2016-10-11T12:00:00+00:00",
  "date_from_url": "2016-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently it takes <a href=\"http://www.dailymail.co.uk/news/article-3831991/Wheelchair-bound-woman-gang-raped-six-migrants-Swedish-asylum-centre-asking-use-toilet.html\">a gang rape of a handicapped woman</a> to stir Swedes into considering the possibility that permitting Muslims to colonize them is a bad idea:</p><blockquote><p> A wheelchair-bound woman was gang-raped by up to six migrants at a Swedish asylum centre after asking if she could use their toilet, it has been reported. The woman, in her 30s, was sharing a taxi home with a man after going in the medieval town of Visby on Sweden’s Gotland island when she asked to stop off. Her fellow passenger invited her inside before she was brutally set upon in the toilet, her lawyer said.</p><p>The assault sparked anger in the town and extra police were called to the island when an angry mob attacked the asylum centre with rocks.</p><p>The victim’s lawyer Staffan Freriksson said the abuse started in the toilet and several other men joined in. He added: ‘Where they came from we don’t know. This was going on for a couple of hours.’</p><p>Six men aged in their 20s were arrested in the days that followed they were later released. Sweden’s Expressen newspaper reported that the suspects were all asylum seekers and that the attack allegedly took place at asylum accommodation.</p></blockquote><p>Diversity + Proximity = War. There will be no peace. There will be no integration. There are two choices: Submission or Reconquista.</p><p>I’ll have a review when I finish it, but one thing I’ve learned from Fukuyama’s <i>The Origins of Political Order</i> is that there is no chance – absolutely none – that people from kinship cultures can ever successfully integrate to the West in statistically significant numbers without totally destroying everything that is identifiably Western.</p><p>It’s not a genetic thing or even a cultural thing, it’s a fundamental philosophical hardwiring that no mere proposition or individual assimilation can possibly undo.</p></div>",
  "content_text": "Apparently it takes\na gang rape of a handicapped woman\nto stir Swedes into considering the possibility that permitting Muslims to colonize them is a bad idea:\nA wheelchair-bound woman was gang-raped by up to six migrants at a Swedish asylum centre after asking if she could use their toilet, it has been reported. The woman, in her 30s, was sharing a taxi home with a man after going in the medieval town of Visby on Sweden’s Gotland island when she asked to stop off. Her fellow passenger invited her inside before she was brutally set upon in the toilet, her lawyer said.\nThe assault sparked anger in the town and extra police were called to the island when an angry mob attacked the asylum centre with rocks.\nThe victim’s lawyer Staffan Freriksson said the abuse started in the toilet and several other men joined in. He added: ‘Where they came from we don’t know. This was going on for a couple of hours.’\nSix men aged in their 20s were arrested in the days that followed they were later released. Sweden’s Expressen newspaper reported that the suspects were all asylum seekers and that the attack allegedly took place at asylum accommodation.\nDiversity + Proximity = War. There will be no peace. There will be no integration. There are two choices: Submission or Reconquista.\nI’ll have a review when I finish it, but one thing I’ve learned from Fukuyama’s\nThe Origins of Political Order\nis that there is no chance – absolutely none – that people from kinship cultures can ever successfully integrate to the West in statistically significant numbers without totally destroying everything that is identifiably Western.\nIt’s not a genetic thing or even a cultural thing, it’s a fundamental philosophical hardwiring that no mere proposition or individual assimilation can possibly undo.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-11T11:00:00+00:00"
}