{
  "url": "https://voxday.net/2016/10/28/tears-of-cuck/",
  "scraped_at": "2025-12-18T02:01:38.454948",
  "title": "Tears of a Cuck",
  "date_display": "October 28, 2016",
  "date_iso": "2016-10-28T08:36:00+00:00",
  "date_from_url": "2016-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David French demonstrates that he definitely wasn’t the man for the job as <a href=\"http://www.npr.org/2016/10/26/499440089/harassed-on-twitter-people-need-to-know-the-reality-of-what-its-like-out-there\">he cries about how mean the Alt-Right</a> is to NPR, of all places:</p><blockquote><p> In September or mid-September of last year, I had noticed that Ann Coulter, who is a very prominent supporter of Donald Trump, was tweeting out a lot of thoughts that are common to this part of the right – even though I hate to even call them part of the right, they call themselves part of the right – called the alt-right that were explicitly white nationalist in their tone and tenor. And so I wrote in our group blog on National Review called The Corner that Ann Coulter was deliberately appealing to these people. And I – and basically and politely said this is something that’s inexcusable and it has no place in the conservative movement.</p><p>And then I had no idea what was about to happen next. My Twitter feed basically exploded. I have – did not have that many followers – in the thousands, certainly not like the more prominent folks in politics, but it was unbelievable. I began to see images, for example, of my youngest daughter, who we adopted from Ethiopia many years ago, who at the time was 7 years old – images of her in a gas chamber with a – Donald Trump in an SS uniform about to push the button to kill her. I saw images of her Photoshopped or, you know, artist’s rendering of her face in slave fields.</p><p>I was called all manner of unbelievable names, which is kind of par for the course for Twitter, but among them was this term that has gained currency in recent years called cuckservatives. Cuckservative is somebody who’s been cuckolded by the establishment, by the liberal elite. And then people began to refer to my wife as having sex with black men when I was deployed to Iraq in 2007, 2008. And it just descended from there. And that’s a side of Twitter I know that others had experienced, but I had certainly never experienced it before. And then it just got worse.</p><p>GROSS: So this was all because you criticized Ann Coulter?</p><p>FRENCH: Yes, it was because I – not just criticized Ann Coulter. I mean, that happens all the time. I mean, she’s a frequent target of criticism. It’s because I criticized this group called the alt-right. It’s – and for, you know, those who don’t know what the alt-right is, it’s a collection of mostly younger people who are rebelling against mainstream conservatism, rebelling against progressive liberalism and have really began to adopt white nationalism, white identity politics.</p></blockquote><p>All I did was politely try to John Birch conservatism’s most popular writer out of conservatism! And then they were mean to me! They sent me pictures!</p><p>The horra, the horra…..</p><p>What all this whining indicates is that the ruthless, relentless meming of the Alt-Right is effective. When they cry racist, send them King Kong and field hand memes. When they cry anti-Semitism, send them swastika and oven memes. The reason they are attempting to ban memes from social media is because it is powerfully effective rhetoric. It is rhetoric that resonates and persuades.</p><p>White nationalism and white identity politics are the future for whites. The <i>inescapable </i>future. There is no future for “I don’t see color” posing anymore, because even if you want to pretend you don’t – and we all know you do, because you make such a particular point of your faux moral preening – every single black, Muslim, Jew, Japanese, Han, Mexican, and Pakistani most certainly does. They see more than color, they see culture and creed too. Even if you’re unwilling to accept that your color, culture, and creed is your uniform, all of those things will be their target.</p><p>And if we’re lucky, you will be what you’ll superficially pass for.</p><p>I understand this is difficult to accept for those with mixed blood or mixed families. It doesn’t matter. Human nature has not changed. The patterns of history have not changed. Ethnic conflict and ethnic cleansing are going to happen in the United States just as they have happened in almost every other polity that allowed itself to become seriously mixed. Homogeneous societies do not appear <i>ex nihilo</i>, they are born from heterogeneous societies.</p><p>Guess how?</p><p>In fact, the primary reason the ethnic conflict now taking place in the USA is happening at a relatively low level is because the ethnic cleansing is still voluntary. We call it “white flight” and “Hispanization”, but the effect is still the same. Don’t delude yourself. The socio-political disintegration of the USA is already underway. By the time the mainstream notices and is willing to admit what it is and why it is happening, it will be far late to even slow the process down.</p><p>In the meantime, enjoy this confession:</p><blockquote class=\"tr_bq\"><p> I know journalist after journalist, writer after writer, public figure after public figure who literally dreads opening their Twitter app right now.</p></blockquote><p>Give them the gift of fear. They deserve it, for they are the 999 lying mouths of the Devil.</p></div>",
  "content_text": "David French demonstrates that he definitely wasn’t the man for the job as\nhe cries about how mean the Alt-Right\nis to NPR, of all places:\nIn September or mid-September of last year, I had noticed that Ann Coulter, who is a very prominent supporter of Donald Trump, was tweeting out a lot of thoughts that are common to this part of the right – even though I hate to even call them part of the right, they call themselves part of the right – called the alt-right that were explicitly white nationalist in their tone and tenor. And so I wrote in our group blog on National Review called The Corner that Ann Coulter was deliberately appealing to these people. And I – and basically and politely said this is something that’s inexcusable and it has no place in the conservative movement.\nAnd then I had no idea what was about to happen next. My Twitter feed basically exploded. I have – did not have that many followers – in the thousands, certainly not like the more prominent folks in politics, but it was unbelievable. I began to see images, for example, of my youngest daughter, who we adopted from Ethiopia many years ago, who at the time was 7 years old – images of her in a gas chamber with a – Donald Trump in an SS uniform about to push the button to kill her. I saw images of her Photoshopped or, you know, artist’s rendering of her face in slave fields.\nI was called all manner of unbelievable names, which is kind of par for the course for Twitter, but among them was this term that has gained currency in recent years called cuckservatives. Cuckservative is somebody who’s been cuckolded by the establishment, by the liberal elite. And then people began to refer to my wife as having sex with black men when I was deployed to Iraq in 2007, 2008. And it just descended from there. And that’s a side of Twitter I know that others had experienced, but I had certainly never experienced it before. And then it just got worse.\nGROSS: So this was all because you criticized Ann Coulter?\nFRENCH: Yes, it was because I – not just criticized Ann Coulter. I mean, that happens all the time. I mean, she’s a frequent target of criticism. It’s because I criticized this group called the alt-right. It’s – and for, you know, those who don’t know what the alt-right is, it’s a collection of mostly younger people who are rebelling against mainstream conservatism, rebelling against progressive liberalism and have really began to adopt white nationalism, white identity politics.\nAll I did was politely try to John Birch conservatism’s most popular writer out of conservatism! And then they were mean to me! They sent me pictures!\nThe horra, the horra…..\nWhat all this whining indicates is that the ruthless, relentless meming of the Alt-Right is effective. When they cry racist, send them King Kong and field hand memes. When they cry anti-Semitism, send them swastika and oven memes. The reason they are attempting to ban memes from social media is because it is powerfully effective rhetoric. It is rhetoric that resonates and persuades.\nWhite nationalism and white identity politics are the future for whites. The\ninescapable\nfuture. There is no future for “I don’t see color” posing anymore, because even if you want to pretend you don’t – and we all know you do, because you make such a particular point of your faux moral preening – every single black, Muslim, Jew, Japanese, Han, Mexican, and Pakistani most certainly does. They see more than color, they see culture and creed too. Even if you’re unwilling to accept that your color, culture, and creed is your uniform, all of those things will be their target.\nAnd if we’re lucky, you will be what you’ll superficially pass for.\nI understand this is difficult to accept for those with mixed blood or mixed families. It doesn’t matter. Human nature has not changed. The patterns of history have not changed. Ethnic conflict and ethnic cleansing are going to happen in the United States just as they have happened in almost every other polity that allowed itself to become seriously mixed. Homogeneous societies do not appear\nex nihilo\n, they are born from heterogeneous societies.\nGuess how?\nIn fact, the primary reason the ethnic conflict now taking place in the USA is happening at a relatively low level is because the ethnic cleansing is still voluntary. We call it “white flight” and “Hispanization”, but the effect is still the same. Don’t delude yourself. The socio-political disintegration of the USA is already underway. By the time the mainstream notices and is willing to admit what it is and why it is happening, it will be far late to even slow the process down.\nIn the meantime, enjoy this confession:\nI know journalist after journalist, writer after writer, public figure after public figure who literally dreads opening their Twitter app right now.\nGive them the gift of fear. They deserve it, for they are the 999 lying mouths of the Devil.",
  "tags": [
    "#AltRight",
    "cuckservative",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-28T07:36:00+00:00"
}