{
  "url": "https://voxday.net/2016/10/11/the-doubters-doub/",
  "scraped_at": "2025-12-18T01:58:48.963490",
  "title": "The doubters doubt",
  "date_display": "October 11, 2016",
  "date_iso": "2016-10-11T00:30:00+00:00",
  "date_from_url": "2016-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://file770.com/?p=31204\">File 770ers respond</a> to the announcement of Infogalactic:</p><blockquote><p> Errrr, just how is Wikipedia troubled? is he conflating Wikipedia with Wikileaks which is a separate undertaking? And is he really stupid enough to think he can create an alternative to somethings that has over five million pages just in the English version?</p><p>MemoryAlpha has *just* forty thousand and its been around for over a decade.</p><p>The old Green Man Review which I run had roughly twenty thousand pages before we moved to WordPress and that took twenty years.</p><p>Fuck, this man is simply insane.</p></blockquote><p>I love this stuff. In answer to her questions:</p><ol><li>Wikipedia is corrupt, incredibly outdated technologically, has betrayed its vision, is losing editors and admins at a rapid rate, and instantly reverts nearly one-third of its additions. Wikipedia’s active admins have been literally decimated from the time we started working on Infogalactic; I now have more VFM than Wikipedia has active admins. Infogalactic is not an <i>alternative </i>to Wikipedia, Infogalactic will replace Wikipedia in the same way Facebook replaced MySpace.</li><li>No.</li><li>We already have 11 million pages. Infogalactic will dwarf the English Wikipedia within 18 months of Phase Three going live.</li><li>Vox’s First Law: any sufficiently advanced intelligence is indistinguishable from insanity.</li></ol><blockquote class=\"tr_bq\"><p> Canons 1 and 7 absolutely contradict each other, which is probably why they appear at either end of the spectrum. In a way, the canons encompass the “reality” of the entire endeavor.</p></blockquote><p>There is no contradiction at all. Facts are facts. But what particular facts one editor chooses to emphasize, or deemphasize, in an article permits the presentation of entirely different perspectives on the same objective reality. For example, the LA Times poll today reports that Donald Trump is winning the election. The NBC News poll today reports that Hillary Clinton is winning the election. Both reports are indubitably facts. Which fact you choose to cite depends upon your perspective and paints a very different picture.</p><blockquote><p> A subjective opinion is not the same as an objective fact.</p><p>Now matter how much I try and wrap my mind around what those words mean, the result is also ways the same:</p><p>ARISTOTLE! RHETORIC!</p></blockquote><p>And that is precisely why we will have Context and Opinion sub-pages in Phase Two. This negative reaction on the part of the SF-SJWs is exactly what I’d hoped to see, because it tends to confirm that we are on the right track in taking back the cultural high ground. As for those claiming we “lifted” any content, I would merely observe that we have literally the exact same right to the content that Wikipedia does. The difference is that Wikipedia’s thought police are desperate to control that content and fit it to their narrative. We’re not, which is why we will inevitably win.</p><p>Wikipedia has lost the Mandate of Heaven. As a result, Infogalactic is going to become a top 100 Internet site en route to becoming The Planetary Knowledge Core. And it is going to do so faster than anyone likely believes possible. And no, I’m not bored with Castalia House at all. Quite to the contrary, Infogalactic is going to help Castalia House become the #1 publisher in science fiction and fantasy.</p><p>The five-phase <a href=\"https://infogalactic.com/info/Infogalactic:Roadmap\">Roadmap </a>is only the beginning. That is far from the entirety of our vision, that’s all we’re willing to discuss publicly for now. Believe me, if you think what we’ve said so far is outlandish, you haven’t seen <i>anything </i>yet.</p><p> UPDATE: Breitbart readers <a href=\"http://www.breitbart.com/tech/2016/10/10/anti-thought-police-infogalactic-launches-as-wikipedia-alternative/\">are rather more enthusiastic</a>:</p><blockquote><p> Infogalactic, an online encyclopedia branding itself as a censorship free alternative to Wikipedia without “bias or thought police,” has launched.</p><p>The online encyclopedia that refers to itself as a “Planetary Knowledge Core™”  was conceived as a replacement for Wikipedia that promises to be free of the problems that have plagued Wikipedia such as the bureaucracy amongst editors, censorship of content, harassment, and vandalism of public figures’ pages.</p></blockquote></div>",
  "content_text": "File 770ers respond\nto the announcement of Infogalactic:\nErrrr, just how is Wikipedia troubled? is he conflating Wikipedia with Wikileaks which is a separate undertaking? And is he really stupid enough to think he can create an alternative to somethings that has over five million pages just in the English version?\nMemoryAlpha has *just* forty thousand and its been around for over a decade.\nThe old Green Man Review which I run had roughly twenty thousand pages before we moved to WordPress and that took twenty years.\nFuck, this man is simply insane.\nI love this stuff. In answer to her questions:\nWikipedia is corrupt, incredibly outdated technologically, has betrayed its vision, is losing editors and admins at a rapid rate, and instantly reverts nearly one-third of its additions. Wikipedia’s active admins have been literally decimated from the time we started working on Infogalactic; I now have more VFM than Wikipedia has active admins. Infogalactic is not an\nalternative\nto Wikipedia, Infogalactic will replace Wikipedia in the same way Facebook replaced MySpace.\nNo.\nWe already have 11 million pages. Infogalactic will dwarf the English Wikipedia within 18 months of Phase Three going live.\nVox’s First Law: any sufficiently advanced intelligence is indistinguishable from insanity.\nCanons 1 and 7 absolutely contradict each other, which is probably why they appear at either end of the spectrum. In a way, the canons encompass the “reality” of the entire endeavor.\nThere is no contradiction at all. Facts are facts. But what particular facts one editor chooses to emphasize, or deemphasize, in an article permits the presentation of entirely different perspectives on the same objective reality. For example, the LA Times poll today reports that Donald Trump is winning the election. The NBC News poll today reports that Hillary Clinton is winning the election. Both reports are indubitably facts. Which fact you choose to cite depends upon your perspective and paints a very different picture.\nA subjective opinion is not the same as an objective fact.\nNow matter how much I try and wrap my mind around what those words mean, the result is also ways the same:\nARISTOTLE! RHETORIC!\nAnd that is precisely why we will have Context and Opinion sub-pages in Phase Two. This negative reaction on the part of the SF-SJWs is exactly what I’d hoped to see, because it tends to confirm that we are on the right track in taking back the cultural high ground. As for those claiming we “lifted” any content, I would merely observe that we have literally the exact same right to the content that Wikipedia does. The difference is that Wikipedia’s thought police are desperate to control that content and fit it to their narrative. We’re not, which is why we will inevitably win.\nWikipedia has lost the Mandate of Heaven. As a result, Infogalactic is going to become a top 100 Internet site en route to becoming The Planetary Knowledge Core. And it is going to do so faster than anyone likely believes possible. And no, I’m not bored with Castalia House at all. Quite to the contrary, Infogalactic is going to help Castalia House become the #1 publisher in science fiction and fantasy.\nThe five-phase\nRoadmap\nis only the beginning. That is far from the entirety of our vision, that’s all we’re willing to discuss publicly for now. Believe me, if you think what we’ve said so far is outlandish, you haven’t seen\nanything\nyet.\nUPDATE: Breitbart readers\nare rather more enthusiastic\n:\nInfogalactic, an online encyclopedia branding itself as a censorship free alternative to Wikipedia without “bias or thought police,” has launched.\nThe online encyclopedia that refers to itself as a “Planetary Knowledge Core™”  was conceived as a replacement for Wikipedia that promises to be free of the problems that have plagued Wikipedia such as the bureaucracy amongst editors, censorship of content, harassment, and vandalism of public figures’ pages.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-10T23:30:00+00:00"
}