{
  "url": "https://voxday.net/2016/10/07/the-broken-freaks-of-fando/",
  "scraped_at": "2025-12-18T01:58:16.168902",
  "title": "The broken freaks of fandom",
  "date_display": "October 7, 2016",
  "date_iso": "2016-10-07T15:00:00+00:00",
  "date_from_url": "2016-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They really are mentally ill, self-hating nutcases. I’ve said for years that the SJWs of science fiction are a vast collection of human wreckage. That’s why their parasitical books are so dreadful, devoid of all beauty, joy, truth, and love, and from a literary perspective, amount to little more than fingerpainting in fecal matter. They are morally blind, mentally weak societal cancers. One would pity them if only they did not attempt to recreate the world in their ugly, soul-shattered image.</p><p>They have many reasons to dislike me, but they main reason they hate and fear me is because, in my self-assurance, I remind them of the bullies who scarred them for life. And here is the conclusive proof that I was right: <a href=\"http://www.magicalwords.net/gail-martin/100-sci-fi-fantasy-authors-blog-about-suicide-depression-ptsd-a-holdontothelight-update-by-gail-z-martin/\">100+ Sci-Fi &amp; Fantasy Authors Blog About Suicide, Depression, PTSD</a>—a #HoldOnToTheLight Update by Gail Z. Martin</p><ul><li>My wife, doctor, and I developed a scale of rage from 1 to 10, 1 being “everything’s cool” to 10 being “I am out of control and breaking shit in the house, car, and my body.” It’s been…let’s see…maybe a few months since I had no-holds-barred Level 10 outburst. But I come close every week or two. I probably reach an 8 once every ten days. But that’s down from a 10 every other week or so. I hate me more than any ten, a hundred, or a thousand people on earth combined could ever hope to. (Even more than Kirkus and Goodreads reviewers, if such a thing be possible!) That’s my legacy. </li><li>I’ve dealt with depression and lingering self-doubt for much of my life, because of that long-ago bullying. Which gives me great compassion for those who are different or who feel like outsiders. And though I won’t name names, because it is not my story to tell – I can assure them that many of the writers and artists I’m friendly with have experienced either bullying, depression, anxiety, suicidal thoughts, or a combination of those things.</li><li>I grew up believing that I was not going to survive to adulthood. My parents were into doomsday politics and apocalyptic religion, so whether it was Soviet nukes or Armageddon, we were all going down in flames. Everyone around me—extended family and religious social group—echoed the same fears and beliefs. I was pleasantly surprised to still be alive at age 12, but I didn’t figure it would last. That’s the year I discovered Star Trek (original series) and read my first science fiction book (Destination: Universe by A.E. VanVogt). I still remember the moment when it hit me that other people saw the possibility of a completely different future than the fire and blood I’d been raised to expect. Cataclysmic destruction was not inevitable. I remember lying in the grass in my back yard, book open, tears running down my face when I realized I actually might live long enough to grow up.</li></ul><p>Now, some of these people experienced genuine abuse. Most, however, experienced nothing worse than the usual societal disapproval for being weird little kids who couldn’t bother to abide by childhood social norms of behavior, conversation, and hygiene. But regardless, the ironic thing is that by wallowing incessantly in their “oh, poor me, I am so broken and depressed and suicidal” nonsense, they only cement their unhappy fate. Virtually none of them experienced the significant life challenges that Ivan Throne did. Very few of them were likely bullied as relentlessly as I was in my first three years of school, being younger, smarter, more athletic, and considerably smaller than everyone in my elementary school class.</p><p>I may, admittedly, have been a little arrogant in failing to conceal my intelligence, my athletic ability, or my interests.</p><p>(I couldn’t figure out why John Scalzi was such a broken little creature, given that he wasn’t particularly fat or ugly, and how he was handed educational opportunities of the sort one seldom sees outside of rich families sending their children to boarding schools, until I learned he’d spent a whole school year in a wheelchair hanging out with the school nurse during recess as the result of an accident. That’s where he learned to rely on snark and pretense as a means of psychological self-defense. An unsound body, when combined with a lack of honesty and courage, often produces a withered soul and an unsound mind.)</p><p>There is one, and only one, difference in the choice that these pathetic husks of human beings made, and the choice that men like Ivan and I made, when we were children under psychological pressure. We fought back. We never ran from reality. We never broke. We refused to accept our externally imposed fates, we also refused to pretend things were other than they were, and by doing so, we not only changed our fates, we changed <i>who we were</i>. They cringed, they cowered, they ran, and they have never stopped running.</p><p>About seven years after graduating from high school, I ran into the one boy who was smaller than I was in junior high in a weight room, a smart kid who also liked to write. We were doubles partners on the JV tennis team in ninth grade. He was still only 5’7″ but was 200 pounds of solid, barrel-chested muscle, and it turned out that he was the reigning state powerlifting champion. I’d added 40 pounds of muscle myself and was a ripped, skin-headed martial artist. We looked at each other and both burst out laughing. “You think we overcompensated a little?” were his first words to me.</p><p>The SF-SJWs genuinely can’t understand why their collective disapproval means absolutely nothing to me. They are confused and befuddled when a failure or a rejection fails to dissuade me from looking for another way forward. They can’t figure out why I get up and go back into the fray after I am knocked down. And that tells you everything you need to know, not about me, but about <i>them</i>. They cannot even <i>imagine </i>a scenario where you don’t curl up and die because someone doesn’t like you. They call me “the most despised man in science fiction”, but remember the Third Law of SJW: SJWs always project.</p><p>The reason the sad sacks of science fiction despise themselves is not because they have post-traumatic stress disorder or chemical imbalances in their brain or a crippling lack of god-belief. In most cases, those are <i>consequences</i>, not causes. They hate themselves because, knowingly or unknowingly, they harbor contempt for the child they once were. Their works are an endless and futile attempt to replay their childhoods to produce a different outcome.</p><p>And instead of humbling themselves, admitting that they are weak, fat, inferior, mentally ill cowards, and taking action to stop being those things, they band together and collectively proclaim that black is white, weak is strong, evil is good, and ugliness is beauty. The light onto which they’re holding is Luciferian, and nothing positive will come of their competition to be the most broken, the most abused, the saddest and least-deserving victim of them all.</p><p>“You’re not alone!” they cry. But you are. Everyone is. There comes a critical point in every man’s life when he faces the choice to accept reality and deal with it or deny it and enter a parallel world of self-centered delusion. You know what choice you made then, and you know why.</p><p>UPDATE: A reader comments: <i>“My husband had a horrendous childhood. Beatings, starvation, severe neglect, homeless and living on the streets at age eight. He is a very high achiever, the strongest man I know, very happy, and successful. Why? He is a FIGHTER. A bad childhood is not a life sentence to misery.”</i></p><p>In fairness, I know who her husband is and to call him a “fighter” is akin to calling the Joker a guy with a few psychological issues. I like him, and he’s a good man, but on a “don’t mess with this guy” scale ranging from 1 to 10, his rank is “Vladimir Putin having a bad day”.</p><p>Childhood adversity will make you weaker or it will make you stronger. The choice is yours.</p></div>",
  "content_text": "They really are mentally ill, self-hating nutcases. I’ve said for years that the SJWs of science fiction are a vast collection of human wreckage. That’s why their parasitical books are so dreadful, devoid of all beauty, joy, truth, and love, and from a literary perspective, amount to little more than fingerpainting in fecal matter. They are morally blind, mentally weak societal cancers. One would pity them if only they did not attempt to recreate the world in their ugly, soul-shattered image.\nThey have many reasons to dislike me, but they main reason they hate and fear me is because, in my self-assurance, I remind them of the bullies who scarred them for life. And here is the conclusive proof that I was right:\n100+ Sci-Fi & Fantasy Authors Blog About Suicide, Depression, PTSD\n—a #HoldOnToTheLight Update by Gail Z. Martin\nMy wife, doctor, and I developed a scale of rage from 1 to 10, 1 being “everything’s cool” to 10 being “I am out of control and breaking shit in the house, car, and my body.” It’s been…let’s see…maybe a few months since I had no-holds-barred Level 10 outburst. But I come close every week or two. I probably reach an 8 once every ten days. But that’s down from a 10 every other week or so. I hate me more than any ten, a hundred, or a thousand people on earth combined could ever hope to. (Even more than Kirkus and Goodreads reviewers, if such a thing be possible!) That’s my legacy.\nI’ve dealt with depression and lingering self-doubt for much of my life, because of that long-ago bullying. Which gives me great compassion for those who are different or who feel like outsiders. And though I won’t name names, because it is not my story to tell – I can assure them that many of the writers and artists I’m friendly with have experienced either bullying, depression, anxiety, suicidal thoughts, or a combination of those things.\nI grew up believing that I was not going to survive to adulthood. My parents were into doomsday politics and apocalyptic religion, so whether it was Soviet nukes or Armageddon, we were all going down in flames. Everyone around me—extended family and religious social group—echoed the same fears and beliefs. I was pleasantly surprised to still be alive at age 12, but I didn’t figure it would last. That’s the year I discovered Star Trek (original series) and read my first science fiction book (Destination: Universe by A.E. VanVogt). I still remember the moment when it hit me that other people saw the possibility of a completely different future than the fire and blood I’d been raised to expect. Cataclysmic destruction was not inevitable. I remember lying in the grass in my back yard, book open, tears running down my face when I realized I actually might live long enough to grow up.\nNow, some of these people experienced genuine abuse. Most, however, experienced nothing worse than the usual societal disapproval for being weird little kids who couldn’t bother to abide by childhood social norms of behavior, conversation, and hygiene. But regardless, the ironic thing is that by wallowing incessantly in their “oh, poor me, I am so broken and depressed and suicidal” nonsense, they only cement their unhappy fate. Virtually none of them experienced the significant life challenges that Ivan Throne did. Very few of them were likely bullied as relentlessly as I was in my first three years of school, being younger, smarter, more athletic, and considerably smaller than everyone in my elementary school class.\nI may, admittedly, have been a little arrogant in failing to conceal my intelligence, my athletic ability, or my interests.\n(I couldn’t figure out why John Scalzi was such a broken little creature, given that he wasn’t particularly fat or ugly, and how he was handed educational opportunities of the sort one seldom sees outside of rich families sending their children to boarding schools, until I learned he’d spent a whole school year in a wheelchair hanging out with the school nurse during recess as the result of an accident. That’s where he learned to rely on snark and pretense as a means of psychological self-defense. An unsound body, when combined with a lack of honesty and courage, often produces a withered soul and an unsound mind.)\nThere is one, and only one, difference in the choice that these pathetic husks of human beings made, and the choice that men like Ivan and I made, when we were children under psychological pressure. We fought back. We never ran from reality. We never broke. We refused to accept our externally imposed fates, we also refused to pretend things were other than they were, and by doing so, we not only changed our fates, we changed\nwho we were\n. They cringed, they cowered, they ran, and they have never stopped running.\nAbout seven years after graduating from high school, I ran into the one boy who was smaller than I was in junior high in a weight room, a smart kid who also liked to write. We were doubles partners on the JV tennis team in ninth grade. He was still only 5’7″ but was 200 pounds of solid, barrel-chested muscle, and it turned out that he was the reigning state powerlifting champion. I’d added 40 pounds of muscle myself and was a ripped, skin-headed martial artist. We looked at each other and both burst out laughing. “You think we overcompensated a little?” were his first words to me.\nThe SF-SJWs genuinely can’t understand why their collective disapproval means absolutely nothing to me. They are confused and befuddled when a failure or a rejection fails to dissuade me from looking for another way forward. They can’t figure out why I get up and go back into the fray after I am knocked down. And that tells you everything you need to know, not about me, but about\nthem\n. They cannot even\nimagine\na scenario where you don’t curl up and die because someone doesn’t like you. They call me “the most despised man in science fiction”, but remember the Third Law of SJW: SJWs always project.\nThe reason the sad sacks of science fiction despise themselves is not because they have post-traumatic stress disorder or chemical imbalances in their brain or a crippling lack of god-belief. In most cases, those are\nconsequences\n, not causes. They hate themselves because, knowingly or unknowingly, they harbor contempt for the child they once were. Their works are an endless and futile attempt to replay their childhoods to produce a different outcome.\nAnd instead of humbling themselves, admitting that they are weak, fat, inferior, mentally ill cowards, and taking action to stop being those things, they band together and collectively proclaim that black is white, weak is strong, evil is good, and ugliness is beauty. The light onto which they’re holding is Luciferian, and nothing positive will come of their competition to be the most broken, the most abused, the saddest and least-deserving victim of them all.\n“You’re not alone!” they cry. But you are. Everyone is. There comes a critical point in every man’s life when he faces the choice to accept reality and deal with it or deny it and enter a parallel world of self-centered delusion. You know what choice you made then, and you know why.\nUPDATE: A reader comments:\n“My husband had a horrendous childhood. Beatings, starvation, severe neglect, homeless and living on the streets at age eight. He is a very high achiever, the strongest man I know, very happy, and successful. Why? He is a FIGHTER. A bad childhood is not a life sentence to misery.”\nIn fairness, I know who her husband is and to call him a “fighter” is akin to calling the Joker a guy with a few psychological issues. I like him, and he’s a good man, but on a “don’t mess with this guy” scale ranging from 1 to 10, his rank is “Vladimir Putin having a bad day”.\nChildhood adversity will make you weaker or it will make you stronger. The choice is yours.",
  "tags": [
    "philosophy",
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-07T14:00:00+00:00"
}