{
  "url": "https://voxday.net/2016/10/22/truth-or-social-justice/",
  "scraped_at": "2025-12-18T02:00:43.051238",
  "title": "Truth or social justice?",
  "date_display": "October 22, 2016",
  "date_iso": "2016-10-22T19:00:00+00:00",
  "date_from_url": "2016-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Haidt argues that universities <a href=\"http://heterodoxacademy.org/2016/10/21/one-telos-truth-or-social-justice/\">face a choice</a>:</p><blockquote><p> Aristotle often evaluated a thing with respect to its “telos” – its purpose, end, or goal. The telos of a kife is to cut. The telos of a physician is health or healing. What is the telos of university?<br> The harvardmost obvious answer is “truth” –- the word appears on so many university crests. But increasingly, many of America’s top universities are embracing social justice as their telos, or as a second and equal telos. But can any institution or profession have two teloses (or teloi)? What happens if they conflict?</br></p><p>As a social psychologist who studies morality, I have watched these two teloses come into conflict increasingly often during my 30 years in the academy. The conflicts seemed manageable in the 1990s. But the intensity of conflict has grown since then, at the same time as the political diversity of the professoriate was plummeting, and at the same time as American cross-partisan hostility was rising. I believe the conflict reached its boiling point in the fall of 2015 when student protesters at 80 universities demanded that their universities make much greater and more explicit commitments to social justice, often including mandatory courses and training for everyone in social justice perspectives and content.</p><p>Now that many university presidents have agreed to implement many of the demands, I believe that the conflict between truth and social justice is likely to become unmanageable.  Universities will have to choose, and be explicit about their choice, so that potential students and faculty recruits can make an informed choice. Universities that try to honor both will face increasing incoherence and internal conflict.</p></blockquote><p>But they don’t, really. The universities are, by and large, going to have to choose social justice. Truth will never serve any institution that depends upon a partnership with government and the banks to prey upon unsuspecting young people in order to mortgage their futures.</p></div>",
  "content_text": "Jonathan Haidt argues that universities\nface a choice\n:\nAristotle often evaluated a thing with respect to its “telos” – its purpose, end, or goal. The telos of a kife is to cut. The telos of a physician is health or healing. What is the telos of university?\nThe harvardmost obvious answer is “truth” –- the word appears on so many university crests. But increasingly, many of America’s top universities are embracing social justice as their telos, or as a second and equal telos. But can any institution or profession have two teloses (or teloi)? What happens if they conflict?\nAs a social psychologist who studies morality, I have watched these two teloses come into conflict increasingly often during my 30 years in the academy. The conflicts seemed manageable in the 1990s. But the intensity of conflict has grown since then, at the same time as the political diversity of the professoriate was plummeting, and at the same time as American cross-partisan hostility was rising. I believe the conflict reached its boiling point in the fall of 2015 when student protesters at 80 universities demanded that their universities make much greater and more explicit commitments to social justice, often including mandatory courses and training for everyone in social justice perspectives and content.\nNow that many university presidents have agreed to implement many of the demands, I believe that the conflict between truth and social justice is likely to become unmanageable.  Universities will have to choose, and be explicit about their choice, so that potential students and faculty recruits can make an informed choice. Universities that try to honor both will face increasing incoherence and internal conflict.\nBut they don’t, really. The universities are, by and large, going to have to choose social justice. Truth will never serve any institution that depends upon a partnership with government and the banks to prey upon unsuspecting young people in order to mortgage their futures.",
  "tags": [
    "education",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-22T18:00:00+00:00"
}