{
  "url": "https://voxday.net/2016/10/09/wait-theyre-going-to-police-us/",
  "scraped_at": "2025-12-18T01:58:34.637699",
  "title": "Wait, they’re going to police US?",
  "date_display": "October 9, 2016",
  "date_iso": "2016-10-09T13:30:00+00:00",
  "date_from_url": "2016-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The lesser SJWs of SF fandom belatedly discover that SF’s thought police don’t only intend to police the speech, thoughts, and behavior <a href=\"https://mcgath.wordpress.com/2016/10/08/fandom-bullies/\">of science fiction’s right wing</a>:<br/></p><blockquote><p> The illiberal factions in fandom just want power. They don’t care much whom they go after, as long as they can flex their muscles. The Worldcon 75 committee has offered the latest sample of this, shoving Dave Weingart out as the filk head.</p><p>Dave discussed what happened here. In brief: Someone got the notion that Dave should never talk to her. He respected this. One day he inadvertently posted a Babylon 5 video link to a chat group which this other person was also in. For this, he was told he could continue to run filk only if he agreed to end all staff contact outside his division. Of course, it’s impossible to run a part of the program that way, so his only choice was to withdraw.</p><p>The concom’s action makes no sense of any kind. It grows out of the notion that “feeling offended” trumps every other consideration and entitles someone to claim any remedy. Well, listen, Helsinki gang. I’m offended. I hope every filker who was planning to go cancels out on you.</p><p>I once got a supporting membership. Some early suspicions that people of this kind were running the con led me to back out on it. I never had any real plans to go there, so there’s only one thing I can stop doing. I run a Twitter account called Filk News, which contains various tidbits about what’s happening in the filk world. From here on, I’m giving the Helsinki con no publicity there.</p><p>I know Dave personally. He’s a friend and a hard worker with a lot of integrity. Filkers know that. Maybe the Helsinki clique decided filk is beneath their idea of a con. They forget that filkers aren’t just filkers; we include pro writers, regular supporters of conventions, and other people who’ve helped to build and maintain fandom. If the con had just decided to drop filk — well, it can do that. But using bullying tactics to drive us away was a serious mistake.</p></blockquote><p>And the Dark Lord laughed. It’s more than a little amusing to see how these hapless idiots obviously didn’t see it coming despite the fact that the same pattern has played out ever since the Montagnards turned on the Girondins. So, it should come as no surprise that the freakiest SJW, such as Mr. Alexandra Erin, publicly applaud the thought police, despite <a href=\"http://file770.com/?p=31173#comment-488845\">their hilarious incompetence</a>.</p><blockquote><p> I think no one would dispute to Mr. Weingart’s contributions to cons actually have been tremendously valuable. But as fannish circles and conventions embrace community standards and commitments to safety and work to be more welcoming to people from every walk of life, we really have to internalize the lesson that nobody is irreplaceable….</p><p>Even if he’s 100% right that this is just bad optics, even granting he’s 100% right that the restrictions he’d have to agree to would prevent him from doing his job, we can’t agree to treat women’s (and others’) safety concerns seriously right up until the moment that it’s inconvenient. That’s not how it works.</p></blockquote><p>Translation: Everyone who doesn’t submit to the latest version of the Narrative will be replaced. And once they scent blood, the zharks will swarm. And really, if the safety of the delicate flowers is paramount, wouldn’t it be best for everyone if they just canceled the convention and everyone stayed home, safely ensconced in their blankets and covered with a thin, comforting coating of stale Doritos dust?</p><p>I look forward to the first accusations being directed at the Finns running Worldcon 75 and charging them with being secret Castalia operatives seeking to destroy the Hugo Awards.</p></div>",
  "content_text": "The lesser SJWs of SF fandom belatedly discover that SF’s thought police don’t only intend to police the speech, thoughts, and behavior\nof science fiction’s right wing\n:\nThe illiberal factions in fandom just want power. They don’t care much whom they go after, as long as they can flex their muscles. The Worldcon 75 committee has offered the latest sample of this, shoving Dave Weingart out as the filk head.\nDave discussed what happened here. In brief: Someone got the notion that Dave should never talk to her. He respected this. One day he inadvertently posted a Babylon 5 video link to a chat group which this other person was also in. For this, he was told he could continue to run filk only if he agreed to end all staff contact outside his division. Of course, it’s impossible to run a part of the program that way, so his only choice was to withdraw.\nThe concom’s action makes no sense of any kind. It grows out of the notion that “feeling offended” trumps every other consideration and entitles someone to claim any remedy. Well, listen, Helsinki gang. I’m offended. I hope every filker who was planning to go cancels out on you.\nI once got a supporting membership. Some early suspicions that people of this kind were running the con led me to back out on it. I never had any real plans to go there, so there’s only one thing I can stop doing. I run a Twitter account called Filk News, which contains various tidbits about what’s happening in the filk world. From here on, I’m giving the Helsinki con no publicity there.\nI know Dave personally. He’s a friend and a hard worker with a lot of integrity. Filkers know that. Maybe the Helsinki clique decided filk is beneath their idea of a con. They forget that filkers aren’t just filkers; we include pro writers, regular supporters of conventions, and other people who’ve helped to build and maintain fandom. If the con had just decided to drop filk — well, it can do that. But using bullying tactics to drive us away was a serious mistake.\nAnd the Dark Lord laughed. It’s more than a little amusing to see how these hapless idiots obviously didn’t see it coming despite the fact that the same pattern has played out ever since the Montagnards turned on the Girondins. So, it should come as no surprise that the freakiest SJW, such as Mr. Alexandra Erin, publicly applaud the thought police, despite\ntheir hilarious incompetence\n.\nI think no one would dispute to Mr. Weingart’s contributions to cons actually have been tremendously valuable. But as fannish circles and conventions embrace community standards and commitments to safety and work to be more welcoming to people from every walk of life, we really have to internalize the lesson that nobody is irreplaceable….\nEven if he’s 100% right that this is just bad optics, even granting he’s 100% right that the restrictions he’d have to agree to would prevent him from doing his job, we can’t agree to treat women’s (and others’) safety concerns seriously right up until the moment that it’s inconvenient. That’s not how it works.\nTranslation: Everyone who doesn’t submit to the latest version of the Narrative will be replaced. And once they scent blood, the zharks will swarm. And really, if the safety of the delicate flowers is paramount, wouldn’t it be best for everyone if they just canceled the convention and everyone stayed home, safely ensconced in their blankets and covered with a thin, comforting coating of stale Doritos dust?\nI look forward to the first accusations being directed at the Finns running Worldcon 75 and charging them with being secret Castalia operatives seeking to destroy the Hugo Awards.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-09T12:30:00+00:00"
}