{
  "url": "https://voxday.net/2016/10/16/why-infogalactic-matters/",
  "scraped_at": "2025-12-18T01:59:33.332070",
  "title": "Why Infogalactic matters",
  "date_display": "October 16, 2016",
  "date_iso": "2016-10-16T01:00:00+00:00",
  "date_from_url": "2016-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And why it is important for everyone to use it and support it:</p><blockquote><p> Cultural Marxism refers to a school or offshoot of Marxism that conceives of culture as central to the legitimation of oppression, in addition to the economic factors that Karl Marx emphasized.[1] An outgrowth of Western Marxism that found popularity in the 1960s as cultural studies, Cultural Marxism asserts that traditional cultural phenomena commonly believed to be intrinsic to Western society, such as the drive for individual acquisition associated with capitalism, nationalism, the nuclear family, gender roles, race and other forms of cultural identity,[1] are actually historically recent developments that serve to justify and maintain the existing hierarchy of power. Cultural Marxists use Marxist methods, including historical research, the identification of economic interest, and the study of the mutually conditioning relations between parts of a social order, to try to understand the complexity of power in contemporary society and to criticise cultural phenomena that appear natural, but are actually ideological.</p></blockquote><p>This is <a href=\"http://infogalactic.com/info/Cultural_Marxism\">the Cultural Marxism page</a> that Wikipedians deleted and tried to bury. It’s just a start, as it needs sections on Gramsci and Lukacs, but it is already a huge improvement on Wikipedia. And we also know why the rabid SJWs deleted it and tried to bury it; they appear to have taken their lead from <a href=\"https://www.google.ch/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwjH7ICfgd7PAhVTahoKHQ9gCroQFggeMAA&amp;url=https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2015%2Fjan%2F19%2Fcultural-marxism-a-uniting-theory-for-rightwingers-who-love-to-play-the-victim&amp;usg=AFQjCNHCU-ivVSQE7jtFAUjOz5hbXweYGQ\">a classic <i>Guardian </i>hit-article</a> published in January 2015.</p><blockquote><p> The whole story is transparently barmy. If humanities faculties are really geared to brainwashing students into accepting the postulates of far-left ideology, the composition of western parliaments and presidencies and the roaring success of corporate capitalism suggests they’re doing an astoundingly bad job. Anyone who takes a cool look at the last three decades of politics will think it bizarre that anyone could interpret what’s happened as the triumph of an all-powerful left.</p><p>The theory of cultural Marxism is also blatantly antisemitic, drawing on the idea of Jews as a fifth column bringing down western civilisation from within, a racist trope that has a longer history than Marxism. Like the Protocols of the Elders of Zion, the theory was fabricated to order, for a special purpose: the institution and perpetuation of culture war. We can even nominate an author for this lunacy: William S Lind, a polymath of the American hard right, who sought to put rightwing activism on a new footing as the cold war drew to a close.</p></blockquote><p>What a beautiful example of its type! Talk about the legitimate history, bring up the modern references, then denounce the whole thing as hogwash for a spurious logical reason that doesn’t hold up for three seconds to anyone who isn’t a mindless SJW. That’s <i>exactly </i>how they like to do it. Everything is aimed at convincing the Right to disbelieve what it is seeing, and to lay down its arms and not resist the endless provocations and forays of the Left.</p><p>Culture war? What culture war? We’re not fighting a culture war, and if anyone claims we are, then by all the gods in which we don’t believe, we’ll hunt you down and make sure you lose your job!</p><p>Also, I have to thank Infogalactic’s new subscribers. Infogalactic is now nearly halfway to the initial goal of 100 subscribers, and I’m very pleased to say that the 48 monthly subscribers are now covering 100 percent of Infogalactic’s current burn rate. The reason that Infogalactic will need to continue <a href=\"http://infogalactic.com/info/Infogalactic:Donations\">to increase the number of subscribers</a>, first to 100, then eventually to 1000, is because as the traffic grows, the burden on the servers will correspondingly grow as well. Right now we’re on track to record multiple millions of pageviews in the first month, which is astonishing… but the English Wikipedia alone saw 7.8 billion pageviews in August alone.</p><p>I’m not at all surprised at the staunch support, but what is surprising is that in the first week we’ve already seen experienced Wikipedia editors come on board, even though we’re still in Phase One. Why, when the base tech is virtually identical? Because we don’t have a culture of deletionism or insist on enforcing the SJW Narrative. The trickle has started. Before long, it will become a flood.</p><p>And don’t worry that I’m going to shill for Infogalactic every day any more than I do for Castalia House. (Mike Cernovich reading that, just shook his head and muttered something about my being an upper-middle-class pussy.) But I did need to thank the Burn Unit members and let them know that thanks to them, the second major support hurdle has been surmounted. It is a significant step, because it means that we’re all in it for the long march.</p><p>UPDATE: Now this is a very interesting development! From the comments:</p><blockquote class=\"tr_bq\"><p> I am really loving using infogalactic for my attribs when fighting online. Seeing that URL seems to make SJWs crazy. I get double the level of trolling of both destroying their argument and deprecating their favorite tool as well.</p></blockquote><p>But it also underlines why Infogalactic has to not only be different than Wikipedia, it has to be objectively <i>better</i>.</p></div>",
  "content_text": "And why it is important for everyone to use it and support it:\nCultural Marxism refers to a school or offshoot of Marxism that conceives of culture as central to the legitimation of oppression, in addition to the economic factors that Karl Marx emphasized.[1] An outgrowth of Western Marxism that found popularity in the 1960s as cultural studies, Cultural Marxism asserts that traditional cultural phenomena commonly believed to be intrinsic to Western society, such as the drive for individual acquisition associated with capitalism, nationalism, the nuclear family, gender roles, race and other forms of cultural identity,[1] are actually historically recent developments that serve to justify and maintain the existing hierarchy of power. Cultural Marxists use Marxist methods, including historical research, the identification of economic interest, and the study of the mutually conditioning relations between parts of a social order, to try to understand the complexity of power in contemporary society and to criticise cultural phenomena that appear natural, but are actually ideological.\nThis is\nthe Cultural Marxism page\nthat Wikipedians deleted and tried to bury. It’s just a start, as it needs sections on Gramsci and Lukacs, but it is already a huge improvement on Wikipedia. And we also know why the rabid SJWs deleted it and tried to bury it; they appear to have taken their lead from\na classic\nGuardian\nhit-article\npublished in January 2015.\nThe whole story is transparently barmy. If humanities faculties are really geared to brainwashing students into accepting the postulates of far-left ideology, the composition of western parliaments and presidencies and the roaring success of corporate capitalism suggests they’re doing an astoundingly bad job. Anyone who takes a cool look at the last three decades of politics will think it bizarre that anyone could interpret what’s happened as the triumph of an all-powerful left.\nThe theory of cultural Marxism is also blatantly antisemitic, drawing on the idea of Jews as a fifth column bringing down western civilisation from within, a racist trope that has a longer history than Marxism. Like the Protocols of the Elders of Zion, the theory was fabricated to order, for a special purpose: the institution and perpetuation of culture war. We can even nominate an author for this lunacy: William S Lind, a polymath of the American hard right, who sought to put rightwing activism on a new footing as the cold war drew to a close.\nWhat a beautiful example of its type! Talk about the legitimate history, bring up the modern references, then denounce the whole thing as hogwash for a spurious logical reason that doesn’t hold up for three seconds to anyone who isn’t a mindless SJW. That’s\nexactly\nhow they like to do it. Everything is aimed at convincing the Right to disbelieve what it is seeing, and to lay down its arms and not resist the endless provocations and forays of the Left.\nCulture war? What culture war? We’re not fighting a culture war, and if anyone claims we are, then by all the gods in which we don’t believe, we’ll hunt you down and make sure you lose your job!\nAlso, I have to thank Infogalactic’s new subscribers. Infogalactic is now nearly halfway to the initial goal of 100 subscribers, and I’m very pleased to say that the 48 monthly subscribers are now covering 100 percent of Infogalactic’s current burn rate. The reason that Infogalactic will need to continue\nto increase the number of subscribers\n, first to 100, then eventually to 1000, is because as the traffic grows, the burden on the servers will correspondingly grow as well. Right now we’re on track to record multiple millions of pageviews in the first month, which is astonishing… but the English Wikipedia alone saw 7.8 billion pageviews in August alone.\nI’m not at all surprised at the staunch support, but what is surprising is that in the first week we’ve already seen experienced Wikipedia editors come on board, even though we’re still in Phase One. Why, when the base tech is virtually identical? Because we don’t have a culture of deletionism or insist on enforcing the SJW Narrative. The trickle has started. Before long, it will become a flood.\nAnd don’t worry that I’m going to shill for Infogalactic every day any more than I do for Castalia House. (Mike Cernovich reading that, just shook his head and muttered something about my being an upper-middle-class pussy.) But I did need to thank the Burn Unit members and let them know that thanks to them, the second major support hurdle has been surmounted. It is a significant step, because it means that we’re all in it for the long march.\nUPDATE: Now this is a very interesting development! From the comments:\nI am really loving using infogalactic for my attribs when fighting online. Seeing that URL seems to make SJWs crazy. I get double the level of trolling of both destroying their argument and deprecating their favorite tool as well.\nBut it also underlines why Infogalactic has to not only be different than Wikipedia, it has to be objectively\nbetter\n.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-10-16T00:00:00+00:00"
}