{
  "url": "https://voxday.net/2015/01/18/a-pink-sf-pet-on-oscars/",
  "scraped_at": "2025-12-16T12:42:13.174316",
  "title": "A Pink SF pet on the Oscars",
  "date_display": "January 18, 2015",
  "date_iso": "2015-01-18T19:50:00+00:00",
  "date_from_url": "2015-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Saladin Ahmed ‏@saladinahmed<br> Not a single one of the TWENTY actors/actresses nominated for Oscars in 2015 is a person of color. Not one. That’s called white supremacy.</br></p><p>Vox Day ‏@voxday<br> Actually, white supremacy is what prevents people like Saladin Ahmed from throwing gays off rooftops.</br></p><p>Mr. Ahmed, in case you were unaware, is Pink SF’s token Mahometan. He was an affirmative action nominee for the Hugo, Nebula, Crawford, Gemmell, and British Fantasy awards in 2013 for a mediocre debut novel called <i>Throne of the Crescent Moon</i>. It’s rather amusing to see him alternate SJW poses with statements like his post-Hebdo assault on free speech <a href=\"http://www.nytimes.com/roomfordebate/2015/01/10/when-satire-cuts-both-ways/in-unequal-an-world-mocking-all-serves-the-powerful\">in the New York Times</a>.</p><blockquote class=\"tr_bq\"><p> The question for writers and artists, then, is not whether we ought to limit ourselves, but how we already limit ourselves. In a field dominated by privileged voices, it’s not enough to say “Mock everyone!” In an unequal world, satire that mocks everyone equally ends up serving the powerful. And in the context of brutal inequality, it is worth at least asking what preexisting injuries we are adding our insults to. The belief that satire is a courageous art beholden to no one is intoxicating. But satire might be better served by an honest reckoning of whose voices we hear and don’t hear, of who we mock and who we don’t, and why.</p></blockquote><p>‘Twas also more than a little amusing to see how quick the pinkshirts were to rush in and assure Mr. Ahmed <a href=\"https://twitter.com/saladinahmed/status/556860594788134912\">THEY STILL CONSIDER HIM TO BE ONE OF THEM</a>. They’ve learned absolutely nothing from the Charlie Hebdo massacres. So I suspect it’s going to be even more amusing to watch as they gradually turn on him over the next decade.</p><blockquote class=\"tr_bq\"><p> D Franklin ‏@D_Libris<br> Or hollow laughter at the hypocritical, mendacious evil of VD, &amp; hugs for Saladin who has to put up with that shit</br></p><p>Charlie Stross ‏@cstross<br> congratulations! You’ve drawn the ire of SF’s very worst self-defeating loser. You level up!</br></p><p>Haralambi Markov ‏@HaralambiMarkov<br> That’s not cute. That’s just insulting. Oh My Everything.</br></p><p>Sean ‏@Sea_Bunker<br> I musta missed the part where you (SA) are a violent homophobe. Vox, on the other hand…</br></p><p>Jim C. Hines ‏@jimchines<br> That … but … huh?</br></p><p>Always Randy ‏@RandyTheRandom<br> What is preventing me from throwing White Supremacist Assholes from rooftops, though?</br></p><p>Charlie Stross ‏@cstross<br> if I followed VD’s totalising logic, gay unitarians would be as dangerous to Jews as the Aryan Nations.</br></p><p>BenjanunSriduangkaew ‏@bees_ja<br> Holy shit. Sorry he’s using queer people to concern-troll you, wow.</br></p><p>Matt Forbeck ‏@mforbeck<br> Ah, what a jackass. I’d stay “stunning jackass” but we’ve come to expect it by now.</br></p><p>Bootleg Girl ‏@BootlegGirl<br> Seriously though I “love” how atheist libertarians who are massive bigots project their own desires onto Muslims</br></p><p>Jim C. Hines ‏@jimchines<br> VD stretching the truth? I am shocked. Shocked, I say!</br></p><p>Rae Carson ‏@raecarson 31m31 minutes ago<br> Ugh, Saladin, I’m so sorry you have to deal with shitbags like him.</br></p><p>Nightjar UrsulaV ‏@UrsulaV<br> Its’s like he’s got a bigot magnetic poetry kit and arranges these on his fridge.</br></p><p>Fledgist ‏@Fledgist<br> One should be measured by the enemies one attracts.</br></p><p>Charlie Stross ‏@cstross<br> Yes, but going by VD is like measuring yourself against the stench of the dog turd you just stepped in.</br></p></blockquote><p>One subtle irony that will probably escape the average reader is the way Benjanun Sriduangkaew is attempting to worm her way back into the warren here. She was quasi-excommunicated from the Pink SF community two months ago when <a href=\"http://www.dailydot.com/geek/benjanun-sriduangkaew-revealed-to-be-troll-requires-hate-winterfox/\">her alternate identity was exposed</a> as being the notorious Requires Only That You Hate.</p><p>UPDATE: See, the pinkshirts are really all about the tolerance. And free speech.</p><p>Really Tired Wanker ‏@benfromcanada<br>@saladinahmed god damn these people</br></p></div>",
  "content_text": "Saladin Ahmed ‏@saladinahmed\nNot a single one of the TWENTY actors/actresses nominated for Oscars in 2015 is a person of color. Not one. That’s called white supremacy.\nVox Day ‏@voxday\nActually, white supremacy is what prevents people like Saladin Ahmed from throwing gays off rooftops.\nMr. Ahmed, in case you were unaware, is Pink SF’s token Mahometan. He was an affirmative action nominee for the Hugo, Nebula, Crawford, Gemmell, and British Fantasy awards in 2013 for a mediocre debut novel called\nThrone of the Crescent Moon\n. It’s rather amusing to see him alternate SJW poses with statements like his post-Hebdo assault on free speech\nin the New York Times\n.\nThe question for writers and artists, then, is not whether we ought to limit ourselves, but how we already limit ourselves. In a field dominated by privileged voices, it’s not enough to say “Mock everyone!” In an unequal world, satire that mocks everyone equally ends up serving the powerful. And in the context of brutal inequality, it is worth at least asking what preexisting injuries we are adding our insults to. The belief that satire is a courageous art beholden to no one is intoxicating. But satire might be better served by an honest reckoning of whose voices we hear and don’t hear, of who we mock and who we don’t, and why.\n‘Twas also more than a little amusing to see how quick the pinkshirts were to rush in and assure Mr. Ahmed\nTHEY STILL CONSIDER HIM TO BE ONE OF THEM\n. They’ve learned absolutely nothing from the Charlie Hebdo massacres. So I suspect it’s going to be even more amusing to watch as they gradually turn on him over the next decade.\nD Franklin ‏@D_Libris\nOr hollow laughter at the hypocritical, mendacious evil of VD, & hugs for Saladin who has to put up with that shit\nCharlie Stross ‏@cstross\ncongratulations! You’ve drawn the ire of SF’s very worst self-defeating loser. You level up!\nHaralambi Markov ‏@HaralambiMarkov\nThat’s not cute. That’s just insulting. Oh My Everything.\nSean ‏@Sea_Bunker\nI musta missed the part where you (SA) are a violent homophobe. Vox, on the other hand…\nJim C. Hines ‏@jimchines\nThat … but … huh?\nAlways Randy ‏@RandyTheRandom\nWhat is preventing me from throwing White Supremacist Assholes from rooftops, though?\nCharlie Stross ‏@cstross\nif I followed VD’s totalising logic, gay unitarians would be as dangerous to Jews as the Aryan Nations.\nBenjanunSriduangkaew ‏@bees_ja\nHoly shit. Sorry he’s using queer people to concern-troll you, wow.\nMatt Forbeck ‏@mforbeck\nAh, what a jackass. I’d stay “stunning jackass” but we’ve come to expect it by now.\nBootleg Girl ‏@BootlegGirl\nSeriously though I “love” how atheist libertarians who are massive bigots project their own desires onto Muslims\nJim C. Hines ‏@jimchines\nVD stretching the truth? I am shocked. Shocked, I say!\nRae Carson ‏@raecarson 31m31 minutes ago\nUgh, Saladin, I’m so sorry you have to deal with shitbags like him.\nNightjar UrsulaV ‏@UrsulaV\nIts’s like he’s got a bigot magnetic poetry kit and arranges these on his fridge.\nFledgist ‏@Fledgist\nOne should be measured by the enemies one attracts.\nCharlie Stross ‏@cstross\nYes, but going by VD is like measuring yourself against the stench of the dog turd you just stepped in.\nOne subtle irony that will probably escape the average reader is the way Benjanun Sriduangkaew is attempting to worm her way back into the warren here. She was quasi-excommunicated from the Pink SF community two months ago when\nher alternate identity was exposed\nas being the notorious Requires Only That You Hate.\nUPDATE: See, the pinkshirts are really all about the tolerance. And free speech.\nReally Tired Wanker ‏@benfromcanada\n@saladinahmed god damn these people",
  "tags": [
    "Clash of Civilizations",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-18T19:50:00+00:00"
}