{
  "url": "https://voxday.net/2015/01/27/a-proper-hobbi/",
  "scraped_at": "2025-12-16T12:43:14.430232",
  "title": "A proper Hobbit",
  "date_display": "January 27, 2015",
  "date_iso": "2015-01-27T09:49:00+00:00",
  "date_from_url": "2015-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TolkienEditor <a href=\"https://tolkieneditor.wordpress.com/\">has cut Peter Jackson’s abusive monstrosity in half</a> and thereby, in large part, restored Tolkien’s much-beloved tale:</p><blockquote class=\"tr_bq\"><p> I decided to condense all three installments (An Unexpected Journey, The Desolation of Smaug and The Battle of the Five Armies) into a single 4-hour feature that more closely resembled Tolkien’s original novel. Well, okay, it’s closer to 4.5 hours, but those are some long-ass credits! This new version was achieved through a series of major and minor cuts, detailed below:</p><p>The investigation of Dol Guldor has been completely excised, including the appearances of Radagast, Saruman and Galadriel. This was the most obvious cut, and the easiest to carry out (a testament to its irrelevance to the main narrative). Like the novel, Gandalf abruptly disappears on the borders of Mirkwood, and then reappears at the siege of the Lonely Mountain with tidings of an orc army.</p><p>The Tauriel-Legolas-Kili love triangle has also been removed. Indeed, Tauriel is no longer a character in the film, and Legolas only gets a brief cameo during the Mirkwood arrest. This was the next clear candidate for elimination, given how little plot value and personality these two woodland sprites added to the story. Dwarves are way more fun to hang out with anyway. 😛</p><p>The Pale Orc subplot is vastly trimmed down. Azog is obviously still leading the attack on the Lonely Mountain at the end, but he does not appear in the film until after the company escapes the goblin tunnels (suggesting that the slaying of the Great Goblin is a factor in their vendetta, as it was in the novel).</p></blockquote><p>I was pleased to learn that in addition to getting rid of “Tauriel”, the ridiculous barrel-fight is also gone. <i>The Hobbit: The Tolkien Edit</i> is a 6GB MP4 file, available by either torrent or direct download. Not all of Jackson’s egregious stupidities have been excised, but most of them have been surgically removed.</p><p>UPDATE: Another, <a href=\"http://definitivehobbitcut.tumblr.com/\">even more reduced</a> option:</p><blockquote class=\"tr_bq\"><p> After about <strong>312 new edits and cuts and almost 5 hours removed</strong><br> from the trilogy, this single film combines the three Peter Jackson<br> movies into one immense epic that accurately tells the story of Bilbo,<br> while maintaining what new ideas and battles have been implanted in<br> Jackson’s retelling (such as the Battle of the Five Armies containing<br> orcs instead of goblins). <br/></br></br></br></br></br></p><div class=\"p4\"> The following is a list of all the major<br> edits/alterations to the films for this single edit. Scenes aren’t<br> always simply removed, sometimes they are repositioned or sometimes<br> specific elements are taken out or added in for coherency or pacing:  </br></br></br></div><ul><li>Removed all of Elf-Dwarf Love Triangle Plot</li><li>Removed all of Gandalf’s necromancer adventures</li><li>Removed most of orc scenes/battles/mentions in first 2/3’s of<br> the film (including removing frames with orcs from the post-goblin<br> escape scene at the end of “Unexpected Journey”)</br></br></li><li>Removed Bilbo killing a wolf – the first thing he kills is the spider in Mirkwood forest, giving the sword the name “Sting”</li><li>Removed all of (elder) Bilbo’s introduction to the lore</li><li>Removed all of the heavy foreshadowing for LOTR and the evil of the ring – kept to the spirit of the book, it was a playful invisibility ring!</li><li>Added a deleted scene of the Shire villagers as an intro to the film</li><li>Reduced much of the Dwarves’ dinner at Bilbo’s</li><li>Created faster transition to Bilbo getting out of the house</li><li>Reduced Rivendell</li><li>Reduced Stone Giant scene</li><li>Reduced goblin scene, re-ordered dialogue to mirror book interactions between Thorin &amp; Goblin King</li><li>Kept Gollum scene entirely intact – no cutting between that<br> and the goblin lair, although shortened as well as removed Gollum<br> beating the corpse in the beginning</br></br></li><li>Created voice-over transition into Beorn scene at the beginning of “Desolation of Smaug”</li><li>Reduced Mirkwood forest &amp; Woodland Realm capture scenes</li><li>Heavily reduced Laketown capture (all of Laketown is about 10 minutes total now)</li><li>Removed Smaug battle scene with dwarves in the mines (kept<br> Bilbo’s conversation with Smaug, the battle was outrageously cartoonish<br> and long)</br></br></li><li>Removed Bard using his son as a bow, the shots dance around it and the scene is intact </li><li>Rearranged much of Battle of Five Armies for coherency of<br> Bilbo concealing and giving away the Arkenstone without the need for so<br> many silly slow-motion Thorin bits</br></br></li><li>Removed many elements of the Battle of Five Armies that<br> contained too much CGI monsters or silly battle actions (like repeated<br> head-butting) </br></br></li><li>Reduced and rearranged the battle to get to Thorin quicker</li><li>Removed elves from the final fight scene (Kili fights the orc in order to protect Bilbo instead of his elf love interest)</li><li>Removed final flash-forward scene, the film ends with Bilbo finally coming home</li></ul></blockquote></div>",
  "content_text": "TolkienEditor\nhas cut Peter Jackson’s abusive monstrosity in half\nand thereby, in large part, restored Tolkien’s much-beloved tale:\nI decided to condense all three installments (An Unexpected Journey, The Desolation of Smaug and The Battle of the Five Armies) into a single 4-hour feature that more closely resembled Tolkien’s original novel. Well, okay, it’s closer to 4.5 hours, but those are some long-ass credits! This new version was achieved through a series of major and minor cuts, detailed below:\nThe investigation of Dol Guldor has been completely excised, including the appearances of Radagast, Saruman and Galadriel. This was the most obvious cut, and the easiest to carry out (a testament to its irrelevance to the main narrative). Like the novel, Gandalf abruptly disappears on the borders of Mirkwood, and then reappears at the siege of the Lonely Mountain with tidings of an orc army.\nThe Tauriel-Legolas-Kili love triangle has also been removed. Indeed, Tauriel is no longer a character in the film, and Legolas only gets a brief cameo during the Mirkwood arrest. This was the next clear candidate for elimination, given how little plot value and personality these two woodland sprites added to the story. Dwarves are way more fun to hang out with anyway. 😛\nThe Pale Orc subplot is vastly trimmed down. Azog is obviously still leading the attack on the Lonely Mountain at the end, but he does not appear in the film until after the company escapes the goblin tunnels (suggesting that the slaying of the Great Goblin is a factor in their vendetta, as it was in the novel).\nI was pleased to learn that in addition to getting rid of “Tauriel”, the ridiculous barrel-fight is also gone.\nThe Hobbit: The Tolkien Edit\nis a 6GB MP4 file, available by either torrent or direct download. Not all of Jackson’s egregious stupidities have been excised, but most of them have been surgically removed.\nUPDATE: Another,\neven more reduced\noption:\nAfter about\n312 new edits and cuts and almost 5 hours removed\nfrom the trilogy, this single film combines the three Peter Jackson\nmovies into one immense epic that accurately tells the story of Bilbo,\nwhile maintaining what new ideas and battles have been implanted in\nJackson’s retelling (such as the Battle of the Five Armies containing\norcs instead of goblins).\nThe following is a list of all the major\nedits/alterations to the films for this single edit. Scenes aren’t\nalways simply removed, sometimes they are repositioned or sometimes\nspecific elements are taken out or added in for coherency or pacing:\nRemoved all of Elf-Dwarf Love Triangle Plot\nRemoved all of Gandalf’s necromancer adventures\nRemoved most of orc scenes/battles/mentions in first 2/3’s of\nthe film (including removing frames with orcs from the post-goblin\nescape scene at the end of “Unexpected Journey”)\nRemoved Bilbo killing a wolf – the first thing he kills is the spider in Mirkwood forest, giving the sword the name “Sting”\nRemoved all of (elder) Bilbo’s introduction to the lore\nRemoved all of the heavy foreshadowing for LOTR and the evil of the ring – kept to the spirit of the book, it was a playful invisibility ring!\nAdded a deleted scene of the Shire villagers as an intro to the film\nReduced much of the Dwarves’ dinner at Bilbo’s\nCreated faster transition to Bilbo getting out of the house\nReduced Rivendell\nReduced Stone Giant scene\nReduced goblin scene, re-ordered dialogue to mirror book interactions between Thorin & Goblin King\nKept Gollum scene entirely intact – no cutting between that\nand the goblin lair, although shortened as well as removed Gollum\nbeating the corpse in the beginning\nCreated voice-over transition into Beorn scene at the beginning of “Desolation of Smaug”\nReduced Mirkwood forest & Woodland Realm capture scenes\nHeavily reduced Laketown capture (all of Laketown is about 10 minutes total now)\nRemoved Smaug battle scene with dwarves in the mines (kept\nBilbo’s conversation with Smaug, the battle was outrageously cartoonish\nand long)\nRemoved Bard using his son as a bow, the shots dance around it and the scene is intact\nRearranged much of Battle of Five Armies for coherency of\nBilbo concealing and giving away the Arkenstone without the need for so\nmany silly slow-motion Thorin bits\nRemoved many elements of the Battle of Five Armies that\ncontained too much CGI monsters or silly battle actions (like repeated\nhead-butting)\nReduced and rearranged the battle to get to Thorin quicker\nRemoved elves from the final fight scene (Kili fights the orc in order to protect Bilbo instead of his elf love interest)\nRemoved final flash-forward scene, the film ends with Bilbo finally coming home",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-27T09:49:00+00:00"
}