{
  "url": "https://voxday.net/2015/01/29/a-true-team-player/",
  "scraped_at": "2025-12-16T12:43:32.918069",
  "title": "A true team player",
  "date_display": "January 29, 2015",
  "date_iso": "2015-01-29T21:00:00+00:00",
  "date_from_url": "2015-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: left;\"> I picked Belichick and Brady to beat Seattle in the Super Bowl before the playoffs started. I’m not changing that prediction now barring Brady being ill at gametime; this is their last hurrah, they know it, they’ve got a healthy Gronk, and Belichick has had two weeks to prepare. That being said, I really like Richard Sherman, as for all his flash and attitude, he is far more <a href=\"http://mmqb.si.com/2015/01/27/richard-sherman-seahawks-super-bowl-49-sports-illustrated-magazine/\">a hard-working team player</a> than many a fan and media favorite.</div><blockquote class=\"tr_bq\"><p> I was lucky to be drafted by Pete and John, who<br> assembled around me one of the most talented and diverse defensive<br> backfields in football. More than I want individual success, I want to<br> be remembered as part of the Legion of Boom, which is why all of us are<br> on the cover of Sports Illustrated magazine this week. In football,<br> unlike various other sports, it takes a total team effort to be<br> successful.</br></br></br></br></br></br></p><p>I can’t perform at<br> this level without Kam Chancellor, the lion of the Legion, the guy who<br> once picked off Peyton Manning by ducking to make it appear as though he<br> couldn’t leap for the ball. He’s also the guy we go to with our<br> problems, who doles out advice about a lot of issues that arise outside<br> of football.</br></br></br></br></br></p><p>I can’t perform at this level without Earl Thomas—The Example—who can<br> show you how to do the right thing better than he can explain it. When<br> everybody else is joking, he’s locked in, a reminder of what we’re here<br> for.</br></br></br></p><p>I can’t perform at this level without Byron Maxwell, our chill guy,<br> oblivious to the pressure. I remember him joking around with Carroll in<br> our rookie camp, saying that if he was allowed to play nickel he’d choke<br> out the slot receiver. Carroll relented and Maxwell delivered, only to<br> get injured in camp. Now he’s the corner on the other side, and his<br> consistently high level of play makes QBs’ decisions very difficult.</br></br></br></br></br></p><p>I can’t perform at this level without Jeremy Lane, the scrappy guy<br> from Tyler, Texas. Competition brings out the dog in him; just look at<br> what he’s done to the Packers’ Randall Cobb.</br></br></p></blockquote><p>He’s also entirely sound on Roger Goodell. One thing I always pay attention to with regards to public figures is how they are regarded by those closest to them. The men who tend to have the strongest characters are those whose friends and colleagues are loyal and stand by them even when the heat is on. The fact that Sherman, the most famous and outspoken member of the Legion of Boom, doesn’t pretend to be the top dog but instead defers to Chancellor as the leader, helps explain why a collection of fairly low draft picks – one first-rounder, two fifth-rounders, and two sixth-rounders – evolved into the most fearsome defensive secondary of all time.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://simmqb.files.wordpress.com/2015/01/lob-thomas-chancellor-sherman-maxwell-lane-960.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"213\" src=\"https://simmqb.files.wordpress.com/2015/01/lob-thomas-chancellor-sherman-maxwell-lane-960.jpg\" width=\"320\"/></a></div><p>It’s strange how many people involved in team sports insist on focusing exclusively on individual talents when the evidence clearly indicates that how well you operate as part of a unit is more important for ultimate team success than your individual talents. I suspect it may not be an accident that at least two of the Legion of Boom members, including its leader, are devout Christians. And although Sherman doesn’t come right out and say it, I wouldn’t be surprised to learn that the original plan had been to put him on the cover alone.</p><p>And if the Seahawks do knock off one of the two best pairings of coach and quarterback in NFL history, that will be further testimony to the sum being greater than the whole of the parts. I can honestly say that aside from the original Purple People Eaters and the Buddy Ryan Bears, I haven’t enjoyed watching a defense more than Seattle’s over the last two years. I wasn’t the only one who decided the Super Bowl was over after seeing this hit by Chancellor. Watch the battle between him and Gronkowski for an early clue on how the game will turn out.</p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/0UevvfswzGk?feature=player_detailpage\" width=\"512\"></iframe></p></div>",
  "content_text": "I picked Belichick and Brady to beat Seattle in the Super Bowl before the playoffs started. I’m not changing that prediction now barring Brady being ill at gametime; this is their last hurrah, they know it, they’ve got a healthy Gronk, and Belichick has had two weeks to prepare. That being said, I really like Richard Sherman, as for all his flash and attitude, he is far more\na hard-working team player\nthan many a fan and media favorite.\nI was lucky to be drafted by Pete and John, who\nassembled around me one of the most talented and diverse defensive\nbackfields in football. More than I want individual success, I want to\nbe remembered as part of the Legion of Boom, which is why all of us are\non the cover of Sports Illustrated magazine this week. In football,\nunlike various other sports, it takes a total team effort to be\nsuccessful.\nI can’t perform at\nthis level without Kam Chancellor, the lion of the Legion, the guy who\nonce picked off Peyton Manning by ducking to make it appear as though he\ncouldn’t leap for the ball. He’s also the guy we go to with our\nproblems, who doles out advice about a lot of issues that arise outside\nof football.\nI can’t perform at this level without Earl Thomas—The Example—who can\nshow you how to do the right thing better than he can explain it. When\neverybody else is joking, he’s locked in, a reminder of what we’re here\nfor.\nI can’t perform at this level without Byron Maxwell, our chill guy,\noblivious to the pressure. I remember him joking around with Carroll in\nour rookie camp, saying that if he was allowed to play nickel he’d choke\nout the slot receiver. Carroll relented and Maxwell delivered, only to\nget injured in camp. Now he’s the corner on the other side, and his\nconsistently high level of play makes QBs’ decisions very difficult.\nI can’t perform at this level without Jeremy Lane, the scrappy guy\nfrom Tyler, Texas. Competition brings out the dog in him; just look at\nwhat he’s done to the Packers’ Randall Cobb.\nHe’s also entirely sound on Roger Goodell. One thing I always pay attention to with regards to public figures is how they are regarded by those closest to them. The men who tend to have the strongest characters are those whose friends and colleagues are loyal and stand by them even when the heat is on. The fact that Sherman, the most famous and outspoken member of the Legion of Boom, doesn’t pretend to be the top dog but instead defers to Chancellor as the leader, helps explain why a collection of fairly low draft picks – one first-rounder, two fifth-rounders, and two sixth-rounders – evolved into the most fearsome defensive secondary of all time.\nIt’s strange how many people involved in team sports insist on focusing exclusively on individual talents when the evidence clearly indicates that how well you operate as part of a unit is more important for ultimate team success than your individual talents. I suspect it may not be an accident that at least two of the Legion of Boom members, including its leader, are devout Christians. And although Sherman doesn’t come right out and say it, I wouldn’t be surprised to learn that the original plan had been to put him on the cover alone.\nAnd if the Seahawks do knock off one of the two best pairings of coach and quarterback in NFL history, that will be further testimony to the sum being greater than the whole of the parts. I can honestly say that aside from the original Purple People Eaters and the Buddy Ryan Bears, I haven’t enjoyed watching a defense more than Seattle’s over the last two years. I wasn’t the only one who decided the Super Bowl was over after seeing this hit by Chancellor. Watch the battle between him and Gronkowski for an early clue on how the game will turn out.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-29T21:00:00+00:00"
}