{
  "url": "https://voxday.net/2015/01/22/an-endorsement-from-dean-of-mil-sf/",
  "scraped_at": "2025-12-16T12:42:38.640233",
  "title": "An endorsement from the Dean of Mil-SF",
  "date_display": "January 22, 2015",
  "date_iso": "2015-01-22T14:07:00+00:00",
  "date_from_url": "2015-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.jerrypournelle.com/chaosmanor/state-of-union-and-depression-windows-10/\">Jerry Pournelle approves</a> of Castalia’s new mil-SF anthology:</p><blockquote class=\"tr_bq\"><p> <b><a href=\"http://www.amazon.com/Riding-Red-Horse-Christopher-Nuttall-ebook/dp/B00QZD9H5K\"><i>Riding The Red Horse</i></a></b> has a number of stories and essays, and is worth your buying. My non fiction contribution is an essay on simulation I did for Avalon Hill in the 70’s –and it is still pretty good. They found and asked my permission, and I am told I’ve already earned a good dinner out of it… Next I think comes a revival of <i>There Will Be War</i>.</p></blockquote><p>It’s good to see Dr. Pournelle recovering so rapidly from his stroke. As a wargamer and game designer, I very much enjoyed his game design essay in <i>The General</i>; I found it by pure happenstance and we added it at literally the last moment. It was fascinating to learn that he was the inventor of the “matchbox” concealment system, which uses a single unit to stand in for several, a concept that is incorporated in most wargames these days in one way or another.</p></div>",
  "content_text": "Jerry Pournelle approves\nof Castalia’s new mil-SF anthology:\nRiding The Red Horse\nhas a number of stories and essays, and is worth your buying. My non fiction contribution is an essay on simulation I did for Avalon Hill in the 70’s –and it is still pretty good. They found and asked my permission, and I am told I’ve already earned a good dinner out of it… Next I think comes a revival of\nThere Will Be War\n.\nIt’s good to see Dr. Pournelle recovering so rapidly from his stroke. As a wargamer and game designer, I very much enjoyed his game design essay in\nThe General\n; I found it by pure happenstance and we added it at literally the last moment. It was fascinating to learn that he was the inventor of the “matchbox” concealment system, which uses a single unit to stand in for several, a concept that is incorporated in most wargames these days in one way or another.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-22T14:07:00+00:00"
}