{
  "url": "https://voxday.net/2015/01/24/anti-europeanists/",
  "scraped_at": "2025-12-16T12:42:50.836795",
  "title": "Anti-Europeanists",
  "date_display": "January 24, 2015",
  "date_iso": "2015-01-24T08:00:00+00:00",
  "date_from_url": "2015-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.ynetnews.com/articles/0,7340,L-4299673,00.html\">celebration of Islamic expansion in Europe</a> may explain why the French and British people haven’t been shedding many tears over Jews targeted by Muslims in Europe:</p><blockquote class=\"tr_bq\"><p> Rabbi Baruch Efrati, a yeshiva head and community rabbi in the West Bank settlement of Efrat, believes that the Islamization of Europe is actually a good thing.</p><p>“With the help of God, the gentiles there will adopt a healthier life with a lot of modesty and integrity, and not like the hypocritical Christianity which appears pure but is fundamentally corrupt,” he explained.</p><p>Rabbi Efrati was asked to discuss the issue by an oriental studies student, who inquired on Judaism’s stand toward the process Europe has been going through in recent years. Following the election of a hijab-wearing Muslim woman as the mayor of the Bosnian city of Visoko for the first time in continent’s history, the student asked the rabbi on the Kipa website: “How do we fight the Islamization of Europe and return it to the hands of Christians and moderates?”</p><p>Efrati wrote in response that the Islamization of Europe was better than a Christian Europe for ethical and theological reasons – as a punishment against Christians for persecuting the Jews and the fact that Christianity, as opposed to Islam, is considered “idolatry” from a halachic point of view….</p><p>“Europe is losing its identity in favor of another people and another religion, and there will be no remnants and survivors from the impurity of Christianity, which shed a lot of blood it won’t be able to atone for.”</p></blockquote><p>One would have thought the Jews might have learned from the Granada Massacre and the Reconquista that betting on the Mahometans isn’t the smart thing to do. Meanwhile, David Goldberg declares that <a href=\"http://pjmedia.com/spengler/2015/01/21/election-envy-the-europeans-and-the-jews/\">he has nothing to say</a> to anyone in Europe:</p><blockquote class=\"tr_bq\"><p> It’s been so long since Europeans took their own national identity<br> seriously that it’s hard for them to remember why it is that they can’t<br> stand the sort of Jew who represents the Jewish future. One has to put<br> them on the proverbial couch and coax it out of them: Europeans hate<br> Jews because European national identity from the outset was a dreadful<br> parody of Jewish identity…. I speak three European languages apart from English and have nothing to say to anybody in any of them.</br></br></br></br></br></p></blockquote><p>I used to like reading Goldberg back when he was Spengler. Now… what is he even trying to say?</p></div>",
  "content_text": "This\ncelebration of Islamic expansion in Europe\nmay explain why the French and British people haven’t been shedding many tears over Jews targeted by Muslims in Europe:\nRabbi Baruch Efrati, a yeshiva head and community rabbi in the West Bank settlement of Efrat, believes that the Islamization of Europe is actually a good thing.\n“With the help of God, the gentiles there will adopt a healthier life with a lot of modesty and integrity, and not like the hypocritical Christianity which appears pure but is fundamentally corrupt,” he explained.\nRabbi Efrati was asked to discuss the issue by an oriental studies student, who inquired on Judaism’s stand toward the process Europe has been going through in recent years. Following the election of a hijab-wearing Muslim woman as the mayor of the Bosnian city of Visoko for the first time in continent’s history, the student asked the rabbi on the Kipa website: “How do we fight the Islamization of Europe and return it to the hands of Christians and moderates?”\nEfrati wrote in response that the Islamization of Europe was better than a Christian Europe for ethical and theological reasons – as a punishment against Christians for persecuting the Jews and the fact that Christianity, as opposed to Islam, is considered “idolatry” from a halachic point of view….\n“Europe is losing its identity in favor of another people and another religion, and there will be no remnants and survivors from the impurity of Christianity, which shed a lot of blood it won’t be able to atone for.”\nOne would have thought the Jews might have learned from the Granada Massacre and the Reconquista that betting on the Mahometans isn’t the smart thing to do. Meanwhile, David Goldberg declares that\nhe has nothing to say\nto anyone in Europe:\nIt’s been so long since Europeans took their own national identity\nseriously that it’s hard for them to remember why it is that they can’t\nstand the sort of Jew who represents the Jewish future. One has to put\nthem on the proverbial couch and coax it out of them: Europeans hate\nJews because European national identity from the outset was a dreadful\nparody of Jewish identity…. I speak three European languages apart from English and have nothing to say to anybody in any of them.\nI used to like reading Goldberg back when he was Spengler. Now… what is he even trying to say?",
  "tags": [
    "EU",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-24T08:00:00+00:00"
}