{
  "url": "https://voxday.net/2015/01/25/be-dragon/",
  "scraped_at": "2025-12-16T12:43:05.250885",
  "title": "Be the dragon",
  "date_display": "January 25, 2015",
  "date_iso": "2015-01-25T23:00:00+00:00",
  "date_from_url": "2015-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At Alpha Game, I comment upon the importance of being the dragon, not the self-styled paladin and self-appointed dragon-slayer. But one part of the Loneliest Paladin’s twitterstorm was relevant here for its illustration of rabbitology:</p><blockquote class=\"tr_bq\"><p> MikeBrendan @MikeBrendan<br> Things I don’t get: why Ghaters would rally around Vox Day. Dude is the epitome of loser.</br></p><p>MikeBrendan @MikeBrendan<br> Not only did Vox get kicked out of SFWA for being a racist homophobic sexist dipshit, he took sixth place on a five person ballot.</br></p></blockquote><p>Note that insufficient popularity with a small and specific group is equated with being “the epitome of loser”… by someone <a href=\"http://alphagameplan.blogspot.com/2015/01/the-loneliest-paladin.html\">with no friends and not much of a life</a>. Success, in the rabbit’s world, is something that depends entirely upon the level of acceptance by the warren. Everything else is irrelevant.</p><p>Rabbits don’t understand that wolves respect strength and loyalty, even when exhibited in causes of no interest to them. Rabbits fear strength and have no loyalty, so the concepts are alien to them. They genuinely can’t understand the concept of standing up for someone because that someone stood up for you, even if you don’t like him, respect him, or want anything to do with him. For all that they are herd animals, they are not team players; in their own way they are more ruthlessly self-serving than the most ideological self-sovereign libertarian.</p><p>And speaking of rabbitology, <a href=\"http://www.markbernstein.org/Jan15/Infamous.html\">see how the rabbits cry</a> when their warrens are invaded and they learn they don’t possess the power they flaunted so foolishly:</p><blockquote class=\"tr_bq\"><p> GamerGate set out to writes its own story in Wikipedia – and to spread the dirt about the women who were its targets. These efforts were blocked by established editors under established Wikipedia policy. In retaliation, GamerGate planned an operation to get rid of its opponents – the “Five Horsemen” active in preserving objectivity and in keeping scurrilous sexual innuendo out of the encyclopedia. As a side-game, GamerGate also launched efforts to promote the idea that “Cultural Marxism” is a conspiracy of some Jewish academics to control the media.</p><p>The original GamerGate operation targeted the “five horsemen:” Ryulong, NorthBySouthBaranof, Tarc, TheRedPenOfDoom, and TaraInDC. All were sanctioned in the draft decision.</p><p>For months, these Wikipedia pages have been an escalating scene of daily – indeed hourly – conflict.</p><p>The Purge</p><p>Yesterday, ArbCom announced its preliminary decision. A panel of fourteen arbitrators – at least 11 of whom are men – decided to give GamerGate everything they’d wished for. All of the Five Horsemen are sanctioned; most will be excluded not only from “Gamergate broadly construed” but from anything in Wikipedia touching on “gender or sexuality, broadly construed.”</p><p>By my informal count, every feminist active in the area is to be sanctioned. This takes care of social justice warriors with a vengeance — not only do the GamerGaters get to rewrite their own page (and Zoe Quinn’s, Brianna Wu’s, Anita Sarkeesian’s, etc.); feminists are to be purged en bloc from the encyclopedia. Liberals are the new Scientologists as far as Arbcom is concerned.</p><p>No sanctions at all were proposed against any of GamerGate’s warriors, save for a few disposable accounts created specifically for the purpose of being sanctioned. The administrator who wrote, regarding Zoe Quinn’s sexual history, that</p><p><i>    I know other other allegations exist but will not state what those on WP are because that would be a BLP violation at the current time</i>.</p><p>was not even mentioned. The many brand-new accounts who arrived in December with no Wiki experience, but possessing a curiously detailed knowledge of Wikipedia policy jargon, are unmentioned, save for the fact that the decision rests almost entirely on their proposals.</p><p>The extensive evidence of off-site collusion, which Wikipedia considers so improper that evidence must not be discussed on wiki but rather submitted in confidence, appears to have been entirely ignored. (I submitted such evidence myself, but received no acknowledgment or thanks; I have been told that much additional evidence was submitted.)</p></blockquote><p>Notice how the upset rabbit appeals to “established editors and established policy” (better described as activist editors and self-imposed customs), despite the fact that the editors concerned were quite clearly VIOLATING Wikipedia policy, and doing so rather egregiously. What appears to have happened is that Wikipedia is finally beginning to act against the SJW thought police who make a practice of attempting to define the public narrative by exerting personal ownership over particular pages of interest.</p></div>",
  "content_text": "At Alpha Game, I comment upon the importance of being the dragon, not the self-styled paladin and self-appointed dragon-slayer. But one part of the Loneliest Paladin’s twitterstorm was relevant here for its illustration of rabbitology:\nMikeBrendan @MikeBrendan\nThings I don’t get: why Ghaters would rally around Vox Day. Dude is the epitome of loser.\nMikeBrendan @MikeBrendan\nNot only did Vox get kicked out of SFWA for being a racist homophobic sexist dipshit, he took sixth place on a five person ballot.\nNote that insufficient popularity with a small and specific group is equated with being “the epitome of loser”… by someone\nwith no friends and not much of a life\n. Success, in the rabbit’s world, is something that depends entirely upon the level of acceptance by the warren. Everything else is irrelevant.\nRabbits don’t understand that wolves respect strength and loyalty, even when exhibited in causes of no interest to them. Rabbits fear strength and have no loyalty, so the concepts are alien to them. They genuinely can’t understand the concept of standing up for someone because that someone stood up for you, even if you don’t like him, respect him, or want anything to do with him. For all that they are herd animals, they are not team players; in their own way they are more ruthlessly self-serving than the most ideological self-sovereign libertarian.\nAnd speaking of rabbitology,\nsee how the rabbits cry\nwhen their warrens are invaded and they learn they don’t possess the power they flaunted so foolishly:\nGamerGate set out to writes its own story in Wikipedia – and to spread the dirt about the women who were its targets. These efforts were blocked by established editors under established Wikipedia policy. In retaliation, GamerGate planned an operation to get rid of its opponents – the “Five Horsemen” active in preserving objectivity and in keeping scurrilous sexual innuendo out of the encyclopedia. As a side-game, GamerGate also launched efforts to promote the idea that “Cultural Marxism” is a conspiracy of some Jewish academics to control the media.\nThe original GamerGate operation targeted the “five horsemen:” Ryulong, NorthBySouthBaranof, Tarc, TheRedPenOfDoom, and TaraInDC. All were sanctioned in the draft decision.\nFor months, these Wikipedia pages have been an escalating scene of daily – indeed hourly – conflict.\nThe Purge\nYesterday, ArbCom announced its preliminary decision. A panel of fourteen arbitrators – at least 11 of whom are men – decided to give GamerGate everything they’d wished for. All of the Five Horsemen are sanctioned; most will be excluded not only from “Gamergate broadly construed” but from anything in Wikipedia touching on “gender or sexuality, broadly construed.”\nBy my informal count, every feminist active in the area is to be sanctioned. This takes care of social justice warriors with a vengeance — not only do the GamerGaters get to rewrite their own page (and Zoe Quinn’s, Brianna Wu’s, Anita Sarkeesian’s, etc.); feminists are to be purged en bloc from the encyclopedia. Liberals are the new Scientologists as far as Arbcom is concerned.\nNo sanctions at all were proposed against any of GamerGate’s warriors, save for a few disposable accounts created specifically for the purpose of being sanctioned. The administrator who wrote, regarding Zoe Quinn’s sexual history, that\nI know other other allegations exist but will not state what those on WP are because that would be a BLP violation at the current time\n.\nwas not even mentioned. The many brand-new accounts who arrived in December with no Wiki experience, but possessing a curiously detailed knowledge of Wikipedia policy jargon, are unmentioned, save for the fact that the decision rests almost entirely on their proposals.\nThe extensive evidence of off-site collusion, which Wikipedia considers so improper that evidence must not be discussed on wiki but rather submitted in confidence, appears to have been entirely ignored. (I submitted such evidence myself, but received no acknowledgment or thanks; I have been told that much additional evidence was submitted.)\nNotice how the upset rabbit appeals to “established editors and established policy” (better described as activist editors and self-imposed customs), despite the fact that the editors concerned were quite clearly VIOLATING Wikipedia policy, and doing so rather egregiously. What appears to have happened is that Wikipedia is finally beginning to act against the SJW thought police who make a practice of attempting to define the public narrative by exerting personal ownership over particular pages of interest.",
  "tags": [
    "games",
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-25T23:00:00+00:00"
}