{
  "url": "https://voxday.net/2015/01/16/burning-down-house-2/",
  "scraped_at": "2025-12-16T12:42:00.334893",
  "title": "Burning down the house",
  "date_display": "January 16, 2015",
  "date_iso": "2015-01-16T21:26:00+00:00",
  "date_from_url": "2015-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brad Torgersen <a href=\"https://bradrtorgersen.wordpress.com/2015/01/16/why-sad-puppies-3-is-going-to-destroy-science-fiction/\">has some thoughts on the reaction</a> to the announcement of the forthcoming SAD PUPPIES 3. To put it in perspective, keep in mind that he is one of the liberal moderates of the Evil Legion of Evil:</p><blockquote class=\"tr_bq\"><p> It’s remarkable how fast word travels on the intarwebz these days. No sooner had I posted the (rather tame) announcement that SAD PUPPIES was coming back for a third go-around, than some people began carping about it. Which is to be expected. SAD PUPPIES breaks the rules. RULE #1: thou shalt not publicly campaign. Even though campaigning (in this award) has been done for many decades. RULE #2: thou shalt not publicly point out blind spots or biases in the voting body. Even though behind-closed-doors rage about these biases and blind spots has also been going on for decades — just not always about the same biases and blind spots. And lastly, RULE #3: thou shalt not publicly criticize Worldcon or “fandom” proper. Even though “fandom” (as an actual, coherent label for a specific body of people) hasn’t been applicable since the 1970s, nor has Worldcon actually represented the largest gathering of the largest body of consumer fans.</p><p>So . . . some personal opinions. Take ‘em or leave ‘em.</p><p>I could care less about Rule 1 and Rule 2, since these are endlessly violated anyway. Rules which are perpetually broken behind the curtain, are not actually rules. And if SAD PUPPIES is to be damned for breaking them, fine. At least we’re honest about what we’re doing. I don’t have much patience for people who aim an accusatory finger at us, then do precisely what we’re doing, just sneaky-like. Hypocrisy is hypocrisy, even when it dresses up in its Sunday best and has good table manners.</p><p>Rule 3 deserves a larger thought bubble. Because (as I have stated many times in the last few years) “fandom” does not really represent FANDOM anymore.</p></blockquote><p>You can understand my difficult position as the Legion’s Supreme Dark Lord, trying to maintain even a modicum of evil order at our monthly staff meetings.</p><p>VOX DAY, SUPREME DARK LORD: Welcome, my black knights, my devious and subtle dark ladies. The circle is joined. Tell me, what evil hath thou wrought?</p><p>TOM KRATMAN: GRAND STRATEGIKON: Sir! Another 64 crossbeams, 97 posts, and 468 iron nails have been prepared and added to the warehouse, sir! Four more excruciators have been trained and are good to go, sir!</p><p>LARRY CORREIA, INTERNATIONAL LORD OF HATE: Bloody hell, Tom! How many crosses do you think we need? We haven’t even crucified <i>anyone </i>yet!</p><p>KRATMAN: I just like to be prepaaaaared, sir!</p><p>DAY: So how many pinkshirts can we crucify? Give me a daily average.</p><p>KRATMAN: All of them!</p><p>SARAH HOYT, BEAUTIFUL BUT EVIL SPACE PRINCESS, All of them?</p><p>KRATMAN: All of them! We’re cocked, locked and ready to rock!</p><p>HOYT (whispers to Correia): Kate’s going to be pissed. She had her heart set on impaling McCreepy.</p><p>DAY: Stand down, Tom. Good work. Anyone else?</p><p>JOHN WRIGHT,  LIVING BRAIN, KING IN YELLOW, AND SPEAKER TO MORLOCKS: I have erected, at great personal expense, a ninety-one foot tall idol<br> of radioactive black marble to your likeness in the caves of Logan County,<br> West Virginia, where I and a coterie of degenerate hillbillies,<br> drug-maddened Saponi and Shawnee shaman, blood-drinking devil dogs,<br> together with an inhuman living fungi from Pluto make hideous sacrifices<br> and perform acts of unspeakable abomination to adore our idol of Vox<br> Day, impiously dreaming of the return of the Elder Star-gods from Hyades<br> in Taurus. For we adore Vox Day! Crowned with Five Divine Cobras of Might! His Buttocks Sit Atop the Thunder-Winged Garuda Bird!</br></br></br></br></br></br></br></p><p>DAY: All I asked for was the latest draft of <i>Somewither</i>, John.</p><p>WRIGHT: Oh, yes. Let me see. Ah, here it is.</p><p>BRAD TORGERSEN, SOFT AND CUDDLY TOKEN LIBERAL: Hey, Larry, what’s this?</p><p>CORREIA: Dammit, Brad, put down-</p><p>TORGERSEN: AH HA HA HA HA HA!</p><p>CORREIA: The flamethrower….</p></div>",
  "content_text": "Brad Torgersen\nhas some thoughts on the reaction\nto the announcement of the forthcoming SAD PUPPIES 3. To put it in perspective, keep in mind that he is one of the liberal moderates of the Evil Legion of Evil:\nIt’s remarkable how fast word travels on the intarwebz these days. No sooner had I posted the (rather tame) announcement that SAD PUPPIES was coming back for a third go-around, than some people began carping about it. Which is to be expected. SAD PUPPIES breaks the rules. RULE #1: thou shalt not publicly campaign. Even though campaigning (in this award) has been done for many decades. RULE #2: thou shalt not publicly point out blind spots or biases in the voting body. Even though behind-closed-doors rage about these biases and blind spots has also been going on for decades — just not always about the same biases and blind spots. And lastly, RULE #3: thou shalt not publicly criticize Worldcon or “fandom” proper. Even though “fandom” (as an actual, coherent label for a specific body of people) hasn’t been applicable since the 1970s, nor has Worldcon actually represented the largest gathering of the largest body of consumer fans.\nSo . . . some personal opinions. Take ‘em or leave ‘em.\nI could care less about Rule 1 and Rule 2, since these are endlessly violated anyway. Rules which are perpetually broken behind the curtain, are not actually rules. And if SAD PUPPIES is to be damned for breaking them, fine. At least we’re honest about what we’re doing. I don’t have much patience for people who aim an accusatory finger at us, then do precisely what we’re doing, just sneaky-like. Hypocrisy is hypocrisy, even when it dresses up in its Sunday best and has good table manners.\nRule 3 deserves a larger thought bubble. Because (as I have stated many times in the last few years) “fandom” does not really represent FANDOM anymore.\nYou can understand my difficult position as the Legion’s Supreme Dark Lord, trying to maintain even a modicum of evil order at our monthly staff meetings.\nVOX DAY, SUPREME DARK LORD: Welcome, my black knights, my devious and subtle dark ladies. The circle is joined. Tell me, what evil hath thou wrought?\nTOM KRATMAN: GRAND STRATEGIKON: Sir! Another 64 crossbeams, 97 posts, and 468 iron nails have been prepared and added to the warehouse, sir! Four more excruciators have been trained and are good to go, sir!\nLARRY CORREIA, INTERNATIONAL LORD OF HATE: Bloody hell, Tom! How many crosses do you think we need? We haven’t even crucified\nanyone\nyet!\nKRATMAN: I just like to be prepaaaaared, sir!\nDAY: So how many pinkshirts can we crucify? Give me a daily average.\nKRATMAN: All of them!\nSARAH HOYT, BEAUTIFUL BUT EVIL SPACE PRINCESS, All of them?\nKRATMAN: All of them! We’re cocked, locked and ready to rock!\nHOYT (whispers to Correia): Kate’s going to be pissed. She had her heart set on impaling McCreepy.\nDAY: Stand down, Tom. Good work. Anyone else?\nJOHN WRIGHT,  LIVING BRAIN, KING IN YELLOW, AND SPEAKER TO MORLOCKS: I have erected, at great personal expense, a ninety-one foot tall idol\nof radioactive black marble to your likeness in the caves of Logan County,\nWest Virginia, where I and a coterie of degenerate hillbillies,\ndrug-maddened Saponi and Shawnee shaman, blood-drinking devil dogs,\ntogether with an inhuman living fungi from Pluto make hideous sacrifices\nand perform acts of unspeakable abomination to adore our idol of Vox\nDay, impiously dreaming of the return of the Elder Star-gods from Hyades\nin Taurus. For we adore Vox Day! Crowned with Five Divine Cobras of Might! His Buttocks Sit Atop the Thunder-Winged Garuda Bird!\nDAY: All I asked for was the latest draft of\nSomewither\n, John.\nWRIGHT: Oh, yes. Let me see. Ah, here it is.\nBRAD TORGERSEN, SOFT AND CUDDLY TOKEN LIBERAL: Hey, Larry, what’s this?\nCORREIA: Dammit, Brad, put down-\nTORGERSEN: AH HA HA HA HA HA!\nCORREIA: The flamethrower….",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-16T21:26:00+00:00"
}