{
  "url": "https://voxday.net/2015/01/03/continental-warming/",
  "scraped_at": "2025-12-16T12:40:24.533632",
  "title": "Continental warming",
  "date_display": "January 3, 2015",
  "date_iso": "2015-01-03T11:44:00+00:00",
  "date_from_url": "2015-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Temperatures <a href=\"http://www.nytimes.com/2015/01/03/world/in-sweden-the-land-of-the-open-door-anti-muslim-sentiment-finds-a-foothold.html?_r=0\">continue to rise in Europe</a>:</p><blockquote class=\"tr_bq\"><p> [T]he relentless stream of migrants to Europe — propelled by the war in<br> Syria and turmoil across the Middle East and the Horn of Africa — has<br> combined with economic troubles and rising fear of Islamic radicalism to<br> fuel a backlash against immigrants, directed most viciously at Muslims.</br></br></br></p><p>The<br> simmering resentments and suspicions have driven debates across Europe<br> about tighter controls on immigration. Worries about immigration have<br> helped buoy right-wing parties in Britain, Denmark, France and Hungary.<br> German officials recorded more than 70 attacks against mosques from 2012<br> to 2014, including an arson, and the police in Britain have recorded an<br> increase in hate crimes against Muslims. There are few places where the<br> turn against immigrants is more surprising than Sweden, where a solid<br> core of citizens still supports the 65-year-old open door policy toward<br> immigrants facing hardship that has long earned international respect<br> for the country….</br></br></br></br></br></br></br></br></br></br></p><p>Opposition<br> to the rising numbers is growing. The far-right, anti-immigrant Sweden<br> Democrats had their best showing ever — nearly 13 percent of votes — in<br> elections in September. The<br> entry of the Sweden Democrats to parliament in 2010 had already opened<br> the door for a previously unthinkable discussion about turning back the<br> country’s policy of taking in foreigners on humanitarian grounds and<br> granting them access to the country’s generous welfare system.</br></br></br></br></br></br></br></p><p>Adrian<br> Groglopo, a professor of social science at the University of<br> Gothenburg, has studied discrimination in Sweden over the past decade.<br> He said that Sweden has long been a racially segregated country where<br> many immigrants live in ghettos and struggle to find jobs, but that the<br> success of the Sweden Democrats has made racism more socially<br> acceptable.</br></br></br></br></br></br></p></blockquote><div class=\"story-body-text story-content\" data-para-count=\"662\" data-total-count=\"2118\" itemprop=\"articleBody\"> By the time the current generation of young people take power, “racism” (or as it is more properly described, nationalism) will not only be socially acceptable, it will be legally mandated. Merkel and her merry band of multiculturalists are on their way out, and once the nationalists gain power everywhere from Greece to Germany, from Serbia to Sweden, the tides will reverse in a manner that will surprise nearly everyone who knows nothing of history and its cycles.<p>Note <a href=\"https://ca.news.yahoo.com/one-8-germans-join-anti-muslim-marches-poll-140837553.html\">this growing movement in Germany</a>, which has already surpassed the peak popularity of the Tea Party: <i>One German in eight would join an anti-Muslim march if a rapidly-growing<br> protest movement organized one in their home towns, according to an<br> opinion poll published on Thursday.</br></br></i></p><p>Immigration in small numbers by those who fully integrate in every way, including language and religion, is beneficial to a nation. But that is very different than mass migration, which is not merely detrimental to a nation, it is materially worse than war. And multi-ethnic societies always collapse, usually in violence.</p></div></div>",
  "content_text": "Temperatures\ncontinue to rise in Europe\n:\n[T]he relentless stream of migrants to Europe — propelled by the war in\nSyria and turmoil across the Middle East and the Horn of Africa — has\ncombined with economic troubles and rising fear of Islamic radicalism to\nfuel a backlash against immigrants, directed most viciously at Muslims.\nThe\nsimmering resentments and suspicions have driven debates across Europe\nabout tighter controls on immigration. Worries about immigration have\nhelped buoy right-wing parties in Britain, Denmark, France and Hungary.\nGerman officials recorded more than 70 attacks against mosques from 2012\nto 2014, including an arson, and the police in Britain have recorded an\nincrease in hate crimes against Muslims. There are few places where the\nturn against immigrants is more surprising than Sweden, where a solid\ncore of citizens still supports the 65-year-old open door policy toward\nimmigrants facing hardship that has long earned international respect\nfor the country….\nOpposition\nto the rising numbers is growing. The far-right, anti-immigrant Sweden\nDemocrats had their best showing ever — nearly 13 percent of votes — in\nelections in September. The\nentry of the Sweden Democrats to parliament in 2010 had already opened\nthe door for a previously unthinkable discussion about turning back the\ncountry’s policy of taking in foreigners on humanitarian grounds and\ngranting them access to the country’s generous welfare system.\nAdrian\nGroglopo, a professor of social science at the University of\nGothenburg, has studied discrimination in Sweden over the past decade.\nHe said that Sweden has long been a racially segregated country where\nmany immigrants live in ghettos and struggle to find jobs, but that the\nsuccess of the Sweden Democrats has made racism more socially\nacceptable.\nBy the time the current generation of young people take power, “racism” (or as it is more properly described, nationalism) will not only be socially acceptable, it will be legally mandated. Merkel and her merry band of multiculturalists are on their way out, and once the nationalists gain power everywhere from Greece to Germany, from Serbia to Sweden, the tides will reverse in a manner that will surprise nearly everyone who knows nothing of history and its cycles.\nNote\nthis growing movement in Germany\n, which has already surpassed the peak popularity of the Tea Party:\nOne German in eight would join an anti-Muslim march if a rapidly-growing\nprotest movement organized one in their home towns, according to an\nopinion poll published on Thursday.\nImmigration in small numbers by those who fully integrate in every way, including language and religion, is beneficial to a nation. But that is very different than mass migration, which is not merely detrimental to a nation, it is materially worse than war. And multi-ethnic societies always collapse, usually in violence.",
  "tags": [
    "Clash of Civilizations",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-03T11:44:00+00:00"
}