{
  "url": "https://voxday.net/2015/01/10/cracks-in-narrative/",
  "scraped_at": "2025-12-16T12:41:09.464245",
  "title": "Cracks in the narrative",
  "date_display": "January 10, 2015",
  "date_iso": "2015-01-10T14:20:00+00:00",
  "date_from_url": "2015-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The transnational establishment is deeply worried about the way the most recent Muslim murders <a href=\"http://www.dailymail.co.uk/news/article-2901736/Farage-accused-using-Paris-attack-score-political-points-Ukip-touring-media-blame-multiculturalism.html\">are upsetting the electorate</a>:</p><blockquote class=\"tr_bq\"><p> Farage cannot divide us: Fury at ‘sickening’ attempt by Ukip to use Paris shootings to score political points on multiculturalism. Britain must stand united against attempts by Nigel Farage to use the Paris terror massacre to score political points, senior politicians said today. Tories including David Cameron, Eric Pickles, Theresa May and Grant Shapps joined Labour’s Ed Miliband and Dame Tessa Jowell and Lib Dem Nick Clegg in condemning the ‘sickening’ attempt to exploit the atrocity in which 12 people died.</p></blockquote><p>The reason the atrocities can be effectively exploited by UKIP is because they only happened due to the immigration policies of the French parties that happen to be very, very similar to the policies of the Tory, Labour, and Liberal Democrat parties. The European establishment parties are afraid, and rightly so, that the attacks are assisting <a href=\"http://www.haaretz.com/news/world/1.636116\">the gradual redrawing the European political lines</a> where they rightly belong: between the pro-EU, pro-Muslim, pro-immigration forces and the more numerous nationalist, anti-Muslim, anti-immigration forces:</p><blockquote class=\"tr_bq\"><p> A day after terror struck Paris, Europe’s resurgent far-right and anti-immigrant parties trumpeted a unified message: I told you so.</p><p>Populist movements warning of the “Islamization” of Europe have been gaining ground across the continent, in small countries like Denmark and large ones like Britain, Germany and France. The attack on satirical newspaper Charlie Hebdo could win more supporters to their cause.</p><p>Fears of precisely the kind of commando-style attack that struck the newspaper on Wednesday, killing 12 people, have risen sharply in recent months as home-grown fighters return from Syria and Iraq. Such warnings have been aired across the political spectrum, but it’s the anti-immigrant parties that have reaped the biggest benefits. </p></blockquote><p>What has been ruled out of bounds for more than three decades is finally becoming the political fault line. And the line is not going to be drawn in the favor of those with blood on their hands, in the favor of those whom history will one day damn far more fervently than the Chamberlains and Quislings of a previous generation. Names like Merkel, Hollande, Cameron, and Blair will be reviled across Europe as long as they are remembered.</p><p>At the train station, I heard one schoolgirl telling her friends that World War III has started and she doesn’t care if anyone calls her racist. There is a perception that something has dramatically changed in the last week, and indeed, the way in which people are not being hysterical about it over here, but are speaking out rather calmly, strikes me as being all the more ominous for the establishment. As is the fact that #JeSuisCharlieMartel is beginning to trend.</p><p>The more the politicians of the major parties attempt to pressure the people into accepting the unacceptable, the more likely it is that the major parties will be replaced by true people’s parties. And I suspect Marine Le Pen’s protests at Front National being excluded from tomorrow’s French “unity” rallies are about as serious as Bre’r Rabbit’s pleas not to be thrown in the briar patch.</p><p>All of the nationalist parties will do well to turn their backs on the false, antinational unity being offered by the champions of diversity. Consider the PEGIDA statement leading up to what looks to be a record rally on Monday: <i>The Islamists, which PEGIDA has been warning about for 12 weeks, showed France that they are not capable of democracy but rather look to violence and death as an answer,” it said. “Our politicians want us to believe the opposite. Must such a tragedy happen here in Germany first???” </i></p><p>“61 percent of non-Muslim Germans said Islam had no place in the West according to the study released by the Bertelsmann Foundation think tank.” And that was prior to the Paris murders.</p></div>",
  "content_text": "The transnational establishment is deeply worried about the way the most recent Muslim murders\nare upsetting the electorate\n:\nFarage cannot divide us: Fury at ‘sickening’ attempt by Ukip to use Paris shootings to score political points on multiculturalism. Britain must stand united against attempts by Nigel Farage to use the Paris terror massacre to score political points, senior politicians said today. Tories including David Cameron, Eric Pickles, Theresa May and Grant Shapps joined Labour’s Ed Miliband and Dame Tessa Jowell and Lib Dem Nick Clegg in condemning the ‘sickening’ attempt to exploit the atrocity in which 12 people died.\nThe reason the atrocities can be effectively exploited by UKIP is because they only happened due to the immigration policies of the French parties that happen to be very, very similar to the policies of the Tory, Labour, and Liberal Democrat parties. The European establishment parties are afraid, and rightly so, that the attacks are assisting\nthe gradual redrawing the European political lines\nwhere they rightly belong: between the pro-EU, pro-Muslim, pro-immigration forces and the more numerous nationalist, anti-Muslim, anti-immigration forces:\nA day after terror struck Paris, Europe’s resurgent far-right and anti-immigrant parties trumpeted a unified message: I told you so.\nPopulist movements warning of the “Islamization” of Europe have been gaining ground across the continent, in small countries like Denmark and large ones like Britain, Germany and France. The attack on satirical newspaper Charlie Hebdo could win more supporters to their cause.\nFears of precisely the kind of commando-style attack that struck the newspaper on Wednesday, killing 12 people, have risen sharply in recent months as home-grown fighters return from Syria and Iraq. Such warnings have been aired across the political spectrum, but it’s the anti-immigrant parties that have reaped the biggest benefits.\nWhat has been ruled out of bounds for more than three decades is finally becoming the political fault line. And the line is not going to be drawn in the favor of those with blood on their hands, in the favor of those whom history will one day damn far more fervently than the Chamberlains and Quislings of a previous generation. Names like Merkel, Hollande, Cameron, and Blair will be reviled across Europe as long as they are remembered.\nAt the train station, I heard one schoolgirl telling her friends that World War III has started and she doesn’t care if anyone calls her racist. There is a perception that something has dramatically changed in the last week, and indeed, the way in which people are not being hysterical about it over here, but are speaking out rather calmly, strikes me as being all the more ominous for the establishment. As is the fact that #JeSuisCharlieMartel is beginning to trend.\nThe more the politicians of the major parties attempt to pressure the people into accepting the unacceptable, the more likely it is that the major parties will be replaced by true people’s parties. And I suspect Marine Le Pen’s protests at Front National being excluded from tomorrow’s French “unity” rallies are about as serious as Bre’r Rabbit’s pleas not to be thrown in the briar patch.\nAll of the nationalist parties will do well to turn their backs on the false, antinational unity being offered by the champions of diversity. Consider the PEGIDA statement leading up to what looks to be a record rally on Monday:\nThe Islamists, which PEGIDA has been warning about for 12 weeks, showed France that they are not capable of democracy but rather look to violence and death as an answer,” it said. “Our politicians want us to believe the opposite. Must such a tragedy happen here in Germany first???”\n“61 percent of non-Muslim Germans said Islam had no place in the West according to the study released by the Bertelsmann Foundation think tank.” And that was prior to the Paris murders.",
  "tags": [
    "Clash of Civilizations",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-10T14:20:00+00:00"
}