{
  "url": "https://voxday.net/2015/01/23/explaining-probability/",
  "scraped_at": "2025-12-16T12:42:43.765787",
  "title": "Probability and the Problem of Life",
  "date_display": "January 23, 2015",
  "date_iso": "2015-01-23T09:50:00+00:00",
  "date_from_url": "2015-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday, I observed that most biologists and believers in evolution have a poor grasp of probability. In the subsequent discussion, the otherwise perspicacious wrf3 demonstrated that he is not entirely clear on the difference between math and philosophy, two fields it is rather important to distinguish between despite their occasional overlap:</p><blockquote class=\"tr_bq\"><p> If you’re going to claim that the occurrence of low probability events is evidence of behind-the-scenes tampering in nature, then you’re going to have to show how the math for that works without assuming your conclusion. Otherwise, you’re a fraud.</p></blockquote><p>That is incorrect and is is an indication of subscribing to the conventional fetish-myth of math. Logic does not require math or even any quantification. A correct syllogism holds true regardless of whether it contains any quantities or not.</p><p>Consider the following two syllogisms:</p><ol><li>All cats are named Tom.</li><li>I have a cat.</li><li>Therefore, my cat’s name is Tom.</li></ol><ol><li>Mike is shorter than Alan.</li><li>Zeke shorter than Mike.</li><li>Therefore, Alan is taller than Zeke.</li></ol><p>Both syllogisms are impeccably correct, without having any need to show how the math for them works. Sure, in the case of the latter we could treat the names as variables, retroactively assign some quantities to them, and thereby <i>confirm </i>the correctness of the logic with math, but that would be redundant. It’s not necessary. We already know that the syllogism is correct because its logical construction is correct. The conclusion follows correctly from the propositions.</p><p>Here is the relevant syllogism:</p><ol><li>No low-probability event has been observed to take place without tampering in nature.</li><li>A low-probability event has taken place.</li><li>Therefore, nature was tampered in.</li></ol><p>There is nothing fraudulent about that. There is no need for any math, or even any precise measurement of how low the relevant probability is in order to correctly conclude that nature has, in fact, been tampered in. Indeed, that is the only possible conclusion that is dictated by the logic.</p><p>Now, one can argue either of the first two propositions. One can claim either a) a low-probability event has been observed to take pace without tampering in nature or b) a low-probability event has NOT taken place to reject the conclusion. Only in the case of evolution, argument b) cannot possibly apply. We are here, after all.</p><p><a name=\"more\"></a> This leaves argument a) a low-probability event has been observed to take pace without tampering in nature. Very well. That is the only correct objection to the argument, so the burden thus falls on wrf3 or anyone who wishes to argue that there has not been any tampering with nature, be it Divine, divine, or merely alien, in the origin of the various species. I do hope no one is so haplessly midwitted that they fall into the obvious and incorrect trap for the intellectually careless here.</p><p>Furthermore, for the stubbornly pedantic, I will note that impossible is NOT a synonym for zero probability. Yesterday’s pedantry was not only foolish and irrelevant, it was technically incorrect and didn’t even rise to the level of Wikipedia.</p><blockquote class=\"tr_bq\"><p> Imagine throwing a dart at a unit square (i.e. a square<br> with area 1) wherein the dart will impact exactly one point, and imagine<br> that this square is the only thing in the universe besides the dart and<br> the thrower. There is physically nowhere else for the dart to land.<br> Then, the event that “the dart hits the square” is a <b>sure</b> event. No other alternative is imaginable.</br></br></br></br></p><p>Now, notice that since the square has area 1, the probability that<br> the dart will hit any particular sub-region of the square equals the<br> area of that sub-region. For example, the probability that the dart will<br> hit the right half of the square is 0.5, since the right half has area<br> 0.5.</br></br></br></br></p><p>Next, consider the event that “the dart hits the diagonal of the unit<br> square exactly”. Since the area of the diagonal of the square is zero,<br> the probability that the dart lands exactly on the diagonal is zero. So,<br> the dart will <b>almost never</b> land on the diagonal (i.e. it will <b>almost surely</b> <i>not</i><br> land on the diagonal). Nonetheless the set of points on the diagonal is<br> not empty and a point on the diagonal is no less possible than any<br> other point, therefore theoretically it is possible that the dart<br> actually hits the diagonal.</br></br></br></br></br></br></br></p><p>The same may be said of any point on the square. Any such point <i>P</i><br> will contain zero area and so will have zero probability of being hit<br> by the dart. However, the dart clearly must hit the square somewhere.<br> Therefore, in this case, it is not only possible or imaginable that an<br> event with zero probability will occur; one must occur. Thus, we would<br> not want to say we were certain that a given event would not occur, but<br> rather <i>almost certain</i>.</br></br></br></br></br></br></p></blockquote><p>Or to put it another way: <i>“Consider selecting a point x from the uniform distribution with p.d.f. f over the unit circle D. P(x = r) = int_{{r}}f = 0 for all r in D. However, clearly x is in D.”</i></p><p>In other words, quibbling over the difference between impossible and very highly improbable is totally pointless, because the sufficiently intelligent can also manage to do so over the difference between impossible and zero probability. It’s all beside the point anyhow, as the aforementioned logical syllogism should suffice to demonstrate.</p><p>Now, one can, if one wishes, attempt to quibble over the precise level of probability that defines “low-probability event”, but here it suffices to cite Borel’s Law of Chance (which is actually more of a Heuristic of Chance) that states: “Phenomena with very small probabilities do not occur”. However, Borel also directly addressed the Problem of Life directly in <i>Probability and Certainty</i>, p. 124-126:<br/></p><blockquote class=\"tr_bq\"><p> The Problem of Life.</p><p>In conclusion, I feel it is necessary to say a few words<br> regarding a question that does not really come within<br> the scope of this book, but that certain readers might nevertheless<br> reproach me for having entirely neglected. I mean the problem of<br> the appearance of life on our planet (and eventually on other planets<br> in the universe) and the probability that this appearance may have<br> been due to chance. If this problem seems to me to lie outside<br> our subject, this is because the probability in question is too<br> complex for us to be able to calculate its order of magnitude. It<br> is on this point that I wish to make several explanatory  comments.</br></br></br></br></br></br></br></br></br></p><p>When we calculated the probability of reproducing by mere chance<br> a work of literature, in one or more volumes, we certainly observed<br> that, if this work was printed, it must have emanated from a human<br> brain. Now the complexity of that brain must therefore have been<br> even richer than the particular work to which it gave birth. Is it<br> not possible to infer that the probability that this brain may have<br> been produced by the blind forces of chance is even slighter than<br> the probability of the typewriting miracle?</br></br></br></br></br></br></br></p><p>It is obviously the same as if we asked ourselves whether we could<br> know if it was possible actually to create a human being by combining<br> at random a certain number of simple bodies. But this is not<br> the way that the problem of the origin of life presents itself:  it<br> is generally held that living beings are the result of a slow process<br> of evolution, beginning with elementary organisms, and that this<br> process of evolution involves certain properties of living matter that<br> prevent us from asserting that the process was accomplished in<br> accordance with the laws of chance.</br></br></br></br></br></br></br></br></p><p>Moreover, certain of these properties of living matter also belong<br> to inanimate matter, when it takes certain forms, such as that of<br> crystals. It does not seem possible to apply the laws of probability<br> calculus to the phenomenon of the formation of a crystal in a<br> more or less supersaturated solution. At least, it would not be<br> possible to treat this as a problem of probability without taking<br> account of certain properties of matter, properties that facilitate<br> the formation of crystals and that we are certainly obliged to verify.<br> We ought, it seems to me, to consider it likely that the formation<br> of elementary living organisms, and the evolution of those organisms,<br> are also governed by elementary properties of matter that we do<br> not understand perfectly but whose existence we ought nevertheless<br> admit.</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is often cited as evidence that it is not possible to apply the laws of probability calculus to the question of evolution. John Stockwell wrote: “In short, Borel says what many a talk.origins poster has said<br> time and time again when confronted with such creationist arguments:<br> namely, that probability estimates that ignore the non-random elements predetermined<br> by physics and chemistry are meaningless.”</br></br></br></p><p>However, the elementary properties of matter that Émile Borel, who died in 1956,<b> </b>did not understand are better understood today. We now know that the probability of the beneficial mutations required for the theory of natural selection are very low; we have also observed that the number of generations needed for even fairly small selective changes to spread across a population are too great to fit the timescales required. So, Borel’s arguments for the inapplicability of probability calculus to the problem of life is outdated, leaving us with one more logical construction to consider.</p><ol><li>The Law of Chance states that phenomena with very small probabilities do not occur</li><li>We do not understand the elementary properties of matter that govern the formation<br> of elementary living organisms and the evolution of those organisms. </br></li><li>Therefore, we cannot apply the Law of Chance to the Problem of Life.</li></ol><p>That may have been true in the 1950s. But in 2015, we possess considerably more information and we sufficiently understand those elementary properties of matter in order to estimate enough of the probabilities concerned to characterize them as “very small”. This falsifies proposition two, leaving us with the inescapable conclusion that the Law of Chance does apply to the Problem of Life, and therefore evolution by natural selection has not occurred. Which then brings us back to the original point and forces us to conclude that <i>if </i>evolution has taken place, it is the result of <i>artificial </i>selection.</p></div>",
  "content_text": "Yesterday, I observed that most biologists and believers in evolution have a poor grasp of probability. In the subsequent discussion, the otherwise perspicacious wrf3 demonstrated that he is not entirely clear on the difference between math and philosophy, two fields it is rather important to distinguish between despite their occasional overlap:\nIf you’re going to claim that the occurrence of low probability events is evidence of behind-the-scenes tampering in nature, then you’re going to have to show how the math for that works without assuming your conclusion. Otherwise, you’re a fraud.\nThat is incorrect and is is an indication of subscribing to the conventional fetish-myth of math. Logic does not require math or even any quantification. A correct syllogism holds true regardless of whether it contains any quantities or not.\nConsider the following two syllogisms:\nAll cats are named Tom.\nI have a cat.\nTherefore, my cat’s name is Tom.\nMike is shorter than Alan.\nZeke shorter than Mike.\nTherefore, Alan is taller than Zeke.\nBoth syllogisms are impeccably correct, without having any need to show how the math for them works. Sure, in the case of the latter we could treat the names as variables, retroactively assign some quantities to them, and thereby\nconfirm\nthe correctness of the logic with math, but that would be redundant. It’s not necessary. We already know that the syllogism is correct because its logical construction is correct. The conclusion follows correctly from the propositions.\nHere is the relevant syllogism:\nNo low-probability event has been observed to take place without tampering in nature.\nA low-probability event has taken place.\nTherefore, nature was tampered in.\nThere is nothing fraudulent about that. There is no need for any math, or even any precise measurement of how low the relevant probability is in order to correctly conclude that nature has, in fact, been tampered in. Indeed, that is the only possible conclusion that is dictated by the logic.\nNow, one can argue either of the first two propositions. One can claim either a) a low-probability event has been observed to take pace without tampering in nature or b) a low-probability event has NOT taken place to reject the conclusion. Only in the case of evolution, argument b) cannot possibly apply. We are here, after all.\nThis leaves argument a) a low-probability event has been observed to take pace without tampering in nature. Very well. That is the only correct objection to the argument, so the burden thus falls on wrf3 or anyone who wishes to argue that there has not been any tampering with nature, be it Divine, divine, or merely alien, in the origin of the various species. I do hope no one is so haplessly midwitted that they fall into the obvious and incorrect trap for the intellectually careless here.\nFurthermore, for the stubbornly pedantic, I will note that impossible is NOT a synonym for zero probability. Yesterday’s pedantry was not only foolish and irrelevant, it was technically incorrect and didn’t even rise to the level of Wikipedia.\nImagine throwing a dart at a unit square (i.e. a square\nwith area 1) wherein the dart will impact exactly one point, and imagine\nthat this square is the only thing in the universe besides the dart and\nthe thrower. There is physically nowhere else for the dart to land.\nThen, the event that “the dart hits the square” is a\nsure\nevent. No other alternative is imaginable.\nNow, notice that since the square has area 1, the probability that\nthe dart will hit any particular sub-region of the square equals the\narea of that sub-region. For example, the probability that the dart will\nhit the right half of the square is 0.5, since the right half has area\n0.5.\nNext, consider the event that “the dart hits the diagonal of the unit\nsquare exactly”. Since the area of the diagonal of the square is zero,\nthe probability that the dart lands exactly on the diagonal is zero. So,\nthe dart will\nalmost never\nland on the diagonal (i.e. it will\nalmost surely\nnot\nland on the diagonal). Nonetheless the set of points on the diagonal is\nnot empty and a point on the diagonal is no less possible than any\nother point, therefore theoretically it is possible that the dart\nactually hits the diagonal.\nThe same may be said of any point on the square. Any such point\nP\nwill contain zero area and so will have zero probability of being hit\nby the dart. However, the dart clearly must hit the square somewhere.\nTherefore, in this case, it is not only possible or imaginable that an\nevent with zero probability will occur; one must occur. Thus, we would\nnot want to say we were certain that a given event would not occur, but\nrather\nalmost certain\n.\nOr to put it another way:\n“Consider selecting a point x from the uniform distribution with p.d.f. f over the unit circle D. P(x = r) = int_{{r}}f = 0 for all r in D. However, clearly x is in D.”\nIn other words, quibbling over the difference between impossible and very highly improbable is totally pointless, because the sufficiently intelligent can also manage to do so over the difference between impossible and zero probability. It’s all beside the point anyhow, as the aforementioned logical syllogism should suffice to demonstrate.\nNow, one can, if one wishes, attempt to quibble over the precise level of probability that defines “low-probability event”, but here it suffices to cite Borel’s Law of Chance (which is actually more of a Heuristic of Chance) that states: “Phenomena with very small probabilities do not occur”. However, Borel also directly addressed the Problem of Life directly in\nProbability and Certainty\n, p. 124-126:\nThe Problem of Life.\nIn conclusion, I feel it is necessary to say a few words\nregarding a question that does not really come within\nthe scope of this book, but that certain readers might nevertheless\nreproach me for having entirely neglected. I mean the problem of\nthe appearance of life on our planet (and eventually on other planets\nin the universe) and the probability that this appearance may have\nbeen due to chance. If this problem seems to me to lie outside\nour subject, this is because the probability in question is too\ncomplex for us to be able to calculate its order of magnitude. It\nis on this point that I wish to make several explanatory  comments.\nWhen we calculated the probability of reproducing by mere chance\na work of literature, in one or more volumes, we certainly observed\nthat, if this work was printed, it must have emanated from a human\nbrain. Now the complexity of that brain must therefore have been\neven richer than the particular work to which it gave birth. Is it\nnot possible to infer that the probability that this brain may have\nbeen produced by the blind forces of chance is even slighter than\nthe probability of the typewriting miracle?\nIt is obviously the same as if we asked ourselves whether we could\nknow if it was possible actually to create a human being by combining\nat random a certain number of simple bodies. But this is not\nthe way that the problem of the origin of life presents itself:  it\nis generally held that living beings are the result of a slow process\nof evolution, beginning with elementary organisms, and that this\nprocess of evolution involves certain properties of living matter that\nprevent us from asserting that the process was accomplished in\naccordance with the laws of chance.\nMoreover, certain of these properties of living matter also belong\nto inanimate matter, when it takes certain forms, such as that of\ncrystals. It does not seem possible to apply the laws of probability\ncalculus to the phenomenon of the formation of a crystal in a\nmore or less supersaturated solution. At least, it would not be\npossible to treat this as a problem of probability without taking\naccount of certain properties of matter, properties that facilitate\nthe formation of crystals and that we are certainly obliged to verify.\nWe ought, it seems to me, to consider it likely that the formation\nof elementary living organisms, and the evolution of those organisms,\nare also governed by elementary properties of matter that we do\nnot understand perfectly but whose existence we ought nevertheless\nadmit.\nThis is often cited as evidence that it is not possible to apply the laws of probability calculus to the question of evolution. John Stockwell wrote: “In short, Borel says what many a talk.origins poster has said\ntime and time again when confronted with such creationist arguments:\nnamely, that probability estimates that ignore the non-random elements predetermined\nby physics and chemistry are meaningless.”\nHowever, the elementary properties of matter that Émile Borel, who died in 1956,\ndid not understand are better understood today. We now know that the probability of the beneficial mutations required for the theory of natural selection are very low; we have also observed that the number of generations needed for even fairly small selective changes to spread across a population are too great to fit the timescales required. So, Borel’s arguments for the inapplicability of probability calculus to the problem of life is outdated, leaving us with one more logical construction to consider.\nThe Law of Chance states that phenomena with very small probabilities do not occur\nWe do not understand the elementary properties of matter that govern the formation\nof elementary living organisms and the evolution of those organisms.\nTherefore, we cannot apply the Law of Chance to the Problem of Life.\nThat may have been true in the 1950s. But in 2015, we possess considerably more information and we sufficiently understand those elementary properties of matter in order to estimate enough of the probabilities concerned to characterize them as “very small”. This falsifies proposition two, leaving us with the inescapable conclusion that the Law of Chance does apply to the Problem of Life, and therefore evolution by natural selection has not occurred. Which then brings us back to the original point and forces us to conclude that\nif\nevolution has taken place, it is the result of\nartificial\nselection.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-23T09:50:00+00:00"
}