{
  "url": "https://voxday.net/2015/01/05/finally-good-game/",
  "scraped_at": "2025-12-16T12:40:36.699548",
  "title": "Finally, a good game",
  "date_display": "January 5, 2015",
  "date_iso": "2015-01-05T08:58:00+00:00",
  "date_from_url": "2015-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The difference between watching games between two teams who should be in the playoffs – Dallas and Detroit – and teams who shouldn’t be – pretty much the other six teams – was glaringly apparent yesterday. I think the playoffs worked best when there were three divisions and one wild card team; just as there are more teams than there are NFL-caliber quarterbacks, there are more teams in the playoffs than there are playoff-caliber teams.</p><p>But as long as there are four divisions (which works well for other reasons), it would be better if there was only one wild card team and one first-round bye. I have no regard for the “best teams” argument, because the only “best teams” that matter are already guaranteed entry. If you’re only the third-best team in your four-team division, you shouldn’t be in the playoffs. If you’re only the third-best of the non-division winners, you shouldn’t be in the playoffs.</p><p>The Eagles, who lost to the Seahawks, Cowboys, and Redskins before beating the Giants to close out the season, weren’t going to do anything that Carolina won’t do, which is to say lose to the Seahawks next weekend.</p><p>As for last night’s game, it was good to see Tony Romo finally get the playoff monkey off his back. The controversial call shouldn’t have been made in the first place, because a) it was offensive pass interference when Pettigrew grabbed Hitchens’s facemask, b) the contact was minimal, and most importantly, c) <i>it was a completely uncatchable ball</i>. Stafford literally hit Hitchens in the back right in the numbers; there was absolutely no way the receiver had any sort of play on the ball. Furtheremore, there is no “face-guarding” rule in the NFL, or, for that matter, in NCAA football; it is only deemed pass interference in high school football, specifically National Federation of State High School Associations rule 7-5-10: <i>“Any player hinders an opponent’s vision without making an<br> attempt to catch, intercept or bat the ball, even though no contact was<br> made.”</br></br></i></p><p>When the officials call pass interference on a player who hasn’t turned around, they do so because he has crashed into a receiver who is coming back for a high ball, to distinguish them from defenders who crash into a receiver when they themselves are going for a high ball. That was not the case in the play being discussed, for the obvious reason that Stafford threw the ball into the Dallas linebacker’s back. Recall the NFL’s pass interference rules: <i>Actions that do not constitute pass interference include but are not limited to: (c) Contact that would normally be considered pass interference, but the pass is clearly uncatchable by the involved players. </i></p><p>ESPN’s Todd Archer asked Pete Morelli (who is admittedly not a very good ref: see the NFC Championship Game 2009) about the call turned non-call:<i> </i></p><blockquote class=\"tr_bq\"><p> Todd Archer: Can you talk about the decision to overturn the call and why you overturned the call?<br> Pete Morelli: The back judge threw his flag for defensive pass<br> interference. We got other information from another official from a<br> different angle that thought the contact was minimal and didn’t warrant<br> pass interference. He thought it was face-guarding.<br> Archer: Which official?<br> Morelli: The head linesman.<br> Archer: What did you see?<br> Morelli: It’s not my responsibility. I’m a hundred miles away.<br> Archer: Face-guarding is not a foul?<br> Morelli: Face-guarding is not a foul. It is a penalty in college but not in professional football.<br> Archer: What is the process you go through after you announce the call? Should you have waited before you announced the call?<br> Morelli: Probably, yes. The information came and then the officials got<br> together a little bit later, after it was given to me, the first<br> information. It would have probably been smoother if we got together.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>He did the right thing. It’s better to get it right and look like a fool or a fix than allow a bad call to stand when he knows better. As for the decision not to flag Dez Bryant for coming onto the field without his helmet in protest of the call, I think it was a correct no-call. We want to see the refs let minor things go in the playoffs (that’s why Suh was permitted to play when his suspension would never have been overturned in the regular season), and no one wants to see a playoff game settled by an off-the-field foul by an excited player in an overheated moment that harmed no one. I wish more NFL games this year had been refereed in the style Dallas-Detroit was; I simply do not understand those fans who seem to enjoy a blizzard of yellow flags and seeing every third play called back.</p><p>If the Lions fans want to blame anyone, they should blame Jim Caldwell for failing to go for it on 4th-and-1. The football gods obviously did not like that, as they promptly punished the Lions with a 10-yard shanked punt. Caldwell played to avoid losing throughout the second half; switching to a four-man rush and abandoning the blitz took the pressure off Romo, who made Detroit pay for it.</p><p>And besides, those petty flags would have caused us to miss the redemption of Dallas’s rookie defensive end, whose utter stupidity in not falling down to seal the game once he’d recovered the fumble was made up for by creating and recovering another fumble to win the game. In the end, with two minutes left and two timeouts, Stafford only managed to produce two fumbles. Game over. The better team won.</p></div>",
  "content_text": "The difference between watching games between two teams who should be in the playoffs – Dallas and Detroit – and teams who shouldn’t be – pretty much the other six teams – was glaringly apparent yesterday. I think the playoffs worked best when there were three divisions and one wild card team; just as there are more teams than there are NFL-caliber quarterbacks, there are more teams in the playoffs than there are playoff-caliber teams.\nBut as long as there are four divisions (which works well for other reasons), it would be better if there was only one wild card team and one first-round bye. I have no regard for the “best teams” argument, because the only “best teams” that matter are already guaranteed entry. If you’re only the third-best team in your four-team division, you shouldn’t be in the playoffs. If you’re only the third-best of the non-division winners, you shouldn’t be in the playoffs.\nThe Eagles, who lost to the Seahawks, Cowboys, and Redskins before beating the Giants to close out the season, weren’t going to do anything that Carolina won’t do, which is to say lose to the Seahawks next weekend.\nAs for last night’s game, it was good to see Tony Romo finally get the playoff monkey off his back. The controversial call shouldn’t have been made in the first place, because a) it was offensive pass interference when Pettigrew grabbed Hitchens’s facemask, b) the contact was minimal, and most importantly, c)\nit was a completely uncatchable ball\n. Stafford literally hit Hitchens in the back right in the numbers; there was absolutely no way the receiver had any sort of play on the ball. Furtheremore, there is no “face-guarding” rule in the NFL, or, for that matter, in NCAA football; it is only deemed pass interference in high school football, specifically National Federation of State High School Associations rule 7-5-10:\n“Any player hinders an opponent’s vision without making an\nattempt to catch, intercept or bat the ball, even though no contact was\nmade.”\nWhen the officials call pass interference on a player who hasn’t turned around, they do so because he has crashed into a receiver who is coming back for a high ball, to distinguish them from defenders who crash into a receiver when they themselves are going for a high ball. That was not the case in the play being discussed, for the obvious reason that Stafford threw the ball into the Dallas linebacker’s back. Recall the NFL’s pass interference rules:\nActions that do not constitute pass interference include but are not limited to: (c) Contact that would normally be considered pass interference, but the pass is clearly uncatchable by the involved players.\nESPN’s Todd Archer asked Pete Morelli (who is admittedly not a very good ref: see the NFC Championship Game 2009) about the call turned non-call:\nTodd Archer: Can you talk about the decision to overturn the call and why you overturned the call?\nPete Morelli: The back judge threw his flag for defensive pass\ninterference. We got other information from another official from a\ndifferent angle that thought the contact was minimal and didn’t warrant\npass interference. He thought it was face-guarding.\nArcher: Which official?\nMorelli: The head linesman.\nArcher: What did you see?\nMorelli: It’s not my responsibility. I’m a hundred miles away.\nArcher: Face-guarding is not a foul?\nMorelli: Face-guarding is not a foul. It is a penalty in college but not in professional football.\nArcher: What is the process you go through after you announce the call? Should you have waited before you announced the call?\nMorelli: Probably, yes. The information came and then the officials got\ntogether a little bit later, after it was given to me, the first\ninformation. It would have probably been smoother if we got together.\nHe did the right thing. It’s better to get it right and look like a fool or a fix than allow a bad call to stand when he knows better. As for the decision not to flag Dez Bryant for coming onto the field without his helmet in protest of the call, I think it was a correct no-call. We want to see the refs let minor things go in the playoffs (that’s why Suh was permitted to play when his suspension would never have been overturned in the regular season), and no one wants to see a playoff game settled by an off-the-field foul by an excited player in an overheated moment that harmed no one. I wish more NFL games this year had been refereed in the style Dallas-Detroit was; I simply do not understand those fans who seem to enjoy a blizzard of yellow flags and seeing every third play called back.\nIf the Lions fans want to blame anyone, they should blame Jim Caldwell for failing to go for it on 4th-and-1. The football gods obviously did not like that, as they promptly punished the Lions with a 10-yard shanked punt. Caldwell played to avoid losing throughout the second half; switching to a four-man rush and abandoning the blitz took the pressure off Romo, who made Detroit pay for it.\nAnd besides, those petty flags would have caused us to miss the redemption of Dallas’s rookie defensive end, whose utter stupidity in not falling down to seal the game once he’d recovered the fumble was made up for by creating and recovering another fumble to win the game. In the end, with two minutes left and two timeouts, Stafford only managed to produce two fumbles. Game over. The better team won.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-05T08:58:00+00:00"
}