{
  "url": "https://voxday.net/2015/01/15/graphic-design-needed/",
  "scraped_at": "2025-12-16T12:41:49.370925",
  "title": "Graphic design needed",
  "date_display": "January 15, 2015",
  "date_iso": "2015-01-15T16:00:00+00:00",
  "date_from_url": "2015-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A message from Castalia House’s art director.</i></p><p>As Castalia House continues to grow we need another graphic design<br> professional to help with cover typography and pre-press needs. Ideally<br> the candidate will have a strong background in graphic design with a<br> love of composition, type, and an understanding of the pre-press process<br> including ICC color profiles, color conversion from RGB to CMYK for the<br> press, and how to read and understand provided print specs and<br> templates. A typical project will include the typography for a cover<br> design with both the artistic cover type over a provided illustration<br> for an eBook cover, and then prepping select covers for printing<br> including laying out the body copy on the cover, designing the spine and<br> back cover based upon the font illustration, and all pre-press work to<br> create a make-ready file for the printer based upon a template. The<br> designer will need to have industry standard software and be able to<br> provide an X-1a compliant pdf for print.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The work and pay is<br> based upon the project and an online portfolio for evaluation of your<br> work is a must. Please email <i>books AT castaliahouse DOT com</i> with COVERS<br> in the subject, provide a link to your work, and include your rates for<br> the work specified above. Not all books will require print layout. If you want to help the Blue SFF revolution<br> and work with a talented and very dedicated team of professionals, this<br> is your opportunity.</br></br></br></br></br></br></p></div>",
  "content_text": "A message from Castalia House’s art director.\nAs Castalia House continues to grow we need another graphic design\nprofessional to help with cover typography and pre-press needs. Ideally\nthe candidate will have a strong background in graphic design with a\nlove of composition, type, and an understanding of the pre-press process\nincluding ICC color profiles, color conversion from RGB to CMYK for the\npress, and how to read and understand provided print specs and\ntemplates. A typical project will include the typography for a cover\ndesign with both the artistic cover type over a provided illustration\nfor an eBook cover, and then prepping select covers for printing\nincluding laying out the body copy on the cover, designing the spine and\nback cover based upon the font illustration, and all pre-press work to\ncreate a make-ready file for the printer based upon a template. The\ndesigner will need to have industry standard software and be able to\nprovide an X-1a compliant pdf for print.\nThe work and pay is\nbased upon the project and an online portfolio for evaluation of your\nwork is a must. Please email\nbooks AT castaliahouse DOT com\nwith COVERS\nin the subject, provide a link to your work, and include your rates for\nthe work specified above. Not all books will require print layout. If you want to help the Blue SFF revolution\nand work with a talented and very dedicated team of professionals, this\nis your opportunity.",
  "tags": [
    "Castalia House",
    "Ilkotism"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-15T16:00:00+00:00"
}