{
  "url": "https://voxday.net/2015/01/22/how-convenien/",
  "scraped_at": "2025-12-16T12:42:41.908537",
  "title": "How convenient",
  "date_display": "January 22, 2015",
  "date_iso": "2015-01-22T21:15:00+00:00",
  "date_from_url": "2015-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know, I think we might have the chance to roll this one out one of these days….</p><p><i>“That said, if you tell people my books are awful but have in fact never read them, you might suck as a human being.”</i><br> – John Scalzi, <a href=\"https://twitter.com/scalzi/status/558344799062097920\">22 January, 2015</a></br></p><p>It could come in handy, don’t you know? That being said, I’ve read three of McRapey’s books and I didn’t think they were awful, with the exception of <i>The Android’s Dream</i>. They were mediocre, derivative, and monocharacteristic (which is to say that the characters all tend to speak with the same snarky voice), but they’re not, on average, awful.</p><p>They’re not good either, of course. I didn’t stop reading Scalzi’s books due to the author, but due to the books themselves. They simply weren’t of any interest to me. No big deal, I don’t have any interest in the books by Stephanie Meyer or whoever wrote <i>The Hunger Games</i> either and plenty of people seem to like them. In not entirely unrelated news, this comment amused me.</p><p><i>“It’s always easy to spot the new midwits showing up on the blog as they come in with pseudo-intellectual swagger, appeal to authority and credentialism, the inability to admit they are wrong on anything, and unfounded belief in their own intelligence.” </i></p><p>One would think the mere use of the term “midwit” would give an intelligent individual pause, but then, they’re only midwits. It’s not their fault that they’re unaccustomed to an environment where a +1.5 SD is nothing special. Everyone has to learn sometime.</p><p>I wish everyone could undergo the humiliation I went through, along with every other Dragon, at my dojo. Our sensei mastered the art of breaking down the individual’s ego and rendering him aware of his own ignorance and ready to learn. There is nothing like getting beaten down by someone you couldn’t imagine was even capable of standing up to you to make you realize that your perception of reality was intrinsically false.</p></div>",
  "content_text": "You know, I think we might have the chance to roll this one out one of these days….\n“That said, if you tell people my books are awful but have in fact never read them, you might suck as a human being.”\n– John Scalzi,\n22 January, 2015\nIt could come in handy, don’t you know? That being said, I’ve read three of McRapey’s books and I didn’t think they were awful, with the exception of\nThe Android’s Dream\n. They were mediocre, derivative, and monocharacteristic (which is to say that the characters all tend to speak with the same snarky voice), but they’re not, on average, awful.\nThey’re not good either, of course. I didn’t stop reading Scalzi’s books due to the author, but due to the books themselves. They simply weren’t of any interest to me. No big deal, I don’t have any interest in the books by Stephanie Meyer or whoever wrote\nThe Hunger Games\neither and plenty of people seem to like them. In not entirely unrelated news, this comment amused me.\n“It’s always easy to spot the new midwits showing up on the blog as they come in with pseudo-intellectual swagger, appeal to authority and credentialism, the inability to admit they are wrong on anything, and unfounded belief in their own intelligence.”\nOne would think the mere use of the term “midwit” would give an intelligent individual pause, but then, they’re only midwits. It’s not their fault that they’re unaccustomed to an environment where a +1.5 SD is nothing special. Everyone has to learn sometime.\nI wish everyone could undergo the humiliation I went through, along with every other Dragon, at my dojo. Our sensei mastered the art of breaking down the individual’s ego and rendering him aware of his own ignorance and ready to learn. There is nothing like getting beaten down by someone you couldn’t imagine was even capable of standing up to you to make you realize that your perception of reality was intrinsically false.",
  "tags": [
    "books",
    "Hugo Award",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-22T21:15:00+00:00"
}