{
  "url": "https://voxday.net/2015/01/15/how-to-hunt-trolls/",
  "scraped_at": "2025-12-16T12:41:46.063670",
  "title": "How to hunt trolls",
  "date_display": "January 15, 2015",
  "date_iso": "2015-01-15T10:22:00+00:00",
  "date_from_url": "2015-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of the conclusion of the successful hunting of one of the Internet’s more notorious trolls, a few people have asked me to explain how to go about doing the same. Here are some of the observations I have made along the way.</p><ol><li>Stay calm. The troll’s primary objective is to upset you. Trolls feed off attention and negative emotion, so it’s important to control your own reactions and deny them both. Staying calm serves two positive purposes, as it prevents you from establishing an emotional relationship with them as well as forcing them to increase their efforts in order to achieve the desired effect, thereby increasing the likelihood they will make a mistake or cross a line.</li><li>Be patient. A security expert has told me that no one can regularly comment without giving away their true identity within one year. Remember, the troll is in it for the attention, so hiding even the smallest significant aspects of his identity places him fundamentally at conflict with his own instincts and desires.</li><li>Directly inform the troll that he is banned from visiting your site and from commenting under all current and future identities, and that if he persists in his activity, he is engaged in illegal trespassing and cyberstalking. It is vital to put them on notice. For some reason, many people who are capable of understanding that physical trespassing is not only illegal, but can permit them to be legally shot in some places tend to find it hard to grasp that online trespassing is illegal. The fact that you CAN access a site does not automatically give you permission to do so any more than the fact that you CAN physically access someone’s lawn gives you permission to walk on it.</li><li>Don’t delete the troll’s comments. It took me a long time to learn this; even though I saved them in a separate text file, I sometimes got lazy or couldn’t be bothered. It’s best to have them there, in the blog, where they can be easily produced as evidence or mined for investigative purposes.</li><li>Don’t permit the readers to engage with the troll. They may mean well, but their reactions to the troll are usually a bigger problem than the troll’s comments are. Set a policy of “Comments responding to a troll will be deleted” and delete them on sight. Commenters cannot shut down a troll because he seeks their negative attention; them saying “shut up” and “go away” is something he desires, so their effort on your behalf are counterproductive. Don’t let them feed him.</li><li>Look for the troll’s other identities. Trolls always have sockpuppets, and often they are less careful when using them. Yama had over 30. Even a cursory glance at the mined comments shows that NTA has at least three. And often, the sockpuppet identity is the troll’s primary identity on other sites. Yama did not use Yama here at all, he primarily used Will leFey, Dan Picaro, Luscinia, and Alauda. But once I was able to link him to the Yamamanama and Yama the Spacefish identities, I was able to learn considerably more information about him and those around him.</li><li>Identify their literary tics. We all have them and they are nearly as reliable as fingerprints. Once you develop some skill at this, you’ll be able to recognize a troll under a new identity within two or three posts. It doesn’t hurt that they always gravitate towards the same bugaboos no matter what identity they present.</li><li>Join forces with the troll’s other targets. You are probably not his first or only target. Comparing notes will almost always prove informative and multiple complainants make it impossible for the troll to claim it is a “he said, she said” situation or to blame everything on you once you bring the situation to the attention of third parties.</li><li>Once you have the troll’s IP address, research the cyberstalking laws in their legal jurisdiction. Most communities consider cyberstalking to be a felony and penalties tend to be steeper than you probably expect. Jail sentences of up to 5 years and fines in the five digits are common.</li><li>Don’t bother with threats and warnings. The troll habitually makes empty threats himself, so he’s not going to take yours seriously.</li><li>Don’t pay undue attention to the troll’s assertions. Given that he is on your site under a false identity, why would you believe anything he says? Observe how trolls are very quick to claim entirely factual statements made by you and others are lies; this is psychological projection on their part.</li><li>Don’t bother contacting his friends, employer, and family except to gather more information. They already know something is off about the troll and are accustomed to turning a blind eye to his activities. They will be very reluctant to cooperate in any way and may even try to put you off the trail. For example, Yama’s friend Emma lied to me about knowing him when I contacted her, and if she hadn’t overdone the fake sympathy I might have even bought it. Don’t be upset with them, after all, they know him and they don’t know you. Just don’t expect assistance from them or to be able to use them to put any pressure on him. Again, you’re not dealing with a normal individual here. Never forget that.</li><li>Expect the troll to try to spin the situation as <i>you </i>harassing <i>him</i> as the net tightens. This is actually a very good sign of progress. It means that he is frightened and that his confidence has been shaken. Trolls like to think of themselves as the cunning masters of the situation, so the switch to helpless victim role marks a significant change. It also confirms that you are dealing with a genuinely aberrant psychology, as no normal individual would ever reach the same conclusion.</li><li>Don’t contact the police until you have prepared a succinct summary of the troll’s activity on your site, dating back to the documented beginning, and organizing the various evidence in detail to be available upon request. The summary that I sent to the Marshfield police was only two pages long, but included a description of what additional information I could provide. If possible, provide multiple summaries, from as many of the troll’s other targets as possible. These summaries will not only articulate the complaint, but will save the police a considerable amount of time in substantiating it. Th easier you make it for them to do their job, the sooner they are likely to do it. The detective who addressed Yama’s case specifically commented on how useful the summaries were to his investigation.</li><li>Before you call the relevant police department, check their website and see if they have an officer or a department specializing in online crimes. Most do. Those are the only officers to whom you should talk, as their colleagues tend to regard computers as akin to magic and beyond their ability to address.</li><li>Be prepared to press charges, but be open to the possibility of other desirable outcomes. The objective should not be vengeance, but simply to end the trolling. For the most part, trolls are disturbed and damaged individuals; the primary reason they have the time to wage their bizarre campaigns is because they are not normally functioning adults with responsibilities.</li><li>Above all, don’t be afraid. The troll is targeting you because he hates the fact that other people think you matter and he feels he does not in comparison. He’s trying to bring you down to his level, to enmesh you in his petty hatred and fear. Don’t permit him to do that. Remember that people snipe from cover because they are too psychologically weak to dare engaging in open and direct confrontation.</li></ol><p>UPDATE: Yama surfaced <a href=\"http://thoughtcatalog.com/tanya-cohen/2015/01/why-do-americans-reject-human-rights-when-the-whole-world-embraces-them/#comment-1794230076\">here</a>. Several people spotted him and it’s been reported.</p><ol></ol></div>",
  "content_text": "In light of the conclusion of the successful hunting of one of the Internet’s more notorious trolls, a few people have asked me to explain how to go about doing the same. Here are some of the observations I have made along the way.\nStay calm. The troll’s primary objective is to upset you. Trolls feed off attention and negative emotion, so it’s important to control your own reactions and deny them both. Staying calm serves two positive purposes, as it prevents you from establishing an emotional relationship with them as well as forcing them to increase their efforts in order to achieve the desired effect, thereby increasing the likelihood they will make a mistake or cross a line.\nBe patient. A security expert has told me that no one can regularly comment without giving away their true identity within one year. Remember, the troll is in it for the attention, so hiding even the smallest significant aspects of his identity places him fundamentally at conflict with his own instincts and desires.\nDirectly inform the troll that he is banned from visiting your site and from commenting under all current and future identities, and that if he persists in his activity, he is engaged in illegal trespassing and cyberstalking. It is vital to put them on notice. For some reason, many people who are capable of understanding that physical trespassing is not only illegal, but can permit them to be legally shot in some places tend to find it hard to grasp that online trespassing is illegal. The fact that you CAN access a site does not automatically give you permission to do so any more than the fact that you CAN physically access someone’s lawn gives you permission to walk on it.\nDon’t delete the troll’s comments. It took me a long time to learn this; even though I saved them in a separate text file, I sometimes got lazy or couldn’t be bothered. It’s best to have them there, in the blog, where they can be easily produced as evidence or mined for investigative purposes.\nDon’t permit the readers to engage with the troll. They may mean well, but their reactions to the troll are usually a bigger problem than the troll’s comments are. Set a policy of “Comments responding to a troll will be deleted” and delete them on sight. Commenters cannot shut down a troll because he seeks their negative attention; them saying “shut up” and “go away” is something he desires, so their effort on your behalf are counterproductive. Don’t let them feed him.\nLook for the troll’s other identities. Trolls always have sockpuppets, and often they are less careful when using them. Yama had over 30. Even a cursory glance at the mined comments shows that NTA has at least three. And often, the sockpuppet identity is the troll’s primary identity on other sites. Yama did not use Yama here at all, he primarily used Will leFey, Dan Picaro, Luscinia, and Alauda. But once I was able to link him to the Yamamanama and Yama the Spacefish identities, I was able to learn considerably more information about him and those around him.\nIdentify their literary tics. We all have them and they are nearly as reliable as fingerprints. Once you develop some skill at this, you’ll be able to recognize a troll under a new identity within two or three posts. It doesn’t hurt that they always gravitate towards the same bugaboos no matter what identity they present.\nJoin forces with the troll’s other targets. You are probably not his first or only target. Comparing notes will almost always prove informative and multiple complainants make it impossible for the troll to claim it is a “he said, she said” situation or to blame everything on you once you bring the situation to the attention of third parties.\nOnce you have the troll’s IP address, research the cyberstalking laws in their legal jurisdiction. Most communities consider cyberstalking to be a felony and penalties tend to be steeper than you probably expect. Jail sentences of up to 5 years and fines in the five digits are common.\nDon’t bother with threats and warnings. The troll habitually makes empty threats himself, so he’s not going to take yours seriously.\nDon’t pay undue attention to the troll’s assertions. Given that he is on your site under a false identity, why would you believe anything he says? Observe how trolls are very quick to claim entirely factual statements made by you and others are lies; this is psychological projection on their part.\nDon’t bother contacting his friends, employer, and family except to gather more information. They already know something is off about the troll and are accustomed to turning a blind eye to his activities. They will be very reluctant to cooperate in any way and may even try to put you off the trail. For example, Yama’s friend Emma lied to me about knowing him when I contacted her, and if she hadn’t overdone the fake sympathy I might have even bought it. Don’t be upset with them, after all, they know him and they don’t know you. Just don’t expect assistance from them or to be able to use them to put any pressure on him. Again, you’re not dealing with a normal individual here. Never forget that.\nExpect the troll to try to spin the situation as\nyou\nharassing\nhim\nas the net tightens. This is actually a very good sign of progress. It means that he is frightened and that his confidence has been shaken. Trolls like to think of themselves as the cunning masters of the situation, so the switch to helpless victim role marks a significant change. It also confirms that you are dealing with a genuinely aberrant psychology, as no normal individual would ever reach the same conclusion.\nDon’t contact the police until you have prepared a succinct summary of the troll’s activity on your site, dating back to the documented beginning, and organizing the various evidence in detail to be available upon request. The summary that I sent to the Marshfield police was only two pages long, but included a description of what additional information I could provide. If possible, provide multiple summaries, from as many of the troll’s other targets as possible. These summaries will not only articulate the complaint, but will save the police a considerable amount of time in substantiating it. Th easier you make it for them to do their job, the sooner they are likely to do it. The detective who addressed Yama’s case specifically commented on how useful the summaries were to his investigation.\nBefore you call the relevant police department, check their website and see if they have an officer or a department specializing in online crimes. Most do. Those are the only officers to whom you should talk, as their colleagues tend to regard computers as akin to magic and beyond their ability to address.\nBe prepared to press charges, but be open to the possibility of other desirable outcomes. The objective should not be vengeance, but simply to end the trolling. For the most part, trolls are disturbed and damaged individuals; the primary reason they have the time to wage their bizarre campaigns is because they are not normally functioning adults with responsibilities.\nAbove all, don’t be afraid. The troll is targeting you because he hates the fact that other people think you matter and he feels he does not in comparison. He’s trying to bring you down to his level, to enmesh you in his petty hatred and fear. Don’t permit him to do that. Remember that people snipe from cover because they are too psychologically weak to dare engaging in open and direct confrontation.\nUPDATE: Yama surfaced\nhere\n. Several people spotted him and it’s been reported.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-15T10:22:00+00:00"
}