{
  "url": "https://voxday.net/2015/01/01/i-miss-bowls/",
  "scraped_at": "2025-12-16T12:40:12.089711",
  "title": "I miss the bowls",
  "date_display": "January 1, 2015",
  "date_iso": "2015-01-01T13:30:00+00:00",
  "date_from_url": "2015-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When I was a kid, New Years Day meant hearing my mother, who grew up in Pasadena, watching the Rose Parade. I’d watch the four bowl games, the Sugar Bowl, the Cotton Bowl, the Rose Bowl, and finally, the Orange Bowl.</p><p>And sure, it wasn’t always possible to know who the “national champion” was, but nobody really cared all that much, what was important was that the Big Ten won the Rose Bowl, that Oklahoma didn’t win the Orange Bowl, and that the games featuring the sort of matchups you hadn’t seen before were either a) good games or b) ridiculous blowouts. I don’t even know why I hated Oklahoma, Arkansas, Alabama, Florida, Michigan, and Notre Dame, or why I liked Baylor, Texas, Ohio State, Pitt, Florida State, and USC. But I had a favorite in every major conference</p><p>For me, things started to fall apart with the Bowl Coalition in 1992. The Big 10 and Pac-10 wisely held out for three years, but everything went south, literally, with the Bowl Alliance and the creation of a national championship played at the Fiesta Bowl on January 2nd.</p><p>Now, I no longer even watch college football on New Years Day. I don’t know who is playing in the bowls, and I don’t care. Are people any happier or more interested in college football now that the “national championship” is the de facto SEC championship? It appears I’m not the only one who is less interested in the unambiguous national championship system.</p><ul><li>“The average attendance for bowl games has declined each of the past six<br> seasons, down to 49,116 last season, the lowest mark since 1978-79, when<br> there were 15 bowls, according to the NCAA bowl record book.”</br></br></li><li>“The Michigan State/Stanford Rose Bowl earned the top audience of the BCS<br> slate, with a 10.2 U.S. rating and 18.6 million viewers on ESPN New<br> Year’s Day — up 9% in ratings and viewership from Stanford/Wisconsin<br> last year (9.4, 17.0M), and flat and up 6%, respectively, from<br> TCU/Wisconsin in 2011 (10.2, 17.6M). Despite the increase, the game tied<br> the second-lowest rating ever for the Rose Bowl.</br></br></br></br></br></li><li>The UCF/Baylor Fiesta Bowl drew a 6.6 U.S. rating and 11.2 million<br> viewers Tuesday night, down 11% in ratings and 9% in viewership from<br> Oregon/Kansas State last year (7.4, 12.3M), and down 21% and 18%,<br> respectively, from Oklahoma State/Stanford in 2011 (8.4, 13.6M). The<br> game earned the second-lowest rating and viewership for the Fiesta Bowl<br> in the BCS era, ahead of only Oklahoma/Connecticut in 2010 (6.2, 10.8M). Overall, the Orange and Fiesta Bowls rank among the ten lowest rated BCS bowls of all time. </br></br></br></br></br></li><li>In 2014, the BCS Championship game drew in 25.5 million viewers, and that was just the ninth-watched BCS title in history.</li></ul><p>Here is what appears to be the root of the problem: “They (ESPN) need live content, even mediocre live content,” Maestas<br> told USA TODAY Sports. “Even 400,000 viewers in a sad bowl with 25,000<br> people in the stands is getting better (viewership) than 100 channels<br> out there.”</br></br></br></p><p>But what’s good for ESPN isn’t necessarily good for the game of college football. Quite the opposite, it appears. At least the NFL, for all its lunatic lurching about in its attempt to grow its female audience, is in control of its own destiny. This may explain why I won’t be watching a single bowl game today, but will not miss a single playoff game this weekend.</p></div>",
  "content_text": "When I was a kid, New Years Day meant hearing my mother, who grew up in Pasadena, watching the Rose Parade. I’d watch the four bowl games, the Sugar Bowl, the Cotton Bowl, the Rose Bowl, and finally, the Orange Bowl.\nAnd sure, it wasn’t always possible to know who the “national champion” was, but nobody really cared all that much, what was important was that the Big Ten won the Rose Bowl, that Oklahoma didn’t win the Orange Bowl, and that the games featuring the sort of matchups you hadn’t seen before were either a) good games or b) ridiculous blowouts. I don’t even know why I hated Oklahoma, Arkansas, Alabama, Florida, Michigan, and Notre Dame, or why I liked Baylor, Texas, Ohio State, Pitt, Florida State, and USC. But I had a favorite in every major conference\nFor me, things started to fall apart with the Bowl Coalition in 1992. The Big 10 and Pac-10 wisely held out for three years, but everything went south, literally, with the Bowl Alliance and the creation of a national championship played at the Fiesta Bowl on January 2nd.\nNow, I no longer even watch college football on New Years Day. I don’t know who is playing in the bowls, and I don’t care. Are people any happier or more interested in college football now that the “national championship” is the de facto SEC championship? It appears I’m not the only one who is less interested in the unambiguous national championship system.\n“The average attendance for bowl games has declined each of the past six\nseasons, down to 49,116 last season, the lowest mark since 1978-79, when\nthere were 15 bowls, according to the NCAA bowl record book.”\n“The Michigan State/Stanford Rose Bowl earned the top audience of the BCS\nslate, with a 10.2 U.S. rating and 18.6 million viewers on ESPN New\nYear’s Day — up 9% in ratings and viewership from Stanford/Wisconsin\nlast year (9.4, 17.0M), and flat and up 6%, respectively, from\nTCU/Wisconsin in 2011 (10.2, 17.6M). Despite the increase, the game tied\nthe second-lowest rating ever for the Rose Bowl.\nThe UCF/Baylor Fiesta Bowl drew a 6.6 U.S. rating and 11.2 million\nviewers Tuesday night, down 11% in ratings and 9% in viewership from\nOregon/Kansas State last year (7.4, 12.3M), and down 21% and 18%,\nrespectively, from Oklahoma State/Stanford in 2011 (8.4, 13.6M). The\ngame earned the second-lowest rating and viewership for the Fiesta Bowl\nin the BCS era, ahead of only Oklahoma/Connecticut in 2010 (6.2, 10.8M). Overall, the Orange and Fiesta Bowls rank among the ten lowest rated BCS bowls of all time.\nIn 2014, the BCS Championship game drew in 25.5 million viewers, and that was just the ninth-watched BCS title in history.\nHere is what appears to be the root of the problem: “They (ESPN) need live content, even mediocre live content,” Maestas\ntold USA TODAY Sports. “Even 400,000 viewers in a sad bowl with 25,000\npeople in the stands is getting better (viewership) than 100 channels\nout there.”\nBut what’s good for ESPN isn’t necessarily good for the game of college football. Quite the opposite, it appears. At least the NFL, for all its lunatic lurching about in its attempt to grow its female audience, is in control of its own destiny. This may explain why I won’t be watching a single bowl game today, but will not miss a single playoff game this weekend.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-01T13:30:00+00:00"
}