{
  "url": "https://voxday.net/2015/01/09/its-star-3/",
  "scraped_at": "2025-12-16T12:41:04.323579",
  "title": "The end of the beginning",
  "date_display": "January 9, 2015",
  "date_iso": "2015-01-09T16:52:00+00:00",
  "date_from_url": "2015-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The French have taken out <a href=\"http://www.nytimes.com/2015/01/10/world/europe/charlie-hebdo-paris-shooting.html?_r=0\">all three of the Muslim killers</a>:</p><blockquote class=\"tr_bq\"><p> French police on Friday killed the two brothers suspected of massacring<br> 12 people at a Paris newspaper on Wednesday and freed a hostage they had<br> been holding unharmed, the authorities said. The police launched a<br> simultaneous raid on a kosher supermarket in Paris where an alleged<br> associate of the brothers was holding an unnamed number of hostages.<br> That hostage taker was also killed, according to a senior French police<br> official, and at least five hostages were freed.</br></br></br></br></br></br></p></blockquote><p>Now that the urgent work is done, it’s time for the West to elect nationalist governments and start discussing the best way to encourage their co-religionists to repatriate back to the Dar al-Islam. Steve Sailer <a href=\"http://www.unz.com/isteve/muslims-and-westerners-only-disconnect/\">put it best</a>:</p><blockquote class=\"tr_bq\"><p> Westerners and Muslims don’t agree on the basics of social order and don’t want to live under the same rules. That shouldn’t be a problem because that’s what separate countries are for. We should stop occupying their countries and stop letting them move to ours.</p><p>To paraphrase E.M. Forster:</p><p><i>“Only disconnect.”</i></p></blockquote><p>Islam is not compatible with Christendom. It is not compatible with Western traditions and values. It is not compatible with the secular West either. Muslims themselves will tell you this, that’s why 40 percent of Muslims resident in Great Britain are seeking to establish Sharia rule over the British. Only disconnect.</p><p>It is no longer possible to pretend that multiculturalism is viable. It is no longer possible to pretend that moderate Islam can reform the more fundamentalist forms. It is no longer possible to pretend that we can all get along in one country. That’s what separate countries are for.</p><p>They should not interfere with us here, and we should stop interfering with how they choose to live over there. The disconnect will take place eventually, the only question that remains is if the process is relatively peaceful or if it is massively violent. Any sane and decent Westerner should actively support the former option.</p></div>",
  "content_text": "The French have taken out\nall three of the Muslim killers\n:\nFrench police on Friday killed the two brothers suspected of massacring\n12 people at a Paris newspaper on Wednesday and freed a hostage they had\nbeen holding unharmed, the authorities said. The police launched a\nsimultaneous raid on a kosher supermarket in Paris where an alleged\nassociate of the brothers was holding an unnamed number of hostages.\nThat hostage taker was also killed, according to a senior French police\nofficial, and at least five hostages were freed.\nNow that the urgent work is done, it’s time for the West to elect nationalist governments and start discussing the best way to encourage their co-religionists to repatriate back to the Dar al-Islam. Steve Sailer\nput it best\n:\nWesterners and Muslims don’t agree on the basics of social order and don’t want to live under the same rules. That shouldn’t be a problem because that’s what separate countries are for. We should stop occupying their countries and stop letting them move to ours.\nTo paraphrase E.M. Forster:\n“Only disconnect.”\nIslam is not compatible with Christendom. It is not compatible with Western traditions and values. It is not compatible with the secular West either. Muslims themselves will tell you this, that’s why 40 percent of Muslims resident in Great Britain are seeking to establish Sharia rule over the British. Only disconnect.\nIt is no longer possible to pretend that multiculturalism is viable. It is no longer possible to pretend that moderate Islam can reform the more fundamentalist forms. It is no longer possible to pretend that we can all get along in one country. That’s what separate countries are for.\nThey should not interfere with us here, and we should stop interfering with how they choose to live over there. The disconnect will take place eventually, the only question that remains is if the process is relatively peaceful or if it is massively violent. Any sane and decent Westerner should actively support the former option.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-09T16:52:00+00:00"
}