{
  "url": "https://voxday.net/2015/01/27/jerry-pournelle-wants-to-get-rid-of-air/",
  "scraped_at": "2025-12-16T12:43:16.255947",
  "title": "Abolishing the Air Force",
  "date_display": "January 27, 2015",
  "date_iso": "2015-01-27T13:58:00+00:00",
  "date_from_url": "2015-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jerry Pournelle wants to <a href=\"http://www.jerrypournelle.com/chaosmanor/abolish-the-air-force-and-other-stories/\">get rid of the Air Force</a>:</p><blockquote class=\"tr_bq\"><p> I also intend to do an essay on why we should abolish the Air Force<br> and return to an Army Air Force which is not a separate service. The<br> purpose of military forces is to win wars. The purpose of the Air Force<br> is—well, they no longer know. When we had SAC we knew – “Our profession<br> is peace” was not just a slogan – but that too is neglected in the<br> Modern Air Force. Deterrence and maintenance of nuclear weapons, being<br> ready to use weapons when your fondest wish is that they will never be<br> used – that does require a different kind of military. We once had that<br> in SAC but the end of the Cold War was the end of SAC, and the nuclear<br> deterrence force is, well not what it once was. It is subject to the<br> Iron Law now.</br></br></br></br></br></br></br></br></br></br></p><p>As to the rest of the Air Force, it is more interested in the Air<br> Force than winning wars, and considers supporting the field army as<br> beneath contempt. A slow old Warthog does a much better job, but there<br> is no glory in that. Best to use fast jets… which of course are<br> imprecise and cause a lot of collateral damage. Everyone knows that a<br> force of propeller driven P-47 fighters of WWII would be more effective<br> for supporting the field army than what we use. And the Army must be<br> crippled, not allowed to have effective air power in taking territory.<br> You must use modern jets at high speed.</br></br></br></br></br></br></br></br></p><p>Now the Air Force has a mission that the Army at present does not<br> have: Air Supremacy. And that is a different mission from supporting the<br> field army. It involves engagements with Surface to Air Missiles (SAMs)<br> as well as strikes against the enemy base of operations. The glory is<br> in air to air combat, but that is not the effective way to air<br> supremacy.</br></br></br></br></br></p><p>That is the main argument for an “Independent Air Force” and the<br> bitter fights that ended with creation of USAF. It is true, ground army<br> commanders tend to select the wrong targets to sortie against, and<br> endanger air supremacy; thus the argument for independence, which USAAF<br> eventually won (before SAC existed or any but a few knew would be<br> needed.) Hiroshima ended the debate. But now the Cold War ended and USAF<br> killed SAC as not glamorous – not career building any longer. As to the<br> Warthogs, give them to the National Guard! Real pilots don’t need them!</br></br></br></br></br></br></br></p><p>Sure, I exaggerate but not much: the Air Force keeps trying to get<br> rid of the Warthogs, but never by giving them (and the ground support<br> mission) to the War Department. Better that GI’s die than USAF give up a<br> mission even though it does not want it.</br></br></br></p><p>Drones will change all this, but why wait?</p></blockquote><p>Actually, as Eric S. Raymond demonstrated in both “Sucker Punch” and “Battlefield Lasers”, the Air Force is very close to obsolete anyhow. My expectation is that they’ll try to survive by moving their mission upward, to space, in order to compensate for the vanishing ability of their planes to survive in the atmosphere.</p></div>",
  "content_text": "Jerry Pournelle wants to\nget rid of the Air Force\n:\nI also intend to do an essay on why we should abolish the Air Force\nand return to an Army Air Force which is not a separate service. The\npurpose of military forces is to win wars. The purpose of the Air Force\nis—well, they no longer know. When we had SAC we knew – “Our profession\nis peace” was not just a slogan – but that too is neglected in the\nModern Air Force. Deterrence and maintenance of nuclear weapons, being\nready to use weapons when your fondest wish is that they will never be\nused – that does require a different kind of military. We once had that\nin SAC but the end of the Cold War was the end of SAC, and the nuclear\ndeterrence force is, well not what it once was. It is subject to the\nIron Law now.\nAs to the rest of the Air Force, it is more interested in the Air\nForce than winning wars, and considers supporting the field army as\nbeneath contempt. A slow old Warthog does a much better job, but there\nis no glory in that. Best to use fast jets… which of course are\nimprecise and cause a lot of collateral damage. Everyone knows that a\nforce of propeller driven P-47 fighters of WWII would be more effective\nfor supporting the field army than what we use. And the Army must be\ncrippled, not allowed to have effective air power in taking territory.\nYou must use modern jets at high speed.\nNow the Air Force has a mission that the Army at present does not\nhave: Air Supremacy. And that is a different mission from supporting the\nfield army. It involves engagements with Surface to Air Missiles (SAMs)\nas well as strikes against the enemy base of operations. The glory is\nin air to air combat, but that is not the effective way to air\nsupremacy.\nThat is the main argument for an “Independent Air Force” and the\nbitter fights that ended with creation of USAF. It is true, ground army\ncommanders tend to select the wrong targets to sortie against, and\nendanger air supremacy; thus the argument for independence, which USAAF\neventually won (before SAC existed or any but a few knew would be\nneeded.) Hiroshima ended the debate. But now the Cold War ended and USAF\nkilled SAC as not glamorous – not career building any longer. As to the\nWarthogs, give them to the National Guard! Real pilots don’t need them!\nSure, I exaggerate but not much: the Air Force keeps trying to get\nrid of the Warthogs, but never by giving them (and the ground support\nmission) to the War Department. Better that GI’s die than USAF give up a\nmission even though it does not want it.\nDrones will change all this, but why wait?\nActually, as Eric S. Raymond demonstrated in both “Sucker Punch” and “Battlefield Lasers”, the Air Force is very close to obsolete anyhow. My expectation is that they’ll try to survive by moving their mission upward, to space, in order to compensate for the vanishing ability of their planes to survive in the atmosphere.",
  "tags": [
    "technology",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-27T13:58:00+00:00"
}