{
  "url": "https://voxday.net/2015/01/03/john-scalzi-is-malignant-narcissis/",
  "scraped_at": "2025-12-16T12:40:26.360485",
  "title": "Is John Scalzi a malignant narcissist?",
  "date_display": "January 3, 2015",
  "date_iso": "2015-01-03T16:05:00+00:00",
  "date_from_url": "2015-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As if being a self-confessed rapist who associates with men accused of sexually battering women wasn’t enough of an indication, reading Michael Trust’s fascinating work on malignant narcissists tends to indicate that there is something seriously off about John Scalzi. Consider these various points from the book:</p><p><b>Competitive/Relative Inferiority</b></p><p>Narcissists are weirdly competitive and strangely envious over seemingly insignificant details, from how the salary they earn compares to other’s, to the respectability of the shampoo they use, compared to the shampoos that others use. It is a shielding mechanism, designed to protect their ego, and their amygdala, from confronting their own insecurity.</p><p>You can sometimes spot this trait in a narcissist, by how they will try to verbally downplay their competitiveness in realms where they can’t compete, as a way of creating a false reality where they don’t care about their competitive inferiority. If your narcissist, out of the blue says, “Other people are obsessed with how much money they earn, but I really don’t care about things like that,” then you know they were just obsessing over exactly that subject. They are trying to establish a verbalized reality where their not caring, will allow their brain to relax over their abject failure in that regard.</p><p><b>McRapey on weightlifting </b>(or practically any other subject, for that matter. To take all his various protestations about not caring at face value, you’d have to assume he was a Stoic of an emotional flatness to put the Romans to shame.)</p><p><i>Last week, as part of my general “try to lose weight and get a little healthier because you’re middle-aged now and you don’t want to die” thing, I started going to the local YMCA to use its weight room and indoor track, with my daughter as my workout partner. She’s been on the powerlifting team at her school for the last three years, so she’s knowledgeable about the weights in a way I am not, and is thus a good person with whom to work out. At the end of our first session, I tweeted the following:</i></p><p>    Let it be known that my daughter can lift more than I do. Because she’s on her school’s weightlifting team, and also because she’s awesome.</p><p>    — John Scalzi (@scalzi) June 30, 2014</p><p>This naturally aroused the derision of the hooting pack of status-anxious dudebros who let me live rent-free in their brains, prompting a predictable slew of tweets and blog posts about how this is further proof of my girly-man status, hardly a man at all, dude do you even lift, and so on.  I am delighted in all the ways that they are the best, and also, better than me.<br> <b><br/></b><br> <b>Diminution of Stature/Humiliation</b></br></br></p><p>The narcissist needs to feel as if they have power, so as to pacify their insecure amygdala. It is only when everyone around them reflexively supplicates, that the narcissist can let their amygdala relax. For this reason, narcissists often build a perception of themselves as superiors, and they demand that others treat them this way.<b> </b></p><p><b>McRapey on running for SFWA President for the fourth time</b><i> </i></p><p><i>I have decided to step forward once more (last, last very last time I swear)<br> as a candidate for President, a position to which I was first elected<br> in 2010. I had originally intended to step down at the end of this term,<br> but on reflection decided there were still some things I wanted to<br> accomplish in the role, and it made sense to try them over the course of<br> an additional year. Whether I get that year will be up to SFWA members,<br> of course; they may be tired of me and my management style. In which<br> case I hope they elect someone else, rather than, say, stabbing me<br> Caesar-style at the Nebula Awards. Please, SFWA members: No stabbing.<br> That’s pointy and hurts.</br></br></br></br></br></br></br></br></br></i></p><p><b>Insist on Arguable Untruths</b></p><p>Narcissists who do this will insist on an untruth, especially one which would impede the attainment of a goal important to the group, and then they will refuse to acknowledge the falsity of the untruth. I fully believe narcissists who practice this technique do it knowingly. They know that what they are asserting is false, they enjoy seeing you upset over the fact that they are so unable to accept logic, and they refuse to give in purposely, to watch you grow increasingly agitated and frustrated. To these narcissists, truth is immaterial, the group’s goals are meaningless, and your upset emotional state is blissfully amusing. As a result they have one goal – to see your frustrated.</p><p><b>McRapey on <a href=\"http://www.milobookclub.com/2005/03/06/frightened-rabbits-of-sfwa/\">the lack of women writing hard science fiction</a></b></p><p><i>I have a degree in philosophy from the University of Chicago<br> (specializing in the philosophy of language), and therefore have ample<br> training in rhetoric, so I doubt that rhetorical deficiencies on this<br> end are the issue. I read your column Vox, and I grasped your<br> obvious rhetorical device. It doesn’t impress me. As continually stated,<br> your rhetorical device is obviously bad: Poorly stated, poorly<br> supported, and rheorically incoherent. To restate: Your thesis is wrong<br> and you lack the rhetorical skills to present your thesis in a coherent<br> fashion. Your latter-day attempt to brush off your sexist and ignorant<br> statement as sarcasm is baldly transparent as backtracking; even if it<br> were true, it shows that your use of such devices is appallingly clumsy.<br> Again one wonders how you got your columnist gig, or, alternately, if<br> anyone bothers to edit you, as you so clearly need.</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p><b>Being a Central Information Hub</b></p><p>Two things narcissists try to do to irritate is to invade privacy, and control and guide the flow of all information. This is probably due to some deep perception that their entire self-worth is defined by the group’s beliefs and perceptions (ie, it’s acceptance of their false reality), combined with an assumption (erroneously assuming that everyone else thinks like them), that everyone else’s self-worth is as well. Thus, to a narcissist, control the information flow, and you control everyone’s self-assessments of their own self-worth. To the narcissist, that information is pure power over not just everyone, but in the narcissist’s mind, the very (false) reality that everyone inhabits.</p><p><b>1. McRapey on all controversial subjects of the last 10 years</b></p><p><i>Comments off on this</i></p><p><b>2. McRapey on all people who <i>might </i>disagree with him</b><i> </i><br> <i><br/></i><br> <i>You are blocked from following @scalzi and viewing @scalzi’s Tweets.</i><br> <i> </i><b> </b><br> <b>Out-grouping</b></br></br></br></br></p><p>When interacting socially, narcissists are snakes in the grass. One of their major objectives when dealing with those they dislike is to alienate their targets from any social group to which they belong. They do this because they themselves require social validation to support the false reality that they construct to shield their amygdala from stimulation. As long as the group accepts the narcissist and their false reality, the narcissist can cling to the belief that they are somehow normal, or even superior. It is this social validation which serves as a crucial psychological crutch, shielding them from the pain that would result from an honest self-assessment of what they are. Projecting this psychology on others, the narcissist will assume that group-affiliation is just as vitally important to you. As a result, they will seek to disrupt your group affiliations as a way to both, try to disrupt the group-validation of the false reality they assume you have, and preserve this vital psychological crutch for themselves. <i></i><br> <i><br/></i><br> <b>McRapey on August 14, 2013, after I announced my expulsion from SFWA</b><i></i><br> <i><br/></i><br> <i>For No Particular Reason At All, This Song Seems Strangely Appropriate Today…. On an entirely unrelated note, today I renewed my SFWA membership. Seems I forgot to do it earlier. Oh, well, an easily corrected oversight, and it was. </i><br> <i><br/></i><br> <b>Privacy Invasion</b><i></i></br></br></br></br></br></br></p><p>The narcissist will intrude into their private spaces, and then feign ignorance of why they should care that he is there.<i></i><br> <i><br/></i><b>McRapey </b></br></p><p>Ask McRapey about this one. He knows what he did. This was the bizarre behavior that made it evident Scalzi’s behavior isn’t merely that of a normal self-centered individual, but more akin to that of the malignant narcissists described in the book. One would do well to keep these things in mind before one too quickly accept McRapey’s retroactive claims concerning his “satirical” practices at face value.</p><p>I’d add one more red flag in addition to those mentioned in the book. It’s what I would call a “probing” style of communication. Everything is two steps forward and one step back; if resistance is met, then it’s all only a joke, ha ha ha, and the individual retreats. If not, the breakthrough is quickly reinforced and a new narrative is established. It’s basically a deceptive tactic used to control the narrative while concealing the narcissist’s objectives. The joke about not wanting to be stabbed at the Nebula Awards is a good example of that; what is the point of the joke in the first place given that it’s not even remotely funny. It is to keep things lighthearted and distract from the fact that the narcissist is dead serious about seeking what he perceives to be power again.</p><p><i>How to Deal with Narcissists</i> is a remarkable book. And it’s astonishing how well it describes the behavior of certain trolls known to infest these parts, as well as explain the reasons for that behavior. My completely unprofessional opinion is that John Scalzi is not a full-blown malignant narcissist, but merely has some observable tendencies in that regard and is rather less psychologically normal than most of his fans and his critics would tend to believe. These tendencies are most clearly seen in his habitual dishonesty and complete inability to admit the truth even when caught out publicly in a lie.</p></div>",
  "content_text": "As if being a self-confessed rapist who associates with men accused of sexually battering women wasn’t enough of an indication, reading Michael Trust’s fascinating work on malignant narcissists tends to indicate that there is something seriously off about John Scalzi. Consider these various points from the book:\nCompetitive/Relative Inferiority\nNarcissists are weirdly competitive and strangely envious over seemingly insignificant details, from how the salary they earn compares to other’s, to the respectability of the shampoo they use, compared to the shampoos that others use. It is a shielding mechanism, designed to protect their ego, and their amygdala, from confronting their own insecurity.\nYou can sometimes spot this trait in a narcissist, by how they will try to verbally downplay their competitiveness in realms where they can’t compete, as a way of creating a false reality where they don’t care about their competitive inferiority. If your narcissist, out of the blue says, “Other people are obsessed with how much money they earn, but I really don’t care about things like that,” then you know they were just obsessing over exactly that subject. They are trying to establish a verbalized reality where their not caring, will allow their brain to relax over their abject failure in that regard.\nMcRapey on weightlifting\n(or practically any other subject, for that matter. To take all his various protestations about not caring at face value, you’d have to assume he was a Stoic of an emotional flatness to put the Romans to shame.)\nLast week, as part of my general “try to lose weight and get a little healthier because you’re middle-aged now and you don’t want to die” thing, I started going to the local YMCA to use its weight room and indoor track, with my daughter as my workout partner. She’s been on the powerlifting team at her school for the last three years, so she’s knowledgeable about the weights in a way I am not, and is thus a good person with whom to work out. At the end of our first session, I tweeted the following:\nLet it be known that my daughter can lift more than I do. Because she’s on her school’s weightlifting team, and also because she’s awesome.\n— John Scalzi (@scalzi) June 30, 2014\nThis naturally aroused the derision of the hooting pack of status-anxious dudebros who let me live rent-free in their brains, prompting a predictable slew of tweets and blog posts about how this is further proof of my girly-man status, hardly a man at all, dude do you even lift, and so on.  I am delighted in all the ways that they are the best, and also, better than me.\nDiminution of Stature/Humiliation\nThe narcissist needs to feel as if they have power, so as to pacify their insecure amygdala. It is only when everyone around them reflexively supplicates, that the narcissist can let their amygdala relax. For this reason, narcissists often build a perception of themselves as superiors, and they demand that others treat them this way.\nMcRapey on running for SFWA President for the fourth time\nI have decided to step forward once more (last, last very last time I swear)\nas a candidate for President, a position to which I was first elected\nin 2010. I had originally intended to step down at the end of this term,\nbut on reflection decided there were still some things I wanted to\naccomplish in the role, and it made sense to try them over the course of\nan additional year. Whether I get that year will be up to SFWA members,\nof course; they may be tired of me and my management style. In which\ncase I hope they elect someone else, rather than, say, stabbing me\nCaesar-style at the Nebula Awards. Please, SFWA members: No stabbing.\nThat’s pointy and hurts.\nInsist on Arguable Untruths\nNarcissists who do this will insist on an untruth, especially one which would impede the attainment of a goal important to the group, and then they will refuse to acknowledge the falsity of the untruth. I fully believe narcissists who practice this technique do it knowingly. They know that what they are asserting is false, they enjoy seeing you upset over the fact that they are so unable to accept logic, and they refuse to give in purposely, to watch you grow increasingly agitated and frustrated. To these narcissists, truth is immaterial, the group’s goals are meaningless, and your upset emotional state is blissfully amusing. As a result they have one goal – to see your frustrated.\nMcRapey on\nthe lack of women writing hard science fiction\nI have a degree in philosophy from the University of Chicago\n(specializing in the philosophy of language), and therefore have ample\ntraining in rhetoric, so I doubt that rhetorical deficiencies on this\nend are the issue. I read your column Vox, and I grasped your\nobvious rhetorical device. It doesn’t impress me. As continually stated,\nyour rhetorical device is obviously bad: Poorly stated, poorly\nsupported, and rheorically incoherent. To restate: Your thesis is wrong\nand you lack the rhetorical skills to present your thesis in a coherent\nfashion. Your latter-day attempt to brush off your sexist and ignorant\nstatement as sarcasm is baldly transparent as backtracking; even if it\nwere true, it shows that your use of such devices is appallingly clumsy.\nAgain one wonders how you got your columnist gig, or, alternately, if\nanyone bothers to edit you, as you so clearly need.\nBeing a Central Information Hub\nTwo things narcissists try to do to irritate is to invade privacy, and control and guide the flow of all information. This is probably due to some deep perception that their entire self-worth is defined by the group’s beliefs and perceptions (ie, it’s acceptance of their false reality), combined with an assumption (erroneously assuming that everyone else thinks like them), that everyone else’s self-worth is as well. Thus, to a narcissist, control the information flow, and you control everyone’s self-assessments of their own self-worth. To the narcissist, that information is pure power over not just everyone, but in the narcissist’s mind, the very (false) reality that everyone inhabits.\n1. McRapey on all controversial subjects of the last 10 years\nComments off on this\n2. McRapey on all people who\nmight\ndisagree with him\nYou are blocked from following @scalzi and viewing @scalzi’s Tweets.\nOut-grouping\nWhen interacting socially, narcissists are snakes in the grass. One of their major objectives when dealing with those they dislike is to alienate their targets from any social group to which they belong. They do this because they themselves require social validation to support the false reality that they construct to shield their amygdala from stimulation. As long as the group accepts the narcissist and their false reality, the narcissist can cling to the belief that they are somehow normal, or even superior. It is this social validation which serves as a crucial psychological crutch, shielding them from the pain that would result from an honest self-assessment of what they are. Projecting this psychology on others, the narcissist will assume that group-affiliation is just as vitally important to you. As a result, they will seek to disrupt your group affiliations as a way to both, try to disrupt the group-validation of the false reality they assume you have, and preserve this vital psychological crutch for themselves.\nMcRapey on August 14, 2013, after I announced my expulsion from SFWA\nFor No Particular Reason At All, This Song Seems Strangely Appropriate Today…. On an entirely unrelated note, today I renewed my SFWA membership. Seems I forgot to do it earlier. Oh, well, an easily corrected oversight, and it was.\nPrivacy Invasion\nThe narcissist will intrude into their private spaces, and then feign ignorance of why they should care that he is there.\nMcRapey\nAsk McRapey about this one. He knows what he did. This was the bizarre behavior that made it evident Scalzi’s behavior isn’t merely that of a normal self-centered individual, but more akin to that of the malignant narcissists described in the book. One would do well to keep these things in mind before one too quickly accept McRapey’s retroactive claims concerning his “satirical” practices at face value.\nI’d add one more red flag in addition to those mentioned in the book. It’s what I would call a “probing” style of communication. Everything is two steps forward and one step back; if resistance is met, then it’s all only a joke, ha ha ha, and the individual retreats. If not, the breakthrough is quickly reinforced and a new narrative is established. It’s basically a deceptive tactic used to control the narrative while concealing the narcissist’s objectives. The joke about not wanting to be stabbed at the Nebula Awards is a good example of that; what is the point of the joke in the first place given that it’s not even remotely funny. It is to keep things lighthearted and distract from the fact that the narcissist is dead serious about seeking what he perceives to be power again.\nHow to Deal with Narcissists\nis a remarkable book. And it’s astonishing how well it describes the behavior of certain trolls known to infest these parts, as well as explain the reasons for that behavior. My completely unprofessional opinion is that John Scalzi is not a full-blown malignant narcissist, but merely has some observable tendencies in that regard and is rather less psychologically normal than most of his fans and his critics would tend to believe. These tendencies are most clearly seen in his habitual dishonesty and complete inability to admit the truth even when caught out publicly in a lie.",
  "tags": [
    "freakshow",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-03T16:05:00+00:00"
}