{
  "url": "https://voxday.net/2015/01/12/mailvox-deportation-is-not-war/",
  "scraped_at": "2025-12-16T12:41:26.877268",
  "title": "Mailvox: deportation is not war",
  "date_display": "January 12, 2015",
  "date_iso": "2015-01-12T18:37:00+00:00",
  "date_from_url": "2015-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Asked asked about the abandonment of multiculturalism:</p><blockquote class=\"tr_bq\"><p> Vox, your position seems to abandon multi-culturalism.. how do you envision this practically? France has 4-5 million Muslims, it’s not possible to deport them without a MAJOR war. The other alternative would be forceful conversions to Christianity/atheism… yeah.. be ready to strike France out of the map.</p></blockquote><p>This is a false dichotomy. Of course it is possible to deport 5 million people. It’s neither difficult to accomplish nor likely to inspire war, let alone a MAJOR war. The oft-heard insistence that mass deportation is either a) impossible or b) necessarily violent is intrinsically ignorant. One has to literally know nothing about 20th century history in order to make the assertion, as one’s knowledge of the subject does not even rise to the level of Wikipedia.</p><ol><li><b>Eastern Europe, 1945:</b> German Reichsdeutsche and citizens of other European states who claimed German ethnicity were forced out of many Eastern Europe countries to Germany and Austria, and to Australia or the United States from there for many, during the later stages of World War II and the post-war period. The areas of expulsion included former eastern territories of Germany, which were transferred to Poland and the Soviet Union after the war, as well as areas annexed or occupied by Nazi Germany in pre-war Poland, Czechoslovakia, Hungary, Romania, northern Yugoslavia and other states of Central and Eastern Europe. By 1950, a total of approximately 12 million Germans had fled or been expelled from east-central Europe into the areas which would become post-war Germany and Allied-occupied Austria. Some sources put the total at 14 million, including migrants to Germany after 1950 and the children born to expelled parents. The largest numbers came from territories ultimately ceded to Poland and the Soviet Union (about 7 million), and from Czechoslovakia (about 3 million).</li><li><b>Soviet Union, 1932</b>: Population transfer in the Soviet Union may be classified into the following broad categories: deportations of “anti-Soviet” categories of population, often classified as “enemies of workers,” deportations of entire nationalities, labor force transfer, and organized migrations in opposite directions to fill the ethnically cleansed territories. In most cases their destinations were underpopulated remote areas (see Forced settlements in the Soviet Union). This includes deportations to the Soviet Union of non-Soviet citizens from countries outside the USSR. It has been estimated that, in their entirety, internal forced migrations affected some 6 million people.</li><li><b>USA, 2011:</b> Nearly 400,000 people were deported from the United States in the past<br> fiscal year, the largest number in the history of the U.S. Immigration<br> and Customs Enforcement agency, the government announced Tuesday. Overall in fiscal year 2011, immigration officials said, 396,906 individuals were removed.</br></br></li><li><b>USA, 1954:</b> Overall, there were 1,078,168 apprehensions made in the first year of<br> Operation Wetback, with 170,000 being captured from May to July 1954.</br></li></ol><p>It is simply false to claim that it is impossible to deport 5 million people from any country without a war. It can certainly be argued whether a mass repatriation policy is desirable or not, and it can be debated precisely how such a policy would be best and most civilly enacted, but it’s utterly ridiculous to claim that such a policy would necessarily lead to war when it has<i> never before done so</i> in all of military history. In general, mass deportations tend to be a postcursor to war rather than a precursor. Note that an immigration regime no stricter than that presently practiced by the current US ICE agency could send every Muslim in France back to the Dar al-Islam by 2025. That’s hardly a blueprint for Armageddon.</p><p>Of course, the first step in abandoning multiculturalism is to stop the bleeding. Which is to say, shut down all immigration immediately. Shut down all income redistribution from the native population to the non-native population. That alone will address one-third to one-half of the problem. Then the question of repatriation can be reasonably debated.</p><p>The alternative is not much of an option, as it should be abundantly clear by now that going further down the multiculturalism and diversity path will lead to civil war followed by vicious and violent ethnic cleansing. If you genuinely wish to avoid violence across the West, an approach that involves closing the borders, ending the income subsidies, and repatriation is the only civilized answer.</p></div>",
  "content_text": "Asked asked about the abandonment of multiculturalism:\nVox, your position seems to abandon multi-culturalism.. how do you envision this practically? France has 4-5 million Muslims, it’s not possible to deport them without a MAJOR war. The other alternative would be forceful conversions to Christianity/atheism… yeah.. be ready to strike France out of the map.\nThis is a false dichotomy. Of course it is possible to deport 5 million people. It’s neither difficult to accomplish nor likely to inspire war, let alone a MAJOR war. The oft-heard insistence that mass deportation is either a) impossible or b) necessarily violent is intrinsically ignorant. One has to literally know nothing about 20th century history in order to make the assertion, as one’s knowledge of the subject does not even rise to the level of Wikipedia.\nEastern Europe, 1945:\nGerman Reichsdeutsche and citizens of other European states who claimed German ethnicity were forced out of many Eastern Europe countries to Germany and Austria, and to Australia or the United States from there for many, during the later stages of World War II and the post-war period. The areas of expulsion included former eastern territories of Germany, which were transferred to Poland and the Soviet Union after the war, as well as areas annexed or occupied by Nazi Germany in pre-war Poland, Czechoslovakia, Hungary, Romania, northern Yugoslavia and other states of Central and Eastern Europe. By 1950, a total of approximately 12 million Germans had fled or been expelled from east-central Europe into the areas which would become post-war Germany and Allied-occupied Austria. Some sources put the total at 14 million, including migrants to Germany after 1950 and the children born to expelled parents. The largest numbers came from territories ultimately ceded to Poland and the Soviet Union (about 7 million), and from Czechoslovakia (about 3 million).\nSoviet Union, 1932\n: Population transfer in the Soviet Union may be classified into the following broad categories: deportations of “anti-Soviet” categories of population, often classified as “enemies of workers,” deportations of entire nationalities, labor force transfer, and organized migrations in opposite directions to fill the ethnically cleansed territories. In most cases their destinations were underpopulated remote areas (see Forced settlements in the Soviet Union). This includes deportations to the Soviet Union of non-Soviet citizens from countries outside the USSR. It has been estimated that, in their entirety, internal forced migrations affected some 6 million people.\nUSA, 2011:\nNearly 400,000 people were deported from the United States in the past\nfiscal year, the largest number in the history of the U.S. Immigration\nand Customs Enforcement agency, the government announced Tuesday. Overall in fiscal year 2011, immigration officials said, 396,906 individuals were removed.\nUSA, 1954:\nOverall, there were 1,078,168 apprehensions made in the first year of\nOperation Wetback, with 170,000 being captured from May to July 1954.\nIt is simply false to claim that it is impossible to deport 5 million people from any country without a war. It can certainly be argued whether a mass repatriation policy is desirable or not, and it can be debated precisely how such a policy would be best and most civilly enacted, but it’s utterly ridiculous to claim that such a policy would necessarily lead to war when it has\nnever before done so\nin all of military history. In general, mass deportations tend to be a postcursor to war rather than a precursor. Note that an immigration regime no stricter than that presently practiced by the current US ICE agency could send every Muslim in France back to the Dar al-Islam by 2025. That’s hardly a blueprint for Armageddon.\nOf course, the first step in abandoning multiculturalism is to stop the bleeding. Which is to say, shut down all immigration immediately. Shut down all income redistribution from the native population to the non-native population. That alone will address one-third to one-half of the problem. Then the question of repatriation can be reasonably debated.\nThe alternative is not much of an option, as it should be abundantly clear by now that going further down the multiculturalism and diversity path will lead to civil war followed by vicious and violent ethnic cleansing. If you genuinely wish to avoid violence across the West, an approach that involves closing the borders, ending the income subsidies, and repatriation is the only civilized answer.",
  "tags": [
    "Clash of Civilizations",
    "immigration",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-12T18:37:00+00:00"
}