{
  "url": "https://voxday.net/2015/01/16/maybe-theyre-just-not-very-good/",
  "scraped_at": "2025-12-16T12:41:54.846774",
  "title": "Maybe they’re just not very good",
  "date_display": "January 16, 2015",
  "date_iso": "2015-01-16T08:55:00+00:00",
  "date_from_url": "2015-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we are supposed to be very concerned that there are insufficient numbers of people of color <a href=\"http://www.hollywoodreporter.com/news/oscars-acting-nominees-all-white-764018\">nominated for awards</a> given in Hollywood:</p><blockquote class=\"tr_bq\"><p> For only the second time in nearly two decades, the 20 Academy Awards acting nominations went to a group made up entirely of white actors and actresses. Among the notable snubs was David Oyelowo, who received praise for his turn as the late Rev. Martin Luther King Jr. in Selma.</p><p>In 2011, the 20 nominees also were entirely white. Before that, one has to go back to 1998 for an all-white acting group.</p><p>The all-white nominees list comes at a time when Hollywood is fielding criticism for not doing enough to promote diversity in filmmaking. And just last month, Sony Pictures co-chairman Amy Pascal and producer Scott Rudin were apologizing for leaked emails that appeared to be racially insensitive. Rudin was nominated this morning for producing best picture nominee The Grand Budapest Hotel.</p></blockquote><p>What I find amusing about this is that while we’re informed that if right-wing writers aren’t nominated for awards, this is an indication of their lack of talent, but if Africans or women aren’t nominated for awards, this is an indication of racism and sexism.</p><p>Meanwhile, none of the science fiction SJWs celebrated the fact that a Hispanic man and a Indian were nominated for Hugo Awards last year. In fact, some of them are still openly decrying those nominations. The racists.</p><p>Another thing that is modestly amusing is the way in which the SJWs don’t understand the way in which a relative nonentity being given an affirmative action award when very young, then winning nothing afterwards, will be used as evidence against their accomplishments in the future. See the Sports Guy’s dissection of Wes Unsfeld’s MVP award in his rookie year, followed by a subsequent lack of honors, in <i>The Book of Basketball</i> for details.</p></div>",
  "content_text": "In which we are supposed to be very concerned that there are insufficient numbers of people of color\nnominated for awards\ngiven in Hollywood:\nFor only the second time in nearly two decades, the 20 Academy Awards acting nominations went to a group made up entirely of white actors and actresses. Among the notable snubs was David Oyelowo, who received praise for his turn as the late Rev. Martin Luther King Jr. in Selma.\nIn 2011, the 20 nominees also were entirely white. Before that, one has to go back to 1998 for an all-white acting group.\nThe all-white nominees list comes at a time when Hollywood is fielding criticism for not doing enough to promote diversity in filmmaking. And just last month, Sony Pictures co-chairman Amy Pascal and producer Scott Rudin were apologizing for leaked emails that appeared to be racially insensitive. Rudin was nominated this morning for producing best picture nominee The Grand Budapest Hotel.\nWhat I find amusing about this is that while we’re informed that if right-wing writers aren’t nominated for awards, this is an indication of their lack of talent, but if Africans or women aren’t nominated for awards, this is an indication of racism and sexism.\nMeanwhile, none of the science fiction SJWs celebrated the fact that a Hispanic man and a Indian were nominated for Hugo Awards last year. In fact, some of them are still openly decrying those nominations. The racists.\nAnother thing that is modestly amusing is the way in which the SJWs don’t understand the way in which a relative nonentity being given an affirmative action award when very young, then winning nothing afterwards, will be used as evidence against their accomplishments in the future. See the Sports Guy’s dissection of Wes Unsfeld’s MVP award in his rookie year, followed by a subsequent lack of honors, in\nThe Book of Basketball\nfor details.",
  "tags": [
    "Hugo Award",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-16T08:55:00+00:00"
}