{
  "url": "https://voxday.net/2015/01/11/more-than-books/",
  "scraped_at": "2025-12-16T12:41:16.380171",
  "title": "More than books",
  "date_display": "January 11, 2015",
  "date_iso": "2015-01-11T15:00:00+00:00",
  "date_from_url": "2015-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We have some new offerings <a href=\"http://www.castaliahouse.com/and-now-for-something-completely-different/\">in the Castalia House store</a>:</p><blockquote class=\"tr_bq\"><p> Castalia House is a publisher of books, but we are also a developer of games. So that is why we are pleased to be able to announce that the Castalia House bookstore will also be carrying digital versions of various games we consider to be of high quality and potential interest to our readers <a href=\"http://www.castaliahouse.com/downloads/category/games/\">in the new Games section</a>. The first games we are offering here are published by Castalia House author Ken Burnside of Ad Astra Games, who contributed “The Hot Equations: Thermodynamics and Military Science Fiction” to <i>Riding the Red Horse</i>. Ken is also Castalia’s newest blogger, where he’ll be focusing on various aspects of game development, from general analysis and history to in-depth design and mechanics.</p></blockquote><p>Our long-term goal for Castalia House is to become a major destination site for all high-quality Blue SF/F-related activity, including books, boardgames, and electronic games. This is another small step towards that objective.</p></div>",
  "content_text": "We have some new offerings\nin the Castalia House store\n:\nCastalia House is a publisher of books, but we are also a developer of games. So that is why we are pleased to be able to announce that the Castalia House bookstore will also be carrying digital versions of various games we consider to be of high quality and potential interest to our readers\nin the new Games section\n. The first games we are offering here are published by Castalia House author Ken Burnside of Ad Astra Games, who contributed “The Hot Equations: Thermodynamics and Military Science Fiction” to\nRiding the Red Horse\n. Ken is also Castalia’s newest blogger, where he’ll be focusing on various aspects of game development, from general analysis and history to in-depth design and mechanics.\nOur long-term goal for Castalia House is to become a major destination site for all high-quality Blue SF/F-related activity, including books, boardgames, and electronic games. This is another small step towards that objective.",
  "tags": [
    "Castalia House",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-11T15:00:00+00:00"
}