{
  "url": "https://voxday.net/2015/01/11/multiculturalisms-last-gasp/",
  "scraped_at": "2025-12-16T12:41:14.567568",
  "title": "Multiculturalism’s last gasp",
  "date_display": "January 11, 2015",
  "date_iso": "2015-01-11T13:01:00+00:00",
  "date_from_url": "2015-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://www.dailymail.co.uk/news/article-2905307/Charlie-Hebdo-march-Cameron-join-French-president-one-million-people-prepare-march-Paris.html\">march in Paris</a> today is a pathetic and pointless globalist fart in the wind of the resurgent nationalism that will scour Europe in the next decade:</p><blockquote class=\"tr_bq\"><p> One million people were today preparing to march through the streets of Paris in tribute to the 17 victims of massacre in the city. British Prime Minister David Cameron was one of approximately 40 world leaders scheduled to take part in the solidarity march in the French capital. In a show of support for the French people, Mr Cameron was to stand alongside French President Francois Hollande in sympathy for the victims executed by terrorists….</p><p>Security services across the world have reportedly received intelligence that more terror attacks are ‘highly likely’, as a ring of steel was placed around the French capital for today’s march. There are fears that Al Qaeda and Islamic State-linked terror cells will be activated as the city prepares to host the rally this afternoon.</p><p>By mid-morning, approximately 2,000 police officers and 1,400 soldiers were deployed across Paris in an atmosphere described by one officer on the scene as ‘extremely tense’. French Interior Minister Bernard Cazeneuve said ‘exceptional measures’ were being taken to try and prevent further attacks, including deploying snipers on roofs.</p></blockquote><p>This is nothing more than a futile demonstration meant to prop up the failing status quo, which is so fragile that a single jihadist could render it all moot in seconds today. None of this will end until the genie is again returned to the bottle, which is to say, until Islam has been forcibly expelled from the continent for the third time.</p><p>The multiculturalist position consists of lies stacked upon more lies. When Angela Merkel claims there is no place for anti-Muslim intolerance, she is attacking more than TWO-THIRDS of the German electorate that is not Muslim. In a November poll by the Bertelsmann Foundation, 61 percent of the German people said: “Islam has no place in the West”.</p><p>61 percent is not an outlier. That is the mainstream position. That is the will of the people. That was before PEGIDA, before the Charlie Hebdo massacre, and before the Jewish deli murders. It is probably over 70 percent by now. What there is no place for is traitorous, anti-democratic “leaders” like Merkel, Hollande, Cameron, and the other anti-nationalists who are marching in Paris today.</p><p>Islam is not compatible with the West. Islam is literally at war with the West, which is part of the Dar al-Harb, “the House of War”. As Mizanur Rahman has declared, Britain is the enemy of Islam. So is France. So is Germany. So is Italy. So is the United States of America. Samuel Huntington warned of this coming great clash of civilizations back in 1993. Enoch Powell warned of the rivers of blood that would flow if mass immigration from non-European countries was permitted back in 1968.</p><p>That long-predicted day has finally arrived. If the situation is not adequately addressed in the next decade, then the Rotherhams and Parises will eventually become Peshawars and <a href=\"http://edition.cnn.com/2015/01/09/africa/boko-haram-violence/\">Bagas</a>. Now the victims of Islam in the West are numbered in double-digits, eventually they will be numbered in the hundreds and the thousands, if the Reconquista 2.0 does not begin sooner rather than later.</p><p>Sooner or later, it will begin. All of this could have been easily prevented, but the Left preached its lies of open borders and immigration and tolerance and diversity, and the people of the West stupidly believed them. Some fools still believe them, although most who claim to do so primarily cling to them out of fear and desperate hope against hope. But prevention is no longer an option. The choice is now between Charlie Hebdo and Charlie Martel.</p><p>As for those who claim that we cannot hold all Muslims responsible for the actions of their military wing, I will remind them that the free people of the West had absolutely no problem holding all Germans responsible for the actions of a few National Socialists. I note that the French Prime Minister, Manuel Valls, has already declared that France is at war with “radical Islam”, even though the vast majority of radical Muslims did not kill anyone in Paris this week.</p><p>The fact is that Islam is already at war with the West, regardless of what its “moderate” Fifth Columnists falsely claim. It has always been at war with the West, it simply hasn’t always had the ability to effectively wage that war. But the West gave it that ability and now <a href=\"http://www.theguardian.com/world/2015/jan/09/muslims-europe-fear-escalation-anti-islamism-paris-attacks\">the people of the West are paying the price</a> through fear, crime, taxes, the loss of liberty, and blood.</p><blockquote class=\"tr_bq\"><p> “This bloodbath proves that those who laughed at or ignored the fears of so many people about a looming danger of Islamism were wrong,” said Alexander Gauland, a regional leader of AfD, which has its roots in the euro crisis and is currently riding at 25% in nationwide polls, on the day of the Charlie Hebdo attacks. “This gives new weight to Pegida demands.”</p><p>In France the leader of the far-right Front National, Marine Le Pen, went further. “We must be in a position to respond to the war that has been declared by Islamist fundamentalism,” she said after a meeting on Friday of party leaders called at the Élysée Palace by the president, François Hollande.</p><p>“I regret that word has not been uttered by [Hollande] nor other politicians. The first thing when one is fighting a war is to be able to know what we’re fighting. We’re fighting an ideology, Islamist fundamentalism. Not to say it is a proof of weakness.”</p></blockquote></div>",
  "content_text": "The\nmarch in Paris\ntoday is a pathetic and pointless globalist fart in the wind of the resurgent nationalism that will scour Europe in the next decade:\nOne million people were today preparing to march through the streets of Paris in tribute to the 17 victims of massacre in the city. British Prime Minister David Cameron was one of approximately 40 world leaders scheduled to take part in the solidarity march in the French capital. In a show of support for the French people, Mr Cameron was to stand alongside French President Francois Hollande in sympathy for the victims executed by terrorists….\nSecurity services across the world have reportedly received intelligence that more terror attacks are ‘highly likely’, as a ring of steel was placed around the French capital for today’s march. There are fears that Al Qaeda and Islamic State-linked terror cells will be activated as the city prepares to host the rally this afternoon.\nBy mid-morning, approximately 2,000 police officers and 1,400 soldiers were deployed across Paris in an atmosphere described by one officer on the scene as ‘extremely tense’. French Interior Minister Bernard Cazeneuve said ‘exceptional measures’ were being taken to try and prevent further attacks, including deploying snipers on roofs.\nThis is nothing more than a futile demonstration meant to prop up the failing status quo, which is so fragile that a single jihadist could render it all moot in seconds today. None of this will end until the genie is again returned to the bottle, which is to say, until Islam has been forcibly expelled from the continent for the third time.\nThe multiculturalist position consists of lies stacked upon more lies. When Angela Merkel claims there is no place for anti-Muslim intolerance, she is attacking more than TWO-THIRDS of the German electorate that is not Muslim. In a November poll by the Bertelsmann Foundation, 61 percent of the German people said: “Islam has no place in the West”.\n61 percent is not an outlier. That is the mainstream position. That is the will of the people. That was before PEGIDA, before the Charlie Hebdo massacre, and before the Jewish deli murders. It is probably over 70 percent by now. What there is no place for is traitorous, anti-democratic “leaders” like Merkel, Hollande, Cameron, and the other anti-nationalists who are marching in Paris today.\nIslam is not compatible with the West. Islam is literally at war with the West, which is part of the Dar al-Harb, “the House of War”. As Mizanur Rahman has declared, Britain is the enemy of Islam. So is France. So is Germany. So is Italy. So is the United States of America. Samuel Huntington warned of this coming great clash of civilizations back in 1993. Enoch Powell warned of the rivers of blood that would flow if mass immigration from non-European countries was permitted back in 1968.\nThat long-predicted day has finally arrived. If the situation is not adequately addressed in the next decade, then the Rotherhams and Parises will eventually become Peshawars and\nBagas\n. Now the victims of Islam in the West are numbered in double-digits, eventually they will be numbered in the hundreds and the thousands, if the Reconquista 2.0 does not begin sooner rather than later.\nSooner or later, it will begin. All of this could have been easily prevented, but the Left preached its lies of open borders and immigration and tolerance and diversity, and the people of the West stupidly believed them. Some fools still believe them, although most who claim to do so primarily cling to them out of fear and desperate hope against hope. But prevention is no longer an option. The choice is now between Charlie Hebdo and Charlie Martel.\nAs for those who claim that we cannot hold all Muslims responsible for the actions of their military wing, I will remind them that the free people of the West had absolutely no problem holding all Germans responsible for the actions of a few National Socialists. I note that the French Prime Minister, Manuel Valls, has already declared that France is at war with “radical Islam”, even though the vast majority of radical Muslims did not kill anyone in Paris this week.\nThe fact is that Islam is already at war with the West, regardless of what its “moderate” Fifth Columnists falsely claim. It has always been at war with the West, it simply hasn’t always had the ability to effectively wage that war. But the West gave it that ability and now\nthe people of the West are paying the price\nthrough fear, crime, taxes, the loss of liberty, and blood.\n“This bloodbath proves that those who laughed at or ignored the fears of so many people about a looming danger of Islamism were wrong,” said Alexander Gauland, a regional leader of AfD, which has its roots in the euro crisis and is currently riding at 25% in nationwide polls, on the day of the Charlie Hebdo attacks. “This gives new weight to Pegida demands.”\nIn France the leader of the far-right Front National, Marine Le Pen, went further. “We must be in a position to respond to the war that has been declared by Islamist fundamentalism,” she said after a meeting on Friday of party leaders called at the Élysée Palace by the president, François Hollande.\n“I regret that word has not been uttered by [Hollande] nor other politicians. The first thing when one is fighting a war is to be able to know what we’re fighting. We’re fighting an ideology, Islamist fundamentalism. Not to say it is a proof of weakness.”",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-11T13:01:00+00:00"
}