{
  "url": "https://voxday.net/2015/01/12/posted-without-commen/",
  "scraped_at": "2025-12-16T12:41:25.018777",
  "title": "Posted without comment",
  "date_display": "January 12, 2015",
  "date_iso": "2015-01-12T16:13:00+00:00",
  "date_from_url": "2015-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i><a href=\"http://cleveland.cbslocal.com/2015/01/11/mental-health-study-men-who-post-selfie-show-psychopathic-tendencies/\"><b>Study: Men Who Post Selfies Show Psychopathic Tendencies</b></a></i></p><p><i>Men who regularly posted photos of themselves online scored higher on a measure for narcissism and psychopathy…. The study also found that men who edited their pictures before posting<br> also scored higher on the scales of narcissism and self-objectification.</br></i></p><p>For no particular reason, <a href=\"http://www.milobookclub.com/2015/01/03/john-scalzi-is-malignant-narcissis/\">you understand</a>.<i> </i>And in other SFWA-related news, it appears that the services of the Toad of Tor <a href=\"http://writeabsolutereviews.blogspot.ch/2015/01/teresa-nielsen-hayden-fired-from-tor.html\">may no longer be required</a> by Tor Books:</p><blockquote class=\"tr_bq\"><p> Teresa Nielsen Hayden, aka the repugnant and infamous cyberbully <a href=\"http://writeabsolutereviews.blogspot.ch/2014/07/teresa-nielsen-hayden-aka-hapisofi.html\">“Hapisofi” on Absolute Write</a>, has been officially fired from the Tor staff. We received the following note from someone connected to the publisher (who must remain anonymous to prevent retaliation by Nielsen’s husband Patrick who is still a big shot at Tor Books and who has supported his wife regardless of her vitriolic and unprovoked assaults on writers, presses, and organizations using her anonymous ID on Absolute Write):</p><p>Teresa Nielsen Hayden is now officially off the Tor staff page. She has been removed permanently. A source close to the staff reports that the sheer amount of negative information about her on the web was the reason.</p></blockquote><p>There is, however, some reason to doubt the accuracy of this report, given that the link is to the Tor.com staff page, not the Tor Books staff page. The two are related, but distinct corporate entities. I will update this once news of the Toad’s firing is either publicly confirmed or confirmed to be false.</p></div>",
  "content_text": "Study: Men Who Post Selfies Show Psychopathic Tendencies\nMen who regularly posted photos of themselves online scored higher on a measure for narcissism and psychopathy…. The study also found that men who edited their pictures before posting\nalso scored higher on the scales of narcissism and self-objectification.\nFor no particular reason,\nyou understand\n.\nAnd in other SFWA-related news, it appears that the services of the Toad of Tor\nmay no longer be required\nby Tor Books:\nTeresa Nielsen Hayden, aka the repugnant and infamous cyberbully\n“Hapisofi” on Absolute Write\n, has been officially fired from the Tor staff. We received the following note from someone connected to the publisher (who must remain anonymous to prevent retaliation by Nielsen’s husband Patrick who is still a big shot at Tor Books and who has supported his wife regardless of her vitriolic and unprovoked assaults on writers, presses, and organizations using her anonymous ID on Absolute Write):\nTeresa Nielsen Hayden is now officially off the Tor staff page. She has been removed permanently. A source close to the staff reports that the sheer amount of negative information about her on the web was the reason.\nThere is, however, some reason to doubt the accuracy of this report, given that the link is to the Tor.com staff page, not the Tor Books staff page. The two are related, but distinct corporate entities. I will update this once news of the Toad’s firing is either publicly confirmed or confirmed to be false.",
  "tags": [
    "McRapey",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-12T16:13:00+00:00"
}