{
  "url": "https://voxday.net/2015/01/18/post-intentional-problems/",
  "scraped_at": "2025-12-16T12:42:07.616728",
  "title": "Post-intentional problems",
  "date_display": "January 18, 2015",
  "date_iso": "2015-01-18T10:46:00+00:00",
  "date_from_url": "2015-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Edward Feser <a href=\"http://edwardfeser.blogspot.com/2015/01/post-intentional-depression.html\">addresses R. Scott Bakker’s proselytization for post-intentionality</a>:</p><blockquote class=\"tr_bq\"><p> Bakker tells us that, though he once found the objections to eliminativism compelling, he now takes the post-intentional “worst case scenario” to be a “live possibility” worthy of exploration.  It seems to me, though, that he doesn’t really say anything new by way of making eliminativism plausible, at least not in the present article.  Here I want to comment on three issues raised in his essay.  The first is the reason he gives for thinking that the incoherence problem facing eliminativism isn’t serious.  The second is the question of why, as Bakker puts it, we are “so convinced that we are the sole exception, the one domain that can be theoretically cognized absent the prostheses of science.”  The third is the question of why more people haven’t considered “what… a post-intentional future [would] look like,” a fact that “amazes” Bakker.</p><p><i>Still incoherent after all these years</i></p><p>Let’s take these in order.  In footnote 3 of his article, Bakker writes:</p><p><i>Using intentional concepts does not entail commitment to intentionalism, any more than using capital entails a commitment to capitalism.  Tu quoque arguments simply beg the question, assume the truth of the very intentional assumptions under question to argue the incoherence of questioning them.  If you define your explanation into the phenomena we’re attempting to explain, then alternative explanations will appear to beg your explanation to the extent the phenomena play some functional role in the process of explanation more generally.  Despite the obvious circularity of this tactic, it remains the weapon of choice for great number of intentional philosophers.</i></p><p>There are a couple of urban legends about the incoherence objection that eliminativists like to peddle, and Bakker essentially repeats them here.  The first urban legend is the claim that to raise the incoherence objection is to accuse the eliminativist of an obvious self-contradiction, like saying “I believe that there are no beliefs.”  The eliminativist then responds that the objection is as puerile as accusing a heliocentrist of self-contradiction when he says “The sun rose today at 6:59 AM.”  Obviously the heliocentrist is just speaking loosely.  He isn’t really saying that the sun moves relative to the earth.  Similarly, when an eliminativist says at lunchtime “I believe I’ll have a ham sandwich,” he isn’t really committing himself to the existence of beliefs or the like.</p><p>But the eliminativist is attacking a straw man.  Proponents of the incoherence objection are well aware that eliminativists can easily avoid saying obviously self-contradictory things like “I believe that there are no beliefs,” and can also go a long way in avoiding certain specific intentional terms like “believe,” “think,” etc.  That is simply not what is at issue.  What is at issue is whether an across-the-board eliminativism is coherent, whether the eliminativist can in principle avoid all intentional notions.  The proponent of the incoherence objection says that this is not possible, and that analogies with heliocentrism and the like therefore fail.</p><p>After all, the heliocentrist can easily state his position without making any explicit or implicit reference to the sun moving relative to the earth.  If he needs to, he can say what he wants to say with sentences like “The sun rose today at 6:59 AM” in a more cumbersome way that makes no reference to the sun rising.  Similarly (and to take Bakker’s own example) an anti-capitalist can easily describe a society in which capital does not exist (e.g. a hunter-gatherer society).  But it is, to say the least, by no means clear how the eliminativist can state his position in a way that does not entail that at least some intentional notions track reality.  For the eliminativist claims that commonsense intentional psychology is false and illusory; he claims that eliminativism is evidentially supported by or even entailed by science; he proposes alternative theories and models of human nature; and so forth.  Even if the eliminativist can drop reference to “beliefs” and “thoughts,” he still typically makes use of “truth,” “falsehood,” “theory,” “model,” “implication,” “entailment,” “cognitive,” “assertion,” “evidence,” “observation,” etc.  Every one of these notions is also intentional.  Every one of them therefore has to be abandoned by a consistent eliminativist.  (As Hilary Putnam pointed out decades ago, a consistent eliminativist has to give up “folk logic” as well as “folk psychology.”)</p><p>To compare the eliminativist to the heliocentrist who talks about the sunrise or the anti-capitalist who uses capital is, if left at that, mere hand waving.  For whether these analogies are good ones is precisely what is at issue.</p></blockquote><p>I am intrinsically dubious about Bakker’s ability to construct anything coherent on much simpler grounds. The fact that he could not, by his own admission, understand the metaphor when I pointed out how the rejection of traditional morality by modern SF/F writers significantly reduced their conceptual color palette and left them painting in shades of grey did not testify well concerning his intelligence.</p><p>John C. Wright had the likes of Bakker pegged when he wrote: <i>“They think they are smarter than us. These undereducated boobs who cannot follow a syllogism of three steps, who do not speak a word of Greek or Latin, who do not know the difference between Arianism and Aryanism, who have never read ORIGIN OF SPECIES or DAS KAPITAL or THE REPUBLIC and who do not even know the intellectual parentage of all their ideas, these vaunting cretins whose arguments consist of nothing but tiresome talking points recited by rote and flaccid ad hominem, whose opinions are based on fashion, they, of all people, think they are smarter than the rest of the world.”</i></p><p>Now, Bakker is far from the worst of the sort; he is at least somewhat conversant with some of the books written on the subject. However, as Feser points out, he’s obviously not sufficiently conversant with the relevant material to understand that he is treading ground that has been trod before.<i></i><br> <i><br/></i><br> This exchange in the comments was particularly amusing:<br> <i><br/></i><br> Bakker: “How does asserting that I’m presupposing one of the thousands of<br> intentionalist interpretations out there do anything more than beg this<br> question?”</br></br></br></br></br></br></p><p>Brandon: “This doesn’t seem to be a correct use of ‘begging the question’; it’s<br> not presupposing a conclusion to point out that you yourself are<br> presupposing the conclusion and don’t seem to have any rational way of<br> not presupposing it.”</br></br></br></p><p>Scott: “Are you really entitled, on an eliminativist view, to talk about<br> “begging the question”? How might you give an account of that logical<br> fallacy with no reference to intentionality? I don’t think it’s<br> possible, but the point is that even eliminativists acknowledge that it<br> hasn’t been done.”</br></br></br></br></p><p><a href=\"http://edwardfeser.blogspot.com/2015/01/post-intentional-depression.html?showComment=1421198176883#c7873339741497488449\">Feser:</a> “I don’t know why you keep saying that the incoherence objection begs the<br> question.  It does not beg the question.  Here’s one way to summarize<br> the objection:</br></br></p><p>1. Eliminativists state their position using expressions like “truth,” “falsehood,” “theory,” “illusion,” etc.</p><p>2.<br> They can do so coherently only if either (a) they accept that<br> intentionality is real, or (b) they provide some alternative, thoroughly<br> non-intentional way of construing such expressions.</br></br></br></p><p>3. But eliminativists reject the claim that intentionality is real, so option (a) is out.</p><p>4.<br> And they have not provided any alternative, thoroughly non-intentional<br> way of construing such expressions, so they have not (successfully)<br> taken option (b).</br></br></br></p><p>5. So eliminativists have not shown how their position is coherent.”</p><p>If you find the whole thing difficult to follow, Anonymous provides a helpful summary:</p><blockquote class=\"tr_bq\"><p> <i>What, precisely, do eliminative materialists think they’ve discovered in science that shows that intentionality doesn’t exist?</i></p><p>They<br> failed to discover something that’s been intentionally excluded<br> from science to begin with. This, they believe, is great evidence that<br> the thing they’ve excluded doesn’t exist.</br></br></br></p></blockquote><p>And thus we see, yet again, that it is his lack of historical knowledge that bites the atheist in the ass. They are, as Wright observes, boobs who cannot follow, or find the error, in a syllogism of three steps.</p><ol><li>If evidence for X cannot be seen or otherwise observed, X does not exist.</li><li>I looked in my closet and did not see or observe any evidence of zebras.</li><li>Therefore, zebras do not exist. </li></ol><p>I find it both amazing and amusing how so many atheist philosophies, no matter their starting points or authors, wind up chasing their own tails in precisely the same manner. They always wind up concluding that neither the individual nor his actions matter in the slightest. Taken as a whole, they point to a particular conclusion: without God, there is no Man.</p><ol></ol></div>",
  "content_text": "Edward Feser\naddresses R. Scott Bakker’s proselytization for post-intentionality\n:\nBakker tells us that, though he once found the objections to eliminativism compelling, he now takes the post-intentional “worst case scenario” to be a “live possibility” worthy of exploration.  It seems to me, though, that he doesn’t really say anything new by way of making eliminativism plausible, at least not in the present article.  Here I want to comment on three issues raised in his essay.  The first is the reason he gives for thinking that the incoherence problem facing eliminativism isn’t serious.  The second is the question of why, as Bakker puts it, we are “so convinced that we are the sole exception, the one domain that can be theoretically cognized absent the prostheses of science.”  The third is the question of why more people haven’t considered “what… a post-intentional future [would] look like,” a fact that “amazes” Bakker.\nStill incoherent after all these years\nLet’s take these in order.  In footnote 3 of his article, Bakker writes:\nUsing intentional concepts does not entail commitment to intentionalism, any more than using capital entails a commitment to capitalism.  Tu quoque arguments simply beg the question, assume the truth of the very intentional assumptions under question to argue the incoherence of questioning them.  If you define your explanation into the phenomena we’re attempting to explain, then alternative explanations will appear to beg your explanation to the extent the phenomena play some functional role in the process of explanation more generally.  Despite the obvious circularity of this tactic, it remains the weapon of choice for great number of intentional philosophers.\nThere are a couple of urban legends about the incoherence objection that eliminativists like to peddle, and Bakker essentially repeats them here.  The first urban legend is the claim that to raise the incoherence objection is to accuse the eliminativist of an obvious self-contradiction, like saying “I believe that there are no beliefs.”  The eliminativist then responds that the objection is as puerile as accusing a heliocentrist of self-contradiction when he says “The sun rose today at 6:59 AM.”  Obviously the heliocentrist is just speaking loosely.  He isn’t really saying that the sun moves relative to the earth.  Similarly, when an eliminativist says at lunchtime “I believe I’ll have a ham sandwich,” he isn’t really committing himself to the existence of beliefs or the like.\nBut the eliminativist is attacking a straw man.  Proponents of the incoherence objection are well aware that eliminativists can easily avoid saying obviously self-contradictory things like “I believe that there are no beliefs,” and can also go a long way in avoiding certain specific intentional terms like “believe,” “think,” etc.  That is simply not what is at issue.  What is at issue is whether an across-the-board eliminativism is coherent, whether the eliminativist can in principle avoid all intentional notions.  The proponent of the incoherence objection says that this is not possible, and that analogies with heliocentrism and the like therefore fail.\nAfter all, the heliocentrist can easily state his position without making any explicit or implicit reference to the sun moving relative to the earth.  If he needs to, he can say what he wants to say with sentences like “The sun rose today at 6:59 AM” in a more cumbersome way that makes no reference to the sun rising.  Similarly (and to take Bakker’s own example) an anti-capitalist can easily describe a society in which capital does not exist (e.g. a hunter-gatherer society).  But it is, to say the least, by no means clear how the eliminativist can state his position in a way that does not entail that at least some intentional notions track reality.  For the eliminativist claims that commonsense intentional psychology is false and illusory; he claims that eliminativism is evidentially supported by or even entailed by science; he proposes alternative theories and models of human nature; and so forth.  Even if the eliminativist can drop reference to “beliefs” and “thoughts,” he still typically makes use of “truth,” “falsehood,” “theory,” “model,” “implication,” “entailment,” “cognitive,” “assertion,” “evidence,” “observation,” etc.  Every one of these notions is also intentional.  Every one of them therefore has to be abandoned by a consistent eliminativist.  (As Hilary Putnam pointed out decades ago, a consistent eliminativist has to give up “folk logic” as well as “folk psychology.”)\nTo compare the eliminativist to the heliocentrist who talks about the sunrise or the anti-capitalist who uses capital is, if left at that, mere hand waving.  For whether these analogies are good ones is precisely what is at issue.\nI am intrinsically dubious about Bakker’s ability to construct anything coherent on much simpler grounds. The fact that he could not, by his own admission, understand the metaphor when I pointed out how the rejection of traditional morality by modern SF/F writers significantly reduced their conceptual color palette and left them painting in shades of grey did not testify well concerning his intelligence.\nJohn C. Wright had the likes of Bakker pegged when he wrote:\n“They think they are smarter than us. These undereducated boobs who cannot follow a syllogism of three steps, who do not speak a word of Greek or Latin, who do not know the difference between Arianism and Aryanism, who have never read ORIGIN OF SPECIES or DAS KAPITAL or THE REPUBLIC and who do not even know the intellectual parentage of all their ideas, these vaunting cretins whose arguments consist of nothing but tiresome talking points recited by rote and flaccid ad hominem, whose opinions are based on fashion, they, of all people, think they are smarter than the rest of the world.”\nNow, Bakker is far from the worst of the sort; he is at least somewhat conversant with some of the books written on the subject. However, as Feser points out, he’s obviously not sufficiently conversant with the relevant material to understand that he is treading ground that has been trod before.\nThis exchange in the comments was particularly amusing:\nBakker: “How does asserting that I’m presupposing one of the thousands of\nintentionalist interpretations out there do anything more than beg this\nquestion?”\nBrandon: “This doesn’t seem to be a correct use of ‘begging the question’; it’s\nnot presupposing a conclusion to point out that you yourself are\npresupposing the conclusion and don’t seem to have any rational way of\nnot presupposing it.”\nScott: “Are you really entitled, on an eliminativist view, to talk about\n“begging the question”? How might you give an account of that logical\nfallacy with no reference to intentionality? I don’t think it’s\npossible, but the point is that even eliminativists acknowledge that it\nhasn’t been done.”\nFeser:\n“I don’t know why you keep saying that the incoherence objection begs the\nquestion.  It does not beg the question.  Here’s one way to summarize\nthe objection:\n1. Eliminativists state their position using expressions like “truth,” “falsehood,” “theory,” “illusion,” etc.\n2.\nThey can do so coherently only if either (a) they accept that\nintentionality is real, or (b) they provide some alternative, thoroughly\nnon-intentional way of construing such expressions.\n3. But eliminativists reject the claim that intentionality is real, so option (a) is out.\n4.\nAnd they have not provided any alternative, thoroughly non-intentional\nway of construing such expressions, so they have not (successfully)\ntaken option (b).\n5. So eliminativists have not shown how their position is coherent.”\nIf you find the whole thing difficult to follow, Anonymous provides a helpful summary:\nWhat, precisely, do eliminative materialists think they’ve discovered in science that shows that intentionality doesn’t exist?\nThey\nfailed to discover something that’s been intentionally excluded\nfrom science to begin with. This, they believe, is great evidence that\nthe thing they’ve excluded doesn’t exist.\nAnd thus we see, yet again, that it is his lack of historical knowledge that bites the atheist in the ass. They are, as Wright observes, boobs who cannot follow, or find the error, in a syllogism of three steps.\nIf evidence for X cannot be seen or otherwise observed, X does not exist.\nI looked in my closet and did not see or observe any evidence of zebras.\nTherefore, zebras do not exist.\nI find it both amazing and amusing how so many atheist philosophies, no matter their starting points or authors, wind up chasing their own tails in precisely the same manner. They always wind up concluding that neither the individual nor his actions matter in the slightest. Taken as a whole, they point to a particular conclusion: without God, there is no Man.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-18T10:46:00+00:00"
}