{
  "url": "https://voxday.net/2015/01/31/republicans-have-clever-new-plan-for/",
  "scraped_at": "2025-12-16T12:43:44.175585",
  "title": "Republicans have clever new plan for failure",
  "date_display": "January 31, 2015",
  "date_iso": "2015-01-31T09:34:00+00:00",
  "date_from_url": "2015-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The establishment’s “electable” candidate in 2016 <a href=\"http://www.nytimes.com/2015/01/31/us/mitt-romney-2016-presidential-election.html?_r=0\">will not be Mitt Romney</a>:</p><blockquote class=\"tr_bq\"><p> In a talk with his eldest son, Tagg, between runs down the mountain on Monday, Mr. Romney, 67, said he had all but decided against a third bid for the White House. The conversation, according to a person familiar with it, came after days of increasingly gloomy news reached the Romney family.</p><p>Donors who supported him last time refused to commit to his campaign. Key operatives were signing up with former Gov. Jeb Bush of Florida. The Republican establishment that lifted Mr. Romney to the nomination in 2012 in the face of scrappy opposition had moved on.</p><p>The news on Friday that Mr. Romney would opt out of the race revealed as much about the party in 2015 as it did about the former Massachusetts governor’s weaknesses as a candidate. Republican leaders, especially the party’s wealthiest donors, are in an impatient and determined mood. They are eager to turn to a new face they believe can defeat what they anticipate will be a strong, well-funded Democratic opponent, Hillary Rodham Clinton….</p><div class=\"story-body-text story-content\" data-para-count=\"604\" data-total-count=\"2973\" id=\"story-continues-5\" itemprop=\"articleBody\"> The<br> campaign to deny Mr. Romney another chance began almost immediately<br> after he mused to donors at a Friday get-together in New York City on<br> Jan. 9 that he was open to the possibility of another run. By that<br> Sunday afternoon, William Oberndorf, a prominent California investor who<br> supported Mr. Romney in both of his previous presidential campaigns,<br> had emailed a group of 52 powerful Republicans, including former<br> Secretary of State George Shultz, the investor Charles Schwab, Gov.<br> Bruce Rauner of Illinois and the Michigan billionaire Betsy DeVos with a<br> blunt message: we need to support someone else.</br></br></br></br></br></br></br></br></br></div><div class=\"story-body-text story-content\" data-para-count=\"604\" data-total-count=\"2973\" id=\"story-continues-5\" itemprop=\"articleBody\"></div><div class=\"story-body-text story-content\" data-para-count=\"304\" data-total-count=\"3277\" itemprop=\"articleBody\"> Mr.<br> Oberndorf wrote: “We are fortunate in Jeb Bush to have an extremely<br> talented and able candidate who, I believe, has a far better prospect of<br> winning a general election than Mitt. Moreover, Mitt has now run twice<br> and has had his chance to be president. It is now time to cede the field<br> to others.”</br></br></br></br></br></div><p></p><div class=\"story-body-text story-content\" data-para-count=\"298\" data-total-count=\"3817\" itemprop=\"articleBody\"> Mr.<br> Oberndorf requested that those on the email contact Mr. Romney’s<br> longtime finance chief, Spencer Zwick, to make it clear that they did<br> not want Mr. Romney to run again. And many of them did, Mr. Oberndorf<br> said in an interview on Friday. “Of<br> everybody I contacted, I only heard from one person who thought Mitt<br> should give it another shot,” said Mr. Oberndorf. In the weeks after he<br> expressed renewed interest in running, Mr. Romney contacted some of his<br> most loyal supporters. But often, he found Mr. Bush had gotten there<br> already.</br></br></br></br></br></br></br></br></br></div></blockquote><p>It’s amazing, though not entirely surprising, that the bi-factional ruling party wants to set up another choice between Bush and Clinton. It’s as if they can’t even bother pretending that Americans live in a democracy anymore, never mind a republic. It increasingly reminds me of the arrogance of the EU establishment, which is now openly anti-democratic.</p><p>Cicero was right. It’s not dictatorship that follows democracy, but aristocracy.</p><p>And the cluelessness of the arrogance is downright amusing. On what planet did Romney think anyone actually wanted him to be president? Then again, on what planet does anyone outside the Republican establishment want another Bush, much less one who is an anti-American open borders lunatic.</p></div>",
  "content_text": "The establishment’s “electable” candidate in 2016\nwill not be Mitt Romney\n:\nIn a talk with his eldest son, Tagg, between runs down the mountain on Monday, Mr. Romney, 67, said he had all but decided against a third bid for the White House. The conversation, according to a person familiar with it, came after days of increasingly gloomy news reached the Romney family.\nDonors who supported him last time refused to commit to his campaign. Key operatives were signing up with former Gov. Jeb Bush of Florida. The Republican establishment that lifted Mr. Romney to the nomination in 2012 in the face of scrappy opposition had moved on.\nThe news on Friday that Mr. Romney would opt out of the race revealed as much about the party in 2015 as it did about the former Massachusetts governor’s weaknesses as a candidate. Republican leaders, especially the party’s wealthiest donors, are in an impatient and determined mood. They are eager to turn to a new face they believe can defeat what they anticipate will be a strong, well-funded Democratic opponent, Hillary Rodham Clinton….\nThe\ncampaign to deny Mr. Romney another chance began almost immediately\nafter he mused to donors at a Friday get-together in New York City on\nJan. 9 that he was open to the possibility of another run. By that\nSunday afternoon, William Oberndorf, a prominent California investor who\nsupported Mr. Romney in both of his previous presidential campaigns,\nhad emailed a group of 52 powerful Republicans, including former\nSecretary of State George Shultz, the investor Charles Schwab, Gov.\nBruce Rauner of Illinois and the Michigan billionaire Betsy DeVos with a\nblunt message: we need to support someone else.\nMr.\nOberndorf wrote: “We are fortunate in Jeb Bush to have an extremely\ntalented and able candidate who, I believe, has a far better prospect of\nwinning a general election than Mitt. Moreover, Mitt has now run twice\nand has had his chance to be president. It is now time to cede the field\nto others.”\nMr.\nOberndorf requested that those on the email contact Mr. Romney’s\nlongtime finance chief, Spencer Zwick, to make it clear that they did\nnot want Mr. Romney to run again. And many of them did, Mr. Oberndorf\nsaid in an interview on Friday. “Of\neverybody I contacted, I only heard from one person who thought Mitt\nshould give it another shot,” said Mr. Oberndorf. In the weeks after he\nexpressed renewed interest in running, Mr. Romney contacted some of his\nmost loyal supporters. But often, he found Mr. Bush had gotten there\nalready.\nIt’s amazing, though not entirely surprising, that the bi-factional ruling party wants to set up another choice between Bush and Clinton. It’s as if they can’t even bother pretending that Americans live in a democracy anymore, never mind a republic. It increasingly reminds me of the arrogance of the EU establishment, which is now openly anti-democratic.\nCicero was right. It’s not dictatorship that follows democracy, but aristocracy.\nAnd the cluelessness of the arrogance is downright amusing. On what planet did Romney think anyone actually wanted him to be president? Then again, on what planet does anyone outside the Republican establishment want another Bush, much less one who is an anti-American open borders lunatic.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-31T09:34:00+00:00"
}