{
  "url": "https://voxday.net/2015/01/24/rumblings-of-tech-war/",
  "scraped_at": "2025-12-16T12:42:52.664967",
  "title": "Rumblings of tech war",
  "date_display": "January 24, 2015",
  "date_iso": "2015-01-24T13:30:00+00:00",
  "date_from_url": "2015-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This article is amusingly incoherent concerning <a href=\"http://www.wsj.com/articles/europe-pulls-welcome-mat-for-u-s-tech-companies-1421963904\">the growing fears of US technology companies</a> concerning Europe:</p><blockquote class=\"tr_bq\"><p> One message so far from the corridors around the World Economic Forum<br> in Davos: U.S. technology companies are very worried about the backlash<br> they are now facing in Europe. From their standpoint, Europe<br> risks shooting itself in the foot by rejecting the cutting-edge<br> technologies they have brought to the continent. But they would say that, wouldn’t they? Look at it from the European point of view.</br></br></br></br></p><p> Europe<br> once led the world in mobile technology: The Global System for Mobile<br> Communications, developed in Europe, became the global standard. But<br> that was a long time ago. Now, most innovation in information and<br> communications technology comes in waves from across the Atlantic.</br></br></br></br></p><p>With America’s vibrant capital markets giving them billions of dollars in risk capital, they can absorb the successful European tech enterprises—look at Skype Technologies, swallowed by Microsoft Corp.</p><p>These U.S. companies— Google, Facebook , Amazon and others—are disrupting industry after industry. Publishing, telecoms and retailing have already been convulsed. Now, the companies, and Google in particular, are turning their gaze from consumer-oriented to business-oriented platforms.</p><p>That is a big deal for growth-starved Europe and for its biggest economy, Germany, which leads the world in high-quality engineering. Europe’s car industry is a leading employer, its suppliers reach through the continent, and it is one of the biggest spenders on research and development. Germany’s machine-tool manufacturers are deservedly renowned.</p><p>But much of the future profit for these industries won’t flow from punching metal but from the networks they will use to manage information—for example, taking the cars where they want to go, catering to passengers with entertainment and retail experiences as they travel—and it’s a strategic question who owns them.</p></blockquote><p>Isn’t it good of those US technology executives to worry so much about Europe shooting themselves in the foot? They must have tremendous empathy! Or could it be that they are not telling the truth and it is something else that worries them?</p><p>Such as, perhaps, the possibility that they will be legally locked out of Europe due to their enabling of US goverment espionage and their continued disinclination to show any respect for various European privacy laws?</p></div>",
  "content_text": "This article is amusingly incoherent concerning\nthe growing fears of US technology companies\nconcerning Europe:\nOne message so far from the corridors around the World Economic Forum\nin Davos: U.S. technology companies are very worried about the backlash\nthey are now facing in Europe. From their standpoint, Europe\nrisks shooting itself in the foot by rejecting the cutting-edge\ntechnologies they have brought to the continent. But they would say that, wouldn’t they? Look at it from the European point of view.\nEurope\nonce led the world in mobile technology: The Global System for Mobile\nCommunications, developed in Europe, became the global standard. But\nthat was a long time ago. Now, most innovation in information and\ncommunications technology comes in waves from across the Atlantic.\nWith America’s vibrant capital markets giving them billions of dollars in risk capital, they can absorb the successful European tech enterprises—look at Skype Technologies, swallowed by Microsoft Corp.\nThese U.S. companies— Google, Facebook , Amazon and others—are disrupting industry after industry. Publishing, telecoms and retailing have already been convulsed. Now, the companies, and Google in particular, are turning their gaze from consumer-oriented to business-oriented platforms.\nThat is a big deal for growth-starved Europe and for its biggest economy, Germany, which leads the world in high-quality engineering. Europe’s car industry is a leading employer, its suppliers reach through the continent, and it is one of the biggest spenders on research and development. Germany’s machine-tool manufacturers are deservedly renowned.\nBut much of the future profit for these industries won’t flow from punching metal but from the networks they will use to manage information—for example, taking the cars where they want to go, catering to passengers with entertainment and retail experiences as they travel—and it’s a strategic question who owns them.\nIsn’t it good of those US technology executives to worry so much about Europe shooting themselves in the foot? They must have tremendous empathy! Or could it be that they are not telling the truth and it is something else that worries them?\nSuch as, perhaps, the possibility that they will be legally locked out of Europe due to their enabling of US goverment espionage and their continued disinclination to show any respect for various European privacy laws?",
  "tags": [
    "corpocracy",
    "EU",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-24T13:30:00+00:00"
}