{
  "url": "https://voxday.net/2015/01/30/sad-puppies-last-day/",
  "scraped_at": "2025-12-16T12:43:36.231912",
  "title": "Sad Puppies: the last day",
  "date_display": "January 30, 2015",
  "date_iso": "2015-01-30T13:00:00+00:00",
  "date_from_url": "2015-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://larrycorreia.files.wordpress.com/2015/01/sad_puppies_3_patch.jpg?w=266&amp;h=300\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://larrycorreia.files.wordpress.com/2015/01/sad_puppies_3_patch.jpg?w=266&amp;h=300\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://larrycorreia.files.wordpress.com/2015/01/sad_puppies_3_patch.jpg?w=266&amp;h=300\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>These are the final hours <a href=\"https://sasquan.swoc.us/sasquan/reg.php\">to register for Sad Puppies 3: The Ensaddening</a>. January 31 is the last day to register as a supporting member of WorldCon. Here is why you might want to consider doing so even if the idea of spending $40 to poke a sharp stick in the collective eyes of the SJWs who are doing their level best to destroy the science fiction and fantasy literature you love for the next two years isn’t enough in its own right.</p><ol><li>Hugo Awards are worth around $13,000 to an SJW, according to one Kameron Hurley. For a fraction of one percent of that, you can deny multiple SJWs their ability to commit Pink SF and force them to spend their time delivering pizzas instead. (Have no fear, the awards are worth absolutely nothing to us in financial terms, because the gatekeepers who value them for marketing purposes won’t publish even national bestselling authors of the Right; they are far more driven by intersectional equalitarian ideology than by evil capitalist business sense.)</li><li>Short of wiping their hard drives and deleting their current manuscripts, there is literally nothing you can do that upsets the SJWs more than putting the sort of right-wing writer they have spent two decades working very hard to suppress in the limelight that they seek for themselves.</li><li>The more obvious our numbers, the more it encourages the moderate elements at the major publishers to rein in the left-wing inmates who have taken over the SF/F asylum. The Toad of Tor <a href=\"http://writeabsolutereviews.blogspot.ch/2015/01/teresa-nielsen-hayden-fired-from-tor.html\">is no longer at Tor</a> and it is unlikely that her dismissal would have taken place without the fact that people were finally standing up to her crude bullying, causing her to double-down and attract the attention of higher-ups at the publisher. Tor’s German owners don’t give a damn about politics or the imperative of strong female characters and they’re only beginning to understand how the SJWs running their subsidiaries have let them down.</li><li>It’s very good value for the money. Last year, the $20 spent on a supporting membership got you the complete Wheel of Time series, the complete Grimnoire Chronicles, and sundry other works as well. Granted, it also got you a fair amount of Pink sludge, but no one is going to make you download it. The more of you that register, the more likely it is that there will be great stuff that you want to read as part of the Hugo Packet.</li><li>Sarah Hoyt <a href=\"http://accordingtohoyt.com/2015/01/29/dilettantes/\">says</a>: “I suggest we kick them while they’re down and make them fight for the<br> awards and prestige they crave. Also, that we point at them and make<br> duck noises.”</br></br></li><li>We have the momentum. Last year, the Dread Ilk showed up in respectable force without me doing anything more than putting up a single post with a modified version of Sad Puppies 2. This year, we’re locked, loaded, and ready to be all that we can be. Trust me on that. About which more soon….</li></ol><p>A supporting membership is $40 and gives you the right to participate this year and next year, as well as receive the material in the Hugo Packets both years. So heed the words of Wendell, our fine spokesmanatee, and <a href=\"https://sasquan.swoc.us/sasquan/reg.php\">end puppy-related sadness</a> now!</p><p>Note to the Dread Ilk already on board: keep your powder dry. Registration is all that is necessary or desirable right now. The next step is in process.</p></div>",
  "content_text": "These are the final hours\nto register for Sad Puppies 3: The Ensaddening\n. January 31 is the last day to register as a supporting member of WorldCon. Here is why you might want to consider doing so even if the idea of spending $40 to poke a sharp stick in the collective eyes of the SJWs who are doing their level best to destroy the science fiction and fantasy literature you love for the next two years isn’t enough in its own right.\nHugo Awards are worth around $13,000 to an SJW, according to one Kameron Hurley. For a fraction of one percent of that, you can deny multiple SJWs their ability to commit Pink SF and force them to spend their time delivering pizzas instead. (Have no fear, the awards are worth absolutely nothing to us in financial terms, because the gatekeepers who value them for marketing purposes won’t publish even national bestselling authors of the Right; they are far more driven by intersectional equalitarian ideology than by evil capitalist business sense.)\nShort of wiping their hard drives and deleting their current manuscripts, there is literally nothing you can do that upsets the SJWs more than putting the sort of right-wing writer they have spent two decades working very hard to suppress in the limelight that they seek for themselves.\nThe more obvious our numbers, the more it encourages the moderate elements at the major publishers to rein in the left-wing inmates who have taken over the SF/F asylum. The Toad of Tor\nis no longer at Tor\nand it is unlikely that her dismissal would have taken place without the fact that people were finally standing up to her crude bullying, causing her to double-down and attract the attention of higher-ups at the publisher. Tor’s German owners don’t give a damn about politics or the imperative of strong female characters and they’re only beginning to understand how the SJWs running their subsidiaries have let them down.\nIt’s very good value for the money. Last year, the $20 spent on a supporting membership got you the complete Wheel of Time series, the complete Grimnoire Chronicles, and sundry other works as well. Granted, it also got you a fair amount of Pink sludge, but no one is going to make you download it. The more of you that register, the more likely it is that there will be great stuff that you want to read as part of the Hugo Packet.\nSarah Hoyt\nsays\n: “I suggest we kick them while they’re down and make them fight for the\nawards and prestige they crave. Also, that we point at them and make\nduck noises.”\nWe have the momentum. Last year, the Dread Ilk showed up in respectable force without me doing anything more than putting up a single post with a modified version of Sad Puppies 2. This year, we’re locked, loaded, and ready to be all that we can be. Trust me on that. About which more soon….\nA supporting membership is $40 and gives you the right to participate this year and next year, as well as receive the material in the Hugo Packets both years. So heed the words of Wendell, our fine spokesmanatee, and\nend puppy-related sadness\nnow!\nNote to the Dread Ilk already on board: keep your powder dry. Registration is all that is necessary or desirable right now. The next step is in process.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-30T13:00:00+00:00"
}