{
  "url": "https://voxday.net/2015/01/31/sad-puppies-working-as-designed/",
  "scraped_at": "2025-12-16T12:43:45.989665",
  "title": "Sad Puppies, working as designed",
  "date_display": "January 31, 2015",
  "date_iso": "2015-01-31T16:30:00+00:00",
  "date_from_url": "2015-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://iansales.com/2015/01/08/on-awards-eligibility-posts/\">criticism of award-eligibility posts</a> by what appears to be a garden variety pinkshirt proves that the International Lord of Hate effectively made his point last year with Sad Puppies 2, and also underlines the importance of <a href=\"http://www.milobookclub.com/2015/01/30/sad-puppies-last-day/\">The Ensaddening</a>:</p><blockquote class=\"tr_bq\"><p> It’s that time of year again when the blogosphere is suddenly full of awards eligibility posts. Some people consider them useful and some people think they’re a bad thing. I used to believe there was something a little bit off about them, and I put that down to being, well, British. Blowing your own trumpet and all that. Bad form, you know. But my opinion on them has hardened of late. Having seen what a mockery the Hugo Awards were last year – which is not to say they haven’t been for many, many years – but in 2014 I was more than just an observer on the sidelines…</p><p>In 2014, I joined the Worldcon, which allowed me nominate works for the award. I took my vote seriously. I read novels I believed might be award-worthy, so I could put together a reasonably well-informed ballot. But the way everything worked out only brought home to me quite how corrupt is the culture surrounding the Hugos. And part of that culture is the awards eligibility post.</p><p>So why are they bad?</p><p>For one thing, awards are not about authors – they’re about what readers think of individual works. When an author enters a conversation about their book, they skew the conversation. We’ve all seen it happen. It usually result in authors bullying fans. When an author does the same with awards, they skew the awards.</p><p>It’s not a level playing-field. If Author A lists the eligible works they had published in 2014 and a couple of thousand people see that list, and Author B does the same but hundreds of thousands of people see their list… and if 0.01% of those people then nominate a work, guess who’s more likely to appear on the shortlist? Popular vote awards are by definition a popularity contest, so to make it acceptable for those with the loudest voices to shout across the room just makes a mockery of the whole thing.</p><p>Awards are fan spaces. Authors should not invade fan spaces. This is not to say that authors are not fans themselves. And there’s no reason why they shouldn’t behave as fans in fan spaces. But an awards eligibility post is an author-thing not a fan-thing. (This leaves posts where authors recommend others’ works in something of a grey area. Big Name Authors have Big Loud Voices, and their endorsement can still skew an award.)</p></blockquote><p>The amusing thing is that most of these would-be critics of Larry Correia know perfectly well who is the individual most to blame for the current state of the Hugo Awards, but they are hesitant to point fingers and call him out for the fraud that he is. And that individual is none other than our old friend McRapey, who was the first to breach the dividing line between author and fan when he openly campaigned for the Best Fan Writer award, and managed to get himself nominated for it in 2007 before winning it in 2008. He justified his actions at the time by claiming that “authors are fans too”. I’ve repeatedly shown that McRapey is a charlatan and a liar, but he does have a gift for ruthless self-marketing; his SFWA presidency was part and parcel of the same self-inflating campaign.</p><p>Since then, other authors have attempted to follow Scalzi’s path to status among the publishing gatekeepers, including Jim C. Hines, the 2012 winner, and Kameron Hurley, the 2014 winner. Hurley even <a href=\"http://www.kameronhurley.com/what-i-get-paid-for-my-novels-or-why-im-not-quitting-my-day-job/\">puts a price tag</a> on her Fan Writer Hugo.</p><blockquote class=\"tr_bq\"><p> If you want to know what magical thing happened between MIRROR EMPIRE and THE STARS ARE LEGION to finally get me to what most folks in the industry used to consider a solid mid-lister advance, it’s one word:</p><p><b> Hugos</b></p><p>So when people tell me that Hugos don’t matter, awards don’t matter, and promotion don’t matter, you can imagine the $13,000 face I make.</p></blockquote><p>(That’s the point that Brad Torgersen missed in his calculations of Hugo value. They are worthless for selling books to readers, but they are very helpful for getting advances from status-seeking pinkshirt publishers.) But there is more than that. <a href=\"http://kaedrin.com/weblog/archive/003074.html\">As Kaedrin points out</a>, even if we ignore Scalzi’s two Dadaesque nominations for <i>Redshirts </i>and “Shadow War of the Night Dragons: Book One: The Dead City: Prologue”, it appears that his 2006 nomination for <i>Old Man’s War</i> may be sketchy. Unless the rules have changed, how can anyone argue that <i>The Martian</i> is not eligible given that <i>Old Man’s War</i> was also self-published more than a year prior to its 2006 nomination?</p><blockquote class=\"tr_bq\"><p> <i>The Martian</i> suffers from eligibility issues – it was self published in 2012, then snapped up by a publisher and put into fancy editions and audio books in 2014 (where it has sold extremely well). General consensus seems to be that it will not be eligible, but I think there are a few things going for it. One is that self-published works that get bought up by a real publisher and come out a year or two later have made it onto the ballot before (an example that comes to mind is Scalzi’s <i>Old Man’s War</i>, which was self-published in 2003 or 2004, after which it was promptly bought up by Tor and republished in 2005, garnering a Hugo nomination in 2006).</p></blockquote><p>The Hugo Awards are corrupt. But Sad Puppies isn’t what corrupted them. Quite to the contrary, Sad Puppies is a necessary part of the process of cleaning them up and restoring them to something that actually recognizes excellence in genuine science fiction and fantasy. </p><p><a name=\"more\"></a>The left-wing rot runs considerably deeper than most realize; consider <a href=\"http://www.locusmag.com/2001/Departments/Letters10Norman.html\">this letter from John Norman to Locus</a>, written concerning a WorldCon more than a decade ago:</p><blockquote class=\"tr_bq\"><p> For those in the science-fiction community who are interested in freedom of speech, a free and open marketplace of ideas, in debate, dialogue, reason, and such, the recent convention is a considerable embarrassment. It seems a shame that the Millennium World Science Fiction Convention will be remembered for its suppression of dissent, an absence of authentic dialogue, its exclusionistic criteria for participation, and its parochial PC mentality. The past cannot be undone, though, I suppose, it is easy enough to lie about it.</p><p>I received a note, dated June 21, 2001, in response to a letter of inquiry, dated June 7, 2001, my letter pertaining to the possible refusal of certain members of the programming committee to countenance an intellectually open convention. My first letter was dated April 7, 2001, and the program-participant list was several times added to, and updated, after that time. The following is my response to the note.</p><p>Thank you for your note of June 21, 2001. Your note reads, in part, as follows: <i>Thank you for your interest in being a Program participant at the Millennium Philcon. However, we are unable to accept your offer for this Worldcon. However, we expect to be able to have a mass autographing session at the Worldcon. Any writer in attendance will be welcome to come in and sign. </i></p><p>It will be noted, in connection with the first paragraph above, that it was not made clear why the “acceptors and rejecters” were “unable” to accept my offer of participation. I thought they were in charge of programming. Without being sanguine to edit another’s discourse, I think, perhaps, they might have said something like “we refuse to let you participate” or, perhaps, “because of political pressures, from certain authors and/or fans, we feel it might our jeopardize our position in a personality network, to have an open convention.”</p><p>I was sorry to be unpleasant, but how else could one possibly have construed such a lame and implausible remark.</p><p>With respect to the second paragraph, their offer was empty, and insulting. For example, as my name did not appear on the list of program participants none of my fans would know that I would be there, and, accordingly, would not bring any books to sign. It is hard for me to suppose that this detail escaped the notice of the “acceptors and rejecters.”</p><p>The grounds for my exclusion were clearly not logistic or professional. For example, I wrote to the committee months before the convention, arid their membership list had been updated, with new additions, several times since that time. That rules out the rationalization of not enough chairs in the hotel, or such.</p><p>Similarly, the grounds for my exclusion could not plausibly be professional. Had I not sold enough millions of books? For example, I have had several million books published in the genre of science fiction, have a worldwide fandom, am available in several languages, and have had two movies made which were putatively based on my work. I think there are very few, if any, authors, much as we love them all, who had objectively made more of a contribution to the genre in the past fifty years.</p></blockquote><p>We have a long way to go. But we have stronger spirits, longer legs, and bigger guns. And, more importantly, unlike our predecessors, we see the enemy for exactly what they are. John Norman was right. “Science fiction’s future deserves more than to be a literary backwater despised by serious critics, and held in contempt by the average intellectual; it deserves more than to be a vehicle for an endless potlatch of prizes.”</p></div>",
  "content_text": "This\ncriticism of award-eligibility posts\nby what appears to be a garden variety pinkshirt proves that the International Lord of Hate effectively made his point last year with Sad Puppies 2, and also underlines the importance of\nThe Ensaddening\n:\nIt’s that time of year again when the blogosphere is suddenly full of awards eligibility posts. Some people consider them useful and some people think they’re a bad thing. I used to believe there was something a little bit off about them, and I put that down to being, well, British. Blowing your own trumpet and all that. Bad form, you know. But my opinion on them has hardened of late. Having seen what a mockery the Hugo Awards were last year – which is not to say they haven’t been for many, many years – but in 2014 I was more than just an observer on the sidelines…\nIn 2014, I joined the Worldcon, which allowed me nominate works for the award. I took my vote seriously. I read novels I believed might be award-worthy, so I could put together a reasonably well-informed ballot. But the way everything worked out only brought home to me quite how corrupt is the culture surrounding the Hugos. And part of that culture is the awards eligibility post.\nSo why are they bad?\nFor one thing, awards are not about authors – they’re about what readers think of individual works. When an author enters a conversation about their book, they skew the conversation. We’ve all seen it happen. It usually result in authors bullying fans. When an author does the same with awards, they skew the awards.\nIt’s not a level playing-field. If Author A lists the eligible works they had published in 2014 and a couple of thousand people see that list, and Author B does the same but hundreds of thousands of people see their list… and if 0.01% of those people then nominate a work, guess who’s more likely to appear on the shortlist? Popular vote awards are by definition a popularity contest, so to make it acceptable for those with the loudest voices to shout across the room just makes a mockery of the whole thing.\nAwards are fan spaces. Authors should not invade fan spaces. This is not to say that authors are not fans themselves. And there’s no reason why they shouldn’t behave as fans in fan spaces. But an awards eligibility post is an author-thing not a fan-thing. (This leaves posts where authors recommend others’ works in something of a grey area. Big Name Authors have Big Loud Voices, and their endorsement can still skew an award.)\nThe amusing thing is that most of these would-be critics of Larry Correia know perfectly well who is the individual most to blame for the current state of the Hugo Awards, but they are hesitant to point fingers and call him out for the fraud that he is. And that individual is none other than our old friend McRapey, who was the first to breach the dividing line between author and fan when he openly campaigned for the Best Fan Writer award, and managed to get himself nominated for it in 2007 before winning it in 2008. He justified his actions at the time by claiming that “authors are fans too”. I’ve repeatedly shown that McRapey is a charlatan and a liar, but he does have a gift for ruthless self-marketing; his SFWA presidency was part and parcel of the same self-inflating campaign.\nSince then, other authors have attempted to follow Scalzi’s path to status among the publishing gatekeepers, including Jim C. Hines, the 2012 winner, and Kameron Hurley, the 2014 winner. Hurley even\nputs a price tag\non her Fan Writer Hugo.\nIf you want to know what magical thing happened between MIRROR EMPIRE and THE STARS ARE LEGION to finally get me to what most folks in the industry used to consider a solid mid-lister advance, it’s one word:\nHugos\nSo when people tell me that Hugos don’t matter, awards don’t matter, and promotion don’t matter, you can imagine the $13,000 face I make.\n(That’s the point that Brad Torgersen missed in his calculations of Hugo value. They are worthless for selling books to readers, but they are very helpful for getting advances from status-seeking pinkshirt publishers.) But there is more than that.\nAs Kaedrin points out\n, even if we ignore Scalzi’s two Dadaesque nominations for\nRedshirts\nand “Shadow War of the Night Dragons: Book One: The Dead City: Prologue”, it appears that his 2006 nomination for\nOld Man’s War\nmay be sketchy. Unless the rules have changed, how can anyone argue that\nThe Martian\nis not eligible given that\nOld Man’s War\nwas also self-published more than a year prior to its 2006 nomination?\nThe Martian\nsuffers from eligibility issues – it was self published in 2012, then snapped up by a publisher and put into fancy editions and audio books in 2014 (where it has sold extremely well). General consensus seems to be that it will not be eligible, but I think there are a few things going for it. One is that self-published works that get bought up by a real publisher and come out a year or two later have made it onto the ballot before (an example that comes to mind is Scalzi’s\nOld Man’s War\n, which was self-published in 2003 or 2004, after which it was promptly bought up by Tor and republished in 2005, garnering a Hugo nomination in 2006).\nThe Hugo Awards are corrupt. But Sad Puppies isn’t what corrupted them. Quite to the contrary, Sad Puppies is a necessary part of the process of cleaning them up and restoring them to something that actually recognizes excellence in genuine science fiction and fantasy.\nThe left-wing rot runs considerably deeper than most realize; consider\nthis letter from John Norman to Locus\n, written concerning a WorldCon more than a decade ago:\nFor those in the science-fiction community who are interested in freedom of speech, a free and open marketplace of ideas, in debate, dialogue, reason, and such, the recent convention is a considerable embarrassment. It seems a shame that the Millennium World Science Fiction Convention will be remembered for its suppression of dissent, an absence of authentic dialogue, its exclusionistic criteria for participation, and its parochial PC mentality. The past cannot be undone, though, I suppose, it is easy enough to lie about it.\nI received a note, dated June 21, 2001, in response to a letter of inquiry, dated June 7, 2001, my letter pertaining to the possible refusal of certain members of the programming committee to countenance an intellectually open convention. My first letter was dated April 7, 2001, and the program-participant list was several times added to, and updated, after that time. The following is my response to the note.\nThank you for your note of June 21, 2001. Your note reads, in part, as follows:\nThank you for your interest in being a Program participant at the Millennium Philcon. However, we are unable to accept your offer for this Worldcon. However, we expect to be able to have a mass autographing session at the Worldcon. Any writer in attendance will be welcome to come in and sign.\nIt will be noted, in connection with the first paragraph above, that it was not made clear why the “acceptors and rejecters” were “unable” to accept my offer of participation. I thought they were in charge of programming. Without being sanguine to edit another’s discourse, I think, perhaps, they might have said something like “we refuse to let you participate” or, perhaps, “because of political pressures, from certain authors and/or fans, we feel it might our jeopardize our position in a personality network, to have an open convention.”\nI was sorry to be unpleasant, but how else could one possibly have construed such a lame and implausible remark.\nWith respect to the second paragraph, their offer was empty, and insulting. For example, as my name did not appear on the list of program participants none of my fans would know that I would be there, and, accordingly, would not bring any books to sign. It is hard for me to suppose that this detail escaped the notice of the “acceptors and rejecters.”\nThe grounds for my exclusion were clearly not logistic or professional. For example, I wrote to the committee months before the convention, arid their membership list had been updated, with new additions, several times since that time. That rules out the rationalization of not enough chairs in the hotel, or such.\nSimilarly, the grounds for my exclusion could not plausibly be professional. Had I not sold enough millions of books? For example, I have had several million books published in the genre of science fiction, have a worldwide fandom, am available in several languages, and have had two movies made which were putatively based on my work. I think there are very few, if any, authors, much as we love them all, who had objectively made more of a contribution to the genre in the past fifty years.\nWe have a long way to go. But we have stronger spirits, longer legs, and bigger guns. And, more importantly, unlike our predecessors, we see the enemy for exactly what they are. John Norman was right. “Science fiction’s future deserves more than to be a literary backwater despised by serious critics, and held in contempt by the average intellectual; it deserves more than to be a vehicle for an endless potlatch of prizes.”",
  "tags": [
    "Hugo Award",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-31T16:30:00+00:00"
}