{
  "url": "https://voxday.net/2015/01/15/see-that-is-why-they-hate-you/",
  "scraped_at": "2025-12-16T12:41:47.885677",
  "title": "See, THAT is why they hate you",
  "date_display": "January 15, 2015",
  "date_iso": "2015-01-15T13:00:00+00:00",
  "date_from_url": "2015-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Jewish woman in Britain worried about anti-semitism in the UK <a href=\"http://www.telegraph.co.uk/news/religion/11345643/Paris-shootings-anti-Semitism-Its-OK-to-blame-Jews-again.html\">inadvertently demonstrates</a> one reason many decent individuals in Britain are increasingly inclined to dislike the Jews in their midst:</p><blockquote class=\"tr_bq\"><p> There may<br> be only 260,000 of us in the UK but if we don’t lead, how can the rest of<br> society follow?</br></br></p></blockquote><p>It’s just so hard to imagine why so many of the 64 million people in the UK might not want this woman living among them and so graciously deigning to lead them. I wouldn’t be at all surprised if most of them would now like to punch her in the face.</p><p><i>“If we don’t lead, how can the rest of<br> society follow?”</br></i> How indeed. Pat Buchanan <a href=\"http://www.unz.com/pbuchanan/a-triumph-of-terrorism/\">asked a pertinent question</a> in his article on Unz: “Muslims in the banlieues wonder why insulting the Prophet is a protected freedom in France, while denying the Holocaust can get you a prison term.”</p><p>Speaking of the Islamic banlieues, across the English Channel <a href=\"http://www.nytimes.com/2015/01/15/world/europe/crisis-in-france-is-seen-as-sign-of-chronic-ills.html\">the failure of French diversity and multiculturalism is highlighted</a> by the reaction in them to the ridiculous “unity” march meant to defend the tottering status quo:</p><blockquote class=\"tr_bq\"><p> The sense of marginalization did not disappear with the massive solidarity march across Paris on Sunday, which drew more than one million people and 40 presidents and prime ministers to Mr. Hollande’s side. For some banlieue residents, it seemed an almost surreal display that had nothing to do with them.</p><p>In Vaulx-en-Velin, the only Charlie reference to be seen was a sign for the Charlie Chaplin cultural center across the street from City Hall, which is topped with a drawing of a flag of its sister city, the West Bank town of Beit Sahour.</p><p>Residents there ridiculed the “I am Charlie” marches. Some said the terrorist attacks had been staged. While many strongly condemned the attackers for the murders, others insisted the cartoonists had gotten what they deserved….</p><p>“I totally feel cut off from France,” said Karim Yahiaoui, 15, who added that he had not left this suburb more than twice in the past year. Over the past few decades, the Muslim community in Vaulx-en-Velin has become increasingly insular. “Many people only believe their own values now, not those of the republic,” said Anne Dufaud, director of the Mission, a nonprofit organization. She has worked in the community for 20 years. When Mr. Hollande led a moment of silence across France last Thursday for the victims of the attacks, two students and a teacher at a local high school, who declined to be identified, said many students refused to stand.</p><p>Patrick Kahn, a manager at the International League Against Racism and Anti-Semitism in Lyon, who operates a weekly tolerance program in the schools of Vaulx-en-Velin, said simply, “The integration policy failed.”</p></blockquote><p>Integration has failed. Diversity has failed. Multiculturalism has failed. What options does that leave?</p></div>",
  "content_text": "A Jewish woman in Britain worried about anti-semitism in the UK\ninadvertently demonstrates\none reason many decent individuals in Britain are increasingly inclined to dislike the Jews in their midst:\nThere may\nbe only 260,000 of us in the UK but if we don’t lead, how can the rest of\nsociety follow?\nIt’s just so hard to imagine why so many of the 64 million people in the UK might not want this woman living among them and so graciously deigning to lead them. I wouldn’t be at all surprised if most of them would now like to punch her in the face.\n“If we don’t lead, how can the rest of\nsociety follow?”\nHow indeed. Pat Buchanan\nasked a pertinent question\nin his article on Unz: “Muslims in the banlieues wonder why insulting the Prophet is a protected freedom in France, while denying the Holocaust can get you a prison term.”\nSpeaking of the Islamic banlieues, across the English Channel\nthe failure of French diversity and multiculturalism is highlighted\nby the reaction in them to the ridiculous “unity” march meant to defend the tottering status quo:\nThe sense of marginalization did not disappear with the massive solidarity march across Paris on Sunday, which drew more than one million people and 40 presidents and prime ministers to Mr. Hollande’s side. For some banlieue residents, it seemed an almost surreal display that had nothing to do with them.\nIn Vaulx-en-Velin, the only Charlie reference to be seen was a sign for the Charlie Chaplin cultural center across the street from City Hall, which is topped with a drawing of a flag of its sister city, the West Bank town of Beit Sahour.\nResidents there ridiculed the “I am Charlie” marches. Some said the terrorist attacks had been staged. While many strongly condemned the attackers for the murders, others insisted the cartoonists had gotten what they deserved….\n“I totally feel cut off from France,” said Karim Yahiaoui, 15, who added that he had not left this suburb more than twice in the past year. Over the past few decades, the Muslim community in Vaulx-en-Velin has become increasingly insular. “Many people only believe their own values now, not those of the republic,” said Anne Dufaud, director of the Mission, a nonprofit organization. She has worked in the community for 20 years. When Mr. Hollande led a moment of silence across France last Thursday for the victims of the attacks, two students and a teacher at a local high school, who declined to be identified, said many students refused to stand.\nPatrick Kahn, a manager at the International League Against Racism and Anti-Semitism in Lyon, who operates a weekly tolerance program in the schools of Vaulx-en-Velin, said simply, “The integration policy failed.”\nIntegration has failed. Diversity has failed. Multiculturalism has failed. What options does that leave?",
  "tags": [
    "Clash of Civilizations",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-15T13:00:00+00:00"
}