{
  "url": "https://voxday.net/2015/01/07/the-three-laws-of-behavioral-genetics/",
  "scraped_at": "2025-12-16T12:40:52.866146",
  "title": "The three laws of behavioral genetics",
  "date_display": "January 7, 2015",
  "date_iso": "2015-01-07T17:00:00+00:00",
  "date_from_url": "2015-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JayMan <a href=\"http://jaymans.wordpress.com/2012/12/31/all-human-behavioral-traits-are-heritable/\">explicates them</a>:</p><ul><li>First Law. All human behavioral traits are heritable.</li><li>Second Law. The effect of being raised in the same family is smaller than the effect of genes.</li><li>Third Law. A substantial portion of the variation in complex human behavioral traits is not accounted for by the effects of genes or families.</li></ul><p>These laws are more controversial than they should be. No one who comes from a large family will find it easy to take exception to them, and anyone who does must be put to the objective test.</p><p>What, specifically, is a behavioral trait that is <i>not </i>heritable? And how would one go about demonstrating that? My impression is that as with many other issues, the fact that most people are binary thinkers renders it very difficult for them to grasp the truth of probabilistic matters. If it can’t be answered with an absolute “yes, always”, then they assume that the answer must necessarily be “no, never”.</p></div>",
  "content_text": "JayMan\nexplicates them\n:\nFirst Law. All human behavioral traits are heritable.\nSecond Law. The effect of being raised in the same family is smaller than the effect of genes.\nThird Law. A substantial portion of the variation in complex human behavioral traits is not accounted for by the effects of genes or families.\nThese laws are more controversial than they should be. No one who comes from a large family will find it easy to take exception to them, and anyone who does must be put to the objective test.\nWhat, specifically, is a behavioral trait that is\nnot\nheritable? And how would one go about demonstrating that? My impression is that as with many other issues, the fact that most people are binary thinkers renders it very difficult for them to grasp the truth of probabilistic matters. If it can’t be answered with an absolute “yes, always”, then they assume that the answer must necessarily be “no, never”.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-07T17:00:00+00:00"
}