{
  "url": "https://voxday.net/2015/01/28/the-devil-called-drisco/",
  "scraped_at": "2025-12-16T12:43:25.387450",
  "title": "The devil called Driscoll",
  "date_display": "January 28, 2015",
  "date_iso": "2015-01-28T17:30:00+00:00",
  "date_from_url": "2015-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know nothing about <a href=\"https://dalrock.wordpress.com/2015/01/28/message-received/\">this “Pastor Driscoll”</a> except for what I’ve read at Dalrock’s. And I would bet considerable money that he’s a Swaggart/Bakker debacle just waiting to be uncovered and exposed:</p><blockquote class=\"tr_bq\"><p> I’ve referenced Pastor Driscoll’s sermon <i>Men and Marriage</i> in several recent posts.  This is the sermon to <a href=\"http://youtu.be/sFPU3PFtrTI?t=6m4s\">watch</a>, or better yet, <a href=\"http://life.biblechurch.org/slifejom/disciplined-audio-video/3092-marriage-and-men-a-sermon-by-mark-driscoll-mars-hill-church.html\">read</a>, if you wan’t to understand what I was describing in <a href=\"https://dalrock.wordpress.com/2015/01/21/the-only-real-man-in-the-room/\">The only real man in the room</a>.  In this sermon Driscoll opens with the prayer I quoted from in <a href=\"https://dalrock.wordpress.com/2013/08/19/fragging-christian-headship/\">Fragging Christian Headship</a>:</p><blockquote><p> Father God, I pray that our time would be pleasing to<br> you, that it would be profitable to us, Lord God, as well. I pray for<br> those men who are here that are cowards, they’re silent, passive,<br> impish, worthless men, they’re making a mess of everything in their life<br> and they’re such sweet little boys that no one ever confronts them on<br> that. I pray for the women who enable them, who permit them to continue<br> in falling, those who are mothers and sisters and girlfriends and wives.<br> I pray, Lord God, for those men who are chauvinists, those who are<br> mean, who are brash, who are rude, who are harsh, who, Lord God, think<br> they are tough when in fact they are Satanic. God, I pray for those men<br> that they would have the courage today to not fight with a woman, but to<br> fight with you, to actually find their rightful place in creation, that<br> they might receive a good rebuke so that they can become honorable<br> rather than dishonorable sons. God, I pray for my tone, I pray for our<br> men, and I pray for the women who are listening in. I pray, Lord God,<br> that they would know this comes from a heart of passion, deep concern,<br> and love. I pray, Lord God, that we would think biblically, critically,<br> humbly, and repentantly, and that, Lord God, there would be dramatic<br> life change by the power of the Holy Spirit in the name of Jesus, Amen.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>If you read the sermon, you will see that Driscoll repeatedly makes it clear that when he uses terms like <i>dishonorable, Satanic, cowards, passive, impish, worthless, jokes, losers, imbeciles, fools, etc.</i><br> he isn’t just referring to a few “peter pan” men who don’t have jobs<br> and/or aren’t married.  He is talking about the husbands and fathers<br> who sought out the church lead by Driscoll, the men who brought their<br> wives and children to the sermon.</br></br></br></br></p><blockquote><p> …most of you men don’t know what masculinity truly is</p></blockquote><p>Driscoll defines the six types of worthless men he regularly comes<br> across.   They are all either cowards or chauvinists and bullies.  And<br> again, Driscoll is addressing this not to men outside the congregation,<br> or even a smallish subset of the men in the congregation.  He means<br> nearly all of the men in the congregation:</br></br></br></br></p><blockquote><p> Were this a women’s conference, I would not call you all<br> idiots and imbeciles and fools, that you’re a joke, okay? But you men,<br> this is where it needs to go. You’ve been glad-handed and buddied up and<br> positive thinking and you’re a winner and Jesus loves you and you can<br> do better. And I’m telling you, you’re a joke. And the real men in the<br> room know it and they see it. And maybe there’s one woman that you<br> fooled and she doesn’t see it because like Eve, she’s deceived.</br></br></br></br></br></br></p></blockquote><p>The hallmark of a real man, a real Christian man, according to<br> Driscoll, is looking around at the other men in the room and knowing<br> that they are pathetic compared to you.  This is of course exactly what<br> Driscoll is doing throughout the sermon. Again, this is a sermon about men and marriage, and married men are<br> Driscoll’s primary target.  While he makes a short stop in Genesis for<br> background, the inspiration for the sermon is one single verse, 1 Pet.<br> 3:7<br/></br></br></br></br></br></br></p><blockquote><p> Likewise, husbands, live with your wives in an<br> understanding way, showing honor to the woman as the weaker vessel,<br> since they are heirs with you of the grace of life, so that your prayers<br> may not be hindered.</br></br></br></p></blockquote><p>The disparaging of the men in the room goes on to the very end of the<br> hour and seven minute sermon.  I’ll repeat that I highly encourage you<br> to <a href=\"http://life.biblechurch.org/slifejom/disciplined-audio-video/3092-marriage-and-men-a-sermon-by-mark-driscoll-mars-hill-church.html\">read the transcript</a>.  There is simply too much to quote, as the stream of invective against the men in the room is non stop.</br></br></p></blockquote><p>This guy is the epitome of the wolf in sheep’s clothing. He’s a wannabe cult leader, not a man of God. Reading his words, I can scent the stink of feminist-appeasing, neighbor’s-wife-seducing sulfur. The joke, the evil joke, is him.</p><p>No man who runs around posturing as “the only man in the room” in this manner is a Christian leader. He’s an Alpha male, a pathological seducer who can’t stand the fact that there are women in the room who prefer another man to him. I can just about guarantee you that he would react very, very badly to me if I merely walked into his church with Spacebunny and stared at him. His sort of Alpha absolutely hates Sigmas because a) we tend to marry attractive women and b) we see their bullshit for what it is.</p><p>Dalrock’s close was beautiful: <i>“Miss Flowahs got Driscoll’s message, and no doubt so did the women in attendance.” </i>His real message, not the fake sermon given as cover.</p><p>I never trust a man who pretends to be talking to God when he is actually talking to the people listening.</p></div>",
  "content_text": "I know nothing about\nthis “Pastor Driscoll”\nexcept for what I’ve read at Dalrock’s. And I would bet considerable money that he’s a Swaggart/Bakker debacle just waiting to be uncovered and exposed:\nI’ve referenced Pastor Driscoll’s sermon\nMen and Marriage\nin several recent posts.  This is the sermon to\nwatch\n, or better yet,\nread\n, if you wan’t to understand what I was describing in\nThe only real man in the room\n.  In this sermon Driscoll opens with the prayer I quoted from in\nFragging Christian Headship\n:\nFather God, I pray that our time would be pleasing to\nyou, that it would be profitable to us, Lord God, as well. I pray for\nthose men who are here that are cowards, they’re silent, passive,\nimpish, worthless men, they’re making a mess of everything in their life\nand they’re such sweet little boys that no one ever confronts them on\nthat. I pray for the women who enable them, who permit them to continue\nin falling, those who are mothers and sisters and girlfriends and wives.\nI pray, Lord God, for those men who are chauvinists, those who are\nmean, who are brash, who are rude, who are harsh, who, Lord God, think\nthey are tough when in fact they are Satanic. God, I pray for those men\nthat they would have the courage today to not fight with a woman, but to\nfight with you, to actually find their rightful place in creation, that\nthey might receive a good rebuke so that they can become honorable\nrather than dishonorable sons. God, I pray for my tone, I pray for our\nmen, and I pray for the women who are listening in. I pray, Lord God,\nthat they would know this comes from a heart of passion, deep concern,\nand love. I pray, Lord God, that we would think biblically, critically,\nhumbly, and repentantly, and that, Lord God, there would be dramatic\nlife change by the power of the Holy Spirit in the name of Jesus, Amen.\nIf you read the sermon, you will see that Driscoll repeatedly makes it clear that when he uses terms like\ndishonorable, Satanic, cowards, passive, impish, worthless, jokes, losers, imbeciles, fools, etc.\nhe isn’t just referring to a few “peter pan” men who don’t have jobs\nand/or aren’t married.  He is talking about the husbands and fathers\nwho sought out the church lead by Driscoll, the men who brought their\nwives and children to the sermon.\n…most of you men don’t know what masculinity truly is\nDriscoll defines the six types of worthless men he regularly comes\nacross.   They are all either cowards or chauvinists and bullies.  And\nagain, Driscoll is addressing this not to men outside the congregation,\nor even a smallish subset of the men in the congregation.  He means\nnearly all of the men in the congregation:\nWere this a women’s conference, I would not call you all\nidiots and imbeciles and fools, that you’re a joke, okay? But you men,\nthis is where it needs to go. You’ve been glad-handed and buddied up and\npositive thinking and you’re a winner and Jesus loves you and you can\ndo better. And I’m telling you, you’re a joke. And the real men in the\nroom know it and they see it. And maybe there’s one woman that you\nfooled and she doesn’t see it because like Eve, she’s deceived.\nThe hallmark of a real man, a real Christian man, according to\nDriscoll, is looking around at the other men in the room and knowing\nthat they are pathetic compared to you.  This is of course exactly what\nDriscoll is doing throughout the sermon. Again, this is a sermon about men and marriage, and married men are\nDriscoll’s primary target.  While he makes a short stop in Genesis for\nbackground, the inspiration for the sermon is one single verse, 1 Pet.\n3:7\nLikewise, husbands, live with your wives in an\nunderstanding way, showing honor to the woman as the weaker vessel,\nsince they are heirs with you of the grace of life, so that your prayers\nmay not be hindered.\nThe disparaging of the men in the room goes on to the very end of the\nhour and seven minute sermon.  I’ll repeat that I highly encourage you\nto\nread the transcript\n.  There is simply too much to quote, as the stream of invective against the men in the room is non stop.\nThis guy is the epitome of the wolf in sheep’s clothing. He’s a wannabe cult leader, not a man of God. Reading his words, I can scent the stink of feminist-appeasing, neighbor’s-wife-seducing sulfur. The joke, the evil joke, is him.\nNo man who runs around posturing as “the only man in the room” in this manner is a Christian leader. He’s an Alpha male, a pathological seducer who can’t stand the fact that there are women in the room who prefer another man to him. I can just about guarantee you that he would react very, very badly to me if I merely walked into his church with Spacebunny and stared at him. His sort of Alpha absolutely hates Sigmas because a) we tend to marry attractive women and b) we see their bullshit for what it is.\nDalrock’s close was beautiful:\n“Miss Flowahs got Driscoll’s message, and no doubt so did the women in attendance.”\nHis real message, not the fake sermon given as cover.\nI never trust a man who pretends to be talking to God when he is actually talking to the people listening.",
  "tags": [
    "Alpha Game",
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-28T17:30:00+00:00"
}