{
  "url": "https://voxday.net/2015/01/14/the-end-of-troll-hun/",
  "scraped_at": "2025-12-16T12:41:44.237770",
  "title": "The end of the troll hunt",
  "date_display": "January 14, 2015",
  "date_iso": "2015-01-14T18:20:00+00:00",
  "date_from_url": "2015-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I spoke with a representative of the Marshfield police department yesterday, and I can declare, with a reasonable degree of confidence, that the great troll campaign of the last five years appears to be more or less at an end. The police had Yama (whose identity, it turns out, was correctly identified) down to the station with his caretakers, none of whom knew anything at all about what Yama had been doing online for the last 12 years. I have been assured that there will be no further trolling of this blog, or of the many other blogs that have been trolled in the past, and that Yama will not be permitted unrestricted access to the Internet going forward.</p><p>While Yama did subsequently take advantage of what I suspect was access outside his home to post a short comment on Brad Torgersen’s blog under the name of Alauda yesterday, I have already reported it to the police and they are addressing the matter. If Yama posts additional comments anywhere else, please bring<br> them to my attention right away so that I can report them. I expect there will be a few more minor incidents of a similar fashion as Yama attempts to evade his newly imposed restrictions.</br></p><p>I have decided not to press criminal charges at this time due to my opinion that the individual responsible for the cyberstalking is not entirely capable of controlling his behavior. I’m not even certain he’d be considered sufficiently competent to be held liable for them. I do, however, retain the option to press charges if it turns out that the individual’s caretakers prove unable, or unwilling, to control his online activity in the future. I can also assure those who have been concerned about various threats made by Yama to various parties over the last 12 years that he poses absolutely no physical threat to anyone. So, the good news is that it looks like it’s all over.</p><p>As an occasional critic of the American police, I would be remiss if I failed to note that the Marshfield police were thorough and professional throughout the course of their investigation. They were also very considerate with regards to some of the more sensitive aspects of the affair, and their temperate actions have permitted us to reach a much better outcome than I had originally imagined possible. I was very impressed by them, as I cannot see how they could have handled the matter any better than they did.</p><p>I won’t go into any details about Yama except to say this: he is not someone to be hated or feared. He is someone to be pitied. That doesn’t excuse his execrable behavior, but it does, to a certain extent, explain it. You could do worse than to pray for the poor bastard.</p><p>As for the other trolls, who don’t have a similar explanation for their behavior, I hope you will have the sense to see this as a warning. Cyberstalking is a crime in most jurisdictions, and the police do take it seriously when a properly documented complaint is lodged with them.</p></div>",
  "content_text": "I spoke with a representative of the Marshfield police department yesterday, and I can declare, with a reasonable degree of confidence, that the great troll campaign of the last five years appears to be more or less at an end. The police had Yama (whose identity, it turns out, was correctly identified) down to the station with his caretakers, none of whom knew anything at all about what Yama had been doing online for the last 12 years. I have been assured that there will be no further trolling of this blog, or of the many other blogs that have been trolled in the past, and that Yama will not be permitted unrestricted access to the Internet going forward.\nWhile Yama did subsequently take advantage of what I suspect was access outside his home to post a short comment on Brad Torgersen’s blog under the name of Alauda yesterday, I have already reported it to the police and they are addressing the matter. If Yama posts additional comments anywhere else, please bring\nthem to my attention right away so that I can report them. I expect there will be a few more minor incidents of a similar fashion as Yama attempts to evade his newly imposed restrictions.\nI have decided not to press criminal charges at this time due to my opinion that the individual responsible for the cyberstalking is not entirely capable of controlling his behavior. I’m not even certain he’d be considered sufficiently competent to be held liable for them. I do, however, retain the option to press charges if it turns out that the individual’s caretakers prove unable, or unwilling, to control his online activity in the future. I can also assure those who have been concerned about various threats made by Yama to various parties over the last 12 years that he poses absolutely no physical threat to anyone. So, the good news is that it looks like it’s all over.\nAs an occasional critic of the American police, I would be remiss if I failed to note that the Marshfield police were thorough and professional throughout the course of their investigation. They were also very considerate with regards to some of the more sensitive aspects of the affair, and their temperate actions have permitted us to reach a much better outcome than I had originally imagined possible. I was very impressed by them, as I cannot see how they could have handled the matter any better than they did.\nI won’t go into any details about Yama except to say this: he is not someone to be hated or feared. He is someone to be pitied. That doesn’t excuse his execrable behavior, but it does, to a certain extent, explain it. You could do worse than to pray for the poor bastard.\nAs for the other trolls, who don’t have a similar explanation for their behavior, I hope you will have the sense to see this as a warning. Cyberstalking is a crime in most jurisdictions, and the police do take it seriously when a properly documented complaint is lodged with them.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-14T18:20:00+00:00"
}