{
  "url": "https://voxday.net/2015/01/28/the-banning-of-sjw/",
  "scraped_at": "2025-12-16T12:43:23.558089",
  "title": "The banning of an SJW",
  "date_display": "January 28, 2015",
  "date_iso": "2015-01-28T13:00:00+00:00",
  "date_from_url": "2015-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of Wikipedia’s worst SJWs, the anti-GamerGate Ryulong, <a href=\"https://en.wikipedia.org/w/index.php?title=Wikipedia:Arbitration/Requests/Case/GamerGate/Proposed_decision&amp;oldid=644493624#Ryulong_banned\">has been banned indefinitely</a> for his all-too-typical thought-policing:</p><blockquote class=\"tr_bq\"><h4> Ryulong banned</h4><p>5.3) (Was 4.5) <a href=\"https://en.wikipedia.org/wiki/User:Ryulong\" title=\"User:Ryulong\">Ryulong</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:Ryulong\" title=\"User talk:Ryulong\">talk</a> <b>·</b> <a href=\"https://en.wikipedia.org/wiki/Special:Contributions/Ryulong\" title=\"Special:Contributions/Ryulong\">contribs</a> <b>·</b> <a class=\"external text\" href=\"https://en.wikipedia.org/w/index.php?title=Special:Log&amp;user=Ryulong\">logs</a> <b>·</b> <a class=\"external text\" href=\"https://en.wikipedia.org/w/index.php?title=Special:AbuseLog&amp;wpSearchUser=Ryulong\">edit filter log</a> <b>·</b> <a class=\"external text\" href=\"https://en.wikipedia.org/w/index.php?title=Special:Log&amp;type=block&amp;page=User:Ryulong\">block log</a>)<br> is indefinitely banned from the English Language Wikipedia. They may<br> request reconsideration of the ban twelve months after the enactment of<br> this remedy, and every twelve months thereafter.<br> Support:<br/></br></br></br></br></p><ol><li>(first choice) As always, banning someone is not something we should <i>want</i><br> to do, but sometimes it is the best thing for the project. Ryulong has<br> acted very poorly in this topic area, and it is clear that previous<br> sanctions and blocks have failed to have the desired effect of ending<br> disruptive behavior. A revolving door of speedy topic bans, chasing the<br> problem from area to another, is not the answer. This is. I sincerely<br> hope that at some point in the future he will be able to return and be a<br> productive member of this community again, but for now he needs to go. <a href=\"https://en.wikipedia.org/wiki/User:Beeblebrox\" title=\"User:Beeblebrox\">Beeblebrox</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:Beeblebrox\" title=\"User talk:Beeblebrox\">talk</a>) 23:15, 19 January 2015 (UTC)</br></br></br></br></br></br></br></li><li>Will prioritise later if need be,  <a href=\"https://en.wikipedia.org/wiki/User:Roger_Davies\" title=\"User:Roger Davies\"><b>Roger Davies</b></a> <a href=\"https://en.wikipedia.org/wiki/User_talk:Roger_Davies\" title=\"User talk:Roger Davies\"><i>talk</i></a> 23:38, 19 January 2015 (UTC)<br> Equal first choice,  <a href=\"https://en.wikipedia.org/wiki/User:Roger_Davies\" title=\"User:Roger Davies\"><b>Roger Davies</b></a> <a href=\"https://en.wikipedia.org/wiki/User_talk:Roger_Davies\" title=\"User talk:Roger Davies\"><i>talk</i></a> 11:31, 21 January 2015 (UTC)</br></li><li>First choice. <a href=\"https://en.wikipedia.org/wiki/User:David_Fuchs\" title=\"User:David Fuchs\">Der Wohltemperierte Fuchs</a>(<a href=\"https://en.wikipedia.org/wiki/User_talk:David_Fuchs\" title=\"User talk:David Fuchs\">talk</a>) 23:56, 19 January 2015 (UTC)</li><li><b>Last Choice</b> I would love to not do this but I don’t think anything else has a snowball’s chance of passing —<a href=\"https://en.wikipedia.org/wiki/User:In_actu\" title=\"User:In actu\">In actu (Guerillero)</a> | <a href=\"https://en.wikipedia.org/wiki/User_talk:Guerillero\" title=\"User talk:Guerillero\">My Talk</a> 01:15, 21 January 2015 (UTC)</li><li>First choice. <b><a class=\"mw-redirect\" href=\"https://en.wikipedia.org/wiki/User:Salvio_giuliano\" title=\"User:Salvio giuliano\">Salvio</a></b> <a href=\"https://en.wikipedia.org/wiki/User_talk:Salvio_giuliano\" title=\"User talk:Salvio giuliano\">Let’s talk about it!</a> 10:46, 21 January 2015 (UTC)</li><li>Last choice of presented options (Right now). I think if we’re<br> dealing with this on a purely pragmatic level this might be best for the<br> project, but I do think that it would only be fair to attempt to apply<br> some of the alternatives first, although I’m a bit concerned as to their<br> potential efficacy, given the history. <i><a href=\"https://en.wikipedia.org/wiki/User:NativeForeigner\" title=\"User:NativeForeigner\">NativeForeigner</a></i> <a href=\"https://en.wikipedia.org/wiki/User_talk:NativeForeigner\" title=\"User talk:NativeForeigner\">Talk</a> 07:26, 23 January 2015 (UTC)<br> Nonetheless, support. <i><a href=\"https://en.wikipedia.org/wiki/User:NativeForeigner\" title=\"User:NativeForeigner\">NativeForeigner</a></i> <a href=\"https://en.wikipedia.org/wiki/User_talk:NativeForeigner\" title=\"User talk:NativeForeigner\">Talk</a> 19:48, 27 January 2015 (UTC)</br></br></br></br></br></li><li><a href=\"https://en.wikipedia.org/wiki/User:Timotheus_Canens\" title=\"User:Timotheus Canens\">T. Canens</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:Timotheus_Canens\" title=\"User talk:Timotheus Canens\">talk</a>) 17:12, 23 January 2015 (UTC)</li><li>If the 1RR does not pass, then first choice of what’s left. Still<br> oppose if the 1RR somehow moves back to passing. The more I look at the<br> history here, the more I am sure the problems are far wider than just<br> this single topic, as I see it, Ryulong doesn’t seem able to “hold his<br> fire”, and not get into edit wars. This also, per his block log, is<br> independent of topic areas. Without very, very strong measures to stop<br> them from continuing to edit war throughout the encyclopedia, I don’t<br> think we have any other choice. Also, even to this morning, I still see<br> evidence of ongoing battleground mentality. I really, really don’t like<br> this, but I can’t support their staying on the project without a strict<br> 1RR and a topic ban at this point. And only one of those is going to<br> pass. <a href=\"https://en.wikipedia.org/wiki/User:Courcelles\" title=\"User:Courcelles\">Courcelles</a> 22:02, 26 January 2015 (UTC)</br></br></br></br></br></br></br></br></br></br></br></li></ol><p>Oppose:<br/></p><ol><li>My mind is open on the other proposed remedies, but I will certainly not be supporting this. <a href=\"https://en.wikipedia.org/wiki/User:Newyorkbrad\" title=\"User:Newyorkbrad\">Newyorkbrad</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:Newyorkbrad\" title=\"User talk:Newyorkbrad\">talk</a>) 03:41, 20 January 2015 (UTC)<ul><li>Neither will I. Need to contemplate the rest of it, but this is not the solution. <a href=\"https://en.wikipedia.org/wiki/User:Courcelles\" title=\"User:Courcelles\">Courcelles</a> 03:48, 20 January 2015 (UTC)</li><li><s>Excessive in the circumstances. I’m open to some alternative. <b><a href=\"https://en.wikipedia.org/wiki/User:DGG\" title=\"User:DGG\">DGG</a></b> ( <a href=\"https://en.wikipedia.org/wiki/User_talk:DGG\" title=\"User talk:DGG\">talk</a> ) 05:33, 20 January 2015 (UTC)</s></li><li>I would like to try something else. —<a href=\"https://en.wikipedia.org/wiki/User:Guerillero\" title=\"User:Guerillero\">Guerillero</a> | <a href=\"https://en.wikipedia.org/wiki/User_talk:Guerillero\" title=\"User talk:Guerillero\">My Talk</a> 07:53, 20 January 2015 (UTC)</li></ul></li><li>I’ve decided to oppose this, albeit weakly. I’m hoping that the<br> other remedies regarding Ryulong will end this situation, but I don’t<br> quite think a siteban is the best course forward here. <a href=\"https://en.wikipedia.org/wiki/User:GorillaWarfare\" title=\"User:GorillaWarfare\">GorillaWarfare</a> <a href=\"https://en.wikipedia.org/wiki/User_talk:GorillaWarfare\" title=\"User talk:GorillaWarfare\">(talk)</a> 02:32, 23 January 2015 (UTC)</br></br></li><li>— <a href=\"https://en.wikipedia.org/wiki/User:Euryalus\" title=\"User:Euryalus\">Euryalus</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:Euryalus\" title=\"User talk:Euryalus\">talk</a>) 05:13, 23 January 2015 (UTC)</li><li>Given the circumstances here, I don’t think this is called for. For<br> clarity’s sake, though, this is very likely the absolute last chance. <a href=\"https://en.wikipedia.org/wiki/User:Seraphimblade\" title=\"User:Seraphimblade\">Seraphimblade</a> <a href=\"https://en.wikipedia.org/wiki/User_talk:Seraphimblade\" title=\"User talk:Seraphimblade\">Talk to me</a> 01:14, 24 January 2015 (UTC)</br></li><li><b><a href=\"https://en.wikipedia.org/wiki/User:LFaraone\" title=\"User:LFaraone\">L</a><a href=\"https://en.wikipedia.org/wiki/User_talk:LFaraone\" title=\"User talk:LFaraone\">Faraone</a></b> 18:45, 24 January 2015 (UTC)</li></ol><p>Abstain:<br/></p><ol><li>I find my view on this changing from day to day, so it would be fairer if I abstained. <b><a href=\"https://en.wikipedia.org/wiki/User:DGG\" title=\"User:DGG\">DGG</a></b> ( <a href=\"https://en.wikipedia.org/wiki/User_talk:DGG\" title=\"User talk:DGG\">talk</a> ) 20:47, 22 January 2015 (UTC)</li></ol><p>Comments:<br> <br> <s>Noting that I skipped this intentionally—still thinking on it and will come back soon. <a href=\"https://en.wikipedia.org/wiki/User:GorillaWarfare\" title=\"User:GorillaWarfare\">GorillaWarfare</a> <a href=\"https://en.wikipedia.org/wiki/User_talk:GorillaWarfare\" title=\"User talk:GorillaWarfare\">(talk)</a> 17:23, 22 January 2015 (UTC)</s></br></br></p><ul><li>@<a href=\"https://en.wikipedia.org/wiki/User:NativeForeigner\" title=\"User:NativeForeigner\">NativeForeigner</a>: I tried to fix the numbering, but clarification of your exact meaning would be useful here. <a href=\"https://en.wikipedia.org/wiki/User:Courcelles\" title=\"User:Courcelles\">Courcelles</a> 20:01, 27 January 2015 (UTC)</li></ul></blockquote><p>Of course, a perusal of the process tends to illustrate why Wikipedia is so hapless when it comes to policing outrageous behavior by its editors. Because it was started by an SJW-sympathetic individual and was rapidly taken over by SJWs of varying rabidity, the site remains hopelessly biased and largely worthless on anything of even moderate political contention.</p><p><a name=\"more\"></a> That being said, it is good to see that Wikipedia is trying to clean up its act, even if it is going about it in a manner that makes Sisyphus look productive. But they simply refuse to see that the way they cherry-pick which sources are deemed reliable and which are not is what produces the intrinsic left-wing bias. The SJW editor who sits on the Wikipedia page about me and tries to publicize as much negative information as possible while minimizing any positive information shows how he evades the point on the Talk page there:</p><blockquote class=\"tr_bq\"><p> Many of the recent additions to this article seem to be the direct result of <a class=\"external text\" href=\"http://www.milobookclub.com/2014/08/07/he-doth-protest-too-muc/\" rel=\"nofollow\">Mr. Beale’s recent blog post</a><br> in which he commented that Wikipedia is unfairly and dishonestly<br> excluding material on his views: “Does [the ‘Views section in the<br> Wikipedia article] describe my views at all? Are the totality of my<br> views really limited to little more than a feud with John Scalzi and my<br> expulsion from SFWA? Do I have no opinions on economics, politics,<br> philosophy, literature, and religion despite having written books on the<br> former and the latter? It’s telling, too, to observe that if the<br> so-called feud and the expulsion are the only significant aspects of my<br> views, there is no mention of the connection between the former and the<br> latter.”</br></br></br></br></br></br></br></br></br></br></p><p>Mr. Beale then gave a brief description of his views on economics — he feels that the <a href=\"https://en.wikipedia.org/wiki/Austrian_School\" title=\"Austrian School\">Austrian School</a><br> is currently the best explanation available, but is ultimately flawed<br> for various reasons — and stated that “(t)hose are my actual views on<br> the subject. That is the absolute truth. Post them on Wikipedia and<br> they’ll be suppressed within 24 hours.”</br></br></br></br></p><p>This, I believe, is indicative of a general misunderstanding. Of<br> course Mr. Beale has a great many more views than are provided in this<br> article; for instance, he has expressed an appreciation for the writing<br> of <a href=\"https://en.wikipedia.org/wiki/Frank_Herbert\" title=\"Frank Herbert\">Frank Herbert</a> and a dislike for that of <a href=\"https://en.wikipedia.org/wiki/Patrick_Rothfuss\" title=\"Patrick Rothfuss\">Patrick Rothfuss</a>.<br> I’m certain he also has food preferences, and opinions on the best way<br> to teach mathematics to children. He may even have discussed these views<br> in posts to his blog. But the mere fact that Mr. Beale has a view on a<br> subject does not indisputably lead to the conclusion that the view<br> should be included in Wikipedia’s biography of him, not even if he <i>has</i><br> made a blog post in which he explicitly states that view. Rather, the<br> views which are (or should be) included are those which have drawn <i>significant independent external attention</i>. I hope that this explanation will satisfy the readers of Mr. Beale’s blog, and possibly even Mr. Beale himself. <a href=\"https://en.wikipedia.org/wiki/User:DragonflySixtyseven\" title=\"User:DragonflySixtyseven\">DS</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:DragonflySixtyseven\" title=\"User talk:DragonflySixtyseven\">talk</a>) 14:42, 8 August 2014</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is the height of absurdity. I misunderstand nothing. Nor do you, my readers. There is FAR MORE <i>significant independent external attention</i> that has been paid to my views on economics, religion, and the history of war than have ever been paid to my views on immigration or race, much less my “Feud with John Scalzi”. I have NEVER done an interview about the latter; Scalzi himself did only one. I did over thirty interviews, some on national radio, about economics subsequent to the release of THE RETURN OF THE GREAT DEPRESSION and more than twenty related to THE IRRATIONAL ATHEIST.</p><p>Transcripts and links to some of those interviews are available on my blog. My views are clearly expressed in them – again, on national radio shows, and even in one case, television – and yet every last trace of those views have been methodically scrubbed from Wikipedia by the likes of DragonFlySixtyseven.</p><p>Here is just one of many possible examples pulled from my email. There are over 75 similar emails from different media outlets ranging from Fox News to the Saturday Evening Post. But in the impartial eyes of the Wikipedia editors, the cumulative total of that <i>independent external attention</i> is less significant and notable than John Scalzi talking about himself on his blog that gets less than half the traffic of this one.</p><p>INTERVIEW CONFIRMATION<br> NAME:  Vox Day                     <br> TOPIC:  The Irrational Atheist<br> DATE:  Tuesday, October 21, 2008<br> INTERVIEW TIME:  11:15 – 11:55 am ET<br> LENGTH OF INTERVIEW:  40 minutes<br/> MEDIA:  Christian Radio Network – over 200 stations in 34 states, 19 affiliates and in Canada</br></br></br></br></br></p><p>I can’t speak to the accuracy of the rest of Wikipedia, but my page is mostly nonsense from start to finish. I mean, it actually says that I was <i>born in Minnesota</i>.</p></div>",
  "content_text": "One of Wikipedia’s worst SJWs, the anti-GamerGate Ryulong,\nhas been banned indefinitely\nfor his all-too-typical thought-policing:\nRyulong banned\n5.3) (Was 4.5)\nRyulong\n(\ntalk\n·\ncontribs\n·\nlogs\n·\nedit filter log\n·\nblock log\n)\nis indefinitely banned from the English Language Wikipedia. They may\nrequest reconsideration of the ban twelve months after the enactment of\nthis remedy, and every twelve months thereafter.\nSupport:\n(first choice) As always, banning someone is not something we should\nwant\nto do, but sometimes it is the best thing for the project. Ryulong has\nacted very poorly in this topic area, and it is clear that previous\nsanctions and blocks have failed to have the desired effect of ending\ndisruptive behavior. A revolving door of speedy topic bans, chasing the\nproblem from area to another, is not the answer. This is. I sincerely\nhope that at some point in the future he will be able to return and be a\nproductive member of this community again, but for now he needs to go.\nBeeblebrox\n(\ntalk\n) 23:15, 19 January 2015 (UTC)\nWill prioritise later if need be,\nRoger Davies\ntalk\n23:38, 19 January 2015 (UTC)\nEqual first choice,\nRoger Davies\ntalk\n11:31, 21 January 2015 (UTC)\nFirst choice.\nDer Wohltemperierte Fuchs\n(\ntalk\n) 23:56, 19 January 2015 (UTC)\nLast Choice\nI would love to not do this but I don’t think anything else has a snowball’s chance of passing —\nIn actu (Guerillero)\n|\nMy Talk\n01:15, 21 January 2015 (UTC)\nFirst choice.\nSalvio\nLet’s talk about it!\n10:46, 21 January 2015 (UTC)\nLast choice of presented options (Right now). I think if we’re\ndealing with this on a purely pragmatic level this might be best for the\nproject, but I do think that it would only be fair to attempt to apply\nsome of the alternatives first, although I’m a bit concerned as to their\npotential efficacy, given the history.\nNativeForeigner\nTalk\n07:26, 23 January 2015 (UTC)\nNonetheless, support.\nNativeForeigner\nTalk\n19:48, 27 January 2015 (UTC)\nT. Canens\n(\ntalk\n) 17:12, 23 January 2015 (UTC)\nIf the 1RR does not pass, then first choice of what’s left. Still\noppose if the 1RR somehow moves back to passing. The more I look at the\nhistory here, the more I am sure the problems are far wider than just\nthis single topic, as I see it, Ryulong doesn’t seem able to “hold his\nfire”, and not get into edit wars. This also, per his block log, is\nindependent of topic areas. Without very, very strong measures to stop\nthem from continuing to edit war throughout the encyclopedia, I don’t\nthink we have any other choice. Also, even to this morning, I still see\nevidence of ongoing battleground mentality. I really, really don’t like\nthis, but I can’t support their staying on the project without a strict\n1RR and a topic ban at this point. And only one of those is going to\npass.\nCourcelles\n22:02, 26 January 2015 (UTC)\nOppose:\nMy mind is open on the other proposed remedies, but I will certainly not be supporting this.\nNewyorkbrad\n(\ntalk\n) 03:41, 20 January 2015 (UTC)\nNeither will I. Need to contemplate the rest of it, but this is not the solution.\nCourcelles\n03:48, 20 January 2015 (UTC)\nExcessive in the circumstances. I’m open to some alternative.\nDGG\n(\ntalk\n) 05:33, 20 January 2015 (UTC)\nI would like to try something else. —\nGuerillero\n|\nMy Talk\n07:53, 20 January 2015 (UTC)\nI’ve decided to oppose this, albeit weakly. I’m hoping that the\nother remedies regarding Ryulong will end this situation, but I don’t\nquite think a siteban is the best course forward here.\nGorillaWarfare\n(talk)\n02:32, 23 January 2015 (UTC)\n—\nEuryalus\n(\ntalk\n) 05:13, 23 January 2015 (UTC)\nGiven the circumstances here, I don’t think this is called for. For\nclarity’s sake, though, this is very likely the absolute last chance.\nSeraphimblade\nTalk to me\n01:14, 24 January 2015 (UTC)\nL\nFaraone\n18:45, 24 January 2015 (UTC)\nAbstain:\nI find my view on this changing from day to day, so it would be fairer if I abstained.\nDGG\n(\ntalk\n) 20:47, 22 January 2015 (UTC)\nComments:\nNoting that I skipped this intentionally—still thinking on it and will come back soon.\nGorillaWarfare\n(talk)\n17:23, 22 January 2015 (UTC)\n@\nNativeForeigner\n: I tried to fix the numbering, but clarification of your exact meaning would be useful here.\nCourcelles\n20:01, 27 January 2015 (UTC)\nOf course, a perusal of the process tends to illustrate why Wikipedia is so hapless when it comes to policing outrageous behavior by its editors. Because it was started by an SJW-sympathetic individual and was rapidly taken over by SJWs of varying rabidity, the site remains hopelessly biased and largely worthless on anything of even moderate political contention.\nThat being said, it is good to see that Wikipedia is trying to clean up its act, even if it is going about it in a manner that makes Sisyphus look productive. But they simply refuse to see that the way they cherry-pick which sources are deemed reliable and which are not is what produces the intrinsic left-wing bias. The SJW editor who sits on the Wikipedia page about me and tries to publicize as much negative information as possible while minimizing any positive information shows how he evades the point on the Talk page there:\nMany of the recent additions to this article seem to be the direct result of\nMr. Beale’s recent blog post\nin which he commented that Wikipedia is unfairly and dishonestly\nexcluding material on his views: “Does [the ‘Views section in the\nWikipedia article] describe my views at all? Are the totality of my\nviews really limited to little more than a feud with John Scalzi and my\nexpulsion from SFWA? Do I have no opinions on economics, politics,\nphilosophy, literature, and religion despite having written books on the\nformer and the latter? It’s telling, too, to observe that if the\nso-called feud and the expulsion are the only significant aspects of my\nviews, there is no mention of the connection between the former and the\nlatter.”\nMr. Beale then gave a brief description of his views on economics — he feels that the\nAustrian School\nis currently the best explanation available, but is ultimately flawed\nfor various reasons — and stated that “(t)hose are my actual views on\nthe subject. That is the absolute truth. Post them on Wikipedia and\nthey’ll be suppressed within 24 hours.”\nThis, I believe, is indicative of a general misunderstanding. Of\ncourse Mr. Beale has a great many more views than are provided in this\narticle; for instance, he has expressed an appreciation for the writing\nof\nFrank Herbert\nand a dislike for that of\nPatrick Rothfuss\n.\nI’m certain he also has food preferences, and opinions on the best way\nto teach mathematics to children. He may even have discussed these views\nin posts to his blog. But the mere fact that Mr. Beale has a view on a\nsubject does not indisputably lead to the conclusion that the view\nshould be included in Wikipedia’s biography of him, not even if he\nhas\nmade a blog post in which he explicitly states that view. Rather, the\nviews which are (or should be) included are those which have drawn\nsignificant independent external attention\n. I hope that this explanation will satisfy the readers of Mr. Beale’s blog, and possibly even Mr. Beale himself.\nDS\n(\ntalk\n) 14:42, 8 August 2014\nThis is the height of absurdity. I misunderstand nothing. Nor do you, my readers. There is FAR MORE\nsignificant independent external attention\nthat has been paid to my views on economics, religion, and the history of war than have ever been paid to my views on immigration or race, much less my “Feud with John Scalzi”. I have NEVER done an interview about the latter; Scalzi himself did only one. I did over thirty interviews, some on national radio, about economics subsequent to the release of THE RETURN OF THE GREAT DEPRESSION and more than twenty related to THE IRRATIONAL ATHEIST.\nTranscripts and links to some of those interviews are available on my blog. My views are clearly expressed in them – again, on national radio shows, and even in one case, television – and yet every last trace of those views have been methodically scrubbed from Wikipedia by the likes of DragonFlySixtyseven.\nHere is just one of many possible examples pulled from my email. There are over 75 similar emails from different media outlets ranging from Fox News to the Saturday Evening Post. But in the impartial eyes of the Wikipedia editors, the cumulative total of that\nindependent external attention\nis less significant and notable than John Scalzi talking about himself on his blog that gets less than half the traffic of this one.\nINTERVIEW CONFIRMATION\nNAME:  Vox Day\nTOPIC:  The Irrational Atheist\nDATE:  Tuesday, October 21, 2008\nINTERVIEW TIME:  11:15 – 11:55 am ET\nLENGTH OF INTERVIEW:  40 minutes\nMEDIA:  Christian Radio Network – over 200 stations in 34 states, 19 affiliates and in Canada\nI can’t speak to the accuracy of the rest of Wikipedia, but my page is mostly nonsense from start to finish. I mean, it actually says that I was\nborn in Minnesota\n.",
  "tags": [
    "media",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-28T13:00:00+00:00"
}