{
  "url": "https://voxday.net/2015/01/29/the-future-of-sf/",
  "scraped_at": "2025-12-16T12:43:31.098470",
  "title": "The future of SF",
  "date_display": "January 29, 2015",
  "date_iso": "2015-01-29T16:28:00+00:00",
  "date_from_url": "2015-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://takimag.com/article/science_fiction_for_the_fourth_generation_ann_sterzinger/print#axzz3QDgpVNYh\">“Science Fiction for the Fourth Generation”</a>: Ann Sterzinger reviews <b><a href=\"http://www.amazon.com/Riding-Red-Horse-Christopher-Nuttall-ebook/dp/B00QZD9H5K/ref=asap_bc?ie=UTF8\"><i>Riding the Red Horse</i></a></b> in Taki’s Magazine:</p><blockquote class=\"tr_bq\"><p> Here’s a brilliant idea for an anthology: collect essays about the changing face of war and war technology, then alternate them with short stories and novel excerpts from the cutting edge of military-focused sci-fi and fantasy.</p><p>Riding the Red Horse, edited by fantasy star Vox Day and Army Ranger vet Tom Kratman for Castalia House, is a tailor-made compromise for those time-pressed souls who find the consumption of unalloyed fiction to be too useless a practice in which to indulge. It’s also a treat for sci-fi readers who retain an interest in the world around them—and the two groups’ overlap is large enough to make it a very good idea indeed.</p><p>Every tale or essay is fronted by an editor’s introduction, placed conveniently before each piece rather than in some tedious index or intro; they perk up the reader’s ears for the key factual and speculative themes of the collection.</p><p>Essays are fully half the mix, with the fiction serving as not only pleasure reading but as exercises in imagining how the technological and population changes the essayists describe might play out in the future. The tone is set early on by William S. Lind’s discussion of the four generations of modern war strategy, in “Understanding 4th Generation War.”</p><p>Lind’s unsettling conclusion is that the U.S. military is stuck in the second-generation mindset used by the French in World War I, while our adversaries—particularly those who aren’t based in a state, i.e. the jihad—have moved on to an updated version of pre-nation-state warfare, where neither the battlefield nor the combatants are clearly defined. Lind writes:<i> </i></p><p><i>We have no magic solutions to offer, only some thoughts. We recognized from the outset that the whole task might be hopeless; state militaries might not be able to come to grips with Fourth Generation enemies no matter what they do. …</i></p><p><i>“Wherever people go, conflict seems to follow, and one always prefers to be on the winning side—so we might as well be ready for the physics problems we’ll encounter if the conflicts move into outer space.”</i></p><p>His essay is preceded by a dramatic fictional illustration of the unpredictability of the near future of war, albeit a state-based one: Eric S. Raymond’s “Sucker Punch,” a near-future military tale in which an American attempt to stop a Chinese invasion of Taiwan is rendered both impossible and unnecessary by the gruesome new weapons both sides have in store for each other.</p><p>The American pilots’ disorientation is so stark as to be almost darkly humorous:<i> </i></p><p><i>“Hey. What are those flashes from the tin cans?”</i></p><p><i>Blazer: “Cool off. We’re stealthed, and radar’s clear. They’ve got nothing in the air that can hit us at angels twenty.”</i></p><p><i>Blazer’s plane disintegrated less than three seconds later.</i></p><p><i> </i>This is what future sci-fi is going to look like, this collection predicts: as nervous as its past, with future-tech tactical guesses mixed into the drama. (Although if you prefer your sci-fi laced with humor, the winner in the anthology is longtime Navy fleet veteran Thomas Mays’ “Within This Horizon”—with Rzasa’s solo contribution, “Turncoat,” as an oddly touching runner-up.)</p><p>This focus on military realism doesn’t surprise me in a Vox Day-branded anthology. What makes <i>A Throne of Bones</i>, the fantasy series that gave Day his name, outstanding is the weakness of his magician characters—which makes his military generals work harder, which is more interesting to read than the standard Robert Jordan-type fantasy plot wherein Rand Al-Thor points at your army and it disappears. The authors in this anthology are reclaiming the same logic for sci-fi; instead of seeing the limitations of physics as an inconvenience to be juked around, they turn them into the driving power of their story lines.</p><p>The stories and essays talk back to each other in this manner<br> constantly; regardless of whether their predictions will be accurate—my<br> own military and technological knowledge is too poor to place any<br> bets—they result in a conversation so entertaining and stimulating that<br> the reader feels most privileged to listen in, especially for an entry<br> fee of five dollars.</br></br></br></br></br></p></blockquote><p> <i>Riding the Red Horse</i> hasn’t been what one would call extensively reviewed in the SF press, but you know, I think we can live with that. This is just an excerpt from a fairly long and detailed review, so you’ll want to <a href=\"http://takimag.com/article/science_fiction_for_the_fourth_generation_ann_sterzinger/print#axzz3QDgpVNYh\">read the whole thing</a>.</p><p> UPDATE: We were just informed that one of our authors has been nominated for the 2015 Prometheus Award. <a href=\"http://www.castaliahouse.com/prometheus-award-nominee/\">Go to the Castalia House blog</a> to find out who it is!</p></div>",
  "content_text": "“Science Fiction for the Fourth Generation”\n: Ann Sterzinger reviews\nRiding the Red Horse\nin Taki’s Magazine:\nHere’s a brilliant idea for an anthology: collect essays about the changing face of war and war technology, then alternate them with short stories and novel excerpts from the cutting edge of military-focused sci-fi and fantasy.\nRiding the Red Horse, edited by fantasy star Vox Day and Army Ranger vet Tom Kratman for Castalia House, is a tailor-made compromise for those time-pressed souls who find the consumption of unalloyed fiction to be too useless a practice in which to indulge. It’s also a treat for sci-fi readers who retain an interest in the world around them—and the two groups’ overlap is large enough to make it a very good idea indeed.\nEvery tale or essay is fronted by an editor’s introduction, placed conveniently before each piece rather than in some tedious index or intro; they perk up the reader’s ears for the key factual and speculative themes of the collection.\nEssays are fully half the mix, with the fiction serving as not only pleasure reading but as exercises in imagining how the technological and population changes the essayists describe might play out in the future. The tone is set early on by William S. Lind’s discussion of the four generations of modern war strategy, in “Understanding 4th Generation War.”\nLind’s unsettling conclusion is that the U.S. military is stuck in the second-generation mindset used by the French in World War I, while our adversaries—particularly those who aren’t based in a state, i.e. the jihad—have moved on to an updated version of pre-nation-state warfare, where neither the battlefield nor the combatants are clearly defined. Lind writes:\nWe have no magic solutions to offer, only some thoughts. We recognized from the outset that the whole task might be hopeless; state militaries might not be able to come to grips with Fourth Generation enemies no matter what they do. …\n“Wherever people go, conflict seems to follow, and one always prefers to be on the winning side—so we might as well be ready for the physics problems we’ll encounter if the conflicts move into outer space.”\nHis essay is preceded by a dramatic fictional illustration of the unpredictability of the near future of war, albeit a state-based one: Eric S. Raymond’s “Sucker Punch,” a near-future military tale in which an American attempt to stop a Chinese invasion of Taiwan is rendered both impossible and unnecessary by the gruesome new weapons both sides have in store for each other.\nThe American pilots’ disorientation is so stark as to be almost darkly humorous:\n“Hey. What are those flashes from the tin cans?”\nBlazer: “Cool off. We’re stealthed, and radar’s clear. They’ve got nothing in the air that can hit us at angels twenty.”\nBlazer’s plane disintegrated less than three seconds later.\nThis is what future sci-fi is going to look like, this collection predicts: as nervous as its past, with future-tech tactical guesses mixed into the drama. (Although if you prefer your sci-fi laced with humor, the winner in the anthology is longtime Navy fleet veteran Thomas Mays’ “Within This Horizon”—with Rzasa’s solo contribution, “Turncoat,” as an oddly touching runner-up.)\nThis focus on military realism doesn’t surprise me in a Vox Day-branded anthology. What makes\nA Throne of Bones\n, the fantasy series that gave Day his name, outstanding is the weakness of his magician characters—which makes his military generals work harder, which is more interesting to read than the standard Robert Jordan-type fantasy plot wherein Rand Al-Thor points at your army and it disappears. The authors in this anthology are reclaiming the same logic for sci-fi; instead of seeing the limitations of physics as an inconvenience to be juked around, they turn them into the driving power of their story lines.\nThe stories and essays talk back to each other in this manner\nconstantly; regardless of whether their predictions will be accurate—my\nown military and technological knowledge is too poor to place any\nbets—they result in a conversation so entertaining and stimulating that\nthe reader feels most privileged to listen in, especially for an entry\nfee of five dollars.\nRiding the Red Horse\nhasn’t been what one would call extensively reviewed in the SF press, but you know, I think we can live with that. This is just an excerpt from a fairly long and detailed review, so you’ll want to\nread the whole thing\n.\nUPDATE: We were just informed that one of our authors has been nominated for the 2015 Prometheus Award.\nGo to the Castalia House blog\nto find out who it is!",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-29T16:28:00+00:00"
}