{
  "url": "https://voxday.net/2015/01/14/the-tipping-poin/",
  "scraped_at": "2025-12-16T12:41:42.374795",
  "title": "The tipping point",
  "date_display": "January 14, 2015",
  "date_iso": "2015-01-14T15:39:00+00:00",
  "date_from_url": "2015-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"widget storyContent article widget-editable viziwyg-section-1024 inpage-widget-8939454 articleContent\"> It appears Netanyahu should have addressed <a href=\"http://www.independent.co.uk/news/uk/home-news/the-new-antisemitism-majority-of-british-jews-feel-they-have-no-future-in-uk-says-new-study-9976310.html\">the Jews of Britain</a>, as well as the Jews of France:<blockquote class=\"tr_bq\"><p> More than half of British Jewish people fear Jews have no future in<br> the UK, according to a new study which also reveals that antisemitic<br> sentiments are more prevalent than widely believed. British society is at a “tipping point” with Jewish families<br> increasingly questioning whether to stay in the country, campaigners<br> claim today.</br></br></br></br></p><p>The warning is bolstered by a new YouGov poll showing<br> that 45 per cent of Britons agreed with at least one of four<br> antisemitic statements put to them. Some 25 per cent agreed with the<br> idea that “Jews chase money more than other British people” while one in<br> five accepted as true that “Jews’ loyalty to Israel makes them less<br> loyal to Britain than other British people”. A further 13 per cent<br> said of those surveyed in the poll commissioned by the Campaign Against<br> Antisemitism (CAA) agreed that “Jews talk about the Holocaust too much<br> in order to get sympathy”.</br></br></br></br></br></br></br></br></p></blockquote></div><p>It seems rather obvious that they don’t have any long-term future in the UK. Great Britain is no more the proper home of the Jewish people any more than France, the USA, or China. The diaspora is over and it is absolutely absurd to say that France and Britain and the USA are all part and parcel of a vast globe-spanning home for less than 15 million people.</p><p>I tend to think the 45 percent figure cited is far too low. I cannot imagine that four out of five British people genuinely believe that any Jew, particularly one with an Israeli passport, is as loyal to Great Britain as an actual Brit is, unless by “other British people” they were thinking of the mainstream political elite. I daresay most Jews in Britain not named “Milliband” are considerably more loyal to Great Britain than David Cameron or Nick Clegg. But it’s a stupid characterization anyway, as it’s not “anti-semitic” to believe a Jew is primarily loyal to Israel. I should think it’s downright anti-semitic to insist otherwise. Every American living in London I know would be downright offended at the idea that he might be more loyal to the Queen of England than to the Stars and Stripes.</p><p>Hell, it’s hard for most of them to go more than a week without reminding an unsuspecting Englishman that “we kicked your ass in 1776 and if it weren’t for us, you’d be speaking German.” On the other hand, some of my English friends do still insist on referring to the US as “the Colonies”.</p><p>What I think most people fail to understand is that nationalism is not rooted in hate, but in love. It is love for one’s own people, one’s own kind. The artificial substitution of “country”, as in the sense of “geographical place with a government” for “nation” in the sense of “genetically kindred people”, has confused the issue for a long time.</p><p>Nationalism is why “Sweet Home Alabama” strikes a deep chord in everyone who hears it, even if they have never been in the United States and couldn’t find Alabama on a map. It’s a love song by a southern man to his own people, and even if we don’t share that particular love, we understand it, we recognize it. And anyhow, Southern Man need not hate Neil Young to know he doesn’t need Neil Young around.</p><p>Citizenship is ersatz nationalism. It is false, it is fake. Unless you understand the difference between citizenship and nationalism, you will not be able to make much sense of the events of the coming decades.</p></div>",
  "content_text": "It appears Netanyahu should have addressed\nthe Jews of Britain\n, as well as the Jews of France:\nMore than half of British Jewish people fear Jews have no future in\nthe UK, according to a new study which also reveals that antisemitic\nsentiments are more prevalent than widely believed. British society is at a “tipping point” with Jewish families\nincreasingly questioning whether to stay in the country, campaigners\nclaim today.\nThe warning is bolstered by a new YouGov poll showing\nthat 45 per cent of Britons agreed with at least one of four\nantisemitic statements put to them. Some 25 per cent agreed with the\nidea that “Jews chase money more than other British people” while one in\nfive accepted as true that “Jews’ loyalty to Israel makes them less\nloyal to Britain than other British people”. A further 13 per cent\nsaid of those surveyed in the poll commissioned by the Campaign Against\nAntisemitism (CAA) agreed that “Jews talk about the Holocaust too much\nin order to get sympathy”.\nIt seems rather obvious that they don’t have any long-term future in the UK. Great Britain is no more the proper home of the Jewish people any more than France, the USA, or China. The diaspora is over and it is absolutely absurd to say that France and Britain and the USA are all part and parcel of a vast globe-spanning home for less than 15 million people.\nI tend to think the 45 percent figure cited is far too low. I cannot imagine that four out of five British people genuinely believe that any Jew, particularly one with an Israeli passport, is as loyal to Great Britain as an actual Brit is, unless by “other British people” they were thinking of the mainstream political elite. I daresay most Jews in Britain not named “Milliband” are considerably more loyal to Great Britain than David Cameron or Nick Clegg. But it’s a stupid characterization anyway, as it’s not “anti-semitic” to believe a Jew is primarily loyal to Israel. I should think it’s downright anti-semitic to insist otherwise. Every American living in London I know would be downright offended at the idea that he might be more loyal to the Queen of England than to the Stars and Stripes.\nHell, it’s hard for most of them to go more than a week without reminding an unsuspecting Englishman that “we kicked your ass in 1776 and if it weren’t for us, you’d be speaking German.” On the other hand, some of my English friends do still insist on referring to the US as “the Colonies”.\nWhat I think most people fail to understand is that nationalism is not rooted in hate, but in love. It is love for one’s own people, one’s own kind. The artificial substitution of “country”, as in the sense of “geographical place with a government” for “nation” in the sense of “genetically kindred people”, has confused the issue for a long time.\nNationalism is why “Sweet Home Alabama” strikes a deep chord in everyone who hears it, even if they have never been in the United States and couldn’t find Alabama on a map. It’s a love song by a southern man to his own people, and even if we don’t share that particular love, we understand it, we recognize it. And anyhow, Southern Man need not hate Neil Young to know he doesn’t need Neil Young around.\nCitizenship is ersatz nationalism. It is false, it is fake. Unless you understand the difference between citizenship and nationalism, you will not be able to make much sense of the events of the coming decades.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-14T15:39:00+00:00"
}