{
  "url": "https://voxday.net/2015/01/29/the-iron-law-in-usaf/",
  "scraped_at": "2025-12-16T12:43:29.289297",
  "title": "The Iron Law in the USAF",
  "date_display": "January 29, 2015",
  "date_iso": "2015-01-29T13:30:00+00:00",
  "date_from_url": "2015-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jerry Pournelle posts an informative and timely explanation of the US Air Force’s self-assisted <a href=\"http://www.jerrypournelle.com/chaosmanor/moving-to-a-new-machine-patience-wins-more-on-air-war/\">decline into military irrelevance</a>:</p><blockquote class=\"tr_bq\"><p> The heart of the USAF’s institutional culture was Strategic Air Command (SAC). It was where the pilots that learned how to do teamwork, logistics and (nuclear) strategy. That was where officers were groomed for senior flag rank command slots.</p><p>When SAC was stood down, Tactical Air Command (TAC) took over in the form of the renamed Air Combat Command (ACC). We are talking fighter jocks, the prima donna’s, the cowboys. The anti-intellectuals who are scared to death of people smarter than they are. Look what happened after the Gulf War when ACC was in charge.</p><p>Col. John A. Warden, the architect of the Gulf War air campaign was black balled by Gen. Horner. He retired a thrice passed over Col. at the Air Command and Staff School.</p><p>Gen. Corder — the man who put together the 1980’s USAF SEAD doctrine used so well in the Gulf War — was effectively sacked by the USAF chief of Staff (CoS) for disobeying a “strong suggestion” to lie to Congress about the need to retain the F-4G Wild Weasels. (The then CoS was trying to retain more F-15C’s in the force structure.) His efforts to deploy a missile warning system** to protect USAF planes was cancelled partially in retaliation.</p><p>When Corder’s allies in Congress started making noise in 1993 about the draw down of F-4G Wild Weasel and EF-111’s, the USAF put the recently retired Corder on a special six month SEAD study to satisfy them. Then the Air Staff sat on the results for close to three years. Corder, under the legal restrictions of the Reagan era secrecy laws, was thus effectively silenced while the deed was done. The downing of Capt. O’ Grady in Bosnia was a direct result of the purging of F-4G Wild Weasel and EF-111 Spark ‘Vark’s from the USAF force structure and senior ACC staff’s willing EW incompetence.</p><p>USAF CoS Fogleman, for all his faults, recognized the lack of institutional professionalism. His support of the Air Command and Staff College, Maxwell AFB, Alb. and attempts to create a USAF doctrine codifying entity like the U.S. Army’s Training and Doctrine Command (TRADOC) were what was needed.<br>Unfortunately, Fogleman could not delegate and his reforms died with his military career. The inability to delegate is a defining fault of USAF fighter pilot culture. Fogleman’s successors haven’t tried to address these core institutional issues since then. The F-22 budget wars and the real wars since 1997 have left the USAF CoS no time for anything else, assuming they were interested.</br></p><p>Jerry adds: The Iron Law even in the military, dammit. The purpose of warriors is to<br> win wars.  It takes one force to gain and keep air supremacy, another<br> to support the ground army.  The army can win without ground support if<br> the other guy also has none, and we used to plan Cold War battles in<br> which neither side had supremacy.  That was tough and the obvious<br> conclusion is that air supremacy is vital; but that does not mean that<br> support of the ground forces is not important. If the Air Force won’t<br> give it, take the mission away; and if USAF blocks that, abolish USAF<br> and bring back USAAF.</br></br></br></br></br></br></br></br></p></blockquote><p> <a name=\"more\"></a> There is real evidence surfacing that the Iron Law has taken over to such a degree that the bureaucrats in the USAF are literally <a href=\"http://www.kansascity.com/news/government-politics/article8499242.html\">more loyal to their bureaucracy</a> than to the country they are sworn to serve:</p><div id=\"content-body-3502-8499242\"><blockquote class=\"tr_bq\"><p> The Air Force is investigating allegations that the No. 2 commander<br> at its prestigious Air Combat Command told lower-ranking officers that<br> talking to members of Congress about the capabilities of the A-10 attack<br> aircraft is tantamount to treason.</br></br></br></p><p>The alleged comment by Maj.<br> Gen. James Post has stirred concern in Congress about the Air Force<br> muzzling officers in violation of their legal rights. “This is<br> very serious, to accuse people of treason for communicating with<br> Congress,” Sen. Kelly Ayotte, R-New Hampshire, told Gen. Mark Welsh, the<br> Air Force chief of staff, who testified Wednesday before the Senate<br> Armed Services Committee.</br></br></br></br></br></br></p><p>Post is reported to have told Air Force<br> officers attending a recent weapons and tactics conference in Nevada<br> that it is their duty to support the service’s budget priorities by<br> refraining from offering opinions inconsistent with those priorities.<br> Air Force leaders have proposed retiring the A-10 fleet but Congress has<br> refused, and some inside the Air Force have sided with Congress.</br></br></br></br></br></p></blockquote><p>I see no point in a separate air force anymore. It has an insulated and myopic perspective on war that is entirely backwards, it is on the verge of being technologically irrelevant, and it simply cannot deliver the results it promises. Give ground support to the Army and Marines, give air and space supremacy to the Navy, and be done with it.</p></div></div>",
  "content_text": "Jerry Pournelle posts an informative and timely explanation of the US Air Force’s self-assisted\ndecline into military irrelevance\n:\nThe heart of the USAF’s institutional culture was Strategic Air Command (SAC). It was where the pilots that learned how to do teamwork, logistics and (nuclear) strategy. That was where officers were groomed for senior flag rank command slots.\nWhen SAC was stood down, Tactical Air Command (TAC) took over in the form of the renamed Air Combat Command (ACC). We are talking fighter jocks, the prima donna’s, the cowboys. The anti-intellectuals who are scared to death of people smarter than they are. Look what happened after the Gulf War when ACC was in charge.\nCol. John A. Warden, the architect of the Gulf War air campaign was black balled by Gen. Horner. He retired a thrice passed over Col. at the Air Command and Staff School.\nGen. Corder — the man who put together the 1980’s USAF SEAD doctrine used so well in the Gulf War — was effectively sacked by the USAF chief of Staff (CoS) for disobeying a “strong suggestion” to lie to Congress about the need to retain the F-4G Wild Weasels. (The then CoS was trying to retain more F-15C’s in the force structure.) His efforts to deploy a missile warning system** to protect USAF planes was cancelled partially in retaliation.\nWhen Corder’s allies in Congress started making noise in 1993 about the draw down of F-4G Wild Weasel and EF-111’s, the USAF put the recently retired Corder on a special six month SEAD study to satisfy them. Then the Air Staff sat on the results for close to three years. Corder, under the legal restrictions of the Reagan era secrecy laws, was thus effectively silenced while the deed was done. The downing of Capt. O’ Grady in Bosnia was a direct result of the purging of F-4G Wild Weasel and EF-111 Spark ‘Vark’s from the USAF force structure and senior ACC staff’s willing EW incompetence.\nUSAF CoS Fogleman, for all his faults, recognized the lack of institutional professionalism. His support of the Air Command and Staff College, Maxwell AFB, Alb. and attempts to create a USAF doctrine codifying entity like the U.S. Army’s Training and Doctrine Command (TRADOC) were what was needed.\nUnfortunately, Fogleman could not delegate and his reforms died with his military career. The inability to delegate is a defining fault of USAF fighter pilot culture. Fogleman’s successors haven’t tried to address these core institutional issues since then. The F-22 budget wars and the real wars since 1997 have left the USAF CoS no time for anything else, assuming they were interested.\nJerry adds: The Iron Law even in the military, dammit. The purpose of warriors is to\nwin wars.  It takes one force to gain and keep air supremacy, another\nto support the ground army.  The army can win without ground support if\nthe other guy also has none, and we used to plan Cold War battles in\nwhich neither side had supremacy.  That was tough and the obvious\nconclusion is that air supremacy is vital; but that does not mean that\nsupport of the ground forces is not important. If the Air Force won’t\ngive it, take the mission away; and if USAF blocks that, abolish USAF\nand bring back USAAF.\nThere is real evidence surfacing that the Iron Law has taken over to such a degree that the bureaucrats in the USAF are literally\nmore loyal to their bureaucracy\nthan to the country they are sworn to serve:\nThe Air Force is investigating allegations that the No. 2 commander\nat its prestigious Air Combat Command told lower-ranking officers that\ntalking to members of Congress about the capabilities of the A-10 attack\naircraft is tantamount to treason.\nThe alleged comment by Maj.\nGen. James Post has stirred concern in Congress about the Air Force\nmuzzling officers in violation of their legal rights. “This is\nvery serious, to accuse people of treason for communicating with\nCongress,” Sen. Kelly Ayotte, R-New Hampshire, told Gen. Mark Welsh, the\nAir Force chief of staff, who testified Wednesday before the Senate\nArmed Services Committee.\nPost is reported to have told Air Force\nofficers attending a recent weapons and tactics conference in Nevada\nthat it is their duty to support the service’s budget priorities by\nrefraining from offering opinions inconsistent with those priorities.\nAir Force leaders have proposed retiring the A-10 fleet but Congress has\nrefused, and some inside the Air Force have sided with Congress.\nI see no point in a separate air force anymore. It has an insulated and myopic perspective on war that is entirely backwards, it is on the verge of being technologically irrelevant, and it simply cannot deliver the results it promises. Give ground support to the Army and Marines, give air and space supremacy to the Navy, and be done with it.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-29T13:30:00+00:00"
}