{
  "url": "https://voxday.net/2015/01/07/the-decline-of-science-fiction-2/",
  "scraped_at": "2025-12-16T12:40:51.025200",
  "title": "The decline of science fiction",
  "date_display": "January 7, 2015",
  "date_iso": "2015-01-07T13:00:00+00:00",
  "date_from_url": "2015-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is well known that science fiction sales have declined since the 1980s, but what Daniel demonstrates in <a href=\"http://www.castaliahouse.com/evidence-for-the-bust-years-the-decline-of-science-fiction-according-to-readers/#comments\">Evidence for the Bust Years</a> is that the perceived quality of science fiction, as measured by average Amazon ratings for books representational of their year, have fallen as well:</p><blockquote class=\"tr_bq\"><p> What this chart argues is that science fiction of the 50s and 60s<br> averages better than a 4.3 rating at Amazon (and you’ll note that all<br> decades average more than 350 reviews per book, so small groups of rabid<br> reviewers really don’t factor in). The quality slides in the 1970s,<br> plummets in the 80s, recovers slightly in the 1990s, but falls back<br> below 4 throughout the 2000s.<br> <a href=\"http://i1.wp.com/www.castaliahouse.com/wp-content/uploads/2015/01/Amazon-Stars-Per-Decade-in-Science-Fiction.png?resize=256%2C192\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://i1.wp.com/www.castaliahouse.com/wp-content/uploads/2015/01/Amazon-Stars-Per-Decade-in-Science-Fiction.png?resize=256%2C192\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://i1.wp.com/www.castaliahouse.com/wp-content/uploads/2015/01/Amazon-Stars-Per-Decade-in-Science-Fiction.png?resize=256%2C192\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a><br> Now, this is just some raw data from a list of books from the past 60<br> years or so, but two things stand out to me: Science Fiction has<br> measurably fallen off in quality, at least according to readers,<br> according to this relatively blind snapshot. I’m sure we could generate<br> different results with a different list, but I want to emphasize that<br> this survey was both as random and as fair as I could muster (in fact, I<br> noticed after the fact that my list is somewhat more heavily weighted<br> toward award-winners in the decade that performed the worst!)</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This should surprise no one who has been paying attention to the corruption that is Pink SF as it has spread throughout the science fiction and fantasy genres. For me, the obvious point was when <i>The Quantum Rose</i>, a romance novel in space that was a middle book in a series virtually no one was reading, was awarded the Nebula for Best Novel in 2002. Notice that despite it supposedly being the best novel of that year, it has a paltry 29 ratings averaging 3.70.</p><p>If that was truly the best of the best, how bad was the average book that year? And if it wasn’t, then how could systematically elevating the mediocre fail to have a subsequent effect on the genre? While more comprehensive statistical work is required to make the case conclusive, this first analysis does indicate that in the eyes of the reviewers, the quality of science fiction and fantasy has objectively declined.</p></div>",
  "content_text": "It is well known that science fiction sales have declined since the 1980s, but what Daniel demonstrates in\nEvidence for the Bust Years\nis that the perceived quality of science fiction, as measured by average Amazon ratings for books representational of their year, have fallen as well:\nWhat this chart argues is that science fiction of the 50s and 60s\naverages better than a 4.3 rating at Amazon (and you’ll note that all\ndecades average more than 350 reviews per book, so small groups of rabid\nreviewers really don’t factor in). The quality slides in the 1970s,\nplummets in the 80s, recovers slightly in the 1990s, but falls back\nbelow 4 throughout the 2000s.\nNow, this is just some raw data from a list of books from the past 60\nyears or so, but two things stand out to me: Science Fiction has\nmeasurably fallen off in quality, at least according to readers,\naccording to this relatively blind snapshot. I’m sure we could generate\ndifferent results with a different list, but I want to emphasize that\nthis survey was both as random and as fair as I could muster (in fact, I\nnoticed after the fact that my list is somewhat more heavily weighted\ntoward award-winners in the decade that performed the worst!)\nThis should surprise no one who has been paying attention to the corruption that is Pink SF as it has spread throughout the science fiction and fantasy genres. For me, the obvious point was when\nThe Quantum Rose\n, a romance novel in space that was a middle book in a series virtually no one was reading, was awarded the Nebula for Best Novel in 2002. Notice that despite it supposedly being the best novel of that year, it has a paltry 29 ratings averaging 3.70.\nIf that was truly the best of the best, how bad was the average book that year? And if it wasn’t, then how could systematically elevating the mediocre fail to have a subsequent effect on the genre? While more comprehensive statistical work is required to make the case conclusive, this first analysis does indicate that in the eyes of the reviewers, the quality of science fiction and fantasy has objectively declined.",
  "tags": [
    "books",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-07T13:00:00+00:00"
}