{
  "url": "https://voxday.net/2015/01/14/the-troubling-ma/",
  "scraped_at": "2025-12-16T12:41:38.699305",
  "title": "The troubling math",
  "date_display": "January 14, 2015",
  "date_iso": "2015-01-14T09:47:00+00:00",
  "date_from_url": "2015-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Percentages are not the only problem. Quantities matter too. Ian Tuttle <a href=\"http://www.nationalreview.com/article/396262/troubling-math-muslim-migration-ian-tuttle\">points out the troubling math</a> on National Review:</p><blockquote class=\"tr_bq\"><p> Demographics may not be the whole of destiny, but they are certainly a good part, and across the Atlantic, the United States seems increasingly to be turning toward Western Europe’s most undesirable demographic trends.</p><p>In 1992, 41 percent of new permanent residents in the United States — green-card holders — hailed from the Asia-Pacific region, the Middle East and North Africa, or sub-Saharan Africa, according to the Pew Research Center. A decade later, the percentage was 53 percent. Over that same period, predictably, the number of Muslim immigrants coming to the United States annually has doubled, from 50,000 to approximately 100,000 each year. In 1992, only 5 percent of Muslim immigrants came from sub-Saharan Africa; 20 years later, it was 16 percent. Of the 2.75 million Muslims in the United States in 2011, 1.7 million were legal permanent residents.</p><p>There is no official estimate of Muslims in the U.S.; religious affiliation is not tracked by the Census Bureau. However, Pew’s estimate of 2.75 million seems to be on the lower end. The Council on American-Islamic Relations says there are approximately 7 million Muslims in the country.</p></blockquote><p>Now consider the following information about France:</p><blockquote class=\"tr_bq\"><p> According to the French Government, which does not have the right to ask direct questions about religion and uses a criterion of people’s geographic origin as a basis for calculation, there were between 5 to 6 million Muslims in metropolitan France in 2010. The government counted all those people in France who migrated from countries with a dominant Muslim population, or whose parents did. Only 33% of those 5 to 6 million people (2 million) said they were practicing believers. That figure is the same as that obtained by the INED/INSEE study in October 2010…. A Pew Forum study, published in January 2011, estimated 4.7 million Muslims in France in 2010 (and forecasted 6.9 million in 2030).</p></blockquote><p>Translation: there may already be more Muslims in the USA than in France. (NB: metropolitan does not mean urban France, but continental France.) And in percentage terms, if one uses the maximum reported numbers on both sides, the Muslim population is 2.1 percent of the US population, versus 7.6 percent for Europe. However, <a href=\"http://www.muslimpopulation.com/Europe/\">the European total</a> includes Albania, Russia, Kosovo, and Bosnia; which are either Islamic nations or contain vast semi-autonomous Islamic enclaves. Once those are removed, as Chechnya is no more properly part of Europe than Turkey or Saudi Arabia, the Islamic percentage of the European population falls to 3.9 percent. Note that about half of all Muslims resident in “Europe” are in Russia.</p><p>As one of my friends from Minnesota noted, she sees considerably more Muslims in Minneapolis than she saw in Rome last summer. I was in a moderately sized Italian city last week and I saw precisely zero. The reason for the false impression is twofold. First, Europeans keep Muslims in what are essentially Islamic ghettos in the major cities, the notorious no-go zones. Second, with the exception of the British, the Europeans are much more openly nationalistic and few consider Muslim residents to be of their nation.</p><p>But percentages are not magic. There is no precise quantity of individuals required to produce two, or ten, or one hundred, who are willing to engage in direct action. If the nation of Europe enjoy the advantage of their greater sense of nationalism and parliamentary systems that permit the rapid growth of non-mainstream parties, the American advantages are its stronger Christianity and its heavily armed population. But on neither side of the Atlantic should the pro-civilization forces assume that their eventual victory over the invasion is guaranteed. All civilizations fall in time, and the fact that the first two waves of Islamic expansion were turned back does not necessarily mean the third will be.</p></div>",
  "content_text": "Percentages are not the only problem. Quantities matter too. Ian Tuttle\npoints out the troubling math\non National Review:\nDemographics may not be the whole of destiny, but they are certainly a good part, and across the Atlantic, the United States seems increasingly to be turning toward Western Europe’s most undesirable demographic trends.\nIn 1992, 41 percent of new permanent residents in the United States — green-card holders — hailed from the Asia-Pacific region, the Middle East and North Africa, or sub-Saharan Africa, according to the Pew Research Center. A decade later, the percentage was 53 percent. Over that same period, predictably, the number of Muslim immigrants coming to the United States annually has doubled, from 50,000 to approximately 100,000 each year. In 1992, only 5 percent of Muslim immigrants came from sub-Saharan Africa; 20 years later, it was 16 percent. Of the 2.75 million Muslims in the United States in 2011, 1.7 million were legal permanent residents.\nThere is no official estimate of Muslims in the U.S.; religious affiliation is not tracked by the Census Bureau. However, Pew’s estimate of 2.75 million seems to be on the lower end. The Council on American-Islamic Relations says there are approximately 7 million Muslims in the country.\nNow consider the following information about France:\nAccording to the French Government, which does not have the right to ask direct questions about religion and uses a criterion of people’s geographic origin as a basis for calculation, there were between 5 to 6 million Muslims in metropolitan France in 2010. The government counted all those people in France who migrated from countries with a dominant Muslim population, or whose parents did. Only 33% of those 5 to 6 million people (2 million) said they were practicing believers. That figure is the same as that obtained by the INED/INSEE study in October 2010…. A Pew Forum study, published in January 2011, estimated 4.7 million Muslims in France in 2010 (and forecasted 6.9 million in 2030).\nTranslation: there may already be more Muslims in the USA than in France. (NB: metropolitan does not mean urban France, but continental France.) And in percentage terms, if one uses the maximum reported numbers on both sides, the Muslim population is 2.1 percent of the US population, versus 7.6 percent for Europe. However,\nthe European total\nincludes Albania, Russia, Kosovo, and Bosnia; which are either Islamic nations or contain vast semi-autonomous Islamic enclaves. Once those are removed, as Chechnya is no more properly part of Europe than Turkey or Saudi Arabia, the Islamic percentage of the European population falls to 3.9 percent. Note that about half of all Muslims resident in “Europe” are in Russia.\nAs one of my friends from Minnesota noted, she sees considerably more Muslims in Minneapolis than she saw in Rome last summer. I was in a moderately sized Italian city last week and I saw precisely zero. The reason for the false impression is twofold. First, Europeans keep Muslims in what are essentially Islamic ghettos in the major cities, the notorious no-go zones. Second, with the exception of the British, the Europeans are much more openly nationalistic and few consider Muslim residents to be of their nation.\nBut percentages are not magic. There is no precise quantity of individuals required to produce two, or ten, or one hundred, who are willing to engage in direct action. If the nation of Europe enjoy the advantage of their greater sense of nationalism and parliamentary systems that permit the rapid growth of non-mainstream parties, the American advantages are its stronger Christianity and its heavily armed population. But on neither side of the Atlantic should the pro-civilization forces assume that their eventual victory over the invasion is guaranteed. All civilizations fall in time, and the fact that the first two waves of Islamic expansion were turned back does not necessarily mean the third will be.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-14T09:47:00+00:00"
}