{
  "url": "https://voxday.net/2015/01/12/the-pride-of-self-gelded/",
  "scraped_at": "2025-12-16T12:41:21.823694",
  "title": "The pride of the self-gelded",
  "date_display": "January 12, 2015",
  "date_iso": "2015-01-12T13:00:00+00:00",
  "date_from_url": "2015-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Guy Gavriel Kay is one of the better fantasy authors writing today. I posted a review of his <i>The Lions of Al-Rassan</i>, which is my favorite of his books, at Recommend. But it is a shame, bordering on a tragedy, <a href=\"http://greenbelt.com/news/aslan/kay.htm\">that he doesn’t see</a> how his inclination towards atheistic secularism will prevent him from ever approaching literary greatness:</p><blockquote class=\"tr_bq\"><p> <i>The Canadian author Guy Gavriel Kay has explored the issues of faith and religious intolerance in several of his fantasy books, such as his duology “The Sarantine Mosaic,” set in a world modelled on Byzantium during the time of the Emperor Justinian. Kay’s stories echo the conflict that arose historically between such religions as paganism, Judaism, Christianity, and Islam. </i></p><p>. . . there has been a natural progression from Fionavar, through Tigana and [A Song for] Arbonne, to The Lions of Al-Rassan, away from the mythic and the fantastical, and towards the human and the historical. The progression from myth to religion is another way to describe it, not that the books are religious, but that we move away from what, in Fionavar, I’ve sometimes called a Homeric world; the gods intervene in the affairs of men, they have their own squabbles and feuds amongst themselves, and yet they’re physically present, men can sleep with the goddess, men can battle with words with the gods – the gods are present. In Tigana, magic is still there, but, for the most part, magic and its use was employed as a sustained metaphor for the eradication of culture. The major use of magic in the novel Tigana is the elimination of the name of the country Tigana, which for me was very much metaphorical. In A Song for Arbonne, we’re into a story about how religion, the organized religion, the clergy, manipulates the people with their beliefs about gods and goddesses. By the time we get to The Lions of Al-Rassan, it’s mainly about how organized religion takes away the freedom and the breathing space of individuals. So there is a natural progression, which is not to say that I know where the next book is going, that that progression is necessarily continuing.<br> <i><br>It certainly seems however that the religious dimension is not going to disappear; it’s been very strong in the last two books, and certainly The Fionavar Tapestry has, in a sense, a proto-religion at the heart of it. Can you conceive of writing a book which does not have religion as a factor?</br></i></br></p><p>Yes, I’m sure I can; I am not a religious man, what I think I am is a person keenly interested in history. When you talk about proto-religion, you’re talking about, as I said, the Homeric idea of gods and goddesses incarnate, and the progression in history away from that. I think that, if I would characterize my interest, it’s very much in the historical and mythical roots of what we have become as cultures. When I say “we”, I mean Western men and women, because that’s the culture that I feel most at home in, it’s the culture that most of us are, to some degree, shaped by. So, in that sense, the four books (treating Fionavar as one) have been incorporating that tension, but it’s not in any huge sense central to my thinking or my own work.<br> <i><br>Does that mean you might write a novel about the Enlightenment, about skepticism coming to the fore?</br></i></br></p><p>I think skepticism comes to the fore in the last two books to a great degree. I think that it’s part of the movement from myth to religion. In The Lions of Al-Rassan, one of the reasons the book is a fantasy, rather than a story about medieval Spain, even though it’s very closely modelled on real history, is that I wanted to see what would happen to people’s preconceptions and prejudices about cultures: Christian, Moslem, Jewish, if the names were changed and if the religious beliefs were rendered virtually banal: one religion worships the Sun, another worships the Moon, and another worships the stars. And out of that relatively banal conflict of ideologies, you have crushingly brutal military and psychological conflict. When you speak of skepticism, it seems to me that The Lions of Al-Rassan should be very clear for the readers: the point that underlies the detaching of these religious conflicts from their real underpinnings is that, if we step back a bit, we can start to see how much violence, how much conflict is generated by something that may be no more complex than whether you worship the Sun rising in the morning or the stars beginning to shine at night.</p></blockquote><p>It’s rather remarkable that such an intelligent and talented man can be so brutally foolish as a result of his anti-religious bias. The sad thing is that he transforms what could have been a great book into one that is merely good, and is dishonest to boot. The amusing thing is that he appears to think that his obvious biases are not readily apparent to the intelligent reader; faithless ecumenicism is the romantic ideal he portrays in the novel.</p><p>The mere fact that I could write the following while knowing nothing of the author’s religious faith, or lack there of, demonstrates the intrinsic problem of the irreligious attempting to meaningfully address religious themes.<br> <i><br/></i><br> <i>This surfeit of excellence might have been excused as a stylistic<br> statement on medieval panegyrics were it not for the author’s<br> excessively modern take on religion. Despite the plot being dependent<br> upon the conflict between the star-worshipping Asherites (Muslims),<br> sun-worshipping Jaddites (Christians) and moon-worshipping Kindath<br> (Jews), the author’s own apparent lack of religious sensibility prevents<br> the book from being as rich and moving as it easily could have been. (A<br> moment’s research confirms that Kay is not, by his own statement, a<br> religious man; it definitely shows throughout.)</br></br></br></br></br></br></br></br></i></br></br></p><p>Note that the interview proves that Kay’s portrayal of religion in the book is intentionally false and shallow<i>. </i>He does not recognize that by rendering such a false account of religion, he has undermined his own attempt to make a case against it. By detaching the “religious conflicts” from their real underpinnings, what he proves is that religion doesn’t have much, if anything, to do with violent conflicts that arise from the normal historical reasons of ambition, pride, greed, and the desire for power.</p><p>Like most secular writers, Kay fails to grasp that if he wishes to successfully attack religion, he must portray it with absolutely rigorous honesty. Because, in <i>The Lions of Al-Rassan</i>, all he has managed to accomplish in this regard is to reduce the literary value of his own work in order to demolish a strawman of his own construction. In this way, he is the anti-Eco, as Eco, despite his own secular inclinations, does his fictional characters the courtesy of taking their beliefs seriously and at face value, which is why he is the better and more memorable writer.</p><p>I have never forgotten the genuine anger in Umberto Eco’s voice when he corrected me concerning a question I asked him about the “villain” of <i>The Name of the Rose</i>: “Jorge is not the villain, he is one of the heroes … He is expressing<br> certain attitudes of his time, but I don’t consider him a villain. It is<br> a confrontation between two worldviews, and a worldview is a system of<br> ideas.”</br></br></br></p><p>That is the difference between a great writer and one who is merely a fine literary technician with a bent for storytelling. The great writer is willing to permit his characters to speak for themselves, according to their worldviews. The technician, on the other hand, insists on reducing his characters to puppets intended to express his worldview.<i><br/></i></p></div>",
  "content_text": "Guy Gavriel Kay is one of the better fantasy authors writing today. I posted a review of his\nThe Lions of Al-Rassan\n, which is my favorite of his books, at Recommend. But it is a shame, bordering on a tragedy,\nthat he doesn’t see\nhow his inclination towards atheistic secularism will prevent him from ever approaching literary greatness:\nThe Canadian author Guy Gavriel Kay has explored the issues of faith and religious intolerance in several of his fantasy books, such as his duology “The Sarantine Mosaic,” set in a world modelled on Byzantium during the time of the Emperor Justinian. Kay’s stories echo the conflict that arose historically between such religions as paganism, Judaism, Christianity, and Islam.\n. . . there has been a natural progression from Fionavar, through Tigana and [A Song for] Arbonne, to The Lions of Al-Rassan, away from the mythic and the fantastical, and towards the human and the historical. The progression from myth to religion is another way to describe it, not that the books are religious, but that we move away from what, in Fionavar, I’ve sometimes called a Homeric world; the gods intervene in the affairs of men, they have their own squabbles and feuds amongst themselves, and yet they’re physically present, men can sleep with the goddess, men can battle with words with the gods – the gods are present. In Tigana, magic is still there, but, for the most part, magic and its use was employed as a sustained metaphor for the eradication of culture. The major use of magic in the novel Tigana is the elimination of the name of the country Tigana, which for me was very much metaphorical. In A Song for Arbonne, we’re into a story about how religion, the organized religion, the clergy, manipulates the people with their beliefs about gods and goddesses. By the time we get to The Lions of Al-Rassan, it’s mainly about how organized religion takes away the freedom and the breathing space of individuals. So there is a natural progression, which is not to say that I know where the next book is going, that that progression is necessarily continuing.\nIt certainly seems however that the religious dimension is not going to disappear; it’s been very strong in the last two books, and certainly The Fionavar Tapestry has, in a sense, a proto-religion at the heart of it. Can you conceive of writing a book which does not have religion as a factor?\nYes, I’m sure I can; I am not a religious man, what I think I am is a person keenly interested in history. When you talk about proto-religion, you’re talking about, as I said, the Homeric idea of gods and goddesses incarnate, and the progression in history away from that. I think that, if I would characterize my interest, it’s very much in the historical and mythical roots of what we have become as cultures. When I say “we”, I mean Western men and women, because that’s the culture that I feel most at home in, it’s the culture that most of us are, to some degree, shaped by. So, in that sense, the four books (treating Fionavar as one) have been incorporating that tension, but it’s not in any huge sense central to my thinking or my own work.\nDoes that mean you might write a novel about the Enlightenment, about skepticism coming to the fore?\nI think skepticism comes to the fore in the last two books to a great degree. I think that it’s part of the movement from myth to religion. In The Lions of Al-Rassan, one of the reasons the book is a fantasy, rather than a story about medieval Spain, even though it’s very closely modelled on real history, is that I wanted to see what would happen to people’s preconceptions and prejudices about cultures: Christian, Moslem, Jewish, if the names were changed and if the religious beliefs were rendered virtually banal: one religion worships the Sun, another worships the Moon, and another worships the stars. And out of that relatively banal conflict of ideologies, you have crushingly brutal military and psychological conflict. When you speak of skepticism, it seems to me that The Lions of Al-Rassan should be very clear for the readers: the point that underlies the detaching of these religious conflicts from their real underpinnings is that, if we step back a bit, we can start to see how much violence, how much conflict is generated by something that may be no more complex than whether you worship the Sun rising in the morning or the stars beginning to shine at night.\nIt’s rather remarkable that such an intelligent and talented man can be so brutally foolish as a result of his anti-religious bias. The sad thing is that he transforms what could have been a great book into one that is merely good, and is dishonest to boot. The amusing thing is that he appears to think that his obvious biases are not readily apparent to the intelligent reader; faithless ecumenicism is the romantic ideal he portrays in the novel.\nThe mere fact that I could write the following while knowing nothing of the author’s religious faith, or lack there of, demonstrates the intrinsic problem of the irreligious attempting to meaningfully address religious themes.\nThis surfeit of excellence might have been excused as a stylistic\nstatement on medieval panegyrics were it not for the author’s\nexcessively modern take on religion. Despite the plot being dependent\nupon the conflict between the star-worshipping Asherites (Muslims),\nsun-worshipping Jaddites (Christians) and moon-worshipping Kindath\n(Jews), the author’s own apparent lack of religious sensibility prevents\nthe book from being as rich and moving as it easily could have been. (A\nmoment’s research confirms that Kay is not, by his own statement, a\nreligious man; it definitely shows throughout.)\nNote that the interview proves that Kay’s portrayal of religion in the book is intentionally false and shallow\n.\nHe does not recognize that by rendering such a false account of religion, he has undermined his own attempt to make a case against it. By detaching the “religious conflicts” from their real underpinnings, what he proves is that religion doesn’t have much, if anything, to do with violent conflicts that arise from the normal historical reasons of ambition, pride, greed, and the desire for power.\nLike most secular writers, Kay fails to grasp that if he wishes to successfully attack religion, he must portray it with absolutely rigorous honesty. Because, in\nThe Lions of Al-Rassan\n, all he has managed to accomplish in this regard is to reduce the literary value of his own work in order to demolish a strawman of his own construction. In this way, he is the anti-Eco, as Eco, despite his own secular inclinations, does his fictional characters the courtesy of taking their beliefs seriously and at face value, which is why he is the better and more memorable writer.\nI have never forgotten the genuine anger in Umberto Eco’s voice when he corrected me concerning a question I asked him about the “villain” of\nThe Name of the Rose\n: “Jorge is not the villain, he is one of the heroes … He is expressing\ncertain attitudes of his time, but I don’t consider him a villain. It is\na confrontation between two worldviews, and a worldview is a system of\nideas.”\nThat is the difference between a great writer and one who is merely a fine literary technician with a bent for storytelling. The great writer is willing to permit his characters to speak for themselves, according to their worldviews. The technician, on the other hand, insists on reducing his characters to puppets intended to express his worldview.",
  "tags": [
    "atheism",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-12T13:00:00+00:00"
}