{
  "url": "https://voxday.net/2015/01/08/the-rabbits-quiver/",
  "scraped_at": "2025-12-16T12:40:58.732658",
  "title": "The rabbits quiver",
  "date_display": "January 8, 2015",
  "date_iso": "2015-01-08T18:10:00+00:00",
  "date_from_url": "2015-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Two posts in which File 770 <a href=\"http://file770.com/?p=20298\">compares Sad Puppies to National Socialism</a>, me to a disease, and <a href=\"http://file770.com/?p=20315\">science fiction writers to dogs</a>.</p><blockquote class=\"tr_bq\"><p> A comment by Daniel on Vox Day’s blog put this amusing spin on yesterday’s story about the 2014 Worldcon financial report:</p><p>    Semi-on topic: thanks to record memberships, LonCon finished with a cash surplus of…</p><p>    …about £1,000.</p><p>    Without Larry and Vox last year, they would have been deep in the red.</p><p>There you have it: all the people who joined to stuff the ballot box for Larry Correia’s “Sad Puppies” slate kept the Worldcon afloat. Now I know how that English schoolboy felt in Hope and Glory when he discovered his school had been bombed by the Luftwaffe — “Thank you Adolf!”</p></blockquote><p>No doubt the pinkshirts will try to deny it, but there is no question that Sad Puppies was to the financial benefit of Worldcon. Some have tried to claim that the huge increase in memberships was the result of the con being based in London rather than the reaction to the nomination of works by Larry, Brad, me, and others, but you have only to compare the percentage increase in voting memberships to the increase in nominations to see that Sad Puppies not only inspired more involvement on the Right side of the science fiction spectrum, but on the Left side as well.</p><blockquote class=\"tr_bq\"><p> Did you hear the mournful baying of the Sad Puppies this morning? Yes, the pack is back in 2015, this time under the direction of Brad Torgersen. And his arguments for renewing this bloc voting campaign are one dogwhistle after another. Usually you can’t see these kinds of contortions outside of a circus.</p><ul><li>The Hugos are a popularity contest – but not the <i>right kind</i> of popularity.</li><li>The Hugos don’t necessarily correlate with sales success – but neither did <a href=\"http://file770.com/?p=16433\">last year’s Sad Puppies slate</a>, once you got past Larry Correia.</li><li>The Hugos “skew ideological” – Did you know they were trying to cure<br> that problem when Vox Day got a Sad Puppies endorsement last year? (I<br> thought it was only on <i>House</i> they try to cure patients by giving them another disease…)</br></br></li><li>The Hugos often ignore “successful ambassadors of the genre to the<br> consumer world at large” – That dogwhistle is at a frequency almost too<br> high for me to hear, but I believe he has <a href=\"http://file770.com/?p=18813\">a particular New York <i>Times </i>bestselling author</a> in mind.</br></br></li></ul><p>Anyway, if you felt something pushing against your “Worldcon fandom<br> zeitgeist” today — that’s because the dogs are off the leash!</br></p></blockquote><p>As one might expect, he’s missing the points.</p><ol><li>Mournful? They may not be enjoying this, but we certainly are.</li><li>The pinkshirts have long <i>denied </i>that the Hugos are a popularity contest. Sad Puppies belied, and continues to belie that argument.</li><li>No one has ever claimed Sad Puppies was about sales. That being said, an endorsement by Larry Correia can absolutely be proven to boost sales.</li><li>Again, the pinkshirts have always denied that the Hugos skew ideological. Sad Puppies disproved, and will continue to disprove that denial.</li><li>It’s not just the Hugos. For example, Chaos Horizon <a href=\"https://chaoshorizon.wordpress.com/2014/10/29/larry-correias-monster-hunter-nemesis-review-round-up/\">noted the refusal</a> of mainstream reviewers to even review <i>Monster Hunter: Nemesis</i>, considered to be a likely Hugo nominee.</li></ol></div>",
  "content_text": "Two posts in which File 770\ncompares Sad Puppies to National Socialism\n, me to a disease, and\nscience fiction writers to dogs\n.\nA comment by Daniel on Vox Day’s blog put this amusing spin on yesterday’s story about the 2014 Worldcon financial report:\nSemi-on topic: thanks to record memberships, LonCon finished with a cash surplus of…\n…about £1,000.\nWithout Larry and Vox last year, they would have been deep in the red.\nThere you have it: all the people who joined to stuff the ballot box for Larry Correia’s “Sad Puppies” slate kept the Worldcon afloat. Now I know how that English schoolboy felt in Hope and Glory when he discovered his school had been bombed by the Luftwaffe — “Thank you Adolf!”\nNo doubt the pinkshirts will try to deny it, but there is no question that Sad Puppies was to the financial benefit of Worldcon. Some have tried to claim that the huge increase in memberships was the result of the con being based in London rather than the reaction to the nomination of works by Larry, Brad, me, and others, but you have only to compare the percentage increase in voting memberships to the increase in nominations to see that Sad Puppies not only inspired more involvement on the Right side of the science fiction spectrum, but on the Left side as well.\nDid you hear the mournful baying of the Sad Puppies this morning? Yes, the pack is back in 2015, this time under the direction of Brad Torgersen. And his arguments for renewing this bloc voting campaign are one dogwhistle after another. Usually you can’t see these kinds of contortions outside of a circus.\nThe Hugos are a popularity contest – but not the\nright kind\nof popularity.\nThe Hugos don’t necessarily correlate with sales success – but neither did\nlast year’s Sad Puppies slate\n, once you got past Larry Correia.\nThe Hugos “skew ideological” – Did you know they were trying to cure\nthat problem when Vox Day got a Sad Puppies endorsement last year? (I\nthought it was only on\nHouse\nthey try to cure patients by giving them another disease…)\nThe Hugos often ignore “successful ambassadors of the genre to the\nconsumer world at large” – That dogwhistle is at a frequency almost too\nhigh for me to hear, but I believe he has\na particular New York\nTimes\nbestselling author\nin mind.\nAnyway, if you felt something pushing against your “Worldcon fandom\nzeitgeist” today — that’s because the dogs are off the leash!\nAs one might expect, he’s missing the points.\nMournful? They may not be enjoying this, but we certainly are.\nThe pinkshirts have long\ndenied\nthat the Hugos are a popularity contest. Sad Puppies belied, and continues to belie that argument.\nNo one has ever claimed Sad Puppies was about sales. That being said, an endorsement by Larry Correia can absolutely be proven to boost sales.\nAgain, the pinkshirts have always denied that the Hugos skew ideological. Sad Puppies disproved, and will continue to disprove that denial.\nIt’s not just the Hugos. For example, Chaos Horizon\nnoted the refusal\nof mainstream reviewers to even review\nMonster Hunter: Nemesis\n, considered to be a likely Hugo nominee.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-08T18:10:00+00:00"
}