{
  "url": "https://voxday.net/2015/01/08/this-is-what-diversity-looks-like/",
  "scraped_at": "2025-12-16T12:40:56.904823",
  "title": "This is what diversity looks like",
  "date_display": "January 8, 2015",
  "date_iso": "2015-01-08T15:17:00+00:00",
  "date_from_url": "2015-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.westernjournalism.com/wp-content/uploads/2015/01/Screen-shot-2015-01-07-at-10.08.18-AM.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.westernjournalism.com/wp-content/uploads/2015/01/Screen-shot-2015-01-07-at-10.08.18-AM.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.westernjournalism.com/wp-content/uploads/2015/01/Screen-shot-2015-01-07-at-10.08.18-AM.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> As usual, we’re seeing most of the usual suspects telling the usual <i>taqiyya</i>, claiming that murdering people is against Islam, that it’s just a few bad apples, that Christians do it too, that Charlie Hebdo had it coming, and so forth.</p><p>They are all lies. Islam is a religion of the sword and has been since its inception.</p><p>Christian popes are given names like Pius and Benedictus and Clemens. Islamic caliphs were proud to bear names such as al-Mansur “the victorious”, which the Caliph of Cordoba assumed after his victory at the Battle of Torrevicente in 981. Furthermore, if it is reasonable to hold Christians today responsible for the actions of other Christians during the Crusades nearly one thousand years ago, how is it unreasonable to hold Muslims today responsible for the action of other Muslims <i>yesterday</i>?</p><p>As I have repeatedly observed, we are about fifty years into the third great wave of Islamic expansion in the West. It was previously turned back at Tours, and again at Vienna. Given the delusions that still persist among the Western governments and the left side of the West’s electorates, it seems unlikely that the murderous assault on the Charlie Hebdo offices mark the high water mark of the third wave of Islamic aggression.</p><p>But the first shots in Reconquista 2.0 have already been fired; they were fired in Norway by Anders Breivik. And that is the terrible point to which multiculturalism and diversity and tolerance has brought the West: the choice between Breivik and Hebdo. Many have embraced the hashtag #JeSuiCharlie, but as Iowahawk wisely noted, never bring a candlelight vigil to a gunfight.</p><p>It will, of course, take time for people to understand that there is no third option, that reinforcing not only decades of failure, but irrational ideological dogma, is absolutely and utterly doomed to even more cataclysmic failure. It will take more attacks by the invaders, more innocent deaths, more dead Westerners, before the people throw out their traitorous governments and their ridiculous pleas for “unity” and true national leaderships arise to expel the invaders.</p><p>This pattern of Quislingesque behavior on the part of the Western elite is nothing new. A reader, JS, notes:</p><blockquote class=\"tr_bq\"><p> I’ve been reading Kissinger’s <i>Diplomacy</i>, and noted that in the lead-up<br> to WW2, many leaders in Europe and England were much more favorably<br> disposed towards a hostile and rearming Germany than they were to the Right<br> in their own countries. Like the Left today, their tactic in response to a<br> challenge was to attempt to cover themselves in ‘moar’ humiliation,<br> abase themselves even further. According to Kissinger,<br> they received grand accolades from other world leaders while betraying<br> their own peoples and increasing the death toll of WW2 by orders of<br> magnitude by disarming when they should have been attacking Hitler’s<br> Germany before Germany was prepared for offensive warfare.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Look at the picture above. Look at the terror and helplessness of the French policeman in his last moments. Look at what his surrender and willingness to appease his Muslim killer accomplished. That is what diversity looks like. That is what diversity means.</p><p>Then again, in the end, it may be that #JeSuiCharlie will turn out to be an appropriate slogan. After all, there was once another Frenchman named Charlie who was not afraid to confront the Islamic invader, Charlie Martel.</p><p>UPDATE: More <a href=\"http://www.dailymail.co.uk/news/article-2901670/Gunman-arrested-Paris-police-officers-seriously-wounded.html\">blessings of diversity</a> in Paris today:</p><blockquote class=\"tr_bq\"><p> Terrified workers in Paris’s business district were warned not to leave their office after a gunmen was seen outside – just hours after a female police officer was shot dead by a ‘North African wielding an assault rifle’. </p></blockquote></div>",
  "content_text": "As usual, we’re seeing most of the usual suspects telling the usual\ntaqiyya\n, claiming that murdering people is against Islam, that it’s just a few bad apples, that Christians do it too, that Charlie Hebdo had it coming, and so forth.\nThey are all lies. Islam is a religion of the sword and has been since its inception.\nChristian popes are given names like Pius and Benedictus and Clemens. Islamic caliphs were proud to bear names such as al-Mansur “the victorious”, which the Caliph of Cordoba assumed after his victory at the Battle of Torrevicente in 981. Furthermore, if it is reasonable to hold Christians today responsible for the actions of other Christians during the Crusades nearly one thousand years ago, how is it unreasonable to hold Muslims today responsible for the action of other Muslims\nyesterday\n?\nAs I have repeatedly observed, we are about fifty years into the third great wave of Islamic expansion in the West. It was previously turned back at Tours, and again at Vienna. Given the delusions that still persist among the Western governments and the left side of the West’s electorates, it seems unlikely that the murderous assault on the Charlie Hebdo offices mark the high water mark of the third wave of Islamic aggression.\nBut the first shots in Reconquista 2.0 have already been fired; they were fired in Norway by Anders Breivik. And that is the terrible point to which multiculturalism and diversity and tolerance has brought the West: the choice between Breivik and Hebdo. Many have embraced the hashtag #JeSuiCharlie, but as Iowahawk wisely noted, never bring a candlelight vigil to a gunfight.\nIt will, of course, take time for people to understand that there is no third option, that reinforcing not only decades of failure, but irrational ideological dogma, is absolutely and utterly doomed to even more cataclysmic failure. It will take more attacks by the invaders, more innocent deaths, more dead Westerners, before the people throw out their traitorous governments and their ridiculous pleas for “unity” and true national leaderships arise to expel the invaders.\nThis pattern of Quislingesque behavior on the part of the Western elite is nothing new. A reader, JS, notes:\nI’ve been reading Kissinger’s\nDiplomacy\n, and noted that in the lead-up\nto WW2, many leaders in Europe and England were much more favorably\ndisposed towards a hostile and rearming Germany than they were to the Right\nin their own countries. Like the Left today, their tactic in response to a\nchallenge was to attempt to cover themselves in ‘moar’ humiliation,\nabase themselves even further. According to Kissinger,\nthey received grand accolades from other world leaders while betraying\ntheir own peoples and increasing the death toll of WW2 by orders of\nmagnitude by disarming when they should have been attacking Hitler’s\nGermany before Germany was prepared for offensive warfare.\nLook at the picture above. Look at the terror and helplessness of the French policeman in his last moments. Look at what his surrender and willingness to appease his Muslim killer accomplished. That is what diversity looks like. That is what diversity means.\nThen again, in the end, it may be that #JeSuiCharlie will turn out to be an appropriate slogan. After all, there was once another Frenchman named Charlie who was not afraid to confront the Islamic invader, Charlie Martel.\nUPDATE: More\nblessings of diversity\nin Paris today:\nTerrified workers in Paris’s business district were warned not to leave their office after a gunmen was seen outside – just hours after a female police officer was shot dead by a ‘North African wielding an assault rifle’.",
  "tags": [
    "Clash of Civilizations",
    "EU",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-08T15:17:00+00:00"
}