{
  "url": "https://voxday.net/2015/01/09/three-more-counts/",
  "scraped_at": "2025-12-16T12:41:00.659261",
  "title": "Three more counts",
  "date_display": "January 9, 2015",
  "date_iso": "2015-01-09T09:03:00+00:00",
  "date_from_url": "2015-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://news.yahoo.com/canadian-radio-star-faces-sex-charges-164655209.html\">Three more counts of sexual assault</a> against McRapey’s partner in psychological projection:</p><blockquote class=\"tr_bq\"><p> Canadian radio star Jian Ghomeshi was charged with three more counts of sexual assault in a court appearance on Thursday in a widening sex scandal that has prompted suspensions at the country’s national public broadcaster.</p><p>The three new charges, linked to three more women, bring the total number of charges facing Ghomeshi to eight and the number of complainants to six. A publication ban prevents naming any of the women.</p><p>The Canadian Broadcasting Corp fired Ghomeshi as host of Q, an internationally syndicated CBC Radio music and arts program, in October. The CBC said it had seen graphic evidence that he had injured a woman in what Ghomeshi said were consensual sex acts involving bondage, discipline, sadism and masochism.</p></blockquote><p>Remember, John Scalzi has not only openly admitted to being a rapist and sexual batterer himself, he has also spent considerably more time attacking me than he has Mr. Ghomeshi. In fact, he barely ever refers to Mr. Ghomeshi at all. It tends to make one suspect that McRapey has some other agenda in mind than his professed purpose in defending women. And speaking of McRapey, here is the full extent of his Twitter commentary on the massacre in Paris.</p><blockquote class=\"tr_bq\"><p> As a non-Muslim, <a href=\"https://twitter.com/scalzi/status/552906502063673347\">I’d like to apologize to Muslims</a> for the non-Muslims<br> demanding that all Muslims should apologize for the attacks today.</br></p><p>Worked at a newspaper; made people angry with words. I was what those cartoonists were. I am still. #JeSuisCharlie </p></blockquote><p>Followed by extensive cat pictures to change the subject. Seriously, that’s John Scalzi’s reaction after Muslims murder more people… to apologize to Muslims. He’s exactly <a href=\"http://accordingtohoyt.com/2015/01/08/je-suis-charlie/\">the sort of left-wing writer whom Sarah Hoyt decried</a> as <i>“asinine cowards, these craven and self-regarding poltroons… who routinely, three times a day, post some dig at Christianity, some mockery of Americans, some pseudo-witty comment about Republicans. But see, none of those people threaten to kill them. The brave social(ist) justice warriors are ever ready to speak truth to the power that will not hurt them. Towards Islam, otoh they adopt the crouching position and kiss the terrorists gangrenous blood-soaked pudenda.”</i></p><p>Scalzi isn’t what the cartoonists of Charlie Hebdo were. Whatever else they may have been, they were brave. He is the precise opposite; a contemptible moral and physical coward. What a craven, self-promoting fraud. As one noTrust aptly tweeted: <i>“The bodies aren’t even cold, and here’s Scalzi &amp; other libs publicly fondling their own Moral Supremacy.” </i></p></div>",
  "content_text": "Three more counts of sexual assault\nagainst McRapey’s partner in psychological projection:\nCanadian radio star Jian Ghomeshi was charged with three more counts of sexual assault in a court appearance on Thursday in a widening sex scandal that has prompted suspensions at the country’s national public broadcaster.\nThe three new charges, linked to three more women, bring the total number of charges facing Ghomeshi to eight and the number of complainants to six. A publication ban prevents naming any of the women.\nThe Canadian Broadcasting Corp fired Ghomeshi as host of Q, an internationally syndicated CBC Radio music and arts program, in October. The CBC said it had seen graphic evidence that he had injured a woman in what Ghomeshi said were consensual sex acts involving bondage, discipline, sadism and masochism.\nRemember, John Scalzi has not only openly admitted to being a rapist and sexual batterer himself, he has also spent considerably more time attacking me than he has Mr. Ghomeshi. In fact, he barely ever refers to Mr. Ghomeshi at all. It tends to make one suspect that McRapey has some other agenda in mind than his professed purpose in defending women. And speaking of McRapey, here is the full extent of his Twitter commentary on the massacre in Paris.\nAs a non-Muslim,\nI’d like to apologize to Muslims\nfor the non-Muslims\ndemanding that all Muslims should apologize for the attacks today.\nWorked at a newspaper; made people angry with words. I was what those cartoonists were. I am still. #JeSuisCharlie\nFollowed by extensive cat pictures to change the subject. Seriously, that’s John Scalzi’s reaction after Muslims murder more people… to apologize to Muslims. He’s exactly\nthe sort of left-wing writer whom Sarah Hoyt decried\nas\n“asinine cowards, these craven and self-regarding poltroons… who routinely, three times a day, post some dig at Christianity, some mockery of Americans, some pseudo-witty comment about Republicans. But see, none of those people threaten to kill them. The brave social(ist) justice warriors are ever ready to speak truth to the power that will not hurt them. Towards Islam, otoh they adopt the crouching position and kiss the terrorists gangrenous blood-soaked pudenda.”\nScalzi isn’t what the cartoonists of Charlie Hebdo were. Whatever else they may have been, they were brave. He is the precise opposite; a contemptible moral and physical coward. What a craven, self-promoting fraud. As one noTrust aptly tweeted:\n“The bodies aren’t even cold, and here’s Scalzi & other libs publicly fondling their own Moral Supremacy.”",
  "tags": [
    "Clash of Civilizations",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-09T09:03:00+00:00"
}