{
  "url": "https://voxday.net/2015/01/01/traffic-report-2014/",
  "scraped_at": "2025-12-16T12:40:10.261029",
  "title": "Traffic report 2014",
  "date_display": "January 1, 2015",
  "date_iso": "2015-01-01T10:50:00+00:00",
  "date_from_url": "2015-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The growth in site traffic was less spectacular than <a href=\"http://www.milobookclub.com/2014/01/01/traffic-report-2013/\">in 2013</a>, and we saw a 1.5-million pageview month instead of the two-million one that I speculated might be possible, but traffic was nevertheless solid and both VP and AG continued to enjoy increased readership, with an overall 19.7 percent increase in pageviews over the course of the year. And, if anything, it’s picking up, as December 2014 was up 38 percent in comparison with December 2013.</p><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2015/01/monthly_2011-2014.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"197\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/01/monthly_2011-2014.jpg\" width=\"320\"/></a>In 2014, Vox Popoli had 11,236,085 pageviews and Alpha Game 4,457,537 for a total of 15,693,622 Google pageviews. To the left is a<br> chart showing the monthly traffic for both blogs over the last four<br> years; even without Alpha Game, VP has grown from 11,383 to 34,809 average daily pageviews. Combined, Vox Popoli and Alpha Game are now running at a average rate of 47,343 daily pageviews. Not quite 50k, I’m afraid, not even if they are converted to the slightly more generous WordPress metric. As for the running annual totals, they are as follows:</br></br></p><p>2008: 3,496,757 <br> 2009: 4,414,801<br> 2010: 4,827,183<br> 2011: 5,969,066<br> 2012: 7,774,074<br> 2013: 13,111,695<br> 2014: 15,693,622</br></br></br></br></br></br></p><p>I doubt we’ll be able to maintain a 2-year doubling rate for a third straight year, since that would require nearly 11 million more pageviews in 2015, but one never knows. And speaking of nearly 50k daily pageviews, I would be remiss if, for no particular reason at all, I did not continue with <a href=\"http://www.milobookclub.com/2012/12/26/running-down-john-scalzi/\">a certain comparison</a><br> that was repeatedly brought to my attention in previous years. This is,<br> of course, the comparison with the hugely famous and massively popular<br> Whatever, formerly the biggest and best-known site in science fiction. The following chart shows the comparative<br> blog traffic over the last six years as measured in Google Pageviews.<br>  </br></br></br></br></br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/01/VP_Whatever_2009-2014.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"160\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/01/VP_Whatever_2009-2014.jpg\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/01/VP_Whatever_2009-2014.jpg\" decoding=\"async\" height=\"160\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20400%20160%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p>Interesting, is it not, that Whatever’s traffic has now declined below the point that mine was when it was declared irrelevant on the basis of its paltry traffic by McRapey’s fans? So, have we seen Peak McRapey? It’s hard to say, as he’s increasingly moved to Twitter, an ideal medium for his unique combination of fabrication, snark, and self-promotion.</p><p>I found the 2014 totals to be particularly amusing in light of this clueless post by an SF Pinkshirt named Nalini Haynes who went public with her strategy to starve the Supreme Dark Lord: <i>“My website averages well over 600 visits a day. Based on comments from<br> other fanzine people, I’m guessing that’s more readers than VD’s blog<br> would get even when he provokes a shit storm. Let’s deprive him of the<br> traffic.”</br></br></br></i></p><p> Apparently it didn’t work so well. Anyhow, 2015 promises to be an interesting year at VP and hopefully a much better one than 2014 was. While the Hugo debacle was entertaining and the Castalia launch went much better than anticipated, I didn’t finish Book Two, Alpenwolf didn’t finish First Sword, and there were some very difficult situations being experienced behind the scenes by friends and family. If, at any point last year, you sensed I didn’t give even the smallest damn about the various public contretemps, you were correct.</p><p>But we’ve got two new partners and an exciting new project in the works at Alpenwolf, both First Sword and Book Two will be out this year, and we’ve got a number of new writers, new bloggers, and new books to announce in the next few months at Castalia. So, thank you for your interest (even if it is no more than morbid curiosity), thank you for your support, and I hope you will come along for the ride in the new year.</p></div>",
  "content_text": "The growth in site traffic was less spectacular than\nin 2013\n, and we saw a 1.5-million pageview month instead of the two-million one that I speculated might be possible, but traffic was nevertheless solid and both VP and AG continued to enjoy increased readership, with an overall 19.7 percent increase in pageviews over the course of the year. And, if anything, it’s picking up, as December 2014 was up 38 percent in comparison with December 2013.\nIn 2014, Vox Popoli had 11,236,085 pageviews and Alpha Game 4,457,537 for a total of 15,693,622 Google pageviews. To the left is a\nchart showing the monthly traffic for both blogs over the last four\nyears; even without Alpha Game, VP has grown from 11,383 to 34,809 average daily pageviews. Combined, Vox Popoli and Alpha Game are now running at a average rate of 47,343 daily pageviews. Not quite 50k, I’m afraid, not even if they are converted to the slightly more generous WordPress metric. As for the running annual totals, they are as follows:\n2008: 3,496,757\n2009: 4,414,801\n2010: 4,827,183\n2011: 5,969,066\n2012: 7,774,074\n2013: 13,111,695\n2014: 15,693,622\nI doubt we’ll be able to maintain a 2-year doubling rate for a third straight year, since that would require nearly 11 million more pageviews in 2015, but one never knows. And speaking of nearly 50k daily pageviews, I would be remiss if, for no particular reason at all, I did not continue with\na certain comparison\nthat was repeatedly brought to my attention in previous years. This is,\nof course, the comparison with the hugely famous and massively popular\nWhatever, formerly the biggest and best-known site in science fiction. The following chart shows the comparative\nblog traffic over the last six years as measured in Google Pageviews.\nInteresting, is it not, that Whatever’s traffic has now declined below the point that mine was when it was declared irrelevant on the basis of its paltry traffic by McRapey’s fans? So, have we seen Peak McRapey? It’s hard to say, as he’s increasingly moved to Twitter, an ideal medium for his unique combination of fabrication, snark, and self-promotion.\nI found the 2014 totals to be particularly amusing in light of this clueless post by an SF Pinkshirt named Nalini Haynes who went public with her strategy to starve the Supreme Dark Lord:\n“My website averages well over 600 visits a day. Based on comments from\nother fanzine people, I’m guessing that’s more readers than VD’s blog\nwould get even when he provokes a shit storm. Let’s deprive him of the\ntraffic.”\nApparently it didn’t work so well. Anyhow, 2015 promises to be an interesting year at VP and hopefully a much better one than 2014 was. While the Hugo debacle was entertaining and the Castalia launch went much better than anticipated, I didn’t finish Book Two, Alpenwolf didn’t finish First Sword, and there were some very difficult situations being experienced behind the scenes by friends and family. If, at any point last year, you sensed I didn’t give even the smallest damn about the various public contretemps, you were correct.\nBut we’ve got two new partners and an exciting new project in the works at Alpenwolf, both First Sword and Book Two will be out this year, and we’ve got a number of new writers, new bloggers, and new books to announce in the next few months at Castalia. So, thank you for your interest (even if it is no more than morbid curiosity), thank you for your support, and I hope you will come along for the ride in the new year.",
  "tags": [
    "Alpha Game",
    "McRapey",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-01T10:50:00+00:00"
}