{
  "url": "https://voxday.net/2015/01/19/war-is-coming/",
  "scraped_at": "2025-12-16T12:42:22.029636",
  "title": "War is coming",
  "date_display": "January 19, 2015",
  "date_iso": "2015-01-19T21:32:00+00:00",
  "date_from_url": "2015-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whether the West is ready or not. As with the National Socialists, the frightened appeasers of the West are unwilling to listen <a href=\"http://www.breitbart.com/national-security/2015/01/18/german-embed-reporter-isis-plans-on-killing-hundreds-of-millions-in-religious-cleansing/\">to what their self-proclaimed enemies are saying</a>:</p><blockquote class=\"tr_bq\"><p> Jurgen Todenhofer, the first Western reporter to embed with Islamic State fighters and not be killed in the process, spoke to Al Jazeera about his time with the terror group. Todenhofer lived side by side with the jihadist fighters for ten days in the Islamic State-stronghold city of Mosul, Iraq. He was accompanied only by his son, who served as his cameraman.</p><p>“I always asked them about the value of mercy in Islam,” but “I didn’t see any mercy in their behavior,” explained Todenhofer. He added, “Something that I don’t understand at all is the enthusiasm in their plan of religious cleansing, planning to kill the non-believers… They also will kill Muslim democrats because they believe that non-ISIL-Muslims put the laws of human beings above the commandments of God.”</p><p>The German reporter then elaborated on how shocked he was about how “willing to kill” the ISIS fighters are. He said that they were ready to commit genocide. “They were talking about [killing] hundreds of millions. They were enthusiastic about it, and I just cannot understand that,” said Todenhofer.</p></blockquote><p>At this point, the Western governments are more interested in suppressing the only forces that will save them, the Christians and the nationalists. But they will go, one way or another. Either they’ll be thrown out democratically by the pro-survival Western elements, or they’ll eventually find themselves in the position <a href=\"http://news.sky.com/story/1410847/rebels-surround-yemen-prime-ministers-home\">of the Yemeni Prime Minister</a>.<br> <i><br/></i><br> <i>Armed Houthi militia have encircled the Prime Minister’s residence in<br> Yemen just hours after gunmen opened fire on his convoy, according to a<br> government spokesman.</br></br></i></br></br></p></div>",
  "content_text": "Whether the West is ready or not. As with the National Socialists, the frightened appeasers of the West are unwilling to listen\nto what their self-proclaimed enemies are saying\n:\nJurgen Todenhofer, the first Western reporter to embed with Islamic State fighters and not be killed in the process, spoke to Al Jazeera about his time with the terror group. Todenhofer lived side by side with the jihadist fighters for ten days in the Islamic State-stronghold city of Mosul, Iraq. He was accompanied only by his son, who served as his cameraman.\n“I always asked them about the value of mercy in Islam,” but “I didn’t see any mercy in their behavior,” explained Todenhofer. He added, “Something that I don’t understand at all is the enthusiasm in their plan of religious cleansing, planning to kill the non-believers… They also will kill Muslim democrats because they believe that non-ISIL-Muslims put the laws of human beings above the commandments of God.”\nThe German reporter then elaborated on how shocked he was about how “willing to kill” the ISIS fighters are. He said that they were ready to commit genocide. “They were talking about [killing] hundreds of millions. They were enthusiastic about it, and I just cannot understand that,” said Todenhofer.\nAt this point, the Western governments are more interested in suppressing the only forces that will save them, the Christians and the nationalists. But they will go, one way or another. Either they’ll be thrown out democratically by the pro-survival Western elements, or they’ll eventually find themselves in the position\nof the Yemeni Prime Minister\n.\nArmed Houthi militia have encircled the Prime Minister’s residence in\nYemen just hours after gunmen opened fire on his convoy, according to a\ngovernment spokesman.",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-01-19T21:32:00+00:00"
}