{
  "url": "https://voxday.net/2018/07/19/a-sound-model/",
  "scraped_at": "2025-12-19T21:12:29.502082",
  "title": "A sound model",
  "date_display": "July 19, 2018",
  "date_iso": "2018-07-19T09:03:55+00:00",
  "date_from_url": "2018-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.rt.com/news/433655-israel-nation-state-law-passsed/\">Israel defines itself</a> as a nation.</p><blockquote><p>The Israeli Knesset has approved the ‘nation-state bill’ that promotes Jewish-only settlements, downgrades Arab language status and limits the right to self-determination to Jews. Arab MPs chided the law as racist.</p><p>The bill, which has the status of a basic law (approximately the same as a constitutional law in countries with a written constitution), was passed overnight to Thursday with 62 votes in favor and 55 against after hours of fierce argument and debate. It will now come into force as soon as it’s published in the Knesset’s Official Gazette.</p><p>The law, which had been in the works since 2011, has sparked a wave of protests, which spilled over the Israeli border and angered the influential Jewish diaspora in the US.</p><p>The bill formally defines the main principles that should stand at the core of the Israeli state and its symbols, such as the flag, the anthem, its capital and language. In a clause that set Arab lawmakers off, the bill explicitly states that “the right to exercises national determination in the State of Israel is unique to the Jewish people.”</p><p>The critics of the bill argue that such wording makes some 1.8 million Israeli Arabs, a quarter of the population, second-class citizens.</p><p>Another contentious clause strips the Arabic language of its official status, instead granting it “a special status” and leaving Hebrew as the only official state language. Although the bill specifically points out that “this clause does not harm the status given to the Arabic language before this law came into effect,” its opponents have been up in arms over the wording change.</p><p>At the center of the controversy is the part of the law aimed at promoting the “establishment and consolidation” of Jewish settlements, which is being castigated by the opposition as a shorthand for segregation bordering on apartheid.</p><p>The divisive nature of the new legislation that saw thousands of people, including Arabs and secular Jews flocking to streets in protest, has not stopped Israeli Prime Minister Benjamin Netanyahu from hailing its adoption as a huge success.</p><p>“With this law we determined the founding principle of our existence. Israel is the nation state of the Jewish people, and respects the rights of all of its citizens,” Netanyahu said, as cited by Haaretz.</p></blockquote><p>What a pity the United States of America doesn’t have anything that defines the founding principle of its existence. Wait a minute….</p><p><i>We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty <b>to ourselves and our posterity</b>, do ordain and establish this Constitution for the United States of America. </i><br><i><br/></i>The reason the “influential Jewish diaspora” is angered by this perfectly sensible law is because with one fell swoop, the nationalists in Israel have just underlined the case for the nations in the West that the diasporans have been trying to adulterate and dispossess for the last fifty years. Given that Netanhayu is an intelligent man who has been openly telling Jews around the world that it is time to move to Israel, it’s very unlikely that he is unaware of this.</br></p><p>It’s the right model. Respect the basic rights of all the paperwork citizens, but don’t permit the non-nationals have any significant say in how the nation is governed or pretend that they are part of the nation proper. The US and the European nations should follow suit, and eventually, they will. The universalist age is at an end.</p><p>The Israeli Arabs shouldn’t get too upset. After all, the lunatics of San Francisco will be happy to let them vote there should they feel the need.</p><blockquote><p>San Francisco began registering non-citizens, including undocumented immigrants, to register to vote Monday in the November election for the city school board, reported The San Francisco Chronicle.</p><p>The move follows passage of a 2016 ballot measure by San Francisco voters opening school elections to non-citizens who are over the age of 18, city residents and have children under age 19, reported the publication.</p><p>“This is no-brainer legislation,” Hillary Ronen, a San Francisco supervisor, told the Chronicle. “Why would we not want our parents invested in the education of their children?”</p><p>“We want to give immigrants the right to vote,” Norman Yee, also a county supervisor, told KGO.</p></blockquote><p>Immigrants, the children of immigrants, the grand-children of immigrants, and the great-grandchildren of immigrants should <i>never</i> be given the right to vote on anything. No one forced them to immigrate, and they <i>always </i>vote to change – and usually to ruin – the societies into which they have immigrated.</p></div>",
  "content_text": "Israel defines itself\nas a nation.\nThe Israeli Knesset has approved the ‘nation-state bill’ that promotes Jewish-only settlements, downgrades Arab language status and limits the right to self-determination to Jews. Arab MPs chided the law as racist.\nThe bill, which has the status of a basic law (approximately the same as a constitutional law in countries with a written constitution), was passed overnight to Thursday with 62 votes in favor and 55 against after hours of fierce argument and debate. It will now come into force as soon as it’s published in the Knesset’s Official Gazette.\nThe law, which had been in the works since 2011, has sparked a wave of protests, which spilled over the Israeli border and angered the influential Jewish diaspora in the US.\nThe bill formally defines the main principles that should stand at the core of the Israeli state and its symbols, such as the flag, the anthem, its capital and language. In a clause that set Arab lawmakers off, the bill explicitly states that “the right to exercises national determination in the State of Israel is unique to the Jewish people.”\nThe critics of the bill argue that such wording makes some 1.8 million Israeli Arabs, a quarter of the population, second-class citizens.\nAnother contentious clause strips the Arabic language of its official status, instead granting it “a special status” and leaving Hebrew as the only official state language. Although the bill specifically points out that “this clause does not harm the status given to the Arabic language before this law came into effect,” its opponents have been up in arms over the wording change.\nAt the center of the controversy is the part of the law aimed at promoting the “establishment and consolidation” of Jewish settlements, which is being castigated by the opposition as a shorthand for segregation bordering on apartheid.\nThe divisive nature of the new legislation that saw thousands of people, including Arabs and secular Jews flocking to streets in protest, has not stopped Israeli Prime Minister Benjamin Netanyahu from hailing its adoption as a huge success.\n“With this law we determined the founding principle of our existence. Israel is the nation state of the Jewish people, and respects the rights of all of its citizens,” Netanyahu said, as cited by Haaretz.\nWhat a pity the United States of America doesn’t have anything that defines the founding principle of its existence. Wait a minute….\nWe the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty\nto ourselves and our posterity\n, do ordain and establish this Constitution for the United States of America.\nThe reason the “influential Jewish diaspora” is angered by this perfectly sensible law is because with one fell swoop, the nationalists in Israel have just underlined the case for the nations in the West that the diasporans have been trying to adulterate and dispossess for the last fifty years. Given that Netanhayu is an intelligent man who has been openly telling Jews around the world that it is time to move to Israel, it’s very unlikely that he is unaware of this.\nIt’s the right model. Respect the basic rights of all the paperwork citizens, but don’t permit the non-nationals have any significant say in how the nation is governed or pretend that they are part of the nation proper. The US and the European nations should follow suit, and eventually, they will. The universalist age is at an end.\nThe Israeli Arabs shouldn’t get too upset. After all, the lunatics of San Francisco will be happy to let them vote there should they feel the need.\nSan Francisco began registering non-citizens, including undocumented immigrants, to register to vote Monday in the November election for the city school board, reported The San Francisco Chronicle.\nThe move follows passage of a 2016 ballot measure by San Francisco voters opening school elections to non-citizens who are over the age of 18, city residents and have children under age 19, reported the publication.\n“This is no-brainer legislation,” Hillary Ronen, a San Francisco supervisor, told the Chronicle. “Why would we not want our parents invested in the education of their children?”\n“We want to give immigrants the right to vote,” Norman Yee, also a county supervisor, told KGO.\nImmigrants, the children of immigrants, the grand-children of immigrants, and the great-grandchildren of immigrants should\nnever\nbe given the right to vote on anything. No one forced them to immigrate, and they\nalways\nvote to change – and usually to ruin – the societies into which they have immigrated.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-19T08:03:55+00:00"
}