{
  "url": "https://voxday.net/2018/07/03/anti-american-conservatives/",
  "scraped_at": "2025-12-19T21:09:54.214690",
  "title": "Anti-American conservatives",
  "date_display": "July 3, 2018",
  "date_iso": "2018-07-03T19:03:24+00:00",
  "date_from_url": "2018-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Overgrown Hobbit demonstrates that she is far too short and dishonest for this ride.</p><blockquote><p><i>Andres Manuel Lopez Obrador, Moammar Gaddafi, Mahmoud Ahmadinejad, and Sarah <strike>D’Almeida</strike> de Almeida Hoyt to the logical conclusion that the contemporary United States is not a nation, but rather, an idea that belongs to all nations and that immigration to the USA is a basic human right.</i></p><p>If Vox Day does not care for people making up lies about him, he should not make them up about other people. Mrs Hoyt has stated on more than once that immigration into the United States is in fact a privilege; one that the United States may extend or withdraw at will.</p><p>A privilege, moreover that if the recipient is not properly grateful for, treating it as an adopted son would his admission into a new family and tribe, he does not deserve and ought not be granted.</p><p>Where she, and I, differ from Vox Day is that the founding principles of America are ALSO important, not just the land and the people. Liberty, rule of law rather than men, and a government that serves the people, in which all men are sovereign, are crucial to our identity as Americans. “Posterity” that lack it, are no true Americans, adopted sons and daughters that do are.</p><p>The idea the these values make her the same as a damned commie or a Muslim is slander.</p><p>It is as false as claiming that because Vox Day is wrong about race trumping culture in IQ, and because he claims that IQ is a necessary requirement for civil society, that he also believes that IQ determines virtue.</p><p>He owes Mrs. Hoyt an apology for that calumny.</p></blockquote><p>First, I didn’t make up any lies. Second, the fact that I can draw more accurate conclusions from Hoyt’s statements than Hoyt herself can makes her logically incoherent, it does not make me a calumnist. Third, Hoyt and Hobbit are both factually wrong and historically revisionist. Fourth, Sarah Hoyt is not merely a Fake American, she is openly anti-American. And fifth, you always know that someone is intellectually dishonest when they edit a quote in such a way that leaves the statement grammatically incorrect. This was the full statement that Overgrown Hobbit disingenuously cropped.</p><p><i><b>It’s going to be very interesting to see which conservatives finally abandon their ahistorical equalitarian-based civic nationalism and which follow Andres Manuel Lopez Obrador, Moammar Gaddafi, Mahmoud Ahmadinejad, and Sarah D’Almeida Hoyt to the logical conclusion that the contemporary United States is not a nation, but rather, an idea that belongs to all nations and that immigration to the USA is a basic human right. </b></i><br><i><br/></i>Overgrown Hobbit was trying to disguise the fact that my statement did not address what Hoyt says on the subject, but rather, the conclusions that logically follow from her statements. Which, in this particular context, does happen to render her no different than the particular damned commie and pair of Muslims referenced. So, what has Sarah Hoyt actually <a href=\"https://accordingtohoyt.com/2016/02/28/i-was-born-american-a-blast-from-the-past-7-4-2014/\">said on the subject</a>?</br></p><blockquote><p>I Was Born American</p><p>Yes, I was born in another country of foreign parents who would no more become American than fly unassisted, (and who desire it less than they wish to have have their heads shaved by a warthog) but I figure that was an accident of circumstance.  What really matters is that I was an American in my heart.  I just had to get here and become one in truth. (And that, by itself, is an American attitude.)</p><p>This week while talking to a friend about his foreign SO, I found myself explaining that other people, in other countries, have a hierarchy in their heads all the time — who is powerful, who isn’t, what attitude is proper.  You can find it (if you know where to look) even when reading British novels.</p><p>We’re not like that.  Whether we were born elsewhere or here, Americans — those of us who are proud of the name —  are rebels, revolutionaries, something new under the sun: a people who believe people should be equal in their right to life, the right to liberty, the right to pursue their happiness undisturbed by either inimical neighbors or oppressive “betters.”… Those beliefs make me American. </p></blockquote><p>The idea that one “had to get here and become one in truth” is actually an intrinsically not-American thought, by definition. It is, rather, a common attitude among Fake Americans who want to lay false claim to the inheritance that belongs to the Posterity of the original We the People. But the belief that she is an American, however sincere, no more makes a Portuguese woman an American than the belief that she is male would make her a man. It gets even worse in a subsequent piece, where Hoyt actually <a href=\"https://pjmedia.com/lifestyle/2017/06/30/becoming-american/\">denies the existence of America as a nation of blood and soil</a>.</p><blockquote><p>I was born in Portugal, of Portuguese parents, and so far as I know (it’s hard to stand on the marital faithfulness of people you never met even if they were your ancestresses) have no American ancestor, ever.  I probably have British blood, somewhere.  Being from the north of Portugal it is virtually impossible I don’t, when you consider trade going back to the 4th century B.C. and a tendency for well-to-do British families to send their remittance men to the area before there was an Empire.</p><p>What does this have to do with being American? Despite the genetic ignorance of people who claim that America is a nation like old Europe of “blood and soil”? Clear nothing.</p><p>I’ve been known to say I was born American, it just took me a few years to make it official. Is this strictly true?  Kind of.  If you squint and shake the magic 8-Ball.</p><p>Of course, I didn’t know the name for what I was or what I wanted.  I had not read that “immortal poetry” of the Declaration of Independence.  All I knew is that I wasn’t precisely right where I was, and while I loved my family and the village in which I grew up, all my impulses — indeed, my way of being — were at odds with the local culture and the local beliefs….</p><p>As almost everyone here should be aware, being an American – not just fitting in the culture, and because that’s regional it means I’ll need to learn to talk and walk again if I move across the country again – is an ongoing process, an ongoing fight between liberty and totalitarian impulses which exist in every society and possibly in every human.  And it is a struggle to free yourself from the inherited nonsense that has plagued other societies too: ideas of class and inherited rank or ability.</p></blockquote><p>Lest you think I am reading too much into Hoyt’s denial of the very purpose of the U.S. Constitution, rest assured, she is consistent in denying and rejecting it.</p><p><i>We are a radical experiment, a nation not of blood and genes, but a nation of heart, of mind, of belief. </i></p><p>Now try to square that statement with the preamble that defines the purpose of the Constitution.</p><p><i><b>We the People of the United States, in Order to… secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.</b></i></p><p>Posterity, <a href=\"http://voxday.blogspot.com/2017/06/posterity-tk-vs-vd.html\">as I have conclusively proven</a>, means “direct genetic descendants”, not “future history” or “succeeding generations” or anything else. Paper Americans, Fake Americans, absolutely love the idea that America is not a material nation like every other nation in the history of Man. That allows them to claim that they are not just Real Americans, they are Better Americans than the real thing, even as they preserve their national identities, endlessly lecture their “fellow Americans” about the way things are done back in the “old country”, and attempt to change American society to be more to their liking. And notice that like so many Fake Americans before her, indeed, like Overgrown Hobbit, Hoyt is openly deriding both the genuine American nation as well as the very purpose of the Constitution to which she claims to have sworn herself. Now, here is the statement by Overgrown Hobbit that proves my original point about the Proposition Nation propagandists and shows that Overgrown Hobbit is intrinsically anti-American herself.</p><p><i>Liberty, rule of law rather than men, and a government that serves the people, in which all men are sovereign, are crucial to our identity as Americans. “Posterity” that lack it, are no true Americans, adopted sons and daughters that do are.</i></p><p>I must have missed the bit about Proposition Policing in the Constitution. If this is adoptive gratitude, I can’t imagine what a lack of it would look like! And idea that one should apologize to a Fake American like Hoyt, an immigrant who exhibits open contempt for both the historical We the People as well as their direct genetic descendants, for accurately characterizing her anti-American views and the conclusions that are logically drawn from those views, is absurd. She is no more American than I am Italian, Argentine, or Zulu. Of course, we can’t expect Sarah Hoyt to understand what Posterity means, or grasp the core purpose of the U.S. Constitution, or to accept the fact that America is an actual blood-and-soil nation and not a mere idea to which anyone, anywhere in the world, can profess allegience, any more than we can expect any other Portuguese, any other immigrant, or any other descendant of immigrants to do so against their own self-perceived interests.</p><p>John Locke warned us of people like Hoyt and Hobbit. Even though nothing gives them the right to dispossess the American posterity and turn those Americans out of the inheritance which ought to be the possession of them and their descendants to all generations, they are indeed apt to think themselves the masters.</p></div>",
  "content_text": "In which Overgrown Hobbit demonstrates that she is far too short and dishonest for this ride.\nAndres Manuel Lopez Obrador, Moammar Gaddafi, Mahmoud Ahmadinejad, and Sarah\nD’Almeida\nde Almeida Hoyt to the logical conclusion that the contemporary United States is not a nation, but rather, an idea that belongs to all nations and that immigration to the USA is a basic human right.\nIf Vox Day does not care for people making up lies about him, he should not make them up about other people. Mrs Hoyt has stated on more than once that immigration into the United States is in fact a privilege; one that the United States may extend or withdraw at will.\nA privilege, moreover that if the recipient is not properly grateful for, treating it as an adopted son would his admission into a new family and tribe, he does not deserve and ought not be granted.\nWhere she, and I, differ from Vox Day is that the founding principles of America are ALSO important, not just the land and the people. Liberty, rule of law rather than men, and a government that serves the people, in which all men are sovereign, are crucial to our identity as Americans. “Posterity” that lack it, are no true Americans, adopted sons and daughters that do are.\nThe idea the these values make her the same as a damned commie or a Muslim is slander.\nIt is as false as claiming that because Vox Day is wrong about race trumping culture in IQ, and because he claims that IQ is a necessary requirement for civil society, that he also believes that IQ determines virtue.\nHe owes Mrs. Hoyt an apology for that calumny.\nFirst, I didn’t make up any lies. Second, the fact that I can draw more accurate conclusions from Hoyt’s statements than Hoyt herself can makes her logically incoherent, it does not make me a calumnist. Third, Hoyt and Hobbit are both factually wrong and historically revisionist. Fourth, Sarah Hoyt is not merely a Fake American, she is openly anti-American. And fifth, you always know that someone is intellectually dishonest when they edit a quote in such a way that leaves the statement grammatically incorrect. This was the full statement that Overgrown Hobbit disingenuously cropped.\nIt’s going to be very interesting to see which conservatives finally abandon their ahistorical equalitarian-based civic nationalism and which follow Andres Manuel Lopez Obrador, Moammar Gaddafi, Mahmoud Ahmadinejad, and Sarah D’Almeida Hoyt to the logical conclusion that the contemporary United States is not a nation, but rather, an idea that belongs to all nations and that immigration to the USA is a basic human right.\nOvergrown Hobbit was trying to disguise the fact that my statement did not address what Hoyt says on the subject, but rather, the conclusions that logically follow from her statements. Which, in this particular context, does happen to render her no different than the particular damned commie and pair of Muslims referenced. So, what has Sarah Hoyt actually\nsaid on the subject\n?\nI Was Born American\nYes, I was born in another country of foreign parents who would no more become American than fly unassisted, (and who desire it less than they wish to have have their heads shaved by a warthog) but I figure that was an accident of circumstance.  What really matters is that I was an American in my heart.  I just had to get here and become one in truth. (And that, by itself, is an American attitude.)\nThis week while talking to a friend about his foreign SO, I found myself explaining that other people, in other countries, have a hierarchy in their heads all the time — who is powerful, who isn’t, what attitude is proper.  You can find it (if you know where to look) even when reading British novels.\nWe’re not like that.  Whether we were born elsewhere or here, Americans — those of us who are proud of the name —  are rebels, revolutionaries, something new under the sun: a people who believe people should be equal in their right to life, the right to liberty, the right to pursue their happiness undisturbed by either inimical neighbors or oppressive “betters.”… Those beliefs make me American.\nThe idea that one “had to get here and become one in truth” is actually an intrinsically not-American thought, by definition. It is, rather, a common attitude among Fake Americans who want to lay false claim to the inheritance that belongs to the Posterity of the original We the People. But the belief that she is an American, however sincere, no more makes a Portuguese woman an American than the belief that she is male would make her a man. It gets even worse in a subsequent piece, where Hoyt actually\ndenies the existence of America as a nation of blood and soil\n.\nI was born in Portugal, of Portuguese parents, and so far as I know (it’s hard to stand on the marital faithfulness of people you never met even if they were your ancestresses) have no American ancestor, ever.  I probably have British blood, somewhere.  Being from the north of Portugal it is virtually impossible I don’t, when you consider trade going back to the 4th century B.C. and a tendency for well-to-do British families to send their remittance men to the area before there was an Empire.\nWhat does this have to do with being American? Despite the genetic ignorance of people who claim that America is a nation like old Europe of “blood and soil”? Clear nothing.\nI’ve been known to say I was born American, it just took me a few years to make it official. Is this strictly true?  Kind of.  If you squint and shake the magic 8-Ball.\nOf course, I didn’t know the name for what I was or what I wanted.  I had not read that “immortal poetry” of the Declaration of Independence.  All I knew is that I wasn’t precisely right where I was, and while I loved my family and the village in which I grew up, all my impulses — indeed, my way of being — were at odds with the local culture and the local beliefs….\nAs almost everyone here should be aware, being an American – not just fitting in the culture, and because that’s regional it means I’ll need to learn to talk and walk again if I move across the country again – is an ongoing process, an ongoing fight between liberty and totalitarian impulses which exist in every society and possibly in every human.  And it is a struggle to free yourself from the inherited nonsense that has plagued other societies too: ideas of class and inherited rank or ability.\nLest you think I am reading too much into Hoyt’s denial of the very purpose of the U.S. Constitution, rest assured, she is consistent in denying and rejecting it.\nWe are a radical experiment, a nation not of blood and genes, but a nation of heart, of mind, of belief.\nNow try to square that statement with the preamble that defines the purpose of the Constitution.\nWe the People of the United States, in Order to… secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.\nPosterity,\nas I have conclusively proven\n, means “direct genetic descendants”, not “future history” or “succeeding generations” or anything else. Paper Americans, Fake Americans, absolutely love the idea that America is not a material nation like every other nation in the history of Man. That allows them to claim that they are not just Real Americans, they are Better Americans than the real thing, even as they preserve their national identities, endlessly lecture their “fellow Americans” about the way things are done back in the “old country”, and attempt to change American society to be more to their liking. And notice that like so many Fake Americans before her, indeed, like Overgrown Hobbit, Hoyt is openly deriding both the genuine American nation as well as the very purpose of the Constitution to which she claims to have sworn herself. Now, here is the statement by Overgrown Hobbit that proves my original point about the Proposition Nation propagandists and shows that Overgrown Hobbit is intrinsically anti-American herself.\nLiberty, rule of law rather than men, and a government that serves the people, in which all men are sovereign, are crucial to our identity as Americans. “Posterity” that lack it, are no true Americans, adopted sons and daughters that do are.\nI must have missed the bit about Proposition Policing in the Constitution. If this is adoptive gratitude, I can’t imagine what a lack of it would look like! And idea that one should apologize to a Fake American like Hoyt, an immigrant who exhibits open contempt for both the historical We the People as well as their direct genetic descendants, for accurately characterizing her anti-American views and the conclusions that are logically drawn from those views, is absurd. She is no more American than I am Italian, Argentine, or Zulu. Of course, we can’t expect Sarah Hoyt to understand what Posterity means, or grasp the core purpose of the U.S. Constitution, or to accept the fact that America is an actual blood-and-soil nation and not a mere idea to which anyone, anywhere in the world, can profess allegience, any more than we can expect any other Portuguese, any other immigrant, or any other descendant of immigrants to do so against their own self-perceived interests.\nJohn Locke warned us of people like Hoyt and Hobbit. Even though nothing gives them the right to dispossess the American posterity and turn those Americans out of the inheritance which ought to be the possession of them and their descendants to all generations, they are indeed apt to think themselves the masters.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-03T18:03:24+00:00"
}