{
  "url": "https://voxday.net/2018/07/29/darkstream-destroying-a-converged-institution/",
  "scraped_at": "2025-12-19T21:14:05.105235",
  "title": "Darkstream: destroying a converged institution",
  "date_display": "July 29, 2018",
  "date_iso": "2018-07-29T18:35:11+00:00",
  "date_from_url": "2018-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><a href=\"https://youtu.be/E1U5b9Tofl4\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/E1U5b9Tofl4\" width=\"512\">https://youtu.be/E1U5b9Tofl4</iframe></a></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\">From the transcript <a href=\"https://youtu.be/E1U5b9Tofl4\">of the Darkstream</a>:</div><p>Basically, what we succeeded in doing is turning Worldcon into WisCon. Now, here’s an interesting observation: isn’t that what is happening to the DNC? Absolutely it is, and who caused that? Donald Trump is doing the same thing on a larger scale in the political world, what Rabid Puppies did to the<br>science-fiction world. It’s the same thing. If you apply sufficient force, if you apply a sufficiently strong action and provoke a strong enough reaction, then you can withdraw and allow the SJWs that have been stirred up to devour everything else that’s still there.</br></p><p>Think about this way. Imagine that SJWs are like piranhas, and so you’ve got these piranhas in a fish tank, and there’s the SJWs and then there’s the regular lefty fish. They’re all the enemy, but some of them are a little bit worse than others. So what you do, you know, is you stick your hand in there and then shake your hand around right? Now, the key is got to pull your hand out! Yeah, so you stick your hand in, you stir them all up, you pull your hand out, and then the piranhas are going to attack everything that’s in there. They don’t realize that the other fish in there aren’t your hand, they’re not discerning, they have their agenda and these other people stand in the way of that agenda just like you do, and so, you know, by going in and stirring things up, and then withdrawing, then the whole thing ends up a massive mutually destructive activity.</p></div>",
  "content_text": "https://youtu.be/E1U5b9Tofl4\nFrom the transcript\nof the Darkstream\n:\nBasically, what we succeeded in doing is turning Worldcon into WisCon. Now, here’s an interesting observation: isn’t that what is happening to the DNC? Absolutely it is, and who caused that? Donald Trump is doing the same thing on a larger scale in the political world, what Rabid Puppies did to the\nscience-fiction world. It’s the same thing. If you apply sufficient force, if you apply a sufficiently strong action and provoke a strong enough reaction, then you can withdraw and allow the SJWs that have been stirred up to devour everything else that’s still there.\nThink about this way. Imagine that SJWs are like piranhas, and so you’ve got these piranhas in a fish tank, and there’s the SJWs and then there’s the regular lefty fish. They’re all the enemy, but some of them are a little bit worse than others. So what you do, you know, is you stick your hand in there and then shake your hand around right? Now, the key is got to pull your hand out! Yeah, so you stick your hand in, you stir them all up, you pull your hand out, and then the piranhas are going to attack everything that’s in there. They don’t realize that the other fish in there aren’t your hand, they’re not discerning, they have their agenda and these other people stand in the way of that agenda just like you do, and so, you know, by going in and stirring things up, and then withdrawing, then the whole thing ends up a massive mutually destructive activity.",
  "tags": [
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-29T17:35:11+00:00"
}