{
  "url": "https://voxday.net/2018/07/19/darkstream-gateways-or-gatekeepers/",
  "scraped_at": "2025-12-19T21:12:34.623725",
  "title": "Darkstream: gateways or gatekeepers?",
  "date_display": "July 19, 2018",
  "date_iso": "2018-07-19T17:30:00+00:00",
  "date_from_url": "2018-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/pccQLl-WaRo\" width=\"512\"></iframe></div><p><i>From the transcript <a href=\"https://youtu.be/pccQLl-WaRo\">of the Darkstream</a>:</i></p><p>You see people like Shapiro, you see people like Peterson who have been elevated, and the reason that they have been elevated is because their whole job is to prevent young men especially from moving to nationalism. Everything that you see come out of their mouths is anti-nationalist. Now, it’s not always <i>directly </i>anti-nationalist, you know Peterson is more clever than Shapiro. What Peterson does is he criticizes things like the European Union, he criticizes the United Nations because he  thinks that they are moving too fast, too far, but his goals are exactly the same as George Soros.</p><p>What was really interesting was I read an interview with George Soros, <a href=\"http://voxday.blogspot.com/2018/07/the-defeat-of-sorosism.html\">it’s on my blog</a>, and one of the things that he said which was really striking was how he is non-ideological. Sound familiar? Jordan Peterson considers himself post-ideological. And Soros’s big concern is that the left has gotten too extreme, just like Peterson talking about how he wants the reasonable left to replace the SJWs because they go too far.</p><p>So what the conservatives constantly do is they see these guys saying, well the absolute hardcore extreme left is going too far, so they must be on our side. No, they’re not! They’re totally opposed to  everything you stand for! Jordan Peterson is not a Christian. Ben Shapiro is not a Christian. They are<br>absolutely against Christian rule, they are absolutely against American nationalism, they’re totally against the closed borders nationalism of Viktor Orban, of the Sweden Democrats, of Matteo Salvini and the Lega! They are world revolutionaries….</br></p><p>Now here’s the way that I can prove to you what I’m asserting. A lot of these people say that, well you know, they’re gateway drugs, you know, first young men encounter them, and then after that they’re able to move on to Steve Sailer, and after that they’re able to move on to Mike Cernovich and Milo, but that’s not true. I’m not saying it never happens but I can mathematically prove to you, I can logically prove to you, that this is not happening.</p><p>If they were gateways, then as they increase in media attention and popularity, and as they expand their fan bases, then if they were gateways we should be seeing an ever-expanding number of people coming into the right, coming into the nationalist right, coming into the Christian nationalist right,<br>from Jordan Peterson and from Ben Shapiro, but <i>that’s exactly what we don’t see!</i> We actually see people who follow these guys coming out directly against any criticism of them.</br></p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nYou see people like Shapiro, you see people like Peterson who have been elevated, and the reason that they have been elevated is because their whole job is to prevent young men especially from moving to nationalism. Everything that you see come out of their mouths is anti-nationalist. Now, it’s not always\ndirectly\nanti-nationalist, you know Peterson is more clever than Shapiro. What Peterson does is he criticizes things like the European Union, he criticizes the United Nations because he  thinks that they are moving too fast, too far, but his goals are exactly the same as George Soros.\nWhat was really interesting was I read an interview with George Soros,\nit’s on my blog\n, and one of the things that he said which was really striking was how he is non-ideological. Sound familiar? Jordan Peterson considers himself post-ideological. And Soros’s big concern is that the left has gotten too extreme, just like Peterson talking about how he wants the reasonable left to replace the SJWs because they go too far.\nSo what the conservatives constantly do is they see these guys saying, well the absolute hardcore extreme left is going too far, so they must be on our side. No, they’re not! They’re totally opposed to  everything you stand for! Jordan Peterson is not a Christian. Ben Shapiro is not a Christian. They are\nabsolutely against Christian rule, they are absolutely against American nationalism, they’re totally against the closed borders nationalism of Viktor Orban, of the Sweden Democrats, of Matteo Salvini and the Lega! They are world revolutionaries….\nNow here’s the way that I can prove to you what I’m asserting. A lot of these people say that, well you know, they’re gateway drugs, you know, first young men encounter them, and then after that they’re able to move on to Steve Sailer, and after that they’re able to move on to Mike Cernovich and Milo, but that’s not true. I’m not saying it never happens but I can mathematically prove to you, I can logically prove to you, that this is not happening.\nIf they were gateways, then as they increase in media attention and popularity, and as they expand their fan bases, then if they were gateways we should be seeing an ever-expanding number of people coming into the right, coming into the nationalist right, coming into the Christian nationalist right,\nfrom Jordan Peterson and from Ben Shapiro, but\nthat’s exactly what we don’t see!\nWe actually see people who follow these guys coming out directly against any criticism of them.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-19T16:30:00+00:00"
}