{
  "url": "https://voxday.net/2018/07/12/darkstream-trump-putin-and-the-religious-war/",
  "scraped_at": "2025-12-19T21:11:24.735170",
  "title": "Darkstream: Trump, Putin, and the religious war",
  "date_display": "July 12, 2018",
  "date_iso": "2018-07-12T12:20:22+00:00",
  "date_from_url": "2018-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/8AIUTggeye0\" width=\"512\"></iframe></div><p>From the transcript of <a href=\"https://youtu.be/8AIUTggeye0\">the Darkstream</a>:</p><p>Whether you believe in the spiritual aspect of life or not,  even if you’re a rational materialist and you believe that the only things that exist are things that you can see and feel, there is no shortage of material evil that you can see and feel and use to choose the right side. What that evil is is what I call the religion of Neo Babel and the European Union is one of the centers for that ancient religion.  Now this is not a coincidence, this is a painting by Bruegel on the left of the Tower of Babel. That was how he conceived of it, and we don’t know what it actually looked like but that was just one painter’s idea of it.</p><p>Now what is the architectural statement that is being made by the EU Parliament in Strasbourg? What they are very clearly stating in a language that anyone who speaks architecture can understand is that they represent Babel. They are the new Babel, and so the connection that a lot of people don’t make, the connection that a lot of people don’t realize is that these are the same people who in the U.S. are called neocons. They’re the same people who in the old Soviet Union were called communists, Bolshevik,  and eventually, Trotskyites. The difference between Stalinism and Trotskyism in the 1930s was that Trotsky stood for world revolution.</p><p>Stalin on the other hand picked up the idea of communism in one country. Now obviously the Soviet Union was not a good place, it was not anywhere you’d like to live, it was a economic contradiction in terms, it was bound to fail. Alexander Solzhenitsyn did a good job of chronicling the evils of Stalinist communism, but the fact is was that once communism ceased to be Trotskyite, it ceased to be the primary vehicle for world revolution. And because of the growing power of the United States, because of the fact that in the United States you had the only surviving industrial economy, you know you had the only global power that had not been destroyed during World War II, that became the center of the world revolution. They don’t call it Trotskyism, they called it neoconservatism, but if you read Irving Krystol – he’s the father of Bill Kristol, the fake conservative and Never Trumper – the neoconservatives were the heirs of Leon Trotsky, they’re the heirs of global revolution, and that’s why the neocons are constantly pressing for war with everyone, but they’re particularly pressing for war with Russia because Russia has escaped their grasp. They began to lose their grasp on it thanks to Stalin.</p><p>Now people didn’t necessarily make all these connections because Stalinist communism didn’t seem all that different than Leninist communism, and so you know, as you look into this, you begin to see that globalism is not something new. Globalism is the same thing that Trotsky preached, it’s the same thing that Antonio Gramsci preached, it is the world revolution. They called it world revolution because world revolution is supposed to bring about global government. Now where this gets religious, one thing that you may have noticed – even those of you who are pagans and hate the cucked Churchians as much as I do – one thing that you may have noticed is that these people <i>absolutely hate</i> Christianity.</p><p>They do their best to destroy Christian institutions, they invaded and began to destroy the Catholic  Church with Vatican II, they have invaded every single Protestant denomination,  I mean even the Southern Baptists, who I would have sworn 20 years ago could not be penetrated by these these lunatics, has been. Russell Moore and the people at the head of the Southern Baptist Conference are absolutely globalists, and so you know, when you look at this, you can see very clearly that this is ultimately not merely a political clash, it is a religious war, not only is it a religious war, it is THE religious war.</p></div>",
  "content_text": "From the transcript of\nthe Darkstream\n:\nWhether you believe in the spiritual aspect of life or not,  even if you’re a rational materialist and you believe that the only things that exist are things that you can see and feel, there is no shortage of material evil that you can see and feel and use to choose the right side. What that evil is is what I call the religion of Neo Babel and the European Union is one of the centers for that ancient religion.  Now this is not a coincidence, this is a painting by Bruegel on the left of the Tower of Babel. That was how he conceived of it, and we don’t know what it actually looked like but that was just one painter’s idea of it.\nNow what is the architectural statement that is being made by the EU Parliament in Strasbourg? What they are very clearly stating in a language that anyone who speaks architecture can understand is that they represent Babel. They are the new Babel, and so the connection that a lot of people don’t make, the connection that a lot of people don’t realize is that these are the same people who in the U.S. are called neocons. They’re the same people who in the old Soviet Union were called communists, Bolshevik,  and eventually, Trotskyites. The difference between Stalinism and Trotskyism in the 1930s was that Trotsky stood for world revolution.\nStalin on the other hand picked up the idea of communism in one country. Now obviously the Soviet Union was not a good place, it was not anywhere you’d like to live, it was a economic contradiction in terms, it was bound to fail. Alexander Solzhenitsyn did a good job of chronicling the evils of Stalinist communism, but the fact is was that once communism ceased to be Trotskyite, it ceased to be the primary vehicle for world revolution. And because of the growing power of the United States, because of the fact that in the United States you had the only surviving industrial economy, you know you had the only global power that had not been destroyed during World War II, that became the center of the world revolution. They don’t call it Trotskyism, they called it neoconservatism, but if you read Irving Krystol – he’s the father of Bill Kristol, the fake conservative and Never Trumper – the neoconservatives were the heirs of Leon Trotsky, they’re the heirs of global revolution, and that’s why the neocons are constantly pressing for war with everyone, but they’re particularly pressing for war with Russia because Russia has escaped their grasp. They began to lose their grasp on it thanks to Stalin.\nNow people didn’t necessarily make all these connections because Stalinist communism didn’t seem all that different than Leninist communism, and so you know, as you look into this, you begin to see that globalism is not something new. Globalism is the same thing that Trotsky preached, it’s the same thing that Antonio Gramsci preached, it is the world revolution. They called it world revolution because world revolution is supposed to bring about global government. Now where this gets religious, one thing that you may have noticed – even those of you who are pagans and hate the cucked Churchians as much as I do – one thing that you may have noticed is that these people\nabsolutely hate\nChristianity.\nThey do their best to destroy Christian institutions, they invaded and began to destroy the Catholic  Church with Vatican II, they have invaded every single Protestant denomination,  I mean even the Southern Baptists, who I would have sworn 20 years ago could not be penetrated by these these lunatics, has been. Russell Moore and the people at the head of the Southern Baptist Conference are absolutely globalists, and so you know, when you look at this, you can see very clearly that this is ultimately not merely a political clash, it is a religious war, not only is it a religious war, it is THE religious war.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-12T11:20:22+00:00"
}