{
  "url": "https://voxday.net/2018/07/31/darkstream-how-arkhaven-will-shake-up-comics/",
  "scraped_at": "2025-12-19T21:14:24.447140",
  "title": "Darkstream: How Arkhaven will shake up comics",
  "date_display": "July 31, 2018",
  "date_iso": "2018-07-31T15:15:19+00:00",
  "date_from_url": "2018-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/1WO6KFvu0u8\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/1WO6KFvu0u8\">of the Darkstream</a>:</p><p>How Arkhaven is going to shake up the comics industry. We’ve been talking about this a fair amount today on the blog and this was really sparked by discussion of someone saying, “well, you know, what the right-wing needs to do is we need to band together, you know, we need all the creators to team up to create a new Marvel.” But the problem is that creators teaming up is not creating a new Marvel, creators teaming up is creating a new Image Comics. And that’s not going to work because Image Comics has not been successful overall as a organization. It’s not going to work and the reason it’s not going to work is three-fold as far as I can tell.</p><p>Number one, people on the right are pretty individualistic. They have a tendency to want to pursue what is of maximum interest and value to them at the moment. They don’t tend to think in terms of building organizations and institutions, and they definitely don’t think in terms of taking over existing organizations and institutions and modifying them to their liking. So that’s the first reason. If you look at what is happening already, look at what has happened since we launched the Alt-Hero campaign and set off this whole comics Kickstarter thing, if you look at what has happened, the guy from Diversity &amp; Comics has had a lot of success, Ethan van Sciver has had a tremendous amount of success, you’ve got folks like Tim Lin and Chuck Dixon doing <i>Trump Space Force</i>, Will Caligan has been doing some other stuff, Jon Del Arroz has done <i>Flying Sparks</i> and he’s got another, bigger, project in the works.</p><p>If these people were all thinking in terms of institutions and infrastructure, then they would all be working with Arkhaven or Dark Legion, but most of them aren’t. Some of them are, yeah, we’re going to be publishing Jon Del Arroz’s stuff at retail, we’re going to be publishing Will Caligan’s stuff  too, but everyone else wants to do their own thing.</p><p>Now, there’s nothing wrong with that! Please understand, I am not criticizing! But what is going to happen is the same thing that has happened in the world of independent publishing, which is that you’re going to have a few really big winners, and they’re going to do very well, and almost everyone else is going to pretty much go by the wayside and be unable to really do anything at all. And in comics, it’s just that more difficult because it’s a lot easier to just write a book and put out an ebook on Amazon than it is to put together the various moving pieces that involve the writing, the illustrating, the coloring, the publishing, and the selling. You know, there are people who can do all that – Ethan van Sciver is very clearly one of them – but you’re not going to be able to build a publishing company off that. We’ve already seen this in the world of independent publishing.</p><p>Castelli House was supposed to publish Milo’s <i>Dangerous</i>. Four times we were told “yeah yeah yeah we want you to publish this,” but then they got all excited about the fact that they had a number one Amazon bestseller in pre-order and all that sort of thing, and thought, “well, you know, we will<br>start a publishing house around it.” The problem is that a publishing house involves a considerable amount of infrastructure and a lot of strategic relationships and that sort of thing, and what most people don’t understand is that we had this infrastructure assembled since 2014. We did the Alt-Hero<br>kickstarter in October 2017, so we already had everything in place for more than three years. The kickstarter was just the thing that allowed us to take it to the market, but we already had all the infrastructure in place.</br></br></p><p>It’s also very different publishing other people’s stuff than just doing your own thing. Now, I’m not saying that people are not going to be successful. Quite to the contrary, you <i>know </i>some people are going to be very successful, just not most of them. If you look at independent publishing, you look at how well people like Nick Cole and Jason Anspach are doing with <i>Galaxy’s Edge</i>, you look at how well a writer like Richard Fox is doing with <i>The</i> <i>Ember War</i>, but that is one-tenth of one-tenth of one percent of all the people who are tempted to play there, and the Amazon marketplace only exacerbates that “win big if you’re lucky, most of you lose” situation.</p><p>The other reason, the second reason, is that most illustrators can’t write. We had this discussion when we first started Arkhaven and I told people not to worry about the art. We had the writing, we had the stories, we had the characters, and as for the art, we were going to improve. People have already seen how we are improving the art and yet those first issues are still selling very well. Why? Because it’s <i>the stories</i> that matter. Art is great, the art attracts a lot of attention, I’m not denigrating the art, I’m simply saying that the art is one part of the puzzle, it’s one ingredient in the cake, and it’s not the most important one, it’s just the most obvious.</p><p>I think there might be a way for us to add some value at Dark Legion by putting together writers and illustrators and bringing them together to start you know working on new IP, new creator IP, that Dark Legion could publish. Now, I just started thinking about this today, I haven’t figured out exactly how the model is going to work. There’s always the problem because the artist has more work and it takes him more time, but the story created by the writer is actually more important in the long run, so how do you balance that? You know, what’s a fair division of labor there and so forth? I don’t know, maybe some of you will have ideas if you’re at all involved in that sort of thing.</p><p>And then the third problem is that you have to be willing to follow the leader. You don’t have to like the leader, you don’t have to agree with everything they do. Do you really think that everybody who joneses to get published by Marvel agrees with everything that Marvel’s editor-in-chief thinks? Of course not, you probably don’t even know who he is or what he thinks! Oh speak of the devil… Ethan’s here!</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nHow Arkhaven is going to shake up the comics industry. We’ve been talking about this a fair amount today on the blog and this was really sparked by discussion of someone saying, “well, you know, what the right-wing needs to do is we need to band together, you know, we need all the creators to team up to create a new Marvel.” But the problem is that creators teaming up is not creating a new Marvel, creators teaming up is creating a new Image Comics. And that’s not going to work because Image Comics has not been successful overall as a organization. It’s not going to work and the reason it’s not going to work is three-fold as far as I can tell.\nNumber one, people on the right are pretty individualistic. They have a tendency to want to pursue what is of maximum interest and value to them at the moment. They don’t tend to think in terms of building organizations and institutions, and they definitely don’t think in terms of taking over existing organizations and institutions and modifying them to their liking. So that’s the first reason. If you look at what is happening already, look at what has happened since we launched the Alt-Hero campaign and set off this whole comics Kickstarter thing, if you look at what has happened, the guy from Diversity & Comics has had a lot of success, Ethan van Sciver has had a tremendous amount of success, you’ve got folks like Tim Lin and Chuck Dixon doing\nTrump Space Force\n, Will Caligan has been doing some other stuff, Jon Del Arroz has done\nFlying Sparks\nand he’s got another, bigger, project in the works.\nIf these people were all thinking in terms of institutions and infrastructure, then they would all be working with Arkhaven or Dark Legion, but most of them aren’t. Some of them are, yeah, we’re going to be publishing Jon Del Arroz’s stuff at retail, we’re going to be publishing Will Caligan’s stuff  too, but everyone else wants to do their own thing.\nNow, there’s nothing wrong with that! Please understand, I am not criticizing! But what is going to happen is the same thing that has happened in the world of independent publishing, which is that you’re going to have a few really big winners, and they’re going to do very well, and almost everyone else is going to pretty much go by the wayside and be unable to really do anything at all. And in comics, it’s just that more difficult because it’s a lot easier to just write a book and put out an ebook on Amazon than it is to put together the various moving pieces that involve the writing, the illustrating, the coloring, the publishing, and the selling. You know, there are people who can do all that – Ethan van Sciver is very clearly one of them – but you’re not going to be able to build a publishing company off that. We’ve already seen this in the world of independent publishing.\nCastelli House was supposed to publish Milo’s\nDangerous\n. Four times we were told “yeah yeah yeah we want you to publish this,” but then they got all excited about the fact that they had a number one Amazon bestseller in pre-order and all that sort of thing, and thought, “well, you know, we will\nstart a publishing house around it.” The problem is that a publishing house involves a considerable amount of infrastructure and a lot of strategic relationships and that sort of thing, and what most people don’t understand is that we had this infrastructure assembled since 2014. We did the Alt-Hero\nkickstarter in October 2017, so we already had everything in place for more than three years. The kickstarter was just the thing that allowed us to take it to the market, but we already had all the infrastructure in place.\nIt’s also very different publishing other people’s stuff than just doing your own thing. Now, I’m not saying that people are not going to be successful. Quite to the contrary, you\nknow\nsome people are going to be very successful, just not most of them. If you look at independent publishing, you look at how well people like Nick Cole and Jason Anspach are doing with\nGalaxy’s Edge\n, you look at how well a writer like Richard Fox is doing with\nThe\nEmber War\n, but that is one-tenth of one-tenth of one percent of all the people who are tempted to play there, and the Amazon marketplace only exacerbates that “win big if you’re lucky, most of you lose” situation.\nThe other reason, the second reason, is that most illustrators can’t write. We had this discussion when we first started Arkhaven and I told people not to worry about the art. We had the writing, we had the stories, we had the characters, and as for the art, we were going to improve. People have already seen how we are improving the art and yet those first issues are still selling very well. Why? Because it’s\nthe stories\nthat matter. Art is great, the art attracts a lot of attention, I’m not denigrating the art, I’m simply saying that the art is one part of the puzzle, it’s one ingredient in the cake, and it’s not the most important one, it’s just the most obvious.\nI think there might be a way for us to add some value at Dark Legion by putting together writers and illustrators and bringing them together to start you know working on new IP, new creator IP, that Dark Legion could publish. Now, I just started thinking about this today, I haven’t figured out exactly how the model is going to work. There’s always the problem because the artist has more work and it takes him more time, but the story created by the writer is actually more important in the long run, so how do you balance that? You know, what’s a fair division of labor there and so forth? I don’t know, maybe some of you will have ideas if you’re at all involved in that sort of thing.\nAnd then the third problem is that you have to be willing to follow the leader. You don’t have to like the leader, you don’t have to agree with everything they do. Do you really think that everybody who joneses to get published by Marvel agrees with everything that Marvel’s editor-in-chief thinks? Of course not, you probably don’t even know who he is or what he thinks! Oh speak of the devil… Ethan’s here!",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-31T14:15:19+00:00"
}