{
  "url": "https://voxday.net/2018/07/01/darkstream-why-you-dont-talk-to-the-media/",
  "scraped_at": "2025-12-19T21:09:26.573087",
  "title": "Darkstream: why you don’t talk to the media",
  "date_display": "July 1, 2018",
  "date_iso": "2018-07-01T12:52:05+00:00",
  "date_from_url": "2018-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/TatYR4aDBfM\" width=\"512\"></iframe></div><p>From the <a href=\"https://youtu.be/TatYR4aDBfM\">transcript</a>:</p><p>It doesn’t even matter what you do or what you say, the narrative is already written, the story has already been laid out. All they’re doing now when they talk to you is getting kill quotes and getting words that they can then spin to claim that they’ve given you a fair shake. You see, when they contact you, what they tell you is that they want to give you your chance to tell your side of the story, and the thing is, the clear implication is already there! You know, <i>they’re already signalling what they’re  going to do to you</i> because the other side of the story, the story that is not your side of the story, is the narrative.</p><p>The way they portray it is, well, so-and-so has said something about you, or there is this belief that X or Y or Z is true about you, what’s your version of that? And what they want you to do is they want you to play defense to their prosecuting attorney. That’s the whole idea! You are there to be the subject of the interrogation and they are the stars who are prosecuting you. Now, of course that’s why they want to talk to you! They don’t need you to verify any facts, they will completely ignore anything that you say if you manage to somehow miraculously defang and conclusively disprove an assertion that was part of their narrative.</p><p>At most what they will do is simply omit that part. They will never make the false charge and then allow you to disprove it, so it’s a situation where you literally cannot win because the deck is stacked. You’re in a courtroom of public opinion where the arresting officer, the judge, the prosecuting attorney and the defense attorney are all the same person, they’re all the reporter.</p><p>And here’s the other thing that you need to understand: it usually isn’t the reporter who dictates the narrative… so the best way that you can defang them, the best way that you control them, is to simply not talk to them! Because they need content, they need your comments, and the stories that they are writing do not do not work without your participation, that’s why they’re always looking for your participation.</p></div>",
  "content_text": "From the\ntranscript\n:\nIt doesn’t even matter what you do or what you say, the narrative is already written, the story has already been laid out. All they’re doing now when they talk to you is getting kill quotes and getting words that they can then spin to claim that they’ve given you a fair shake. You see, when they contact you, what they tell you is that they want to give you your chance to tell your side of the story, and the thing is, the clear implication is already there! You know,\nthey’re already signalling what they’re  going to do to you\nbecause the other side of the story, the story that is not your side of the story, is the narrative.\nThe way they portray it is, well, so-and-so has said something about you, or there is this belief that X or Y or Z is true about you, what’s your version of that? And what they want you to do is they want you to play defense to their prosecuting attorney. That’s the whole idea! You are there to be the subject of the interrogation and they are the stars who are prosecuting you. Now, of course that’s why they want to talk to you! They don’t need you to verify any facts, they will completely ignore anything that you say if you manage to somehow miraculously defang and conclusively disprove an assertion that was part of their narrative.\nAt most what they will do is simply omit that part. They will never make the false charge and then allow you to disprove it, so it’s a situation where you literally cannot win because the deck is stacked. You’re in a courtroom of public opinion where the arresting officer, the judge, the prosecuting attorney and the defense attorney are all the same person, they’re all the reporter.\nAnd here’s the other thing that you need to understand: it usually isn’t the reporter who dictates the narrative… so the best way that you can defang them, the best way that you control them, is to simply not talk to them! Because they need content, they need your comments, and the stories that they are writing do not do not work without your participation, that’s why they’re always looking for your participation.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-01T11:52:05+00:00"
}