{
  "url": "https://voxday.net/2018/07/04/darkstream-everyone-is-an-american-now/",
  "scraped_at": "2025-12-19T21:09:57.853726",
  "title": "Darkstream: Everyone is an American now",
  "date_display": "July 4, 2018",
  "date_iso": "2018-07-04T00:37:16+00:00",
  "date_from_url": "2018-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/PoKtQZrs43Y\" width=\"512\"></iframe></div><p>From the <a href=\"https://youtu.be/PoKtQZrs43Y\">transcript</a>:</p><p>So the Mexican elections finished up and the results were not surprising to anyone who’s been paying attention,  but they’re certainly significant. You know the remarkable thing wasn’t that Mexico elected a pretty serious socialist on the Venezuelan model, but the massive amount of the guy won by. If I recall correctly he had nearly 60 percent more votes than his closest rival, and what I want to discuss is the statement that he made where he was talking about how everyone has a right to live in the United States. Everyone apparently is an American now. So how does somebody come up with something like this? Where does it come from? You know, why would a foreign leader say something that is that seemingly insane?</p><p>The answer is very simple. He’s not even close to being the first foreign leader who said something like this. A lot of people don’t realize it, but Moammar Qaddafi used to say exactly the same thing: America belongs to everyone, America belongs to the world. More recently the Iranian president, or former President Mahmoud Ahmadinejad said much the same thing. He said America is a concept that belongs to the world and no government has the right to tell people that they can’t go and live in the United States.</p><p>Now a lot of people are saying well, how can this be? How can AMLO, this Mexican president, be talking like this? They don’t know about Qaddafi, they don’t know about the Iranian president using the same language, but the reality is that this concept is directly traceable to the idea that conservatives have been using in order to try to justify their dislike for identity politics and their dislike for the idea that white Americans might have a nationality of their own, that there might be an American nation.</p><p>You know, it’s not the Mexicans, it’s not the Iranians, it’s not the Libyans, who came up with the idea that there is no such thing as an American nation. If you want to hear people talk about that you’ve got people like Ben Shapiro who will talk your ears off about how America is not a nation, America is a concept, America is a a nation of immigrants, America is a melting pot. Come on! You guys have all heard these concepts. In fact, I would be willing to bet that since this audience tends to be a bit more right wing than the norm, I would bet that at least three-quarters of you subscribed to those concepts at some point.</p><p>So I’m going to make some of you extremely uncomfortable here, because what I’m going to tell you – and this is not going to be comfortable for those of you who are US citizens – a lot of you are not Americans and you never were. Your parents aren’t, you’re grandparents aren’t, because Americans<br>are defined very, very clearly and the United States Constitution was written for a very specific group of people and that doesn’t include immigrants, it doesn’t include refugees, it doesn’t include the great grand children of former immigrants, it doesn’t include anybody except for the sons and daughters of the American Revolution.</br></p></div>",
  "content_text": "From the\ntranscript\n:\nSo the Mexican elections finished up and the results were not surprising to anyone who’s been paying attention,  but they’re certainly significant. You know the remarkable thing wasn’t that Mexico elected a pretty serious socialist on the Venezuelan model, but the massive amount of the guy won by. If I recall correctly he had nearly 60 percent more votes than his closest rival, and what I want to discuss is the statement that he made where he was talking about how everyone has a right to live in the United States. Everyone apparently is an American now. So how does somebody come up with something like this? Where does it come from? You know, why would a foreign leader say something that is that seemingly insane?\nThe answer is very simple. He’s not even close to being the first foreign leader who said something like this. A lot of people don’t realize it, but Moammar Qaddafi used to say exactly the same thing: America belongs to everyone, America belongs to the world. More recently the Iranian president, or former President Mahmoud Ahmadinejad said much the same thing. He said America is a concept that belongs to the world and no government has the right to tell people that they can’t go and live in the United States.\nNow a lot of people are saying well, how can this be? How can AMLO, this Mexican president, be talking like this? They don’t know about Qaddafi, they don’t know about the Iranian president using the same language, but the reality is that this concept is directly traceable to the idea that conservatives have been using in order to try to justify their dislike for identity politics and their dislike for the idea that white Americans might have a nationality of their own, that there might be an American nation.\nYou know, it’s not the Mexicans, it’s not the Iranians, it’s not the Libyans, who came up with the idea that there is no such thing as an American nation. If you want to hear people talk about that you’ve got people like Ben Shapiro who will talk your ears off about how America is not a nation, America is a concept, America is a a nation of immigrants, America is a melting pot. Come on! You guys have all heard these concepts. In fact, I would be willing to bet that since this audience tends to be a bit more right wing than the norm, I would bet that at least three-quarters of you subscribed to those concepts at some point.\nSo I’m going to make some of you extremely uncomfortable here, because what I’m going to tell you – and this is not going to be comfortable for those of you who are US citizens – a lot of you are not Americans and you never were. Your parents aren’t, you’re grandparents aren’t, because Americans\nare defined very, very clearly and the United States Constitution was written for a very specific group of people and that doesn’t include immigrants, it doesn’t include refugees, it doesn’t include the great grand children of former immigrants, it doesn’t include anybody except for the sons and daughters of the American Revolution.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-03T23:37:16+00:00"
}