{
  "url": "https://voxday.net/2018/07/25/darkstream-saint-chan-takes-on-hollywood/",
  "scraped_at": "2025-12-19T21:13:22.566296",
  "title": "Darkstream: Saint Chan takes on Hollywood",
  "date_display": "July 25, 2018",
  "date_iso": "2018-07-25T14:41:20+00:00",
  "date_from_url": "2018-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/6q-12WJQrLc\" width=\"512\"></iframe></div><p>From the transcript of <a href=\"https://youtu.be/6q-12WJQrLc\">the Darkstream</a>.</p><p>You may recall when David Chappelle inexplicably went off to Africa. I mean here is a guy who was top of his game, making incredible sums of money, who was offered everything in the world, and he turns it all down and just disappears into Africa for no reason that anyone can understand. And he never really addressed it directly, it was portrayed as him having some sort of breakdown or something, but he wasn’t having a breakdown, and he explained it in an interview on Inside the Acting show – I can’t remember what it’s called – but he’s talking to a bunch of acting students and he talked about how important it was to have your price, to know what your price was before you went out to pursue a career in Hollywood. And so it was interesting because he said it’s very important to know what your price is, to know what lines you’re not going to cross, and then he said “hence Africa.” What he was very clearly saying was that he was asked to pay a price that he was not willing to pay for his career.</p><p>This is something that is relevant to me personally at the moment because now we have a successful line of comics, now that people are becoming aware of the quality of our books and the potential that they have in various mediums and various media, whether it’s film, whether it’s cable, whether it’s streaming, or whether it’s games, so there are people that are interested and that are talking to us, and one of the things I make very clear is that if they’re interested in trying to offer us success in exchange for compromising our principles, our faith, or our souls, they can just stop the conversation right now. We will do it ourselves, then maybe we won’t be successful – so the fuck what?</p><p>Jesus Christ turned down the entire world, what price a TV show? Why would you sell your soul for a TV show, for a movie, for a career as a second-rate movie star? I mean seriously, who has a better career in Hollywood than Tom Cruise, is there anyone you can think of? He’s in all the blockbusters, everybody knows his name, he’s about as famous as you can be, he’s been in a number of hit franchises, he’s been in movies that are part of our cultural language, several of his characters are iconic figures, and how many of you would trade places to live in that guy’s freakish life? Why would you ever why would you ever want to live like that?  And that’s the best that they can offer! That is the Heaven on Earth that they can offer you. What an utter nightmare!</p><p><i> Are there any other celebrities you believe will be exposed?</i></p><p>Yes I think that lots of people will be exposed. If you go to Neon Revolt, if you go to 8Chan, if you go to Crazy Days and Nights they are all naming names. Now, I’m not going to name any of those names because I have no direct information about any of them. It’s not my world. I’m <i>glad </i>it’s not my world. You know if you want to talk about game designers, I was talking to Derek Smart today. I talk to people in the games industry on a regular basis, and I can guarantee you that we don’t do any casting couch bullshit, we don’t make anybody engage in bizarre rituals so that they can work on games with us. I mean, that sort of stuff would be totally insane.</p><p><i>Do you believe Hollywood’s destructive influence on dismantling Christian culture was intentional or a side-effect of encouraging their own depravity?</i></p><p>It was absolutely intentional: these people hate Christianity, they hate Christians, they hate Western civilization, and they even hate Christmas. It’s really astonishing when you learn to see it, and once you see it, you can’t un-see it.</p><p>On a not-unrelated note, Ben Shapiro being a Hollywood Jew with Hollywood values is not news to me. I knew the background of the Littlest Chickenhawk – now there is an unexpectedly dual-barreled nickname – from the start. But Ben Shapiro’s background never seemed relevant to my criticism of him until the “conservative” talking head inexplicably <a href=\"https://www.thegatewaypundit.com/2018/07/ben-shapiro-loses-debate-defending-disgraced-perverted-disney-director-james-gunn/\">leaped to the defense of James Gunn</a>:</p><blockquote><p>Late Thursday night, Mike Cernovich, a centrist social writer-activist and childrens advocate who has aligned himself with right-wing political movements over the past two years, began sharing Gunn’s insidious tweets. Less than 12 hours after Cernovich, who was amplified by One America News’ Jack Posobiec and the film, An Open Secret, which documents the systemic sexual child abuse found throughout Hollywood, began sharing this evidence with the public Disney fired Gunn from the upcoming sequel.</p><p>Gunn tweeted these comments in his forties. He is reportedly worth $100 million and the writer-director of a teen film series. These aren’t tweets from a college kid trying to get attention, or a rising standup comedian trying to bombast their way into the public spotlight. This wasn’t a careless retweet, or a foolishly shared comic. These comments should be damning to anyone, like Shapiro, who strategically positions themselves on the most archaic of social conservatism.</p><p>Strange, isn’t it? Maybe not. Shapiro grew up, and still lives, in Hollywood. His mother is a power-player within the industry and his cousins are actors Mara Wilson and Daniel Ben Wilson….</p><ul><li>Was Ben Shapiro defending of James Gunn on his Twitter, the Daily Wire blog, and podcast because Gunn had defended him?</li><li>Is this tribal Hollywood protecting Hollywood?</li><li>Was Mike Cernovich’s takedown of James Gunn the reason why Shapiro opposed it?</li><li>Are there any disclosures Shapiro would like to make about himself or his family’s relationship with Gunn, his associates, or Disney or its subsidiaries? </li></ul><p>These are questions Shapiro won’t host a debate on. Why not?</p></blockquote><p>Because Shapiro is an evil little fraud. He’s terrified of debate with anyone who isn’t a left-wing halfwit. He’s a midwit, a gatekeeper, and a media construct who has been relentlessly pushed on American conservatives since he was in junior high. Any Christian or conservative who considers himself a Shapiro fan is a naive fool who has been taken in by the propaganda program. The same thing goes for Jordan Peterson.</p><p>These heavily promoted wormtongues do not speak the truth, they do not believe what their fans think they believe, and their objectives are to protect evil by distracting and confusing those who would otherwise stand against it. William F. Buckley. Glenn Beck. Ben Shapiro. Jordan Peterson…. when are conservatives going to stop falling for these obvious frauds?</p></div>",
  "content_text": "From the transcript of\nthe Darkstream\n.\nYou may recall when David Chappelle inexplicably went off to Africa. I mean here is a guy who was top of his game, making incredible sums of money, who was offered everything in the world, and he turns it all down and just disappears into Africa for no reason that anyone can understand. And he never really addressed it directly, it was portrayed as him having some sort of breakdown or something, but he wasn’t having a breakdown, and he explained it in an interview on Inside the Acting show – I can’t remember what it’s called – but he’s talking to a bunch of acting students and he talked about how important it was to have your price, to know what your price was before you went out to pursue a career in Hollywood. And so it was interesting because he said it’s very important to know what your price is, to know what lines you’re not going to cross, and then he said “hence Africa.” What he was very clearly saying was that he was asked to pay a price that he was not willing to pay for his career.\nThis is something that is relevant to me personally at the moment because now we have a successful line of comics, now that people are becoming aware of the quality of our books and the potential that they have in various mediums and various media, whether it’s film, whether it’s cable, whether it’s streaming, or whether it’s games, so there are people that are interested and that are talking to us, and one of the things I make very clear is that if they’re interested in trying to offer us success in exchange for compromising our principles, our faith, or our souls, they can just stop the conversation right now. We will do it ourselves, then maybe we won’t be successful – so the fuck what?\nJesus Christ turned down the entire world, what price a TV show? Why would you sell your soul for a TV show, for a movie, for a career as a second-rate movie star? I mean seriously, who has a better career in Hollywood than Tom Cruise, is there anyone you can think of? He’s in all the blockbusters, everybody knows his name, he’s about as famous as you can be, he’s been in a number of hit franchises, he’s been in movies that are part of our cultural language, several of his characters are iconic figures, and how many of you would trade places to live in that guy’s freakish life? Why would you ever why would you ever want to live like that?  And that’s the best that they can offer! That is the Heaven on Earth that they can offer you. What an utter nightmare!\nAre there any other celebrities you believe will be exposed?\nYes I think that lots of people will be exposed. If you go to Neon Revolt, if you go to 8Chan, if you go to Crazy Days and Nights they are all naming names. Now, I’m not going to name any of those names because I have no direct information about any of them. It’s not my world. I’m\nglad\nit’s not my world. You know if you want to talk about game designers, I was talking to Derek Smart today. I talk to people in the games industry on a regular basis, and I can guarantee you that we don’t do any casting couch bullshit, we don’t make anybody engage in bizarre rituals so that they can work on games with us. I mean, that sort of stuff would be totally insane.\nDo you believe Hollywood’s destructive influence on dismantling Christian culture was intentional or a side-effect of encouraging their own depravity?\nIt was absolutely intentional: these people hate Christianity, they hate Christians, they hate Western civilization, and they even hate Christmas. It’s really astonishing when you learn to see it, and once you see it, you can’t un-see it.\nOn a not-unrelated note, Ben Shapiro being a Hollywood Jew with Hollywood values is not news to me. I knew the background of the Littlest Chickenhawk – now there is an unexpectedly dual-barreled nickname – from the start. But Ben Shapiro’s background never seemed relevant to my criticism of him until the “conservative” talking head inexplicably\nleaped to the defense of James Gunn\n:\nLate Thursday night, Mike Cernovich, a centrist social writer-activist and childrens advocate who has aligned himself with right-wing political movements over the past two years, began sharing Gunn’s insidious tweets. Less than 12 hours after Cernovich, who was amplified by One America News’ Jack Posobiec and the film, An Open Secret, which documents the systemic sexual child abuse found throughout Hollywood, began sharing this evidence with the public Disney fired Gunn from the upcoming sequel.\nGunn tweeted these comments in his forties. He is reportedly worth $100 million and the writer-director of a teen film series. These aren’t tweets from a college kid trying to get attention, or a rising standup comedian trying to bombast their way into the public spotlight. This wasn’t a careless retweet, or a foolishly shared comic. These comments should be damning to anyone, like Shapiro, who strategically positions themselves on the most archaic of social conservatism.\nStrange, isn’t it? Maybe not. Shapiro grew up, and still lives, in Hollywood. His mother is a power-player within the industry and his cousins are actors Mara Wilson and Daniel Ben Wilson….\nWas Ben Shapiro defending of James Gunn on his Twitter, the Daily Wire blog, and podcast because Gunn had defended him?\nIs this tribal Hollywood protecting Hollywood?\nWas Mike Cernovich’s takedown of James Gunn the reason why Shapiro opposed it?\nAre there any disclosures Shapiro would like to make about himself or his family’s relationship with Gunn, his associates, or Disney or its subsidiaries?\nThese are questions Shapiro won’t host a debate on. Why not?\nBecause Shapiro is an evil little fraud. He’s terrified of debate with anyone who isn’t a left-wing halfwit. He’s a midwit, a gatekeeper, and a media construct who has been relentlessly pushed on American conservatives since he was in junior high. Any Christian or conservative who considers himself a Shapiro fan is a naive fool who has been taken in by the propaganda program. The same thing goes for Jordan Peterson.\nThese heavily promoted wormtongues do not speak the truth, they do not believe what their fans think they believe, and their objectives are to protect evil by distracting and confusing those who would otherwise stand against it. William F. Buckley. Glenn Beck. Ben Shapiro. Jordan Peterson…. when are conservatives going to stop falling for these obvious frauds?",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-25T13:41:20+00:00"
}