{
  "url": "https://voxday.net/2018/07/25/david-cole-defends-the-pedojokers/",
  "scraped_at": "2025-12-19T21:13:18.713408",
  "title": "David Cole defends the pedojokers",
  "date_display": "July 25, 2018",
  "date_iso": "2018-07-25T09:35:07+00:00",
  "date_from_url": "2018-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s just ever so shocking to discover another (((conservative))) <a href=\"http://takimag.com/article/shouting_pedo_in_a_crowded_twitter_david_cole\">defending the right of depraved Hollywood freaks</a> to repeatedly “joke” about pedophilia and molesting children:</p><blockquote><p>Last week, everyone’s favorite alt-right troll, Mike Cernovich, decided he’d had enough of Gunn’s two-bit leftist moralizing. So a-diggin’ he went, and he unearthed all those nasty old tweets. And Disney promptly fired Gunn from the next Guardians of the Galaxy installment. Gunn canceled his appearance at the San Diego Comic-Con (the Cannes of nerd-dom), and his future in the business is very much in doubt.</p><p>Moved by the peine forte et dure, Gunn apologized and begged for forgiveness. But seriously, does that ever work anymore? Of course not. The man’s toast. And his fate has divided the right into four camps:</p><p>(1) The Pizzagaters. These nuts believe that Gunn’s public tweets prove there’s a top-secret, organized cabal of pedophiles in Hollywood.</p><p>(2) The Moralists. Their deal is, “Rape jokes are never funny! Pedo jokes are never funny! Firing Gunn was the right call.”</p><p>(3) The Schadenfreuders. “The bastard got what he deserved for cheering when the same thing happened to Roseanne. Maybe if enough lefties suffer because of these witch hunts, they’ll finally stop doing it to us.”</p><p>(4) Me. I’ll get to that in a minute.</p></blockquote><p>(1) It’s not a secret. There is a disturbingly large population of pedophiles in Hollywood. Everyone there knows who they are, including David Cole. While Gunn’s jokes don’t prove the existence of an organized cabal, based on his “jokes”, his recent movie that featured a pit containing the remains of tens of thousands of children murdered by their father, and his various pictures posted on social media featuring pizza, crying children, and other symbols known to be utilized by pedos, it appears that Gunn was, at the very least, conversant with that particular collection of evil freaks.</p><p>(2) David Cole doesn’t understand what morality is. The deal of the moralists are that pedo jokes are always <u>wrong</u>, whether they are funny or not. But whether that is true or not, being funny does not absolve one of the immorality of ones words and deeds. To be forgiven for sin, one must repent, not produce a sufficiently amusing wisecrack. From the moral perspective, firing Gunn was the right call, whether one happened to find him to be funny or not.</p><p>(3) Gunn did get what he deserved. Having been banned from Twitter for absolutely nothing at all and having my livelihood <a href=\"https://yesmargaret.com/2018/07/crowdfunding-platform-freestartr-banned-by-paypal-stripe/\">directly affected by the speech and thought police</a>, I have absolutely no pity whatsoever for someone like Gunn losing his job. Reprisals are always justified whether they are successful in convincing the enemy to abandon the tactic in question or not.</p><p>(4) He never got to it.</p><blockquote class=\"tr_bq\"><p>When a major leftist A-lister like Gunn is punished for speech, the right goes “Serves you right! Sweet revenge!” But the general public, and other figures in the entertainment industry, go “Oh shit, if that can happen to him, I’d better shut the hell up and never say anything even slightly controversial.” So go ahead, cheer James Gunn’s destruction. You want Europe? That’s how you’ll get Europe. People scared to speak freely, people frightened to crack a joke. If that’s what you want, I don’t care if you’re on “my side.” Fuck off. </p></blockquote><p>Everyone in the center and the Right was already doing that. Submission is not better than resistance and reprisal. And as one who has lived in Europe for decades, I can attest that Europeans feel considerably more free to make controversial statements than anyone in America does.</p><p>We’re not on your side, David. And we know perfectly well that you’re not on ours. You’re not fooling us at all. Free speech is an anti-Christian fraud, <a href=\"https://aerbook.com/maker/productcard-148266-1875.html\">it always has been</a>, and the West will do very well to revive and restore the historical blasphemy laws. Since the idea of no standards is clearly not tenable, it will be much better to abide by the historical standards of civilized Christianity than the ever-mutating standard of social justice.</p></div>",
  "content_text": "It’s just ever so shocking to discover another (((conservative)))\ndefending the right of depraved Hollywood freaks\nto repeatedly “joke” about pedophilia and molesting children:\nLast week, everyone’s favorite alt-right troll, Mike Cernovich, decided he’d had enough of Gunn’s two-bit leftist moralizing. So a-diggin’ he went, and he unearthed all those nasty old tweets. And Disney promptly fired Gunn from the next Guardians of the Galaxy installment. Gunn canceled his appearance at the San Diego Comic-Con (the Cannes of nerd-dom), and his future in the business is very much in doubt.\nMoved by the peine forte et dure, Gunn apologized and begged for forgiveness. But seriously, does that ever work anymore? Of course not. The man’s toast. And his fate has divided the right into four camps:\n(1) The Pizzagaters. These nuts believe that Gunn’s public tweets prove there’s a top-secret, organized cabal of pedophiles in Hollywood.\n(2) The Moralists. Their deal is, “Rape jokes are never funny! Pedo jokes are never funny! Firing Gunn was the right call.”\n(3) The Schadenfreuders. “The bastard got what he deserved for cheering when the same thing happened to Roseanne. Maybe if enough lefties suffer because of these witch hunts, they’ll finally stop doing it to us.”\n(4) Me. I’ll get to that in a minute.\n(1) It’s not a secret. There is a disturbingly large population of pedophiles in Hollywood. Everyone there knows who they are, including David Cole. While Gunn’s jokes don’t prove the existence of an organized cabal, based on his “jokes”, his recent movie that featured a pit containing the remains of tens of thousands of children murdered by their father, and his various pictures posted on social media featuring pizza, crying children, and other symbols known to be utilized by pedos, it appears that Gunn was, at the very least, conversant with that particular collection of evil freaks.\n(2) David Cole doesn’t understand what morality is. The deal of the moralists are that pedo jokes are always\nwrong\n, whether they are funny or not. But whether that is true or not, being funny does not absolve one of the immorality of ones words and deeds. To be forgiven for sin, one must repent, not produce a sufficiently amusing wisecrack. From the moral perspective, firing Gunn was the right call, whether one happened to find him to be funny or not.\n(3) Gunn did get what he deserved. Having been banned from Twitter for absolutely nothing at all and having my livelihood\ndirectly affected by the speech and thought police\n, I have absolutely no pity whatsoever for someone like Gunn losing his job. Reprisals are always justified whether they are successful in convincing the enemy to abandon the tactic in question or not.\n(4) He never got to it.\nWhen a major leftist A-lister like Gunn is punished for speech, the right goes “Serves you right! Sweet revenge!” But the general public, and other figures in the entertainment industry, go “Oh shit, if that can happen to him, I’d better shut the hell up and never say anything even slightly controversial.” So go ahead, cheer James Gunn’s destruction. You want Europe? That’s how you’ll get Europe. People scared to speak freely, people frightened to crack a joke. If that’s what you want, I don’t care if you’re on “my side.” Fuck off.\nEveryone in the center and the Right was already doing that. Submission is not better than resistance and reprisal. And as one who has lived in Europe for decades, I can attest that Europeans feel considerably more free to make controversial statements than anyone in America does.\nWe’re not on your side, David. And we know perfectly well that you’re not on ours. You’re not fooling us at all. Free speech is an anti-Christian fraud,\nit always has been\n, and the West will do very well to revive and restore the historical blasphemy laws. Since the idea of no standards is clearly not tenable, it will be much better to abide by the historical standards of civilized Christianity than the ever-mutating standard of social justice.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-25T08:35:07+00:00"
}