{
  "url": "https://voxday.net/2018/07/01/i-hate-video/",
  "scraped_at": "2025-12-19T21:09:33.976497",
  "title": "I hate video",
  "date_display": "July 1, 2018",
  "date_iso": "2018-07-01T17:48:28+00:00",
  "date_from_url": "2018-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I really, really do. I mean, I understand it is necessary to reach a broader, post-literate audience, and I am committed to mastering the medium eventually, but I genuinely do not understand how these morons can so confidently, and so publicly, take the absurd positions they do.</p><blockquote class=\"tr_bq\"><p>Κέννυ Αντονέσκου<br>All you seem to do is just say “this won’t work because its not applicable to X” and other statements that you do not back up with logic, reason, evidence, etc. Maybe your brain-dead followers won’t challenge what you are saying but I will, unsubscribing from you because you are obviously a pseudo-intellectual who constantly brags about how you have super high IQ when its clear you are not high IQ.﻿</br></p></blockquote><p>Perhaps if he was able to read, or obtain material from some other medium, he would understand that I reliably back up my assertions in what is generally considered to be comprehensive detail. He doesn’t seem to be aware that there is considerably more information available beyond that which is presented on YouTube in the Darkstreams.</p><p>It’s like someone told these morons that all you have to do is say the magic words and declare that it seems like someone doesn’t back up a statement with logic, reason, and evidence, and this will suffice to not only disprove the statement, but also permanently disqualify the source. He quite clearly doesn’t understand that saying X won’t work because it’s not applicable to Y is, in fact, a logical syllogism. I really wish he was telling the truth about unsubscribing and not watching future videos, but we all know what the chances of that are.</p></div>",
  "content_text": "I really, really do. I mean, I understand it is necessary to reach a broader, post-literate audience, and I am committed to mastering the medium eventually, but I genuinely do not understand how these morons can so confidently, and so publicly, take the absurd positions they do.\nΚέννυ Αντονέσκου\nAll you seem to do is just say “this won’t work because its not applicable to X” and other statements that you do not back up with logic, reason, evidence, etc. Maybe your brain-dead followers won’t challenge what you are saying but I will, unsubscribing from you because you are obviously a pseudo-intellectual who constantly brags about how you have super high IQ when its clear you are not high IQ.﻿\nPerhaps if he was able to read, or obtain material from some other medium, he would understand that I reliably back up my assertions in what is generally considered to be comprehensive detail. He doesn’t seem to be aware that there is considerably more information available beyond that which is presented on YouTube in the Darkstreams.\nIt’s like someone told these morons that all you have to do is say the magic words and declare that it seems like someone doesn’t back up a statement with logic, reason, and evidence, and this will suffice to not only disprove the statement, but also permanently disqualify the source. He quite clearly doesn’t understand that saying X won’t work because it’s not applicable to Y is, in fact, a logical syllogism. I really wish he was telling the truth about unsubscribing and not watching future videos, but we all know what the chances of that are.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-01T16:48:28+00:00"
}