{
  "url": "https://voxday.net/2018/07/29/interview-with-chuck-dixon/",
  "scraped_at": "2025-12-19T21:14:01.398686",
  "title": "Interview with Chuck Dixon",
  "date_display": "July 29, 2018",
  "date_iso": "2018-07-29T12:00:08+00:00",
  "date_from_url": "2018-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know how I somehow managed to miss <a href=\"http://boundingintocomics.com/2018/02/12/interview-wading-war-chuck-dixon/\">this interview with The Legend Chuck Dixon</a> – that is how he is addressed in the Arkhaven offices, you understand – by <i>Bounding Into Comics</i>:</p><blockquote><p><b>BIC:</b> Along with Levon’s War, you are also working on a number of projects with Vox Day’s Castalia House publishing. You’ve got Avalon which is expected to come out this March. The book will feature the crime fighting duo of King Ace and Fazer, what can you tell us about these two?</p><p><b>Chuck: </b>King and Fazer are just a part of a larger ensemble cast of super-powered heroes and outlaws. To say King and Fazer’s relationship is complicated is an understatement. King Ace is a kind of Superman type, a big beefcake who’s bullet-resistant, super-strong and can leap long distances. Fazer has the ability to pass through solid objects. They’re powers complement one another even though their personalities are very much at odds.</p><p>We also have Cash, a mercenary crimefighter who battles evil for tips and Vendetta, a female vigilante, whose motives and mission provide much of the core story for the first six issues of the book.</p><p>But the true star of the book is the city of Avalon itself. It’s an east coast town that’s seen better days and getting rather tired of being ground zero for super-fights between good guys and bad guys.</p><p><b>BIC:</b> You will also be working with Will Caligan. Have you figured out which novels you will adapt into graphic novels?</p><p><b>Chuck:</b> We’re adapting <i>Swan Knight’s Son</i> by John C. Wright. The novel really lends itself to comics. Loads of great eye candy and a story that gets off the blocks on page one and never slows down.</p><p>BIC: Will also lost his job because of his very personal Christian and conservative beliefs. There have been a number of people who hold similar conservative and Christian beliefs who have also had their careers threatened or lost. Do you see this as a serious problem in the comic book industry?</p><p>Chuck: Damn right. A lot of great talent is either unemployed or underemployed because of either their personal religious or political beliefs. Their personal beliefs. The blacklists are very real and a lot of careers have been damaged. And as bad as this kind of discrimination is, the effect of silencing other creators who fear for their livelihoods is even more far-reaching. It’s intimidation, pure and simple; a radical core of far-left editors and publishers forcing their ideologies on the creator community as well as the readership.</p><p>Most damaging, in the long term, is the hiring of staff and assigning of freelancers based on their political beliefs rather than any kind of merit. The result is the current crop of, frankly, mediocre efforts from companies that used to be the industry leaders. It’s hard to find even a competently written and drawn comic let alone anything that could be called exemplary examples of the medium.</p><p>We’re all paying for this with depressed sales overall and the loss of readers who may never come back.</p><p><b>BIC: </b>Blacklists seem to be a pretty hot topic right now. One Twitter user even created a pretty lengthy list for customers to boycott certain professionals. He labeled these professionals as the “main contributors… to the declining quality” of comic books. What are your thoughts on this list?</p><p><b>Chuck:</b> I don’t like lists of any kind. Blacklists, redlists, enemies lists or ****lists. While it’s true that a number of people on the list I saw are guilty of writing agenda-driven comics, a few on that list are vocal personally on political matters, but not in their work. The declining quality of comics is due to creators who prioritize their ideology above their professional standards. So much of the stuff I’ve seen is simply poorly crafted comics. They call attention to themselves by doing crap work. No lists needed.</p><p><b>BIC:</b> I also read Marvel has had you on a blacklist for over 15 years. Is that true? How do you go from writing one of their best-selling comics with Punisher: War Zone to completely blacklisted?</p><p><b>Chuck: </b>When you don’t fall in lockstep with everything Axel Alonso believes. Of course, which of us is still working in comics today?</p><p><b>BIC: </b>Where do you see the comic book industry in the future. Do you see it sticking with the tried and true DC and Marvel or will we start to see it fracture along political lines?</p><p><b>Chuck: </b>I think it will become like the music industry. Garage band kinds of comics that will find their own audience. The big comic book publishers have never really known, or tried to really market their product. Now that, for all intents, the major publishers have skipped a generation of readers, they’re going to have to work to get them back. And I don’t think they have the first clue as to how to do that.</p><p>We’ll be looking at more and more creator-owned, creator-marketed comics that don’t do huge numbers but are financially rewarding enough for the creators to keep doing what they love.</p></blockquote><p>Nice little shiv there, with a twist. This is just an excerpt, <a href=\"http://boundingintocomics.com/2018/02/12/interview-wading-war-chuck-dixon/\">read the whole thing there</a>. Believe it or not, the machine that is known as The Legend Chuck Dixon has already scripted the first EIGHT issues of<i> Chuck Dixon’s Avalon</i>. #2 is being colored now, and we’re bringing on a second illustrator in order to get the entire 12-issue series out in a reasonably timely manner.</p><p>And yes, Vendetta is back and doing her thing.</p></div>",
  "content_text": "I don’t know how I somehow managed to miss\nthis interview with The Legend Chuck Dixon\n– that is how he is addressed in the Arkhaven offices, you understand – by\nBounding Into Comics\n:\nBIC:\nAlong with Levon’s War, you are also working on a number of projects with Vox Day’s Castalia House publishing. You’ve got Avalon which is expected to come out this March. The book will feature the crime fighting duo of King Ace and Fazer, what can you tell us about these two?\nChuck:\nKing and Fazer are just a part of a larger ensemble cast of super-powered heroes and outlaws. To say King and Fazer’s relationship is complicated is an understatement. King Ace is a kind of Superman type, a big beefcake who’s bullet-resistant, super-strong and can leap long distances. Fazer has the ability to pass through solid objects. They’re powers complement one another even though their personalities are very much at odds.\nWe also have Cash, a mercenary crimefighter who battles evil for tips and Vendetta, a female vigilante, whose motives and mission provide much of the core story for the first six issues of the book.\nBut the true star of the book is the city of Avalon itself. It’s an east coast town that’s seen better days and getting rather tired of being ground zero for super-fights between good guys and bad guys.\nBIC:\nYou will also be working with Will Caligan. Have you figured out which novels you will adapt into graphic novels?\nChuck:\nWe’re adapting\nSwan Knight’s Son\nby John C. Wright. The novel really lends itself to comics. Loads of great eye candy and a story that gets off the blocks on page one and never slows down.\nBIC: Will also lost his job because of his very personal Christian and conservative beliefs. There have been a number of people who hold similar conservative and Christian beliefs who have also had their careers threatened or lost. Do you see this as a serious problem in the comic book industry?\nChuck: Damn right. A lot of great talent is either unemployed or underemployed because of either their personal religious or political beliefs. Their personal beliefs. The blacklists are very real and a lot of careers have been damaged. And as bad as this kind of discrimination is, the effect of silencing other creators who fear for their livelihoods is even more far-reaching. It’s intimidation, pure and simple; a radical core of far-left editors and publishers forcing their ideologies on the creator community as well as the readership.\nMost damaging, in the long term, is the hiring of staff and assigning of freelancers based on their political beliefs rather than any kind of merit. The result is the current crop of, frankly, mediocre efforts from companies that used to be the industry leaders. It’s hard to find even a competently written and drawn comic let alone anything that could be called exemplary examples of the medium.\nWe’re all paying for this with depressed sales overall and the loss of readers who may never come back.\nBIC:\nBlacklists seem to be a pretty hot topic right now. One Twitter user even created a pretty lengthy list for customers to boycott certain professionals. He labeled these professionals as the “main contributors… to the declining quality” of comic books. What are your thoughts on this list?\nChuck:\nI don’t like lists of any kind. Blacklists, redlists, enemies lists or ****lists. While it’s true that a number of people on the list I saw are guilty of writing agenda-driven comics, a few on that list are vocal personally on political matters, but not in their work. The declining quality of comics is due to creators who prioritize their ideology above their professional standards. So much of the stuff I’ve seen is simply poorly crafted comics. They call attention to themselves by doing crap work. No lists needed.\nBIC:\nI also read Marvel has had you on a blacklist for over 15 years. Is that true? How do you go from writing one of their best-selling comics with Punisher: War Zone to completely blacklisted?\nChuck:\nWhen you don’t fall in lockstep with everything Axel Alonso believes. Of course, which of us is still working in comics today?\nBIC:\nWhere do you see the comic book industry in the future. Do you see it sticking with the tried and true DC and Marvel or will we start to see it fracture along political lines?\nChuck:\nI think it will become like the music industry. Garage band kinds of comics that will find their own audience. The big comic book publishers have never really known, or tried to really market their product. Now that, for all intents, the major publishers have skipped a generation of readers, they’re going to have to work to get them back. And I don’t think they have the first clue as to how to do that.\nWe’ll be looking at more and more creator-owned, creator-marketed comics that don’t do huge numbers but are financially rewarding enough for the creators to keep doing what they love.\nNice little shiv there, with a twist. This is just an excerpt,\nread the whole thing there\n. Believe it or not, the machine that is known as The Legend Chuck Dixon has already scripted the first EIGHT issues of\nChuck Dixon’s Avalon\n. #2 is being colored now, and we’re bringing on a second illustrator in order to get the entire 12-issue series out in a reasonably timely manner.\nAnd yes, Vendetta is back and doing her thing.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-29T11:00:08+00:00"
}