{
  "url": "https://voxday.net/2018/07/27/introducing-the-devstream/",
  "scraped_at": "2025-12-19T21:13:39.096876",
  "title": "Introducing the Devstream",
  "date_display": "July 27, 2018",
  "date_iso": "2018-07-27T10:18:54+00:00",
  "date_from_url": "2018-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of people have been asking me to do the occasional Darkstream dedicated to games and game development, so I gave it a shot last night and it appears to have been reasonably well received. Because I anticipate considerably more discussion on this front in the coming months, and because a lot of the people interested in it will have no interest in the other subjects regularly addressed here, I’m not going to post Devstreams here, but <a href=\"https://devgamecourse.blogspot.com/2018/07/devstream-fortnite-surrender.html\">on the DevGame blog instead</a>.</p><blockquote><p>The interesting thing to me about Fortnite, and the reason why I consider Fortnite to be essentially the game designers more or less giving up, is because what we have been doing as FPS designers from the very beginning is attempting to provide meaning and structure and story and experience to the action, and unfortunately we’ve been fighting the tendency of a certain group of players – who I am not at all convinced are the majority of players, but there are a lot of them – and they have a tendency to simply run around like chickens with their heads cut off. If you’ve played any online game starting back in the days of Doom and Heretic – yeah when we were playing with 4-player and 8-player networks – what you would see is some people would play strategically, some people would camp, other people would would team up and move cooperatively, but you always had the people who just run around like crazy, blasting away like crazy, and basically behaving in a way that you can’t even possibly consider anything that is remotely approaching anything credible or realistic.</p><p>And so, with Fortnite, and I have played it, and it’s a very good example of what it is the Battle Royale genre and so forth, but ultimately there is no purpose, there is no story, the action is the experience. Now that’s ok, that’s fine if that’s if that’s what you want, but you see, for years designers have been trying to hide that, they’ve been trying to keep that under control, and what Fortnite represents – and it’s obviously not the first Battle Royale game, it’s not the only one, but it is the most successful, the most symbolic of the concept – it’s basically the designers throwing up their hands and saying, “you know what, you guys just want to run around like chickens with your heads cut off slaughtering each other, here you go!” And to their credit, they give you the means to do that, so that’s what’s different between that and Call of Duty and Battlefield and all these other FPS games. Almost all the other games were trying to limit that, they’re trying to limit it through the level designs they’re trying to limit it through the ammo drops, and all that sort of thing.</p></blockquote><p>I can’t say more about this at the moment, but there is a very real possibility that we will soon be moving Alt-Hero into the game space as well as the movie space in the not-too-distant future. So, it’s best to be prepared for that.</p></div>",
  "content_text": "A number of people have been asking me to do the occasional Darkstream dedicated to games and game development, so I gave it a shot last night and it appears to have been reasonably well received. Because I anticipate considerably more discussion on this front in the coming months, and because a lot of the people interested in it will have no interest in the other subjects regularly addressed here, I’m not going to post Devstreams here, but\non the DevGame blog instead\n.\nThe interesting thing to me about Fortnite, and the reason why I consider Fortnite to be essentially the game designers more or less giving up, is because what we have been doing as FPS designers from the very beginning is attempting to provide meaning and structure and story and experience to the action, and unfortunately we’ve been fighting the tendency of a certain group of players – who I am not at all convinced are the majority of players, but there are a lot of them – and they have a tendency to simply run around like chickens with their heads cut off. If you’ve played any online game starting back in the days of Doom and Heretic – yeah when we were playing with 4-player and 8-player networks – what you would see is some people would play strategically, some people would camp, other people would would team up and move cooperatively, but you always had the people who just run around like crazy, blasting away like crazy, and basically behaving in a way that you can’t even possibly consider anything that is remotely approaching anything credible or realistic.\nAnd so, with Fortnite, and I have played it, and it’s a very good example of what it is the Battle Royale genre and so forth, but ultimately there is no purpose, there is no story, the action is the experience. Now that’s ok, that’s fine if that’s if that’s what you want, but you see, for years designers have been trying to hide that, they’ve been trying to keep that under control, and what Fortnite represents – and it’s obviously not the first Battle Royale game, it’s not the only one, but it is the most successful, the most symbolic of the concept – it’s basically the designers throwing up their hands and saying, “you know what, you guys just want to run around like chickens with your heads cut off slaughtering each other, here you go!” And to their credit, they give you the means to do that, so that’s what’s different between that and Call of Duty and Battlefield and all these other FPS games. Almost all the other games were trying to limit that, they’re trying to limit it through the level designs they’re trying to limit it through the ammo drops, and all that sort of thing.\nI can’t say more about this at the moment, but there is a very real possibility that we will soon be moving Alt-Hero into the game space as well as the movie space in the not-too-distant future. So, it’s best to be prepared for that.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-27T09:18:54+00:00"
}