{
  "url": "https://voxday.net/2018/07/29/mailvox-an-open-letter-to-vox-day/",
  "scraped_at": "2025-12-19T21:13:59.576764",
  "title": "Mailvox: an open letter to Vox Day",
  "date_display": "July 29, 2018",
  "date_iso": "2018-07-29T10:31:56+00:00",
  "date_from_url": "2018-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Spencer Quinn writes <a href=\"https://www.counter-currents.com/2018/07/an-open-letter-to-vox-day/\">an open letter to me</a>, to which some Darkstream viewers have asked me to respond. I’ll address the relevant sections:</p><blockquote><p>Here is your position, as far as I can tell: White nationalism is unworkable, but the two main kinds of white nationalism are not the same thing and are therefore unworkable for different reasons. European white nationalism is a “non-starter” because Europeans are too ethnically disparate to make a pan-European country work without empire. Indeed, you believe that the indigenous French, Finns, Irish, et cetera are all separate nations in and of themselves, and so wouldn’t be interested in homogenizing Europe in any case.</p><p>As for American white nationalism, you seem to allow for white nationalism in theory but you question the timing. You believe it would take a thousand years or so for all the whites in America to interbreed well enough to form a real nation, one that would have a genuinely unique identity apart from the European nations from which it sprang. You also believe that the United States has between fifteen and thirty years before it breaks apart due non-white immigration and racial strife. Therefore any effort to stuff a thousand years of change into thirty is doomed to fail. Does this sum it up more or less accurately?</p></blockquote><p>More or less, although the actual trigger for the political breakup is going to be economic in nature, so the effects of mass immigration and the increased racial and religious strife are merely going to multiply the consequences of the inevitable economic breakdown and ensure the shattering of the single polity into what could be anything from five to several hundred pieces.</p><blockquote class=\"tr_bq\"><p>So if American whites are completely incapable of functioning as a nation, then what were they doing between 1790 and 1965? Were they failing when they enjoyed a ninety percent majority of the country? Did they consider themselves ‘deracinated’ as well? Were the tiny proportions of non-whites in the United States the glue that held it all together? Is there anything in the American literature from that time period that tells us the American identity is a “false identity,” as you put it? What sources can you produce to back up such an uncompromising position? And can you explain why sources that don’t are unreliable?</p></blockquote><p>Between 1790 and 1965, they were mostly spreading out across a mostly empty continent and fighting a brutal civil war. These other questions strike me as disingenuous and I will not bother to answer them, nor do I have any interest in playing the source game. But I will point out a few relevant facts: the USA is not a nation, it is an empire held together by the threat of military force. The American identity from 1790 through 1920 was British, hence the bits about “British brethren” from the Declaration of Independence; it was the British Crown from which the American Revolutionaries were declaring independence, after all, not the European nations in general. It was generally believed that non-British whites from Germany and other European nations would be able to become ersatz Anglo-Americans over time, although there were skeptics such as Ben Franklin from the start. In my opinion, the skeptics were correct and the optimists, such as George Washington, were wrong. It is clear that, for the most part, the descendants of the Spanish-Americans, German-Americans, Irish-Americans, Scandinavian-Americans, Italian-Americans, and various other European-Americans have never truly understood or supported limited government or the traditions of the English Common Law.</p><blockquote class=\"tr_bq\"><p>But according to your logic, white America would have broken off into ethnic enclaves before 1930. According to your logic, white Americans would have felt enough allegiance to the European powers they fought against in the world wars to rise up against American power. </p></blockquote><p>This is an inept and incorrect attempt to apply my logic to American history. That being said, many European-Americans most certainly did feel an allegiance to their European homelands, particularly during World War I.</p><p><i>When news of the war reached the United States in August 1914, immigrants from all over Europe reacted with sympathy and concern for the citizens of their home countries. Among those immigrants were thousands of German reservists who rushed to German consulates in the U.S. in an effort to return home and join the fight. German-Americans also held patriotic meetings in cities such as New York and Chicago and collected for war relief funds. Such enthusiastic “war fever” was prevalent among all immigrant groups, but since people of German origin made up a high percentage of the American population, they came under heightened public scrutiny….</i><br><i><br/></i><i>In the fall of 1917, the fight against Germans in Europe was extended to their Kultur in the United States. This battle against all things German included a ban on the use of the German language in schools, universities, libraries, and religious services. Additionally, German societies, musical organizations, and theaters were shuttered and the German-language press in America was forced to shut down.</i><br><i><br/></i>Note that this was a classic imperial reaction by a ruling nation to a restive subject one, even if it was a subject nation that had been voluntarily subjugated. To the extent German-Americans have been assimilated, it was through the ruthless suppression of their language, culture, and identity in the 20th century. But their genetic inclinations remain intact. Remember, even mass interbreeding will favor the dominant genetics.</br></br></p><blockquote><p>One attempt you make is to point to tradition. When a reader asked you, “Why can’t the mixed whites in America band together as white and form a new nation and a new identity?” you answered “Because they all have different traditions.” As an example of such divisive traditions, you then how describe different Scandinavian peoples open Christmas presents on different days.</p><p>I believe that sound you’re hearing right now is the sound of everyone’s jaws dropping to the floor.</p><p>Not to offend you, Vox, but such an absurd objection to American white nationalism invites mockery.</p></blockquote><p>Spencer can mock away if he likes. His inability to understand the obvious implications is not my problem. It is the multiplication of a thousand such seemingly small differences that irretrievably divide one identity from another. Few outside the Balkans can tell the difference between a Croat and a Serb, but that did not prevent them from fighting a war in the 1990s; the differences between a Prussian German and a Bavarian German or a Veneziano and a Napolitano are considerably less than the breadth of the “mixed whites in America” and yet they continue to have profound implications for the political instability of those modern states.</p><p>Spencer is welcome to imagine that blue-haired SJWs and Swedish-American DFLers and Italian-American mafiosi are going to join forces with him against the rising tide of La Raza Cosmica and the expanding global empire of the Han Chinese due solely to the color of their skin, but I wouldn’t bet on it. The mistake he and other pan-white nationalists are making is to believe that most people are capable of making an identity shift on the basis of abstract information, which is directly contrary to everything we have learned about human nature since Aristotle. For example, most German Jews did not abandon their German self-identity until after they were personally arrested by their “fellow Germans”. In like manner, the vast majority of white Americans will not identify themselves as part of as an intrinsically white nation until they are <i>personally </i>and explicitly and <i>physically </i>attacked for being American by non-whites who reject an American identity. Even then, some will not be emotionally capable of making the conceptual shift, not even if they are rejected by members of their own identity-complicated family.</p><blockquote class=\"tr_bq\"><p>How can someone believe in the fourteen words and not be a white nationalist?</p></blockquote><p>Because, again, pan-white “nationalism” is not nationalism. There is no pan-white nation and there never will be a pan-white nation anymore than there will ever be a pan-Arab nation, a pan-Asian nation, or a pan-Red nation. Every historical attempt at pan-national supranationalism has eventually failed, from the American Indian alliances to the United Arab Republic. Destroying the European nations in order to save the white race is an epically stupid and historically ignorant strategy. Even if a “mixed-white nation” were to somehow come into existence over time, it would identify itself separately from other white nations. All there has ever been, all there will ever be, are empires where one identity rules over the others by force and/or numbers.</p><blockquote><p>I do believe most white nationalists would agree with you that the civic nationalist option you seem to favor is still a pretty good option, especially if it could come without the price of a war.</p></blockquote><p>I don’t favor the civic nationalist option. That too has proven to be a false and failing form of nationalism. Spencer quite simply hasn’t understood my position at all. <i>There will be war.</i> War is inevitable, and it will probably take place on a global scale. There has never been any movement of people of human history even one-tenth as large as the post-1965 invasion of the United States that has not either a) led to war, or b) been imposed by lethal force as the result of war. I believe the die is already cast, as do more than a few military historians of my acquaintance.</p><p>Like many people, Spencer does not understand that I am not an activist. I am not a politician nor am I part of any movement. I am an observer, a chronicler, and perhaps one day, a historian. I seek primarily to understand the patterns and trends of history, I do not seek to alter them nor do I really believe that is even possible. And I am far from the only one who expects the next American civil war <a href=\"https://spectator.org/americas-next-civil-war-will-be-worse-than-our-last/\">to be worse than its predecessor</a>.</p><blockquote><p>The difference between the America of today and the America of what seems like just yesterday is that we once had a common culture. As recently as 1990, Ken Burns could make a Civil War documentary for PBS and let historian Shelby Foote wax eloquent on the martial prowess of Confederate General Nathan Bedford Forrest —  something that now would likely get them both tarred, feathered, and Twitter-banned.</p><p>Yes, there were big differences between North and South a century and a half ago. The South was a slave-holding, free-trading, libertarian-leaning, conservative Christian, agricultural, aristocratic Sparta, while the North was a commercial, industrial, protectionist, Transcendentalist, social gospel, democratic Athens. But they held far more in common than separated them — beginning with the fact that, as Lincoln observed, “Both read the same Bible and pray to the same God.”</p><p>In the end, the war was fought over a single legal issue: whether the states that had freely ratified the Constitution to form the Union could freely leave the Union if they felt it no longer served their interests…. Today, however, our divisions are so deep and fundamental that Americans cannot even agree on what marriage is or what a man or a woman is (which is pretty darn fundamental).</p></blockquote></div>",
  "content_text": "Spencer Quinn writes\nan open letter to me\n, to which some Darkstream viewers have asked me to respond. I’ll address the relevant sections:\nHere is your position, as far as I can tell: White nationalism is unworkable, but the two main kinds of white nationalism are not the same thing and are therefore unworkable for different reasons. European white nationalism is a “non-starter” because Europeans are too ethnically disparate to make a pan-European country work without empire. Indeed, you believe that the indigenous French, Finns, Irish, et cetera are all separate nations in and of themselves, and so wouldn’t be interested in homogenizing Europe in any case.\nAs for American white nationalism, you seem to allow for white nationalism in theory but you question the timing. You believe it would take a thousand years or so for all the whites in America to interbreed well enough to form a real nation, one that would have a genuinely unique identity apart from the European nations from which it sprang. You also believe that the United States has between fifteen and thirty years before it breaks apart due non-white immigration and racial strife. Therefore any effort to stuff a thousand years of change into thirty is doomed to fail. Does this sum it up more or less accurately?\nMore or less, although the actual trigger for the political breakup is going to be economic in nature, so the effects of mass immigration and the increased racial and religious strife are merely going to multiply the consequences of the inevitable economic breakdown and ensure the shattering of the single polity into what could be anything from five to several hundred pieces.\nSo if American whites are completely incapable of functioning as a nation, then what were they doing between 1790 and 1965? Were they failing when they enjoyed a ninety percent majority of the country? Did they consider themselves ‘deracinated’ as well? Were the tiny proportions of non-whites in the United States the glue that held it all together? Is there anything in the American literature from that time period that tells us the American identity is a “false identity,” as you put it? What sources can you produce to back up such an uncompromising position? And can you explain why sources that don’t are unreliable?\nBetween 1790 and 1965, they were mostly spreading out across a mostly empty continent and fighting a brutal civil war. These other questions strike me as disingenuous and I will not bother to answer them, nor do I have any interest in playing the source game. But I will point out a few relevant facts: the USA is not a nation, it is an empire held together by the threat of military force. The American identity from 1790 through 1920 was British, hence the bits about “British brethren” from the Declaration of Independence; it was the British Crown from which the American Revolutionaries were declaring independence, after all, not the European nations in general. It was generally believed that non-British whites from Germany and other European nations would be able to become ersatz Anglo-Americans over time, although there were skeptics such as Ben Franklin from the start. In my opinion, the skeptics were correct and the optimists, such as George Washington, were wrong. It is clear that, for the most part, the descendants of the Spanish-Americans, German-Americans, Irish-Americans, Scandinavian-Americans, Italian-Americans, and various other European-Americans have never truly understood or supported limited government or the traditions of the English Common Law.\nBut according to your logic, white America would have broken off into ethnic enclaves before 1930. According to your logic, white Americans would have felt enough allegiance to the European powers they fought against in the world wars to rise up against American power.\nThis is an inept and incorrect attempt to apply my logic to American history. That being said, many European-Americans most certainly did feel an allegiance to their European homelands, particularly during World War I.\nWhen news of the war reached the United States in August 1914, immigrants from all over Europe reacted with sympathy and concern for the citizens of their home countries. Among those immigrants were thousands of German reservists who rushed to German consulates in the U.S. in an effort to return home and join the fight. German-Americans also held patriotic meetings in cities such as New York and Chicago and collected for war relief funds. Such enthusiastic “war fever” was prevalent among all immigrant groups, but since people of German origin made up a high percentage of the American population, they came under heightened public scrutiny….\nIn the fall of 1917, the fight against Germans in Europe was extended to their Kultur in the United States. This battle against all things German included a ban on the use of the German language in schools, universities, libraries, and religious services. Additionally, German societies, musical organizations, and theaters were shuttered and the German-language press in America was forced to shut down.\nNote that this was a classic imperial reaction by a ruling nation to a restive subject one, even if it was a subject nation that had been voluntarily subjugated. To the extent German-Americans have been assimilated, it was through the ruthless suppression of their language, culture, and identity in the 20th century. But their genetic inclinations remain intact. Remember, even mass interbreeding will favor the dominant genetics.\nOne attempt you make is to point to tradition. When a reader asked you, “Why can’t the mixed whites in America band together as white and form a new nation and a new identity?” you answered “Because they all have different traditions.” As an example of such divisive traditions, you then how describe different Scandinavian peoples open Christmas presents on different days.\nI believe that sound you’re hearing right now is the sound of everyone’s jaws dropping to the floor.\nNot to offend you, Vox, but such an absurd objection to American white nationalism invites mockery.\nSpencer can mock away if he likes. His inability to understand the obvious implications is not my problem. It is the multiplication of a thousand such seemingly small differences that irretrievably divide one identity from another. Few outside the Balkans can tell the difference between a Croat and a Serb, but that did not prevent them from fighting a war in the 1990s; the differences between a Prussian German and a Bavarian German or a Veneziano and a Napolitano are considerably less than the breadth of the “mixed whites in America” and yet they continue to have profound implications for the political instability of those modern states.\nSpencer is welcome to imagine that blue-haired SJWs and Swedish-American DFLers and Italian-American mafiosi are going to join forces with him against the rising tide of La Raza Cosmica and the expanding global empire of the Han Chinese due solely to the color of their skin, but I wouldn’t bet on it. The mistake he and other pan-white nationalists are making is to believe that most people are capable of making an identity shift on the basis of abstract information, which is directly contrary to everything we have learned about human nature since Aristotle. For example, most German Jews did not abandon their German self-identity until after they were personally arrested by their “fellow Germans”. In like manner, the vast majority of white Americans will not identify themselves as part of as an intrinsically white nation until they are\npersonally\nand explicitly and\nphysically\nattacked for being American by non-whites who reject an American identity. Even then, some will not be emotionally capable of making the conceptual shift, not even if they are rejected by members of their own identity-complicated family.\nHow can someone believe in the fourteen words and not be a white nationalist?\nBecause, again, pan-white “nationalism” is not nationalism. There is no pan-white nation and there never will be a pan-white nation anymore than there will ever be a pan-Arab nation, a pan-Asian nation, or a pan-Red nation. Every historical attempt at pan-national supranationalism has eventually failed, from the American Indian alliances to the United Arab Republic. Destroying the European nations in order to save the white race is an epically stupid and historically ignorant strategy. Even if a “mixed-white nation” were to somehow come into existence over time, it would identify itself separately from other white nations. All there has ever been, all there will ever be, are empires where one identity rules over the others by force and/or numbers.\nI do believe most white nationalists would agree with you that the civic nationalist option you seem to favor is still a pretty good option, especially if it could come without the price of a war.\nI don’t favor the civic nationalist option. That too has proven to be a false and failing form of nationalism. Spencer quite simply hasn’t understood my position at all.\nThere will be war.\nWar is inevitable, and it will probably take place on a global scale. There has never been any movement of people of human history even one-tenth as large as the post-1965 invasion of the United States that has not either a) led to war, or b) been imposed by lethal force as the result of war. I believe the die is already cast, as do more than a few military historians of my acquaintance.\nLike many people, Spencer does not understand that I am not an activist. I am not a politician nor am I part of any movement. I am an observer, a chronicler, and perhaps one day, a historian. I seek primarily to understand the patterns and trends of history, I do not seek to alter them nor do I really believe that is even possible. And I am far from the only one who expects the next American civil war\nto be worse than its predecessor\n.\nThe difference between the America of today and the America of what seems like just yesterday is that we once had a common culture. As recently as 1990, Ken Burns could make a Civil War documentary for PBS and let historian Shelby Foote wax eloquent on the martial prowess of Confederate General Nathan Bedford Forrest —  something that now would likely get them both tarred, feathered, and Twitter-banned.\nYes, there were big differences between North and South a century and a half ago. The South was a slave-holding, free-trading, libertarian-leaning, conservative Christian, agricultural, aristocratic Sparta, while the North was a commercial, industrial, protectionist, Transcendentalist, social gospel, democratic Athens. But they held far more in common than separated them — beginning with the fact that, as Lincoln observed, “Both read the same Bible and pray to the same God.”\nIn the end, the war was fought over a single legal issue: whether the states that had freely ratified the Constitution to form the Union could freely leave the Union if they felt it no longer served their interests…. Today, however, our divisions are so deep and fundamental that Americans cannot even agree on what marriage is or what a man or a woman is (which is pretty darn fundamental).",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-29T09:31:56+00:00"
}