{
  "url": "https://voxday.net/2018/07/08/melting-the-mic/",
  "scraped_at": "2025-12-19T21:10:35.220823",
  "title": "Melting the mic",
  "date_display": "July 8, 2018",
  "date_iso": "2018-07-08T10:19:13+00:00",
  "date_from_url": "2018-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s more than a little amusing that the SJWs in comics who hate the Alt-Right so much don’t even have the courage to actually address the real Alt-Right <a href=\"http://boundingintocomics.com/2018/06/25/comic-crusaders-fires-writer-after-nasty-comments-directed-at-ethan-van-sciver-and-diversity-comics/\">in their attacks on it</a>. They prefer to go after the likes of Ethan van Sciver and Diversity &amp; Comics and call relative moderates like them “Alt-Right” because they are so afraid of us that they don’t even dare to directly engage.</p><blockquote><p>Dusty Good@DangerDusty<br>News flash for the Alt-Right comix trolls. The industry/hobby/craft doesn’t want or need you. You’re not welcome here. The cosplay girls won’t fuck you, the pros absolutely hate you, your fellow fans despise you. Go ahead and continue to circle jerk each other on KS.</br></p><p>Dusty Good@DangerDusty<br>Oh we raised $300,000 on KS! We’re legit! Nobody worth a shit cares. Even the KKK has financial backing … in fact I bet that’s the driving force behind the crowd funding!</br></p><div></div><p>Dusty Good@DangerDusty<br>Love making the Alt-Right trolls dance. They can’t help themselves; they’re idiots. They don’t realize that the more they respond, the more they retweet and tag, the bigger my reach grows. @EthanVanSciver and @DiversityAndCmx goons are the best PR free can buy!!!!! HAHAHAHAHAHAHA</br></p><div></div><p>Dusty Good@DangerDusty<br>Looks like Audio Henchmen is coming back full time. They may fire me from the site. But I still own the rights to my podcast and I’ve got a contract. Who wants to hear me melt a mic against the Alt-Right comic fans?</br></p><p>Dusty Good @DangerDusty<br>A podcast for all those folks in CYBERland feeling FROGgy and anyone who likes to hear me flap my JAWs about all you rule BREAKERS. BEWARE. The ALT-RIGHT need not apply. We plan on practicing freedom of speech to its fullest extent.</br></p></blockquote><p>These sad little gamma males have absolutely no idea what is going to hit them soon. The bigger his reach grows? He has all of 440 followers on Twitter. And while I’m pleased that Cyberfrog and Jawbreakers have managed to replicate Alt★Hero’s crowdfunding success, and in doing so, prove that it was not a fluke, that is literally the first and smallest step that Arkhaven has taken in our combined arms offensive on the SJW-held territory of the comics industry.</p><p>We know the pros at Marvel and DC <a href=\"http://voxday.blogspot.com/2018/07/you-knew-marvel-would-make-me-villain.html\">hate us</a>. We don’t care. We don’t want the fat cosplay girls, we have real models. We know the SJW comics media won’t cover us. We don’t need the coverage. We know SJWs in the mainstream media will write hit pieces about us. We don’t talk to them. We know Disney and Warner Bros won’t work with us. We don’t want to work with them. We’re not here to join an SJW-infested industry that is dying by more than 10 percent every year, we’re here to replace it with something new, better, and more entertaining.</p><p>Two weeks ago I signed an agreement with a movie producer. We’ve since had a number of meetings with various organizations and I can state with some confidence that we will be skipping the whole “option” phase and go directly to making the movies and/or television shows ourselves in partnership with people who know what they are doing. Some of these scenarios involve crowdfunding and backer participation, others do not. We are also discussing the creation of a major new comics imprint with one or two partners and are in the process of completing <i>Chuck Dixon’s Avalon #1</i>, after which we will launch our comic store campaign with the assistance of the VFM and the Dark Legion.</p><p>There is more, of course, but that will do for now. And now, for the punchline. To absolutely no one’s surprise, it took all of one week for Brave Sir Dusty to bravely sacrifice his principles, <a href=\"https://twitter.com/DangerDusty/status/1011282539959521283\">take his nuts off the chopping block</a>, and beg for his job back.</p><blockquote><p>Dusty Good@DangerDusty<br>I’m better than this and bigger than this, so I apologise to @EthanVanSciver  and @DiversityAndCmx  for my childish and unprofessional comments and any shade that was thrown on @ComicCrusaders  because of my social media posts.</br></p><p>Dusty Good@Dusty Good<br>I have requested my previous position back with @ComicCrusaders and if accepted will make sure that an incident like this never happens again.</br></p></blockquote></div>",
  "content_text": "It’s more than a little amusing that the SJWs in comics who hate the Alt-Right so much don’t even have the courage to actually address the real Alt-Right\nin their attacks on it\n. They prefer to go after the likes of Ethan van Sciver and Diversity & Comics and call relative moderates like them “Alt-Right” because they are so afraid of us that they don’t even dare to directly engage.\nDusty Good@DangerDusty\nNews flash for the Alt-Right comix trolls. The industry/hobby/craft doesn’t want or need you. You’re not welcome here. The cosplay girls won’t fuck you, the pros absolutely hate you, your fellow fans despise you. Go ahead and continue to circle jerk each other on KS.\nDusty Good@DangerDusty\nOh we raised $300,000 on KS! We’re legit! Nobody worth a shit cares. Even the KKK has financial backing … in fact I bet that’s the driving force behind the crowd funding!\nDusty Good@DangerDusty\nLove making the Alt-Right trolls dance. They can’t help themselves; they’re idiots. They don’t realize that the more they respond, the more they retweet and tag, the bigger my reach grows. @EthanVanSciver and @DiversityAndCmx goons are the best PR free can buy!!!!! HAHAHAHAHAHAHA\nDusty Good@DangerDusty\nLooks like Audio Henchmen is coming back full time. They may fire me from the site. But I still own the rights to my podcast and I’ve got a contract. Who wants to hear me melt a mic against the Alt-Right comic fans?\nDusty Good @DangerDusty\nA podcast for all those folks in CYBERland feeling FROGgy and anyone who likes to hear me flap my JAWs about all you rule BREAKERS. BEWARE. The ALT-RIGHT need not apply. We plan on practicing freedom of speech to its fullest extent.\nThese sad little gamma males have absolutely no idea what is going to hit them soon. The bigger his reach grows? He has all of 440 followers on Twitter. And while I’m pleased that Cyberfrog and Jawbreakers have managed to replicate Alt★Hero’s crowdfunding success, and in doing so, prove that it was not a fluke, that is literally the first and smallest step that Arkhaven has taken in our combined arms offensive on the SJW-held territory of the comics industry.\nWe know the pros at Marvel and DC\nhate us\n. We don’t care. We don’t want the fat cosplay girls, we have real models. We know the SJW comics media won’t cover us. We don’t need the coverage. We know SJWs in the mainstream media will write hit pieces about us. We don’t talk to them. We know Disney and Warner Bros won’t work with us. We don’t want to work with them. We’re not here to join an SJW-infested industry that is dying by more than 10 percent every year, we’re here to replace it with something new, better, and more entertaining.\nTwo weeks ago I signed an agreement with a movie producer. We’ve since had a number of meetings with various organizations and I can state with some confidence that we will be skipping the whole “option” phase and go directly to making the movies and/or television shows ourselves in partnership with people who know what they are doing. Some of these scenarios involve crowdfunding and backer participation, others do not. We are also discussing the creation of a major new comics imprint with one or two partners and are in the process of completing\nChuck Dixon’s Avalon #1\n, after which we will launch our comic store campaign with the assistance of the VFM and the Dark Legion.\nThere is more, of course, but that will do for now. And now, for the punchline. To absolutely no one’s surprise, it took all of one week for Brave Sir Dusty to bravely sacrifice his principles,\ntake his nuts off the chopping block\n, and beg for his job back.\nDusty Good@DangerDusty\nI’m better than this and bigger than this, so I apologise to @EthanVanSciver  and @DiversityAndCmx  for my childish and unprofessional comments and any shade that was thrown on @ComicCrusaders  because of my social media posts.\nDusty Good@Dusty Good\nI have requested my previous position back with @ComicCrusaders and if accepted will make sure that an incident like this never happens again.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-08T09:19:13+00:00"
}