{
  "url": "https://voxday.net/2018/07/27/no-place-for-sarah-silverman/",
  "scraped_at": "2025-12-19T21:13:42.785408",
  "title": "No place for Sarah Silverman",
  "date_display": "July 27, 2018",
  "date_iso": "2018-07-27T13:33:10+00:00",
  "date_from_url": "2018-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CNN takes note of <a href=\"https://edition.cnn.com/2018/07/26/entertainment/sarah-silverman-tweet/index.html\">the Silverman controversy</a>:</p><blockquote><p>A tweet Sarah Silverman sent nine years ago, which she says was a joke, has some labeling her a pedophile.</p><p>In July 2009, the comedic actress tweeted, <i>“Hey, is it considered molestation if the child makes the first move? I’m gonna need a quick answer on this.”</i></p><p>On Wednesday, the conservative publication Townhall posted a story about that tweet with the headline, “Disney Voice Actress and Comedian Sarah Silverman Also Joked About Molesting Children.” The article noted that a Twitter user asked Silverman about the 2009 tweet last year, “Was that supposed to be funny? Cause it wasn’t.”</p><p>Silverman responded to the controversy on Thursday.</p><p>Sarah Silverman@SarahKSilverman<br><i> Some very odd people R saying I’m a pedo, re: a joke from a time not that long ago when hard absurd jokes by comedians were acknowledged for what they were — jokes — not a disengenuous national threat to people fake-clutching their pearls (whilst ranting the country’s too PC)</i></br></p></blockquote><p>If it’s not okay to joke about Jews or Nazis or Africans, then it’s absolutely not okay to joke about <i>molesting children</i>. If jokes about Jews mean you’re an anti-Semite, and jokes about Africans mean you’re a racist, then jokes about molesting children obviously mean you’re a pedophile and you should be hunted down, disemployed, banned from social media and payment processing, and <a href=\"http://forge-and-anvil.com/2018/07/25/silverman-pedo-normalization-evil-hollywood/\">rejected by all right-thinking citizens</a>.</p><p>Those are the rules. The logic is straightforward and impeccable. So deal with it.</p></div>",
  "content_text": "CNN takes note of\nthe Silverman controversy\n:\nA tweet Sarah Silverman sent nine years ago, which she says was a joke, has some labeling her a pedophile.\nIn July 2009, the comedic actress tweeted,\n“Hey, is it considered molestation if the child makes the first move? I’m gonna need a quick answer on this.”\nOn Wednesday, the conservative publication Townhall posted a story about that tweet with the headline, “Disney Voice Actress and Comedian Sarah Silverman Also Joked About Molesting Children.” The article noted that a Twitter user asked Silverman about the 2009 tweet last year, “Was that supposed to be funny? Cause it wasn’t.”\nSilverman responded to the controversy on Thursday.\nSarah Silverman@SarahKSilverman\nSome very odd people R saying I’m a pedo, re: a joke from a time not that long ago when hard absurd jokes by comedians were acknowledged for what they were — jokes — not a disengenuous national threat to people fake-clutching their pearls (whilst ranting the country’s too PC)\nIf it’s not okay to joke about Jews or Nazis or Africans, then it’s absolutely not okay to joke about\nmolesting children\n. If jokes about Jews mean you’re an anti-Semite, and jokes about Africans mean you’re a racist, then jokes about molesting children obviously mean you’re a pedophile and you should be hunted down, disemployed, banned from social media and payment processing, and\nrejected by all right-thinking citizens\n.\nThose are the rules. The logic is straightforward and impeccable. So deal with it.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-27T12:33:10+00:00"
}