{
  "url": "https://voxday.net/2018/07/11/qanon-a-users-guide/",
  "scraped_at": "2025-12-19T21:11:15.519594",
  "title": "Qanon: a user’s guide",
  "date_display": "July 11, 2018",
  "date_iso": "2018-07-11T15:00:06+00:00",
  "date_from_url": "2018-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neon Revolt helpfully breaks down the significance of Q and <a href=\"https://www.neonrevolt.com/2018/07/11/who-is-qanon-an-introduction-to-the-qanon-phenomenon-qanon-greatawakening/\">what it all means</a>:</p><blockquote><p>The world has long been held hostage by a group of power-brokers I have collectively labelled “The Cabal.” They sit in seats of power around the world, making sure they control governments, wars, money flow, and even now the lives of individuals like you and me. They see us as disposable pawns, a sort of natural resource they can spend at will, and this Cabal seeks to grow and expand its power every single day, through all sorts of subversive action, be it class strife, fomenting economic instability, or sending us to die in foreign lands under the guise of patriotism and duty.</p><p>The Cabal is not entirely monolithic, but features many different branches. Despite this, they work together and their goals are much the same: the destruction of the West by any and all means, and the creation of a global mega-state.</p><p>A large portion of The Cabal are members of a Secret Society that is little more than a Neo-Babylonian Death Cult, and the higher you advance in the cult, the more mutual blackmail is required of you. You see, the higher ranking members want the ability to destroy the lower ranking members at any time. This is achieved through several means, but recording individuals in honeypots, pedophilic acts, and participation human sacrifice are the primary ways in which this is achieved.</p><p>That’s not to say this is done against the will of the individuals being blackmailed. Often, they are willing participants in all this, and enjoy performing these kinds of evil deeds. Such is the face of depravity.</p><p>Hillary and Obama are two such members of this Cabal, and though they were high ranking, they are not top dogs (and certainly not since HRC’s failed presidential run in 2016). That day cost them so much power and influence, they didn’t even know what to do. Remember – Hillary didn’t even give a concession speech that night. That was because they never expected her to lose.</p><p>Together, as we’ve since learned from the Q drops, they were plotting the complete destruction of the USA (and Russia). And I don’t mean that in some esoteric sense of empires collapsing and coalescing into new empires across time, like the murmurations of flocks birds across the sky. No, I quite literally mean nuclear war, mass drought, disease, and food shortages. I’m talking roving death squads in the streets. The goal was to wipe out two of the biggest threats to the Cabal by making them fight each other, and rule over a fragmented, atomized, neo-Fascist global mega-state, made up of whatever was left over (mostly Europe, Africa, parts of Asia, South America, and Australia).</p><p>Remember when I said don’t be surprised if you feel incredulous when reading this?</p></blockquote><p>As hard as it is to believe all of the stuff that has come out to varying degrees so far, as difficult as it is to credit, rest assured that it is Christians who are going to have the most difficult time accepting the degree to which their understanding of not only the world, but their own faith, is incorrect.</p><p>Just to be clear, I am not saying that Christianity is false. To the contrary, the more we have learned about the Cabal, its beliefs and objectives, and its methods, the more we have learned that Christianity is not only absolutely true, but absolutely vital. Jesus Christ is truly Man’s only hope in a world ruled by evils both spiritual and material.</p><p>The Storm is coming. We don’t know the day or the hour, but it is coming. And we should quite literally thank God for Donald Trump and Vladimir Putin, both of whom stand between us and all the raging, raving, rancid evil of the Cabal. Pray for their upcoming meeting, pray that both men be granted wisdom and courage, and pray that they are victorious over the evil that seeks to destroy Christianity, Christendom, America, <a href=\"https://www.rt.com/politics/432643-russians-world-government-conspiracy/\">and Russia</a>.</p><blockquote class=\"tr_bq\"><p>About two-thirds of Russians believe in the existence of a shadowy world government, and most of them also believe it is hostile to their country, according to a recent survey. On Wednesday state-run Russian public opinion research agency VTSIOM released the results of a poll in which 67 percent of Russian citizens said they believe there is a secret world government. Twenty-one percent said they reject the possibility that it exists, and the rest were undecided.</p></blockquote><p>It’s time Americans started to catch up to the Russians again.</p></div>",
  "content_text": "Neon Revolt helpfully breaks down the significance of Q and\nwhat it all means\n:\nThe world has long been held hostage by a group of power-brokers I have collectively labelled “The Cabal.” They sit in seats of power around the world, making sure they control governments, wars, money flow, and even now the lives of individuals like you and me. They see us as disposable pawns, a sort of natural resource they can spend at will, and this Cabal seeks to grow and expand its power every single day, through all sorts of subversive action, be it class strife, fomenting economic instability, or sending us to die in foreign lands under the guise of patriotism and duty.\nThe Cabal is not entirely monolithic, but features many different branches. Despite this, they work together and their goals are much the same: the destruction of the West by any and all means, and the creation of a global mega-state.\nA large portion of The Cabal are members of a Secret Society that is little more than a Neo-Babylonian Death Cult, and the higher you advance in the cult, the more mutual blackmail is required of you. You see, the higher ranking members want the ability to destroy the lower ranking members at any time. This is achieved through several means, but recording individuals in honeypots, pedophilic acts, and participation human sacrifice are the primary ways in which this is achieved.\nThat’s not to say this is done against the will of the individuals being blackmailed. Often, they are willing participants in all this, and enjoy performing these kinds of evil deeds. Such is the face of depravity.\nHillary and Obama are two such members of this Cabal, and though they were high ranking, they are not top dogs (and certainly not since HRC’s failed presidential run in 2016). That day cost them so much power and influence, they didn’t even know what to do. Remember – Hillary didn’t even give a concession speech that night. That was because they never expected her to lose.\nTogether, as we’ve since learned from the Q drops, they were plotting the complete destruction of the USA (and Russia). And I don’t mean that in some esoteric sense of empires collapsing and coalescing into new empires across time, like the murmurations of flocks birds across the sky. No, I quite literally mean nuclear war, mass drought, disease, and food shortages. I’m talking roving death squads in the streets. The goal was to wipe out two of the biggest threats to the Cabal by making them fight each other, and rule over a fragmented, atomized, neo-Fascist global mega-state, made up of whatever was left over (mostly Europe, Africa, parts of Asia, South America, and Australia).\nRemember when I said don’t be surprised if you feel incredulous when reading this?\nAs hard as it is to believe all of the stuff that has come out to varying degrees so far, as difficult as it is to credit, rest assured that it is Christians who are going to have the most difficult time accepting the degree to which their understanding of not only the world, but their own faith, is incorrect.\nJust to be clear, I am not saying that Christianity is false. To the contrary, the more we have learned about the Cabal, its beliefs and objectives, and its methods, the more we have learned that Christianity is not only absolutely true, but absolutely vital. Jesus Christ is truly Man’s only hope in a world ruled by evils both spiritual and material.\nThe Storm is coming. We don’t know the day or the hour, but it is coming. And we should quite literally thank God for Donald Trump and Vladimir Putin, both of whom stand between us and all the raging, raving, rancid evil of the Cabal. Pray for their upcoming meeting, pray that both men be granted wisdom and courage, and pray that they are victorious over the evil that seeks to destroy Christianity, Christendom, America,\nand Russia\n.\nAbout two-thirds of Russians believe in the existence of a shadowy world government, and most of them also believe it is hostile to their country, according to a recent survey. On Wednesday state-run Russian public opinion research agency VTSIOM released the results of a poll in which 67 percent of Russian citizens said they believe there is a secret world government. Twenty-one percent said they reject the possibility that it exists, and the rest were undecided.\nIt’s time Americans started to catch up to the Russians again.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-11T14:00:06+00:00"
}