{
  "url": "https://voxday.net/2018/07/16/ron-unz-contemplates-his-childhood-religion/",
  "scraped_at": "2025-12-19T21:12:05.572876",
  "title": "Ron Unz contemplates his childhood religion",
  "date_display": "July 16, 2018",
  "date_iso": "2018-07-16T14:29:40+00:00",
  "date_from_url": "2018-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t take a genius to see that <a href=\"http://www.unz.com/runz/american-pravda-oddities-of-the-jewish-religion/\">this article by Ron Unz on Judaism</a> is going to prove highly controversial in conservative circles. But the truth is what it is, not what we would prefer it to be, so if you take any issue with it, or if you feel the need to run around shrieking about the anti-semitism of self-hating Jews, then I suggest you take it up with either Mr. Unz or Mr. Shahak. All I can say is that if you think this article is shocking, you don’t know religious history very well and you’re probably in for a real treat down the road. As I said before, it’s not merely non-Christians who are going to have a very difficult time with the light of truth being shined in so many dark places these days.</p><blockquote><p>I must emphasize that I cannot directly vouch for Shahak’s claims about Judaism. My own knowledge of that religion is absolutely negligible, mostly being limited to my childhood, when my grandmother occasionally managed to drag me down to services at the local synagogue, where I was seated among a mass of elderly men praying and chanting in some strange language while wearing various ritualistic cloths and religious talismans, an experience that I always found much less enjoyable than my usual Saturday morning cartoons….. Essentially almost everything I had known—or thought I had known—about the religion of Judaism, at least in its zealously Orthodox traditional form, was utterly wrong.</p><p>For example, traditionally religious Jews pay little attention to most of the Old Testament, and even very learned rabbis or students who have devoted many years to intensive study may remain largely ignorant of its contents. Instead, the center of their religious world view is the Talmud, an enormously large, complex, and somewhat contradictory mass of secondary writings and commentary built up over many centuries, which is why their religious doctrine is sometimes called “Talmudic Judaism.” Among large portions of the faithful, the Talmud is supplemented by the Kabala, another large collection of accumulated writings, mostly focused on mysticism and all sorts of magic. Since these commentaries and interpretations represent the core of the religion, much of what everyone takes for granted in the Bible is considered in a very different manner.</p><p>Given the nature of the Talmudic basis of traditional Judaism and my total previous ignorance of the subject, any attempt on my part of summarize some of the more surprising aspects of Shahak’s description may be partially garbled, and is certainly worthy of correction by someone better versed in that dogma. And given that so many parts of the Talmud are highly contradictory and infused with complex mysticism, it would be impossible for someone like me to attempt to disentangle the seeming inconsistencies that I am merely repeating. I should note that although Shahak’s description of the beliefs and practices of Talmudic Judaism evoked a fire-storm of denunciations, few of those harsh critics seem to have denied his very specific claims, including the most astonishing ones, which would seem to strengthen his credibility.</p><p>On the most basic level, the religion of most traditional Jews is actually not at all monotheistic, but instead contains a wide variety of different male and female gods, having quite complex relations to each other, with these entities and their properties varying enormously among the numerous different Jewish sub-sects, depending upon which portions of the Talmud and the Kabala they place uppermost. For example, the traditional Jewish religious cry “The Lord Is One” has always been interpreted by most people to be an monotheistic affirmation, and indeed, many Jews take exactly this same view. But large numbers of other Jews believe this declaration instead refers to achievement of sexual union between the primary male and female divine entities. And most bizarrely, Jews having such radically different views see absolutely no difficulty in praying side by side, and merely interpreting their identical chants in very different fashion.</p><p>Furthermore, religious Jews apparently pray to Satan almost as readily as they pray to God, and depending upon the various rabbinical schools, the particular rituals and sacrifices they practice may be aimed at enlisting the support of the one or the other. Once again, so long as the rituals are properly followed, the Satan-worshippers and the God-worshippers get along perfectly well and consider each other equally pious Jews, merely of a slightly different tradition. One point that Shahak repeatedly emphasizes is that in traditional Judaism the nature of the ritual itself is absolutely uppermost, while the interpretation of the ritual is rather secondary. So perhaps a Jew who washes his hands three times clockwise might be horrified by another who follows a counter-clockwise direction, but whether the hand-washing were meant to honor God or to honor Satan would be hardly be a matter of much consequence.</p><p>Strangely enough, many of the traditional rituals are explicitly intended to fool or trick God or His angels or sometimes Satan, much like the mortal heroes of some Greek legend might seek to trick Zeus or Aphrodite. For example, certain prayers must be uttered in Aramaic rather than Hebrew on the grounds that holy angels apparently don’t understand the former language, and their confusion allows those verses to slip by unimpeded and take effect without divine interference….</p><p>And while religious Judaism has a decidedly negative view towards all non-Jews, Christianity in particular is regarded as a total abomination, which must be wiped from the face of the earth.</p><p>Whereas pious Muslims consider Jesus the holy prophet of God and Muhammed’s immediate predecessor, according to the Jewish Talmud, Jesus is perhaps the vilest being who ever lived, condemned to spend eternity in the bottommost pit of Hell, immersed in a boiling vat of excrement. Religious Jews regard the Muslim Quran as just another book, though a totally mistaken one, but the Christian Bible represents purest evil, and if circumstances permit, burning Bibles is a very praiseworthy act. Pious Jews are also enjoined to always spit three times at any cross or church they encounter, and direct a curse at all Christian cemeteries. Indeed, many deeply religious Jews utter a prayer each and every day for the immediate extermination of all Christians.</p></blockquote><p> And remember, this is the religion of Ben Shapiro, which is why it is patently obvious that there is not, and has never been any such thing as “Judeo-Christianity”, a “Judeo-Christian ethic”, or a “Judeo-Christian heritage”. It would certainly be very interesting to debate shifty little Benny and see just how much he knows about the faith he so publicly professes.</p></div>",
  "content_text": "It doesn’t take a genius to see that\nthis article by Ron Unz on Judaism\nis going to prove highly controversial in conservative circles. But the truth is what it is, not what we would prefer it to be, so if you take any issue with it, or if you feel the need to run around shrieking about the anti-semitism of self-hating Jews, then I suggest you take it up with either Mr. Unz or Mr. Shahak. All I can say is that if you think this article is shocking, you don’t know religious history very well and you’re probably in for a real treat down the road. As I said before, it’s not merely non-Christians who are going to have a very difficult time with the light of truth being shined in so many dark places these days.\nI must emphasize that I cannot directly vouch for Shahak’s claims about Judaism. My own knowledge of that religion is absolutely negligible, mostly being limited to my childhood, when my grandmother occasionally managed to drag me down to services at the local synagogue, where I was seated among a mass of elderly men praying and chanting in some strange language while wearing various ritualistic cloths and religious talismans, an experience that I always found much less enjoyable than my usual Saturday morning cartoons….. Essentially almost everything I had known—or thought I had known—about the religion of Judaism, at least in its zealously Orthodox traditional form, was utterly wrong.\nFor example, traditionally religious Jews pay little attention to most of the Old Testament, and even very learned rabbis or students who have devoted many years to intensive study may remain largely ignorant of its contents. Instead, the center of their religious world view is the Talmud, an enormously large, complex, and somewhat contradictory mass of secondary writings and commentary built up over many centuries, which is why their religious doctrine is sometimes called “Talmudic Judaism.” Among large portions of the faithful, the Talmud is supplemented by the Kabala, another large collection of accumulated writings, mostly focused on mysticism and all sorts of magic. Since these commentaries and interpretations represent the core of the religion, much of what everyone takes for granted in the Bible is considered in a very different manner.\nGiven the nature of the Talmudic basis of traditional Judaism and my total previous ignorance of the subject, any attempt on my part of summarize some of the more surprising aspects of Shahak’s description may be partially garbled, and is certainly worthy of correction by someone better versed in that dogma. And given that so many parts of the Talmud are highly contradictory and infused with complex mysticism, it would be impossible for someone like me to attempt to disentangle the seeming inconsistencies that I am merely repeating. I should note that although Shahak’s description of the beliefs and practices of Talmudic Judaism evoked a fire-storm of denunciations, few of those harsh critics seem to have denied his very specific claims, including the most astonishing ones, which would seem to strengthen his credibility.\nOn the most basic level, the religion of most traditional Jews is actually not at all monotheistic, but instead contains a wide variety of different male and female gods, having quite complex relations to each other, with these entities and their properties varying enormously among the numerous different Jewish sub-sects, depending upon which portions of the Talmud and the Kabala they place uppermost. For example, the traditional Jewish religious cry “The Lord Is One” has always been interpreted by most people to be an monotheistic affirmation, and indeed, many Jews take exactly this same view. But large numbers of other Jews believe this declaration instead refers to achievement of sexual union between the primary male and female divine entities. And most bizarrely, Jews having such radically different views see absolutely no difficulty in praying side by side, and merely interpreting their identical chants in very different fashion.\nFurthermore, religious Jews apparently pray to Satan almost as readily as they pray to God, and depending upon the various rabbinical schools, the particular rituals and sacrifices they practice may be aimed at enlisting the support of the one or the other. Once again, so long as the rituals are properly followed, the Satan-worshippers and the God-worshippers get along perfectly well and consider each other equally pious Jews, merely of a slightly different tradition. One point that Shahak repeatedly emphasizes is that in traditional Judaism the nature of the ritual itself is absolutely uppermost, while the interpretation of the ritual is rather secondary. So perhaps a Jew who washes his hands three times clockwise might be horrified by another who follows a counter-clockwise direction, but whether the hand-washing were meant to honor God or to honor Satan would be hardly be a matter of much consequence.\nStrangely enough, many of the traditional rituals are explicitly intended to fool or trick God or His angels or sometimes Satan, much like the mortal heroes of some Greek legend might seek to trick Zeus or Aphrodite. For example, certain prayers must be uttered in Aramaic rather than Hebrew on the grounds that holy angels apparently don’t understand the former language, and their confusion allows those verses to slip by unimpeded and take effect without divine interference….\nAnd while religious Judaism has a decidedly negative view towards all non-Jews, Christianity in particular is regarded as a total abomination, which must be wiped from the face of the earth.\nWhereas pious Muslims consider Jesus the holy prophet of God and Muhammed’s immediate predecessor, according to the Jewish Talmud, Jesus is perhaps the vilest being who ever lived, condemned to spend eternity in the bottommost pit of Hell, immersed in a boiling vat of excrement. Religious Jews regard the Muslim Quran as just another book, though a totally mistaken one, but the Christian Bible represents purest evil, and if circumstances permit, burning Bibles is a very praiseworthy act. Pious Jews are also enjoined to always spit three times at any cross or church they encounter, and direct a curse at all Christian cemeteries. Indeed, many deeply religious Jews utter a prayer each and every day for the immediate extermination of all Christians.\nAnd remember, this is the religion of Ben Shapiro, which is why it is patently obvious that there is not, and has never been any such thing as “Judeo-Christianity”, a “Judeo-Christian ethic”, or a “Judeo-Christian heritage”. It would certainly be very interesting to debate shifty little Benny and see just how much he knows about the faith he so publicly professes.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-16T13:29:40+00:00"
}