{
  "url": "https://voxday.net/2018/07/02/rules-are-made-to-be-broken/",
  "scraped_at": "2025-12-19T21:09:48.669368",
  "title": "Rules are made to be broken",
  "date_display": "July 2, 2018",
  "date_iso": "2018-07-02T23:12:06+00:00",
  "date_from_url": "2018-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You all know the rule: DO NOT TALK TO THE MEDIA. Of course, as we all know, the rules <a href=\"https://www.socialmatter.net/2018/07/02/express-heartfelt-apology-rolling-stone-journalist-amanda-robb/\">do not apply to Pax</a>:</p><blockquote><p>A fortnight ago I was contacted by a Ms. Amanda Robb, who identified herself as a journalist. Having had a personal history of difficulty with unsavory wretches of that sort, and being a well-known proponent of a harsh criminal punishment for their un-American collectivist scribblings, I of course immediately recommended that Ms. Robb engage in a vigorous act of self-procreation.</p><p>Ms. Robb, however, would not be deterred. She (I did not ask her pronoun, regrettably, so I must assume) was earnestly seeking my comment regarding traditionalist superhero comic books and the manners and methods of aggregating funds for the production of such. The aggressively persistent Ms. Robb told me she is a journalist  for the widely known (none would say ‘popular’, but it is widely known) <i>Rolling Stone</i> magazine; which magazine, I learned, is not actually solely published for manipulative character assassinations of washed-up entertainers and the dissemination of libelous false rape accusations against innocent frat boys, but purports to do Actual Journalism. I questioned this ambition, of course, but Ms. Robb assured me that the former incautious <i>Rolling Stone</i> editors responsible for the recent libelous rape fiction had been quite thoroughly sacked after the massive financial settlement and had been replaced by a new crop of editors who were assuredly much cleverer about not being found responsible for making things up in any legally actionable way.</p><p>Upon perusing Ms. Robb’s prior work at <i>Marie Claire</i>, <i>The Guardian </i>and with <i>The Investigative Fund</i> of <i>The Nation Magazine</i>, which focused on baby-killing tips, a convenient debunking of investigations of elite pedophile rings, and Ms. Robb’s personal experiences with extensive plastic surgery, I could only conclude Ms. Robb must be undoubtedly amongst the finest of politically axe-grinding journalists working in stale Boomer left-wing pop music magazines today.</p><p>I explained to Ms. Robb that I have retired to the quiet life of a simple gentleman farmer, knew and cared little about comic books, and did not seek further attention from the media-propaganda complex. I further explained that I considered her employers and her “profession” (such that it is) to be distasteful at best and criminal at worst, and that I expected she might not have the best of intentions toward me given my knowledge about how modern journalism is done and my past experiences being a subject of the yellow press.</p></blockquote><p>Oh dear. Oh, sweet Saint Sulzberger… you really have to read the whole thing! I have to say, though, there is one small niggling detail about this that puzzles me. What on Earth does good ol’ Pax have to do with comics in general and Arkhaven Comics in particular?</p><p>It’s really rather remarkable to what lengths they will go for a quote when no one is talking.</p><p>UPDATE: No means no!</p><blockquote class=\"tr_bq\"><p>amanda sent you an invitation on LinkedIn<br>amanda robb wants to add you to their network<br>amanda robb<br>Writer/Reporter at amandarobb.com<br>Greater New York City Area<br>Accept amanda’s invitation</br></br></br></br></br></p></blockquote></div>",
  "content_text": "You all know the rule: DO NOT TALK TO THE MEDIA. Of course, as we all know, the rules\ndo not apply to Pax\n:\nA fortnight ago I was contacted by a Ms. Amanda Robb, who identified herself as a journalist. Having had a personal history of difficulty with unsavory wretches of that sort, and being a well-known proponent of a harsh criminal punishment for their un-American collectivist scribblings, I of course immediately recommended that Ms. Robb engage in a vigorous act of self-procreation.\nMs. Robb, however, would not be deterred. She (I did not ask her pronoun, regrettably, so I must assume) was earnestly seeking my comment regarding traditionalist superhero comic books and the manners and methods of aggregating funds for the production of such. The aggressively persistent Ms. Robb told me she is a journalist  for the widely known (none would say ‘popular’, but it is widely known)\nRolling Stone\nmagazine; which magazine, I learned, is not actually solely published for manipulative character assassinations of washed-up entertainers and the dissemination of libelous false rape accusations against innocent frat boys, but purports to do Actual Journalism. I questioned this ambition, of course, but Ms. Robb assured me that the former incautious\nRolling Stone\neditors responsible for the recent libelous rape fiction had been quite thoroughly sacked after the massive financial settlement and had been replaced by a new crop of editors who were assuredly much cleverer about not being found responsible for making things up in any legally actionable way.\nUpon perusing Ms. Robb’s prior work at\nMarie Claire\n,\nThe Guardian\nand with\nThe Investigative Fund\nof\nThe Nation Magazine\n, which focused on baby-killing tips, a convenient debunking of investigations of elite pedophile rings, and Ms. Robb’s personal experiences with extensive plastic surgery, I could only conclude Ms. Robb must be undoubtedly amongst the finest of politically axe-grinding journalists working in stale Boomer left-wing pop music magazines today.\nI explained to Ms. Robb that I have retired to the quiet life of a simple gentleman farmer, knew and cared little about comic books, and did not seek further attention from the media-propaganda complex. I further explained that I considered her employers and her “profession” (such that it is) to be distasteful at best and criminal at worst, and that I expected she might not have the best of intentions toward me given my knowledge about how modern journalism is done and my past experiences being a subject of the yellow press.\nOh dear. Oh, sweet Saint Sulzberger… you really have to read the whole thing! I have to say, though, there is one small niggling detail about this that puzzles me. What on Earth does good ol’ Pax have to do with comics in general and Arkhaven Comics in particular?\nIt’s really rather remarkable to what lengths they will go for a quote when no one is talking.\nUPDATE: No means no!\namanda sent you an invitation on LinkedIn\namanda robb wants to add you to their network\namanda robb\nWriter/Reporter at amandarobb.com\nGreater New York City Area\nAccept amanda’s invitation",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-02T22:12:06+00:00"
}