{
  "url": "https://voxday.net/2018/07/31/run-bill-run/",
  "scraped_at": "2025-12-19T21:14:22.632377",
  "title": "Run, Bill, run!",
  "date_display": "July 31, 2018",
  "date_iso": "2018-07-31T12:00:05+00:00",
  "date_from_url": "2018-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because the French/McMuffin debacle wasn’t embarrassing enough, the traitorous Trotskyite is considering the possibility of <a href=\"http://dailycaller.com/2018/07/30/bill-kristol-2020/\">seeking even more humiliation in 2020</a>:</p><blockquote><p>Bill Kristol, the former editor-in-chief of The Weekly Standard, is considering challenging President Donald Trump in the 2020 Republican primary.</p><p>Kristol, who is consistently one of the most vocal anti-Trump Republicans, has been considering a run for months, a source familiar with Kristol’s thinking told The Daily Caller News Foundation.</p><p>Kristol, who remains an editor-at-large for the Standard, said he has no plans to run but declined to rule it out when asked by TheDCNF.</p><p>“No plans to run. But I’m randomly in Boston today, and happen to have had lunch with someone who does a lot of work in New Hampshire,” Kristol wrote in an email. “As he’d say, ‘Ya nevah know.’”</p><p>The New Hampshire primary, the second electoral contest after the Iowa Caucuses, is a key hurdle in the presidential nominating process.</p><p>Kristol previously sparked 2020 rumors in March when he popped up in New Hampshire to speak at “a must-show event for potential presidential contenders,” as Inside Sources noted at the time.</p></blockquote><p>While I would love to see Kristol the Younger repeatedly humiliated on a national stage, trying to argue his Israel First policies in public against the God-Emperor, even he is not <i>quite </i>that stupid. Captain Underoos, on the other hand, just might be.</p></div>",
  "content_text": "Because the French/McMuffin debacle wasn’t embarrassing enough, the traitorous Trotskyite is considering the possibility of\nseeking even more humiliation in 2020\n:\nBill Kristol, the former editor-in-chief of The Weekly Standard, is considering challenging President Donald Trump in the 2020 Republican primary.\nKristol, who is consistently one of the most vocal anti-Trump Republicans, has been considering a run for months, a source familiar with Kristol’s thinking told The Daily Caller News Foundation.\nKristol, who remains an editor-at-large for the Standard, said he has no plans to run but declined to rule it out when asked by TheDCNF.\n“No plans to run. But I’m randomly in Boston today, and happen to have had lunch with someone who does a lot of work in New Hampshire,” Kristol wrote in an email. “As he’d say, ‘Ya nevah know.’”\nThe New Hampshire primary, the second electoral contest after the Iowa Caucuses, is a key hurdle in the presidential nominating process.\nKristol previously sparked 2020 rumors in March when he popped up in New Hampshire to speak at “a must-show event for potential presidential contenders,” as Inside Sources noted at the time.\nWhile I would love to see Kristol the Younger repeatedly humiliated on a national stage, trying to argue his Israel First policies in public against the God-Emperor, even he is not\nquite\nthat stupid. Captain Underoos, on the other hand, just might be.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-31T11:00:05+00:00"
}