{
  "url": "https://voxday.net/2018/07/08/the-inevitable-conclusion/",
  "scraped_at": "2025-12-19T21:10:37.046267",
  "title": "The inevitable conclusion",
  "date_display": "July 8, 2018",
  "date_iso": "2018-07-08T12:00:06+00:00",
  "date_from_url": "2018-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The discussion on <a href=\"http://voxday.blogspot.com/2018/07/dysgenics-and-failure-migration.html\">dysgenics and failure migration</a>, which naturally circled back to the conceptual distinction between posterity and the proposition nation, was usefully clarifying for several readers.</p><p>Garuna said: <i>The true America really is dead. Just look at all the “nationalists” here pushing the proposition nation meme.</i></p><p>lynnjynh9315 added: <i>I think this is Vox’s point: American identity is dead. Even without non-whites, there will still be Anglo-America, Scots-America, German-America, Scand-America, Cajun-America, etc. This is the source of the problem. Even whites are not homogeneous. The United States is dead, it’s just a matter of what new nations the fragments will form into. No one group is going to win it all.</i></p><p>Both observations are correct. That has been my consistent theme <a href=\"http://test.www.wnd.com/2004/07/25518/\">since 2004</a>.</p><p>Tibetan religious tradition has it that when the Dalai Lama dies, the Buddha of Compassion leaves his body and incarnates in the body of a young child. The monks immediately go out in search of this blessed child, and when they find him – as they inevitably do – he is tested by a group of high lamas and enthroned as the reincarnation of his successor.</p><p>Imagine, however, if the lamas refused to recognize that the Dalai Lama was, in fact, dead. Suppose that instead of going in search of the Buddha’s new carnal home, they hooked the corpse up to a life support machine and waited patiently for the Holy One to awake and rise up. It’s not hard to see that they would be doomed to disappointment, and furthermore, <i>would fail to find the next Dalai Lama as well</i>.</p><p>This is precisely our dilemma today, for America, as envisioned by the Founding Fathers, is dead. By every measure, large and small, the original vision of limited government by, for and of the people has been folded, spindled and mutilated beyond recognition. When one reads the Constitution, one simply marvels at the distinct difference between its words and our present reality.</p><p>America is dead. Let us go, then, and find her.</p></div>",
  "content_text": "The discussion on\ndysgenics and failure migration\n, which naturally circled back to the conceptual distinction between posterity and the proposition nation, was usefully clarifying for several readers.\nGaruna said:\nThe true America really is dead. Just look at all the “nationalists” here pushing the proposition nation meme.\nlynnjynh9315 added:\nI think this is Vox’s point: American identity is dead. Even without non-whites, there will still be Anglo-America, Scots-America, German-America, Scand-America, Cajun-America, etc. This is the source of the problem. Even whites are not homogeneous. The United States is dead, it’s just a matter of what new nations the fragments will form into. No one group is going to win it all.\nBoth observations are correct. That has been my consistent theme\nsince 2004\n.\nTibetan religious tradition has it that when the Dalai Lama dies, the Buddha of Compassion leaves his body and incarnates in the body of a young child. The monks immediately go out in search of this blessed child, and when they find him – as they inevitably do – he is tested by a group of high lamas and enthroned as the reincarnation of his successor.\nImagine, however, if the lamas refused to recognize that the Dalai Lama was, in fact, dead. Suppose that instead of going in search of the Buddha’s new carnal home, they hooked the corpse up to a life support machine and waited patiently for the Holy One to awake and rise up. It’s not hard to see that they would be doomed to disappointment, and furthermore,\nwould fail to find the next Dalai Lama as well\n.\nThis is precisely our dilemma today, for America, as envisioned by the Founding Fathers, is dead. By every measure, large and small, the original vision of limited government by, for and of the people has been folded, spindled and mutilated beyond recognition. When one reads the Constitution, one simply marvels at the distinct difference between its words and our present reality.\nAmerica is dead. Let us go, then, and find her.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-08T11:00:06+00:00"
}