{
  "url": "https://voxday.net/2018/07/21/the-chickenhawk-squared/",
  "scraped_at": "2025-12-19T21:12:49.287385",
  "title": "The Chickenhawk squared",
  "date_display": "July 21, 2018",
  "date_iso": "2018-07-21T15:13:07+00:00",
  "date_from_url": "2018-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of the newer Ilk are learning to trust my instincts:</p><blockquote class=\"tr_bq\"><p>I doubted Vox when he predicted that Shapiro would eventually come out in defense of Jewish Hollywood rapists. But here we are.</p></blockquote><p>It’s really not that difficult. Everything a tribalist does will be in defense of his tribe, even if that requires declaring that 1+1=2 one minute, then turning around and declaring that 1+1=fuchsia the next. I have known that Ben Shapiro was a dishonest little snake since 2005.</p><p>When are you all going to understand that you can NEVER give a snake a pass just because he happens to mouth a few words that you like every now and then? <i>NEVER!</i> Once someone reveals their snakish character, that means you cannot trust a single word that he wrote, said, or implied, either in the past or in the future.</p><p>That’s how I knew Jordan Peterson was an evil and corrupting influence before I’d watched any of his videos or read either of his books. That’s why I have never had any respect or regard for Ben Shapiro, even before his star ascended in the usual conservative circles and <a href=\"https://www.nytimes.com/2017/11/23/us/ben-shapiro-conservative.html\">the New York Times anointed him</a> a leading figure of the Approved Opposition. It’s just a matter of time before pictures of both of them with black eyes appear.</p><p>The following are the words of a snake. Compare and contrast the two statements.</p><p><i>I think @JamesGunn is an a**hole, as my exchange with him earlier this week made clear. I also think that firing him for vile old joke tweets is bad precedent and a mistake. There is no limiting principle to the outrage mob.</i><br>– Ben Shapiro</br></p><p><i>Of course there are legitimate racists and we should target them, We should find them and we should hurt their careers because racism is unacceptable.</i><br>– Ben Shapiro</br></p><p>So, racism is unacceptable, but pedophilia is just fine with the Littlest Chickenhawk. Quelle surprise…. Anyhow, it’s beyond stupid to claim that any “precedent” is being set here. There is no dearth of well-established precedent for people being fired for a single tweet, let alone <a href=\"https://www.neonrevolt.com/2018/07/20/but-but-but-i-thought-pizzagate-wasnt-real-gunncontrol/\">dozens of seriously sketchy ones</a>.</p><p>A reader points out another snakish juxtaposition.</p><p><i>And by the way, I don’t give a good damn about the so-called “browning of America.</i><br>– Ben Shapiro</br></p><p><i>If Germans, who had a centuries-old connection to the newly created Polish territory, could be expelled, then surely Palestinians, whose claim to Judea, Samaria and Gaza is dubious at best, can be expelled. </i><i>It’s time to stop being squeamish.</i><br>– Ben Shapiro</br></p><p>The Palestinians have a much stronger historical claim to Judea, Samaria, and Gaza than the Jews do to any land from Maine to California. Shall we take this to mean that Ben Shapiro would support the expulsion of the Jewish people from the USA?</p></div>",
  "content_text": "Some of the newer Ilk are learning to trust my instincts:\nI doubted Vox when he predicted that Shapiro would eventually come out in defense of Jewish Hollywood rapists. But here we are.\nIt’s really not that difficult. Everything a tribalist does will be in defense of his tribe, even if that requires declaring that 1+1=2 one minute, then turning around and declaring that 1+1=fuchsia the next. I have known that Ben Shapiro was a dishonest little snake since 2005.\nWhen are you all going to understand that you can NEVER give a snake a pass just because he happens to mouth a few words that you like every now and then?\nNEVER!\nOnce someone reveals their snakish character, that means you cannot trust a single word that he wrote, said, or implied, either in the past or in the future.\nThat’s how I knew Jordan Peterson was an evil and corrupting influence before I’d watched any of his videos or read either of his books. That’s why I have never had any respect or regard for Ben Shapiro, even before his star ascended in the usual conservative circles and\nthe New York Times anointed him\na leading figure of the Approved Opposition. It’s just a matter of time before pictures of both of them with black eyes appear.\nThe following are the words of a snake. Compare and contrast the two statements.\nI think @JamesGunn is an a**hole, as my exchange with him earlier this week made clear. I also think that firing him for vile old joke tweets is bad precedent and a mistake. There is no limiting principle to the outrage mob.\n– Ben Shapiro\nOf course there are legitimate racists and we should target them, We should find them and we should hurt their careers because racism is unacceptable.\n– Ben Shapiro\nSo, racism is unacceptable, but pedophilia is just fine with the Littlest Chickenhawk. Quelle surprise…. Anyhow, it’s beyond stupid to claim that any “precedent” is being set here. There is no dearth of well-established precedent for people being fired for a single tweet, let alone\ndozens of seriously sketchy ones\n.\nA reader points out another snakish juxtaposition.\nAnd by the way, I don’t give a good damn about the so-called “browning of America.\n– Ben Shapiro\nIf Germans, who had a centuries-old connection to the newly created Polish territory, could be expelled, then surely Palestinians, whose claim to Judea, Samaria and Gaza is dubious at best, can be expelled.\nIt’s time to stop being squeamish.\n– Ben Shapiro\nThe Palestinians have a much stronger historical claim to Judea, Samaria, and Gaza than the Jews do to any land from Maine to California. Shall we take this to mean that Ben Shapiro would support the expulsion of the Jewish people from the USA?",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-21T14:13:07+00:00"
}