{
  "url": "https://voxday.net/2018/07/12/where-the-prey-is/",
  "scraped_at": "2025-12-19T21:11:26.560992",
  "title": "Where the prey is",
  "date_display": "July 12, 2018",
  "date_iso": "2018-07-12T12:20:45+00:00",
  "date_from_url": "2018-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If parents had any idea how many pedos <a href=\"https://theautisticmomma.wordpress.com/2018/06/18/3-years-at-colonial-road-school/\">have infiltrated the public schools</a> and turned them into child porn production centers, the public school system would not only lose two-thirds of its students over night, but suburban America would look like The Purge.</p><blockquote><p>A week and a half into school we received an email saying that he had been scratched by another child on the playground. No big deal, kids will be kids.</p><p>Two weeks later our sons got off the bus. I asked my older son if he had seen his younger brother in school. He put his head down, said no and ran in the opposite direction. I thought it was odd but I didn’t push. He came back a few minutes later and said “I saw him in the nurse’s office”. We questioned why and his response was “to look at our bodies” the entire time he smacked his body and cried. We didn’t push and comforted him the best we could.</p><p>Meanwhile, I called and left the nurse a message. That night she called me back. I asked why my children were in her office and why was she looking at their bodies. She said she did it every day to them. Her reason for them being together during this process? My younger son wouldn’t comply. He cried and tried to run so they brought his older brother in to coerce him into compliance. She said it was “protocol”. I asked where the protocol was and she just kept repeating that it was protocol. I asked to see the written protocol. She replied with “it isn’t written”. I informed her that this was against my beliefs on bodily autonomy. She told me that she didn’t need my permission and didn’t need to tell me that it was being done. I informed her that she was grooming my children for a predator. She became angry. She said she had been doing it to my older son for 3 years and it was done twice a day. Wait? Did you just say 3 years? Twice a day? For 3 years you’ve been searching my child’s body without my permission or knowledge? How long did it happen to my younger son? Every day for almost 4 weeks….</p><p>I went home and called the police and filed an internal abuse report. The principal spoke to the police and said that we had agreed to body searches but couldn’t provide documentation. The internal abuse investigator came out and talked to our children. He said that if there was no written policy then it was clearly illegal but his investigation could take 90 days.</p><p>That night I sat with those records from the nurse and went through them 1 by 1. I found the names of other autistic children on the papers, crossed out to make room for my children’s names.</p></blockquote><p>You know how when these pedophile arrests are announced and the police talk about how they found thousands of images on the evil bastard’s computer? Well, <i>where do you think those photographs are being taken?</i> I’ll bet that a lot of them are being taken at elementary schools, in the nurse’s office, by school employees. Notice that the entire administrative system of the school, including the principal and the superintendent, was immediately summoned to try to defend the nurse against charges that should have resulted in her immediate dismissal and arrest by the police.</p><p>The problem is that there is an entire system that has been constructed to protect pedos who have been exposed and caught. Remember that President of the Manhattan Young Democrats and Hillary Clinton activist who was arrested just over one year ago after being found in possession of over three thousand illegal images? Mike Cernovich describes the legal fallout, <a href=\"https://www.cernovich.com/cnn-guest-and-bill-de-blasio-aide-getting-sweetheart-deal-in-child-p-rn-case/\">or lack thereof</a>:</p><blockquote><p>Bill de Blasio aid and well-connected Democrat leader Jacob Schwarz, who was President of the Manhattan Young Democrats, was arrested over a year ago for possessing child p-rnography.</p><p><i>De Blasio administration employee, 29, is arrested for ‘having 3,000 photos and 89 videos of child pornography depicting children as young as six months old’</i></p><p>Schwartz was released on $7,500 bail, and has been free since. In fact, no motions have been filed in his case at all, court records reveal.</p><p>What is going on here?</p><p>Schwartz is facing up to life in prison for the charges, and he has no credible defense against them.</p><p>The judge is thus leaving him out on bail as a way to delay the inevitable.</p><p>Here are the court appearances in the Jacob Schwartz case. As you can see, nothing is happening. The case is completely stalled.</p></blockquote><p>All of this is related to what Qanon has been telling us. The overall scale of the corruption in the United States is so vast, and so shocking, that even those who are heavily armed preppers and survivalists are going to find it very hard to believe. And even good Christians are going to find it very hard to accept the reality of the literally Satanic evil.</p></div>",
  "content_text": "If parents had any idea how many pedos\nhave infiltrated the public schools\nand turned them into child porn production centers, the public school system would not only lose two-thirds of its students over night, but suburban America would look like The Purge.\nA week and a half into school we received an email saying that he had been scratched by another child on the playground. No big deal, kids will be kids.\nTwo weeks later our sons got off the bus. I asked my older son if he had seen his younger brother in school. He put his head down, said no and ran in the opposite direction. I thought it was odd but I didn’t push. He came back a few minutes later and said “I saw him in the nurse’s office”. We questioned why and his response was “to look at our bodies” the entire time he smacked his body and cried. We didn’t push and comforted him the best we could.\nMeanwhile, I called and left the nurse a message. That night she called me back. I asked why my children were in her office and why was she looking at their bodies. She said she did it every day to them. Her reason for them being together during this process? My younger son wouldn’t comply. He cried and tried to run so they brought his older brother in to coerce him into compliance. She said it was “protocol”. I asked where the protocol was and she just kept repeating that it was protocol. I asked to see the written protocol. She replied with “it isn’t written”. I informed her that this was against my beliefs on bodily autonomy. She told me that she didn’t need my permission and didn’t need to tell me that it was being done. I informed her that she was grooming my children for a predator. She became angry. She said she had been doing it to my older son for 3 years and it was done twice a day. Wait? Did you just say 3 years? Twice a day? For 3 years you’ve been searching my child’s body without my permission or knowledge? How long did it happen to my younger son? Every day for almost 4 weeks….\nI went home and called the police and filed an internal abuse report. The principal spoke to the police and said that we had agreed to body searches but couldn’t provide documentation. The internal abuse investigator came out and talked to our children. He said that if there was no written policy then it was clearly illegal but his investigation could take 90 days.\nThat night I sat with those records from the nurse and went through them 1 by 1. I found the names of other autistic children on the papers, crossed out to make room for my children’s names.\nYou know how when these pedophile arrests are announced and the police talk about how they found thousands of images on the evil bastard’s computer? Well,\nwhere do you think those photographs are being taken?\nI’ll bet that a lot of them are being taken at elementary schools, in the nurse’s office, by school employees. Notice that the entire administrative system of the school, including the principal and the superintendent, was immediately summoned to try to defend the nurse against charges that should have resulted in her immediate dismissal and arrest by the police.\nThe problem is that there is an entire system that has been constructed to protect pedos who have been exposed and caught. Remember that President of the Manhattan Young Democrats and Hillary Clinton activist who was arrested just over one year ago after being found in possession of over three thousand illegal images? Mike Cernovich describes the legal fallout,\nor lack thereof\n:\nBill de Blasio aid and well-connected Democrat leader Jacob Schwarz, who was President of the Manhattan Young Democrats, was arrested over a year ago for possessing child p-rnography.\nDe Blasio administration employee, 29, is arrested for ‘having 3,000 photos and 89 videos of child pornography depicting children as young as six months old’\nSchwartz was released on $7,500 bail, and has been free since. In fact, no motions have been filed in his case at all, court records reveal.\nWhat is going on here?\nSchwartz is facing up to life in prison for the charges, and he has no credible defense against them.\nThe judge is thus leaving him out on bail as a way to delay the inevitable.\nHere are the court appearances in the Jacob Schwartz case. As you can see, nothing is happening. The case is completely stalled.\nAll of this is related to what Qanon has been telling us. The overall scale of the corruption in the United States is so vast, and so shocking, that even those who are heavily armed preppers and survivalists are going to find it very hard to believe. And even good Christians are going to find it very hard to accept the reality of the literally Satanic evil.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-07-12T11:20:45+00:00"
}