{
  "url": "https://voxday.net/2007/02/08/all-bark-no-backbone/",
  "scraped_at": "2026-01-08T21:31:01.687864",
  "title": "All bark, no backbone",
  "date_display": "February 8, 2007",
  "date_iso": "2007-02-08T19:39:00+00:00",
  "date_from_url": "2007-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“<a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2007/02/08/AR2007020800878.html\">My intention is never to offend anyone</a> for his or her personal beliefs, and I am sorry if anyone was personally offended by writings meant only as criticisms of public politics.  Freedom of religion and freedom of expression are central rights, and the sum of my personal writings is a testament to this fact.” – Amynda</p><p>“[I have] an unwavering support of religious freedom and a deep respect for diverse beliefs. It has never been my intention to disparage people’s individual faith, and I’m sorry if my words were taken in that way.” – Shakespeare’s Sister</p><p>I have no doubt there will be plenty of opportunity to hang both of these dimwits on those words.  What a pair of cowards!  If I was a fan of either of those blogs, I’d be sickened at the boot-licking on display here, especially considering how those fans were going on and on about how disgusting they found John Edwards’ presumed willingness to bow to necessity.</p><p>Of course, being a feminist means never having to make sense.</p><p>While I’m delighted that they’ll both be around for further public blog-kicking, I fully expect Amynda to break under the pressure of trying to watch her tongue.  She’ll land herself in hot water again long before Edwards drops out of the race to endorse the Lizard Queen.</p><p>As for me, I shall intentionally offend whomever I wish, whenever I wish, for whatever reason I wish.  This includes, but is not limited to, your personal beliefs, your intellect, your physical appearance, your opinion on a particular matter, your abilities or your lack of abilities, your sex, your race, your language or your national origin.</p><p>Furthermore, I have yet to apologize for or retract anything that I have written in a WorldNetDaily column or on this blog.  Nor do I foresee any probability of doing so in the future.</p></div>",
  "content_text": "“\nMy intention is never to offend anyone\nfor his or her personal beliefs, and I am sorry if anyone was personally offended by writings meant only as criticisms of public politics.  Freedom of religion and freedom of expression are central rights, and the sum of my personal writings is a testament to this fact.” – Amynda\n“[I have] an unwavering support of religious freedom and a deep respect for diverse beliefs. It has never been my intention to disparage people’s individual faith, and I’m sorry if my words were taken in that way.” – Shakespeare’s Sister\nI have no doubt there will be plenty of opportunity to hang both of these dimwits on those words.  What a pair of cowards!  If I was a fan of either of those blogs, I’d be sickened at the boot-licking on display here, especially considering how those fans were going on and on about how disgusting they found John Edwards’ presumed willingness to bow to necessity.\nOf course, being a feminist means never having to make sense.\nWhile I’m delighted that they’ll both be around for further public blog-kicking, I fully expect Amynda to break under the pressure of trying to watch her tongue.  She’ll land herself in hot water again long before Edwards drops out of the race to endorse the Lizard Queen.\nAs for me, I shall intentionally offend whomever I wish, whenever I wish, for whatever reason I wish.  This includes, but is not limited to, your personal beliefs, your intellect, your physical appearance, your opinion on a particular matter, your abilities or your lack of abilities, your sex, your race, your language or your national origin.\nFurthermore, I have yet to apologize for or retract anything that I have written in a WorldNetDaily column or on this blog.  Nor do I foresee any probability of doing so in the future.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-08T19:39:00+00:00"
}