{
  "url": "https://voxday.net/2007/02/25/cold-and-quie/",
  "scraped_at": "2026-01-08T21:32:55.672595",
  "title": "The Cold and the Quiet",
  "date_display": "February 25, 2007",
  "date_iso": "2007-02-25T14:48:00+00:00",
  "date_from_url": "2007-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Newsweek:</p><blockquote><p>George Clooney, off shooting a movie, contributed the maximum when Obama first announced and tells NEWSWEEK that Obama is “as good as Bobby [Kennedy] late in his career and Jack from early on.”)</p></blockquote><p>Since B. Hussein isn’t a white Irish Catholic, I can only assume my sometime drinking buddy is referring to a particular interest in Marilyn Monroe.</p><p>There is something vaguely ghoulish about Obama, isn’t there?  He’s not a bad-looking guy, but he still looks a little like someone you’d expect to see in a Hunter: the Reckoning movie.</p><p>Don’t you think the title would have been a better name for “Six Feet Under”?  Maybe if it had been a soap opera, anyhow.  Actually, it might have been a soap opera for all I know, I’ve never seen it.</p><p>Speaking of amazingly bad ideas, the VP at one of my publishers and I were in hysterics last week over a hypothethetical submission of a proposal for <i>REMEMBRANCE OF THINGS PAST 3D: The Quest for the Colder Side of the Pillow</i>.  I swear, one of these days I’m going to blow a stupid amount of money making a demo of it just for kicks and get Sony to show it at GDC.</p></div>",
  "content_text": "From Newsweek:\nGeorge Clooney, off shooting a movie, contributed the maximum when Obama first announced and tells NEWSWEEK that Obama is “as good as Bobby [Kennedy] late in his career and Jack from early on.”)\nSince B. Hussein isn’t a white Irish Catholic, I can only assume my sometime drinking buddy is referring to a particular interest in Marilyn Monroe.\nThere is something vaguely ghoulish about Obama, isn’t there?  He’s not a bad-looking guy, but he still looks a little like someone you’d expect to see in a Hunter: the Reckoning movie.\nDon’t you think the title would have been a better name for “Six Feet Under”?  Maybe if it had been a soap opera, anyhow.  Actually, it might have been a soap opera for all I know, I’ve never seen it.\nSpeaking of amazingly bad ideas, the VP at one of my publishers and I were in hysterics last week over a hypothethetical submission of a proposal for\nREMEMBRANCE OF THINGS PAST 3D: The Quest for the Colder Side of the Pillow\n.  I swear, one of these days I’m going to blow a stupid amount of money making a demo of it just for kicks and get Sony to show it at GDC.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-25T14:48:00+00:00"
}