{
  "url": "https://voxday.net/2007/02/15/euthyphro-ii/",
  "scraped_at": "2026-01-08T21:32:02.685725",
  "title": "Euthyphro, part II of II",
  "date_display": "February 15, 2007",
  "date_iso": "2007-02-15T11:58:00+00:00",
  "date_from_url": "2007-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday <a href=\"http://www.milobookclub.com/2007/02/14/non-dilemma-of-euthyphro/\">in the first part</a> of our look at the applicability of Plato’s Euthyphro and the dilemma it supposedly poses to Christian claims about morality and its divine source, we concluded three things:</p><p>1.  The Euthyphro “dilemma” is defeated by shifting the focus from “the pious” to “obedience”, therefore it is an inappropriate criticism of Christian morality.</p><p>2.  The dilemma relies upon the false assumption that a fixed variable cannot be arbitrarily fixed.</p><p>3.  The section about disagreement between gods regarding the pious and impious does not apply to a monotheistic god or a Supreme polytheistic God who rules over the other gods and defines their morality for them.</p><p>Note that no one, either here or on any other blog, has taken exception to any of these conclusions.  Personally, I find it rather damning that atheists who are so quick to boast of their supposed intelligence and superior educations will only dare to leap in and criticize a short and obvious response to someone else’s question; when I write a lengthy post asserting my ability to prove the flawed nature of one of Mankind’s great philosophical dilemmas, there is only silence.</p><p>This is particularly strange considering the accusations that I am “stupid”, even “mindless”.  But is my logic truly “laughable”?  Is it not a simple matter for such intelligent and well-educated people to pick apart my reasoning?  Or is it merely that they are afraid to find themselves in the position of being forced to confess that I might actually be capable of legitimately challenging some of Mankind’s greatest philosophers?</p><p>In any event, we have reached the weak point in Socrates’ argument, where he reveals the devious, intellectually dishonest aspect of his character:</p><p><em>Soc. There was a notion that came into my mind while you were speaking; I said to myself: “Well, and what if Euthyphro does prove to me that all the gods regarded the death of the serf as unjust, how do I know anything more of the nature of piety and impiety? for granting that this action may be hateful to the gods, still piety and impiety are not adequately defined by these distinctions, for that which is hateful to the gods has been shown to be also pleasing and dear to them.” And therefore, Euthyphro, I do not ask you to prove this; I will suppose, if you like, that all the gods condemn and abominate such an action. But I will amend the definition so far as to say that what all the gods hate is impious, and what they love pious or holy; and what some of them love and others hate is both or neither. Shall this be our definition of piety and impiety?</em></p><p>Euth. Why not, Socrates?</p><p>Soc. Why not! certainly, as far as I am concerned, Euthyphro, there is no reason why not. But whether this admission will greatly assist you in the task of instructing me as you promised, is a matter for you to consider.</p><p>Euth. Yes, I should say that what all the gods love is pious and holy, and the opposite which they all hate, impious.</p><p>In order to narrow the definition for his egalitarian polytheist environment, Socrates first removes all individual preferences from the gods.  This means that war cannot be pious and holy even though Ares and Athena love it since Aphrodite objects, while happiness and love cannot be either if grim Hades takes exception to it.  This means that Plato’s definition of what is pious must be a vastly reduced subset of what any one particular god loves.</p><p>So, the idea of “the pious and the holy” being equated with what the Christian God loves is bait-and-switch even as Socrates and Euthyprho have defined the term.  Whether we define piety or Socrates and Euthyphro do, in either case it cannot be applied to the Christian God.</p><p>More importantly, the equation of “pious” with “what all the gods love” is an entirely arbitrary assignation by Socrates, who even admits that he is “amending the definition”.  To use one famous counterexample, David was loved by God although his actions in seducing Bathsheba and murdering Uriah were notoriously impious by our definition (obedience to God’s Will) or by Socrates’ definition (that which all the gods love).  Either God ceased to love David, which we are informed was not the case, or Socrates’ amended definition is merely a subset of “the pious and holy”.</p><p>Now, the “dilemma” is that one cannot logically define “the pious and holy” in a circular manner, since that would not be a definition but rather a tautology.  “Is the pious loved by the gods because it is pious, or is it pious because it is loved by the gods?”  But now that we recognize how Socrates has twice artificially narrowed the definition of “the pious”, all that is necessary to destroy the dilemma is to show that there is a reasonable definition of “loved by the gods” that is not defined by the narrowed definition of “the pious”.</p><p><em>Soc. And what do you say of piety, Euthyphro: is not piety, according to your definition, loved by all the gods?</em></p><p>Euth. Yes.</p><p>Soc. Because it is pious or holy, or for some other reason?</p><p>Euth. No, that is the reason.</p><p>Soc. It is loved because it is holy, not holy because it is loved?</p><p>Euth. Yes.</p><p>Soc. And that which is dear to the gods is loved by them, and is in a state to be loved of them because it is loved of them?</p><p>Euth. Certainly.</p><p>At no point does Socrates convincingly limit “what is loved by the gods” to “the pious”.  Nor is it difficult to cite particular godly loves that were not limited to “the pious”.  Zeus was reputed to fall in love on a regular basis, this love obviously fell outside Socrates’ narrow definition since Hera, being a jealous god, often took vengeance upon the Thunderer’s unfortunate beloveds.  Poseidon  and Athena hated Troy, while Ares and Aphrodite fought for the Trojans.</p><p>This is all quite applicable to the Christian dismissal of Euthyphro, but in order to smash the last remaining shards of the philosophical “dilemma” on its own terms, we must still find something that “all the gods love” which cannot reasonably be described as “the pious”.  Therefore, I propose the following dialogue with Socrates.</p><p><em>Vox. My dear friend Socrates, do inform me, so that I might better understand the nature of man’s proper relation with the gods, what the nature of that relationship might be.</em></p><p>Soc. I believe the custom is for me to ask the questions, sport.</p><p>Vox. Humor me.</p><p>Soc. (squeezes bicep)  Thundering Zeus, you must work out a lot.  Um, you were saying?</p><p>Vox. I was asking you about the nature of our relations with the gods.  But speaking of Zeus, would it be correct to say that Zeus might love a woman?</p><p>Soc. I am given to understand that he is most indiscriminate in this regard.</p><p>Vox. And would it likewise be correct to state that Zeus could also love a man?</p><p>Soc. Mount Olympos would be short one smashing young cup-bearer if he could not.</p><p>Vox. And is the Thunderer’s love limited to these carnal desires, or is he also capable of loving men and women in a platonic sense as well?</p><p>Soc. I should say he has been known to love those with whom he has no physical relations.</p><p>Vox. Tell me, Socrates, could that platonic love be said to stretch so far as to include all humanity?</p><p>Soc. I think it must, else he would surely have allowed Deucalion and Pyrrha to drown rather than cause the waters to recede and give them safe landing on Mount Parnossos.  Moreover, he did ultimately free Prometheus once his ire over the fire had passed.</p><p>Vox. I would not dream of disputing your conclusion, Socrates.  As for Aphrodite, does she love humanity any less than the Thunderer?</p><p>Soc. Surely you jest!  Is she not the Goddess of Love?</p><p>Vox. But what of her red-handed lover, Ares?  He glories in chaos<br> and war, surely he must hate humanity to bring such terrible suffering upon it?</br></p><p>Soc. Ah, but there you are wrong, my muscular young friend!  Ares loves mankind most of all, for without it he would have no plaything.  Does not a child love his toys?</p><p>Vox. Yes, to be sure.</p><p>Soc. Then so too does Ares love Man.</p><p>Vox. Thank you, Socrates, I see now the limits of my imagination.  As for Athena, we know well that she loves the Athenians.  But what of the rest of humanity?  Did she not hate the Trojans?  And what of the Lacedaemonians, whose arms caused the Long Walls to fall?</p><p>Soc. You are confusing anger at a specific offense with a general disdain for humanity.  The grey-eyed one would have harbored no ill will for either Troy or Sparta had they only shown her proper reverence.  Consider how she granted her favor to all the Hellenes, even the Spartans, at Ilium.  Nor did she spurn the Syracusans, even when the Athenian forces were shattered against their walls.</p><p>Vox. You are wise even beyond your many years, Socrates.  But surely Artemis, who loathes all men so much that she is known to hunt them, cannot be said to love humanity, but rather, to despise it!</p><p>Soc. Do you believe that men and women are a different species?  Her loathing for men is but a reflection of her sexual sociopathy, and without men, there would be no women for her to love.  As for her predilection for the chase, would you say that the hunter hates the deer her pursues?</p><p>Vox. I stand corrected, Socrates.  But then, are there no gods that can be said to hate humanity?</p><p>Soc. Certainly not, or mortal man would perish before the force of an undying Olympian hatred, even were that god to act alone.  Not even Zeus and Apollo could spare Troy from the wrath of Athena, Hera and Poseidon, you may recall.  And those the gods hate, they destroy, as you may witness by the Titans imprisoned to this day in Tartarus.</p><p>Vox. So then, you would say that the gods love humanity.</p><p>Soc. Yes.</p><p>Vox. All the gods.</p><p>Soc. Yes, that is the point I have been endeavoring to eventually lead you towards.  I must say, you are a bit slow at times.</p><p>Vox. I seem to recall hearing that before.  But thank you, Socrates, you are most patient and kind.  So then, as I have heard that with the assistance of Euthyphro, you have defined “the pious and holy” as “that which all the gods love”, may we therefore conclude that humanity is pious?</p><p>Soc. I should say we must.</p><p>Vox. And holy?</p><p>Soc. Indubitably.</p><p>Vox. And that every man and woman comprises a part of that humanity?</p><p>Soc. That is so, is it not?</p><p>Vox. I, too, am given to understand that, Socrates.  So then, must we not conclude that every man and woman are pious and holy and loved by the gods?</p><p>Soc.  It is certain, we must.</p><p>Vox.  Including you and me?</p><p>Soc.  Was there ever a doubt of it?  Now, may I buy you a cup of wine?</p><p>Vox.  Indeed you may, my learned friend.  Let us drink to knowledge and our hopes of enjoying continued Divine favor.</p><p>Of course, it is as pointless to “prove” that every man is pious as it is to “prove” that the pious is wholly defined as being loved by all the gods.  The ability to construct a tautological trap does not serve as proof of anything; in my dialogue the weak point is the agreement that that which applies to collective humanity transitively applies to an individual human, but this is still a much more defensible concept than several of the agreements in Euthyphro.</p><p>In his questioning, Socrates is constantly guiding Euthyphro towards the tautological trap, the form of which is perhaps more obvious in my stripped-down version of it.  But since Socrates’ narrowed definition is as arbitrary as any that anyone else might devise, and since it manifestly fails to cover the vast majority of things that we are informed, beyond any shadow of a doubt, that the Greek gods loved, Eutyhphro’s “dilemma” is more an exercise in rhetorical manipulation than a genuine philosophical challenge.</p><p>I hope you will note that there was no need to resort to anything particularly religious, let alone Christian, in dismissing the “dilemma”, which cannot reasonably be applied to Christianity in the first place.  And if you do not find this dismissal of Euthyphro to be convincing, please let me know why.  As always, if I have made any errors, I invite everyone to point them out and shall certainly endeavor to correct them.</p></div>",
  "content_text": "Yesterday\nin the first part\nof our look at the applicability of Plato’s Euthyphro and the dilemma it supposedly poses to Christian claims about morality and its divine source, we concluded three things:\n1.  The Euthyphro “dilemma” is defeated by shifting the focus from “the pious” to “obedience”, therefore it is an inappropriate criticism of Christian morality.\n2.  The dilemma relies upon the false assumption that a fixed variable cannot be arbitrarily fixed.\n3.  The section about disagreement between gods regarding the pious and impious does not apply to a monotheistic god or a Supreme polytheistic God who rules over the other gods and defines their morality for them.\nNote that no one, either here or on any other blog, has taken exception to any of these conclusions.  Personally, I find it rather damning that atheists who are so quick to boast of their supposed intelligence and superior educations will only dare to leap in and criticize a short and obvious response to someone else’s question; when I write a lengthy post asserting my ability to prove the flawed nature of one of Mankind’s great philosophical dilemmas, there is only silence.\nThis is particularly strange considering the accusations that I am “stupid”, even “mindless”.  But is my logic truly “laughable”?  Is it not a simple matter for such intelligent and well-educated people to pick apart my reasoning?  Or is it merely that they are afraid to find themselves in the position of being forced to confess that I might actually be capable of legitimately challenging some of Mankind’s greatest philosophers?\nIn any event, we have reached the weak point in Socrates’ argument, where he reveals the devious, intellectually dishonest aspect of his character:\nSoc. There was a notion that came into my mind while you were speaking; I said to myself: “Well, and what if Euthyphro does prove to me that all the gods regarded the death of the serf as unjust, how do I know anything more of the nature of piety and impiety? for granting that this action may be hateful to the gods, still piety and impiety are not adequately defined by these distinctions, for that which is hateful to the gods has been shown to be also pleasing and dear to them.” And therefore, Euthyphro, I do not ask you to prove this; I will suppose, if you like, that all the gods condemn and abominate such an action. But I will amend the definition so far as to say that what all the gods hate is impious, and what they love pious or holy; and what some of them love and others hate is both or neither. Shall this be our definition of piety and impiety?\nEuth. Why not, Socrates?\nSoc. Why not! certainly, as far as I am concerned, Euthyphro, there is no reason why not. But whether this admission will greatly assist you in the task of instructing me as you promised, is a matter for you to consider.\nEuth. Yes, I should say that what all the gods love is pious and holy, and the opposite which they all hate, impious.\nIn order to narrow the definition for his egalitarian polytheist environment, Socrates first removes all individual preferences from the gods.  This means that war cannot be pious and holy even though Ares and Athena love it since Aphrodite objects, while happiness and love cannot be either if grim Hades takes exception to it.  This means that Plato’s definition of what is pious must be a vastly reduced subset of what any one particular god loves.\nSo, the idea of “the pious and the holy” being equated with what the Christian God loves is bait-and-switch even as Socrates and Euthyprho have defined the term.  Whether we define piety or Socrates and Euthyphro do, in either case it cannot be applied to the Christian God.\nMore importantly, the equation of “pious” with “what all the gods love” is an entirely arbitrary assignation by Socrates, who even admits that he is “amending the definition”.  To use one famous counterexample, David was loved by God although his actions in seducing Bathsheba and murdering Uriah were notoriously impious by our definition (obedience to God’s Will) or by Socrates’ definition (that which all the gods love).  Either God ceased to love David, which we are informed was not the case, or Socrates’ amended definition is merely a subset of “the pious and holy”.\nNow, the “dilemma” is that one cannot logically define “the pious and holy” in a circular manner, since that would not be a definition but rather a tautology.  “Is the pious loved by the gods because it is pious, or is it pious because it is loved by the gods?”  But now that we recognize how Socrates has twice artificially narrowed the definition of “the pious”, all that is necessary to destroy the dilemma is to show that there is a reasonable definition of “loved by the gods” that is not defined by the narrowed definition of “the pious”.\nSoc. And what do you say of piety, Euthyphro: is not piety, according to your definition, loved by all the gods?\nEuth. Yes.\nSoc. Because it is pious or holy, or for some other reason?\nEuth. No, that is the reason.\nSoc. It is loved because it is holy, not holy because it is loved?\nEuth. Yes.\nSoc. And that which is dear to the gods is loved by them, and is in a state to be loved of them because it is loved of them?\nEuth. Certainly.\nAt no point does Socrates convincingly limit “what is loved by the gods” to “the pious”.  Nor is it difficult to cite particular godly loves that were not limited to “the pious”.  Zeus was reputed to fall in love on a regular basis, this love obviously fell outside Socrates’ narrow definition since Hera, being a jealous god, often took vengeance upon the Thunderer’s unfortunate beloveds.  Poseidon  and Athena hated Troy, while Ares and Aphrodite fought for the Trojans.\nThis is all quite applicable to the Christian dismissal of Euthyphro, but in order to smash the last remaining shards of the philosophical “dilemma” on its own terms, we must still find something that “all the gods love” which cannot reasonably be described as “the pious”.  Therefore, I propose the following dialogue with Socrates.\nVox. My dear friend Socrates, do inform me, so that I might better understand the nature of man’s proper relation with the gods, what the nature of that relationship might be.\nSoc. I believe the custom is for me to ask the questions, sport.\nVox. Humor me.\nSoc. (squeezes bicep)  Thundering Zeus, you must work out a lot.  Um, you were saying?\nVox. I was asking you about the nature of our relations with the gods.  But speaking of Zeus, would it be correct to say that Zeus might love a woman?\nSoc. I am given to understand that he is most indiscriminate in this regard.\nVox. And would it likewise be correct to state that Zeus could also love a man?\nSoc. Mount Olympos would be short one smashing young cup-bearer if he could not.\nVox. And is the Thunderer’s love limited to these carnal desires, or is he also capable of loving men and women in a platonic sense as well?\nSoc. I should say he has been known to love those with whom he has no physical relations.\nVox. Tell me, Socrates, could that platonic love be said to stretch so far as to include all humanity?\nSoc. I think it must, else he would surely have allowed Deucalion and Pyrrha to drown rather than cause the waters to recede and give them safe landing on Mount Parnossos.  Moreover, he did ultimately free Prometheus once his ire over the fire had passed.\nVox. I would not dream of disputing your conclusion, Socrates.  As for Aphrodite, does she love humanity any less than the Thunderer?\nSoc. Surely you jest!  Is she not the Goddess of Love?\nVox. But what of her red-handed lover, Ares?  He glories in chaos\nand war, surely he must hate humanity to bring such terrible suffering upon it?\nSoc. Ah, but there you are wrong, my muscular young friend!  Ares loves mankind most of all, for without it he would have no plaything.  Does not a child love his toys?\nVox. Yes, to be sure.\nSoc. Then so too does Ares love Man.\nVox. Thank you, Socrates, I see now the limits of my imagination.  As for Athena, we know well that she loves the Athenians.  But what of the rest of humanity?  Did she not hate the Trojans?  And what of the Lacedaemonians, whose arms caused the Long Walls to fall?\nSoc. You are confusing anger at a specific offense with a general disdain for humanity.  The grey-eyed one would have harbored no ill will for either Troy or Sparta had they only shown her proper reverence.  Consider how she granted her favor to all the Hellenes, even the Spartans, at Ilium.  Nor did she spurn the Syracusans, even when the Athenian forces were shattered against their walls.\nVox. You are wise even beyond your many years, Socrates.  But surely Artemis, who loathes all men so much that she is known to hunt them, cannot be said to love humanity, but rather, to despise it!\nSoc. Do you believe that men and women are a different species?  Her loathing for men is but a reflection of her sexual sociopathy, and without men, there would be no women for her to love.  As for her predilection for the chase, would you say that the hunter hates the deer her pursues?\nVox. I stand corrected, Socrates.  But then, are there no gods that can be said to hate humanity?\nSoc. Certainly not, or mortal man would perish before the force of an undying Olympian hatred, even were that god to act alone.  Not even Zeus and Apollo could spare Troy from the wrath of Athena, Hera and Poseidon, you may recall.  And those the gods hate, they destroy, as you may witness by the Titans imprisoned to this day in Tartarus.\nVox. So then, you would say that the gods love humanity.\nSoc. Yes.\nVox. All the gods.\nSoc. Yes, that is the point I have been endeavoring to eventually lead you towards.  I must say, you are a bit slow at times.\nVox. I seem to recall hearing that before.  But thank you, Socrates, you are most patient and kind.  So then, as I have heard that with the assistance of Euthyphro, you have defined “the pious and holy” as “that which all the gods love”, may we therefore conclude that humanity is pious?\nSoc. I should say we must.\nVox. And holy?\nSoc. Indubitably.\nVox. And that every man and woman comprises a part of that humanity?\nSoc. That is so, is it not?\nVox. I, too, am given to understand that, Socrates.  So then, must we not conclude that every man and woman are pious and holy and loved by the gods?\nSoc.  It is certain, we must.\nVox.  Including you and me?\nSoc.  Was there ever a doubt of it?  Now, may I buy you a cup of wine?\nVox.  Indeed you may, my learned friend.  Let us drink to knowledge and our hopes of enjoying continued Divine favor.\nOf course, it is as pointless to “prove” that every man is pious as it is to “prove” that the pious is wholly defined as being loved by all the gods.  The ability to construct a tautological trap does not serve as proof of anything; in my dialogue the weak point is the agreement that that which applies to collective humanity transitively applies to an individual human, but this is still a much more defensible concept than several of the agreements in Euthyphro.\nIn his questioning, Socrates is constantly guiding Euthyphro towards the tautological trap, the form of which is perhaps more obvious in my stripped-down version of it.  But since Socrates’ narrowed definition is as arbitrary as any that anyone else might devise, and since it manifestly fails to cover the vast majority of things that we are informed, beyond any shadow of a doubt, that the Greek gods loved, Eutyhphro’s “dilemma” is more an exercise in rhetorical manipulation than a genuine philosophical challenge.\nI hope you will note that there was no need to resort to anything particularly religious, let alone Christian, in dismissing the “dilemma”, which cannot reasonably be applied to Christianity in the first place.  And if you do not find this dismissal of Euthyphro to be convincing, please let me know why.  As always, if I have made any errors, I invite everyone to point them out and shall certainly endeavor to correct them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-15T11:58:00+00:00"
}