{
  "url": "https://voxday.net/2007/02/16/false-outrage-of-hypocrite/",
  "scraped_at": "2026-01-08T21:32:10.548496",
  "title": "The False Outrage of the Hypocrite",
  "date_display": "February 16, 2007",
  "date_iso": "2007-02-16T19:56:00+00:00",
  "date_from_url": "2007-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Before Pharyngurl wrote this:</p><blockquote><p>Charming. Good Christian Vox Day argues that <a href=\"http://scienceblogs.com/pharyngula/2007/02/and_they_call_us_atheists_amor.php\">murdering toddlers in the name of Jesus is defensible</a>.</p></blockquote><p>He wrote this:</p><blockquote><p>I’m in favor of voluntary late term abortions (where premature birth would impose severe economic hardship, for instance), and can even consider situations where <a href=\"http://pharyngula.org/index/weblog/comments/when_women_ask_whats_on_my_mind_i_cannot_resist/\">infanticide is ethically tenable</a>.</p><p>This is not a black and white issue….  That’s why I say infanticide can be considered in some situations, but not all — an anencephalic child, for instance, should be humanely euthanized without a qualm.</p></blockquote><p>Apparently Pharyngurl was upset over the idea that I asserted the morality of obeying a nonexistent but hypothetically incontrovertible command of God to kill ALL the toddlers, not merely those he believes SHOULD be offed or can ethically be slaughtered.</p><p>Pleaes note that I, and to the best of my knowledge, God, stand OPPOSED to the murder of children.  (As the brighter and more intellectually honest atheists recognized, I was merely providing a logical response to the theoretical situation proposed by Jefferson.)  The good atheist Pharyngurl, on the other hand, believes that child murder is not only POTENTIALLY ETHICAL, but is actually the MORAL IMPERATIVE in some situations.</p><p>So, it seems that it’s okay for Pharyngurl to decide who lives and dies, but not the Creator God.  (Pharyngurl is a scientist, you see, so all that ethical training he received in obtaining his holy sheepskin justifies his exercise of the high justice.)  Unlike Satan, Pharyngurl is not merely content to make himself like the Most High, he asserts his superiority to God even in the hypothetical context wherein it is proposed that God exists and rules supreme over His Creation.</p><p>And some of you worry about the arbitrary nature of a morality defined by that Creator God?  Do you truly believe that six billion competing arbitrary moralities expounded by irrational and inconsistent individuals drunk on their half-baked educations are likely to provide superior results?</p><p>By the way, I’m still waiting for those legions of intelligent, educated atheists who were previously name-dropping Euthyphro to provide any criticism, let alone refutation, of my dismissal of that so-called dilemma.</p><p>UPDATE: Tom Foss disingenously claims that Pharyngurl hasn’t exposed his characteristic hypocrisy: <em>“So we’re back to the “PZ is a hypocrite because he’s pro-abortion AND pro-euthanasia, but not pro-God-mandated slaughter of innocent healthy babies” argument? Yeah, Parakeet, that’s right. No one refuted that, not a hundred and fifty posts ago.”</em></p><p>No, PZ is a blatant hypocrite because he is not only pro-abortion and pro-euthanasia, but also explicitly pro-INFANTICIDE as long as INFANTICIDE is not proven conclusively to be God-mandated.  No one has refuted that, not a hundred and fifty posts ago and not now, because it is irrefutable.  And Tom himself well knows this, which is why he avoided using the word that Pharyngurl himself used, namely, INFANTICIDE.</p></div>",
  "content_text": "Before Pharyngurl wrote this:\nCharming. Good Christian Vox Day argues that\nmurdering toddlers in the name of Jesus is defensible\n.\nHe wrote this:\nI’m in favor of voluntary late term abortions (where premature birth would impose severe economic hardship, for instance), and can even consider situations where\ninfanticide is ethically tenable\n.\nThis is not a black and white issue….  That’s why I say infanticide can be considered in some situations, but not all — an anencephalic child, for instance, should be humanely euthanized without a qualm.\nApparently Pharyngurl was upset over the idea that I asserted the morality of obeying a nonexistent but hypothetically incontrovertible command of God to kill ALL the toddlers, not merely those he believes SHOULD be offed or can ethically be slaughtered.\nPleaes note that I, and to the best of my knowledge, God, stand OPPOSED to the murder of children.  (As the brighter and more intellectually honest atheists recognized, I was merely providing a logical response to the theoretical situation proposed by Jefferson.)  The good atheist Pharyngurl, on the other hand, believes that child murder is not only POTENTIALLY ETHICAL, but is actually the MORAL IMPERATIVE in some situations.\nSo, it seems that it’s okay for Pharyngurl to decide who lives and dies, but not the Creator God.  (Pharyngurl is a scientist, you see, so all that ethical training he received in obtaining his holy sheepskin justifies his exercise of the high justice.)  Unlike Satan, Pharyngurl is not merely content to make himself like the Most High, he asserts his superiority to God even in the hypothetical context wherein it is proposed that God exists and rules supreme over His Creation.\nAnd some of you worry about the arbitrary nature of a morality defined by that Creator God?  Do you truly believe that six billion competing arbitrary moralities expounded by irrational and inconsistent individuals drunk on their half-baked educations are likely to provide superior results?\nBy the way, I’m still waiting for those legions of intelligent, educated atheists who were previously name-dropping Euthyphro to provide any criticism, let alone refutation, of my dismissal of that so-called dilemma.\nUPDATE: Tom Foss disingenously claims that Pharyngurl hasn’t exposed his characteristic hypocrisy:\n“So we’re back to the “PZ is a hypocrite because he’s pro-abortion AND pro-euthanasia, but not pro-God-mandated slaughter of innocent healthy babies” argument? Yeah, Parakeet, that’s right. No one refuted that, not a hundred and fifty posts ago.”\nNo, PZ is a blatant hypocrite because he is not only pro-abortion and pro-euthanasia, but also explicitly pro-INFANTICIDE as long as INFANTICIDE is not proven conclusively to be God-mandated.  No one has refuted that, not a hundred and fifty posts ago and not now, because it is irrefutable.  And Tom himself well knows this, which is why he avoided using the word that Pharyngurl himself used, namely, INFANTICIDE.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-16T19:56:00+00:00"
}