{
  "url": "https://voxday.net/2007/02/26/home-of-atheidio/",
  "scraped_at": "2026-01-08T21:33:04.908056",
  "title": "Home of the Atheidiot",
  "date_display": "February 26, 2007",
  "date_iso": "2007-02-26T17:40:00+00:00",
  "date_from_url": "2007-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The godless commenters at Pharyngurl’s are almost as irrational as they are <a href=\"http://scienceblogs.com/pharyngula/2007/02/the_false_equation.php#more\">breathtakingly ignorant</a>:</p><blockquote><p>They’re afraid that you’re going to do to them what they did to you and to anyone who didn’t think EXACTLY like them.</p><p>They’re afraid that once the atheists take over, religion will be banned and its practitioners rounded up, jailed and persecuted — and they will point to Russia and China and other allegedly atheistic states to prove that this will happen. Never mind that both Russia and China’s respective traditions of unbelievable violence (much of it religious violence) and lack of a post-feudal history made their experience somewhat different from, say, Sweden’s or Cuba’s.</p></blockquote><p>Yes, those ALLEDGEDLY ATHEIST states like the Soviet Union, China, the Democratic Republic of Kampuchea, North Korea, the First French Republic etc.  What was Korea’s history of “unbelievable violence” and why do the massacres – of religious people – only seem to be occurring in OFFICIALLY ATHEIST North Korea instead of religious South Korea?</p><p>This atheidiot clearly doesn’t know that “atheist” Sweden had a state Lutheran church until 2000.  Even today, only 23 percent of Swedes believe that there is not “any sort of spirit, god, or life force”.  That’s why Sweden is only dying out instead of actively killing itself.</p><p>Clearly she also doesn’t realize that the Cuban regime is a totalitarian and murderous one, even if it hasn’t racked up the usual quantities of atheist-ordered deaths.</p><p>It is always amusing how atheists desperately attempt to sweep away their murderous track record, which is much worse than Islam, as a far smaller number of atheist regimes have racked up a far greater number of killings in a far shorter period of time.  One of these days, I’m going to have to break down the relative lethality of various governments according to religion, as measured in government-ordered murders/year.</p><p>Another atheidiot demonstrates his cluelessness thusly: <em>“Oh, and suicide bombers seem to be nonexistent among atheists.”</em></p><p>Well, except for the secular, Marxist, Liberation Tigers of Tamil Eelam, who practically invented the concept and were the leading practitioners of it until surpassed by the Islamic militants.</p><p>And, of course, at the heart is PZ, the ignorant educator and part-time mass psychologist, who states: <em>“I think you’re right, Cyde Ways, and that’s why we have to continue to open our loud mouths and fight against religion.  The word you’re missing, Phoenix Woman, is “projection”. They’re afraid that if we took over, we’d do to them what they’d like to do to us.”</em></p><p>But these atheidiots constantly complain that theists are in charge.  And yet no one is doing anything to them.  Nor is anyone even calling for atheists to be treated the way atheists are treating religious believers in North Korea and China today.</p><p>Now, any reasonable person would have to conclude that it is obvious this is because theists have no desire to kill atheists – and why should we, when we understand they will all be deservedly burning in Hell soon enough – so therefore, the logical conclusion is that only projection taking place is that regarding atheist fears of <b>precisely that which istory strongly suggests they will do to theists if they manage to take power here!</b></p><p>Someone obviously could have used a few more history classes… and yet they claim to be the educated ones.</p><p>As for reasonable atheists who aren’t ignorant lunatics like these, but simply don’t believe in the existence of God or the supernatural… please don’t whine.  Your fellow atheists are the ones openly declaring war on religion and talking about fighting religion and religious people.</p><p>One final note: no one really cares WHY atheists in power possess such a strong predilection for killing large quantities of people.  Whether they do it “in the name” of Karl Marx, the Flying Spaghetti Monster or the Great Nothing, the salient point is that they can be reliably expected to do it.</p></div>",
  "content_text": "The godless commenters at Pharyngurl’s are almost as irrational as they are\nbreathtakingly ignorant\n:\nThey’re afraid that you’re going to do to them what they did to you and to anyone who didn’t think EXACTLY like them.\nThey’re afraid that once the atheists take over, religion will be banned and its practitioners rounded up, jailed and persecuted — and they will point to Russia and China and other allegedly atheistic states to prove that this will happen. Never mind that both Russia and China’s respective traditions of unbelievable violence (much of it religious violence) and lack of a post-feudal history made their experience somewhat different from, say, Sweden’s or Cuba’s.\nYes, those ALLEDGEDLY ATHEIST states like the Soviet Union, China, the Democratic Republic of Kampuchea, North Korea, the First French Republic etc.  What was Korea’s history of “unbelievable violence” and why do the massacres – of religious people – only seem to be occurring in OFFICIALLY ATHEIST North Korea instead of religious South Korea?\nThis atheidiot clearly doesn’t know that “atheist” Sweden had a state Lutheran church until 2000.  Even today, only 23 percent of Swedes believe that there is not “any sort of spirit, god, or life force”.  That’s why Sweden is only dying out instead of actively killing itself.\nClearly she also doesn’t realize that the Cuban regime is a totalitarian and murderous one, even if it hasn’t racked up the usual quantities of atheist-ordered deaths.\nIt is always amusing how atheists desperately attempt to sweep away their murderous track record, which is much worse than Islam, as a far smaller number of atheist regimes have racked up a far greater number of killings in a far shorter period of time.  One of these days, I’m going to have to break down the relative lethality of various governments according to religion, as measured in government-ordered murders/year.\nAnother atheidiot demonstrates his cluelessness thusly:\n“Oh, and suicide bombers seem to be nonexistent among atheists.”\nWell, except for the secular, Marxist, Liberation Tigers of Tamil Eelam, who practically invented the concept and were the leading practitioners of it until surpassed by the Islamic militants.\nAnd, of course, at the heart is PZ, the ignorant educator and part-time mass psychologist, who states:\n“I think you’re right, Cyde Ways, and that’s why we have to continue to open our loud mouths and fight against religion.  The word you’re missing, Phoenix Woman, is “projection”. They’re afraid that if we took over, we’d do to them what they’d like to do to us.”\nBut these atheidiots constantly complain that theists are in charge.  And yet no one is doing anything to them.  Nor is anyone even calling for atheists to be treated the way atheists are treating religious believers in North Korea and China today.\nNow, any reasonable person would have to conclude that it is obvious this is because theists have no desire to kill atheists – and why should we, when we understand they will all be deservedly burning in Hell soon enough – so therefore, the logical conclusion is that only projection taking place is that regarding atheist fears of\nprecisely that which istory strongly suggests they will do to theists if they manage to take power here!\nSomeone obviously could have used a few more history classes… and yet they claim to be the educated ones.\nAs for reasonable atheists who aren’t ignorant lunatics like these, but simply don’t believe in the existence of God or the supernatural… please don’t whine.  Your fellow atheists are the ones openly declaring war on religion and talking about fighting religion and religious people.\nOne final note: no one really cares WHY atheists in power possess such a strong predilection for killing large quantities of people.  Whether they do it “in the name” of Karl Marx, the Flying Spaghetti Monster or the Great Nothing, the salient point is that they can be reliably expected to do it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-26T17:40:00+00:00"
}