{
  "url": "https://voxday.net/2007/02/07/john-edwards-cum-guzzler/",
  "scraped_at": "2026-01-08T21:30:54.347974",
  "title": "John Edwards’ cum-guzzler",
  "date_display": "February 7, 2007",
  "date_iso": "2007-02-07T17:38:00+00:00",
  "date_from_url": "2007-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those familiar with Cthulhu’s Coven know very well why <a href=\"http://www.nytimes.com/2007/02/07/us/politics/07edwards.html?_r=3&amp;oref=slogin&amp;oref=slogin&amp;oref=slogin\">John Edwards might want to keep Ms Marcotte around</a>:</p><blockquote><p>The Catholic League, a conservative religious group, is demanding that Mr. Edwards dismiss the two, Amanda Marcotte of the Pandagon blog site and Melissa McEwan, who writes on her blog, Shakespeare’s Sister, for expressing anti-Catholic opinions.</p><p>Mr. Edwards, a former North Carolina senator, is among the leading Democratic presidential candidates.</p><p>Bill Donohue, president of the Catholic League, said in a statement on Tuesday, “John Edwards is a decent man who has had his campaign tarnished by two anti-Catholic vulgar trash-talking bigots.”</p><p>Mr. Edwards’s spokeswoman, Jennifer Palmieri, said Tuesday night that the campaign was weighing the fate of the two bloggers.</p></blockquote><p>And it’s back to the bureacracy for everyone’s favorite “<a href=\"http://pandagon.net/2005/09/03/dear-racist-fucks-who-complained-about-looting/\">cum-guzzling boozehound</a>“, as she described herself in the comments to her post dedicated to “racist fucks who complained about looting”.  The fate of the two raging feminists is surely settled already, it’s likely only the manner of the dismissal that is left to be determined.</p><p>Perhaps Amynda can announce that she is retiring from the Edwards campaign in order to spend more time with her abortions.</p><p>By the way, how is Edwards “among the leading Democratic presidential candidates”?  If you’ve got less than half the support of the front runner, you’re just another member of the pack.</p><p>The most amusing thing about this “scandal” is the way in which Amynda’s pretensions to being a keen political analyst have been exposed as being as empty as her core ideology.  I mean, <a href=\"http://www.milobookclub.com/2007/01/31/and-lizard-queen-smiled/\">how hard is it to understand</a> that you simply cannot speak or write in a controversial manner and expect to be allowed to play in the world of superficial public impressions, when the most successful political commentators of our time, Ann Coulter and Rush Limbaugh, were bounced from National Review and ESPN?</p></div>",
  "content_text": "Those familiar with Cthulhu’s Coven know very well why\nJohn Edwards might want to keep Ms Marcotte around\n:\nThe Catholic League, a conservative religious group, is demanding that Mr. Edwards dismiss the two, Amanda Marcotte of the Pandagon blog site and Melissa McEwan, who writes on her blog, Shakespeare’s Sister, for expressing anti-Catholic opinions.\nMr. Edwards, a former North Carolina senator, is among the leading Democratic presidential candidates.\nBill Donohue, president of the Catholic League, said in a statement on Tuesday, “John Edwards is a decent man who has had his campaign tarnished by two anti-Catholic vulgar trash-talking bigots.”\nMr. Edwards’s spokeswoman, Jennifer Palmieri, said Tuesday night that the campaign was weighing the fate of the two bloggers.\nAnd it’s back to the bureacracy for everyone’s favorite “\ncum-guzzling boozehound\n“, as she described herself in the comments to her post dedicated to “racist fucks who complained about looting”.  The fate of the two raging feminists is surely settled already, it’s likely only the manner of the dismissal that is left to be determined.\nPerhaps Amynda can announce that she is retiring from the Edwards campaign in order to spend more time with her abortions.\nBy the way, how is Edwards “among the leading Democratic presidential candidates”?  If you’ve got less than half the support of the front runner, you’re just another member of the pack.\nThe most amusing thing about this “scandal” is the way in which Amynda’s pretensions to being a keen political analyst have been exposed as being as empty as her core ideology.  I mean,\nhow hard is it to understand\nthat you simply cannot speak or write in a controversial manner and expect to be allowed to play in the world of superficial public impressions, when the most successful political commentators of our time, Ann Coulter and Rush Limbaugh, were bounced from National Review and ESPN?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-07T17:38:00+00:00"
}