{
  "url": "https://voxday.net/2007/02/06/keith-olbermann-exposed/",
  "scraped_at": "2026-01-08T21:30:45.200592",
  "title": "Keith Olbermann exposed",
  "date_display": "February 6, 2007",
  "date_iso": "2007-02-06T12:04:00+00:00",
  "date_from_url": "2007-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I quite enjoyed Keith Olbermann and Dan Patrick back in the Golden Age of ESPN, <a href=\"http://www.olbermannwatch.com/archives/2007/02/levin_on_olberm_3.php\">Olbermann really should have stuck to sports</a>.  Bane points us to Mark Levin’s methodical exposure of Olbermann as a truly pathetic excuse for a human being.  I particularly liked the stories about Olbermann’s hiding under his desk prior to going on air and the way  he made up an excuse about a relative dying in order to get out of a second date with a woman he’d flown to New York before suffering another form of performance anxiety.</p><p>The beatdown is neither the most brutal nor the most intellectual I’ve ever heard, but it’s mostly public information, and anyway, there just isn’t much intellectual substance to attack when you’re dealing with lightweights like Olbermann.  Credit to Levin for hitting back like Ann Coulter instead of re-enacting Michelle Malkin’s gaping goldfish impression on Hardball.</p><p>In case one doubts the severe lack of intellectual depth possessed by the left’s brightest media stars, consider the way in which both Amynda and Keith Olbermann are apparently unaware of the fact that emails and blog posts don’t actually disappear into the aether.</p></div>",
  "content_text": "While I quite enjoyed Keith Olbermann and Dan Patrick back in the Golden Age of ESPN,\nOlbermann really should have stuck to sports\n.  Bane points us to Mark Levin’s methodical exposure of Olbermann as a truly pathetic excuse for a human being.  I particularly liked the stories about Olbermann’s hiding under his desk prior to going on air and the way  he made up an excuse about a relative dying in order to get out of a second date with a woman he’d flown to New York before suffering another form of performance anxiety.\nThe beatdown is neither the most brutal nor the most intellectual I’ve ever heard, but it’s mostly public information, and anyway, there just isn’t much intellectual substance to attack when you’re dealing with lightweights like Olbermann.  Credit to Levin for hitting back like Ann Coulter instead of re-enacting Michelle Malkin’s gaping goldfish impression on Hardball.\nIn case one doubts the severe lack of intellectual depth possessed by the left’s brightest media stars, consider the way in which both Amynda and Keith Olbermann are apparently unaware of the fact that emails and blog posts don’t actually disappear into the aether.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-06T12:04:00+00:00"
}