{
  "url": "https://voxday.net/2007/02/02/someone-has-sense-of-humor/",
  "scraped_at": "2026-01-08T21:30:24.948278",
  "title": "SOMEONE has a sense of humor",
  "date_display": "February 2, 2007",
  "date_iso": "2007-02-02T21:32:00+00:00",
  "date_from_url": "2007-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First Amynda implodes, now Pharyngurl is, in his inimitable style, leaping about and f<a href=\"http://scienceblogs.com/pharyngula/2007/01/will_scott_adams_never_learn.php?utm_source=mostactive&amp;utm_medium=link\">linging his stinking emissions at Scott Adams</a>.  Never one to worry about making sense, he’s now accusing the creator of Dilbert of having “a piss-poor sense of humor”.</p><p>One wonders what he’ll do for an encore, assert that Bill Gates isn’t rich?  That Michael Medved isn’t gay?  That Big Chilly is not a sex machine to all the chicks?  What Amynda and Pharyngurl have in common, besides their tendency towards foam-flecked rhetoric, is their combination of demonstrable ignorance with ad hominum-oriented arrogance.  Neither of them is anywhere nearly as bright as they appear to believe, and both of them are apparently foolish enough to believe their own hype.</p><p>I mean, Pharyngurl’s a professor, so he must be highly intelligent, right?  But he’s a professor at <i>Minnesota freaking Morris</i>!  I grew up in Minnesota and let’s just put it this way, Minnesota-Morris is not exactly a fall-back school for kids applying to the Ivy League, or the MIAC schools for that matter.  It’s basically a community college with a hockey team.</p><p>What neither Amynda nor Pharyngurl have every understood is that holding “correct” opinions is not necessarily a sign of intelligence, especially when those opinions can be demonstrated to be at least questionable.  A predilection for name-calling in the place of legitimate, logical argumentation is always the sign of a fourth-rate mind.</p></div>",
  "content_text": "First Amynda implodes, now Pharyngurl is, in his inimitable style, leaping about and f\nlinging his stinking emissions at Scott Adams\n.  Never one to worry about making sense, he’s now accusing the creator of Dilbert of having “a piss-poor sense of humor”.\nOne wonders what he’ll do for an encore, assert that Bill Gates isn’t rich?  That Michael Medved isn’t gay?  That Big Chilly is not a sex machine to all the chicks?  What Amynda and Pharyngurl have in common, besides their tendency towards foam-flecked rhetoric, is their combination of demonstrable ignorance with ad hominum-oriented arrogance.  Neither of them is anywhere nearly as bright as they appear to believe, and both of them are apparently foolish enough to believe their own hype.\nI mean, Pharyngurl’s a professor, so he must be highly intelligent, right?  But he’s a professor at\nMinnesota freaking Morris\n!  I grew up in Minnesota and let’s just put it this way, Minnesota-Morris is not exactly a fall-back school for kids applying to the Ivy League, or the MIAC schools for that matter.  It’s basically a community college with a hockey team.\nWhat neither Amynda nor Pharyngurl have every understood is that holding “correct” opinions is not necessarily a sign of intelligence, especially when those opinions can be demonstrated to be at least questionable.  A predilection for name-calling in the place of legitimate, logical argumentation is always the sign of a fourth-rate mind.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-02T21:32:00+00:00"
}