{
  "url": "https://voxday.net/2007/02/20/thats-not-hard-one/",
  "scraped_at": "2026-01-08T21:32:23.800615",
  "title": "That’s not a hard one",
  "date_display": "February 20, 2007",
  "date_iso": "2007-02-20T07:58:00+00:00",
  "date_from_url": "2007-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over at Brent Rasmussen’s site, <a href=\"http://brentrasmussen.com/log/node/1183\">Jim Downey has a hard time</a> understanding why most people would rather vote for a retarded Dachshund of questionable moral character and only three legs for President of the United States than a “generally well-qualified” atheist:</p><blockquote><p>Yup. Bottom of the list.  [Gallup Poll indicating 45 percent would vote for an atheist, 53 percent wouldn’t.]  Now, someone tell me again how we’re such a threat to the religious.</p></blockquote><p>I can give you three reasons right off the top of my head:</p><p>1.  Everyone knows an annoying, smarmy atheist who likes nothing better than to tell people how stupid they are for believing whatever it is they believe, almost always without being asked for his opinion.  Since most people believe in something weird and supernatural, whether it is the supposedly Christian Rapture or Tarot cards or that George Bush is the reincarnation of Adolf Hitler, this means that nearly everyone subconsciously equates “atheist” with “boorish asshole”.  And this reasonable conclusion is very well supported indeed by most atheist blogs as well as the behavior of the best-known public atheists.  At least the Jehovah’s Witnesses and Mormons are polite… even the Muslims are more respectful when they’re not occupied with beheading people.</p><p>2.  The world’s leading atheist has declared that providing religious instruction to children is akin to child abuse.  Since most normal people, religious or non-religious, are vaguely aware that children have been receiving religious education for the entirety of world history, hearing this sort of thing makes them more likely to support atheists being put into psychiatric care than into any position of political power.  Sweet Darwin, even Daniel C. Dennett confesses to fondly recalling his own childhood religious instruction!  But I’m sure a lot of kids scarred by their childhood beatings and molestations feel the same way… you can easily make a better case against public school.</p><p>3.  When it comes to mass slaughter, atheists are the Ted Williams of world history, batting .400 or thereabouts.  Not every officially atheist government has committed astounding quantities of murder, and certainly plenty of non-atheist governments have committed terrible atrocities, but despite the relatively small number of atheist governments recorded, they account for a disturbingly high percentage of history’s most lethal governments.  This pattern began with the very first atheist government, the Revolutionary French regime, and continues to this day in North Korea.  Atheists can bring up the No True Scotsman logical fallacy all they like but it’s no use; if Catholics had as reliably awful a track record, people would fear putting them in power too.  It’s not that atheists are a threat to the religious, they’re an obvious threat to everyone, including themselves.</p><p>Speaking of Catholics, the Gallup poll shows how completely out of touch this Downey gentleman is.  In an earlier post, he demonstrated that he didn’t understand the basic nature of <a href=\"http://brentrasmussen.com/log/node/1180\">the obvious need for Amynda’s resignation</a> from the Edwards’ campaign.  Perhaps this poll will help him understand that it is utterly impossible to go out of your way to intentionally insult what is apparently the least offensive large political bloc in the country and then expect to win an election.</p><p>Or perhaps it won’t.  Boorish assholes are usually boorish assholes because they are socially autistic and incapable of applying logic to interpersonal relations, not because they want to be hated.  If atheists don’t wish to be personally despised for their lack of belief, perhaps they should consider behaving more politely, or at least in a manner which is somewhat less despicable.</p><p>Atheists like to claim that Christians are atheists, we simply believe in one more god than they do.  (This is incorrect, of course, but we’ll leave it alone for now.)  If that’s so, then I don’t believe in nearly as many supernatural absurdities as the average atheist.  But unlike the average atheist, I don’t behave like a boorish asshole on a regular basis, telling every Shinto worshipper or astrology nut I encounter how stupid they are for believing such obvious nonsense.  If I am asked for my opinion of their particular lunacy, I will share it, otherwise I keep it to myself.</p><p>So do the vast majority of Christians.  And even when missions-oriented Christians do volunteer their opinion unsolicited, most people understand that the Christian is usually doing so out of concern for them, out of a desire, however misguided, to save them from a terrible future fate.  It’s hard to hate someone like that even if you think they’re completely crazy.  On the other hand, most people also realize that the atheist is only sharing his unsolicited opinion with them because he is a jerk and wishes to demonstrate his superior intelligence, not because he cares so deeply that they know The Truth as he understands it.</p><p>I mean, they want people to call them “brights”, for crying out loud.  Seriously.  Talk about social autism… why not simply have done with it and go for “super sex machines to all the chicks”.  That would at least have the benefit of being amusingly ironic instead of embarrasingly self-parodying.</p></div>",
  "content_text": "Over at Brent Rasmussen’s site,\nJim Downey has a hard time\nunderstanding why most people would rather vote for a retarded Dachshund of questionable moral character and only three legs for President of the United States than a “generally well-qualified” atheist:\nYup. Bottom of the list.  [Gallup Poll indicating 45 percent would vote for an atheist, 53 percent wouldn’t.]  Now, someone tell me again how we’re such a threat to the religious.\nI can give you three reasons right off the top of my head:\n1.  Everyone knows an annoying, smarmy atheist who likes nothing better than to tell people how stupid they are for believing whatever it is they believe, almost always without being asked for his opinion.  Since most people believe in something weird and supernatural, whether it is the supposedly Christian Rapture or Tarot cards or that George Bush is the reincarnation of Adolf Hitler, this means that nearly everyone subconsciously equates “atheist” with “boorish asshole”.  And this reasonable conclusion is very well supported indeed by most atheist blogs as well as the behavior of the best-known public atheists.  At least the Jehovah’s Witnesses and Mormons are polite… even the Muslims are more respectful when they’re not occupied with beheading people.\n2.  The world’s leading atheist has declared that providing religious instruction to children is akin to child abuse.  Since most normal people, religious or non-religious, are vaguely aware that children have been receiving religious education for the entirety of world history, hearing this sort of thing makes them more likely to support atheists being put into psychiatric care than into any position of political power.  Sweet Darwin, even Daniel C. Dennett confesses to fondly recalling his own childhood religious instruction!  But I’m sure a lot of kids scarred by their childhood beatings and molestations feel the same way… you can easily make a better case against public school.\n3.  When it comes to mass slaughter, atheists are the Ted Williams of world history, batting .400 or thereabouts.  Not every officially atheist government has committed astounding quantities of murder, and certainly plenty of non-atheist governments have committed terrible atrocities, but despite the relatively small number of atheist governments recorded, they account for a disturbingly high percentage of history’s most lethal governments.  This pattern began with the very first atheist government, the Revolutionary French regime, and continues to this day in North Korea.  Atheists can bring up the No True Scotsman logical fallacy all they like but it’s no use; if Catholics had as reliably awful a track record, people would fear putting them in power too.  It’s not that atheists are a threat to the religious, they’re an obvious threat to everyone, including themselves.\nSpeaking of Catholics, the Gallup poll shows how completely out of touch this Downey gentleman is.  In an earlier post, he demonstrated that he didn’t understand the basic nature of\nthe obvious need for Amynda’s resignation\nfrom the Edwards’ campaign.  Perhaps this poll will help him understand that it is utterly impossible to go out of your way to intentionally insult what is apparently the least offensive large political bloc in the country and then expect to win an election.\nOr perhaps it won’t.  Boorish assholes are usually boorish assholes because they are socially autistic and incapable of applying logic to interpersonal relations, not because they want to be hated.  If atheists don’t wish to be personally despised for their lack of belief, perhaps they should consider behaving more politely, or at least in a manner which is somewhat less despicable.\nAtheists like to claim that Christians are atheists, we simply believe in one more god than they do.  (This is incorrect, of course, but we’ll leave it alone for now.)  If that’s so, then I don’t believe in nearly as many supernatural absurdities as the average atheist.  But unlike the average atheist, I don’t behave like a boorish asshole on a regular basis, telling every Shinto worshipper or astrology nut I encounter how stupid they are for believing such obvious nonsense.  If I am asked for my opinion of their particular lunacy, I will share it, otherwise I keep it to myself.\nSo do the vast majority of Christians.  And even when missions-oriented Christians do volunteer their opinion unsolicited, most people understand that the Christian is usually doing so out of concern for them, out of a desire, however misguided, to save them from a terrible future fate.  It’s hard to hate someone like that even if you think they’re completely crazy.  On the other hand, most people also realize that the atheist is only sharing his unsolicited opinion with them because he is a jerk and wishes to demonstrate his superior intelligence, not because he cares so deeply that they know The Truth as he understands it.\nI mean, they want people to call them “brights”, for crying out loud.  Seriously.  Talk about social autism… why not simply have done with it and go for “super sex machines to all the chicks”.  That would at least have the benefit of being amusingly ironic instead of embarrasingly self-parodying.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-20T07:58:00+00:00"
}