{
  "url": "https://voxday.net/2007/02/15/they-call-themselves-brights/",
  "scraped_at": "2026-01-08T21:32:00.855429",
  "title": "They call themselves “brights”",
  "date_display": "February 15, 2007",
  "date_iso": "2007-02-15T11:55:00+00:00",
  "date_from_url": "2007-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The amusing thing is that while he won’t believe in a god, he does believe he <a href=\"http://jberlako.blogspot.com/2007/02/nice-try-cnn.html\">has a chance of successfully criticizing me</a>.  Needless to say, he makes exactly the same error that nearly every atheist <a href=\"http://www.brentrasmussen.com/log/node/1178\">except Brent Rasmussen has made</a>, that my statement of a perfectly logical conclusion is somehow tantamount to evidence of being on psychologically perilous grounds:</p><blockquote><p>“Are Atheists morally compromised?” Excuse me? Atheist don’t have to make excuses for priests that molest children, religious extremism, holy wars, or anything like that, but atheists are morally compromised?</p></blockquote><p>True.  Of course, neither do any non-Catholic Christians, Jews, Muslims are anyone else.  Furthermore, the number of child-molesting teachers, janitors, principals in the secular schools where religion is banned surpasses the number of child-molesting priests in both absolute and percentage terms.</p><p>As has been previously discussed, the number of holy wars is a very small percentage of all wars and atheists, despite their relatively short amount of time in power anywhere, are responsible for more fatalities than all of the holy wars of history combined.</p><p>So, yes, even by this atheist’s reckoning, there’s a very strong case to be made for the case that atheists are morally compromised, assuming that we first posit that the very concept of a “moral atheist” is not an oxymoron.</p></div>",
  "content_text": "The amusing thing is that while he won’t believe in a god, he does believe he\nhas a chance of successfully criticizing me\n.  Needless to say, he makes exactly the same error that nearly every atheist\nexcept Brent Rasmussen has made\n, that my statement of a perfectly logical conclusion is somehow tantamount to evidence of being on psychologically perilous grounds:\n“Are Atheists morally compromised?” Excuse me? Atheist don’t have to make excuses for priests that molest children, religious extremism, holy wars, or anything like that, but atheists are morally compromised?\nTrue.  Of course, neither do any non-Catholic Christians, Jews, Muslims are anyone else.  Furthermore, the number of child-molesting teachers, janitors, principals in the secular schools where religion is banned surpasses the number of child-molesting priests in both absolute and percentage terms.\nAs has been previously discussed, the number of holy wars is a very small percentage of all wars and atheists, despite their relatively short amount of time in power anywhere, are responsible for more fatalities than all of the holy wars of history combined.\nSo, yes, even by this atheist’s reckoning, there’s a very strong case to be made for the case that atheists are morally compromised, assuming that we first posit that the very concept of a “moral atheist” is not an oxymoron.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-15T11:55:00+00:00"
}