{
  "url": "https://voxday.net/2007/02/13/when-professors-cant-read/",
  "scraped_at": "2026-01-08T21:31:47.896745",
  "title": "When professors can’t read",
  "date_display": "February 13, 2007",
  "date_iso": "2007-02-13T23:17:00+00:00",
  "date_from_url": "2007-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://scienceblogs.com/pharyngula/2007/02/and_they_call_us_atheists_amor.php\">why Pharyngirl teaches at a jumped-up community college</a> instead of a real university:</p><blockquote><p>Charming. Good Christian Vox Day argues that murdering toddlers in the name of Jesus is defensible.</p><p>(I’m hoping ol’ Vox will make another post calling me “Pharyngurl”. It’s pathetic that he thinks femininity is an insult, isn’t it?)</p></blockquote><p>No, Vox answers that offing two-year olds at the direct and 100-percent confirmed command of the Almighty is the moral act.  Jesus never entered into it one way or another, let alone a self-motivated or (presumably) delusional act justified post facto by an exculpatory invocation of Jesus Christ’s name.</p><p>But as <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2007/02/am_i_serious.html\">Scott Adams and others have learned</a>, Pharyngirl can’t even read a simple statement and understand it well enough to summarize it accurately.  This is particularly amusing considering that Jefferson and all of the atheists and agnostics here, despite their many differences with me and their rejection of my position, have had no similar difficulties.</p><p>It’s possible, of course, that Pharyngirl does actually understand the difference but simply chose to lie.  And why shouldn’t he?  He’s an atheist, he has no reason not to lie… except for the fact that he keeps getting caught at it.</p><p>And yes, femininity in bearded middle-aged men is considered to be an insult by those who actually managed to leave college.</p><p>The interesting thing is that no atheist – not here and not on any of the blogs that have commented on the Sharpening Knives post – has even attempted to explain why this divinely ordered slaughter would be an immoral act.  Instead, like impressionable young women, they gasp and pretend to collapse on their fainting couches over the correct answer to an obvious and inconsequential Q&amp;A trap.</p><p>This feigned swooning is particularly ironic given the obvious fact that God has not given such a command in nearly 2,000 years of Christianity, meanwhile, godless butcheries continue in the United States and around the world even as their comrades rush for the smelling salts.</p><p>A commenter adds an interesting note: “I know it’s only been 2500 years since this kind of idea was shown to be ridiculous, but maybe this guy’s just a little slow.”</p><p>That’s entirely possible.  Of course, it’s also possible that I am vehemently anti-Platonist, have little respect for Socrates and can present a logical case for rejecting the <i>Euthyphro</i> dilemma as spurious… tune in tomorrow.</p></div>",
  "content_text": "This is\nwhy Pharyngirl teaches at a jumped-up community college\ninstead of a real university:\nCharming. Good Christian Vox Day argues that murdering toddlers in the name of Jesus is defensible.\n(I’m hoping ol’ Vox will make another post calling me “Pharyngurl”. It’s pathetic that he thinks femininity is an insult, isn’t it?)\nNo, Vox answers that offing two-year olds at the direct and 100-percent confirmed command of the Almighty is the moral act.  Jesus never entered into it one way or another, let alone a self-motivated or (presumably) delusional act justified post facto by an exculpatory invocation of Jesus Christ’s name.\nBut as\nScott Adams and others have learned\n, Pharyngirl can’t even read a simple statement and understand it well enough to summarize it accurately.  This is particularly amusing considering that Jefferson and all of the atheists and agnostics here, despite their many differences with me and their rejection of my position, have had no similar difficulties.\nIt’s possible, of course, that Pharyngirl does actually understand the difference but simply chose to lie.  And why shouldn’t he?  He’s an atheist, he has no reason not to lie… except for the fact that he keeps getting caught at it.\nAnd yes, femininity in bearded middle-aged men is considered to be an insult by those who actually managed to leave college.\nThe interesting thing is that no atheist – not here and not on any of the blogs that have commented on the Sharpening Knives post – has even attempted to explain why this divinely ordered slaughter would be an immoral act.  Instead, like impressionable young women, they gasp and pretend to collapse on their fainting couches over the correct answer to an obvious and inconsequential Q&A trap.\nThis feigned swooning is particularly ironic given the obvious fact that God has not given such a command in nearly 2,000 years of Christianity, meanwhile, godless butcheries continue in the United States and around the world even as their comrades rush for the smelling salts.\nA commenter adds an interesting note: “I know it’s only been 2500 years since this kind of idea was shown to be ridiculous, but maybe this guy’s just a little slow.”\nThat’s entirely possible.  Of course, it’s also possible that I am vehemently anti-Platonist, have little respect for Socrates and can present a logical case for rejecting the\nEuthyphro\ndilemma as spurious… tune in tomorrow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-02-13T23:17:00+00:00"
}