{
  "url": "https://voxday.net/2004/12/23/christmas-greetings-from-oc/",
  "scraped_at": "2026-01-08T19:48:16.089693",
  "title": "Christmas greetings from the OC",
  "date_display": "December 23, 2004",
  "date_iso": "2004-12-23T19:24:00+00:00",
  "date_from_url": "2004-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://www.spedro.com/nf_xmas.html\">I am not ready to be this old</a>. I’m not ready to become part of the Parents generation, as if I had a choice. But one of my daughters lives half a continent away and can’t get the time off work to make the trip home for the holidays. Another will be coming home for a few days and may bring her fiancé, but then they’ll probably leave to spend a few days with his family. The third will be staying at the house a bit longer, but she’s really planning to spend most of her vacation hanging out with her high school friends.</br></p><p>We’re lucky. We still have The Kid: the 9-year-old late-life surprise who keeps us young and reminds his older sisters that they’re not quite ready to start families of their own, yet. So we’ll haul out the camcorder, watch him tear into the presents, and record every happy shriek and bit of shredded wrapping paper for posterity.<br/></p></blockquote><p></p></div>",
  "content_text": "I am not ready to be this old\n. I’m not ready to become part of the Parents generation, as if I had a choice. But one of my daughters lives half a continent away and can’t get the time off work to make the trip home for the holidays. Another will be coming home for a few days and may bring her fiancé, but then they’ll probably leave to spend a few days with his family. The third will be staying at the house a bit longer, but she’s really planning to spend most of her vacation hanging out with her high school friends.\nWe’re lucky. We still have The Kid: the 9-year-old late-life surprise who keeps us young and reminds his older sisters that they’re not quite ready to start families of their own, yet. So we’ll haul out the camcorder, watch him tear into the presents, and record every happy shriek and bit of shredded wrapping paper for posterity.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-23T19:24:00+00:00"
}