{
  "url": "https://voxday.net/2004/12/24/fred-on-newspapers/",
  "scraped_at": "2026-01-08T19:48:19.799685",
  "title": "Fred on newspapers",
  "date_display": "December 24, 2004",
  "date_iso": "2004-12-24T15:42:00+00:00",
  "date_from_url": "2004-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>…the greatest weakness of the American press is moral. Our media are relentlessly, grindingly, hermetically controlled or, as we say, politically correct. Everyone with the brains of an aspirin tablet is aware of it. Newspaper do not so much report the news as avoid it. The taboos are endless and rigid. What reporters know, they do not write; what they write, they do not believe. We all understand exactly what the media can say, can’t say, and will say. Sheer dishonesty rubs shoulders with poor content.<br/></br></p></blockquote><p>This inability to address the truth, however uncomfortable, is what is leading the media reality further and further away from the easily observable reality.  This is why the commentary aspect of the mainstream media is simply growing more and more irrelevant.</p><p>The structural aspects of the media will continue to be useful, but more and more it will come to resemble the AP newswire, with superblogs replacing the individual papers themselves.  This will, I think, be a good thing.  If nothing else, it will return some level of variety that has been lost to the print world the last twenty years.<br/></p></div>",
  "content_text": "…the greatest weakness of the American press\nis moral. Our media are relentlessly, grindingly, hermetically controlled or, as we say, politically correct. Everyone with the brains of an aspirin tablet is aware of it. Newspaper do not so much report the news as avoid it. The taboos are endless and rigid. What reporters know, they do not write; what they write, they do not believe. We all understand exactly what the media can say, can’t say, and will say. Sheer dishonesty rubs shoulders with poor content.\nThis inability to address the truth, however uncomfortable, is what is leading the media reality further and further away from the easily observable reality.  This is why the commentary aspect of the mainstream media is simply growing more and more irrelevant.\nThe structural aspects of the media will continue to be useful, but more and more it will come to resemble the AP newswire, with superblogs replacing the individual papers themselves.  This will, I think, be a good thing.  If nothing else, it will return some level of variety that has been lost to the print world the last twenty years.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-24T15:42:00+00:00"
}