{
  "url": "https://voxday.net/2004/12/08/hence-confusion/",
  "scraped_at": "2026-01-08T19:47:06.006120",
  "title": "Hence the confusion",
  "date_display": "December 8, 2004",
  "date_iso": "2004-12-08T11:32:00+00:00",
  "date_from_url": "2004-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This column by Paul Greenberg, one of the many syndicated columnists who happens to be Jewish, very much amused me in light of the discussion of the meaning of Hannukah between Scott and Gypsy:<br/></p><blockquote><p> <br>The central metaphor of all religious belief – revealing light – now blots out all the imperial intrigues and internecine warfare. And that may be the greatest miracle of Chanukah: the transformation of that oldest and darkest of human activities, war, into a feast of illumination.</br></p><p>There is more than a single theme to this minor but not simple holiday. One can almost trace the ebbs and flows of Jewish history, its yearnings and fulfillments, its wisdom and folly, its holiness and vainglory, by noting which themes of Chanukah have been emphasized when in Jewish history.  So does history say more about the time in which it is written than the time it describes. <a href=\"http://www.townhall.com/columnists/paulgreenberg/pg20041208.shtml\">The message of Chanukah changes</a> from age to age.<br/></p></blockquote><p></p></div>",
  "content_text": "This column by Paul Greenberg, one of the many syndicated columnists who happens to be Jewish, very much amused me in light of the discussion of the meaning of Hannukah between Scott and Gypsy:\nThe central metaphor of all religious belief – revealing light – now blots out all the imperial intrigues and internecine warfare. And that may be the greatest miracle of Chanukah: the transformation of that oldest and darkest of human activities, war, into a feast of illumination.\nThere is more than a single theme to this minor but not simple holiday. One can almost trace the ebbs and flows of Jewish history, its yearnings and fulfillments, its wisdom and folly, its holiness and vainglory, by noting which themes of Chanukah have been emphasized when in Jewish history.  So does history say more about the time in which it is written than the time it describes.\nThe message of Chanukah changes\nfrom age to age.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-08T11:32:00+00:00"
}