{
  "url": "https://voxday.net/2004/12/01/if-you-want-free-fiction/",
  "scraped_at": "2026-01-08T19:46:12.683843",
  "title": "If you want free fiction",
  "date_display": "December 1, 2004",
  "date_iso": "2004-12-01T20:00:00+00:00",
  "date_from_url": "2004-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Naron is heartened by the literary contributions:<br/></p><blockquote><p> <br>I’m about to turn in after <a href=\"http://www.eternalwarriors.com/tbshorts.html\">reading the first three</a>.  I have to say, those were worth reading.  And I don’t think I’m exaggerating when I say what I’ve read so far is far above any of the contrived “Christian genre,” as you put it, I have read in recent years.  Actually, I can’t say enough about your work.  Why, may I ask, are you not on every shelf?<br/></br></p></blockquote><p>That’s a question perhaps better directed to my publisher.  Or better yet, to a Christian media that would rather complain about Dungeons &amp; Dragons or Harry Potter than devote any coverage to genuine and reasonable alternatives.</p><p>The main reason my books read very differently than books like Peretti and LaHaye-Jenkins is that as a novelist, I am a Christian who writes in the science fiction and fantasy genre, I am not a writer in the Christian genre.  There is a significant stylistic difference.<br/></p></div>",
  "content_text": "Chris Naron is heartened by the literary contributions:\nI’m about to turn in after\nreading the first three\n.  I have to say, those were worth reading.  And I don’t think I’m exaggerating when I say what I’ve read so far is far above any of the contrived “Christian genre,” as you put it, I have read in recent years.  Actually, I can’t say enough about your work.  Why, may I ask, are you not on every shelf?\nThat’s a question perhaps better directed to my publisher.  Or better yet, to a Christian media that would rather complain about Dungeons & Dragons or Harry Potter than devote any coverage to genuine and reasonable alternatives.\nThe main reason my books read very differently than books like Peretti and LaHaye-Jenkins is that as a novelist, I am a Christian who writes in the science fiction and fantasy genre, I am not a writer in the Christian genre.  There is a significant stylistic difference.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-01T20:00:00+00:00"
}