{
  "url": "https://voxday.net/2004/12/09/liar/",
  "scraped_at": "2026-01-08T19:47:13.305623",
  "title": "Liar!",
  "date_display": "December 9, 2004",
  "date_iso": "2004-12-09T11:10:00+00:00",
  "date_from_url": "2004-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://thescotsman.scotsman.com/index.cfm?id=1407622004\">NINETEEN out of 20 women admit lying</a> to their partners or husbands, a survey on attitudes to truth and relationships has found. Eighty-three per cent owned up to telling “big, life-changing lies”, with 13 per cent saying they did so frequently. Half said that if they became pregnant by another man but wanted to stay with their partner, they would lie about the baby’s real father.</br></p><p>Forty-two per cent would lie about contraception in order to get pregnant, no matter the wishes of their partner. And an alarming 31 per cent said they would not tell a future partner if they had a sexual disease: this rises to 65 per cent among single women….</p><p>She said: “Modern women just can’t stop lying, but they do it to stop hurting other people’s feelings. It could be argued that these little white lies simply make the world go round a little more smoothly. But to tell a man a baby is his when it’s not, or to deliberately get pregnant when your partner doesn’t want a baby, is playing Russian roulette with other people’s lives.”<br/></p></blockquote><p>That sounds about right, except that based on my experience, I’d say that the one in twenty who won’t admit that she lies is lying too.  The venereal disease bit is particularly interesting, as I have a few friends, male and female, who suffer from such afflictions and in every case, the women do not make a habit of telling their prospective partners ahead of time while the men do.</p><p>I think the willingness to lie about paternity is particularly despicable, especially when the corrupt family courts are willing to force a man to support a child that is provably not his.<br/></p></div>",
  "content_text": "NINETEEN out of 20 women admit lying\nto their partners or husbands, a survey on attitudes to truth and relationships has found. Eighty-three per cent owned up to telling “big, life-changing lies”, with 13 per cent saying they did so frequently. Half said that if they became pregnant by another man but wanted to stay with their partner, they would lie about the baby’s real father.\nForty-two per cent would lie about contraception in order to get pregnant, no matter the wishes of their partner. And an alarming 31 per cent said they would not tell a future partner if they had a sexual disease: this rises to 65 per cent among single women….\nShe said: “Modern women just can’t stop lying, but they do it to stop hurting other people’s feelings. It could be argued that these little white lies simply make the world go round a little more smoothly. But to tell a man a baby is his when it’s not, or to deliberately get pregnant when your partner doesn’t want a baby, is playing Russian roulette with other people’s lives.”\nThat sounds about right, except that based on my experience, I’d say that the one in twenty who won’t admit that she lies is lying too.  The venereal disease bit is particularly interesting, as I have a few friends, male and female, who suffer from such afflictions and in every case, the women do not make a habit of telling their prospective partners ahead of time while the men do.\nI think the willingness to lie about paternity is particularly despicable, especially when the corrupt family courts are willing to force a man to support a child that is provably not his.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-09T11:10:00+00:00"
}