{
  "url": "https://voxday.net/2004/12/29/mailvox-jews-and-fascists/",
  "scraped_at": "2026-01-08T19:48:45.451713",
  "title": "Mailvox: Jews and Fascists",
  "date_display": "December 29, 2004",
  "date_iso": "2004-12-29T13:32:00+00:00",
  "date_from_url": "2004-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DL isn’t quite sure what to think:<br/></p><blockquote><p> <br>The gist of that paragraph is that Jews totally out of proportion of their numbers are in the front in of the Secularists in taking Christ out of Christmas and, alas you write the truth but not the whole truth.  What you chose to omit is the fact the Conservative Jews both neo as well as paleo (amongst the latter I number myself) made a determined effort to keep Christ in Christmas, as a cursory glance of Town Hall during the month of December will testify thereto; and I do fault you for that….</br></p><p>Now back to Jewish Fascists or rather the term ‘Fascist.’  Are you using this term as a descriptive or as a pejorative?  If descriptive, how to describe it?  One way is to go back all the way to the source, to the late Benito Mussolini who, after all, coined that word: ‘All to the State, everything inside the State, nothing outside the State.’  Obviously not applicable in this particular instance.</p><p>If using it as a pejorative, well . . .<br/></p></blockquote><p>I’m aware of people such as Dennis Prager, Charles Krauthammer, Mona Charon, Michael Medved and Jeff Jacoby defending the right of Christians to publicly celebrate Christmas.  But these very Jews have criticized the very same secular Jews to whom I was specifically referring.  These more-or-less conservative Jews are clearly not anti-religious secular Jews, (although I’m not actually sure about Krauthammer).</p><p>You’ll note that I did not say “Jews” or even fascist Jewish secularists.  “Secular Jewish” served as an adjective to describe the non-religious fascists (small-f descriptive) at the ADL and the ACLU.  I<br> <br>speak Italian, I have lived in Italia and I have even personally translated Mussolini’s Manifesto of the Fascist struggle.  So, I do not speak lightly when I call these individuals fascists – as opposed to Fascists – as it is the ideological term that best suits their corporate-friendly ur-socialism.  There is more to the historical Fascist program than the slogan <em>Niente fuori lo stato….</em> and much of it, especially its virulently antireligious fervor, is echoed by the ADL and the ACLU.<br/></br></br></p><blockquote><p> <br>One hit, one palpable hit of yours was: Meanwhile, in gloriously secular Europe, Jews walk the streets in visible fear and are physically attacked on a regular basis in France, Germany and Belgium.<br/></br></p></blockquote><p>I was at a large train station in Europe and it really struck me how fearful the eyes of an Orthodox Jewish couple were, as they glanced continuously around them.  I’ve never seen that in America.<br/></p><blockquote><p> <br>One grievance I do have with columnists across the political spectrum is their contribution to the debasement of our language, or, as a conservative columnist, whom charity forbids me to name, excused himself by saying that he merely follows current usage.<br/></br></p></blockquote><p>I agree, though I make the occasional slip myself.  It’s why you’ll usually see me referring to left-liberals.  And I have written several columns on how the Fascists and Nazis were both left-wing ideologies.<br/></p></div>",
  "content_text": "DL isn’t quite sure what to think:\nThe gist of that paragraph is that Jews totally out of proportion of their numbers are in the front in of the Secularists in taking Christ out of Christmas and, alas you write the truth but not the whole truth.  What you chose to omit is the fact the Conservative Jews both neo as well as paleo (amongst the latter I number myself) made a determined effort to keep Christ in Christmas, as a cursory glance of Town Hall during the month of December will testify thereto; and I do fault you for that….\nNow back to Jewish Fascists or rather the term ‘Fascist.’  Are you using this term as a descriptive or as a pejorative?  If descriptive, how to describe it?  One way is to go back all the way to the source, to the late Benito Mussolini who, after all, coined that word: ‘All to the State, everything inside the State, nothing outside the State.’  Obviously not applicable in this particular instance.\nIf using it as a pejorative, well . . .\nI’m aware of people such as Dennis Prager, Charles Krauthammer, Mona Charon, Michael Medved and Jeff Jacoby defending the right of Christians to publicly celebrate Christmas.  But these very Jews have criticized the very same secular Jews to whom I was specifically referring.  These more-or-less conservative Jews are clearly not anti-religious secular Jews, (although I’m not actually sure about Krauthammer).\nYou’ll note that I did not say “Jews” or even fascist Jewish secularists.  “Secular Jewish” served as an adjective to describe the non-religious fascists (small-f descriptive) at the ADL and the ACLU.  I\nspeak Italian, I have lived in Italia and I have even personally translated Mussolini’s Manifesto of the Fascist struggle.  So, I do not speak lightly when I call these individuals fascists – as opposed to Fascists – as it is the ideological term that best suits their corporate-friendly ur-socialism.  There is more to the historical Fascist program than the slogan\nNiente fuori lo stato….\nand much of it, especially its virulently antireligious fervor, is echoed by the ADL and the ACLU.\nOne hit, one palpable hit of yours was: Meanwhile, in gloriously secular Europe, Jews walk the streets in visible fear and are physically attacked on a regular basis in France, Germany and Belgium.\nI was at a large train station in Europe and it really struck me how fearful the eyes of an Orthodox Jewish couple were, as they glanced continuously around them.  I’ve never seen that in America.\nOne grievance I do have with columnists across the political spectrum is their contribution to the debasement of our language, or, as a conservative columnist, whom charity forbids me to name, excused himself by saying that he merely follows current usage.\nI agree, though I make the occasional slip myself.  It’s why you’ll usually see me referring to left-liberals.  And I have written several columns on how the Fascists and Nazis were both left-wing ideologies.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-29T13:32:00+00:00"
}