{
  "url": "https://voxday.net/2004/12/05/never-assume/",
  "scraped_at": "2026-01-08T19:46:36.547902",
  "title": "Never assume",
  "date_display": "December 5, 2004",
  "date_iso": "2004-12-05T10:23:00+00:00",
  "date_from_url": "2004-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When I saw the headline: <em><a href=\"http://sportsillustrated.cnn.com/2004/writers/roy_johnson/12/04/pass.the.word/index.html\">Undesirable Irish</a>: Why Notre Dame has become the worst job in college football</em>, and saw that it was written by a black man, SI managing editor Roy S. Johnson, I was sure that this would be yet another emotional, fact-free assertion of why Notre Dame is to be condemned for racism because they dumped a coach, Ty Willingham, who is not performing at the required level.  I was wrong.<br/></p><blockquote><p> <br>Notre Dame will never again be a regular contender for the national title. And let’s stop blaming the school’s high academic requirements. Sure, the school’s admission standards are a barrier for many of the nation’s top athletes, but a surly admissions officer isn’t even one of the top three reasons the job is the worst in college football.</br></p><p>The primary culprit is the Irish’s schedule. In the BCS era, an undefeated record does not guarantee an invitation to the title game (See: Auburn, Utah and Boise State), and a single loss (Cal, Texas) can make you Team Irrelevant. Notre Dame plays the toughest schedule in the nation, and will do so at least until 2008, the last season for which its schedule is already locked in. Next year, four of the Irish’s first five games are on the road, at Pittsburgh, Michigan, Washington and Purdue. Then they’ll face USC at home. Season over.</p><p>The second reason is the one Notre Dame officials and boosters seem most delusional about: Notre Dame just simply isn’t Notre Dame anymore. It’s no longer the Holy Grail of college football. Talented young men no longer dream of representing the Golden Dome and following the legacies of the Four Horsemen and the Joes, Theismann and Montana. Blue-chip players dream of competing for conference titles. That’s not happening at Notre Dame. It’s happening at places like Purdue, Wisconsin, Cal, Florida, Auburn and even Boise State.  They dream of playing close to family and friends, which helped schools like Virginia Tech, Iowa and LSU retain home-grown talent and achieve respectability. South Bend? Please.</p><p>The third reason Notre Dame has come to this place was ignited 13 years ago when the school signed NBC to be its exclusive football broadcaster. Most TV deals are struck with conferences, allowing teams to share the television revenue and the pressure to produce solid ratings. As an independent, the Irish signed a deal that allows them to pocket all the revenue (variously reported to be $9 million annually). But it also puts the ratings burden squarely — and solely — on Irish shoulder pads.<br/></p></blockquote><p>Mr. Jones writes a good, dispassionate assessment of why Notre Dame is in a stew of its own making.  He takes a more charitable view of Willingham’s performance than I do, but his position is an eminently reasonable one that revolves around academic performance and off-field character, not race.  I wish the white sportswriters who are undergoing fainting spells at the notion that a black coach would be held accountable to the same brutal standards of college coaching as everyone else would take a lesson from the man.<br/></p></div>",
  "content_text": "When I saw the headline:\nUndesirable Irish\n: Why Notre Dame has become the worst job in college football\n, and saw that it was written by a black man, SI managing editor Roy S. Johnson, I was sure that this would be yet another emotional, fact-free assertion of why Notre Dame is to be condemned for racism because they dumped a coach, Ty Willingham, who is not performing at the required level.  I was wrong.\nNotre Dame will never again be a regular contender for the national title. And let’s stop blaming the school’s high academic requirements. Sure, the school’s admission standards are a barrier for many of the nation’s top athletes, but a surly admissions officer isn’t even one of the top three reasons the job is the worst in college football.\nThe primary culprit is the Irish’s schedule. In the BCS era, an undefeated record does not guarantee an invitation to the title game (See: Auburn, Utah and Boise State), and a single loss (Cal, Texas) can make you Team Irrelevant. Notre Dame plays the toughest schedule in the nation, and will do so at least until 2008, the last season for which its schedule is already locked in. Next year, four of the Irish’s first five games are on the road, at Pittsburgh, Michigan, Washington and Purdue. Then they’ll face USC at home. Season over.\nThe second reason is the one Notre Dame officials and boosters seem most delusional about: Notre Dame just simply isn’t Notre Dame anymore. It’s no longer the Holy Grail of college football. Talented young men no longer dream of representing the Golden Dome and following the legacies of the Four Horsemen and the Joes, Theismann and Montana. Blue-chip players dream of competing for conference titles. That’s not happening at Notre Dame. It’s happening at places like Purdue, Wisconsin, Cal, Florida, Auburn and even Boise State.  They dream of playing close to family and friends, which helped schools like Virginia Tech, Iowa and LSU retain home-grown talent and achieve respectability. South Bend? Please.\nThe third reason Notre Dame has come to this place was ignited 13 years ago when the school signed NBC to be its exclusive football broadcaster. Most TV deals are struck with conferences, allowing teams to share the television revenue and the pressure to produce solid ratings. As an independent, the Irish signed a deal that allows them to pocket all the revenue (variously reported to be $9 million annually). But it also puts the ratings burden squarely — and solely — on Irish shoulder pads.\nMr. Jones writes a good, dispassionate assessment of why Notre Dame is in a stew of its own making.  He takes a more charitable view of Willingham’s performance than I do, but his position is an eminently reasonable one that revolves around academic performance and off-field character, not race.  I wish the white sportswriters who are undergoing fainting spells at the notion that a black coach would be held accountable to the same brutal standards of college coaching as everyone else would take a lesson from the man.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-05T10:23:00+00:00"
}