{
  "url": "https://voxday.net/2004/12/02/oxymauronic-lamentations/",
  "scraped_at": "2026-01-08T19:46:18.216109",
  "title": "Oxymauronic lamentations",
  "date_display": "December 2, 2004",
  "date_iso": "2004-12-02T11:30:00+00:00",
  "date_from_url": "2004-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Maureen Dowd suffers an old Freudian standby:<br/></p><blockquote><p> <br>The networks don’t even give lip service to looking for women and blacks for anchor jobs – they just put pretty-boy clones in the pipeline. “I think we’re still stuck in a society that looks at white males as authority figures,” Mr. Brokaw conceded. Bill Carter, a TV reporter at The Times, agreed: “Katie Couric may be a much bigger star and even more experienced than Brian Williams. But when the next 9/11 happens, it’ll be Brian, not Katie, in the central role. The attitude still seems to be, ‘We want a daddy in that chair'”….</br></p><p>I know that women have surpassed men, in many respects, by embracing their femininity and frivolity. Katie Couric and Diane Sawyer, who mix news with dish, cooking and fashion in the morning, are the real breadwinners of their news divisions, generating more ratings and revenue than the cookie-cutter men of the night….</p><p>But my pal admits that she watched Mr. Brokaw partly because he was “eye candy,” and declares women at fault in this matter: “Women like to read books about men and go to movies about men. But men don’t like to read books about women or go to movies about women. The only way this is going to change is if women refuse to watch men. And the problem is, women like watching men.”<br/></p></blockquote><p>The problem is that women in the media are so frivolous and portray themselves in a such a lightweight manner that most men – and women – cannot possibly conclude that they are to be taken seriously.  Perhaps this is because women so often insist on being frivolous.  Maureen Dowd is herself an indication of this; one could read her for a year and never encounter a mention of any philosophy from Aristotle to Zarathustra but nary a week will pass without her citing Sex in the City, Desperate Housewives or another television show du jour.</p><p>Katie Couric may be popular with the public, but so is Howard Stern, who arguably would do better job and be more believable as a news anchor than the affable Eva Braun analog.  It shouldn’t be surprising that men don’t have any interest in women’s entertainment, as women’s entertainment is nothing but complaints about men.  As Roger Ailes’ hilarously tells her: “You ought to call the Lifetime network or, as we say, the ‘Men Are No Damn Good Network,’ and protest it.”</p><p>Men’s entertainment seldom revolves around women.  We’re far more interested in heroic last stands – I’ve been reading Gemmell’s Drenai Chronicles, they’re great – competition of one sort or another and for the more intellectually minded, contemplating the purpose of life, the universe and everything.  When our entertainment does involve women, it tends to revolve around those things we like best about women, namely, their pretty faces, their nicely rounded parts and the inspiration that they can provide, not the things we hate.</p><p>Dowd’s column reminds me of the bitter, nasty woman who can’t figure out why her husband doesn’t want to be around her.  If you want people to like you, then behave in a likeable manner.  If women want men to read their books or watch their movies, then create something interesting.  JK Rowling and Margaret Weis don’t lack for male readers, but then, they write fantasy novels, not <em>women’s</em> fantasy novels.</p><p>Nor is women refusing to watch men’s entertainment going to change anything.  I’m glad that Space Bunny enjoys watching football with me, but I’m going to watch it whether she does or not.  And the video game industry has grown from zero to a multi-billion dollar business without any significant female interest.  Women should simply do what they want to do, watch what they want to watch and allow men to do the same; the pastime is not political<br/></p></div>",
  "content_text": "Maureen Dowd suffers an old Freudian standby:\nThe networks don’t even give lip service to looking for women and blacks for anchor jobs – they just put pretty-boy clones in the pipeline. “I think we’re still stuck in a society that looks at white males as authority figures,” Mr. Brokaw conceded. Bill Carter, a TV reporter at The Times, agreed: “Katie Couric may be a much bigger star and even more experienced than Brian Williams. But when the next 9/11 happens, it’ll be Brian, not Katie, in the central role. The attitude still seems to be, ‘We want a daddy in that chair'”….\nI know that women have surpassed men, in many respects, by embracing their femininity and frivolity. Katie Couric and Diane Sawyer, who mix news with dish, cooking and fashion in the morning, are the real breadwinners of their news divisions, generating more ratings and revenue than the cookie-cutter men of the night….\nBut my pal admits that she watched Mr. Brokaw partly because he was “eye candy,” and declares women at fault in this matter: “Women like to read books about men and go to movies about men. But men don’t like to read books about women or go to movies about women. The only way this is going to change is if women refuse to watch men. And the problem is, women like watching men.”\nThe problem is that women in the media are so frivolous and portray themselves in a such a lightweight manner that most men – and women – cannot possibly conclude that they are to be taken seriously.  Perhaps this is because women so often insist on being frivolous.  Maureen Dowd is herself an indication of this; one could read her for a year and never encounter a mention of any philosophy from Aristotle to Zarathustra but nary a week will pass without her citing Sex in the City, Desperate Housewives or another television show du jour.\nKatie Couric may be popular with the public, but so is Howard Stern, who arguably would do better job and be more believable as a news anchor than the affable Eva Braun analog.  It shouldn’t be surprising that men don’t have any interest in women’s entertainment, as women’s entertainment is nothing but complaints about men.  As Roger Ailes’ hilarously tells her: “You ought to call the Lifetime network or, as we say, the ‘Men Are No Damn Good Network,’ and protest it.”\nMen’s entertainment seldom revolves around women.  We’re far more interested in heroic last stands – I’ve been reading Gemmell’s Drenai Chronicles, they’re great – competition of one sort or another and for the more intellectually minded, contemplating the purpose of life, the universe and everything.  When our entertainment does involve women, it tends to revolve around those things we like best about women, namely, their pretty faces, their nicely rounded parts and the inspiration that they can provide, not the things we hate.\nDowd’s column reminds me of the bitter, nasty woman who can’t figure out why her husband doesn’t want to be around her.  If you want people to like you, then behave in a likeable manner.  If women want men to read their books or watch their movies, then create something interesting.  JK Rowling and Margaret Weis don’t lack for male readers, but then, they write fantasy novels, not\nwomen’s\nfantasy novels.\nNor is women refusing to watch men’s entertainment going to change anything.  I’m glad that Space Bunny enjoys watching football with me, but I’m going to watch it whether she does or not.  And the video game industry has grown from zero to a multi-billion dollar business without any significant female interest.  Women should simply do what they want to do, watch what they want to watch and allow men to do the same; the pastime is not political",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-02T11:30:00+00:00"
}