{
  "url": "https://voxday.net/2004/12/16/parenting-by-proxy/",
  "scraped_at": "2026-01-08T19:47:44.701795",
  "title": "Parenting by proxy",
  "date_display": "December 16, 2004",
  "date_iso": "2004-12-16T09:13:00+00:00",
  "date_from_url": "2004-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>“I think there is a place for Christian bands, and schools aren’t where they belong,” Ms. Chiarelott said. “Maybe most people don’t really see anything wrong with it, but there is a line and this is crossing it. I’m amazed they even considered it.”<br/></br></p></blockquote><p>Setting aside the lameness of the “anti-drug” nonsense and the amusing concept of a “rock” band playing in schools, I don’t know how much more clear the point can be made that <a href=\"http://www.toledoblade.com/apps/pbcs.dll/article?AID=/20041215/NEWS18/412150341\">the public schools do not want Christianity</a> in any shape or form being permitted to enter.  Why any Christian would want to voluntarily subject their children to this sort of virulent opposition from a very young age is utterly beyond me.</p><p>It strikes me as ironic that those who would never consider subjecting their children to a physical beating in order to toughen them up for the real world think that it is a good idea to send them to those who despise Christians during what are manifestly their developmental years.</p><p>The point of parenting is to train your children to meet the real world when they are ready for it; leaving them to television and teachers is not parenting but parenting by proxy.<br/></p></div>",
  "content_text": "“I think there is a place for Christian bands, and schools aren’t where they belong,” Ms. Chiarelott said. “Maybe most people don’t really see anything wrong with it, but there is a line and this is crossing it. I’m amazed they even considered it.”\nSetting aside the lameness of the “anti-drug” nonsense and the amusing concept of a “rock” band playing in schools, I don’t know how much more clear the point can be made that\nthe public schools do not want Christianity\nin any shape or form being permitted to enter.  Why any Christian would want to voluntarily subject their children to this sort of virulent opposition from a very young age is utterly beyond me.\nIt strikes me as ironic that those who would never consider subjecting their children to a physical beating in order to toughen them up for the real world think that it is a good idea to send them to those who despise Christians during what are manifestly their developmental years.\nThe point of parenting is to train your children to meet the real world when they are ready for it; leaving them to television and teachers is not parenting but parenting by proxy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-16T09:13:00+00:00"
}