{
  "url": "https://voxday.net/2004/12/10/please-excuse-ran/",
  "scraped_at": "2026-01-08T19:47:17.005509",
  "title": "Please excuse the rant",
  "date_display": "December 10, 2004",
  "date_iso": "2004-12-10T10:03:00+00:00",
  "date_from_url": "2004-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the last three days, I have received twelve novels and at least that many press releases for computer games.  Most of them are obviously crap, some of them are promising and three – Kage Baker’s THE LIFE OF THE WORLD TO COME, Charles Stross’s A FAMILY TRADE and Jacqueline Carey’s BANEWREAKER – look particularly interesting.  (I was far less impressed with Carey’s debut trilogy than most, but she does have promise).</p><p>Now, I’m not going to review all of them, or even most of them.  But I will review some of them and pass word of the better books onto you.  Space Bunny has been acting as my filter, unfortunately for her she’s been slogging through a LOT of third and fourth-rate fantasy of late.  Meanwhile, I recently finished my piece on Douglas Adams for the forthcoming essays on Hitchhiker’s – THE SUBVERSIVE DISMAL SCIENTIST – and Bruce and I may be teaming up to write a piece for the next Smart Pop book, this one on Harry Potter.</p><p>What’s the point?  It is this.  After reading articles or posts lamenting the state of the culture, or more specifically, the absence of decent conservative and Christian entertainment, I have sent / offered to send copies of my books, (and more recently, my comic), to the complaining conservative commentators.  The result?  Not one has seen fit to review or even MENTION them.  This is not because they read them and found them wanting, but because they simply haven’t bothered to so much as give them a cursory look-through.  This isn’t an assertion, I’ve confirmed it with most of them.</p><p>I find this to be simultaneously amusing and annoying.  Where do they get off bitching about a dearth of such entertainment when they won’t give it the time of day themselves?  I’m not just speaking of my own work here; how many people have heard a peep out of the cultural complainants regarding G.P. Taylor’s Shadowmancer, despite the fact that it now tops the CBA charts and if my memory serves me correctly, actually <a href=\"http://www.cst-phl.com/040715/sixth.html\">outsold the fifth Harry Potter installment</a> at one point in the UK?</p><p>So, here’s what I’m suggesting.  If you run across a commentator or blogger who is singing the same old song, email their contact details to me along with a quote of the relevant passage.  If it’s a newspaper or magazine journalist, I’ll have my publishers send them a pair of books and the comics for review.  If it’s a blogger with more than 1,000 daily hits, I’ll email them the ebook versions along with a copy of Palm’s trial eReader.  This will leave them with no excuses that they’ve never heard of such things.</p><p>I’m not saying my stuff represents the gems of conservative-friendly literature.  Ad I’m no Eco, Stephenson or Simmons.  But since I’m on my second secular literary award jury and half my non-Christian fans seem to hail from the Goth world, I have a pretty good notion that it <a href=\"http://www.amazon.com/exec/obidos/tg/listmania/list-browse/-/1KXTQYEM8DYO2/ref=cm_lm_dp_m_1/002-5974970-6223210\">can’t be dismissed</a> as your basic fourth-rate Christian ghetto stuff either.<br/></p></div>",
  "content_text": "In the last three days, I have received twelve novels and at least that many press releases for computer games.  Most of them are obviously crap, some of them are promising and three – Kage Baker’s THE LIFE OF THE WORLD TO COME, Charles Stross’s A FAMILY TRADE and Jacqueline Carey’s BANEWREAKER – look particularly interesting.  (I was far less impressed with Carey’s debut trilogy than most, but she does have promise).\nNow, I’m not going to review all of them, or even most of them.  But I will review some of them and pass word of the better books onto you.  Space Bunny has been acting as my filter, unfortunately for her she’s been slogging through a LOT of third and fourth-rate fantasy of late.  Meanwhile, I recently finished my piece on Douglas Adams for the forthcoming essays on Hitchhiker’s – THE SUBVERSIVE DISMAL SCIENTIST – and Bruce and I may be teaming up to write a piece for the next Smart Pop book, this one on Harry Potter.\nWhat’s the point?  It is this.  After reading articles or posts lamenting the state of the culture, or more specifically, the absence of decent conservative and Christian entertainment, I have sent / offered to send copies of my books, (and more recently, my comic), to the complaining conservative commentators.  The result?  Not one has seen fit to review or even MENTION them.  This is not because they read them and found them wanting, but because they simply haven’t bothered to so much as give them a cursory look-through.  This isn’t an assertion, I’ve confirmed it with most of them.\nI find this to be simultaneously amusing and annoying.  Where do they get off bitching about a dearth of such entertainment when they won’t give it the time of day themselves?  I’m not just speaking of my own work here; how many people have heard a peep out of the cultural complainants regarding G.P. Taylor’s Shadowmancer, despite the fact that it now tops the CBA charts and if my memory serves me correctly, actually\noutsold the fifth Harry Potter installment\nat one point in the UK?\nSo, here’s what I’m suggesting.  If you run across a commentator or blogger who is singing the same old song, email their contact details to me along with a quote of the relevant passage.  If it’s a newspaper or magazine journalist, I’ll have my publishers send them a pair of books and the comics for review.  If it’s a blogger with more than 1,000 daily hits, I’ll email them the ebook versions along with a copy of Palm’s trial eReader.  This will leave them with no excuses that they’ve never heard of such things.\nI’m not saying my stuff represents the gems of conservative-friendly literature.  Ad I’m no Eco, Stephenson or Simmons.  But since I’m on my second secular literary award jury and half my non-Christian fans seem to hail from the Goth world, I have a pretty good notion that it\ncan’t be dismissed\nas your basic fourth-rate Christian ghetto stuff either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-10T10:03:00+00:00"
}