{
  "url": "https://voxday.net/2004/12/27/proto-nazi-evolutionists/",
  "scraped_at": "2026-01-08T19:48:34.412623",
  "title": "Proto-Nazi evolutionists",
  "date_display": "December 27, 2004",
  "date_iso": "2004-12-27T19:32:00+00:00",
  "date_from_url": "2004-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Evangelical Outpost has an excellent post on the Scopes evolution trial.  As is often the case, the scientists with their pretensions to infallible authority look stupid, arrogant and more than a little evil in retrospect:<br/></p><blockquote><p> <br>Teaching evolution…and eugenics — The biology book that was used by Scopes was George William Hunter’s Civic Biology….</br></p><p>The Races of Man. — At the present time there exist upon the earth five races or varieties of man, each very different from the other in instincts, social customs, and, to an extent, in structure. These are the Ethiopian or negro type, originating in Africa; the Malay or brown race, from the islands of the Pacific; The American Indian; the Mongolian or yellow race, including the natives of China, Japan, and the Eskimos; and finally, the highest type of all, the caucasians, represented by the civilized white inhabitants of Europe and America.</p><p>Improvement of Man. — If the stock of domesticated animals can be improved, it is not unfair to ask if the health and vigor of the future generations of men and women on the earth might not be improved by applying to them the laws of selection. This improvement of the future race has a number of factors in which we as individuals may play a part. These are personal hygiene, selection of healthy mates, and the betterment of the environment.</p><p>Eugenics. — When people marry there are certain things that the individual as well as the race should demand. The most important of these is freedom from germ diseases which might be handed down to the offspring. Tuberculosis, syphilis, that dread disease which cripples and kills hundreds of thousands of innocent children, epilepsy, and feeble-mindedness are handicaps which it is not only unfair but criminal to hand down to posterity. The science of being well born is called eugenics.</p><p>The Jukes. — Studies have been made on a number of different families in this country, in which mental and moral defects were present in one or both of the original parents. The “Jukes” family is a notorious example. The first mother is known as “Margaret, the mother of criminals.” In seventy-five years the progeny of the original generation has cost the state of New York over a million and a quarter dollars, besides giving over to the care of prisons and asylums considerably over a hundred feeble-minded, alcoholic, immoral, or criminal persons. Another case recently studied is the “Kallikak” family. <em>(Note: The name Kallikak is fictitious.)</em> This family has been traced back to the War of the Revolution, when a young soldier named Martin Kallikak seduced a feeble-minded girl. She had a feeble-minded son from whom there have been to the present time 480 descendants. Of these 33 were sexually immoral, 24 confirmed drunkards, 3 epileptics, and 143 feeble-minded. The man who started this terrible line of immorality and feeble-mindedness later married a normal Quaker girl. From this couple a line of 496 descendants have come, with no cases of feeble-mindedness. The evidence and the moral speak for themselves!</p><p>Parasitism and its Cost to Society. — Hundreds of families such as those described above exist today, spreading disease, immorality, and crime to all parts of this country. The cost to society of such families is very severe. Just as certain animals or plants become parasitic on other plants or animals, these families have become parasitic on society. They not only do harm to others by corrupting, stealing, or spreading disease, but they are actually protected and cared for by the state out of public money. Largely for them the poorhouse and the asylum exist. They take from society, but they give nothing in return. They are true parasites.</p><p>The Remedy. — If such people were lower animals, we would probably kill them off to prevent them from spreading. Humanity will not allow this, but we do have the remedy of separating the sexes in asylums or other places and in various ways preventing intermarriage and the possibilities of perpetuating such a low and degenerate race. Remedies of this sort have been tried successfully in Europe and are now meeting with some success in this country.<br/></p></blockquote><p>In an amusing note with regards to the media’s objectivity, Joe also notes that the reporter for the Baltimore Sun who was covering the trial, HL Mencken, paid the fine meted out to the teacher found guilty.<br/></p></div>",
  "content_text": "Evangelical Outpost has an excellent post on the Scopes evolution trial\n.  As is often the case, the scientists with their pretensions to infallible authority look stupid, arrogant and more than a little evil in retrospect:\nTeaching evolution…and eugenics — The biology book that was used by Scopes was George William Hunter’s Civic Biology….\nThe Races of Man. — At the present time there exist upon the earth five races or varieties of man, each very different from the other in instincts, social customs, and, to an extent, in structure. These are the Ethiopian or negro type, originating in Africa; the Malay or brown race, from the islands of the Pacific; The American Indian; the Mongolian or yellow race, including the natives of China, Japan, and the Eskimos; and finally, the highest type of all, the caucasians, represented by the civilized white inhabitants of Europe and America.\nImprovement of Man. — If the stock of domesticated animals can be improved, it is not unfair to ask if the health and vigor of the future generations of men and women on the earth might not be improved by applying to them the laws of selection. This improvement of the future race has a number of factors in which we as individuals may play a part. These are personal hygiene, selection of healthy mates, and the betterment of the environment.\nEugenics. — When people marry there are certain things that the individual as well as the race should demand. The most important of these is freedom from germ diseases which might be handed down to the offspring. Tuberculosis, syphilis, that dread disease which cripples and kills hundreds of thousands of innocent children, epilepsy, and feeble-mindedness are handicaps which it is not only unfair but criminal to hand down to posterity. The science of being well born is called eugenics.\nThe Jukes. — Studies have been made on a number of different families in this country, in which mental and moral defects were present in one or both of the original parents. The “Jukes” family is a notorious example. The first mother is known as “Margaret, the mother of criminals.” In seventy-five years the progeny of the original generation has cost the state of New York over a million and a quarter dollars, besides giving over to the care of prisons and asylums considerably over a hundred feeble-minded, alcoholic, immoral, or criminal persons. Another case recently studied is the “Kallikak” family.\n(Note: The name Kallikak is fictitious.)\nThis family has been traced back to the War of the Revolution, when a young soldier named Martin Kallikak seduced a feeble-minded girl. She had a feeble-minded son from whom there have been to the present time 480 descendants. Of these 33 were sexually immoral, 24 confirmed drunkards, 3 epileptics, and 143 feeble-minded. The man who started this terrible line of immorality and feeble-mindedness later married a normal Quaker girl. From this couple a line of 496 descendants have come, with no cases of feeble-mindedness. The evidence and the moral speak for themselves!\nParasitism and its Cost to Society. — Hundreds of families such as those described above exist today, spreading disease, immorality, and crime to all parts of this country. The cost to society of such families is very severe. Just as certain animals or plants become parasitic on other plants or animals, these families have become parasitic on society. They not only do harm to others by corrupting, stealing, or spreading disease, but they are actually protected and cared for by the state out of public money. Largely for them the poorhouse and the asylum exist. They take from society, but they give nothing in return. They are true parasites.\nThe Remedy. — If such people were lower animals, we would probably kill them off to prevent them from spreading. Humanity will not allow this, but we do have the remedy of separating the sexes in asylums or other places and in various ways preventing intermarriage and the possibilities of perpetuating such a low and degenerate race. Remedies of this sort have been tried successfully in Europe and are now meeting with some success in this country.\nIn an amusing note with regards to the media’s objectivity, Joe also notes that the reporter for the Baltimore Sun who was covering the trial, HL Mencken, paid the fine meted out to the teacher found guilty.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-12-27T19:32:00+00:00"
}