{
  "url": "https://voxday.net/2010/04/23/always-call-their-bluff/",
  "scraped_at": "2026-01-08T23:25:13.430824",
  "title": "Always call their bluff",
  "date_display": "April 23, 2010",
  "date_iso": "2010-04-23T14:15:00+00:00",
  "date_from_url": "2010-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Never forget that the smarter and more knowledgeable act put on by many atheists is inevitably nothing more than that, an act, and one that has absolutely no basis in empirical reality except for a three-point average advantage in IQ which is almost surely a statistical artifact of their insignificant numbers and self-selected identification.  Do ANY of them, from the Antipope of Oxford on down, know even the first thing about history?  Here’s a lovely example:</p><blockquote><p>WorldNetDaily columnist Vox Day bends over backwards to argue that James Watson’s recent criticism is worse than the Spanish Inquisition’s threats of torture against Galileo. Seriously.</p></blockquote><p>I wouldn’t think a great deal of bending is required in order to establish that simple fact.  Seriously.  Monty Python had it right, no doubt Galileo wasn’t expecting <i>them!</i> And, I wonder, to whom has James Watson been directing his criticism of late?</p><p>On a related note, Chad the Elder quotes David Hart’s piece on the decline of intelligent atheism: <i>“The utter inconsequentiality of contemporary atheism is a social and spiritual catastrophe. Something splendid and irreplaceable has taken leave of our culture–some great moral and intellectual capacity that once inspired the more heroic expressions of belief and unbelief alike. Skepticism and atheism are, at least in their highest manifestations, noble, precious, and even necessary traditions, and even the most fervent of believers should acknowledge that both are often inspired by a profound moral alarm at evil and suffering, at the corruption of religious institutions, at psychological terrorism, at injustices either prompted or abetted by religious doctrines, at arid dogmatisms and inane fideisms, and at worldly power wielded in the name of otherworldly goods. In the best kinds of unbelief, there is something of the moral grandeur of the prophets–a deep and admirable abhorrence of those vicious idolatries that enslave minds and justify our worst cruelties.”</i></p><p>And now we have the spectacle of Dawkinsian atheism, which warns of how a revival of the Spanish Inquisition’s terrible witchburnings during the Thirty Years War, which cost Galileo, Bruno, and Sarah Good their lives at the siege of Jerusalem, poses an imminent threat to science.</p></div>",
  "content_text": "Never forget that the smarter and more knowledgeable act put on by many atheists is inevitably nothing more than that, an act, and one that has absolutely no basis in empirical reality except for a three-point average advantage in IQ which is almost surely a statistical artifact of their insignificant numbers and self-selected identification.  Do ANY of them, from the Antipope of Oxford on down, know even the first thing about history?  Here’s a lovely example:\nWorldNetDaily columnist Vox Day bends over backwards to argue that James Watson’s recent criticism is worse than the Spanish Inquisition’s threats of torture against Galileo. Seriously.\nI wouldn’t think a great deal of bending is required in order to establish that simple fact.  Seriously.  Monty Python had it right, no doubt Galileo wasn’t expecting\nthem!\nAnd, I wonder, to whom has James Watson been directing his criticism of late?\nOn a related note, Chad the Elder quotes David Hart’s piece on the decline of intelligent atheism:\n“The utter inconsequentiality of contemporary atheism is a social and spiritual catastrophe. Something splendid and irreplaceable has taken leave of our culture–some great moral and intellectual capacity that once inspired the more heroic expressions of belief and unbelief alike. Skepticism and atheism are, at least in their highest manifestations, noble, precious, and even necessary traditions, and even the most fervent of believers should acknowledge that both are often inspired by a profound moral alarm at evil and suffering, at the corruption of religious institutions, at psychological terrorism, at injustices either prompted or abetted by religious doctrines, at arid dogmatisms and inane fideisms, and at worldly power wielded in the name of otherworldly goods. In the best kinds of unbelief, there is something of the moral grandeur of the prophets–a deep and admirable abhorrence of those vicious idolatries that enslave minds and justify our worst cruelties.”\nAnd now we have the spectacle of Dawkinsian atheism, which warns of how a revival of the Spanish Inquisition’s terrible witchburnings during the Thirty Years War, which cost Galileo, Bruno, and Sarah Good their lives at the siege of Jerusalem, poses an imminent threat to science.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-23T13:15:00+00:00"
}