{
  "url": "https://voxday.net/2010/04/01/another-rgd-error/",
  "scraped_at": "2026-01-08T23:23:33.242353",
  "title": "Another RGD error",
  "date_display": "April 1, 2010",
  "date_iso": "2010-04-01T09:25:00+00:00",
  "date_from_url": "2010-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GL spots a problem on page 70:</p><p><i>“The unemployment rate is the third major statistic that is considered to be fundamentally unreliable, and like the previous two it is closely watched by politicians, economists, and Wall Street. Like GDP and CPI, it is an estimate, though it is theoretically a little less difficult to estimate due to the obvious fact that there are far more economic actions and goods being sold than there are people in a national economy, so the challenge of figuring out how many of those people are working is somewhat reduced. This does not mean that it is difficult, though, since the definition of employment can vary greatly from one individual to the next.”</i></p><p>The last sentence should read: “This does not mean that it is <b>not</b> difficult….”  I appreciate the correction.  Those inclined to a critical perspective should feel free to commence arguing how this proves that every economic prediction in the book is false, Keynes and Friedman were both correct, Ben Bernanke saved Western civilization, now is the right time to invest in equities, and the global economy has recovered.</p></div>",
  "content_text": "GL spots a problem on page 70:\n“The unemployment rate is the third major statistic that is considered to be fundamentally unreliable, and like the previous two it is closely watched by politicians, economists, and Wall Street. Like GDP and CPI, it is an estimate, though it is theoretically a little less difficult to estimate due to the obvious fact that there are far more economic actions and goods being sold than there are people in a national economy, so the challenge of figuring out how many of those people are working is somewhat reduced. This does not mean that it is difficult, though, since the definition of employment can vary greatly from one individual to the next.”\nThe last sentence should read: “This does not mean that it is\nnot\ndifficult….”  I appreciate the correction.  Those inclined to a critical perspective should feel free to commence arguing how this proves that every economic prediction in the book is false, Keynes and Friedman were both correct, Ben Bernanke saved Western civilization, now is the right time to invest in equities, and the global economy has recovered.",
  "tags": [
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-01T08:25:00+00:00"
}