{
  "url": "https://voxday.net/2010/04/16/breaking-of-euro/",
  "scraped_at": "2026-01-08T23:24:40.537089",
  "title": "The breaking of the Euro",
  "date_display": "April 16, 2010",
  "date_iso": "2010-04-16T09:22:00+00:00",
  "date_from_url": "2010-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the Euro is still much more valuable than it was ten years ago when it was trading at .88 to the dollar, the inherent problems of both the currency and the political entity has never been more obvious.  The European Union cannot survive the dissolution of the Euro.  And the Euro cannot survive the intrinsic economic contradictions of the various member states.  For years, Europhiles have scoffed at my prediction of a complete Eurofailure in which Britain and a few of the smaller member states would withdraw from the EU while Northern and Southern Europe break into two or more apolitical economic blocs, but I don’t see anyone scoffing at <a href=\"http://www.telegraph.co.uk/finance/financetopics/financialcrisis/7594859/Morgan-Stanley-fears-German-exit-from-EMU.html\">the fears of George Soros and other professional investors</a> who follow the European economic scene.</p><blockquote><p>Morgan Stanley has warned that the Greek debt crisis is setting off a chain of events that may prompt German withdrawal from the eurozone, with grim implications for investors caught off-guard.  “The backstop package for Greece  and the ECB’s climb-down on its collateral rules set a bad precedent for other euro area states and make it more likely that the euro area degenerates into a zone of fiscal profligacy, currency weakness, and higher inflationary pressures over time,” said Joachim Fels, head of research, in a note to clients.</p></blockquote><p>As socionomics predicts, political unity is a consequence of economic growth and positive social mood.  As the economy and the social mood worsens, we can expect movement away from political unity in both the USA and Europe.  Since there are very strong indicators of further economic contraction, we can safely expect further trouble for the EU and the Euro.</p></div>",
  "content_text": "While the Euro is still much more valuable than it was ten years ago when it was trading at .88 to the dollar, the inherent problems of both the currency and the political entity has never been more obvious.  The European Union cannot survive the dissolution of the Euro.  And the Euro cannot survive the intrinsic economic contradictions of the various member states.  For years, Europhiles have scoffed at my prediction of a complete Eurofailure in which Britain and a few of the smaller member states would withdraw from the EU while Northern and Southern Europe break into two or more apolitical economic blocs, but I don’t see anyone scoffing at\nthe fears of George Soros and other professional investors\nwho follow the European economic scene.\nMorgan Stanley has warned that the Greek debt crisis is setting off a chain of events that may prompt German withdrawal from the eurozone, with grim implications for investors caught off-guard.  “The backstop package for Greece  and the ECB’s climb-down on its collateral rules set a bad precedent for other euro area states and make it more likely that the euro area degenerates into a zone of fiscal profligacy, currency weakness, and higher inflationary pressures over time,” said Joachim Fels, head of research, in a note to clients.\nAs socionomics predicts, political unity is a consequence of economic growth and positive social mood.  As the economy and the social mood worsens, we can expect movement away from political unity in both the USA and Europe.  Since there are very strong indicators of further economic contraction, we can safely expect further trouble for the EU and the Euro.",
  "tags": [
    "economics",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-16T08:22:00+00:00"
}