{
  "url": "https://voxday.net/2010/04/14/but-but-hes-unelectable/",
  "scraped_at": "2026-01-08T23:24:29.873597",
  "title": "But, but, he’s UNELECTABLE",
  "date_display": "April 14, 2010",
  "date_iso": "2010-04-14T17:45:00+00:00",
  "date_from_url": "2010-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As was the case in 2008, Republicans <a href=\"http://www.rasmussenreports.com/public_content/politics/elections2/election_2012/election_2012_barack_obama_42_ron_paul_41\">are going to have to go with Ron Paul</a> if they want to beat Obama. Even with the administration lurching from one debacle to the next, they cannot win by putting up another hated servant of Wall Street and the neocons like McCain, Romney, Giuliani, Palin, Pawlenty, and Huckabee.  And this will be especially true when the economy is understood to be continuing on its long march netherward:</p><blockquote><p>Pit maverick Republican Congressman Ron Paul against President Obama in a  hypothetical 2012 election match-up, and the race is – virtually dead  even.  A new Rasmussen Reports national telephone survey of likely voters finds  Obama with 42% support and Paul with 41% of the vote. Eleven percent  (11%) prefer some other candidate, and six percent (6%) are undecided. Ask the <a href=\"http://www.rasmussenreports.com/public_content/politics/general_politics/january_2010/65_now_hold_populist_or_mainstream_views\" rel=\"noopener\" target=\"_self\">Political Class</a>, though, and it’s a blowout. While  58% of Mainstream voters favor Paul, 95% of the Political Class vote for Obama.</p></blockquote><p>As the poll indicates, the Republican Party leadership would much rather lose to an approved mandarin like Obama than elect a real republican who would threaten the bifactional ruling party.  No doubt National Review and other “conservative” media sites will soon be finding ways to deprecate these poll findings.</p></div>",
  "content_text": "As was the case in 2008, Republicans\nare going to have to go with Ron Paul\nif they want to beat Obama. Even with the administration lurching from one debacle to the next, they cannot win by putting up another hated servant of Wall Street and the neocons like McCain, Romney, Giuliani, Palin, Pawlenty, and Huckabee.  And this will be especially true when the economy is understood to be continuing on its long march netherward:\nPit maverick Republican Congressman Ron Paul against President Obama in a  hypothetical 2012 election match-up, and the race is – virtually dead  even.  A new Rasmussen Reports national telephone survey of likely voters finds  Obama with 42% support and Paul with 41% of the vote. Eleven percent  (11%) prefer some other candidate, and six percent (6%) are undecided. Ask the\nPolitical Class\n, though, and it’s a blowout. While  58% of Mainstream voters favor Paul, 95% of the Political Class vote for Obama.\nAs the poll indicates, the Republican Party leadership would much rather lose to an approved mandarin like Obama than elect a real republican who would threaten the bifactional ruling party.  No doubt National Review and other “conservative” media sites will soon be finding ways to deprecate these poll findings.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-14T16:45:00+00:00"
}