{
  "url": "https://voxday.net/2010/04/25/calm-before-stor/",
  "scraped_at": "2026-01-08T23:25:24.435880",
  "title": "The calm before the storm",
  "date_display": "April 25, 2010",
  "date_iso": "2010-04-25T19:04:00+00:00",
  "date_from_url": "2010-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In response to <a href=\"http://drhelen.blogspot.com/2010/04/return-of-great-depression.html\">Dr. Helen’s question</a>, the answer is an unequivocal “yes”.</p><blockquote><p>Glenn just got Vox Day’s new book in the mail, The Return of the Great Depression, so I picked it up and started reading. It is not for the faint of heart or the economically hopeful….  I have noticed that house sales (at least in the lower prices) in our area seem to be picking up and people seem to be out buying again–or at least, they are in the stores. I wonder if this is just the calm before the storm or whether things are improving?</p></blockquote><p><a href=\"http://2.bp.blogspot.com/_3UXl0oMYPLs/S5tu0zS1J9I/AAAAAAAAAL4/VlDNorcO8p0/s1600-h/Debt-sector-04-09.png\">This graph on debt outstanding by sector </a>should explain why things look superficially as if they are improving, while they are actually doing absolutely nothing of the kind.  Keep in mind that Q2 2010 – in other words, now – marks the beginning of the end of the massive federal stimulus plan that has allowed <a href=\"http://www.wnd.com/images/markettickerchart.jpg\">the substitution of G for C</a> over the last six quarters.  But as the first graph shows, that substitution cannot continue indefinitely.  It would require deficits that are <i>multiples</i> of Obama’s record-setting 2009 and 2010 deficits and it wouldn’t ultimately work any better than either the Bush or Obama stimuli did.</p><p>And <a href=\"http://pajamasmedia.com/instapundit/98189/\">this is an amusing aside</a> from Dr. Helen’s husband:</p><blockquote><p>SORRY, WE’RE STILL SCREWED: Reihan Salam says we’re heading into a decade-long economic buzz saw. <i>“We are propping up the most rotten sectors of the economy and diverting talent that would otherwise shift into the new interrelated systems that are slowly emerging—and this emergence will prove very slow indeed once the inevitable tax burden required to prop up aging yet politically powerful sectors hits.”</i> Let’s hope this is wrong, but it’s basically an explanation of why a powerful federal government, unconstrained by traditional limits, is a bad idea. Oh, well, at least I’ve got Vox Day’s book to cheer me up . . . .</p></blockquote></div>",
  "content_text": "In response to\nDr. Helen’s question\n, the answer is an unequivocal “yes”.\nGlenn just got Vox Day’s new book in the mail, The Return of the Great Depression, so I picked it up and started reading. It is not for the faint of heart or the economically hopeful….  I have noticed that house sales (at least in the lower prices) in our area seem to be picking up and people seem to be out buying again–or at least, they are in the stores. I wonder if this is just the calm before the storm or whether things are improving?\nThis graph on debt outstanding by sector\nshould explain why things look superficially as if they are improving, while they are actually doing absolutely nothing of the kind.  Keep in mind that Q2 2010 – in other words, now – marks the beginning of the end of the massive federal stimulus plan that has allowed\nthe substitution of G for C\nover the last six quarters.  But as the first graph shows, that substitution cannot continue indefinitely.  It would require deficits that are\nmultiples\nof Obama’s record-setting 2009 and 2010 deficits and it wouldn’t ultimately work any better than either the Bush or Obama stimuli did.\nAnd\nthis is an amusing aside\nfrom Dr. Helen’s husband:\nSORRY, WE’RE STILL SCREWED: Reihan Salam says we’re heading into a decade-long economic buzz saw.\n“We are propping up the most rotten sectors of the economy and diverting talent that would otherwise shift into the new interrelated systems that are slowly emerging—and this emergence will prove very slow indeed once the inevitable tax burden required to prop up aging yet politically powerful sectors hits.”\nLet’s hope this is wrong, but it’s basically an explanation of why a powerful federal government, unconstrained by traditional limits, is a bad idea. Oh, well, at least I’ve got Vox Day’s book to cheer me up . . . .",
  "tags": [
    "economics",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-25T18:04:00+00:00"
}