{
  "url": "https://voxday.net/2010/04/21/cross-of-goldman/",
  "scraped_at": "2026-01-08T23:25:03.294171",
  "title": "The cross of Goldman",
  "date_display": "April 21, 2010",
  "date_iso": "2010-04-21T17:00:00+00:00",
  "date_from_url": "2010-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Republicans <a href=\"http://www.politico.com/news/stories/0410/36097.html\">are determined to crucify themselves</a> upon it:</p><blockquote><p>Rep. Darrell Issa, the top Republican on the House Oversight committee, is demanding a slew of documents from the Securities and Exchange Commission, asserting that the timing of civil charges against Goldman Sachs raises “serious questions about the commission’s independence and impartiality.”</p><p>Issa’s letter, addressed to SEC Chairwoman Mary Schapiro and signed by eight other House Republicans, asks whether the commission had any contact about the case, prior to its public release, with White House aides, Democratic Party committee officials, or members of Congress or their staff.</p><p>“[W]e are concerned that politics have unduly influenced the decision and timing of the commission’s controversial enforcement action against Goldman,” Issa writes.</p></blockquote><p>Beautiful!  Simply beautiful!  The Republicans are so astoundingly stupid, so uncompromisingly idiotic, that they are actually going to take on the SEC <i>in defense of Goldman Sachs</i>!  Apparently they learned absolutely nothing from giving away the presidency in return for the banking bailout, now they’re threatening to get Obama re-elected on behalf of the Vampire Squid… who gave more money to Obama and the Democrats in 2008 anyhow.</p><p>No wonder they’re called the stupid party.</p></div>",
  "content_text": "The Republicans\nare determined to crucify themselves\nupon it:\nRep. Darrell Issa, the top Republican on the House Oversight committee, is demanding a slew of documents from the Securities and Exchange Commission, asserting that the timing of civil charges against Goldman Sachs raises “serious questions about the commission’s independence and impartiality.”\nIssa’s letter, addressed to SEC Chairwoman Mary Schapiro and signed by eight other House Republicans, asks whether the commission had any contact about the case, prior to its public release, with White House aides, Democratic Party committee officials, or members of Congress or their staff.\n“[W]e are concerned that politics have unduly influenced the decision and timing of the commission’s controversial enforcement action against Goldman,” Issa writes.\nBeautiful!  Simply beautiful!  The Republicans are so astoundingly stupid, so uncompromisingly idiotic, that they are actually going to take on the SEC\nin defense of Goldman Sachs\n!  Apparently they learned absolutely nothing from giving away the presidency in return for the banking bailout, now they’re threatening to get Obama re-elected on behalf of the Vampire Squid… who gave more money to Obama and the Democrats in 2008 anyhow.\nNo wonder they’re called the stupid party.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-21T16:00:00+00:00"
}