{
  "url": "https://voxday.net/2010/04/14/democrats-iz-smar/",
  "scraped_at": "2026-01-08T23:24:28.050637",
  "title": "Democrats iz smart",
  "date_display": "April 14, 2010",
  "date_iso": "2010-04-14T15:56:00+00:00",
  "date_from_url": "2010-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ever since I was in college, I always found it remarkably amusing that Democrats thought they were the more intelligent party by virtue of the fact that Ivy League academics tend to be left-wingers.  They always seemed to forget that there are more crack whores across the country than there are Ivy League professors.  Anyhow, <a href=\"http://isteve.blogspot.com/2010/04/politics-of-cable-network-audiences.html\">courtesy of Steve Sailer</a>, this chart of preferred cable channels by party should further tread the myth of the intelligent Democrat into the mire.  SoapNet, VH1, and Nick at Nite… yes, those are most certainly indicators of the American intellectual elite.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.nmrpp.com/images/research-graph-target.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"300\" src=\"http://www.nmrpp.com/images/research-graph-target.jpg\" width=\"400\"/></a></div></div>",
  "content_text": "Ever since I was in college, I always found it remarkably amusing that Democrats thought they were the more intelligent party by virtue of the fact that Ivy League academics tend to be left-wingers.  They always seemed to forget that there are more crack whores across the country than there are Ivy League professors.  Anyhow,\ncourtesy of Steve Sailer\n, this chart of preferred cable channels by party should further tread the myth of the intelligent Democrat into the mire.  SoapNet, VH1, and Nick at Nite… yes, those are most certainly indicators of the American intellectual elite.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-14T14:56:00+00:00"
}