{
  "url": "https://voxday.net/2010/04/28/enders-arena/",
  "scraped_at": "2026-01-08T23:25:42.293411",
  "title": "Ender’s Arena",
  "date_display": "April 28, 2010",
  "date_iso": "2010-04-28T21:02:00+00:00",
  "date_from_url": "2010-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After a speedy game of old favorite <i>War at Sea</i> in which the brilliant and extraordinarily handsome Axis admiral took advantage of Ender’s inexplicable failure to control the Mediterranean in order to steal an early Turn 5 Axis Major Victory, it was decided that we would give the Avalon Hill classic <i>Gladiator</i> a try.</p><p>Ender’s first attempt in the Arena was remarkably short, coming as it did to a speedy end in the fifth phase of the first turn.  His medium gladiator, Felix, was arguably the most inaptly named gladiator to ever stumble across the sands of the <i>Colosseo</i>.  Felix collided twice with my champion Varius, a light gladiator who didn’t wear much armor but carried a large shield that gives +2 Impact Factors.  Felix stumbled after the first collision, at which point Varius charged him, crashed into him behind the weight of that large shield, and Felix was out cold.  Ender was more amused than disgusted, but wouldn’t even bother to consult the Moment of Truth chart to determine the unlucky Felix’s fate.  *schlunk*</p><p>The undefeated Varius, whose wins date back over a period of ten years thanks to some old battles with Big Chilly and the Missile Digit, next met Ender’s light, but brawny Aptus.  Aptus quickly put his massive +4 Strength to work, smashing into Varius and stunning him, then methodically bashing Varius’s large shield to bits.  Varius repeatedly sought to get positional advantage to counteract the stun penalty he could not seem to shake, but to little avail.</p><p>After a few furious engagements, the two gladiators found themselves facing each other.  Varius was vision-impaired, bleeding from a serious head wound, and was lacking both his shield and his weapon, which had been knocked from his grasp when parrying a thunderous head stroke.  Aptus had clearly been getting the better of the combat, but was badly wounded in the chest due to four targeted attacks that had been inadequately blocked.  Varius managed to elude Aptus’s subsequent charge and circled around behind to retrieve his sword, then immediately spun around to score with an all-or-nothing thrust to the chest that brought Aptus to death’s door.</p><p>In the first two phases of the fifth turn, Aptus tried to retreat, but Varius successfully anticipated his loss of nerve and forced two more engagements that both came within a single point of finishing Aptus off.  But in the third phase, Varius made the mistake of sidestepping forward while Aptus turned and plowed straight ahead into the smaller, lighter, and shieldless gladiator.  The combination of strength, shield, and movement advantages gave Aptus a +7 mod to the collision roll; Ender picked the perfect time to roll boxcars for a 19 that sent Varius sprawling unconscious on the bloody sands.</p><p>We were in accord that Varius merited Missus, as his Attack CF – Defense CF was +44 in only eight engagements.  But the fans in the <i>Colosseo</i> were apparently in a bloodthirsty mood that day, as they nevertheless turned their thumbs down.  *schlunk*  And Varius the light gladiator was no more.</p></div>",
  "content_text": "After a speedy game of old favorite\nWar at Sea\nin which the brilliant and extraordinarily handsome Axis admiral took advantage of Ender’s inexplicable failure to control the Mediterranean in order to steal an early Turn 5 Axis Major Victory, it was decided that we would give the Avalon Hill classic\nGladiator\na try.\nEnder’s first attempt in the Arena was remarkably short, coming as it did to a speedy end in the fifth phase of the first turn.  His medium gladiator, Felix, was arguably the most inaptly named gladiator to ever stumble across the sands of the\nColosseo\n.  Felix collided twice with my champion Varius, a light gladiator who didn’t wear much armor but carried a large shield that gives +2 Impact Factors.  Felix stumbled after the first collision, at which point Varius charged him, crashed into him behind the weight of that large shield, and Felix was out cold.  Ender was more amused than disgusted, but wouldn’t even bother to consult the Moment of Truth chart to determine the unlucky Felix’s fate.  *schlunk*\nThe undefeated Varius, whose wins date back over a period of ten years thanks to some old battles with Big Chilly and the Missile Digit, next met Ender’s light, but brawny Aptus.  Aptus quickly put his massive +4 Strength to work, smashing into Varius and stunning him, then methodically bashing Varius’s large shield to bits.  Varius repeatedly sought to get positional advantage to counteract the stun penalty he could not seem to shake, but to little avail.\nAfter a few furious engagements, the two gladiators found themselves facing each other.  Varius was vision-impaired, bleeding from a serious head wound, and was lacking both his shield and his weapon, which had been knocked from his grasp when parrying a thunderous head stroke.  Aptus had clearly been getting the better of the combat, but was badly wounded in the chest due to four targeted attacks that had been inadequately blocked.  Varius managed to elude Aptus’s subsequent charge and circled around behind to retrieve his sword, then immediately spun around to score with an all-or-nothing thrust to the chest that brought Aptus to death’s door.\nIn the first two phases of the fifth turn, Aptus tried to retreat, but Varius successfully anticipated his loss of nerve and forced two more engagements that both came within a single point of finishing Aptus off.  But in the third phase, Varius made the mistake of sidestepping forward while Aptus turned and plowed straight ahead into the smaller, lighter, and shieldless gladiator.  The combination of strength, shield, and movement advantages gave Aptus a +7 mod to the collision roll; Ender picked the perfect time to roll boxcars for a 19 that sent Varius sprawling unconscious on the bloody sands.\nWe were in accord that Varius merited Missus, as his Attack CF – Defense CF was +44 in only eight engagements.  But the fans in the\nColosseo\nwere apparently in a bloodthirsty mood that day, as they nevertheless turned their thumbs down.  *schlunk*  And Varius the light gladiator was no more.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-28T20:02:00+00:00"
}