{
  "url": "https://voxday.net/2010/04/07/evolution-finally-observed/",
  "scraped_at": "2026-01-08T23:23:57.243438",
  "title": "Human evolution observed in the wild",
  "date_display": "April 7, 2010",
  "date_iso": "2010-04-07T14:21:00+00:00",
  "date_from_url": "2010-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After only 150 years, Man finally <a href=\"http://news.yahoo.com/s/nm/20100406/sc_nm/us_science_lizard\">witnesses evolution from one distinct species into another</a>:</p><blockquote><p>A dragon-sized, fruit-eating lizard that lives in the trees on the northern Philippines island of Luzon has been confirmed as a new species, scientists reported on Tuesday.  Hunted for its tasty flesh, the brightly colored forest monitor lizard can grow to more than six feet in length but weighs only about 22 pounds (10 kg), said Rafe Brown of the University of Kansas, whose team confirmed the find.</p><p>“It lives up in trees, so it can’t get as massive as the Komodo dragon, a huge thing that eats large amounts of fresh meat,” Brown said by telephone. “This thing is a fruit-eater and it’s only the third fruit-eating lizard in the world.”</p></blockquote><p>I think it’s remarkable proof of the power of natural selection.  And to think that it only takes three generations for <i>homo sapiens</i> to evolve into <i>draco arboris</i>!  No doubt the families of those missing Japanese soldiers will not only be relieved to know the ultimate fate of their loved ones, but proud to know that both the Sakurakai and Shintaro Ishihara were right and the Japanese are, in fact, the most highly evolved form of Man on the planet.</p><p>Of course, we had better wipe these dragons out at once before the pressure placed upon them by quasi-cannibalistic Philippinos causes them to evolve the ability to breathe fire.  And in other evolution news, <a href=\"http://www.telegraph.co.uk/science/evolution/7550033/Missing-link-between-man-and-apes-found.html\">the Missing Link was found again</a>.  What are the odds that it lasts longer than last year’s extraordinary fossil find, Ida?</p></div>",
  "content_text": "After only 150 years, Man finally\nwitnesses evolution from one distinct species into another\n:\nA dragon-sized, fruit-eating lizard that lives in the trees on the northern Philippines island of Luzon has been confirmed as a new species, scientists reported on Tuesday.  Hunted for its tasty flesh, the brightly colored forest monitor lizard can grow to more than six feet in length but weighs only about 22 pounds (10 kg), said Rafe Brown of the University of Kansas, whose team confirmed the find.\n“It lives up in trees, so it can’t get as massive as the Komodo dragon, a huge thing that eats large amounts of fresh meat,” Brown said by telephone. “This thing is a fruit-eater and it’s only the third fruit-eating lizard in the world.”\nI think it’s remarkable proof of the power of natural selection.  And to think that it only takes three generations for\nhomo sapiens\nto evolve into\ndraco arboris\n!  No doubt the families of those missing Japanese soldiers will not only be relieved to know the ultimate fate of their loved ones, but proud to know that both the Sakurakai and Shintaro Ishihara were right and the Japanese are, in fact, the most highly evolved form of Man on the planet.\nOf course, we had better wipe these dragons out at once before the pressure placed upon them by quasi-cannibalistic Philippinos causes them to evolve the ability to breathe fire.  And in other evolution news,\nthe Missing Link was found again\n.  What are the odds that it lasts longer than last year’s extraordinary fossil find, Ida?",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-07T13:21:00+00:00"
}