{
  "url": "https://voxday.net/2010/04/13/failure-to-communicate-2/",
  "scraped_at": "2026-01-08T23:24:22.545680",
  "title": "A failure to communicate",
  "date_display": "April 13, 2010",
  "date_iso": "2010-04-13T17:15:00+00:00",
  "date_from_url": "2010-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I believe that’s what we have here:</p><blockquote><p>I believe that when you say that Catholics are not Christian you are wrong.</p></blockquote><p>I am not in the business of deciding who is and who is not a Christian.  What I was referring to when I wrote “although many Catholics are Christians, many are not by any reasonable Bible-based definition of the latter term” is Catholics who themselves abjure Christianity.  There are no shortage of confirmed Catholics who reject the label “Christian” but nevertheless describe themselves as Catholics.  Indeed, in Italy, they probably make up the majority of Catholics.  While they are cultural Catholics, one cannot reasonably describe them as Christians <i>because they themselves will tell you they are not</i>.</p><p>But speaking of Catholics, it is good to see that the Vatican is finally beginning to lay the greater part of the blame for their priestly sexual abuse scandal <a href=\"http://www.timesonline.co.uk/tol/comment/faith/article7096149.ece\">where it properly belongs</a>, on homosexual priests who should never have been admitted to the priesthood in the first place.  The Catholic hierarchy is still responsible, of course, as it was their decision to accept those priests and their failure to deal appropriately with the predictable consequences of that decision when they eventually surfaced.</p><blockquote><p>The Holy See’s second-highest prelate after the Pope has blamed homosexuals for the paedophile crisis.  Cardinal Tarcisio Bertone, the Vatican’s Secretary of State, said that the child rape scandal that is threatening the moral authority of the Roman Catholic Church worldwide is linked to homosexuality and not celibacy among priests.</p></blockquote><p>I can’t help but find it funny that the example cited by the Times in an obvious attempt to surreptitiously rebut Bertone’s statement refers to a “paedophile” priest having sex with a young girl from the time she was 16 until she was 20.  By this standard, pretty much every single college man in the country is a pedophile.  The man was clearly not fit for the priesthood and should have been stripped of his office long ago, but on the basis of the example cited, he was just as clearly not a pedophile.</p></div>",
  "content_text": "I believe that’s what we have here:\nI believe that when you say that Catholics are not Christian you are wrong.\nI am not in the business of deciding who is and who is not a Christian.  What I was referring to when I wrote “although many Catholics are Christians, many are not by any reasonable Bible-based definition of the latter term” is Catholics who themselves abjure Christianity.  There are no shortage of confirmed Catholics who reject the label “Christian” but nevertheless describe themselves as Catholics.  Indeed, in Italy, they probably make up the majority of Catholics.  While they are cultural Catholics, one cannot reasonably describe them as Christians\nbecause they themselves will tell you they are not\n.\nBut speaking of Catholics, it is good to see that the Vatican is finally beginning to lay the greater part of the blame for their priestly sexual abuse scandal\nwhere it properly belongs\n, on homosexual priests who should never have been admitted to the priesthood in the first place.  The Catholic hierarchy is still responsible, of course, as it was their decision to accept those priests and their failure to deal appropriately with the predictable consequences of that decision when they eventually surfaced.\nThe Holy See’s second-highest prelate after the Pope has blamed homosexuals for the paedophile crisis.  Cardinal Tarcisio Bertone, the Vatican’s Secretary of State, said that the child rape scandal that is threatening the moral authority of the Roman Catholic Church worldwide is linked to homosexuality and not celibacy among priests.\nI can’t help but find it funny that the example cited by the Times in an obvious attempt to surreptitiously rebut Bertone’s statement refers to a “paedophile” priest having sex with a young girl from the time she was 16 until she was 20.  By this standard, pretty much every single college man in the country is a pedophile.  The man was clearly not fit for the priesthood and should have been stripped of his office long ago, but on the basis of the example cited, he was just as clearly not a pedophile.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-13T16:15:00+00:00"
}