{
  "url": "https://voxday.net/2010/04/18/hispanics-in-mis/",
  "scraped_at": "2026-01-08T23:24:48.625767",
  "title": "Hispanics in the mist",
  "date_display": "April 18, 2010",
  "date_iso": "2010-04-18T13:31:00+00:00",
  "date_from_url": "2010-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One must salute the bravery of <a href=\"http://latimesblogs.latimes.com/comments_blog/2010/04/can-two-white-women-effectively-write-about-la-immigrant-life.html\">these two intrepid amateur zoologists</a> as they go out into the deep, dark, wilderness of Los Angeles:</p><blockquote><p>Can journalists only report about the issues of their own race?  That’s the question being debated about two white journalists who decided to embed themselves in a home in the MacArthur Park neighborhood with at least seven undocumented Mexicans to “learn Spanish so that we can better report our native city.”</p><p>Reporter Devin Browne and photographer Kara Mears are documenting the yearlong project on a blog called The Entryway. The name is derived from the fact that the two share a bed in the apartment’s front entryway. They both pay rent to the host family.  The blog, which started in March after a two-year search for a host family, has led to fair deal of criticism, and praise, from reporters and bloggers. Some call the project voyeuristic.</p></blockquote><p>The most amusing part of what should prove to be a thoroughly amusing anthropological experiment on the two white girls was the fact that it took them <i>two years</i> to find a place they were willing to live.  My guess is that the reporter will come to her senses and quit both the project and journalism the first time a cockroach gets in her hair while the photographer will get pregnant after a series of short affairs with gangbangers and eventually be arrested for being in possession of a handgun used to murder a convenience store clerk.</p><p>I do so enjoy the NPR/SWPL approach to every subject they “investigate”.  It doesn’t matter if they are ice-fishing in Minnesota, climbing mountains in Tibet or chewing qat with jihadists in Yemen, look past the details and the story always ends sounds exactly as if Dian Fossey had written it.  Because no matter what the subject nominally is, the only thing NPR/SWPL ever write about is how the nominal subject makes them feel.</p></div>",
  "content_text": "One must salute the bravery of\nthese two intrepid amateur zoologists\nas they go out into the deep, dark, wilderness of Los Angeles:\nCan journalists only report about the issues of their own race?  That’s the question being debated about two white journalists who decided to embed themselves in a home in the MacArthur Park neighborhood with at least seven undocumented Mexicans to “learn Spanish so that we can better report our native city.”\nReporter Devin Browne and photographer Kara Mears are documenting the yearlong project on a blog called The Entryway. The name is derived from the fact that the two share a bed in the apartment’s front entryway. They both pay rent to the host family.  The blog, which started in March after a two-year search for a host family, has led to fair deal of criticism, and praise, from reporters and bloggers. Some call the project voyeuristic.\nThe most amusing part of what should prove to be a thoroughly amusing anthropological experiment on the two white girls was the fact that it took them\ntwo years\nto find a place they were willing to live.  My guess is that the reporter will come to her senses and quit both the project and journalism the first time a cockroach gets in her hair while the photographer will get pregnant after a series of short affairs with gangbangers and eventually be arrested for being in possession of a handgun used to murder a convenience store clerk.\nI do so enjoy the NPR/SWPL approach to every subject they “investigate”.  It doesn’t matter if they are ice-fishing in Minnesota, climbing mountains in Tibet or chewing qat with jihadists in Yemen, look past the details and the story always ends sounds exactly as if Dian Fossey had written it.  Because no matter what the subject nominally is, the only thing NPR/SWPL ever write about is how the nominal subject makes them feel.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-18T12:31:00+00:00"
}