{
  "url": "https://voxday.net/2010/04/21/intellectual-poverty-of-new-atheists/",
  "scraped_at": "2026-01-08T23:25:01.476060",
  "title": "The intellectual poverty of the New Atheists",
  "date_display": "April 21, 2010",
  "date_iso": "2010-04-21T14:30:00+00:00",
  "date_from_url": "2010-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would appear I am not the only one who has noticed.  David B. Hart’s highly amusing essay at First Things pours disdain on the best efforts of a murder of atheists <a href=\"http://www.firstthings.com/article/2010/04/believe-it-or-not\">to rationalize their neurosociological shortcomings in public</a>:</p><blockquote><p>Take, for instance, the recently published <i>50 Voices of Disbelief: Why We Are Atheists</i>. Simple probability, surely, would seem to dictate that a collection of essays by fifty fairly intelligent and zealous atheists would contain at least one logically compelling, deeply informed, morally profound, or conceptually arresting argument for not believing in God. Certainly that was my hope in picking it up. Instead, I came away from the whole drab assemblage of preachments and preenings feeling rather as if I had just left a large banquet at which I had been made to dine entirely on crushed ice and water vapor.</p><p>To be fair, the shallowness is not evenly distributed. Some of the writers exhibit a measure of wholesome tentativeness in making their cases, and as a rule the quality of the essays is inversely proportionate to the air of authority their authors affect. For this reason, the philosophers—who are no better than their fellow contributors at reasoning, but who have better training in giving even specious arguments some appearance of systematic form—tend to come off as the most insufferable contributors….</p><p>The scientists fare almost as poorly. Among these, Victor Stenger is the most recklessly self-confident, but his inability to differentiate the physical distinction between something and nothing (in the sense of “not anything as such”) from the logical distinction between existence and nonexistence renders his argument empty. The contributors drawn from other fields offer nothing better. The Amazing Randi, being a magician, knows that there is quite a lot of credulity out there. The historian of science Michael Shermer notes that there are many, many different and even contradictory systems of belief. The journalist Emma Tom had a psychotic scripture teacher when she was a girl. Et, as they say, cetera. The whole project probably reaches its reductio ad absurdum when the science-fiction writer Sean Williams explains that he learned to reject supernaturalism in large part from having grown up watching Doctor Who.</p></blockquote><p>You really have to have read several of the New Atheist books to fully comprehend the astonishing lack of intellect, knowledge, and reason on offer.  And I note with great amusement that the utter speciousness of Richard Dawkins’s “unrebuttable” argument does not go unremarked.</p><p><i>“But something worse than mere misunderstanding lies at the base of Dawkins’ own special version of the argument from infinite regress—a version in which he takes a pride of almost maternal fierceness….  But all the evidence suggests that Dawkins has never understood the point being made, and it is his unfortunate habit contemptuously to dismiss as meaningless concepts whose meanings elude him. Frankly, going solely on the record of his published work, it would be rash to assume that Dawkins has ever learned how to reason his way to the end of a simple syllogism.<br> “</br></i><br> It would be rash indeed.  The “unrebuttable” Ultimate 747 argument, which Dawkins himself declares is the central argument of <i>The God Delusion</i> isn’t just wrong, it is provably wrong at multiple steps along the way.  To say that it “scarcely rises to the level of nonsense” is almost too kind.  This is precisely why so many intelligent individuals, religious and irreligious, have contempt for Richard Dawkins and why Dawkins has largely abandoned all debate.  Having fooled a number of moderately intelligent people into thinking that he knows what he is talking about, he is now desperate to avoid being exposed for the charlatan and logical incompetent that he quite clearly and demonstrably is.</br></p></div>",
  "content_text": "It would appear I am not the only one who has noticed.  David B. Hart’s highly amusing essay at First Things pours disdain on the best efforts of a murder of atheists\nto rationalize their neurosociological shortcomings in public\n:\nTake, for instance, the recently published\n50 Voices of Disbelief: Why We Are Atheists\n. Simple probability, surely, would seem to dictate that a collection of essays by fifty fairly intelligent and zealous atheists would contain at least one logically compelling, deeply informed, morally profound, or conceptually arresting argument for not believing in God. Certainly that was my hope in picking it up. Instead, I came away from the whole drab assemblage of preachments and preenings feeling rather as if I had just left a large banquet at which I had been made to dine entirely on crushed ice and water vapor.\nTo be fair, the shallowness is not evenly distributed. Some of the writers exhibit a measure of wholesome tentativeness in making their cases, and as a rule the quality of the essays is inversely proportionate to the air of authority their authors affect. For this reason, the philosophers—who are no better than their fellow contributors at reasoning, but who have better training in giving even specious arguments some appearance of systematic form—tend to come off as the most insufferable contributors….\nThe scientists fare almost as poorly. Among these, Victor Stenger is the most recklessly self-confident, but his inability to differentiate the physical distinction between something and nothing (in the sense of “not anything as such”) from the logical distinction between existence and nonexistence renders his argument empty. The contributors drawn from other fields offer nothing better. The Amazing Randi, being a magician, knows that there is quite a lot of credulity out there. The historian of science Michael Shermer notes that there are many, many different and even contradictory systems of belief. The journalist Emma Tom had a psychotic scripture teacher when she was a girl. Et, as they say, cetera. The whole project probably reaches its reductio ad absurdum when the science-fiction writer Sean Williams explains that he learned to reject supernaturalism in large part from having grown up watching Doctor Who.\nYou really have to have read several of the New Atheist books to fully comprehend the astonishing lack of intellect, knowledge, and reason on offer.  And I note with great amusement that the utter speciousness of Richard Dawkins’s “unrebuttable” argument does not go unremarked.\n“But something worse than mere misunderstanding lies at the base of Dawkins’ own special version of the argument from infinite regress—a version in which he takes a pride of almost maternal fierceness….  But all the evidence suggests that Dawkins has never understood the point being made, and it is his unfortunate habit contemptuously to dismiss as meaningless concepts whose meanings elude him. Frankly, going solely on the record of his published work, it would be rash to assume that Dawkins has ever learned how to reason his way to the end of a simple syllogism.\n“\nIt would be rash indeed.  The “unrebuttable” Ultimate 747 argument, which Dawkins himself declares is the central argument of\nThe God Delusion\nisn’t just wrong, it is provably wrong at multiple steps along the way.  To say that it “scarcely rises to the level of nonsense” is almost too kind.  This is precisely why so many intelligent individuals, religious and irreligious, have contempt for Richard Dawkins and why Dawkins has largely abandoned all debate.  Having fooled a number of moderately intelligent people into thinking that he knows what he is talking about, he is now desperate to avoid being exposed for the charlatan and logical incompetent that he quite clearly and demonstrably is.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-21T13:30:00+00:00"
}