{
  "url": "https://voxday.net/2010/04/26/intrinsic-weakness-of-secular-society/",
  "scraped_at": "2026-01-08T23:25:28.201924",
  "title": "The intrinsic weakness of secular society",
  "date_display": "April 26, 2010",
  "date_iso": "2010-04-26T14:15:00+00:00",
  "date_from_url": "2010-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was not a fan of Ross Douthat in the past, but I have to admit that he has really risen to the occasion more often than not and is rapidly becoming the most readable and interesting columnist at the New York Times. <a href=\"http://www.nytimes.com/2010/04/26/opinion/26douthat.html\">In today’s column</a>, he succinctly points out something that I have less successfully been attempting to articulate for some time:</p><blockquote><p>In a way, the muzzling of “South Park” is no more disquieting than any other example of Western institutions’ cowering before the threat of Islamist violence. It’s no worse than the German opera house that temporarily suspended performances of Mozart’s opera “Idomeneo” because it included a scene featuring Muhammad’s severed head. Or Random House’s decision to cancel the publication of a novel about the prophet’s third wife. Or Yale University Press’s refusal to publish the controversial Danish cartoons … in a book about the Danish cartoon crisis. Or the fact that various Western journalists, intellectuals and politicians — the list includes Oriana Fallaci in Italy, Michel Houellebecq in France, Mark Steyn in Canada and Geert Wilders in the Netherlands — have been hauled before courts and “human rights” tribunals, in supposedly liberal societies, for daring to give offense to Islam….</p><p>Happily, today’s would-be totalitarians are probably too marginal to take full advantage. This isn’t Weimar Germany, and Islam’s radical fringe is still a fringe, rather than an existential enemy.  For that, we should be grateful. Because if a violent fringe is capable of inspiring so much cowardice and self-censorship, it suggests that there’s enough rot in our institutions that a stronger foe might be able to bring them crashing down.</p></blockquote><p>The intrinsic problem with secular society is essentially atheism’s warrant problem writ large.  Just as atheism permits individual moralities, but no objective and universally applicable moral structure, secular society has no material foundations upon which to sustain itself.  The attempt to manufacture theoretical foundations are fruitless, because the perfectly reasonable hypotheses of intellectuals working in the abstract have no connection to the way in which everyone else actually lives their lives.</p><p>Hence the irrelevance of those who suggest that morals “could be” based on a happiness/suffering metric or ask “why couldn’t” a society be founded on one proposed secular principle or another.  Many of these ideas could, in theory, exist, but the empirical and observable reality is that they do not exist, they have never existed, no one abides by them, and no one is actually willing to risk anything to ensure their survival.</p><p>It is now eminently clear that those who are quick to criticize the Spanish Inquisition 176 years after its abolition would not have uttered a peep against it if they lived in Queen Isabella’s Castile.  The ideals that the secularists have proposed to substitute for the Christian values of the traditional West are quite clearly counterfeit, and unlike Christianity, cannot survive in competition with more rigorous rivals.  As can be seen in India, Africa, and parts of Asia, only paganism and Christian revival are capable of competing successfully with aggressive Islam, which is why it is increasingly apparent that the 20th century secular societies will turn out to be as unsustainable and nearly as short-lived as the financial system that made them possible.</p><p>There are already signs that secularism is devolving into pagan global Gaianism.  I suspect that this new religion will become Islam’s primary rival in the post-Christian West, even as Christianity continues to grow exposively in the East and South.  This is not to say that Christianity will not survive in the West, of course it will continue to be a significant influence, but it may not be the culturally dominant religion that it has been throughout previous centuries.</p></div>",
  "content_text": "I was not a fan of Ross Douthat in the past, but I have to admit that he has really risen to the occasion more often than not and is rapidly becoming the most readable and interesting columnist at the New York Times.\nIn today’s column\n, he succinctly points out something that I have less successfully been attempting to articulate for some time:\nIn a way, the muzzling of “South Park” is no more disquieting than any other example of Western institutions’ cowering before the threat of Islamist violence. It’s no worse than the German opera house that temporarily suspended performances of Mozart’s opera “Idomeneo” because it included a scene featuring Muhammad’s severed head. Or Random House’s decision to cancel the publication of a novel about the prophet’s third wife. Or Yale University Press’s refusal to publish the controversial Danish cartoons … in a book about the Danish cartoon crisis. Or the fact that various Western journalists, intellectuals and politicians — the list includes Oriana Fallaci in Italy, Michel Houellebecq in France, Mark Steyn in Canada and Geert Wilders in the Netherlands — have been hauled before courts and “human rights” tribunals, in supposedly liberal societies, for daring to give offense to Islam….\nHappily, today’s would-be totalitarians are probably too marginal to take full advantage. This isn’t Weimar Germany, and Islam’s radical fringe is still a fringe, rather than an existential enemy.  For that, we should be grateful. Because if a violent fringe is capable of inspiring so much cowardice and self-censorship, it suggests that there’s enough rot in our institutions that a stronger foe might be able to bring them crashing down.\nThe intrinsic problem with secular society is essentially atheism’s warrant problem writ large.  Just as atheism permits individual moralities, but no objective and universally applicable moral structure, secular society has no material foundations upon which to sustain itself.  The attempt to manufacture theoretical foundations are fruitless, because the perfectly reasonable hypotheses of intellectuals working in the abstract have no connection to the way in which everyone else actually lives their lives.\nHence the irrelevance of those who suggest that morals “could be” based on a happiness/suffering metric or ask “why couldn’t” a society be founded on one proposed secular principle or another.  Many of these ideas could, in theory, exist, but the empirical and observable reality is that they do not exist, they have never existed, no one abides by them, and no one is actually willing to risk anything to ensure their survival.\nIt is now eminently clear that those who are quick to criticize the Spanish Inquisition 176 years after its abolition would not have uttered a peep against it if they lived in Queen Isabella’s Castile.  The ideals that the secularists have proposed to substitute for the Christian values of the traditional West are quite clearly counterfeit, and unlike Christianity, cannot survive in competition with more rigorous rivals.  As can be seen in India, Africa, and parts of Asia, only paganism and Christian revival are capable of competing successfully with aggressive Islam, which is why it is increasingly apparent that the 20th century secular societies will turn out to be as unsustainable and nearly as short-lived as the financial system that made them possible.\nThere are already signs that secularism is devolving into pagan global Gaianism.  I suspect that this new religion will become Islam’s primary rival in the post-Christian West, even as Christianity continues to grow exposively in the East and South.  This is not to say that Christianity will not survive in the West, of course it will continue to be a significant influence, but it may not be the culturally dominant religion that it has been throughout previous centuries.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-26T13:15:00+00:00"
}