{
  "url": "https://voxday.net/2010/04/15/its-little-late-richard/",
  "scraped_at": "2026-01-08T23:24:36.829958",
  "title": "It’s a little late, Richard",
  "date_display": "April 15, 2010",
  "date_iso": "2010-04-15T17:15:00+00:00",
  "date_from_url": "2010-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins <a href=\"http://www.timesonline.co.uk/tol/comment/faith/article7085129.ece\">reconsiders the wisdom of his war</a> against Christianity:</p><blockquote><p>Even among the world’s most famous atheists, the crisis of faith among Christians in Europe has been met with concern.  Richard Dawkins, author of The God Delusion, said: “There are no Christians, as far as I know, blowing up buildings. I am not aware of any Christian suicide bombers. I am not aware of any major Christian denomination that believes the penalty for apostasy is death. I have mixed feelings about the decline of Christianity, in so far as Christianity might be a bulwark against something worse.”</p></blockquote><p>Translation: <i>“I’m beginning to worry that Vox is correct after all and the replacement for European Christianity may not be that shiny, sexy, secular scientific society of for which I have labored.”</i> As I have been warning for some time now, atheism and scientific secular humanism are little more than speed bumps on the decline into paganism.  And paganism, as the historically literate know, made for some horrific societal structures that took Christians literal centuries to stamp out.  The legalization of abortion and euthanasia is only the beginning of the post-Christian Endarkenment on a silent continent that has rejected the Light of the World.</p></div>",
  "content_text": "Richard Dawkins\nreconsiders the wisdom of his war\nagainst Christianity:\nEven among the world’s most famous atheists, the crisis of faith among Christians in Europe has been met with concern.  Richard Dawkins, author of The God Delusion, said: “There are no Christians, as far as I know, blowing up buildings. I am not aware of any Christian suicide bombers. I am not aware of any major Christian denomination that believes the penalty for apostasy is death. I have mixed feelings about the decline of Christianity, in so far as Christianity might be a bulwark against something worse.”\nTranslation:\n“I’m beginning to worry that Vox is correct after all and the replacement for European Christianity may not be that shiny, sexy, secular scientific society of for which I have labored.”\nAs I have been warning for some time now, atheism and scientific secular humanism are little more than speed bumps on the decline into paganism.  And paganism, as the historically literate know, made for some horrific societal structures that took Christians literal centuries to stamp out.  The legalization of abortion and euthanasia is only the beginning of the post-Christian Endarkenment on a silent continent that has rejected the Light of the World.",
  "tags": [
    "atheism",
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-15T16:15:00+00:00"
}