{
  "url": "https://voxday.net/2010/04/26/mailvox-probable-irrelevance-of-tea/",
  "scraped_at": "2026-01-08T23:25:30.068825",
  "title": "Mailvox: the probable irrelevance of the Tea Party",
  "date_display": "April 26, 2010",
  "date_iso": "2010-04-26T17:15:00+00:00",
  "date_from_url": "2010-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JM explains why he is dubious with regards to the Tea Party’s ability to achieve anything:</p><blockquote><p>In the past, every president has shown great concern with how they will look, and what is said about them, this one has no concern at all, apparently, on those issues, but only regarding his intended goals.  His party has remained true to its fundamental principles, it has handily tossed off the handicap of being expected to behave within the constraints of “republicanism”, because people have ceased to relate that notion to the Nation as a whole, and have allowed themselves to confine the term to the party, forgetting that our unique status as a Nation is entirely dependent on the principles of “republicanism”, as most who vote these days were never taught that in school, and won’t learn it by accident.</p><p>Add to this picture, the least responsible previous president as the head of a Nation in serious fiscal problems preceding him, and we have in essence, “the perfect storm”, a situation where the fact that playing offense in politics meshes perfectly, and makes for that much more effective gains….</p><p>The “tea party movement” has more citizens activated than any other movement in my life, and should, by rights, be sufficient to offset this advantage the social democrats have, however, there is far less real power in simply massing than appears and most protests in the past have made the most impact through the fear of those facing it, than any other factor.  It would appear the social democrats and this administration were prepared for mass protests, and while they perhaps didn’t expect the numbers, they are not showing any fear.</p><p>I’ve watched riots close up from the crashing of the DNC in Chicago, in 68, and ever since, and from where I stood, each and every time, the entire issue was decided by the reaction of the administrators, not the crowd.  If the administration and the party standing behind it do not flinch, the tea party movement will cease to have any influence unless the whole issue devolves into outright uprising and a physical outbreak of war against the illegal government is commenced.</p></blockquote><p>Seeing the way in which Obama is confounding the Tea Party movement tends to remind me of the classic alternative history short story in which the Germans conquer British India and instead of facing imperial British troops, Gandhi finds himself confronting soldiers of the Wehrmacht.  Needless to say, <i>satyagraha</i> is rather less effective in the face of a ruthless enemy that is indifferent to bloodshed.</p><p>Obama is entirely focused on his goals, not the polls.  He is as indifferent to the political pressure from his left as he is to the Tea Party-led pressure from his right, in part because he has largely delegated his legislative priorities to the Congressional Democrats.  And being a ruthless pragmatist who has never hesitated to discard others once they cease to prove useful to him, it is extremely unlikely that he is in any way concerned with the Democratic Party’s probable loss of the House in the fall.  Obama will simply keep pursuing his progressive goals while relying upon Republicans to do what they do best, namely, crumble under media pressure.</p></div>",
  "content_text": "JM explains why he is dubious with regards to the Tea Party’s ability to achieve anything:\nIn the past, every president has shown great concern with how they will look, and what is said about them, this one has no concern at all, apparently, on those issues, but only regarding his intended goals.  His party has remained true to its fundamental principles, it has handily tossed off the handicap of being expected to behave within the constraints of “republicanism”, because people have ceased to relate that notion to the Nation as a whole, and have allowed themselves to confine the term to the party, forgetting that our unique status as a Nation is entirely dependent on the principles of “republicanism”, as most who vote these days were never taught that in school, and won’t learn it by accident.\nAdd to this picture, the least responsible previous president as the head of a Nation in serious fiscal problems preceding him, and we have in essence, “the perfect storm”, a situation where the fact that playing offense in politics meshes perfectly, and makes for that much more effective gains….\nThe “tea party movement” has more citizens activated than any other movement in my life, and should, by rights, be sufficient to offset this advantage the social democrats have, however, there is far less real power in simply massing than appears and most protests in the past have made the most impact through the fear of those facing it, than any other factor.  It would appear the social democrats and this administration were prepared for mass protests, and while they perhaps didn’t expect the numbers, they are not showing any fear.\nI’ve watched riots close up from the crashing of the DNC in Chicago, in 68, and ever since, and from where I stood, each and every time, the entire issue was decided by the reaction of the administrators, not the crowd.  If the administration and the party standing behind it do not flinch, the tea party movement will cease to have any influence unless the whole issue devolves into outright uprising and a physical outbreak of war against the illegal government is commenced.\nSeeing the way in which Obama is confounding the Tea Party movement tends to remind me of the classic alternative history short story in which the Germans conquer British India and instead of facing imperial British troops, Gandhi finds himself confronting soldiers of the Wehrmacht.  Needless to say,\nsatyagraha\nis rather less effective in the face of a ruthless enemy that is indifferent to bloodshed.\nObama is entirely focused on his goals, not the polls.  He is as indifferent to the political pressure from his left as he is to the Tea Party-led pressure from his right, in part because he has largely delegated his legislative priorities to the Congressional Democrats.  And being a ruthless pragmatist who has never hesitated to discard others once they cease to prove useful to him, it is extremely unlikely that he is in any way concerned with the Democratic Party’s probable loss of the House in the fall.  Obama will simply keep pursuing his progressive goals while relying upon Republicans to do what they do best, namely, crumble under media pressure.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-26T16:15:00+00:00"
}