{
  "url": "https://voxday.net/2010/04/20/mailvox-other-side/",
  "scraped_at": "2026-01-08T23:24:54.118742",
  "title": "Mailvox: the other side",
  "date_display": "April 20, 2010",
  "date_iso": "2010-04-20T13:00:00+00:00",
  "date_from_url": "2010-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB looks at Changing Your Mind from the reverse perspective:</p><blockquote><p>I think “Changing Your Mind: The Steps” could suggest a model of persuasion. The lessons I draw from the list for the persuader are the following:</p><p>1. Expect to be initially regarded as crazy, and defend yourself against that accusation effectively but unemotionally.<br> 2. Continue to make the case; time will cure the “he’s crazy” phase.<br> 2. Make points that will be objectively verifiable as valid.<br> 3. Expose the poor behavior of the other side.<br> 4. Highlight division within the ranks of the other side.<br> 5. Leave room for opponents to defend you.<br> 6. After exposure, give a person time to begin to adopt your viewpoint.<br> 7. Don’t be so needlessly offensive you prevent the person from doing so.<br> 8. Don’t inhibit admissions of error with gloating or demands for further change.<br> 9. Point out the inconsistencies in the positions of the partially persuaded.<br> 10. More people agree with you, and to a greater extent, than will say so.<br> 11. Keep pride in check, because for every proclaimed convert, there are still 10 in the previous phases.</br></br></br></br></br></br></br></br></br></br></br></p><p>This is why a blog is so much more effective than a book at changing minds. A book loses the time and interactivity components of the above steps. Also, a book is usually narrower in scope, while people’s opinions are tied into their entire worldviews.</p></blockquote><p>I think JB’s steps 6 and 8 are particularly important.  It is difficult enough for people to change their minds, so adding to their degree of difficulty by making it personally uncomfortable for them to do so is inherently counterproductive.  Now, I could quite reasonably be accused of violating step 7 on a regular basis, but it should always be kept in mind that I do not expect the vast majority of people to change their minds even when they are presented with an open-and-shut, 100 percent conclusive case.</p><p>It’s true, I could theoretically be more persuasive if I refrained from needlessly upsetting so many people.  But that’s only true in theory, because if I gave a damn about what people happen to emote and rationalize in lieu of actually thinking, I would never be able to ignore the mindless protestations and spurious condemnations in pursuit of the most accurate truth I am able to comprehend.</p></div>",
  "content_text": "JB looks at Changing Your Mind from the reverse perspective:\nI think “Changing Your Mind: The Steps” could suggest a model of persuasion. The lessons I draw from the list for the persuader are the following:\n1. Expect to be initially regarded as crazy, and defend yourself against that accusation effectively but unemotionally.\n2. Continue to make the case; time will cure the “he’s crazy” phase.\n2. Make points that will be objectively verifiable as valid.\n3. Expose the poor behavior of the other side.\n4. Highlight division within the ranks of the other side.\n5. Leave room for opponents to defend you.\n6. After exposure, give a person time to begin to adopt your viewpoint.\n7. Don’t be so needlessly offensive you prevent the person from doing so.\n8. Don’t inhibit admissions of error with gloating or demands for further change.\n9. Point out the inconsistencies in the positions of the partially persuaded.\n10. More people agree with you, and to a greater extent, than will say so.\n11. Keep pride in check, because for every proclaimed convert, there are still 10 in the previous phases.\nThis is why a blog is so much more effective than a book at changing minds. A book loses the time and interactivity components of the above steps. Also, a book is usually narrower in scope, while people’s opinions are tied into their entire worldviews.\nI think JB’s steps 6 and 8 are particularly important.  It is difficult enough for people to change their minds, so adding to their degree of difficulty by making it personally uncomfortable for them to do so is inherently counterproductive.  Now, I could quite reasonably be accused of violating step 7 on a regular basis, but it should always be kept in mind that I do not expect the vast majority of people to change their minds even when they are presented with an open-and-shut, 100 percent conclusive case.\nIt’s true, I could theoretically be more persuasive if I refrained from needlessly upsetting so many people.  But that’s only true in theory, because if I gave a damn about what people happen to emote and rationalize in lieu of actually thinking, I would never be able to ignore the mindless protestations and spurious condemnations in pursuit of the most accurate truth I am able to comprehend.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-20T12:00:00+00:00"
}