{
  "url": "https://voxday.net/2010/04/13/modal-mania/",
  "scraped_at": "2026-01-08T23:24:24.381260",
  "title": "Modal mania",
  "date_display": "April 13, 2010",
  "date_iso": "2010-04-13T20:35:00+00:00",
  "date_from_url": "2010-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re interested in creating a mode for our little technology project, now is the time to <a href=\"http://warmouse.com/modes/modeware_templates.xls\">fill out the spreadsheet</a> and send it in to us.  That will let us put it in the box for everyone.  We’re up to 72 modes now and we want to have well over 100, so if you are an aficionado of a game or application that is <a href=\"http://warmouse.com/app_list.html\">not on the list</a>, don’t hesitate to dive in.</p><p>Also, a reader would like everyone to know that if they are in need of “the services of a good Access/SQL database geek”, he is available.  Shoot me an email if you’re in the market for one.  It’s not my purpose to establish a classified section here – although that’s not the worst idea – but one must reward initiative.  Although I suppose Beau is already engaged with <s>human trafficking</s> matchmaking, so I suppose anything is possible.</p></div>",
  "content_text": "If you’re interested in creating a mode for our little technology project, now is the time to\nfill out the spreadsheet\nand send it in to us.  That will let us put it in the box for everyone.  We’re up to 72 modes now and we want to have well over 100, so if you are an aficionado of a game or application that is\nnot on the list\n, don’t hesitate to dive in.\nAlso, a reader would like everyone to know that if they are in need of “the services of a good Access/SQL database geek”, he is available.  Shoot me an email if you’re in the market for one.  It’s not my purpose to establish a classified section here – although that’s not the worst idea – but one must reward initiative.  Although I suppose Beau is already engaged with\nhuman trafficking\nmatchmaking, so I suppose anything is possible.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-13T19:35:00+00:00"
}