{
  "url": "https://voxday.net/2010/04/23/nfl-draf/",
  "scraped_at": "2026-01-08T23:25:11.624566",
  "title": "NFL draft",
  "date_display": "April 23, 2010",
  "date_iso": "2010-04-23T11:58:00+00:00",
  "date_from_url": "2010-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was certainly interesting.  And for Vikings fans, a little disappointing, because I would very much have liked to see the Vikings draft Tim Tebow.  Unfortunately, Denver’s unexpectedly bold move means that they may have to get by with Clausen, assuming that they go for a quarterback with the second pick in the second round.  Obviously Tebow has some doubters, but <a href=\"http://www.coldhardfootballfacts.com/Articles/11_3171_A_tale_of_six_quarterbacks.html\">as Cold Hard Football Facts points out</a>, if you don’t buy into the “mechanics” voodoo, Tebow has been the best SEC quarterback since Peyton Manning and cannot possibly be as likely to turn out a bust as JaMarcus Russell was.</p><p>I trust passing accuracy, character, and championships a lot more than the dogmatic insistence on a model that has regularly produced the likes of Russell, Leaf, and Harrington.  The scouts didn’t think much of one Francis Asbury Tarkenton either, and he only retired with every major passing record in the books.  Bradford was probably the right pick for the Rams, but it was a high risk/reward pick that they had little choice regarding.  Quarterback is simply so much more important than every other position in the modern NFL that if there is even a 20 percent chance that a quarterback is genuine long-term starter material, a team has to take it.</p><p>Which means Clausen even though I suspect he is a little prick of a prima donna.  Which is all right, since he’ll be nicely suited to step into Brett Favre’s when old Number Four finally retires for real after next season.  Or maybe the season after that.  Prior to the Sheppard signing, I’d expected the Vikes to draft a cornerback, but despite Sheppard’s loss of elite status, he’s still a definite upgrade to the secondary once Griffin returns.  I would like to see them pick up Clausen with 2(34) and Myron Rolle at S with 2(62), assuming he’s still available.  And, since Pat Williams won’t be around much longer, it would be interesting to see them pursue a trade with Washington for Haynesworth.</p></div>",
  "content_text": "It was certainly interesting.  And for Vikings fans, a little disappointing, because I would very much have liked to see the Vikings draft Tim Tebow.  Unfortunately, Denver’s unexpectedly bold move means that they may have to get by with Clausen, assuming that they go for a quarterback with the second pick in the second round.  Obviously Tebow has some doubters, but\nas Cold Hard Football Facts points out\n, if you don’t buy into the “mechanics” voodoo, Tebow has been the best SEC quarterback since Peyton Manning and cannot possibly be as likely to turn out a bust as JaMarcus Russell was.\nI trust passing accuracy, character, and championships a lot more than the dogmatic insistence on a model that has regularly produced the likes of Russell, Leaf, and Harrington.  The scouts didn’t think much of one Francis Asbury Tarkenton either, and he only retired with every major passing record in the books.  Bradford was probably the right pick for the Rams, but it was a high risk/reward pick that they had little choice regarding.  Quarterback is simply so much more important than every other position in the modern NFL that if there is even a 20 percent chance that a quarterback is genuine long-term starter material, a team has to take it.\nWhich means Clausen even though I suspect he is a little prick of a prima donna.  Which is all right, since he’ll be nicely suited to step into Brett Favre’s when old Number Four finally retires for real after next season.  Or maybe the season after that.  Prior to the Sheppard signing, I’d expected the Vikes to draft a cornerback, but despite Sheppard’s loss of elite status, he’s still a definite upgrade to the secondary once Griffin returns.  I would like to see them pick up Clausen with 2(34) and Myron Rolle at S with 2(62), assuming he’s still available.  And, since Pat Williams won’t be around much longer, it would be interesting to see them pursue a trade with Washington for Haynesworth.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-23T10:58:00+00:00"
}