{
  "url": "https://voxday.net/2010/04/30/nonexistent-recovery/",
  "scraped_at": "2026-01-08T23:25:55.075797",
  "title": "The nonexistent recovery",
  "date_display": "April 30, 2010",
  "date_iso": "2010-04-30T18:14:00+00:00",
  "date_from_url": "2010-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RGD readers will know that I’m very skeptical of the reliability of government economic statistics, mostly because they are a constantly moving target that mutate over time.  However, a closer look at everything from TOTLL to today’s GDP Advance (3.2% annual) makes it appear as if the <a href=\"http://market-ticker.denninger.net/archives/2254-First-Quarter-2010-GDP-Advance.html\">statistical shenanigans are growing</a> exponentially:</p><blockquote><p>I’m concerned with these numbers – quite concerned in fact.  The Federal Government borrowed (and presumably spent) $462 billion in excess of tax receipts over the first three months of 2010. But PCE – personal consumption expenditures – was up $83 billion and federal spending was up only 3.5 billion.</p><p>Where did the other $375 billion go?</p><p>Into a black hole of covering existing obligations, it appears, and the final private demand GDP deficit covered by this is almost exactly 10% (GDP for the quarter is ~3.650 trillion, so $375 billion is roughly 10% of that.)</p></blockquote><p>Karl Denninger isn’t the only one to notice anomalies with regards to today’s BEA release.  Calculated Risk notices that Residential Investment <a href=\"http://3.bp.blogspot.com/_pMscxxELHEg/S9rQ8PA-F_I/AAAAAAAAIKo/qfuISZbwhLs/s320/RIPercentGDPQ12010.jpg\">isn’t behaving</a> in its usual post-recessionary manner: <i>“RI as a percent of GDP is at a new record low. And there is no reason to expect a sustained increase in RI until the excess housing inventory is absorbed.  Notice that RI usually recovers very quickly coming out of a recession. This time RI is moving sideways – not a good sign for a robust recovery in 2010.”</i></p></div>",
  "content_text": "RGD readers will know that I’m very skeptical of the reliability of government economic statistics, mostly because they are a constantly moving target that mutate over time.  However, a closer look at everything from TOTLL to today’s GDP Advance (3.2% annual) makes it appear as if the\nstatistical shenanigans are growing\nexponentially:\nI’m concerned with these numbers – quite concerned in fact.  The Federal Government borrowed (and presumably spent) $462 billion in excess of tax receipts over the first three months of 2010. But PCE – personal consumption expenditures – was up $83 billion and federal spending was up only 3.5 billion.\nWhere did the other $375 billion go?\nInto a black hole of covering existing obligations, it appears, and the final private demand GDP deficit covered by this is almost exactly 10% (GDP for the quarter is ~3.650 trillion, so $375 billion is roughly 10% of that.)\nKarl Denninger isn’t the only one to notice anomalies with regards to today’s BEA release.  Calculated Risk notices that Residential Investment\nisn’t behaving\nin its usual post-recessionary manner:\n“RI as a percent of GDP is at a new record low. And there is no reason to expect a sustained increase in RI until the excess housing inventory is absorbed.  Notice that RI usually recovers very quickly coming out of a recession. This time RI is moving sideways – not a good sign for a robust recovery in 2010.”",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-30T17:14:00+00:00"
}