{
  "url": "https://voxday.net/2010/04/08/on-austrian-analysis/",
  "scraped_at": "2026-01-08T23:24:02.763605",
  "title": "On the Austrian analysis",
  "date_display": "April 8, 2010",
  "date_iso": "2010-04-08T15:12:00+00:00",
  "date_from_url": "2010-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which SM asks me to respond to <a href=\"http://blogs.ft.com/martin-wolf-exchange/2010/04/01/hello-world/#comments\">a post by Financial Times writer Martin Wolf</a>:</p><blockquote><p>I think we can say that conventional neo-classical equilibrium economics did a poor job in predicting the crisis and in suggesting what should be done in response. We can also say that neo-Keynesians pointed out some important precursors of the crisis, in particular, the destabilising role of huge private sector financial deficits in countries with large external deficits, such as the US, and the Keynesian view certainly played a big part in the post-crisis response, as did that of Milton Friedman.</p><p>Yet some would argue that economists working in the Austrian tradition were more nearly right than anybody else. In particular, they have argued that: inflation-targeting is inherently destabilising; that fractional reserve banking creates unmanageable credit booms; and that the resulting global “malinvestment” explains the subsequent financial crash. I have sympathy with this point of view. But Austrians also say – as their predecessors said in the 1930s – that the right response is to let everything rotten be liquidated, while continuing to balance the budget as the economy implodes. I find this unconvincing. Mass bankruptcy is extremely costly. Moreover, it is impossible to separate what is healthy from what is unhealthy during a general economic collapse triggered by an implosion of the financial system.</p><p>Anyway, what do readers think of the Austrian analysis? In particular, what does it imply about the future of the global monetary and global financial systems and about the right way to respond to financial crises when they occur?</p></blockquote><p>1.  Yes, Austrian economics does understand financial crises better than other schools of thought, even if one includes Hyman Minsky’s Financial Instability Hypothesis as a distinct economic school.  The Austrian analysis is broadly correct because it a) provides a means of understanding one of the core components of modern economics that no other major economic school provides.  None of the Neo-Classical, Marxian, Neo-Keynesian, or Monetarist theories of economics consider debt to be a primary aspect of economics and therefore their policy interpretations and prescriptions are all largely irrelevant with regards to modern economies with debt-based financial systems.  Austrian school theory is also more robust and comprehensive, in my opinion, than the new empirical Post-Keynesianism which also attempts to account for debt and therefore is also vastly superior to the four major schools.</p><p>2.  As I predicted both in 2002 and in my 2009 book, <i>The Return of the Great Depression</i> there is no future for the present global monetary and financial systems.  The giant international banks are insolvent and the monetary systems are doomed to collapse.  This means that in the interest of avoiding this collapse, the monetary systems will be unified, first on a regional and then eventually on a global basis when the regional moneys begin to break down.  The correct response would be to let all of the “full faith and credit” moneys fail and be replaced by the gold standard or some other monetary standard less subject to the bank-driven inflate-and-collapse cycle that has been witnessed five times in the United States alone, but that is not going to happen at this point in time.</p><p>3.  The right way to respond to financial crises is to let them play out.  When a building is burning, it doesn’t matter how much damage is being inflicted by the fire, it is never the correct response to attempt extinguishing it by pouring something inflammable on it.  Mass bankruptcy is certainly costly, but the only relevant point is that it is much less costly than the greater number of bankruptcies that will eventually follow combined with the immense costs of the futile atttempts to stave it off that will do little more than delay it for a time.</p><p>Moreover, it is ALWAYS impossible for a central authority to separate what is healthy from what is unhealthy, during a general economic collapse triggered by an implosion of the financial system or at any other time.  Central economic planning does not work any more effectively or efficiently with regards to money and credit than it does with regards to goods and services.</p></div>",
  "content_text": "In which SM asks me to respond to\na post by Financial Times writer Martin Wolf\n:\nI think we can say that conventional neo-classical equilibrium economics did a poor job in predicting the crisis and in suggesting what should be done in response. We can also say that neo-Keynesians pointed out some important precursors of the crisis, in particular, the destabilising role of huge private sector financial deficits in countries with large external deficits, such as the US, and the Keynesian view certainly played a big part in the post-crisis response, as did that of Milton Friedman.\nYet some would argue that economists working in the Austrian tradition were more nearly right than anybody else. In particular, they have argued that: inflation-targeting is inherently destabilising; that fractional reserve banking creates unmanageable credit booms; and that the resulting global “malinvestment” explains the subsequent financial crash. I have sympathy with this point of view. But Austrians also say – as their predecessors said in the 1930s – that the right response is to let everything rotten be liquidated, while continuing to balance the budget as the economy implodes. I find this unconvincing. Mass bankruptcy is extremely costly. Moreover, it is impossible to separate what is healthy from what is unhealthy during a general economic collapse triggered by an implosion of the financial system.\nAnyway, what do readers think of the Austrian analysis? In particular, what does it imply about the future of the global monetary and global financial systems and about the right way to respond to financial crises when they occur?\n1.  Yes, Austrian economics does understand financial crises better than other schools of thought, even if one includes Hyman Minsky’s Financial Instability Hypothesis as a distinct economic school.  The Austrian analysis is broadly correct because it a) provides a means of understanding one of the core components of modern economics that no other major economic school provides.  None of the Neo-Classical, Marxian, Neo-Keynesian, or Monetarist theories of economics consider debt to be a primary aspect of economics and therefore their policy interpretations and prescriptions are all largely irrelevant with regards to modern economies with debt-based financial systems.  Austrian school theory is also more robust and comprehensive, in my opinion, than the new empirical Post-Keynesianism which also attempts to account for debt and therefore is also vastly superior to the four major schools.\n2.  As I predicted both in 2002 and in my 2009 book,\nThe Return of the Great Depression\nthere is no future for the present global monetary and financial systems.  The giant international banks are insolvent and the monetary systems are doomed to collapse.  This means that in the interest of avoiding this collapse, the monetary systems will be unified, first on a regional and then eventually on a global basis when the regional moneys begin to break down.  The correct response would be to let all of the “full faith and credit” moneys fail and be replaced by the gold standard or some other monetary standard less subject to the bank-driven inflate-and-collapse cycle that has been witnessed five times in the United States alone, but that is not going to happen at this point in time.\n3.  The right way to respond to financial crises is to let them play out.  When a building is burning, it doesn’t matter how much damage is being inflicted by the fire, it is never the correct response to attempt extinguishing it by pouring something inflammable on it.  Mass bankruptcy is certainly costly, but the only relevant point is that it is much less costly than the greater number of bankruptcies that will eventually follow combined with the immense costs of the futile atttempts to stave it off that will do little more than delay it for a time.\nMoreover, it is ALWAYS impossible for a central authority to separate what is healthy from what is unhealthy, during a general economic collapse triggered by an implosion of the financial system or at any other time.  Central economic planning does not work any more effectively or efficiently with regards to money and credit than it does with regards to goods and services.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-08T14:12:00+00:00"
}