{
  "url": "https://voxday.net/2010/04/16/profession-of-whack-jobs/",
  "scraped_at": "2026-01-08T23:24:44.210643",
  "title": "A profession of whack jobs",
  "date_display": "April 16, 2010",
  "date_iso": "2010-04-16T17:15:00+00:00",
  "date_from_url": "2010-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I would turn to retarded crack whores for wisdom and advice on how to live my life before I’d spend five seconds listening to a therapist.  Dr. Helen explains why:</p><blockquote><p>Kottler touches often on the narcissism of therapists in the book and has a section on the topic. He talks about his own struggle with self-worth and measures his own success by looking at all the good he has done, the people he has helped. He discusses how therapists often feel they are frauds. The author talks about his deep need to influence others, and he mentions a treatise on narcissism that describes it as such:</p><p><i>“A lack of feeling, the need to project an image, the desire to help others in order to exercise power, and arrogance are all familiar symptoms.”</i></p><p>He then states that he has long felt he holds super powers:</p><p><i>“After all, it seems at times (to others, if not to myself) that I can read minds, predict the future, and hear, see, feel, and sense things beyond the powers of mere mortal beings.”</i></p><p>In the author’s defense, he does struggle with this and acknowledge it can be a problem. I have talked to therapists who feel they are superhuman yet see it as an asset.</p></blockquote><p>I’m sure it would be an asset to be superhuman… if it weren’t an obvious sign that you are insane.  But there is a solution.  As soon as a psychological therapist completes his training, lock him up for life in the lunatic asylum.  Tell half of them they’re doctors, tell the other half they’re patients.  The narcissistic whack jobs can keep each other occupied without harming anyone and the mental health of the rest of the world will improve significantly.</p><p>Dr. Helen asks a cogent question at the end: “Could it be that many liberals, like narcissistic therapists, are so insistent that others go along with them because they fear being obscure and crave feeling powerful more than they care about whether their solutions actually work?”</p><p>Yes.  Absolutely.  Which reminds me… I’ve been reading Jack Kerouac’s <i>On the Road</i> and found it to be little more than the travel diary of a useless, moronic narcissist and closet-case gamma who errantly believes he is poetic due to his habit of utilizing inappropriate superlatives.  If Kerouac had been born in 1969 instead of dying then, he wouldn’t have written an astonishingly tedious “this one time, on a road trip” stream of semi-consciousness, he’d be a licensed therapist.</p><p>The New York Times pronounced the most damning verdict on Kerouac’s generation when it described his novel as “the most beautifully executed, the clearest and most important utterance” of that generation.  Truman Capote had it right.  “That’s not writing, that’s typing.”  But <i>On the Road</i> is a remarkable achievement in one way, as I now find Rand al’Thor to be only the second most-irritating fictional protagonist in literary history.</p></div>",
  "content_text": "I would turn to retarded crack whores for wisdom and advice on how to live my life before I’d spend five seconds listening to a therapist.  Dr. Helen explains why:\nKottler touches often on the narcissism of therapists in the book and has a section on the topic. He talks about his own struggle with self-worth and measures his own success by looking at all the good he has done, the people he has helped. He discusses how therapists often feel they are frauds. The author talks about his deep need to influence others, and he mentions a treatise on narcissism that describes it as such:\n“A lack of feeling, the need to project an image, the desire to help others in order to exercise power, and arrogance are all familiar symptoms.”\nHe then states that he has long felt he holds super powers:\n“After all, it seems at times (to others, if not to myself) that I can read minds, predict the future, and hear, see, feel, and sense things beyond the powers of mere mortal beings.”\nIn the author’s defense, he does struggle with this and acknowledge it can be a problem. I have talked to therapists who feel they are superhuman yet see it as an asset.\nI’m sure it would be an asset to be superhuman… if it weren’t an obvious sign that you are insane.  But there is a solution.  As soon as a psychological therapist completes his training, lock him up for life in the lunatic asylum.  Tell half of them they’re doctors, tell the other half they’re patients.  The narcissistic whack jobs can keep each other occupied without harming anyone and the mental health of the rest of the world will improve significantly.\nDr. Helen asks a cogent question at the end: “Could it be that many liberals, like narcissistic therapists, are so insistent that others go along with them because they fear being obscure and crave feeling powerful more than they care about whether their solutions actually work?”\nYes.  Absolutely.  Which reminds me… I’ve been reading Jack Kerouac’s\nOn the Road\nand found it to be little more than the travel diary of a useless, moronic narcissist and closet-case gamma who errantly believes he is poetic due to his habit of utilizing inappropriate superlatives.  If Kerouac had been born in 1969 instead of dying then, he wouldn’t have written an astonishingly tedious “this one time, on a road trip” stream of semi-consciousness, he’d be a licensed therapist.\nThe New York Times pronounced the most damning verdict on Kerouac’s generation when it described his novel as “the most beautifully executed, the clearest and most important utterance” of that generation.  Truman Capote had it right.  “That’s not writing, that’s typing.”  But\nOn the Road\nis a remarkable achievement in one way, as I now find Rand al’Thor to be only the second most-irritating fictional protagonist in literary history.",
  "tags": [
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-16T16:15:00+00:00"
}