{
  "url": "https://voxday.net/2010/04/05/right-because-its-their-fau/",
  "scraped_at": "2026-01-08T23:23:51.678296",
  "title": "They didn’t start the fire",
  "date_display": "April 5, 2010",
  "date_iso": "2010-04-05T19:42:00+00:00",
  "date_from_url": "2010-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A presumed Friedmanite named Luigi <a href=\"http://www.city-journal.org/2010/20_2_strategic-mortgage-default.html\">condemns indebted homeowners</a> for doing exactly what the banks who wrote their mortgage contracts do whenever they make a bad real estate investment:</p><blockquote><p>Homeowners who walk away from their mortgages undermine our financial system….Undermining the social norm to repay mortgages, as Lowenstein and White do, is thus a very bad idea. You might just as well say that when a theater is going up in flames, it’s “rational” to trample other people in rushing to the exits.</p></blockquote><p>It is rational… for the person trying to escape.  And the person to blame isn’t the poor guy trying to avoid being burned to death, but <i>the people who set the fire in the first place!</i></p><p>The contracts are clear, even if the consequences vary from state to state.  If your mortgage is worth significantly more than your house, you have the right to walk away.  The bank has the right to take the house.  There is no moral question involved.</p></div>",
  "content_text": "A presumed Friedmanite named Luigi\ncondemns indebted homeowners\nfor doing exactly what the banks who wrote their mortgage contracts do whenever they make a bad real estate investment:\nHomeowners who walk away from their mortgages undermine our financial system….Undermining the social norm to repay mortgages, as Lowenstein and White do, is thus a very bad idea. You might just as well say that when a theater is going up in flames, it’s “rational” to trample other people in rushing to the exits.\nIt is rational… for the person trying to escape.  And the person to blame isn’t the poor guy trying to avoid being burned to death, but\nthe people who set the fire in the first place!\nThe contracts are clear, even if the consequences vary from state to state.  If your mortgage is worth significantly more than your house, you have the right to walk away.  The bank has the right to take the house.  There is no moral question involved.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-05T18:42:00+00:00"
}