{
  "url": "https://voxday.net/2010/04/12/social-autism-strikes-again/",
  "scraped_at": "2026-01-08T23:24:15.236601",
  "title": "Social autism strikes again",
  "date_display": "April 12, 2010",
  "date_iso": "2010-04-12T13:45:00+00:00",
  "date_from_url": "2010-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins and Christopher Hitchens once more demonstrate that while it isn’t necessary to be a consummate horse’s ass in order to be an atheist, <a href=\"http://www.timesonline.co.uk/tol/comment/faith/article7094310.ece\">it certainly doesn’t hurt</a>:</p><blockquote><p>RICHARD DAWKINS, the atheist campaigner, is planning a legal ambush to have the Pope arrested during his state visit to Britain “for crimes against humanity”.</p><p>Dawkins and Christopher Hitchens, the atheist author, have asked human rights lawyers to produce a case for charging Pope Benedict XVI over his alleged cover-up of sexual abuse in the Catholic church.  The pair believe they can exploit the same legal principle used to arrest Augusto Pinochet, the late Chilean dictator, when he visited Britain in 1998.</p><p>The Pope was embroiled in new controversy this weekend over a letter he signed arguing that the “good of the universal church” should be considered against the defrocking of an American priest who committed sex offences against two boys. It was dated 1985, when he was in charge of the Congregation for the Doctrine of the Faith, which deals with sex abuse cases.</p></blockquote><p>Being a nondenominational Christian with Southern Baptist ties, I am not inclined to be a defender of popery.  And being a casual student of medieval history, I am fully cognizant of the various crimes that have been committed in Rome, Ravenna, and Avignon by men who claimed St. Peter’s throne.  I also see a clear distinction between Christianity and Catholicism; although many Catholics are Christians, many are not by any reasonable Bible-based definition of the latter term.  While I respect the organization and the historical contributions of the institution, I do not confuse it with my religious faith.  Nor do I approve of the sexual abuse of children; I would have absolutely no problem with every priest, schoolteacher, and sports coach confirmed to be guilty of preying upon the children in their care being taken out and shot, were it not for my opposition to granting the government a hunting license on its citizens.</p><p>Since, ironically enough, it is Richard Dawkins who has openly minimized the damage to children from sexual abuse, it is obviously the Pope’s Catholicism that he wishes to prosecute, not the Pope’s suboptimal human resources management 25 years ago.  The fact that Dawkins is targeting the Pope, who is not even accused of committing any abuse, rather than the hundreds of English school teachers – including one of his own teachers – who have actually done so is conclusive evidence that this is nothing more than the world’s most famous atheist demonstrating <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXWZGAYJf8I/AAAAAAAAAFo/tiHGbGA9JMY/s1600-h/atheism-nogod.jpg\">the Argument from Social Autism</a>.  It’s a remarkably stupid PR stunt, even by the low standards of the Clowns of Reason</p><p><i>“Once, in the question time after a lecture in Dublin, I was asked what I thought about the widely publicized cases of sexual abuse by Catholic priests in Ireland. I replied that, as horrible as sexual abuse no doubt was, the damage was arguably less than the long-term psychological damage inflicted by bringing up the child Catholic in the first place…”</i><br> – Richard Dawkins, <i>The God Delusion</i>, p. 317</br></p><p>The sexual abuse scandal in the Catholic church is the direct result of allowing homosexuals to enter the priesthood.  Unless and until the Pope addresses that ludicrous decision of his predecessors, more predatory abuses will occur.  But the Pope is no more personally responsible for those crimes than the Minister of Education is responsible for the same crimes taking place in the English schools.</p><p><i>“The Roman Catholic Church has borne a heavy share of such retrospective opprobrium. For all sorts of reasons I dislike the Roman Catholic Church. But I dislike unfairness even more, and I can’t help wondering whether this one institution has been unfairly demonized over the issue, especially in Ireland and America.”</i><br> – Richard Dawkins, <i>The God Delusion</i>, p. 316</br></p><p>It would appear that Mr. Dawkins isn’t quite as opposed to unfair demonization as he used to be.</p></div>",
  "content_text": "Richard Dawkins and Christopher Hitchens once more demonstrate that while it isn’t necessary to be a consummate horse’s ass in order to be an atheist,\nit certainly doesn’t hurt\n:\nRICHARD DAWKINS, the atheist campaigner, is planning a legal ambush to have the Pope arrested during his state visit to Britain “for crimes against humanity”.\nDawkins and Christopher Hitchens, the atheist author, have asked human rights lawyers to produce a case for charging Pope Benedict XVI over his alleged cover-up of sexual abuse in the Catholic church.  The pair believe they can exploit the same legal principle used to arrest Augusto Pinochet, the late Chilean dictator, when he visited Britain in 1998.\nThe Pope was embroiled in new controversy this weekend over a letter he signed arguing that the “good of the universal church” should be considered against the defrocking of an American priest who committed sex offences against two boys. It was dated 1985, when he was in charge of the Congregation for the Doctrine of the Faith, which deals with sex abuse cases.\nBeing a nondenominational Christian with Southern Baptist ties, I am not inclined to be a defender of popery.  And being a casual student of medieval history, I am fully cognizant of the various crimes that have been committed in Rome, Ravenna, and Avignon by men who claimed St. Peter’s throne.  I also see a clear distinction between Christianity and Catholicism; although many Catholics are Christians, many are not by any reasonable Bible-based definition of the latter term.  While I respect the organization and the historical contributions of the institution, I do not confuse it with my religious faith.  Nor do I approve of the sexual abuse of children; I would have absolutely no problem with every priest, schoolteacher, and sports coach confirmed to be guilty of preying upon the children in their care being taken out and shot, were it not for my opposition to granting the government a hunting license on its citizens.\nSince, ironically enough, it is Richard Dawkins who has openly minimized the damage to children from sexual abuse, it is obviously the Pope’s Catholicism that he wishes to prosecute, not the Pope’s suboptimal human resources management 25 years ago.  The fact that Dawkins is targeting the Pope, who is not even accused of committing any abuse, rather than the hundreds of English school teachers – including one of his own teachers – who have actually done so is conclusive evidence that this is nothing more than the world’s most famous atheist demonstrating\nthe Argument from Social Autism\n.  It’s a remarkably stupid PR stunt, even by the low standards of the Clowns of Reason\n“Once, in the question time after a lecture in Dublin, I was asked what I thought about the widely publicized cases of sexual abuse by Catholic priests in Ireland. I replied that, as horrible as sexual abuse no doubt was, the damage was arguably less than the long-term psychological damage inflicted by bringing up the child Catholic in the first place…”\n– Richard Dawkins,\nThe God Delusion\n, p. 317\nThe sexual abuse scandal in the Catholic church is the direct result of allowing homosexuals to enter the priesthood.  Unless and until the Pope addresses that ludicrous decision of his predecessors, more predatory abuses will occur.  But the Pope is no more personally responsible for those crimes than the Minister of Education is responsible for the same crimes taking place in the English schools.\n“The Roman Catholic Church has borne a heavy share of such retrospective opprobrium. For all sorts of reasons I dislike the Roman Catholic Church. But I dislike unfairness even more, and I can’t help wondering whether this one institution has been unfairly demonized over the issue, especially in Ireland and America.”\n– Richard Dawkins,\nThe God Delusion\n, p. 316\nIt would appear that Mr. Dawkins isn’t quite as opposed to unfair demonization as he used to be.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-12T12:45:00+00:00"
}