{
  "url": "https://voxday.net/2010/04/15/this-is-how-you-do-i-2/",
  "scraped_at": "2026-01-08T23:24:33.179915",
  "title": "This is how you do it",
  "date_display": "April 15, 2010",
  "date_iso": "2010-04-15T12:11:00+00:00",
  "date_from_url": "2010-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PawnTakesQueen declared yesterday that those who do not believe that Obama has provided a legitimate birth certificate proving that he is a natural born citizen and is therefore Constitutionally qualified to hold the office of President are “dumbass Birthers” and are either “dumb, dishonest, or ignorant”.  I was somewhat disappointed that those who responded to him demonstrated that they have not yet mastered the correct way to deal with aggressive interlocutors of inferior intelligence holding opinions that are unsupported by evidence or correctly applied logic.  As I explained in the comments, the correct way to go about dismantling both the arguments and the intellectual credibility of these annoying individuals is not to pay any attention to their insulting statements about those with whom they disagree, because that is their only hope of being able to escape a critical dialogue relatively unscathed.  In fact, the primary reason they always begin in such a provocative manner is that they need to keep the discussion at a level that permits them to avoid providing any objective information subject to independent verification.  I recommended the following approach:</p><p><i>You simply ask direct questions about the assertions and assumptions that support their posturing, they immediately start evading, at which point you begin the process of pinning them down until they are eventually forced to run away or concede. Never skip ahead, as you only give them the chance to avoid being forced to defend their unsupportable assumptions.</i></p><p>Therefore, I asked PTQ the following question: “[W]hat are your reasons for believing that Obama was born in the United States? They must be remarkably conclusive for you to conclude that anyone believing otherwise is either dumb, dishonest, or ignorant!”  And, as I expected, he responded in a manner which demonstrates that he has absolutely nothing which is even remotely capable of justifying the dismissive stance he assumed from the outset.</p><blockquote><p>My reasoning for believing that Obama was born in the United States?</p><p>Well, for starters we’re not talking about a normal vetting process here. You don’t think the CIA checked him out? This wasn’t for some entry level CIA agent position. We’re talking the Presidency of the United States. Top secret clearance? Try the very highest, strictest security clearance. You think they’d let a Kenyan get through? You think something so ridiculously fundamental as a fake birth certificate would get past the CIA, FBI, NSA, and the other 13 U.S. intelligence agencies? Of course you do. They’re all included in your conspiracy theory apparently. Or maybe you didn’t think of that. You are, after all, a dumbass birther. Actually “dumbass birther” is redundant, but it’s fun to say.</p></blockquote><p>First, note that despite answering the question – commendable – PTQ still attempts to direct the discussion back to the perjorative level.  Second, notice that he does nothing more than appeal to logic in contradicting the logic that points towards precisely the opposite conclusion.  And he has far less evidence in support of that logical appeal; whereas the large amount of manpower and money expended in pursuit of concealing Obama’s actual birth documentation, kindergarten records, Punahou school records, Occidental College records, Columbia University records, Columbia thesis, Harvard Law School records, Harvard Law Review articles, scholarly articles from the University of Chicago, passport, medical records, Illinois state senate files, Illinois State Bar Association records, and adoption records has been widely reported and is not in dispute, PTQ cites no evidence whatsoever that the CIA, FBI, NSA, or any government agency has ever vetted Obama, or for that matter, <i>any other presidential candidate</i> in the past.</p><p>Moreoever, PTQ’s argument makes no sense because the citizenship-related aspect of top secret national security clearances only relates to citizenship, not natural born citizenship.  “Subject must be a U.S. citizen. Independent verification of citizenship received directly from appropriate registration authority. For foreign-born immediate family members, verification of citizenship or legal status is also required.”</p><p>And finally, the idea that the very federal agencies which are known to have been involved in some of the worst abuses of the U.S. Constitution in American history are in any way concerned with guarding against the Constitutional illegitimacy of a sitting U.S. Senator is risible.  There is no question of those agencies letting “a fake birth certificate” get past them; the Hawaiian document which has been produced is a real document, the problem is that it is not the relevant long-form documentation of birth that is required in order to prove Obama’s claims.  No document of that sort, fake or real, has been produced to date.  There is no reason that agencies with no responsibility or authority to vet the Constitutional legitimacy of a U.S. citizen and U.S. Senator should not have accepted the Hawaiian certificate at face value in lieu of the relevant long-form document despite its shortcomings, just as the mainstream media and PTQ himself have done.</p><p>As for the other reason he provided, that “corporate America, including Big Pharma, the AMA, Big Oil, and all the rest of the businesses who don’t want to pay higher taxes under a Democratic president” would not “let this fake birth certificate stuff slide”, PTQ clearly does not realize that Obama raised more money from Big Pharma than McCain did, the AMA supported Obama and even endorsed his health plan, and Obama received significant donations from Big Oil, although only about a third of what McCain received.  Corporate America has no objection to Obama whatsoever, primarily because he is as beholden to Wall Street as McCain and nearly every other national Democrat or Republican are.  It should be obvious that these corporate Obama supporters have zero interest in rending their investments in him worthless.</p><p>Now, perhaps PTQ has other reasons for believing that Obama was born in the United States that he has not shared with us.  But clearly the reasons that he has provided so far are not only superficial, inconclusive and incorrect, but rest upon logic that is much more questionable than the competing logical reasoning that he previously rejected in such perjorative terms.  The amusing thing, of course, is that I told PTQ yesterday exactly what I was going to do prior to his response and warned him that there was nothing he could do about it.  I leave it to you to ascertain the accuracy of that prediction.</p></div>",
  "content_text": "PawnTakesQueen declared yesterday that those who do not believe that Obama has provided a legitimate birth certificate proving that he is a natural born citizen and is therefore Constitutionally qualified to hold the office of President are “dumbass Birthers” and are either “dumb, dishonest, or ignorant”.  I was somewhat disappointed that those who responded to him demonstrated that they have not yet mastered the correct way to deal with aggressive interlocutors of inferior intelligence holding opinions that are unsupported by evidence or correctly applied logic.  As I explained in the comments, the correct way to go about dismantling both the arguments and the intellectual credibility of these annoying individuals is not to pay any attention to their insulting statements about those with whom they disagree, because that is their only hope of being able to escape a critical dialogue relatively unscathed.  In fact, the primary reason they always begin in such a provocative manner is that they need to keep the discussion at a level that permits them to avoid providing any objective information subject to independent verification.  I recommended the following approach:\nYou simply ask direct questions about the assertions and assumptions that support their posturing, they immediately start evading, at which point you begin the process of pinning them down until they are eventually forced to run away or concede. Never skip ahead, as you only give them the chance to avoid being forced to defend their unsupportable assumptions.\nTherefore, I asked PTQ the following question: “[W]hat are your reasons for believing that Obama was born in the United States? They must be remarkably conclusive for you to conclude that anyone believing otherwise is either dumb, dishonest, or ignorant!”  And, as I expected, he responded in a manner which demonstrates that he has absolutely nothing which is even remotely capable of justifying the dismissive stance he assumed from the outset.\nMy reasoning for believing that Obama was born in the United States?\nWell, for starters we’re not talking about a normal vetting process here. You don’t think the CIA checked him out? This wasn’t for some entry level CIA agent position. We’re talking the Presidency of the United States. Top secret clearance? Try the very highest, strictest security clearance. You think they’d let a Kenyan get through? You think something so ridiculously fundamental as a fake birth certificate would get past the CIA, FBI, NSA, and the other 13 U.S. intelligence agencies? Of course you do. They’re all included in your conspiracy theory apparently. Or maybe you didn’t think of that. You are, after all, a dumbass birther. Actually “dumbass birther” is redundant, but it’s fun to say.\nFirst, note that despite answering the question – commendable – PTQ still attempts to direct the discussion back to the perjorative level.  Second, notice that he does nothing more than appeal to logic in contradicting the logic that points towards precisely the opposite conclusion.  And he has far less evidence in support of that logical appeal; whereas the large amount of manpower and money expended in pursuit of concealing Obama’s actual birth documentation, kindergarten records, Punahou school records, Occidental College records, Columbia University records, Columbia thesis, Harvard Law School records, Harvard Law Review articles, scholarly articles from the University of Chicago, passport, medical records, Illinois state senate files, Illinois State Bar Association records, and adoption records has been widely reported and is not in dispute, PTQ cites no evidence whatsoever that the CIA, FBI, NSA, or any government agency has ever vetted Obama, or for that matter,\nany other presidential candidate\nin the past.\nMoreoever, PTQ’s argument makes no sense because the citizenship-related aspect of top secret national security clearances only relates to citizenship, not natural born citizenship.  “Subject must be a U.S. citizen. Independent verification of citizenship received directly from appropriate registration authority. For foreign-born immediate family members, verification of citizenship or legal status is also required.”\nAnd finally, the idea that the very federal agencies which are known to have been involved in some of the worst abuses of the U.S. Constitution in American history are in any way concerned with guarding against the Constitutional illegitimacy of a sitting U.S. Senator is risible.  There is no question of those agencies letting “a fake birth certificate” get past them; the Hawaiian document which has been produced is a real document, the problem is that it is not the relevant long-form documentation of birth that is required in order to prove Obama’s claims.  No document of that sort, fake or real, has been produced to date.  There is no reason that agencies with no responsibility or authority to vet the Constitutional legitimacy of a U.S. citizen and U.S. Senator should not have accepted the Hawaiian certificate at face value in lieu of the relevant long-form document despite its shortcomings, just as the mainstream media and PTQ himself have done.\nAs for the other reason he provided, that “corporate America, including Big Pharma, the AMA, Big Oil, and all the rest of the businesses who don’t want to pay higher taxes under a Democratic president” would not “let this fake birth certificate stuff slide”, PTQ clearly does not realize that Obama raised more money from Big Pharma than McCain did, the AMA supported Obama and even endorsed his health plan, and Obama received significant donations from Big Oil, although only about a third of what McCain received.  Corporate America has no objection to Obama whatsoever, primarily because he is as beholden to Wall Street as McCain and nearly every other national Democrat or Republican are.  It should be obvious that these corporate Obama supporters have zero interest in rending their investments in him worthless.\nNow, perhaps PTQ has other reasons for believing that Obama was born in the United States that he has not shared with us.  But clearly the reasons that he has provided so far are not only superficial, inconclusive and incorrect, but rest upon logic that is much more questionable than the competing logical reasoning that he previously rejected in such perjorative terms.  The amusing thing, of course, is that I told PTQ yesterday exactly what I was going to do prior to his response and warned him that there was nothing he could do about it.  I leave it to you to ascertain the accuracy of that prediction.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-15T11:11:00+00:00"
}