{
  "url": "https://voxday.net/2010/04/05/who-needs-christianity/",
  "scraped_at": "2026-01-08T23:23:49.857958",
  "title": "Who needs Christianity?",
  "date_display": "April 5, 2010",
  "date_iso": "2010-04-05T16:33:00+00:00",
  "date_from_url": "2010-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or the Western European culture it inspired <a href=\"http://www.google.com/hostednews/ap/article/ALeqM5iVKJwZGbjcGft_IsyTJWdY6UGlCQD9ESCS900\">in light of the options</a>:</p><blockquote><p>The practice of human sacrifice is on the rise in Uganda, as measured by ritual killings where body parts, often facial features or genitals, are cut off for use in ceremonies. The number of people killed in ritual murders last year rose to a new high of at least 15 children and 14 adults, up from just three cases in 2007, according to police. The informal count is much higher — 154 suspects were arrested last year and 50 taken to court over ritual killings.</p><p>Children in particular are common victims, according to a U.S. State Department report released this month. The U.S. spent $500,000 to train 2,000 Ugandan police last year to investigate offences related to human trafficking, including ritual killings.</p><p>The problem is bad enough that last year the police established an Anti-Human Sacrifice Taskforce. Posters on police station walls show a sinister stranger luring two young girls into a car below bold letters that call on parents to “Prevent Child Sacrifice.”</p></blockquote><p>The thing that struck me as most interesting about this is the fact that it comes so soon after the Western media was up in arms about Uganda’s anti-homosexual laws.  Journalists are clearly more concerned about <i>potential</i> death sentences being meted out for criminal acts of homosexuality than they are about actual child murders being committed by witch doctors.</p><p>Now, some irreligious will quite reasonably declare a pox on both the Christian and pagan houses; the only form of child sacrifice practiced by secularists is abortion and the occasional collateral damage from mass vaccination.  The problem with that perspective is that no matter what the 1950s science fiction authors believed, it is very clear godless secularism has about the same chance to be the cultural heir to Christianity that we had to be flying cars and living in undersea cities before the end of the 20th century.</p><p>As Chesterton, history, and demographics have all pointed out, when Christianity fails in a society, it is not going to be replaced by a lack of religion, but by a different religion.  The more intelligent members of the irreligientsia would do well to ponder whether continuting to work towards that replacement is a wise policy or not.</p><p>It is also worth keeping in mind that Christians who are accustomed to fighting this sort of raw and undisguised evil are not likely to be as tolerant of open violations of Biblical morality as the average Western Christian.</p></div>",
  "content_text": "Or the Western European culture it inspired\nin light of the options\n:\nThe practice of human sacrifice is on the rise in Uganda, as measured by ritual killings where body parts, often facial features or genitals, are cut off for use in ceremonies. The number of people killed in ritual murders last year rose to a new high of at least 15 children and 14 adults, up from just three cases in 2007, according to police. The informal count is much higher — 154 suspects were arrested last year and 50 taken to court over ritual killings.\nChildren in particular are common victims, according to a U.S. State Department report released this month. The U.S. spent $500,000 to train 2,000 Ugandan police last year to investigate offences related to human trafficking, including ritual killings.\nThe problem is bad enough that last year the police established an Anti-Human Sacrifice Taskforce. Posters on police station walls show a sinister stranger luring two young girls into a car below bold letters that call on parents to “Prevent Child Sacrifice.”\nThe thing that struck me as most interesting about this is the fact that it comes so soon after the Western media was up in arms about Uganda’s anti-homosexual laws.  Journalists are clearly more concerned about\npotential\ndeath sentences being meted out for criminal acts of homosexuality than they are about actual child murders being committed by witch doctors.\nNow, some irreligious will quite reasonably declare a pox on both the Christian and pagan houses; the only form of child sacrifice practiced by secularists is abortion and the occasional collateral damage from mass vaccination.  The problem with that perspective is that no matter what the 1950s science fiction authors believed, it is very clear godless secularism has about the same chance to be the cultural heir to Christianity that we had to be flying cars and living in undersea cities before the end of the 20th century.\nAs Chesterton, history, and demographics have all pointed out, when Christianity fails in a society, it is not going to be replaced by a lack of religion, but by a different religion.  The more intelligent members of the irreligientsia would do well to ponder whether continuting to work towards that replacement is a wise policy or not.\nIt is also worth keeping in mind that Christians who are accustomed to fighting this sort of raw and undisguised evil are not likely to be as tolerant of open violations of Biblical morality as the average Western Christian.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-05T15:33:00+00:00"
}