{
  "url": "https://voxday.net/2010/04/17/whores-rush-to-defend-goldman/",
  "scraped_at": "2026-01-08T23:24:47.128455",
  "title": "The whores rush to defend Goldman",
  "date_display": "April 17, 2010",
  "date_iso": "2010-04-17T20:20:00+00:00",
  "date_from_url": "2010-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William D. Cohan <a href=\"http://opinionator.blogs.nytimes.com/2010/04/16/in-a-rush-to-judge-goldman/?hp\">leaps to defend the Vampire Squid</a>.  And surprise, surprise, he also owns Goldman stock:</p><blockquote><p>Goldman also was not above working with a client like Paulson to structure a security — for a fee — that Paulson could then short. Would those European banks not have bought Abacus if they had known that Paulson had helped select what went inside it? Possibly. But no one forced them to buy Abacus.  And if the housing market had soared for a few more years, and Paulson and Goldman had lost billions instead of making billions, would the S.E.C. have filed a lawsuit against Abacus’s investors?</p><p>These might not be the most popular questions to be asking right now, but until we get the answers we can’t assume Goldman’s guilt.</p></blockquote><p>There are no words sufficiently contemptuous to describe this insufferable little [expletive deleted] and his pathetic attempt to play defense attorney on the Vampire Squid’s behalf.  How dare he try to exonerate Goldman by claiming the market could have gone against them!  Because we all know very well what happened when the market DID go against them… they were bailed out by the federal government.  Not only were they bailed out, but they were permitted to magically transform their legal corporate identity so that they could be bailed out!</p><p>It’s at times like these that one can understand the initial popularity of the French revolutionary excesses.  One knows better than to think any good would come of it, and even so, one would almost find oneself ready to welcome <i>La Terreur</i> so long as the insufferable bankers with their interminable self-justifications are sent to the guillotines.</p><p>Cohan conveniently omits that no one forces little old ladies to invest in financial scams either, and yet the petty con men who scammed them are still prosecuted for fraud.</p></div>",
  "content_text": "William D. Cohan\nleaps to defend the Vampire Squid\n.  And surprise, surprise, he also owns Goldman stock:\nGoldman also was not above working with a client like Paulson to structure a security — for a fee — that Paulson could then short. Would those European banks not have bought Abacus if they had known that Paulson had helped select what went inside it? Possibly. But no one forced them to buy Abacus.  And if the housing market had soared for a few more years, and Paulson and Goldman had lost billions instead of making billions, would the S.E.C. have filed a lawsuit against Abacus’s investors?\nThese might not be the most popular questions to be asking right now, but until we get the answers we can’t assume Goldman’s guilt.\nThere are no words sufficiently contemptuous to describe this insufferable little [expletive deleted] and his pathetic attempt to play defense attorney on the Vampire Squid’s behalf.  How dare he try to exonerate Goldman by claiming the market could have gone against them!  Because we all know very well what happened when the market DID go against them… they were bailed out by the federal government.  Not only were they bailed out, but they were permitted to magically transform their legal corporate identity so that they could be bailed out!\nIt’s at times like these that one can understand the initial popularity of the French revolutionary excesses.  One knows better than to think any good would come of it, and even so, one would almost find oneself ready to welcome\nLa Terreur\nso long as the insufferable bankers with their interminable self-justifications are sent to the guillotines.\nCohan conveniently omits that no one forces little old ladies to invest in financial scams either, and yet the petty con men who scammed them are still prosecuted for fraud.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-17T19:20:00+00:00"
}