{
  "url": "https://voxday.net/2010/04/05/wnd-column-33/",
  "scraped_at": "2026-01-08T23:23:48.010210",
  "title": "WND column",
  "date_display": "April 5, 2010",
  "date_iso": "2010-04-05T13:24:00+00:00",
  "date_from_url": "2010-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/index.php?pageId=136369\"><b>Ignoring History’s Lessons</b></a></p><p><i>ALAN GREENSPAN, the former chairman of the Federal Reserve, proclaimed last month that no one could have predicted the housing bubble. “Everybody missed it,” he said, “academia, the Federal Reserve, all regulators.”… Mr. Greenspan said that he sat through innumerable meetings at the Fed with crack economists, and not one of them warned of the problems that were to come. By Mr. Greenspan’s logic, anyone who might have foreseen the housing bubble would have been invited into the ivory tower, so if all those who were there did not hear it, then no one could have said it.<br> – Michael J. Burry, New York Times, April 3, 2010</br></i></p><p>Michael Burry is correct. Alan Greenspan is completely wrong to say everyone missed the housing bubble. Michael Burry recognized it in 2005. I saw it coming in 2002. And Edward Gramlich, a Federal Reserve governor, accurately anticipated the problem as far back as 2000. Moreover, Gramlich personally warned Greenspan about the way in which providing home mortgages to low-income borrowers would lead to widespread loan defaults that would have tremendously negative effects on the national economy. Greenspan, of course, disregarded Gramlich’s warning and rejected Gramlich’s recommendation to audit consumer finance companies because he correctly feared that shining a light on the widespread fraud being committed by the swarming mortgage brokers would reduce the availability of subprime credit.</p></div>",
  "content_text": "Ignoring History’s Lessons\nALAN GREENSPAN, the former chairman of the Federal Reserve, proclaimed last month that no one could have predicted the housing bubble. “Everybody missed it,” he said, “academia, the Federal Reserve, all regulators.”… Mr. Greenspan said that he sat through innumerable meetings at the Fed with crack economists, and not one of them warned of the problems that were to come. By Mr. Greenspan’s logic, anyone who might have foreseen the housing bubble would have been invited into the ivory tower, so if all those who were there did not hear it, then no one could have said it.\n– Michael J. Burry, New York Times, April 3, 2010\nMichael Burry is correct. Alan Greenspan is completely wrong to say everyone missed the housing bubble. Michael Burry recognized it in 2005. I saw it coming in 2002. And Edward Gramlich, a Federal Reserve governor, accurately anticipated the problem as far back as 2000. Moreover, Gramlich personally warned Greenspan about the way in which providing home mortgages to low-income borrowers would lead to widespread loan defaults that would have tremendously negative effects on the national economy. Greenspan, of course, disregarded Gramlich’s warning and rejected Gramlich’s recommendation to audit consumer finance companies because he correctly feared that shining a light on the widespread fraud being committed by the swarming mortgage brokers would reduce the availability of subprime credit.",
  "tags": [
    "banks",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-05T12:24:00+00:00"
}