{
  "url": "https://voxday.net/2010/04/15/your-money-is-perfectly-safe/",
  "scraped_at": "2026-01-08T23:24:35.027960",
  "title": "Your money is perfectly safe",
  "date_display": "April 15, 2010",
  "date_iso": "2010-04-15T13:45:00+00:00",
  "date_from_url": "2010-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt those who believe Obama is hiding his past because he has nothing to hide will conclude that the U.S. banks must be perfectly healthy if they are so vehemently determined <a href=\"http://www.bloomberg.com/apps/news?pid=20601087&amp;sid=ax8ulGXswn4E\">to prevent the disclosure</a> of the money they borrowed from the Federal Reserve:</p><blockquote><p>The biggest U.S. commercial banks will take their fight against disclosure of Federal Reserve lending in 2008 to the Supreme Court if necessary, the top lawyer for an industry-owned group said.</p><p>Continued legal appeals will delay or block the first public look at details of the central bank’s $2 trillion in emergency lending during the 2008 financial crisis. The Clearing House Association LLC, a group that includes Bank of America Corp. and JPMorgan Chase &amp; Co., joined the Fed in defense of a lawsuit brought by Bloomberg LP, the parent company of Bloomberg News, seeking release of records related to four Fed lending programs.</p><p>The U.S. Court of Appeals in Manhattan ruled March 19 that the central bank must release the documents. A three-judge panel of the appellate court rejected the Fed’s argument that disclosure would stigmatize borrowers and discourage banks from seeking emergency help.</p><p>“Our member banks are very concerned about real-time disclosure of information that could cause a run on the banks,” said Paul Saltzman, the group’s general counsel, in an interview yesterday. “We’re not going to let the Second Circuit opinion stand without seeking a review.”</p></blockquote><p>Now that was a <i>professional</i> segue.  Please don’t try it at home without first taking the necessary precautionary measures.  So, here is my question.  If the banks are so determined to fight this disclosure and if their general counsel is publicly declaring that the release of this information could be reasonably expected to cause a bank run, then what in the world are Americans doing still leaving their money in those banks?  Are they waiting for the guy to spell it out for them in interpretive dance or something?</p></div>",
  "content_text": "No doubt those who believe Obama is hiding his past because he has nothing to hide will conclude that the U.S. banks must be perfectly healthy if they are so vehemently determined\nto prevent the disclosure\nof the money they borrowed from the Federal Reserve:\nThe biggest U.S. commercial banks will take their fight against disclosure of Federal Reserve lending in 2008 to the Supreme Court if necessary, the top lawyer for an industry-owned group said.\nContinued legal appeals will delay or block the first public look at details of the central bank’s $2 trillion in emergency lending during the 2008 financial crisis. The Clearing House Association LLC, a group that includes Bank of America Corp. and JPMorgan Chase & Co., joined the Fed in defense of a lawsuit brought by Bloomberg LP, the parent company of Bloomberg News, seeking release of records related to four Fed lending programs.\nThe U.S. Court of Appeals in Manhattan ruled March 19 that the central bank must release the documents. A three-judge panel of the appellate court rejected the Fed’s argument that disclosure would stigmatize borrowers and discourage banks from seeking emergency help.\n“Our member banks are very concerned about real-time disclosure of information that could cause a run on the banks,” said Paul Saltzman, the group’s general counsel, in an interview yesterday. “We’re not going to let the Second Circuit opinion stand without seeking a review.”\nNow that was a\nprofessional\nsegue.  Please don’t try it at home without first taking the necessary precautionary measures.  So, here is my question.  If the banks are so determined to fight this disclosure and if their general counsel is publicly declaring that the release of this information could be reasonably expected to cause a bank run, then what in the world are Americans doing still leaving their money in those banks?  Are they waiting for the guy to spell it out for them in interpretive dance or something?",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-04-15T12:45:00+00:00"
}