{
  "url": "https://voxday.net/2019/11/23/a-nonexistent-invitation/",
  "scraped_at": "2025-12-21T03:06:37.133813",
  "title": "A nonexistent invitation",
  "date_display": "November 23, 2019",
  "date_iso": "2019-11-23T15:12:24+00:00",
  "date_from_url": "2019-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Howard leaped to a completely erroneous conclusion subsequent to my invitation to Mr. Fuentes to debate a specific historical event of particular interest to him:</p><blockquote class=\"tr_bq\"><p>This must mean Nick the knife has finally and definitively turned down the “come join us at unauthorized tv” overtures. Considering his live viewership, nightly superchat support, and the fact he is taken as a serious threat by conservative Inc, this must be quite a blow to the ego. To the gamma, the sting of rejection is like the slow knife, the one that takes its time, which slips quietly between the bones, that’s the knife that cuts the deepest.</p></blockquote><p>Let me be perfectly clear about the relevant facts. Nick Fuentes was never invited to join Unauthorized.TV. Never. Out of about 85 established creators who have expressed varying degrees of interest in joining us at one time or another, precisely three have been invited to join UATV: Dr. Rachel Fulton Brown, Zammy the Giant Sheepadoodle, and Wranglerstar. All three accepted the invitation without hesitation.</p><p>I have spoken once to Mr. Fuentes, on May 8th, 2019, for about 20 minutes. We had a good and mutually respectful discussion, in which it soon became apparent to both of us that it did not make any sense for him to join Unauthorized, which is why he never asked to join it and I never invited him to do so. I further note that <i>America First with Nicholas J. Fuentes</i> has 68.9k YouTube subscribers, which is excellent considering that he had around 30k back in May when we spoke. That being said, by way of comparison, <a href=\"https://www.unauthorized.tv/categories/wranglerstar\">UATV’s newest contributor, Wranglerstar</a>, has 1.33M subscribers.</p><p>In summary, no one at Unauthorized cares even a fraction of an iota whether Mr. Fuentes wants to be on Unauthorized or not. We certainly wish Mr. Fuentes great success in his campaign against Conservatism Inc., but we neither need nor want him on our channel. Our egos, such as they are, remain intact and unaffected.</p></div>",
  "content_text": "Thomas Howard leaped to a completely erroneous conclusion subsequent to my invitation to Mr. Fuentes to debate a specific historical event of particular interest to him:\nThis must mean Nick the knife has finally and definitively turned down the “come join us at unauthorized tv” overtures. Considering his live viewership, nightly superchat support, and the fact he is taken as a serious threat by conservative Inc, this must be quite a blow to the ego. To the gamma, the sting of rejection is like the slow knife, the one that takes its time, which slips quietly between the bones, that’s the knife that cuts the deepest.\nLet me be perfectly clear about the relevant facts. Nick Fuentes was never invited to join Unauthorized.TV. Never. Out of about 85 established creators who have expressed varying degrees of interest in joining us at one time or another, precisely three have been invited to join UATV: Dr. Rachel Fulton Brown, Zammy the Giant Sheepadoodle, and Wranglerstar. All three accepted the invitation without hesitation.\nI have spoken once to Mr. Fuentes, on May 8th, 2019, for about 20 minutes. We had a good and mutually respectful discussion, in which it soon became apparent to both of us that it did not make any sense for him to join Unauthorized, which is why he never asked to join it and I never invited him to do so. I further note that\nAmerica First with Nicholas J. Fuentes\nhas 68.9k YouTube subscribers, which is excellent considering that he had around 30k back in May when we spoke. That being said, by way of comparison,\nUATV’s newest contributor, Wranglerstar\n, has 1.33M subscribers.\nIn summary, no one at Unauthorized cares even a fraction of an iota whether Mr. Fuentes wants to be on Unauthorized or not. We certainly wish Mr. Fuentes great success in his campaign against Conservatism Inc., but we neither need nor want him on our channel. Our egos, such as they are, remain intact and unaffected.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-23T15:12:24+00:00"
}