{
  "url": "https://voxday.net/2019/11/03/grabblerism-is-not-capitalism/",
  "scraped_at": "2025-12-21T03:04:06.815321",
  "title": "Grabblerism is not capitalism",
  "date_display": "November 3, 2019",
  "date_iso": "2019-11-03T13:25:19+00:00",
  "date_from_url": "2019-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Saker interviews economist Michael Hudson, whose answers underline the increasingly obvious fact that as bad as communism is for a nation, grabblerism is even worse for it:</i></p><p><b>The Saker: </b>The US propaganda often claims that the three Baltic states are a true success, just like Poland is also supposed to be. Does this notion have a factual basis? Initially it did appear that these states were experiencing growth, but was that not mostly/entirely due to EU/IMF/US subsidies? Looking specifically at the three Baltic states, and especially Latvia, these were the “showcase” Soviet republics, with a high standard of living (at least compared to the other Soviet republics) and a lot of high-tech industries (including defense contracts). Could you please outline for us what truly happened to these economies following independence? How did they “reform” their economies going from an ex-Soviet one to the modern “liberal” one?</p><p><b>Michael Hudson: </b>This is a trick question, because it all depends on what you mean by “success.”</p><p>The post-Soviet neoliberalism has been a great success for kleptocrats at the top. They gave themselves the public domain, from key industries to prime real estate. But the Balts largely let their Soviet industries collapse, making no effort to salvage or reorganize them.</p><p>Much of the problem, of course, was that all the linkages to Soviet-era industry were torn apart as the Soviet Union was disbanded. With their supplier and final markets closed down from Russia to Central Asia, the Baltic economies had to start afresh – with a very right-wing tax policy and no government help whatsoever, as the government itself had become privatized in the hands of former officials and grabitizers.</p><p>Lithuania was marginally better in having some industrial policy. EU and NATO accession in 2004, along with easy credit, kicked off property bubbles in the Baltics, largely inflated by Swedish banks that made a bonanza off these countries that lacked their own banks or public credit creation. The resulting 2008 crashes were the largest in the world as a percent of GDP, with Latvia suffering the world’s biggest contraction.</p><p>The neoliberal western advisors who took control of these economies – as if this was the only alternative to Soviet bureaucracy – imposed crushing austerity programs to restore macroeconomic “stability” meaning security of their land and infrastructure grabs. This was applauded by Europe’s bankers, who thought the Balts had discovered a workable recipe allowing austerity governments to retain power in a seeming democracy. These policies would have collapsed governments anywhere else, but the ability to emigrate, plus ethnic divisions against Russian speakers, allowed these governments to survive.</p><p>It’s a historically specific situation, but Europe’s bankers promote it as a generalized model. George Soros’s INET and his associated front institutions have been leaders in subsidizing this financialization-cum-grabitization. The result has been a massive exodus of prime working age people from Lithuania and Latvia. (Estonians simply commute to Finland.) Meanwhile, their economies are buoyed by foreign bank lending, which sends profits back to home countries and can be reversed at any time.</p><p>Politically, the neoliberal revolution also has been a success for U.S. Cold Warriors, who sent over native Balts from Georgetown and other universities to impose “free market” doctrine – that is, a market “free” of domestic regulation against theft of the public domain, against monopolies, against land taxes and other income taxes. The Baltic states, like most of the rest of the former Soviet Union, became the Wild East.</p><p>What was left to the Baltic countries was land and real estate. Their forests are being cut down to sell wood abroad. I describe all this in my book Killing the Host.</p><p><b>The Saker: </b>After independence, the Baltic states had tried to cut as many ties with Russia as possible. This included building (rather silly looking) fences, to forcing the Russians to develop their ports on the Baltic, to shutting down large (or selling to foreign interests which then shut them down) and profitable factories (including a large nuclear plant I believe), etc. What has been the impact of this policy of “economic de-Sovietization” on the local economies?</p><p><b>Michael Hudson: </b>Dissolution of the Soviet Union meant that Baltic countries lost their traditional markets, and had to shift their focus to Western Europe and, to some extent, Asia…. The Baltic states, especially Latvia, have lost about 30 percent of their population since the 1990s, especially those of working age. In Latvia, about 10 percent of the loss were Russians who exited shortly after independence. The other 20 percent have subsequently emigrated.</p></div>",
  "content_text": "The Saker interviews economist Michael Hudson, whose answers underline the increasingly obvious fact that as bad as communism is for a nation, grabblerism is even worse for it:\nThe Saker:\nThe US propaganda often claims that the three Baltic states are a true success, just like Poland is also supposed to be. Does this notion have a factual basis? Initially it did appear that these states were experiencing growth, but was that not mostly/entirely due to EU/IMF/US subsidies? Looking specifically at the three Baltic states, and especially Latvia, these were the “showcase” Soviet republics, with a high standard of living (at least compared to the other Soviet republics) and a lot of high-tech industries (including defense contracts). Could you please outline for us what truly happened to these economies following independence? How did they “reform” their economies going from an ex-Soviet one to the modern “liberal” one?\nMichael Hudson:\nThis is a trick question, because it all depends on what you mean by “success.”\nThe post-Soviet neoliberalism has been a great success for kleptocrats at the top. They gave themselves the public domain, from key industries to prime real estate. But the Balts largely let their Soviet industries collapse, making no effort to salvage or reorganize them.\nMuch of the problem, of course, was that all the linkages to Soviet-era industry were torn apart as the Soviet Union was disbanded. With their supplier and final markets closed down from Russia to Central Asia, the Baltic economies had to start afresh – with a very right-wing tax policy and no government help whatsoever, as the government itself had become privatized in the hands of former officials and grabitizers.\nLithuania was marginally better in having some industrial policy. EU and NATO accession in 2004, along with easy credit, kicked off property bubbles in the Baltics, largely inflated by Swedish banks that made a bonanza off these countries that lacked their own banks or public credit creation. The resulting 2008 crashes were the largest in the world as a percent of GDP, with Latvia suffering the world’s biggest contraction.\nThe neoliberal western advisors who took control of these economies – as if this was the only alternative to Soviet bureaucracy – imposed crushing austerity programs to restore macroeconomic “stability” meaning security of their land and infrastructure grabs. This was applauded by Europe’s bankers, who thought the Balts had discovered a workable recipe allowing austerity governments to retain power in a seeming democracy. These policies would have collapsed governments anywhere else, but the ability to emigrate, plus ethnic divisions against Russian speakers, allowed these governments to survive.\nIt’s a historically specific situation, but Europe’s bankers promote it as a generalized model. George Soros’s INET and his associated front institutions have been leaders in subsidizing this financialization-cum-grabitization. The result has been a massive exodus of prime working age people from Lithuania and Latvia. (Estonians simply commute to Finland.) Meanwhile, their economies are buoyed by foreign bank lending, which sends profits back to home countries and can be reversed at any time.\nPolitically, the neoliberal revolution also has been a success for U.S. Cold Warriors, who sent over native Balts from Georgetown and other universities to impose “free market” doctrine – that is, a market “free” of domestic regulation against theft of the public domain, against monopolies, against land taxes and other income taxes. The Baltic states, like most of the rest of the former Soviet Union, became the Wild East.\nWhat was left to the Baltic countries was land and real estate. Their forests are being cut down to sell wood abroad. I describe all this in my book Killing the Host.\nThe Saker:\nAfter independence, the Baltic states had tried to cut as many ties with Russia as possible. This included building (rather silly looking) fences, to forcing the Russians to develop their ports on the Baltic, to shutting down large (or selling to foreign interests which then shut them down) and profitable factories (including a large nuclear plant I believe), etc. What has been the impact of this policy of “economic de-Sovietization” on the local economies?\nMichael Hudson:\nDissolution of the Soviet Union meant that Baltic countries lost their traditional markets, and had to shift their focus to Western Europe and, to some extent, Asia…. The Baltic states, especially Latvia, have lost about 30 percent of their population since the 1990s, especially those of working age. In Latvia, about 10 percent of the loss were Russians who exited shortly after independence. The other 20 percent have subsequently emigrated.",
  "tags": [
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-03T13:25:19+00:00"
}