{
  "url": "https://voxday.net/2019/11/06/no-despair-nancies/",
  "scraped_at": "2025-12-21T03:04:36.129843",
  "title": "No despair nancies",
  "date_display": "November 6, 2019",
  "date_iso": "2019-11-06T13:19:52+00:00",
  "date_from_url": "2019-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re going to be a despair nancy, just go away now. Take that weak, worrisome <i>“I just fear bad things will happen to people who are braver than me”</i> bullshit to Hell from whence it came. You are literally worse than useless. If you were truly concerned, you’d be praying for them in silence, you wouldn’t be issuing what could quite reasonably be seen as implicit threats in public.</p><p>Understand this is a hard and fast rule. If you are a demoralizer, if you are a black-piller, you WILL be banned. Period. And I don’t give an airborne rodent’s posterior if your fear is genuine. In fact, that would be all the more reason to banish you from our midst.</p><p>WE are not given a spirit of fear. If YOU are, then obviously you are not us.</p><p>If you can’t steel yourself and find the courage to stand in the ranks without flinching, then we neither need nor want you at our sides.</p></div>",
  "content_text": "If you’re going to be a despair nancy, just go away now. Take that weak, worrisome\n“I just fear bad things will happen to people who are braver than me”\nbullshit to Hell from whence it came. You are literally worse than useless. If you were truly concerned, you’d be praying for them in silence, you wouldn’t be issuing what could quite reasonably be seen as implicit threats in public.\nUnderstand this is a hard and fast rule. If you are a demoralizer, if you are a black-piller, you WILL be banned. Period. And I don’t give an airborne rodent’s posterior if your fear is genuine. In fact, that would be all the more reason to banish you from our midst.\nWE are not given a spirit of fear. If YOU are, then obviously you are not us.\nIf you can’t steel yourself and find the courage to stand in the ranks without flinching, then we neither need nor want you at our sides.",
  "tags": [
    "ELoE"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-06T13:19:52+00:00"
}