{
  "url": "https://voxday.net/2019/11/06/outgrowing-logic/",
  "scraped_at": "2025-12-21T03:04:34.312723",
  "title": "Outgrowing logic",
  "date_display": "November 6, 2019",
  "date_iso": "2019-11-06T10:40:58+00:00",
  "date_from_url": "2019-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scientists can’t do logic. Especially <a href=\"https://www.thetimes.co.uk/article/outgrowing-god-by-richard-dawkins-review-dxnsjcdfk?shareToken=5d15de2faf5092a6d539a72088659234\">not atheist ex-scientists</a>:</p><blockquote><p>Thankfully, though, the farther this book gets from God, the better it gets. A chapter on the increasing niceness of humanity is neatly presented, contrasting popular support for attacking enemy civilians in the Second World War with condemnation of even accidental civilian casualties in the two Gulf wars. By the time we get to part two, which focuses on his first passion of evolution, the bitterness has evaporated. Instead we have delight at the way a cheetah can accelerate faster than a Tesla and five pages on what goes on with a chameleon’s tongue. The skin of an octopus, we learn, changes colour according to the same principles as a TV screen, to the extent that if we could hook an octopus brain to a computer, “we could play Charlie Chaplin movies on its skin”.</p><p>We hear about goosebumps being a leftover from the days we were hairier, and about the recurrent laryngeal nerve, which loops down into the chest of a mammal, then loops back up to where it is needed, in the throat. In a giraffe it is metres longer than it would need to be if the damn creatures had been designed properly. In other words, it offers irrefutable proof that they, like us, evolved from something else.</p><p>It should be noted that almost none of this is new, and especially not for the readers of Dawkins. The laryngeal-nerve stuff, for example, is lifted almost wholesale from his 2009 book <i>The Greatest Show on Earth</i>. For the earlier, more cantankerous anti-religious stuff, you might as well just read <i>The God Delusion</i>, where you’ll find most of the same arguments, and usually with the same examples too.</p></blockquote><p>It’s rather amusing the way scientists attempt to convey a permanent status on themselves. For example, no one describes me as “a chart-topping techno band member” because my band no longer records music or hits the Billboard club charts. But Richard Dawkins’s most recent science paper is nearly as old as <a href=\"https://www.youtube.com/watch?v=EJklwXwRjmU\"><i>Welcome to My Mind</i></a>.</p><p>Anyhow, scientist or ex-scientist, logic has always been well beyond Richard Dawkins. Consider the logic of his 2009 argument about the giraffe in syllogistic form.</p><p><b>Major premise: </b>That which is designed is perfectly efficient.<br><b>Minor premise:</b> The giraffe’s recurrent laryngeal nerve is not perfectly efficient.<br><b>Conclusion: </b>The giraffe was not designed.</br></br></p><p>As I pointed out when he first wrote <i>The Greatest Show on Earth</i>, this logic is not merely based on a false major premise, but the false premise requires almost complete ignorance about engineering and design. No one who has ever seen a prototype computer board would fall for such nonsense, and indeed, the core concept that underlies this false logic is obviously ridiculous from a philosophical perspective, as it could be used to logically disprove the existence of the material world.</p><p><b>Major premise: </b>That which is not its Platonic Form does not exist.<br><b>Minor premise:</b> The world is not ideal (i.e. we can imagine a more perfect world)<br><b>Conclusion: </b>The world does not exist.</br></br></p><p>It’s the reverse ontological argument for the nonexistence of God, the universe, and everything. And then, of course, even if we ignore the incorrect initial logic and simply grant the assumption that the giraffe was not designed, that does not mean that the giraffe must have evolved, much less that the giraffe evolved by natural selection as per Darwin by way of Mendel.</p></div>",
  "content_text": "Scientists can’t do logic. Especially\nnot atheist ex-scientists\n:\nThankfully, though, the farther this book gets from God, the better it gets. A chapter on the increasing niceness of humanity is neatly presented, contrasting popular support for attacking enemy civilians in the Second World War with condemnation of even accidental civilian casualties in the two Gulf wars. By the time we get to part two, which focuses on his first passion of evolution, the bitterness has evaporated. Instead we have delight at the way a cheetah can accelerate faster than a Tesla and five pages on what goes on with a chameleon’s tongue. The skin of an octopus, we learn, changes colour according to the same principles as a TV screen, to the extent that if we could hook an octopus brain to a computer, “we could play Charlie Chaplin movies on its skin”.\nWe hear about goosebumps being a leftover from the days we were hairier, and about the recurrent laryngeal nerve, which loops down into the chest of a mammal, then loops back up to where it is needed, in the throat. In a giraffe it is metres longer than it would need to be if the damn creatures had been designed properly. In other words, it offers irrefutable proof that they, like us, evolved from something else.\nIt should be noted that almost none of this is new, and especially not for the readers of Dawkins. The laryngeal-nerve stuff, for example, is lifted almost wholesale from his 2009 book\nThe Greatest Show on Earth\n. For the earlier, more cantankerous anti-religious stuff, you might as well just read\nThe God Delusion\n, where you’ll find most of the same arguments, and usually with the same examples too.\nIt’s rather amusing the way scientists attempt to convey a permanent status on themselves. For example, no one describes me as “a chart-topping techno band member” because my band no longer records music or hits the Billboard club charts. But Richard Dawkins’s most recent science paper is nearly as old as\nWelcome to My Mind\n.\nAnyhow, scientist or ex-scientist, logic has always been well beyond Richard Dawkins. Consider the logic of his 2009 argument about the giraffe in syllogistic form.\nMajor premise:\nThat which is designed is perfectly efficient.\nMinor premise:\nThe giraffe’s recurrent laryngeal nerve is not perfectly efficient.\nConclusion:\nThe giraffe was not designed.\nAs I pointed out when he first wrote\nThe Greatest Show on Earth\n, this logic is not merely based on a false major premise, but the false premise requires almost complete ignorance about engineering and design. No one who has ever seen a prototype computer board would fall for such nonsense, and indeed, the core concept that underlies this false logic is obviously ridiculous from a philosophical perspective, as it could be used to logically disprove the existence of the material world.\nMajor premise:\nThat which is not its Platonic Form does not exist.\nMinor premise:\nThe world is not ideal (i.e. we can imagine a more perfect world)\nConclusion:\nThe world does not exist.\nIt’s the reverse ontological argument for the nonexistence of God, the universe, and everything. And then, of course, even if we ignore the incorrect initial logic and simply grant the assumption that the giraffe was not designed, that does not mean that the giraffe must have evolved, much less that the giraffe evolved by natural selection as per Darwin by way of Mendel.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-06T10:40:58+00:00"
}