{
  "url": "https://voxday.net/2019/11/24/rep-nunes-gets-it/",
  "scraped_at": "2025-12-21T03:06:47.762374",
  "title": "Rep. Nunes gets it",
  "date_display": "November 24, 2019",
  "date_iso": "2019-11-24T18:00:04+00:00",
  "date_from_url": "2019-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You don’t talk to the media. Not to the enemy media. Not to their lesser sisters in the conservative media. Not to the so-called Christian media. You <a href=\"https://www.dailywire.com/news/breaking-devin-nunes-will-take-swift-legal-action-against-cnn-for-demonstrably-false-story\">don’t talk to the media</a>.</p><blockquote><p>In an exclusive statement provided to Breitbart News, Nunes said: “These demonstrably false and scandalous stories published by the Daily Beast and CNN are the perfect example of defamation and reckless disregard for the truth. Some political operative offered these fake stories to at least five different media outlets before finding someone irresponsible enough to publish them. I look forward to prosecuting these cases, including the media outlets, as well as the sources of their fake stories, to the fullest extent of the law. I intend to hold the Daily Beast and CNN accountable for their actions. They will find themselves in court soon after Thanksgiving.”</p><p>CNN claims that they began to ask Nunes questions about his Vienna trip on November 14, to which Nunes responded to CNN: “I don’t talk to you in this lifetime or the next lifetime. At any time. On any question.”</p><p>CNN asked Nunes about the trip again on Thursday, to which Nunes responded: “To be perfectly clear, I don’t acknowledge any questions from you in this lifetime or the next lifetime. I don’t acknowledge any question from you ever.”</p><p>Nunes has long held a policy of not communicating with CNN.</p></blockquote><p>A number of media outlets of varying stripes, some purportedly friendly, others obviously not so, have contacted me with regards to an interview concerning <i>Corporate Cancer</i>. I have declined all of them, some regretfully, others not so.</p><p>I anticipate there will be considerably more media interest as things continue to progress on the various legal fronts and word eventually begins to leak out concerning the complete untenability of Silicon Valley’s perspective on thought policing and deplatforming. And I will continue to not talk to anyone about it or anything else.</p><p>The media has nothing to sell except the information that we collectively give them. So stop feeding the evil beast that hates you.</p></div>",
  "content_text": "You don’t talk to the media. Not to the enemy media. Not to their lesser sisters in the conservative media. Not to the so-called Christian media. You\ndon’t talk to the media\n.\nIn an exclusive statement provided to Breitbart News, Nunes said: “These demonstrably false and scandalous stories published by the Daily Beast and CNN are the perfect example of defamation and reckless disregard for the truth. Some political operative offered these fake stories to at least five different media outlets before finding someone irresponsible enough to publish them. I look forward to prosecuting these cases, including the media outlets, as well as the sources of their fake stories, to the fullest extent of the law. I intend to hold the Daily Beast and CNN accountable for their actions. They will find themselves in court soon after Thanksgiving.”\nCNN claims that they began to ask Nunes questions about his Vienna trip on November 14, to which Nunes responded to CNN: “I don’t talk to you in this lifetime or the next lifetime. At any time. On any question.”\nCNN asked Nunes about the trip again on Thursday, to which Nunes responded: “To be perfectly clear, I don’t acknowledge any questions from you in this lifetime or the next lifetime. I don’t acknowledge any question from you ever.”\nNunes has long held a policy of not communicating with CNN.\nA number of media outlets of varying stripes, some purportedly friendly, others obviously not so, have contacted me with regards to an interview concerning\nCorporate Cancer\n. I have declined all of them, some regretfully, others not so.\nI anticipate there will be considerably more media interest as things continue to progress on the various legal fronts and word eventually begins to leak out concerning the complete untenability of Silicon Valley’s perspective on thought policing and deplatforming. And I will continue to not talk to anyone about it or anything else.\nThe media has nothing to sell except the information that we collectively give them. So stop feeding the evil beast that hates you.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-24T18:00:04+00:00"
}