{
  "url": "https://voxday.net/2019/11/30/statistics-and-the-gamma/",
  "scraped_at": "2025-12-21T03:07:24.174437",
  "title": "Statistics and the gamma",
  "date_display": "November 30, 2019",
  "date_iso": "2019-11-30T11:02:27+00:00",
  "date_from_url": "2019-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As bad as the comments here can be, they can never hope to devolve to the level of gamma lunacy one encounters on YouTube. One DM offers us <a href=\"https://www.youtube.com/watch?v=AAa3WbJyCAQ&amp;lc=UgwXSmGoTz7PQjVQxCR4AaABAg\">the usual Gamma Wall of Text</a> in the customary attempt to demonstrate that he is a Smart Boy:</p><blockquote><p>I was really interested in this topic and the first 10 minutes of the stream – preparing for our reaction to stress is extremely important. However, you spent the rest of the stream dealing with one comment from the chat and about that person’s banning. You didn’t end up getting into the topic. I was/am genuinely interested in your thoughts on the matter.</p><p>Messaging/The Chat is a terrible form of communication – you can’t tell the person’s tone of voice and there is a massive space for misinterpretation. I do agree that banning is not a sign of weakness nor strength. I do agree that you do need to be banning people. However, I completely disagree that you know that your level of banning is “absolutely worth the risk”. You do not know that for certain. People can have an off day, be in a bad mood, forget for a moment the context of the chat, write something in a way that doesn’t exactly reflect their thoughts, they could be responding to another comment in the chat and not you, and sometimes they might have a point that is true but you just don’t want to hear it. Conversely, you could be having an off day, an off week, misinterpret a comment, or who knows whatever else.</p><p>More importantly, if there were 10 other Vox Day’s out there in the world (yes there are other very intelligent people in the world) and they found themselves in your chat I would be willing to bet that you would have likely banned some or all of them over time. If that’s true then how would that benefit your community? My hypothesis is – your bannings gets rid of a portion of the very top and very bottom IQ/Value members of the chat/community. Yes you get rid of the bottom feeders but Im quite confident that you are also getting rid of a good portion of your highest value members. Now, before you call me a gamma I want you to know that the reason I am saying this is not because I’ve been banned, or Im worried about being banned, or that Im trying to take a shot at you. The reason I say it is because I genuinely want you to do well and thrive, just as I want Owen to do well and thrive.</p><p>Conversely, what would the other 10 Vox Day’s think (assuming you hadn’t banned them) if they are taking a piece of their evening to listen to your channel only to hear you say to them “you are not my equal, you are nobody, you are totally irrelevant, there are tens of thousands of you, there is one of me, Im the only one who truly matters here”. How many times would you listen to someone saying that to you?</p><p>I get that you are speaking to a broad audience that you can’t see and hardly know so that must be very difficult to navigate. I also get that it is very easy for me to come in and run my mouth at you. I am certain that I couldn’t do anywhere near as good a job as you and Owen do and I appreciate what both of you are doing. My suggestion is to re-listen to this episode and imagine the high IQ/ high value viewers point of view – one who is busy doing their own projects and want to stop in and hear your thoughts about preparing for our reactions to stress – hoping to learn something or hear another point of view from someone they respect.</p></blockquote><p>My response: <i>The other 10 Vox Days would never pay any attention to these videos. I don’t watch videos. Your entire argument is based on a false foundation. </i></p><p>As you would expect, this highly informed and relevant observation immediately caused him to understand and admit that he was wrong. I jest, of course. It did nothing of the sort.</p><blockquote><p>When I made my comment I thought you might use this out but I assumed you wouldn’t take that backdoor exit. I meant someone of similar intellect level. You can’t possibly be implying that not a single person in your community is at your level. If you don’t want high level people in your community then yes I take it back, you might be banning appropriately. Also, that was only one part of my argument – take away 10 Vox Days and my point still stands.</p><p>Also, of the 10 other manifestations of Vox Day Im sure some of them would watch videos.</p></blockquote><p>My second response: <i>First, you’re absolutely wrong. Zero manifestations of Vox Day would watch videos. Second, from the statistical perspective, given that there are less than one thousand people watching live, precisely none of them are at my IQ level. </i><br><i><br/></i>I invite you to join me in anticipating the next Wall of Text which will call into question everything from my integrity to statistics to the legitimacy of the Stanford-Binet test.</br></p><p><b>UPDATE: </b>The anticipated Wall of Text:</p><blockquote><p>First, you definitely watch videos sometimes and so would many if not all manifestations of you – everyone knows this is a silly claim. In order to have any sense of the social/political climate you need to be watching some videos sometimes – there is no way around that. Second, you said we were one of tens of thousands in the stream, what happened to that figure? Third, based statistics claiming there are “precisely zero” people at your level is dead wrong. Maybe there are very few at your level, maybe it’s unlikely there are any – but “precisely zero” is statistically repugnant – unless you believe you are literally the smartest person alive – in which case we need to have another conversation.</p><p>You should not be talking down to your audience. This is a major mistake. For example: the reason Norm MacDonald is so beloved and respected is because not only is he brilliant but he never assumes his audience is dumber than he is. He has said this in several interviews. Even though he is very often the smartest person in the room he never talks to his audience as though he is smarter than they are. There isn’t a comic on the planet who doesn’t universally respect Norm’s talent. Yes he is brilliant but there are other brilliant comics. Norm is the top dog because he is the one who never ever talks down to his audience – and because of this every other brilliant person out there listening to Norm is attracted to this trait. The top end minds do not like being talked down to – for obvious reasons but also because they also have bigger egos just the same.</p><p>The Vox Day algorithm has a flaw and it is repelling high IQ individuals. Deal with this or lose high IQ members of your community. Hate me, insult me, ignore me, this is constructive criticism and nothing else. As A Christian I want to see good Christian leaders thrive, grow, and have their communities increase in quantity AND quality.</p><p>If there really are no people at the same IQ level (or close) as yourself among the tens of thousands, perhaps it’s because you have driven them away.</p></blockquote><p>Followed in rapid succession by a second after I utilized this exhibit as an example of typical gamma behavior in last night’s Darkstream.</p><blockquote><p>If I respond in detail then Im a doing a wall of text. Dig my heels in and Im an SJW doubling down. And it seems like no matter what I say Im a low IQ gamma. Here goes. I never said I am right and you are wrong. I might be completely wrong here. I was simply stating my case and in doing so pointed out one detail that I knew you were wrong about – the math. You are definitely wrong about the math. It’s you who didn’t do your homework. You don’t understand random distributions. Just because 1 in 850 is at your IQ level, and you are there, that doesn’t necessarily mean that nobody in the chat is higher than you. It means that there is an average of 1 in 850 each time. Some times 0 , some times 1, some times 2, some times even 3. If you had any mathematical inclination you would never use the term “precisely zero” when describing the number of people in the chat at your IQ level. Precisely zero means precisely zero. The number of people in the chat and in the community on a given day is NOT precisely zero. Do YOUR homework. I was making a YT comment and I made sure to get it right. You did a public stream (which to me is a wall of text to the N) about my comment and you didn’t bother to do the work. Also, as you conveniently avoided mentioning, I was doing these numbers based on your claim that the community was “tens of thousand” large – meaning your community likely has many people with a higher IQ than you – some of which show up to the chat randomly (assuming you haven’t banned them already of course).</p><p>More importantly, the IQ thing isn’t even the main point I was making. I was saying that being super trigger happy with bannings was possibly cutting out both the gammas and potentially some of the top IQ folk. It’s just a theory I had. I wasn’t telling you not to ban gammas.</p><p>You have now wasted 2 streams reacting to comments from people you believe are gammas while simultaneously claiming that you aren’t bothered by the comments. If you weren’t bothered by my comments then why do a stream about them the very next day? You say you caught me in a trap? You’ve been trapped by what you believe are gammas 2 days in a row!</p><p>If you want me to be a low IQ wall of text gamma and explain in further detail why I am right about the math in an email I’d be happy to do so.</p><p>Standing up for yourself isn’t gamma. Pushing back isn’t low IQ.</p><p>Holy crap dude. I’m on your side. I like you. I genuinely respect you and Owen greatly. My intention wasn’t to get into an argument. Like, can nobody ever push back about anything without being attacked and called a low IQ gamma? “Gamma” is turning into the new “Anti-semitism” – you can’t just use it every time someone calls you out or makes a point you don’t like.</p></blockquote><p>This is why there is no need to pay any attention to anything Gammas say, much less respond to it. Just let them do their thing once they’ve been triggered. There is no more effective way to demonstrate how hopelessly wrong they are than their own desperate flopping around as they repeatedly double down on their initial errors.</p></div>",
  "content_text": "As bad as the comments here can be, they can never hope to devolve to the level of gamma lunacy one encounters on YouTube. One DM offers us\nthe usual Gamma Wall of Text\nin the customary attempt to demonstrate that he is a Smart Boy:\nI was really interested in this topic and the first 10 minutes of the stream – preparing for our reaction to stress is extremely important. However, you spent the rest of the stream dealing with one comment from the chat and about that person’s banning. You didn’t end up getting into the topic. I was/am genuinely interested in your thoughts on the matter.\nMessaging/The Chat is a terrible form of communication – you can’t tell the person’s tone of voice and there is a massive space for misinterpretation. I do agree that banning is not a sign of weakness nor strength. I do agree that you do need to be banning people. However, I completely disagree that you know that your level of banning is “absolutely worth the risk”. You do not know that for certain. People can have an off day, be in a bad mood, forget for a moment the context of the chat, write something in a way that doesn’t exactly reflect their thoughts, they could be responding to another comment in the chat and not you, and sometimes they might have a point that is true but you just don’t want to hear it. Conversely, you could be having an off day, an off week, misinterpret a comment, or who knows whatever else.\nMore importantly, if there were 10 other Vox Day’s out there in the world (yes there are other very intelligent people in the world) and they found themselves in your chat I would be willing to bet that you would have likely banned some or all of them over time. If that’s true then how would that benefit your community? My hypothesis is – your bannings gets rid of a portion of the very top and very bottom IQ/Value members of the chat/community. Yes you get rid of the bottom feeders but Im quite confident that you are also getting rid of a good portion of your highest value members. Now, before you call me a gamma I want you to know that the reason I am saying this is not because I’ve been banned, or Im worried about being banned, or that Im trying to take a shot at you. The reason I say it is because I genuinely want you to do well and thrive, just as I want Owen to do well and thrive.\nConversely, what would the other 10 Vox Day’s think (assuming you hadn’t banned them) if they are taking a piece of their evening to listen to your channel only to hear you say to them “you are not my equal, you are nobody, you are totally irrelevant, there are tens of thousands of you, there is one of me, Im the only one who truly matters here”. How many times would you listen to someone saying that to you?\nI get that you are speaking to a broad audience that you can’t see and hardly know so that must be very difficult to navigate. I also get that it is very easy for me to come in and run my mouth at you. I am certain that I couldn’t do anywhere near as good a job as you and Owen do and I appreciate what both of you are doing. My suggestion is to re-listen to this episode and imagine the high IQ/ high value viewers point of view – one who is busy doing their own projects and want to stop in and hear your thoughts about preparing for our reactions to stress – hoping to learn something or hear another point of view from someone they respect.\nMy response:\nThe other 10 Vox Days would never pay any attention to these videos. I don’t watch videos. Your entire argument is based on a false foundation.\nAs you would expect, this highly informed and relevant observation immediately caused him to understand and admit that he was wrong. I jest, of course. It did nothing of the sort.\nWhen I made my comment I thought you might use this out but I assumed you wouldn’t take that backdoor exit. I meant someone of similar intellect level. You can’t possibly be implying that not a single person in your community is at your level. If you don’t want high level people in your community then yes I take it back, you might be banning appropriately. Also, that was only one part of my argument – take away 10 Vox Days and my point still stands.\nAlso, of the 10 other manifestations of Vox Day Im sure some of them would watch videos.\nMy second response:\nFirst, you’re absolutely wrong. Zero manifestations of Vox Day would watch videos. Second, from the statistical perspective, given that there are less than one thousand people watching live, precisely none of them are at my IQ level.\nI invite you to join me in anticipating the next Wall of Text which will call into question everything from my integrity to statistics to the legitimacy of the Stanford-Binet test.\nUPDATE:\nThe anticipated Wall of Text:\nFirst, you definitely watch videos sometimes and so would many if not all manifestations of you – everyone knows this is a silly claim. In order to have any sense of the social/political climate you need to be watching some videos sometimes – there is no way around that. Second, you said we were one of tens of thousands in the stream, what happened to that figure? Third, based statistics claiming there are “precisely zero” people at your level is dead wrong. Maybe there are very few at your level, maybe it’s unlikely there are any – but “precisely zero” is statistically repugnant – unless you believe you are literally the smartest person alive – in which case we need to have another conversation.\nYou should not be talking down to your audience. This is a major mistake. For example: the reason Norm MacDonald is so beloved and respected is because not only is he brilliant but he never assumes his audience is dumber than he is. He has said this in several interviews. Even though he is very often the smartest person in the room he never talks to his audience as though he is smarter than they are. There isn’t a comic on the planet who doesn’t universally respect Norm’s talent. Yes he is brilliant but there are other brilliant comics. Norm is the top dog because he is the one who never ever talks down to his audience – and because of this every other brilliant person out there listening to Norm is attracted to this trait. The top end minds do not like being talked down to – for obvious reasons but also because they also have bigger egos just the same.\nThe Vox Day algorithm has a flaw and it is repelling high IQ individuals. Deal with this or lose high IQ members of your community. Hate me, insult me, ignore me, this is constructive criticism and nothing else. As A Christian I want to see good Christian leaders thrive, grow, and have their communities increase in quantity AND quality.\nIf there really are no people at the same IQ level (or close) as yourself among the tens of thousands, perhaps it’s because you have driven them away.\nFollowed in rapid succession by a second after I utilized this exhibit as an example of typical gamma behavior in last night’s Darkstream.\nIf I respond in detail then Im a doing a wall of text. Dig my heels in and Im an SJW doubling down. And it seems like no matter what I say Im a low IQ gamma. Here goes. I never said I am right and you are wrong. I might be completely wrong here. I was simply stating my case and in doing so pointed out one detail that I knew you were wrong about – the math. You are definitely wrong about the math. It’s you who didn’t do your homework. You don’t understand random distributions. Just because 1 in 850 is at your IQ level, and you are there, that doesn’t necessarily mean that nobody in the chat is higher than you. It means that there is an average of 1 in 850 each time. Some times 0 , some times 1, some times 2, some times even 3. If you had any mathematical inclination you would never use the term “precisely zero” when describing the number of people in the chat at your IQ level. Precisely zero means precisely zero. The number of people in the chat and in the community on a given day is NOT precisely zero. Do YOUR homework. I was making a YT comment and I made sure to get it right. You did a public stream (which to me is a wall of text to the N) about my comment and you didn’t bother to do the work. Also, as you conveniently avoided mentioning, I was doing these numbers based on your claim that the community was “tens of thousand” large – meaning your community likely has many people with a higher IQ than you – some of which show up to the chat randomly (assuming you haven’t banned them already of course).\nMore importantly, the IQ thing isn’t even the main point I was making. I was saying that being super trigger happy with bannings was possibly cutting out both the gammas and potentially some of the top IQ folk. It’s just a theory I had. I wasn’t telling you not to ban gammas.\nYou have now wasted 2 streams reacting to comments from people you believe are gammas while simultaneously claiming that you aren’t bothered by the comments. If you weren’t bothered by my comments then why do a stream about them the very next day? You say you caught me in a trap? You’ve been trapped by what you believe are gammas 2 days in a row!\nIf you want me to be a low IQ wall of text gamma and explain in further detail why I am right about the math in an email I’d be happy to do so.\nStanding up for yourself isn’t gamma. Pushing back isn’t low IQ.\nHoly crap dude. I’m on your side. I like you. I genuinely respect you and Owen greatly. My intention wasn’t to get into an argument. Like, can nobody ever push back about anything without being attacked and called a low IQ gamma? “Gamma” is turning into the new “Anti-semitism” – you can’t just use it every time someone calls you out or makes a point you don’t like.\nThis is why there is no need to pay any attention to anything Gammas say, much less respond to it. Just let them do their thing once they’ve been triggered. There is no more effective way to demonstrate how hopelessly wrong they are than their own desperate flopping around as they repeatedly double down on their initial errors.",
  "tags": [
    "Gamma"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-30T11:02:27+00:00"
}