{
  "url": "https://voxday.net/2019/11/26/the-last-interview/",
  "scraped_at": "2025-12-21T03:07:02.382923",
  "title": "The last interview",
  "date_display": "November 26, 2019",
  "date_iso": "2019-11-26T14:32:10+00:00",
  "date_from_url": "2019-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I initially declined the interview request, but since I read <i>the Unz Review</i> myself and the interviewer only had a few substantive questions tangential to <a href=\"http://www.unz.com/article/tired-of-hollywoods-woke-and-failing-actioners-try-vox-days-new-comic-book-series/\">his very positive review of Alt-Hero</a>, I took a few minutes to email him back. It’s not his fault, but in retrospect, I should have stuck with my instinctive reaction and declined to answer them, as a commenter here noted.</p><blockquote class=\"tr_bq\"><p>The comments on the UNZ article are a testament to moderating comments as they do here. It’s like a gamma bomb went off under the article.</p></blockquote><p>Precisely. The way the anklebiters who stalk this place and the Darkstream in vain will immediately rush to any media mention of any kind is yet another good reason not to talk to anyone, media or not. Even when the interview is friendly, positive, and substantive, there’s always at least some degree of nonsense and negativity that results from it.</p><p>This little gamma bomb is orders of magnitude smaller than the fallout from my previous interview with <i>Bleeding Cool</i>, but nevertheless underlines the point that there is zero net benefit to me from bothering to talk to anyone who isn’t on Unauthorized. So, <a href=\"http://www.unz.com/article/tired-of-hollywoods-woke-and-failing-actioners-try-vox-days-new-comic-book-series/\">this little Kersey interview</a> will likely be the last one I give to anyone for the time being. I have my own channels of communication; I have no need for anyone else’s. Anyone who wants to know what I think has dozens of books, hundreds of columns, hundreds of videos, and thousands of blog posts available to them that are more than capable of satisfying their curiosity.</p><p>And for those who believe my decision has anything to do with being thin-skinned or unable to take criticism, all I can say is you’re far too short for this ride. What I’ve learned over the years is that all answering questions does is to raise more questions, and that talking to anyone in any form of media, no matter how friendly, places you into an endless cycle of feeding various false narratives even as you attempt to counteract them. There is simply no reason to devote even a modicum of time to activities that are neither productive nor enjoyable.</p><p>So, the answer to “will you talk to X?” is an unambiguous NO. It doesn’t matter who it is, whether I like them or not, that you sincerely believe our views are harmonious, or what the purported subject is. While I may interview the occasional author on the Darkstream, I do not plan to publicly speak to anyone who is not on Unauthorized.</p></div>",
  "content_text": "I initially declined the interview request, but since I read\nthe Unz Review\nmyself and the interviewer only had a few substantive questions tangential to\nhis very positive review of Alt-Hero\n, I took a few minutes to email him back. It’s not his fault, but in retrospect, I should have stuck with my instinctive reaction and declined to answer them, as a commenter here noted.\nThe comments on the UNZ article are a testament to moderating comments as they do here. It’s like a gamma bomb went off under the article.\nPrecisely. The way the anklebiters who stalk this place and the Darkstream in vain will immediately rush to any media mention of any kind is yet another good reason not to talk to anyone, media or not. Even when the interview is friendly, positive, and substantive, there’s always at least some degree of nonsense and negativity that results from it.\nThis little gamma bomb is orders of magnitude smaller than the fallout from my previous interview with\nBleeding Cool\n, but nevertheless underlines the point that there is zero net benefit to me from bothering to talk to anyone who isn’t on Unauthorized. So,\nthis little Kersey interview\nwill likely be the last one I give to anyone for the time being. I have my own channels of communication; I have no need for anyone else’s. Anyone who wants to know what I think has dozens of books, hundreds of columns, hundreds of videos, and thousands of blog posts available to them that are more than capable of satisfying their curiosity.\nAnd for those who believe my decision has anything to do with being thin-skinned or unable to take criticism, all I can say is you’re far too short for this ride. What I’ve learned over the years is that all answering questions does is to raise more questions, and that talking to anyone in any form of media, no matter how friendly, places you into an endless cycle of feeding various false narratives even as you attempt to counteract them. There is simply no reason to devote even a modicum of time to activities that are neither productive nor enjoyable.\nSo, the answer to “will you talk to X?” is an unambiguous NO. It doesn’t matter who it is, whether I like them or not, that you sincerely believe our views are harmonious, or what the purported subject is. While I may interview the occasional author on the Darkstream, I do not plan to publicly speak to anyone who is not on Unauthorized.",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-26T14:32:10+00:00"
}