{
  "url": "https://voxday.net/2019/11/18/the-princes-pizza-party/",
  "scraped_at": "2025-12-21T03:05:57.200076",
  "title": "The prince’s pizza party",
  "date_display": "November 18, 2019",
  "date_iso": "2019-11-18T13:18:23+00:00",
  "date_from_url": "2019-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Prince Andrew’s televised interview has been widely seen as an unmitigated disaster, but the prince nevertheless considered it <a href=\"https://www.dailymail.co.uk/news/article-7696301/It-great-success-Prince-Andrew-told-Queen-church-shock-TV-interview.html\">to have been a complete succes</a>s:</p><blockquote class=\"tr_bq\"><p>The Duke of York attempted to ‘set the record straight’ by speaking about the sex allegations against him during a sit-down with Maitlis at Buckingham Palace. He completely refuted any wrongdoing in the interview but he was widely condemned for showing a lack of remorse over his friendship with Epstein. Despite many calling his performance a ‘PR disaster’, the prince is thought to have spoken to the Queen at a church service on Sunday, describing the interview as a ‘great success’.</p></blockquote><p>How to rectify the two positions? I suspect both perspectives are correct. While it was obviously a PR disaster, Prince Andrew doesn’t give a damn about what the public thinks. It appears that what the prince was doing was akin to Kevin Spacey’s <a href=\"https://www.theguardian.com/commentisfree/2018/dec/28/kevin-spaceys-video-distraction-allegations-house-of-cards\">weird, but successful warning</a> that if he was abandoned to be held accountable for his crimes, he would spill everything about everyone else.</p><p>I very much doubt it is a strange coincidence that Prince Andrew said he was at a children’s pizza party rather than at a club he was known to frequent. My interpretation of this weirdly specific detail is that he was warning his fellow evildoers that if they don’t get him out of his present predicament, he’ll tell the legal authorities in the UK and in the USA everything about their crimes against children.</p></div>",
  "content_text": "Prince Andrew’s televised interview has been widely seen as an unmitigated disaster, but the prince nevertheless considered it\nto have been a complete succes\ns:\nThe Duke of York attempted to ‘set the record straight’ by speaking about the sex allegations against him during a sit-down with Maitlis at Buckingham Palace. He completely refuted any wrongdoing in the interview but he was widely condemned for showing a lack of remorse over his friendship with Epstein. Despite many calling his performance a ‘PR disaster’, the prince is thought to have spoken to the Queen at a church service on Sunday, describing the interview as a ‘great success’.\nHow to rectify the two positions? I suspect both perspectives are correct. While it was obviously a PR disaster, Prince Andrew doesn’t give a damn about what the public thinks. It appears that what the prince was doing was akin to Kevin Spacey’s\nweird, but successful warning\nthat if he was abandoned to be held accountable for his crimes, he would spill everything about everyone else.\nI very much doubt it is a strange coincidence that Prince Andrew said he was at a children’s pizza party rather than at a club he was known to frequent. My interpretation of this weirdly specific detail is that he was warning his fellow evildoers that if they don’t get him out of his present predicament, he’ll tell the legal authorities in the UK and in the USA everything about their crimes against children.",
  "tags": [
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-18T13:18:23+00:00"
}