{
  "url": "https://voxday.net/2019/11/21/why-we-do-what-we-do/",
  "scraped_at": "2025-12-21T03:06:20.633462",
  "title": "Why we do what we do",
  "date_display": "November 21, 2019",
  "date_iso": "2019-11-21T17:03:51+00:00",
  "date_from_url": "2019-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A supporter of the Junior Classics 2020 edition observes 60’s-era convergence:</p><blockquote class=\"tr_bq\"><p>My father in law recently gave us a 1962 edition of the Junior Classics that was sitting around his house. All female editors with a corresponding convergence in the stories included therein. Still some good stuff by today’s standards, but the rot was well established by then.</p></blockquote><p>I’ve never seen that edition, having grown up on the 1958 edition, but I’m not even remotely surprised. Preserving knowledge, teaching children, and taking back cultural ground. The objective is right there in the name.</p><p>Speaking of the intellectual offensive, if you emailed about your interest in <a href=\"https://arkhavencomics.com/product/castalia-deluxe-subscription/\">the Castalia Deluxe subscription</a> but haven’t signed up yet, this is the time to do so. I don’t know if we’re going to close subscription sign-ups for the even months or add a sign-up fee during those months, but regardless, we want to pass 50 percent before we place the initial order with the bindery. Right now, we’re at 32 percent, which isn’t at all bad for the first 18 hours, but we can certainly do better.</p></div>",
  "content_text": "A supporter of the Junior Classics 2020 edition observes 60’s-era convergence:\nMy father in law recently gave us a 1962 edition of the Junior Classics that was sitting around his house. All female editors with a corresponding convergence in the stories included therein. Still some good stuff by today’s standards, but the rot was well established by then.\nI’ve never seen that edition, having grown up on the 1958 edition, but I’m not even remotely surprised. Preserving knowledge, teaching children, and taking back cultural ground. The objective is right there in the name.\nSpeaking of the intellectual offensive, if you emailed about your interest in\nthe Castalia Deluxe subscription\nbut haven’t signed up yet, this is the time to do so. I don’t know if we’re going to close subscription sign-ups for the even months or add a sign-up fee during those months, but regardless, we want to pass 50 percent before we place the initial order with the bindery. Right now, we’re at 32 percent, which isn’t at all bad for the first 18 hours, but we can certainly do better.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-21T17:03:51+00:00"
}