{
  "url": "https://voxday.net/2019/11/25/wranglerstar-on-unauthorized/",
  "scraped_at": "2025-12-21T03:06:51.379192",
  "title": "Wranglerstar on Unauthorized",
  "date_display": "November 25, 2019",
  "date_iso": "2019-11-25T11:19:25+00:00",
  "date_from_url": "2019-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wranglerstar, the well-known homesteader, is the latest addition to Unauthorized.TV! Nine of his latest videos <a href=\"https://www.unauthorized.tv/categories/wranglerstar\">are now available</a> on the channel, with two more already on the way.</p><ul><li>Crushing</li><li>Eureka! I found gold on the homestead!</li><li>Canning with Mrs. Wranglerstar</li><li>Emergency equipment for your home</li><li>A better way to restore leather</li><li>Is the MK-18 the perfect home defense AR?</li><li>Simple battery hack could save your life</li><li>Chainsaw chaps may have a fatal flaw</li><li>They took away my chainsaw</li></ul><p>If you’re a fan of Wranglerstar and would like to support him, you can subscribe to <a href=\"https://www.unauthorized.tv/join\">his monthly Unauthorized subscription</a>. Definitely check out the battery hack; it is rather ingenious and could prove very useful for anyone who ever needs to start a fire.</p><p>In other UATV news, the problem with the Home page was the result of my deleting some superfluous categories that were linked to the page. That has been corrected; <i>Garden</i> now connects to David the Good’s video catalog while <i>Survive</i> connects to Wranglerstar’s new catalog. We’re told the Roku and Android apps should be approved any day now; once that happens we will let you know.</p></div>",
  "content_text": "Wranglerstar, the well-known homesteader, is the latest addition to Unauthorized.TV! Nine of his latest videos\nare now available\non the channel, with two more already on the way.\nCrushing\nEureka! I found gold on the homestead!\nCanning with Mrs. Wranglerstar\nEmergency equipment for your home\nA better way to restore leather\nIs the MK-18 the perfect home defense AR?\nSimple battery hack could save your life\nChainsaw chaps may have a fatal flaw\nThey took away my chainsaw\nIf you’re a fan of Wranglerstar and would like to support him, you can subscribe to\nhis monthly Unauthorized subscription\n. Definitely check out the battery hack; it is rather ingenious and could prove very useful for anyone who ever needs to start a fire.\nIn other UATV news, the problem with the Home page was the result of my deleting some superfluous categories that were linked to the page. That has been corrected;\nGarden\nnow connects to David the Good’s video catalog while\nSurvive\nconnects to Wranglerstar’s new catalog. We’re told the Roku and Android apps should be approved any day now; once that happens we will let you know.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-25T11:19:25+00:00"
}