{
  "url": "https://voxday.net/2019/11/30/youtube-to-ban-big-bear/",
  "scraped_at": "2025-12-21T03:07:27.819199",
  "title": "YouTube to ban Big Bear?",
  "date_display": "November 30, 2019",
  "date_iso": "2019-11-30T23:17:16+00:00",
  "date_from_url": "2019-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will be interesting to see <a href=\"https://youtu.be/0O55TKoLpbo?t=244\">if YouTube follows through</a> on what are rumored to be plans to ban everyone associated with Proud Boys and Infowars:</p><blockquote class=\"tr_bq\"><p>I have an insider at YouTube and he’s telling me all the scoop on the imminent conservative purge. Stephen Crowder’s on the list, Paul Joseph Watson’s on the list, Owen Benjamin is on the list, anyone remotely associated with Proud Boys or Infowars is on the list.</p></blockquote><p>Apparently this is supposed to happen on December 10th. We’ll see. If it’s true, then we can safely conclude that no one at YouTube has read <i>Corporate Cancer</i> yet. I’m skeptical myself, because that’s the date the new terms of use come into effect and there is no particular reason YouTube needs them in order to deplatform anyone.</p><p>But regardless, this would be a good time <a href=\"https://www.unauthorized.tv/join\">to subscribe to Unauthorized</a>.</p></div>",
  "content_text": "It will be interesting to see\nif YouTube follows through\non what are rumored to be plans to ban everyone associated with Proud Boys and Infowars:\nI have an insider at YouTube and he’s telling me all the scoop on the imminent conservative purge. Stephen Crowder’s on the list, Paul Joseph Watson’s on the list, Owen Benjamin is on the list, anyone remotely associated with Proud Boys or Infowars is on the list.\nApparently this is supposed to happen on December 10th. We’ll see. If it’s true, then we can safely conclude that no one at YouTube has read\nCorporate Cancer\nyet. I’m skeptical myself, because that’s the date the new terms of use come into effect and there is no particular reason YouTube needs them in order to deplatform anyone.\nBut regardless, this would be a good time\nto subscribe to Unauthorized\n.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-11-30T23:17:16+00:00"
}