{
  "url": "https://voxday.net/2011/01/11/answering-atheists-question/",
  "scraped_at": "2025-12-13T22:59:29.179047",
  "title": "Answering an atheist’s question",
  "date_display": "January 11, 2011",
  "date_iso": "2011-01-11T12:32:00+00:00",
  "date_from_url": "2011-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An atheist <a href=\"http://www.alternet.org/belief/149419/why_are_believers_so_hostile_toward_atheists/?page=1\">asks why believers are hostile toward atheists, </a>then answers her own question in a manner she probably didn’t intend:</p><blockquote><p>Why are believers so hostile toward atheists?  Is there anything atheists can say about our atheism — or even just about our lives — that won’t make people look at us with revulsion?</p></blockquote><p>The short answer is no, not really, because the self-styled atheist is usually an intrinsically repellent individual for the very reasons that caused him to primarily identify himself on the peculiar basis of one very specific non-belief.  The reason that believers, agnostics, and even other atheists all dislike atheists <i>who identify themselves as atheists</i> is because they don’t like annoying, dishonest, and literally self-righteous people with social handicaps who reject every objective moral or ethical code.  You don’t have to be an asshole to call yourself an atheist, but it quite clearly helps.  After all, as the 2008 ARIS study showed, the even vast majority of <i>atheists</i> are not willing to call themselves atheists!</p><p>While atheism is defined as a belief that gods do not exist,(or sometimes an absence of belief in gods, although in practice it is really just a subset of a materialist philosophy), identifying oneself an atheist is a conscious choice to announce to the world that one’s disbelief in gods is a defining and important aspect of one’s life.  I don’t believe in fairies, but I never describe myself as an afairiest because that does not define me in any way, shape or form.  When asked about his religion, an atheist could just as easily say that he does not have a religion instead of making a contentious assertion that God does not exist – in fact, most de facto atheists do precisely that – but the self-proclaimed atheist prefers the latter.  And therein lies the heart of the answer.</p><p>Only an atheist could possibly find it a mystery why believers might be just a little bit hostile towards atheists like Uber Dawks, who sent this email yesterday: <i>Color me not at all shocked that your kind hastily pointed out Jared Lee Loughner’s highly debatable atheism. This only serves as further evidence that the religious right is completely intolerant of those who hold to an atheistic view. Like McVeigh or Seung-Hui Cho or James Jay Lee before him, Loughner’s atheism has absolutely nothing to do with his actions <b>[Or Stalin’s, or Mao’s, or Pol Pot’s… they keep saying that and their co-non-religionists just keep inexplicably killing more people.  It’s a mystery – VD]</b> and to make any claim to the contrary is tantamount to bigotry-fueled profiling.  It is more than obvious that the man was mentally unhinged and given his reading material was reacting irrationally and violently to the barrage of capitalist and biblical rhetoric coming from the right-wing. If you “money, guns n’ bibles” types would stop forcing your silly notions upon the rest of us, we might be able to prevent misguided and mentally ill young men like this one from taking this kind of action.</i></p><p>Unless religion is finally replaced with science and reason, this illness and the violent reaction to it will keep on perpetuating. That is what religious belief is, an illness. Whenever a Christian asks why religious scientists are not hired for certain positions in academia or do not get their contracts renewed, the answer is simple. It is because their religious affliction affects their ability to do their work, just as the affliction of an alcoholic or serious drug addict leads to a similar inability. Like the illness of alcoholism and drug addiction, we need to treat these harmful behaviors for the good of both the individual and the society.</p><p>There is an impressive abuse of logic in that little atheist rant.  Unlike the small-a de facto atheist who merely doesn’t happen to believe that gods exist, the self-styled atheist is much more accurately described as an anti-religionist in general and anti-Christian in particular.  And again, only a socially autistic Capital-A atheist would find it hard to understand why religious people might be hostile towards anti-religious people who actively want to eliminate their holidays, their jobs, and in some cases, even their lives.</p><p>Moreover, no one likes a liar and most atheists lie about the source of their atheism.  Greta Christina herself is clearly not telling the truth when she writes: <i>When atheists make it clear that we gave religion a sincere try, that we considered the question seriously and thoughtfully and finally came to the conclusion that the god hypothesis was implausible and unsupported by any good evidence… religious believers then have to come up with an explanation for why God hasn’t revealed himself to us.</i></p><p>We can easily confirm this to be untrue on several levels.  First, while most atheists claim that they gave religion a sincere try, it is patently obvious when they haven’t because one can reliably expose an atheist’s ignorance of even the most basic Christian doctrine, let alone more obscure religious doctrines, with only two or three simple questions.  Second, the age at which most people become atheists indicates that it is almost never an intellectual decision, but an emotional one.  (This is why most self-identified atheists are angry, bitter, and immature.  The anger, bitterness, and immaturity are usually the <i>cause</i> of the atheism, they are not, as many Christians erroneously suppose, the effects.)  Third, Greta reveals her own ignorance of the Bible and Christian doctrine and her own dishonesty as well when she claims that “religious believers then have to come up with an explanation for why God hasn’t revealed himself to us”.  No, as a matter of fact, we don’t.  There are a number of explanations provided in various religious scriptures, including both the Old and New Testaments, among others.</p><p><i>He does not answer when people cry out because of the arrogance of the wicked. Indeed, God does not listen to their empty plea; the Almighty pays no attention to it. How much less, then, will he listen when you say that you do not see him….</i><br> – Job 35:12-14</br></p><p><i>“The true light that gives light to everyone was coming into the world. He was in the world, and though the world was made through him, the world did not recognize him. He came to that which was his own, but his own did not receive him. Yet to all who did receive him, to those who believed in his name, he gave the right to become children of God.”</i><br> – John 1:9-12</br></p><p>Or, to put it in omniderigent terms, atheists are among the vessels made to be broken.</p><p>The combination of ignorance, epistemic incoherence, and ill-founded arrogance that is necessary to label oneself an atheist is as distasteful to the average individual as it is contemptible to the intellectual.  When one combines those qualities with the social autism and hate-filled evangelicalism that is all too commonly displayed by atheists, it is a wonder that they are tolerated as much as they are.  All evangelicalism is not the same.  If someone is attempting to save you from fiery destruction, their intentions toward you are clearly good.  If, on the other hand, someone is attempting to kick the crutch upon which you are leaning out from under you, their intentions are clearly evil.</p><p>Few, if any, believers are hostile to people who simply don’t believe in God on the mere basis of their not sharing the believer’s beliefs.  Pity is the much more common attitude.  But hostility towards anti-religious, untrustworthy individuals with evil intentions is not only explicable, it is entirely justified.  And if Greta genuinely wants believers to look at her with less revulsion, perhaps she should simply concern herself with living her life according to her own beliefs rather than spending it attempting to interfere with the lives and beliefs of others.</p><p>On a final note, let me explain one aspect of this very slowly for the less socially adept atheists.  Let us suppose, for the sake of argument, that you are correct and that there is no God.  We shall suppose that you are right and I am wrong.  Let us also suppose, again for the sake of argument, that I am more beautiful than you are.  Now, neither your being more right than I am nor my being more beautiful than you are has to have any affect on how we regard the other living his life.  But how would you look at me if I went so far as to define and label who I am as being “not ugly like you”?  What would you say if I asked you if there was anything I could say about your relative lack of beauty when compared to me that would not make you look at me with revulsion?  And why do you think you can do that sort of thing to believers without suffering the obvious social consequences?</p></div>",
  "content_text": "An atheist\nasks why believers are hostile toward atheists,\nthen answers her own question in a manner she probably didn’t intend:\nWhy are believers so hostile toward atheists?  Is there anything atheists can say about our atheism — or even just about our lives — that won’t make people look at us with revulsion?\nThe short answer is no, not really, because the self-styled atheist is usually an intrinsically repellent individual for the very reasons that caused him to primarily identify himself on the peculiar basis of one very specific non-belief.  The reason that believers, agnostics, and even other atheists all dislike atheists\nwho identify themselves as atheists\nis because they don’t like annoying, dishonest, and literally self-righteous people with social handicaps who reject every objective moral or ethical code.  You don’t have to be an asshole to call yourself an atheist, but it quite clearly helps.  After all, as the 2008 ARIS study showed, the even vast majority of\natheists\nare not willing to call themselves atheists!\nWhile atheism is defined as a belief that gods do not exist,(or sometimes an absence of belief in gods, although in practice it is really just a subset of a materialist philosophy), identifying oneself an atheist is a conscious choice to announce to the world that one’s disbelief in gods is a defining and important aspect of one’s life.  I don’t believe in fairies, but I never describe myself as an afairiest because that does not define me in any way, shape or form.  When asked about his religion, an atheist could just as easily say that he does not have a religion instead of making a contentious assertion that God does not exist – in fact, most de facto atheists do precisely that – but the self-proclaimed atheist prefers the latter.  And therein lies the heart of the answer.\nOnly an atheist could possibly find it a mystery why believers might be just a little bit hostile towards atheists like Uber Dawks, who sent this email yesterday:\nColor me not at all shocked that your kind hastily pointed out Jared Lee Loughner’s highly debatable atheism. This only serves as further evidence that the religious right is completely intolerant of those who hold to an atheistic view. Like McVeigh or Seung-Hui Cho or James Jay Lee before him, Loughner’s atheism has absolutely nothing to do with his actions\n[Or Stalin’s, or Mao’s, or Pol Pot’s… they keep saying that and their co-non-religionists just keep inexplicably killing more people.  It’s a mystery – VD]\nand to make any claim to the contrary is tantamount to bigotry-fueled profiling.  It is more than obvious that the man was mentally unhinged and given his reading material was reacting irrationally and violently to the barrage of capitalist and biblical rhetoric coming from the right-wing. If you “money, guns n’ bibles” types would stop forcing your silly notions upon the rest of us, we might be able to prevent misguided and mentally ill young men like this one from taking this kind of action.\nUnless religion is finally replaced with science and reason, this illness and the violent reaction to it will keep on perpetuating. That is what religious belief is, an illness. Whenever a Christian asks why religious scientists are not hired for certain positions in academia or do not get their contracts renewed, the answer is simple. It is because their religious affliction affects their ability to do their work, just as the affliction of an alcoholic or serious drug addict leads to a similar inability. Like the illness of alcoholism and drug addiction, we need to treat these harmful behaviors for the good of both the individual and the society.\nThere is an impressive abuse of logic in that little atheist rant.  Unlike the small-a de facto atheist who merely doesn’t happen to believe that gods exist, the self-styled atheist is much more accurately described as an anti-religionist in general and anti-Christian in particular.  And again, only a socially autistic Capital-A atheist would find it hard to understand why religious people might be hostile towards anti-religious people who actively want to eliminate their holidays, their jobs, and in some cases, even their lives.\nMoreover, no one likes a liar and most atheists lie about the source of their atheism.  Greta Christina herself is clearly not telling the truth when she writes:\nWhen atheists make it clear that we gave religion a sincere try, that we considered the question seriously and thoughtfully and finally came to the conclusion that the god hypothesis was implausible and unsupported by any good evidence… religious believers then have to come up with an explanation for why God hasn’t revealed himself to us.\nWe can easily confirm this to be untrue on several levels.  First, while most atheists claim that they gave religion a sincere try, it is patently obvious when they haven’t because one can reliably expose an atheist’s ignorance of even the most basic Christian doctrine, let alone more obscure religious doctrines, with only two or three simple questions.  Second, the age at which most people become atheists indicates that it is almost never an intellectual decision, but an emotional one.  (This is why most self-identified atheists are angry, bitter, and immature.  The anger, bitterness, and immaturity are usually the\ncause\nof the atheism, they are not, as many Christians erroneously suppose, the effects.)  Third, Greta reveals her own ignorance of the Bible and Christian doctrine and her own dishonesty as well when she claims that “religious believers then have to come up with an explanation for why God hasn’t revealed himself to us”.  No, as a matter of fact, we don’t.  There are a number of explanations provided in various religious scriptures, including both the Old and New Testaments, among others.\nHe does not answer when people cry out because of the arrogance of the wicked. Indeed, God does not listen to their empty plea; the Almighty pays no attention to it. How much less, then, will he listen when you say that you do not see him….\n– Job 35:12-14\n“The true light that gives light to everyone was coming into the world. He was in the world, and though the world was made through him, the world did not recognize him. He came to that which was his own, but his own did not receive him. Yet to all who did receive him, to those who believed in his name, he gave the right to become children of God.”\n– John 1:9-12\nOr, to put it in omniderigent terms, atheists are among the vessels made to be broken.\nThe combination of ignorance, epistemic incoherence, and ill-founded arrogance that is necessary to label oneself an atheist is as distasteful to the average individual as it is contemptible to the intellectual.  When one combines those qualities with the social autism and hate-filled evangelicalism that is all too commonly displayed by atheists, it is a wonder that they are tolerated as much as they are.  All evangelicalism is not the same.  If someone is attempting to save you from fiery destruction, their intentions toward you are clearly good.  If, on the other hand, someone is attempting to kick the crutch upon which you are leaning out from under you, their intentions are clearly evil.\nFew, if any, believers are hostile to people who simply don’t believe in God on the mere basis of their not sharing the believer’s beliefs.  Pity is the much more common attitude.  But hostility towards anti-religious, untrustworthy individuals with evil intentions is not only explicable, it is entirely justified.  And if Greta genuinely wants believers to look at her with less revulsion, perhaps she should simply concern herself with living her life according to her own beliefs rather than spending it attempting to interfere with the lives and beliefs of others.\nOn a final note, let me explain one aspect of this very slowly for the less socially adept atheists.  Let us suppose, for the sake of argument, that you are correct and that there is no God.  We shall suppose that you are right and I am wrong.  Let us also suppose, again for the sake of argument, that I am more beautiful than you are.  Now, neither your being more right than I am nor my being more beautiful than you are has to have any affect on how we regard the other living his life.  But how would you look at me if I went so far as to define and label who I am as being “not ugly like you”?  What would you say if I asked you if there was anything I could say about your relative lack of beauty when compared to me that would not make you look at me with revulsion?  And why do you think you can do that sort of thing to believers without suffering the obvious social consequences?",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-11T12:32:00+00:00"
}