{
  "url": "https://voxday.net/2011/01/11/ardent-atheis/",
  "scraped_at": "2025-12-13T22:59:32.472506",
  "title": "“An ardent atheist”",
  "date_display": "January 11, 2011",
  "date_iso": "2011-01-11T20:00:00+00:00",
  "date_from_url": "2011-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As some of the usual suspects have been attempting to pull out Sam Harris’s classic “No True Atheist” argument to which they retreat every time the atheism of a mass murderer or spree killer is mentioned, I thought it would be pertinent to quote <a href=\"http://www.sfgate.com/cgi-bin/article.cgi?f=/n/a/2011/01/09/national/a160942S37.DTL&amp;ao=2\">this Associated Press article</a> about Arizona shooter:</p><blockquote><p>Over time, Loughner became increasingly introspective — what one of the friends described as a “nihilistic rut.” <b>An ardent atheist</b>, he began to characterize people as sheep whose free will was being sapped by the government and the monotony of modern life.</p></blockquote><p>Thus perishes Uber Dawks’s claim that Loughner’s atheism was “highly debatable”.  I further note that the atheist killed  six times more people than did the secular Catholic authorities following the trials of Giordano Bruno and Galileo combined… more than 375 years ago.  Now, atheism doesn’t cause anyone to kill by itself.  The vast majority of atheists, like the vast majority of theists, will never intentionally do physical harm to anyone.  But there is no question that the rejection of objective divine morality that atheism necessarily entails removes considerable rational obstacles from murder and other moral offenses.  The danger created by this rejection is that it leaves the atheist answerable to nothing more than his subjective and dynamic morality, which despite the partial barriers of intellectual pretensions and moral parasitism, ultimately consists of emotion, desire, and passing fancies.</p></div>",
  "content_text": "As some of the usual suspects have been attempting to pull out Sam Harris’s classic “No True Atheist” argument to which they retreat every time the atheism of a mass murderer or spree killer is mentioned, I thought it would be pertinent to quote\nthis Associated Press article\nabout Arizona shooter:\nOver time, Loughner became increasingly introspective — what one of the friends described as a “nihilistic rut.”\nAn ardent atheist\n, he began to characterize people as sheep whose free will was being sapped by the government and the monotony of modern life.\nThus perishes Uber Dawks’s claim that Loughner’s atheism was “highly debatable”.  I further note that the atheist killed  six times more people than did the secular Catholic authorities following the trials of Giordano Bruno and Galileo combined… more than 375 years ago.  Now, atheism doesn’t cause anyone to kill by itself.  The vast majority of atheists, like the vast majority of theists, will never intentionally do physical harm to anyone.  But there is no question that the rejection of objective divine morality that atheism necessarily entails removes considerable rational obstacles from murder and other moral offenses.  The danger created by this rejection is that it leaves the atheist answerable to nothing more than his subjective and dynamic morality, which despite the partial barriers of intellectual pretensions and moral parasitism, ultimately consists of emotion, desire, and passing fancies.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-11T20:00:00+00:00"
}