{
  "url": "https://voxday.net/2011/01/08/beware-butterfly-collectors/",
  "scraped_at": "2025-12-13T22:59:14.390637",
  "title": "Those brilliant butterfly collectors",
  "date_display": "January 8, 2011",
  "date_iso": "2011-01-08T15:50:00+00:00",
  "date_from_url": "2011-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not only has it been confirmed by their university curriculums that scientists learn next to nothing outside their chosen disciplines, but it now appears that <a href=\"http://news.msu.edu/story/8738/\">biology students don’t even know much about their own scientific specialty</a> or understand how some of its basic functions operate:</p><blockquote><p>The researchers assessed the fundamental science knowledge of more than 500 students at 13 U.S. colleges in courses ranging from introductory biology to advanced ecology.  Most students did not truly understand the processes that transform carbon. They failed to apply principles such as the conservation of matter, which holds that when something changes chemically or physically, the amount of matter at the end of the process needs to equal the amount at the beginning. (Matter doesn’t magically appear or disappear.)</p><p>Students trying to explain weight loss, for example, could not trace matter once it leaves the body; instead they used informal reasoning based on their personal experiences (such as the fat “melted away” or was “burned off”). In reality, the atoms in fat molecules leave the body (mostly through breathing) and enter the atmosphere as carbon dioxide and water. Most students also incorrectly believe plants obtain their mass from the soil rather than primarily from carbon dioxide in the atmosphere. “When you see a tree growing,” Anderson said, “it’s a lot easier to believe that tree is somehow coming out of the soil rather than the scientific reality that it’s coming out of the air.”</p><p>The researchers say biology textbooks and high-school and college science instructors need to do a better job of teaching the fundamentals – particularly how matter transforms from gaseous to solid states and vice-versa.  It won’t be easy, Anderson said, because students’ beliefs of the carbon cycle are deeply engrained (such as the misconception that plants get most of their nutrients from the soil).</p></blockquote><p>Needless to say, these brilliant biologists-of-the-future are primarily concerned that little kids might not be indoctrinated with pseudo-scientific fairy tales about the origin of the species, despite the fact that they themselves quite clearly don’t even understand how the various species live and grow <i>today</i>.  Keep this in mind the next time a biologist is attempting to lecture you on history, politics, philosophy, religion, or pretty much anything more complicated than red + yellow = orange.  Not only are they largely uneducated outside a very narrow range of information, they’re not very intelligent either.</p><p>I’d love to see those same researchers assess the fundamental science knowledge of 500 biology professors at various colleges and universities across America.  If Mr. Myers is a reliable guide, they won’t fare much better.</p></div>",
  "content_text": "Not only has it been confirmed by their university curriculums that scientists learn next to nothing outside their chosen disciplines, but it now appears that\nbiology students don’t even know much about their own scientific specialty\nor understand how some of its basic functions operate:\nThe researchers assessed the fundamental science knowledge of more than 500 students at 13 U.S. colleges in courses ranging from introductory biology to advanced ecology.  Most students did not truly understand the processes that transform carbon. They failed to apply principles such as the conservation of matter, which holds that when something changes chemically or physically, the amount of matter at the end of the process needs to equal the amount at the beginning. (Matter doesn’t magically appear or disappear.)\nStudents trying to explain weight loss, for example, could not trace matter once it leaves the body; instead they used informal reasoning based on their personal experiences (such as the fat “melted away” or was “burned off”). In reality, the atoms in fat molecules leave the body (mostly through breathing) and enter the atmosphere as carbon dioxide and water. Most students also incorrectly believe plants obtain their mass from the soil rather than primarily from carbon dioxide in the atmosphere. “When you see a tree growing,” Anderson said, “it’s a lot easier to believe that tree is somehow coming out of the soil rather than the scientific reality that it’s coming out of the air.”\nThe researchers say biology textbooks and high-school and college science instructors need to do a better job of teaching the fundamentals – particularly how matter transforms from gaseous to solid states and vice-versa.  It won’t be easy, Anderson said, because students’ beliefs of the carbon cycle are deeply engrained (such as the misconception that plants get most of their nutrients from the soil).\nNeedless to say, these brilliant biologists-of-the-future are primarily concerned that little kids might not be indoctrinated with pseudo-scientific fairy tales about the origin of the species, despite the fact that they themselves quite clearly don’t even understand how the various species live and grow\ntoday\n.  Keep this in mind the next time a biologist is attempting to lecture you on history, politics, philosophy, religion, or pretty much anything more complicated than red + yellow = orange.  Not only are they largely uneducated outside a very narrow range of information, they’re not very intelligent either.\nI’d love to see those same researchers assess the fundamental science knowledge of 500 biology professors at various colleges and universities across America.  If Mr. Myers is a reliable guide, they won’t fare much better.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-08T15:50:00+00:00"
}