{
  "url": "https://voxday.net/2011/01/25/civilization-requires-patriarchy/",
  "scraped_at": "2025-12-13T23:00:43.700253",
  "title": "Civilization requires patriarchy",
  "date_display": "January 25, 2011",
  "date_iso": "2011-01-25T20:09:00+00:00",
  "date_from_url": "2011-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This comment on an old post by Laurence Auster is too succinct to miss as it addresses <a href=\"http://www.inmalafide.com/2009/08/17/lawrence-auster-a-social-conservative-who-just-doesnt-get-it/\">the natural state of Man</a>.</p><blockquote><p>I would also disagree with the idea that somehow family is the natural state of mankind. In reality, the natural state of mankind is a mother and her children (as the feminists claim). The family, instead, is the natural state of civilization. The monogamous marriage of patriarchal control and exclusive sexual access guarantees each man a woman and thus gives him a stake in the civilization around him. This reduces one major source of conflict and allows men to cooperate more easily. In fact, this exclusive sexual access is a hallmark feature of Western Civilization and a major reason why it surged ahead against the various polygamous societies of Africa and the Middle East.</p><p>What women want today is a polyandryous society that still maintains a “Sex and the City” civilization. They somehow expect to limit sexual access to the five percent of men they find attractive while the rest toil away to make life easier and more comfortable for them. It ain’t gonna happen.</p></blockquote><p>This summarizes the decline of the West in a nutshell.  Every great civilization has not only been patriarchal, but has been <i>necessarily</i> patriarchal as an intrinsic aspect of its foundation.  This is logical, because if you think about it, in order to exist, a great civilization must somehow arise from the morass of tribal barbarism that is the human norm.  This can only be accomplished if the aggressive drive of the male portion of the population can somehow be successfully harnessed in a manner that builds up a civilization.</p><p>Women have successfully attacked the concept of patriarchy under the guise of the equality myth.  It has few defenders these days.  But, as I have declared on numerous occasions, there is no such thing as equality in any legal, material or spiritual sense.  It does not exist and one might as legitimately criticize patriarchy on the basis of rainbow unicorns or sparkly vampires.  Unfortunately, what most of these equalitarian women do not realize is that they have been attacking the very core of civilization itself.  The collapse is coming, most likely within decades, and the reality is not going to be much fun for anyone, but especially not for women.</p><p>It is understandable that the sheltered children of the West cannot fathom the brutality of barbarism and the pointlessness its mindless horrors.  Even now, with the barbarians within the gates, they do not quite recognize it.  But once the barbarians reach a critical mass, there will be no mistaking that the end of yet another great civilization has arrived.  And they will.  No civilization ever survives the attempt to replace its children with imported substitutes.</p><p><i>“According to Guttmacher, 35 percent of all U.S. women will have had an abortion by age 45.  Guttmacher also reports that 93 percent of all abortions occur for “social reasons” such as a mother’s decision that the child is unwanted or “inconvenient.””</i></p><p>I tend to doubt the historians of the future will find it terribly difficult to determine the cause of the decline and fall of America.  Some Christians still like to think that America is a nation for which God has a close regard.  I tend to imagine that Americans would do well to hope that the God who has such harsh promises for those who corrupt the young hasn’t been paying close attention lately.</p></div>",
  "content_text": "This comment on an old post by Laurence Auster is too succinct to miss as it addresses\nthe natural state of Man\n.\nI would also disagree with the idea that somehow family is the natural state of mankind. In reality, the natural state of mankind is a mother and her children (as the feminists claim). The family, instead, is the natural state of civilization. The monogamous marriage of patriarchal control and exclusive sexual access guarantees each man a woman and thus gives him a stake in the civilization around him. This reduces one major source of conflict and allows men to cooperate more easily. In fact, this exclusive sexual access is a hallmark feature of Western Civilization and a major reason why it surged ahead against the various polygamous societies of Africa and the Middle East.\nWhat women want today is a polyandryous society that still maintains a “Sex and the City” civilization. They somehow expect to limit sexual access to the five percent of men they find attractive while the rest toil away to make life easier and more comfortable for them. It ain’t gonna happen.\nThis summarizes the decline of the West in a nutshell.  Every great civilization has not only been patriarchal, but has been\nnecessarily\npatriarchal as an intrinsic aspect of its foundation.  This is logical, because if you think about it, in order to exist, a great civilization must somehow arise from the morass of tribal barbarism that is the human norm.  This can only be accomplished if the aggressive drive of the male portion of the population can somehow be successfully harnessed in a manner that builds up a civilization.\nWomen have successfully attacked the concept of patriarchy under the guise of the equality myth.  It has few defenders these days.  But, as I have declared on numerous occasions, there is no such thing as equality in any legal, material or spiritual sense.  It does not exist and one might as legitimately criticize patriarchy on the basis of rainbow unicorns or sparkly vampires.  Unfortunately, what most of these equalitarian women do not realize is that they have been attacking the very core of civilization itself.  The collapse is coming, most likely within decades, and the reality is not going to be much fun for anyone, but especially not for women.\nIt is understandable that the sheltered children of the West cannot fathom the brutality of barbarism and the pointlessness its mindless horrors.  Even now, with the barbarians within the gates, they do not quite recognize it.  But once the barbarians reach a critical mass, there will be no mistaking that the end of yet another great civilization has arrived.  And they will.  No civilization ever survives the attempt to replace its children with imported substitutes.\n“According to Guttmacher, 35 percent of all U.S. women will have had an abortion by age 45.  Guttmacher also reports that 93 percent of all abortions occur for “social reasons” such as a mother’s decision that the child is unwanted or “inconvenient.””\nI tend to doubt the historians of the future will find it terribly difficult to determine the cause of the decline and fall of America.  Some Christians still like to think that America is a nation for which God has a close regard.  I tend to imagine that Americans would do well to hope that the God who has such harsh promises for those who corrupt the young hasn’t been paying close attention lately.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-25T20:09:00+00:00"
}