{
  "url": "https://voxday.net/2011/01/26/dating-up-means-dating-older/",
  "scraped_at": "2025-12-13T23:00:47.438097",
  "title": "Dating up means dating older",
  "date_display": "January 26, 2011",
  "date_iso": "2011-01-26T15:52:00+00:00",
  "date_from_url": "2011-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Molloy <a href=\"http://today.msnbc.msn.com/id/3088165/ns/today-today_hidden/\">offers some advice to women </a>looking to get married that is based on real world statistical behavior rather than Disney movies and HBO television shows:</p><blockquote><p>One of the most common mistakes young women make is to assume that because they’re ready for marriage in their early- or mid-twenties, the men they date are, as well. But as the above research shows, that’s usually not the case. If a woman is seriously trying to find a husband, she should date men who have reached the age of commitment. She can date men slightly before they reach that age, because by the time she’s gone out with a man for a year, he may have reached the point of being receptive to the idea of marriage. But this is taking a gamble that the man is typical, because the figures I’ve just given are educated estimates. Not all men mature at the same rate, and other factors can and do affect a man’s readiness to marry.</p></blockquote><p>His advice corresponds pretty well with my own observations of my friends who have and have not married.  Both logic and economics dictate that women should not get involved with men of their own age unless they are planning to marry between the ages of 18 and 20.  The problem is that because women hypergamous, those who want to start thinking about getting married around the age of 27 after <s>riding the carousel</s>having fun for a few years face the choice of a) pursuing men of equal or higher status and competing with younger women who are more focused on getting married than they are, or b) pursuing men of lower status.  Game theory – of the logical sort, not the sociobiological variety – indicates that the correct play for a woman is to be the younger woman looking for marriage among the men at the next higher age of commitment.</p><p>This means a woman who is not going to college should look for men who are twenty-three or twenty-four, while college women should look for men who are twenty-six or twenty-seven.  Women over the age of thirty should look for men who are thirty-eight to forty, while those over forty should look primarily at divorced men and widowers since men who haven’t married at all by forty have become confirmed bachelors and seldom want to get married or are capable of altering their lifestyles to accomodate it.</p><p>These are general guidelines, not hard and fast laws, but they should help women significantly increase their chances of having relationships that blossom into marriage rather than a series of disappointing ones that never go anywhere.</p></div>",
  "content_text": "John Molloy\noffers some advice to women\nlooking to get married that is based on real world statistical behavior rather than Disney movies and HBO television shows:\nOne of the most common mistakes young women make is to assume that because they’re ready for marriage in their early- or mid-twenties, the men they date are, as well. But as the above research shows, that’s usually not the case. If a woman is seriously trying to find a husband, she should date men who have reached the age of commitment. She can date men slightly before they reach that age, because by the time she’s gone out with a man for a year, he may have reached the point of being receptive to the idea of marriage. But this is taking a gamble that the man is typical, because the figures I’ve just given are educated estimates. Not all men mature at the same rate, and other factors can and do affect a man’s readiness to marry.\nHis advice corresponds pretty well with my own observations of my friends who have and have not married.  Both logic and economics dictate that women should not get involved with men of their own age unless they are planning to marry between the ages of 18 and 20.  The problem is that because women hypergamous, those who want to start thinking about getting married around the age of 27 after\nriding the carousel\nhaving fun for a few years face the choice of a) pursuing men of equal or higher status and competing with younger women who are more focused on getting married than they are, or b) pursuing men of lower status.  Game theory – of the logical sort, not the sociobiological variety – indicates that the correct play for a woman is to be the younger woman looking for marriage among the men at the next higher age of commitment.\nThis means a woman who is not going to college should look for men who are twenty-three or twenty-four, while college women should look for men who are twenty-six or twenty-seven.  Women over the age of thirty should look for men who are thirty-eight to forty, while those over forty should look primarily at divorced men and widowers since men who haven’t married at all by forty have become confirmed bachelors and seldom want to get married or are capable of altering their lifestyles to accomodate it.\nThese are general guidelines, not hard and fast laws, but they should help women significantly increase their chances of having relationships that blossom into marriage rather than a series of disappointing ones that never go anywhere.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-26T15:52:00+00:00"
}