{
  "url": "https://voxday.net/2011/01/29/death-of-white-knight-episode-iii/",
  "scraped_at": "2025-12-13T23:01:02.581625",
  "title": "Death of a White Knight: Episode III",
  "date_display": "January 29, 2011",
  "date_iso": "2011-01-29T22:15:00+00:00",
  "date_from_url": "2011-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another would-be White Knight manages to <a href=\"http://www.vcstar.com/news/2011/jan/27/sheriffs-department-investigating-homicides-at/\">get himself killed</a> unnecessarily:</p><blockquote><p>Wednesday night during a fight outside his Conejo Valley apartment, authorities said.  The suspect, who was injured in the fight, was arrested and booked into Ventura County Jail on suspicion of murder, Ventura County sheriff’s officials said.  Authorities declined to comment on what sparked the fatal fight. The victim’s daughter said relatives were told he was stabbed while intervening in an altercation between a woman and man….</p><p>Barnes died of stab wounds to his torso, said Michael Tellez, a deputy medical examiner. It was unclear if Otal and Barnes knew each other, officials said.</p></blockquote><p>So again I will advise all the deltas and gammas prone to white-knighting: if a man and woman are engaged in a verbal or physical altercation, <i>stay out of it!</i> It’s not your concern and if the man doesn’t attack you, the woman probably will.  On a tangential note, it would be very interesting to know if those who thought a woman is justified in aborting her child in order to save herself to raise the rest of her family also believe that it is right for a man to intervene in domestic altercations.</p></div>",
  "content_text": "Another would-be White Knight manages to\nget himself killed\nunnecessarily:\nWednesday night during a fight outside his Conejo Valley apartment, authorities said.  The suspect, who was injured in the fight, was arrested and booked into Ventura County Jail on suspicion of murder, Ventura County sheriff’s officials said.  Authorities declined to comment on what sparked the fatal fight. The victim’s daughter said relatives were told he was stabbed while intervening in an altercation between a woman and man….\nBarnes died of stab wounds to his torso, said Michael Tellez, a deputy medical examiner. It was unclear if Otal and Barnes knew each other, officials said.\nSo again I will advise all the deltas and gammas prone to white-knighting: if a man and woman are engaged in a verbal or physical altercation,\nstay out of it!\nIt’s not your concern and if the man doesn’t attack you, the woman probably will.  On a tangential note, it would be very interesting to know if those who thought a woman is justified in aborting her child in order to save herself to raise the rest of her family also believe that it is right for a man to intervene in domestic altercations.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-29T22:15:00+00:00"
}