{
  "url": "https://voxday.net/2011/01/05/genocide-is-for-blacks/",
  "scraped_at": "2025-12-13T16:01:19.584254",
  "title": "Genocide is for blacks",
  "date_display": "January 5, 2011",
  "date_iso": "2011-01-05T12:00:00+00:00",
  "date_from_url": "2011-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I would say African-Americans, of course, only as one of my Nigerian sprinter friends had to point out more than once to one of our relentlessly PC acquaintances, <i>they’re not Americans</i>.  Anyhow, Brendan O’Neill notices that African nations apparently <a href=\"http://blogs.telegraph.co.uk/news/brendanoneill2/100070532/liberal-racism-at-work-africans-dont-have-wars-they-have-genocides/\">do not engage in wars </a>any more than the United States does.  Except, instead of engaging in “police actions” and “global struggles against violent extremism”, they apparently just wage “genocide”.</p><blockquote><p>When does war become genocide? When the protagonists are black people. That is the only conclusion one can draw from the unhinged claims that the Ivory Coast is on “the brink of genocide” following the disputed presidential elections and the stand-off between the incumbent president Laurent Gbagbo and president-elect Alassane Ouattara….</p><p>These discussions reveal rather more about the warped Western imagination than they do about realities on the ground. Seemingly incapable of making sense of contemporary political conflict, observers reach for sensationalist, one-size-fits-all explanations instead. These conflicts are like pornography for Western misanthropes who see in every African stand-off the potential for Holocaust-style horrors. It’s a PC rehabilitation of the idea that there is a divide between the civilised West and uncivilised Africa – only today we use the more acceptable-sounding terminology of “genocide preventers” (us) and “genocidaires” (them) to establish our superiority over the dark-skinned barbarians.</p></blockquote><p>A pertinent observation on how even the most fervent equalitarians cannot successfully hide their own fundamental lack of belief in human equality.  On a tangential note, I can’t help but note that many of the same people who are so concerned about overpopulation and global warming are also deeply concerned about preventing genocide and starvation.  How, one wonders, do they think that what they believe to be the excessive human population is going to be reduced?  Relying on material wealth, feminism and irreligious ennui to sap the reproductive instinct strikes me as having no effect on at least three-quarters of the human population, which leaves genocide, famine, and mass forced sterilization as the available options.</p></div>",
  "content_text": "I would say African-Americans, of course, only as one of my Nigerian sprinter friends had to point out more than once to one of our relentlessly PC acquaintances,\nthey’re not Americans\n.  Anyhow, Brendan O’Neill notices that African nations apparently\ndo not engage in wars\nany more than the United States does.  Except, instead of engaging in “police actions” and “global struggles against violent extremism”, they apparently just wage “genocide”.\nWhen does war become genocide? When the protagonists are black people. That is the only conclusion one can draw from the unhinged claims that the Ivory Coast is on “the brink of genocide” following the disputed presidential elections and the stand-off between the incumbent president Laurent Gbagbo and president-elect Alassane Ouattara….\nThese discussions reveal rather more about the warped Western imagination than they do about realities on the ground. Seemingly incapable of making sense of contemporary political conflict, observers reach for sensationalist, one-size-fits-all explanations instead. These conflicts are like pornography for Western misanthropes who see in every African stand-off the potential for Holocaust-style horrors. It’s a PC rehabilitation of the idea that there is a divide between the civilised West and uncivilised Africa – only today we use the more acceptable-sounding terminology of “genocide preventers” (us) and “genocidaires” (them) to establish our superiority over the dark-skinned barbarians.\nA pertinent observation on how even the most fervent equalitarians cannot successfully hide their own fundamental lack of belief in human equality.  On a tangential note, I can’t help but note that many of the same people who are so concerned about overpopulation and global warming are also deeply concerned about preventing genocide and starvation.  How, one wonders, do they think that what they believe to be the excessive human population is going to be reduced?  Relying on material wealth, feminism and irreligious ennui to sap the reproductive instinct strikes me as having no effect on at least three-quarters of the human population, which leaves genocide, famine, and mass forced sterilization as the available options.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-05T12:00:00+00:00"
}