{
  "url": "https://voxday.net/2011/01/07/home-of-banks/",
  "scraped_at": "2025-12-13T22:59:09.785763",
  "title": "The Home of the Banks",
  "date_display": "January 7, 2011",
  "date_iso": "2011-01-07T17:49:00+00:00",
  "date_from_url": "2011-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will be interesting to see how the White House and the Congress intervene to keep their masters <a href=\"http://market-ticker.org/akcs-www?post=176735\">in business and out of prison</a>:</p><blockquote><p><i>“The Massachusetts Supreme Court just dealt a negative ruling to the banks in the closely-followed Ibanez case, which challenged securitization standards. It’s pretty straightforward: The banks didn’t have the proper parwork to foreclose, says the court. Hence, no legitimate foreclosure.”</i></p><p>Oh oh.  That’s exactly what I argued at the time.</p><p>If the details look like what this appears to be, the banks are totally ****ed on their securitized paper.  This decision is from the State Supreme Court and thus is final within the State, and makes it likely that MBS holders will now sue en-masse for the sale of fraudulently-constituted securities (that is, there are no mortgages in the MBS they were sold!)</p></blockquote><p>It’s perfectly clear that the mortgage banks and sellers of “mortgage-backed” securities that were not, in fact, backed by actual mortgages have committed the second-biggest financial fraud in American history.  The amount of money that they have stolen from investors and the IRS absolutely <i>dwarfs</i> the amounts that are enough to imprison smaller fish for more than a decade.</p><p>Needless to say, it is highly unlikely that a single banker will ever do any prison time despite the fact that they are absolutely and provably guilty of massive criminal fraud and tax evasion because the USA is now an aristocracy with democratic trappings.  The financial elite are, quite literally, above the law.  If you steal $100 from a convenience store, there is no question that you will be punished much more severely than a banker who steals <i>billions</i> of dollars.</p><p>It is hard to escape the observation that America has become the Land of the Frauds and the Home of the Banks.  But in the meantime, Zerohedge has more details on <a href=\"http://www.zerohedge.com/article/some-very-bad-news-sweep-fraudclosure-under-rub-brigade\">the Massachusetts bank-slapping</a>.</p><p><i>“Plaintiffs’ claims that the Land Court’s ruling will cause widespread confusion or significant cost to innocent parties are greatly exaggerated, and such reasoning does not warrant ignoring the plain requirements of the law designed to protect Massachusetts consumers. Indeed, it is the foreclosing entities themselves who will bear the greatest cost of clearing titled from their invalid foreclosures.   Having profited greatly from practices regarding the assignment and securitization of mortgages not grounded in the law, it is reasonable  for them to bear the cost of failing to ensure that such practices conformed to Massachusetts law.”</i></p><p>Cue the Commerce Clause….</p></div>",
  "content_text": "It will be interesting to see how the White House and the Congress intervene to keep their masters\nin business and out of prison\n:\n“The Massachusetts Supreme Court just dealt a negative ruling to the banks in the closely-followed Ibanez case, which challenged securitization standards. It’s pretty straightforward: The banks didn’t have the proper parwork to foreclose, says the court. Hence, no legitimate foreclosure.”\nOh oh.  That’s exactly what I argued at the time.\nIf the details look like what this appears to be, the banks are totally ****ed on their securitized paper.  This decision is from the State Supreme Court and thus is final within the State, and makes it likely that MBS holders will now sue en-masse for the sale of fraudulently-constituted securities (that is, there are no mortgages in the MBS they were sold!)\nIt’s perfectly clear that the mortgage banks and sellers of “mortgage-backed” securities that were not, in fact, backed by actual mortgages have committed the second-biggest financial fraud in American history.  The amount of money that they have stolen from investors and the IRS absolutely\ndwarfs\nthe amounts that are enough to imprison smaller fish for more than a decade.\nNeedless to say, it is highly unlikely that a single banker will ever do any prison time despite the fact that they are absolutely and provably guilty of massive criminal fraud and tax evasion because the USA is now an aristocracy with democratic trappings.  The financial elite are, quite literally, above the law.  If you steal $100 from a convenience store, there is no question that you will be punished much more severely than a banker who steals\nbillions\nof dollars.\nIt is hard to escape the observation that America has become the Land of the Frauds and the Home of the Banks.  But in the meantime, Zerohedge has more details on\nthe Massachusetts bank-slapping\n.\n“Plaintiffs’ claims that the Land Court’s ruling will cause widespread confusion or significant cost to innocent parties are greatly exaggerated, and such reasoning does not warrant ignoring the plain requirements of the law designed to protect Massachusetts consumers. Indeed, it is the foreclosing entities themselves who will bear the greatest cost of clearing titled from their invalid foreclosures.   Having profited greatly from practices regarding the assignment and securitization of mortgages not grounded in the law, it is reasonable  for them to bear the cost of failing to ensure that such practices conformed to Massachusetts law.”\nCue the Commerce Clause….",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-07T17:49:00+00:00"
}