{
  "url": "https://voxday.net/2011/01/09/in-which-prize-is-awarded/",
  "scraped_at": "2025-12-13T22:59:19.926677",
  "title": "In which a prize is awarded",
  "date_display": "January 9, 2011",
  "date_iso": "2011-01-09T11:58:00+00:00",
  "date_from_url": "2011-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Olegt, a science professor who teaches physics to biology students, wins a Beezle for this prophetic gem which he assures us <i>in no way</i> indicates a blind faith in science:</p><p><i>“Scientific theories that are well established are with us to stay….  No amount of new research will change the age of the Earth from the current value of 4.54 billion years (plus or minus one percent). The age of the Universe won’t be adjusted much from 13.7 billion years.”</i><br> <b>– olegt: 1/8/11 9:25 PM,</b> <a href=\"http://www.milobookclub.com/2011/01/08/beware-butterfly-collectors/\">Those brilliant butterfly collectors</a></br></p><p>Brave words indeed.  I especially enjoyed the way in which the intrepid professor firmly asserted his immovable position with such confidence, then followed it with a fudge factor of <i>90.8 million years</i> in parentheses.  I can only conclude that he missed his true calling… he should be doing market forecasts on CNBC.  Well-established scientific theories are immutable, stocks have reached a permanently high plateau, and the U.S. Navy is not going to be caught napping.</p></div>",
  "content_text": "Olegt, a science professor who teaches physics to biology students, wins a Beezle for this prophetic gem which he assures us\nin no way\nindicates a blind faith in science:\n“Scientific theories that are well established are with us to stay….  No amount of new research will change the age of the Earth from the current value of 4.54 billion years (plus or minus one percent). The age of the Universe won’t be adjusted much from 13.7 billion years.”\n– olegt: 1/8/11 9:25 PM,\nThose brilliant butterfly collectors\nBrave words indeed.  I especially enjoyed the way in which the intrepid professor firmly asserted his immovable position with such confidence, then followed it with a fudge factor of\n90.8 million years\nin parentheses.  I can only conclude that he missed his true calling… he should be doing market forecasts on CNBC.  Well-established scientific theories are immutable, stocks have reached a permanently high plateau, and the U.S. Navy is not going to be caught napping.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-09T11:58:00+00:00"
}