{
  "url": "https://voxday.net/2011/01/15/in-which-logic-is-abandoned/",
  "scraped_at": "2025-12-13T22:59:54.507190",
  "title": "In which logic is abandoned",
  "date_display": "January 15, 2011",
  "date_iso": "2011-01-15T12:00:00+00:00",
  "date_from_url": "2011-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And empirical evidence is embraced in its stead.  Now, I have long contended that it is worthwhile to pay attention to those with whom one disagrees even if one is convinced that they are wrong.  While I am most certainly not a fan of Malcolm Gladwell and have little regard for science fetishists, after reading <i>What the Dog Saw</i> and engaging in the recent series of discussions related to the limits of science, it occurred to me that even without taking MPAI into account, I was asking far too much of most people in thinking they would grasp the benefits of a radically different interface by simply presenting them with the specifications and features and expecting them to reach the appropriate conclusions.  Most people don’t want to have to think about something in order to figure it out, they want to be informed.  But how can you inform someone of the detailed specifics when you don’t even know what they are?  Most people find it far less meaningful to hear “X will be significantly better than Y because of Z”  than “X is 20, Y is 10.  So X is twice as much as Y.”  They don’t want to think about Z or to work out how much better X is than Y.  In fact, experience suggests that they often regard the first option as complete gibberish.</p><p>This should have been obvious to me from the beginning.  Whenever people react to something that is perfectly logical by saying that it is crazy, this is little more than an indication that they really don’t understand either the logic or the conclusion. I suspect the modern fetish for unassailable empirical evidence is in part the result of a decline in the average individual’s ability to think in the abstract; I noticed that the early adopters of the interface with whom I have communicated have almost uniformly been highly intelligent.  That might appear flattering, except it’s actually indicative of a problem because it means that the vast majority of potential users are not grasping the potential advantage to them.</p><p>Therefore, I concluded that empirical evidence was necessary.  I therefore went about designing a means of acquiring that evidence, which has worked out rather well indeed.  I now have a strange new respect for both Gladwell and blind, thoughtless faith in empirical evidence.</p></div>",
  "content_text": "And empirical evidence is embraced in its stead.  Now, I have long contended that it is worthwhile to pay attention to those with whom one disagrees even if one is convinced that they are wrong.  While I am most certainly not a fan of Malcolm Gladwell and have little regard for science fetishists, after reading\nWhat the Dog Saw\nand engaging in the recent series of discussions related to the limits of science, it occurred to me that even without taking MPAI into account, I was asking far too much of most people in thinking they would grasp the benefits of a radically different interface by simply presenting them with the specifications and features and expecting them to reach the appropriate conclusions.  Most people don’t want to have to think about something in order to figure it out, they want to be informed.  But how can you inform someone of the detailed specifics when you don’t even know what they are?  Most people find it far less meaningful to hear “X will be significantly better than Y because of Z”  than “X is 20, Y is 10.  So X is twice as much as Y.”  They don’t want to think about Z or to work out how much better X is than Y.  In fact, experience suggests that they often regard the first option as complete gibberish.\nThis should have been obvious to me from the beginning.  Whenever people react to something that is perfectly logical by saying that it is crazy, this is little more than an indication that they really don’t understand either the logic or the conclusion. I suspect the modern fetish for unassailable empirical evidence is in part the result of a decline in the average individual’s ability to think in the abstract; I noticed that the early adopters of the interface with whom I have communicated have almost uniformly been highly intelligent.  That might appear flattering, except it’s actually indicative of a problem because it means that the vast majority of potential users are not grasping the potential advantage to them.\nTherefore, I concluded that empirical evidence was necessary.  I therefore went about designing a means of acquiring that evidence, which has worked out rather well indeed.  I now have a strange new respect for both Gladwell and blind, thoughtless faith in empirical evidence.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-15T12:00:00+00:00"
}