{
  "url": "https://voxday.net/2011/01/17/krugman-attempts-logic-hilarity-ensues/",
  "scraped_at": "2025-12-13T23:00:03.948945",
  "title": "Krugman attacks logic, hilarity ensues",
  "date_display": "January 17, 2011",
  "date_iso": "2011-01-17T15:30:00+00:00",
  "date_from_url": "2011-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Krugman inadvertantly reveals a glimpse into <a href=\"http://www.nytimes.com/2011/01/17/opinion/17krugman.html?hp\">his reasoning process</a>:</p><blockquote><p>My wife and I were thinking of going out for an inexpensive dinner tonight. But John Boehner, the speaker of the House, says that no matter how cheap the meal may seem, it will cost thousands of dollars once you take our monthly mortgage payments into account.  Wait a minute, you may say. How can our mortgage payments be a cost of going out to eat, when we’ll have to make the same payments even if we stay home? But Mr. Boehner is adamant: our mortgage is part of the cost of our meal, and to say otherwise is just a budget gimmick.</p><p>O.K., the speaker hasn’t actually weighed in on our plans for the evening. But he and his G.O.P. colleagues have lately been making exactly the nonsensical argument I’ve just described — not about tonight’s dinner, but about health care reform.</p><p>in 1997 Congress enacted a formula to determine Medicare payments to physicians. The formula was, however, flawed; it would lead to payments so low that doctors would stop accepting Medicare patients. Instead of changing the formula, however, Congress has consistently enacted one-year fixes. And Republicans claim that the estimated cost of future fixes, $208 billion over the next 10 years, should be considered a cost of health care reform.</p><p>But the same spending would still be necessary if we were to undo reform. So the G.O.P. argument here is exactly like claiming that my mortgage payments, which I’ll have to make no matter what we do tonight, are a cost of going out for dinner.</p></blockquote><p>Krugman’s column is based upon three assertions.  Number one, that the large divergence in the cost of a mortgage versus an inexpensive dinner is comparable to the cost of future fixes versus the total cost of health care reform.  Let’s consider that one first.  The average monthly mortgage payment is around $1,750.  An inexpensive dinner for two is around $50.  Krugman tells us the cost of fixing Medicare for 10 years is $208 billion.  The CBO’s revised estimate for health care reform, which does NOT include the Medicare fix, is $1,055 billion.  (The Republicans say that the total will be $2,600 billion, but we’ll go with Krugman’s favored estimate just to be fair to him.)</p><p>So, the Nobel Prize-winning economist Krugman is claiming that 1750/50=208/1055, or that 35=0.197.  And you wonder why the economy is in such dire straits…</p><p>Number two, Krugman is assuming that the Medicare fix is as inevitable as a mortgage payment.  But this quite clearly isn’t the case; whereas not making the mortgage payment entails losing the house, (or at least it did back when mortgage banks held legitimate title to houses and were actually willing to foreclose on properties and write off the bad loan), the possibility that doctors might elect not to see Medicare patients hardly makes increasing Medicare payments a necessity.  There are other options available that don’t require spending the money, which is not the case when it comes to making mortgage payments.</p><p>Number three, Krugman declares that “the modern G.O.P. has been taken over by an ideology in which the suffering of the unfortunate isn’t a proper concern of government, and alleviating that suffering at taxpayer expense is immoral, never mind how little it costs.”  But if this were actually the case, then the modern G.O.P. would simply solve the budgetary problem by <i>not spending the $208 billion</i> instead of insisting that it be counted as part of the cost of health care reform.  Even if we ignore the fact that this is the fiscally responsible decision as well as the Constitutionally correct thing to do since Medicare is not a legitimate function of the federal government, Krugman’s failure to realize that the Republicans are not advocating this only underlines his complete logical incoherence.</p><p>Far be it from me to defend the Congressional Republicans, but for all their ill-conceived enthusiasm for illegitimate military adventures, a war on logic is not one in which they are presently engaged.  It is instead Paul Krugman who is waging a public one-man crusade against it.</p></div>",
  "content_text": "Paul Krugman inadvertantly reveals a glimpse into\nhis reasoning process\n:\nMy wife and I were thinking of going out for an inexpensive dinner tonight. But John Boehner, the speaker of the House, says that no matter how cheap the meal may seem, it will cost thousands of dollars once you take our monthly mortgage payments into account.  Wait a minute, you may say. How can our mortgage payments be a cost of going out to eat, when we’ll have to make the same payments even if we stay home? But Mr. Boehner is adamant: our mortgage is part of the cost of our meal, and to say otherwise is just a budget gimmick.\nO.K., the speaker hasn’t actually weighed in on our plans for the evening. But he and his G.O.P. colleagues have lately been making exactly the nonsensical argument I’ve just described — not about tonight’s dinner, but about health care reform.\nin 1997 Congress enacted a formula to determine Medicare payments to physicians. The formula was, however, flawed; it would lead to payments so low that doctors would stop accepting Medicare patients. Instead of changing the formula, however, Congress has consistently enacted one-year fixes. And Republicans claim that the estimated cost of future fixes, $208 billion over the next 10 years, should be considered a cost of health care reform.\nBut the same spending would still be necessary if we were to undo reform. So the G.O.P. argument here is exactly like claiming that my mortgage payments, which I’ll have to make no matter what we do tonight, are a cost of going out for dinner.\nKrugman’s column is based upon three assertions.  Number one, that the large divergence in the cost of a mortgage versus an inexpensive dinner is comparable to the cost of future fixes versus the total cost of health care reform.  Let’s consider that one first.  The average monthly mortgage payment is around $1,750.  An inexpensive dinner for two is around $50.  Krugman tells us the cost of fixing Medicare for 10 years is $208 billion.  The CBO’s revised estimate for health care reform, which does NOT include the Medicare fix, is $1,055 billion.  (The Republicans say that the total will be $2,600 billion, but we’ll go with Krugman’s favored estimate just to be fair to him.)\nSo, the Nobel Prize-winning economist Krugman is claiming that 1750/50=208/1055, or that 35=0.197.  And you wonder why the economy is in such dire straits…\nNumber two, Krugman is assuming that the Medicare fix is as inevitable as a mortgage payment.  But this quite clearly isn’t the case; whereas not making the mortgage payment entails losing the house, (or at least it did back when mortgage banks held legitimate title to houses and were actually willing to foreclose on properties and write off the bad loan), the possibility that doctors might elect not to see Medicare patients hardly makes increasing Medicare payments a necessity.  There are other options available that don’t require spending the money, which is not the case when it comes to making mortgage payments.\nNumber three, Krugman declares that “the modern G.O.P. has been taken over by an ideology in which the suffering of the unfortunate isn’t a proper concern of government, and alleviating that suffering at taxpayer expense is immoral, never mind how little it costs.”  But if this were actually the case, then the modern G.O.P. would simply solve the budgetary problem by\nnot spending the $208 billion\ninstead of insisting that it be counted as part of the cost of health care reform.  Even if we ignore the fact that this is the fiscally responsible decision as well as the Constitutionally correct thing to do since Medicare is not a legitimate function of the federal government, Krugman’s failure to realize that the Republicans are not advocating this only underlines his complete logical incoherence.\nFar be it from me to defend the Congressional Republicans, but for all their ill-conceived enthusiasm for illegitimate military adventures, a war on logic is not one in which they are presently engaged.  It is instead Paul Krugman who is waging a public one-man crusade against it.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-17T15:30:00+00:00"
}