{
  "url": "https://voxday.net/2011/01/29/mailvox-no-harm-no-fou/",
  "scraped_at": "2025-12-13T23:01:00.759802",
  "title": "Mailvox: no harm, no foul",
  "date_display": "January 29, 2011",
  "date_iso": "2011-01-29T18:01:00+00:00",
  "date_from_url": "2011-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The ElusiveWapiti is offended on the blog’s behalf:</p><blockquote><p>Pharyngula makes the <a href=\"http://brainz.org/top-100-blogs/\">list of “Top 100 Blogs”</a> but VP does not.  Blasphemy, I’d say.</p></blockquote><p>Actually, that was a pretty good list.  I’m delighted to see <a href=\"http://market-ticker.org/\">Karl</a>, <a href=\"http://www.hookingupsmart.com/\">Susan</a>, <a href=\"http://roissy.wordpress.com/\">Roissy</a>, <a href=\"http://www.marriedmansexlife.com/\">Athol</a>, and <a href=\"http://www.inmalafide.com/\">Ferdinand </a>all receiving well-deserved notice. <a href=\"http://www.ritholtz.com/blog/\">Ritzholtz’s blog</a> is a good choice too, although I would have liked to see <a href=\"http://globaleconomicanalysis.blogspot.com/\">Mish </a>and <a href=\"http://www.debtdeflation.com/blogs/\">Steve Keen</a> in the Economics category.  Scalzi’s blog used to be quite good when he had the time to post daily, and although I don’t read it now that it’s mostly authors writing about their own books, I can see where that would be appealing to many readers.  The list is a bit dated and lefty, since as Instapundit noted, Wonkette is all but dead and Boing Boing is stultifyingly boring.</p><p>As for Pharyngula, it is the home of the moderately intelligent, college-educated, angry, and unpopular.  Since there is no shortage of such creatures, I think it eminently merits its recognition as a top blog.  I wouldn’t characterize it as “smart”, but then, I don’t have an IQ of 100 either.  Of course the readers of this blog don’t find it to be intelligent since most of you are more intelligent than PZ, but from the average perspective, it is pretty smart.  One can’t be an idiot to get things that completely wrong.</p><p>I would be very surprised if VP was ever named on such a list, since even after the publication of RGD you won’t find it on a list of top 100 Economics blogs.  Nor do I mind that it isn’t.  This blog is too esoteric for the mainstream and too iconoclastic for the moderately intelligent; I would tend to consider it a failure if it was not.  What I said about women is also true of men.  I don’t expect most people to agree with me because I don’t expect them to be able to understand me.</p><p>The problem is that when you make a habit of dealing in the realm of the unthinkable, few can fathom it.  So, even when I’m correct about some previously outlandish possibility, I am unlikely to receive any credit for it because such things are considered to be, by definition, black swans.  Since no one can possibly have imagined it, no one could have predicted it, therefore any claims to have done so are inherently false.  This is but one of the many examples of modern/medieval logic that has, ironically enough, returned to supplant the empiricism that previously usurped its primacy.</p></div>",
  "content_text": "The ElusiveWapiti is offended on the blog’s behalf:\nPharyngula makes the\nlist of “Top 100 Blogs”\nbut VP does not.  Blasphemy, I’d say.\nActually, that was a pretty good list.  I’m delighted to see\nKarl\n,\nSusan\n,\nRoissy\n,\nAthol\n, and\nFerdinand\nall receiving well-deserved notice.\nRitzholtz’s blog\nis a good choice too, although I would have liked to see\nMish\nand\nSteve Keen\nin the Economics category.  Scalzi’s blog used to be quite good when he had the time to post daily, and although I don’t read it now that it’s mostly authors writing about their own books, I can see where that would be appealing to many readers.  The list is a bit dated and lefty, since as Instapundit noted, Wonkette is all but dead and Boing Boing is stultifyingly boring.\nAs for Pharyngula, it is the home of the moderately intelligent, college-educated, angry, and unpopular.  Since there is no shortage of such creatures, I think it eminently merits its recognition as a top blog.  I wouldn’t characterize it as “smart”, but then, I don’t have an IQ of 100 either.  Of course the readers of this blog don’t find it to be intelligent since most of you are more intelligent than PZ, but from the average perspective, it is pretty smart.  One can’t be an idiot to get things that completely wrong.\nI would be very surprised if VP was ever named on such a list, since even after the publication of RGD you won’t find it on a list of top 100 Economics blogs.  Nor do I mind that it isn’t.  This blog is too esoteric for the mainstream and too iconoclastic for the moderately intelligent; I would tend to consider it a failure if it was not.  What I said about women is also true of men.  I don’t expect most people to agree with me because I don’t expect them to be able to understand me.\nThe problem is that when you make a habit of dealing in the realm of the unthinkable, few can fathom it.  So, even when I’m correct about some previously outlandish possibility, I am unlikely to receive any credit for it because such things are considered to be, by definition, black swans.  Since no one can possibly have imagined it, no one could have predicted it, therefore any claims to have done so are inherently false.  This is but one of the many examples of modern/medieval logic that has, ironically enough, returned to supplant the empiricism that previously usurped its primacy.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-29T18:01:00+00:00"
}