{
  "url": "https://voxday.net/2011/01/01/mailvox-one-less-god-and-banana/",
  "scraped_at": "2025-12-13T16:01:02.651490",
  "title": "Mailvox: one less god and the banana",
  "date_display": "January 1, 2011",
  "date_iso": "2011-01-01T16:15:00+00:00",
  "date_from_url": "2011-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lithp wishes to respond to my critique of Stephen Roberts’s One Less God argument:</p><blockquote><p>All right. I’m interested in addressing your critique:</p><p><i>“1. No, we are not both atheists.<br> 2. No, you are confusing God with gods. If you simply take the First Commandment into account, you will know that this is incorrect. Few atheists understand that monotheism concerns the worship of one supreme Creator God, not belief in the existence of only one supernatural being that demands worship.<br> 3. Unless an atheist dismisses the Christian God because they believe Him to be an evil supernatural being falsely posing as a deity worthy of worship, he is not doing so for the same reason that Christians dismiss the pagan gods.”</br></br></i></p><p>On Point 1, the first part is not meant to be taken literally. Of course a monotheist is not an atheist. The point is that disbelieving in deities is not such a novel concept.  I can proceed no further unless you clear up a point for me: Are you saying that you DO believe in pagan gods, you just don’t think they are what they claim?</p><p><i>“It is so eminently fitting that atheists should rely upon fake quotes to argue in support of their supposed dedication to reality.”</i></p><p>I should think the point matters more than who said it.</p><p><i>“Dawkins, Harris, Hitchens, and Myers are no more philosophically sophisticated than the teenagers and make pretty much the same arguments.”</i></p><p>Okay. You really aren’t going to get a more in-depth rebuttal from anyone other than “no they aren’t,” because you didn’t actually demonstrate how this is so. This is especially problematic for someone such as myself, who doesn’t really follow any of these people. Additionally, I don’t see why you keep using the phrase “teenager” to describe an ignorant person. I’m 19 and I can tell you why Ray Comfort’s banana argument is a load of nonsense.</p></blockquote><p>1.  I am aware that Roberts’s first statement can be viewed as mere rhetorical exaggeration, even though most atheists who quote it do take it literally.  That doesn’t make it any less false.  The fact that he begins with a demonstrable falsehood doesn’t bode well for his argument, since it indicates he is more interested in the superficial sound of his argument than its substance.  If you’re going to pose as a philosophical champion of material fact and reason, shouldn’t you really stick to strict factual accuracy?</p><p>2.  That’s a reasonable question.  Yes, I do believe in the literal existence of intelligent and supernatural beings that are not the Creator God and may or may not seek human worship.  Some of the pagan gods in the written historical record are these creatures whereas others are mere human invention.  The Bible describes both kinds.  I would put Zeus and Amaterasu in the fictional category and Baal, Wotan, and Damballah Wedo in the non-fiction one based on the behavior of their human worshippers.  As I have repeatedly written, atheists like Roberts and even some Christians fail to make the vital distinction between “God” and “gods”.  There are many gods but only one Creator God who merits our worship and who sent His Son to die on our behalf.</p><p>Please note that one needn’t believe in the existence of either the Christian God or the pagan gods to understand that the distinction renders Roberts’s argument invalid.</p><p>3.  Again, if you are claiming to be devoted to fact and reason, basing your self-proclaimed most effective argument on a fictitious statement at the very least renders your devotion to fact more than a little suspect.  That being said, if the point stands, it stands, though obviously without the benefit of the presumed authority of the erroneously quoted individual who didn’t actually supply the quote.  It also calls either the knowledge or the intellectual honesty of the individual providing the false quote into question.</p><p>4.  First, the overlap between the arguments presented by the Reddit “teenagers” and the New Atheists is easily confirmed by comparing them.  Second, I have actually demonstrated how the arguments of Dawkins, Harris, Hitchens, Myers, and others are philosophically unsophisticated and have gone into considerable detail explaining precisely how those arguments are incorrect.  Since I have published an entire book on the subject, I don’t believe it is either necessary or possible for me to rehash several hundred pages of material every time the subject comes up again.  Of course, until someone reads the book, their opinion on the matter is entirely irrelevant.</p><p>Moreover, numerous <i>atheists</i> have reached precisely the same conclusion about the lack of philosophical and theological sophistication on the part of the New Atheists as I have.  Dawkins and Myers have both openly admitted their own ignorance of philosophy and/or theology; you should note that the Courtier’s Reply is a feeble attempt to justify that ignorance.  You may also wish to note that only Harris, Dennett, and Onfray even pretend to have any knowledge of philosophy.</p><p>5.  Teenagers are, for the most part, almost completely ignorant without realizing it.  They have very little experience of the world and the vast majority are badly educated and poorly read.  Even the most intelligent seldom have enough information at their intellectual disposal to use that intelligence to any significant effect.  However, in this particular case, it was asserted by someone else that the people who were posting quotes in the Reddit thread were mostly teenagers.  Not being familiar with that site, I simply accepted his assertion, even though I consider it to be questionable.</p><p>As for Ray Comfort’s banana, I have no idea to what you are referring.  But what little I have read of Comfort does not lead me to conclude that it would take much in the way of either intelligence or experience to successfully address one of his arguments.</p></div>",
  "content_text": "Lithp wishes to respond to my critique of Stephen Roberts’s One Less God argument:\nAll right. I’m interested in addressing your critique:\n“1. No, we are not both atheists.\n2. No, you are confusing God with gods. If you simply take the First Commandment into account, you will know that this is incorrect. Few atheists understand that monotheism concerns the worship of one supreme Creator God, not belief in the existence of only one supernatural being that demands worship.\n3. Unless an atheist dismisses the Christian God because they believe Him to be an evil supernatural being falsely posing as a deity worthy of worship, he is not doing so for the same reason that Christians dismiss the pagan gods.”\nOn Point 1, the first part is not meant to be taken literally. Of course a monotheist is not an atheist. The point is that disbelieving in deities is not such a novel concept.  I can proceed no further unless you clear up a point for me: Are you saying that you DO believe in pagan gods, you just don’t think they are what they claim?\n“It is so eminently fitting that atheists should rely upon fake quotes to argue in support of their supposed dedication to reality.”\nI should think the point matters more than who said it.\n“Dawkins, Harris, Hitchens, and Myers are no more philosophically sophisticated than the teenagers and make pretty much the same arguments.”\nOkay. You really aren’t going to get a more in-depth rebuttal from anyone other than “no they aren’t,” because you didn’t actually demonstrate how this is so. This is especially problematic for someone such as myself, who doesn’t really follow any of these people. Additionally, I don’t see why you keep using the phrase “teenager” to describe an ignorant person. I’m 19 and I can tell you why Ray Comfort’s banana argument is a load of nonsense.\n1.  I am aware that Roberts’s first statement can be viewed as mere rhetorical exaggeration, even though most atheists who quote it do take it literally.  That doesn’t make it any less false.  The fact that he begins with a demonstrable falsehood doesn’t bode well for his argument, since it indicates he is more interested in the superficial sound of his argument than its substance.  If you’re going to pose as a philosophical champion of material fact and reason, shouldn’t you really stick to strict factual accuracy?\n2.  That’s a reasonable question.  Yes, I do believe in the literal existence of intelligent and supernatural beings that are not the Creator God and may or may not seek human worship.  Some of the pagan gods in the written historical record are these creatures whereas others are mere human invention.  The Bible describes both kinds.  I would put Zeus and Amaterasu in the fictional category and Baal, Wotan, and Damballah Wedo in the non-fiction one based on the behavior of their human worshippers.  As I have repeatedly written, atheists like Roberts and even some Christians fail to make the vital distinction between “God” and “gods”.  There are many gods but only one Creator God who merits our worship and who sent His Son to die on our behalf.\nPlease note that one needn’t believe in the existence of either the Christian God or the pagan gods to understand that the distinction renders Roberts’s argument invalid.\n3.  Again, if you are claiming to be devoted to fact and reason, basing your self-proclaimed most effective argument on a fictitious statement at the very least renders your devotion to fact more than a little suspect.  That being said, if the point stands, it stands, though obviously without the benefit of the presumed authority of the erroneously quoted individual who didn’t actually supply the quote.  It also calls either the knowledge or the intellectual honesty of the individual providing the false quote into question.\n4.  First, the overlap between the arguments presented by the Reddit “teenagers” and the New Atheists is easily confirmed by comparing them.  Second, I have actually demonstrated how the arguments of Dawkins, Harris, Hitchens, Myers, and others are philosophically unsophisticated and have gone into considerable detail explaining precisely how those arguments are incorrect.  Since I have published an entire book on the subject, I don’t believe it is either necessary or possible for me to rehash several hundred pages of material every time the subject comes up again.  Of course, until someone reads the book, their opinion on the matter is entirely irrelevant.\nMoreover, numerous\natheists\nhave reached precisely the same conclusion about the lack of philosophical and theological sophistication on the part of the New Atheists as I have.  Dawkins and Myers have both openly admitted their own ignorance of philosophy and/or theology; you should note that the Courtier’s Reply is a feeble attempt to justify that ignorance.  You may also wish to note that only Harris, Dennett, and Onfray even pretend to have any knowledge of philosophy.\n5.  Teenagers are, for the most part, almost completely ignorant without realizing it.  They have very little experience of the world and the vast majority are badly educated and poorly read.  Even the most intelligent seldom have enough information at their intellectual disposal to use that intelligence to any significant effect.  However, in this particular case, it was asserted by someone else that the people who were posting quotes in the Reddit thread were mostly teenagers.  Not being familiar with that site, I simply accepted his assertion, even though I consider it to be questionable.\nAs for Ray Comfort’s banana, I have no idea to what you are referring.  But what little I have read of Comfort does not lead me to conclude that it would take much in the way of either intelligence or experience to successfully address one of his arguments.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-01T16:15:00+00:00"
}