{
  "url": "https://voxday.net/2011/01/12/more-biologist-brilliance/",
  "scraped_at": "2025-12-13T22:59:39.830116",
  "title": "More biologist brilliance",
  "date_display": "January 12, 2011",
  "date_iso": "2011-01-12T21:31:00+00:00",
  "date_from_url": "2011-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no doubt that many young schoolchildren with an interest in the life sciences dream of studying biology, traveling to exotic foreign lands, studying wonderful animals… <a href=\"http://www.foxnews.com/scitech/2011/01/12/scientists-inadvertently-killing-penguins-researchers/\">and killing them</a>:</p><blockquote><p>Some scientists studying penguins may be inadvertently harming them with the metal bands they use to keep track of the tuxedo-clad seabirds, a new study says.  The survival rate of King penguins with metal bands on their flippers was 44 percent lower than those without bands and banded birds produced far fewer chicks, according to new research published Wednesday in the journal Nature.  The theory is that the metal bands — either aluminum or stainless steel — increase drag on the penguins when they swim, making them work harder, the study’s authors said.</p></blockquote><p>Science: it’s all about the self-correction.  And here you thought I was exaggerating when I said that biologists are rather stupid.  They can’t even figure out that strapping metal onto swimming birds just might be a problem, and yet they expect us to swallow their latest Evolutionary <s>Fairy Tale</s>Stable Strategy they just concocted to replace the one that previously proved absurd.  I probably shouldn’t keep cracking jokes about empirically testing natural selection by painting polar bears pink… no doubt there is a biologist out there who would think it’s a <i>great</i> idea.</p></div>",
  "content_text": "I have no doubt that many young schoolchildren with an interest in the life sciences dream of studying biology, traveling to exotic foreign lands, studying wonderful animals…\nand killing them\n:\nSome scientists studying penguins may be inadvertently harming them with the metal bands they use to keep track of the tuxedo-clad seabirds, a new study says.  The survival rate of King penguins with metal bands on their flippers was 44 percent lower than those without bands and banded birds produced far fewer chicks, according to new research published Wednesday in the journal Nature.  The theory is that the metal bands — either aluminum or stainless steel — increase drag on the penguins when they swim, making them work harder, the study’s authors said.\nScience: it’s all about the self-correction.  And here you thought I was exaggerating when I said that biologists are rather stupid.  They can’t even figure out that strapping metal onto swimming birds just might be a problem, and yet they expect us to swallow their latest Evolutionary\nFairy Tale\nStable Strategy they just concocted to replace the one that previously proved absurd.  I probably shouldn’t keep cracking jokes about empirically testing natural selection by painting polar bears pink… no doubt there is a biologist out there who would think it’s a\ngreat\nidea.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-12T21:31:00+00:00"
}