{
  "url": "https://voxday.net/2011/01/16/most-atheists-have-sub-norma/",
  "scraped_at": "2025-12-13T22:59:58.444772",
  "title": "Most atheists have sub-normal intelligence",
  "date_display": "January 16, 2011",
  "date_iso": "2011-01-16T15:30:00+00:00",
  "date_from_url": "2011-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I mean that quite literally, not that this is any news to those who have read TIA and understand the two churches of atheism or have been forced to slog through the reasoning exhibited by some of the atheists commenting on this blog. <a href=\"http://inductivist.blogspot.com/2011/01/more-than-one-half-of-atheists-are-dumb.html\">The Inductivist</a> points us to empirical evidence that proves 56.8% of all atheists have IQs below 100.</p><p>Should you wish to verify this information for yourself, go to <a href=\"http://sda.berkeley.edu/cgi-bin/hsda?harcsda+gss08\">the GSS 1972-2008 database</a>, type “god” in the column field and “WORDSUM” in the row field, then hit the “Run the Table” button.  Be sure to select the unweighted numbers if you want to see the raw results.</p><p>So, while it is true that a slightly higher <i>percentage</i> of atheists have IQs in the highest range, 8.8 percent compared to 8.0 percent of those who believe God exists, because there are so many more theists than atheists, there are 9 highly intelligent theists who are sure that God exists, (and 13 who believe in God’s existence), for every highly intelligent atheist who believes God does not exist.  And on a personal note, visiting atheists who believe that they are more intelligent than theists by sheer virtue of their non-belief and/or commitment to Science Reason would do well to keep in mind that less than nine percent of all atheists reach the level that is from twelve to six points <i>lower</i> than the very minimum you know my IQ could be.</p><p>It should come as no surprise that the highest percentage of highly intelligent individuals are agnostic since it is the only position fully supported by all the material evidence.  Nor should it be a surprise that atheists so often attempt to claim agnostics as atheists, as there are nearly three times more highly intelligent agnostics as there are atheists.  The GSS data is more evidence for the idea that atheism is little more than a less intelligent form of socially maladjusted agnosticism.</p><p>Cue attacks on the scientific validity of the General Social Survey or an abandonment of the appeal to intelligence argument in 3… 2… 1….</p><p> UPDATE: Contrary to their self-advertising, atheists are actually more over-represented at the low end of the intelligence spectrum than they are on the high end.  8.4 percent of atheists have IQs below 63 (nearly as many as have high IQs) whereas only 1.9 percent of believing theists do.</p></div>",
  "content_text": "I mean that quite literally, not that this is any news to those who have read TIA and understand the two churches of atheism or have been forced to slog through the reasoning exhibited by some of the atheists commenting on this blog.\nThe Inductivist\npoints us to empirical evidence that proves 56.8% of all atheists have IQs below 100.\nShould you wish to verify this information for yourself, go to\nthe GSS 1972-2008 database\n, type “god” in the column field and “WORDSUM” in the row field, then hit the “Run the Table” button.  Be sure to select the unweighted numbers if you want to see the raw results.\nSo, while it is true that a slightly higher\npercentage\nof atheists have IQs in the highest range, 8.8 percent compared to 8.0 percent of those who believe God exists, because there are so many more theists than atheists, there are 9 highly intelligent theists who are sure that God exists, (and 13 who believe in God’s existence), for every highly intelligent atheist who believes God does not exist.  And on a personal note, visiting atheists who believe that they are more intelligent than theists by sheer virtue of their non-belief and/or commitment to Science Reason would do well to keep in mind that less than nine percent of all atheists reach the level that is from twelve to six points\nlower\nthan the very minimum you know my IQ could be.\nIt should come as no surprise that the highest percentage of highly intelligent individuals are agnostic since it is the only position fully supported by all the material evidence.  Nor should it be a surprise that atheists so often attempt to claim agnostics as atheists, as there are nearly three times more highly intelligent agnostics as there are atheists.  The GSS data is more evidence for the idea that atheism is little more than a less intelligent form of socially maladjusted agnosticism.\nCue attacks on the scientific validity of the General Social Survey or an abandonment of the appeal to intelligence argument in 3… 2… 1….\nUPDATE: Contrary to their self-advertising, atheists are actually more over-represented at the low end of the intelligence spectrum than they are on the high end.  8.4 percent of atheists have IQs below 63 (nearly as many as have high IQs) whereas only 1.9 percent of believing theists do.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-16T15:30:00+00:00"
}