{
  "url": "https://voxday.net/2011/01/21/numerology/",
  "scraped_at": "2025-12-13T23:00:24.777530",
  "title": "Numerology",
  "date_display": "January 21, 2011",
  "date_iso": "2011-01-21T21:00:00+00:00",
  "date_from_url": "2011-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As much as most women absolutely hate it, the evidence that there is a statistical correlation between past and future behavior is remorseless.  The Audacious Epigone <a href=\"http://anepigone.blogspot.com/2010/12/women-who-get-around-while-unmarried.html\">goes through the GSS</a> and uncovers the following data related to the number of men with whom a woman reports she has had sex and the percentage of married women who admit that they have been unfaithful:</p><p>00.0% 1 (by definition)<br> 10.4% 2<br> 14.9% 3<br> 17.7% 4<br> 21.6% 5<br> 26.0% 6-10<br> 36.7% 11-20<br> 46.8% 21+</br></br></br></br></br></br></br></p><p>It’s interesting to see that <i>most</i> married women still do not report cheating regardless of their personal history; one might have imagined the 21+ crowd to surpass 50%.  Some of the other interesting data derived from the GSS data is that male atheists are the most likely to be unfaithful (30.2%) while women who are vaguely spiritual and believe in Some Higher Power are the worst risk (25%).  And only 2.6% of Slim women report cheating while married versus 15.7% of Stocky ones.</p><p>On a related note is what young women <a href=\"http://www.hookingupsmart.com/2011/01/20/hookinguprealities/the-case-for-slut-shaming-part-deux/\">tend to deprioritize</a> in terms of what they want in a man.  And unsurprisingly, it isn’t what they will later prioritize in a marriage.</p><p><i>“A second measure is the number of sex partners that “sub-optimal men” have had. I define that group as men who are 22 years old, dropped out of high school and don’t have a full-time job — men who don’t have a lot going for them. We compare the number of partners they’ve had with the number of partners of a male college graduate who is employed full-time. Theoretically, if sex is valuable to her then she’s not going to trade it away to just some crummy man, and when we look at the data, we find that those sub-optimal men report a lot more partners than men who actually have a lot going for them.”</i></p><p>As with most things, it all comes down to economics in the end.</p></div>",
  "content_text": "As much as most women absolutely hate it, the evidence that there is a statistical correlation between past and future behavior is remorseless.  The Audacious Epigone\ngoes through the GSS\nand uncovers the following data related to the number of men with whom a woman reports she has had sex and the percentage of married women who admit that they have been unfaithful:\n00.0% 1 (by definition)\n10.4% 2\n14.9% 3\n17.7% 4\n21.6% 5\n26.0% 6-10\n36.7% 11-20\n46.8% 21+\nIt’s interesting to see that\nmost\nmarried women still do not report cheating regardless of their personal history; one might have imagined the 21+ crowd to surpass 50%.  Some of the other interesting data derived from the GSS data is that male atheists are the most likely to be unfaithful (30.2%) while women who are vaguely spiritual and believe in Some Higher Power are the worst risk (25%).  And only 2.6% of Slim women report cheating while married versus 15.7% of Stocky ones.\nOn a related note is what young women\ntend to deprioritize\nin terms of what they want in a man.  And unsurprisingly, it isn’t what they will later prioritize in a marriage.\n“A second measure is the number of sex partners that “sub-optimal men” have had. I define that group as men who are 22 years old, dropped out of high school and don’t have a full-time job — men who don’t have a lot going for them. We compare the number of partners they’ve had with the number of partners of a male college graduate who is employed full-time. Theoretically, if sex is valuable to her then she’s not going to trade it away to just some crummy man, and when we look at the data, we find that those sub-optimal men report a lot more partners than men who actually have a lot going for them.”\nAs with most things, it all comes down to economics in the end.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-21T21:00:00+00:00"
}