{
  "url": "https://voxday.net/2011/01/21/pat-buchanan-on-china-and-free-trade/",
  "scraped_at": "2025-12-13T23:00:21.106421",
  "title": "Pat Buchanan on China and free trade",
  "date_display": "January 21, 2011",
  "date_iso": "2011-01-21T15:02:00+00:00",
  "date_from_url": "2011-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The growing power of China and <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=253613\">the decline of an indebted America</a> is just one small aspect of the strong historical case against free trade:</p><blockquote><p>Revalue your currency, we demand of the Chinese, stop running these trade surpluses at our expense, start practicing free trade, and abandon these mercantilist and protectionist policies.  But why should they? Why should China abandon a trade policy that is working marvelously well for them, and adopt a trade policy that is failing dismally for us? Does that make sense?</p><p>Why should any nation emulate the U.S. trade policy of the Bush-Clinton-Bush era that has stripped us of a third of our manufacturing jobs and made us dependent on China and the world for the needs of our national life and the borrowed money to pay for them?</p><p>Why would China, seeking to make herself an independent and self-sufficient nation, adopt a policy that cost us our independence?  And what are the Chinese doing in their ascendancy to first power on earth that we did not do in ours?</p></blockquote><p>One of the interesting things that readily becomes apparent when reading Rothbard’s <i>An Economic Perspective on the History of Economic Thought</i> is that virtually everything the free traders – and I was once one of them – believe about economic <i>history</i> is wrong.  They have various theoretical problems too, to be sure, but history provides an easier means of undermining the primary intellectual engine for totalitarian globalism than comparatively esoteric economic theory.  Of course, the weakness of the free trade case is very easily seen in the way that they immediately retreat from their previous analogies and arguments as soon as their weaknesses are demonstrated.</p></div>",
  "content_text": "The growing power of China and\nthe decline of an indebted America\nis just one small aspect of the strong historical case against free trade:\nRevalue your currency, we demand of the Chinese, stop running these trade surpluses at our expense, start practicing free trade, and abandon these mercantilist and protectionist policies.  But why should they? Why should China abandon a trade policy that is working marvelously well for them, and adopt a trade policy that is failing dismally for us? Does that make sense?\nWhy should any nation emulate the U.S. trade policy of the Bush-Clinton-Bush era that has stripped us of a third of our manufacturing jobs and made us dependent on China and the world for the needs of our national life and the borrowed money to pay for them?\nWhy would China, seeking to make herself an independent and self-sufficient nation, adopt a policy that cost us our independence?  And what are the Chinese doing in their ascendancy to first power on earth that we did not do in ours?\nOne of the interesting things that readily becomes apparent when reading Rothbard’s\nAn Economic Perspective on the History of Economic Thought\nis that virtually everything the free traders – and I was once one of them – believe about economic\nhistory\nis wrong.  They have various theoretical problems too, to be sure, but history provides an easier means of undermining the primary intellectual engine for totalitarian globalism than comparatively esoteric economic theory.  Of course, the weakness of the free trade case is very easily seen in the way that they immediately retreat from their previous analogies and arguments as soon as their weaknesses are demonstrated.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-21T15:02:00+00:00"
}