{
  "url": "https://voxday.net/2011/01/13/phantom-income-real-bonuses/",
  "scraped_at": "2025-12-13T22:59:43.493043",
  "title": "Phantom income, real bonuses",
  "date_display": "January 13, 2011",
  "date_iso": "2011-01-13T14:15:00+00:00",
  "date_from_url": "2011-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You almost have to admire the insane insouciance of the bankers, who boldly <a href=\"http://blogs.forbes.com/robertlenzner/2011/01/12/us-banks-reporting-phantom-income-on-1-4-trillion-delinquent-mortgages/?boxes=Homepagechannels\">invent fake profits</a> in order to pay themselves gargantuan profit-shares as bonuses:</p><blockquote><p>The giant US banks have been bailed out again from huge potential writeoffs by loosey-goosey accounting accepted by the accounting profession and the regulators.  They are allowed to accrue interest on non-performing mortgages until the actual foreclosure takes place, which on average takes about 16 months.</p><p>All the phantom interest that is not actually collected is booked as income until the actual act of foreclosure. As a resullt, many bank financial statements actually look much better than they actually are. At foreclosure all the phantom income comes off the books of the banks.</p><p>This means that Bank of America, Citigroup, JP Morgan and Wells Fargo, among hundreds of other smaller institutions, can report interest due them, but not paid, on an estimated $1.4 trillion of face value mortgages on the 7 million homes that are in the process of being foreclosed.</p></blockquote><p>That does explain the slowdown in foreclosures rather nicely, doesn’t it.  This is amazing news and makes the Enron accounting look downright angelic in comparison.  It’s the equivalent of Intel booking income from the sales of millions of chips, then admitting 16 months later that it never actually sold anything.  And it would certainly be an incredible way to launch a startup and take it public, assuming you could get it done in 16 months.</p><p>I’ve been reading the most excellent <i>An Austrian Perspective on the History of Economic Thought</i>, specifically the chapter on the pre-Salamancan scholastics, and I have to admit that the medieval anti-usury arguments Rothbard criticizes are looking more and more reasonable in the light of the way modern banks have taken the core concepts of credit and interest that were originally derived from natural law and private property rights and turned them into a fraudulent and usurious monstrosity that completely defies reality, reason, and logic.</p><p>By the way, there will <i>definitely</i> be a future Voxiversity on Rothbard’s <i>History</i>.  It is approximately 61.8 times more interesting and informative than AGD was.</p></div>",
  "content_text": "You almost have to admire the insane insouciance of the bankers, who boldly\ninvent fake profits\nin order to pay themselves gargantuan profit-shares as bonuses:\nThe giant US banks have been bailed out again from huge potential writeoffs by loosey-goosey accounting accepted by the accounting profession and the regulators.  They are allowed to accrue interest on non-performing mortgages until the actual foreclosure takes place, which on average takes about 16 months.\nAll the phantom interest that is not actually collected is booked as income until the actual act of foreclosure. As a resullt, many bank financial statements actually look much better than they actually are. At foreclosure all the phantom income comes off the books of the banks.\nThis means that Bank of America, Citigroup, JP Morgan and Wells Fargo, among hundreds of other smaller institutions, can report interest due them, but not paid, on an estimated $1.4 trillion of face value mortgages on the 7 million homes that are in the process of being foreclosed.\nThat does explain the slowdown in foreclosures rather nicely, doesn’t it.  This is amazing news and makes the Enron accounting look downright angelic in comparison.  It’s the equivalent of Intel booking income from the sales of millions of chips, then admitting 16 months later that it never actually sold anything.  And it would certainly be an incredible way to launch a startup and take it public, assuming you could get it done in 16 months.\nI’ve been reading the most excellent\nAn Austrian Perspective on the History of Economic Thought\n, specifically the chapter on the pre-Salamancan scholastics, and I have to admit that the medieval anti-usury arguments Rothbard criticizes are looking more and more reasonable in the light of the way modern banks have taken the core concepts of credit and interest that were originally derived from natural law and private property rights and turned them into a fraudulent and usurious monstrosity that completely defies reality, reason, and logic.\nBy the way, there will\ndefinitely\nbe a future Voxiversity on Rothbard’s\nHistory\n.  It is approximately 61.8 times more interesting and informative than AGD was.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-13T14:15:00+00:00"
}