{
  "url": "https://voxday.net/2011/01/13/precision-in-biology/",
  "scraped_at": "2025-12-13T22:59:41.663897",
  "title": "Precision in biology",
  "date_display": "January 13, 2011",
  "date_iso": "2011-01-13T10:33:00+00:00",
  "date_from_url": "2011-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Only <a href=\"http://www.foxnews.com/scitech/2010/12/30/worlds-plant-life-far-diverse-previously-thought/\">a 67% error rate</a>.  Why is that so completely unsurprising?  I continue to find it remarkable that biologists insist on inserting their uneducated noses into other fields of study when they quite clearly have no idea what they’re doing <i>in their own scientific discipline</i>:</p><blockquote><p>The world’s plant life is far less diverse than previously thought, with a review of about one million named plants finding that only one third of them are unique.  The Royal Botanic Gardens at Kew, in southwestern London, has published “The Plant List” online Wednesday, updating a project conceived 130 years ago by the British naturalist Charles Darwin.</p><p>The list attempts to identify every plant known to science, and was begun in the 1880s with the help of a bequest from Darwin. The review found 300,000 unique species, and 480,000 synonyms for those species, meaning that many had been “discovered” and named several times by botanists.  Another 260,000 names were listed as “unresolved,” meaning that botanists have so far been unable to determine whether they are a separate species of a duplication of one of the 300,000.</p></blockquote><p>In the immortal words of Bill Belichick: “Do your job.”  And yes, in answer to a question from one previous commenter, the fact that biologists can’t even be relied upon to correctly define a “species” or reliably identify them does very much call into serious question their various theories regarding the origin of those species.  Or, you know, whatever they are.</p><p>“Well, we can’t tell you what it is, or even what “it” means, when we are examining what is right in front of us.  But we can tell you with complete and utter confidence exactly how, and from what, these things that we can’t define or identify were developed thousands of years ago.  And if you don’t believe us, <i>then you just don’t understand science</i>.”</p><p>Mmm-kay.  I have come to the conclusion that many, if not most, biologists not only don’t grasp basic logic, they are not terribly clear on the concept of <i>history</i> either.  Most people understand that if they said X yesterday and Y today, others will tend to find them less than perfectly credible and rather expect them to say Z tomorrow.  The biologist, on the other hand, insists that X is really Y if you just squint hard enough and denies that there could ever possibly be Not-Y, not infrequently prior to <i>Nature</i> publishing an article declaring that Y, formerly believed to be X, has now been replaced by Z… or amusingly, in some cases, a new variant of X.  And, as this botanical news yet again confirms, you don’t have to know what the variables are in order to recognize the dynamic pattern.</p><p>This was my favorite part: <i>“Despite the surprising lack of diversity among plant life, the botanists and scientists associated with the project all hailed it as a milestone achievement for many different reasons.”</i></p><p>Congratulations, you finally figured out just how wildly inept your colleagues have been for the last 130 years.  No doubt this very brief interregnum of inaccuracy will be rapidly and scientifically swept beneath the historical carpet.  In fact, the error rate is worse than reported two-thirds; they were only able to specifically identify 29 percent since 25 percent are still “unresolved”.  Now, no doubt this incident will tempt some intrepid devotee of Science Reason to resort to one of his favorite mantras: “science is self-correcting”.   But as JQP has pointed out, this touching religious claim notwithstanding, science is not “self-correcting” in any way, shape, or form.  Accountants also audit each other’s work and actually do so much more often than scientists attempt to replicate other scientists’ experiments… to the extent that scientists even do any experiments in the first place.  And yet we don’t consider accounting to be “self-correcting” simply because the books <i>may</i> be audited at some point in the future.  As for peer review, that is more commonly known as “editing” by the rest of the publishing world.  There is a word that best describes any field in which news reports regularly involve the words “than previously thought”.  That word is “unreliable”.</p><p>Even economists, whose imprecision borders on legendary at this point, usually manage to do better than this.  Can you imagine if the quarterly GDP revisions reported $14.4 trillion for Q4 2010, subsequently revised to $4.2 trillion?  (The scary thing is that’s not actually unthinkable if one considers the amount of credit supporting those numbers.)  Or if Bloomberg reported that the Dow dropped from 11,755 to 3,391.  The only reason biologists can get away with this astounding level of imprecision is that their butterfly collecting and theoretical fairy tales don’t have much material significance in the real world.</p></div>",
  "content_text": "Only\na 67% error rate\n.  Why is that so completely unsurprising?  I continue to find it remarkable that biologists insist on inserting their uneducated noses into other fields of study when they quite clearly have no idea what they’re doing\nin their own scientific discipline\n:\nThe world’s plant life is far less diverse than previously thought, with a review of about one million named plants finding that only one third of them are unique.  The Royal Botanic Gardens at Kew, in southwestern London, has published “The Plant List” online Wednesday, updating a project conceived 130 years ago by the British naturalist Charles Darwin.\nThe list attempts to identify every plant known to science, and was begun in the 1880s with the help of a bequest from Darwin. The review found 300,000 unique species, and 480,000 synonyms for those species, meaning that many had been “discovered” and named several times by botanists.  Another 260,000 names were listed as “unresolved,” meaning that botanists have so far been unable to determine whether they are a separate species of a duplication of one of the 300,000.\nIn the immortal words of Bill Belichick: “Do your job.”  And yes, in answer to a question from one previous commenter, the fact that biologists can’t even be relied upon to correctly define a “species” or reliably identify them does very much call into serious question their various theories regarding the origin of those species.  Or, you know, whatever they are.\n“Well, we can’t tell you what it is, or even what “it” means, when we are examining what is right in front of us.  But we can tell you with complete and utter confidence exactly how, and from what, these things that we can’t define or identify were developed thousands of years ago.  And if you don’t believe us,\nthen you just don’t understand science\n.”\nMmm-kay.  I have come to the conclusion that many, if not most, biologists not only don’t grasp basic logic, they are not terribly clear on the concept of\nhistory\neither.  Most people understand that if they said X yesterday and Y today, others will tend to find them less than perfectly credible and rather expect them to say Z tomorrow.  The biologist, on the other hand, insists that X is really Y if you just squint hard enough and denies that there could ever possibly be Not-Y, not infrequently prior to\nNature\npublishing an article declaring that Y, formerly believed to be X, has now been replaced by Z… or amusingly, in some cases, a new variant of X.  And, as this botanical news yet again confirms, you don’t have to know what the variables are in order to recognize the dynamic pattern.\nThis was my favorite part:\n“Despite the surprising lack of diversity among plant life, the botanists and scientists associated with the project all hailed it as a milestone achievement for many different reasons.”\nCongratulations, you finally figured out just how wildly inept your colleagues have been for the last 130 years.  No doubt this very brief interregnum of inaccuracy will be rapidly and scientifically swept beneath the historical carpet.  In fact, the error rate is worse than reported two-thirds; they were only able to specifically identify 29 percent since 25 percent are still “unresolved”.  Now, no doubt this incident will tempt some intrepid devotee of Science Reason to resort to one of his favorite mantras: “science is self-correcting”.   But as JQP has pointed out, this touching religious claim notwithstanding, science is not “self-correcting” in any way, shape, or form.  Accountants also audit each other’s work and actually do so much more often than scientists attempt to replicate other scientists’ experiments… to the extent that scientists even do any experiments in the first place.  And yet we don’t consider accounting to be “self-correcting” simply because the books\nmay\nbe audited at some point in the future.  As for peer review, that is more commonly known as “editing” by the rest of the publishing world.  There is a word that best describes any field in which news reports regularly involve the words “than previously thought”.  That word is “unreliable”.\nEven economists, whose imprecision borders on legendary at this point, usually manage to do better than this.  Can you imagine if the quarterly GDP revisions reported $14.4 trillion for Q4 2010, subsequently revised to $4.2 trillion?  (The scary thing is that’s not actually unthinkable if one considers the amount of credit supporting those numbers.)  Or if Bloomberg reported that the Dow dropped from 11,755 to 3,391.  The only reason biologists can get away with this astounding level of imprecision is that their butterfly collecting and theoretical fairy tales don’t have much material significance in the real world.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-13T10:33:00+00:00"
}