{
  "url": "https://voxday.net/2011/01/21/quixotic-defense/",
  "scraped_at": "2025-12-13T23:00:22.962101",
  "title": "A fascinating defense",
  "date_display": "January 21, 2011",
  "date_iso": "2011-01-21T18:14:00+00:00",
  "date_from_url": "2011-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ Myers makes a remarkable “<a href=\"http://scienceblogs.com/pharyngula/2011/01/i_get_email_74.php\">argument from inhuman sociopathy</a>” in defense of abortion:</p><blockquote><p>[T]he standard bullying tactics of waving bloody fetuses might cow the squeamish, but I’m a biologist. I’ve guillotined rats. I’ve held eyeballs in my hand and peeled them apart with a pair of scissors. I’ve used a wet-vac to clean up a lake of half-clotted blood from an exsanguinated dog. I’ve opened bodies and watched the intestines do their slow writhing dance, I’ve been elbow deep in blood, I’ve split open cats and stabbed them in the heart with a perfusion needle. I’ve extracted the brains of mice…with a pair of pliers. I’ve scooped brains out of buckets, I’ve counted dendrites in slices cut from the brains of dead babies.</p><p>You want to make me back down by trying to inspire revulsion with dead baby pictures? I look at them unflinchingly and see meat. And meat does not frighten me.</p></blockquote><p>It’s probably a good thing he is an atheist without any moral standards, otherwise he might demonstrate at least a modicum of conscience for the bloody acts in which he appears to take such pride.  And if he happened to take any sexual gratification from them as well, who can say it is wrong from his perspective, given his total lack of any moral or ethical code.  If he feels no revulsion at looking at the pictures of butchered babies, then he likely feels no revulsion and sees only meat when looking at pictures of dead Jews and murdered Ukrainians as well.  The awful thing is not that the pictures do not frighten him; they do not frighten me either.  The awful thing is that <i>he does not find them revolting</i> like any normal human being with even a minimal amount of empathy would.</p><p>This is the naked face of atheism, ladies and gentlemen.  Look on it well and remember it, because it usually doesn’t dare to show its disgusting and anti-human nature so openly.</p></div>",
  "content_text": "PZ Myers makes a remarkable “\nargument from inhuman sociopathy\n” in defense of abortion:\n[T]he standard bullying tactics of waving bloody fetuses might cow the squeamish, but I’m a biologist. I’ve guillotined rats. I’ve held eyeballs in my hand and peeled them apart with a pair of scissors. I’ve used a wet-vac to clean up a lake of half-clotted blood from an exsanguinated dog. I’ve opened bodies and watched the intestines do their slow writhing dance, I’ve been elbow deep in blood, I’ve split open cats and stabbed them in the heart with a perfusion needle. I’ve extracted the brains of mice…with a pair of pliers. I’ve scooped brains out of buckets, I’ve counted dendrites in slices cut from the brains of dead babies.\nYou want to make me back down by trying to inspire revulsion with dead baby pictures? I look at them unflinchingly and see meat. And meat does not frighten me.\nIt’s probably a good thing he is an atheist without any moral standards, otherwise he might demonstrate at least a modicum of conscience for the bloody acts in which he appears to take such pride.  And if he happened to take any sexual gratification from them as well, who can say it is wrong from his perspective, given his total lack of any moral or ethical code.  If he feels no revulsion at looking at the pictures of butchered babies, then he likely feels no revulsion and sees only meat when looking at pictures of dead Jews and murdered Ukrainians as well.  The awful thing is not that the pictures do not frighten him; they do not frighten me either.  The awful thing is that\nhe does not find them revolting\nlike any normal human being with even a minimal amount of empathy would.\nThis is the naked face of atheism, ladies and gentlemen.  Look on it well and remember it, because it usually doesn’t dare to show its disgusting and anti-human nature so openly.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-21T18:14:00+00:00"
}