{
  "url": "https://voxday.net/2011/01/01/religious-fitness-and-science-education/",
  "scraped_at": "2025-12-13T16:01:00.812749",
  "title": "Religious fitness and science education",
  "date_display": "January 1, 2011",
  "date_iso": "2011-01-01T14:52:00+00:00",
  "date_from_url": "2011-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ever since I started reading up on the present state of evolutionary theory a few years ago, I have found it rather remarkable to discover how resistant the TEpNS enthusiasts tend to be with regards to concluding what <a href=\"http://www.scientificamerican.com/blog/post.cfm?id=gods-little-rabbits-religious-peopl-2010-12-22\">this article in the Scientific American</a> points out is entirely obvious:</p><blockquote><p>Blume’s research also shows quite vividly that secular, nonreligious people are being dramatically out-reproduced by religious people of any faith. Across a broad swath of demographic data relating to religiosity, the godly are gaining traction in offspring produced. For example, there’s a global-level positive correlation between frequency of parental worship attendance and number of offspring. Those who “never” attend religious services bear, on a worldwide average, 1.67 children per lifetime; “once per month,” and the average goes up to 2.01 children; “more than once a week,” 2.5 children. Those numbers add up—and quickly. Some of the strongest data from Blume’s analyses, however, come from a Swiss Statistic Office poll conducted in the year 2000. These data are especially valuable because nearly the entire Swiss population answered this questionnaire—6,972,244 individuals, amounting to 95.67% of the population—which included a question about religious denomination.</p><p><i>“The results are highly significant,”</i> writes Blume: <i>“… women among all denominational categories give birth to far more children than the non-affiliated. And this remains true even among those (Jewish and Christian) communities who combine nearly double as much births with higher percentages of academics and higher income classes as their non-affiliated Swiss contemporaries.”</i></p><p>In other words, it’s not just that “educated” or “upper class” people have fewer children and tend also to be less religious, but even when you control for such things statistically, religiosity independently predicts number of offspring born to mothers.</p></blockquote><p>The spandrel explanation for religion has always looked like little more than willful blindness combined with wishful thinking on the part of anti-theists.  In the same way that most atheists are reluctant to admit the unavoidably nihilistic conclusion to their material reductionism, (hence the “irrational atheist” appellation), many irreligious evolutionists so dislike religion that they will concoct any number of far-fetched hypotheses to avoid concluding that even from their own godless perspective, religion has great utility and provides a reproductive advantage.  As anecdotal evidence, the 12 or so couples who made up our old Bible study in Minnesota and who were all just beginning to have their first children now have between three and six non-adopted children per couple.  The average is probably around 3.8; even with the Christmas cards I can never keep them all straight.</p><p>But then, as I have repeatedly pointed out, scientists tend to be much worse than one would expect them to be at correctly applying logic.  Although I suppose they really should not be expected to do it well; after all, the entire <i>raison d’etre</i> of the proper scientific method is to avoid relying upon logic in favor of reaching conclusions that are based firmly upon experimentation and observation, confirmed by replication.  The problem, of course, is that logic is still required with regards to interpreting the significance of the conclusions provided by the scientific method and I have observed that very few scientists, if any, appear to have received any training in logic as part of their professional education.</p><p>Now, please feel free to correct me with actual curriculum-related facts if I am wrong about my conclusions here, but based on the many arguments I have seen put forth on various subjects from numerous individuals holding science-related PhDs, I very much doubt that many science majors devote any time to learning either history or logic.  A look at the M.I.T. Department of Biology’s <a href=\"http://web.mit.edu/biology/www/graduate/courselist.html\">graduate </a> and <a href=\"http://web.mit.edu/catalog/degre.scien.ch7.html\">undergraduate</a> programs shows no sign of requiring either beyond the standard Humanities, Arts, and Social Sciences Requirement for all undergraduate majors.  While it is entirely possible that MIT science majors are choosing to study history or philosophy as part of their grand total of eight (8!) elective courses, they could just as easily be taking courses in Comparative Media Studies or Theater Arts.  And given the astonishing inability of science majors to anticipate the supply and demand curves for PhDs in their chosen fields, one is forced to conclude that very few of them elect to study economics.</p><p>What this suggests is that scientists, on average, are at least as ignorant of history, economics, philosophy, religion, and logic as they believe non-scientists to be of science, and for precisely the same reason.  Therefore, barring any convincing individual demonstration to the contrary, their opinions outside their professional discipline are ignorant and should be taken no more seriously than they believe the opinions of non-scientists are to be regarded within their field.</p></div>",
  "content_text": "Ever since I started reading up on the present state of evolutionary theory a few years ago, I have found it rather remarkable to discover how resistant the TEpNS enthusiasts tend to be with regards to concluding what\nthis article in the Scientific American\npoints out is entirely obvious:\nBlume’s research also shows quite vividly that secular, nonreligious people are being dramatically out-reproduced by religious people of any faith. Across a broad swath of demographic data relating to religiosity, the godly are gaining traction in offspring produced. For example, there’s a global-level positive correlation between frequency of parental worship attendance and number of offspring. Those who “never” attend religious services bear, on a worldwide average, 1.67 children per lifetime; “once per month,” and the average goes up to 2.01 children; “more than once a week,” 2.5 children. Those numbers add up—and quickly. Some of the strongest data from Blume’s analyses, however, come from a Swiss Statistic Office poll conducted in the year 2000. These data are especially valuable because nearly the entire Swiss population answered this questionnaire—6,972,244 individuals, amounting to 95.67% of the population—which included a question about religious denomination.\n“The results are highly significant,”\nwrites Blume:\n“… women among all denominational categories give birth to far more children than the non-affiliated. And this remains true even among those (Jewish and Christian) communities who combine nearly double as much births with higher percentages of academics and higher income classes as their non-affiliated Swiss contemporaries.”\nIn other words, it’s not just that “educated” or “upper class” people have fewer children and tend also to be less religious, but even when you control for such things statistically, religiosity independently predicts number of offspring born to mothers.\nThe spandrel explanation for religion has always looked like little more than willful blindness combined with wishful thinking on the part of anti-theists.  In the same way that most atheists are reluctant to admit the unavoidably nihilistic conclusion to their material reductionism, (hence the “irrational atheist” appellation), many irreligious evolutionists so dislike religion that they will concoct any number of far-fetched hypotheses to avoid concluding that even from their own godless perspective, religion has great utility and provides a reproductive advantage.  As anecdotal evidence, the 12 or so couples who made up our old Bible study in Minnesota and who were all just beginning to have their first children now have between three and six non-adopted children per couple.  The average is probably around 3.8; even with the Christmas cards I can never keep them all straight.\nBut then, as I have repeatedly pointed out, scientists tend to be much worse than one would expect them to be at correctly applying logic.  Although I suppose they really should not be expected to do it well; after all, the entire\nraison d’etre\nof the proper scientific method is to avoid relying upon logic in favor of reaching conclusions that are based firmly upon experimentation and observation, confirmed by replication.  The problem, of course, is that logic is still required with regards to interpreting the significance of the conclusions provided by the scientific method and I have observed that very few scientists, if any, appear to have received any training in logic as part of their professional education.\nNow, please feel free to correct me with actual curriculum-related facts if I am wrong about my conclusions here, but based on the many arguments I have seen put forth on various subjects from numerous individuals holding science-related PhDs, I very much doubt that many science majors devote any time to learning either history or logic.  A look at the M.I.T. Department of Biology’s\ngraduate\nand\nundergraduate\nprograms shows no sign of requiring either beyond the standard Humanities, Arts, and Social Sciences Requirement for all undergraduate majors.  While it is entirely possible that MIT science majors are choosing to study history or philosophy as part of their grand total of eight (8!) elective courses, they could just as easily be taking courses in Comparative Media Studies or Theater Arts.  And given the astonishing inability of science majors to anticipate the supply and demand curves for PhDs in their chosen fields, one is forced to conclude that very few of them elect to study economics.\nWhat this suggests is that scientists, on average, are at least as ignorant of history, economics, philosophy, religion, and logic as they believe non-scientists to be of science, and for precisely the same reason.  Therefore, barring any convincing individual demonstration to the contrary, their opinions outside their professional discipline are ignorant and should be taken no more seriously than they believe the opinions of non-scientists are to be regarded within their field.",
  "tags": [
    "religion",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-01T14:52:00+00:00"
}