{
  "url": "https://voxday.net/2011/01/19/roissy-reviews-movie/",
  "scraped_at": "2025-12-13T23:00:11.303657",
  "title": "Roissy reviews a movie",
  "date_display": "January 19, 2011",
  "date_iso": "2011-01-19T12:36:00+00:00",
  "date_from_url": "2011-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s certainly <a href=\"http://roissy.wordpress.com/2011/01/18/beta-valentine/\">an unusual take</a> on the usual reviewer’s formula.  And significantly more insightful:</p><blockquote><p>Blue Valentine is an exploration of a modern marriage in the process of disintegrating, told via alternating scenes between the couple’s sordid present and their romantically heady past of five or six years ago. The flashback scenes aren’t labeled as such; the viewer knows they are flashbacks by the youthful hairline of Ryan Gosling’s character, Dean, and by the fact that there’s no kid around. The effect of the flashbacks is like a prolonged near-death experience, where the characters’ dying relationship is punctuated by gauzy vignettes of happier times.</p><p>Although the theater was filled with SWPL women probably on a bender from Glee house parties, don’t mistake this film for a chick flic. There’s too much truth told in the portrayal of a relationship hitting the skids for this to be anything resembling the typical sappy romance movie. For one, there’s no happy ending. Women’s faces after a manipulative cheese-fest chick flic show the telltale signs of throat-lumped weepiness: the glisten of fresh tears on cheeks. But the crowd of women filing out of the theater after Blue Valentine had only the vacant-eyed look of a shellshocked soldier who has just seen his buddy catch shrapnel. Or, in this case, catch a little too much reality.</p><p>Quite simply, there hasn’t been a movie in our lifetimes which depicts the fall of a man from charming nascent alpha to inept needy beta, and the loathing that this engenders in his lover, better than Blue Valentine.</p></blockquote><p>There are apparently “spoilers” in the review, although since I assume most of the readers of this blog are about as likely to see Blue Valentine as I am to win the Powerball lottery, (never having purchased a lottery ticket in my life), there is no reason not to read it.  And it’s interesting to learn that Hollywood, in at least this one instance, has abandoned the Disney Snowflake formula in favor of a more realistic Game-like perspective.</p><p>One uncomfortable observation that men would do well to accept is that even with the best will in the world, when a man makes a habit of automatically deferring to a woman’s wishes, it tends to cause her to develop contempt for him.  It’s simply how they are wired; it can be astonishing to see how quickly a woman develops a prickly queen bee attitude towards others as soon as she has her social status upgraded for one reason or another.  Also, because women are dynamic, (which is admittedly part of their charm), they can’t necessarily articulate what they happen to want at any given moment, so the gamma’s plea of “tell me what you want and I’ll do it” not only sounds craven and off-putting to them, it’s not even relevant.  The correct thing is to simply do whatever it is that you do and understand that a woman will be with you as long as she chooses, all promises and vows notwithstanding.</p><p>Men should pay very little attention to what a woman says.  That’s just a snapshot of her emotional state at the moment, which, for good or for ill, is guaranteed to change.  In the end, it is only what she has done in the past that is informative and what she decides to do now and in the future that matters.  And if she doesn’t want to be with you, why would you want her to stick around anyhow?  There are literally <i>three billion</i> other members of the opposite sex out there, after all, and the chances are pretty high that at least one of them will appreciate you considerably more than a woman who has gradually come to dislike or even loathe you.</p></div>",
  "content_text": "It’s certainly\nan unusual take\non the usual reviewer’s formula.  And significantly more insightful:\nBlue Valentine is an exploration of a modern marriage in the process of disintegrating, told via alternating scenes between the couple’s sordid present and their romantically heady past of five or six years ago. The flashback scenes aren’t labeled as such; the viewer knows they are flashbacks by the youthful hairline of Ryan Gosling’s character, Dean, and by the fact that there’s no kid around. The effect of the flashbacks is like a prolonged near-death experience, where the characters’ dying relationship is punctuated by gauzy vignettes of happier times.\nAlthough the theater was filled with SWPL women probably on a bender from Glee house parties, don’t mistake this film for a chick flic. There’s too much truth told in the portrayal of a relationship hitting the skids for this to be anything resembling the typical sappy romance movie. For one, there’s no happy ending. Women’s faces after a manipulative cheese-fest chick flic show the telltale signs of throat-lumped weepiness: the glisten of fresh tears on cheeks. But the crowd of women filing out of the theater after Blue Valentine had only the vacant-eyed look of a shellshocked soldier who has just seen his buddy catch shrapnel. Or, in this case, catch a little too much reality.\nQuite simply, there hasn’t been a movie in our lifetimes which depicts the fall of a man from charming nascent alpha to inept needy beta, and the loathing that this engenders in his lover, better than Blue Valentine.\nThere are apparently “spoilers” in the review, although since I assume most of the readers of this blog are about as likely to see Blue Valentine as I am to win the Powerball lottery, (never having purchased a lottery ticket in my life), there is no reason not to read it.  And it’s interesting to learn that Hollywood, in at least this one instance, has abandoned the Disney Snowflake formula in favor of a more realistic Game-like perspective.\nOne uncomfortable observation that men would do well to accept is that even with the best will in the world, when a man makes a habit of automatically deferring to a woman’s wishes, it tends to cause her to develop contempt for him.  It’s simply how they are wired; it can be astonishing to see how quickly a woman develops a prickly queen bee attitude towards others as soon as she has her social status upgraded for one reason or another.  Also, because women are dynamic, (which is admittedly part of their charm), they can’t necessarily articulate what they happen to want at any given moment, so the gamma’s plea of “tell me what you want and I’ll do it” not only sounds craven and off-putting to them, it’s not even relevant.  The correct thing is to simply do whatever it is that you do and understand that a woman will be with you as long as she chooses, all promises and vows notwithstanding.\nMen should pay very little attention to what a woman says.  That’s just a snapshot of her emotional state at the moment, which, for good or for ill, is guaranteed to change.  In the end, it is only what she has done in the past that is informative and what she decides to do now and in the future that matters.  And if she doesn’t want to be with you, why would you want her to stick around anyhow?  There are literally\nthree billion\nother members of the opposite sex out there, after all, and the chances are pretty high that at least one of them will appreciate you considerably more than a woman who has gradually come to dislike or even loathe you.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-19T12:36:00+00:00"
}