{
  "url": "https://voxday.net/2011/01/07/science-of-cuckoldry/",
  "scraped_at": "2025-12-13T22:59:11.604116",
  "title": "The science of cuckoldry",
  "date_display": "January 7, 2011",
  "date_iso": "2011-01-07T20:26:00+00:00",
  "date_from_url": "2011-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe class=\"youtube-player\" frameborder=\"0\" height=\"390\" src=\"http://www.youtube.com/embed/G43Grbgupds\" title=\"YouTube video player\" type=\"text/html\" width=\"640\"></iframe><br> I don’t mean to suggest that women are not biologically programmed to be ruthlessly deceptive cheating machines who only manage to surmount their programming by rigid self-control, religious dedication, or cliterectomies and the threat of stoning, but I think the scientistry on display in this video is less than entirely convincing.  Seriously, what can reasonably be concluded from a woman who is self-consciously attempting to gyrate in front of a blue screen and an elderly German scientist armed with a camera?  And there is a serious self-selection bias as well, given that the great majority of women who were not choosing to go out on the town were excluded from it.  It hardly seems surprising that attached women who go out clubbing sans mate are more inclined to cheat than the average single woman… no doubt science will next tell us that recently divorced women are more readily available than the norm too.</br></p><p>Anyhow, it would be a rather more informative metric to combine the skin display percentage with observations of which women a) got physical with someone in public and b) left the club with a man rather than their friends.  The observed connection between skin display and ovulation/attachment is potentially significant, but it’s incorrect to assume that skin display is necessarily tantamount to an increased interest in sex.</p><p>Perhaps it is a sign of the science fetish that pervades modern society, but the thing that too many men and women alike tend to forget is that <i>we are not at the mercy of our biology</i>.  It can be a powerful influence, yes, of course.  But the more we intellectually understand these various biomechanical influences, the more we can reduce their ability to dictate our behavior.  Or, alternatively, make use of them to manipulate other people.</p><p>Courtesy: Biology Department, <a href=\"http://roissy.wordpress.com/2011/01/07/is-your-girlfriend-ovulating-watch-out/\">The Chateau</a></p></div>",
  "content_text": "I don’t mean to suggest that women are not biologically programmed to be ruthlessly deceptive cheating machines who only manage to surmount their programming by rigid self-control, religious dedication, or cliterectomies and the threat of stoning, but I think the scientistry on display in this video is less than entirely convincing.  Seriously, what can reasonably be concluded from a woman who is self-consciously attempting to gyrate in front of a blue screen and an elderly German scientist armed with a camera?  And there is a serious self-selection bias as well, given that the great majority of women who were not choosing to go out on the town were excluded from it.  It hardly seems surprising that attached women who go out clubbing sans mate are more inclined to cheat than the average single woman… no doubt science will next tell us that recently divorced women are more readily available than the norm too.\nAnyhow, it would be a rather more informative metric to combine the skin display percentage with observations of which women a) got physical with someone in public and b) left the club with a man rather than their friends.  The observed connection between skin display and ovulation/attachment is potentially significant, but it’s incorrect to assume that skin display is necessarily tantamount to an increased interest in sex.\nPerhaps it is a sign of the science fetish that pervades modern society, but the thing that too many men and women alike tend to forget is that\nwe are not at the mercy of our biology\n.  It can be a powerful influence, yes, of course.  But the more we intellectually understand these various biomechanical influences, the more we can reduce their ability to dictate our behavior.  Or, alternatively, make use of them to manipulate other people.\nCourtesy: Biology Department,\nThe Chateau",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-07T20:26:00+00:00"
}