{
  "url": "https://voxday.net/2011/01/12/science-reason-in-action/",
  "scraped_at": "2025-12-13T22:59:36.198223",
  "title": "Science Reason in action",
  "date_display": "January 12, 2011",
  "date_iso": "2011-01-12T15:00:00+00:00",
  "date_from_url": "2011-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Telic Thoughts presents <a href=\"http://telicthoughts.com/pz-myers-a-case-study/\">an amusing chronicle of PZ Myers</a> and his response to the Arizona shooting:</p><blockquote><p>Upon hearing that a democratic congresswoman had been shot, the scientist PZ Myers immediately discards science to make this rather unscientific hypothesis about a man who’s name he didn’t even know yet.</p><p><i>“I’ll take a wild guess here. The scumbag who committed this crime has been caught; I’ll bet he’ll turn out to be a Teabagger who listens to a lot of AM talk radio.”</i></p><p>PZ’s only evidence comes in the form of a Palin campaign poster featuring a map of targeted campaign races with “targets” over the congressional districts that were targeted.  Then facts start to come in. The shooter had exhibited disturbed behavior. The shooter was an atheist. The shooter read Marx, Hitler, and Rand. Rambling nonsensical web screeds?</p><p>PZ responds to the evidence with more emotional, partisan non-science:</p><p><i>“What I see are people who are far too quick to dismiss the right-wing hate speech as a causal factor. Yes, this shooter was a lunatic; that doesn’t mean he wasn’t hearing the drumbeats from the right.”</i></p><p>More evidence comes in fast. Former acquaintances and friends call him a liberal activist. Radical. An atheist. A 9/11 truther. A pothead.</p><p>PZ doubles down.</p></blockquote><p>Now, there is certainly nothing wrong in making guesses about why something happened.  And those guesses are bound to reflect our biases in one way or another.  But it is interesting to compare the irrational reactions of left-wingers like Myers and Paul Krugman, who have clung to their immediate and biased suppositions rather than abandoning them in the face of the documentary and testimonial evidence, with a more rational albeit equally incorrect reaction.</p><p>The left-wing supposition was based, as Telic Thoughts notes, on pure personal prejudice.  There simply wasn’t any reasonable justification for the conclusion.  There haven’t been <i>any</i> shootings by members of the Tea Party and or many shootings inspired by talk radio; the example that has been cited on various sites is a <i>fictional</i> one from a movie called <i>The Fisher King</i>.</p><p>Now, my initial suppositions were also incorrect.  My very first thought when I heard about it was that the shooting was probably immigration-related because Arizona has been such a national hotspot on that issue.  I didn’t know if it was more likely to be someone who was pro-immigration or anti-immigration because I didn’t know the congresswoman’s position on the matter.  I initially assumed the shooter was an anti-immigrationist since Giffords is a Democrat and most Democrats are supporters of unlimited third world immigration.  But I looked up her record, discovered the woman was considered to be somewhat of a restrictionist on the issue, and therefore concluded incorrectly that the shooter was likely to be some sort of La Raza fanatic disappointed by the failure of the DREAM act.</p><p><i>“[T]his could be the result of a personal issue, for all we know right now….  I would guess that it’s a Hispanic college student who is an illegal alien and has lived in the USA all his life. I can’t imagine it was anyone even loosely associated with the Tea Party in any way since they tend to be more focused on Washington players. It’s probably not a pro-lifer either, since they would be more interested in targeting abortion doctors than politicians.</i>“</p><p>When one takes a logical approach to observing and interpreting the world’s events, one is forced to consider all the various possibilities regardless of one’s biases.  Hence my consideration of the various possibilities that the shooter might have been an anti-immigrationist, a Tea Partier, or a pro-lifer.  (I never considered the gold standard or anti-federalism to be even remote possibilities since the shooter might as reasonably have targeted a Cardinals cheerleader as a congresswoman if one of those issues happened to be his motivation.)   And while my conclusions could certainly have been skewed by my own biases, at least there was a coherent and logical basis unrelated to them for reaching it.  This also meant I had no vested interest in clinging to my initial surmise.  So, once it became obvious that the shooter was not a Hispanic, but a young white male who was not a military veteran, I correctly concluded that the shooter was an atheist with personal problems.  “Schizoid atheist” was the term I used.  The schizophrenia hasn’t been confirmed yet, but the atheism has.  Again, I did not reach that conclusion because of my personal biases, but because it fit the model of numerous recent shootings by other young white men around the world.</p><p>Myers, on the other hand, believed as he did only because he very much wanted to believe it.  His initial conclusion was based on absolutely zero evidence, and he has continued to stick with it in the face of all the available evidence.  As one of his commenters correctly pointed out, there is no indication that the shooter had any knowledge of the Palin “crosshairs” map that has the hysterical Left in full point-and-shriek mode.  What passes for Myers’s reasoning in this incident goes a long way towards explaining the central basis of his criticism of religious beliefs; he is quite clearly <i>projecting</i> his own habit of belief for belief’s sake upon those who possess them.  Moreover, it is amusing to note how his inability to adjust his thinking on the basis of the evidence is consistent with the inflated importance he ascribes to scientific evidence; because he has to reject the validity of documentary and testimonial evidence in order to justify his belief in the non-existence of God, he cannot permit himself to be swayed by those forms of evidence with regards to matters he considers less important.  And so, the truth of what was written nearly 2,000 years ago is made evident.</p><p><i>“For what can be known about God is plain to them, because God has shown it to them. For his invisible attributes, namely, his eternal power and divine nature, have been clearly perceived, ever since the creation of the world, in the things that have been made. So they are without excuse.  For although they knew God, they did not honor him as God or give thanks to him, but they became futile in their thinking, and their foolish hearts were darkened.</i></p><p>Claiming to be wise, they became fools…”</p><p>It is particularly amusing to see the ready willingness of a self-proclaimed skeptic who disdains documentary evidence <a href=\"http://scienceblogs.com/pharyngula/2011/01/another_datum_for_our_armchair.php\">to fall for a forged document</a>.  And this comment by Lou Cypher related to the forgery nicely underlines the aforementioned Pharyngulan predilection for projection.</p><p><i>“It doesn’t matter what the facts are, if the teabaggers repeat a lie frequently enough it evidently magically stops being a lie in the eyes of the public, so once they decide to posthumously change his party affiliation to ‘D’ that’s basically the end of the discussion right there.”</i></p><p>How I love the smell of irony in the morning….</p><p>UPDATE: And <a href=\"http://www.mediabistro.com/tvnewser/jared-loughners-friend-says-suspect-did-not-watch-tv-disliked-the-news_b48040\">there goes the remnant</a> of PZ’s “right wing talk radio incitement” meme. <i>“He did not watch TV. He disliked the news. He didn’t listen to political radio.”</i></p><p>Does anyone doubt that this won’t slow any of the brainless Lefties from continuing to argue that even if right-wing discourse didn’t have anything to do with this incident, <i>it might next time.</i></p></div>",
  "content_text": "Telic Thoughts presents\nan amusing chronicle of PZ Myers\nand his response to the Arizona shooting:\nUpon hearing that a democratic congresswoman had been shot, the scientist PZ Myers immediately discards science to make this rather unscientific hypothesis about a man who’s name he didn’t even know yet.\n“I’ll take a wild guess here. The scumbag who committed this crime has been caught; I’ll bet he’ll turn out to be a Teabagger who listens to a lot of AM talk radio.”\nPZ’s only evidence comes in the form of a Palin campaign poster featuring a map of targeted campaign races with “targets” over the congressional districts that were targeted.  Then facts start to come in. The shooter had exhibited disturbed behavior. The shooter was an atheist. The shooter read Marx, Hitler, and Rand. Rambling nonsensical web screeds?\nPZ responds to the evidence with more emotional, partisan non-science:\n“What I see are people who are far too quick to dismiss the right-wing hate speech as a causal factor. Yes, this shooter was a lunatic; that doesn’t mean he wasn’t hearing the drumbeats from the right.”\nMore evidence comes in fast. Former acquaintances and friends call him a liberal activist. Radical. An atheist. A 9/11 truther. A pothead.\nPZ doubles down.\nNow, there is certainly nothing wrong in making guesses about why something happened.  And those guesses are bound to reflect our biases in one way or another.  But it is interesting to compare the irrational reactions of left-wingers like Myers and Paul Krugman, who have clung to their immediate and biased suppositions rather than abandoning them in the face of the documentary and testimonial evidence, with a more rational albeit equally incorrect reaction.\nThe left-wing supposition was based, as Telic Thoughts notes, on pure personal prejudice.  There simply wasn’t any reasonable justification for the conclusion.  There haven’t been\nany\nshootings by members of the Tea Party and or many shootings inspired by talk radio; the example that has been cited on various sites is a\nfictional\none from a movie called\nThe Fisher King\n.\nNow, my initial suppositions were also incorrect.  My very first thought when I heard about it was that the shooting was probably immigration-related because Arizona has been such a national hotspot on that issue.  I didn’t know if it was more likely to be someone who was pro-immigration or anti-immigration because I didn’t know the congresswoman’s position on the matter.  I initially assumed the shooter was an anti-immigrationist since Giffords is a Democrat and most Democrats are supporters of unlimited third world immigration.  But I looked up her record, discovered the woman was considered to be somewhat of a restrictionist on the issue, and therefore concluded incorrectly that the shooter was likely to be some sort of La Raza fanatic disappointed by the failure of the DREAM act.\n“[T]his could be the result of a personal issue, for all we know right now….  I would guess that it’s a Hispanic college student who is an illegal alien and has lived in the USA all his life. I can’t imagine it was anyone even loosely associated with the Tea Party in any way since they tend to be more focused on Washington players. It’s probably not a pro-lifer either, since they would be more interested in targeting abortion doctors than politicians.\n“\nWhen one takes a logical approach to observing and interpreting the world’s events, one is forced to consider all the various possibilities regardless of one’s biases.  Hence my consideration of the various possibilities that the shooter might have been an anti-immigrationist, a Tea Partier, or a pro-lifer.  (I never considered the gold standard or anti-federalism to be even remote possibilities since the shooter might as reasonably have targeted a Cardinals cheerleader as a congresswoman if one of those issues happened to be his motivation.)   And while my conclusions could certainly have been skewed by my own biases, at least there was a coherent and logical basis unrelated to them for reaching it.  This also meant I had no vested interest in clinging to my initial surmise.  So, once it became obvious that the shooter was not a Hispanic, but a young white male who was not a military veteran, I correctly concluded that the shooter was an atheist with personal problems.  “Schizoid atheist” was the term I used.  The schizophrenia hasn’t been confirmed yet, but the atheism has.  Again, I did not reach that conclusion because of my personal biases, but because it fit the model of numerous recent shootings by other young white men around the world.\nMyers, on the other hand, believed as he did only because he very much wanted to believe it.  His initial conclusion was based on absolutely zero evidence, and he has continued to stick with it in the face of all the available evidence.  As one of his commenters correctly pointed out, there is no indication that the shooter had any knowledge of the Palin “crosshairs” map that has the hysterical Left in full point-and-shriek mode.  What passes for Myers’s reasoning in this incident goes a long way towards explaining the central basis of his criticism of religious beliefs; he is quite clearly\nprojecting\nhis own habit of belief for belief’s sake upon those who possess them.  Moreover, it is amusing to note how his inability to adjust his thinking on the basis of the evidence is consistent with the inflated importance he ascribes to scientific evidence; because he has to reject the validity of documentary and testimonial evidence in order to justify his belief in the non-existence of God, he cannot permit himself to be swayed by those forms of evidence with regards to matters he considers less important.  And so, the truth of what was written nearly 2,000 years ago is made evident.\n“For what can be known about God is plain to them, because God has shown it to them. For his invisible attributes, namely, his eternal power and divine nature, have been clearly perceived, ever since the creation of the world, in the things that have been made. So they are without excuse.  For although they knew God, they did not honor him as God or give thanks to him, but they became futile in their thinking, and their foolish hearts were darkened.\nClaiming to be wise, they became fools…”\nIt is particularly amusing to see the ready willingness of a self-proclaimed skeptic who disdains documentary evidence\nto fall for a forged document\n.  And this comment by Lou Cypher related to the forgery nicely underlines the aforementioned Pharyngulan predilection for projection.\n“It doesn’t matter what the facts are, if the teabaggers repeat a lie frequently enough it evidently magically stops being a lie in the eyes of the public, so once they decide to posthumously change his party affiliation to ‘D’ that’s basically the end of the discussion right there.”\nHow I love the smell of irony in the morning….\nUPDATE: And\nthere goes the remnant\nof PZ’s “right wing talk radio incitement” meme.\n“He did not watch TV. He disliked the news. He didn’t listen to political radio.”\nDoes anyone doubt that this won’t slow any of the brainless Lefties from continuing to argue that even if right-wing discourse didn’t have anything to do with this incident,\nit might next time.",
  "tags": [
    "atheism",
    "Science Reason"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-12T15:00:00+00:00"
}