{
  "url": "https://voxday.net/2011/01/13/science-champion-wanted/",
  "scraped_at": "2025-12-13T22:59:49.024625",
  "title": "Science champion wanted",
  "date_display": "January 13, 2011",
  "date_iso": "2011-01-13T21:23:00+00:00",
  "date_from_url": "2011-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve gotten a few emails from people relating to science, so I think it would be beneficial to hash this out in public.  I propose a Socratic dialogue to examine the following question: <i>Is science self-correcting?</i></p><p>Whoever is nominated the <s>Official Champion of</s>Speaker for Science should at least be an enthusiastic believer in the scientific method, although an actual scientist would be preferred.  Don’t forget to inform everyone of your credentials, as I’m told they’re very important!  Now, this isn’t intended to be a debate per se, because I am not defending a position and I have nothing against the idea of science being self-correcting.  If the matter is as obvious as my various emailers believe it to be, it should be no problem to successfully answer my simple and straightforward questions in a manner that will prove illuminating to everyone.</p><p>So, feel free to throw your name in the hat if you’re interested in educating me and everyone else can discuss who they believe would provide the strongest and most credible champion of science here.</p><p>UPDATE: We have several volunteers, two of whom stand out in particular.  Matt is a Scienceblogger and PhD candidate for a degree in Physics, while 445supermag is a Senior Research Scientist with 15 published papers ranging from biophysics to quantum chemistry.  Matt has suggested that the dialogue include both of them, seeing as they represent different disciplines within science, and I tend to agree with him.  I think they will both make for excellent Speakers for Science, but feel free to share your opinon on the matter.</p></div>",
  "content_text": "I’ve gotten a few emails from people relating to science, so I think it would be beneficial to hash this out in public.  I propose a Socratic dialogue to examine the following question:\nIs science self-correcting?\nWhoever is nominated the\nOfficial Champion of\nSpeaker for Science should at least be an enthusiastic believer in the scientific method, although an actual scientist would be preferred.  Don’t forget to inform everyone of your credentials, as I’m told they’re very important!  Now, this isn’t intended to be a debate per se, because I am not defending a position and I have nothing against the idea of science being self-correcting.  If the matter is as obvious as my various emailers believe it to be, it should be no problem to successfully answer my simple and straightforward questions in a manner that will prove illuminating to everyone.\nSo, feel free to throw your name in the hat if you’re interested in educating me and everyone else can discuss who they believe would provide the strongest and most credible champion of science here.\nUPDATE: We have several volunteers, two of whom stand out in particular.  Matt is a Scienceblogger and PhD candidate for a degree in Physics, while 445supermag is a Senior Research Scientist with 15 published papers ranging from biophysics to quantum chemistry.  Matt has suggested that the dialogue include both of them, seeing as they represent different disciplines within science, and I tend to agree with him.  I think they will both make for excellent Speakers for Science, but feel free to share your opinon on the matter.",
  "tags": [
    "mailvox",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-13T21:23:00+00:00"
}