{
  "url": "https://voxday.net/2011/01/28/science-vs-feminist-propaganda/",
  "scraped_at": "2025-12-13T23:00:57.129526",
  "title": "Loads of time",
  "date_display": "January 28, 2011",
  "date_iso": "2011-01-28T12:30:00+00:00",
  "date_from_url": "2011-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You really have to wonder about the feminist claims to be “pro-woman” considering how readily they have fed false information to young women in <a href=\"http://www.dailymail.co.uk/health/article-1351237/Women-6-times-likely-suffer-fertility-problems-35-25.html\">what has proven to be a serious obstacle</a> to the long-term objectives of many of them:</p><blockquote><p>Doctors have issued a stark warning to couples not to leave it too late to try for a baby.  With more and more women pursuing careers, they and their partners are leaving parenthood to at least their late thirties.  But women aged 35 are six times more likely to have problems conceiving compared to those ten years younger, warns a major study from the Royal College of Obstetricians and Gynaecologists.</p><p>The report says older parents are making it harder for themselves to have children – and increasing the likelihood of serious medical complications for both mother and baby.  By the age of 40, a woman is more likely to have a miscarriage than give birth.</p></blockquote><p>In light of how drenched in feminist propaganda and false biological horologies most young women are today, it is probably necessary for more scientifically astute and family-friendly individuals to take the literal offensive when confronted with the mindless “I’m still young, I have plenty of time” mantra of the average college-educated woman.  The correct response is, “of course you do, darling, so long as you don’t mind having two miscarriages and a <s>retard</s>special needs child.”</p></div>",
  "content_text": "You really have to wonder about the feminist claims to be “pro-woman” considering how readily they have fed false information to young women in\nwhat has proven to be a serious obstacle\nto the long-term objectives of many of them:\nDoctors have issued a stark warning to couples not to leave it too late to try for a baby.  With more and more women pursuing careers, they and their partners are leaving parenthood to at least their late thirties.  But women aged 35 are six times more likely to have problems conceiving compared to those ten years younger, warns a major study from the Royal College of Obstetricians and Gynaecologists.\nThe report says older parents are making it harder for themselves to have children – and increasing the likelihood of serious medical complications for both mother and baby.  By the age of 40, a woman is more likely to have a miscarriage than give birth.\nIn light of how drenched in feminist propaganda and false biological horologies most young women are today, it is probably necessary for more scientifically astute and family-friendly individuals to take the literal offensive when confronted with the mindless “I’m still young, I have plenty of time” mantra of the average college-educated woman.  The correct response is, “of course you do, darling, so long as you don’t mind having two miscarriages and a\nretard\nspecial needs child.”",
  "tags": [
    "science",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-28T12:30:00+00:00"
}