{
  "url": "https://voxday.net/2011/01/13/source-of-evangelis/",
  "scraped_at": "2025-12-13T22:59:47.169860",
  "title": "The source of evangelism",
  "date_display": "January 13, 2011",
  "date_iso": "2011-01-13T21:15:00+00:00",
  "date_from_url": "2011-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christians are driven to evangelize out of duty or out of a sympathetic desire to prevent others from destruction.  Other religions proselytize for similar reasons.  But why do militant atheists evangelize so fervently?  I suspect one reason may be from an instinctive demographic fear:</p><blockquote><p>The World Values Survey, which covered 82 nations from 1981 to 2004, found that adults who attended religious services more than once a week had 2.5 children on average; while those who went once a month had two; and those who never attended had 1.67.  Prof Rowthorn wrote: “The more devout people are, the more children they are likely to have.”</p></blockquote><p>As Rowthorn notes, people do fall away from their childhood religions, although as I have shown in the past, this is also true of those with no childhood religion.  But the demographic disadvantage means that the atheist community has to keep all of their children within the godless fold and deconvert one out of every three religious children <i>just to keep pace</i> with the growth of the religious community.</p><p>No wonder their evangelical efforts are so feverish.  And no wonder their writings are so frequently tinged with despair, because their own children are converting to religion faster than religious children are converting out of it.</p></div>",
  "content_text": "Christians are driven to evangelize out of duty or out of a sympathetic desire to prevent others from destruction.  Other religions proselytize for similar reasons.  But why do militant atheists evangelize so fervently?  I suspect one reason may be from an instinctive demographic fear:\nThe World Values Survey, which covered 82 nations from 1981 to 2004, found that adults who attended religious services more than once a week had 2.5 children on average; while those who went once a month had two; and those who never attended had 1.67.  Prof Rowthorn wrote: “The more devout people are, the more children they are likely to have.”\nAs Rowthorn notes, people do fall away from their childhood religions, although as I have shown in the past, this is also true of those with no childhood religion.  But the demographic disadvantage means that the atheist community has to keep all of their children within the godless fold and deconvert one out of every three religious children\njust to keep pace\nwith the growth of the religious community.\nNo wonder their evangelical efforts are so feverish.  And no wonder their writings are so frequently tinged with despair, because their own children are converting to religion faster than religious children are converting out of it.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-13T21:15:00+00:00"
}