{
  "url": "https://voxday.net/2011/01/29/special-needs-mountain/",
  "scraped_at": "2025-12-13T23:00:58.943428",
  "title": "Special Needs Mountain",
  "date_display": "January 29, 2011",
  "date_iso": "2011-01-29T16:20:00+00:00",
  "date_from_url": "2011-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So I went skiing today.  And while I don’t completely object to the idea of putting helmets on little kids since they sometimes get going and don’t know how to stop, it is <i>astonishing</i> to see how many adults and teenagers wear them now.  It’s ridiculous.  I started skiing when I was three and I don’t recall seeing or even hearing of anyone ever impaling their skull on a tree branch.</p><p>And another thing.  Those short, fat skis that everyone uses nowadays.  It’s the Alpine equivalent of people walking around wearing clown shoes with suits.  They supposedly make it easier to ski, but when I tried them I found it far too irritating to have to keep my skis apart.  So, often I’m the only one on the mountain with what I consider to be proper skis.  I suppose I’d feel like a dinosaur if everyone else didn’t look like such retarded clowns.</p></div>",
  "content_text": "So I went skiing today.  And while I don’t completely object to the idea of putting helmets on little kids since they sometimes get going and don’t know how to stop, it is\nastonishing\nto see how many adults and teenagers wear them now.  It’s ridiculous.  I started skiing when I was three and I don’t recall seeing or even hearing of anyone ever impaling their skull on a tree branch.\nAnd another thing.  Those short, fat skis that everyone uses nowadays.  It’s the Alpine equivalent of people walking around wearing clown shoes with suits.  They supposedly make it easier to ski, but when I tried them I found it far too irritating to have to keep my skis apart.  So, often I’m the only one on the mountain with what I consider to be proper skis.  I suppose I’d feel like a dinosaur if everyone else didn’t look like such retarded clowns.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-29T16:20:00+00:00"
}