{
  "url": "https://voxday.net/2011/01/12/tale-of-two-bad-ideas/",
  "scraped_at": "2025-12-13T22:59:34.367132",
  "title": "A tale of two bad ideas",
  "date_display": "January 12, 2011",
  "date_iso": "2011-01-12T14:15:00+00:00",
  "date_from_url": "2011-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It occurs to me that American police would be wise to consider abandoning their police state mentality sooner rather than later.  Despite their ongoing militarization, the badge gang isn’t actually capable of enforcing the law or anything else upon the population.  They only look as if they are in control so long as the populace is largely law-abiding of its own free will. <a href=\"http://www.tribuneonline.org/commentary/20101123com7.html\">Consider the following anecdote</a> from just across the border:</p><blockquote><p>11/23/2010  CIUDAD JUAREZ — In the bloodstained chaos that is Mexico’s drug war raging on the doorstep of the United States, Erika Gandara, 28, is standing tall, and alone. As her town’s only police officer “I am the law,” she says….  “Yes, I am a police officer,” the fresh-faced Gandara, who might be mistaken for a high (secondary) school student in her purple hoodie if she were not packing an [A]R-15 rifle, told AFP in an interview in her sparsely furnished office.</p><p>“I am this town’s only cop. I am the law,” she said.</p><p>And she meant it.</p></blockquote><p>I remember reading that a few months ago and thinking that it was a classic example of female bravado, which rests entirely upon the false notion that a woman’s sex renders her untouchable.  Needless to say, I wasn’t terribly surprised <a href=\"http://www.nytimes.com/2011/01/12/world/americas/12mexico.html?hp\">to read this today</a>.</p><p><i>“Érika Gándara, 28, seemed to relish the role, posing with a semiautomatic rifle and talking openly about the importance of her new job.  “I am the only police in this town, the authority,” she told reporters.  Then, two days before Christmas, a group of armed men took her from her home, residents say, and she has not been seen since.”</i></p><p>I’m not sure which was more ill-conceived, Gandara’s brief career as a police chief or Pippa Bacca’s attempt to hitchhike across Turkey in a wedding dress.  Regardless, they appear to have come to the same end.  And speaking of ill-conceived notions, both the government and the police should keep in mind that it is not wise to aim into the abyss.</p></div>",
  "content_text": "It occurs to me that American police would be wise to consider abandoning their police state mentality sooner rather than later.  Despite their ongoing militarization, the badge gang isn’t actually capable of enforcing the law or anything else upon the population.  They only look as if they are in control so long as the populace is largely law-abiding of its own free will.\nConsider the following anecdote\nfrom just across the border:\n11/23/2010  CIUDAD JUAREZ — In the bloodstained chaos that is Mexico’s drug war raging on the doorstep of the United States, Erika Gandara, 28, is standing tall, and alone. As her town’s only police officer “I am the law,” she says….  “Yes, I am a police officer,” the fresh-faced Gandara, who might be mistaken for a high (secondary) school student in her purple hoodie if she were not packing an [A]R-15 rifle, told AFP in an interview in her sparsely furnished office.\n“I am this town’s only cop. I am the law,” she said.\nAnd she meant it.\nI remember reading that a few months ago and thinking that it was a classic example of female bravado, which rests entirely upon the false notion that a woman’s sex renders her untouchable.  Needless to say, I wasn’t terribly surprised\nto read this today\n.\n“Érika Gándara, 28, seemed to relish the role, posing with a semiautomatic rifle and talking openly about the importance of her new job.  “I am the only police in this town, the authority,” she told reporters.  Then, two days before Christmas, a group of armed men took her from her home, residents say, and she has not been seen since.”\nI’m not sure which was more ill-conceived, Gandara’s brief career as a police chief or Pippa Bacca’s attempt to hitchhike across Turkey in a wedding dress.  Regardless, they appear to have come to the same end.  And speaking of ill-conceived notions, both the government and the police should keep in mind that it is not wise to aim into the abyss.",
  "tags": [
    "NWA was right",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-12T14:15:00+00:00"
}