{
  "url": "https://voxday.net/2011/01/27/tech-roundup/",
  "scraped_at": "2025-12-13T23:00:49.294061",
  "title": "Tech update",
  "date_display": "January 27, 2011",
  "date_iso": "2011-01-27T11:17:00+00:00",
  "date_from_url": "2011-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Needless to say, I was much amused by <a href=\"http://www.appleinsider.com/articles/11/01/20/apples_next_magic_mouse_could_include_a_multi_touch_display.html\">this patent application</a> in light of all of the Macintossers initially dismissing the multibutton approach and declaring how stylistically horrific it is.  Clearly it is much better to imitate the multibutton approach, only to do so in a manner that forces one operate by sight instead of by touch and places the virtual buttons <i>directly under one’s palm</i>, if for no other reason than Apple has blessed the approach.</p><p>Speaking of comparing the effectiveness of different interface approaches, we’re going to be releasing the performance results of various mice soon and it looks to be a bit of a scandal.  We have compiled strong empirical evidence indicating that in between the switch from mechanical rollers to optical sensors and the advent of the the multibutton interface, there has been essentially no actual performance difference between so-called high performance gaming mice and cheap office mice.  Here is <a href=\"http://warmouse.com/branding/images/speedtest_4mice.png\">a comparison of four mice</a>, two of which have multibutton support and two of which do not.  The difference in performance between the two multibutton mice is the result of their different approaches to the interface; there is a reason, after all, that clumsy people are described as being “all thumbs”.  That comparison marks the fastest speeds recorded at 1920×1200 resolution, whereas <a href=\"http://warmouse.com/branding/images/speedtest_500.png\">the sustainable speeds that one can reasonably expect to maintain in consistent use are about 15% slower</a> on both the conventional and multibutton interfaces.</p><p>Finally, on the practical application side, there is <a href=\"http://www.youtube.com/watch?v=Bouc4ycuWtM\">a new video focused on Mozilla Firefox</a> and demonstrating how the default Firefox mode operates for those who might be interested.</p></div>",
  "content_text": "Needless to say, I was much amused by\nthis patent application\nin light of all of the Macintossers initially dismissing the multibutton approach and declaring how stylistically horrific it is.  Clearly it is much better to imitate the multibutton approach, only to do so in a manner that forces one operate by sight instead of by touch and places the virtual buttons\ndirectly under one’s palm\n, if for no other reason than Apple has blessed the approach.\nSpeaking of comparing the effectiveness of different interface approaches, we’re going to be releasing the performance results of various mice soon and it looks to be a bit of a scandal.  We have compiled strong empirical evidence indicating that in between the switch from mechanical rollers to optical sensors and the advent of the the multibutton interface, there has been essentially no actual performance difference between so-called high performance gaming mice and cheap office mice.  Here is\na comparison of four mice\n, two of which have multibutton support and two of which do not.  The difference in performance between the two multibutton mice is the result of their different approaches to the interface; there is a reason, after all, that clumsy people are described as being “all thumbs”.  That comparison marks the fastest speeds recorded at 1920×1200 resolution, whereas\nthe sustainable speeds that one can reasonably expect to maintain in consistent use are about 15% slower\non both the conventional and multibutton interfaces.\nFinally, on the practical application side, there is\na new video focused on Mozilla Firefox\nand demonstrating how the default Firefox mode operates for those who might be interested.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-27T11:17:00+00:00"
}