{
  "url": "https://voxday.net/2011/01/31/trust-not-in-republicans/",
  "scraped_at": "2025-12-13T23:01:10.068442",
  "title": "Trust not in Republicans",
  "date_display": "January 31, 2011",
  "date_iso": "2011-01-31T14:15:00+00:00",
  "date_from_url": "2011-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Note that <a href=\"http://news.cnet.com/8301-31921_3-20029393-281.html?tag=cnetRiver\">this the technological priority</a> of the so-called party of “small government”:</p><blockquote><p>The House Republicans’ first major technology initiative is about to be unveiled: a push to force Internet companies to keep track of what their users are doing.  A House panel chaired by Rep. F. James Sensenbrenner of Wisconsin is scheduled to hold a hearing tomorrow morning to discuss forcing Internet providers, and perhaps Web companies as well, to store records of their users’ activities for later review by police….  Tomorrow’s data retention hearing is juxtaposed against the recent trend to protect Internet users’ privacy by storing less data. Last month, the Federal Trade Commission called for “limited retention” of user data on privacy grounds, and in the last 24 hours, both Mozilla and Google have announced do-not-track technology.</p></blockquote><p>These jokers aren’t going to fix <i>anything</i>.  If they leave Ron Paul alone long enough to get some straight accounting out of the Fed, it will only be because the incompetence of the central bankers has put their corporatist gravy train in danger.  The division between Democrats and Republicans isn’t based upon ideology or big government vs small government, it is basically a battle between pro-government bureaucrats and pro-corporate bureaucrats.  And by “corporation”, I do not mean the small businesses that are a legal shell for the business activity of actual individuals, but the giant, government-created artificial entities that have taken on financial lives of their own.</p></div>",
  "content_text": "Note that\nthis the technological priority\nof the so-called party of “small government”:\nThe House Republicans’ first major technology initiative is about to be unveiled: a push to force Internet companies to keep track of what their users are doing.  A House panel chaired by Rep. F. James Sensenbrenner of Wisconsin is scheduled to hold a hearing tomorrow morning to discuss forcing Internet providers, and perhaps Web companies as well, to store records of their users’ activities for later review by police….  Tomorrow’s data retention hearing is juxtaposed against the recent trend to protect Internet users’ privacy by storing less data. Last month, the Federal Trade Commission called for “limited retention” of user data on privacy grounds, and in the last 24 hours, both Mozilla and Google have announced do-not-track technology.\nThese jokers aren’t going to fix\nanything\n.  If they leave Ron Paul alone long enough to get some straight accounting out of the Fed, it will only be because the incompetence of the central bankers has put their corporatist gravy train in danger.  The division between Democrats and Republicans isn’t based upon ideology or big government vs small government, it is basically a battle between pro-government bureaucrats and pro-corporate bureaucrats.  And by “corporation”, I do not mean the small businesses that are a legal shell for the business activity of actual individuals, but the giant, government-created artificial entities that have taken on financial lives of their own.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-01-31T14:15:00+00:00"
}