{
  "url": "https://voxday.net/2005/03/26/done-and-done/",
  "scraped_at": "2026-01-08T19:57:21.323528",
  "title": "Done and done",
  "date_display": "March 26, 2005",
  "date_iso": "2005-03-26T08:40:00+00:00",
  "date_from_url": "2005-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.cahabaproductions.com/fall_comic.htm\">ARCHANGELS: THE FALL Vol. III</a> is complete:</p><blockquote><p><em>When the Son of Man died, the darkness that had fallen about the land began to fade.  The bloodthirsty crowd of mortals fell silent, as if for the first time they realized what they had done.  Shame filled them and they departed quickly from Calvary, eager to leave behind the dead body that rebuked them in its innocent silence.  But the darkness was in their hearts now, even as the one who claimed lordship over them howled in exaltation.  The skies were lost to madness as his demons hurled themselves against the downcast Host of Heaven, who were still in shock at the death of the promised savior.  One after another, they fell before the evil legions, raining down upon the earth like shooting stars.  The Dragon urged them on, arrogantly certain of his victory.</em></p></blockquote><p>We went to press yesterday, finishing up the final third in the trilogy.  This one was a little harder to write, as we filled it with more text than one normally sees in a comic book and there was less Biblical text available on which to base the story.  Also, it was felt that Christian Bookstore Association sensitivities did not allow for any graphic harrowing of Hell, which was unfortunate since that was something I was rather looking forward to writing.</p><p>But Focus on the Family seems to really like them – one of their editors volunteered to edit the third one – and so it will be interesting to see how people respond to them once they become more widely available in the next month or two.  The general consensus seems to be that they’re somewhat unusual as CBA product goes, since the fantasy elements are both stronger and darker than is typically the case.  (One guess as to who is responsible for that….)</p><p>There’s a pretty good chance that we’re going to be doing more comics this year with one of the larger CBA publishers.  The two leading contenders, in my opinion, are ARCHANGELS: LEGACY, a concept about angelic battles of the past and how they related to historical events both real and fictional, and <a href=\"http://www.eternalwarriors.com/david_chapters.htm\">THE CHRONICLES OF KING DAVID</a>, which is a concept designed around the Biblical David combined with recently uncovered archeological evidence and the New Chronology of Egypt that would involve three traditional novels and three-related graphic novels.</p><p>UPDATE – In answer to some questions, clicking on the gold cover of Volume III will take you to a place where you can order it.  It will be a few weeks before they make their way to the Family Christian stores, Lifeways and a few other Christian bookstores that plan to carry them.  As for who does the artwork, I believe Patrick did the cover himself, while the interior artwork is done by Deon Ruckols and Scott Sirag (pencils), Rus Sever (inks) and Jose Flores (colors and digital effects).</p></div>",
  "content_text": "ARCHANGELS: THE FALL Vol. III\nis complete:\nWhen the Son of Man died, the darkness that had fallen about the land began to fade.  The bloodthirsty crowd of mortals fell silent, as if for the first time they realized what they had done.  Shame filled them and they departed quickly from Calvary, eager to leave behind the dead body that rebuked them in its innocent silence.  But the darkness was in their hearts now, even as the one who claimed lordship over them howled in exaltation.  The skies were lost to madness as his demons hurled themselves against the downcast Host of Heaven, who were still in shock at the death of the promised savior.  One after another, they fell before the evil legions, raining down upon the earth like shooting stars.  The Dragon urged them on, arrogantly certain of his victory.\nWe went to press yesterday, finishing up the final third in the trilogy.  This one was a little harder to write, as we filled it with more text than one normally sees in a comic book and there was less Biblical text available on which to base the story.  Also, it was felt that Christian Bookstore Association sensitivities did not allow for any graphic harrowing of Hell, which was unfortunate since that was something I was rather looking forward to writing.\nBut Focus on the Family seems to really like them – one of their editors volunteered to edit the third one – and so it will be interesting to see how people respond to them once they become more widely available in the next month or two.  The general consensus seems to be that they’re somewhat unusual as CBA product goes, since the fantasy elements are both stronger and darker than is typically the case.  (One guess as to who is responsible for that….)\nThere’s a pretty good chance that we’re going to be doing more comics this year with one of the larger CBA publishers.  The two leading contenders, in my opinion, are ARCHANGELS: LEGACY, a concept about angelic battles of the past and how they related to historical events both real and fictional, and\nTHE CHRONICLES OF KING DAVID\n, which is a concept designed around the Biblical David combined with recently uncovered archeological evidence and the New Chronology of Egypt that would involve three traditional novels and three-related graphic novels.\nUPDATE – In answer to some questions, clicking on the gold cover of Volume III will take you to a place where you can order it.  It will be a few weeks before they make their way to the Family Christian stores, Lifeways and a few other Christian bookstores that plan to carry them.  As for who does the artwork, I believe Patrick did the cover himself, while the interior artwork is done by Deon Ruckols and Scott Sirag (pencils), Rus Sever (inks) and Jose Flores (colors and digital effects).",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-26T08:40:00+00:00"
}