{
  "url": "https://voxday.net/2005/03/11/in-defense-of-blackmai/",
  "scraped_at": "2026-01-08T19:56:12.688723",
  "title": "In defense of blackmail",
  "date_display": "March 11, 2005",
  "date_iso": "2005-03-11T12:24:00+00:00",
  "date_from_url": "2005-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joe Carter <a href=\"http://www.evangelicaloutpost.com/mt/mt-tb.cgi?__mode=view&amp;entry_id=1232\">poses a conundrum</a>:</p><blockquote><p>But while blackmail is a sin, should it also be a crime? Libertarians, who claim it is a “victimless crime” would say no.  Would a Christian libertarian also argue in favor decriminalizing the practice? The reason I ask is because one the main complaints I have with most libertarians is that they often work backwards from a grievance to the development of their core beliefs. Christians, on the other hand, must start with Biblical principles and work their way to a coherent political philosophy.</p><p>But a number of bloggers whose intellect and opinions I respect (particularly John Coleman, Josh Claybourn, and Vox Day) subscribe to some version of Christian libertarianism. While I don’t find the political theory to be a tenable option, I’m open to changing my opinion and so I’m eager to hear a defense of blackmail from a Biblical perspective.</p></blockquote><p>My favorite thing about the Evangelical Outpost is that one can always count on Joe to bring up something interesting to consider while simultaneously calling someone out on it.  I suppose I could imitate the Panda’s Thumbkins and tell him that there is a plethora of material written by Very Important Names defending blackmail on Christian grounds somewhere Out There, but instead, I’ll see if I can make a case.  Although this will probably cause CAIR, Atrios and the Electrolites to conclude that I am also a blackmailer, in addition to my copious other crimes against humanity.</p><p>First, there is nothing criminal with regards to disseminating non-private information about an individidual.  You might find it very embarassing to have your wife learn that you were deported from Italy after being caught with your pants down in the act of pretending to molest the statue of Juliet by the Veronese police, but there’s no law preventing me from telling her. <em>Or sending her the digital pictures, BC</em>.  Nor is there any law which forbids one party from giving money to another party in return for legal services, or as a gift.</p><p>There are two routes to defense here.  One is the link between the Christian intellectual tradition and “Die Gedanken, sie sind frei”.  Freedom of thought is an integral part of free will, but to ban blackmail is to necessarily engage in thought-policing, since it is the intentions, rather than the actions, which are being judged.   Your intention is to buy my silence; you are operating under the assumption that I intend to inform others if you do not pay.  Blackmail is therefore inherently a thought crime since if it occurs, no action has actually been taken by the blackmailer.</p><p>Second, the commandments to the Church in the proper means of dealing with remorseless sinners is potentially relevant here.  Exposing the sins of an unrepentant individual to others, far from being a wrongful act, is actually required of the church member in good standing.  Since such exposure is a virtuous act under Biblical principles, it cannot and should not be viewed as something negative, much less as the basis for a crime.</p><p>So, WB, about those pictures of you and that elephant seal in Carmel….</p></div>",
  "content_text": "Joe Carter\nposes a conundrum\n:\nBut while blackmail is a sin, should it also be a crime? Libertarians, who claim it is a “victimless crime” would say no.  Would a Christian libertarian also argue in favor decriminalizing the practice? The reason I ask is because one the main complaints I have with most libertarians is that they often work backwards from a grievance to the development of their core beliefs. Christians, on the other hand, must start with Biblical principles and work their way to a coherent political philosophy.\nBut a number of bloggers whose intellect and opinions I respect (particularly John Coleman, Josh Claybourn, and Vox Day) subscribe to some version of Christian libertarianism. While I don’t find the political theory to be a tenable option, I’m open to changing my opinion and so I’m eager to hear a defense of blackmail from a Biblical perspective.\nMy favorite thing about the Evangelical Outpost is that one can always count on Joe to bring up something interesting to consider while simultaneously calling someone out on it.  I suppose I could imitate the Panda’s Thumbkins and tell him that there is a plethora of material written by Very Important Names defending blackmail on Christian grounds somewhere Out There, but instead, I’ll see if I can make a case.  Although this will probably cause CAIR, Atrios and the Electrolites to conclude that I am also a blackmailer, in addition to my copious other crimes against humanity.\nFirst, there is nothing criminal with regards to disseminating non-private information about an individidual.  You might find it very embarassing to have your wife learn that you were deported from Italy after being caught with your pants down in the act of pretending to molest the statue of Juliet by the Veronese police, but there’s no law preventing me from telling her.\nOr sending her the digital pictures, BC\n.  Nor is there any law which forbids one party from giving money to another party in return for legal services, or as a gift.\nThere are two routes to defense here.  One is the link between the Christian intellectual tradition and “Die Gedanken, sie sind frei”.  Freedom of thought is an integral part of free will, but to ban blackmail is to necessarily engage in thought-policing, since it is the intentions, rather than the actions, which are being judged.   Your intention is to buy my silence; you are operating under the assumption that I intend to inform others if you do not pay.  Blackmail is therefore inherently a thought crime since if it occurs, no action has actually been taken by the blackmailer.\nSecond, the commandments to the Church in the proper means of dealing with remorseless sinners is potentially relevant here.  Exposing the sins of an unrepentant individual to others, far from being a wrongful act, is actually required of the church member in good standing.  Since such exposure is a virtuous act under Biblical principles, it cannot and should not be viewed as something negative, much less as the basis for a crime.\nSo, WB, about those pictures of you and that elephant seal in Carmel….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-11T12:24:00+00:00"
}