{
  "url": "https://voxday.net/2005/03/04/irresponsible-abortionettes/",
  "scraped_at": "2026-01-08T19:55:27.150913",
  "title": "Irresponsible abortionettes",
  "date_display": "March 4, 2005",
  "date_iso": "2005-03-04T11:28:00+00:00",
  "date_from_url": "2005-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have zero intellectual regard for the abortionettes, mostly because they can’t offer a single argument that can hold up to ten seconds debate before an impartial judge.  The OC did a fine job of destroying the most cherished arguments in one or two sentences apiece; my favorite idiocy has always been the utterly asinine “it’s my body” argument, which of course doesn’t apply to almost anything else you eat, drink, wear or do in our current legal system.</p><p>But the argument I find the most tiresome is the “poor frightened young girl” argument.  First, it’s a cop-out.  Few would harbor similar pity for a “poor sexually deprived young boy” who rapes someone.  Second, it’s a stupid basis for abortion rights as a whole, since it would be trivially simple to enact lesser penalties for girls under the age of 18 on the basis of their being <em>non compos mentis</em>, although I’d think that this could just as easily be regarded as an insult.  In any event, the ease with which this “problem” can theoretically be addressed demonstrates that it’s nothing but a stalking horse designed to take the pressure off a beleagured abortionette who’s losing an argument.</p><p>A tangential annoyance is how abortionettes, when faced with the need to acknowledge the irresponsibility of the woman in getting pregnant in the first place given the plethora of available birth control methods, start whining about how men are irresponsible too.  But this simply leads their argument onto very thin ice, as they don’t want men to be responsible or even have any voice in the matter.  This is because bringing male responsibility into the pro-abortion argument would require granting men the right to either force the woman to have an abortion or be able to deny any subsequent paternal responsibility for the child.</p><p>This, of course, would be more terrifying to the abortionettes than an outright ban on the disgusting practice.  What a contemptible lot!  On top of everything else, they can’t even manage to take responsibility for the logic of their own haphazard arguments.</p></div>",
  "content_text": "I have zero intellectual regard for the abortionettes, mostly because they can’t offer a single argument that can hold up to ten seconds debate before an impartial judge.  The OC did a fine job of destroying the most cherished arguments in one or two sentences apiece; my favorite idiocy has always been the utterly asinine “it’s my body” argument, which of course doesn’t apply to almost anything else you eat, drink, wear or do in our current legal system.\nBut the argument I find the most tiresome is the “poor frightened young girl” argument.  First, it’s a cop-out.  Few would harbor similar pity for a “poor sexually deprived young boy” who rapes someone.  Second, it’s a stupid basis for abortion rights as a whole, since it would be trivially simple to enact lesser penalties for girls under the age of 18 on the basis of their being\nnon compos mentis\n, although I’d think that this could just as easily be regarded as an insult.  In any event, the ease with which this “problem” can theoretically be addressed demonstrates that it’s nothing but a stalking horse designed to take the pressure off a beleagured abortionette who’s losing an argument.\nA tangential annoyance is how abortionettes, when faced with the need to acknowledge the irresponsibility of the woman in getting pregnant in the first place given the plethora of available birth control methods, start whining about how men are irresponsible too.  But this simply leads their argument onto very thin ice, as they don’t want men to be responsible or even have any voice in the matter.  This is because bringing male responsibility into the pro-abortion argument would require granting men the right to either force the woman to have an abortion or be able to deny any subsequent paternal responsibility for the child.\nThis, of course, would be more terrifying to the abortionettes than an outright ban on the disgusting practice.  What a contemptible lot!  On top of everything else, they can’t even manage to take responsibility for the logic of their own haphazard arguments.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-04T11:28:00+00:00"
}