{
  "url": "https://voxday.net/2005/03/02/ketchup-sandwich-and-other-horrors/",
  "scraped_at": "2026-01-08T19:55:12.387483",
  "title": "The ketchup sandwich and other horrors",
  "date_display": "March 2, 2005",
  "date_iso": "2005-03-02T16:26:00+00:00",
  "date_from_url": "2005-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I must confess a certain sympathy for the sort of progressive, educated, quasi-intellectual who reads The New Yorker and shudders at Fox News.  There truly is something horrible about seeing a crowded Macdonalds in Verona, and strolling down the streets of Oxford one realizes that there is virtually no point to tourist shopping, since you can buy precisely the same clothes and whatnot at the Mall of America.  The last time I was at the Megamall, what impressed me most was that  barring a few digital gadgets I’d probably order online anyhow, I did not see a single thing I wanted to buy.</p><p>And I’ll admit, I cringe at the sight of the obese American tourists in their t-shirts and white tennis shoes, farting and shouting at each other as they stroll around Venice.  I was at a hotel in Amsterdam a few years ago, and the contrast between two families in the hotel’s living room – one Italian, one American – could not have been more stark.  The two Italian children were quietly sitting on a couch next to their parents, drinking wine with them.  The supersized American parents were talking so loudly that I could understand every word of their conversation from across the room, while their two roly-poly teenagers were doing reverse somersaults over the back of another couch.</p><p>I was alone, engrossed in a worn English copy of The Prisoner of Zenda and a glass of wine, when the Italian girl glanced at me and caught me staring with horror at the out-of-control kids.  She glanced at them, shook her head and said: <em>“Come animali, che brutto!”</em> Needless to say, I did not feel any strong urge to leap to the defense of my fellow countrymen.  At that moment, I probably would have preferred to confess to being a Frenchman first.</p><p>Europeans also have a great respect for literature which is delightful.  Most homes possess a library that is more than a mere smattering of books, most of which are not the King-Clancy-Grisham fare that Americans overwhelmingly find so absorbing.  However, their servile nature is downright frightening to any red-blooded American, even an elitist, as their resignation to whatever lunacy their socialist governments are currently wrapped up in inflicting on them is complete.  If the price of culture is gas chambers and gulags, it is far too high.</p><p>Anyhow, if the Europhile elitists have a point about what Umberto Eco describes as the absence of culture, (for in Apocalypse he explains at some length how the concept of mass culture is inherently oxymoronic), they also miss the larger one.  First, every individual has a perfect right to his tastes, regardless of how appalling they might be.  Second, in a world without Wayne Newton and Britney Spears, there would be no one for the devotees of Wagner and Calvino to despise.</p><p>And where would be the fun in that?</p></div>",
  "content_text": "I must confess a certain sympathy for the sort of progressive, educated, quasi-intellectual who reads The New Yorker and shudders at Fox News.  There truly is something horrible about seeing a crowded Macdonalds in Verona, and strolling down the streets of Oxford one realizes that there is virtually no point to tourist shopping, since you can buy precisely the same clothes and whatnot at the Mall of America.  The last time I was at the Megamall, what impressed me most was that  barring a few digital gadgets I’d probably order online anyhow, I did not see a single thing I wanted to buy.\nAnd I’ll admit, I cringe at the sight of the obese American tourists in their t-shirts and white tennis shoes, farting and shouting at each other as they stroll around Venice.  I was at a hotel in Amsterdam a few years ago, and the contrast between two families in the hotel’s living room – one Italian, one American – could not have been more stark.  The two Italian children were quietly sitting on a couch next to their parents, drinking wine with them.  The supersized American parents were talking so loudly that I could understand every word of their conversation from across the room, while their two roly-poly teenagers were doing reverse somersaults over the back of another couch.\nI was alone, engrossed in a worn English copy of The Prisoner of Zenda and a glass of wine, when the Italian girl glanced at me and caught me staring with horror at the out-of-control kids.  She glanced at them, shook her head and said:\n“Come animali, che brutto!”\nNeedless to say, I did not feel any strong urge to leap to the defense of my fellow countrymen.  At that moment, I probably would have preferred to confess to being a Frenchman first.\nEuropeans also have a great respect for literature which is delightful.  Most homes possess a library that is more than a mere smattering of books, most of which are not the King-Clancy-Grisham fare that Americans overwhelmingly find so absorbing.  However, their servile nature is downright frightening to any red-blooded American, even an elitist, as their resignation to whatever lunacy their socialist governments are currently wrapped up in inflicting on them is complete.  If the price of culture is gas chambers and gulags, it is far too high.\nAnyhow, if the Europhile elitists have a point about what Umberto Eco describes as the absence of culture, (for in Apocalypse he explains at some length how the concept of mass culture is inherently oxymoronic), they also miss the larger one.  First, every individual has a perfect right to his tastes, regardless of how appalling they might be.  Second, in a world without Wayne Newton and Britney Spears, there would be no one for the devotees of Wagner and Calvino to despise.\nAnd where would be the fun in that?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-02T16:26:00+00:00"
}