{
  "url": "https://voxday.net/2005/03/13/killing-women-to-support-the/",
  "scraped_at": "2026-01-08T19:56:23.746595",
  "title": "Killing women to support them",
  "date_display": "March 13, 2005",
  "date_iso": "2005-03-13T15:40:00+00:00",
  "date_from_url": "2005-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As the Pan-Galactic one <a href=\"http://bloggerblaster.blogspot.com/2005_03_01_bloggerblaster_archive.html#111064650779978354\">pointed out on his blog</a>, the big story that the legacy media won’t report about the recent judge shooting is that all of the guards in the courtroom were women.  So, despite the feminist gynomyth that insists modern combat does not involve strength or speed, the armed guards ended up getting decked, disarmed and shot, not necessarily in that order.  Well done, ladies.  I guess if you build your worldview around movies starring Demi Moore, reality can come as a very ugly surprise.</p><p>I find it ironic that these supposedly pro-women feminists keep pushing to put women in positions where they end up getting killed.  The top-rated women aviators can’t land on carriers without killing themselves, armed female guards can’t guard an unarmed prisoner without getting blown away, and all the while fetal-identification technology is leading to a quiet rise in the elimination of unborn female babies.</p><p>But we’re the ones who hate women.  Right.</p></div>",
  "content_text": "As the Pan-Galactic one\npointed out on his blog\n, the big story that the legacy media won’t report about the recent judge shooting is that all of the guards in the courtroom were women.  So, despite the feminist gynomyth that insists modern combat does not involve strength or speed, the armed guards ended up getting decked, disarmed and shot, not necessarily in that order.  Well done, ladies.  I guess if you build your worldview around movies starring Demi Moore, reality can come as a very ugly surprise.\nI find it ironic that these supposedly pro-women feminists keep pushing to put women in positions where they end up getting killed.  The top-rated women aviators can’t land on carriers without killing themselves, armed female guards can’t guard an unarmed prisoner without getting blown away, and all the while fetal-identification technology is leading to a quiet rise in the elimination of unborn female babies.\nBut we’re the ones who hate women.  Right.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-13T15:40:00+00:00"
}