{
  "url": "https://voxday.net/2005/03/14/marxism-of-right-critique/",
  "scraped_at": "2026-01-08T19:56:27.435389",
  "title": "Marxism of the Right critique",
  "date_display": "March 14, 2005",
  "date_iso": "2005-03-14T08:30:00+00:00",
  "date_from_url": "2005-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As promised in today’s article, a critique of Robert Locke’s article which appeared in American Conservative magazine:</p><blockquote><p>Free spirits, the ambitious, ex-socialists, drug users, and sexual eccentrics often find an attractive political philosophy in libertarianism, the idea that individual freedom should be the sole rule of ethics and government. Libertarianism offers its believers a clear conscience to do things society presently restrains, like make more money, have more sex, or take more drugs. It promises a consistent formula for ethics, a rigorous framework for policy analysis, a foundation in American history, and the application of capitalist efficiencies to the whole of society. But while it contains substantial grains of truth, as a whole it is a seductive mistake.</p></blockquote><p>I’ve already pointed out that ex-socialists have gravitated to the Republican party, where they call themselves neoconservatives, not the libertarians.  Libertarianism simply has nothing to interest a socialist, (who requires a vehicle he can use to control other individuals), which is why ex-socialists are known to become Fascists (Benito Mussolini) or neoconservative advocates of “strong government conservatism” instead.  Locke confuses legality with a clear conscience here, but legality is not and has never been synonymous with morality, although some fortunate societies may be blessed with a legal system harboring a basis in it.</p><blockquote><p>There are many varieties of libertarianism, from natural-law libertarianism (the least crazy) to anarcho-capitalism (the most), and some varieties avoid some of the criticisms below. But many are still subject to most of them, and some of the more successful varieties—I recently heard a respected pundit insist that classical liberalism is libertarianism—enter a gray area where it is not really clear that they are libertarians at all. But because 95 percent of the libertarianism one encounters at cocktail parties, on editorial pages, and on Capitol Hill is a kind of commonplace “street” libertarianism, I decline to allow libertarians the sophistical trick of using a vulgar libertarianism to agitate for what they want by defending a refined version of their doctrine when challenged philosophically. We’ve seen Marxists pull that before.</p></blockquote><p>This trick isn’t even sophistical.  Because libertarianism is intellectually cool, people from Bill Mahre to Condoleeza Rice have wrongly claimed some degree of allegiance to it.  The truth is that most people, including Mr. Locke, have a poor understanding of libertarianism.  There is no dichotomy between vulgar and refined forms; libertarianism is more coherent and consistent than the conservatism Locke is presumably defending.  Since conservatives have pulled this before, would Locke likewise assert that libertarians are the conservatives of the Right on this basis?</p><blockquote><p>This is no surprise, as libertarianism is basically the Marxism of the Right. If Marxism is the delusion that one can run society purely on altruism and collectivism, then libertarianism is the mirror-image delusion that one can run it purely on selfishness and individualism. Society in fact requires both individualism and collectivism, both selfishness and altruism, to function. Like Marxism, libertarianism offers the fraudulent intellectual security of a complete a priori account of the political good without the effort of empirical investigation. Like Marxism, it aspires, overtly or covertly, to reduce social life to economics. And like Marxism, it has its historical myths and a genius for making its followers feel like an elect unbound by the moral rules of their society.</p></blockquote><p>I covered this in the column today.  Locke is simply wrong.  Libertarianism is not based on economics, it is based on a fear of government and a belief that the adherents of any ideology which find themselves holding the reins of power will soon sacrifice their beliefs in favor of retaining and expanding that power.  The only way to prevent this is to spread out, and, wherever possible, eliminate central power, to prevent it from being amassed as long as possible.  The proven tendency of Republicans to abandon their small government philosophy, their term-limits and spending cuts, their opposition to unlimited foreign adventures and supranational organizations, is a powerful testimony in support of fundamental libertarian pessimism.</p><blockquote><p>The most fundamental problem with libertarianism is very simple: freedom, though a good thing, is simply not the only good thing in life. Simple physical security, which even a prisoner can possess, is not freedom, but one cannot live without it. Prosperity is connected to freedom, in that it makes us free to consume, but it is not the same thing, in that one can be rich but as unfree as a Victorian tycoon’s wife. A family is in fact one of the least free things imaginable, as the emotional satisfactions of it derive from relations that we are either born into without choice or, once they are chosen, entail obligations that we cannot walk away from with ease or justice. But security, prosperity, and family are in fact the bulk of happiness for most real people and the principal issues that concern governments.</p></blockquote><p>This is meaningless gobbledy-gook.  Libertarianism doesn’t argue that freedom is the only good thing in life, only that it is the foundation of all good things in life.  Security, prosperity and family are the principal issues that concern governments, what Locke omits is the fact that the evidence strongly suggests that governments are dedicated to destroying all three.  A government that limits an individual’s right to own guns is not pro-security.  A government that taxes its people more than 10 percent is not pro-prosperity.  And a government that makes divorce easy and funds abortions is not pro-family.  And this is a so-called conservative government I am describing!</p><blockquote><p>Libertarians try to get around this fact that freedom is not the only good thing by trying to reduce all other goods to it through the concept of choice, claiming that everything that is good is so because we choose to partake of it. Therefore freedom, by giving us choice, supposedly embraces all other goods. But this violates common sense by denying that anything is good by nature, independently of whether we choose it. Nourishing foods are good for us by nature, not because we choose to eat them. Taken to its logical conclusion, the reduction of the good to the freely chosen means there are no inherently good or bad choices at all, but that a man who chose to spend his life playing tiddlywinks has lived as worthy a life as a Washington or a Churchill.</p></blockquote><p>Apparently Locke would be happier with a central committee deciding what people will do with their lives.  A man who chose to spend his life playing tiddlywinks has done more for humanity than most of the Great Men of history.  What happened to the conservatives who only wished to be left alone to live their lives as they saw fit?</p><blockquote><p>Furthermore, the reduction of all goods to individual choices presupposes that all goods are individual. But some, like national security, clean air, or a healthy culture, are inherently collective. It may be possible to privatize some, but only some, and the efforts can be comically inefficient. Do you really want to trace every pollutant in the air back to the factory that emitted it and sue?</p></blockquote><p>Locke is relying on amorphous terms in order to try to avoid the fact that in every case, even those examples he gives, individual choices, taken in the aggregate, determine these things.  Mises demonstrated that there is no such thing as collective action, one need only to examine a stock market to see that while there are patterns of aggregate individual behavior, collective behavior does not exist.  Aristotle explained how without a Mover, there is no Movement.</p><blockquote><p>L<br> ibertarians rightly concede that one’s freedom must end at the point at which it starts to impinge upon another person’s, but they radically underestimate how easily this happens. So even if the libertarian principle of “an it harm none, do as thou wilt,” is true, it does not license the behavior libertarians claim. Consider pornography: libertarians say it should be permitted because if someone doesn’t like it, he can choose not to view it. But what he can’t do is choose not to live in a culture that has been vulgarized by it.</br></p></blockquote><p>Apparently the concept of emigration is foreign to Mr. Locke.  By his reckoning, Locke can’t choose not to live in a society where home prices haven’t been artificially inflated by interest rate cuts either.</p><blockquote><p>Libertarians in real life rarely live up to their own theory but tend to indulge in the pleasant parts while declining to live up to the difficult portions. They flout the drug laws but continue to collect government benefits they consider illegitimate. This is not just an accidental failing of libertarianism’s believers but an intrinsic temptation of the doctrine that sets it up to fail whenever tried, just like Marxism.</p></blockquote><p>Or just like Republicanism.  As I pointed out today, the Libertarian party is more ideologically pure any other party on the American presidential ballot.  Randomly throwing out similarities with Marxism – libertarians are dependent on H2O, <em>just like Marxists</em> – proves absolutely nothing.</p><blockquote><p>Libertarians need to be asked some hard questions. What if a free society needed to draft its citizens in order to remain free? What if it needed to limit oil imports to protect the economic freedom of its citizens from unfriendly foreigners? What if it needed to force its citizens to become sufficiently educated to sustain a free society? What if it needed to deprive landowners of the freedom to refuse to sell their property as a precondition for giving everyone freedom of movement on highways? What if it needed to deprive citizens of the freedom to import cheap foreign labor in order to keep out poor foreigners who would vote for socialistic wealth redistribution?</p></blockquote><p>1.  Then it would not be free.  2.  Then it would not be economically free.  3.  Government education does not sustain a free society, which is why government-funded education is one of the ten pillars of Marxism as well as one of the 25 points of the National Socialist Munich Manifesto.  4.  It doesn’t, and everyone is not given freedom of movement on the highways, as everyone with a traffic ticket knows.  5.  This is tangential to a valid point, which is why I have argued that open immigration is actually an anti-libertarian position.</p><blockquote><p>In each of these cases, less freedom today is the price of more tomorrow. Total freedom today would just be a way of running down accumulated social capital and storing up problems for the future. So even if libertarianism is true in some ultimate sense, this does not prove that the libertarian policy choice is the right one today on any particular question.</p></blockquote><p>In four of these five cases, Locke demonstrates that he gets it precisely backwards.  Less freedom today for more tomorrow!  Is this sort of Orwellian construction really the backbone of modern conservativism?  No wonder the paleo-conservatives want nothing to do with today’s “conservative” frauds.</p><blockquote><p>Furthermore, if limiting freedom today may prolong it tomorrow, then limiting freedom tomorrow may prolong it the day after and so on, so the right amount of freedom may in fact be limited freedom in perpetuity. But if limited freedom is the right choice, then libertarianism, which makes freedom an absolute, is simply wrong. If all we want is limited freedom, then mere liberalism will do, or even better, a Burkean conservatism that reveres traditional liberties. There is no need to embrace outright libertarianism just because we want a healthy portion of freedom, and the alternative to libertarianism is not the USSR, it is America’s traditional liberties.</p></blockquote><p>This borders on parody.  Determining the “right” amount of freedom sounds far more Marxist than anything any libertarian has ever said.  And one need only look at the goals and historical policies of Marxist governments and compare them to the goals and policies of the Libertarian party to see how completely they are in opposition to one another.</p><blockquote><p>Libertarianism’s abstract and absolutist view of freedom leads to bizarre conclusions. Like slavery, libertarianism would have to allow one to sell oneself into it. (It has been possible at certain times in history to do just that by assuming debts one could not repay.) And libertarianism degenerates into outright idiocy when confronted with the problem of children, whom it treats like adults, supporting the abolition of compulsory education and all child-specific laws, like those against child labor and child sex. It likewise cannot handle the insane and the senile.</p></blockquote><p>By this point, the words “bizarre conclusions” appear to be a strong case of projection.  Libertarianism does NOT treat children like adults, nor does it have any problem handling the insane and the senile.  The only party with any noticeable elements for expanding children’s rights is not the Libertarians, but the Democrats, the stronger of the two strong government parties.</p><blockquote><p>Libertarians argue that radical permissiveness, like legalizing drugs, would not shred a libertarian society because drug users who caused trouble would be disciplined by the threat of losing their jobs or homes if current laws that make it difficult to fire or evict people were abolished. They claim a “natural order” of reasonable behavior would emerge. But there is no actual empirical proof that this would happen. Furthermore, this means libertarianism is an all-or-nothing proposition: if society continues to protect people from the consequences of their actions in any way, libertarianism regarding specific freedoms is illegitimate. And since society does so protect people, libertarianism is an illegitimate moral position until the Great Libertarian Revolution has occurred.</p></blockquote><p>Society protects people?  Really?  Actually, if Locke bothered to let facts get in the way of his elaborate fantasy construction, he’d know that society, in the form of government or the police, is in no way legally obligated to protect anyone.  As far as empirical proofs with regards to drugs go, there is ample empirical proof that the Drug War erodes liberty and erodes security at the same time.</p><blockquote><p>And is society really wrong to protect people against the negative consequences of some of their free choices? While it is obviously fair to let people enjoy the benefits of their wise choices and suffer the costs of their stupid ones, decent societies set limits on both these outcomes. People are allowed to become millionaires, but they are taxed. They are allowed to go broke, but they are not then forced to starve. They are deprived of the most extreme benefits of freedom in order to spare us the most extreme costs. The libertopian alternative would be perhaps a more glittering society, but also a crueler one.</p></blockquote><p><em>Like a Marxist</em>, Locke conflates empathy with government action.  A libertarian society wouldn’t necessarily be any crueller, in fact, without the illusion of government “help”, individuals and churches would be more inclined to pick up the slack, as they did in the days before the conservative Great Society of LBJ.  Locke provides more evidence for an article called Conservatives: Marxists of the Right than he does for his actual premise.</p><blockquote><p>Empirically, most people don’t actually want absolute freedom, which is why democracies don’t elect libertarian governments. Irony of ironies, people don’t choose absolute freedom. But this refutes libertarianism by<br> its own premise, as libertarianism defines the good as the freely chosen, yet people do not choose it. Paradoxically, people exercise their freedom not to be libertarians.</br></p></blockquote><p>This is why a lot of people bitched about the AT&amp;T breakup too.  And yet, there’s not a lot of people pining for the days of black rotary-dialed telephones either.  The fact that most people wanted to be treated like sheep doesn’t mean that it is right to do so.</p><blockquote><p>The political corollary of this is that since no electorate will support libertarianism, a libertarian government could never be achieved democratically but would have to be imposed by some kind of authoritarian state, which rather puts the lie to libertarians’ claim that under any other philosophy, busybodies who claim to know what’s best for other people impose their values on the rest of us. Libertarianism itself is based on the conviction that it is the one true political philosophy and all others are false. It entails imposing a certain kind of society, with all its attendant pluses and minuses, which the inhabitants thereof will not be free to opt out of except by leaving.</p></blockquote><p>As opposed to the establishment of democracies in Iraq and America, which were established by an electorate and not military force.  Wait a minute!  Again, Locke is simply making silly loops around a differently-colored sky.  And at least libertarians will allow people to opt out by leaving, the same is not true of any Marxist society, or even modern American society.  There’s a few more paragraphs, but at this point I got bored and what I’ve covered should suffice to demonstrate that Locke does not even begin to make a case against the libertarian philosophy, much less prove its relationship to Marxism.</p></div>",
  "content_text": "As promised in today’s article, a critique of Robert Locke’s article which appeared in American Conservative magazine:\nFree spirits, the ambitious, ex-socialists, drug users, and sexual eccentrics often find an attractive political philosophy in libertarianism, the idea that individual freedom should be the sole rule of ethics and government. Libertarianism offers its believers a clear conscience to do things society presently restrains, like make more money, have more sex, or take more drugs. It promises a consistent formula for ethics, a rigorous framework for policy analysis, a foundation in American history, and the application of capitalist efficiencies to the whole of society. But while it contains substantial grains of truth, as a whole it is a seductive mistake.\nI’ve already pointed out that ex-socialists have gravitated to the Republican party, where they call themselves neoconservatives, not the libertarians.  Libertarianism simply has nothing to interest a socialist, (who requires a vehicle he can use to control other individuals), which is why ex-socialists are known to become Fascists (Benito Mussolini) or neoconservative advocates of “strong government conservatism” instead.  Locke confuses legality with a clear conscience here, but legality is not and has never been synonymous with morality, although some fortunate societies may be blessed with a legal system harboring a basis in it.\nThere are many varieties of libertarianism, from natural-law libertarianism (the least crazy) to anarcho-capitalism (the most), and some varieties avoid some of the criticisms below. But many are still subject to most of them, and some of the more successful varieties—I recently heard a respected pundit insist that classical liberalism is libertarianism—enter a gray area where it is not really clear that they are libertarians at all. But because 95 percent of the libertarianism one encounters at cocktail parties, on editorial pages, and on Capitol Hill is a kind of commonplace “street” libertarianism, I decline to allow libertarians the sophistical trick of using a vulgar libertarianism to agitate for what they want by defending a refined version of their doctrine when challenged philosophically. We’ve seen Marxists pull that before.\nThis trick isn’t even sophistical.  Because libertarianism is intellectually cool, people from Bill Mahre to Condoleeza Rice have wrongly claimed some degree of allegiance to it.  The truth is that most people, including Mr. Locke, have a poor understanding of libertarianism.  There is no dichotomy between vulgar and refined forms; libertarianism is more coherent and consistent than the conservatism Locke is presumably defending.  Since conservatives have pulled this before, would Locke likewise assert that libertarians are the conservatives of the Right on this basis?\nThis is no surprise, as libertarianism is basically the Marxism of the Right. If Marxism is the delusion that one can run society purely on altruism and collectivism, then libertarianism is the mirror-image delusion that one can run it purely on selfishness and individualism. Society in fact requires both individualism and collectivism, both selfishness and altruism, to function. Like Marxism, libertarianism offers the fraudulent intellectual security of a complete a priori account of the political good without the effort of empirical investigation. Like Marxism, it aspires, overtly or covertly, to reduce social life to economics. And like Marxism, it has its historical myths and a genius for making its followers feel like an elect unbound by the moral rules of their society.\nI covered this in the column today.  Locke is simply wrong.  Libertarianism is not based on economics, it is based on a fear of government and a belief that the adherents of any ideology which find themselves holding the reins of power will soon sacrifice their beliefs in favor of retaining and expanding that power.  The only way to prevent this is to spread out, and, wherever possible, eliminate central power, to prevent it from being amassed as long as possible.  The proven tendency of Republicans to abandon their small government philosophy, their term-limits and spending cuts, their opposition to unlimited foreign adventures and supranational organizations, is a powerful testimony in support of fundamental libertarian pessimism.\nThe most fundamental problem with libertarianism is very simple: freedom, though a good thing, is simply not the only good thing in life. Simple physical security, which even a prisoner can possess, is not freedom, but one cannot live without it. Prosperity is connected to freedom, in that it makes us free to consume, but it is not the same thing, in that one can be rich but as unfree as a Victorian tycoon’s wife. A family is in fact one of the least free things imaginable, as the emotional satisfactions of it derive from relations that we are either born into without choice or, once they are chosen, entail obligations that we cannot walk away from with ease or justice. But security, prosperity, and family are in fact the bulk of happiness for most real people and the principal issues that concern governments.\nThis is meaningless gobbledy-gook.  Libertarianism doesn’t argue that freedom is the only good thing in life, only that it is the foundation of all good things in life.  Security, prosperity and family are the principal issues that concern governments, what Locke omits is the fact that the evidence strongly suggests that governments are dedicated to destroying all three.  A government that limits an individual’s right to own guns is not pro-security.  A government that taxes its people more than 10 percent is not pro-prosperity.  And a government that makes divorce easy and funds abortions is not pro-family.  And this is a so-called conservative government I am describing!\nLibertarians try to get around this fact that freedom is not the only good thing by trying to reduce all other goods to it through the concept of choice, claiming that everything that is good is so because we choose to partake of it. Therefore freedom, by giving us choice, supposedly embraces all other goods. But this violates common sense by denying that anything is good by nature, independently of whether we choose it. Nourishing foods are good for us by nature, not because we choose to eat them. Taken to its logical conclusion, the reduction of the good to the freely chosen means there are no inherently good or bad choices at all, but that a man who chose to spend his life playing tiddlywinks has lived as worthy a life as a Washington or a Churchill.\nApparently Locke would be happier with a central committee deciding what people will do with their lives.  A man who chose to spend his life playing tiddlywinks has done more for humanity than most of the Great Men of history.  What happened to the conservatives who only wished to be left alone to live their lives as they saw fit?\nFurthermore, the reduction of all goods to individual choices presupposes that all goods are individual. But some, like national security, clean air, or a healthy culture, are inherently collective. It may be possible to privatize some, but only some, and the efforts can be comically inefficient. Do you really want to trace every pollutant in the air back to the factory that emitted it and sue?\nLocke is relying on amorphous terms in order to try to avoid the fact that in every case, even those examples he gives, individual choices, taken in the aggregate, determine these things.  Mises demonstrated that there is no such thing as collective action, one need only to examine a stock market to see that while there are patterns of aggregate individual behavior, collective behavior does not exist.  Aristotle explained how without a Mover, there is no Movement.\nL\nibertarians rightly concede that one’s freedom must end at the point at which it starts to impinge upon another person’s, but they radically underestimate how easily this happens. So even if the libertarian principle of “an it harm none, do as thou wilt,” is true, it does not license the behavior libertarians claim. Consider pornography: libertarians say it should be permitted because if someone doesn’t like it, he can choose not to view it. But what he can’t do is choose not to live in a culture that has been vulgarized by it.\nApparently the concept of emigration is foreign to Mr. Locke.  By his reckoning, Locke can’t choose not to live in a society where home prices haven’t been artificially inflated by interest rate cuts either.\nLibertarians in real life rarely live up to their own theory but tend to indulge in the pleasant parts while declining to live up to the difficult portions. They flout the drug laws but continue to collect government benefits they consider illegitimate. This is not just an accidental failing of libertarianism’s believers but an intrinsic temptation of the doctrine that sets it up to fail whenever tried, just like Marxism.\nOr just like Republicanism.  As I pointed out today, the Libertarian party is more ideologically pure any other party on the American presidential ballot.  Randomly throwing out similarities with Marxism – libertarians are dependent on H2O,\njust like Marxists\n– proves absolutely nothing.\nLibertarians need to be asked some hard questions. What if a free society needed to draft its citizens in order to remain free? What if it needed to limit oil imports to protect the economic freedom of its citizens from unfriendly foreigners? What if it needed to force its citizens to become sufficiently educated to sustain a free society? What if it needed to deprive landowners of the freedom to refuse to sell their property as a precondition for giving everyone freedom of movement on highways? What if it needed to deprive citizens of the freedom to import cheap foreign labor in order to keep out poor foreigners who would vote for socialistic wealth redistribution?\n1.  Then it would not be free.  2.  Then it would not be economically free.  3.  Government education does not sustain a free society, which is why government-funded education is one of the ten pillars of Marxism as well as one of the 25 points of the National Socialist Munich Manifesto.  4.  It doesn’t, and everyone is not given freedom of movement on the highways, as everyone with a traffic ticket knows.  5.  This is tangential to a valid point, which is why I have argued that open immigration is actually an anti-libertarian position.\nIn each of these cases, less freedom today is the price of more tomorrow. Total freedom today would just be a way of running down accumulated social capital and storing up problems for the future. So even if libertarianism is true in some ultimate sense, this does not prove that the libertarian policy choice is the right one today on any particular question.\nIn four of these five cases, Locke demonstrates that he gets it precisely backwards.  Less freedom today for more tomorrow!  Is this sort of Orwellian construction really the backbone of modern conservativism?  No wonder the paleo-conservatives want nothing to do with today’s “conservative” frauds.\nFurthermore, if limiting freedom today may prolong it tomorrow, then limiting freedom tomorrow may prolong it the day after and so on, so the right amount of freedom may in fact be limited freedom in perpetuity. But if limited freedom is the right choice, then libertarianism, which makes freedom an absolute, is simply wrong. If all we want is limited freedom, then mere liberalism will do, or even better, a Burkean conservatism that reveres traditional liberties. There is no need to embrace outright libertarianism just because we want a healthy portion of freedom, and the alternative to libertarianism is not the USSR, it is America’s traditional liberties.\nThis borders on parody.  Determining the “right” amount of freedom sounds far more Marxist than anything any libertarian has ever said.  And one need only look at the goals and historical policies of Marxist governments and compare them to the goals and policies of the Libertarian party to see how completely they are in opposition to one another.\nLibertarianism’s abstract and absolutist view of freedom leads to bizarre conclusions. Like slavery, libertarianism would have to allow one to sell oneself into it. (It has been possible at certain times in history to do just that by assuming debts one could not repay.) And libertarianism degenerates into outright idiocy when confronted with the problem of children, whom it treats like adults, supporting the abolition of compulsory education and all child-specific laws, like those against child labor and child sex. It likewise cannot handle the insane and the senile.\nBy this point, the words “bizarre conclusions” appear to be a strong case of projection.  Libertarianism does NOT treat children like adults, nor does it have any problem handling the insane and the senile.  The only party with any noticeable elements for expanding children’s rights is not the Libertarians, but the Democrats, the stronger of the two strong government parties.\nLibertarians argue that radical permissiveness, like legalizing drugs, would not shred a libertarian society because drug users who caused trouble would be disciplined by the threat of losing their jobs or homes if current laws that make it difficult to fire or evict people were abolished. They claim a “natural order” of reasonable behavior would emerge. But there is no actual empirical proof that this would happen. Furthermore, this means libertarianism is an all-or-nothing proposition: if society continues to protect people from the consequences of their actions in any way, libertarianism regarding specific freedoms is illegitimate. And since society does so protect people, libertarianism is an illegitimate moral position until the Great Libertarian Revolution has occurred.\nSociety protects people?  Really?  Actually, if Locke bothered to let facts get in the way of his elaborate fantasy construction, he’d know that society, in the form of government or the police, is in no way legally obligated to protect anyone.  As far as empirical proofs with regards to drugs go, there is ample empirical proof that the Drug War erodes liberty and erodes security at the same time.\nAnd is society really wrong to protect people against the negative consequences of some of their free choices? While it is obviously fair to let people enjoy the benefits of their wise choices and suffer the costs of their stupid ones, decent societies set limits on both these outcomes. People are allowed to become millionaires, but they are taxed. They are allowed to go broke, but they are not then forced to starve. They are deprived of the most extreme benefits of freedom in order to spare us the most extreme costs. The libertopian alternative would be perhaps a more glittering society, but also a crueler one.\nLike a Marxist\n, Locke conflates empathy with government action.  A libertarian society wouldn’t necessarily be any crueller, in fact, without the illusion of government “help”, individuals and churches would be more inclined to pick up the slack, as they did in the days before the conservative Great Society of LBJ.  Locke provides more evidence for an article called Conservatives: Marxists of the Right than he does for his actual premise.\nEmpirically, most people don’t actually want absolute freedom, which is why democracies don’t elect libertarian governments. Irony of ironies, people don’t choose absolute freedom. But this refutes libertarianism by\nits own premise, as libertarianism defines the good as the freely chosen, yet people do not choose it. Paradoxically, people exercise their freedom not to be libertarians.\nThis is why a lot of people bitched about the AT&T breakup too.  And yet, there’s not a lot of people pining for the days of black rotary-dialed telephones either.  The fact that most people wanted to be treated like sheep doesn’t mean that it is right to do so.\nThe political corollary of this is that since no electorate will support libertarianism, a libertarian government could never be achieved democratically but would have to be imposed by some kind of authoritarian state, which rather puts the lie to libertarians’ claim that under any other philosophy, busybodies who claim to know what’s best for other people impose their values on the rest of us. Libertarianism itself is based on the conviction that it is the one true political philosophy and all others are false. It entails imposing a certain kind of society, with all its attendant pluses and minuses, which the inhabitants thereof will not be free to opt out of except by leaving.\nAs opposed to the establishment of democracies in Iraq and America, which were established by an electorate and not military force.  Wait a minute!  Again, Locke is simply making silly loops around a differently-colored sky.  And at least libertarians will allow people to opt out by leaving, the same is not true of any Marxist society, or even modern American society.  There’s a few more paragraphs, but at this point I got bored and what I’ve covered should suffice to demonstrate that Locke does not even begin to make a case against the libertarian philosophy, much less prove its relationship to Marxism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-14T08:30:00+00:00"
}