{
  "url": "https://voxday.net/2005/03/03/superphreak/",
  "scraped_at": "2026-01-08T19:55:19.830832",
  "title": "Superphreak",
  "date_display": "March 3, 2005",
  "date_iso": "2005-03-03T17:14:00+00:00",
  "date_from_url": "2005-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’ve got to love the technofreaks.  Even if I didn’t loathe Microsoft – and I do, by the mad pipings of Azathoth, I sure do – I think I’d have to switch to Linux based on the inspiration of this heart-warming story alone.  Thanks to oneJohn for bringing this to our attention.</p><blockquote><p>The project began when Nils Schneider, a 17-year-old computer science student from Germany, received an iPod for Christmas. Unlike most new iPod owners, he decided to install Linux – a freely available computer operating system not used as standard in iPods – on his device.</p><p>The existing version of Linux for the iPod would not install easily, however, as the latest generation of player features new hardware.  Undeterred, Schneider decided to figure out how these components worked by himself. He found he could control some parts of the device but not <br>those containing details about the way the unit starts up, which is vital to getting Linux installed.</br></p><p>Instead of going through the usual process of trial and error to work out the code, Schneider realised that listening to it could provide a shortcut. Bernard Leach, a UK software engineer who helped set up the so-called iPod Linux project, had already worked out how to control the piezoelectric component within the iPod that produces the click.</p><p>To decipher the bootloader code – the program which allows the iPod to start up – Schneider decided to use Leach’s system to play the bootloader code as sound.  “I just tried to encode a single byte as a click sound with different spaces between the clicks,” Schneider told New Scientist. “It seemed to  work but it was slow so I played around with the code and found out how <br>to make the clicks faster.”</br></p><p>After encoding the bootloader data he recorded the resulting sounds onto another PC programmed to convert it back into computer code. The whole process took more than 20 hours and Schneider had to construct a sound proof box for the recording. But, in the end, he had extracted the information intact. This made it possible to get Linux running on the device, along with a variety of compatible software programs such as simple games and audio recorders.</p><p>“After extracting the bootloader it was only a couple of days’ worth of work to get iPod Linux booting,” Leach told New Scientist. “Otherwise it would have taken months.”</p></blockquote><p>Does anyone doubt that the kid would have forged on anyhow even if it did take months?  This bizarre impulse to mess around with things is why we’re not all still living in caves, mud huts and thatched dwellings.  I love the phrase “unlike most new iPod owners”, as if ten or fifteen percent of them are modifying the operating systems.</p></div>",
  "content_text": "You’ve got to love the technofreaks.  Even if I didn’t loathe Microsoft – and I do, by the mad pipings of Azathoth, I sure do – I think I’d have to switch to Linux based on the inspiration of this heart-warming story alone.  Thanks to oneJohn for bringing this to our attention.\nThe project began when Nils Schneider, a 17-year-old computer science student from Germany, received an iPod for Christmas. Unlike most new iPod owners, he decided to install Linux – a freely available computer operating system not used as standard in iPods – on his device.\nThe existing version of Linux for the iPod would not install easily, however, as the latest generation of player features new hardware.  Undeterred, Schneider decided to figure out how these components worked by himself. He found he could control some parts of the device but not\nthose containing details about the way the unit starts up, which is vital to getting Linux installed.\nInstead of going through the usual process of trial and error to work out the code, Schneider realised that listening to it could provide a shortcut. Bernard Leach, a UK software engineer who helped set up the so-called iPod Linux project, had already worked out how to control the piezoelectric component within the iPod that produces the click.\nTo decipher the bootloader code – the program which allows the iPod to start up – Schneider decided to use Leach’s system to play the bootloader code as sound.  “I just tried to encode a single byte as a click sound with different spaces between the clicks,” Schneider told New Scientist. “It seemed to  work but it was slow so I played around with the code and found out how\nto make the clicks faster.”\nAfter encoding the bootloader data he recorded the resulting sounds onto another PC programmed to convert it back into computer code. The whole process took more than 20 hours and Schneider had to construct a sound proof box for the recording. But, in the end, he had extracted the information intact. This made it possible to get Linux running on the device, along with a variety of compatible software programs such as simple games and audio recorders.\n“After extracting the bootloader it was only a couple of days’ worth of work to get iPod Linux booting,” Leach told New Scientist. “Otherwise it would have taken months.”\nDoes anyone doubt that the kid would have forged on anyhow even if it did take months?  This bizarre impulse to mess around with things is why we’re not all still living in caves, mud huts and thatched dwellings.  I love the phrase “unlike most new iPod owners”, as if ten or fifteen percent of them are modifying the operating systems.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-03T17:14:00+00:00"
}