{
  "url": "https://voxday.net/2005/03/04/untwist-panties-people/",
  "scraped_at": "2026-01-08T19:55:28.962128",
  "title": "Untwist the panties, people",
  "date_display": "March 4, 2005",
  "date_iso": "2005-03-04T18:00:00+00:00",
  "date_from_url": "2005-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Bradley Smith says that <a href=\"http://news.com.com/The+coming+crackdown+on+blogging/2008-1028_3-5597079.html?tag=st.prev\">the freewheeling days of political blogging and online punditry are over</a>. In just a few months, he warns, bloggers and news organizations could risk the wrath of the federal government if they improperly link to a campaign’s Web site. Even forwarding a political candidate’s press release to a mailing list, depending on the details, could be punished by fines.</p><p>Smith should know. He’s one of the six commissioners at the Federal Election Commission, which is beginning the perilous process of extending a controversial 2002 campaign finance law to the Internet.</p><p>In 2002, the FEC exempted the Internet by a 4-2 vote, but U.S. District Judge Colleen Kollar-Kotelly last fall overturned that decision. “The commission’s exclusion of Internet communications from the coordinated communications regulation severely undermines” the campaign finance law’s purposes, Kollar-Kotelly wrote.</p></blockquote><p>I saw this yesterday but didn’t even bother commenting on it.  The notion is absurd.  The Clinton administration wanted to shut down WND and even sent the IRS after it – Al Gore is still suing them, if I recall correctly – and couldn’t do so despite the fact that as a corporation that has people dependent on getting paid by it for a living, it is far more vulnerable than blogs.</p><p>The government might be able to make life a little more difficult for Blogspot and other hosting services, and will almost certainly be a pain for the Kos-style professional bloggers, but it will be virtually impossible to shut down blogs like this one, at least until the globalist traitors in the US manage to hand the Internet over to the UN.  In the meantime, hosting it somewhere outside of US jurisdiction would be a matter of hours, if not minutes.</p><p>Color me both unsurprised and unconcerned.  There’s a lot of things to be genuinely concerned about; this isn’t one of them.  It’s ironic that blogs like the Captain’s Quarters would get their panties in a bunch over this, while simultaneously saluting the UN’s embrace of military power.</p></div>",
  "content_text": "Bradley Smith says that\nthe freewheeling days of political blogging and online punditry are over\n. In just a few months, he warns, bloggers and news organizations could risk the wrath of the federal government if they improperly link to a campaign’s Web site. Even forwarding a political candidate’s press release to a mailing list, depending on the details, could be punished by fines.\nSmith should know. He’s one of the six commissioners at the Federal Election Commission, which is beginning the perilous process of extending a controversial 2002 campaign finance law to the Internet.\nIn 2002, the FEC exempted the Internet by a 4-2 vote, but U.S. District Judge Colleen Kollar-Kotelly last fall overturned that decision. “The commission’s exclusion of Internet communications from the coordinated communications regulation severely undermines” the campaign finance law’s purposes, Kollar-Kotelly wrote.\nI saw this yesterday but didn’t even bother commenting on it.  The notion is absurd.  The Clinton administration wanted to shut down WND and even sent the IRS after it – Al Gore is still suing them, if I recall correctly – and couldn’t do so despite the fact that as a corporation that has people dependent on getting paid by it for a living, it is far more vulnerable than blogs.\nThe government might be able to make life a little more difficult for Blogspot and other hosting services, and will almost certainly be a pain for the Kos-style professional bloggers, but it will be virtually impossible to shut down blogs like this one, at least until the globalist traitors in the US manage to hand the Internet over to the UN.  In the meantime, hosting it somewhere outside of US jurisdiction would be a matter of hours, if not minutes.\nColor me both unsurprised and unconcerned.  There’s a lot of things to be genuinely concerned about; this isn’t one of them.  It’s ironic that blogs like the Captain’s Quarters would get their panties in a bunch over this, while simultaneously saluting the UN’s embrace of military power.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-03-04T18:00:00+00:00"
}