{
  "url": "https://voxday.net/2011/05/03/and-anomalies-begin/",
  "scraped_at": "2025-12-13T23:09:55.348136",
  "title": "And the anomalies begin",
  "date_display": "May 3, 2011",
  "date_iso": "2011-05-03T07:39:00+00:00",
  "date_from_url": "2011-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>May 2, 2011: <i>“Bin Laden — given the code name “Geronimo” by US officials — was found in the compound with one of his young wives, who identified him by name.  According to White House counterterrorism adviser John Brennan, the woman died as she shielded bin Laden. Brennan said it was unclear whether she was attempting to protect the terrorist leader of her own free will, or whether he deliberately placed her in the line of fire. However, defense officials have confirmed that women were deliberately used as human shields to protect the compound’s male inhabitants.”</i></p><p>May 3, 2011: <i>“A woman killed during the raid of Osama bin Laden’s compound in Pakistan was not his wife and was not used as a human shield by the al Qaeda leader before his death, a U.S. official said on Monday, correcting an earlier description.  John Brennan, President Barack Obama’s top counter- terrorism adviser, told reporters earlier that the slain woman had been one of bin Laden’s wives and had been used — perhaps voluntarily — as a shield during the firefight.  However, a different White House official said that account had turned out not to be the case. Bin Laden’s wife was injured but not killed in the assault.”</i></p><p>There would appear to be one piece of the ID evidence gone, along with the body.  If she wasn’t his wife and she wasn’t killed while shielding him, we have to assume that she also did not identify him.  This leaves DNA and photos, although the DNA evidence <a href=\"http://www.nationaljournal.com/tech/did-dna-finger-bin-laden--20110502\">may be less conclusive</a> than would be desirable.</p><p>I think the best evidence that those of us on the outside have is that the USA was willing to violate Pakistani sovereignty in order to take out the target.  I have no doubt that the White House genuinely believed it was Osama in the compound or that they killed someone there, the question is whether they were correct or not.  And so far, the evidence they have offered is far from convincing, especially since we know they have the entire thing on video.  If the post-mortem pictures are too gruesome to be released, then why not release several stills from the video before he was shot along with a statement from his surviving wife?</p><p>UPDATE: The Official Story <a href=\"http://www.politico.com/news/stories/0511/54162.html\">continues to evolve</a>: <i>“The White House backed away Monday evening from key details in its narrative about the raid that killed Osama bin Laden, including claims by senior U.S. officials that the Al Qaeda leader had a weapon and may have fired it during a gun battle with U.S. forces.  Officials also retreated from claims that one of bin Laden’s wives was killed in the raid and that bin Laden was using her as a human shield before she was shot by U.S. forces.”</i></p><p>So no body, no photos, no witnesses, and the story is changing despite the report that the White House officials watched the entire raid on video.  Conclusion: the tale of bin Laden’s demise is possibly – though not necessarily – a fiction.  That someone was killed at the compound by the Navy Seals is not in doubt, only the question of whom.  And if it was someone other than bin Laden, one can only hope that the graphic artists at the White House now busily engaged in photoshopping the corpse images are more competent than those who produced the forged birth certificate.</p><p>UPDATE II:  Good news!  The first White House photoshopper appears to be finished with his <a href=\"http://games1234.net/gimg/75438e60-0971-4de9-bf8f-56da594b09cc.jpg\">image of Obama’s demise</a>.  Warning, it is very disturbing.</p></div>",
  "content_text": "May 2, 2011:\n“Bin Laden — given the code name “Geronimo” by US officials — was found in the compound with one of his young wives, who identified him by name.  According to White House counterterrorism adviser John Brennan, the woman died as she shielded bin Laden. Brennan said it was unclear whether she was attempting to protect the terrorist leader of her own free will, or whether he deliberately placed her in the line of fire. However, defense officials have confirmed that women were deliberately used as human shields to protect the compound’s male inhabitants.”\nMay 3, 2011:\n“A woman killed during the raid of Osama bin Laden’s compound in Pakistan was not his wife and was not used as a human shield by the al Qaeda leader before his death, a U.S. official said on Monday, correcting an earlier description.  John Brennan, President Barack Obama’s top counter- terrorism adviser, told reporters earlier that the slain woman had been one of bin Laden’s wives and had been used — perhaps voluntarily — as a shield during the firefight.  However, a different White House official said that account had turned out not to be the case. Bin Laden’s wife was injured but not killed in the assault.”\nThere would appear to be one piece of the ID evidence gone, along with the body.  If she wasn’t his wife and she wasn’t killed while shielding him, we have to assume that she also did not identify him.  This leaves DNA and photos, although the DNA evidence\nmay be less conclusive\nthan would be desirable.\nI think the best evidence that those of us on the outside have is that the USA was willing to violate Pakistani sovereignty in order to take out the target.  I have no doubt that the White House genuinely believed it was Osama in the compound or that they killed someone there, the question is whether they were correct or not.  And so far, the evidence they have offered is far from convincing, especially since we know they have the entire thing on video.  If the post-mortem pictures are too gruesome to be released, then why not release several stills from the video before he was shot along with a statement from his surviving wife?\nUPDATE: The Official Story\ncontinues to evolve\n:\n“The White House backed away Monday evening from key details in its narrative about the raid that killed Osama bin Laden, including claims by senior U.S. officials that the Al Qaeda leader had a weapon and may have fired it during a gun battle with U.S. forces.  Officials also retreated from claims that one of bin Laden’s wives was killed in the raid and that bin Laden was using her as a human shield before she was shot by U.S. forces.”\nSo no body, no photos, no witnesses, and the story is changing despite the report that the White House officials watched the entire raid on video.  Conclusion: the tale of bin Laden’s demise is possibly – though not necessarily – a fiction.  That someone was killed at the compound by the Navy Seals is not in doubt, only the question of whom.  And if it was someone other than bin Laden, one can only hope that the graphic artists at the White House now busily engaged in photoshopping the corpse images are more competent than those who produced the forged birth certificate.\nUPDATE II:  Good news!  The first White House photoshopper appears to be finished with his\nimage of Obama’s demise\n.  Warning, it is very disturbing.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-03T06:39:00+00:00"
}