{
  "url": "https://voxday.net/2011/05/11/another-denomination-bites-dus/",
  "scraped_at": "2025-12-13T23:10:39.123962",
  "title": "Another denomination bites the dust",
  "date_display": "May 11, 2011",
  "date_iso": "2011-05-11T17:00:00+00:00",
  "date_from_url": "2011-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the Presbyterian Church joins the growing collection of denominations dead <a href=\"http://www.nytimes.com/2011/05/11/us/11presbyterian.html?hp\">by theological suicide</a>:</p><blockquote><p>With a vote in Minneapolis, the Presbyterian Church (U.S.A.) is expected to pass a measure on Tuesday afternoon allowing openly gay people in same-sex relationships to be ordained as ministers, elders and deacons.</p><p>Although Presbyterians have been debating the issue since 1978, the news will most likely come as a surprise to many church members. Only two years ago, a majority of the church’s regions, known as presbyterys, voted against ordaining openly gay candidates.</p><p>This time, 19 of the church’s 173 presbyterys so far have switched their votes from no to yes. The Twin Cities presbytery, which covers the Minneapolis and St. Paul region, is expected to cast the deciding vote at its meeting on Tuesday.</p><p>The Rev. Heidi Vardeman, senior minister of Macalester Plymouth United Church, in St. Paul, said in an interview, “Finally, the denomination has seen the error of its ways and it will repent, which means, literally, to turn around.”</p></blockquote><p>The “Reverend” Heidi clearly has her directions confused.  What the Presbyterian Church has to repent from, and from which it must literally turn around, is its present course, which is headed for extinction.  The report mentions that 100 congregations have already left, and more will likely leave soon.  It is a dying denomination that is already down to only 2 million members; this action means that they’ll likely fall below one million within a decade.</p><p>As I have often stated, female pastors are the first sign of a church dancing with the theological death spiral.  It is safe to conclude that gay pastors are the final one, an indication that the spiral will soon be complete.  And yes, I am aware of my old church’s <a href=\"http://whchurch.org/about/beliefs/controversial-issues\">position on the matter</a>: “We affirm that ministerial authority is based upon a person’s character, calling and giftedness, not his or her gender.”</p></div>",
  "content_text": "And the Presbyterian Church joins the growing collection of denominations dead\nby theological suicide\n:\nWith a vote in Minneapolis, the Presbyterian Church (U.S.A.) is expected to pass a measure on Tuesday afternoon allowing openly gay people in same-sex relationships to be ordained as ministers, elders and deacons.\nAlthough Presbyterians have been debating the issue since 1978, the news will most likely come as a surprise to many church members. Only two years ago, a majority of the church’s regions, known as presbyterys, voted against ordaining openly gay candidates.\nThis time, 19 of the church’s 173 presbyterys so far have switched their votes from no to yes. The Twin Cities presbytery, which covers the Minneapolis and St. Paul region, is expected to cast the deciding vote at its meeting on Tuesday.\nThe Rev. Heidi Vardeman, senior minister of Macalester Plymouth United Church, in St. Paul, said in an interview, “Finally, the denomination has seen the error of its ways and it will repent, which means, literally, to turn around.”\nThe “Reverend” Heidi clearly has her directions confused.  What the Presbyterian Church has to repent from, and from which it must literally turn around, is its present course, which is headed for extinction.  The report mentions that 100 congregations have already left, and more will likely leave soon.  It is a dying denomination that is already down to only 2 million members; this action means that they’ll likely fall below one million within a decade.\nAs I have often stated, female pastors are the first sign of a church dancing with the theological death spiral.  It is safe to conclude that gay pastors are the final one, an indication that the spiral will soon be complete.  And yes, I am aware of my old church’s\nposition on the matter\n: “We affirm that ministerial authority is based upon a person’s character, calling and giftedness, not his or her gender.”",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-11T16:00:00+00:00"
}