{
  "url": "https://voxday.net/2011/05/01/atheists-lamen/",
  "scraped_at": "2025-12-13T23:09:46.208721",
  "title": "The atheist’s lament",
  "date_display": "May 1, 2011",
  "date_iso": "2011-05-01T19:17:00+00:00",
  "date_from_url": "2011-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why, oh why, he wonders, do those stupid and evil Bible thumpers who know nothing about science, and shouldn’t be allowed to vote or raise their own children, <a href=\"http://www.washingtonpost.com/opinions/why-do-americans-still-dislike-atheists/2011/02/18/AFqgnwGF_story.html\">dislike someone so objectively wonderful as me</a>?</p><blockquote><p>Those who don’t believe in God are widely considered to be immoral, wicked and angry. They can’t join the Boy Scouts. Atheist soldiers are rated potentially deficient when they do not score as sufficiently “spiritual” in military psychological evaluations. Surveys find that most Americans refuse or are reluctant to marry or vote for nontheists; in other words, nonbelievers are one minority still commonly denied in practical terms the right to assume office despite the constitutional ban on religious tests.</p><p>Rarely denounced by the mainstream, this stunning anti-atheist discrimination is egged on by Christian conservatives who stridently — and uncivilly — declare that the lack of godly faith is detrimental to society, rendering nonbelievers intrinsically suspect and second-class citizens.</p><p>Is this knee-jerk dislike of atheists warranted? Not even close.</p></blockquote><p>It never ceases to be amusing when socially inept assholes take the trouble of listing the reasons why they believe people should like them.  Never mind the fact that the guy shows himself to be both disagreeble and dishonest in the very article where he is lecturing America for not liking him.</p><p>It’s really not that hard to explain.  No one likes people who offer them unsolicited advice, much less tell them what to do from an unwarranted position of assumed superiority.  And as anyone who knows more than two or three atheists has experienced at one point or another, far too many atheists simply do not understand the concept of “live and let live”.  No one hates atheists because they don’t believe in God; agnostics don’t believe in God either.  People tend to dislike atheists because so many of them are socially autistic jerks who are simply a massive pain in the posterior.  The whining about Christian incivility is as hilarious as it is untrue; many atheists are so emotionally undeveloped that they cannot bear to be treated in the same manner that they habitually treat everyone else.</p><p>If everyone thinks you are an obnoxious prick, the solution is not to attempt to argue them out of their opinion, but rather <i>to stop behaving like an obnoxious prick</i>.  And to think these are the very people who believe they are more rational than everyone else.</p><p>NB: I am obviously not describing all atheists here.  There are plenty of perfectly likeable and intelligent atheists who are quite willing to leave others to live and believe as they like.  But if the gentleman writing in the Washington Post is going to attempt to defend the likeability of atheists in very broad and general terms, he must accept the validity of contrarian evidence given in the same manner.</p></div>",
  "content_text": "Why, oh why, he wonders, do those stupid and evil Bible thumpers who know nothing about science, and shouldn’t be allowed to vote or raise their own children,\ndislike someone so objectively wonderful as me\n?\nThose who don’t believe in God are widely considered to be immoral, wicked and angry. They can’t join the Boy Scouts. Atheist soldiers are rated potentially deficient when they do not score as sufficiently “spiritual” in military psychological evaluations. Surveys find that most Americans refuse or are reluctant to marry or vote for nontheists; in other words, nonbelievers are one minority still commonly denied in practical terms the right to assume office despite the constitutional ban on religious tests.\nRarely denounced by the mainstream, this stunning anti-atheist discrimination is egged on by Christian conservatives who stridently — and uncivilly — declare that the lack of godly faith is detrimental to society, rendering nonbelievers intrinsically suspect and second-class citizens.\nIs this knee-jerk dislike of atheists warranted? Not even close.\nIt never ceases to be amusing when socially inept assholes take the trouble of listing the reasons why they believe people should like them.  Never mind the fact that the guy shows himself to be both disagreeble and dishonest in the very article where he is lecturing America for not liking him.\nIt’s really not that hard to explain.  No one likes people who offer them unsolicited advice, much less tell them what to do from an unwarranted position of assumed superiority.  And as anyone who knows more than two or three atheists has experienced at one point or another, far too many atheists simply do not understand the concept of “live and let live”.  No one hates atheists because they don’t believe in God; agnostics don’t believe in God either.  People tend to dislike atheists because so many of them are socially autistic jerks who are simply a massive pain in the posterior.  The whining about Christian incivility is as hilarious as it is untrue; many atheists are so emotionally undeveloped that they cannot bear to be treated in the same manner that they habitually treat everyone else.\nIf everyone thinks you are an obnoxious prick, the solution is not to attempt to argue them out of their opinion, but rather\nto stop behaving like an obnoxious prick\n.  And to think these are the very people who believe they are more rational than everyone else.\nNB: I am obviously not describing all atheists here.  There are plenty of perfectly likeable and intelligent atheists who are quite willing to leave others to live and believe as they like.  But if the gentleman writing in the Washington Post is going to attempt to defend the likeability of atheists in very broad and general terms, he must accept the validity of contrarian evidence given in the same manner.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-01T18:17:00+00:00"
}