{
  "url": "https://voxday.net/2011/05/21/be-very-afraid/",
  "scraped_at": "2025-12-13T23:11:30.889234",
  "title": "Be very afraid",
  "date_display": "May 21, 2011",
  "date_iso": "2011-05-21T20:16:00+00:00",
  "date_from_url": "2011-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would seem the solution to cowbell is <a href=\"http://www.bloomberg.com/news/2011-05-20/summers-says-he-s-seeing-bubble-concern-in-u-s-technology-as-stocks-soar.html\">MORE COWBELL</a>:</p><blockquote><p>“Today there are very substantial risks, to be sure, but the economy is growing, unemployment is falling and financial conditions are normalized,” said Summers, who was director of the White House National Economic Council in the Obama administration from 2009 to 2010.</p><p>Summers said the “central irony” of a financial crisis is that it’s caused by too much confidence, borrowing and lending, and is resolved by more confidence, borrowing and spending.</p></blockquote><p>There is no irony there because <i>it isn’t a solution</i>.  This is exactly what I meant by “buying time” and what others have meant by “extend and pretend”.  There is little chance that Summers actually believes this, but the financial charlatans of the world now have no choice but to keep clinging to the tiger’s tail while hoping for a miracle.</p></div>",
  "content_text": "It would seem the solution to cowbell is\nMORE COWBELL\n:\n“Today there are very substantial risks, to be sure, but the economy is growing, unemployment is falling and financial conditions are normalized,” said Summers, who was director of the White House National Economic Council in the Obama administration from 2009 to 2010.\nSummers said the “central irony” of a financial crisis is that it’s caused by too much confidence, borrowing and lending, and is resolved by more confidence, borrowing and spending.\nThere is no irony there because\nit isn’t a solution\n.  This is exactly what I meant by “buying time” and what others have meant by “extend and pretend”.  There is little chance that Summers actually believes this, but the financial charlatans of the world now have no choice but to keep clinging to the tiger’s tail while hoping for a miracle.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-21T19:16:00+00:00"
}