{
  "url": "https://voxday.net/2011/05/14/brave-sir-robins-of-atheis/",
  "scraped_at": "2025-12-13T23:10:50.486934",
  "title": "The Brave Sir Robins of atheism",
  "date_display": "May 14, 2011",
  "date_iso": "2011-05-14T10:16:00+00:00",
  "date_from_url": "2011-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Telegraph reports that Richard Dawkins <a href=\"http://www.telegraph.co.uk/news/religion/8511931/Richard-Dawkins-accused-of-cowardice-for-refusing-to-debate-existence-of-God.html\">is exhibiting some well-founded cowardice</a>:</p><blockquote><p>A war of words has broken out between the best selling author of The God Delusion, and his critics, who see his refusal to take on the American academic, William Lane Craig, as a “glaring” failure and a sign that he may be losing his nerve.</p><p>Prof Dawkins maintains that Prof Craig is not a figure worthy of his attention and has reportedly said that such a contest would “look good” on his opponent’s CV but not on his own.  An emeritus fellow of New College, Oxford, Prof Dawkins last year supported a plan to charge Pope Benedict XVI with crimes against humanity for his alleged involvement in the cover-up of sex abuse by Catholic priests.  Prof Craig is a research Professor of Philosophy at Talbot School of Theology, in California, and the author of 30 books and hundreds of scholarly articles on Christianity.  He has debated with leading thinkers including Daniel Dennett, A.C.Grayling, Christopher Hitchens, Lewis Wolpert and Sam Harris.</p><p>Prof Craig is due to visit Britain in October this year. Four invitations to take part in public debates were sent to Prof Dawkins from The British Humanist Association, The Cambridge Debating Union, the Oxford Christian Union and Premier Radio.</p><p>Prof Dawkins declined them all. He told The Daily Telegraph that he had recently debated Prof Craig, in a boxing ring, in Mexico, and claimed he was not impressed by his opponent. His critics say this event was a six-person discussion, not a rigorous debate, but Prof Dawkins disagrees.</p><p>“I have no intention of assisting Craig in his relentless drive for self-promotion,” he said.</p><p>Some of Prof Dawkins’s contemporaries are not impressed. Dr Daniel Came, a philosophy lecturer and fellow atheist, from Worcester College, Oxford, wrote to him urging him to reconsider his refusal to debate the existence of God with Prof Craig.  In a letter to Prof Dawkins, Dr Came said: “The absence of a debate with the foremost apologist for Christian theism is a glaring omission on your CV and is of course apt to be interpreted as cowardice on your part.  I notice that, by contrast, you are happy to discuss theological matters with television and radio presenters and other intellectual heavyweights like Pastor Ted Haggard of the National Association of Evangelicals and Pastor Keenan Roberts of the Colorado Hell House.”</p></blockquote><p>First, the idea that Dawkins would accuse anyone else of a “relentless drive for self-promotion” is amusing.  Dawkins is one of the most self-promoting individuals on the planet.  Even <i>The God Delusion</i> was little more than a belated attempt to jump on the atheist book bandwagon that Sam Harris and Michel Onfray got rolling.  Second, it is encouraging that some atheists are intellectually honest enough to refuse to defend Dawkins’s clear cowardice.  Third, note that the invitations Dawkins is rejecting are not coming from Craig, but from various organizations, including one with which Dawkins is affiliated as a vice-president.</p><p>Still, Dawkins is likely correct in asserting that the contest would look good on Craig’s CV and bad on his own, because the chances are good that Craig would destroy Dawkins in much the same way that he destroyed Harris.  Of course, at his age, Dawkkins isn’t concerned about his CV so much as his legacy.  Dawkins’s concerns don’t stem from Craig being a particularly formidable debater, although he is quite clearly a competent and successful one, but because he has presented as case against the existence of God that is absolutely full of factual and logical flaws that are easily exposed.  Anyone who has read TIA and is quick enough to recognize Dawkins’s deceptive little bait-and-switches and call them out would be able to beat the man in a debate without too much trouble.  This is because Dawkins is not only a coward, but as <a href=\"http://www.spectator.co.uk/melaniephillips/3571996/the-truth-delusion-of-richard-dawkins.thtml\">Melanie Philips</a> has pointed out, “is sloppy and cavalier with both facts and reasoning to a disturbing degree.”  The man is simply no longer a credible intellectual figure.</p><p>I have no doubt that Dawkins’s cheerleaders will attempt to justify his cowardice, just as PZ Myers’s fans attempted to justify everyone’s favorite community college professor’s repeated retreats from my debate challenges.  And while the cheerleaders will loudly proclaim the deathless courage of their godless heroes, they know perfectly well that the reluctance to debate demonstrated by the likes of Dawkins and Myers whenever a formidable opponent presents himself is not founded on confidence in their intellectual prowess or positions, but rather the awarenesss that they cannot successfully defend their positions against competent opponents.  Dawkins is avoiding a debate with Craig for precisely the same reasons Myers has been avoiding a debate with me.  They are the Brave Sir Robins of atheism.</p><p>The Fowl Atheist <a href=\"http://scienceblogs.com/pharyngula/2011/05/we_arent_angry_were_effective.php\">recently confessed</a>: <i>“I’ll also cop to the obvious fact that, knowing that reason will not get through their skills, I’m happy to use emotional arguments as well. Passion is persuasive. Look at all those assertive Gnu/New Atheists — they are not making Spock-like dispassionate arguments only, although there is a strong rational core — we are hitting people in the gut and telling them to open their eyes. It gives us that unseemly aggressive reputation, but at the same time it’s a very effective way to let people know we think they are dead wrong.”</i></p><p>Note that PZ is readily admitting to “the obvious fact” of his use of logically invalid appeals to emotion.  It is obvious, it always was obvious, and he is not the only New Atheist to rely upon them.  But I must correct him: Myers provides emotional arguments <i>in the place of reason</i> due to the way in which his attempts at reason-based arguments tend to be inept and incorrect.  See The Courier’s Reply for both proof and amusement.  That’s why PZ is terrified to debate anyone who is his rational and intellectual superior and instead seeks out debates with half-educated creationists who couldn’t argue their way out of a paper bag and don’t know how to deal with his naked appeals to emotion.  What passes for PZ’s “reason” can’t get through our skills because his arguments are irrational and unfounded in correct fact and logic.</p><p>As for Spock-like dispassionate arguments and the claimed “rational core”, there isn’t a single New Atheist who reliably produces substantive logic-based arguments.  Christopher Hitchens relies upon telling personal and historical anecdotes, Sam Harris usually asks leading questions before leaping to unsupported and incorrect conclusions, Richard Dawkins offers constant bait-and-switches in lieu of argument, and Daniel Dennett doesn’t even construct many direct arguments on the subject at all.  None of them have managed to produce much of philosophical relevance that Jean Meslier hadn’t already articulated in 1729.</p></div>",
  "content_text": "The Telegraph reports that Richard Dawkins\nis exhibiting some well-founded cowardice\n:\nA war of words has broken out between the best selling author of The God Delusion, and his critics, who see his refusal to take on the American academic, William Lane Craig, as a “glaring” failure and a sign that he may be losing his nerve.\nProf Dawkins maintains that Prof Craig is not a figure worthy of his attention and has reportedly said that such a contest would “look good” on his opponent’s CV but not on his own.  An emeritus fellow of New College, Oxford, Prof Dawkins last year supported a plan to charge Pope Benedict XVI with crimes against humanity for his alleged involvement in the cover-up of sex abuse by Catholic priests.  Prof Craig is a research Professor of Philosophy at Talbot School of Theology, in California, and the author of 30 books and hundreds of scholarly articles on Christianity.  He has debated with leading thinkers including Daniel Dennett, A.C.Grayling, Christopher Hitchens, Lewis Wolpert and Sam Harris.\nProf Craig is due to visit Britain in October this year. Four invitations to take part in public debates were sent to Prof Dawkins from The British Humanist Association, The Cambridge Debating Union, the Oxford Christian Union and Premier Radio.\nProf Dawkins declined them all. He told The Daily Telegraph that he had recently debated Prof Craig, in a boxing ring, in Mexico, and claimed he was not impressed by his opponent. His critics say this event was a six-person discussion, not a rigorous debate, but Prof Dawkins disagrees.\n“I have no intention of assisting Craig in his relentless drive for self-promotion,” he said.\nSome of Prof Dawkins’s contemporaries are not impressed. Dr Daniel Came, a philosophy lecturer and fellow atheist, from Worcester College, Oxford, wrote to him urging him to reconsider his refusal to debate the existence of God with Prof Craig.  In a letter to Prof Dawkins, Dr Came said: “The absence of a debate with the foremost apologist for Christian theism is a glaring omission on your CV and is of course apt to be interpreted as cowardice on your part.  I notice that, by contrast, you are happy to discuss theological matters with television and radio presenters and other intellectual heavyweights like Pastor Ted Haggard of the National Association of Evangelicals and Pastor Keenan Roberts of the Colorado Hell House.”\nFirst, the idea that Dawkins would accuse anyone else of a “relentless drive for self-promotion” is amusing.  Dawkins is one of the most self-promoting individuals on the planet.  Even\nThe God Delusion\nwas little more than a belated attempt to jump on the atheist book bandwagon that Sam Harris and Michel Onfray got rolling.  Second, it is encouraging that some atheists are intellectually honest enough to refuse to defend Dawkins’s clear cowardice.  Third, note that the invitations Dawkins is rejecting are not coming from Craig, but from various organizations, including one with which Dawkins is affiliated as a vice-president.\nStill, Dawkins is likely correct in asserting that the contest would look good on Craig’s CV and bad on his own, because the chances are good that Craig would destroy Dawkins in much the same way that he destroyed Harris.  Of course, at his age, Dawkkins isn’t concerned about his CV so much as his legacy.  Dawkins’s concerns don’t stem from Craig being a particularly formidable debater, although he is quite clearly a competent and successful one, but because he has presented as case against the existence of God that is absolutely full of factual and logical flaws that are easily exposed.  Anyone who has read TIA and is quick enough to recognize Dawkins’s deceptive little bait-and-switches and call them out would be able to beat the man in a debate without too much trouble.  This is because Dawkins is not only a coward, but as\nMelanie Philips\nhas pointed out, “is sloppy and cavalier with both facts and reasoning to a disturbing degree.”  The man is simply no longer a credible intellectual figure.\nI have no doubt that Dawkins’s cheerleaders will attempt to justify his cowardice, just as PZ Myers’s fans attempted to justify everyone’s favorite community college professor’s repeated retreats from my debate challenges.  And while the cheerleaders will loudly proclaim the deathless courage of their godless heroes, they know perfectly well that the reluctance to debate demonstrated by the likes of Dawkins and Myers whenever a formidable opponent presents himself is not founded on confidence in their intellectual prowess or positions, but rather the awarenesss that they cannot successfully defend their positions against competent opponents.  Dawkins is avoiding a debate with Craig for precisely the same reasons Myers has been avoiding a debate with me.  They are the Brave Sir Robins of atheism.\nThe Fowl Atheist\nrecently confessed\n:\n“I’ll also cop to the obvious fact that, knowing that reason will not get through their skills, I’m happy to use emotional arguments as well. Passion is persuasive. Look at all those assertive Gnu/New Atheists — they are not making Spock-like dispassionate arguments only, although there is a strong rational core — we are hitting people in the gut and telling them to open their eyes. It gives us that unseemly aggressive reputation, but at the same time it’s a very effective way to let people know we think they are dead wrong.”\nNote that PZ is readily admitting to “the obvious fact” of his use of logically invalid appeals to emotion.  It is obvious, it always was obvious, and he is not the only New Atheist to rely upon them.  But I must correct him: Myers provides emotional arguments\nin the place of reason\ndue to the way in which his attempts at reason-based arguments tend to be inept and incorrect.  See The Courier’s Reply for both proof and amusement.  That’s why PZ is terrified to debate anyone who is his rational and intellectual superior and instead seeks out debates with half-educated creationists who couldn’t argue their way out of a paper bag and don’t know how to deal with his naked appeals to emotion.  What passes for PZ’s “reason” can’t get through our skills because his arguments are irrational and unfounded in correct fact and logic.\nAs for Spock-like dispassionate arguments and the claimed “rational core”, there isn’t a single New Atheist who reliably produces substantive logic-based arguments.  Christopher Hitchens relies upon telling personal and historical anecdotes, Sam Harris usually asks leading questions before leaping to unsupported and incorrect conclusions, Richard Dawkins offers constant bait-and-switches in lieu of argument, and Daniel Dennett doesn’t even construct many direct arguments on the subject at all.  None of them have managed to produce much of philosophical relevance that Jean Meslier hadn’t already articulated in 1729.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-14T09:16:00+00:00"
}