{
  "url": "https://voxday.net/2011/05/31/does-anyone-know-where-ice-t-was/",
  "scraped_at": "2025-12-13T23:12:27.711180",
  "title": "Does anyone know where Ice-T was?",
  "date_display": "May 31, 2011",
  "date_iso": "2011-05-31T20:00:00+00:00",
  "date_from_url": "2011-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am not at all surprised that <a href=\"http://www.mysanantonio.com/news/local_news/article/Rewards-offered-for-info-in-slaying-of-Bexar-1400829.php\">the police are now being targeted for murder</a> due to nothing more than their membership in the Badge Gang.  And there isn’t a soul in the country who can reasonably argue that the police haven’t collectively begged for such targeting, considering how many innocent Americans they have killed with shameless impunity in the last two decades.</p><blockquote><p>Bexar County Sheriff Amadeo Ortiz said the seemingly senseless and coldblooded slaying of a sergeant early Saturday on the East Side has sent a chilling statement to local law enforcement: No one is safe.</p><p>“The way it happened sends a message to the law enforcement community that we’re not safe, even responding to calls and helping citizens,” Ortiz said Sunday. “Officers sometimes get hurt responding to domestic violence calls or shootings, but not while they’re stopped at a red light.”</p><p>Sgt. Kenneth Vann, 48, was en route to a call for a shooting around 2 a.m. Saturday when a small white car pulled up next to his marked patrol car at a red light at Loop 410 and Rigsby Avenue, officials said.  A barrage of shots was fired from the white car, likely from a high-caliber semiautomatic weapon, striking the passenger-side windows of Vann’s patrol car and killing him, officials said.</p></blockquote><p>Now this is the interesting part.  A retired police lieutenant said in the article that the ambush-style killing “is part of a two-year national trend….Every officer in Texas and the U.S. knows there’s a guy who could pull up next to them and kill them. How do you stop that sudden assault?”</p><p>You don’t.  You can’t.  And if you think the police are worried now, just wait until a) they start being gunned down when they leave their homes in the morning and b) their families start being targeted.</p><p>There is only one way the police can stop this and it is to immediately stop the militarization, shut down the SWAT units, end the no-knock raids, and return to keeping the peace rather than swaggering around as law enforcement officers.  Because what is happening is what always happens when the balance of power is tipped too far. <i>If the rules are stacked against you, you stop playing by the rules.</i></p><p>Of course, getting rid of more than 10 million illegal aliens and ending immigration from south of the border would also be a significant help.  But that’s not going to happen either.</p><p>Here’s an interesting comment from a retired cop at Denninger’s place: <i>“I am a former police officer from a high crime town in the Chicago area and have witnessed the changes to police tactics first hand. 20 years ago when I worked patrol we showed up with shoes and leather polished, said Sir when pulling someone over, stopped and talked to the residents and children and tried to de-escalate situations whenever possible to avoid confrontation. Now??? Military style uniforms, AR15’s, Taser’s and the general thinking that that badge gives them additional rights. Act like you are at war and you will be, guaranteed…. Its a shame that I can’t teach my grandson that the police are there to help, because I no longer believe that myself.”</i></p><p>Contrast with this the march protesting the police murder of Marine Jose Guerena.</p><p><i>A group called Oath Keepers organized a march and protest for Jose Guerena.  Guerena was killed by a Pima County SWAT team on May 5th. They entered his home with a search warrant, but deputies said when they went in, Guerena aimed an assault rifle at them. They fired 71 rounds and killed him.  More than a hundred people took part in the march, some of which came from as far away as Vegas. The people said they were there for a number of reasons: pay tribute to a fallen marine, support the victim’s family, and protest the tactics of the SWAT team.</i></p><p>Some protest, some shoot.  If the police don’t abandon their present path of violence and start prosecuting police killers instead of protecting them, they can expect more of the latter and less of the former.</p></div>",
  "content_text": "I am not at all surprised that\nthe police are now being targeted for murder\ndue to nothing more than their membership in the Badge Gang.  And there isn’t a soul in the country who can reasonably argue that the police haven’t collectively begged for such targeting, considering how many innocent Americans they have killed with shameless impunity in the last two decades.\nBexar County Sheriff Amadeo Ortiz said the seemingly senseless and coldblooded slaying of a sergeant early Saturday on the East Side has sent a chilling statement to local law enforcement: No one is safe.\n“The way it happened sends a message to the law enforcement community that we’re not safe, even responding to calls and helping citizens,” Ortiz said Sunday. “Officers sometimes get hurt responding to domestic violence calls or shootings, but not while they’re stopped at a red light.”\nSgt. Kenneth Vann, 48, was en route to a call for a shooting around 2 a.m. Saturday when a small white car pulled up next to his marked patrol car at a red light at Loop 410 and Rigsby Avenue, officials said.  A barrage of shots was fired from the white car, likely from a high-caliber semiautomatic weapon, striking the passenger-side windows of Vann’s patrol car and killing him, officials said.\nNow this is the interesting part.  A retired police lieutenant said in the article that the ambush-style killing “is part of a two-year national trend….Every officer in Texas and the U.S. knows there’s a guy who could pull up next to them and kill them. How do you stop that sudden assault?”\nYou don’t.  You can’t.  And if you think the police are worried now, just wait until a) they start being gunned down when they leave their homes in the morning and b) their families start being targeted.\nThere is only one way the police can stop this and it is to immediately stop the militarization, shut down the SWAT units, end the no-knock raids, and return to keeping the peace rather than swaggering around as law enforcement officers.  Because what is happening is what always happens when the balance of power is tipped too far.\nIf the rules are stacked against you, you stop playing by the rules.\nOf course, getting rid of more than 10 million illegal aliens and ending immigration from south of the border would also be a significant help.  But that’s not going to happen either.\nHere’s an interesting comment from a retired cop at Denninger’s place:\n“I am a former police officer from a high crime town in the Chicago area and have witnessed the changes to police tactics first hand. 20 years ago when I worked patrol we showed up with shoes and leather polished, said Sir when pulling someone over, stopped and talked to the residents and children and tried to de-escalate situations whenever possible to avoid confrontation. Now??? Military style uniforms, AR15’s, Taser’s and the general thinking that that badge gives them additional rights. Act like you are at war and you will be, guaranteed…. Its a shame that I can’t teach my grandson that the police are there to help, because I no longer believe that myself.”\nContrast with this the march protesting the police murder of Marine Jose Guerena.\nA group called Oath Keepers organized a march and protest for Jose Guerena.  Guerena was killed by a Pima County SWAT team on May 5th. They entered his home with a search warrant, but deputies said when they went in, Guerena aimed an assault rifle at them. They fired 71 rounds and killed him.  More than a hundred people took part in the march, some of which came from as far away as Vegas. The people said they were there for a number of reasons: pay tribute to a fallen marine, support the victim’s family, and protest the tactics of the SWAT team.\nSome protest, some shoot.  If the police don’t abandon their present path of violence and start prosecuting police killers instead of protecting them, they can expect more of the latter and less of the former.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-31T19:00:00+00:00"
}