{
  "url": "https://voxday.net/2011/05/24/humble-man/",
  "scraped_at": "2025-12-13T23:11:46.506618",
  "title": "A humble man",
  "date_display": "May 24, 2011",
  "date_iso": "2011-05-24T14:15:00+00:00",
  "date_from_url": "2011-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And one with <a href=\"http://www.nationalreview.com/corner/267941/pawlenty-s-humble-beginnings-christian-schneider\">much about which to be humble</a>, most notably his governance of Minnesota:</p><blockquote><p>Tim Pawlenty <a href=\"http://www.nationalreview.com/corner/267884/pawlenty-s-katrina-trinko\">is in</a>. So far, he has been talking tough — although his <a href=\"http://www.timpawlenty.com/articles/press-release-governor-pawlenty-statement-on-rep-ryan-budget-proposal\">response</a> to Paul Ryan’s House budget a few months ago was to jam his hands in  his pockets, shuffle his feet a little, and then point and yell, “Look  over there, at the debt ceiling!” (Also, I am secretly worried that  Pawlenty’s <a href=\"http://img.photobucket.com/albums/v287/69king/story-1.jpg\">ex-mullet</a> will now write a tell-all book about him.)  And while his <a href=\"http://youtu.be/5i66q1f3M3w\">introductory video</a> is effective at positioning himself as a “truth teller,” it contains  one of my foremost pet peeves in political commercials: the “I’m from  humble beginnings” talking point.</p></blockquote><p>I have no desire to go into the specifics underlying my contempt for Tim Pawlenty, but suffice it to say that to my certain and personal knowledge, he is a conflict-avoidant coward, a mediocre, hands-off manager of the executive branch, and moreoever, one with zero regard for the letter of the written law.  Republicans who hope to ride this bland dishrag of a pragmatist to the White House will almost certainly find themselves badly disappointed, as the man has even less principle and backbone than George W. Bush.</p></div>",
  "content_text": "And one with\nmuch about which to be humble\n, most notably his governance of Minnesota:\nTim Pawlenty\nis in\n. So far, he has been talking tough — although his\nresponse\nto Paul Ryan’s House budget a few months ago was to jam his hands in  his pockets, shuffle his feet a little, and then point and yell, “Look  over there, at the debt ceiling!” (Also, I am secretly worried that  Pawlenty’s\nex-mullet\nwill now write a tell-all book about him.)  And while his\nintroductory video\nis effective at positioning himself as a “truth teller,” it contains  one of my foremost pet peeves in political commercials: the “I’m from  humble beginnings” talking point.\nI have no desire to go into the specifics underlying my contempt for Tim Pawlenty, but suffice it to say that to my certain and personal knowledge, he is a conflict-avoidant coward, a mediocre, hands-off manager of the executive branch, and moreoever, one with zero regard for the letter of the written law.  Republicans who hope to ride this bland dishrag of a pragmatist to the White House will almost certainly find themselves badly disappointed, as the man has even less principle and backbone than George W. Bush.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-24T13:15:00+00:00"
}