{
  "url": "https://voxday.net/2011/05/02/inexplicable-burial-at-sea/",
  "scraped_at": "2025-12-13T23:09:51.690733",
  "title": "An inexplicable burial at sea",
  "date_display": "May 2, 2011",
  "date_iso": "2011-05-02T09:00:00+00:00",
  "date_from_url": "2011-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently we are going to have to <a href=\"http://news.yahoo.com/s/ap/20110502/ap_on_re_us/us_bin_laden_burial\">take the U.S. government’s word for bin Laden’s death</a>:</p><blockquote><p>After bin Laden was killed in a raid by U.S. forces in Pakistan, senior administration officials said the body would be handled according to Islamic practice and tradition. That practice calls for the body to be buried within 24 hours, the official said. Finding a country willing to accept the remains of the world’s most wanted terrorist would have been difficult, the official said. So the U.S. decided to bury him at sea.</p></blockquote><p>I’m not saying that Osama bin Laden isn’t dead.  For all I know, he’s been dead since 2001, if not before.  But it strikes me that if you wanted to make your own words more look suspiciously incredible, you would be hard-pressed to top the recent actions of the Obama administration.</p><p>“Hey, here’s an ineptly produced computer file that clearly isn’t a simple copy of the document that supposedly no longer existed in the first place!”  “Hey, we killed the bad guy, but we had to ditch the body before anyone else could take a look at it and confirm it’s actually him.  Maybe if we just wave our hands and talk about DNA that nobody else has, someone will buy it.”</p><p>The whole point of engaging in a helicopter raid rather than simply dropping a daisy cutter was to obtain the body.  As one British journalist noted: <i>“The decision to carry out a helicopter assault was incredibly risky but the US Navy SEALS and the CIA pulled it off. The huge advantage is that it means that bin Laden’s body was recovered – any speculation that he remains alive is likely to be shortlived.”</i></p><p>Unless, of course, the body is immediately thrown into the sea….  But whether the most recent reports of bin Laden’s death is real or not, they should at least serve as an excuse to get out of Afghanistan and Iraq before Libya heats up in response to Qaddafi’s likely efforts at retaliation following the reported death of his youngest son.  I find myself wondering if the unexpected cancellation of the royal honeymoon has anything to do with the probability that Qaddafi has his terrorist network aimed at Britain and France these days.</p><p>I’m not saying they needed to stick bin Laden’s head on a pike at the White House, but providing independent confirmation from a third party such as the Saudi ambassador or one of his family members would have been significantly more convincing than a press release about a body dumped in the ocean.</p><p>UPDATE – Bin Laden may well be dead.  Presumably photos will soon be released to prove it.  But that will not change the fact that the U.S. government lied in claiming that his body was buried at sea in accordance with Islamic ritual. <i>“Muslim clerics said Monday that Osama bin Laden’s burial at sea was a violation of Islamic tradition that may further provoke militant calls for revenge attacks against American targets.  Although there appears to be some room for debate over the burial — as with many issues within the faith — a wide range of Islamic scholars interpreted it as a humiliating disregard for the standard Muslim practice of placing the body in a grave with the head pointed toward the holy city of Mecca.  Sea burials can be allowed, they said, but only in special cases where the death occurred aboard a ship.”</i></p><p>That’s two known lies in two days out of the Obama administration.  They may be telling the truth about other things, such as Obama’s birth certificate or Osama’s death.  But one is most certainly not justified in accepting anything they say at face value.</p></div>",
  "content_text": "Apparently we are going to have to\ntake the U.S. government’s word for bin Laden’s death\n:\nAfter bin Laden was killed in a raid by U.S. forces in Pakistan, senior administration officials said the body would be handled according to Islamic practice and tradition. That practice calls for the body to be buried within 24 hours, the official said. Finding a country willing to accept the remains of the world’s most wanted terrorist would have been difficult, the official said. So the U.S. decided to bury him at sea.\nI’m not saying that Osama bin Laden isn’t dead.  For all I know, he’s been dead since 2001, if not before.  But it strikes me that if you wanted to make your own words more look suspiciously incredible, you would be hard-pressed to top the recent actions of the Obama administration.\n“Hey, here’s an ineptly produced computer file that clearly isn’t a simple copy of the document that supposedly no longer existed in the first place!”  “Hey, we killed the bad guy, but we had to ditch the body before anyone else could take a look at it and confirm it’s actually him.  Maybe if we just wave our hands and talk about DNA that nobody else has, someone will buy it.”\nThe whole point of engaging in a helicopter raid rather than simply dropping a daisy cutter was to obtain the body.  As one British journalist noted:\n“The decision to carry out a helicopter assault was incredibly risky but the US Navy SEALS and the CIA pulled it off. The huge advantage is that it means that bin Laden’s body was recovered – any speculation that he remains alive is likely to be shortlived.”\nUnless, of course, the body is immediately thrown into the sea….  But whether the most recent reports of bin Laden’s death is real or not, they should at least serve as an excuse to get out of Afghanistan and Iraq before Libya heats up in response to Qaddafi’s likely efforts at retaliation following the reported death of his youngest son.  I find myself wondering if the unexpected cancellation of the royal honeymoon has anything to do with the probability that Qaddafi has his terrorist network aimed at Britain and France these days.\nI’m not saying they needed to stick bin Laden’s head on a pike at the White House, but providing independent confirmation from a third party such as the Saudi ambassador or one of his family members would have been significantly more convincing than a press release about a body dumped in the ocean.\nUPDATE – Bin Laden may well be dead.  Presumably photos will soon be released to prove it.  But that will not change the fact that the U.S. government lied in claiming that his body was buried at sea in accordance with Islamic ritual.\n“Muslim clerics said Monday that Osama bin Laden’s burial at sea was a violation of Islamic tradition that may further provoke militant calls for revenge attacks against American targets.  Although there appears to be some room for debate over the burial — as with many issues within the faith — a wide range of Islamic scholars interpreted it as a humiliating disregard for the standard Muslim practice of placing the body in a grave with the head pointed toward the holy city of Mecca.  Sea burials can be allowed, they said, but only in special cases where the death occurred aboard a ship.”\nThat’s two known lies in two days out of the Obama administration.  They may be telling the truth about other things, such as Obama’s birth certificate or Osama’s death.  But one is most certainly not justified in accepting anything they say at face value.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-02T08:00:00+00:00"
}