{
  "url": "https://voxday.net/2011/05/06/it-seems-new-atheism-is-not-on-rise/",
  "scraped_at": "2025-12-13T23:10:17.149773",
  "title": "It seems the New Atheism is not on the rise",
  "date_display": "May 6, 2011",
  "date_iso": "2011-05-06T17:00:00+00:00",
  "date_from_url": "2011-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contra the assertions of various factually- and logically-challenged individuals, the evangelical efforts of Richard Dawkins and his Scarlet-A campaign <a href=\"http://www.reuters.com/article/2011/05/02/us-autism-idUSTRE7416XC20110502\">would appear to have fizzled</a>:</p><blockquote><p>A national UK survey out Monday found no traces of an “autism epidemic,” despite earlier reports that the developmental disorder has been rising quickly in recent decades.  Researchers found nearly one percent of Britons older than 16 years have autism, a rate that is similar to that seen in children. Younger people were no more likely to be affected than older ones, however, which would have been expected if the condition were truly on the increase.</p><p>“It was surprising to all of us,” said Dr. Traolach Brugha, a psychiatrist at the University of Leicester, who worked on the study. “If this study is correct, it does put a big question mark over the autism epidemic.”</p></blockquote><p>On a related note, I was more than a little amused to encounter John Keegan’s assertion of the way in which most people naturally “flee the company” of “the compulsively argumentative” while reading <i>The Face of Battle</i> today.  But if it is not a mild form of autism that renders so many atheists completely incapable of recognizing it is their behavior that people despise and not their lack of belief, what else may serve to explain this compulsively argumentative truculence?</p></div>",
  "content_text": "Contra the assertions of various factually- and logically-challenged individuals, the evangelical efforts of Richard Dawkins and his Scarlet-A campaign\nwould appear to have fizzled\n:\nA national UK survey out Monday found no traces of an “autism epidemic,” despite earlier reports that the developmental disorder has been rising quickly in recent decades.  Researchers found nearly one percent of Britons older than 16 years have autism, a rate that is similar to that seen in children. Younger people were no more likely to be affected than older ones, however, which would have been expected if the condition were truly on the increase.\n“It was surprising to all of us,” said Dr. Traolach Brugha, a psychiatrist at the University of Leicester, who worked on the study. “If this study is correct, it does put a big question mark over the autism epidemic.”\nOn a related note, I was more than a little amused to encounter John Keegan’s assertion of the way in which most people naturally “flee the company” of “the compulsively argumentative” while reading\nThe Face of Battle\ntoday.  But if it is not a mild form of autism that renders so many atheists completely incapable of recognizing it is their behavior that people despise and not their lack of belief, what else may serve to explain this compulsively argumentative truculence?",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-06T16:00:00+00:00"
}