{
  "url": "https://voxday.net/2011/05/29/layers-within-layers/",
  "scraped_at": "2025-12-13T23:12:13.047860",
  "title": "Layers within layers",
  "date_display": "May 29, 2011",
  "date_iso": "2011-05-29T21:37:00+00:00",
  "date_from_url": "2011-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was reading Umberto Eco’s book <em>On Literature</em> the other day and his essay entitled “Intertextual Irony and Levels of Reading” caught my attention, particularly in light of Matthew David Surridge’s <a href=\"http://www.blackgate.com/2011/05/22/the-lord-of-the-rings-a-personal-reading-part-three/\">intriguing series of essays on Tolkien</a>.  (I haven’t commented upon them yet because they are sufficiently deep to require a second reading before opining, Matt, so my apologies for the tardiness.)  Because the flip side of readers, presumably non-Ideal, who read things into the text that are not there are readers, definitely non-Ideal, who fail to recognize the deeper layers of the text that are, in fact, there.</p><p>Read more, including a minor revelation about one of my past novels, <a href=\"http://www.blackgate.com/2011/05/29/in-search-of-the-ideal-reader/\">at the Black Gate</a>.</p></div>",
  "content_text": "I was reading Umberto Eco’s book\nOn Literature\nthe other day and his essay entitled “Intertextual Irony and Levels of Reading” caught my attention, particularly in light of Matthew David Surridge’s\nintriguing series of essays on Tolkien\n.  (I haven’t commented upon them yet because they are sufficiently deep to require a second reading before opining, Matt, so my apologies for the tardiness.)  Because the flip side of readers, presumably non-Ideal, who read things into the text that are not there are readers, definitely non-Ideal, who fail to recognize the deeper layers of the text that are, in fact, there.\nRead more, including a minor revelation about one of my past novels,\nat the Black Gate\n.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-29T20:37:00+00:00"
}