{
  "url": "https://voxday.net/2011/05/28/mailvox-why-yes-racists-are-preferable/",
  "scraped_at": "2025-12-13T23:12:07.584956",
  "title": "Mailvox: why yes, the racists are preferable",
  "date_display": "May 28, 2011",
  "date_iso": "2011-05-28T13:08:00+00:00",
  "date_from_url": "2011-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unsurprisingly, Dodo fails to reach the correct conclusion concerning why so many people of different political, religious, and ideological stripes keep telling him to shut up:</p><blockquote><p>I love it how I can come on this site and express some of the tamest liberal philosophy and get attacked from all sides, but this guy gets NO RESPONSE AT ALL.  But you’re not racists, no.</p></blockquote><p>I find it tremendously amusing that Dodo is whining about the way people react to him <i>while simultaneously calling all of the thousands of daily readers here, including the black ones, racists</i>.  He is clearly incapable of realizing that it is his personality defects, and not his political views, that account for the hostile responses he provokes on a daily basis.  Of course, it is not only that he is an annoying asshole, as he also makes a regular habit of producing asinine and uninformed comments that have no object except to be disagreeable.  Even other atheists have complained about his repetitive idiocy.</p><p>The fact is that most people will quite understandably prefer the company of an open racist who keeps his opinion on racial matters to himself except when it is topical to that of an ignorant and unintelligent asshole who insists on constantly forcing his opinion on others no matter the subject.  The fact that people tolerate a wide range of diverse opinions, some well outside the zone of the politically correct, while reacting harshly to Dodo’s expressed views does not mean that everyone agrees with any of those opinions or are racists, it merely proves what an exceptional and unmitigated asshole Dodo has shown himself to be.</p><p>Moreover, Dodo’s remark underlines his social autism.  If he had any social skills at all, he would realize that silence very seldom denotes <i>approval</i>.  I also find it interesting that some have inaccurately claimed that this blog is an echo chamber while others have seen fit to criticize the way in which I permit others to freely express their opinions, even on the most sensitive subjects.  But if one simply looks at the rules of the blog, one will see that there is no rule which bars any political, ideological, or religious opinion of any kind.</p></div>",
  "content_text": "Unsurprisingly, Dodo fails to reach the correct conclusion concerning why so many people of different political, religious, and ideological stripes keep telling him to shut up:\nI love it how I can come on this site and express some of the tamest liberal philosophy and get attacked from all sides, but this guy gets NO RESPONSE AT ALL.  But you’re not racists, no.\nI find it tremendously amusing that Dodo is whining about the way people react to him\nwhile simultaneously calling all of the thousands of daily readers here, including the black ones, racists\n.  He is clearly incapable of realizing that it is his personality defects, and not his political views, that account for the hostile responses he provokes on a daily basis.  Of course, it is not only that he is an annoying asshole, as he also makes a regular habit of producing asinine and uninformed comments that have no object except to be disagreeable.  Even other atheists have complained about his repetitive idiocy.\nThe fact is that most people will quite understandably prefer the company of an open racist who keeps his opinion on racial matters to himself except when it is topical to that of an ignorant and unintelligent asshole who insists on constantly forcing his opinion on others no matter the subject.  The fact that people tolerate a wide range of diverse opinions, some well outside the zone of the politically correct, while reacting harshly to Dodo’s expressed views does not mean that everyone agrees with any of those opinions or are racists, it merely proves what an exceptional and unmitigated asshole Dodo has shown himself to be.\nMoreover, Dodo’s remark underlines his social autism.  If he had any social skills at all, he would realize that silence very seldom denotes\napproval\n.  I also find it interesting that some have inaccurately claimed that this blog is an echo chamber while others have seen fit to criticize the way in which I permit others to freely express their opinions, even on the most sensitive subjects.  But if one simply looks at the rules of the blog, one will see that there is no rule which bars any political, ideological, or religious opinion of any kind.",
  "tags": [
    "atheism",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-28T12:08:00+00:00"
}