{
  "url": "https://voxday.net/2011/05/08/mailvox-when-god-makes-you-lie/",
  "scraped_at": "2025-12-13T23:10:20.798006",
  "title": "Mailvox: when God makes you lie",
  "date_display": "May 8, 2011",
  "date_iso": "2011-05-08T13:57:00+00:00",
  "date_from_url": "2011-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamsco heroically attempts to explain why using a word in a manner that doesn’t mean what it actually means isn’t an indication of intellectual dishonesty:</p><blockquote><p>The following is meant to be a debriefing of the two days of debating Calvinism. Some of what follows I’ve already stated in comments.</p><p>A. I’m developing a theory about you and the way you run your blog.</p><p>You’ve addressed the suggestion by others that you are very passionate about this subject (Calvinism) by giving statistics about the number of posts you’ve made relating to the subject. But this doesn’t really address the manner in which you interact with commenter once you choose to jump into it.</p><p>To be sure – once you’re in – you’re in all the way. And you’re in it to win.  What this means, unfortunately, is that you are not in it to learn.</p><p>When someone comments with disagreement to your post or a subsequent comment – from your standpoint, the comments come in one of three ways.</p><p>1. A comment that you can pick a part and show that they contain error.<br> 2. A comment that you can’t really see a flaw in (I imagine these are fairly rare). I assume you generally ignore these.<br> 3. A comment that is a curve ball with some kind of oddity which thwarts you of an opportunity to slam it.</br></br></p><p>It’s this third kind that frustrate you the most and are the most likely to draw out from you cries of “lies!”</p><p>For example: WRF3’s definition of the Bible (Anything that teaches us about God). Now it is a weird definition, but for all you and I know, it’s something he’s been thinking about lately and it’s his honest definition and he’s been wanting to mention it somewhere and thought he’d take the opportunity. But you dislike it, because it screws up where you want to go with the conversation (in your attempt to show . . . something about how foolish reformed commenters are – i.e to ‘break him down’). So you call him ‘not intellectually honest’, when you don’t really have evidence of it.</p><p>To be clear, Vox, you should have strong evidence before you call someone dishonest even if you mean ‘dishonest with yourself’. And even if you have strong evidence, it might be wise to let it pass and let others be the judge.</p></blockquote><p>Let me begin by stating that I dislike the “weird definition” of “the Bible” because it is, in fact, a completely false and deceitful definition and would be a grotesque insult to my intelligence at half its staggering height.  This portion of Jamsco’s email – the quoted portion is but an excerpt – amounts to little more than an attempt to justify blatant and outright intellectual dishonesty of the sort that I so regularly point out among the New Atheists.  It is a beautiful exhibit of what has been described as “Humpty-Dumpty language”, after the famous passage from Lewis Carroll’s <i>Alice in Wonderland</i>:</p><p><i>“There’s glory for you!”<br> “I don’t know what you mean by ‘glory,’ ” Alice said.<br> Humpty Dumpty smiled contemptuously. “Of course you don’t—till I tell you. I meant ‘there’s a nice knock-down argument for you!’ “<br> “But ‘glory’ doesn’t mean ‘a nice knock-down argument,’ ” Alice objected.<br> “When I use a word,” Humpty Dumpty said, in rather a scornful tone, “it means just what I choose it to mean—neither more nor less.”<br> “The question is, ” said Alice, “whether you can make words mean so many different things.”<br> “The question is,” said Humpty Dumpty. “which is to be master—that’s all.”</br></br></br></br></br></br></i></p><p>It’s ridiculous to say that WRF’s mendacious definition of “the Bible” thwarted me of an opportunity to slam his hapless argument anymore than Sam Harris’s inventive uses of the term “faith” prevented me from completely eviscerating the very conceptual foundation of his best-selling book.  Longtime readers may recall it took me all of one email to force him to publicly declare that he was actually criticizing “tribalism” rather than religious faith per se.  And yet, we find ourselves waiting in vain for the next edition of <i>The End of Tribalism</i>.  Indeed, I requested a definition of the Bible from WRF3 expressly in order to illuminate for everyone else what I already knew to be a dishonest argument.  I wasn’t frustrated at all; Jamsco is merely mistaking my scorn and contempt for this sort of easily anticipated behavior for frustration.  And scorn and contempt are more than well-merited regarding for argument that rests upon the idea that the most famous historical written document in the world is Sunday School teachers.  That’s not only wrong, it’s a category error.</p><p>I don’t call Calvinists – or whatever those who subscribe to notions of divine omniderigence and/or omniscience and/or perfect goodness prefer to call themselves – liars because I am <i>frustrated</i> by them, I am calling them liars because the positions they are holding are inconsistent and therefore <i>require them to lie</i> whether they do so consciously as with the example of WRF3 or unconsciously as I suspect is more often the case.</p><p>For example, it is incredibly easy to show the doublethink required of a omniderigiste who asserts that God doesn’t lie.  If I believe that God wills and actively causes all events that take place, and I also observe that lies are told, then I have absolutely no choice but to conclude that God tells lies and is therefore a liar.  None.  It doesn’t matter how massive an edifice of epicycles I construct to rationalize away the existence of lies that I observe, or even tell myself, I have to choose between being intellectually dishonest or give up my dogma.  In the case of every “Calvinist” with whom I have ever engaged, I have observed that they eventually resort to intellectual dishonesty sooner or later, although I will freely admit that few of them do so as blatantly or as knowingly as WRF3 did.  Just to be fair, I don’t believe most of them genuinely realize what they are doing.</p><p>That’s why I was certain that I would be able to find inconsistencies and incoherencies in Piper’s writings before I had read a single one.  It’s the same reason that I know, without even the shadow of a doubt, that a Keynesian is going to produce some deceptive sleight-of-tongue whenever he finds himself forced to confront the observable fact both inflation and unemployment are rising.  I don’t need to know what the specific deviation from either fact or logic will be in order to be 100 percent certain that it will be there to be found, because logic dictates that if the dogma has not been abandoned, then the error has to be there.  It’s rather like knowing that there must be a bug in the code <i>because one can observe that the program isn’t working</i>.</p><p>I think two things are worth pointing out here.  First, anyone who engages in “Humpty-Dumpty” talk is not only a liar, but a purposeful deceiver.  I have been mocked in the past at times for arguing from the dictionary, but the main reason I resort so readily to the dictionary is that it is a source that is entirely objective from my perspective.  Resorting to such objective sources eliminates a tremendous amount of weasel room both on my part and on the part of others.  If I was only interested in winning, why would I ever do this?  I can play pedantic and semantic games as well as anyone, but I prefer to avoid them for the most part.</p><p>Second, I don’t think it would be accurate to conclude that I am preemptively declaring victory when I am simply pointing out the clear, readily observable errors of others.  In the case of the likes of Piper and WRF3, because their position is intrinsically self-contradictory, they have not only lost the argument before I ever entered it, <i>they already knew they had lost it.</i> If they weren’t aware of this, they wouldn’t need to engage in such dreadful contortions and abuses of the language.  And that, of course, is not only what bothers me, but is why I consider them to be such intellectual snakes even when they are otherwise decent people.</p></div>",
  "content_text": "Jamsco heroically attempts to explain why using a word in a manner that doesn’t mean what it actually means isn’t an indication of intellectual dishonesty:\nThe following is meant to be a debriefing of the two days of debating Calvinism. Some of what follows I’ve already stated in comments.\nA. I’m developing a theory about you and the way you run your blog.\nYou’ve addressed the suggestion by others that you are very passionate about this subject (Calvinism) by giving statistics about the number of posts you’ve made relating to the subject. But this doesn’t really address the manner in which you interact with commenter once you choose to jump into it.\nTo be sure – once you’re in – you’re in all the way. And you’re in it to win.  What this means, unfortunately, is that you are not in it to learn.\nWhen someone comments with disagreement to your post or a subsequent comment – from your standpoint, the comments come in one of three ways.\n1. A comment that you can pick a part and show that they contain error.\n2. A comment that you can’t really see a flaw in (I imagine these are fairly rare). I assume you generally ignore these.\n3. A comment that is a curve ball with some kind of oddity which thwarts you of an opportunity to slam it.\nIt’s this third kind that frustrate you the most and are the most likely to draw out from you cries of “lies!”\nFor example: WRF3’s definition of the Bible (Anything that teaches us about God). Now it is a weird definition, but for all you and I know, it’s something he’s been thinking about lately and it’s his honest definition and he’s been wanting to mention it somewhere and thought he’d take the opportunity. But you dislike it, because it screws up where you want to go with the conversation (in your attempt to show . . . something about how foolish reformed commenters are – i.e to ‘break him down’). So you call him ‘not intellectually honest’, when you don’t really have evidence of it.\nTo be clear, Vox, you should have strong evidence before you call someone dishonest even if you mean ‘dishonest with yourself’. And even if you have strong evidence, it might be wise to let it pass and let others be the judge.\nLet me begin by stating that I dislike the “weird definition” of “the Bible” because it is, in fact, a completely false and deceitful definition and would be a grotesque insult to my intelligence at half its staggering height.  This portion of Jamsco’s email – the quoted portion is but an excerpt – amounts to little more than an attempt to justify blatant and outright intellectual dishonesty of the sort that I so regularly point out among the New Atheists.  It is a beautiful exhibit of what has been described as “Humpty-Dumpty language”, after the famous passage from Lewis Carroll’s\nAlice in Wonderland\n:\n“There’s glory for you!”\n“I don’t know what you mean by ‘glory,’ ” Alice said.\nHumpty Dumpty smiled contemptuously. “Of course you don’t—till I tell you. I meant ‘there’s a nice knock-down argument for you!’ “\n“But ‘glory’ doesn’t mean ‘a nice knock-down argument,’ ” Alice objected.\n“When I use a word,” Humpty Dumpty said, in rather a scornful tone, “it means just what I choose it to mean—neither more nor less.”\n“The question is, ” said Alice, “whether you can make words mean so many different things.”\n“The question is,” said Humpty Dumpty. “which is to be master—that’s all.”\nIt’s ridiculous to say that WRF’s mendacious definition of “the Bible” thwarted me of an opportunity to slam his hapless argument anymore than Sam Harris’s inventive uses of the term “faith” prevented me from completely eviscerating the very conceptual foundation of his best-selling book.  Longtime readers may recall it took me all of one email to force him to publicly declare that he was actually criticizing “tribalism” rather than religious faith per se.  And yet, we find ourselves waiting in vain for the next edition of\nThe End of Tribalism\n.  Indeed, I requested a definition of the Bible from WRF3 expressly in order to illuminate for everyone else what I already knew to be a dishonest argument.  I wasn’t frustrated at all; Jamsco is merely mistaking my scorn and contempt for this sort of easily anticipated behavior for frustration.  And scorn and contempt are more than well-merited regarding for argument that rests upon the idea that the most famous historical written document in the world is Sunday School teachers.  That’s not only wrong, it’s a category error.\nI don’t call Calvinists – or whatever those who subscribe to notions of divine omniderigence and/or omniscience and/or perfect goodness prefer to call themselves – liars because I am\nfrustrated\nby them, I am calling them liars because the positions they are holding are inconsistent and therefore\nrequire them to lie\nwhether they do so consciously as with the example of WRF3 or unconsciously as I suspect is more often the case.\nFor example, it is incredibly easy to show the doublethink required of a omniderigiste who asserts that God doesn’t lie.  If I believe that God wills and actively causes all events that take place, and I also observe that lies are told, then I have absolutely no choice but to conclude that God tells lies and is therefore a liar.  None.  It doesn’t matter how massive an edifice of epicycles I construct to rationalize away the existence of lies that I observe, or even tell myself, I have to choose between being intellectually dishonest or give up my dogma.  In the case of every “Calvinist” with whom I have ever engaged, I have observed that they eventually resort to intellectual dishonesty sooner or later, although I will freely admit that few of them do so as blatantly or as knowingly as WRF3 did.  Just to be fair, I don’t believe most of them genuinely realize what they are doing.\nThat’s why I was certain that I would be able to find inconsistencies and incoherencies in Piper’s writings before I had read a single one.  It’s the same reason that I know, without even the shadow of a doubt, that a Keynesian is going to produce some deceptive sleight-of-tongue whenever he finds himself forced to confront the observable fact both inflation and unemployment are rising.  I don’t need to know what the specific deviation from either fact or logic will be in order to be 100 percent certain that it will be there to be found, because logic dictates that if the dogma has not been abandoned, then the error has to be there.  It’s rather like knowing that there must be a bug in the code\nbecause one can observe that the program isn’t working\n.\nI think two things are worth pointing out here.  First, anyone who engages in “Humpty-Dumpty” talk is not only a liar, but a purposeful deceiver.  I have been mocked in the past at times for arguing from the dictionary, but the main reason I resort so readily to the dictionary is that it is a source that is entirely objective from my perspective.  Resorting to such objective sources eliminates a tremendous amount of weasel room both on my part and on the part of others.  If I was only interested in winning, why would I ever do this?  I can play pedantic and semantic games as well as anyone, but I prefer to avoid them for the most part.\nSecond, I don’t think it would be accurate to conclude that I am preemptively declaring victory when I am simply pointing out the clear, readily observable errors of others.  In the case of the likes of Piper and WRF3, because their position is intrinsically self-contradictory, they have not only lost the argument before I ever entered it,\nthey already knew they had lost it.\nIf they weren’t aware of this, they wouldn’t need to engage in such dreadful contortions and abuses of the language.  And that, of course, is not only what bothers me, but is why I consider them to be such intellectual snakes even when they are otherwise decent people.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-08T12:57:00+00:00"
}