{
  "url": "https://voxday.net/2011/05/11/mailvox-when-x-is-merely-x/",
  "scraped_at": "2025-12-13T23:10:35.477150",
  "title": "Mailvox: When x is merely x",
  "date_display": "May 11, 2011",
  "date_iso": "2011-05-11T09:21:00+00:00",
  "date_from_url": "2011-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things that often amuses me about genuinely knowledgeable experts is the way they walk around dragging their well-credentialed hammers behind them, desperately searching for an opportunity to show off their ability to hit nails, regardless of whether the nail needs hitting, or, as happens to be the case here, even exists in the first place.</p><p>The Staggering Height of the Logic Midget wrote:</p><blockquote><p>Let X be a logical statement; that is, X is a statement considered to be either true or false, but not both.</p><p>Assume X is true. By basic rules of logic, not-X is false. Is a truth table needed?</p><p>It could be that you are not requiring X to be a logical statement. But no, because you use standard logic notation such as X and Not-X, X must be a logical statement as I described above.</p><p>It could be that you are thinking of a more complicated scenario in which logic quantifiers are involved. For example, if there exists a divine statement that’s true, that doesn’t prove that every divine statement is true.</p><p>But regardless, no matter how complicated the statement X is, if X is true, then not-X is false. If X is false, then not-X is true.</p><p>It could be that you’re thinking of the common mistake of a person claiming that (A implies B) proves (not-A implies not-B).</p><p>But regardless, no matter the form of statement X, if X is true, then not-X is false.</p></blockquote><p>What Logic Midget failed to recognize is that not all discussions of logical conclusions involve formal philosophical logic notation.  His increasingly deranged argument with Markku was more than a little amusing; it’s as if an economist overheard a woman say that a certain individual was a GDP, then leaped in and started telling her that she obviously didn’t know anything about trade balances and deflators, little realizing that the acronym simply stood for a divinely doomed bastard.  This isn’t merely a failure of an assumption, it’s a failure of basic contextual comprehension.</p><p>Logic Midget was referring to a statement that I made in summarizing the example of divine promises cited earlier in the comment thread.</p><p><i>“My position is one of volipotence, which means that God can lie or not lie as it suits Him… But I’ve noticed that very few people who discuss theology are capable of grasping implications… It’s as if they can’t see the negative space that always surrounds the positive assertion.  X does not absolutely require Not-X, but it does tend to suggest its existence.”</i></p><p>What I was referring to here was the existence of divine promises in the context of the question of God’s perfect truthfulness.  The point I made was that the fact God has explicitly assured that specific statements he has made are true tends to imply that other statements he has made will are not.  If we like, we can put it this way: X = divine statement guaranteed to be true and Not X = divine statement not guaranteed to be true.  Insofar as the formal logic applies in that way, Logic Midget is correct.  But only trivially so, <i>because we’re obviously not talking about a single divine statement here</i>, we’re talking about a comparison between different divine statements, in fact, we’re actually talking about the set of all divine statements and two distinct subsets within it.</p><p>(I should note that I was not using X in any formal sense here.  X simply served as a variable representing any word with a specific meaning that is limited in a manner that carries intrinsic implications.  For example, “afternoon” implies the existence of both “noon” and “before noon” just as saying “what I tell you now is true” implies “what I told you then may not be true”.  In this case, when X = afternoon and Not-X = before noon, then obviously X and Not-X both simultaneously exist, the rules of formal logical notation notwithstanding, given that afternoon is not before noon.)</p><p>In his myopic focus on the tree of formal logic, Logic Midget has completely failed to notice the forest of the actual subject at hand.  Because it is not the logical distinction between the truth or falsehood of a single divine statement that is relevant here, but rather the semantic implication of statements that are promises and statements that are not promises.  The two points I was making were as follows:</p><p>1.  There are implications behind the use of certain specific terms.  If God’s promises are guaranteed to be true, then His non-promises are not necessarily guaranteed to be true.  Insofar as God makes statements that are not promises, there is an implication that those statements are not guaranteed to be true, as well as a further implication that God makes statements that are not true.</p><p>2.  On the other hand, the implication that these statements are not guaranteed to be true does not make them untrue, it merely allows for the possibility that they may not be true.</p><p>Logic Midget really should have known better, but he was too eager to strike an educated pose.  And since I am his logical superior despite knowing far less about formal notation, it’s not hard for me to find his two logical errors, both at the beginning and right here: <i>“It could be that you are not requiring X to be a logical statement. But no, because you use standard logic notation such as X and Not-X, X must be a logical statement as I described above.”</i></p><p>His first error was his assumption that X “is a statement considered to be either true or false, but not both”.  He compounded this with his second error in which he stated that “Not-X” is standard logic notation.  It is not, as he should have noted that I did not use (¬P), (~P), or even (-P).  In fact, if I had been making use of formal logic notation, I wouldn’t have used any of them anyhow, but rather (P –&gt; Q).  Sometimes X is just a variable.  Note that Logic Midget didn’t bother to ask what X represented, nor did he even comprehend which part of the statement was the logically relevant one here.</p><p>So, once more, we see the wisdom inherent in asking a few preliminary questions rather than making assumptions and thereby leaping to incorrect conclusions.  But there are few people so predictably prone to making asses of themselves as well-educated individuals eager to exhibit their hard-won educations.</p></div>",
  "content_text": "One of the things that often amuses me about genuinely knowledgeable experts is the way they walk around dragging their well-credentialed hammers behind them, desperately searching for an opportunity to show off their ability to hit nails, regardless of whether the nail needs hitting, or, as happens to be the case here, even exists in the first place.\nThe Staggering Height of the Logic Midget wrote:\nLet X be a logical statement; that is, X is a statement considered to be either true or false, but not both.\nAssume X is true. By basic rules of logic, not-X is false. Is a truth table needed?\nIt could be that you are not requiring X to be a logical statement. But no, because you use standard logic notation such as X and Not-X, X must be a logical statement as I described above.\nIt could be that you are thinking of a more complicated scenario in which logic quantifiers are involved. For example, if there exists a divine statement that’s true, that doesn’t prove that every divine statement is true.\nBut regardless, no matter how complicated the statement X is, if X is true, then not-X is false. If X is false, then not-X is true.\nIt could be that you’re thinking of the common mistake of a person claiming that (A implies B) proves (not-A implies not-B).\nBut regardless, no matter the form of statement X, if X is true, then not-X is false.\nWhat Logic Midget failed to recognize is that not all discussions of logical conclusions involve formal philosophical logic notation.  His increasingly deranged argument with Markku was more than a little amusing; it’s as if an economist overheard a woman say that a certain individual was a GDP, then leaped in and started telling her that she obviously didn’t know anything about trade balances and deflators, little realizing that the acronym simply stood for a divinely doomed bastard.  This isn’t merely a failure of an assumption, it’s a failure of basic contextual comprehension.\nLogic Midget was referring to a statement that I made in summarizing the example of divine promises cited earlier in the comment thread.\n“My position is one of volipotence, which means that God can lie or not lie as it suits Him… But I’ve noticed that very few people who discuss theology are capable of grasping implications… It’s as if they can’t see the negative space that always surrounds the positive assertion.  X does not absolutely require Not-X, but it does tend to suggest its existence.”\nWhat I was referring to here was the existence of divine promises in the context of the question of God’s perfect truthfulness.  The point I made was that the fact God has explicitly assured that specific statements he has made are true tends to imply that other statements he has made will are not.  If we like, we can put it this way: X = divine statement guaranteed to be true and Not X = divine statement not guaranteed to be true.  Insofar as the formal logic applies in that way, Logic Midget is correct.  But only trivially so,\nbecause we’re obviously not talking about a single divine statement here\n, we’re talking about a comparison between different divine statements, in fact, we’re actually talking about the set of all divine statements and two distinct subsets within it.\n(I should note that I was not using X in any formal sense here.  X simply served as a variable representing any word with a specific meaning that is limited in a manner that carries intrinsic implications.  For example, “afternoon” implies the existence of both “noon” and “before noon” just as saying “what I tell you now is true” implies “what I told you then may not be true”.  In this case, when X = afternoon and Not-X = before noon, then obviously X and Not-X both simultaneously exist, the rules of formal logical notation notwithstanding, given that afternoon is not before noon.)\nIn his myopic focus on the tree of formal logic, Logic Midget has completely failed to notice the forest of the actual subject at hand.  Because it is not the logical distinction between the truth or falsehood of a single divine statement that is relevant here, but rather the semantic implication of statements that are promises and statements that are not promises.  The two points I was making were as follows:\n1.  There are implications behind the use of certain specific terms.  If God’s promises are guaranteed to be true, then His non-promises are not necessarily guaranteed to be true.  Insofar as God makes statements that are not promises, there is an implication that those statements are not guaranteed to be true, as well as a further implication that God makes statements that are not true.\n2.  On the other hand, the implication that these statements are not guaranteed to be true does not make them untrue, it merely allows for the possibility that they may not be true.\nLogic Midget really should have known better, but he was too eager to strike an educated pose.  And since I am his logical superior despite knowing far less about formal notation, it’s not hard for me to find his two logical errors, both at the beginning and right here:\n“It could be that you are not requiring X to be a logical statement. But no, because you use standard logic notation such as X and Not-X, X must be a logical statement as I described above.”\nHis first error was his assumption that X “is a statement considered to be either true or false, but not both”.  He compounded this with his second error in which he stated that “Not-X” is standard logic notation.  It is not, as he should have noted that I did not use (¬P), (~P), or even (-P).  In fact, if I had been making use of formal logic notation, I wouldn’t have used any of them anyhow, but rather (P –> Q).  Sometimes X is just a variable.  Note that Logic Midget didn’t bother to ask what X represented, nor did he even comprehend which part of the statement was the logically relevant one here.\nSo, once more, we see the wisdom inherent in asking a few preliminary questions rather than making assumptions and thereby leaping to incorrect conclusions.  But there are few people so predictably prone to making asses of themselves as well-educated individuals eager to exhibit their hard-won educations.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-11T08:21:00+00:00"
}