{
  "url": "https://voxday.net/2011/05/29/mailvox-aspies-and-social-autis/",
  "scraped_at": "2025-12-13T23:12:11.232706",
  "title": "Mailvox: aspies and social autism",
  "date_display": "May 29, 2011",
  "date_iso": "2011-05-29T08:52:00+00:00",
  "date_from_url": "2011-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Van Rooinek objects to making a conceptual link between Asperger’s and atheism:</p><blockquote><p>It’s utterly unfair to link “aspie” with “atheist”. An innate defect in social-situational awareness is no way synonymous with either atheism or an inability to grasp the Christian moral duty of charity. Aspie Christians have a tough enough time with fellow Christians assuming that our inevitable social faux pas are intentional sins rather than perceptual accidents; the equation of “aspie” with “atheist” is even more galling.</p></blockquote><p>While I have no doubt that some will manage it, I find it hard to believe that anyone could miss the humor intrinsic in atheists being offended at being labeled socially autistic while aspies take offense at being tarred by association with atheism.  Good times.  But, since both groups observably have a somewhat difficult time in understanding various aspects of communication and social interaction, I will explain everything in a logical manner that even the most socially challenged individual should be able to follow.</p><p>First, let me address a common misunderstanding.  The term “socially autistic” is not, as some have imagined, redundant even though autistic people are known to frequently have social difficulties.  The reason is that in the English language, the adjective <i>modifies</i> the noun.  As von Hayek elucidated in <i>The Fatal Conceit</i>, “social justice” is intrinsically different than “justice”, so “social autism” is therefore different than “autism”.</p><p>The observable difference between the behavior of militant atheists and autistic or aspie individuals is that whereas the latter behave in a neuro-atypical manner regardless of whether they are in a social situation or not, the atheist’s neuro-atypical behavior tends to be limited to the social spheres.  This tends to indicate that the behavior is, at least some extent, a conscious choice on the atheist’s part, which only underlines the obnoxious nature of the behavior.</p><p>And that, obviously, is the crucial difference.  The aspie cannot help his behavior; while the atheist may not be able to help his lack of belief, (which, as I have suggested, may stem from a related neurological disorder), he has no similar excuse for the reprehensible behavior that so often accompanies it.</p><p>What Van Rooinek would do well to understand and accept is that when non-aspies behave in a certain manner – the excessive literalism with which some students of Game receive the advice of the Game theoreticians to which he referred being but one example – it is perfectly reasonable to describe such behavior as aspie-like, or “aspie” for short.  But there is no more condemnation to be inferred in such a description than there is in referring to a sighted person who simply cannot understand something being explained to him as “blind”.</p><p>Moreover, given the way in which aspies are predisposed, by virtue of their neurological handicap, to unintentionally offend others, they would be well-advised to be deliberately slow in taking offense, especially when it is unnecessary.  Indeed, instead of being offended, they should be pleased by the sufficient awareness of their condition, and therefore recognition of their lack of culpability for any inadvertently maladroit behavior, that casual use of such an appellation indicates.</p></div>",
  "content_text": "In which Van Rooinek objects to making a conceptual link between Asperger’s and atheism:\nIt’s utterly unfair to link “aspie” with “atheist”. An innate defect in social-situational awareness is no way synonymous with either atheism or an inability to grasp the Christian moral duty of charity. Aspie Christians have a tough enough time with fellow Christians assuming that our inevitable social faux pas are intentional sins rather than perceptual accidents; the equation of “aspie” with “atheist” is even more galling.\nWhile I have no doubt that some will manage it, I find it hard to believe that anyone could miss the humor intrinsic in atheists being offended at being labeled socially autistic while aspies take offense at being tarred by association with atheism.  Good times.  But, since both groups observably have a somewhat difficult time in understanding various aspects of communication and social interaction, I will explain everything in a logical manner that even the most socially challenged individual should be able to follow.\nFirst, let me address a common misunderstanding.  The term “socially autistic” is not, as some have imagined, redundant even though autistic people are known to frequently have social difficulties.  The reason is that in the English language, the adjective\nmodifies\nthe noun.  As von Hayek elucidated in\nThe Fatal Conceit\n, “social justice” is intrinsically different than “justice”, so “social autism” is therefore different than “autism”.\nThe observable difference between the behavior of militant atheists and autistic or aspie individuals is that whereas the latter behave in a neuro-atypical manner regardless of whether they are in a social situation or not, the atheist’s neuro-atypical behavior tends to be limited to the social spheres.  This tends to indicate that the behavior is, at least some extent, a conscious choice on the atheist’s part, which only underlines the obnoxious nature of the behavior.\nAnd that, obviously, is the crucial difference.  The aspie cannot help his behavior; while the atheist may not be able to help his lack of belief, (which, as I have suggested, may stem from a related neurological disorder), he has no similar excuse for the reprehensible behavior that so often accompanies it.\nWhat Van Rooinek would do well to understand and accept is that when non-aspies behave in a certain manner – the excessive literalism with which some students of Game receive the advice of the Game theoreticians to which he referred being but one example – it is perfectly reasonable to describe such behavior as aspie-like, or “aspie” for short.  But there is no more condemnation to be inferred in such a description than there is in referring to a sighted person who simply cannot understand something being explained to him as “blind”.\nMoreover, given the way in which aspies are predisposed, by virtue of their neurological handicap, to unintentionally offend others, they would be well-advised to be deliberately slow in taking offense, especially when it is unnecessary.  Indeed, instead of being offended, they should be pleased by the sufficient awareness of their condition, and therefore recognition of their lack of culpability for any inadvertently maladroit behavior, that casual use of such an appellation indicates.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-29T07:52:00+00:00"
}