{
  "url": "https://voxday.net/2011/05/25/militant-atheism-is-more-than-theis/",
  "scraped_at": "2025-12-13T23:11:54.663603",
  "title": "Godlessness is more than a-theism",
  "date_display": "May 25, 2011",
  "date_iso": "2011-05-25T18:30:00+00:00",
  "date_from_url": "2011-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing I always enjoy about atheists is the shameless way they perform the Atheist Dance.  They are such hopelessly muddled thinkers that they constantly define and redefine words as it happens to suit them at the moment, not infrequently contradicting themselves multiple times in a single article, blog post, or book.  An atheist will claim that there is absolutely nothing that can be determined about him by the mere fact of his atheism except for his non-belief in a creator God, then immediately turn around and insist that of course he doesn’t believe in the power of crystals or Noah’s Flood… because he is an atheist and therefore obviously doesn’t believe in anything insufficiently “proven” by science… except for historical events that a sufficient number of people believe to be true… except for those related to religion.  And so forth.</p><p>The observation that most atheism is little more than a juvenile psychological disorder tends to be supported by the fact that left-wing politics are far more central to most atheists, including some of the most outspoken ones, than their “atheism”, whatever that might actually happen to be.  Consider the Fowl Atheist’s recent statement that <a href=\"http://scienceblogs.com/pharyngula/2011/05/godless_goals_are_progressive.php\">godless goals are progressive goals</a>:</p><blockquote><p>All the big shots in the secular organizations I’ve met seem like rather progressive individuals who would agree entirely with Watson’s [radically pro-abortion] position, and I’ve seen some published statements here and there that support such liberal (i.e., rational) causes as women’s rights and gay rights and equality in general, but otherwise, these particular civil rights issues seem more assumed than advocated by the major organizations — they certainly don’t oppose them. I can understand how a non-profit might have to tread carefully on political claims (they can’t come out and damn the Republican party, after all), but Watson has a point.</p><p>Maybe there should be more overt activism for civil rights in general, in addition to the more focused attention given to atheist/humanist issues. Freethought movements should be about human dignity and freedom in all domains, not just religion. We should own these issues; we need to be on the right side of history….</p><p>Of course, such a move would piss off the libertarian/conservative wing of the atheist movement, but I can’t see a down side to jettisoning them, anyway.</p></blockquote><p>That’s fine with me.  I’d quite pleased to have libertarian atheists and conservative atheists on my side; they are proof that godlessness is not completely antithetical to political sanity.  And it is amusing that PZ thinks that murdering unborn children is “the right side of history”; I have absolutely no doubt that the atheists of the future will be denying that pro-abortion equalitarians were motivated by their atheism in much the same way that atheists today deny that rabidly murderous Communists were motivated by their atheism.</p><p>Calling a feminist a feminazi is an insult to the German National Socialist Workers Party.  The feminists and equalitarians have FAR more blood on their hands than the National Socialists ever did.  Consider that in India, there are <a href=\"http://hosted.ap.org/dynamic/stories/A/AS_INDIA_SEX_SELECTIVE_ABORTIONS?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2011-05-24-06-48-11\">only 893 girls born</a> for every 1,000 boys.  In China, the girl/boy birth ratio is .855.  And the more educated and wealthy a woman is, the more likely it is that she will murder her daughter.</p><p>“That decrease was even more marked in families where the mothers were wealthier and had 10 or more years of education compared with a poor and uneducated mothers – presumably because the wealthy are more easily able to obtain illegal abortions.”</p><p>In the name of progress and equality, up to 12 million Indian girls have been slaughtered in the last 30 years.  This is not about human freedom and dignity, it is not “the right side of history”.  It is nothing less than the greatest crime yet committed by humanity against itself.  These progressive atheists and equalitarians will forever bear the curse of the hundreds of millions of innocents whose deaths they have not only demanded, but celebrated.</p></div>",
  "content_text": "One thing I always enjoy about atheists is the shameless way they perform the Atheist Dance.  They are such hopelessly muddled thinkers that they constantly define and redefine words as it happens to suit them at the moment, not infrequently contradicting themselves multiple times in a single article, blog post, or book.  An atheist will claim that there is absolutely nothing that can be determined about him by the mere fact of his atheism except for his non-belief in a creator God, then immediately turn around and insist that of course he doesn’t believe in the power of crystals or Noah’s Flood… because he is an atheist and therefore obviously doesn’t believe in anything insufficiently “proven” by science… except for historical events that a sufficient number of people believe to be true… except for those related to religion.  And so forth.\nThe observation that most atheism is little more than a juvenile psychological disorder tends to be supported by the fact that left-wing politics are far more central to most atheists, including some of the most outspoken ones, than their “atheism”, whatever that might actually happen to be.  Consider the Fowl Atheist’s recent statement that\ngodless goals are progressive goals\n:\nAll the big shots in the secular organizations I’ve met seem like rather progressive individuals who would agree entirely with Watson’s [radically pro-abortion] position, and I’ve seen some published statements here and there that support such liberal (i.e., rational) causes as women’s rights and gay rights and equality in general, but otherwise, these particular civil rights issues seem more assumed than advocated by the major organizations — they certainly don’t oppose them. I can understand how a non-profit might have to tread carefully on political claims (they can’t come out and damn the Republican party, after all), but Watson has a point.\nMaybe there should be more overt activism for civil rights in general, in addition to the more focused attention given to atheist/humanist issues. Freethought movements should be about human dignity and freedom in all domains, not just religion. We should own these issues; we need to be on the right side of history….\nOf course, such a move would piss off the libertarian/conservative wing of the atheist movement, but I can’t see a down side to jettisoning them, anyway.\nThat’s fine with me.  I’d quite pleased to have libertarian atheists and conservative atheists on my side; they are proof that godlessness is not completely antithetical to political sanity.  And it is amusing that PZ thinks that murdering unborn children is “the right side of history”; I have absolutely no doubt that the atheists of the future will be denying that pro-abortion equalitarians were motivated by their atheism in much the same way that atheists today deny that rabidly murderous Communists were motivated by their atheism.\nCalling a feminist a feminazi is an insult to the German National Socialist Workers Party.  The feminists and equalitarians have FAR more blood on their hands than the National Socialists ever did.  Consider that in India, there are\nonly 893 girls born\nfor every 1,000 boys.  In China, the girl/boy birth ratio is .855.  And the more educated and wealthy a woman is, the more likely it is that she will murder her daughter.\n“That decrease was even more marked in families where the mothers were wealthier and had 10 or more years of education compared with a poor and uneducated mothers – presumably because the wealthy are more easily able to obtain illegal abortions.”\nIn the name of progress and equality, up to 12 million Indian girls have been slaughtered in the last 30 years.  This is not about human freedom and dignity, it is not “the right side of history”.  It is nothing less than the greatest crime yet committed by humanity against itself.  These progressive atheists and equalitarians will forever bear the curse of the hundreds of millions of innocents whose deaths they have not only demanded, but celebrated.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-25T17:30:00+00:00"
}