{
  "url": "https://voxday.net/2011/05/18/note-to-would-be-rapists/",
  "scraped_at": "2025-12-13T23:11:16.216541",
  "title": "Note to would-be rapists",
  "date_display": "May 18, 2011",
  "date_iso": "2011-05-18T17:00:00+00:00",
  "date_from_url": "2011-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the consensual defense is a perfectly reasonable one, and no man should ever be convicted on the mere basis of a he-said she-said accusation, it’s not a defense that is going to hold up <i>when you a) initially denied that any sort of sexual encounter ever took place</i> and b) you are claiming innocence <a href=\"http://www.euronews.net/2011/05/16/dsk-due-in-court-later-on-monday/\">by reason of an alibi</a>.</p><blockquote><p>International Monetary Fund (IMF) chief Dominique Strauss-Kahn’s defense attorney looks set to claim the French politician’s alleged assault on a Manhattan hotel maid was actually a consensual sexual encounter. During Strauss-Kahn’s arraignment hearing Monday lawyer Ben Brafman told a packed criminal courtroom, “The evidence, we believe, will not be consistent with a forcible encounter.” The New York Post cited a source as saying, “There may well have been consent.”</p></blockquote><p>Now that the alibi defense has disappeared, I’m curious to know if the New York Times and Wall Street Journal are going to start crying anti-semitism as soon as the consensual defense falls apart, (<a href=\"http://feedproxy.google.com/~r/inmalafide/~3/ttpZWw6hsEg/\">his accuser is a Muslim</a>, after all, and therefore must be assumed to be a top al-Qaeda operative), or if they’ll try running with the “too big to jail” argument first.</p><p>NB: One wonders about the wisdom of centralizing the global financial system and turning it over to an idiot who is dumb enough to not only rape an African immigrant, but an African immigrant <i><a href=\"http://www.nypost.com/p/news/local/imf_accuser_in_apt_for_hiv_vics_oZmUkbtouJ14RHw1434HvJ\">who may have HIV or AIDS</a></i>.  Now that would truly make for poetic justice.</p></div>",
  "content_text": "While the consensual defense is a perfectly reasonable one, and no man should ever be convicted on the mere basis of a he-said she-said accusation, it’s not a defense that is going to hold up\nwhen you a) initially denied that any sort of sexual encounter ever took place\nand b) you are claiming innocence\nby reason of an alibi\n.\nInternational Monetary Fund (IMF) chief Dominique Strauss-Kahn’s defense attorney looks set to claim the French politician’s alleged assault on a Manhattan hotel maid was actually a consensual sexual encounter. During Strauss-Kahn’s arraignment hearing Monday lawyer Ben Brafman told a packed criminal courtroom, “The evidence, we believe, will not be consistent with a forcible encounter.” The New York Post cited a source as saying, “There may well have been consent.”\nNow that the alibi defense has disappeared, I’m curious to know if the New York Times and Wall Street Journal are going to start crying anti-semitism as soon as the consensual defense falls apart, (\nhis accuser is a Muslim\n, after all, and therefore must be assumed to be a top al-Qaeda operative), or if they’ll try running with the “too big to jail” argument first.\nNB: One wonders about the wisdom of centralizing the global financial system and turning it over to an idiot who is dumb enough to not only rape an African immigrant, but an African immigrant\nwho may have HIV or AIDS\n.  Now that would truly make for poetic justice.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-18T16:00:00+00:00"
}