{
  "url": "https://voxday.net/2011/05/16/of-captains-and-first-mates/",
  "scraped_at": "2025-12-13T23:11:01.703753",
  "title": "Of captains and first mates",
  "date_display": "May 16, 2011",
  "date_iso": "2011-05-16T13:15:00+00:00",
  "date_from_url": "2011-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.amazon.com/review/R3L8FQSHP2ECNW/ref=cm_cr_dp_perm?ie=UTF8&amp;ASIN=B004W0IRQ8&amp;nodeID=133140011&amp;tag=&amp;linkCode=\">This comment at Amazon</a> concerning Athol Kay’s book on marital sex is educational and highlights both the effectiveness of what he has written as well as the intrinsic challenge its concepts pose to husbands and wives alike:</p><blockquote><p>Let me just say, as a feminist, I found so much of it to be revolting and awful.  I stayed up all Saturday night reading it. I was irritated and pissed off at times, yet I could not put it down….  My husband is a VERY good looking man, think Tom Brady good looking. He is incredibly attractive. 6’3″, green eyes, blondish brown hair/full head, a member of Mensa and makes six figs. His genetics alone are what women would kill for. So why is it then that for me (the higher sex drive person), sex is just eh and I often don’t want it….</p><p>It hit me like a torpedo last night after everybody else had gone to bed. I want the Captain husband and me as his First Mate. I am tired of being the person in control. I never wanted it in the first place, he assumed I did as he saw this dynamic with his parents. I am tired of words vs. actions. He always says I turn him on, I am the one he wants, I am sexy. He doesn’t back it up with action though. His “action” is to wait and see, a very unsexy trait. He is very dominant in his career, so clearly he has the ability. I want him to be dominant in our relationship. I want my husband to say “be ready at 10 pm, wearing these heels and this lingerie” instead of “are you staying up?”. I want the directive and the passion that comes across with it. I would literally be putty in his hands if he told me instead of asked.</p></blockquote><p>In most marriages there are one of four problems, and this woman is a good example of at least one of them.  The first thing to understand is that there is absolutely no such thing as a 50-50 marriage, any more than there can be a true 50-50 presidential election.  It’s not so much that it does not exist as that it cannot possibly exist.  The two-party marriage, like the two-party political system, means that one party must be in the effective majority at all times <i>or nothing will be decided and no actions will be taken.</i> If both parties are in agreement, then obviously there is no issue.  It doesn’t matter who is in charge.  But when they are not in agreement, one party <i>will</i> decide and it will either be the party that is a) the default majority if one was previously determined or b) the more static party.  The reason for (b) is because it is always easier to do nothing than act.</p><p>The four problem scenarios are 1) Captain wife, First Mate husband, 2) Two Captains, 3) Two First Mates, 4) abdicated Captain husband, insubordinate First Mate wife.  Scenario (1) can actually work for a while if the wife has a dominant personality and the husband a submissive one, although it is a fragile relationship and likely to eventually break down due to female hypergamy.  It’s usually only a matter of time before the wife loses all respect for the delta husband and starts pursuing an alpha or beta who makes her feel submissive and sexy.  In any case, there isn’t any fix for this scenario, it simply is what it is.</p><p>The problem with scenario (2) is obvious.  In this case, the marriage is likely headed for divorce sooner rather than later since both parties will tend to simply go their own way and neither will offer much support for the other.  Unless one party breaks the other one to their will, there isn’t going to be much space for negotiating disagreements, and in most cases, both parties will find it easier to end the relationship and move on.  The one positive observation is that such breakups tend to be on the amicable side.</p><p>Scenario (3) is almost always the husband’s fault.  In this case, the wife is actively trying to submit to her husband and follow his lead, only he will not permit her to do so because he doesn’t want the responsibility that goes with the Captain’s role.  It’s fairly difficult to make someone assume leadership when he doesn’t want it, but the one tactic that can work for a woman in this position is to simply refuse to make decisions or even express an opinion.  The key, of course, will be for her to avoid second-guessing those decisions once she finally forces him into making them by default, as that will undermine the very objective she is hoping to accomplish.  This is superficially the situation described by the Amazon reviewer, but based on certain things she says, it appears to be more a combination of (3) and (4).  And this is the one scenario where the constant Churchian calls to “man up” are actually pertinent advice.</p><p>In the case of scenario (4), both the husband and the wife are typically culpable to varying degrees.  It is usually, though not necessarily, started by the wife’s repeated refusal to follow her husband’s lead, an action which is subsequently exacerbated by his abdication of the Captain’s role and refusal to even attempt to offer leadership anymore.  While (4) can be fixed in a relatively easy manner, the challenge is that it will require the wife to do two things that tend to be difficult for women, which is to first accurately share her desires for her husband’s leadership and then to clamp down on her inevitable desire to engage in back-seat driving as soon as he begins to exercise it.  No man is going to lead where no one follows.</p><p>What the Amazon reviewer has belatedly discovered thanks to Athol is that she wants influence and respect, not actual leadership and responsibility.  She clearly doesn’t want to decide when and how to have sex, although the chances are that she also has a contradictory desire for a veto over his decisions.  The problem stems from the observation that very few women truly understand the difference until they obtain, either purposefully or inadvertently, a position in the relationship they do not want.  This problem is compounded by the fact that most men make lousy First Mates; men tend to believe that if a decision is not our responsibility, then we have no need to spend any time thinking about it or even having, let alone expressing, an opinion.</p><p>This is why an atheist like Athol has nevertheless recognized that the Biblical model of the husband is a superior one, even for irreligious couples.  When the man is the Captain and the woman is the First Mate, he is more likely to be comfortable making decisions and she is more likely to offer him both advice and support.  When the woman is the Captain and the man is the First Mate, she is likely to be forced to make decisions that she does not want to make without any advice or support on a regular basis.  And, of course, the 50-50 model, be it Captain-Captain or First Mate-First Mate, is structurally liable to devolve into the tragedy of the commons while it lasts.</p><p>Both men and women would benefit from accepting the actual state of their relationships.  If you’re the one making the decisions in an aspect of your marriage, then you are the leader whether you consider yourself to be or not.  And since you can’t be the leader and not be the leader at the same time, if you don’t want to be the leader then you have to ask your husband or wife to accept leadership on that issue.  If you are the leader, then you need accept the fact of your leadership and the decision-making responsibilities that go with it.  A significant problem with most American marriages, as indicated by the Amazon reviewer, is that women are the sexual Captains <i>and they do not want to be</i>.  But unless they are willing to turn over sexual leadership to their husbands and actively embrace the First Mate role, there can be no permanent improvements in that aspect of the relationship.</p><p>In summary, married women have two choices before them.  Either accept your man’s decisions or accept the fact that you’re going to making the decisions for both of you for the rest of your marriage.  Whether one likes that choice or not, the logic is inescapable.  In a democracy of two, one vote always has to count more than the other one.</p></div>",
  "content_text": "This comment at Amazon\nconcerning Athol Kay’s book on marital sex is educational and highlights both the effectiveness of what he has written as well as the intrinsic challenge its concepts pose to husbands and wives alike:\nLet me just say, as a feminist, I found so much of it to be revolting and awful.  I stayed up all Saturday night reading it. I was irritated and pissed off at times, yet I could not put it down….  My husband is a VERY good looking man, think Tom Brady good looking. He is incredibly attractive. 6’3″, green eyes, blondish brown hair/full head, a member of Mensa and makes six figs. His genetics alone are what women would kill for. So why is it then that for me (the higher sex drive person), sex is just eh and I often don’t want it….\nIt hit me like a torpedo last night after everybody else had gone to bed. I want the Captain husband and me as his First Mate. I am tired of being the person in control. I never wanted it in the first place, he assumed I did as he saw this dynamic with his parents. I am tired of words vs. actions. He always says I turn him on, I am the one he wants, I am sexy. He doesn’t back it up with action though. His “action” is to wait and see, a very unsexy trait. He is very dominant in his career, so clearly he has the ability. I want him to be dominant in our relationship. I want my husband to say “be ready at 10 pm, wearing these heels and this lingerie” instead of “are you staying up?”. I want the directive and the passion that comes across with it. I would literally be putty in his hands if he told me instead of asked.\nIn most marriages there are one of four problems, and this woman is a good example of at least one of them.  The first thing to understand is that there is absolutely no such thing as a 50-50 marriage, any more than there can be a true 50-50 presidential election.  It’s not so much that it does not exist as that it cannot possibly exist.  The two-party marriage, like the two-party political system, means that one party must be in the effective majority at all times\nor nothing will be decided and no actions will be taken.\nIf both parties are in agreement, then obviously there is no issue.  It doesn’t matter who is in charge.  But when they are not in agreement, one party\nwill\ndecide and it will either be the party that is a) the default majority if one was previously determined or b) the more static party.  The reason for (b) is because it is always easier to do nothing than act.\nThe four problem scenarios are 1) Captain wife, First Mate husband, 2) Two Captains, 3) Two First Mates, 4) abdicated Captain husband, insubordinate First Mate wife.  Scenario (1) can actually work for a while if the wife has a dominant personality and the husband a submissive one, although it is a fragile relationship and likely to eventually break down due to female hypergamy.  It’s usually only a matter of time before the wife loses all respect for the delta husband and starts pursuing an alpha or beta who makes her feel submissive and sexy.  In any case, there isn’t any fix for this scenario, it simply is what it is.\nThe problem with scenario (2) is obvious.  In this case, the marriage is likely headed for divorce sooner rather than later since both parties will tend to simply go their own way and neither will offer much support for the other.  Unless one party breaks the other one to their will, there isn’t going to be much space for negotiating disagreements, and in most cases, both parties will find it easier to end the relationship and move on.  The one positive observation is that such breakups tend to be on the amicable side.\nScenario (3) is almost always the husband’s fault.  In this case, the wife is actively trying to submit to her husband and follow his lead, only he will not permit her to do so because he doesn’t want the responsibility that goes with the Captain’s role.  It’s fairly difficult to make someone assume leadership when he doesn’t want it, but the one tactic that can work for a woman in this position is to simply refuse to make decisions or even express an opinion.  The key, of course, will be for her to avoid second-guessing those decisions once she finally forces him into making them by default, as that will undermine the very objective she is hoping to accomplish.  This is superficially the situation described by the Amazon reviewer, but based on certain things she says, it appears to be more a combination of (3) and (4).  And this is the one scenario where the constant Churchian calls to “man up” are actually pertinent advice.\nIn the case of scenario (4), both the husband and the wife are typically culpable to varying degrees.  It is usually, though not necessarily, started by the wife’s repeated refusal to follow her husband’s lead, an action which is subsequently exacerbated by his abdication of the Captain’s role and refusal to even attempt to offer leadership anymore.  While (4) can be fixed in a relatively easy manner, the challenge is that it will require the wife to do two things that tend to be difficult for women, which is to first accurately share her desires for her husband’s leadership and then to clamp down on her inevitable desire to engage in back-seat driving as soon as he begins to exercise it.  No man is going to lead where no one follows.\nWhat the Amazon reviewer has belatedly discovered thanks to Athol is that she wants influence and respect, not actual leadership and responsibility.  She clearly doesn’t want to decide when and how to have sex, although the chances are that she also has a contradictory desire for a veto over his decisions.  The problem stems from the observation that very few women truly understand the difference until they obtain, either purposefully or inadvertently, a position in the relationship they do not want.  This problem is compounded by the fact that most men make lousy First Mates; men tend to believe that if a decision is not our responsibility, then we have no need to spend any time thinking about it or even having, let alone expressing, an opinion.\nThis is why an atheist like Athol has nevertheless recognized that the Biblical model of the husband is a superior one, even for irreligious couples.  When the man is the Captain and the woman is the First Mate, he is more likely to be comfortable making decisions and she is more likely to offer him both advice and support.  When the woman is the Captain and the man is the First Mate, she is likely to be forced to make decisions that she does not want to make without any advice or support on a regular basis.  And, of course, the 50-50 model, be it Captain-Captain or First Mate-First Mate, is structurally liable to devolve into the tragedy of the commons while it lasts.\nBoth men and women would benefit from accepting the actual state of their relationships.  If you’re the one making the decisions in an aspect of your marriage, then you are the leader whether you consider yourself to be or not.  And since you can’t be the leader and not be the leader at the same time, if you don’t want to be the leader then you have to ask your husband or wife to accept leadership on that issue.  If you are the leader, then you need accept the fact of your leadership and the decision-making responsibilities that go with it.  A significant problem with most American marriages, as indicated by the Amazon reviewer, is that women are the sexual Captains\nand they do not want to be\n.  But unless they are willing to turn over sexual leadership to their husbands and actively embrace the First Mate role, there can be no permanent improvements in that aspect of the relationship.\nIn summary, married women have two choices before them.  Either accept your man’s decisions or accept the fact that you’re going to making the decisions for both of you for the rest of your marriage.  Whether one likes that choice or not, the logic is inescapable.  In a democracy of two, one vote always has to count more than the other one.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-16T12:15:00+00:00"
}