{
  "url": "https://voxday.net/2011/05/03/on-placement-of-elephants/",
  "scraped_at": "2025-12-13T23:09:58.996518",
  "title": "On the placement of elephants",
  "date_display": "May 3, 2011",
  "date_iso": "2011-05-03T19:15:00+00:00",
  "date_from_url": "2011-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m always more than a little amused when people comment that I am wasting my time by posting about Game, or atheism, or [fill in subject of little interest to you].  The fact is that I probably spend more time on pressing things like playing Guitar Hero and wondering why a superlative general like Hannibal would have elected <a href=\"http://www.roman-empire.net/army/zama.html\">to place his elephants in the center at Zama</a> when he had to know that his cavalry on the wings was outnumbered by the Italian and Numidian cavalries opposing them.</p><blockquote><p>The Romans drew up their forces in three lines, creating an effective reserve in the rear. The maniples however stood in separate formations, not creating a continuous line. The gaps were loosely filled by the velites (skirmishers).  The Roman left wing was made up of Italian allied cavalry, while the right wing consisted of the Numidian calvary of Massinissa.</p><p>Hannibal meanwhile also aligned his troops in three lines. His mercenaries took the front, the second line was formed by the Carthaginian forces and those of the Carthaginian territories (Liby-Phoenicians). Finally at the rear stood Hannibal’s most reliable troops, the veterans from the campaign in Italy.  At the very front of the army Hannibal placed his elephant corps. On his left wing he had his Numidian cavalry and to the right stood the Carthaginian cavalry.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.roman-empire.net/army/pics/chart-zama-2-b.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"138\" src=\"http://www.roman-empire.net/army/pics/chart-zama-2-b.jpg\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.roman-empire.net/army/pics/chart-zama-2-b.jpg\" decoding=\"async\" height=\"138\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20138%22%3E%3C/svg%3E\" width=\"320\"/></a></div><p> After some initial skirmishes between the cavalry units, the battle began with a charge of the Carthaginian war elephants. They were meant to cause confusion and terrify the enemy. But it was here that Scipio’s preparation in lining up his troops in separate maniples bore fruit. The velites in the gaps now engaged the elephants, drawing them up through the alleys between the main Roman units. Also Scipio had ordered for every trumpeter of the army to blow, creating a startling noise which terrified the nervous beasts. This Roman tactic was largely successful. Most of the elephants simply charged up the alleys between the units, others even turned and collided with their own cavalry. However some did indeed drive into the Roman ranks and caused considerable damage before escaping up the alleys.</p></blockquote><p>Since horses tend to be more skittish than infantry, it seems to me that it would have been significantly more effective to divide the elephant corps in two and attempt to drive off at least one cavalry wing, following the elephant charge up with an immediate cavalry attack while the Roman wings were still in disarray.  Sure, hindsight is 20/20, but the fact that Africanus had his troops drawn up in columns rather than lines should have been an obvious clue that he planned to permit the elephants to pass through the Roman center.</p><p>Anyhow, Ender and I have been playing <i>Hannibal</i> lately and it’s not just an excellent historical wargame, it’s an educational game that tends to inspire this sort of thinking.  Now I’m going to have to break out a Zama game and see if I can game out what might have happened if Hannibal had used his elephants as a means of actively defending his wings instead of simply trying to smash the Roman center with them.</p></div>",
  "content_text": "I’m always more than a little amused when people comment that I am wasting my time by posting about Game, or atheism, or [fill in subject of little interest to you].  The fact is that I probably spend more time on pressing things like playing Guitar Hero and wondering why a superlative general like Hannibal would have elected\nto place his elephants in the center at Zama\nwhen he had to know that his cavalry on the wings was outnumbered by the Italian and Numidian cavalries opposing them.\nThe Romans drew up their forces in three lines, creating an effective reserve in the rear. The maniples however stood in separate formations, not creating a continuous line. The gaps were loosely filled by the velites (skirmishers).  The Roman left wing was made up of Italian allied cavalry, while the right wing consisted of the Numidian calvary of Massinissa.\nHannibal meanwhile also aligned his troops in three lines. His mercenaries took the front, the second line was formed by the Carthaginian forces and those of the Carthaginian territories (Liby-Phoenicians). Finally at the rear stood Hannibal’s most reliable troops, the veterans from the campaign in Italy.  At the very front of the army Hannibal placed his elephant corps. On his left wing he had his Numidian cavalry and to the right stood the Carthaginian cavalry.\nAfter some initial skirmishes between the cavalry units, the battle began with a charge of the Carthaginian war elephants. They were meant to cause confusion and terrify the enemy. But it was here that Scipio’s preparation in lining up his troops in separate maniples bore fruit. The velites in the gaps now engaged the elephants, drawing them up through the alleys between the main Roman units. Also Scipio had ordered for every trumpeter of the army to blow, creating a startling noise which terrified the nervous beasts. This Roman tactic was largely successful. Most of the elephants simply charged up the alleys between the units, others even turned and collided with their own cavalry. However some did indeed drive into the Roman ranks and caused considerable damage before escaping up the alleys.\nSince horses tend to be more skittish than infantry, it seems to me that it would have been significantly more effective to divide the elephant corps in two and attempt to drive off at least one cavalry wing, following the elephant charge up with an immediate cavalry attack while the Roman wings were still in disarray.  Sure, hindsight is 20/20, but the fact that Africanus had his troops drawn up in columns rather than lines should have been an obvious clue that he planned to permit the elephants to pass through the Roman center.\nAnyhow, Ender and I have been playing\nHannibal\nlately and it’s not just an excellent historical wargame, it’s an educational game that tends to inspire this sort of thinking.  Now I’m going to have to break out a Zama game and see if I can game out what might have happened if Hannibal had used his elephants as a means of actively defending his wings instead of simply trying to smash the Roman center with them.",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-03T18:15:00+00:00"
}