{
  "url": "https://voxday.net/2011/05/22/rino-down/",
  "scraped_at": "2025-12-13T23:11:32.724757",
  "title": "RINO down",
  "date_display": "May 22, 2011",
  "date_iso": "2011-05-22T07:53:00+00:00",
  "date_from_url": "2011-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d like to think I helped provide Gov. Daniels with some clarity <a href=\"http://www.washingtonpost.com/politics/indianas-republican-gov-mitch-daniels-rules-out-run-for-the-white-house/2011/05/22/AFB4ju8G_story.html?hpid=z3\">on the matter</a> last week.  I don’t, actually, but I enjoy having the opportunity to do so.  While it was nice that the Indiana governor too the message of last week’s column to heart, it rather more likely that it was the revolving door that knocked a little sense into him.</p><blockquote><p>Indiana Gov. Mitch Daniels said early Sunday that he won’t run for president because of family considerations, narrowing the field in the race for the GOP nomination….  A two-term Midwestern governor, Daniels had been considering a bid for months and was pressured by many in the establishment wing of the party hungering for a conservative with a strong fiscal record to run. He expressed interest in getting in the race partly because it would give him a national platform to ensure the country’s fiscal health would remain part of the 2012 debate.</p></blockquote><p>Now if the dishrag and the ridiculous me-too from the Fed will only drop out of the race, we can see a clear and straightforward choice between Ron Paul and Captain Underoos.</p></div>",
  "content_text": "I’d like to think I helped provide Gov. Daniels with some clarity\non the matter\nlast week.  I don’t, actually, but I enjoy having the opportunity to do so.  While it was nice that the Indiana governor too the message of last week’s column to heart, it rather more likely that it was the revolving door that knocked a little sense into him.\nIndiana Gov. Mitch Daniels said early Sunday that he won’t run for president because of family considerations, narrowing the field in the race for the GOP nomination….  A two-term Midwestern governor, Daniels had been considering a bid for months and was pressured by many in the establishment wing of the party hungering for a conservative with a strong fiscal record to run. He expressed interest in getting in the race partly because it would give him a national platform to ensure the country’s fiscal health would remain part of the 2012 debate.\nNow if the dishrag and the ridiculous me-too from the Fed will only drop out of the race, we can see a clear and straightforward choice between Ron Paul and Captain Underoos.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-22T06:53:00+00:00"
}