{
  "url": "https://voxday.net/2011/05/24/stay-away-from-career-women-ii/",
  "scraped_at": "2025-12-13T23:11:44.703911",
  "title": "Stay away from career women II",
  "date_display": "May 24, 2011",
  "date_iso": "2011-05-24T10:15:00+00:00",
  "date_from_url": "2011-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday a few working wives took exception to the logic which suggests that because working wives tend to have more affairs than non-working wives, it is wise for the man who is interested in marrying to eliminate career-oriented women from his list of prospective mates.  This was entirely unsurprising, but not entirely unamusing.</p><p>On a seemingly unrelated note, I have been reading Umberto Eco’s <i>On Literature </i>this past week, and one passage in particular will surely remind the Dread Ilk of why I regard him as a writer worthy of a regard that comes perilously close to idolatry.  (Bear with me, this will all make sense soon.)<i>  <b>“Our only commitment is, by serious and continued work, without giving in to any blackmail, to humiliate those who are our inferiors.”</b></i></p><p>Thus spake Umberto.  And as an Award-Winning Cruelty Artist and Internet Superintelligence, I have little choice but to heed the Zarathustranesque call. <i>Hier steh ich, ich kann nicht anders, weil es ist mein Los</i>.</p><p>So.  With that in mind, let us now consider the claims made by a few of the various female critics yesterday.  Connie asserted: <i>“The percentage of men who cheat on women still outnumbers the percentage of women who cheat on men by at least double.”</i></p><p>This is simply wrong; as I correctly concluded on the mere basis of her sex and passive-aggression. Connie is a statistical illiterate.  The most recent figures I have seen report that 20% of married men and 15% of married women have been unfaithful.  This means that men are 33% more likely to cheat than women, which is significantly less than “more than 100%.”  But more relevant given the context of the post is the fact that men between the ages of 25 and 44, (the age range in which most marriage and marital unfaithfulness occurs), are also 21% more likely to be a participant in the labor force.  This tends to support the reported link between increased female labor force participation and increased female unfaithfulness.</p><p>This link is further bolstered by a 2005 report which shows:</p><p>1. “Working women are more than three times more likely to be divorced than their stay-at-home counterparts.”</p><p>2.  “The longer hours women work, the more likely they are to be divorced.”</p><p>3.  “Compared to non-working women, those with a full-time job have a 29 per cent higher odds of divorce.”</p><p>Now, obviously not all divorces are the result of extramarital affairs, let alone affairs by the wife.  But the statistics are conclusive and clear.  If a man elects to pursue a relationship with a woman who intends to continue working full-time, he will significantly increase the chances that his wife will be unfaithful to him and that he will eventually end up divorced.  Furthermore, he should also know that if his marriage survives, his wife will make for an inferior mother, as his children will be 23% less likely to pass college entrance exams, 29% more likely to be unemployed, and will weigh an average of four pounds more at age 11 than children whose mothers care enough about them to stay at home and raise them.</p><p>(For the Nth time, this should not be taken as criticism of single mothers who have no choice but to work and provide for their children.  One cannot condemn a nonexistent choice.  However, most working mothers who are married do not have to work, they have instead made a lifestyle choice that happens to place a priority on other things than personally raising their children.  While it is their right to make such a choice, it is not their right to pretend they have not made it.)</p><p>BJ attempted to respond by relying upon the always humorous, but logically invalid Appeal to Individual Nonexistent Hearsay approach, as she wrote: <i>“Sorry, but my husband has yet to tell me that a co-worker hit on him, but rather a customer (i.e., stay at home moms who are good wives and superior mothers).”</i></p><p>BJ’s argument is based on four central assumptions:</p><p>1.  BJ’s husband as likely to report being hit on by a co-worker, who would be a regular threat to their marriage, than a customer with whom he spends far less, if indeed any, time.  This may be true, but it is by no means certain.  And BJ is not a reliable determinant of her husband’s inclination to keep her informed on the subject.</p><p>2.  BJ’s husband is equally attractive to his co-workers as his customers.  This is questionable.  Since his work brings him into regular contact with stay-at-home wives, his employment status is probably relatively low, an observation supported by our knowledge that BJ herself works and supplements the marital income.</p><p>3.  BJ’s husband has a similar number of female co-workers and customers.  This is unknown, but unlikely.  But it’s an important assumption, because even if he had been hit on 10 times more often by stay-at-home wives than by his female co-workers, the logic would still remain relevant if he had 100 female clients and two female co-workers.  While 10&gt;1, 10%&lt;50%.</p><p>4.  BJ’s husband’s experience is statistically relevant.  Since we are dealing with a sample size of one, it is obvious that her entire objection is completely spurious.  In my own anecdotal and equally statistically invalid experience, I have never been hit on by a stay-at-home wife while I have been the recipient of definite indicators of sexual interest from working wives on many occasions.  Of course, I have always been of relatively high employment status and my work seldom brings me into contact with stay-at-home wives, so it should come as no surprise that my experience would significantly diverge from that of BJ’s husband.</p><p>Connie next attempted to appeal to studies that equate women’s “equality” with national “happiness”. <i>“The happiest societies on earth, those that were surveyed quantitatively on quality of life across a variety of factors, correlate strongly with the societies having the most equality for women.”  </i>This is partially true, but as you might correctly conclude, it depends entirely upon how “happiness” is defined.  Given that Egypt and Saudi Arabia were rated the 12th and 13th happiest nations on Earth by the New Economics Foundation, (the famously equalitarian nation of Sweden was ranked 53rd), her assertion is as dubious as it is irrelevant to the subject of whether working women are a reasonable bet to make good wives.  Most “happiness” metrics are little more than a measure of societal wealth, and since only wealthy societies can afford the economic and societal ills of equalitarianism, (even if only for a few decades before the inevitable structural collapse), it should come as no surprise that the correlation is mistaken for causation by the illogical and statistically illiterate.</p><p>But without question my favorite response was the quintessentially feminine one from Betty, who apparently takes an <i>ad hominem</i> approach to ascertaining the truth of any and all things. <i>“After reading vox’s blog about women in the workplace (talk about painting a “Scarlet S” with a wide brush) I can’t in good conscience buy the argument [the column on Herman Cain] above. Being a member of MENSA doesn’t make him unequivocally correct.”</i></p><p>It is absolutely true that my daunting superintelligence is no <i>guarantee</i> that I am correct on any given matter, it merely indicates that those of lesser intelligence, a subset of humanity which includes approximately 6.92 billion people if one rounds up from the nearest hundredth, should at least be open to the possibility that they are wrong when their opinion diverges dramatically from my own.  However, neither the vastness of my intellect nor my statistically sound conclusions have anything at all to do with the wisdom of electing a former Federal Reserve executive to fix a problem that was primarily caused by the Federal Reserve, still less a Fed official who believes that the Fed has done nothing questionable, let along wrong.</p></div>",
  "content_text": "Yesterday a few working wives took exception to the logic which suggests that because working wives tend to have more affairs than non-working wives, it is wise for the man who is interested in marrying to eliminate career-oriented women from his list of prospective mates.  This was entirely unsurprising, but not entirely unamusing.\nOn a seemingly unrelated note, I have been reading Umberto Eco’s\nOn Literature\nthis past week, and one passage in particular will surely remind the Dread Ilk of why I regard him as a writer worthy of a regard that comes perilously close to idolatry.  (Bear with me, this will all make sense soon.)\n“Our only commitment is, by serious and continued work, without giving in to any blackmail, to humiliate those who are our inferiors.”\nThus spake Umberto.  And as an Award-Winning Cruelty Artist and Internet Superintelligence, I have little choice but to heed the Zarathustranesque call.\nHier steh ich, ich kann nicht anders, weil es ist mein Los\n.\nSo.  With that in mind, let us now consider the claims made by a few of the various female critics yesterday.  Connie asserted:\n“The percentage of men who cheat on women still outnumbers the percentage of women who cheat on men by at least double.”\nThis is simply wrong; as I correctly concluded on the mere basis of her sex and passive-aggression. Connie is a statistical illiterate.  The most recent figures I have seen report that 20% of married men and 15% of married women have been unfaithful.  This means that men are 33% more likely to cheat than women, which is significantly less than “more than 100%.”  But more relevant given the context of the post is the fact that men between the ages of 25 and 44, (the age range in which most marriage and marital unfaithfulness occurs), are also 21% more likely to be a participant in the labor force.  This tends to support the reported link between increased female labor force participation and increased female unfaithfulness.\nThis link is further bolstered by a 2005 report which shows:\n1. “Working women are more than three times more likely to be divorced than their stay-at-home counterparts.”\n2.  “The longer hours women work, the more likely they are to be divorced.”\n3.  “Compared to non-working women, those with a full-time job have a 29 per cent higher odds of divorce.”\nNow, obviously not all divorces are the result of extramarital affairs, let alone affairs by the wife.  But the statistics are conclusive and clear.  If a man elects to pursue a relationship with a woman who intends to continue working full-time, he will significantly increase the chances that his wife will be unfaithful to him and that he will eventually end up divorced.  Furthermore, he should also know that if his marriage survives, his wife will make for an inferior mother, as his children will be 23% less likely to pass college entrance exams, 29% more likely to be unemployed, and will weigh an average of four pounds more at age 11 than children whose mothers care enough about them to stay at home and raise them.\n(For the Nth time, this should not be taken as criticism of single mothers who have no choice but to work and provide for their children.  One cannot condemn a nonexistent choice.  However, most working mothers who are married do not have to work, they have instead made a lifestyle choice that happens to place a priority on other things than personally raising their children.  While it is their right to make such a choice, it is not their right to pretend they have not made it.)\nBJ attempted to respond by relying upon the always humorous, but logically invalid Appeal to Individual Nonexistent Hearsay approach, as she wrote:\n“Sorry, but my husband has yet to tell me that a co-worker hit on him, but rather a customer (i.e., stay at home moms who are good wives and superior mothers).”\nBJ’s argument is based on four central assumptions:\n1.  BJ’s husband as likely to report being hit on by a co-worker, who would be a regular threat to their marriage, than a customer with whom he spends far less, if indeed any, time.  This may be true, but it is by no means certain.  And BJ is not a reliable determinant of her husband’s inclination to keep her informed on the subject.\n2.  BJ’s husband is equally attractive to his co-workers as his customers.  This is questionable.  Since his work brings him into regular contact with stay-at-home wives, his employment status is probably relatively low, an observation supported by our knowledge that BJ herself works and supplements the marital income.\n3.  BJ’s husband has a similar number of female co-workers and customers.  This is unknown, but unlikely.  But it’s an important assumption, because even if he had been hit on 10 times more often by stay-at-home wives than by his female co-workers, the logic would still remain relevant if he had 100 female clients and two female co-workers.  While 10>1, 10%<50%.\n4.  BJ’s husband’s experience is statistically relevant.  Since we are dealing with a sample size of one, it is obvious that her entire objection is completely spurious.  In my own anecdotal and equally statistically invalid experience, I have never been hit on by a stay-at-home wife while I have been the recipient of definite indicators of sexual interest from working wives on many occasions.  Of course, I have always been of relatively high employment status and my work seldom brings me into contact with stay-at-home wives, so it should come as no surprise that my experience would significantly diverge from that of BJ’s husband.\nConnie next attempted to appeal to studies that equate women’s “equality” with national “happiness”.\n“The happiest societies on earth, those that were surveyed quantitatively on quality of life across a variety of factors, correlate strongly with the societies having the most equality for women.”\nThis is partially true, but as you might correctly conclude, it depends entirely upon how “happiness” is defined.  Given that Egypt and Saudi Arabia were rated the 12th and 13th happiest nations on Earth by the New Economics Foundation, (the famously equalitarian nation of Sweden was ranked 53rd), her assertion is as dubious as it is irrelevant to the subject of whether working women are a reasonable bet to make good wives.  Most “happiness” metrics are little more than a measure of societal wealth, and since only wealthy societies can afford the economic and societal ills of equalitarianism, (even if only for a few decades before the inevitable structural collapse), it should come as no surprise that the correlation is mistaken for causation by the illogical and statistically illiterate.\nBut without question my favorite response was the quintessentially feminine one from Betty, who apparently takes an\nad hominem\napproach to ascertaining the truth of any and all things.\n“After reading vox’s blog about women in the workplace (talk about painting a “Scarlet S” with a wide brush) I can’t in good conscience buy the argument [the column on Herman Cain] above. Being a member of MENSA doesn’t make him unequivocally correct.”\nIt is absolutely true that my daunting superintelligence is no\nguarantee\nthat I am correct on any given matter, it merely indicates that those of lesser intelligence, a subset of humanity which includes approximately 6.92 billion people if one rounds up from the nearest hundredth, should at least be open to the possibility that they are wrong when their opinion diverges dramatically from my own.  However, neither the vastness of my intellect nor my statistically sound conclusions have anything at all to do with the wisdom of electing a former Federal Reserve executive to fix a problem that was primarily caused by the Federal Reserve, still less a Fed official who believes that the Fed has done nothing questionable, let along wrong.",
  "tags": [
    "mailvox",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-24T09:15:00+00:00"
}