{
  "url": "https://voxday.net/2011/05/31/vaccine-doctor-fraud/",
  "scraped_at": "2025-12-13T23:12:22.233643",
  "title": "Vaccine doctor fraud",
  "date_display": "May 31, 2011",
  "date_iso": "2011-05-31T09:20:00+00:00",
  "date_from_url": "2011-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A pro-vaccine researcher <a href=\"http://www.reuters.com/article/2011/04/13/us-crime-research-funds-idUSTRE73C8JJ20110413\">is indicted</a>:</p><blockquote><p>A scientist in Denmark has been indicted by a federal grand jury in Atlanta for allegedly stealing $1 million in grant money that the Centers for Disease Control and Prevention had earmarked for autism research.  U.S. prosecutors on Wednesday said they are seeking to extradite Poul Thorsen, 49, accused of wire fraud and money laundering.  He used the stolen money to buy a home in Atlanta, a Harley Davidson motorcycle and two cars, prosecutors said.</p><p>“Grant money for disease research is a precious commodity,” said Sally Yates, U.S. attorney for the Northern District of Georgia, in a news release.  “When grant funds are stolen, we lose not only the money, but also the opportunity to better understand and cure debilitating diseases.”</p><p>Thorsen, a visiting scientist at the Atlanta-based CDC in the 1990s, helped two government agencies in Denmark obtain $11 million in research grants.  He moved back to Denmark in 2002 to be principal investigator for the program. Prosecutors said he was also in charge of administering the research dollars, earmarked in part to study the relationship between autism and exposure to vaccines.</p></blockquote><p>The response from the vaccine propaganda camp is interesting.  David Gorski at Science-Based Medicine <a href=\"http://www.sciencebasedmedicine.org/index.php/the-curious-case-of-poul-thorsen-fraud-and-embezzlement-and-the-danish-studies/\">writes</a>: “If there’s one thing about the anti-vaccine movement, it’s all about the ad hominem attack. Failing to win on science, clinical trials, epidemiology, and other objective evidence, with few exceptions, anti-vaccine propagandists fall back on attacking the person instead of the evidence.”</p><p>The problem with Gorski’s attempted defense is that in the field of research science, an ad hominem attack is a valid and rational one because all of the other elements, the “science, clinical trials, epidemiology, and other objective evidence” are only as reliable as the scientific integrity of the researchers involved.  Peer review, as we all know, is worthless, being nothing more than what in other fields is known as “editing”; if the underlying experiment has not been replicated then it has not actually been scientifically verified regardless of how many credentialed individuals have read the paper.  If the “principle investigator” for the research program is financially corrupt, there is no reason to assume that the rest of the program, indeed, <i>the rest of the field</i> is devoid of similar corruption, particularly when such corruption has long been suspected of researchers working in the interests of Big Pharma and funded in part by it.</p><p>Moreover, Gorski’s argument is on the shady side, given that there is very little objective evidence that can be presented for the safety of vaccines and a good deal of circumstantial evidence that the dangers they pose to children’s health is both real and underreported.  The millions of dollars paid out annually of the VAERS system, which despite the reluctance of doctors to admit or report negative reactions still records around 4,500 cases of “permanent disability, hospitalization, life-threatening illnesses or death”, is almost never mentioned by the “vaccines are totally safe” crowd.  Nor do they admit that there is not a single double-blind experiment comparing the health of a control group of children receiving the current American vaccine schedule with groups receiving a partial schedule or a series of placebo shots.</p><p>Gorski also shows his own lack of integrity when he correctly points out that Thorsen was not the principle author of the NEJM and Pediatrics papers, but pretends not to know that “whatever leadership position he may have held at Aarhus University and in its vaccine studies group” was actually the chief of the North Atlantic Neuro-Epidemiology Alliance group based at the University of Aarhus, Denmark and funded in part by the U.S. Centers for Disease Control.</p><p>Science cannot be said to be on the pro-vaccine side for the obvious reason that its “scientists” simply have not been willing to do the relevant science.  In fact, the vaccine propagandists have spent decades producing various statistical surveys and writing acerbic blog posts in an attempt to <i>avoid</i> doing <i>the only sort of scientific experiment</i> that would be conclusive on the matter.</p><p>Now, before the vaccine propagandists leap in, I will again point out that I am not an anti-vaccine activist; I got a tetanus shot myself not long ago.  I am, rather, a vaccine safety advocate.  Real doctors, with real concerns about real risks to children for whom they are responsible, do not blindly advocate the macro one-size-fits-all approach and sacrifice the vaccine sensitive upon the altar of herd immunity.  No pediatrician worth his salt is going to administer vaccines according to the schedule once he hears that a child had a serious adverse reaction to a vaccine.  The goal of herd immunity does not trump the physician’s oath to first do no harm.</p><p>The problem is not that parents are overprotective of their children or that they are too stupid to understand the potential benefits of herd immunity.  The problem is that the vaccine propagandists have been deeply dishonest in the past and therefore rightly lost the trust of many parents.  Vaccine advocates have not been straightforward with the actual risks of vaccines because they are afraid that fully informed parents will not abide by the program that they believe will be best for the entire community, but will instead do what is best for the individual child, which is a delayed and staggered schedule that ensures the child gets all the necessary vaccines without putting a risky amount of stress on their developing systems.</p><p>The solution is honesty, scientific integrity, and openness.  Until the pro-vaccine camp is willing to be honest about the risks as well as the benefits of vaccines <i>to the individual child</i>, all of their efforts to convince parents will not only be in vain, but will be counterproductive.</p></div>",
  "content_text": "A pro-vaccine researcher\nis indicted\n:\nA scientist in Denmark has been indicted by a federal grand jury in Atlanta for allegedly stealing $1 million in grant money that the Centers for Disease Control and Prevention had earmarked for autism research.  U.S. prosecutors on Wednesday said they are seeking to extradite Poul Thorsen, 49, accused of wire fraud and money laundering.  He used the stolen money to buy a home in Atlanta, a Harley Davidson motorcycle and two cars, prosecutors said.\n“Grant money for disease research is a precious commodity,” said Sally Yates, U.S. attorney for the Northern District of Georgia, in a news release.  “When grant funds are stolen, we lose not only the money, but also the opportunity to better understand and cure debilitating diseases.”\nThorsen, a visiting scientist at the Atlanta-based CDC in the 1990s, helped two government agencies in Denmark obtain $11 million in research grants.  He moved back to Denmark in 2002 to be principal investigator for the program. Prosecutors said he was also in charge of administering the research dollars, earmarked in part to study the relationship between autism and exposure to vaccines.\nThe response from the vaccine propaganda camp is interesting.  David Gorski at Science-Based Medicine\nwrites\n: “If there’s one thing about the anti-vaccine movement, it’s all about the ad hominem attack. Failing to win on science, clinical trials, epidemiology, and other objective evidence, with few exceptions, anti-vaccine propagandists fall back on attacking the person instead of the evidence.”\nThe problem with Gorski’s attempted defense is that in the field of research science, an ad hominem attack is a valid and rational one because all of the other elements, the “science, clinical trials, epidemiology, and other objective evidence” are only as reliable as the scientific integrity of the researchers involved.  Peer review, as we all know, is worthless, being nothing more than what in other fields is known as “editing”; if the underlying experiment has not been replicated then it has not actually been scientifically verified regardless of how many credentialed individuals have read the paper.  If the “principle investigator” for the research program is financially corrupt, there is no reason to assume that the rest of the program, indeed,\nthe rest of the field\nis devoid of similar corruption, particularly when such corruption has long been suspected of researchers working in the interests of Big Pharma and funded in part by it.\nMoreover, Gorski’s argument is on the shady side, given that there is very little objective evidence that can be presented for the safety of vaccines and a good deal of circumstantial evidence that the dangers they pose to children’s health is both real and underreported.  The millions of dollars paid out annually of the VAERS system, which despite the reluctance of doctors to admit or report negative reactions still records around 4,500 cases of “permanent disability, hospitalization, life-threatening illnesses or death”, is almost never mentioned by the “vaccines are totally safe” crowd.  Nor do they admit that there is not a single double-blind experiment comparing the health of a control group of children receiving the current American vaccine schedule with groups receiving a partial schedule or a series of placebo shots.\nGorski also shows his own lack of integrity when he correctly points out that Thorsen was not the principle author of the NEJM and Pediatrics papers, but pretends not to know that “whatever leadership position he may have held at Aarhus University and in its vaccine studies group” was actually the chief of the North Atlantic Neuro-Epidemiology Alliance group based at the University of Aarhus, Denmark and funded in part by the U.S. Centers for Disease Control.\nScience cannot be said to be on the pro-vaccine side for the obvious reason that its “scientists” simply have not been willing to do the relevant science.  In fact, the vaccine propagandists have spent decades producing various statistical surveys and writing acerbic blog posts in an attempt to\navoid\ndoing\nthe only sort of scientific experiment\nthat would be conclusive on the matter.\nNow, before the vaccine propagandists leap in, I will again point out that I am not an anti-vaccine activist; I got a tetanus shot myself not long ago.  I am, rather, a vaccine safety advocate.  Real doctors, with real concerns about real risks to children for whom they are responsible, do not blindly advocate the macro one-size-fits-all approach and sacrifice the vaccine sensitive upon the altar of herd immunity.  No pediatrician worth his salt is going to administer vaccines according to the schedule once he hears that a child had a serious adverse reaction to a vaccine.  The goal of herd immunity does not trump the physician’s oath to first do no harm.\nThe problem is not that parents are overprotective of their children or that they are too stupid to understand the potential benefits of herd immunity.  The problem is that the vaccine propagandists have been deeply dishonest in the past and therefore rightly lost the trust of many parents.  Vaccine advocates have not been straightforward with the actual risks of vaccines because they are afraid that fully informed parents will not abide by the program that they believe will be best for the entire community, but will instead do what is best for the individual child, which is a delayed and staggered schedule that ensures the child gets all the necessary vaccines without putting a risky amount of stress on their developing systems.\nThe solution is honesty, scientific integrity, and openness.  Until the pro-vaccine camp is willing to be honest about the risks as well as the benefits of vaccines\nto the individual child\n, all of their efforts to convince parents will not only be in vain, but will be counterproductive.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-31T08:20:00+00:00"
}