{
  "url": "https://voxday.net/2011/05/11/wall-street-journal-scrubs-true-finns/",
  "scraped_at": "2025-12-13T23:10:37.308942",
  "title": "The Wall Street Journal scrubs the True Finns",
  "date_display": "May 11, 2011",
  "date_iso": "2011-05-11T13:00:00+00:00",
  "date_from_url": "2011-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger catches the WSJ doing <a href=\"http://market-ticker.org/akcs-www?post=185817\">a little ex post facto editing</a> of the letter written by True Finn leader Timo Soini on the corrupt nature of the European banking bailouts:</p><blockquote><p><b>Why I Won’t Support More Bailouts</b></p><p>When I had the honor of leading the True Finn Party to electoral victory in April, we made a solemn promise to oppose the so-called bailouts of euro-zone member states. <b>These bailouts are patently bad for Europe, bad for Finland and bad for the countries that have been forced to accept them.</b> Europe is suffering from the economic gangrene of insolvency—both public and private. And unless we amputate that which cannot be saved, we risk poisoning the whole body.</p><p><b>The official wisdom is that Greece, Ireland and Portugal have been hit by a liquidity crisis, so they needed a momentary infusion of capital, after which everything would return to normal. But this official version is a lie, one that takes the ordinary people of Europe for idiots. They deserve better from politics and their leaders.</b></p><p>To understand the real nature and purpose of the bailouts, we first have to understand who really benefits from them. <b>Let’s follow the money.</b></p><p>At the risk of being accused of populism, we’ll begin with the obvious: It is not the little guy that benefits. He is being milked and lied to in order to keep the insolvent system running. He is paid less and taxed more to provide the money needed to keep this Ponzi scheme going. Meanwhile, <b>a kind of deadly</b> symbiosis has developed between politicians and banks: Our political leaders borrow ever more money to pay off the banks, which return the favor by lending ever-more money back to our governments, <b>keeping the scheme afloat</b>.</p><p>In a true market economy, bad choices get penalized. <b>Not here. When the inevitable failure of overindebted euro-zone countries came to light, a secret pact was made.</b> Instead of accepting losses on unsound investments—which would have led to the probable collapse <b>and national bailout</b> of some banks—it was decided to transfer the losses to taxpayers via loans, guarantees and opaque constructs such as the European Financial Stability Fund, <b>Ireland’s NAMA and a lineup of special-purpose vehicles that make Enron look simple. Some politicians understood this; others just panicked and did as they were told.</b></p><p>The money did not go to help indebted economies. It flowed through the European Central Bank and recipient states to the coffers of big banks and investment funds.</p></blockquote><p>The text that the Journal removed is marked in bold.  Read the whole thing at the Market Ticker.  And a thought occurs to me.  Since the election of Mr. Soetoro has demonstrated that absolutely no documentation is required of an American presidential candidate, why not nominate Mr. Soini for the presidency?  He’s a damn sight better than anyone else the Republicans are likely to choose, he isn’t too old, and as the leader of a popular, electorally successful party, he can’t possibly be called unelectable.</p><p>Anyhow, it’s a good example of how the Whore Street Journal should not be trusted any more than the New York Times or the National Enquirer.</p></div>",
  "content_text": "Karl Denninger catches the WSJ doing\na little ex post facto editing\nof the letter written by True Finn leader Timo Soini on the corrupt nature of the European banking bailouts:\nWhy I Won’t Support More Bailouts\nWhen I had the honor of leading the True Finn Party to electoral victory in April, we made a solemn promise to oppose the so-called bailouts of euro-zone member states.\nThese bailouts are patently bad for Europe, bad for Finland and bad for the countries that have been forced to accept them.\nEurope is suffering from the economic gangrene of insolvency—both public and private. And unless we amputate that which cannot be saved, we risk poisoning the whole body.\nThe official wisdom is that Greece, Ireland and Portugal have been hit by a liquidity crisis, so they needed a momentary infusion of capital, after which everything would return to normal. But this official version is a lie, one that takes the ordinary people of Europe for idiots. They deserve better from politics and their leaders.\nTo understand the real nature and purpose of the bailouts, we first have to understand who really benefits from them.\nLet’s follow the money.\nAt the risk of being accused of populism, we’ll begin with the obvious: It is not the little guy that benefits. He is being milked and lied to in order to keep the insolvent system running. He is paid less and taxed more to provide the money needed to keep this Ponzi scheme going. Meanwhile,\na kind of deadly\nsymbiosis has developed between politicians and banks: Our political leaders borrow ever more money to pay off the banks, which return the favor by lending ever-more money back to our governments,\nkeeping the scheme afloat\n.\nIn a true market economy, bad choices get penalized.\nNot here. When the inevitable failure of overindebted euro-zone countries came to light, a secret pact was made.\nInstead of accepting losses on unsound investments—which would have led to the probable collapse\nand national bailout\nof some banks—it was decided to transfer the losses to taxpayers via loans, guarantees and opaque constructs such as the European Financial Stability Fund,\nIreland’s NAMA and a lineup of special-purpose vehicles that make Enron look simple. Some politicians understood this; others just panicked and did as they were told.\nThe money did not go to help indebted economies. It flowed through the European Central Bank and recipient states to the coffers of big banks and investment funds.\nThe text that the Journal removed is marked in bold.  Read the whole thing at the Market Ticker.  And a thought occurs to me.  Since the election of Mr. Soetoro has demonstrated that absolutely no documentation is required of an American presidential candidate, why not nominate Mr. Soini for the presidency?  He’s a damn sight better than anyone else the Republicans are likely to choose, he isn’t too old, and as the leader of a popular, electorally successful party, he can’t possibly be called unelectable.\nAnyhow, it’s a good example of how the Whore Street Journal should not be trusted any more than the New York Times or the National Enquirer.",
  "tags": [
    "banks",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-05-11T12:00:00+00:00"
}