{
  "url": "https://voxday.net/2017/09/19/a-taste-of-the-bass/",
  "scraped_at": "2025-12-19T10:24:29.228254",
  "title": "A taste of the bass",
  "date_display": "September 19, 2017",
  "date_iso": "2017-09-19T13:01:00+00:00",
  "date_from_url": "2017-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/Sv7bO0e8iaQ\" width=\"512\"></iframe></div><p>While we’re in the process of acquiring the required equipment, the Voxiversity team has been experimenting with some of the different concepts we are planning to apply to the videos we will be producing. Here is a brief sample of one such experiment, entitled <a href=\"https://youtu.be/Sv7bO0e8iaQ\">Know Thyself</a>, which utilizes the audio from my debate with Greg Johnson.</p><p>We will obviously be utilizing higher quality audio than the mic of my gaming headset, and I think we will also bring in some new fonts, preferably some of those regularly used by Castalia House on its covers for some cross-media unity of style. But this should give you some idea of the sort of thing we’ll be doing to bring the concepts to life and make them memorable beyond my simple articulation of them.</p><p>If you’d like to assist these efforts and support Voxiversity, you can do so <a href=\"https://freestartr.com/project/voxiversity/\">at Freestartr</a>.</p><p>And I would be remiss if I failed to note that, somewhat to my surprise, the backers have overwhelmingly selected <i>Immigration &amp; War</i> as the first Voxiversity video.</p></div>",
  "content_text": "While we’re in the process of acquiring the required equipment, the Voxiversity team has been experimenting with some of the different concepts we are planning to apply to the videos we will be producing. Here is a brief sample of one such experiment, entitled\nKnow Thyself\n, which utilizes the audio from my debate with Greg Johnson.\nWe will obviously be utilizing higher quality audio than the mic of my gaming headset, and I think we will also bring in some new fonts, preferably some of those regularly used by Castalia House on its covers for some cross-media unity of style. But this should give you some idea of the sort of thing we’ll be doing to bring the concepts to life and make them memorable beyond my simple articulation of them.\nIf you’d like to assist these efforts and support Voxiversity, you can do so\nat Freestartr\n.\nAnd I would be remiss if I failed to note that, somewhat to my surprise, the backers have overwhelmingly selected\nImmigration & War\nas the first Voxiversity video.",
  "tags": [
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-19T12:01:00+00:00"
}