{
  "url": "https://voxday.net/2017/09/12/announcing-voxiversity/",
  "scraped_at": "2025-12-19T10:23:33.384558",
  "title": "Announcing VOXIVERSITY",
  "date_display": "September 12, 2017",
  "date_iso": "2017-09-12T19:31:00+00:00",
  "date_from_url": "2017-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/C2QqOpJum2o\" width=\"512\"></iframe></div><p>To support Voxiversity, please visit <a href=\"http://freestartr.com/project/voxiversity/\">the Voxiversity project</a> at the new crowdfunding site, Freestartr, which combines the functionality of Kickstarter, Patreon, and Indiegogo, but without the SJW thought-policing. There are six levels of support, each of which comes with different rewards.</p><ul><li>Subscriber</li><li>Supporter</li><li>Advocate</li><li>Champion</li><li>Brainstorm</li><li>Foundation</li></ul><p>Voxiversity is a series of educational video lectures by bestselling political philosopher Vox Day.</p><p>Castalia House reaches tens of thousands of people through the medium of books. The ideas first presented in books such as <i>SJWs Always Lie</i>, <i>4th Generation Warfare Handbook</i>, and <i>The Irrational Atheist</i> have penetrated even those institutions most converged by social justice, such as academia and the media.. But Castalia’s reach is limited to an audience of people who enjoy reading books.</p><p>Video offers the ability to reach millions of people in a very short period of time. But the distribution of video is entirely different than book-selling, as most people who watch videos expect to do so for free. Video production is also more expensive, and the combination of those two factors is why it is necessary to crowdfund the production of videos containing the same kind of viral information that one so often encounters in Castalia’s non-fiction books.</p><p>The videos will be 20-minutes long, and subjects that require more detailed analysis will be addressed by multi-video series. The videos will also be released as podcasts for those who prefer audio to video.</p><p>Voxiversity will change the way people think.</p><p>UPDATE: Thanks very much for the staunch support. Our objective is to exceed expectations. In the meantime, I think this was the most amusing reaction.</p><p><i>I suspect that your success will be proportional to your ability to restrain yourself from telling people how much more intelligent you are then them when you fail to explain something clearly. Having said that…I wish you the best of luck ? </i></p></div>",
  "content_text": "To support Voxiversity, please visit\nthe Voxiversity project\nat the new crowdfunding site, Freestartr, which combines the functionality of Kickstarter, Patreon, and Indiegogo, but without the SJW thought-policing. There are six levels of support, each of which comes with different rewards.\nSubscriber\nSupporter\nAdvocate\nChampion\nBrainstorm\nFoundation\nVoxiversity is a series of educational video lectures by bestselling political philosopher Vox Day.\nCastalia House reaches tens of thousands of people through the medium of books. The ideas first presented in books such as\nSJWs Always Lie\n,\n4th Generation Warfare Handbook\n, and\nThe Irrational Atheist\nhave penetrated even those institutions most converged by social justice, such as academia and the media.. But Castalia’s reach is limited to an audience of people who enjoy reading books.\nVideo offers the ability to reach millions of people in a very short period of time. But the distribution of video is entirely different than book-selling, as most people who watch videos expect to do so for free. Video production is also more expensive, and the combination of those two factors is why it is necessary to crowdfund the production of videos containing the same kind of viral information that one so often encounters in Castalia’s non-fiction books.\nThe videos will be 20-minutes long, and subjects that require more detailed analysis will be addressed by multi-video series. The videos will also be released as podcasts for those who prefer audio to video.\nVoxiversity will change the way people think.\nUPDATE: Thanks very much for the staunch support. Our objective is to exceed expectations. In the meantime, I think this was the most amusing reaction.\nI suspect that your success will be proportional to your ability to restrain yourself from telling people how much more intelligent you are then them when you fail to explain something clearly. Having said that…I wish you the best of luck ?",
  "tags": [
    "#AltTech",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-12T18:31:00+00:00"
}