{
  "url": "https://voxday.net/2017/09/04/another-case-against-free-trade/",
  "scraped_at": "2025-12-19T10:22:31.335396",
  "title": "Another case against free trade",
  "date_display": "September 4, 2017",
  "date_iso": "2017-09-04T11:00:00+00:00",
  "date_from_url": "2017-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Keen, arguably the most important economist alive today, turns his formidable guns <a href=\"https://americanaffairsjournal.org/2017/08/ricardos-vice-virtues-industrial-diversity/\">on David Ricardo, specialization, and free trade</a>.</p><blockquote><p>David Ricardo extended Smith’s vision of specialization within a given industry to specialization between industries and nations, and made the argument that two countries can benefit from free trade even if one country is absolutely less competitive in both industries than the other. In his hypothetical example, Portugal could produce both cloth and wine with less labor than England. If England specialized at the industry it was comparatively better at (cloth, obviously) and Portugal specialized in wine, then the total output of both industries would rise.</p><p>This concept of the advantages of specialization became the core insight of economics, and it continues to be ingrained in and promoted by economists today. Lionel Robbins’s proposition that “Economics is the science which studies human behaviour as a relationship between ends and scarce means which have alternative uses”3 is the dominant definition of economics. It implicitly emphasizes the importance of specialization, so that those “scarce means which have alternative uses” can be efficiently allocated to achieve the maximum level of output.</p><p>This belief in the advantages of specialization lies behind the incredulity with which economists have reacted to the rise of populist politicians like Donald Trump in the United States, as well as the United Kingdom’s vote for Brexit. They have, at their most self-righteous, blamed the rise of anti-globalization sentiment on the public’s irrational failure to appreciate the net benefits of trade. Or, more commonly, they have conceded that perhaps the electorate has reacted negatively because the gains from trade have not been shared fairly.</p><p>There is, however, another explanation for why anti–free trade sentiment has risen: the gains from specialization at the national level were not there to share in the first place, for sound empirical reasons that were ignored in Ricardo’s example. That ignorance has been ingrained in economics since then, as Robbins’s definition—dominant and superficially persuasive, but fundamentally limited—gave economists a starting point from which they could not properly perceive either the advantages or the costs of globalization.</p><p><b>Deus Sine Machina</b></p><p>Robbins’s definition codifies arguably the most egregious oversight in economic theory. It omits a realistic treatment of resources that do not “have alternative uses,” by which the great wealth of modern society has been created: machines. Today, with 3-D printers, increasingly adaptable robotics, and the beginnings of AI, we can contemplate the eventual creation of a single machine that could be deployed across a range of industries. Yet for the foreseeable future, most machines are tailored for specific tasks in specific industries and are useless in any others, as was also the case in the distant past when the theory of comparative advantage was invented. Smith acknowledged the need for specialized machinery in pin production (and attributed the development of that specialized machinery to the division of labor itself, though it can just as easily be argued that the specialization of machinery is what gave rise to the specialization of labor):</p><p><i>A workman not educated to this business (which the division of labour has rendered a distinct trade), nor acquainted with the use of the machinery employed in it (to the invention of which the same division of labour has probably given occasion), could scarce, perhaps, with his utmost industry, make one pin in a day, and certainly could not make twenty.</i></p><p>Ricardo also acknowledged the need for machinery. But in considering not one industry but two, Ricardo assumed <i>a crucial and false</i> equivalence between physical machinery and monetary capital that has bedeviled economics ever since: he treated the specialized machinery in different industries as if it were equally as liquid (and so could be as easily repurposed) as the money with which it had been purchased.</p><p>The gain from trade arose, Ricardo asserted, because of different production technologies in different countries (whether that was due to different labor skills, different weather, or different machinery). These differences could not apply within one country, but did apply between them, so that “the produce of the labour of 100 Englishmen may be given for the produce of the labour of 80 Portuguese, 60 Russians, or 120 East Indians.” The reason for this difference between domestic and international trade was, he claimed, because capital moved easily within a country, whereas it was effectively immobile between them.</p><p>This is a confusion of monetary capital (which Ricardo, as a stockbroker by trade, knew intimately) with the physical machinery in factories (about which he knew very little). Yes, monetary capital moves easily in search of a profit—today, even internationally. But machinery is specific to each industry, and the crucial machines in one industry cannot simply “move” to another without loss of productivity.</p><p>The archetypal machines for cloth and wine manufacturing in Ricardo’s time included the spinning jenny and the wine press. It is stating the obvious that one cannot be turned into the other, but stating the obvious is necessary, because the easy conversion of one into the other was assumed by Ricardo, and has been assumed ever since by mainstream economic theory.</p><p>In fact, the relative mobility which Ricardo assumed for his ubiquitous concept of “capital” is the opposite of what applies to machinery. Machinery designed for one industry simply cannot move to any other, even in the same country; but machinery in one industry can (and frequently is) shipped between countries.</p></blockquote><p>This is a conceptually devastating critique of comparative advantage, which, in combination with my labor mobility argument, should suffice to convince even the most enthusiastic free trader that free trade is intrinsically and inherently disadvantageous in certain specific circumstances, many of which happen to be applicable to the USA today.</p><p>Free trade is not always and inherently inimical. The important point is that, contra Ricardo and his mindless adherents, it is not always and inherently beneficial either.</p></div>",
  "content_text": "Steve Keen, arguably the most important economist alive today, turns his formidable guns\non David Ricardo, specialization, and free trade\n.\nDavid Ricardo extended Smith’s vision of specialization within a given industry to specialization between industries and nations, and made the argument that two countries can benefit from free trade even if one country is absolutely less competitive in both industries than the other. In his hypothetical example, Portugal could produce both cloth and wine with less labor than England. If England specialized at the industry it was comparatively better at (cloth, obviously) and Portugal specialized in wine, then the total output of both industries would rise.\nThis concept of the advantages of specialization became the core insight of economics, and it continues to be ingrained in and promoted by economists today. Lionel Robbins’s proposition that “Economics is the science which studies human behaviour as a relationship between ends and scarce means which have alternative uses”3 is the dominant definition of economics. It implicitly emphasizes the importance of specialization, so that those “scarce means which have alternative uses” can be efficiently allocated to achieve the maximum level of output.\nThis belief in the advantages of specialization lies behind the incredulity with which economists have reacted to the rise of populist politicians like Donald Trump in the United States, as well as the United Kingdom’s vote for Brexit. They have, at their most self-righteous, blamed the rise of anti-globalization sentiment on the public’s irrational failure to appreciate the net benefits of trade. Or, more commonly, they have conceded that perhaps the electorate has reacted negatively because the gains from trade have not been shared fairly.\nThere is, however, another explanation for why anti–free trade sentiment has risen: the gains from specialization at the national level were not there to share in the first place, for sound empirical reasons that were ignored in Ricardo’s example. That ignorance has been ingrained in economics since then, as Robbins’s definition—dominant and superficially persuasive, but fundamentally limited—gave economists a starting point from which they could not properly perceive either the advantages or the costs of globalization.\nDeus Sine Machina\nRobbins’s definition codifies arguably the most egregious oversight in economic theory. It omits a realistic treatment of resources that do not “have alternative uses,” by which the great wealth of modern society has been created: machines. Today, with 3-D printers, increasingly adaptable robotics, and the beginnings of AI, we can contemplate the eventual creation of a single machine that could be deployed across a range of industries. Yet for the foreseeable future, most machines are tailored for specific tasks in specific industries and are useless in any others, as was also the case in the distant past when the theory of comparative advantage was invented. Smith acknowledged the need for specialized machinery in pin production (and attributed the development of that specialized machinery to the division of labor itself, though it can just as easily be argued that the specialization of machinery is what gave rise to the specialization of labor):\nA workman not educated to this business (which the division of labour has rendered a distinct trade), nor acquainted with the use of the machinery employed in it (to the invention of which the same division of labour has probably given occasion), could scarce, perhaps, with his utmost industry, make one pin in a day, and certainly could not make twenty.\nRicardo also acknowledged the need for machinery. But in considering not one industry but two, Ricardo assumed\na crucial and false\nequivalence between physical machinery and monetary capital that has bedeviled economics ever since: he treated the specialized machinery in different industries as if it were equally as liquid (and so could be as easily repurposed) as the money with which it had been purchased.\nThe gain from trade arose, Ricardo asserted, because of different production technologies in different countries (whether that was due to different labor skills, different weather, or different machinery). These differences could not apply within one country, but did apply between them, so that “the produce of the labour of 100 Englishmen may be given for the produce of the labour of 80 Portuguese, 60 Russians, or 120 East Indians.” The reason for this difference between domestic and international trade was, he claimed, because capital moved easily within a country, whereas it was effectively immobile between them.\nThis is a confusion of monetary capital (which Ricardo, as a stockbroker by trade, knew intimately) with the physical machinery in factories (about which he knew very little). Yes, monetary capital moves easily in search of a profit—today, even internationally. But machinery is specific to each industry, and the crucial machines in one industry cannot simply “move” to another without loss of productivity.\nThe archetypal machines for cloth and wine manufacturing in Ricardo’s time included the spinning jenny and the wine press. It is stating the obvious that one cannot be turned into the other, but stating the obvious is necessary, because the easy conversion of one into the other was assumed by Ricardo, and has been assumed ever since by mainstream economic theory.\nIn fact, the relative mobility which Ricardo assumed for his ubiquitous concept of “capital” is the opposite of what applies to machinery. Machinery designed for one industry simply cannot move to any other, even in the same country; but machinery in one industry can (and frequently is) shipped between countries.\nThis is a conceptually devastating critique of comparative advantage, which, in combination with my labor mobility argument, should suffice to convince even the most enthusiastic free trader that free trade is intrinsically and inherently disadvantageous in certain specific circumstances, many of which happen to be applicable to the USA today.\nFree trade is not always and inherently inimical. The important point is that, contra Ricardo and his mindless adherents, it is not always and inherently beneficial either.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-04T10:00:00+00:00"
}