{
  "url": "https://voxday.net/2017/09/17/excerpt-daughter-of-danger/",
  "scraped_at": "2025-12-19T10:24:15.789312",
  "title": "EXCERPT: Daughter of Danger",
  "date_display": "September 17, 2017",
  "date_iso": "2017-09-17T21:18:00+00:00",
  "date_from_url": "2017-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is from <b><i><a href=\"http://amzn.to/2kEICTN\">Daughter of Danger: The Dark Avenger’s Sidekick, Book One</a></i></b>. It is the fourth in John C. Wright’s wonderful <i>Moth &amp; Cobweb</i> dodecology.<br><b><br/></b><b>The Three Intruders</b></br></p><p>A strange, painful sensation of hope came across her then. It was like a sick, hot feeling boiling in the pit of her stomach. Maybe nothing was wrong. Maybe those who sought her life were not nigh. What if this were merely the night nurse, walking softly so as not to wake a sick patient?</p><p>She lowered her eye to the gap between the curtain hem and the floor. Her cheek touched the floor tile, and she realized it was linoleum. It was good for footing: resilient, and splinter free. And if she were horribly wounded, there would be no delay to getting her to a hospital, would there be?</p><p>That stray thought produced a second: where was the hospital staff? Who had brought her here? Why hadn’t he stayed to look after her?</p><p>The sight of the figure bent over the bed drove all other thoughts away. He wore a red cap with a white owl’s feather atop his shaggy head, and a long green coat over his broad back, but beneath the lower hem of the green coat were not sterile and comfy shoes favored by doctors. He wore knickerbockers buckled at the knee and was barefoot.</p><p>His seemed to have a skin condition: his feet were covered with clumps of hair, and strands were even growing up between his toes. His feet were too long and thin. She wondered if a bone disease in his feet had disfigured them. His toenails were an inch long, half an inch thick, and yellow as horn.</p><p>Not a nurse. Not a normal person with healthy feet.</p><p>He lowered his head toward the empty bed. She heard a soft noise. A snort. A snuffle.</p><p>He was sniffing. The stranger with the bad feet was sniffing her bedsheets!</p><p>She was waiting for him to be far enough into the room that she might have a chance to slip out behind him and race out the door.</p><p>That hope was quashed when she heard the rustle of two other people entering the room. She heard the creak of the door being eased shut, and heard a slither of steel and then the click of a padlock shutting.</p><p>She was locked in the room with three of them.</p><p><a name=\"more\"></a><br><b> Laignech Faelad</b></br></p><p>Her mind went blank. There was no other exit, no escape.</p><p>The first man was still sniffing the bed. He spoke without turning his head. “The ring was here, but the scent is confounded! Phaugh! My nose be filled with starch and stink, ammonia and disinfectant!”</p><p>A second man stepped into her view. He was bald, stocky, and dark skinned, wearing a green leather motorcycle jacket and steel-toed workboots. In his hands he carried a chain. He held it with his hands apart so that the chain was taut and the links would not rattle. He also wore a red cap. “The moon is near the earth. Let us take up our true forms.”</p><p>The second man shrugged out of his jacket, tossed the chain on the bed, and began undoing his belt and trousers.</p><p>The third was not a man. He stood on two legs and had arms and hands like a man, but his head was the head of a goat. His knees bent backward, and his hoof was split. He was over seven feet tall, thick of chest and broad of shoulder to match. Except for his own natural pelt of brown and black, he was naked. A barnyard smell came from the monster. Between his ram horns was perched a red peaked cap with a white owl’s feather. In his hands was a long trident, whose tines scraped against the ceiling tiles.</p><p>The monster spoke in a strangled voice, like a man sounds when he speaks while breathing in. “Here as yet, I wager, missy? Here as yet?”</p><p>The monster clip-clopped to the closet and yanked open the door, brandishing his trident as he did so.<br>“We are come to crack your bones and lap the marrow!”</br></p><p>Inside were a small toilet and sink. The goat-man’s ears drooped.</p><p>The butt of his weapon brushed against the wheeled bed stand and knocked it over. The remote control for the TV bounced on the floor and came to rest a foot or so from her hand.</p><p>The second man had his trousers about his knees and was scowling and unlacing his boots. His face turned darker and began to elongate, and hair sprouted from his bald head as well as from his cheeks, jaw, neck, naked back, and shoulders. His ears were getting larger and standing out from his skull, like the ears of a dog.</p><p>The first man, the barefoot one, was beginning to turn his head as he looked to the other corners of the room. He was about to turn his head far enough to see her. She pushed the red button on the remote.</p><p>The noise of the television overhead, and the light from the screen, were startling in the quiet gloom. All three flinched and looked up. The barefoot man stepped backward and thus was half a step closer to her.</p><p>It was close enough. Instinct moved her limbs. Before she was aware of what she was doing, she had vaulted toward the barefoot man, selecting him as the most immediate target.</p><p>She heard the echo of a voice in her memory:<i> In fighting a man, a girl is less in strength, reach, speed, and spirit. Your bones are more easily broken. Your heart more easily frightened. This does not mean victory is his! Use his strength against him. Use his speed against him. Use his skill against him.</i></p><p>The first man turned and rushed at her. She saw that he was an amateur fighter, one who tries to punch or tackle before judging his distance properly. She stepped closer, inside his swing, bobbing her head. His fist flew past her ear.</p><p>She snap-kicked, using her shin rather than her foot to land the blow. His legs guided the blow to his groin, and his strong forward momentum gave it force. Had he been a weaker man, moving less quickly, he would not have injured himself. But he was very strong.</p><p>On the backstroke on her same kick, she drove her instep down his shin and brought the heel of her bare foot onto his strangely narrow foot hard enough that she heard a cracking noise.</p><p>The echo said: <i>If a man cannot walk, he cannot fight.</i></p><p>He doubled over in pain. He tried to grab her, but missed.</p><p>While he was doubled over, she gripped her own wrist and twisted her upper body to drive the corner of her elbow into his temple. He stumbled and fell.</p><p>The second man, the one who had been bald but was now halfway transformed into a wolf-creature, swung at her with a limb that was neither a man’s arm nor a forepaw. But because the limb was still in the midst of changing length, it neither struck nor clawed her.</p><p>She grabbed the hairy wrist with one hand and drove her palm into the elbow joint. It is usually an easy joint to damage, but the man simply grunted in pain and swung at her with his other hand. With his trousers binding his knees, he was off balance. But he still had quick reflexes and he was blindingly fast.</p><p>She deflected his blow with both her forearms and let the force of his blow pull her inside his reach. His reflexes had betrayed him: now she was inside his guard.</p><p>She straightened both of her arms and struck at his face, one hand to either side of his nose. The index finger was extended, and the other three fingers were bent underneath in support, lest her index finger break from the blow. The curves of the face naturally guide the blow into the eye sockets.</p><p>The echo said: <i>If a man cannot see, he cannot fight.</i></p><p>When he instinctively drew his hand back to his face to protect it, she drove her knee into his floating rib where his arms were no longer in place to block.</p><p>He doubled over. She did an acrobatic flip across his back and landed on the bed, picking up the chain as she did so. A second somersault carried her to the strip of floor between the foot of the bed and the bathroom door.</p><p>She was close enough to the goat-man now to strike at his long nose with the chain. He tried to parry with the haft of his trident, but the chain wrapped around it and struck him on the soft snout. Breaking a man’s nose in a fight prevents him from drawing air. She hoped this held true for goats as well.</p><p>The echo said: <i>If a man cannot breathe, he cannot fight.</i><br><i><br/></i>Before she could follow up, the goat-man struck at her with the butt of his weapon, and, moving unexpectedly fast for someone his size, he vaulted backward until his rear hoof touched the door. She blocked the blow with her knee, but his strength was such that even the partial blow had force enough to fling her, stumbling, across the room. She tripped, did a back handspring, and regained her footing but she had lost the chain, her only weapon.</br></p><p><b>Goborchend</b></p><p>Her gaze was on the goat-man’s monstrous form crouching by the door. She now saw how they had locked the door with no lock. One of them had inserted a metal strip between the door and the jamb, and padlocked a sliding clamp in place. She did not like the fact that they had evidently prepared this attack.</p><p>The goat-man said, “You hurt my hounds! But you will find a Goborchend is not overcome so readily as the Laignech Faelad!”</p><p>She was trembling with fear and rage. The other two men were now both on the ground, in convulsions. She dared not take her eyes from the goat-man, but in the corner of her eye she saw—or thought she saw—hair turning to fur and spreading over their flesh, faces stretching, writhing and changing shape, and limbs shriveling from human hands and feet into wolf paws. Both were howling, but whether this was from the pain of their wounds or the rage of their transformation, she did not know.</p><p>She backed up. There was a lightweight chair next to her, and she felt the Venetian blinds brush her backside.</p><p>She picked up the chair in her hands and turned sideways, crouching.</p><p>Blindingly quick, the goat-man lunged with his three-headed spear. She parried with the chair legs, deflecting the tines high. The tines became tangled with the blinds, and he pulled the whole curtain rod off the wall when he recovered from the lunge. The three windows stood in one frame. They were old-fashioned, from the days before the invention of air conditioning, nothing more than glass panes held in wooden sashes.</p><p>She was sweating freely now. He was taller and stronger, she was backed into a corner. There was no retreat. He was tall enough, and his trident long enough, that he could strike her anywhere in the room.</p><p>The two others rolling on the floor now grew less agitated. The bed blocked her view of them.</p><p>The goat-man shifted his weight and struck again.</p><p>His forward hand, which was constantly in motion, weaving and bobbing, guided the trident, and his rear hand, arm and shoulder, gave weight to the blow. With three spear blades instead of one, he could strike three places at once. And with each twitch of his hands, he switched the trident blades from vertical to horizontal and back again.</p><p>This time, she managed to deflect the blow to her left. The tines penetrated the glass and stuck in the wood of the frame. He roared and yanked. The whole window frame came out of the wall and fell into the room in a spray of splinters, nails, and clouds of powdery dust.</p><p>She saw a narrow stone ledge, less than nine inches wide, flush with the lower lip of the sill.</p><p>The only way to overcome a more skilled opponent is by doing the unexpected, something for which his reflexes are not primed to counter.</p><p>The monster took a moment to kick the wooden debris free from the head of his trident. That moment was her only chance. Up she vaulted, and slid out the window, in one smooth and reckless move, nimbly as a gymnast.</p></div>",
  "content_text": "This is from\nDaughter of Danger: The Dark Avenger’s Sidekick, Book One\n. It is the fourth in John C. Wright’s wonderful\nMoth & Cobweb\ndodecology.\nThe Three Intruders\nA strange, painful sensation of hope came across her then. It was like a sick, hot feeling boiling in the pit of her stomach. Maybe nothing was wrong. Maybe those who sought her life were not nigh. What if this were merely the night nurse, walking softly so as not to wake a sick patient?\nShe lowered her eye to the gap between the curtain hem and the floor. Her cheek touched the floor tile, and she realized it was linoleum. It was good for footing: resilient, and splinter free. And if she were horribly wounded, there would be no delay to getting her to a hospital, would there be?\nThat stray thought produced a second: where was the hospital staff? Who had brought her here? Why hadn’t he stayed to look after her?\nThe sight of the figure bent over the bed drove all other thoughts away. He wore a red cap with a white owl’s feather atop his shaggy head, and a long green coat over his broad back, but beneath the lower hem of the green coat were not sterile and comfy shoes favored by doctors. He wore knickerbockers buckled at the knee and was barefoot.\nHis seemed to have a skin condition: his feet were covered with clumps of hair, and strands were even growing up between his toes. His feet were too long and thin. She wondered if a bone disease in his feet had disfigured them. His toenails were an inch long, half an inch thick, and yellow as horn.\nNot a nurse. Not a normal person with healthy feet.\nHe lowered his head toward the empty bed. She heard a soft noise. A snort. A snuffle.\nHe was sniffing. The stranger with the bad feet was sniffing her bedsheets!\nShe was waiting for him to be far enough into the room that she might have a chance to slip out behind him and race out the door.\nThat hope was quashed when she heard the rustle of two other people entering the room. She heard the creak of the door being eased shut, and heard a slither of steel and then the click of a padlock shutting.\nShe was locked in the room with three of them.\nLaignech Faelad\nHer mind went blank. There was no other exit, no escape.\nThe first man was still sniffing the bed. He spoke without turning his head. “The ring was here, but the scent is confounded! Phaugh! My nose be filled with starch and stink, ammonia and disinfectant!”\nA second man stepped into her view. He was bald, stocky, and dark skinned, wearing a green leather motorcycle jacket and steel-toed workboots. In his hands he carried a chain. He held it with his hands apart so that the chain was taut and the links would not rattle. He also wore a red cap. “The moon is near the earth. Let us take up our true forms.”\nThe second man shrugged out of his jacket, tossed the chain on the bed, and began undoing his belt and trousers.\nThe third was not a man. He stood on two legs and had arms and hands like a man, but his head was the head of a goat. His knees bent backward, and his hoof was split. He was over seven feet tall, thick of chest and broad of shoulder to match. Except for his own natural pelt of brown and black, he was naked. A barnyard smell came from the monster. Between his ram horns was perched a red peaked cap with a white owl’s feather. In his hands was a long trident, whose tines scraped against the ceiling tiles.\nThe monster spoke in a strangled voice, like a man sounds when he speaks while breathing in. “Here as yet, I wager, missy? Here as yet?”\nThe monster clip-clopped to the closet and yanked open the door, brandishing his trident as he did so.\n“We are come to crack your bones and lap the marrow!”\nInside were a small toilet and sink. The goat-man’s ears drooped.\nThe butt of his weapon brushed against the wheeled bed stand and knocked it over. The remote control for the TV bounced on the floor and came to rest a foot or so from her hand.\nThe second man had his trousers about his knees and was scowling and unlacing his boots. His face turned darker and began to elongate, and hair sprouted from his bald head as well as from his cheeks, jaw, neck, naked back, and shoulders. His ears were getting larger and standing out from his skull, like the ears of a dog.\nThe first man, the barefoot one, was beginning to turn his head as he looked to the other corners of the room. He was about to turn his head far enough to see her. She pushed the red button on the remote.\nThe noise of the television overhead, and the light from the screen, were startling in the quiet gloom. All three flinched and looked up. The barefoot man stepped backward and thus was half a step closer to her.\nIt was close enough. Instinct moved her limbs. Before she was aware of what she was doing, she had vaulted toward the barefoot man, selecting him as the most immediate target.\nShe heard the echo of a voice in her memory:\nIn fighting a man, a girl is less in strength, reach, speed, and spirit. Your bones are more easily broken. Your heart more easily frightened. This does not mean victory is his! Use his strength against him. Use his speed against him. Use his skill against him.\nThe first man turned and rushed at her. She saw that he was an amateur fighter, one who tries to punch or tackle before judging his distance properly. She stepped closer, inside his swing, bobbing her head. His fist flew past her ear.\nShe snap-kicked, using her shin rather than her foot to land the blow. His legs guided the blow to his groin, and his strong forward momentum gave it force. Had he been a weaker man, moving less quickly, he would not have injured himself. But he was very strong.\nOn the backstroke on her same kick, she drove her instep down his shin and brought the heel of her bare foot onto his strangely narrow foot hard enough that she heard a cracking noise.\nThe echo said:\nIf a man cannot walk, he cannot fight.\nHe doubled over in pain. He tried to grab her, but missed.\nWhile he was doubled over, she gripped her own wrist and twisted her upper body to drive the corner of her elbow into his temple. He stumbled and fell.\nThe second man, the one who had been bald but was now halfway transformed into a wolf-creature, swung at her with a limb that was neither a man’s arm nor a forepaw. But because the limb was still in the midst of changing length, it neither struck nor clawed her.\nShe grabbed the hairy wrist with one hand and drove her palm into the elbow joint. It is usually an easy joint to damage, but the man simply grunted in pain and swung at her with his other hand. With his trousers binding his knees, he was off balance. But he still had quick reflexes and he was blindingly fast.\nShe deflected his blow with both her forearms and let the force of his blow pull her inside his reach. His reflexes had betrayed him: now she was inside his guard.\nShe straightened both of her arms and struck at his face, one hand to either side of his nose. The index finger was extended, and the other three fingers were bent underneath in support, lest her index finger break from the blow. The curves of the face naturally guide the blow into the eye sockets.\nThe echo said:\nIf a man cannot see, he cannot fight.\nWhen he instinctively drew his hand back to his face to protect it, she drove her knee into his floating rib where his arms were no longer in place to block.\nHe doubled over. She did an acrobatic flip across his back and landed on the bed, picking up the chain as she did so. A second somersault carried her to the strip of floor between the foot of the bed and the bathroom door.\nShe was close enough to the goat-man now to strike at his long nose with the chain. He tried to parry with the haft of his trident, but the chain wrapped around it and struck him on the soft snout. Breaking a man’s nose in a fight prevents him from drawing air. She hoped this held true for goats as well.\nThe echo said:\nIf a man cannot breathe, he cannot fight.\nBefore she could follow up, the goat-man struck at her with the butt of his weapon, and, moving unexpectedly fast for someone his size, he vaulted backward until his rear hoof touched the door. She blocked the blow with her knee, but his strength was such that even the partial blow had force enough to fling her, stumbling, across the room. She tripped, did a back handspring, and regained her footing but she had lost the chain, her only weapon.\nGoborchend\nHer gaze was on the goat-man’s monstrous form crouching by the door. She now saw how they had locked the door with no lock. One of them had inserted a metal strip between the door and the jamb, and padlocked a sliding clamp in place. She did not like the fact that they had evidently prepared this attack.\nThe goat-man said, “You hurt my hounds! But you will find a Goborchend is not overcome so readily as the Laignech Faelad!”\nShe was trembling with fear and rage. The other two men were now both on the ground, in convulsions. She dared not take her eyes from the goat-man, but in the corner of her eye she saw—or thought she saw—hair turning to fur and spreading over their flesh, faces stretching, writhing and changing shape, and limbs shriveling from human hands and feet into wolf paws. Both were howling, but whether this was from the pain of their wounds or the rage of their transformation, she did not know.\nShe backed up. There was a lightweight chair next to her, and she felt the Venetian blinds brush her backside.\nShe picked up the chair in her hands and turned sideways, crouching.\nBlindingly quick, the goat-man lunged with his three-headed spear. She parried with the chair legs, deflecting the tines high. The tines became tangled with the blinds, and he pulled the whole curtain rod off the wall when he recovered from the lunge. The three windows stood in one frame. They were old-fashioned, from the days before the invention of air conditioning, nothing more than glass panes held in wooden sashes.\nShe was sweating freely now. He was taller and stronger, she was backed into a corner. There was no retreat. He was tall enough, and his trident long enough, that he could strike her anywhere in the room.\nThe two others rolling on the floor now grew less agitated. The bed blocked her view of them.\nThe goat-man shifted his weight and struck again.\nHis forward hand, which was constantly in motion, weaving and bobbing, guided the trident, and his rear hand, arm and shoulder, gave weight to the blow. With three spear blades instead of one, he could strike three places at once. And with each twitch of his hands, he switched the trident blades from vertical to horizontal and back again.\nThis time, she managed to deflect the blow to her left. The tines penetrated the glass and stuck in the wood of the frame. He roared and yanked. The whole window frame came out of the wall and fell into the room in a spray of splinters, nails, and clouds of powdery dust.\nShe saw a narrow stone ledge, less than nine inches wide, flush with the lower lip of the sill.\nThe only way to overcome a more skilled opponent is by doing the unexpected, something for which his reflexes are not primed to counter.\nThe monster took a moment to kick the wooden debris free from the head of his trident. That moment was her only chance. Up she vaulted, and slid out the window, in one smooth and reckless move, nimbly as a gymnast.",
  "tags": [
    "books",
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-17T20:18:00+00:00"
}