{
  "url": "https://voxday.net/2017/09/18/gab-kicked-off-registrar/",
  "scraped_at": "2025-12-19T10:24:17.344294",
  "title": "Gab kicked off registrar",
  "date_display": "September 18, 2017",
  "date_iso": "2017-09-18T08:46:00+00:00",
  "date_from_url": "2017-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gab‏Verified@getongab<br><i>BREAKING: Gab’s domain registrar has given us 5 days to transfer our domain or they will seize it. The free and open web is in danger.</i></br></p><p>The free and open web is not in danger. Literally NOTHING has changed except that Gab has received a legal wakeup call from reality. It’s more than a little remarkable that they didn’t anticipate this. Remember, I warned Andrew Torba that they ABSOLUTELY HAD to moderate their content, and I did so back in November, long before anyone had “said mean words” or “hurt my feelings” there. I did so again on September 7th, both when I emailed Utsav after our conversation and in my conversation with him.</p><p>What I believe inevitably doomed Gab with Asia Registry was not merely the complaints that were being made to the registry in lieu of Gab providing its users with any other option besides the recommended court order, but Gab’s public stance on its refusal to moderate defamation as laid out in its Google filing. There are three sections that are relevant in this regard:</p><blockquote><p>81. Even if it were possible for a social media platform to censor “defamatory and mean-spirited content” generated by 250,000 users, a level of content censorship that extended to “defamatory” and “mean-spirited” content would place at risk that service’s status as a protected Internet Service Provider, as opposed to a publisher or speaker, under 47 U.S. Code 230, also known as Section 230 of the Communications Decency Act (“CDA”)</p><p>82. Unlike an Internet Service Provider, a publisher or speaker is not granted the “safe harbor” benefits of Section 230, and may be held liable for defamation or other torts or other liability arising from content published on a platform it owns or manages.</p><p>251. Compliance with Google’s demand that moderate content posted by its users on a viewpoint-discrimination basis would place at risk Gab’s critical “safe harbor” protection against claims arising from such content under Section 230 of the Communications Decency Act by turning Gab into an unprotected editor or publisher, whereas it is presently protected as an Internet Service Provider.</p></blockquote><p>This is bad lawyering for four reasons.</p><ol><li>Some forms of defamation are criminal in Australia. Gab openly stated, in a public filing, that it cannot, and will not, remain in compliance with Australian law. </li><li>Gab is not an Internet Service Provider. An Internet Service Provider, or ISP, is the company you pay a fee to access to the internet, not an internet site that lets you comment on it.</li><li>Section 230 of the CDA doesn’t only protect ISPs, but also protects both the users and the providers of interactive computer service and says neither “shall be treated as the publisher or speaker of any information provided by another information content provider.”</li><li>As a Texas entity – which Gab still is despite its establishment of a second office to be able to file its lawsuit against Google in Philadelphia County – Gab was additionally protected by the Defamation Mitigation Act, or Retraction Statute of 2013, which protects the publisher by giving him the option of correcting the mistake by publishing a retraction or deleting the defamatory content.</li></ol><div>In other words, on the basis of an entirely groundless fear of being sued for what they like to describe as “mean words”, Gab elected to state on the public record that they would not moderate for “defamatory” content, in open violation of the laws of the country in which they selected their registrar.<p>Not ready for prime time doesn’t even begin to describe the level of strategic and legal incompetence demonstrated here.</p><p>This really isn’t that difficult. As I have repeatedly said, as I have repeatedly told Andrew Torba, <i>moderation is a must</i>. It is implicitely required by law, and for those who want access to the Play Store and the App Store, it is explicitly required by Google and Apple. More importantly, if you refuse to offer your users a reasonable form of redress they can easily afford when they are targeted for harassment, don’t pretend to be surprised or upset when they pursue alternate means to achieve their objectives just because those means happen to be more damaging to you.</p><p>I am the only one who pursued the course of action recommended by Gab. Considering the expense and the additional harassment that entailed, is it really surprising that everyone else opted for the free and anonymous course of action? In any event, Gab will find another registrar. I hope they will also find the common sense required to install some reasonable moderation policies, or they’re just going to find themselves right back in the same position in a matter of weeks.</p></div></div>",
  "content_text": "Gab‏Verified@getongab\nBREAKING: Gab’s domain registrar has given us 5 days to transfer our domain or they will seize it. The free and open web is in danger.\nThe free and open web is not in danger. Literally NOTHING has changed except that Gab has received a legal wakeup call from reality. It’s more than a little remarkable that they didn’t anticipate this. Remember, I warned Andrew Torba that they ABSOLUTELY HAD to moderate their content, and I did so back in November, long before anyone had “said mean words” or “hurt my feelings” there. I did so again on September 7th, both when I emailed Utsav after our conversation and in my conversation with him.\nWhat I believe inevitably doomed Gab with Asia Registry was not merely the complaints that were being made to the registry in lieu of Gab providing its users with any other option besides the recommended court order, but Gab’s public stance on its refusal to moderate defamation as laid out in its Google filing. There are three sections that are relevant in this regard:\n81. Even if it were possible for a social media platform to censor “defamatory and mean-spirited content” generated by 250,000 users, a level of content censorship that extended to “defamatory” and “mean-spirited” content would place at risk that service’s status as a protected Internet Service Provider, as opposed to a publisher or speaker, under 47 U.S. Code 230, also known as Section 230 of the Communications Decency Act (“CDA”)\n82. Unlike an Internet Service Provider, a publisher or speaker is not granted the “safe harbor” benefits of Section 230, and may be held liable for defamation or other torts or other liability arising from content published on a platform it owns or manages.\n251. Compliance with Google’s demand that moderate content posted by its users on a viewpoint-discrimination basis would place at risk Gab’s critical “safe harbor” protection against claims arising from such content under Section 230 of the Communications Decency Act by turning Gab into an unprotected editor or publisher, whereas it is presently protected as an Internet Service Provider.\nThis is bad lawyering for four reasons.\nSome forms of defamation are criminal in Australia. Gab openly stated, in a public filing, that it cannot, and will not, remain in compliance with Australian law.\nGab is not an Internet Service Provider. An Internet Service Provider, or ISP, is the company you pay a fee to access to the internet, not an internet site that lets you comment on it.\nSection 230 of the CDA doesn’t only protect ISPs, but also protects both the users and the providers of interactive computer service and says neither “shall be treated as the publisher or speaker of any information provided by another information content provider.”\nAs a Texas entity – which Gab still is despite its establishment of a second office to be able to file its lawsuit against Google in Philadelphia County – Gab was additionally protected by the Defamation Mitigation Act, or Retraction Statute of 2013, which protects the publisher by giving him the option of correcting the mistake by publishing a retraction or deleting the defamatory content.\nIn other words, on the basis of an entirely groundless fear of being sued for what they like to describe as “mean words”, Gab elected to state on the public record that they would not moderate for “defamatory” content, in open violation of the laws of the country in which they selected their registrar.\nNot ready for prime time doesn’t even begin to describe the level of strategic and legal incompetence demonstrated here.\nThis really isn’t that difficult. As I have repeatedly said, as I have repeatedly told Andrew Torba,\nmoderation is a must\n. It is implicitely required by law, and for those who want access to the Play Store and the App Store, it is explicitly required by Google and Apple. More importantly, if you refuse to offer your users a reasonable form of redress they can easily afford when they are targeted for harassment, don’t pretend to be surprised or upset when they pursue alternate means to achieve their objectives just because those means happen to be more damaging to you.\nI am the only one who pursued the course of action recommended by Gab. Considering the expense and the additional harassment that entailed, is it really surprising that everyone else opted for the free and anonymous course of action? In any event, Gab will find another registrar. I hope they will also find the common sense required to install some reasonable moderation policies, or they’re just going to find themselves right back in the same position in a matter of weeks.",
  "tags": [
    "#AltTech",
    "law",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-18T07:46:00+00:00"
}