{
  "url": "https://voxday.net/2017/09/28/i-think-theyre-done-laughing/",
  "scraped_at": "2025-12-19T10:25:38.613450",
  "title": "I think they’re done laughing",
  "date_display": "September 28, 2017",
  "date_iso": "2017-09-28T17:00:00+00:00",
  "date_from_url": "2017-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJW Trigger Sequence:</p><ol><li>LOL! LMAO! LMFAO! HAHAHAHAHA! So very ha!</li><li>Me no care. Give zero fucks.</li><li>ANGER! FURY! HATE HATE HATE! RAGE!</li></ol><p>GAYLIEN‏ @GuyWithOpinion1<br>You know, I usually just laugh at you, but honestly fuck off and die. You don’t get to shit on Jack fucking Kirby’s grave, you Nazi fuck.</br></p><p>Supreme Dark Lord‏ @voxday<br>Sure I do. He was a midget, a bullshitter, and he couldn’t draw hands or ears. I see we’ve gone from Stage One to Stage Three.</br></p><p>Drew Habits‏ @DrewHabits<br>If Jack Kirby were alive today, he’d probably kick your ass with his 100-year-old muscles while you pooped your Dukes of Hazzard underoos</br></p><p>Supreme Dark Lord‏ @voxday<br>Jack Kirby was a midget and a bullshitter. He wasn’t kicking anyone’s ass, except maybe a little girl’s.</br></p><p>Ten‏ @tenryuuwu<br>if kirby were alive today he’d steal your lunch money and give you a swirly</br></p><p>Supreme Dark Lord‏ @voxday<br>That’s antisemitic. Jews are not all thieves. And Kirby wasn’t big enough to pick me up, let alone give me a swirly.</br></p><p>Whatever happened to all the laughing? Well, they’re clearly not triggered or anything.</p><p>By the way, I performed a little science at the gym today, testing out hypotheses. It turns out I could curl the little midget four times cleanly, six if I cheated. Figure eight at peak.</p><p>UPDATE: Now MovieBob <a href=\"https://kiwifarms.net/threads/bob-moviebob-chipman.5873/page-723#post-2638997\">is weighing in</a>.</p></div>",
  "content_text": "The SJW Trigger Sequence:\nLOL! LMAO! LMFAO! HAHAHAHAHA! So very ha!\nMe no care. Give zero fucks.\nANGER! FURY! HATE HATE HATE! RAGE!\nGAYLIEN‏ @GuyWithOpinion1\nYou know, I usually just laugh at you, but honestly fuck off and die. You don’t get to shit on Jack fucking Kirby’s grave, you Nazi fuck.\nSupreme Dark Lord‏ @voxday\nSure I do. He was a midget, a bullshitter, and he couldn’t draw hands or ears. I see we’ve gone from Stage One to Stage Three.\nDrew Habits‏ @DrewHabits\nIf Jack Kirby were alive today, he’d probably kick your ass with his 100-year-old muscles while you pooped your Dukes of Hazzard underoos\nSupreme Dark Lord‏ @voxday\nJack Kirby was a midget and a bullshitter. He wasn’t kicking anyone’s ass, except maybe a little girl’s.\nTen‏ @tenryuuwu\nif kirby were alive today he’d steal your lunch money and give you a swirly\nSupreme Dark Lord‏ @voxday\nThat’s antisemitic. Jews are not all thieves. And Kirby wasn’t big enough to pick me up, let alone give me a swirly.\nWhatever happened to all the laughing? Well, they’re clearly not triggered or anything.\nBy the way, I performed a little science at the gym today, testing out hypotheses. It turns out I could curl the little midget four times cleanly, six if I cheated. Figure eight at peak.\nUPDATE: Now MovieBob\nis weighing in\n.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-28T16:00:00+00:00"
}