{
  "url": "https://voxday.net/2017/09/18/in-defense-of-gab/",
  "scraped_at": "2025-12-19T10:24:23.330121",
  "title": "In defense of Gab",
  "date_display": "September 18, 2017",
  "date_iso": "2017-09-18T17:21:00+00:00",
  "date_from_url": "2017-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now the self-appointed Defenders of Gab are appealing to Google in order to get back at me for Gab’s failure to moderate content to the satisfaction of its registrar. I’m less than entirely confident that Google is going to be particularly inclined to leap to the assistance of the self-appointed Defenders of Gab, since Gab is, as you may recall, <i>currently suing Google</i>.</p><blockquote><p>Larry L Sharp PRO · @LarryLSharp<br>@VoxDay’s blog is on blogspot in case anyone’s asking. I don’t advocate anything. I just provide PSA. How to register a complaint with Google about inappropriate content on blogs using blogspot.com.</br></p><p>Jason American · @jamerica<br>Vox admitting he played a part in Gab losing their domain registrar. @a @e @u</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>This is so easy to do! Just pick a topic &amp; paste in the blogger’s URL and submit. The satisfaction of knowing you just did something good in helping to preserve freedom of speech is incredible. I don’t advocate anything of course. Just a PSA.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>@VoxDay’s blog is on blogspot in case anyone’s asking. I don’t advocate anything. I just provide PSA. How to register a complaint with Google about inappropriate content on blogs using blogspot.com.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Interesting. He seems to use his blog as his primary means of communicating with his followers. How would they communicate without it? Can high IQ folks do telepathy?</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>It would make for an interesting experience if the ppl on Gab, who are trying to destroy Gab by reporting it to the Domain Registrar, were to be outed on other social media sites for inappropriate content and then reported to Twitter’s Domain Registrar or other registrars</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Could that information be tethered to Twitter asking why he would say such inappropriate things?</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Could posts from his blog be tethered to Twitter asking why he would have such inappropriate content?</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Is there anyone searching through @VoxDay and @SpaceBunny Twitter accounts for inappropriate posts that should be reported to the FBI and Twitter’s Domain Registrar? Asking for a nosy neighbor.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Is there anyone reporting this to Twitter’s Domain Registrar and to the FBI? How many ppl on Gab who are still on Twitter too can be reporting it? What type of effect would that have on Twitter?</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>If anyone has a Spacebunny Day face png with a clear background (ready to use) plz post. Thank you in advance ?</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>It is laughable that some ppl think they can fight the Deep State or whoever to keep Gab up &amp; running when they don’t even have the balls to stand up to some has-been space cadets who are trying to destroy Gab.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>The rats are already deserting Gab and going back to the Twitter Ghetto. You never were with us. So, good riddance.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Calling all 4chan /pol/ autists You know what to do.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>Interesting that this all occurred – after – @VoxDay said he deleted all of the posts that @MicroChip found offensive.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>There’s no time for negativity my friend. It’s time to go for the jugular. This time, there will be no peace brokered by one gabber.</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>All you Dear @VoxDay and @SpaceBunny supporters get off my TL. Now!</br></p><p>Larry L Sharp PRO · @LarryLSharp<br>@VoxDay’s blog is on blogspot in case anyone’s asking. I don’t advocate anything. I just provide PSA. How to register a complaint with Google about inappropriate content on blogs using blogspot.com.</br></p></blockquote><p>I also tend to suspect this gentleman doesn’t understand how Google – or really, Blogger – handles complaints. First, they review the post. Second, they put it into draft mode. Third, they tell you to modify it to remove something specific or they tell you to delete the post. If Blogger tells me to delete something, I will do so. It is, after all, their house. And this would not be the first time that has happened, although it would be the first time in a long while, because, unlike Gab, I abide by their specified standards, and have done so for 14 years.</p><p>The amusing thing is that these are the very people who are attempting to lecture everyone on the importance of not punching right. But it is clear that they don’t respect their own professed principle, so why do they expect anyone else to do so?</p></div>",
  "content_text": "Now the self-appointed Defenders of Gab are appealing to Google in order to get back at me for Gab’s failure to moderate content to the satisfaction of its registrar. I’m less than entirely confident that Google is going to be particularly inclined to leap to the assistance of the self-appointed Defenders of Gab, since Gab is, as you may recall,\ncurrently suing Google\n.\nLarry L Sharp PRO · @LarryLSharp\n@VoxDay’s blog is on blogspot in case anyone’s asking. I don’t advocate anything. I just provide PSA. How to register a complaint with Google about inappropriate content on blogs using blogspot.com.\nJason American · @jamerica\nVox admitting he played a part in Gab losing their domain registrar. @a @e @u\nLarry L Sharp PRO · @LarryLSharp\nThis is so easy to do! Just pick a topic & paste in the blogger’s URL and submit. The satisfaction of knowing you just did something good in helping to preserve freedom of speech is incredible. I don’t advocate anything of course. Just a PSA.\nLarry L Sharp PRO · @LarryLSharp\n@VoxDay’s blog is on blogspot in case anyone’s asking. I don’t advocate anything. I just provide PSA. How to register a complaint with Google about inappropriate content on blogs using blogspot.com.\nLarry L Sharp PRO · @LarryLSharp\nInteresting. He seems to use his blog as his primary means of communicating with his followers. How would they communicate without it? Can high IQ folks do telepathy?\nLarry L Sharp PRO · @LarryLSharp\nIt would make for an interesting experience if the ppl on Gab, who are trying to destroy Gab by reporting it to the Domain Registrar, were to be outed on other social media sites for inappropriate content and then reported to Twitter’s Domain Registrar or other registrars\nLarry L Sharp PRO · @LarryLSharp\nCould that information be tethered to Twitter asking why he would say such inappropriate things?\nLarry L Sharp PRO · @LarryLSharp\nCould posts from his blog be tethered to Twitter asking why he would have such inappropriate content?\nLarry L Sharp PRO · @LarryLSharp\nIs there anyone searching through @VoxDay and @SpaceBunny Twitter accounts for inappropriate posts that should be reported to the FBI and Twitter’s Domain Registrar? Asking for a nosy neighbor.\nLarry L Sharp PRO · @LarryLSharp\nIs there anyone reporting this to Twitter’s Domain Registrar and to the FBI? How many ppl on Gab who are still on Twitter too can be reporting it? What type of effect would that have on Twitter?\nLarry L Sharp PRO · @LarryLSharp\nIf anyone has a Spacebunny Day face png with a clear background (ready to use) plz post. Thank you in advance ?\nLarry L Sharp PRO · @LarryLSharp\nIt is laughable that some ppl think they can fight the Deep State or whoever to keep Gab up & running when they don’t even have the balls to stand up to some has-been space cadets who are trying to destroy Gab.\nLarry L Sharp PRO · @LarryLSharp\nThe rats are already deserting Gab and going back to the Twitter Ghetto. You never were with us. So, good riddance.\nLarry L Sharp PRO · @LarryLSharp\nCalling all 4chan /pol/ autists You know what to do.\nLarry L Sharp PRO · @LarryLSharp\nInteresting that this all occurred – after – @VoxDay said he deleted all of the posts that @MicroChip found offensive.\nLarry L Sharp PRO · @LarryLSharp\nThere’s no time for negativity my friend. It’s time to go for the jugular. This time, there will be no peace brokered by one gabber.\nLarry L Sharp PRO · @LarryLSharp\nAll you Dear @VoxDay and @SpaceBunny supporters get off my TL. Now!\nLarry L Sharp PRO · @LarryLSharp\n@VoxDay’s blog is on blogspot in case anyone’s asking. I don’t advocate anything. I just provide PSA. How to register a complaint with Google about inappropriate content on blogs using blogspot.com.\nI also tend to suspect this gentleman doesn’t understand how Google – or really, Blogger – handles complaints. First, they review the post. Second, they put it into draft mode. Third, they tell you to modify it to remove something specific or they tell you to delete the post. If Blogger tells me to delete something, I will do so. It is, after all, their house. And this would not be the first time that has happened, although it would be the first time in a long while, because, unlike Gab, I abide by their specified standards, and have done so for 14 years.\nThe amusing thing is that these are the very people who are attempting to lecture everyone on the importance of not punching right. But it is clear that they don’t respect their own professed principle, so why do they expect anyone else to do so?",
  "tags": [
    "#AltTech",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-18T16:21:00+00:00"
}