{
  "url": "https://voxday.net/2017/09/15/jerry-pournelle-week-iv/",
  "scraped_at": "2025-12-19T10:23:53.168355",
  "title": "Jerry Pournelle Week IV",
  "date_display": "September 15, 2017",
  "date_iso": "2017-09-15T00:24:00+00:00",
  "date_from_url": "2017-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an excellent article on wargame design, “Simulating the Art of War”, that Jerry Pournelle originally published in <i>The General</i>, and which he graciously permitted us to reprint four decades later in <i><b><a href=\"http://amzn.to/2jxTlhN\">Riding the Red Horse</a></b></i>. It is perhaps worth noting that Castalia House will be publishing the book mentioned below, <i>The Strategy of Technology,</i> in a new hardcover edition this winter.</p><p>SIMULATING THE ART OF WAR<br>by Jerry Pournelle</br></p><p>The title of this article is a misnomer. Although I have had some experience simulating the art of war, nothing would be duller for a game; so far as I can tell, the closer the simulation, the less playable the result. The best simulation of land warfare I have ever seen takes place at Research Analysis Corporation (RAC). an Army-related think tank in Virginia. At RAC, they have three enormous war-rooms, each equipped with a wargames table some twenty feet square, each table having elaborate terrain features at a scale of about one inch to the kilometer. ln the Blue room, only Blue units and the Red units located by reconaissance are shown; in the Red room, the opposite, while the only complete record of all units in the game is in the Control room.</p><p>Each team consists of an array of talent including logistics and supply officers. intelligence officers, subordinate unit commanders, etc. Orders are given to a computer, which then sends the orders to the actual units, while members of the Control team move them rather than the players Both teams send in orders simultaneously, so that the computer is needed to ﬁnd which units actually get to move and which are interfered with. The last time I was involved with a RAC game, as a consultant to feed in data about how to simulate strategic and tactical air strikes, it took six months playing time to finish a forty-eight hour simulation—and that was with about ten players on each side, a staff of twenty referees, and a large computer to help. The game, incidentally was one which eventually resulted in the US Army’s evolving the Air Assault Divisions, now known as Air Cav.</p><p>The point is that although an accurate simulation—it had to be. since procurement and real-world organization decisions were based in part on the results—the “war game” at RAC was unplayable, and, one suspects, even the most fanatical wargames buff would have found it dull after working at it full time for months.</p><p>Yet. What makes a wargame different from some other form of combat game like chess? What is there about the wargame that can generate such enthusiasm? Obviously, it is the similarity to war; the element of simulation which is lacking from other games. Consequently, the game designer must know something about simulation. and must make realism his second goal in design.</p><p>There are two ways of making a wargame realistic. The ﬁrst, which by and large has been exploited well, is “face-realism”. That is, the game designer attempts to employ terrain features similar to a real world battle or war; designates units that either really were in a battle, or might have been; calls the playing pieces “armor” and “infantry”, or “CCA”, or “42nd Infantry Regiment” and the like. He tries, in other words, to give the appearance of reality. He may also, as is often done, make the rules complex, usually by adding optional rules to bring in such factors as “air power” or “supply”, or “weather”</p><p>The second way of making a wargame realistic is much more difficult, and has seldom been tried. This method is as follows: the designer abstracts the principles of war as we know them, and designs a game in which only the correct application of those principles brings success. There are, as I said, few of those games. I am tempted to say none, but this would be incorrect; many Avalon Hill games partially meet this goal.</p><p>The second kind of simulation is admittedly far more difficult. To some extent it may even interfere with the “realism” of the ﬁrst kind, in that some rather unusual moves may be required. In this and succeeding articles I shall attempt to analyze the principles of war which should be simulated, and the rules which may introduce “functional simulation” to the art of wargaming.<br><a name=\"more\"></a><br>Tactics or Strategy?</br></br></p><p>The first decision is a key one: do we simulate tactics or strategy? This is compounded by the problem that no really satisfactory deﬁnitions of strategy and tactics exist, and neither is very well understood in the United States. For example, there is nowhere in this country a good work on modern tactics, and the study of tactics has largely been neglected for the study of something which we call strategy, but which is often not that either. This is a large subject, and not one to be settled in a single essay; the interested reader might refer to <i>The Strategy of Technology</i>, by S. T. Possony and J. E. Pournelle, University Press of Cambridge, Mass. for a fuller exposition on what I mean by that statement.</p><p>The average game of strategy, in any event, would be too complex, and simulation is extremely difﬁcult because strategy operates against the will of the opponent rather than his means. Because there is no more penalty to a wargamer for losing utterly than there is for losing at all, it is difficult to make him surrender until his means of combat have been eliminated. I suppose rules could be devised in which a point system is employed, with a penalty to be paid for the number of points lost by the loser less those which he has gained against the winner, but then another difficulty arises: in the real world there are usually factors operating which make the victor anxious to accept the surrender of his enemy, in war games there is almost none, and consequently a player who is winning would be most reluctant to allow the loser to stop the war until the maximum number of points had been extracted. It is all a very difficult matter. and one which deserves more thought than we have time for in this article.</p><p>Consequently, we will discuss tactics more than grand tactics, and grand tactics more than strategy. The subject is, I think, large enough for our purposes.</p><p>Which Principles of War?</p><p>The next problem is, which principles of war do we wish to emphasize? For that matter, which list of principles will we accept? Every serious student has his own set of “the” principles of war, and few lists are alike. Again, for our purposes, we will have to be satisifed with an arbitrary set of principles which seem appropriate for gaming, leaving the question of which are the correct principles of war to another discussion.</p><p>It seems to me that the most important principle of war neglected in popular games is the Principle of Surprise. Surprise has probably won more battles than all the other factors combined. Certainly it has provided most clear wins by a side which should reasonably be expected to lose. Consequently, let us examine the characteristics of surprise as it operates in real battles, and how it might be simulated in games.</p><p>Surprise consists of doing what the opponent is certain you will not or cannot do. Classical examples are: night marches, attacks by inferior forces, the use of equipment, troops, or weapons in totally unexpected ways, attacks through “impassable” terrain, and “secret weapons” which quite often have not been secret in the sense of being unknown, but secret in the sense of a capability previously unexpected, such as when infantry has been trained to make forced marches at speeds not thought possible.</p><p>Many of these kinds of surprise are impossible in gaming. There is no way, at least none known to me, in which we can unexpectedly increase the striking radius of the gaming pieces, or change the terrain rules in the middle of the game, or combine forces in such a way that together they have a higher combat factor than they do separately. Certainly we could do any of these things, possibly by some kind of card drawing or random number system; but the resultant would not be the mind-numbing shock of the totally unexpected, because the opponent would know from the rules that such things were possible. The true effect of surprise goes beyond the immediate effect to a paralysis of the opponent’s will; if he could do that, then what else might he be able to do? Wars have been won by exploiting that kind of surprise.</p><p>We can, however, introduce surprise by imperfect intelligence; allow a player to do, if not the totally unexpected, then at least something which the opponent has dismissed as highly unlikely. The best way to achieve this at the game board, in my judgment, is through the matchbox system. In this system, each player has a certain number of headquarters-type pieces, and for each such piece a matchbox or envelope. At any time a player may move a certain number of combat pieces up to the headquarters and take them off the board to be placed in the corresponding matchbox. The HQ then moves on the board, and the combat pieces are considered to be stacked on top of it, or, in non-stacking games, in the squares through which the headquarters has last moved. Obviously, by judicious moving of the headquarters units together and then apart, a player can create confusion as to just what units are in any given formation containing headquarters pieces, so much so that what appears to be a minor raid might well be a full armored army, while what seems to be a major attack might be a reconaissance in force. The matchboxes are used to keep the players honest; only those pieces in the matchbox can be claimed to be with the on-board HQ.</p><p>This rule alone can produce a major effect on wargames; I have seen the emergence of an army in a totally unexpected place bring about a paralysis of will that brought defeat to an otherwise winning player. I have also seen the fear of surprise attack stop an advance even though there was in fact no real strength opposing it. In my judgment the rule should become a standard rule in all board-type wargames.</p><p>The second most neglected factor in wargaming is the principle of Economy of Forces, the judicious combination of units of different types to bring about a force sufficient for the objective set. Again, the really great exploitations of this principle are denied the gamer. We cannot change the rules in the middle of the game, or discover a new use for infantry-cavalry combinations unknown to the opponent. We can, however, provide a rich variety of really different units, each with a special capability. This was discussed at great length in my previous article on “The Decisive Arm” and cannot be repeated here. Therefore, we will only examine some possibilities open to the wargamer.</p><p>First, it seems to me, we will need complexity, and complexity is generally the enemy of playability. ln this case there is no help for it and what we must do is strive to make our complexities such that we do not lose ourselves in them. What we need is a variety of kinds of units which have some really fundamental differences between them, not merely differences in strength and mobility.</p><p>For example: in Waterloo, the artillery should be allowed to stack without limit. This means that a player who has husbanded his artillery can bring an enormous concentration of force against a single point-much as Napoleon was able to do. The P-A-A player, on the other hand, should be prevented from stacking dissimilar units, and in particular forbidden to place Prussians with Allies. Adding this rule and the matchbox rule produces a game of Waterloo entirely different from the standard game, and one which I think is more interesting. It automatically provides a role for cavalry as well—reconnaissance becomes absolutely necessary, with cavalry making sweeps to locate the enemy artillery prior to setting up a defensive position or mounting a major attack. Without such knowledge, the player is nearly blinded and can be surprised. In modern games, armor can have unique stacking capabilities, as infantry, or infantry-armor combinations, can stack.</p><p>The last principle we shall examine in this article is the Principle of Uncertainty: No battle plan ever survives contact with the enemy. It is the ﬁrst maxim that the aspiring commander must learn.<br>This was, to some extent, brilliantly incorporated into the original Avalon Hill combat results tables. It has been less and less so as time went on, and I fear the results when the new non-random combat results rules become universal as they seem destined to do.</br></p><p>In simulation, you can never eliminate uncertainties. There is always a chance that a small unit, ordered to die to a man, will in fact repulse a much larger unit ordered to attack without quarter. The chance may be small, but it is there, and the really great generals have been those who understood this and made contingency plans for unlikely events. If we are to keep realism in our wargames, we must have uncertainty.</p><p>At the same time, there is no question but that the old, rigid combat tables were wrong. The defense should have the option of bugging out to save his forces, and the attacker should have the option of making feints rather than full-scale attacks. On the other hand, the uncertainties need to be preserved. A withdrawal in the face of a cavalry attack, for example, can be very difﬁcult and might even result in greater losses than an attempt to hold the position. The possibilities are easy to speculate on. harder to simulate.</p><p>Still, simulation is not impossible. Better combat tables could be devised by spending a lot more time analyzing what happens in particular situations and adjusting the probabilities accordingly. Other future articles will analyse the Principle of Pursuit, the Principle of the Objective, the Principle of Unity of Command, Logistics and Supply, and the Center of Gravity, a European concept almost totally neglected in U.S. military analyses.</p></div>",
  "content_text": "This is an excellent article on wargame design, “Simulating the Art of War”, that Jerry Pournelle originally published in\nThe General\n, and which he graciously permitted us to reprint four decades later in\nRiding the Red Horse\n. It is perhaps worth noting that Castalia House will be publishing the book mentioned below,\nThe Strategy of Technology,\nin a new hardcover edition this winter.\nSIMULATING THE ART OF WAR\nby Jerry Pournelle\nThe title of this article is a misnomer. Although I have had some experience simulating the art of war, nothing would be duller for a game; so far as I can tell, the closer the simulation, the less playable the result. The best simulation of land warfare I have ever seen takes place at Research Analysis Corporation (RAC). an Army-related think tank in Virginia. At RAC, they have three enormous war-rooms, each equipped with a wargames table some twenty feet square, each table having elaborate terrain features at a scale of about one inch to the kilometer. ln the Blue room, only Blue units and the Red units located by reconaissance are shown; in the Red room, the opposite, while the only complete record of all units in the game is in the Control room.\nEach team consists of an array of talent including logistics and supply officers. intelligence officers, subordinate unit commanders, etc. Orders are given to a computer, which then sends the orders to the actual units, while members of the Control team move them rather than the players Both teams send in orders simultaneously, so that the computer is needed to ﬁnd which units actually get to move and which are interfered with. The last time I was involved with a RAC game, as a consultant to feed in data about how to simulate strategic and tactical air strikes, it took six months playing time to finish a forty-eight hour simulation—and that was with about ten players on each side, a staff of twenty referees, and a large computer to help. The game, incidentally was one which eventually resulted in the US Army’s evolving the Air Assault Divisions, now known as Air Cav.\nThe point is that although an accurate simulation—it had to be. since procurement and real-world organization decisions were based in part on the results—the “war game” at RAC was unplayable, and, one suspects, even the most fanatical wargames buff would have found it dull after working at it full time for months.\nYet. What makes a wargame different from some other form of combat game like chess? What is there about the wargame that can generate such enthusiasm? Obviously, it is the similarity to war; the element of simulation which is lacking from other games. Consequently, the game designer must know something about simulation. and must make realism his second goal in design.\nThere are two ways of making a wargame realistic. The ﬁrst, which by and large has been exploited well, is “face-realism”. That is, the game designer attempts to employ terrain features similar to a real world battle or war; designates units that either really were in a battle, or might have been; calls the playing pieces “armor” and “infantry”, or “CCA”, or “42nd Infantry Regiment” and the like. He tries, in other words, to give the appearance of reality. He may also, as is often done, make the rules complex, usually by adding optional rules to bring in such factors as “air power” or “supply”, or “weather”\nThe second way of making a wargame realistic is much more difficult, and has seldom been tried. This method is as follows: the designer abstracts the principles of war as we know them, and designs a game in which only the correct application of those principles brings success. There are, as I said, few of those games. I am tempted to say none, but this would be incorrect; many Avalon Hill games partially meet this goal.\nThe second kind of simulation is admittedly far more difficult. To some extent it may even interfere with the “realism” of the ﬁrst kind, in that some rather unusual moves may be required. In this and succeeding articles I shall attempt to analyze the principles of war which should be simulated, and the rules which may introduce “functional simulation” to the art of wargaming.\nTactics or Strategy?\nThe first decision is a key one: do we simulate tactics or strategy? This is compounded by the problem that no really satisfactory deﬁnitions of strategy and tactics exist, and neither is very well understood in the United States. For example, there is nowhere in this country a good work on modern tactics, and the study of tactics has largely been neglected for the study of something which we call strategy, but which is often not that either. This is a large subject, and not one to be settled in a single essay; the interested reader might refer to\nThe Strategy of Technology\n, by S. T. Possony and J. E. Pournelle, University Press of Cambridge, Mass. for a fuller exposition on what I mean by that statement.\nThe average game of strategy, in any event, would be too complex, and simulation is extremely difﬁcult because strategy operates against the will of the opponent rather than his means. Because there is no more penalty to a wargamer for losing utterly than there is for losing at all, it is difficult to make him surrender until his means of combat have been eliminated. I suppose rules could be devised in which a point system is employed, with a penalty to be paid for the number of points lost by the loser less those which he has gained against the winner, but then another difficulty arises: in the real world there are usually factors operating which make the victor anxious to accept the surrender of his enemy, in war games there is almost none, and consequently a player who is winning would be most reluctant to allow the loser to stop the war until the maximum number of points had been extracted. It is all a very difficult matter. and one which deserves more thought than we have time for in this article.\nConsequently, we will discuss tactics more than grand tactics, and grand tactics more than strategy. The subject is, I think, large enough for our purposes.\nWhich Principles of War?\nThe next problem is, which principles of war do we wish to emphasize? For that matter, which list of principles will we accept? Every serious student has his own set of “the” principles of war, and few lists are alike. Again, for our purposes, we will have to be satisifed with an arbitrary set of principles which seem appropriate for gaming, leaving the question of which are the correct principles of war to another discussion.\nIt seems to me that the most important principle of war neglected in popular games is the Principle of Surprise. Surprise has probably won more battles than all the other factors combined. Certainly it has provided most clear wins by a side which should reasonably be expected to lose. Consequently, let us examine the characteristics of surprise as it operates in real battles, and how it might be simulated in games.\nSurprise consists of doing what the opponent is certain you will not or cannot do. Classical examples are: night marches, attacks by inferior forces, the use of equipment, troops, or weapons in totally unexpected ways, attacks through “impassable” terrain, and “secret weapons” which quite often have not been secret in the sense of being unknown, but secret in the sense of a capability previously unexpected, such as when infantry has been trained to make forced marches at speeds not thought possible.\nMany of these kinds of surprise are impossible in gaming. There is no way, at least none known to me, in which we can unexpectedly increase the striking radius of the gaming pieces, or change the terrain rules in the middle of the game, or combine forces in such a way that together they have a higher combat factor than they do separately. Certainly we could do any of these things, possibly by some kind of card drawing or random number system; but the resultant would not be the mind-numbing shock of the totally unexpected, because the opponent would know from the rules that such things were possible. The true effect of surprise goes beyond the immediate effect to a paralysis of the opponent’s will; if he could do that, then what else might he be able to do? Wars have been won by exploiting that kind of surprise.\nWe can, however, introduce surprise by imperfect intelligence; allow a player to do, if not the totally unexpected, then at least something which the opponent has dismissed as highly unlikely. The best way to achieve this at the game board, in my judgment, is through the matchbox system. In this system, each player has a certain number of headquarters-type pieces, and for each such piece a matchbox or envelope. At any time a player may move a certain number of combat pieces up to the headquarters and take them off the board to be placed in the corresponding matchbox. The HQ then moves on the board, and the combat pieces are considered to be stacked on top of it, or, in non-stacking games, in the squares through which the headquarters has last moved. Obviously, by judicious moving of the headquarters units together and then apart, a player can create confusion as to just what units are in any given formation containing headquarters pieces, so much so that what appears to be a minor raid might well be a full armored army, while what seems to be a major attack might be a reconaissance in force. The matchboxes are used to keep the players honest; only those pieces in the matchbox can be claimed to be with the on-board HQ.\nThis rule alone can produce a major effect on wargames; I have seen the emergence of an army in a totally unexpected place bring about a paralysis of will that brought defeat to an otherwise winning player. I have also seen the fear of surprise attack stop an advance even though there was in fact no real strength opposing it. In my judgment the rule should become a standard rule in all board-type wargames.\nThe second most neglected factor in wargaming is the principle of Economy of Forces, the judicious combination of units of different types to bring about a force sufficient for the objective set. Again, the really great exploitations of this principle are denied the gamer. We cannot change the rules in the middle of the game, or discover a new use for infantry-cavalry combinations unknown to the opponent. We can, however, provide a rich variety of really different units, each with a special capability. This was discussed at great length in my previous article on “The Decisive Arm” and cannot be repeated here. Therefore, we will only examine some possibilities open to the wargamer.\nFirst, it seems to me, we will need complexity, and complexity is generally the enemy of playability. ln this case there is no help for it and what we must do is strive to make our complexities such that we do not lose ourselves in them. What we need is a variety of kinds of units which have some really fundamental differences between them, not merely differences in strength and mobility.\nFor example: in Waterloo, the artillery should be allowed to stack without limit. This means that a player who has husbanded his artillery can bring an enormous concentration of force against a single point-much as Napoleon was able to do. The P-A-A player, on the other hand, should be prevented from stacking dissimilar units, and in particular forbidden to place Prussians with Allies. Adding this rule and the matchbox rule produces a game of Waterloo entirely different from the standard game, and one which I think is more interesting. It automatically provides a role for cavalry as well—reconnaissance becomes absolutely necessary, with cavalry making sweeps to locate the enemy artillery prior to setting up a defensive position or mounting a major attack. Without such knowledge, the player is nearly blinded and can be surprised. In modern games, armor can have unique stacking capabilities, as infantry, or infantry-armor combinations, can stack.\nThe last principle we shall examine in this article is the Principle of Uncertainty: No battle plan ever survives contact with the enemy. It is the ﬁrst maxim that the aspiring commander must learn.\nThis was, to some extent, brilliantly incorporated into the original Avalon Hill combat results tables. It has been less and less so as time went on, and I fear the results when the new non-random combat results rules become universal as they seem destined to do.\nIn simulation, you can never eliminate uncertainties. There is always a chance that a small unit, ordered to die to a man, will in fact repulse a much larger unit ordered to attack without quarter. The chance may be small, but it is there, and the really great generals have been those who understood this and made contingency plans for unlikely events. If we are to keep realism in our wargames, we must have uncertainty.\nAt the same time, there is no question but that the old, rigid combat tables were wrong. The defense should have the option of bugging out to save his forces, and the attacker should have the option of making feints rather than full-scale attacks. On the other hand, the uncertainties need to be preserved. A withdrawal in the face of a cavalry attack, for example, can be very difﬁcult and might even result in greater losses than an attempt to hold the position. The possibilities are easy to speculate on. harder to simulate.\nStill, simulation is not impossible. Better combat tables could be devised by spending a lot more time analyzing what happens in particular situations and adjusting the probabilities accordingly. Other future articles will analyse the Principle of Pursuit, the Principle of the Objective, the Principle of Unity of Command, Logistics and Supply, and the Center of Gravity, a European concept almost totally neglected in U.S. military analyses.",
  "tags": [
    "CastaliaHouse",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-14T23:24:00+00:00"
}