{
  "url": "https://voxday.net/2017/09/16/jerry-pournelle-week-vi/",
  "scraped_at": "2025-12-19T10:24:03.723939",
  "title": "Jerry Pournelle Week VI",
  "date_display": "September 16, 2017",
  "date_iso": "2017-09-16T13:33:00+00:00",
  "date_from_url": "2017-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.amazon.com/There-Will-Be-War-X-ebook/dp/B019KYLOKQ/ref=as_li_ss_il?ie=UTF8&amp;qid=1505463421&amp;sr=8-2&amp;keywords=war+x&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=2429226e738b03ca1a75a9e92b61440e\" rel=\"noopener\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B019KYLOKQ&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B019KYLOKQ&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a><noscript><img alt=\"\" border=\"0\" decoding=\"async\" height=\"1\" src=\"https://ir-na.amazon-adsystem.com/e/ir?t=voxpop06-20&amp;l=li3&amp;o=1&amp;a=B019KYLOKQ\" style=\"border: none !important; margin: 0px !important;\" width=\"1\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"https://ir-na.amazon-adsystem.com/e/ir?t=voxpop06-20&amp;l=li3&amp;o=1&amp;a=B019KYLOKQ\" decoding=\"async\" height=\"1\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201%201%22%3E%3C/svg%3E\" style=\"border: none !important; margin: 0px !important;\" width=\"1\"><i>25 years after the end of the Cold War and the publication of the ninth volume of THERE WILL BE WAR, Dr. Pournelle revived his classic science fiction series with Castalia House. THERE WILL BE WAR Volume X continued the tradition of combining top-notch military science fiction with first-rate real-world analysis by military experts. The Cold War may have ended, but as recent events everywhere from Paris to Syria have demonstrated, war has not. </i><br><i><br/></i><i><b><a href=\"http://amzn.to/1OjeR54\">THERE WILL BE WAR Volume X </a></b>is edited by Jerry Pournelle and features 18 stories, articles, and poems. </i><i>Of particular note are “Battle Station” by Ben Bova, “Flashpoint: Titan” by Cheah Kai Wai, “What Price Humanity?” by David VanDyke, and the eerily prescient “The Man Who Wasn’t There” by Gregory Benford. Volume X also includes timely essays on “War and Migration” by Martin van Creveld, “The 4GW Counterforce” by William S. Lind and LtCol Gregory A. Thiele, USMC, and “The Deadly Future of Littoral Sea Control” by CDR Phillip E. Pournelle, USN, which was awarded the 2015 Literary Award by the Surface Navy Association for “the best professional article in any publication addressing Surface Navy or surface warfare issues.”</i></br></img></p><p><b><a href=\"http://amzn.to/1OjeR54\"><i>THERE WILL BE WAR Volume X</i> </a></b>is free today. The following is an excerpt from “<i>Flashpoint: Titan</i>“, the Hugo-nominated novelette by Cheah Kai Wai, the author of <b><i><a href=\"http://amzn.to/2pgk2I1\">No Gods, Only Daimons</a></i></b>.</p><p>Editor’s Introduction to:<br>FLASHPOINT: TITAN<br>by Cheah Kai Wai</br></br></p><p>Arthur C. Clarke said that if the human race is to survive, for most of its history the word ship will mean space ship. I will add to that the obvious implication that Navy will soon mean Space Navy. The Space Navy will certainly keep many of the traditions and practices of the wet navies, for the same reasons that they developed in the first place.</p><p>Navy stories are as old as going to sea in ships. The heroines of those stories are often ships as well as their crews. Here a story of a heroic ship and her crew.</p><p><a name=\"more\"></a>FLASHPOINT: TITAN<br>by Cheah Kai Wai</br></p><p>Something was wrong. Somewhere in the sea of data before him, there was a shark swimming amidst a school of fish. Commander Hoshi Tenzen of the Japanese Space Self Defense Force narrowed his eyes, studying his ship’s combined sensor take on his console.</p><p>The console displayed the data as a three-dimensional hologram. In the center of the display, Takao was a blue triangle pointing towards a bright yellow mass. That was Titan, the largest moon in the Saturnian system, ten thousand kilometers away. Other yellow dots indicated satellites, orbital structures and shuttles with Titanian registration. White tracks indicated civilian space traffic. A number of small green dots orbited Titan, each representing American orbital patrol ships. Each contact carried a unique tag, displaying vector, velocity, name and other critical information.</p><p>There was too much data. He was drowning in it. Leaning back, he studied the big picture, looking for patterns of activity. Ships came to Titan, dropped off cargo, picked up other cargo, and left. It was their purpose in coming here.</p><p>But there were ships that did not fit this pattern.</p><p>Four of them. Their beacons claimed they were merchant ships registered to Clementine Space Transport Services, headquartered in Ceres. They were burning at five milligees, their vectors pointed at deep space.</p><p>But there was nothing of interest beyond Titan. The only other significant human activity past the moon was the gas mines at Uranus, which were almost completely automated.</p><p>So why were these ships accelerating?</p><p>Hoshi opened a new window, studying the radar track history. For the past week, the quartet had plodded steadily towards Titan on deceleration burns. They arrived three hours ago, entering the ten thousand kilometer orbit at a velocity of two klicks per second. An hour later, they flipped around and burned their engines. And they hadn’t stopped since.</p><p>His console chirped. Prometheus, the largest colony on Titan, was hailing Takao on the laser communications array. They had a message for Takao’s ears only.</p><p>He accepted the hail on his implants. A broad Midwestern accent flooded his skull. “Takao, this is Prometheus Control. Welcome to Titan. I wish I could greet you under more auspicious circumstances, but we need your help.”</p><p>“Copy, Prometheus Control,” Hoshi replied in English. “What kind of help do you need?”</p><p>“Takao, I want to draw your attention to Cloud Nine, Summer Squall, Autumn Lightning and Blue Jasper. They just pinged the laser launch array, the space elevator and the colony with lidar. They claim they are testing their instruments, but I’ve never heard of merchies that need military-grade lidar. We think they’re up to something.”</p><p>Hoshi looked for the ships. They were the same four ships he had flagged. Takao had designated them S-547 through S-550. They had formed a box, each ship separated by two hundred and fifty kilometers. He’d never known civilian freighters to take up such a formation in orbit.</p><p>But he knew warships did prior to a bombing run.</p><p>“Prometheus Control, understood. If these are Q-ships, we are ready to provide assistance. Be advised, we are carrying a full war load.”</p><p>Q-ships were warships disguised as merchant vessels. They couldn’t match the performance of real warships, but they could remain concealed until they released their weapons, making them the favorite of pirates and terrorists.</p><p>“Thank you kindly, Takao. We’re going to run an emergency drill, clear the airspace, and launch the alert squadron. Our plan is to lock down the ships and board ’em for surprise inspections. Give us a half hour and we’ll be in place.”</p><p>“Roger, Prometheus Control. If the suspect ships attempt to resist or escape, we will provide fire support.”</p><p>“Much obliged, Takao. Let’s do this.”</p><p>Hoshi typed a command on his console. Throughout the ship, a klaxon sounded. He keyed the ship-wide intercom and said, “All hands, sentou youii. All hands, sentou youii.”</p><p>The crew rushed to assume their battle stations. Around him, the duty personnel in the Combat Information Center tensed. Other spacers streamed in, taking their places.</p><p>Hoshi buckled himself into his seat and summoned a window that tracked the ship’s status. One by one, the boxes representing each deck and department turned green. He patted down his blue skinsuit, checking for holes. Two minutes later, the ship was at maximum readiness.</p><p>Lieutenant Kamishiro Takeshi, whose place as Executive Officer was in the astrogation deck above Hoshi, called him. “Sir, the ship is battle ready.”</p><p>“Thank you, Lieutenant.” Hoshi turned off the klaxon, brought his officers into a conference call, and briefed them.</p><p>“Gentlemen, this is no longer a shakedown cruise,” he concluded. “Remember: everyone back home is watching. Do not screw up.”</p><p>Only Kamishiro had the courage to snicker over the line. “Ryoukai!” Roger! “We won’t let you down.”</p><p>No one was watching him, so Hoshi allowed himself a momentary smile. “Sensors, extend telescopes and track the bogies. If they pull in their radiators, inform us immediately. Intelligence, assume the bogies are Q-ships and develop a threat profile. Weapons, create a solution for long-range engagement. Astrogation, plot an interdiction vector at full thrust.”</p><p>Hoshi and his Astrogation head, Lieutenant Sato Koichi, went back and forth until they were satisfied. Then Ensign Tanaka Michi, the Engineering officer, got on the intercom.</p><p>“All hands, accelerating, accelerating.”</p><p>The Japanese Space Self Defense Force called Takao a multimission patrol ship, the first of her class. But that was a misleading misnomer. Takao was truly a torch ship.</p><p>Mobilizing her gyroscopes,Takao rotated in place. Once vector-aligned, the fusion drive roared, accelerating the ship at one-third gravity, faster than any warship ever built. As Takao ate up the distance to Titan, Ensign Subaru Ryuto, the Weapons chief, hailed Hoshi.</p><p>“Sir, I have a solution.”</p><p>Subaru’s solution called for engaging the threats with Takao’s main laser from standoff range, then finishing them with missiles. Her point defense lasers and railguns would handle counterfire.</p><p>“Very good, Subaru. But while use of the laser is as per doctrine, there are Chinese forces a week out from Titan, and the Americans don’t need to know our capabilities. Set the lasers to ultraviolet-A. Then launch two sunrays and program them for the same frequency. Boost the sunrays to a deep space vector that enables us to make broadside shots against the bogies.”</p><p>Lieutenant Junior Grade Nakamura Makoto was next in line, ready with the threat profile. “Captain, the ships are registered as independent merchant vessels, displacement of twelve hundred tons each. They have deuterium-tritium drives, maximum acceleration of five milligees. They have a payload of five hundred tons each, mounted on external cargo pods. They claim to be carrying a shipment of ice from Ceres. Assuming these are Q-ships, I expect the pods to be filled with missiles and possibly drones.”</p><p>“Nakamura, did you say five milligees?”</p><p>“Yes sir. The reactor is either pretty small or pretty underpowered.” Nakamura hesitated. “Or they are concealing their actual acceleration profile.”</p><p>“Let’s assume the latter,” Hoshi said. “If they are Q-ships, they must suspect something by now. Titanian airspace is being cleared, the orbital patrol is converging on them, and our drive capabilities are as plain as day. Why haven’t they attacked yet?”</p><p>Nakamura took a moment to think it through. “Sir, they must be waiting for all their targets to enter their engagement envelope. That means the orbital patrol squadron, the laser launch array…and us.”</p><p>Hoshi’s blood chilled. Maybe they pinged the colony and pulled a burn so that everybody would come running into their sights. If Takao closed with an enemy too fast, she would be setting herself up for a point-blank missile swarm—one even she could not dodge in time.</p><p>“Thank you, Nakamura. Tanaka, halt acceleration.”</p><p>The drive cut off. Hoshi contacted Prometheus Control and passed on his men’s thoughts.</p><p>“Thank you very much, Takao,” Control said. “We’re moving slow too. We don’t want to spook them into doing something stupid. Way I figure, they will want to wait until we launch the alert squadron before striking.”</p><p>“Roger. What’s the plan for Q-ships?”</p><p>“Our priority will be to protect the Elevator, the colony, and the laser launch array, in that order. We will aim for impactors first, drones second, missiles third, and the Q-ships last.”</p><p>“Copy. We will target the Q-ships, drones and missiles in order of decreasing importance. We will also try to trash enemy weapons, but we don’t want to splash you by mistake.”</p><p>“Much obliged, Takao. If you don’t mind, let us handle impactors. That should prevent friendly fire. Also, let us know if you have to fire kinetics and I’ll get my birds out of your way.”</p><p>“Roger that, Prometheus Control.”</p><p>Subaru contacted Hoshi as soon as he closed the connection. “Sir, sunrays are good to go.”</p><p>Hoshi checked the solution and nodded. “Thank you, Subaru. Stand by.”</p><p>Hoshi brought up the radio controls, tuning it to the guard channel. “Attention all stations, attention all stations. This is JS Takao. We will be launching laser-propelled probes shortly. Please maintain separation of one hundred kilometers from my vector.”</p><p>Space warships launched probes so often that nobody would think twice about the announcement. Hoshi repeated the announcement three times, then said, “Launch sunrays.”</p><p>Powerful gas generators kicked the two Type 99 missiles into space. Takao trained a point defense laser bank on the nozzles of both missiles. Each of her lasers housed two independent turrets. The turrets picked a sunray each, and ignited the solid propellant in the missiles’ nozzles. Subaru’s solution would place the sunrays just over a thousand kilometers from the suspect ships when the operation was slated to begin.</p><p>Hoshi called up the telescope feed. Ensign Mori Arata, the Sensors officer sharing the CIC with Hoshi, was tracking the four-ship formation with his telescopes. The ships were still making steady burns, barely deviating from their predicted paths.</p><p>White dots bloomed from Titan’s surface. The Americans were launching on schedule. The rest of the orbital patrol closed in on the bogies.</p><p>Hoshi tapped his fingers against the console. If the bogies continued to behave themselves, all would be well. Yes, Hoshi would have to explain expending two Type 99 mirrors, but they were replaceable. On the other hand, if the bogies…</p><p>“Sir, Sierras 547 to 550 are retracting their radiators!” Mori called.</p><p>Radiators, being the primary means of shedding heat in space, were the most vulnerable and critical component of a ship. Ships only ever retracted them to prevent them from being harmed—or shot off. Over a colonized world, pulling in radiators was tantamount to a declaration of war.</p><p>He hailed the ships on the guard channel. “Attention, attention. This is JS Takao. You are in orbit over an inhabited surface. Retracting your radiators is against international law. Extend your radiators or you will be fired upon. This is your only warning.”</p><p>“Sir, we’re being pinged by multiple lidar sources,” Mori said. “They’re from the bogies.”</p><p>“Subaru, what’s the status of the main laser?”</p><p>“Captain, the capacitors are fully charged and the firing solution is ready.”</p><p>Clusters of cylindrical objects decoupled from each of the spaceships and fired tiny chemical rockets, burning towards the moon.</p><p>“Sir, bogies have ejected cargo pods,” Mori reported. “They are increasing acceleration to fifty milligees and are taking an escape vector.”</p><p>With fifty milligees of acceleration they could outrun most ships. But to Takao, they were slower than slugs.</p><p>“Subaru, initiate solution.”</p><p>“Initiating solution, ryoukai.”</p><p>Takao sent an encoded laser pulse to the sunrays. Their boosters kicked out their payloads, and the smaller projectiles inflated their smart-matter mirrors. The mirror modules discharged their onboard capacitors, energizing the lenses to alter their shape and molecular structure to reflect UV-A beams. Takao unshuttered her main laser, situated in her nose, and unleashed a stream of pulses. Bouncing off the mirror, the invisible pulses drilled into Sierra 547.</p><p>The two main laser turrets alternated their fire, pausing just long enough to recharge their ultracapacitors. The lasers burned through the Q-ship’s engine. A ball of hot plasma erupted from the target’s rear. Secondary explosions followed, then tertiary explosions, and the ship broke apart.<br>Hoshi blinked. Ships do not blow up like that, not unless the laser punched all the way into the reactor. Takao’s laser couldn’t do that, not at this angle of attack.</br></p><p>But that didn’t matter now. He had a fight to win.</p><p>Prometheus Control sent lasers snapping skywards, destroying as many pods as they could. The orbital patrol ships launched volleys of missiles, then closed into laser range. But there were too many pods and they could not get them all. The pods split open, dispersing their payloads.</p><p>In Hoshi’s display, huge numbers of red triangles popped into existence around the Q-ships, clustered so thick they formed a scarlet blanket. An alarm sounded.</p><p>“Captain, threat radar!” Mori called. “Ninety-eight strikers and twenty buzzards are locked on to us!”</p><p>“Chikusho!” Hoshi swore. “All hands, full guard, full guard!”</p><p>At the call, the entire crew snapped into action, following pre-established protocols. All non-essential systems and compartments shut down. Sato plotted the safest vector. Subaru directed his men to activate the point defenses. Nakamura activated the electronic warfare suite. Mori fed data to everybody as needed.</p><p>Powered by miniature nuclear reactor engines, ninety-eight missiles sped in at a quarter gravity. As they closed in, Tanaka yelled, “All hands, side kick! Side kick!”</p><p>Takao spun her gyroscopes, pointing her skywards. Her chemical maneuvering rockets fired, adding velocity to the turn, then fired again to cancel her momentum. The ship accelerated, burning for a higher orbit.</p><p>The missiles turned, trying to keep up. But the real threat was the twenty incoming drones. Fitted with nuclear gas-core rockets, they screamed in at one gravity, turning faster than Takao could, and fired barrages of smaller missiles from their coilguns.</p><p>“Sir!” Nakamura called. “Buzzards match profile of Tiannu drones!”</p><p>The Tiannu drone was an armed drone employed by the Chinese Space Forces. It was also obsoleted a few years ago, and its sensors were vulnerable to modern electronic warfare.</p><p>Some of the drones went berserk, firing blindly into empty space and chasing phantom targets. The point defense lasers burned down the rest. Takao continued spinning, giving her lasers a chance to cool off and recharge. The lasers fired low-powered pulses, melting sensors, electronics and payloads, sacrificing power for rate of fire. Many of the struck missiles detonated prematurely. More missiles spiraled away, confounded by the white noise in the air.</p><p>But dozens of threats survived to enter Takao’s kinetic engagement envelope.</p><p>“Subaru! Snap shot bursters, snap shot guns! Tanaka, retract radiators!”</p><p>The ship rumbled. Twenty-four Type 82 missiles leapt from her missile banks. Scorching towards the threats, the warheads detonated into sprays of tungsten cubes, each striking with the force of a small bomb.</p><p>Then Takao’s 60mm railguns fired. The guns churned out a barrage of fragmentation shells, placing an ocean of steel between Takao and the threats. The unguided flechettes disintegrated. The missiles tried to dodge. At this range, if the shells forced the missiles off a threat vector, it was as good as a kill.</p><p>But it was not enough. There were still too many missiles.</p><p>Takao still had reserves. If he launched them Hoshi was certain Takao would survive. Unscathed, even. But he had his orders, and his duty was absolute. The weapons could only be fired under exceptional circumstances, and a counter-piracy mission was, by definition, not exceptional. He could not use them, even if it meant the death of his ship and his crew.</p><p>He would not use them even to save his own life.</p><p>“Sir!” Subaru called. “Lasers have overheated!”</p><p>“Tanaka, divert all available coolant to point defense! All hands, brace for impact!”</p><p>Even as he spoke, twelve missiles survived to engagement range and detonated.</p><p>The lasers shut down completely. The railguns continued firing. They drew power from explosively pumped generators and had a separate coolant store, but were far less accurate than the lasers. Hoshi clenched his fists, watching tens of arrows close in on his ship.</p><p>Long seconds later, the lasers returned to life. Together with the railguns, they plucked the darts from the sky. Tanaka pulled one last trick, firing the engine and maneuvering rockets. The superheated exhaust consumed every flechette that entered the plumes.</p><p>But it was not enough.</p><p>The lasers dropped their shutters. The guns got off a final barrage. Then dozens of flechettes crashed into the ship. Tortured metal screamed. The blasts slammed Hoshi into his seat. Sirens went off. Alerts popped up on his console.</p><p>“Kamishiro,” Hoshi said, “damage report.”</p><p>The XO took a moment to check his boards. “Whipple shields compromised, no hull breaches. Forward missile cells damaged. Point Defense Laser Two reports damaged shutters, but not the turrets. No crew casualties.”</p><p>Hoshi heaved a sigh of relief. The enemy had loaded up with general-purpose flechettes. Hundreds could fit inside a warhead, but they lacked the punch to penetrate Takao’s armor.</p><p>He checked the display. The red blanket was rapidly dispersing. At some point, Sierra 549 had died in the hail of fire; she was now little more than debris and plasma. But the orbital patrol had been obliterated too, and so had the sunrays. And Sierra 548 and 550 were about to leave Titan orbit.</p><p>Hoshi wanted answers. At this angle, Takao’s lasers could punch through the enemies’ engines and into their reactors. But even civilian-grade compartment bulkheads would stop hypervelocity munitions.</p><p>“Tanaka, extend radiators. Subaru, target the enemy ships’ engines with muskets.”</p><p>Takao launched eight Type 83 missiles. These were fitted with anti-ship warheads, not the light flechettes Takao had endured. Her point defense lasers sent them soaring at the threats at three-quarters of a gravity.</p><p>The Q-ships couldn’t hope to outrun the missiles. But they had one last surprise. Hidden panels retracted, revealing automatic railguns. Two per ship.</p><p>“Nani?” Hoshi muttered. What?</p><p>Even as he spoke, the leading ship rained heavy metal down on the colony, while the other blasted at Takao and her missiles.</p><p>“Tanaka, evasive maneuvers. Subaru, snipe the railguns with lasers,” Hoshi said. “Prioritize the ones firing on Prometheus.”</p><p>Takao’s main laser discharged. Four shots later, the railguns blew apart. Then the point defense lasers kicked in, destroying the shells threatening Takao.</p><p>Prometheus didn’t take the insult lightly either. A lance of light carved through the heart of Sierra 548. Another speared Sierra 550. Shortly after, the four surviving muskets fired their payloads, spewing clusters of segmented-rod penetrators optimized for defeating armor.</p><p>The threats tried to turn their drives on the incoming flechettes, but they were too slow. The darts slammed into their engines, blowing them out.</p><p>Mori said, “Sir, bandits have ceased acceleration. No escape pods. No further targets. We have a grand—”</p><p>The telescopes blanked out.</p><p>“—slam?” Mori finished. “What the hell?”</p><p>The telescopes cleared. Sierras 548 and 550 were now rapidly expanding balls of plasma.</p><p>“Nakamura? What the hell happened?” Hoshi demanded.</p><p>“Looks like a reactor failure, sir. Mori, what’s in the vapor?”</p><p>“Lieutenant, laser spectroscope is picking up deuterium, tritium and heavy metals. Definitely a catastrophic reactor failure.”</p><p>“How likely is that to be from combat damage?” Hoshi asked.</p><p>“Our penetrators shouldn’t have damaged the reactor deck,” Subaru said. “Maybe the Americans?”</p><p>“Negative,” Mori said. “Spectroscope did not pick up fusion fuels following the laser strikes.”</p><p>“Suicide trigger then?” Nakamura wondered. “But that doesn’t make sense. Pirates aren’t suicidal. Even most terrorists aren’t that crazy these days. They’d rather surrender if they can’t maneuver.”</p><p>Hoshi thought again of Sierra 547. The secondary explosions were plausible, if the laser had struck a capacitor bank. But tertiaries? Ships were compartmented to prevent just that. It shouldn’t be possible, unless someone, or something, deliberately induced a reactor failure.</p><p>But now wasn’t the time and place to ponder such things.</p><p>“Gentlemen,” Hoshi said, “I’m sure we have plenty of questions. For now, we will secure from battle stations and clean up the skies.”</p><p>He had a very strong suspicion that this was not over. Not by a long shot.</p></div>",
  "content_text": "25 years after the end of the Cold War and the publication of the ninth volume of THERE WILL BE WAR, Dr. Pournelle revived his classic science fiction series with Castalia House. THERE WILL BE WAR Volume X continued the tradition of combining top-notch military science fiction with first-rate real-world analysis by military experts. The Cold War may have ended, but as recent events everywhere from Paris to Syria have demonstrated, war has not.\nTHERE WILL BE WAR Volume X\nis edited by Jerry Pournelle and features 18 stories, articles, and poems.\nOf particular note are “Battle Station” by Ben Bova, “Flashpoint: Titan” by Cheah Kai Wai, “What Price Humanity?” by David VanDyke, and the eerily prescient “The Man Who Wasn’t There” by Gregory Benford. Volume X also includes timely essays on “War and Migration” by Martin van Creveld, “The 4GW Counterforce” by William S. Lind and LtCol Gregory A. Thiele, USMC, and “The Deadly Future of Littoral Sea Control” by CDR Phillip E. Pournelle, USN, which was awarded the 2015 Literary Award by the Surface Navy Association for “the best professional article in any publication addressing Surface Navy or surface warfare issues.”\nTHERE WILL BE WAR Volume X\nis free today. The following is an excerpt from “\nFlashpoint: Titan\n“, the Hugo-nominated novelette by Cheah Kai Wai, the author of\nNo Gods, Only Daimons\n.\nEditor’s Introduction to:\nFLASHPOINT: TITAN\nby Cheah Kai Wai\nArthur C. Clarke said that if the human race is to survive, for most of its history the word ship will mean space ship. I will add to that the obvious implication that Navy will soon mean Space Navy. The Space Navy will certainly keep many of the traditions and practices of the wet navies, for the same reasons that they developed in the first place.\nNavy stories are as old as going to sea in ships. The heroines of those stories are often ships as well as their crews. Here a story of a heroic ship and her crew.\nFLASHPOINT: TITAN\nby Cheah Kai Wai\nSomething was wrong. Somewhere in the sea of data before him, there was a shark swimming amidst a school of fish. Commander Hoshi Tenzen of the Japanese Space Self Defense Force narrowed his eyes, studying his ship’s combined sensor take on his console.\nThe console displayed the data as a three-dimensional hologram. In the center of the display, Takao was a blue triangle pointing towards a bright yellow mass. That was Titan, the largest moon in the Saturnian system, ten thousand kilometers away. Other yellow dots indicated satellites, orbital structures and shuttles with Titanian registration. White tracks indicated civilian space traffic. A number of small green dots orbited Titan, each representing American orbital patrol ships. Each contact carried a unique tag, displaying vector, velocity, name and other critical information.\nThere was too much data. He was drowning in it. Leaning back, he studied the big picture, looking for patterns of activity. Ships came to Titan, dropped off cargo, picked up other cargo, and left. It was their purpose in coming here.\nBut there were ships that did not fit this pattern.\nFour of them. Their beacons claimed they were merchant ships registered to Clementine Space Transport Services, headquartered in Ceres. They were burning at five milligees, their vectors pointed at deep space.\nBut there was nothing of interest beyond Titan. The only other significant human activity past the moon was the gas mines at Uranus, which were almost completely automated.\nSo why were these ships accelerating?\nHoshi opened a new window, studying the radar track history. For the past week, the quartet had plodded steadily towards Titan on deceleration burns. They arrived three hours ago, entering the ten thousand kilometer orbit at a velocity of two klicks per second. An hour later, they flipped around and burned their engines. And they hadn’t stopped since.\nHis console chirped. Prometheus, the largest colony on Titan, was hailing Takao on the laser communications array. They had a message for Takao’s ears only.\nHe accepted the hail on his implants. A broad Midwestern accent flooded his skull. “Takao, this is Prometheus Control. Welcome to Titan. I wish I could greet you under more auspicious circumstances, but we need your help.”\n“Copy, Prometheus Control,” Hoshi replied in English. “What kind of help do you need?”\n“Takao, I want to draw your attention to Cloud Nine, Summer Squall, Autumn Lightning and Blue Jasper. They just pinged the laser launch array, the space elevator and the colony with lidar. They claim they are testing their instruments, but I’ve never heard of merchies that need military-grade lidar. We think they’re up to something.”\nHoshi looked for the ships. They were the same four ships he had flagged. Takao had designated them S-547 through S-550. They had formed a box, each ship separated by two hundred and fifty kilometers. He’d never known civilian freighters to take up such a formation in orbit.\nBut he knew warships did prior to a bombing run.\n“Prometheus Control, understood. If these are Q-ships, we are ready to provide assistance. Be advised, we are carrying a full war load.”\nQ-ships were warships disguised as merchant vessels. They couldn’t match the performance of real warships, but they could remain concealed until they released their weapons, making them the favorite of pirates and terrorists.\n“Thank you kindly, Takao. We’re going to run an emergency drill, clear the airspace, and launch the alert squadron. Our plan is to lock down the ships and board ’em for surprise inspections. Give us a half hour and we’ll be in place.”\n“Roger, Prometheus Control. If the suspect ships attempt to resist or escape, we will provide fire support.”\n“Much obliged, Takao. Let’s do this.”\nHoshi typed a command on his console. Throughout the ship, a klaxon sounded. He keyed the ship-wide intercom and said, “All hands, sentou youii. All hands, sentou youii.”\nThe crew rushed to assume their battle stations. Around him, the duty personnel in the Combat Information Center tensed. Other spacers streamed in, taking their places.\nHoshi buckled himself into his seat and summoned a window that tracked the ship’s status. One by one, the boxes representing each deck and department turned green. He patted down his blue skinsuit, checking for holes. Two minutes later, the ship was at maximum readiness.\nLieutenant Kamishiro Takeshi, whose place as Executive Officer was in the astrogation deck above Hoshi, called him. “Sir, the ship is battle ready.”\n“Thank you, Lieutenant.” Hoshi turned off the klaxon, brought his officers into a conference call, and briefed them.\n“Gentlemen, this is no longer a shakedown cruise,” he concluded. “Remember: everyone back home is watching. Do not screw up.”\nOnly Kamishiro had the courage to snicker over the line. “Ryoukai!” Roger! “We won’t let you down.”\nNo one was watching him, so Hoshi allowed himself a momentary smile. “Sensors, extend telescopes and track the bogies. If they pull in their radiators, inform us immediately. Intelligence, assume the bogies are Q-ships and develop a threat profile. Weapons, create a solution for long-range engagement. Astrogation, plot an interdiction vector at full thrust.”\nHoshi and his Astrogation head, Lieutenant Sato Koichi, went back and forth until they were satisfied. Then Ensign Tanaka Michi, the Engineering officer, got on the intercom.\n“All hands, accelerating, accelerating.”\nThe Japanese Space Self Defense Force called Takao a multimission patrol ship, the first of her class. But that was a misleading misnomer. Takao was truly a torch ship.\nMobilizing her gyroscopes,Takao rotated in place. Once vector-aligned, the fusion drive roared, accelerating the ship at one-third gravity, faster than any warship ever built. As Takao ate up the distance to Titan, Ensign Subaru Ryuto, the Weapons chief, hailed Hoshi.\n“Sir, I have a solution.”\nSubaru’s solution called for engaging the threats with Takao’s main laser from standoff range, then finishing them with missiles. Her point defense lasers and railguns would handle counterfire.\n“Very good, Subaru. But while use of the laser is as per doctrine, there are Chinese forces a week out from Titan, and the Americans don’t need to know our capabilities. Set the lasers to ultraviolet-A. Then launch two sunrays and program them for the same frequency. Boost the sunrays to a deep space vector that enables us to make broadside shots against the bogies.”\nLieutenant Junior Grade Nakamura Makoto was next in line, ready with the threat profile. “Captain, the ships are registered as independent merchant vessels, displacement of twelve hundred tons each. They have deuterium-tritium drives, maximum acceleration of five milligees. They have a payload of five hundred tons each, mounted on external cargo pods. They claim to be carrying a shipment of ice from Ceres. Assuming these are Q-ships, I expect the pods to be filled with missiles and possibly drones.”\n“Nakamura, did you say five milligees?”\n“Yes sir. The reactor is either pretty small or pretty underpowered.” Nakamura hesitated. “Or they are concealing their actual acceleration profile.”\n“Let’s assume the latter,” Hoshi said. “If they are Q-ships, they must suspect something by now. Titanian airspace is being cleared, the orbital patrol is converging on them, and our drive capabilities are as plain as day. Why haven’t they attacked yet?”\nNakamura took a moment to think it through. “Sir, they must be waiting for all their targets to enter their engagement envelope. That means the orbital patrol squadron, the laser launch array…and us.”\nHoshi’s blood chilled. Maybe they pinged the colony and pulled a burn so that everybody would come running into their sights. If Takao closed with an enemy too fast, she would be setting herself up for a point-blank missile swarm—one even she could not dodge in time.\n“Thank you, Nakamura. Tanaka, halt acceleration.”\nThe drive cut off. Hoshi contacted Prometheus Control and passed on his men’s thoughts.\n“Thank you very much, Takao,” Control said. “We’re moving slow too. We don’t want to spook them into doing something stupid. Way I figure, they will want to wait until we launch the alert squadron before striking.”\n“Roger. What’s the plan for Q-ships?”\n“Our priority will be to protect the Elevator, the colony, and the laser launch array, in that order. We will aim for impactors first, drones second, missiles third, and the Q-ships last.”\n“Copy. We will target the Q-ships, drones and missiles in order of decreasing importance. We will also try to trash enemy weapons, but we don’t want to splash you by mistake.”\n“Much obliged, Takao. If you don’t mind, let us handle impactors. That should prevent friendly fire. Also, let us know if you have to fire kinetics and I’ll get my birds out of your way.”\n“Roger that, Prometheus Control.”\nSubaru contacted Hoshi as soon as he closed the connection. “Sir, sunrays are good to go.”\nHoshi checked the solution and nodded. “Thank you, Subaru. Stand by.”\nHoshi brought up the radio controls, tuning it to the guard channel. “Attention all stations, attention all stations. This is JS Takao. We will be launching laser-propelled probes shortly. Please maintain separation of one hundred kilometers from my vector.”\nSpace warships launched probes so often that nobody would think twice about the announcement. Hoshi repeated the announcement three times, then said, “Launch sunrays.”\nPowerful gas generators kicked the two Type 99 missiles into space. Takao trained a point defense laser bank on the nozzles of both missiles. Each of her lasers housed two independent turrets. The turrets picked a sunray each, and ignited the solid propellant in the missiles’ nozzles. Subaru’s solution would place the sunrays just over a thousand kilometers from the suspect ships when the operation was slated to begin.\nHoshi called up the telescope feed. Ensign Mori Arata, the Sensors officer sharing the CIC with Hoshi, was tracking the four-ship formation with his telescopes. The ships were still making steady burns, barely deviating from their predicted paths.\nWhite dots bloomed from Titan’s surface. The Americans were launching on schedule. The rest of the orbital patrol closed in on the bogies.\nHoshi tapped his fingers against the console. If the bogies continued to behave themselves, all would be well. Yes, Hoshi would have to explain expending two Type 99 mirrors, but they were replaceable. On the other hand, if the bogies…\n“Sir, Sierras 547 to 550 are retracting their radiators!” Mori called.\nRadiators, being the primary means of shedding heat in space, were the most vulnerable and critical component of a ship. Ships only ever retracted them to prevent them from being harmed—or shot off. Over a colonized world, pulling in radiators was tantamount to a declaration of war.\nHe hailed the ships on the guard channel. “Attention, attention. This is JS Takao. You are in orbit over an inhabited surface. Retracting your radiators is against international law. Extend your radiators or you will be fired upon. This is your only warning.”\n“Sir, we’re being pinged by multiple lidar sources,” Mori said. “They’re from the bogies.”\n“Subaru, what’s the status of the main laser?”\n“Captain, the capacitors are fully charged and the firing solution is ready.”\nClusters of cylindrical objects decoupled from each of the spaceships and fired tiny chemical rockets, burning towards the moon.\n“Sir, bogies have ejected cargo pods,” Mori reported. “They are increasing acceleration to fifty milligees and are taking an escape vector.”\nWith fifty milligees of acceleration they could outrun most ships. But to Takao, they were slower than slugs.\n“Subaru, initiate solution.”\n“Initiating solution, ryoukai.”\nTakao sent an encoded laser pulse to the sunrays. Their boosters kicked out their payloads, and the smaller projectiles inflated their smart-matter mirrors. The mirror modules discharged their onboard capacitors, energizing the lenses to alter their shape and molecular structure to reflect UV-A beams. Takao unshuttered her main laser, situated in her nose, and unleashed a stream of pulses. Bouncing off the mirror, the invisible pulses drilled into Sierra 547.\nThe two main laser turrets alternated their fire, pausing just long enough to recharge their ultracapacitors. The lasers burned through the Q-ship’s engine. A ball of hot plasma erupted from the target’s rear. Secondary explosions followed, then tertiary explosions, and the ship broke apart.\nHoshi blinked. Ships do not blow up like that, not unless the laser punched all the way into the reactor. Takao’s laser couldn’t do that, not at this angle of attack.\nBut that didn’t matter now. He had a fight to win.\nPrometheus Control sent lasers snapping skywards, destroying as many pods as they could. The orbital patrol ships launched volleys of missiles, then closed into laser range. But there were too many pods and they could not get them all. The pods split open, dispersing their payloads.\nIn Hoshi’s display, huge numbers of red triangles popped into existence around the Q-ships, clustered so thick they formed a scarlet blanket. An alarm sounded.\n“Captain, threat radar!” Mori called. “Ninety-eight strikers and twenty buzzards are locked on to us!”\n“Chikusho!” Hoshi swore. “All hands, full guard, full guard!”\nAt the call, the entire crew snapped into action, following pre-established protocols. All non-essential systems and compartments shut down. Sato plotted the safest vector. Subaru directed his men to activate the point defenses. Nakamura activated the electronic warfare suite. Mori fed data to everybody as needed.\nPowered by miniature nuclear reactor engines, ninety-eight missiles sped in at a quarter gravity. As they closed in, Tanaka yelled, “All hands, side kick! Side kick!”\nTakao spun her gyroscopes, pointing her skywards. Her chemical maneuvering rockets fired, adding velocity to the turn, then fired again to cancel her momentum. The ship accelerated, burning for a higher orbit.\nThe missiles turned, trying to keep up. But the real threat was the twenty incoming drones. Fitted with nuclear gas-core rockets, they screamed in at one gravity, turning faster than Takao could, and fired barrages of smaller missiles from their coilguns.\n“Sir!” Nakamura called. “Buzzards match profile of Tiannu drones!”\nThe Tiannu drone was an armed drone employed by the Chinese Space Forces. It was also obsoleted a few years ago, and its sensors were vulnerable to modern electronic warfare.\nSome of the drones went berserk, firing blindly into empty space and chasing phantom targets. The point defense lasers burned down the rest. Takao continued spinning, giving her lasers a chance to cool off and recharge. The lasers fired low-powered pulses, melting sensors, electronics and payloads, sacrificing power for rate of fire. Many of the struck missiles detonated prematurely. More missiles spiraled away, confounded by the white noise in the air.\nBut dozens of threats survived to enter Takao’s kinetic engagement envelope.\n“Subaru! Snap shot bursters, snap shot guns! Tanaka, retract radiators!”\nThe ship rumbled. Twenty-four Type 82 missiles leapt from her missile banks. Scorching towards the threats, the warheads detonated into sprays of tungsten cubes, each striking with the force of a small bomb.\nThen Takao’s 60mm railguns fired. The guns churned out a barrage of fragmentation shells, placing an ocean of steel between Takao and the threats. The unguided flechettes disintegrated. The missiles tried to dodge. At this range, if the shells forced the missiles off a threat vector, it was as good as a kill.\nBut it was not enough. There were still too many missiles.\nTakao still had reserves. If he launched them Hoshi was certain Takao would survive. Unscathed, even. But he had his orders, and his duty was absolute. The weapons could only be fired under exceptional circumstances, and a counter-piracy mission was, by definition, not exceptional. He could not use them, even if it meant the death of his ship and his crew.\nHe would not use them even to save his own life.\n“Sir!” Subaru called. “Lasers have overheated!”\n“Tanaka, divert all available coolant to point defense! All hands, brace for impact!”\nEven as he spoke, twelve missiles survived to engagement range and detonated.\nThe lasers shut down completely. The railguns continued firing. They drew power from explosively pumped generators and had a separate coolant store, but were far less accurate than the lasers. Hoshi clenched his fists, watching tens of arrows close in on his ship.\nLong seconds later, the lasers returned to life. Together with the railguns, they plucked the darts from the sky. Tanaka pulled one last trick, firing the engine and maneuvering rockets. The superheated exhaust consumed every flechette that entered the plumes.\nBut it was not enough.\nThe lasers dropped their shutters. The guns got off a final barrage. Then dozens of flechettes crashed into the ship. Tortured metal screamed. The blasts slammed Hoshi into his seat. Sirens went off. Alerts popped up on his console.\n“Kamishiro,” Hoshi said, “damage report.”\nThe XO took a moment to check his boards. “Whipple shields compromised, no hull breaches. Forward missile cells damaged. Point Defense Laser Two reports damaged shutters, but not the turrets. No crew casualties.”\nHoshi heaved a sigh of relief. The enemy had loaded up with general-purpose flechettes. Hundreds could fit inside a warhead, but they lacked the punch to penetrate Takao’s armor.\nHe checked the display. The red blanket was rapidly dispersing. At some point, Sierra 549 had died in the hail of fire; she was now little more than debris and plasma. But the orbital patrol had been obliterated too, and so had the sunrays. And Sierra 548 and 550 were about to leave Titan orbit.\nHoshi wanted answers. At this angle, Takao’s lasers could punch through the enemies’ engines and into their reactors. But even civilian-grade compartment bulkheads would stop hypervelocity munitions.\n“Tanaka, extend radiators. Subaru, target the enemy ships’ engines with muskets.”\nTakao launched eight Type 83 missiles. These were fitted with anti-ship warheads, not the light flechettes Takao had endured. Her point defense lasers sent them soaring at the threats at three-quarters of a gravity.\nThe Q-ships couldn’t hope to outrun the missiles. But they had one last surprise. Hidden panels retracted, revealing automatic railguns. Two per ship.\n“Nani?” Hoshi muttered. What?\nEven as he spoke, the leading ship rained heavy metal down on the colony, while the other blasted at Takao and her missiles.\n“Tanaka, evasive maneuvers. Subaru, snipe the railguns with lasers,” Hoshi said. “Prioritize the ones firing on Prometheus.”\nTakao’s main laser discharged. Four shots later, the railguns blew apart. Then the point defense lasers kicked in, destroying the shells threatening Takao.\nPrometheus didn’t take the insult lightly either. A lance of light carved through the heart of Sierra 548. Another speared Sierra 550. Shortly after, the four surviving muskets fired their payloads, spewing clusters of segmented-rod penetrators optimized for defeating armor.\nThe threats tried to turn their drives on the incoming flechettes, but they were too slow. The darts slammed into their engines, blowing them out.\nMori said, “Sir, bandits have ceased acceleration. No escape pods. No further targets. We have a grand—”\nThe telescopes blanked out.\n“—slam?” Mori finished. “What the hell?”\nThe telescopes cleared. Sierras 548 and 550 were now rapidly expanding balls of plasma.\n“Nakamura? What the hell happened?” Hoshi demanded.\n“Looks like a reactor failure, sir. Mori, what’s in the vapor?”\n“Lieutenant, laser spectroscope is picking up deuterium, tritium and heavy metals. Definitely a catastrophic reactor failure.”\n“How likely is that to be from combat damage?” Hoshi asked.\n“Our penetrators shouldn’t have damaged the reactor deck,” Subaru said. “Maybe the Americans?”\n“Negative,” Mori said. “Spectroscope did not pick up fusion fuels following the laser strikes.”\n“Suicide trigger then?” Nakamura wondered. “But that doesn’t make sense. Pirates aren’t suicidal. Even most terrorists aren’t that crazy these days. They’d rather surrender if they can’t maneuver.”\nHoshi thought again of Sierra 547. The secondary explosions were plausible, if the laser had struck a capacitor bank. But tertiaries? Ships were compartmented to prevent just that. It shouldn’t be possible, unless someone, or something, deliberately induced a reactor failure.\nBut now wasn’t the time and place to ponder such things.\n“Gentlemen,” Hoshi said, “I’m sure we have plenty of questions. For now, we will secure from battle stations and clean up the skies.”\nHe had a very strong suspicion that this was not over. Not by a long shot.",
  "tags": [
    "books",
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-16T12:33:00+00:00"
}