{
  "url": "https://voxday.net/2017/09/13/legal-legion-update/",
  "scraped_at": "2025-12-19T10:23:37.994226",
  "title": "Legal Legion update",
  "date_display": "September 13, 2017",
  "date_iso": "2017-09-13T12:00:00+00:00",
  "date_from_url": "2017-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There have been a number of developments on the defamation front. First, a member of the Legal Legion of Evil has filed the petition in Travis County and the county clerk has approved the filing. Today a hearing will be scheduled, at which we will seek to be provided with the identity of 14 individuals presently identified only by username, and ask to depose a representative of Gab concerning matters related to the identity of said individuals.</p><p>According to other members of the Legal Legion who have been reviewing activity at Gab, there have been a considerable number of additional defamatory attacks, directed at me as well as at others, and we will be amending the petition accordingly to add additional examples and usernames until the hearing actually takes place.</p><p>Now that we have actually gone through the process, it is evident that Gab’s recommended path of “get a court order” is simply not viable for the average individual who doesn’t have lawyers and paralegals at his immediate disposal. The process is simply too expensive for most people; the court filing alone is over $300.</p><p>As one individual has already discovered, it is much easier and more cost-effective to simply contact the Australian registrar, Asia Registry, at abuse@asiaregistry.com. Unfortunately, rather than address the individual’s concerns, news that the abuse on his site was being reported led Andrew Torba to publicly threaten a campaign of harassment of the gentleman concerned.</p><p>Andrew TorbaPRO · @a<br><i>If our registrar requires us to remove something again we will publish it here and let everyone know that you whined to them because someone hurt your feelings with mean words on the internet.</i></br></p><p>However, in Australia, defamation is both a civil and a criminal offense, and Asia Registry’s terms of service say a website owner must ensure that the website, “is not comprised or is not used for any unlawful purpose or activity.”</p><p>So, if you have reason to believe you have been defamed on Gab, you can send me the link to the defamatory Gab post along with your real name and the username of the offender with the subject LL-ASIA. I will pass your email along to a member of the Legal Legion of Evil, who will review it and decide if it rises to the level of defamation, defamation per se, or criminal defamation according to Australian standards. If, in his opinion, it does, you will then be provided with an appropriate template that can be sent to the woman responsible for handling abuse-related complaints along with her email address.</p><p>Again, I will point out that it is not my intent to harm Gab. We are not requesting any damages from Gab and we do not anticipate any further legal action against them once we obtain the requested information about the parties responsible. As a number of VFM and Dread Ilk have noted, I am handling Gab with kid gloves, in part because they are young and inexperienced and they do not appear be receiving appropriate legal counsel. But I have made it very, very clear that the defamatory attacks on me are going to be removed, one way or another, and as always, I am not bluffing.</p><p>At this point, it should be clear to everyone that the Legal Legion of Evil is real. As it happens, the LLoE has over 200 years of collective experience practicing the law in various states in a surprisingly wide range of specialties. Including defamation.</p><p>I understand that not everyone is happy with my actions, and I understand that a few of my supporters are extremely unhappy with them. To them, I would merely point out that this is a problem Gab was <i>always </i>going to face. I first warned Andrew of Gab’s need for some form of moderation back in early November 2016. And contra the opinions of the free speech purists, extortion, treason, fraud, defamation, and death threats are not free speech, as the court process should suffice to make abundantly clear.</p><p>I am not at all unfamiliar with the way in which some individuals simply refuse to take the easy and obvious way out. I once spent three years to resolve a situation that could have been resolved, at <i>vastly </i>less expense, by sending me a simple one-paragraph letter. I hope it won’t take three years to resolve this one, but if it does, that possibility doesn’t bother me at all. I’ve been through it before, and if I have to, I will go through it again.</p></div>",
  "content_text": "There have been a number of developments on the defamation front. First, a member of the Legal Legion of Evil has filed the petition in Travis County and the county clerk has approved the filing. Today a hearing will be scheduled, at which we will seek to be provided with the identity of 14 individuals presently identified only by username, and ask to depose a representative of Gab concerning matters related to the identity of said individuals.\nAccording to other members of the Legal Legion who have been reviewing activity at Gab, there have been a considerable number of additional defamatory attacks, directed at me as well as at others, and we will be amending the petition accordingly to add additional examples and usernames until the hearing actually takes place.\nNow that we have actually gone through the process, it is evident that Gab’s recommended path of “get a court order” is simply not viable for the average individual who doesn’t have lawyers and paralegals at his immediate disposal. The process is simply too expensive for most people; the court filing alone is over $300.\nAs one individual has already discovered, it is much easier and more cost-effective to simply contact the Australian registrar, Asia Registry, at abuse@asiaregistry.com. Unfortunately, rather than address the individual’s concerns, news that the abuse on his site was being reported led Andrew Torba to publicly threaten a campaign of harassment of the gentleman concerned.\nAndrew TorbaPRO · @a\nIf our registrar requires us to remove something again we will publish it here and let everyone know that you whined to them because someone hurt your feelings with mean words on the internet.\nHowever, in Australia, defamation is both a civil and a criminal offense, and Asia Registry’s terms of service say a website owner must ensure that the website, “is not comprised or is not used for any unlawful purpose or activity.”\nSo, if you have reason to believe you have been defamed on Gab, you can send me the link to the defamatory Gab post along with your real name and the username of the offender with the subject LL-ASIA. I will pass your email along to a member of the Legal Legion of Evil, who will review it and decide if it rises to the level of defamation, defamation per se, or criminal defamation according to Australian standards. If, in his opinion, it does, you will then be provided with an appropriate template that can be sent to the woman responsible for handling abuse-related complaints along with her email address.\nAgain, I will point out that it is not my intent to harm Gab. We are not requesting any damages from Gab and we do not anticipate any further legal action against them once we obtain the requested information about the parties responsible. As a number of VFM and Dread Ilk have noted, I am handling Gab with kid gloves, in part because they are young and inexperienced and they do not appear be receiving appropriate legal counsel. But I have made it very, very clear that the defamatory attacks on me are going to be removed, one way or another, and as always, I am not bluffing.\nAt this point, it should be clear to everyone that the Legal Legion of Evil is real. As it happens, the LLoE has over 200 years of collective experience practicing the law in various states in a surprisingly wide range of specialties. Including defamation.\nI understand that not everyone is happy with my actions, and I understand that a few of my supporters are extremely unhappy with them. To them, I would merely point out that this is a problem Gab was\nalways\ngoing to face. I first warned Andrew of Gab’s need for some form of moderation back in early November 2016. And contra the opinions of the free speech purists, extortion, treason, fraud, defamation, and death threats are not free speech, as the court process should suffice to make abundantly clear.\nI am not at all unfamiliar with the way in which some individuals simply refuse to take the easy and obvious way out. I once spent three years to resolve a situation that could have been resolved, at\nvastly\nless expense, by sending me a simple one-paragraph letter. I hope it won’t take three years to resolve this one, but if it does, that possibility doesn’t bother me at all. I’ve been through it before, and if I have to, I will go through it again.",
  "tags": [
    "ELoE",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-13T11:00:00+00:00"
}