{
  "url": "https://voxday.net/2017/09/08/nazi-anti-white/",
  "scraped_at": "2025-12-19T10:22:56.562483",
  "title": "Nazi = anti-white",
  "date_display": "September 8, 2017",
  "date_iso": "2017-09-08T09:03:00+00:00",
  "date_from_url": "2017-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the great ironies of the Alt-Reich is that they claim to be National Socialists, some “ironically”, some not so much, while also claiming that “saving the white race” is their primary goal. However, this is akin to ants claiming that dressing up as anteaters and eating other ants is the way to save the ant species.</p><p>First, Hitler thought more highly of both the Asians and the Arabs than he did of most non-German whites. Second, the National Socialists actually planned to murder a statistically significant percentage of the white race, around 20 percent of it.</p><p>Generalplan Ost was the name of the project, which was intended to slaughter white people. Specifically, about 60 percent of all the Russians, Estonians, Latvians, Czechs, Ukrainians, Belarusians, Poles, and Lithuanians were to be killed or “deported” to Western Siberia. The Nazis literally planned to murder tens of millions of white people, but were prevented from doing so by losing the war to the <i>untermensch </i>Russians and the <i>mischling </i>Americans.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://cdn.brosome.com/wp-content/uploads/2010/04/Daniela-Pestova-7.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"480\" data-original-width=\"640\" decoding=\"async\" fetchpriority=\"high\" height=\"300\" src=\"http://cdn.brosome.com/wp-content/uploads/2010/04/Daniela-Pestova-7.jpg\" width=\"400\"/></a></div><div style=\"text-align: center;\"><i>The National Socialists planned to eliminate the Czechs. Like her.</i></div><p>From <a href=\"https://infogalactic.com/info/Generalplan_Ost\">Infogalactic</a>:</p><blockquote><p>The Generalplan Ost, abbreviated GPO, was the Nazi German government’s plan for the genocide and ethnic cleansing on a vast scale, and colonization of Central and Eastern Europe by Germans. It was to be undertaken in territories occupied by Germany during World War II. The plan was partially realized during the war, resulting indirectly and directly in a very large number of deaths, but its full implementation was not considered practicable during the major military operations, and was prevented by Germany’s defeat.</p><p>The plan entailed the enslavement, expulsion, and mass murder of most Slavic peoples in Europe along with planned destruction of their nations, whom the ‘Aryan’ Nazis viewed as racially inferior.The programme operational guidelines were based on the policy of Lebensraum designed by Adolf Hitler and the Nazi Party in fulfilment of the Drang nach Osten ideology of German expansionism. As such, it was intended to be a part of the New Order in Europe.</p><p>The Generalplan Ost proposal offered various percentages of the conquered or colonized people who were targeted for removal and physical destruction; the net effect of which would be to ensure that the conquered territories would become German. In ten years’ time, the plan effectively called for the extermination, expulsion, Germanization or enslavement of most or all East and West Slavs living behind the front lines of East-Central Europe. The “Small Plan” was to be put into practice as the Germans conquered the areas to the east of their pre-war borders. In this way the plan for Poland was drawn up at the end of November 1939 and is probably responsible for much of the World War II expulsion of Poles by Germany (first to colonial district of the General Government and, from 1942 also to Polenlager).</p></blockquote><p>There is nothing “pro-white” about National Socialism of any kind. Indeed, in light of the results of the Soviet occupation of Eastern Europe, it is clear that Communism, for all its tremendous flaws, is in practice more objectively pro-white than National Socialism.</p><p>Which is why anyone who claims to be a Nazi is intrinsically and always anti-white. The German National Socialist Worker’s Party was German supremacist imperialism, and as such, should be opposed by anyone who agrees with the ideas laid out in <a href=\"http://voxday.blogspot.com/2016/08/what-alt-right-is.html\">the 16 Points of the Alternative Right</a>. I know there are a number of young men who don’t know much about history, who are rightly concerned about the future of their people, but they need to learn their history, learn their culture, and realize that running around playing Fake Right Clown Nazi bantzing for the lulz will accomplish less than nothing in that regard.</p><p>Work out. Dress better. Get a job. Talk to a pretty girl. Read the Bible. Get married. Have children. Any one of those acts would be more genuinely revolutionary, and accomplish more towards saving the white race, than spending the next ten years Swastika Panty-larping.</p></div>",
  "content_text": "One of the great ironies of the Alt-Reich is that they claim to be National Socialists, some “ironically”, some not so much, while also claiming that “saving the white race” is their primary goal. However, this is akin to ants claiming that dressing up as anteaters and eating other ants is the way to save the ant species.\nFirst, Hitler thought more highly of both the Asians and the Arabs than he did of most non-German whites. Second, the National Socialists actually planned to murder a statistically significant percentage of the white race, around 20 percent of it.\nGeneralplan Ost was the name of the project, which was intended to slaughter white people. Specifically, about 60 percent of all the Russians, Estonians, Latvians, Czechs, Ukrainians, Belarusians, Poles, and Lithuanians were to be killed or “deported” to Western Siberia. The Nazis literally planned to murder tens of millions of white people, but were prevented from doing so by losing the war to the\nuntermensch\nRussians and the\nmischling\nAmericans.\nThe National Socialists planned to eliminate the Czechs. Like her.\nFrom\nInfogalactic\n:\nThe Generalplan Ost, abbreviated GPO, was the Nazi German government’s plan for the genocide and ethnic cleansing on a vast scale, and colonization of Central and Eastern Europe by Germans. It was to be undertaken in territories occupied by Germany during World War II. The plan was partially realized during the war, resulting indirectly and directly in a very large number of deaths, but its full implementation was not considered practicable during the major military operations, and was prevented by Germany’s defeat.\nThe plan entailed the enslavement, expulsion, and mass murder of most Slavic peoples in Europe along with planned destruction of their nations, whom the ‘Aryan’ Nazis viewed as racially inferior.The programme operational guidelines were based on the policy of Lebensraum designed by Adolf Hitler and the Nazi Party in fulfilment of the Drang nach Osten ideology of German expansionism. As such, it was intended to be a part of the New Order in Europe.\nThe Generalplan Ost proposal offered various percentages of the conquered or colonized people who were targeted for removal and physical destruction; the net effect of which would be to ensure that the conquered territories would become German. In ten years’ time, the plan effectively called for the extermination, expulsion, Germanization or enslavement of most or all East and West Slavs living behind the front lines of East-Central Europe. The “Small Plan” was to be put into practice as the Germans conquered the areas to the east of their pre-war borders. In this way the plan for Poland was drawn up at the end of November 1939 and is probably responsible for much of the World War II expulsion of Poles by Germany (first to colonial district of the General Government and, from 1942 also to Polenlager).\nThere is nothing “pro-white” about National Socialism of any kind. Indeed, in light of the results of the Soviet occupation of Eastern Europe, it is clear that Communism, for all its tremendous flaws, is in practice more objectively pro-white than National Socialism.\nWhich is why anyone who claims to be a Nazi is intrinsically and always anti-white. The German National Socialist Worker’s Party was German supremacist imperialism, and as such, should be opposed by anyone who agrees with the ideas laid out in\nthe 16 Points of the Alternative Right\n. I know there are a number of young men who don’t know much about history, who are rightly concerned about the future of their people, but they need to learn their history, learn their culture, and realize that running around playing Fake Right Clown Nazi bantzing for the lulz will accomplish less than nothing in that regard.\nWork out. Dress better. Get a job. Talk to a pretty girl. Read the Bible. Get married. Have children. Any one of those acts would be more genuinely revolutionary, and accomplish more towards saving the white race, than spending the next ten years Swastika Panty-larping.",
  "tags": [
    "#AltRetard",
    "#AltRight",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-08T08:03:00+00:00"
}