{
  "url": "https://voxday.net/2017/09/24/nfl-week-three-3/",
  "scraped_at": "2025-12-19T10:25:08.465216",
  "title": "NFL Week Three",
  "date_display": "September 24, 2017",
  "date_iso": "2017-09-24T17:15:00+00:00",
  "date_from_url": "2017-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not a lot to say, except I’m not watching this week. The players understand this is about the cultural war. So does the President. I’m not sure what percentage of the NFL-watching public does, but it does appear to be statistically significant if Twitter is any guide.</p><p>This sort of calculated and specific disrespect is not incidental. <a href=\"http://www.dailymail.co.uk/news/article-4914656/American-football-stars-drop-knees.html\">It is intentional</a>. Apparently all the Steelers but one boycotted the anthem. Yes, it’s just symbolism, but symbolism matters. The Right used to understand this. Bud Grant’s Vikings used to <i>practice </i>standing for the national anthem.</p><blockquote class=\"tr_bq\"><p>American football stars drop to their knees during national anthem at Wembley in protest defying Donald Trump after he said sportsman who ‘disrespect America’ should be SACKED. Players from Jacksonville Jaguars and the Baltimore Ravens dropped to their knees as national anthem played. No players were kneeling during the playing of ‘God Save The Queen’, which followed the US national anthem. </p></blockquote><p>Regardless, discuss either the protests or the weekend action, as you see fit.</p><p>How awesome would it be if Steelers owner Art Rooney released his entire team tomorrow, except for Alejandro Villanueva? Talk about making a statement! They could go winless for the next three years, and they’d still wind up ahead on the merchandise sales alone.</p><p><i>Skol Vikings!</i> I am reliably informed that Minnesota Vikings are the only team to not have a single player kneel for the anthem thus far. The legacy of Bud Grant remains strong.</p></div>",
  "content_text": "Not a lot to say, except I’m not watching this week. The players understand this is about the cultural war. So does the President. I’m not sure what percentage of the NFL-watching public does, but it does appear to be statistically significant if Twitter is any guide.\nThis sort of calculated and specific disrespect is not incidental.\nIt is intentional\n. Apparently all the Steelers but one boycotted the anthem. Yes, it’s just symbolism, but symbolism matters. The Right used to understand this. Bud Grant’s Vikings used to\npractice\nstanding for the national anthem.\nAmerican football stars drop to their knees during national anthem at Wembley in protest defying Donald Trump after he said sportsman who ‘disrespect America’ should be SACKED. Players from Jacksonville Jaguars and the Baltimore Ravens dropped to their knees as national anthem played. No players were kneeling during the playing of ‘God Save The Queen’, which followed the US national anthem.\nRegardless, discuss either the protests or the weekend action, as you see fit.\nHow awesome would it be if Steelers owner Art Rooney released his entire team tomorrow, except for Alejandro Villanueva? Talk about making a statement! They could go winless for the next three years, and they’d still wind up ahead on the merchandise sales alone.\nSkol Vikings!\nI am reliably informed that Minnesota Vikings are the only team to not have a single player kneel for the anthem thus far. The legacy of Bud Grant remains strong.",
  "tags": [
    "politics",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-24T16:15:00+00:00"
}