{
  "url": "https://voxday.net/2017/09/20/programmed-hate/",
  "scraped_at": "2025-12-19T10:24:33.697092",
  "title": "Programmed hate",
  "date_display": "September 20, 2017",
  "date_iso": "2017-09-20T12:03:00+00:00",
  "date_from_url": "2017-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anonymous Conservative explains why it is so vital for Trump, and other Republicans, <a href=\"https://www.anonymousconservative.com/blog/is-trump-going-to-sell-us-out-on-daca/\">not to cuck on immigration</a>:</p><blockquote><p>The real problem President Trump must grasp is, conservatives have become programmed over these last few presidential cycles, and this conditioning has imbued a specific set of neural pathways. Too many times, we have had a politician espouse conservative, anti-leftist ideals to us, we got in line to support him, and then he either turned around in office and reversed his position to support a leftist position, or he took a “moderate” pro-left tone in the campaign and never even made it into office.</p><p>As a result of this history, conservatives have a whole lot of hatred and rage-circuits burned into their brains, just waiting to be triggered by a perception of betrayal, and attached to whoever is seen as doing the betrayal. If Donald turns around, in what most conservatives perceive as a time of war, and legalizes 800,000 new democrat voters, those circuits will all fire up throughout the movement.</p><p>As the research shows, once you attach such an aversive stimulus pathway to a concept in the amygdala, you cannot destroy that neural pathway, unlike in other areas of the brain. An amygdala pathway which triggers aversive stimulus never degrades, unlike mere memory circuits. It is permanent. At most, with extensive deconditioning work, you can create a second suppressive-circuit to suppress the amygdala trigger, but that secondary pathway is always weak in its operation. The initial aversive stimulus is easily re-triggered through it – a circumstance which destroys the suppressive pathway, and fully reestablishes the trigger.</p><p>What this means is, from a cognitive neuroscience perspective, if Trump allows the DACA-recipients any sort of path to voting, a large swath of his base will suddenly have a very negative sensation attach to him related to betrayal. Once that pathway is there, all any subsequent opponent will need to do is press that betrayal button to elicit the sensation.</p><p>I voted for George Bush twice, and really liked him as a person. But when I think of how he destroyed the party to support democrats and polish his own “moderate” credentials, it doesn’t matter what he does going forward. Those angry sensations of betrayal and anger will rise, no matter how nice he may be, no matter what he does. He will now always elicit negative feelings in me, and I would never support him or his family again. For a more detailed discussion of that, ask President Jeb Bush about it.</p><p>In my opinion, George W Bush was actually worse for the future prospects of the Bush family than even his ultra-leftist father, because W. pretended to be one of us. We all knew H.W. was shaky. When he went left it was no surprise. But W. pretended to be a Texas conservative. When he ultimately refused to attack the left, let all their attacks go unanswered, and handed the Presidency to Obama, the violation of expectation of betrayal made the amygdala-pathway that formed so strong that the entire Bush dynasty was destroyed, and even the full backing of the Establishment could not resurrect it.</p><p>Then there is also the issue of all the conservatives who have been fighting with other conservatives, defending President Trump’s conservatism during the campaign. Others would say he was a New York liberal who was merely pandering on immigration, and would ultimately legalize all of those leftist voters and kill the party. If the President reverses his position, he destroys the credibility of his defenders within the conservative movement. That would be yet another betrayal.</p><p>This is a minefield which goes beyond mere persuasion. There comes a point where amygdala begins to become so high that persuasion is ineffective. If someone kills your entire family, you will have enough amygdala that they will never be able to use persuasion to change how you feel. For conservatives, America is being destroyed, freedom is waning rapidly, and it is all due to liberalism. Leftists now violently attack any conservative who speaks openly in public. Leftism is now an enemy which we view with as much hate as any enemy our nation has faced in history.</p></blockquote><p>He’s right. I am considerably more cool-tempered than most, I have no problem at all waiting extended periods of time to take my shots when necessary, and yet, there is literally nothing that any member of the Bush family, or any establishment Republican like Paul Ryan, can say that will allow me to even hear what they are saying. They might as well be Charlie Brown’s teacher as far as I am concerned. <i>Wuaah-wa-wuaah-wa-wuaah….</i></p><p>Their past behavior has rendered them literally incredible to me and millions of others on the Right. This is the real reason the Alternative Right is inevitable, because so many of us no longer find the conservative movement, or the Republican Party, to be even potentially persuasive.</p></div>",
  "content_text": "Anonymous Conservative explains why it is so vital for Trump, and other Republicans,\nnot to cuck on immigration\n:\nThe real problem President Trump must grasp is, conservatives have become programmed over these last few presidential cycles, and this conditioning has imbued a specific set of neural pathways. Too many times, we have had a politician espouse conservative, anti-leftist ideals to us, we got in line to support him, and then he either turned around in office and reversed his position to support a leftist position, or he took a “moderate” pro-left tone in the campaign and never even made it into office.\nAs a result of this history, conservatives have a whole lot of hatred and rage-circuits burned into their brains, just waiting to be triggered by a perception of betrayal, and attached to whoever is seen as doing the betrayal. If Donald turns around, in what most conservatives perceive as a time of war, and legalizes 800,000 new democrat voters, those circuits will all fire up throughout the movement.\nAs the research shows, once you attach such an aversive stimulus pathway to a concept in the amygdala, you cannot destroy that neural pathway, unlike in other areas of the brain. An amygdala pathway which triggers aversive stimulus never degrades, unlike mere memory circuits. It is permanent. At most, with extensive deconditioning work, you can create a second suppressive-circuit to suppress the amygdala trigger, but that secondary pathway is always weak in its operation. The initial aversive stimulus is easily re-triggered through it – a circumstance which destroys the suppressive pathway, and fully reestablishes the trigger.\nWhat this means is, from a cognitive neuroscience perspective, if Trump allows the DACA-recipients any sort of path to voting, a large swath of his base will suddenly have a very negative sensation attach to him related to betrayal. Once that pathway is there, all any subsequent opponent will need to do is press that betrayal button to elicit the sensation.\nI voted for George Bush twice, and really liked him as a person. But when I think of how he destroyed the party to support democrats and polish his own “moderate” credentials, it doesn’t matter what he does going forward. Those angry sensations of betrayal and anger will rise, no matter how nice he may be, no matter what he does. He will now always elicit negative feelings in me, and I would never support him or his family again. For a more detailed discussion of that, ask President Jeb Bush about it.\nIn my opinion, George W Bush was actually worse for the future prospects of the Bush family than even his ultra-leftist father, because W. pretended to be one of us. We all knew H.W. was shaky. When he went left it was no surprise. But W. pretended to be a Texas conservative. When he ultimately refused to attack the left, let all their attacks go unanswered, and handed the Presidency to Obama, the violation of expectation of betrayal made the amygdala-pathway that formed so strong that the entire Bush dynasty was destroyed, and even the full backing of the Establishment could not resurrect it.\nThen there is also the issue of all the conservatives who have been fighting with other conservatives, defending President Trump’s conservatism during the campaign. Others would say he was a New York liberal who was merely pandering on immigration, and would ultimately legalize all of those leftist voters and kill the party. If the President reverses his position, he destroys the credibility of his defenders within the conservative movement. That would be yet another betrayal.\nThis is a minefield which goes beyond mere persuasion. There comes a point where amygdala begins to become so high that persuasion is ineffective. If someone kills your entire family, you will have enough amygdala that they will never be able to use persuasion to change how you feel. For conservatives, America is being destroyed, freedom is waning rapidly, and it is all due to liberalism. Leftists now violently attack any conservative who speaks openly in public. Leftism is now an enemy which we view with as much hate as any enemy our nation has faced in history.\nHe’s right. I am considerably more cool-tempered than most, I have no problem at all waiting extended periods of time to take my shots when necessary, and yet, there is literally nothing that any member of the Bush family, or any establishment Republican like Paul Ryan, can say that will allow me to even hear what they are saying. They might as well be Charlie Brown’s teacher as far as I am concerned.\nWuaah-wa-wuaah-wa-wuaah….\nTheir past behavior has rendered them literally incredible to me and millions of others on the Right. This is the real reason the Alternative Right is inevitable, because so many of us no longer find the conservative movement, or the Republican Party, to be even potentially persuasive.",
  "tags": [
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-20T11:03:00+00:00"
}