{
  "url": "https://voxday.net/2017/09/12/real-alt-right/",
  "scraped_at": "2025-12-19T10:23:27.455210",
  "title": "Real Alt Right",
  "date_display": "September 12, 2017",
  "date_iso": "2017-09-12T09:42:00+00:00",
  "date_from_url": "2017-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s incredibly informative that one of the most devastating accusations that the Fake Right Swastika Wearing Jackasses can imagine is that <i>I stand by my friends and allies.</i> Pop quiz: what can we safely conclude about the socio-sexual rank of people who consider doing so to be, not only a negative, but one <a href=\"https://twitter.com/TruthNSausages/status/907445563985076224\">so damaging as to be meme-worthy</a>?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DJesvUXUEAAxoD7.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"516\" data-original-width=\"600\" decoding=\"async\" fetchpriority=\"high\" height=\"344\" src=\"https://pbs.twimg.com/media/DJesvUXUEAAxoD7.jpg\" width=\"400\"/></a></div><p>Milo stood by me when I made a media misstep that angered people at Breitbart. I stood by Milo when the media attempted to crucify him for his Joe Rogan interview and he lost his book deal with Simon &amp; Schuster. That’s what friends and allies do, even when the other individual is flawed, imperfect, or behaves in a suboptimal manner. And only a fool or a social reject abandons people over mere differences of opinion or the occasional moral failure.</p><p>The responses were amusing.</p><blockquote><p>Steve Autism‏@TruthNSausages<br>They DO know Vox was in the music business right?</br></p><p>Rusticus‏ @rusticusjunius<br>Wax Trax! Records for crying out loud.</br></p></blockquote><p>To say nothing of TVT. Anyhow, it has become abundantly clear that we right-wing omni-nationalists are the Real Alternative Right, the True Right. Because the Fake Right Clowns are not of the Right, do not believe in the Right-Left spectrum, and even openly claim that the historical ideological Right is entirely irrelevant today. Which, of course, <i>is precisely what makes them frauds and charlatans</i> when they attempt to market themselves as “right-wing” in order to appeal to young conservatives and libertarians, as well as disenchanted young liberals and leftists.</p><p>The Fake Right is every bit as deceitful and false as CNN. And they utilize the same “guilt-by-association” tactics as the mainstream media.</p><p>As for me, you can always expect me to stand by my friends, allies, authors, and readers. Even when they make mistakes. <i>Especially </i>when they make mistakes.</p></div>",
  "content_text": "It’s incredibly informative that one of the most devastating accusations that the Fake Right Swastika Wearing Jackasses can imagine is that\nI stand by my friends and allies.\nPop quiz: what can we safely conclude about the socio-sexual rank of people who consider doing so to be, not only a negative, but one\nso damaging as to be meme-worthy\n?\nMilo stood by me when I made a media misstep that angered people at Breitbart. I stood by Milo when the media attempted to crucify him for his Joe Rogan interview and he lost his book deal with Simon & Schuster. That’s what friends and allies do, even when the other individual is flawed, imperfect, or behaves in a suboptimal manner. And only a fool or a social reject abandons people over mere differences of opinion or the occasional moral failure.\nThe responses were amusing.\nSteve Autism‏@TruthNSausages\nThey DO know Vox was in the music business right?\nRusticus‏ @rusticusjunius\nWax Trax! Records for crying out loud.\nTo say nothing of TVT. Anyhow, it has become abundantly clear that we right-wing omni-nationalists are the Real Alternative Right, the True Right. Because the Fake Right Clowns are not of the Right, do not believe in the Right-Left spectrum, and even openly claim that the historical ideological Right is entirely irrelevant today. Which, of course,\nis precisely what makes them frauds and charlatans\nwhen they attempt to market themselves as “right-wing” in order to appeal to young conservatives and libertarians, as well as disenchanted young liberals and leftists.\nThe Fake Right is every bit as deceitful and false as CNN. And they utilize the same “guilt-by-association” tactics as the mainstream media.\nAs for me, you can always expect me to stand by my friends, allies, authors, and readers. Even when they make mistakes.\nEspecially\nwhen they make mistakes.",
  "tags": [
    "#AltRetard",
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-12T08:42:00+00:00"
}