{
  "url": "https://voxday.net/2017/09/09/rip-jerry-pournelle/",
  "scraped_at": "2025-12-19T10:23:07.618754",
  "title": "RIP Jerry Pournelle",
  "date_display": "September 9, 2017",
  "date_iso": "2017-09-09T13:33:00+00:00",
  "date_from_url": "2017-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>J. Lamplighter Wright recalls Jerry Pournelle’s last public performance at Dragoncon, where he gave out the Dragon Award for Best Science Fiction novel.</p><blockquote class=\"tr_bq\"><p>What Mr Pournelle did not tell you is that when he went up to hand out the award, he got a standing ovation. Everyone stood up…even Larry Niven. It wasn’t a big crowd, but it was a wonderful moment. I also noticed that, unlike everyone else who seemed to be reading the names, I could have sworn that Pournelle had his list memorized. He recited them smoothly while looking out at the audience.</p></blockquote><p>I’m so pleased to hear that he was publicly celebrated to the very end, as he deserved. My favorite memory of Mr. Pournelle was talking to him after the publication of <i>Riding the Red Horse</i>. At almost the last possible moment, he had agreed to let me use “His Truth Goes Marching On”, a story which had appeared in the first volume of <i>There Will Be War</i>, which <i>Riding the Red Horse</i> was consciously designed to imitate. I thought that would be a fitting symbol of the torch being passed from the one series to the next, since I had been unable to obtain the rights to the original anthology series.</p><p>Then, at absolutely the last possible moment, I happened to see an article written by him in an old issue of <i>The General</i>, which combined strategy, wargames, and game design. Excited to have discovered it, I shot him an email asking him for permission to republish it, which right he graciously granted. This is the introduction I wrote for it.</p><blockquote><p>Editor’s Introduction to:</p><p>SIMULATING THE ART OF WAR</p><p>by Jerry Pournelle</p><p>Science fiction’s gain was the game industry’s loss.</p><p>There are few, very few, readers of this anthology who do not know of Jerry Pournelle, the science fiction writer. Nearly everyone has heard of the author of <i>Jannissaries </i>and <i>The Mote in God’s Eye</i>, the editor of many anthologies, the techno-savvy <i>Byte </i>columnist, the SFWA president, the Lord of Chaos Manor, even the aphorist who coined the Iron Law of Bureaucracy.<br><i><br/></i><i>In any bureaucracy, the people devoted to the benefit of the bureaucracy itself always get in control and those dedicated to the goals the bureaucracy is supposed to accomplish have less and less influence, and sometimes are eliminated entirely.</i></br></p><p>But there are not very many who know of J.E. Pournelle, Ph.D., wargamer, and particular fan of the classic Avalon Hill game <i>Afrika Korps</i>. In the early 1970s, Jerry was also an occasional contributor to the Avalon Hill house magazine, <i>The General</i>, in which he introduced new rules for Waterloo, conceived an clever device for counter concealment that anticipated<i> Fifth Frontier War</i>‘s Fleet rules by a decade, and penned an astute article explaining how to draw upon the timeless Principles of War for the purposes of designing better wargames.</p><p>Alas, it is a lesson that few designers in the industry have taken to heart. These little-known facts may be reasonably cited as evidence that Dr. Pangloss was wrong, and we do not, in fact, live in the best of all possible worlds. After all, we narrowly missed living in a world where J.E. Pournelle designed <i>Halo: Combat Evolved</i>!</p></blockquote><p>But the best part was yet to come. Not long after the publication of <i>Riding the Red Horse</i>, Jerry called me up and said, “You know, maybe it would be a good idea to revive <i>There Will Be War</i>. Would you have any interest in bringing that back into print?”</p><p>I did my best to remain calm, refrained from mentioning that obtaining the rights to publish <i>There Will Be War</i> had always been my original desire, and informed him that we would be <i>extremely </i>pleased to do so. I am very sorry that we were unable to get the last two original volumes, Vols VII and VIII, out before his death, but they will be released later this month, and at least Jerry was able to see his flagship anthology fully revived with Volume X last year. As I said before, working with him was both an honor and a privilege.</p><p>Please feel free to post your remembrances of Dr. Pournelle and his work here. Beginning tomorrow, Castalia House will honor Jerry Pournelle by making the first volume in his classic military science fiction anthology, <i><b><a href=\"http://amzn.to/1tpzQu2\">There Will Be War Vol. I</a></b>  </i>a free download on Amazon for three days. Also, Chaos Manor has set up <a href=\"https://www.jerrypournelle.com/chaosmanor/well-wishing/\">a Well-Wishing Page</a> in case you wish to offer the Pournelle family your condolences.</p></div>",
  "content_text": "J. Lamplighter Wright recalls Jerry Pournelle’s last public performance at Dragoncon, where he gave out the Dragon Award for Best Science Fiction novel.\nWhat Mr Pournelle did not tell you is that when he went up to hand out the award, he got a standing ovation. Everyone stood up…even Larry Niven. It wasn’t a big crowd, but it was a wonderful moment. I also noticed that, unlike everyone else who seemed to be reading the names, I could have sworn that Pournelle had his list memorized. He recited them smoothly while looking out at the audience.\nI’m so pleased to hear that he was publicly celebrated to the very end, as he deserved. My favorite memory of Mr. Pournelle was talking to him after the publication of\nRiding the Red Horse\n. At almost the last possible moment, he had agreed to let me use “His Truth Goes Marching On”, a story which had appeared in the first volume of\nThere Will Be War\n, which\nRiding the Red Horse\nwas consciously designed to imitate. I thought that would be a fitting symbol of the torch being passed from the one series to the next, since I had been unable to obtain the rights to the original anthology series.\nThen, at absolutely the last possible moment, I happened to see an article written by him in an old issue of\nThe General\n, which combined strategy, wargames, and game design. Excited to have discovered it, I shot him an email asking him for permission to republish it, which right he graciously granted. This is the introduction I wrote for it.\nEditor’s Introduction to:\nSIMULATING THE ART OF WAR\nby Jerry Pournelle\nScience fiction’s gain was the game industry’s loss.\nThere are few, very few, readers of this anthology who do not know of Jerry Pournelle, the science fiction writer. Nearly everyone has heard of the author of\nJannissaries\nand\nThe Mote in God’s Eye\n, the editor of many anthologies, the techno-savvy\nByte\ncolumnist, the SFWA president, the Lord of Chaos Manor, even the aphorist who coined the Iron Law of Bureaucracy.\nIn any bureaucracy, the people devoted to the benefit of the bureaucracy itself always get in control and those dedicated to the goals the bureaucracy is supposed to accomplish have less and less influence, and sometimes are eliminated entirely.\nBut there are not very many who know of J.E. Pournelle, Ph.D., wargamer, and particular fan of the classic Avalon Hill game\nAfrika Korps\n. In the early 1970s, Jerry was also an occasional contributor to the Avalon Hill house magazine,\nThe General\n, in which he introduced new rules for Waterloo, conceived an clever device for counter concealment that anticipated\nFifth Frontier War\n‘s Fleet rules by a decade, and penned an astute article explaining how to draw upon the timeless Principles of War for the purposes of designing better wargames.\nAlas, it is a lesson that few designers in the industry have taken to heart. These little-known facts may be reasonably cited as evidence that Dr. Pangloss was wrong, and we do not, in fact, live in the best of all possible worlds. After all, we narrowly missed living in a world where J.E. Pournelle designed\nHalo: Combat Evolved\n!\nBut the best part was yet to come. Not long after the publication of\nRiding the Red Horse\n, Jerry called me up and said, “You know, maybe it would be a good idea to revive\nThere Will Be War\n. Would you have any interest in bringing that back into print?”\nI did my best to remain calm, refrained from mentioning that obtaining the rights to publish\nThere Will Be War\nhad always been my original desire, and informed him that we would be\nextremely\npleased to do so. I am very sorry that we were unable to get the last two original volumes, Vols VII and VIII, out before his death, but they will be released later this month, and at least Jerry was able to see his flagship anthology fully revived with Volume X last year. As I said before, working with him was both an honor and a privilege.\nPlease feel free to post your remembrances of Dr. Pournelle and his work here. Beginning tomorrow, Castalia House will honor Jerry Pournelle by making the first volume in his classic military science fiction anthology,\nThere Will Be War Vol. I\na free download on Amazon for three days. Also, Chaos Manor has set up\na Well-Wishing Page\nin case you wish to offer the Pournelle family your condolences.",
  "tags": [
    "CastaliaHouse",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-09T12:33:00+00:00"
}