{
  "url": "https://voxday.net/2017/09/24/sjwadd-excerpt/",
  "scraped_at": "2025-12-19T10:25:11.406837",
  "title": "SJWADD excerpt",
  "date_display": "September 24, 2017",
  "date_iso": "2017-09-24T23:56:00+00:00",
  "date_from_url": "2017-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unearthed this beautiful example of an SJW tactic just today. Watching SJWs attempt to babble incoherently about logic is rather like watching monkeys chewing the covers off of books and bragging how they’ve totally got this “reading” thing down.</p><blockquote><p>Andrew Flick‏ @AndrewFlick87<br>So many logical fallacies here.</br></p><p>Supreme Dark Lord‏ @voxday<br>Name them. Specifically. Is it Ambiguity, Amphiboly, Combination, Division… wait, is it Accent?</br></p><p>Andrew Flick‏ @AndrewFlick87<br>Btw False equivalence is a logical fallacy in which two opposing arguments appear to be logically equivalent when they are not.</br></p><p>Supreme Dark Lord‏ @voxday<br>Yes, but that does not apply here. Where does the equivalence fail? Moreover, you said there were “so many” logical fallacies. How many, 8?</br></p><p>Andrew Flick‏ @AndrewFlick87<br>Promoting hate speech and promoting upholding of civil rights are not equivalent. Also, suck a big fat cock and choke on it. Have a nice day</br></p></blockquote><p>And… flounce! Perfect. Absolutely perfect. There is plenty of this sort of thing, and more, in the forthcoming <a href=\"https://www.amazon.com/gp/product/B075BGGKLG\"><i><b>SJWs Always Double Down</b></i></a>.</p></div>",
  "content_text": "Unearthed this beautiful example of an SJW tactic just today. Watching SJWs attempt to babble incoherently about logic is rather like watching monkeys chewing the covers off of books and bragging how they’ve totally got this “reading” thing down.\nAndrew Flick‏ @AndrewFlick87\nSo many logical fallacies here.\nSupreme Dark Lord‏ @voxday\nName them. Specifically. Is it Ambiguity, Amphiboly, Combination, Division… wait, is it Accent?\nAndrew Flick‏ @AndrewFlick87\nBtw False equivalence is a logical fallacy in which two opposing arguments appear to be logically equivalent when they are not.\nSupreme Dark Lord‏ @voxday\nYes, but that does not apply here. Where does the equivalence fail? Moreover, you said there were “so many” logical fallacies. How many, 8?\nAndrew Flick‏ @AndrewFlick87\nPromoting hate speech and promoting upholding of civil rights are not equivalent. Also, suck a big fat cock and choke on it. Have a nice day\nAnd… flounce! Perfect. Absolutely perfect. There is plenty of this sort of thing, and more, in the forthcoming\nSJWs Always Double Down\n.",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-24T22:56:00+00:00"
}