{
  "url": "https://voxday.net/2017/09/02/some-things-dont-change/",
  "scraped_at": "2025-12-19T10:22:20.759213",
  "title": "Some things don’t change",
  "date_display": "September 2, 2017",
  "date_iso": "2017-09-02T22:55:00+00:00",
  "date_from_url": "2017-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://file770.com/?p=37355\">Mike Glyer reports</a> that someone named Steve J. Wright is “reviewing” A Throne of Bones the way atheists used to do chapter-by-chapter “reviews” of TIA:</p><blockquote><p>Steve J. Wright has assigned himself the quest of reading and blogging about Vox Day’s epic fantasy novel A Throne of Bones and has written half-a-dozen posts this past week. The first is: A Throne of Bones by “Vox Day” – Preamble, on Managing Expectations. Wright doesn’t think much of the writer either as a storyteller or a technician, and all the posts come at the book at an angle similar to this passage in the third post, A Throne of Bones – Chapter 1:</p><p><i>Well.  Basically, in this chapter, Beale is managing to do a little with a lot – his style continues to be ponderous, awkward and clunky, nothing very much happens, and the deficiencies of style lead to the failure of his attempts at characterization – Corvus is clearly meant to be a super-competent military commander, but his laboured and over-long dialogue make him come across as a pompous old windbag instead.</i></p><p>I think that’s the trap – Wright is giving a solid, honest review of something he doesn’t find very interesting. And it’s contagious. When a fanwriter feels contempt for the material he’s discussing, the only way to win is to treat it humorously, because otherwise an audience finds it wearing to keep reading someone taking a superior point of view.</p></blockquote><p>I mentioned this before, and when I did, I was thinking this all reminded me of something else, though. Then, when I saw Glyer’s reference to it, the recollection hit me, almost entirely unlike a cheetah. What it reminded me of is <a href=\"http://www.revolutionsf.com/article.php?id=953\">Michael Moorcock’s nominal critique of Tolkien</a>, although, as we know, Moorcock was really just whining about the fact that nearly everyone who is literate prefers Tolkien’s books to his own tedious, poorly-plotted, scrawny little “epics”. And even those who aren’t literate would definitely prefer a <i>Lord of the Rings</i> movie to an <i>Elric </i>one.</p><p>Can you even imagine the latter? Ninety minutes of an albino, probably played by Idris Elba these days, repeatedly alternating between self-serving betrayals and self-pitying bouts of weeping. Moorcock’s work didn’t even rise to the level of Harry freaking Potter, never mind the lasting epic greatness of Tolkien.</p><blockquote><p>The sort of prose most often identified with “high” fantasy is the prose of the nursery-room. It is a lullaby; it is meant to soothe and console. It is mouth-music. It is frequently enjoyed not for its tensions but for its lack of tensions. It coddles; it makes friends with you; it tells you comforting lies….</p><p>The Lord of the Rings is much more deep-rooted in its infantilism than a good many of the more obviously juvenile books it influenced. It is Winnie-the-Pooh posing as an epic. If the Shire is a suburban garden, Sauron and his henchmen are that old bourgeois bugaboo, the Mob – mindless football supporters throwing their beer-bottles over the fence the worst aspects of modern urban society represented as the whole by a fearful, backward-yearning class for whom “good taste” is synonymous with “restraint” (pastel colours, murmured protest) and “civilized” behaviour means “conventional behaviour in all circumstances”. This is not to deny that courageous characters are found in The Lord of the Rings, or a willingness to fight Evil (never really defined), but somehow those courageous characters take on the aspect of retired colonels at last driven to write a letter to The Times and we are not sure – because Tolkien cannot really bring himself to get close to his proles and their satanic leaders – if Sauron and Co. are quite as evil as we’re told. After all, anyone who hates hobbits can’t be all bad.</p></blockquote><p>You can always tell when gammas with literary ambitions have it in for an author that normal people like. They hone in on the “prose” and the “style” like lasers, because literary style is a sufficiently nebulous and subjective subject to let them natter on about it without risking being disproven. I’ve only seen one of his posts – I have no use for criticism that is not substantive – and saw he had already committed two major howlers with regards to military history and the use of magic. He’d be wise to stick to complaining about the style, which no one has ever claimed is any better than “workmanlike”. Including me.</p><p>But let the critics natter on, by all means. This is a big step forward from simply being ignored. The more hate from these circles, the better. I expect that in another few years, they’ll start hedging their bets by starting to mention a few of the positive aspects that presently manage to escape their collective notice. And it would certainly be ironic, to say nothing of highly amusing, if Mr. Wright’s take eventually proved to be as much of an obvious joke as Mr. Moorcock’s.</p><p>What’s interesting about all this is that someone who shall remain nameless to protect his reputation, but is a Respected and Well-Known Name in science fiction and fantasy circles, told me some years ago that he expected I would eventually become a leading fantasy writer. I’m not there yet, to be sure, but the notion is considerably less ridiculous than it appeared at the time. I have to admit, I scoffed at it myself, not out of humility, but out of a recognition of my stylistic limitations. Of course, since then, I’ve learned that style is only one of the four major components of a novel, and it is far from the most important one. No one reads Eco or Murakami or Tolkien for their literary styles. If I’m very fortunate, perhaps one day someone will write a hate-review called “The Dichotomy of Day” about me <a href=\"https://www.theatlantic.com/magazine/archive/2014/09/the-mystery-of-murakami/375064/\">in <i>The Atlantic</i></a> instead of merely posting it on a personal blog.</p><p>Anyhow, should you wish to judge my “ponderous, awkward and clunky” style for yourself, <b><i><a href=\"http://amzn.to/20HuZhV\">Summa Elvetica &amp; Other Stories</a></i></b> is still free.</p></div>",
  "content_text": "Mike Glyer reports\nthat someone named Steve J. Wright is “reviewing” A Throne of Bones the way atheists used to do chapter-by-chapter “reviews” of TIA:\nSteve J. Wright has assigned himself the quest of reading and blogging about Vox Day’s epic fantasy novel A Throne of Bones and has written half-a-dozen posts this past week. The first is: A Throne of Bones by “Vox Day” – Preamble, on Managing Expectations. Wright doesn’t think much of the writer either as a storyteller or a technician, and all the posts come at the book at an angle similar to this passage in the third post, A Throne of Bones – Chapter 1:\nWell.  Basically, in this chapter, Beale is managing to do a little with a lot – his style continues to be ponderous, awkward and clunky, nothing very much happens, and the deficiencies of style lead to the failure of his attempts at characterization – Corvus is clearly meant to be a super-competent military commander, but his laboured and over-long dialogue make him come across as a pompous old windbag instead.\nI think that’s the trap – Wright is giving a solid, honest review of something he doesn’t find very interesting. And it’s contagious. When a fanwriter feels contempt for the material he’s discussing, the only way to win is to treat it humorously, because otherwise an audience finds it wearing to keep reading someone taking a superior point of view.\nI mentioned this before, and when I did, I was thinking this all reminded me of something else, though. Then, when I saw Glyer’s reference to it, the recollection hit me, almost entirely unlike a cheetah. What it reminded me of is\nMichael Moorcock’s nominal critique of Tolkien\n, although, as we know, Moorcock was really just whining about the fact that nearly everyone who is literate prefers Tolkien’s books to his own tedious, poorly-plotted, scrawny little “epics”. And even those who aren’t literate would definitely prefer a\nLord of the Rings\nmovie to an\nElric\none.\nCan you even imagine the latter? Ninety minutes of an albino, probably played by Idris Elba these days, repeatedly alternating between self-serving betrayals and self-pitying bouts of weeping. Moorcock’s work didn’t even rise to the level of Harry freaking Potter, never mind the lasting epic greatness of Tolkien.\nThe sort of prose most often identified with “high” fantasy is the prose of the nursery-room. It is a lullaby; it is meant to soothe and console. It is mouth-music. It is frequently enjoyed not for its tensions but for its lack of tensions. It coddles; it makes friends with you; it tells you comforting lies….\nThe Lord of the Rings is much more deep-rooted in its infantilism than a good many of the more obviously juvenile books it influenced. It is Winnie-the-Pooh posing as an epic. If the Shire is a suburban garden, Sauron and his henchmen are that old bourgeois bugaboo, the Mob – mindless football supporters throwing their beer-bottles over the fence the worst aspects of modern urban society represented as the whole by a fearful, backward-yearning class for whom “good taste” is synonymous with “restraint” (pastel colours, murmured protest) and “civilized” behaviour means “conventional behaviour in all circumstances”. This is not to deny that courageous characters are found in The Lord of the Rings, or a willingness to fight Evil (never really defined), but somehow those courageous characters take on the aspect of retired colonels at last driven to write a letter to The Times and we are not sure – because Tolkien cannot really bring himself to get close to his proles and their satanic leaders – if Sauron and Co. are quite as evil as we’re told. After all, anyone who hates hobbits can’t be all bad.\nYou can always tell when gammas with literary ambitions have it in for an author that normal people like. They hone in on the “prose” and the “style” like lasers, because literary style is a sufficiently nebulous and subjective subject to let them natter on about it without risking being disproven. I’ve only seen one of his posts – I have no use for criticism that is not substantive – and saw he had already committed two major howlers with regards to military history and the use of magic. He’d be wise to stick to complaining about the style, which no one has ever claimed is any better than “workmanlike”. Including me.\nBut let the critics natter on, by all means. This is a big step forward from simply being ignored. The more hate from these circles, the better. I expect that in another few years, they’ll start hedging their bets by starting to mention a few of the positive aspects that presently manage to escape their collective notice. And it would certainly be ironic, to say nothing of highly amusing, if Mr. Wright’s take eventually proved to be as much of an obvious joke as Mr. Moorcock’s.\nWhat’s interesting about all this is that someone who shall remain nameless to protect his reputation, but is a Respected and Well-Known Name in science fiction and fantasy circles, told me some years ago that he expected I would eventually become a leading fantasy writer. I’m not there yet, to be sure, but the notion is considerably less ridiculous than it appeared at the time. I have to admit, I scoffed at it myself, not out of humility, but out of a recognition of my stylistic limitations. Of course, since then, I’ve learned that style is only one of the four major components of a novel, and it is far from the most important one. No one reads Eco or Murakami or Tolkien for their literary styles. If I’m very fortunate, perhaps one day someone will write a hate-review called “The Dichotomy of Day” about me\nin\nThe Atlantic\ninstead of merely posting it on a personal blog.\nAnyhow, should you wish to judge my “ponderous, awkward and clunky” style for yourself,\nSumma Elvetica & Other Stories\nis still free.",
  "tags": [
    "BookReview",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-02T21:55:00+00:00"
}