{
  "url": "https://voxday.net/2017/09/15/stop-encouraging-young-writers/",
  "scraped_at": "2025-12-19T10:23:54.780957",
  "title": "Stop encouraging young writers!",
  "date_display": "September 15, 2017",
  "date_iso": "2017-09-15T08:38:00+00:00",
  "date_from_url": "2017-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A heartfelt plea from a woman writer over 40 to <a href=\"https://www.theguardian.com/books/booksblog/2017/sep/08/all-the-awards-for-young-writers-amount-to-discrimination\">stop recognizing people who are not her</a>:</p><blockquote><p>A few years ago I wrote an article for the Guardian on ageism in the literary world, about the predilection of publications like Granta, the New Yorker and Buzzfeed for authors under the age of 40. The problem hasn’t gone away and on Tuesday I wrote an open letter to the Royal Society of Literature, after it called for nominations for 40 new fellows under 40.</p><p>Encouraging young writers is laudable. After all, it’s increasingly difficult to get started. Publishers’ advances are low and getting lower; arts degrees are more expensive than Stem subjects; social security is fiercely tested. Which must mean that those most able to pay for a writing course, or those most able to take time off work to write while still young, are those most likely to have money, security, contacts, confidence. There’s a correlation between setting an age bar and encouraging the already privileged.</p><p>All writers were young once, and many start writing young, but not all begin their careers as published authors at that point. Leaving aside the fact that some only decide to start writing later in life, many factors affect one’s ability to commit to writing seriously. Besides income issues, age bars can lead an organisation into worrying territory. Authors from outside the perceived cultural mainstream who do not already see their voices represented – LGBTQ writers, writers of colour – are sometimes slow to recognise the contribution they can make, or to feel like their voices will be valued.</p><p>Age is a feminist issue. Carers, delayed by years looking after children or other dependents, are mostly women; residencies that offer no childcare or require long stays are an easy way to sift female candidates out of contention. Older women are already told every day, in ways ranging from the subtle to the blatant, that they are irrelevant and should shut up. Multiply this by, say, race or gender, and the courage required to put work out is even greater. Or the potential writer might not be the carer, but the cared-for. Writers who live with a disability or ill-health may not start out until they have found a way to write with their condition – which may take longer than this 40-years-old rule allows for.</p><p>Since writing to the RSL, I’ve been sent heartrending accounts from well-published writers, several of whom specified that it wasn’t until their late 30s that they were finally able to take the time to write, making age bar of 40 not only arbitrary, but a particularly cruel irony.</p></blockquote><p>Wow just wow! First, I am, of course, appalled by the writer’s unpersoning and excision from the social justice movement of so many sexualities. It’s fine to defend Lesbian, Gay, Bisexual, Transgender, and Queer writers, but what about those who are Genderqueer, Demisexual, Transsexual, Twospirit, Intersex, Questioning, Asexual, Allies, Pansexual, and Polyamorous? If she doesn’t support LGGBDTTTIQQAAPP in its entirety, she is clearly a bigot, a hater, and she should never be published by any socially responsible publisher.</p><p>Second, what, exactly, is the point of her article? Should we not recognize young writers at all and attempt to identify the most promising? Actually, that’s not a bad idea, since the convergence of most writing awards and institutions means that they’re only promoting callow SJW droppings anyhow.</p><p>But I suspect that she wants to make elderly female and diversity writers eligible for young author awards, never mind the fact that first-time novelists of any age are honored by awards such as the  John W. Campbell Award for Best New Writer. What we have here is merely a literary spin on Sailer’s Law of Female Journalism: <i>The most heartfelt articles by female journalists tend to be demands that social values be overturned in order that, Come the Revolution, the journalist herself will be considered hotter-looking.</i><br><i><br/></i>Or, as in this case, an award-winning writer.</br></p><p>I have to admit it, I’m going to be genuinely sorry when <i>The Guardian</i> finally finishes burning through its once-massive endowment and goes out of business. It’s genuinely funnier than <i>The Onion</i>.</p></div>",
  "content_text": "A heartfelt plea from a woman writer over 40 to\nstop recognizing people who are not her\n:\nA few years ago I wrote an article for the Guardian on ageism in the literary world, about the predilection of publications like Granta, the New Yorker and Buzzfeed for authors under the age of 40. The problem hasn’t gone away and on Tuesday I wrote an open letter to the Royal Society of Literature, after it called for nominations for 40 new fellows under 40.\nEncouraging young writers is laudable. After all, it’s increasingly difficult to get started. Publishers’ advances are low and getting lower; arts degrees are more expensive than Stem subjects; social security is fiercely tested. Which must mean that those most able to pay for a writing course, or those most able to take time off work to write while still young, are those most likely to have money, security, contacts, confidence. There’s a correlation between setting an age bar and encouraging the already privileged.\nAll writers were young once, and many start writing young, but not all begin their careers as published authors at that point. Leaving aside the fact that some only decide to start writing later in life, many factors affect one’s ability to commit to writing seriously. Besides income issues, age bars can lead an organisation into worrying territory. Authors from outside the perceived cultural mainstream who do not already see their voices represented – LGBTQ writers, writers of colour – are sometimes slow to recognise the contribution they can make, or to feel like their voices will be valued.\nAge is a feminist issue. Carers, delayed by years looking after children or other dependents, are mostly women; residencies that offer no childcare or require long stays are an easy way to sift female candidates out of contention. Older women are already told every day, in ways ranging from the subtle to the blatant, that they are irrelevant and should shut up. Multiply this by, say, race or gender, and the courage required to put work out is even greater. Or the potential writer might not be the carer, but the cared-for. Writers who live with a disability or ill-health may not start out until they have found a way to write with their condition – which may take longer than this 40-years-old rule allows for.\nSince writing to the RSL, I’ve been sent heartrending accounts from well-published writers, several of whom specified that it wasn’t until their late 30s that they were finally able to take the time to write, making age bar of 40 not only arbitrary, but a particularly cruel irony.\nWow just wow! First, I am, of course, appalled by the writer’s unpersoning and excision from the social justice movement of so many sexualities. It’s fine to defend Lesbian, Gay, Bisexual, Transgender, and Queer writers, but what about those who are Genderqueer, Demisexual, Transsexual, Twospirit, Intersex, Questioning, Asexual, Allies, Pansexual, and Polyamorous? If she doesn’t support LGGBDTTTIQQAAPP in its entirety, she is clearly a bigot, a hater, and she should never be published by any socially responsible publisher.\nSecond, what, exactly, is the point of her article? Should we not recognize young writers at all and attempt to identify the most promising? Actually, that’s not a bad idea, since the convergence of most writing awards and institutions means that they’re only promoting callow SJW droppings anyhow.\nBut I suspect that she wants to make elderly female and diversity writers eligible for young author awards, never mind the fact that first-time novelists of any age are honored by awards such as the  John W. Campbell Award for Best New Writer. What we have here is merely a literary spin on Sailer’s Law of Female Journalism:\nThe most heartfelt articles by female journalists tend to be demands that social values be overturned in order that, Come the Revolution, the journalist herself will be considered hotter-looking.\nOr, as in this case, an award-winning writer.\nI have to admit it, I’m going to be genuinely sorry when\nThe Guardian\nfinally finishes burning through its once-massive endowment and goes out of business. It’s genuinely funnier than\nThe Onion\n.",
  "tags": [
    "books",
    "media",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-15T07:38:00+00:00"
}