{
  "url": "https://voxday.net/2017/09/17/thats-not-encouraging/",
  "scraped_at": "2025-12-19T10:24:09.757932",
  "title": "That’s not encouraging",
  "date_display": "September 17, 2017",
  "date_iso": "2017-09-17T09:42:00+00:00",
  "date_from_url": "2017-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sebastien Gorka tries to tell the anti-immigration Right <a href=\"https://amgreatness.com/2017/09/16/gorka-daca-trumps-war-gop-establishment2/?utm_term=TheDeplorables\">to settle down about DACA</a>, but in doing so, illustrates that neither he nor the President truly grasp its position.</p><blockquote><p><b>Gorka:</b> “Take a deep breath, and wait a day.” Sure enough, less than a day, nine hours later, we have the counterpoint from the press secretary and from the President himself. Look, having worked for the man, let me tell you that it’s neither of the options that you, or scenarios that you have painted. He knows, he knows why he is the president. He knows that the first policy issue that catapulted him into preeminence as a presidential candidate was the border, was immigration. He knows that when Jeff Sessions put on that hat, Jeff Sessions was bringing his stance on illegal immigration to his campaign to set him apart from the 16 other hackneyed establishment candidates the GOP had arrayed against him. The president’s not gonna go back.</p><p>The other scenario is also fallacious. I love reading how we have these uber-Trumpsters… Look, I’m here to support the president inside the White House or outside the White House. If I read another article on how the president is doing 48-dimensional chess…</p><p><b>Buskirk:</b> Right.</p><p><b>Gorka:</b> It’s just, no, he doesn’t do that. He’s not some kind of uber-Machiavellian operator. He is an instinctual actor, a masterful … But he’s not plotting a … Steve Bannon is the fifth dimensional Vulcan, OK? That’s how Steve Bannon operates. He is the super strategist. The president, and that’s why Steve and the president work so well together, the president, as we’ve discussed, is this present, natural, instinctual actor. He goes into these meetings in ways that the swamp doesn’t. Of course, they tweeted the second they got out of the Oval, because they’re politicians and they want to get reelected. The president doesn’t think like that. He’s thinking about the American interest, and at the end of the day, he is not going to sell us up the river, I tell you that.</p><p><b>Buskirk:</b> Okay, so look, that’s extremely helpful. That’s why I really wanted to talk to you. You know the president as well as anybody, way better than most. What’s your understanding of what happened? What do you think is the right way to think about it?</p><p><b>Gorka:</b> Okay, so two things are important. The way I explain what’s happened in the last seven days is the following. Number one, the original response to DACA from the president is quintessential Donald Trump. He said, “Look, this is un-American because it’s unconstitutional.” President Obama behaved like an emperor when he created DACA. He has no right to legislate from the Oval Office, and that’s why he told to the attorney general, “End it now.” That’s why AG Sessions said, “DACA is over.”</p><p>However, Donald Trump, if you’ve read anything about him, to get his own books, read the real books not the tag jobs, the real books about him. He is one of the most charitable, kind-hearted men you’ll ever meet. He doesn’t wear it on his sleeve, he’s very quiet about it, but he is a very warm-hearted individual. He is not prepared to see young men and women who have not committed any crime of their own doing, be deported from this nation. He said to Congress, “Guys, let’s work this out.” Criminals, we get rid of them, and he’s absolutely adamant. You’re a member of MS-13, you’re a Dreamer who’s killed somebody, as has happened, you are going to be imprisoned or be deported. End of story. For those people who have not committed any crime beyond being brought here as a child by their parents, we’ve got to find a solution that comports with our Judeo-Christian charitable basis. Those are the things we have to understand about what the president is doing.</p></blockquote><p>This is why philosophical coherence, and intellectual precision, are so important. Because when you don’t have the guidance offered by those tools, you will have a tendency to make decisions based on your emotions. First, there is no “Judeo-Christian charitable basis”, so the entire premise is false. There is no need to find a solution that comports with something that does not exist; the Good Samaritan did not adopt and take into his house the children of the man he found beaten by the roadside.</p><p>Second, if Donald Trump is not prepared to see young men and women who have not committed any crime of their own doing be deported, he is not psychogically suited to be President. The law is clear, the principle is settled, the American people have been burned by such amnesties before and they are not going to accept another one, no matter how many sob stories about “Dreamers” are waved like red flags before the public.</p><p>However, if there is one thing that is clear about Donald Trump, it is that he is capable of learning from his mistakes. His base needs to be very clear about the fact that failing to keep his word on DACA is not acceptable.</p></div>",
  "content_text": "Sebastien Gorka tries to tell the anti-immigration Right\nto settle down about DACA\n, but in doing so, illustrates that neither he nor the President truly grasp its position.\nGorka:\n“Take a deep breath, and wait a day.” Sure enough, less than a day, nine hours later, we have the counterpoint from the press secretary and from the President himself. Look, having worked for the man, let me tell you that it’s neither of the options that you, or scenarios that you have painted. He knows, he knows why he is the president. He knows that the first policy issue that catapulted him into preeminence as a presidential candidate was the border, was immigration. He knows that when Jeff Sessions put on that hat, Jeff Sessions was bringing his stance on illegal immigration to his campaign to set him apart from the 16 other hackneyed establishment candidates the GOP had arrayed against him. The president’s not gonna go back.\nThe other scenario is also fallacious. I love reading how we have these uber-Trumpsters… Look, I’m here to support the president inside the White House or outside the White House. If I read another article on how the president is doing 48-dimensional chess…\nBuskirk:\nRight.\nGorka:\nIt’s just, no, he doesn’t do that. He’s not some kind of uber-Machiavellian operator. He is an instinctual actor, a masterful … But he’s not plotting a … Steve Bannon is the fifth dimensional Vulcan, OK? That’s how Steve Bannon operates. He is the super strategist. The president, and that’s why Steve and the president work so well together, the president, as we’ve discussed, is this present, natural, instinctual actor. He goes into these meetings in ways that the swamp doesn’t. Of course, they tweeted the second they got out of the Oval, because they’re politicians and they want to get reelected. The president doesn’t think like that. He’s thinking about the American interest, and at the end of the day, he is not going to sell us up the river, I tell you that.\nBuskirk:\nOkay, so look, that’s extremely helpful. That’s why I really wanted to talk to you. You know the president as well as anybody, way better than most. What’s your understanding of what happened? What do you think is the right way to think about it?\nGorka:\nOkay, so two things are important. The way I explain what’s happened in the last seven days is the following. Number one, the original response to DACA from the president is quintessential Donald Trump. He said, “Look, this is un-American because it’s unconstitutional.” President Obama behaved like an emperor when he created DACA. He has no right to legislate from the Oval Office, and that’s why he told to the attorney general, “End it now.” That’s why AG Sessions said, “DACA is over.”\nHowever, Donald Trump, if you’ve read anything about him, to get his own books, read the real books not the tag jobs, the real books about him. He is one of the most charitable, kind-hearted men you’ll ever meet. He doesn’t wear it on his sleeve, he’s very quiet about it, but he is a very warm-hearted individual. He is not prepared to see young men and women who have not committed any crime of their own doing, be deported from this nation. He said to Congress, “Guys, let’s work this out.” Criminals, we get rid of them, and he’s absolutely adamant. You’re a member of MS-13, you’re a Dreamer who’s killed somebody, as has happened, you are going to be imprisoned or be deported. End of story. For those people who have not committed any crime beyond being brought here as a child by their parents, we’ve got to find a solution that comports with our Judeo-Christian charitable basis. Those are the things we have to understand about what the president is doing.\nThis is why philosophical coherence, and intellectual precision, are so important. Because when you don’t have the guidance offered by those tools, you will have a tendency to make decisions based on your emotions. First, there is no “Judeo-Christian charitable basis”, so the entire premise is false. There is no need to find a solution that comports with something that does not exist; the Good Samaritan did not adopt and take into his house the children of the man he found beaten by the roadside.\nSecond, if Donald Trump is not prepared to see young men and women who have not committed any crime of their own doing be deported, he is not psychogically suited to be President. The law is clear, the principle is settled, the American people have been burned by such amnesties before and they are not going to accept another one, no matter how many sob stories about “Dreamers” are waved like red flags before the public.\nHowever, if there is one thing that is clear about Donald Trump, it is that he is capable of learning from his mistakes. His base needs to be very clear about the fact that failing to keep his word on DACA is not acceptable.",
  "tags": [
    "cuckservative",
    "immigration",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-17T08:42:00+00:00"
}