{
  "url": "https://voxday.net/2017/09/21/that-would-be-why/",
  "scraped_at": "2025-12-19T10:24:42.916125",
  "title": "That would be why",
  "date_display": "September 21, 2017",
  "date_iso": "2017-09-21T11:34:00+00:00",
  "date_from_url": "2017-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some people asked me why I didn’t choose CounterFund for Voxiversity and Alt⭐️Hero. The truth is that I never considered using Counterfund at all. Remember what I said about Andrew Torba not being ready for prime time? Well, in my opinion, neither is Pax Dickinson. He had been directing his attacks at Charles Johnson, not me, but I was aware that anyone who behaved that way in public towards a former business partner is likely to do the same to others in the future.</p><p>I’ve had the occasional problem with people and companies with whom I’ve worked in the past. Not many over the years, but a few. And aside from GT Interactive, which was a matter of public record, you probably couldn’t name any of them because I don’t ever talk about them in public. Among the necessary skills for a professional is the ability to keep your mouth shut, even when you have been wronged.</p><blockquote><p>Pax Dickinson · @pax<br>I think Vox Day’s “minions” are so bad at bantz and trolling because they’re only used to soft SJW resistance, they don’t know how to handle seasoned veterans of the meme wars. They exist in their secure little blog bubble where Vox’s moderation keeps them weak and flaccid, like shitposting veal.</br></p><p>Counter.Fund‏ @CounterFund<br>I asked Vox Day to help me move, so he sued my couch.</br></p><p>Counter.Fund‏ @CounterFund<br>You can tell which #AltRight people are sincere &amp; not just e-book selling charlatans because the good ones quit in disgust and never return.</br></p><p>Counter.Fund‏ @CounterFund<br>the e-book merchants take their e-fame very very seriously because they work at it but I became e-famous by accident so I think it’s a joke</br></p><p>Counter.Fund‏ @CounterFund<br>Everyone: “Nazi LARPers are the Right’s most autistic lolcows”<br>Vox Day: “Hold my beer”</br></br></p><p>Counter.Fund‏ @CounterFund<br>“hey #AltRight look what I built for you”<br>*called a shill*<br>*accused of grubbing for shekels*<br>*sued by Vox Day*<br>“on 2nd thought never mind”</br></br></br></br></br></p><p>Counter.Fund‏ @CounterFund<br>Calling for people to take back their investments in Gab is lower than shit. Fuck you @voxday you’re fucking dead to me.</br></p><p>Counter.Fund‏ @CounterFund<br>Vox called me up back when I was ripping Chuck to advise that infighting was a bad look. I wonder when he changed his mind about that.</br></p><p>Counter.Fund‏ @CounterFund<br>I had a discussion with @VoxDay. It didn’t go that well.  He blocked me. ?</br></p></blockquote><p>I most certainly did block him. I don’t discuss things with individuals who refuse to address the relevant points and instead elect to call me “a fucking moron” in lieu of argument. I see that as a reliable indicator that there is absolutely no benefit to having anything to do with them, now or in the future. One can readily observe a pattern here: both Pax and Andrew Torba are volatile individuals who are temperamentally unsuited for what they are trying to do. That is why the probabilities of success are not in their favor.</p><p>Can you imagine me attacking an author that I was trying to recruit for Castalia House this way? Can you imagine ANY successful publisher doing so?</p><p>As for Gab, the LLoE and I will be continuing to proceed as before, albeit in a rather more unsympathetic manner than we began. As one reader noted in response to the following Gab posts: <i>“Gab is a useless, irredeemable sewer. Let it burn.”</i></p><blockquote><p>Folk · @Folk<br>Deus Vulters can never be real nationalists, because they MUST believe in Oneness under Christ. A Christian Syrian is worth more to them than a secular or pagan White. All Deus Vulters should be Vox fans, as Vox’s platform says you must be a Christian and support all races to be Alt-Right.</br></p><p>Goyim Revolution · @GoyimRevolution<br>Koanic you are such a loser. In fact it’s obvious you’re just a @VoxDay sock. What the hell is a “Nazi” anyway? Do you have a definition? And what’s so vile about these Nazis? Is it because they won’t shutup about jews like Soros?</br></p><p>Tyron T. White · @TightyWhitey<br>Being a “Christian” and “supporting all races” is exactly how all-white countries have been flooded with parasitic mud people. If someone shot Vox in the head on a sidewalk, do you think his followers would tilt right, or back toward center?</br></p></blockquote><p>Charming. Now, one never knows what the future will bring, but based on what I have been hearing in various development circles, I expect that within 18 months Gab will be, at best, the third-place Alt-Tech alternative to Twitter.</p></div>",
  "content_text": "Some people asked me why I didn’t choose CounterFund for Voxiversity and Alt⭐️Hero. The truth is that I never considered using Counterfund at all. Remember what I said about Andrew Torba not being ready for prime time? Well, in my opinion, neither is Pax Dickinson. He had been directing his attacks at Charles Johnson, not me, but I was aware that anyone who behaved that way in public towards a former business partner is likely to do the same to others in the future.\nI’ve had the occasional problem with people and companies with whom I’ve worked in the past. Not many over the years, but a few. And aside from GT Interactive, which was a matter of public record, you probably couldn’t name any of them because I don’t ever talk about them in public. Among the necessary skills for a professional is the ability to keep your mouth shut, even when you have been wronged.\nPax Dickinson · @pax\nI think Vox Day’s “minions” are so bad at bantz and trolling because they’re only used to soft SJW resistance, they don’t know how to handle seasoned veterans of the meme wars. They exist in their secure little blog bubble where Vox’s moderation keeps them weak and flaccid, like shitposting veal.\nCounter.Fund‏ @CounterFund\nI asked Vox Day to help me move, so he sued my couch.\nCounter.Fund‏ @CounterFund\nYou can tell which #AltRight people are sincere & not just e-book selling charlatans because the good ones quit in disgust and never return.\nCounter.Fund‏ @CounterFund\nthe e-book merchants take their e-fame very very seriously because they work at it but I became e-famous by accident so I think it’s a joke\nCounter.Fund‏ @CounterFund\nEveryone: “Nazi LARPers are the Right’s most autistic lolcows”\nVox Day: “Hold my beer”\nCounter.Fund‏ @CounterFund\n“hey #AltRight look what I built for you”\n*called a shill*\n*accused of grubbing for shekels*\n*sued by Vox Day*\n“on 2nd thought never mind”\nCounter.Fund‏ @CounterFund\nCalling for people to take back their investments in Gab is lower than shit. Fuck you @voxday you’re fucking dead to me.\nCounter.Fund‏ @CounterFund\nVox called me up back when I was ripping Chuck to advise that infighting was a bad look. I wonder when he changed his mind about that.\nCounter.Fund‏ @CounterFund\nI had a discussion with @VoxDay. It didn’t go that well.  He blocked me. ?\nI most certainly did block him. I don’t discuss things with individuals who refuse to address the relevant points and instead elect to call me “a fucking moron” in lieu of argument. I see that as a reliable indicator that there is absolutely no benefit to having anything to do with them, now or in the future. One can readily observe a pattern here: both Pax and Andrew Torba are volatile individuals who are temperamentally unsuited for what they are trying to do. That is why the probabilities of success are not in their favor.\nCan you imagine me attacking an author that I was trying to recruit for Castalia House this way? Can you imagine ANY successful publisher doing so?\nAs for Gab, the LLoE and I will be continuing to proceed as before, albeit in a rather more unsympathetic manner than we began. As one reader noted in response to the following Gab posts:\n“Gab is a useless, irredeemable sewer. Let it burn.”\nFolk · @Folk\nDeus Vulters can never be real nationalists, because they MUST believe in Oneness under Christ. A Christian Syrian is worth more to them than a secular or pagan White. All Deus Vulters should be Vox fans, as Vox’s platform says you must be a Christian and support all races to be Alt-Right.\nGoyim Revolution · @GoyimRevolution\nKoanic you are such a loser. In fact it’s obvious you’re just a @VoxDay sock. What the hell is a “Nazi” anyway? Do you have a definition? And what’s so vile about these Nazis? Is it because they won’t shutup about jews like Soros?\nTyron T. White · @TightyWhitey\nBeing a “Christian” and “supporting all races” is exactly how all-white countries have been flooded with parasitic mud people. If someone shot Vox in the head on a sidewalk, do you think his followers would tilt right, or back toward center?\nCharming. Now, one never knows what the future will bring, but based on what I have been hearing in various development circles, I expect that within 18 months Gab will be, at best, the third-place Alt-Tech alternative to Twitter.",
  "tags": [
    "#AltTech",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-21T10:34:00+00:00"
}