{
  "url": "https://voxday.net/2017/09/28/the-original-comics-sjw/",
  "scraped_at": "2025-12-19T10:25:35.668584",
  "title": "The original Comics-SJW",
  "date_display": "September 28, 2017",
  "date_iso": "2017-09-28T12:00:00+00:00",
  "date_from_url": "2017-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been a little taken aback by the sheer vituperation of the SJWs triggered by the mere existence of the Alt⭐️Hero concept, at least at this very early stage. And, I confess, I have been more than a little surprised by their apparent confusion between the late Marvel/DC artist Jack Kirby and the superheroes that he drew.</p><blockquote><p>Ayatollah Cumonme‏ @Phonycian<br>if jack kirby were alive today he’d kick you in the balls and spit on you</br></p><p>Supreme Dark Lord‏ @voxday<br>If Jack Kirby were alive today, he’d be asking to work for me. The SJWs at Marvel and DC today wouldn’t employ him.</br></p><p>rstevens  @rstevens<br>kirby would cook you and serve you to hogs, dude</br></p><p>Supreme Dark Lord‏ @voxday<br>You’re talking about the little Jewish guy with no biceps, right? Sure, he might draw that.</br></p><p>psychopompous‏ @prognostiq<br>you really have fucking clue huh. i mean, not surprising but… you’re not fit to shine his shoes, bud.</br></p><p>Supreme Dark Lord‏ @voxday<br>Shine his tiny little size five shoes? I shall endeavor to restrain my disappointment.</br></p><p>Jo O’Donnell ⚘‏ @bowtiednomad<br>son hed cause more damage to your body than your daily lunch of 5 5-layer burritos</br></p><p>Supreme Dark Lord‏ @voxday<br>A dead guy who went 5’4 and weighed about 125? You’ve read way too many comic books. You know they’re not real, right?</br></p><p>meth lab for cutie‏ @patrickmustdie<br>jack kirby would of wooped your ass and then tell the story for laughs at parties for years</br></p><p>Supreme Dark Lord‏ @voxday<br>Kirby used to brag about fighting a guy who didn’t show up. I made the Commandant of the U.S. Marine Corps tap out in less than 7 seconds.</br></p></blockquote><p>As strange as it is to be threatened with a very small corpse, I understand that comic book fans enjoy this sort of theoretical matchup. So, just to be clear, <a href=\"https://s-media-cache-ak0.pinimg.com/originals/21/29/8c/21298cf71afe3d552e65519efa85cbd1.jpg\">this is Jack Kirby</a> in his physical prime, with his wife, Roz. This is another picture <a href=\"https://nothingbutcomics.files.wordpress.com/2014/08/bwiz13pcyaaybgb.jpg\">of Kirby</a>. <a href=\"https://pbs.twimg.com/media/B38-4P4CQAA0Oxp.jpg:large\">This is me</a>, with Spacebunny. Another picture <a href=\"https://pbs.twimg.com/media/B1MiAL3CcAEgPFJ.jpg\">of me</a>. Yes, both pictures were a long time ago, but nevertheless, I am confident that I have maintained myself in rather better condition than Mr. Kirby has.</p><p>Jack Kirby’s tough guy story: <i>Once, while Jack was in the Timely office, a call came from someone in the lobby. When Kirby answered, the caller threatened Jack with bodily harm if he showed his face. Kirby told the caller he would be right down, but by the time Jack reached street level, there was no one to be found.</i></p><p>Vox Day’s tough guy story: <i>In his second public ringfight, his opponent, a Tae Kwan Do practitioner, broke Vox’s nose in the initial exchange. Vox didn’t notice it until his sensei called time out to stop the bleeding. After the time out, Vox caught his opponent coming in with a sidekick that doubled him over, and proceeded to throw alternating hooks to both sides of the defenseless man’s head until the referee stopped the fight in the first round and declared Vox the winner. After the fight, Vox went to the hospital to get his nose straightened out. Mostly.</i></p><p>For what it’s worth. Anyhow, what explains this weird elevation of Jack Kirby to demigod status by the Comic SJWs? The answer, as it turns out, is that they believe him to have been <a href=\"https://www.vox.com/2015/9/1/9239315/kirby-diversity-comics\">their much-revered forefather</a> who blazed the social justice trail they so bravely tread today.</p><blockquote><p>X-Men creator Jack Kirby was the original comic book social justice warrior</p><p>Over the past week, comic book enthusiasts have been celebrating the late artist Jack Kirby’s birthday by remembering the impact he had on the industry. From his iconic stories and characters to his contentious relationship with Marvel, Kirby’s legacy is a rich and memorable one. A massive part of this legacy was that Kirby was always telling stories — through his heroes like the X-Men, the Thing, the Hulk — of being an outsider and becoming a hero despite living in a world that’s seemingly out to get you. And there are still people fighting battles today in the spirit of Kirby’s legacy.</p><p>The past few years in the comic book industry have been underscored by a struggle for more diversity. And while it can get ugly, sexist, and racist, there’s plenty of good to come out of this battle. Case in point: the hugely successful Ms. Marvel series featuring Kamala Khan, a Pakistani-American Muslim teenager. More characters like Kamala is what Kirby would have wanted.</p><p>In the spirit of remembering Kirby, writer Saladin Ahmed tweeted and pointed to a 1990 interview with the Comics Journal, where Kirby explained that he was compelled to create the superhero Black Panther because the default had always been white characters. And one day, he realized he was ignoring how important it was for him, and for the comic book industry, to reflect humanity.</p></blockquote><p>So, yeah. This is going to be SO MUCH FUN. You know how SJWs love nothing better than to deconstruct our historical heroes and literally tear them down? Well, as I have pointed out, any use of a tactic legitimizes it….</p><p>And they’re totally NOT TRIGGERED! NOT EVEN A LITTLE!</p><p>Georgie‏ @SilverDoe_Iso<br><i>Thanks to the delightful replies to this idiot, I was made aware of Faiza Hussein, and just ordered myself a comic ?</i><br><i><br/></i>Well, that certainly shows me! By the way, in the Marvel universe, Faiza Hussein is the current bearer of the sword Excalibur. That’s right. In Marvel’s world, King Arthur’s blade is wielded by a Muslim woman.</br></br></p><p>But it must be confessed that it is true that the artists of Alt⭐️Hero don’t draw women like Jack Kirby did. Then again, why they would want to do so remains a mystery to me. I leave it to the reader to guess which image below is Mr. Kirby’s work and which is not. And, in case you’re interested, I should probably mention that we anticipate launching the Freestartr campaign tomorrow.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DKzNJ2aXUAIqOby.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"465\" data-original-width=\"545\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DKzNJ2aXUAIqOby.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"465\" data-original-width=\"545\" data-src=\"https://pbs.twimg.com/media/DKzNJ2aXUAIqOby.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20545%20465%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "I’ve been a little taken aback by the sheer vituperation of the SJWs triggered by the mere existence of the Alt⭐️Hero concept, at least at this very early stage. And, I confess, I have been more than a little surprised by their apparent confusion between the late Marvel/DC artist Jack Kirby and the superheroes that he drew.\nAyatollah Cumonme‏ @Phonycian\nif jack kirby were alive today he’d kick you in the balls and spit on you\nSupreme Dark Lord‏ @voxday\nIf Jack Kirby were alive today, he’d be asking to work for me. The SJWs at Marvel and DC today wouldn’t employ him.\nrstevens  @rstevens\nkirby would cook you and serve you to hogs, dude\nSupreme Dark Lord‏ @voxday\nYou’re talking about the little Jewish guy with no biceps, right? Sure, he might draw that.\npsychopompous‏ @prognostiq\nyou really have fucking clue huh. i mean, not surprising but… you’re not fit to shine his shoes, bud.\nSupreme Dark Lord‏ @voxday\nShine his tiny little size five shoes? I shall endeavor to restrain my disappointment.\nJo O’Donnell ⚘‏ @bowtiednomad\nson hed cause more damage to your body than your daily lunch of 5 5-layer burritos\nSupreme Dark Lord‏ @voxday\nA dead guy who went 5’4 and weighed about 125? You’ve read way too many comic books. You know they’re not real, right?\nmeth lab for cutie‏ @patrickmustdie\njack kirby would of wooped your ass and then tell the story for laughs at parties for years\nSupreme Dark Lord‏ @voxday\nKirby used to brag about fighting a guy who didn’t show up. I made the Commandant of the U.S. Marine Corps tap out in less than 7 seconds.\nAs strange as it is to be threatened with a very small corpse, I understand that comic book fans enjoy this sort of theoretical matchup. So, just to be clear,\nthis is Jack Kirby\nin his physical prime, with his wife, Roz. This is another picture\nof Kirby\n.\nThis is me\n, with Spacebunny. Another picture\nof me\n. Yes, both pictures were a long time ago, but nevertheless, I am confident that I have maintained myself in rather better condition than Mr. Kirby has.\nJack Kirby’s tough guy story:\nOnce, while Jack was in the Timely office, a call came from someone in the lobby. When Kirby answered, the caller threatened Jack with bodily harm if he showed his face. Kirby told the caller he would be right down, but by the time Jack reached street level, there was no one to be found.\nVox Day’s tough guy story:\nIn his second public ringfight, his opponent, a Tae Kwan Do practitioner, broke Vox’s nose in the initial exchange. Vox didn’t notice it until his sensei called time out to stop the bleeding. After the time out, Vox caught his opponent coming in with a sidekick that doubled him over, and proceeded to throw alternating hooks to both sides of the defenseless man’s head until the referee stopped the fight in the first round and declared Vox the winner. After the fight, Vox went to the hospital to get his nose straightened out. Mostly.\nFor what it’s worth. Anyhow, what explains this weird elevation of Jack Kirby to demigod status by the Comic SJWs? The answer, as it turns out, is that they believe him to have been\ntheir much-revered forefather\nwho blazed the social justice trail they so bravely tread today.\nX-Men creator Jack Kirby was the original comic book social justice warrior\nOver the past week, comic book enthusiasts have been celebrating the late artist Jack Kirby’s birthday by remembering the impact he had on the industry. From his iconic stories and characters to his contentious relationship with Marvel, Kirby’s legacy is a rich and memorable one. A massive part of this legacy was that Kirby was always telling stories — through his heroes like the X-Men, the Thing, the Hulk — of being an outsider and becoming a hero despite living in a world that’s seemingly out to get you. And there are still people fighting battles today in the spirit of Kirby’s legacy.\nThe past few years in the comic book industry have been underscored by a struggle for more diversity. And while it can get ugly, sexist, and racist, there’s plenty of good to come out of this battle. Case in point: the hugely successful Ms. Marvel series featuring Kamala Khan, a Pakistani-American Muslim teenager. More characters like Kamala is what Kirby would have wanted.\nIn the spirit of remembering Kirby, writer Saladin Ahmed tweeted and pointed to a 1990 interview with the Comics Journal, where Kirby explained that he was compelled to create the superhero Black Panther because the default had always been white characters. And one day, he realized he was ignoring how important it was for him, and for the comic book industry, to reflect humanity.\nSo, yeah. This is going to be SO MUCH FUN. You know how SJWs love nothing better than to deconstruct our historical heroes and literally tear them down? Well, as I have pointed out, any use of a tactic legitimizes it….\nAnd they’re totally NOT TRIGGERED! NOT EVEN A LITTLE!\nGeorgie‏ @SilverDoe_Iso\nThanks to the delightful replies to this idiot, I was made aware of Faiza Hussein, and just ordered myself a comic ?\nWell, that certainly shows me! By the way, in the Marvel universe, Faiza Hussein is the current bearer of the sword Excalibur. That’s right. In Marvel’s world, King Arthur’s blade is wielded by a Muslim woman.\nBut it must be confessed that it is true that the artists of Alt⭐️Hero don’t draw women like Jack Kirby did. Then again, why they would want to do so remains a mystery to me. I leave it to the reader to guess which image below is Mr. Kirby’s work and which is not. And, in case you’re interested, I should probably mention that we anticipate launching the Freestartr campaign tomorrow.",
  "tags": [
    "Alt-Hero",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-28T11:00:00+00:00"
}