{
  "url": "https://voxday.net/2017/09/01/the-epic-greatness-of-stephen-donaldson/",
  "scraped_at": "2025-12-19T10:22:10.220478",
  "title": "The epic greatness of Stephen Donaldson",
  "date_display": "September 1, 2017",
  "date_iso": "2017-09-01T15:00:00+00:00",
  "date_from_url": "2017-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of people have been surprised that I write Stephen Donaldson, and in particular, the first Chronicles of Thomas Covenant so highly on <a href=\"http://voxday.blogspot.com/2017/08/compression-and-decompression.html\">my list of Epic Fantasy authors</a>. This excellent essay by Tom Simon <a href=\"https://bondwine.com/2007/02/24/1977-hero-and-fool/\">may help to explain why</a>.</p><blockquote><p>The antipathy of Donaldson’s professors to Tolkien was immediate and complete, and it put Donaldson in a difficult, almost untenable position. With one side of his mind he had to be a good Modernist, and sneer at the tall tales of the ancients as the work of childish primitives; but with the other he was keenly and imaginatively alive to the power of those ancient tales and their modern successors. Not only Tolkien but Wagner moved him with tectonic force. In later life he would write a sprawling five-volume novel, The Gap, as a space-operatic homage to Wagner’s Ring cycle. But for now he felt the overriding need to answer his professors (and most of his fellow students) on their own ground. Not indeed by academic argument, for that would have been fruitless and might well have cost him his M.A., but by example.</p><p>So he began to write a very curious fantasy story, about a man who stubbornly refuses to believe in fairy-tales even when he is plunged into one himself. Harking back to his father’s work, he made his protagonist a leper, and with an eye on Kent State he made him a bestselling author, a Modernist and realist, facile rather than deep. The one quality crushed out the other: the Modernist imagination was no match for the stringent demands of Hansen’s disease, which forced this man, Thomas Covenant, to focus all his wits and energies on the daily struggle for survival. Tuberculoid leprosy damages peripheral nerves and makes the extremities numb; a small cut or contusion, unfelt and therefore neglected, can lead to infection and gangrene, and even bruises can be dangerous. It was thus only natural that Covenant, transported from his ‘real’ life to the fantasy world called ‘the Land’, should cling desperately to the medical disciplines that kept him alive, and strive to deny the exotic temptations of an environment instinct with magic and miracle.</p><p>Now this is a very different method from Tolkien’s, and many misunderstandings have arisen among those who confuse the two. Tolkien’s was a mythopoeic fantasy, a direct successor to Beowulf and the Kalevala, the Eddas and sagas, informed indeed by his own experience of modern life, but not primarily intended as a commentary upon it. One of his first stories, The Fall of Gondolin, was written while he was on sick-leave from the trenches of the Great War; and though it is the story of a battle, the battle of Gondolin is as remote from the Battle of the Somme as a blooded warhorse is from a military railway. Gondolin is written in an extremely archaic style, heavily reminiscent of Malory. The young Tolkien takes great and sometimes clumsy pains to emphasize the glory and chivalry of epic warfare, where fate turns on the skill and courage of heroes and not on the drill of divisions and the supply of artillery shells. This is, if you like, a reaction against the squalid and seemingly pointless fighting Tolkien had actually seen; but it is neither an allegory nor a satire of it. It is simply an escape, or rather, a quest: a desperate attempt to rediscover, in the practices of a simpler and nobler age, the need and cause of courage, the spirit that makes men willing to fight and die defending their homes and loved ones.</p><p>Donaldson, too, was susceptible to this appeal. Although a conscientious objector and in some measure a pacifist, he recognized that even a hopeless war may be preferable to mere surrender. In The Illearth War Hile Troy, another man from Covenant’s ‘real’ world, compares his former work at the Pentagon with his new role as the commander of the Land’s army, the Warward:</p><p><i>‘I’m useful to something worth being useful to. The issues at stake in this war are the only ones I’ve ever seen worth fighting for. The life of the Land is beautiful. It deserves preservation. For once, I can do some good. Instead of spending my time on troop deployment, first- and second-strike capabilities, superready status, demoralization parameters, nuclear induction of lethal genetic events, I can help defend against a genuine evil. The world we came from — the “real” world hasn’t got such clear colors, no blue and black and green and red, “ebon ichor incarnadine viridian.” Gray is the color of “reality.”’</i></p><p>This is a fine example of the likeness and difference between Tolkien and Donaldson. It is the very likeness that points up the difference: the difference is that the likeness is made explicit. In all Tolkien’s descriptions of battles, at Helm’s Deep and the Pelennor Fields and the rest, there is no reference to modern modes of warfare; the contrast and the criticism are mute and implicit. A man of Malory’s time could read Tolkien with understanding and recognition, though some of the vocabulary would be strange to him. But Hile Troy is utterly modern, and can only be understood by one with a knowledge of the modern world.</p><p>Incidentally, Donaldson has earned a lot of disrespect for his vocabulary, which ranges from the rococo to the bizarre. ‘Ebon ichor incarnadine viridian’ is a particularly concentrated example. Ursula K. Le Guin has called the word ichor ‘the infallible touchstone of the seventh-rate’, which ‘bores the bejesus out of everybody’. It is certainly not one of Donaldson’s more felicitous word-choices. The prose of the Covenant books is liberally strewn with such questionable jewels as coigned, orieled, threnody, theurgy, unhermeneuticable (!), sibilating, chrysoprastic, irenic, and the ever-popular roynish. This last word is used as a sort of Homeric epithet to describe the ur-viles, the ‘black roynish’ kindred of the Demondim-spawn. Ur-viles are one of Donaldson’s more memorable and original inventions, eyeless, wizardly, sinister, and thoroughly inscrutable. But I never could discover what was particularly roynish about them; indeed, from Donaldson’s usage of the word, I could never figure out what roynish meant at all. The OED gives it as a variant of roinish, defined thus: ‘Covered with scale or scurf; scabby, scurvy, coarse, mean, paltry, base.’ The smooth skins and austerely evil magics of the ur-viles do not seem to suit the word well.</p><p>Donaldson also has a strange tendency to use clench as every part of speech under the sun. To my knowledge he has not yet used it as an interjection or a definite article, but one must not set arbitrary limits to his genius. And he gives a strange sort of value to imprecise, which is usually a Donaldsonian understatement for ‘utterly wrong or bogus’. These peculiarities give his prose somewhat of the aspect of a magpie’s nest, cluttered with bright shiny objects of unknown or forgotten use. This is not an unfair criticism; he has said himself that he keeps lists of rare words encountered in his reading, and does not always look them up in a dictionary before attempting to use them. In consequence his usages of such words are, in his own personal acceptation of the term, ‘imprecise’. When I first read the Covenant books at fourteen, I merely skipped over the words I did not know, or tried to interpret them from context. This is probably the best way to approach Donaldson’s prose; those who have a dictionary at their elbow as they read are likely to get rather angry.</p><p>On the other hand, it must be said that Donaldson is capable of wonderfully lyrical passages, relying heavily on the sound of words, even when their meaning sheds no light on his intent. He is a very considerable prose poet, a quality not much appreciated by most modern readers. Like Tolkien, he decks his fiction with verses, though as a rule of a very much lower quality; he descends to vers libre and doggerel, as Tolkien never did. A little later he developed some real facility with formal and metrical verse. Two verses in particular from the later Covenant books, ‘My heart has rooms that sigh with dust’ and ‘Let those who sail the Sea bow down’, have some claim to be called poetry even by snobs.</p><p>But let us leave Donaldson’s prose and return to his Method. Tom Shippey has put his finger on the cardinal difference between Tolkien and the Modernists:</p><p><i>Tolkien’s approach to the ideas or the devices accepted as modernist is radically different because they are on principle not literary. He used ‘mythical method’ not because it was an interesting method but because he believed that the myths were true. . . . He experimented with language not to see what interesting effects could be produced but because he thought all forms of human language were already an experiment.</i></p><p>In this, Donaldson is very much on the Modernist side. His characters and situations do not exist for their own sake but because they are effective as symbols. Here, in the ‘Gradual Interview’ on his website, he describes a method antithetical to Tolkien’s:</p><p><i>My general view of the kind of fantasy I write is that it’s a specialized form of psychodrama. Putting the issue as simply as I can: the story is a human mind turned inside out, and all of the internal forces which drive that mind are dramatized as if they were external characters, places, and events. This is easier to see in the first ‘Chronicles’ because the story is simpler: the Land and everyone in it is an external manifestation of Covenant’s internal journey/struggle. Everything is more complex in ‘The Second Chronicles’ because there are two minds being turned inside out. Which means that there are actually three stories at work: Covenant’s, Linden’s, and the interaction between the two.</i></p><p>With the two words ‘as if’, Donaldson rejects the genuine epic; and when you analyse what remains, it all comes down to that old friend of the literati, the pathetic fallacy. He writes of battles fought with swords and spears (and wizards’ staffs) because that is an interesting way to comment on the spiritual battle in the hero’s mind. He makes that hero a leper because he wants to point out how many of us suffer from a leprosy of the soul. If you strip away the voluptuous flesh of the Land and expose the bare bones of the plot, you will find that Covenant is satirical and symbolic and bitingly topical. None of these things are true of Tolkien’s major works. You cannot strip away the voluptuous flesh of Middle-earth to expose the bones of the plot, because the bones themselves are Middle-earth. As Tolkien said in a letter to a reader: ‘The story is really a story of what happened in B.C. year X, and it just happened to people who were like that!’ With Donaldson one never forgets that the people to whom the story ‘just happened’ are carefully constructed to be ‘like that’ in the service of his theme. It is the tradition not of Beowulf and the Eddas but of Utopia and Gulliver’s Travels.</p></blockquote><p>In my opinion, what Donaldson attempted to do, and the degree to which he succeeded, is considerably more of a literary accomplishment than anything that Abercrombie, Bakker, or any of the other epic fantasy authors have managed to do. And if his more recent work has not been of a similar level – and it has not – that does not detract from the excellence of the first series.</p><p>Donaldson may be a modernist, but he is a moral modernist, and as such, his color palette considerably exceeds that of the more nihilistic authors. So, it should be no surprise that the images he paints are rather more vivid than theirs.</p><p>Simon also rather helpfully explains why the Second Chronicles and subsequent books are mediocrities and should not be taken into account when considering Stephen Donaldson.</p><blockquote class=\"tr_bq\"><p>A year or two later, when the first Covenant trilogy was a runaway success, casting even del Rey’s pet, Terry Brooks, in the shade, Donaldson was duly called upon for a sequel. He had some difficulty in coming up with one, as he had never intended to go beyond the original trilogy. To solve this problem, he introduced a new character from the ‘real’ world, a physician named Linden Avery. And to increase her importance, and also to help along those readers who might not have read the first three books, he made her the chief viewpoint character of the second trilogy. Del Rey was outraged. He threatened to reject the new books outright, saying: ‘You can’t tell a Tarzan story from Jane’s point of view!’ (His superiors at Ballantine Books, rather than lose Donaldson and his undeniable earning-power, took him away from del Rey and gave him an editor he could work with.)</p></blockquote><p>It should never be a surprise when an author’s effort to turn out additional work for hire fails to rise to the level of his labor of love. Stephen Donaldson is not one of my favorite authors. He is not one of my 50 favorite authors. But, as an author of epic fantasy myself, I respect his greatest accomplishment, the original Chronicles of Thomas Covenant.</p></div>",
  "content_text": "A number of people have been surprised that I write Stephen Donaldson, and in particular, the first Chronicles of Thomas Covenant so highly on\nmy list of Epic Fantasy authors\n. This excellent essay by Tom Simon\nmay help to explain why\n.\nThe antipathy of Donaldson’s professors to Tolkien was immediate and complete, and it put Donaldson in a difficult, almost untenable position. With one side of his mind he had to be a good Modernist, and sneer at the tall tales of the ancients as the work of childish primitives; but with the other he was keenly and imaginatively alive to the power of those ancient tales and their modern successors. Not only Tolkien but Wagner moved him with tectonic force. In later life he would write a sprawling five-volume novel, The Gap, as a space-operatic homage to Wagner’s Ring cycle. But for now he felt the overriding need to answer his professors (and most of his fellow students) on their own ground. Not indeed by academic argument, for that would have been fruitless and might well have cost him his M.A., but by example.\nSo he began to write a very curious fantasy story, about a man who stubbornly refuses to believe in fairy-tales even when he is plunged into one himself. Harking back to his father’s work, he made his protagonist a leper, and with an eye on Kent State he made him a bestselling author, a Modernist and realist, facile rather than deep. The one quality crushed out the other: the Modernist imagination was no match for the stringent demands of Hansen’s disease, which forced this man, Thomas Covenant, to focus all his wits and energies on the daily struggle for survival. Tuberculoid leprosy damages peripheral nerves and makes the extremities numb; a small cut or contusion, unfelt and therefore neglected, can lead to infection and gangrene, and even bruises can be dangerous. It was thus only natural that Covenant, transported from his ‘real’ life to the fantasy world called ‘the Land’, should cling desperately to the medical disciplines that kept him alive, and strive to deny the exotic temptations of an environment instinct with magic and miracle.\nNow this is a very different method from Tolkien’s, and many misunderstandings have arisen among those who confuse the two. Tolkien’s was a mythopoeic fantasy, a direct successor to Beowulf and the Kalevala, the Eddas and sagas, informed indeed by his own experience of modern life, but not primarily intended as a commentary upon it. One of his first stories, The Fall of Gondolin, was written while he was on sick-leave from the trenches of the Great War; and though it is the story of a battle, the battle of Gondolin is as remote from the Battle of the Somme as a blooded warhorse is from a military railway. Gondolin is written in an extremely archaic style, heavily reminiscent of Malory. The young Tolkien takes great and sometimes clumsy pains to emphasize the glory and chivalry of epic warfare, where fate turns on the skill and courage of heroes and not on the drill of divisions and the supply of artillery shells. This is, if you like, a reaction against the squalid and seemingly pointless fighting Tolkien had actually seen; but it is neither an allegory nor a satire of it. It is simply an escape, or rather, a quest: a desperate attempt to rediscover, in the practices of a simpler and nobler age, the need and cause of courage, the spirit that makes men willing to fight and die defending their homes and loved ones.\nDonaldson, too, was susceptible to this appeal. Although a conscientious objector and in some measure a pacifist, he recognized that even a hopeless war may be preferable to mere surrender. In The Illearth War Hile Troy, another man from Covenant’s ‘real’ world, compares his former work at the Pentagon with his new role as the commander of the Land’s army, the Warward:\n‘I’m useful to something worth being useful to. The issues at stake in this war are the only ones I’ve ever seen worth fighting for. The life of the Land is beautiful. It deserves preservation. For once, I can do some good. Instead of spending my time on troop deployment, first- and second-strike capabilities, superready status, demoralization parameters, nuclear induction of lethal genetic events, I can help defend against a genuine evil. The world we came from — the “real” world hasn’t got such clear colors, no blue and black and green and red, “ebon ichor incarnadine viridian.” Gray is the color of “reality.”’\nThis is a fine example of the likeness and difference between Tolkien and Donaldson. It is the very likeness that points up the difference: the difference is that the likeness is made explicit. In all Tolkien’s descriptions of battles, at Helm’s Deep and the Pelennor Fields and the rest, there is no reference to modern modes of warfare; the contrast and the criticism are mute and implicit. A man of Malory’s time could read Tolkien with understanding and recognition, though some of the vocabulary would be strange to him. But Hile Troy is utterly modern, and can only be understood by one with a knowledge of the modern world.\nIncidentally, Donaldson has earned a lot of disrespect for his vocabulary, which ranges from the rococo to the bizarre. ‘Ebon ichor incarnadine viridian’ is a particularly concentrated example. Ursula K. Le Guin has called the word ichor ‘the infallible touchstone of the seventh-rate’, which ‘bores the bejesus out of everybody’. It is certainly not one of Donaldson’s more felicitous word-choices. The prose of the Covenant books is liberally strewn with such questionable jewels as coigned, orieled, threnody, theurgy, unhermeneuticable (!), sibilating, chrysoprastic, irenic, and the ever-popular roynish. This last word is used as a sort of Homeric epithet to describe the ur-viles, the ‘black roynish’ kindred of the Demondim-spawn. Ur-viles are one of Donaldson’s more memorable and original inventions, eyeless, wizardly, sinister, and thoroughly inscrutable. But I never could discover what was particularly roynish about them; indeed, from Donaldson’s usage of the word, I could never figure out what roynish meant at all. The OED gives it as a variant of roinish, defined thus: ‘Covered with scale or scurf; scabby, scurvy, coarse, mean, paltry, base.’ The smooth skins and austerely evil magics of the ur-viles do not seem to suit the word well.\nDonaldson also has a strange tendency to use clench as every part of speech under the sun. To my knowledge he has not yet used it as an interjection or a definite article, but one must not set arbitrary limits to his genius. And he gives a strange sort of value to imprecise, which is usually a Donaldsonian understatement for ‘utterly wrong or bogus’. These peculiarities give his prose somewhat of the aspect of a magpie’s nest, cluttered with bright shiny objects of unknown or forgotten use. This is not an unfair criticism; he has said himself that he keeps lists of rare words encountered in his reading, and does not always look them up in a dictionary before attempting to use them. In consequence his usages of such words are, in his own personal acceptation of the term, ‘imprecise’. When I first read the Covenant books at fourteen, I merely skipped over the words I did not know, or tried to interpret them from context. This is probably the best way to approach Donaldson’s prose; those who have a dictionary at their elbow as they read are likely to get rather angry.\nOn the other hand, it must be said that Donaldson is capable of wonderfully lyrical passages, relying heavily on the sound of words, even when their meaning sheds no light on his intent. He is a very considerable prose poet, a quality not much appreciated by most modern readers. Like Tolkien, he decks his fiction with verses, though as a rule of a very much lower quality; he descends to vers libre and doggerel, as Tolkien never did. A little later he developed some real facility with formal and metrical verse. Two verses in particular from the later Covenant books, ‘My heart has rooms that sigh with dust’ and ‘Let those who sail the Sea bow down’, have some claim to be called poetry even by snobs.\nBut let us leave Donaldson’s prose and return to his Method. Tom Shippey has put his finger on the cardinal difference between Tolkien and the Modernists:\nTolkien’s approach to the ideas or the devices accepted as modernist is radically different because they are on principle not literary. He used ‘mythical method’ not because it was an interesting method but because he believed that the myths were true. . . . He experimented with language not to see what interesting effects could be produced but because he thought all forms of human language were already an experiment.\nIn this, Donaldson is very much on the Modernist side. His characters and situations do not exist for their own sake but because they are effective as symbols. Here, in the ‘Gradual Interview’ on his website, he describes a method antithetical to Tolkien’s:\nMy general view of the kind of fantasy I write is that it’s a specialized form of psychodrama. Putting the issue as simply as I can: the story is a human mind turned inside out, and all of the internal forces which drive that mind are dramatized as if they were external characters, places, and events. This is easier to see in the first ‘Chronicles’ because the story is simpler: the Land and everyone in it is an external manifestation of Covenant’s internal journey/struggle. Everything is more complex in ‘The Second Chronicles’ because there are two minds being turned inside out. Which means that there are actually three stories at work: Covenant’s, Linden’s, and the interaction between the two.\nWith the two words ‘as if’, Donaldson rejects the genuine epic; and when you analyse what remains, it all comes down to that old friend of the literati, the pathetic fallacy. He writes of battles fought with swords and spears (and wizards’ staffs) because that is an interesting way to comment on the spiritual battle in the hero’s mind. He makes that hero a leper because he wants to point out how many of us suffer from a leprosy of the soul. If you strip away the voluptuous flesh of the Land and expose the bare bones of the plot, you will find that Covenant is satirical and symbolic and bitingly topical. None of these things are true of Tolkien’s major works. You cannot strip away the voluptuous flesh of Middle-earth to expose the bones of the plot, because the bones themselves are Middle-earth. As Tolkien said in a letter to a reader: ‘The story is really a story of what happened in B.C. year X, and it just happened to people who were like that!’ With Donaldson one never forgets that the people to whom the story ‘just happened’ are carefully constructed to be ‘like that’ in the service of his theme. It is the tradition not of Beowulf and the Eddas but of Utopia and Gulliver’s Travels.\nIn my opinion, what Donaldson attempted to do, and the degree to which he succeeded, is considerably more of a literary accomplishment than anything that Abercrombie, Bakker, or any of the other epic fantasy authors have managed to do. And if his more recent work has not been of a similar level – and it has not – that does not detract from the excellence of the first series.\nDonaldson may be a modernist, but he is a moral modernist, and as such, his color palette considerably exceeds that of the more nihilistic authors. So, it should be no surprise that the images he paints are rather more vivid than theirs.\nSimon also rather helpfully explains why the Second Chronicles and subsequent books are mediocrities and should not be taken into account when considering Stephen Donaldson.\nA year or two later, when the first Covenant trilogy was a runaway success, casting even del Rey’s pet, Terry Brooks, in the shade, Donaldson was duly called upon for a sequel. He had some difficulty in coming up with one, as he had never intended to go beyond the original trilogy. To solve this problem, he introduced a new character from the ‘real’ world, a physician named Linden Avery. And to increase her importance, and also to help along those readers who might not have read the first three books, he made her the chief viewpoint character of the second trilogy. Del Rey was outraged. He threatened to reject the new books outright, saying: ‘You can’t tell a Tarzan story from Jane’s point of view!’ (His superiors at Ballantine Books, rather than lose Donaldson and his undeniable earning-power, took him away from del Rey and gave him an editor he could work with.)\nIt should never be a surprise when an author’s effort to turn out additional work for hire fails to rise to the level of his labor of love. Stephen Donaldson is not one of my favorite authors. He is not one of my 50 favorite authors. But, as an author of epic fantasy myself, I respect his greatest accomplishment, the original Chronicles of Thomas Covenant.",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-01T14:00:00+00:00"
}