{
  "url": "https://voxday.net/2017/09/24/voxiversity-update/",
  "scraped_at": "2025-12-19T10:25:09.931428",
  "title": "Voxiversity update",
  "date_display": "September 24, 2017",
  "date_iso": "2017-09-24T18:00:00+00:00",
  "date_from_url": "2017-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First of all, thanks very much to everyone who is backing <a href=\"https://freestartr.com/project/voxiversity/\"><b><i>Voxiversity</i></b></a>. It is much appreciated and we are genuinely stoked about what you have made possible.</p><p>Second, I am still in the process of acquiring the required equipment, which is not quite as accessible here as one might like it to be. I have the Lavalier microphone, which works well, but I need a little adapter in order to get the better quality that will entail from going through the FocusRite amplifier I already have instead of going directly into the PC’s mic-in input. The light is ordered and is en route, but we’re still trying to find a place that can provide the stand and diffusor.</p><p>None of this is a pressing problem, however, as my producer is presently occupied with finishing the video for Alt⭐️Hero, which I can already testify is awesome and more Professional Comics in appearance than I was expecting. Note to self: we’re going to need a Castalia House Comics logo. Or is that Castalia Comics? We’ll figure it out later. While we’re getting set up for <i>Voxiversity 001: Immigration and War</i>, he’s going to release a few more one-minute trailers akin to <a href=\"https://www.youtube.com/watch?v=Sv7bO0e8iaQ\">Know Thyself</a>, in part because they’ve proven to be popular, but also because it is an ideal way for us to experiment with different ideas before getting in too deep to something that doesn’t work.</p><p>In the meantime, I’ll continue to do Darkstreams, including tonight’s on the NFL protests, and I’ll also be doing an interview with Cernovich Media tomorrow on the subject. But mostly, I’ll be finishing <b><i><a href=\"https://www.amazon.com/SJWs-Always-Double-Down-Anticipating-ebook/dp/B075BGGKLG\">SJWADD</a></i></b>, which comes out in 15 days. Once that is out, I’ll be focusing on Voxiversity and on getting the extended edition of <i><b><a href=\"http://amzn.to/2hgubn2\">A Sea of Skulls</a></b></i> out in time for Christmas. I can also promise that we will be completing Jerry Pournelle’s <i>There Will Be War</i> series this year, with Volumes VII and VIII being released this fall.</p></div>",
  "content_text": "First of all, thanks very much to everyone who is backing\nVoxiversity\n. It is much appreciated and we are genuinely stoked about what you have made possible.\nSecond, I am still in the process of acquiring the required equipment, which is not quite as accessible here as one might like it to be. I have the Lavalier microphone, which works well, but I need a little adapter in order to get the better quality that will entail from going through the FocusRite amplifier I already have instead of going directly into the PC’s mic-in input. The light is ordered and is en route, but we’re still trying to find a place that can provide the stand and diffusor.\nNone of this is a pressing problem, however, as my producer is presently occupied with finishing the video for Alt⭐️Hero, which I can already testify is awesome and more Professional Comics in appearance than I was expecting. Note to self: we’re going to need a Castalia House Comics logo. Or is that Castalia Comics? We’ll figure it out later. While we’re getting set up for\nVoxiversity 001: Immigration and War\n, he’s going to release a few more one-minute trailers akin to\nKnow Thyself\n, in part because they’ve proven to be popular, but also because it is an ideal way for us to experiment with different ideas before getting in too deep to something that doesn’t work.\nIn the meantime, I’ll continue to do Darkstreams, including tonight’s on the NFL protests, and I’ll also be doing an interview with Cernovich Media tomorrow on the subject. But mostly, I’ll be finishing\nSJWADD\n, which comes out in 15 days. Once that is out, I’ll be focusing on Voxiversity and on getting the extended edition of\nA Sea of Skulls\nout in time for Christmas. I can also promise that we will be completing Jerry Pournelle’s\nThere Will Be War\nseries this year, with Volumes VII and VIII being released this fall.",
  "tags": [
    "CastaliaHouse",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-09-24T17:00:00+00:00"
}