{
  "url": "https://voxday.net/2013/04/24/a-biologist-seeks-to-dumb-down-science/",
  "scraped_at": "2025-12-14T22:26:52.979777",
  "title": "A biologist seeks to dumb down science",
  "date_display": "April 24, 2013",
  "date_iso": "2013-04-24T13:30:00+00:00",
  "date_from_url": "2013-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This fascinating call <a href=\"http://online.wsj.com/article/SB10001424127887323611604578398943650327184.html\">to dumb down science by E.O. Wilson</a> not only demonstrates my point about the relative lack of intelligence and intellectual rigor on the part of biologists, but is particularly untimely given the recent relevations concerning the economic work of some famous, and apparently similarly limited economists, Carmen Reinhart and Kenneth Rogoff.</p><blockquote class=\"tr_bq\"><p> For many young people who aspire to be scientists, the great bugbear<br> is mathematics. Without advanced math, how can you do serious work in<br> the sciences? Well, I have a professional secret to share: Many of the<br> most successful scientists in the world today are mathematically no more<br> than semiliterate.</br></br></br></br></p><p>Many of the most successful scientists in the world today are mathematically no more than semiliterate.</p><p>During<br> my decades of teaching biology at Harvard, I watched sadly as bright<br> undergraduates turned away from the possibility of a scientific career,<br> fearing that, without strong math skills, they would fail. This mistaken<br> assumption has deprived science of an immeasurable amount of sorely<br> needed talent. It has created a hemorrhage of brain power we need to<br> stanch.</br></br></br></br></br></br></p></blockquote><div class=\"insetContent embedType-image imageFormat-DV\"><div class=\"insetTree\"> Now, why would we need to stanch a hemorrhage of demonstrably inferior brains?  And how bright could those undergraduates be if they were not capable of the math? Wilson clearly not only isn’t mathematically more than semiliterate, (which TIA readers will note is something I previously observed about Richard Dawkins as well), he also doesn’t understand the current state of supply and demand in his field.  We already have far more biologists than even the currently inflated state of higher education can support.<p>The fact that E.O. Wilson is considered a great scientist isn’t an indication that biology doesn’t need mathematically adept individuals, it is an indictment of biology and its butterfly collectors.  While it is true that higher math is not always required, the panoply of mathematical, statistical, and logical errors riddling his field demonstrates that, at the very least, biology could use more people who are at least capable of mastering calculus, not less.</p><p>Wilson’s article is particularly amusing in light of Mike Williamson’s claim of the intellectual inferiority of “creationtards”.  I have a homeschooled kid of junior high school age who is already more mathematically advanced than one of the most famous scientific advocates of TE(p)NS was when he was in his thirties and a tenured professor at Harvard.</p><p>While it is true that exceptional mathematical skills are not required for formulating scientific hypotheses, they serve as a reasonable proxy for intelligence, and that is necessary for both formulating the hypotheses as well as designing legitimate tests for them.  Wilson himself notes that the “annals of theoretical biology are clogged with mathematical models that either can be safely ignored or, when tested, fail.” The same is true of economics, and it is a direct result of insufficient intelligence – or more ominously, insufficient integrity – being used in the construction and testing of those models.</p><p>Of course, it surely doesn’t help that many, if not most, of those models are conceptually based on the philosophical argument known as “natural selection”.  One would think that the very high failure rate would cause Wilson to at least consider the possibility that the conceptual framework is false, but then, as we can reasonably surmise, logic is not his strong point.</p><p>One wonders if it is conceivable that the real reason Wilson wants less intelligent students studying biology is because that is the only way evolutionists will be able to continue indoctrinating undergraduates with the Neo-Darwinian theory in the future without it raising too many awkward questions in their minds.</p></div></div></div>",
  "content_text": "This fascinating call\nto dumb down science by E.O. Wilson\nnot only demonstrates my point about the relative lack of intelligence and intellectual rigor on the part of biologists, but is particularly untimely given the recent relevations concerning the economic work of some famous, and apparently similarly limited economists, Carmen Reinhart and Kenneth Rogoff.\nFor many young people who aspire to be scientists, the great bugbear\nis mathematics. Without advanced math, how can you do serious work in\nthe sciences? Well, I have a professional secret to share: Many of the\nmost successful scientists in the world today are mathematically no more\nthan semiliterate.\nMany of the most successful scientists in the world today are mathematically no more than semiliterate.\nDuring\nmy decades of teaching biology at Harvard, I watched sadly as bright\nundergraduates turned away from the possibility of a scientific career,\nfearing that, without strong math skills, they would fail. This mistaken\nassumption has deprived science of an immeasurable amount of sorely\nneeded talent. It has created a hemorrhage of brain power we need to\nstanch.\nNow, why would we need to stanch a hemorrhage of demonstrably inferior brains?  And how bright could those undergraduates be if they were not capable of the math? Wilson clearly not only isn’t mathematically more than semiliterate, (which TIA readers will note is something I previously observed about Richard Dawkins as well), he also doesn’t understand the current state of supply and demand in his field.  We already have far more biologists than even the currently inflated state of higher education can support.\nThe fact that E.O. Wilson is considered a great scientist isn’t an indication that biology doesn’t need mathematically adept individuals, it is an indictment of biology and its butterfly collectors.  While it is true that higher math is not always required, the panoply of mathematical, statistical, and logical errors riddling his field demonstrates that, at the very least, biology could use more people who are at least capable of mastering calculus, not less.\nWilson’s article is particularly amusing in light of Mike Williamson’s claim of the intellectual inferiority of “creationtards”.  I have a homeschooled kid of junior high school age who is already more mathematically advanced than one of the most famous scientific advocates of TE(p)NS was when he was in his thirties and a tenured professor at Harvard.\nWhile it is true that exceptional mathematical skills are not required for formulating scientific hypotheses, they serve as a reasonable proxy for intelligence, and that is necessary for both formulating the hypotheses as well as designing legitimate tests for them.  Wilson himself notes that the “annals of theoretical biology are clogged with mathematical models that either can be safely ignored or, when tested, fail.” The same is true of economics, and it is a direct result of insufficient intelligence – or more ominously, insufficient integrity – being used in the construction and testing of those models.\nOf course, it surely doesn’t help that many, if not most, of those models are conceptually based on the philosophical argument known as “natural selection”.  One would think that the very high failure rate would cause Wilson to at least consider the possibility that the conceptual framework is false, but then, as we can reasonably surmise, logic is not his strong point.\nOne wonders if it is conceivable that the real reason Wilson wants less intelligent students studying biology is because that is the only way evolutionists will be able to continue indoctrinating undergraduates with the Neo-Darwinian theory in the future without it raising too many awkward questions in their minds.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-24T12:30:00+00:00"
}