{
  "url": "https://voxday.net/2013/04/08/a-review-of-wardogs-coin/",
  "scraped_at": "2025-12-14T22:25:19.870877",
  "title": "A review of The Wardog’s Coin",
  "date_display": "April 8, 2013",
  "date_iso": "2013-04-08T17:00:00+00:00",
  "date_from_url": "2013-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Moeller, Pulp Writer, <a href=\"http://www.jonathanmoeller.com/writer/?p=3521\">reviews The Wardog’s Coin</a>:</p><blockquote class=\"tr_bq\"><p> Last year, I read A THRONE OF BONES by Vox Day, and thought it was one of the more interesting new epic fantasy novels I’ve read. The author was kind enough to send me an advance copy of THE WARDOG’S COIN, a pair of short stories set in THRONE’s setting of Selenoth – specifically THE WARDOG’S COIN and QALABI DAWN.</p><p>In THE WARDOG’S COIN, the protagonist is the sergeant in a human mercenary company fighting for an elven kingdom against a horde of goblins and orcs. (The story’s name comes from the coin necklace each of the mercenaries bears – they act as sort of a dog tag.) What is supposed to be an easy assignment quickly turns into a death trap once the mercenaries realize the orcs are far more formidable than they expected – and that the elves are not unduly concerned if their hirelings survive or not. The mercenaries’ only hope of survival is through an audacious and risky plan. THE WARDOG’S COIN reminded me a great deal of Glen Cook’s better BLACK COMPANY books, and also had some moments of surprising hilarity – the sergeant’s attempt to get a recalcitrant pig to move is one of them. I did not care for the sergeant’s dialect (it reminded me of the farmer’s final monologue in HP Lovecraft’s THE COLOUR OUT OF SPACE, alas), but that was only a minor flaw in an otherwise good story.</p><p>The first story was good, but I think the second, QALABI DAWN, was more interesting…. I rather liked the depiction of the cat-people – their perspectives were truly alien, which is a hard trick for a writer to pull off.</p></blockquote><p>This is just an excerpt, so be sure to read the entire review at Jonathan’s site. In related news, I am pleased to announce that Marcher Lord Hinterlands will be publishing the hardcover version of <i>Summa Elvetica: A Casuistry of the Elvish Controversy</i>, in May.  The book will be priced at $24.99 and will be approximately 450 pages, as it will not only include the short novel, (modestly updated for the purposes of harmonization with <i>A Throne of Bones</i>), but eight other stories set in Selenoth.</p><p>The stories included are: “A Magic Broken”, “The Wardog’s Coin”, “Qalabi Dawn”, “Master of Cats”, “Birth of an Order”, “The Last Witchking”, “The Hoblets of Wiccam Fensboro”, and “Opera Vita Aeterna”.</p><p>Those who wish to preorder from Marcher Lord can do so at a price of $17.99. Preorders will also come with a free ebook copy of <i>The Last Witchking</i>, which will be published in May at a price of $1.99; please specify if your preference is epub or mobi.  <i>The Last Witchking</i> will consist of the title story and the two other stories not previously available in ebook format.</p></div>",
  "content_text": "Jonathan Moeller, Pulp Writer,\nreviews The Wardog’s Coin\n:\nLast year, I read A THRONE OF BONES by Vox Day, and thought it was one of the more interesting new epic fantasy novels I’ve read. The author was kind enough to send me an advance copy of THE WARDOG’S COIN, a pair of short stories set in THRONE’s setting of Selenoth – specifically THE WARDOG’S COIN and QALABI DAWN.\nIn THE WARDOG’S COIN, the protagonist is the sergeant in a human mercenary company fighting for an elven kingdom against a horde of goblins and orcs. (The story’s name comes from the coin necklace each of the mercenaries bears – they act as sort of a dog tag.) What is supposed to be an easy assignment quickly turns into a death trap once the mercenaries realize the orcs are far more formidable than they expected – and that the elves are not unduly concerned if their hirelings survive or not. The mercenaries’ only hope of survival is through an audacious and risky plan. THE WARDOG’S COIN reminded me a great deal of Glen Cook’s better BLACK COMPANY books, and also had some moments of surprising hilarity – the sergeant’s attempt to get a recalcitrant pig to move is one of them. I did not care for the sergeant’s dialect (it reminded me of the farmer’s final monologue in HP Lovecraft’s THE COLOUR OUT OF SPACE, alas), but that was only a minor flaw in an otherwise good story.\nThe first story was good, but I think the second, QALABI DAWN, was more interesting…. I rather liked the depiction of the cat-people – their perspectives were truly alien, which is a hard trick for a writer to pull off.\nThis is just an excerpt, so be sure to read the entire review at Jonathan’s site. In related news, I am pleased to announce that Marcher Lord Hinterlands will be publishing the hardcover version of\nSumma Elvetica: A Casuistry of the Elvish Controversy\n, in May.  The book will be priced at $24.99 and will be approximately 450 pages, as it will not only include the short novel, (modestly updated for the purposes of harmonization with\nA Throne of Bones\n), but eight other stories set in Selenoth.\nThe stories included are: “A Magic Broken”, “The Wardog’s Coin”, “Qalabi Dawn”, “Master of Cats”, “Birth of an Order”, “The Last Witchking”, “The Hoblets of Wiccam Fensboro”, and “Opera Vita Aeterna”.\nThose who wish to preorder from Marcher Lord can do so at a price of $17.99. Preorders will also come with a free ebook copy of\nThe Last Witchking\n, which will be published in May at a price of $1.99; please specify if your preference is epub or mobi.\nThe Last Witchking\nwill consist of the title story and the two other stories not previously available in ebook format.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-08T16:00:00+00:00"
}