{
  "url": "https://voxday.net/2013/04/11/book-review-terms-of-enlistmen/",
  "scraped_at": "2025-12-14T22:25:35.696958",
  "title": "Book review: Terms of Enlistment",
  "date_display": "April 11, 2013",
  "date_iso": "2013-04-11T14:54:00+00:00",
  "date_from_url": "2013-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.amazon.com/Terms-of-Enlistment-ebook/dp/B00BUQWVDC/ref=pd_sim_kstore_5/181-1120485-8877754\">TERMS OF ENLISTMENT</a><br>Marko Kloos<br>Rating: 7 of 10 </br></br></b></p><p><i>Terms of Enlistment</i> is a military sci-fi novel that will, like John Scalzi’s <i>Old Man’s War</i>, be compared by many to Robert Heinlein’s <i>Starship Troopers</i>.  It is the self-published debut novel from Marko Kloos, and it has justifiably been a surprise hit on Amazon, where it has been a top bestseller in science fiction as well as a top 100 seller overall.</p><p>Why? Well, there are no shortage of writers, (myself included), editors, and publishers, who would very much like to know the answer to that.</p><p>One possibility is that unlike the Heinlein novel, <i>Terms of Enlistment</i> is set in a dystopic future America where the cities are crowded, dirty ghettos, the space colonies are sparsely populated, far away, and nearly impossible to reach, and a permanent state of semi-war exists with the future Soviet Union. Kloos is very in touch with the zeitgeist in this regard; his protagonist doesn’t join the military out of a desire for glory or a sense of patriotism, but merely due to the prospect of some solid meals even if he fails the enlistment process.</p><p>Another is that Kloos hits the ideological sweet spot, writing about war and guns in the sort of loving, knowledgeable detail that appeals to readers on the right, while never wavering from the equalitarian ideals that are sacrosanct to readers on the left. Beyond the necessary structural assumptions, however, he doesn’t appear to be interested in taking sides or going off on tangents to deliver mini-sermons on patriotic virtue like Heinlein or the supreme importance of tolerance like Scalzi. Instead, he stays focused on his story and his characters, much to the benefit of them and the reader.  If none of the characters are particularly deep, neither are they cardboard characters set up to be either the good guy or the bad guy for purposes of Teaching An Important Lesson.</p><p>For all the dystopian grime of the setting and the attention to detail devoted to the weaponry, Kloos abides by what has become the SF-MIL trope of a sex-neutral military in which men and women enlist, shower, fight, and bunk together.  That this is entirely absurd is beside the point and in no way detracts from the story, which in fact depends quite heavily upon it.  (Let’s face it, if you’re going to feature giant missile-resistant aliens, also having female Medal of Honor winners who can best any man in hand-to-hand combat is hardly going to destroy the reader’s suspension of disbelief.)  I am arguably one of the foremost critics of <a href=\"http://www.blackgate.com/2009/02/15/on-kick-ass-female-fighters/\">the Warrior Woman trope</a> in SF/F, and I barely even noticed it.  With one important and necessary exception, the nominal sex of the soldiers in the book is almost entirely irrelevant.</p><p>And that brings us to the third, and perhaps the most powerful element of <i>Terms of Enlistment</i>, the element which is actually hinted at in the title. Underneath the science fiction and the military trappings, the novel is actually a romance novel about a first love that lasts. I don’t say this to denigrate the book, but to praise it, as Kloos weaves the elements together so seamlessly that the sheer impossibilities of the romance no more trouble the reader than the ludicrous machinations of Shakespeare in Romeo and Juliet. Having been rejected by the fading gatekeepers of SF/F and finding success through making his own way, it may be that Kloos has shown a way out of science fiction’s present ideological morass, in offering readers a solid futuristic love story with no shortage of action, in producing a book with strong appeal to both men and women, to both SF’s left and right.</p><p>Terms of Enlistment is a very readable debut novel that is better than the sum of its parts because those parts fit so well together. It is also a resounding rebuke to the world of professional publishing and its procurement system. One wishes Kloos continued success and hopes that as he is embraced by that world, as he inevitably will be, he does not devolve into yet another preachy progressive SF writer.</p><p><b>Story:</b> 3.5 of 5. It’s simple. It’s straightforward. It’s sufficiently interesting and compelling to hold the reader’s attention throughout.  It is essentially divided into two parts; I tended to find the first part more interesting than the second, but at no point did I lose interest in finding out what happened next. There are certainly aspects to the plot that would tend to strain credulity should one wish to dwell on them, but this isn’t a novel to make one think, it is one to simply kick back and read through in a sitting or three.</p><p><b>Style:</b> 3 of 5. It’s simple. It’s straightforward. If there are no fireworks, there are no real clunkers either. The best thing about Kloos’s writing style is that it does its job and doesn’t get in the way of the story.</p><p><b>Characters:</b> 3 of 5. They are likable and one stays interested in their fates, but they are not what one would call either deep or developed.  We never understand why Grayson, the protagonist, is so hung up on his Navy girl that he is willing to swap services and follow her into space. We never learn why she stays, as far as we know, faithful to him and isn’t involved with two or three of the other officers on her ship. We know they care about each other, what we really never find out is why.</p><p><b>Creativity:</b> 3 of 5. There actually isn’t much in the way of creativity here, but the dystopic world is presented so competently, so vividly, that I simply couldn’t reasonably claim that it is below average in any way. Have we seen it before? Of course, hence the comparisons to <i>Starship Troopers</i> and <i>Old Man’s War</i>. But the familiarity with books we enjoyed when we were younger is part of the book’s appeal; it is not always necessary to reinvent the wheel.  And if one cannot praise an author who doesn’t do something he has no need to do, neither can one criticize him.</p><p><b>Text sample: </b><i>All of my roommates have chevrons on their collars. Two of them are E-2s, with single chevrons, and the third is an E-3, a Private First Class, a chevron with a rocker underneath. People don’t usually make E-2 right out of Basic unless they were top flight in their training battalion like Halley, and E-3 promotions don’t ever happen before a year of active service.<br>“Am I the only new guy in this squad?” I ask.<br>“Yep,” one of them confirms. “Our platoon got four this cycle, I think, including you. They trickle the new guys in like that, so you can learn on the job. Grayson, is it?”<br>“Yeah.”<br>The soldier across the table from me extends his hand, and I shake it.<br>“I’m Baker. The cheating fuck over there trying to look at my cards is Priest, and the one with the ponytail is Hansen.”<br>I nod at each of them in turn.<br>“You’re in luck, Grayson. You’re in the squad with the best squad leader in the entire battalion.”<br>“In the entire brigade,” Hansen corrects. She has almond-shaped eyes and very white and even teeth, evidence of better dental care than you can get anywhere within ten miles of a Public Residence Cluster.<br>“Oh, yeah? What’s his name?”<br>“Her name.” Priest gives up his attempt to sneak a peek at Baker’s cards, and leans back in his chair. “Staff Sergeant Fallon. She used to be a First Sergeant, but they busted her down for striking an officer.”<br>“I thought they kicked you out of the service for hitting a superior,” I say, smelling a military fish tale.<br>“Oh, they do,” Hansen says. “That’s unless you’re a Medal of Honor winner. They don’t get rid of certified heroes. It would be bad PR.”<br>“Medal of Honor?” I ask, and the disbelief in my face makes my three roommates grin with delight. “As in, that blue ribbon with the white stars that goes on top of all the other ribbons?”<br>“That’s the one. She got it when the NAC did that excursion into mainland China a few years back, at the Battle of Dalian. You get the Medal, you can ask for any assignment anywhere in the Service, and she went right back to her old unit once she was out of the hospital.”<br>“That’s pretty wild. Is she a complete hard-ass?”<br>“Not at all. She’s got no patience for slackers, but as long as you pull your weight and don’t look like you’re clueless, she’s hands-off.”<br>“That doesn’t sound too bad,” I say. “I was expecting…hell, I have no idea what I was expecting, actually.”<br>“You were expecting some sort of penal colony,” Baker says amicably. “You thought you pulled the shittiest card in the deck when they told you that you’re going TA, right?”<br>There’s no point denying it, so I nod.<br>“That’s what everyone thinks at first. We all did. But this is a good outfit. Our sergeants know their shit, and our officers mostly leave us alone. We get the job done, and we look after each other. I’ve been TA for almost two years, and I wouldn’t take a garrison post on a colony if you paid me double.”<br>The others at the table nod in agreement.<br>I’m still disappointed about not going into space, and I have no idea whether I’ll feel the same way about the TA in two years. For better or for worse, however, this place will be my home until my service time is up, so I decide that I might as well make the best of it.<br>“You play cards, Grayson?” Hansen asks.<br>“Sure,” I say, and pull my chair up to the table.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></i></p></div>",
  "content_text": "TERMS OF ENLISTMENT\nMarko Kloos\nRating: 7 of 10\nTerms of Enlistment\nis a military sci-fi novel that will, like John Scalzi’s\nOld Man’s War\n, be compared by many to Robert Heinlein’s\nStarship Troopers\n.  It is the self-published debut novel from Marko Kloos, and it has justifiably been a surprise hit on Amazon, where it has been a top bestseller in science fiction as well as a top 100 seller overall.\nWhy? Well, there are no shortage of writers, (myself included), editors, and publishers, who would very much like to know the answer to that.\nOne possibility is that unlike the Heinlein novel,\nTerms of Enlistment\nis set in a dystopic future America where the cities are crowded, dirty ghettos, the space colonies are sparsely populated, far away, and nearly impossible to reach, and a permanent state of semi-war exists with the future Soviet Union. Kloos is very in touch with the zeitgeist in this regard; his protagonist doesn’t join the military out of a desire for glory or a sense of patriotism, but merely due to the prospect of some solid meals even if he fails the enlistment process.\nAnother is that Kloos hits the ideological sweet spot, writing about war and guns in the sort of loving, knowledgeable detail that appeals to readers on the right, while never wavering from the equalitarian ideals that are sacrosanct to readers on the left. Beyond the necessary structural assumptions, however, he doesn’t appear to be interested in taking sides or going off on tangents to deliver mini-sermons on patriotic virtue like Heinlein or the supreme importance of tolerance like Scalzi. Instead, he stays focused on his story and his characters, much to the benefit of them and the reader.  If none of the characters are particularly deep, neither are they cardboard characters set up to be either the good guy or the bad guy for purposes of Teaching An Important Lesson.\nFor all the dystopian grime of the setting and the attention to detail devoted to the weaponry, Kloos abides by what has become the SF-MIL trope of a sex-neutral military in which men and women enlist, shower, fight, and bunk together.  That this is entirely absurd is beside the point and in no way detracts from the story, which in fact depends quite heavily upon it.  (Let’s face it, if you’re going to feature giant missile-resistant aliens, also having female Medal of Honor winners who can best any man in hand-to-hand combat is hardly going to destroy the reader’s suspension of disbelief.)  I am arguably one of the foremost critics of\nthe Warrior Woman trope\nin SF/F, and I barely even noticed it.  With one important and necessary exception, the nominal sex of the soldiers in the book is almost entirely irrelevant.\nAnd that brings us to the third, and perhaps the most powerful element of\nTerms of Enlistment\n, the element which is actually hinted at in the title. Underneath the science fiction and the military trappings, the novel is actually a romance novel about a first love that lasts. I don’t say this to denigrate the book, but to praise it, as Kloos weaves the elements together so seamlessly that the sheer impossibilities of the romance no more trouble the reader than the ludicrous machinations of Shakespeare in Romeo and Juliet. Having been rejected by the fading gatekeepers of SF/F and finding success through making his own way, it may be that Kloos has shown a way out of science fiction’s present ideological morass, in offering readers a solid futuristic love story with no shortage of action, in producing a book with strong appeal to both men and women, to both SF’s left and right.\nTerms of Enlistment is a very readable debut novel that is better than the sum of its parts because those parts fit so well together. It is also a resounding rebuke to the world of professional publishing and its procurement system. One wishes Kloos continued success and hopes that as he is embraced by that world, as he inevitably will be, he does not devolve into yet another preachy progressive SF writer.\nStory:\n3.5 of 5. It’s simple. It’s straightforward. It’s sufficiently interesting and compelling to hold the reader’s attention throughout.  It is essentially divided into two parts; I tended to find the first part more interesting than the second, but at no point did I lose interest in finding out what happened next. There are certainly aspects to the plot that would tend to strain credulity should one wish to dwell on them, but this isn’t a novel to make one think, it is one to simply kick back and read through in a sitting or three.\nStyle:\n3 of 5. It’s simple. It’s straightforward. If there are no fireworks, there are no real clunkers either. The best thing about Kloos’s writing style is that it does its job and doesn’t get in the way of the story.\nCharacters:\n3 of 5. They are likable and one stays interested in their fates, but they are not what one would call either deep or developed.  We never understand why Grayson, the protagonist, is so hung up on his Navy girl that he is willing to swap services and follow her into space. We never learn why she stays, as far as we know, faithful to him and isn’t involved with two or three of the other officers on her ship. We know they care about each other, what we really never find out is why.\nCreativity:\n3 of 5. There actually isn’t much in the way of creativity here, but the dystopic world is presented so competently, so vividly, that I simply couldn’t reasonably claim that it is below average in any way. Have we seen it before? Of course, hence the comparisons to\nStarship Troopers\nand\nOld Man’s War\n. But the familiarity with books we enjoyed when we were younger is part of the book’s appeal; it is not always necessary to reinvent the wheel.  And if one cannot praise an author who doesn’t do something he has no need to do, neither can one criticize him.\nText sample:\nAll of my roommates have chevrons on their collars. Two of them are E-2s, with single chevrons, and the third is an E-3, a Private First Class, a chevron with a rocker underneath. People don’t usually make E-2 right out of Basic unless they were top flight in their training battalion like Halley, and E-3 promotions don’t ever happen before a year of active service.\n“Am I the only new guy in this squad?” I ask.\n“Yep,” one of them confirms. “Our platoon got four this cycle, I think, including you. They trickle the new guys in like that, so you can learn on the job. Grayson, is it?”\n“Yeah.”\nThe soldier across the table from me extends his hand, and I shake it.\n“I’m Baker. The cheating fuck over there trying to look at my cards is Priest, and the one with the ponytail is Hansen.”\nI nod at each of them in turn.\n“You’re in luck, Grayson. You’re in the squad with the best squad leader in the entire battalion.”\n“In the entire brigade,” Hansen corrects. She has almond-shaped eyes and very white and even teeth, evidence of better dental care than you can get anywhere within ten miles of a Public Residence Cluster.\n“Oh, yeah? What’s his name?”\n“Her name.” Priest gives up his attempt to sneak a peek at Baker’s cards, and leans back in his chair. “Staff Sergeant Fallon. She used to be a First Sergeant, but they busted her down for striking an officer.”\n“I thought they kicked you out of the service for hitting a superior,” I say, smelling a military fish tale.\n“Oh, they do,” Hansen says. “That’s unless you’re a Medal of Honor winner. They don’t get rid of certified heroes. It would be bad PR.”\n“Medal of Honor?” I ask, and the disbelief in my face makes my three roommates grin with delight. “As in, that blue ribbon with the white stars that goes on top of all the other ribbons?”\n“That’s the one. She got it when the NAC did that excursion into mainland China a few years back, at the Battle of Dalian. You get the Medal, you can ask for any assignment anywhere in the Service, and she went right back to her old unit once she was out of the hospital.”\n“That’s pretty wild. Is she a complete hard-ass?”\n“Not at all. She’s got no patience for slackers, but as long as you pull your weight and don’t look like you’re clueless, she’s hands-off.”\n“That doesn’t sound too bad,” I say. “I was expecting…hell, I have no idea what I was expecting, actually.”\n“You were expecting some sort of penal colony,” Baker says amicably. “You thought you pulled the shittiest card in the deck when they told you that you’re going TA, right?”\nThere’s no point denying it, so I nod.\n“That’s what everyone thinks at first. We all did. But this is a good outfit. Our sergeants know their shit, and our officers mostly leave us alone. We get the job done, and we look after each other. I’ve been TA for almost two years, and I wouldn’t take a garrison post on a colony if you paid me double.”\nThe others at the table nod in agreement.\nI’m still disappointed about not going into space, and I have no idea whether I’ll feel the same way about the TA in two years. For better or for worse, however, this place will be my home until my service time is up, so I decide that I might as well make the best of it.\n“You play cards, Grayson?” Hansen asks.\n“Sure,” I say, and pull my chair up to the table.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-11T13:54:00+00:00"
}