{
  "url": "https://voxday.net/2013/04/25/book-review-infinite-jes/",
  "scraped_at": "2025-12-14T22:26:59.679589",
  "title": "Book review: INFINITE JEST",
  "date_display": "April 25, 2013",
  "date_iso": "2013-04-25T12:30:00+00:00",
  "date_from_url": "2013-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><i>INFINITE JEST</i><br>David Foster Wallace<br>Rating: 3 of 10<br> </br></br></br></b></p><p>If nothing else, I now understand why David Foster Wallace killed himself. Despite being built up as the literary wunderkind of his generation, despite having been widely acclaimed as the author of one of greatest novels of the 20th century, he could not escape the realization that, at least as a novelist, he was a poser and a literary charlatan. Thanks to a tireless campaign by the New York literati and the fact that so few people who claim to admire the book actually bothered to read his magnum opus, he dodged one bullet following the publication of <i>Infinite Jest</i>.  But he couldn’t count on doing that twice, and he must have known that he would be left exposed to all and sundry upon publication of <i>The Pale King</i>.</p><p>Now, I’m not the least bit intimidated by large books nor do I find their girth intrinsically impressive.  I very much enjoyed <i>War and Peace</i> as well as <i>Cryptonomicon</i>. My own most recent novel runs more than 850 pages. But I will admit that it was hard and brutal slogging through the overly self-conscious, over-educated banality of Wallace’s <i>Infinite Jest</i>; the only literary experience to which I can reasonably compare it is reading two of the later Robert Jordan novels in <i>The Wheel of Time</i> series, back to back, after both novels have been translated into German and back again into English by Google Translate.  There is considerably less pulling of braids and considerably more in the way of physical and mental abnormalities in <i>Infinite Jest</i>, but that’s a fair approximation of the literary pleasure one can expect to find in Wallace’s so-called masterpiece.</p><p>It doesn’t take long to recognize Wallace’s High American Lit style. If you are familiar with Tom Robbins or John Irving, then you’ve read the distillation of David Foster Wallace<i>. Infinite Jest</i> is little more than an oversized, incoherent, less amusing version of <i>The World According to Garp</i>. It takes five times longer to say less than <i>Still Life with Woodpecker</i>. Take a few quirky and improbably intelligent characters with exaggerated vocabularies.  Go into<br> excruciating detail concerning the minute-by-minute existence of their<br> quotidian routines, especially regarding the sexual or toilet aspects,<br> then throw in some highly implausible gonzo drama produced by their<br> relationships with their cartoonishly dysfunctional families, inexplicably deformed lovers, or hopelessly deviant housemates.  Be sure to include a strong amateur sporting<br> element, be it wrestling or tennis.  At all times, be careful to<br> utilize the high-low technique of an unfamiliar and elevated vocabulary<br> taken straight from the OED alternating with the crudest vulgar slang. <br> The perspective, at all times, is one of vaguely bemused detachment; the<br> narrative only observes, it never acts.</br></br></br></br></br></br></br></br></br></p><p>When I finished <i>Infinite Jest</i>, a review of Paul Auster’s <i>New York Trilogy</i> by Ferdinand Bardamu came to mind: “[T]his neutered New York has produced a literati that spends all day<br> sniffing its own farts. Jonathan Safran Foer, Colson Whitehead, Nicole<br> Krauss, Gary Shteyngart, Jhumpa Lahiri, David Foster Wallace (actually<br> wait, he’s dead — I’ve never derived so much joy from a suicide in my<br> life), and all the rest: worthless hacks devoid of curiosity, humanity<br> or talent.”</br></br></br></br></br></p><p>There is very little genuine humanity in <i>Infinite Jest</i>. It is a curiously autistic novel, as if the emotions of the characters described in such extensive detail are being cataloged by someone who has never actually felt them. It is a decrepit bordello of freaks and wrecks, whose fictional realities are as alien as they are unconvincing to the sane and sober reader. After finishing the book, I was curious to read its various reviews in order to see who had been courageous enough to openly declare that the American literary prince was strutting about in the buff.  There were a few who weren’t afraid to point out that DFW wore no clothes, but to my surprise, easily the best review was by a writer who happens to know more than a little about inflated vocabularies and literary pretensions himself, our old friend Wängsty, known to the rest of the world as R. Scott Bakker.  <a href=\"http://rsbakker.wordpress.com/2011/10/14/alas-poor-wallace-a-review-of-infinite-jest/\">In his excellent review of <i>Infinite Jest</i></a>, he writes:</p><blockquote class=\"tr_bq\"><p> Like lovers and assholes (and reviews), <i>books sort readers</i>. I would argue that books like <i>Infinite Jest </i>identify<br> you–your affiliations, your beliefs and values, your politics–with the<br> same degree of accuracy as monster truck rallies….</br></br></p><p>This is the whole reason why publishers are keen to plaster testimonials on the cover of their books: to milk our authority and social proof biases. <i>Infinite Jest</i> is literally festooned with blurbs from a galaxy of authoritative sources: It arrives literally armoured in literary authority. We are told by a variety of serious people (who are taken very seriously by other serious people) that this is a seriously serious book. There can be little doubt that as far as the 1996 literary ingroup was concerned, <i>Infinite Jest</i> was a smashing communicative success.</p><p>Which should be no surprise. “I come to writing from a pretty hard-core, abstract place,” Wallace explains in The Boston Phoenix interview. “It comes out of technical philosophy and continental European theory, and extreme avante-garde shit.” Given who he was, and given he saw this as a conversation with good friends, and given that the seriously serious readers likely shared, as good friends often do, the bulk of his attitudes and aesthetic sensibilities, it’s easy to see how this book became as successful as it did. <i>Infinite Jest</i> is the product of a ingroup sender communicating to other ingroup receivers: insofar as those other receivers loved it, you can say that as a communication Infinite Jest was a tremendous ingroup success.</p><p>The problem is that one can say the same about <i>The Turner Diaries</i> or <i>Mein Kampf</i>.</p><p>I don’t pretend to know what literature is any metaphysical sense, but I do think that it has to have something to do with <i>transcendence</i>. What distinguishes literature from fiction in general is its ability to push <i>beyond</i>, beyond received dogmas, beyond comfort zones, and most importantly (because it indexes the possibility of the former two), beyond social ingroups. This is why communicative success and literary success are not one and the same thing. And this is also why outgroup readers generally find ingroup estimations of <i>literary </i>merit so unconvincing.</p><p>Make no mistake, <i>Infinite Jest </i>is a piece of genre fiction: something expressly written for a dedicated groups of readers possessing a relatively fixed set of expectations. It just so happens that this particular group of readers happen to command the cultural high ground when it comes to things linguistic and narrative. </p></blockquote><p>In the immortal words of Public Enemy, don’t believe the hype. Avante-garde shit, however extreme, is still, in the end, shit, and it tends to be more noxious than the more pedestrian varieties.  <i>Infinite Jest</i> is what might have been a decent 250-page novel stricken with a terminal elephantiasian cancer. Wallace’s excess verbosity and endless, pointless, pretentious, indefatigable digressions hang off and over the story like giant slabs of flesh swollen with fatty tumors; if this book were to come to life and take the shape of a man, it would resemble Mohammad Latif Khatana.</p><p>The most impressive thing about <i>Infinite Jest</i>, or as I found myself thinking of it, <i>Tedious Waste</i>, is the sheer magnitude of the deceit in the Foreword written by David Eggers.  There has seldom been a less honest paragraph written in the English language than this one:</p><p><i>“The book is 1,079 pages long and there is not one lazy sentence. The book is drum-tight and relentlessly smart, and though it does not wear its heart on its sleeve, it’s deeply felt and incredibly moving. That it was written in three years by a writer under thirty-five is very painful to think about. So let’s not think about that. The point is that it’s for all these reasons — acclaimed, daunting, not-lazy, drum-tight, very funny (we didn’t mention that yet but yes) — that you picked up this book. Now the question is this: Will you actually read it?” </i></p><p>There may not be one lazy sentence, whatever that might be, but there are thousands of totally unnecessary ones. The book is not drum-tight; it doesn’t even have an ending, or, for that matter, a coherent plot — and before any literati groupies attempt to protest, I will note that Wallace himself openly admitted as much — and it cannot possibly, by any reasonable metric, be described as “very funny”.  There are the occasional moments where Infinite Jest generates mild amusement, to be sure, but I never once on any of the 1,079 pages found myself provoked to laughter. It is not deeply felt; the descriptions of the game of tennis are far more loving than those of any of the human relationships, and I have to sincerely question the sanity of anyone who found it “incredibly moving”. It does not wear its heart on its sleeve because it does not have one; it is heartless.</p><p>Eggrers’s Foreword is pure PR puffery on a scale to make the inveterate circle-jerkers known as the <strike>Four</strike>Three Horsemen of the New Atheism roll their eyes.</p><p>It is telling that the reader has to be challenged to actually read it the book they are, by virtue of reading the forward, presently reading.  And yet, there is no point to actually reading the novel, even if one wishes to claim the literary cred for doing so. Given the observed behavior of the sort of people who desperately want to be seen as the sort of person who adores this sort of thing, the sort of individual who very much wants to consider himself part of the in-group for whom Wallace was writing, one can be sure that very, very few of them will have actually read more than a few chapters.  A few casual references to “wheelchair terrorists”, “that amazing game that combined geopolitics with tennis”, and “lethally enstupidating Entertainment”, plus throwing in a knowing joke about this being “The Year of The Taco Bell Cool Ranch Doritos Locos Taco”, should inspire sufficient panic in any other individual who pretends to have read <i>Infinite Jest</i> to convince him to enthusiastically nod, vociferously agree, and immediately change the subject.</p><p>I can’t say that I derived any pleasure, let alone joy, from David Foster Wallace’s suicide. But it doesn’t surprise me terribly to learn that a man whose whole essence and identity were derived from the supposedly exceptional quality of his writing would elect to kill himself after producing such a overrated work of unmitigated fraudulence. </p><p><i>Infinite Jest</i> is a joke, but it isn’t one that is intended at the reader’s expense. It is the author’s bitter view of himself and the small, shallow make-believe world in which he lived.</p><p><b>Story:</b> 1 of 5.  I won’t even bother attempting to describe the plot, such as it is.  Suffice it to say that it is ludicrous, unconvincing, incoherent, unfinished, weirdly remniscent of the 1970s, and despite Wallace’s attempt to involve the reader’s imagination in its completion, leaves him absolutely devoid of any curiosity concerning “what really happened”.  The insufficiently well-read might be surprised, even angered, to find their arduous effort in finishing the book so poorly rewarded. Those more familiar with the eminently predictable tricks of the neutered New York literati will simply smile wryly and close the book with a dismissive “yeah, I expected as much.”</p><p><b>Style:</b> 3 of 5. Harold Bloom was a little too harsh <a href=\"http://www.wwd.com/eye/people/the-full-bloom-3592315?full=true\">when he said</a>: “Infinite Jest is just<br> awful. It seems ridiculous to have to say it. He can’t think, he can’t<br> write. There’s no discernible talent.”  There is talent there, there is intelligence, the problem is that it is not put to effective use.  Wallace can write, but apparently his editor can’t edit. I enjoyed the occasional adroit turn of phrase, but they were far too few and far between to make up for the run-on sentences. I’ve translated Umberto Eco sentences from Italian that required five separate English sentences to make proper sense, and they were still shorter than some of Wallace’s unnecessarily extended monstrosities.</br></br></p><p><b>Characters:</b> 0 of 5. I don’t think it is controversial to say that you not only will find it hard to keep the vast cast of characters straight, but you won’t give a damn about what happens to any of them.  It’s almost a remarkable achievement of sorts that Wallace can provide so much detail about so many characters without making any of them feel even remotely credible or breathing life into any of them.  It takes a certain amount of inadvertent skill to render a healthy young NFL punter who seduces every woman he comes across almost completely indistinguishable from a hospitalized former drug addict who is the whitest knight in the history of American literature. And Wallace’s characters aren’t merely cardboard, they are cut out from a John Irving novel.</p><p><b>Creativity:</b> 3.5 of 5. I didn’t really know how to fairly consider this. Infinite Jest is certainly creative in certain senses, such as its structure and in some of the details of the idiotic plot. Its delving into the experience of addiction is actually fairly good. In other ways, there is a rigid adherence to exactly what one would expect from an author writing in this genre, complete with all the politically correct prejudices and myopic sensitivities. But in sum, it is different than the average novel, so I’m choosing to err on the side of mild generosity here.</p><p><b>Text sample: </b> <i>YEAR OF THE DEPEND ADULT UNDERGARMENT</i></p><p>On a White Flag Group Commitment to the Tough Shit But You Still Can’t Drink Group down in Braintree this past July, Don G., up at the podium, revealed publicly about how he was ashamed that he still as yet had no real solid understanding of a Higher Power. It’s suggested in the 3rd of Boston AA’s 12 Steps that you to turn your Diseased will over to the direction and love of ‘God as you understand Him.’ It’s supposed to be one of AA’s major selling points that you get to choose your own God. You get to make up your own understanding of God or a Higher Power or Whom-/Whatever. But Gately, at like ten months clean, at the TSBYSCD podium in Braintree, opines that at this juncture he’s so totally clueless and lost he’s thinking that he’d maybe rather have the White Flag Crocodiles just grab him by the lapels and just tell him what AA God to have an understanding of, and give him totally blunt and dogmatic orders about how to turn over his Diseased will to whatever this Higher Power is. He notes how he’s observed already that some Catholics and Fundamentalists now in AA had a childhood understanding of a Stern and Punishing–type God, and Gately’s heard them express incredible Gratitude that AA let them at long last let go and change over to an understanding of a Loving, Forgiving, Nurturing–type God. But at least these folks started out with some idea of Him/Her/It, whether fucked up or no. You might think it’d be easier if you Came In with 0 in the way of denominational background or preconceptions, you might think it’d be easier to sort of invent a Higher-Powerish God from scratch and then like erect an understanding, but Don Gately complains that this has not been his experience thus far. His sole experience so far is that he takes one of AA’s very rare specific suggestions and hits the knees in the A.M. and asks for Help and then hits the knees again at bedtime and says Thank You, whether he believes he’s talking to Anything/-body or not, and he somehow gets through that day clean. This, after ten months of ear-smoking concentration and reflection, is still all he feels like he ‘understands’ about the ‘God angle.’ Publicly, in front of a very tough and hard-ass-looking AA crowd, he sort of simultaneously confesses and complains that he feels like a rat that’s learned one route in the maze to the cheese and travels that route in a ratty-type fashion and whatnot. W/ the God thing being the cheese in the metaphor. Gately still feels like he has no access to the Big spiritual Picture. He feels about the ritualistic daily Please and Thank You prayers rather like like a hitter that’s on a hitting streak and doesn’t change his jock or socks or pre-game routine for as long as he’s on the streak. W/ sobriety being the hitting streak and whatnot, he explains. The whole church basement is literally blue with smoke. Gately says he feels like this is a pretty limp and lame understanding of a Higher Power: a cheese-easement or unwashed athletic supporter. He says but when he tries to go beyond the very basic rote automatic get-me-through-this-day-please stuff, when he kneels at other times and prays or meditates or tries to achieve a Big-Picture spiritual understanding of a God as he can understand Him, he feels Nothing — not nothing but Nothing, an edgeless blankness that somehow feels worse than the sort of unconsidered atheism he Came In with. He says he doesn’t know if any of this is coming through or making any sense or if it’s all just still symptomatic of a thoroughgoingly Diseased will and quote ‘spirit.’ He finds himself telling the Tough Shit But You Still Can’t Drink audience dark doubtful thoughts he wouldn’t have fucking ever dared tell Ferocious Francis man to man. He can’t even look at F.F. in the Crocodile’s row as he says that at this point the God-understanding stuff kind of makes him want to puke, from fear. Something you can’t see or hear or touch or smell: OK. All right. But something you can’t even feel? Because that’s what he feels when he tries to understand something to really sincerely pray to. Nothingness. He says when he tries to pray he gets this like image in his mind’s eye of the brainwaves or whatever of his prayers going out and out, with nothing to stop them, going, going, radiating out into like space and outliving him and still going and never hitting Anything out there, much less Something with an ear. Much much less Something with an ear that could possibly give a rat’s ass. He’s both pissed off and ashamed to be talking about this instead of how just completely good it is to just be getting through the day without ingesting a Substance, but there it is. This is what’s going on. He’s no closer to carrying out the suggestion of the 3rd Step than the day the Probie drove him over to his halfway house from Peabody Holding. The idea of this whole God thing makes him puke, still. And he is afraid. </p><p><i>And the same fucking thing happens again. The tough chain-smoking TSBYSCD Group all stands and applauds and the men give two-finger whistles, and people come up at the raffle-break to pump his big hand and even sometimes try and hug on him.</i><br> <i><br>It seems like every time he forgets himself and publicizes how he’s fucking up in sobriety Boston AAs fall all over themselves to tell him how good it was to hear him and to for God’s sake Keep Coming, for them if not for himself, whatever the fuck that means. </br></i></br></p></div>",
  "content_text": "INFINITE JEST\nDavid Foster Wallace\nRating: 3 of 10\nIf nothing else, I now understand why David Foster Wallace killed himself. Despite being built up as the literary wunderkind of his generation, despite having been widely acclaimed as the author of one of greatest novels of the 20th century, he could not escape the realization that, at least as a novelist, he was a poser and a literary charlatan. Thanks to a tireless campaign by the New York literati and the fact that so few people who claim to admire the book actually bothered to read his magnum opus, he dodged one bullet following the publication of\nInfinite Jest\n.  But he couldn’t count on doing that twice, and he must have known that he would be left exposed to all and sundry upon publication of\nThe Pale King\n.\nNow, I’m not the least bit intimidated by large books nor do I find their girth intrinsically impressive.  I very much enjoyed\nWar and Peace\nas well as\nCryptonomicon\n. My own most recent novel runs more than 850 pages. But I will admit that it was hard and brutal slogging through the overly self-conscious, over-educated banality of Wallace’s\nInfinite Jest\n; the only literary experience to which I can reasonably compare it is reading two of the later Robert Jordan novels in\nThe Wheel of Time\nseries, back to back, after both novels have been translated into German and back again into English by Google Translate.  There is considerably less pulling of braids and considerably more in the way of physical and mental abnormalities in\nInfinite Jest\n, but that’s a fair approximation of the literary pleasure one can expect to find in Wallace’s so-called masterpiece.\nIt doesn’t take long to recognize Wallace’s High American Lit style. If you are familiar with Tom Robbins or John Irving, then you’ve read the distillation of David Foster Wallace\n. Infinite Jest\nis little more than an oversized, incoherent, less amusing version of\nThe World According to Garp\n. It takes five times longer to say less than\nStill Life with Woodpecker\n. Take a few quirky and improbably intelligent characters with exaggerated vocabularies.  Go into\nexcruciating detail concerning the minute-by-minute existence of their\nquotidian routines, especially regarding the sexual or toilet aspects,\nthen throw in some highly implausible gonzo drama produced by their\nrelationships with their cartoonishly dysfunctional families, inexplicably deformed lovers, or hopelessly deviant housemates.  Be sure to include a strong amateur sporting\nelement, be it wrestling or tennis.  At all times, be careful to\nutilize the high-low technique of an unfamiliar and elevated vocabulary\ntaken straight from the OED alternating with the crudest vulgar slang.\nThe perspective, at all times, is one of vaguely bemused detachment; the\nnarrative only observes, it never acts.\nWhen I finished\nInfinite Jest\n, a review of Paul Auster’s\nNew York Trilogy\nby Ferdinand Bardamu came to mind: “[T]his neutered New York has produced a literati that spends all day\nsniffing its own farts. Jonathan Safran Foer, Colson Whitehead, Nicole\nKrauss, Gary Shteyngart, Jhumpa Lahiri, David Foster Wallace (actually\nwait, he’s dead — I’ve never derived so much joy from a suicide in my\nlife), and all the rest: worthless hacks devoid of curiosity, humanity\nor talent.”\nThere is very little genuine humanity in\nInfinite Jest\n. It is a curiously autistic novel, as if the emotions of the characters described in such extensive detail are being cataloged by someone who has never actually felt them. It is a decrepit bordello of freaks and wrecks, whose fictional realities are as alien as they are unconvincing to the sane and sober reader. After finishing the book, I was curious to read its various reviews in order to see who had been courageous enough to openly declare that the American literary prince was strutting about in the buff.  There were a few who weren’t afraid to point out that DFW wore no clothes, but to my surprise, easily the best review was by a writer who happens to know more than a little about inflated vocabularies and literary pretensions himself, our old friend Wängsty, known to the rest of the world as R. Scott Bakker.\nIn his excellent review of\nInfinite Jest\n, he writes:\nLike lovers and assholes (and reviews),\nbooks sort readers\n. I would argue that books like\nInfinite Jest\nidentify\nyou–your affiliations, your beliefs and values, your politics–with the\nsame degree of accuracy as monster truck rallies….\nThis is the whole reason why publishers are keen to plaster testimonials on the cover of their books: to milk our authority and social proof biases.\nInfinite Jest\nis literally festooned with blurbs from a galaxy of authoritative sources: It arrives literally armoured in literary authority. We are told by a variety of serious people (who are taken very seriously by other serious people) that this is a seriously serious book. There can be little doubt that as far as the 1996 literary ingroup was concerned,\nInfinite Jest\nwas a smashing communicative success.\nWhich should be no surprise. “I come to writing from a pretty hard-core, abstract place,” Wallace explains in The Boston Phoenix interview. “It comes out of technical philosophy and continental European theory, and extreme avante-garde shit.” Given who he was, and given he saw this as a conversation with good friends, and given that the seriously serious readers likely shared, as good friends often do, the bulk of his attitudes and aesthetic sensibilities, it’s easy to see how this book became as successful as it did.\nInfinite Jest\nis the product of a ingroup sender communicating to other ingroup receivers: insofar as those other receivers loved it, you can say that as a communication Infinite Jest was a tremendous ingroup success.\nThe problem is that one can say the same about\nThe Turner Diaries\nor\nMein Kampf\n.\nI don’t pretend to know what literature is any metaphysical sense, but I do think that it has to have something to do with\ntranscendence\n. What distinguishes literature from fiction in general is its ability to push\nbeyond\n, beyond received dogmas, beyond comfort zones, and most importantly (because it indexes the possibility of the former two), beyond social ingroups. This is why communicative success and literary success are not one and the same thing. And this is also why outgroup readers generally find ingroup estimations of\nliterary\nmerit so unconvincing.\nMake no mistake,\nInfinite Jest\nis a piece of genre fiction: something expressly written for a dedicated groups of readers possessing a relatively fixed set of expectations. It just so happens that this particular group of readers happen to command the cultural high ground when it comes to things linguistic and narrative.\nIn the immortal words of Public Enemy, don’t believe the hype. Avante-garde shit, however extreme, is still, in the end, shit, and it tends to be more noxious than the more pedestrian varieties.\nInfinite Jest\nis what might have been a decent 250-page novel stricken with a terminal elephantiasian cancer. Wallace’s excess verbosity and endless, pointless, pretentious, indefatigable digressions hang off and over the story like giant slabs of flesh swollen with fatty tumors; if this book were to come to life and take the shape of a man, it would resemble Mohammad Latif Khatana.\nThe most impressive thing about\nInfinite Jest\n, or as I found myself thinking of it,\nTedious Waste\n, is the sheer magnitude of the deceit in the Foreword written by David Eggers.  There has seldom been a less honest paragraph written in the English language than this one:\n“The book is 1,079 pages long and there is not one lazy sentence. The book is drum-tight and relentlessly smart, and though it does not wear its heart on its sleeve, it’s deeply felt and incredibly moving. That it was written in three years by a writer under thirty-five is very painful to think about. So let’s not think about that. The point is that it’s for all these reasons — acclaimed, daunting, not-lazy, drum-tight, very funny (we didn’t mention that yet but yes) — that you picked up this book. Now the question is this: Will you actually read it?”\nThere may not be one lazy sentence, whatever that might be, but there are thousands of totally unnecessary ones. The book is not drum-tight; it doesn’t even have an ending, or, for that matter, a coherent plot — and before any literati groupies attempt to protest, I will note that Wallace himself openly admitted as much — and it cannot possibly, by any reasonable metric, be described as “very funny”.  There are the occasional moments where Infinite Jest generates mild amusement, to be sure, but I never once on any of the 1,079 pages found myself provoked to laughter. It is not deeply felt; the descriptions of the game of tennis are far more loving than those of any of the human relationships, and I have to sincerely question the sanity of anyone who found it “incredibly moving”. It does not wear its heart on its sleeve because it does not have one; it is heartless.\nEggrers’s Foreword is pure PR puffery on a scale to make the inveterate circle-jerkers known as the\nFour\nThree Horsemen of the New Atheism roll their eyes.\nIt is telling that the reader has to be challenged to actually read it the book they are, by virtue of reading the forward, presently reading.  And yet, there is no point to actually reading the novel, even if one wishes to claim the literary cred for doing so. Given the observed behavior of the sort of people who desperately want to be seen as the sort of person who adores this sort of thing, the sort of individual who very much wants to consider himself part of the in-group for whom Wallace was writing, one can be sure that very, very few of them will have actually read more than a few chapters.  A few casual references to “wheelchair terrorists”, “that amazing game that combined geopolitics with tennis”, and “lethally enstupidating Entertainment”, plus throwing in a knowing joke about this being “The Year of The Taco Bell Cool Ranch Doritos Locos Taco”, should inspire sufficient panic in any other individual who pretends to have read\nInfinite Jest\nto convince him to enthusiastically nod, vociferously agree, and immediately change the subject.\nI can’t say that I derived any pleasure, let alone joy, from David Foster Wallace’s suicide. But it doesn’t surprise me terribly to learn that a man whose whole essence and identity were derived from the supposedly exceptional quality of his writing would elect to kill himself after producing such a overrated work of unmitigated fraudulence.\nInfinite Jest\nis a joke, but it isn’t one that is intended at the reader’s expense. It is the author’s bitter view of himself and the small, shallow make-believe world in which he lived.\nStory:\n1 of 5.  I won’t even bother attempting to describe the plot, such as it is.  Suffice it to say that it is ludicrous, unconvincing, incoherent, unfinished, weirdly remniscent of the 1970s, and despite Wallace’s attempt to involve the reader’s imagination in its completion, leaves him absolutely devoid of any curiosity concerning “what really happened”.  The insufficiently well-read might be surprised, even angered, to find their arduous effort in finishing the book so poorly rewarded. Those more familiar with the eminently predictable tricks of the neutered New York literati will simply smile wryly and close the book with a dismissive “yeah, I expected as much.”\nStyle:\n3 of 5. Harold Bloom was a little too harsh\nwhen he said\n: “Infinite Jest is just\nawful. It seems ridiculous to have to say it. He can’t think, he can’t\nwrite. There’s no discernible talent.”  There is talent there, there is intelligence, the problem is that it is not put to effective use.  Wallace can write, but apparently his editor can’t edit. I enjoyed the occasional adroit turn of phrase, but they were far too few and far between to make up for the run-on sentences. I’ve translated Umberto Eco sentences from Italian that required five separate English sentences to make proper sense, and they were still shorter than some of Wallace’s unnecessarily extended monstrosities.\nCharacters:\n0 of 5. I don’t think it is controversial to say that you not only will find it hard to keep the vast cast of characters straight, but you won’t give a damn about what happens to any of them.  It’s almost a remarkable achievement of sorts that Wallace can provide so much detail about so many characters without making any of them feel even remotely credible or breathing life into any of them.  It takes a certain amount of inadvertent skill to render a healthy young NFL punter who seduces every woman he comes across almost completely indistinguishable from a hospitalized former drug addict who is the whitest knight in the history of American literature. And Wallace’s characters aren’t merely cardboard, they are cut out from a John Irving novel.\nCreativity:\n3.5 of 5. I didn’t really know how to fairly consider this. Infinite Jest is certainly creative in certain senses, such as its structure and in some of the details of the idiotic plot. Its delving into the experience of addiction is actually fairly good. In other ways, there is a rigid adherence to exactly what one would expect from an author writing in this genre, complete with all the politically correct prejudices and myopic sensitivities. But in sum, it is different than the average novel, so I’m choosing to err on the side of mild generosity here.\nText sample:\nYEAR OF THE DEPEND ADULT UNDERGARMENT\nOn a White Flag Group Commitment to the Tough Shit But You Still Can’t Drink Group down in Braintree this past July, Don G., up at the podium, revealed publicly about how he was ashamed that he still as yet had no real solid understanding of a Higher Power. It’s suggested in the 3rd of Boston AA’s 12 Steps that you to turn your Diseased will over to the direction and love of ‘God as you understand Him.’ It’s supposed to be one of AA’s major selling points that you get to choose your own God. You get to make up your own understanding of God or a Higher Power or Whom-/Whatever. But Gately, at like ten months clean, at the TSBYSCD podium in Braintree, opines that at this juncture he’s so totally clueless and lost he’s thinking that he’d maybe rather have the White Flag Crocodiles just grab him by the lapels and just tell him what AA God to have an understanding of, and give him totally blunt and dogmatic orders about how to turn over his Diseased will to whatever this Higher Power is. He notes how he’s observed already that some Catholics and Fundamentalists now in AA had a childhood understanding of a Stern and Punishing–type God, and Gately’s heard them express incredible Gratitude that AA let them at long last let go and change over to an understanding of a Loving, Forgiving, Nurturing–type God. But at least these folks started out with some idea of Him/Her/It, whether fucked up or no. You might think it’d be easier if you Came In with 0 in the way of denominational background or preconceptions, you might think it’d be easier to sort of invent a Higher-Powerish God from scratch and then like erect an understanding, but Don Gately complains that this has not been his experience thus far. His sole experience so far is that he takes one of AA’s very rare specific suggestions and hits the knees in the A.M. and asks for Help and then hits the knees again at bedtime and says Thank You, whether he believes he’s talking to Anything/-body or not, and he somehow gets through that day clean. This, after ten months of ear-smoking concentration and reflection, is still all he feels like he ‘understands’ about the ‘God angle.’ Publicly, in front of a very tough and hard-ass-looking AA crowd, he sort of simultaneously confesses and complains that he feels like a rat that’s learned one route in the maze to the cheese and travels that route in a ratty-type fashion and whatnot. W/ the God thing being the cheese in the metaphor. Gately still feels like he has no access to the Big spiritual Picture. He feels about the ritualistic daily Please and Thank You prayers rather like like a hitter that’s on a hitting streak and doesn’t change his jock or socks or pre-game routine for as long as he’s on the streak. W/ sobriety being the hitting streak and whatnot, he explains. The whole church basement is literally blue with smoke. Gately says he feels like this is a pretty limp and lame understanding of a Higher Power: a cheese-easement or unwashed athletic supporter. He says but when he tries to go beyond the very basic rote automatic get-me-through-this-day-please stuff, when he kneels at other times and prays or meditates or tries to achieve a Big-Picture spiritual understanding of a God as he can understand Him, he feels Nothing — not nothing but Nothing, an edgeless blankness that somehow feels worse than the sort of unconsidered atheism he Came In with. He says he doesn’t know if any of this is coming through or making any sense or if it’s all just still symptomatic of a thoroughgoingly Diseased will and quote ‘spirit.’ He finds himself telling the Tough Shit But You Still Can’t Drink audience dark doubtful thoughts he wouldn’t have fucking ever dared tell Ferocious Francis man to man. He can’t even look at F.F. in the Crocodile’s row as he says that at this point the God-understanding stuff kind of makes him want to puke, from fear. Something you can’t see or hear or touch or smell: OK. All right. But something you can’t even feel? Because that’s what he feels when he tries to understand something to really sincerely pray to. Nothingness. He says when he tries to pray he gets this like image in his mind’s eye of the brainwaves or whatever of his prayers going out and out, with nothing to stop them, going, going, radiating out into like space and outliving him and still going and never hitting Anything out there, much less Something with an ear. Much much less Something with an ear that could possibly give a rat’s ass. He’s both pissed off and ashamed to be talking about this instead of how just completely good it is to just be getting through the day without ingesting a Substance, but there it is. This is what’s going on. He’s no closer to carrying out the suggestion of the 3rd Step than the day the Probie drove him over to his halfway house from Peabody Holding. The idea of this whole God thing makes him puke, still. And he is afraid.\nAnd the same fucking thing happens again. The tough chain-smoking TSBYSCD Group all stands and applauds and the men give two-finger whistles, and people come up at the raffle-break to pump his big hand and even sometimes try and hug on him.\nIt seems like every time he forgets himself and publicizes how he’s fucking up in sobriety Boston AAs fall all over themselves to tell him how good it was to hear him and to for God’s sake Keep Coming, for them if not for himself, whatever the fuck that means.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-25T11:30:00+00:00"
}