{
  "url": "https://voxday.net/2013/04/19/boston-bombers-caught-one-killed/",
  "scraped_at": "2025-12-14T22:26:22.463715",
  "title": "One Boston bomber caught and killed",
  "date_display": "April 19, 2013",
  "date_iso": "2013-04-19T09:29:00+00:00",
  "date_from_url": "2013-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strike>Two suspects</strike> One suspect caught and killed.  Names are Tamerlan <strike>Mike Mulugeta</strike> and Dzhokhar Tsarnaev <strike>Sunil Tripathi</strike>. <a href=\"http://www.guardian.co.uk/world/2013/apr/19/tamerlan-tsarnaev-american-life-of-dead-boston-bomb-suspect\">Tamerlan </a>is dead. An MIT police officer was shot and killed on campus.  More details that show the confusion leading up to the endgame from <a href=\"http://www.reddit.com/r/news/comments/1cnwms/mods_removed_thread_live_updates_of_boston/\">this scanner summary on Reddit</a>.  As well as <a href=\"http://www.reddit.com/r/news/comments/1co395/live_updates_of_boston_situation_part_2/\">Part 2</a>.</p><p><b>EDIT 1:39 EST</b>: WCVB reports one suspect is at large!<br> <b>EDIT 1:41 EST</b>: Reports of first officer down has died of his wounds (death toll: 2)<br> <b>EDIT 1:42 EST</b>: Reports of explosion at Harvard Quad.<br> <b>EDIT 1:42 EST</b>: Second suspect not in custody from radio! Be safe all!!<br> <b>EDIT 1:44 EST</b>: Children’s Hospital clear. No shots fired there.<br> <b>EDIT 1:46 EST</b>: Explosion heard was from bomb squad.<br> <b>EDIT 1:47 EST</b>: Backpacks left on Laurel St.<br> <b>EDIT 1:48 EST</b>: News about Harvard Quad bomb seems to be fake. No bomb confirmed there.<br> <b>EDIT 1:55 EST</b>: Second suspect middle eastern looking, clean shaven, male with blue jacket with a “christmas style” hat.<br> <b>EDIT 1:56 EST</b>: My inbox is flooded with “Fuck the Mods”<br> posts. Please, not now. Come back with hate in a few hours. For now,<br> only news. Hate them in another thread.<br> <b>EDIT 1:57 EST</b>: The Christmas hat is a beenie.<br> <b>EDIT 1:58 EST</b>: MIT update: Suspect from there is no longer on campus. Right now, these are two different incidents and not related.<br> <b>EDIT 1:58 EST</b>: Suspect who was laying on the ground was released and is walking home. Taken in from confusion.<br> <b>EDIT 2:00 EST</b>: Reports of a <a href=\"http://en.wikipedia.org/wiki/Hospital_emergency_codes#Code_Black\">“code black”</a> at Auburn Hospital. Nothing confirmed.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>According to Wikipedia, Tripathi is a “Hindu Brahmin surname found mostly in the northern and central parts of India and Nepal.”  Mulugeta is an Ethiopian name.  It looks as if they were both recent immigrants to the USA, within the last year, but if they were Muslims, they would appear to have been converts.  CORRECTION: The Tsarnaev brothers appear to be Muslims of Chechen descent.</p><p>UPDATE: NBC says Tripathi is not suspect. Police searching Watertown area for Suspect 2.</p><p>UPDATE 2: <a href=\"https://twitter.com/dannysullivan/watertown\">Watertown Twitter feed</a>.</p><p>UPDATE 3: “To recap: One marathon suspect killed. The other at-large and dangerous. If you live in Boston, stay indoors.”</p><p>UPDATE 4: <a href=\"http://graphics8.nytimes.com/images/blogs/thelede/posts/suspect-number-2.JPG\">The guy in the white hat</a> to the left of the picture appears to be the man for whom the SWAT team is looking. The AP reports his name is Dzhokhar A. Tsarnaev, thereby dashing once more the hopes of progressives who fearfully fantasize about white Christian terrorists.</p><p>UPDATE 5: Glenn Reynolds notes: “Several readers comment that there are probably quite a few people in<br> the Watertown area who wish they had a gun right about now.”</br></p><p>UPDATE 6: Zerohedge posts <a href=\"http://www.zerohedge.com/news/2013-04-19/tamerlan-tsarnaevs-gym-partner-profiles-dead-bomber\">an interview with an MMA guy</a> who trained with Tamerlan: <i>“About four or five years ago, I was working full-time as a project<br> manager and in my off time, I was training at a mixed martial arts gym<br> in Boston. Tamerlan wasn’t part of our gym, but he was training for the<br> golden gloves boxing championship. I remember that he would come in to<br> work with some of our boxers and worked with us. That is where I<br> remember him from. When I woke up this morning and saw his name and his<br> picture on the news, I immediately recognized him.  He seemed<br> like a really nice guy, to himself and a little bit arrogant and cocky,<br> but he helped people at the gym all the time with their boxing and was<br> friendly with everyone. It’s a complete shock.”</br></br></br></br></br></br></br></br></br></i></p><p>His girlfriend was attractive and supposedly converted to Islam, presumably on his behalf. It looks like he might have met her at one gym or another.</p><p>UPDATE 7: The Telegraph has <a href=\"http://www.telegraph.co.uk/news/worldnews/northamerica/usa/10002469/Boston-Marathon-bombs-live.html\">a detailed summary</a>, including lots of pictures related to the incidents.</p></div>",
  "content_text": "Two suspects\nOne suspect caught and killed.  Names are Tamerlan\nMike Mulugeta\nand Dzhokhar Tsarnaev\nSunil Tripathi\n.\nTamerlan\nis dead. An MIT police officer was shot and killed on campus.  More details that show the confusion leading up to the endgame from\nthis scanner summary on Reddit\n.  As well as\nPart 2\n.\nEDIT 1:39 EST\n: WCVB reports one suspect is at large!\nEDIT 1:41 EST\n: Reports of first officer down has died of his wounds (death toll: 2)\nEDIT 1:42 EST\n: Reports of explosion at Harvard Quad.\nEDIT 1:42 EST\n: Second suspect not in custody from radio! Be safe all!!\nEDIT 1:44 EST\n: Children’s Hospital clear. No shots fired there.\nEDIT 1:46 EST\n: Explosion heard was from bomb squad.\nEDIT 1:47 EST\n: Backpacks left on Laurel St.\nEDIT 1:48 EST\n: News about Harvard Quad bomb seems to be fake. No bomb confirmed there.\nEDIT 1:55 EST\n: Second suspect middle eastern looking, clean shaven, male with blue jacket with a “christmas style” hat.\nEDIT 1:56 EST\n: My inbox is flooded with “Fuck the Mods”\nposts. Please, not now. Come back with hate in a few hours. For now,\nonly news. Hate them in another thread.\nEDIT 1:57 EST\n: The Christmas hat is a beenie.\nEDIT 1:58 EST\n: MIT update: Suspect from there is no longer on campus. Right now, these are two different incidents and not related.\nEDIT 1:58 EST\n: Suspect who was laying on the ground was released and is walking home. Taken in from confusion.\nEDIT 2:00 EST\n: Reports of a\n“code black”\nat Auburn Hospital. Nothing confirmed.\nAccording to Wikipedia, Tripathi is a “Hindu Brahmin surname found mostly in the northern and central parts of India and Nepal.”  Mulugeta is an Ethiopian name.  It looks as if they were both recent immigrants to the USA, within the last year, but if they were Muslims, they would appear to have been converts.  CORRECTION: The Tsarnaev brothers appear to be Muslims of Chechen descent.\nUPDATE: NBC says Tripathi is not suspect. Police searching Watertown area for Suspect 2.\nUPDATE 2:\nWatertown Twitter feed\n.\nUPDATE 3: “To recap: One marathon suspect killed. The other at-large and dangerous. If you live in Boston, stay indoors.”\nUPDATE 4:\nThe guy in the white hat\nto the left of the picture appears to be the man for whom the SWAT team is looking. The AP reports his name is Dzhokhar A. Tsarnaev, thereby dashing once more the hopes of progressives who fearfully fantasize about white Christian terrorists.\nUPDATE 5: Glenn Reynolds notes: “Several readers comment that there are probably quite a few people in\nthe Watertown area who wish they had a gun right about now.”\nUPDATE 6: Zerohedge posts\nan interview with an MMA guy\nwho trained with Tamerlan:\n“About four or five years ago, I was working full-time as a project\nmanager and in my off time, I was training at a mixed martial arts gym\nin Boston. Tamerlan wasn’t part of our gym, but he was training for the\ngolden gloves boxing championship. I remember that he would come in to\nwork with some of our boxers and worked with us. That is where I\nremember him from. When I woke up this morning and saw his name and his\npicture on the news, I immediately recognized him.  He seemed\nlike a really nice guy, to himself and a little bit arrogant and cocky,\nbut he helped people at the gym all the time with their boxing and was\nfriendly with everyone. It’s a complete shock.”\nHis girlfriend was attractive and supposedly converted to Islam, presumably on his behalf. It looks like he might have met her at one gym or another.\nUPDATE 7: The Telegraph has\na detailed summary\n, including lots of pictures related to the incidents.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-19T08:29:00+00:00"
}