{
  "url": "https://voxday.net/2013/04/12/boycotting-gun-grabbers/",
  "scraped_at": "2025-12-14T22:25:43.071161",
  "title": "Boycotting the gun grabbers",
  "date_display": "April 12, 2013",
  "date_iso": "2013-04-12T17:00:00+00:00",
  "date_from_url": "2013-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger follows the lead of PTR Industries, which is moving out of Connecticut, and goes them one better by announcing <a href=\"http://market-ticker.org/akcs-www?post=219692\">he will no longer do business with anyone from Connecticut</a>:</p><blockquote class=\"tr_bq\"><p> <i> “The rights of the citizens of CT have been trampled<br> upon. The safety of its children is at best questionably improved from<br> the day of the tragedy that triggered the events that lead us here.<br> Finally, due to an improperly drafted bill, manufacturing of modern<br> sporting rifles in the State of CT has been effectively outlawed. With a<br> heavy heart but a clear mind, we have been forced to decide that our<br> business can no longer survive in Connecticut – the former Constitution<br> state.</br></br></br></br></br></br></br></i><br> <i><br>Furthermore, we feel that our<br> industry as a whole will continue to be threatened so long as it remains<br> in a state where its elected leaders have no regard for the rights of<br> those who produce and manufacture its wealth. We are making a call to<br> all involved in our industry to leave this state, close your doors and<br> show our politicians the true consequences of their hasty and uninformed<br> actions. We encourage those in our industry to abandon this state as<br> its leaders have abandoned the proud heritage that forged our freedom.”</br></br></br></br></br></br></br></br></i></br></p><p>I will make a wider call. We should <b>all</b> boycott <b><i>everyone and everything</i></b> in Connecticut.</p><p>You<br> got CT plates on your car?  Tough crap — no hotel room for you, no<br> gas, no food, no nothing.  Go back where you came from.  Return to your<br> socialist utopia.<br> You claim you “didn’t do it”?  Yes you did —<br> you sat still for it.  You haven’t removed the clowns who did it.  You<br> have not done <b>your duty as a citizen</b>, and until you do so I will not do business with you.</br></br></br></br></br></br></p><p>Will I act on this? You bet.  <b>In fact, I already did.</b></p></blockquote><p>I’m all for this sort of thing. There are no shortages of egregious political offenses about which one might merely complain, but gun control laws are the line in the sand that cannot be crossed.  Everyone who understands the primary importance of gun rights and the People’s ability to defend itself against the government should follow the lead of the gun manufacturers and Mr. Denninger in refusing to do business with Connecticut and any the residents of any other state that cross that all-important line.  The Newton shootings are no justification.</p><p>Let me be perfectly clear.  It is preferable, vastly preferable, to permit drugged-up, mentally disturbed individuals to shoot up public schools <i>every single day</i> than to disarm the People.  Disarming the People, particularly given a regime that proclaims its right to assassinate citizens at will, would have consequences that are several orders of magnitude worse than the cumulative result of a daily Newton-style shooting.</p><p>No compromise is possible. Connecticut has gone too far. And if Connecticut is not forced to backdown, other states will follow suit and the situation will eventually spiral out of control.</p><p>I don’t have subscribers. I don’t do business with anyone from Connecticut. So, my support for the boycott is without substance. But if you do happen to live in Connecticut, I would encourage you to vote with your feet at the earliest opportunity.  Free men cannot live in the same polity as slaves and parasites who wish to enslave them.</p><p>One of The Market Ticker’s commenters said: “I like it here.  I have a nice house, a good job, and I appreciate the<br> mild climate.  I don’t want to have to pack up and move if things get<br> worse, which they probably will.  Why should those who love liberty have<br> to keep fleeing?”</br></br></br></p><p>Because, unlike their forefathers, they are not willing to fight for it.</p></div>",
  "content_text": "Karl Denninger follows the lead of PTR Industries, which is moving out of Connecticut, and goes them one better by announcing\nhe will no longer do business with anyone from Connecticut\n:\n“The rights of the citizens of CT have been trampled\nupon. The safety of its children is at best questionably improved from\nthe day of the tragedy that triggered the events that lead us here.\nFinally, due to an improperly drafted bill, manufacturing of modern\nsporting rifles in the State of CT has been effectively outlawed. With a\nheavy heart but a clear mind, we have been forced to decide that our\nbusiness can no longer survive in Connecticut – the former Constitution\nstate.\nFurthermore, we feel that our\nindustry as a whole will continue to be threatened so long as it remains\nin a state where its elected leaders have no regard for the rights of\nthose who produce and manufacture its wealth. We are making a call to\nall involved in our industry to leave this state, close your doors and\nshow our politicians the true consequences of their hasty and uninformed\nactions. We encourage those in our industry to abandon this state as\nits leaders have abandoned the proud heritage that forged our freedom.”\nI will make a wider call. We should\nall\nboycott\neveryone and everything\nin Connecticut.\nYou\ngot CT plates on your car?  Tough crap — no hotel room for you, no\ngas, no food, no nothing.  Go back where you came from.  Return to your\nsocialist utopia.\nYou claim you “didn’t do it”?  Yes you did —\nyou sat still for it.  You haven’t removed the clowns who did it.  You\nhave not done\nyour duty as a citizen\n, and until you do so I will not do business with you.\nWill I act on this? You bet.\nIn fact, I already did.\nI’m all for this sort of thing. There are no shortages of egregious political offenses about which one might merely complain, but gun control laws are the line in the sand that cannot be crossed.  Everyone who understands the primary importance of gun rights and the People’s ability to defend itself against the government should follow the lead of the gun manufacturers and Mr. Denninger in refusing to do business with Connecticut and any the residents of any other state that cross that all-important line.  The Newton shootings are no justification.\nLet me be perfectly clear.  It is preferable, vastly preferable, to permit drugged-up, mentally disturbed individuals to shoot up public schools\nevery single day\nthan to disarm the People.  Disarming the People, particularly given a regime that proclaims its right to assassinate citizens at will, would have consequences that are several orders of magnitude worse than the cumulative result of a daily Newton-style shooting.\nNo compromise is possible. Connecticut has gone too far. And if Connecticut is not forced to backdown, other states will follow suit and the situation will eventually spiral out of control.\nI don’t have subscribers. I don’t do business with anyone from Connecticut. So, my support for the boycott is without substance. But if you do happen to live in Connecticut, I would encourage you to vote with your feet at the earliest opportunity.  Free men cannot live in the same polity as slaves and parasites who wish to enslave them.\nOne of The Market Ticker’s commenters said: “I like it here.  I have a nice house, a good job, and I appreciate the\nmild climate.  I don’t want to have to pack up and move if things get\nworse, which they probably will.  Why should those who love liberty have\nto keep fleeing?”\nBecause, unlike their forefathers, they are not willing to fight for it.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-12T16:00:00+00:00"
}