{
  "url": "https://voxday.net/2013/04/29/death-of-republican-blogosphere/",
  "scraped_at": "2025-12-14T22:27:19.582213",
  "title": "Death of the Republican blogosphere",
  "date_display": "April 29, 2013",
  "date_iso": "2013-04-29T12:02:00+00:00",
  "date_from_url": "2013-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Instapundit, John Hawkins, and a number of right-wing bloggers consider why some consider the right-wing blogosphere <a href=\"http://www.rightwingnews.com/blogosphere/the-slow-painful-coming-death-of-the-independent-conservative-blogosphere/\">to be on the decline</a>:</p><blockquote class=\"tr_bq\"><p> [A] funny thing happened in 2002-2003 — the left side of the<br> blogosphere took off and eclipsed the Right side of the blogosphere.<br> Liberals ferociously loathed George W. Bush, just as conservatives had<br> detested Clinton, and they went online to congregate and get the<br> information they needed to fight back. Soon, the liberal blogs were<br> considerably bigger than the conservative blogs….although, and this is<br> an often overlooked caveat, there were still a number of significant<br> conservative websites, with large audiences, that many people don’t<br> consider to be “blogs:” <a href=\"http://lucianne.com/\" rel=\"noopener\" target=\"_top\"><b>Lucianne</b></a>, <a href=\"http://spectator.org/\" rel=\"noopener\" target=\"_top\"><b>The American Spectator</b></a>, <a href=\"http://www.wnd.com/\" rel=\"noopener\" target=\"_top\"><b>WorldnetDaily</b></a>, <a href=\"http://www.newsmax.com/\" rel=\"noopener\" target=\"_top\"><b>Newsmax</b></a>, etc.</br></br></br></br></br></br></br></br></p><p>So, since that was the case, when Barack Obama got into power, you’d<br> have expected that traffic on the Right side of the blogosphere would<br> have surged just as it did on the Left side of the blogosphere in the<br> early Bush years.</br></br></br></p><p>That didn’t happen.</p><p>Sure, there were a few outliers that took off: <a href=\"http://hotair.com/\" rel=\"noopener\" target=\"_top\"><b>Hot Air</b></a>, <a href=\"http://redstate.com/\" rel=\"noopener\" target=\"_top\"><b>Redstate</b></a>, and the <a href=\"http://breitbart.com/\" rel=\"noopener\" target=\"_top\"><b>Breitbart empire</b></a><br> for example, but most conservative blogs have either grown<br> insignificantly, stayed the same size, or even shrank. Most bloggers on<br> the right side of the blogosphere haven’t increased their traffic<br> significantly in years. Moreover, the right side of the blogosphere as a<br> whole is definitely shrinking in numbers as bloggers that have had<br> trouble getting traction are quitting and fewer and fewer bloggers are<br> starting up new blogs.</br></br></br></br></br></br></br></p></blockquote><p>And Legal Insurrection laments the link-stinginess of the corporate blogs that have largely taken over both Left and Right alike.</p><blockquote class=\"tr_bq\"><p> I wish the reality weren’t so true that the days of collaboration and mutual support are waning. It’s nearly impossible to get a link out of the new big names in<br> conservative media.  It’s not even a conservative blogosphere anymore,<br> it’s for-profit and non-profit corporate media which are protective of<br> eyeballs.</br></br></br></p></blockquote><p>I think there are several problems.  The first is the increased amount of corporatization among the blogosphere. Pajamas Media is the primary culprit here, but Gawker Media is also to blame. Once Nick Denton and Roger Simon showed that it was possible to monetize a blog or ten, pecuniary interests rapidly came to the fore. Suddenly everything had a price tag, links were worth money, and everyone’s behavior naturally became just a bit more self-centered and mercenary.  The H/T soon went the way of the dodo.</p><p>And everyone became increasingly afraid of offending the bigger dogs and getting cut off from the all-important link flow. For example, I used to be a regular guest on the Northern Alliance Radio Show. That stopped not long after I criticized Michelle Malkin for her shoddy research failure and thereby offended the Powerline guys, even though I remained on good terms with the Fraters Libertas.  I suspect this desire to curry favor is why the outliers that took off in terms of popularity have so little chili; they’re basically the blogosphere equivalent of the mainstream media whores.  Face it, Dana Loesch isn’t any smarter now that she’s a Breitbart bimbo than she was when she called herself Mamalogues(TM) and I was <a href=\"http://voxday.blogspot.com/search?q=mamalogues\">kicking her around</a> in response to her various lunacies.</p><p>An even more important factor is the sapping of right-wing energy by thirteen straight years of relentless betrayal of conservative principles by the Republican Party. Libertarian realists like me are still going strong, since we never expected any better, but how much enthusiasm can conservatives expect to muster in support of nominal leaders like George W. Bush, John McCain, and Mitt Romney?  The political enthusiasm simply isn’t there anymore.  It’s not so much the right-wing blogosphere that is dying as the Republican one.</p><p>It may be worth noting that the Right also tends to fear controversy and mainstream criticism far more than the Left, not always without cause.  I’m a bit more controversial than the average blogger, and as a result, have an unusually small number of incoming links in relation to the readership.  Consider this fact: McRapey’s Whatever has between 30 to 40 percent less traffic than VP+AG these days, but Alexa shows 4,713 incoming links there, nearly 3,500 more than VP’s 941 and AG’s 315.  I’m not complaining. I’m  clear that readers will find their way here whether they are encouraged by others to do so or not. But the difference is noticeable.</p><p>Being an aggregator, Instapundit is one of the few bloggers who still links religiously to others. I’ve attempted to follow his example and I never cite any information from any blog without linking directly to it. But I don’t really bother with a blogroll per se anymore, because I have neither the time nor the interest to keep track of them as they spring up, post for a few months, or even a few weeks, and then fade away. </p><p>These days, if someone sends me an email enthusiastically informing me that they have just launched a new blog and would love to exchange links, I don’t even bother to reply anymore.  I’ve seen far too many new blogs begin with a few enthusiastic posts, followed soon after by an apology for not having the time to post but promising that will change real soon now, then a last hurrah, after which comes the void. Blogging isn’t for everyone, but it usually requires trying it in order to learn whether it suits you or not… but I would recommend not requesting links from anyone until you’ve proven that you can do it for at least one year.</p><p>I think the corporatization of blogs makes independent that much more important, even if it is less common and less popular than it once was.  Otherwise, we might as all sit around and watch the three television stations permitted to us by our masters in the media.</p></div>",
  "content_text": "Instapundit, John Hawkins, and a number of right-wing bloggers consider why some consider the right-wing blogosphere\nto be on the decline\n:\n[A] funny thing happened in 2002-2003 — the left side of the\nblogosphere took off and eclipsed the Right side of the blogosphere.\nLiberals ferociously loathed George W. Bush, just as conservatives had\ndetested Clinton, and they went online to congregate and get the\ninformation they needed to fight back. Soon, the liberal blogs were\nconsiderably bigger than the conservative blogs….although, and this is\nan often overlooked caveat, there were still a number of significant\nconservative websites, with large audiences, that many people don’t\nconsider to be “blogs:”\nLucianne\n,\nThe American Spectator\n,\nWorldnetDaily\n,\nNewsmax\n, etc.\nSo, since that was the case, when Barack Obama got into power, you’d\nhave expected that traffic on the Right side of the blogosphere would\nhave surged just as it did on the Left side of the blogosphere in the\nearly Bush years.\nThat didn’t happen.\nSure, there were a few outliers that took off:\nHot Air\n,\nRedstate\n, and the\nBreitbart empire\nfor example, but most conservative blogs have either grown\ninsignificantly, stayed the same size, or even shrank. Most bloggers on\nthe right side of the blogosphere haven’t increased their traffic\nsignificantly in years. Moreover, the right side of the blogosphere as a\nwhole is definitely shrinking in numbers as bloggers that have had\ntrouble getting traction are quitting and fewer and fewer bloggers are\nstarting up new blogs.\nAnd Legal Insurrection laments the link-stinginess of the corporate blogs that have largely taken over both Left and Right alike.\nI wish the reality weren’t so true that the days of collaboration and mutual support are waning. It’s nearly impossible to get a link out of the new big names in\nconservative media.  It’s not even a conservative blogosphere anymore,\nit’s for-profit and non-profit corporate media which are protective of\neyeballs.\nI think there are several problems.  The first is the increased amount of corporatization among the blogosphere. Pajamas Media is the primary culprit here, but Gawker Media is also to blame. Once Nick Denton and Roger Simon showed that it was possible to monetize a blog or ten, pecuniary interests rapidly came to the fore. Suddenly everything had a price tag, links were worth money, and everyone’s behavior naturally became just a bit more self-centered and mercenary.  The H/T soon went the way of the dodo.\nAnd everyone became increasingly afraid of offending the bigger dogs and getting cut off from the all-important link flow. For example, I used to be a regular guest on the Northern Alliance Radio Show. That stopped not long after I criticized Michelle Malkin for her shoddy research failure and thereby offended the Powerline guys, even though I remained on good terms with the Fraters Libertas.  I suspect this desire to curry favor is why the outliers that took off in terms of popularity have so little chili; they’re basically the blogosphere equivalent of the mainstream media whores.  Face it, Dana Loesch isn’t any smarter now that she’s a Breitbart bimbo than she was when she called herself Mamalogues(TM) and I was\nkicking her around\nin response to her various lunacies.\nAn even more important factor is the sapping of right-wing energy by thirteen straight years of relentless betrayal of conservative principles by the Republican Party. Libertarian realists like me are still going strong, since we never expected any better, but how much enthusiasm can conservatives expect to muster in support of nominal leaders like George W. Bush, John McCain, and Mitt Romney?  The political enthusiasm simply isn’t there anymore.  It’s not so much the right-wing blogosphere that is dying as the Republican one.\nIt may be worth noting that the Right also tends to fear controversy and mainstream criticism far more than the Left, not always without cause.  I’m a bit more controversial than the average blogger, and as a result, have an unusually small number of incoming links in relation to the readership.  Consider this fact: McRapey’s Whatever has between 30 to 40 percent less traffic than VP+AG these days, but Alexa shows 4,713 incoming links there, nearly 3,500 more than VP’s 941 and AG’s 315.  I’m not complaining. I’m  clear that readers will find their way here whether they are encouraged by others to do so or not. But the difference is noticeable.\nBeing an aggregator, Instapundit is one of the few bloggers who still links religiously to others. I’ve attempted to follow his example and I never cite any information from any blog without linking directly to it. But I don’t really bother with a blogroll per se anymore, because I have neither the time nor the interest to keep track of them as they spring up, post for a few months, or even a few weeks, and then fade away.\nThese days, if someone sends me an email enthusiastically informing me that they have just launched a new blog and would love to exchange links, I don’t even bother to reply anymore.  I’ve seen far too many new blogs begin with a few enthusiastic posts, followed soon after by an apology for not having the time to post but promising that will change real soon now, then a last hurrah, after which comes the void. Blogging isn’t for everyone, but it usually requires trying it in order to learn whether it suits you or not… but I would recommend not requesting links from anyone until you’ve proven that you can do it for at least one year.\nI think the corporatization of blogs makes independent that much more important, even if it is less common and less popular than it once was.  Otherwise, we might as all sit around and watch the three television stations permitted to us by our masters in the media.",
  "tags": [
    "corpocracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-29T11:02:00+00:00"
}