{
  "url": "https://voxday.net/2013/04/07/debt-is-cas/",
  "scraped_at": "2025-12-14T22:25:14.733854",
  "title": "Debt is cash",
  "date_display": "April 7, 2013",
  "date_iso": "2013-04-07T19:22:00+00:00",
  "date_from_url": "2013-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re not talking monetary theory anymore.  We’re talking <a href=\"http://www.zerohedge.com/news/2013-04-07/portugal-considers-paying-public-workers-treasury-bills-instead-cash\">actual government wages</a>:</p><blockquote class=\"tr_bq\"><p> <i>“”The Portuguese government is considering a plan to pay<br> public workers and pensioners one month of their salary in treasury<br> bills rather than cash after a high court ruled out wage cuts, a person<br> familiar with the situation said Sunday.</br></br></br></i><br> <i><br> </br></i><br> <i><br> </br></i><i>“This is one of the ideas being considered,” the person said. </i><br> <i><br> </br></i><br> <i><br> </br></i><i>By paying one month of salary in T-bills to public workers and<br> pensioners, the government would save an estimated €1.1 billion in<br> expenses, narrowing the budget gap significantly.”</br></br></i></br></br></br></br></p><p>Incidentally, this plan makes perfect sense: with every central bank<br> openly monetizing its debt, it has effectively made debt and cash<br> equivalent.</br></br></p></blockquote><p>Things are rapidly getting very weird in the economic sense. Cyprus. Ireland. Portugal. And having driven away its high-income earners, France is showing signs of attempting to expand its tax reach beyond its borders. Paul Krugman is praising capital controls.</p><p>And, as Karl Denninger points out, it probably won’t be long before the federal government uses the insolvency of the state and local pension plans <a href=\"http://market-ticker.org/akcs-www?post=219536\">to make a play</a> for seizing all those luscious, previously untaxed assets in millions of retirement plans.</p></div>",
  "content_text": "We’re not talking monetary theory anymore.  We’re talking\nactual government wages\n:\n“”The Portuguese government is considering a plan to pay\npublic workers and pensioners one month of their salary in treasury\nbills rather than cash after a high court ruled out wage cuts, a person\nfamiliar with the situation said Sunday.\n“This is one of the ideas being considered,” the person said.\nBy paying one month of salary in T-bills to public workers and\npensioners, the government would save an estimated €1.1 billion in\nexpenses, narrowing the budget gap significantly.”\nIncidentally, this plan makes perfect sense: with every central bank\nopenly monetizing its debt, it has effectively made debt and cash\nequivalent.\nThings are rapidly getting very weird in the economic sense. Cyprus. Ireland. Portugal. And having driven away its high-income earners, France is showing signs of attempting to expand its tax reach beyond its borders. Paul Krugman is praising capital controls.\nAnd, as Karl Denninger points out, it probably won’t be long before the federal government uses the insolvency of the state and local pension plans\nto make a play\nfor seizing all those luscious, previously untaxed assets in millions of retirement plans.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-07T18:22:00+00:00"
}