{
  "url": "https://voxday.net/2013/04/23/dont-be-afraid-of-killer-immigrants/",
  "scraped_at": "2025-12-14T22:26:49.631349",
  "title": "Don’t be afraid of killer immigrants",
  "date_display": "April 23, 2013",
  "date_iso": "2013-04-23T17:00:00+00:00",
  "date_from_url": "2013-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Relax, most immigrants aren’t going to kill you.  They’re only going to lower wage rates, pollute the environment, live off your social benefits, transform your culture and your legal system, and make the USA considerably more like the third world hellholes from which they have escaped. The real problem, according to the Washington Post, isn’t a few murderous immigrants, but <a href=\"http://www.washingtonpost.com/opinions/lawmakers-stoking-fear-of-immigrants/2013/04/22/e24eb568-ab8a-11e2-a8b9-2a63d75b5459_story.html?hpid=z3\">lawmakers stoking fear in the native populace</a>:</p><blockquote class=\"tr_bq\"><p> CYNICS IN CONGRESS, eager to derail landmark legislation to overhaul the nation’s broken immigration system, have seized on last week’s events in Boston as a pretext to slow momentumon the issue. In the process, they may unwittingly provide a push for the very bill they hope to derail.</p><p>With scant regard for the actual immigration status of the bombing suspects, who came to this country legally as minors, Sen. Charles E. Grassley (R-Iowa) nonetheless framed the attacks in Boston in the context of the debate over immigration. With a suspect still at large Friday, he asked, “How do we ensure that people who wish to do us harm are not eligible for benefits under the immigration laws, including this new bill before us?”</p><p>His fellow Republican, Sen. Rand Paul of Kentucky, then sent a letter<br> to Senate Majority Leader Harry Reid (D-Nev.), arguing that the Senate “<a data-xslt=\"_http\" href=\"http://www.washingtonpost.com/blogs/post-politics/wp/2013/04/22/sen-rand-paul-delay-immigration-debate-until-after-boston-hearings/\">should not proceed</a> [with immigration reform] until we understand the specific failures in our immigration system.”</br></p><p>Just<br> what flaws in the immigration system are the senators talking about?<br> The failure to divine the future and predict that Tamerlan Tsarnaev, who<br> was a teenager when his family immigrated, and his surviving brother,<br> Dzhokhar, who was 9, might become radicalized years after arriving?</br></br></br></br></p></blockquote><p>Well, yes.  After all, we have been repeatedly ensured that the younger they are, the better immigrants will integrate and become Real White Americans who evere the Constitution, value American liberties, and vote in exactly equal numbers for Republicans and Democrats.</p><p>I know the Washington Post likes to blame everything on Republicans in Congress, but honestly, I would think that even the most propaganda-oriented progressive would admit that immigrants planting bombs and killing Americans is a perfectly rational reason to be less than wildly enthusiastic about immigration.</p></div>",
  "content_text": "Relax, most immigrants aren’t going to kill you.  They’re only going to lower wage rates, pollute the environment, live off your social benefits, transform your culture and your legal system, and make the USA considerably more like the third world hellholes from which they have escaped. The real problem, according to the Washington Post, isn’t a few murderous immigrants, but\nlawmakers stoking fear in the native populace\n:\nCYNICS IN CONGRESS, eager to derail landmark legislation to overhaul the nation’s broken immigration system, have seized on last week’s events in Boston as a pretext to slow momentumon the issue. In the process, they may unwittingly provide a push for the very bill they hope to derail.\nWith scant regard for the actual immigration status of the bombing suspects, who came to this country legally as minors, Sen. Charles E. Grassley (R-Iowa) nonetheless framed the attacks in Boston in the context of the debate over immigration. With a suspect still at large Friday, he asked, “How do we ensure that people who wish to do us harm are not eligible for benefits under the immigration laws, including this new bill before us?”\nHis fellow Republican, Sen. Rand Paul of Kentucky, then sent a letter\nto Senate Majority Leader Harry Reid (D-Nev.), arguing that the Senate “\nshould not proceed\n[with immigration reform] until we understand the specific failures in our immigration system.”\nJust\nwhat flaws in the immigration system are the senators talking about?\nThe failure to divine the future and predict that Tamerlan Tsarnaev, who\nwas a teenager when his family immigrated, and his surviving brother,\nDzhokhar, who was 9, might become radicalized years after arriving?\nWell, yes.  After all, we have been repeatedly ensured that the younger they are, the better immigrants will integrate and become Real White Americans who evere the Constitution, value American liberties, and vote in exactly equal numbers for Republicans and Democrats.\nI know the Washington Post likes to blame everything on Republicans in Congress, but honestly, I would think that even the most propaganda-oriented progressive would admit that immigrants planting bombs and killing Americans is a perfectly rational reason to be less than wildly enthusiastic about immigration.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-23T16:00:00+00:00"
}