{
  "url": "https://voxday.net/2013/04/07/educated-white-woman-vip-credit-card/",
  "scraped_at": "2025-12-14T22:25:11.052605",
  "title": "Educated White Woman: the VIP credit card",
  "date_display": "April 7, 2013",
  "date_iso": "2013-04-07T08:36:00+00:00",
  "date_from_url": "2013-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been thinking of a way to explain to educated white women how life works for them, without invoking the dreaded phrase “female imperative” to which they react like vampires being slipped into a Hervé Léger bandage dress woven from silver thread. It’s not that the concept of “female imperative” is incorrect, it’s that it’s not their word. When confronted with “female imperative” they point their fingers and shriek “misogynist”, start crying about how they were once near-raped in college, then threaten not to have sex with anyone in the near vicinity.</p><p>So, the challenge: how to get across the ideas bound up in the word “privilege,” in a way that your average educated white woman will get, without freaking out about it?</p><p>Ladies. Imagine life here in the US — or indeed, pretty much anywhere in the Western world — is a massive department store, like Macy’s or Saks. Let’s call it The Real World. You have entered The Real World and are about to start shopping, but first you go have to decide what credit card you are going to use while you are shopping. Got it?</p><p>Okay: In the department store known as The Real World, Educated White Woman is the VIP credit card. It is an American Express Centurion card with an unlimited credit limit.</p><p>This means that almost all the employees in the store are more deferential to you than they would be to anyone else. They carry your bags for you. The prices are lower and you’re given discounts without even asking for them. You don’t have to stand in line at the register. You are simply given entry to some departments that others have to wait to get into, or are simply denied access. The store is easier to walk through, automatically, you don’t have to wait for a changing room, and when you need help, by default it’s easier to get.</p><p>Now, once you’ve chosen the “Educated White Woman” card, you still have to decide how much you’re going to spend, and on what you’re going to spend it, and that will make a difference. If you only spend $250, and you spend it all on a big-screen TV as soon as you walk in the store, well, then you may be kind of screwed. If you spend $2,500 on earrings in the jewelry department, well, then you’re probably fine.</p><p>As your shopping trip progresses, your object is to buy stuff, figure out a way to carry it, and move on to the next department. If you spend all your time trying on swimsuits, or choose poorly and buy bulky things you can’t easily carry, then you probably won’t end up with much. But because you’re shopping with the “Educated White Woman” card, buying things and bypassing the lines at the register will still by default be easier for you, all other things being equal, than for another shopper using a less elite card.</p><p>Likewise, it’s certainly possible someone shopping with a lesser card is buying more, and more valuable, stuff than you are, because they know where everything is, or they are the perfect size 4, or they have an employee discount, or simply because they don’t spend half an hour dithering over every decision. It doesn’t change the fact you are still shopping with the VIP card.</p><p>You can end up buying nothing with the VIP card, but the VIP card still lets you buy more, and better, stuff than anyone else can possibly buy. The shopper who chose the “<a href=\"http://whatever.scalzi.com/2012/05/15/straight-white-male-the-lowest-difficulty-setting-there-is/\">Straight White Male</a>” card? That’s not even a proper credit card, that’s a Sam’s Club membership! If Straight White Male gets caught in the lingerie department trying on a pretty little thong, they’re not going to sell it to him, they’re going to call security.</p><p>And maybe at this point you say, hey, I’m not greedy, I don’t want a massive credit card bill at the end of the month and I don’t need any special treatment, I can make do with a regular VISA or Mastercard with a sensible limit.  Well, here’s the thing: In The Real World, you don’t ever have to pay off your balance! And you only get to shop there once. So why not make the most of it while you’re there? Your goal is to get as much of the best stuff as you can, not economize.</p><p>Oh, and one other thing. Remember when I said that you could choose what credit card you use in The Real World? Well, I lied. In fact, the store chooses what card you’re going to get when you walk in. You don’t get a choice; you just get the card given to you at the start of the game, and then you have to deal with it.</p><p>So that’s “Educated White Woman” for you in The Real World (and also, in the real world): The ultimate VIP treatment. All things being equal, and even when they are not, if the department store — or life — assigns you the “Educated White Woman” card, then sister, you’ve caught a break.</p><p>Of course, there is just one little problem with the “Educated White Woman” card.  It expires and you never know exactly when.  Just be sure that you’re done with your shopping before the employees start ignoring you, you have to stand in line at the registers, and no one is willing to carry your bags for you anymore.</p></div>",
  "content_text": "I’ve been thinking of a way to explain to educated white women how life works for them, without invoking the dreaded phrase “female imperative” to which they react like vampires being slipped into a Hervé Léger bandage dress woven from silver thread. It’s not that the concept of “female imperative” is incorrect, it’s that it’s not their word. When confronted with “female imperative” they point their fingers and shriek “misogynist”, start crying about how they were once near-raped in college, then threaten not to have sex with anyone in the near vicinity.\nSo, the challenge: how to get across the ideas bound up in the word “privilege,” in a way that your average educated white woman will get, without freaking out about it?\nLadies. Imagine life here in the US — or indeed, pretty much anywhere in the Western world — is a massive department store, like Macy’s or Saks. Let’s call it The Real World. You have entered The Real World and are about to start shopping, but first you go have to decide what credit card you are going to use while you are shopping. Got it?\nOkay: In the department store known as The Real World, Educated White Woman is the VIP credit card. It is an American Express Centurion card with an unlimited credit limit.\nThis means that almost all the employees in the store are more deferential to you than they would be to anyone else. They carry your bags for you. The prices are lower and you’re given discounts without even asking for them. You don’t have to stand in line at the register. You are simply given entry to some departments that others have to wait to get into, or are simply denied access. The store is easier to walk through, automatically, you don’t have to wait for a changing room, and when you need help, by default it’s easier to get.\nNow, once you’ve chosen the “Educated White Woman” card, you still have to decide how much you’re going to spend, and on what you’re going to spend it, and that will make a difference. If you only spend $250, and you spend it all on a big-screen TV as soon as you walk in the store, well, then you may be kind of screwed. If you spend $2,500 on earrings in the jewelry department, well, then you’re probably fine.\nAs your shopping trip progresses, your object is to buy stuff, figure out a way to carry it, and move on to the next department. If you spend all your time trying on swimsuits, or choose poorly and buy bulky things you can’t easily carry, then you probably won’t end up with much. But because you’re shopping with the “Educated White Woman” card, buying things and bypassing the lines at the register will still by default be easier for you, all other things being equal, than for another shopper using a less elite card.\nLikewise, it’s certainly possible someone shopping with a lesser card is buying more, and more valuable, stuff than you are, because they know where everything is, or they are the perfect size 4, or they have an employee discount, or simply because they don’t spend half an hour dithering over every decision. It doesn’t change the fact you are still shopping with the VIP card.\nYou can end up buying nothing with the VIP card, but the VIP card still lets you buy more, and better, stuff than anyone else can possibly buy. The shopper who chose the “\nStraight White Male\n” card? That’s not even a proper credit card, that’s a Sam’s Club membership! If Straight White Male gets caught in the lingerie department trying on a pretty little thong, they’re not going to sell it to him, they’re going to call security.\nAnd maybe at this point you say, hey, I’m not greedy, I don’t want a massive credit card bill at the end of the month and I don’t need any special treatment, I can make do with a regular VISA or Mastercard with a sensible limit.  Well, here’s the thing: In The Real World, you don’t ever have to pay off your balance! And you only get to shop there once. So why not make the most of it while you’re there? Your goal is to get as much of the best stuff as you can, not economize.\nOh, and one other thing. Remember when I said that you could choose what credit card you use in The Real World? Well, I lied. In fact, the store chooses what card you’re going to get when you walk in. You don’t get a choice; you just get the card given to you at the start of the game, and then you have to deal with it.\nSo that’s “Educated White Woman” for you in The Real World (and also, in the real world): The ultimate VIP treatment. All things being equal, and even when they are not, if the department store — or life — assigns you the “Educated White Woman” card, then sister, you’ve caught a break.\nOf course, there is just one little problem with the “Educated White Woman” card.  It expires and you never know exactly when.  Just be sure that you’re done with your shopping before the employees start ignoring you, you have to stand in line at the registers, and no one is willing to carry your bags for you anymore.",
  "tags": [
    "McRapey",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-07T07:36:00+00:00"
}