{
  "url": "https://voxday.net/2013/04/02/feminist-sff-convention-battles-lookis/",
  "scraped_at": "2025-12-14T22:24:42.227950",
  "title": "Feminist SF/F convention battles lookism",
  "date_display": "April 2, 2013",
  "date_iso": "2013-04-02T08:17:00+00:00",
  "date_from_url": "2013-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suppose it was really only a matter of time before the appeal of the strong horse <a href=\"http://www.battleswarmblog.com/?p=16802\">began to take its toll among the feminist swaddle</a>.  And to be honest, given what I saw of Madison the last time I was there, burqahs probably aren’t the worst idea considering the amount of corpulent, graffitied flesh on display:</p><blockquote class=\"tr_bq\"><p> WisCon Makes Burqas Mandatory for All Attendees</p><p>Today the SF3 ruling committee for the Madison,<br> Wisconsin-based feminist SF convention WisCon announced that starting<br> this year, all attendees would be required to wear burqas.</br></br></p><p>“We were trying to think of what we could do to make Wiscon more<br> inclusive,” said con chair Belle Gunness. “Suddenly, we realized that<br> devout Muslims could easily be offended by the amount of sinful and<br> wanton flesh on display at Wiscon. Therefore, starting with this year’s<br> Wiscon, we’ve made burqas mandatory for all attendees. Allah Akbar!”</br></br></br></br></p><p>Both male and female members will be required to don the traditional<br> black, face-covering, head-to-toe Islamic garb for all convention<br> events. Gunness indicated that the convention would have substantial<br> quantities of Burqas for rental to congoers, from Small to 5XL sizes. As<br> an added benefit, she said that the new regulations would help<br> eliminate “rampant lookism.”</br></br></br></br></br></p><p>Gunness said that guests would be required to wear the garb as well, “in the spirit of egalitarianism.”</p><p>Wiscon also announced that next year’s guest lineup would consist of<br> J. K. Rowling, Stephen King, George R. R. Martin, Joss Whedon and<br> Suzanne Collins. “At least as far as you know.”</br></br></p></blockquote><p>You do have to wonder about a convention of lunatics so psychologically disturbed that Elizabeth Moon, of all people, is too rabidly right-wing for them.</p><p>UPDATE: The utter cravenness of <a href=\"http://www.locusmag.com/Perspectives/2013/04/an-apology/\">Locus’s apology</a> is considerably funnier than the originally posted article.</p><div class=\"contenttext\"> <i>“We would like to offer our apology for the offensive April Fool’s<br> post that was published on the site today. The April Fool’s pieces were<br> not seen by the Locus HQ staff before being posted — it was an ugly<br> moment this morning when we saw the post already online, and we<br> immediately took steps to remove it. Of course, being after the fact, it<br> was too late, and the offense had already happened.</br></br></br></br></br></i><i> We did not find the post funny at all, and it does not reflect in any<br> way the opinions of the magazine staff. We apologize for it appearing<br> under our auspices.”</br></br></i><p>It’s not funny.  It’s not funny at all!  Also, and I quote, “<a href=\"http://www.voxday.net/tox/GrooveKittens.mp3\">John Scalzi is a rapist.</a>” </p></div></div>",
  "content_text": "I suppose it was really only a matter of time before the appeal of the strong horse\nbegan to take its toll among the feminist swaddle\n.  And to be honest, given what I saw of Madison the last time I was there, burqahs probably aren’t the worst idea considering the amount of corpulent, graffitied flesh on display:\nWisCon Makes Burqas Mandatory for All Attendees\nToday the SF3 ruling committee for the Madison,\nWisconsin-based feminist SF convention WisCon announced that starting\nthis year, all attendees would be required to wear burqas.\n“We were trying to think of what we could do to make Wiscon more\ninclusive,” said con chair Belle Gunness. “Suddenly, we realized that\ndevout Muslims could easily be offended by the amount of sinful and\nwanton flesh on display at Wiscon. Therefore, starting with this year’s\nWiscon, we’ve made burqas mandatory for all attendees. Allah Akbar!”\nBoth male and female members will be required to don the traditional\nblack, face-covering, head-to-toe Islamic garb for all convention\nevents. Gunness indicated that the convention would have substantial\nquantities of Burqas for rental to congoers, from Small to 5XL sizes. As\nan added benefit, she said that the new regulations would help\neliminate “rampant lookism.”\nGunness said that guests would be required to wear the garb as well, “in the spirit of egalitarianism.”\nWiscon also announced that next year’s guest lineup would consist of\nJ. K. Rowling, Stephen King, George R. R. Martin, Joss Whedon and\nSuzanne Collins. “At least as far as you know.”\nYou do have to wonder about a convention of lunatics so psychologically disturbed that Elizabeth Moon, of all people, is too rabidly right-wing for them.\nUPDATE: The utter cravenness of\nLocus’s apology\nis considerably funnier than the originally posted article.\n“We would like to offer our apology for the offensive April Fool’s\npost that was published on the site today. The April Fool’s pieces were\nnot seen by the Locus HQ staff before being posted — it was an ugly\nmoment this morning when we saw the post already online, and we\nimmediately took steps to remove it. Of course, being after the fact, it\nwas too late, and the offense had already happened.\nWe did not find the post funny at all, and it does not reflect in any\nway the opinions of the magazine staff. We apologize for it appearing\nunder our auspices.”\nIt’s not funny.  It’s not funny at all!  Also, and I quote, “\nJohn Scalzi is a rapist.\n”",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-02T07:17:00+00:00"
}