{
  "url": "https://voxday.net/2013/04/16/free-book-hailstone-mountain-by-lars/",
  "scraped_at": "2025-12-14T22:26:04.326079",
  "title": "Free book: HAILSTONE MOUNTAIN by Lars Walker",
  "date_display": "April 16, 2013",
  "date_iso": "2013-04-16T12:00:00+00:00",
  "date_from_url": "2013-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lars Walker, the author of <a href=\"http://www.intercollegiatereview.com/index.php/2013/03/20/the-christian-fantasy/\">a piece about Christian Fantasy</a> published on Intercollegiate Review last month that he assures me absolutely did not include a direct shot at <i>A Throne of Bones</i>, (“wannabee (christened) George R. R. Martins”), is giving away <a href=\"http://www.amazon.com/Hailstone-Mountain-Erling-Skjalgsson-ebook/dp/B00BU3WK1S/ref=sr_1_1?ie=UTF8&amp;qid=1366100831&amp;sr=8-1&amp;keywords=Hailstone+Mountain\">free copies of HAILSTONE MOUNTAIN</a> today.</p><blockquote class=\"tr_bq\"><p> In the latest entry in the saga of Erling Skjalgsson, the 11th Century<br> Norwegian chieftain is struck by a deadly curse, and must journey north<br> along with his friends in order to crush it at its source. Meanwhile<br> Freydis, niece of the smith Lemming, is kidnapped by the servants of a<br> mysterious, ancient cannibalistic race who dwell in secret in the<br> mountains of the north. Once again the Irish priest Father Ailill<br> narrates a tale of struggle, faith, endurance, and supernatural peril.<br> Fans of H. Rider Haggard will delight in this “lost world” adventure.</br></br></br></br></br></br></br></p></blockquote><p>He’s a Minnesotan named Lars, so you know he knows his Vikings. He’s also one of my growing list of <a href=\"http://www.larswalker.com/\">Standout Authors</a>. Check it out, and if you like it, don’t forget to review it.</p></div>",
  "content_text": "Lars Walker, the author of\na piece about Christian Fantasy\npublished on Intercollegiate Review last month that he assures me absolutely did not include a direct shot at\nA Throne of Bones\n, (“wannabee (christened) George R. R. Martins”), is giving away\nfree copies of HAILSTONE MOUNTAIN\ntoday.\nIn the latest entry in the saga of Erling Skjalgsson, the 11th Century\nNorwegian chieftain is struck by a deadly curse, and must journey north\nalong with his friends in order to crush it at its source. Meanwhile\nFreydis, niece of the smith Lemming, is kidnapped by the servants of a\nmysterious, ancient cannibalistic race who dwell in secret in the\nmountains of the north. Once again the Irish priest Father Ailill\nnarrates a tale of struggle, faith, endurance, and supernatural peril.\nFans of H. Rider Haggard will delight in this “lost world” adventure.\nHe’s a Minnesotan named Lars, so you know he knows his Vikings. He’s also one of my growing list of\nStandout Authors\n. Check it out, and if you like it, don’t forget to review it.",
  "tags": [
    "books",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-16T11:00:00+00:00"
}