{
  "url": "https://voxday.net/2013/04/24/gop-contemplates-electoral-suicide/",
  "scraped_at": "2025-12-14T22:26:56.272212",
  "title": "GOP contemplates electoral suicide",
  "date_display": "April 24, 2013",
  "date_iso": "2013-04-24T22:00:00+00:00",
  "date_from_url": "2013-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Any Republican supporting the proposed immigration amnesty <a href=\"http://www.politico.com/story/2013/04/immigration-reform-could-upend-electoral-college-90478.html\">must be considered a RINO by definition</a>:</p><blockquote class=\"tr_bq\"><p> The immigration proposal pending in Congress would transform the nation’s political landscape for a generation or more — pumping as many as 11 million new Hispanic voters into the electorate a decade from now in ways that, if current trends hold, would produce an electoral bonanza for Democrats and cripple Republican prospects in many states they now win easily.</p><p>Beneath the philosophical debates about amnesty and border security, there are brass-tacks partisan calculations driving the thinking of lawmakers in both parties over comprehensive immigration reform, which in its current form offers a pathway to citizenship — and full voting rights — for a group of undocumented residents that roughly equals the population of Ohio, the nation’s seventh-largest state.</p></blockquote><p>It’s telling, is it not, how if the majority responding to a poll favor the legality of homosexuals playing marriage, this is indicative of an urgent moral imperative, but when there is an even stronger shift <a href=\"http://www.foxnews.com/politics/2013/04/23/fox-news-poll-majority-says-legal-immigration-should-be-reduced/\">against LEGAL immigration</a>, it is simply ignored.  Such is the power of the media narrative.</p><p><i>“A just-released Fox News poll finds 55 percent of voters think fewer<br> legal immigrants should be accepted into the U.S.  That’s up from 43<br> percent in 2010.</br></br></i><br> <i>Majorities of Republicans (67 percent) and independents (53 percent)<br> as well as a plurality of Democrats (47 percent) want to decrease legal<br> immigration.</br></br></i>“</br></p><p>But the latest push for amnesty demonstrates the intrinsic bankruptcy of the longtime conservative and Republican position that the immigration problem was rooted in its illegality.  The legality or illegality has never been the issue.  The issue has always been what it has been since the Israelites first immigrated to Canaan; the quantity.  Mass immigration transforms the invaded nation in keeping with the culture of the newcomers and leads to the dissolution of the old structures and their replacement with new and different ones.</p><p>Both liberals and conservatives can say goodbye to American ideals, traditions, and even modes of thought.  There is no picking and choosing about what will be saved and what will be thrown out.  This is not a controlled process. For those progressives who supported immigration because they hated their traditional society, this was the equivalent of trying to hold up a liquor store by setting off an atomic bomb.</p><p>There are certain things upon which no society can compromise and hope to survive. One of them is the quantity of permitted immigration. Since Americans foolishly abandoned their pre-1965 laws against immigration, they have assured themselves one of two outcomes: partition or mass ethnic cleansing.  Or, as history suggests is more likely the case, some combination of both.</p><p>And don’t blame the separatists and ruthless nationalists for their inevitable actions. They are the consequence, they are the symptoms. The responsible parties are all of those individuals, on both the political left and right, who bought into the myth of Ellis Island and welcomed tens of millions of alien invaders into the USA.</p><p>Perhaps I’m wrong. Perhaps this time it will be different and unlike every other reasonable historical analog I can recall. If you live there, you had certainly better hope so. What happened in Boston last week isn’t even the smallest taste of what is likely on the way.</p><p>UPDATE: It took her long enough, but Ann Coulter has finally figured out that the problem isn’t ILLEGAL immigration, but <a href=\"http://www.anncoulter.com/columns/2013-04-24.html\">excessive legal IMMIGRATION</a>.</p></div>",
  "content_text": "Any Republican supporting the proposed immigration amnesty\nmust be considered a RINO by definition\n:\nThe immigration proposal pending in Congress would transform the nation’s political landscape for a generation or more — pumping as many as 11 million new Hispanic voters into the electorate a decade from now in ways that, if current trends hold, would produce an electoral bonanza for Democrats and cripple Republican prospects in many states they now win easily.\nBeneath the philosophical debates about amnesty and border security, there are brass-tacks partisan calculations driving the thinking of lawmakers in both parties over comprehensive immigration reform, which in its current form offers a pathway to citizenship — and full voting rights — for a group of undocumented residents that roughly equals the population of Ohio, the nation’s seventh-largest state.\nIt’s telling, is it not, how if the majority responding to a poll favor the legality of homosexuals playing marriage, this is indicative of an urgent moral imperative, but when there is an even stronger shift\nagainst LEGAL immigration\n, it is simply ignored.  Such is the power of the media narrative.\n“A just-released Fox News poll finds 55 percent of voters think fewer\nlegal immigrants should be accepted into the U.S.  That’s up from 43\npercent in 2010.\nMajorities of Republicans (67 percent) and independents (53 percent)\nas well as a plurality of Democrats (47 percent) want to decrease legal\nimmigration.\n“\nBut the latest push for amnesty demonstrates the intrinsic bankruptcy of the longtime conservative and Republican position that the immigration problem was rooted in its illegality.  The legality or illegality has never been the issue.  The issue has always been what it has been since the Israelites first immigrated to Canaan; the quantity.  Mass immigration transforms the invaded nation in keeping with the culture of the newcomers and leads to the dissolution of the old structures and their replacement with new and different ones.\nBoth liberals and conservatives can say goodbye to American ideals, traditions, and even modes of thought.  There is no picking and choosing about what will be saved and what will be thrown out.  This is not a controlled process. For those progressives who supported immigration because they hated their traditional society, this was the equivalent of trying to hold up a liquor store by setting off an atomic bomb.\nThere are certain things upon which no society can compromise and hope to survive. One of them is the quantity of permitted immigration. Since Americans foolishly abandoned their pre-1965 laws against immigration, they have assured themselves one of two outcomes: partition or mass ethnic cleansing.  Or, as history suggests is more likely the case, some combination of both.\nAnd don’t blame the separatists and ruthless nationalists for their inevitable actions. They are the consequence, they are the symptoms. The responsible parties are all of those individuals, on both the political left and right, who bought into the myth of Ellis Island and welcomed tens of millions of alien invaders into the USA.\nPerhaps I’m wrong. Perhaps this time it will be different and unlike every other reasonable historical analog I can recall. If you live there, you had certainly better hope so. What happened in Boston last week isn’t even the smallest taste of what is likely on the way.\nUPDATE: It took her long enough, but Ann Coulter has finally figured out that the problem isn’t ILLEGAL immigration, but\nexcessive legal IMMIGRATION\n.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-24T21:00:00+00:00"
}