{
  "url": "https://voxday.net/2013/04/27/how-anti-racism-creates-racists/",
  "scraped_at": "2025-12-14T22:27:10.389038",
  "title": "How anti-racism creates racists",
  "date_display": "April 27, 2013",
  "date_iso": "2013-04-27T10:20:00+00:00",
  "date_from_url": "2013-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> In news that should surprise no one, it appears that all those lectures on “white privilege”, the public service announcements declaring “raciss bad”, and television shows and advertisements selling “mudshark good” only <a href=\"http://www.dailymail.co.uk/news/article-2315483/How-anti-racism-lesson-INCREASE-pupil-intolerance-They-cause-animosity-cultures.html\">ends up making people less tolerant</a>:</p><blockquote class=\"tr_bq\"><p> Children who are given anti-racism lessons in school are more likely to be intolerant outside the classroom, a major study found yesterday.  It said accusing white pupils of racism causes animosity, and discussing sensitive ethnic concerns such as honour killings paints minority group children in a bad light.</p><p>The survey said children who live in mixed neighbourhoods are often free of hostility towards other racial groups. But it found that ‘when more attention in class is being paid to the multicultural society, the liberalising effect of positive contact in class on youngsters’ xenophobic attitude decreases’.</p></blockquote><p>This actually isn’t news; there have been several studies indicating the same effect holds true with regards to the global warming propaganda.  But what I find most interesting is that the greatest negative effect isn’t on those who are avowedly racist or simply up-to-date on the relevant science, but rather, on the very moderates to whom the racemongers are primarily attempting to appeal.</p><p>A 2002 study on advertising showed <a href=\"http://www.eurekalert.org/pub_releases/2002-12/esr-haa120902.php\">adults are similarly resistant</a> to the anti-racist propaganda: “People in two minds about their attitudes towards ethnic minority groups<br> become more unfavourable when exposed to anti-racism advertising or<br> arguments, according to new research sponsored by the ESRC. The ‘backfire effects’ occur both in conscious and non-conscious<br> feelings towards people from ethnic minorities, says a report based on<br> studies by a team led by Dr Gregory Maio of the School of Psychology at<br> Cardiff University.”</br></br></br></br></br></p><p>I suspect the backfire effect stems from the natural human instinct to rebel against propaganda and social totalitarianism. Consider the low point of the most recent European football championship. Even the most oppressed, left-leaning, racially conscious African immigrant could not watch the clumsy anti-racist statements read out in robotic fashion by the captains of the two teams playing in the final without feeling a momentary temptation to burn a cross on someone’s lawn, paint a Swastika on a synagogue, order dog at a Chinese restaurant, and sketch a cartoon of Mohammed on the nearest napkin.</p><p>The arguments for the anti-racist position are weak and everyone knows it.  That is why the one thing they cannot permit is free and open discourse on the subject, which is a red flag in the eyes of those of every sub-species, color, or creed who happens to value human liberty.</p><p>Intellectual fads come and go. The intrinsic intellectual and scientific weakness of the equalitarian position is less demonstrated<br> by the counterproductive nature of the heavy propaganda as the<br> equalitarians obvious awareness of their need to resort to it in the<br> first place. Equalitarianism is merely an eyeblink in the grand course of human history and the half-century of attempts to permanently enmesh the various nationalities and human sub-species is nothing that a decade or two of intense wide-scale violence will not easily undo. The ethnic cleansings of the 21st century will be all the more brutal for the multiculturalism and diversity celebrating of the latter half of the 20th.</br></br></br></p><p>It should not be hard to see that love for one’s own kind has been falsely spun as hatred for the Other.  And if one is told that one already hates the Other, even when one has no opinion at all about them, then most people are more likely to graduate to genuine hatred before they will give up their natural and instinctive love for their own. </p><p>Who among you would stop loving your child simply because you were told that your love for your child was hatred for all the other children in their school?  Perhaps the most rabbity might, but faced with such a price, even the average rabbit would shrug and admit that, yes, they do indeed hate all those others.</p></div>",
  "content_text": "In news that should surprise no one, it appears that all those lectures on “white privilege”, the public service announcements declaring “raciss bad”, and television shows and advertisements selling “mudshark good” only\nends up making people less tolerant\n:\nChildren who are given anti-racism lessons in school are more likely to be intolerant outside the classroom, a major study found yesterday.  It said accusing white pupils of racism causes animosity, and discussing sensitive ethnic concerns such as honour killings paints minority group children in a bad light.\nThe survey said children who live in mixed neighbourhoods are often free of hostility towards other racial groups. But it found that ‘when more attention in class is being paid to the multicultural society, the liberalising effect of positive contact in class on youngsters’ xenophobic attitude decreases’.\nThis actually isn’t news; there have been several studies indicating the same effect holds true with regards to the global warming propaganda.  But what I find most interesting is that the greatest negative effect isn’t on those who are avowedly racist or simply up-to-date on the relevant science, but rather, on the very moderates to whom the racemongers are primarily attempting to appeal.\nA 2002 study on advertising showed\nadults are similarly resistant\nto the anti-racist propaganda: “People in two minds about their attitudes towards ethnic minority groups\nbecome more unfavourable when exposed to anti-racism advertising or\narguments, according to new research sponsored by the ESRC. The ‘backfire effects’ occur both in conscious and non-conscious\nfeelings towards people from ethnic minorities, says a report based on\nstudies by a team led by Dr Gregory Maio of the School of Psychology at\nCardiff University.”\nI suspect the backfire effect stems from the natural human instinct to rebel against propaganda and social totalitarianism. Consider the low point of the most recent European football championship. Even the most oppressed, left-leaning, racially conscious African immigrant could not watch the clumsy anti-racist statements read out in robotic fashion by the captains of the two teams playing in the final without feeling a momentary temptation to burn a cross on someone’s lawn, paint a Swastika on a synagogue, order dog at a Chinese restaurant, and sketch a cartoon of Mohammed on the nearest napkin.\nThe arguments for the anti-racist position are weak and everyone knows it.  That is why the one thing they cannot permit is free and open discourse on the subject, which is a red flag in the eyes of those of every sub-species, color, or creed who happens to value human liberty.\nIntellectual fads come and go. The intrinsic intellectual and scientific weakness of the equalitarian position is less demonstrated\nby the counterproductive nature of the heavy propaganda as the\nequalitarians obvious awareness of their need to resort to it in the\nfirst place. Equalitarianism is merely an eyeblink in the grand course of human history and the half-century of attempts to permanently enmesh the various nationalities and human sub-species is nothing that a decade or two of intense wide-scale violence will not easily undo. The ethnic cleansings of the 21st century will be all the more brutal for the multiculturalism and diversity celebrating of the latter half of the 20th.\nIt should not be hard to see that love for one’s own kind has been falsely spun as hatred for the Other.  And if one is told that one already hates the Other, even when one has no opinion at all about them, then most people are more likely to graduate to genuine hatred before they will give up their natural and instinctive love for their own.\nWho among you would stop loving your child simply because you were told that your love for your child was hatred for all the other children in their school?  Perhaps the most rabbity might, but faced with such a price, even the average rabbit would shrug and admit that, yes, they do indeed hate all those others.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-27T09:20:00+00:00"
}