{
  "url": "https://voxday.net/2013/04/03/hultgreen-curie/",
  "scraped_at": "2025-12-14T22:24:51.074067",
  "title": "Flirting with Hultgreen-Curie Syndrome",
  "date_display": "April 3, 2013",
  "date_iso": "2013-04-03T17:17:00+00:00",
  "date_from_url": "2013-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because I am in the midst of reading <i>Terms of Enlistment</i>, a new military SF novel, I found <a href=\"http://freebeacon.com/female-marines-fail-infantry-officer-course/\">this USMC news</a> to be more than a little amusing:</p><blockquote class=\"tr_bq\"><p> “The only two women to participate in the Marine Corps Infantry<br> Officer Course (IOC) failed ongoing tests to determine which infantry<br> positions should be available to women, according to the <i><a href=\"http://www.marinecorpstimes.com/article/20130402/NEWS/304020020\" rel=\"noopener\" target=\"_blank\">Marine Corps Times</a></i>:<i> </i></br></br></p><p><i>‘The women failed the introductory Combat Endurance Test, a<br> punishing test of physical strength and endurance, officials at Marine<br> Corps headquarters said Tuesday. The latest class began March 28 at<br> Marine Corps Base Quantico, Va., with 110 lieutenants participating.<br> Ninety-six men passed the initial endurance test. Twelve men and two<br> women — the only female Marines taking part — failed.’</br></br></br></br></br></i></p><p>The two women both volunteered to participate in the IOC. Two other<br> women had previously volunteered in September but also failed.”</br></p></blockquote><p>The Marines will have no choice but to make the Combat Endurance Test more equal.  Which is to say easier.  Because, after all, everyone knows that actual military combat is considerably less difficult than an introductory fitness test.</p><p>What I’d love to see is for the Marine Corps to address the political pressure it is facing by creating an all-female combat battalion.  Give them the very best of training, the best equipment, and then put them right on the front lines.  After one-third of them suddenly fall pregnant before the deployment, another third flee at the first sound of gunfire, and the remaining third are captured and raped, there won’t be any need to continue the debate any longer.</p><p>When faced with lunatic nonsense, agree and amplify.  To be honest, I’m genuinely surprised that none of the four female pioneers managed to break their necks or otherwise get themselves killed during the test.</p></div>",
  "content_text": "Because I am in the midst of reading\nTerms of Enlistment\n, a new military SF novel, I found\nthis USMC news\nto be more than a little amusing:\n“The only two women to participate in the Marine Corps Infantry\nOfficer Course (IOC) failed ongoing tests to determine which infantry\npositions should be available to women, according to the\nMarine Corps Times\n:\n‘The women failed the introductory Combat Endurance Test, a\npunishing test of physical strength and endurance, officials at Marine\nCorps headquarters said Tuesday. The latest class began March 28 at\nMarine Corps Base Quantico, Va., with 110 lieutenants participating.\nNinety-six men passed the initial endurance test. Twelve men and two\nwomen — the only female Marines taking part — failed.’\nThe two women both volunteered to participate in the IOC. Two other\nwomen had previously volunteered in September but also failed.”\nThe Marines will have no choice but to make the Combat Endurance Test more equal.  Which is to say easier.  Because, after all, everyone knows that actual military combat is considerably less difficult than an introductory fitness test.\nWhat I’d love to see is for the Marine Corps to address the political pressure it is facing by creating an all-female combat battalion.  Give them the very best of training, the best equipment, and then put them right on the front lines.  After one-third of them suddenly fall pregnant before the deployment, another third flee at the first sound of gunfire, and the remaining third are captured and raped, there won’t be any need to continue the debate any longer.\nWhen faced with lunatic nonsense, agree and amplify.  To be honest, I’m genuinely surprised that none of the four female pioneers managed to break their necks or otherwise get themselves killed during the test.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-03T16:17:00+00:00"
}