{
  "url": "https://voxday.net/2013/04/09/i-suspect-connection/",
  "scraped_at": "2025-12-14T22:25:21.720407",
  "title": "I suspect a connection",
  "date_display": "April 9, 2013",
  "date_iso": "2013-04-09T08:36:00+00:00",
  "date_from_url": "2013-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ed Trimnell observes that not only are atheists far more inclined to attack Christianity than Islam, but some are even willing to publicly declare that Islam should be <a href=\"http://onewordtrimnell.blogspot.com/2013/04/saloncom-to-new-atheists-critique.html\">off-limits to atheist criticism</a>:</p><blockquote class=\"tr_bq\"><p> “It seems that a writer at Salon.com is upset because the so-called “New Atheists” have been rather unkind to Islam of late. In a piece entitled “Dawkins, Harris, Hitchens: New Atheists flirt with Islamophobia” Nathan Lean suggests that these New Atheists should simply shut up about terrorism, sharia courts ordering death sentences for apostates, and honor killings in the Muslim world. Then they can go back to doing what atheists in the post-modern West are supposed to do: talk about the threat that evangelical Christianity poses to humanity. (After all, some of those hillbilly reactionary Christians still haven’t fully embraced same-sex marriage!)”</p></blockquote><p>I suspect that this sort of thing might have something to do with <a href=\"http://www.volokh.com/2013/04/08/god-is-great-hang-the-atheist-bloggers/\">the atheist hypocrisy</a>:</p><blockquote class=\"tr_bq\"><p> “Hundreds of thousands of people have held protests in Bangladesh to<br> demand that the government introduce an anti-blasphemy law that would<br> include the death penalty for bloggers who insult Islam…. Supporters of Hefazat-e-Islam, an Islamist group which draws support<br> from tens of thousands of religious seminaries [and that has the backing<br> of country’s largest party, Jamaat-e-Islami], converged on Dhaka’s main<br> commercial hub to protest against what they said were blasphemous<br> writings by atheist bloggers, shouting “God is great — hang the atheist<br> bloggers”.”</br></br></br></br></br></br></br></p></blockquote><p>Apparently the old chestnut about there being no atheists in foxholes isn’t all that far from the truth. Christians are holding to their faith even as they are murdered for it by Muslims in Nigeria and Egypt and by atheists in China and North Korea. Atheists, meanwhile, are showing that they don’t have the courage of their lack of conviction, thus proving my point that post-Christianity in the West is unlikely to look any different than post-Christianity in the Middle East.</p><p>A post-Christian West will be pagan, not secular. It will be in the form of dark gods like Santa Muerte and Damballah Wedo, and it will be rooted in death and cruelty. It should be recalled that whereas there never was any medieval “Dark Ages”, there is a very good reason why Jesus Christ was considered “the Light of the World” by civilized and scholarly men who were familiar with the darkness of pagan cultures that preceded Christian society. Merely having to compete with that Christian society considerably improved paganism, as even Julian the Apostate implicitly admitted in his futile attempt to build a paganism capable of rivaling it.</p><p><i>“Julian’s heart was set on a civil and religious reformation. He longed for amendment in law and administration, above all for a remodelling of the old cult and the winning of converts to the cause of the gods. He himself was to be the head of the new state church of Paganism; the hierarchy of the Christians was to be adopted — the country priests subordinated to the high priest of the province, the high priest to be responsible to the Emperor, the pontifex maximus. A new spirit was to inspire the Pagan clergy; the priest himself was to be no longer a mere performer of public rites, let him take up the work of preacher, expound the deeper sense which underlay the old mythology and be at once shepherd of souls and an ensample to his flock in holy living. What Maximin Daza had attempted to achieve in ruder fashion by forged acts of Pilate, Julian’s writings against the Galilaeans should effect: as Maximin had bidden cities ask what they would of his royal bounty, did they but petition that the Christians might be removed from their midst, so Julian was ready to assist and favour towns which were loyal to the old faith. Maximin had created a new priesthood recruited from men who had won distinction in public careers. his dream had been to fashion an organisation which might successfully withstand the Christian clergy; here too Julian was his disciple. </i></p><p><i>“When pest and famine had desolated the Roman East in Maximia’s days, the helpfulness and liberality of Christians towards the starving and the plague-stricken had forced men to confess that true piety and religion had made their home with the persecuted heretics: it was Julian’s will that Paganism should boast its public charity and that an all-embracing service of humanity should be reasserted as a vital part of the ancient creed. If only the worshippers of the gods of Hellas were once quickened with a spiritual enthusiasm, the lost ground would be recovered. It was indeed to this call that Paganism could not respond. There were men who clung to the old belief, but theirs was no longer a victorious faith, for the fire had died upon the altar. Resignation to Christian intolerance was bitter, but the passion which inspires martyrs was nowhere to be found. Julian made converts — the Christian writers mournfully testify to their numbers —but he made them by imperial gold, by promises of advancement or fear of dismissal. They were not the stuff of which missionaries could be fashonied. The citizens were disappointed of their pageants, while the royal enthusiast found his hopes to be illusions. Mutual embitterment was the natural result.” </i><br> – The Cambridge Medieval History Vol. I, pp 362-363</br></p><p>That was 1,650 years ago. There is truly nothing new under the sun. Even today, we see “the passion which inspires martyrs was nowhere to be found.”<i> </i>The reason Richard Dawkins’s attempt to set up an atheist charity will ultimately be no more successful than the Emperor Julian’s efforts is because the Christian customs they seek to imitate are not inspired and encouraged for their own sake, but by the particular religious impulse. Both history and observation clearly indicate that it is no more possible to maintain the tenets and various aspects of Christian civilization considered desirable by non-Christians without the Christian faith to support them than it is to maintain intellectual function without a beating heart.</p><p>Such efforts can be maintained, for a short time, by extraordinary artificial measures. But they will fail soon enough. And then the true nature of pagan darkness will reveal itself again.</p></div>",
  "content_text": "Ed Trimnell observes that not only are atheists far more inclined to attack Christianity than Islam, but some are even willing to publicly declare that Islam should be\noff-limits to atheist criticism\n:\n“It seems that a writer at Salon.com is upset because the so-called “New Atheists” have been rather unkind to Islam of late. In a piece entitled “Dawkins, Harris, Hitchens: New Atheists flirt with Islamophobia” Nathan Lean suggests that these New Atheists should simply shut up about terrorism, sharia courts ordering death sentences for apostates, and honor killings in the Muslim world. Then they can go back to doing what atheists in the post-modern West are supposed to do: talk about the threat that evangelical Christianity poses to humanity. (After all, some of those hillbilly reactionary Christians still haven’t fully embraced same-sex marriage!)”\nI suspect that this sort of thing might have something to do with\nthe atheist hypocrisy\n:\n“Hundreds of thousands of people have held protests in Bangladesh to\ndemand that the government introduce an anti-blasphemy law that would\ninclude the death penalty for bloggers who insult Islam…. Supporters of Hefazat-e-Islam, an Islamist group which draws support\nfrom tens of thousands of religious seminaries [and that has the backing\nof country’s largest party, Jamaat-e-Islami], converged on Dhaka’s main\ncommercial hub to protest against what they said were blasphemous\nwritings by atheist bloggers, shouting “God is great — hang the atheist\nbloggers”.”\nApparently the old chestnut about there being no atheists in foxholes isn’t all that far from the truth. Christians are holding to their faith even as they are murdered for it by Muslims in Nigeria and Egypt and by atheists in China and North Korea. Atheists, meanwhile, are showing that they don’t have the courage of their lack of conviction, thus proving my point that post-Christianity in the West is unlikely to look any different than post-Christianity in the Middle East.\nA post-Christian West will be pagan, not secular. It will be in the form of dark gods like Santa Muerte and Damballah Wedo, and it will be rooted in death and cruelty. It should be recalled that whereas there never was any medieval “Dark Ages”, there is a very good reason why Jesus Christ was considered “the Light of the World” by civilized and scholarly men who were familiar with the darkness of pagan cultures that preceded Christian society. Merely having to compete with that Christian society considerably improved paganism, as even Julian the Apostate implicitly admitted in his futile attempt to build a paganism capable of rivaling it.\n“Julian’s heart was set on a civil and religious reformation. He longed for amendment in law and administration, above all for a remodelling of the old cult and the winning of converts to the cause of the gods. He himself was to be the head of the new state church of Paganism; the hierarchy of the Christians was to be adopted — the country priests subordinated to the high priest of the province, the high priest to be responsible to the Emperor, the pontifex maximus. A new spirit was to inspire the Pagan clergy; the priest himself was to be no longer a mere performer of public rites, let him take up the work of preacher, expound the deeper sense which underlay the old mythology and be at once shepherd of souls and an ensample to his flock in holy living. What Maximin Daza had attempted to achieve in ruder fashion by forged acts of Pilate, Julian’s writings against the Galilaeans should effect: as Maximin had bidden cities ask what they would of his royal bounty, did they but petition that the Christians might be removed from their midst, so Julian was ready to assist and favour towns which were loyal to the old faith. Maximin had created a new priesthood recruited from men who had won distinction in public careers. his dream had been to fashion an organisation which might successfully withstand the Christian clergy; here too Julian was his disciple.\n“When pest and famine had desolated the Roman East in Maximia’s days, the helpfulness and liberality of Christians towards the starving and the plague-stricken had forced men to confess that true piety and religion had made their home with the persecuted heretics: it was Julian’s will that Paganism should boast its public charity and that an all-embracing service of humanity should be reasserted as a vital part of the ancient creed. If only the worshippers of the gods of Hellas were once quickened with a spiritual enthusiasm, the lost ground would be recovered. It was indeed to this call that Paganism could not respond. There were men who clung to the old belief, but theirs was no longer a victorious faith, for the fire had died upon the altar. Resignation to Christian intolerance was bitter, but the passion which inspires martyrs was nowhere to be found. Julian made converts — the Christian writers mournfully testify to their numbers —but he made them by imperial gold, by promises of advancement or fear of dismissal. They were not the stuff of which missionaries could be fashonied. The citizens were disappointed of their pageants, while the royal enthusiast found his hopes to be illusions. Mutual embitterment was the natural result.”\n– The Cambridge Medieval History Vol. I, pp 362-363\nThat was 1,650 years ago. There is truly nothing new under the sun. Even today, we see “the passion which inspires martyrs was nowhere to be found.”\nThe reason Richard Dawkins’s attempt to set up an atheist charity will ultimately be no more successful than the Emperor Julian’s efforts is because the Christian customs they seek to imitate are not inspired and encouraged for their own sake, but by the particular religious impulse. Both history and observation clearly indicate that it is no more possible to maintain the tenets and various aspects of Christian civilization considered desirable by non-Christians without the Christian faith to support them than it is to maintain intellectual function without a beating heart.\nSuch efforts can be maintained, for a short time, by extraordinary artificial measures. But they will fail soon enough. And then the true nature of pagan darkness will reveal itself again.",
  "tags": [
    "atheism",
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-09T07:36:00+00:00"
}