{
  "url": "https://voxday.net/2013/04/05/is-reality-misogynistic/",
  "scraped_at": "2025-12-14T22:24:58.532289",
  "title": "Is reality misogynistic?",
  "date_display": "April 5, 2013",
  "date_iso": "2013-04-05T11:34:00+00:00",
  "date_from_url": "2013-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This was <a href=\"http://www.hookingupsmart.com/2013/04/04/politics-and-feminism/game-and-cowering-bad-boys/comment-page-2/#comment-197593\">an interesting exchange</a> over at Susan’s place.  Mike C asked her if  something I wrote merited being described in a certain manner:</p><blockquote class=\"tr_bq\"><p> Does <a href=\"http://alphagameplan.blogspot.com/2013/03/sexual-equality-or-freedom.html\">this language from Vox Day</a> also count as misogynistic? I am trying to figure out if this also falls into your categorization of misogynistic?<i><b> </b></i></p><p><i><b>“Because women are collectively more short-sighted and more<br> self-centered than men, giving them an equal voice in society is<br> tantamount to a slow-motion execution for any society.</br></br></b> This is not<br> theoretical, it is observable, as the equalitarian societies of Europe<br> are already demographically in demise and in the process of losing their<br> democracies and their property rights.</br></br></br></i></p><p><i>I understand that many people believe women’s rights are important.<br> But are they more important than property rights?  Are they more<br> important than democracy? What those who support women’s rights are<br> understandably reluctant to accept is that equalitarianism necessarily<br> requires the elimination of democracy, property rights, freedom of<br> movement, and even, in the end, capitalism and most of the tenets of<br> Western civilization.  But like it or not, that is the choice that has<br> been made, and is being made, even today.</br></br></br></br></br></br></br></i></p><p><i>The Founding Fathers of the USA were no more mindless sexists than the Conscript Fathers of the Roman Senate. <b>They<br> knew full well what would happen if sexual equality was ever granted.<br> It is not a coincidence, still less ironic, that those who built the<br> greatest and freest human societies have always vehemently opposed<br> women’s rights,</br></br></br></br></b> while the totalitarians who most avidly sought to curtail human freedom it have tended to support them.”</i></p><p>To which Susan replied:  “Totally.”</p></blockquote><p> I don’t think this is correct.  I don’t think it’s even possibly correct, in fact, I will assert that the notion is a simple category error. To claim that the observable, demonstrable, and provable<br> contradiction between women’s rights and the rights upon which Western<br> civilization were historically founded could even theoretically be described as misogynistic is tantamount to setting oneself<br> against logic, against history, and against reality itself.</br></br></br></p><p>As the Castrate said, it is so or it is not so.  If women’s rights contradict the rights of natural law, or the rights guaranteed by the U.S. Constitution, then they contradict them.  If I am correct, and they do, then it is a simple matter of fact and neither my feelings about women or Susan’s feelings about Martians have anything whatsoever to do with the matter. The idea is not misogynistic for the same reason it is not romantic or anti-semitic or happy or purple. The term simply cannot apply, not even hypothetically.</p><p>But no one need take my<br> word for this.  I plan to methodically prove it, conclusively, in a<br> series of forthcoming posts.  As I mentioned on her blog, I’d even welcome Susan’s contribution, if she would care to provide<br> me with what she would consider to be the definitive “women’s rights”.</br></br></br></p><p>I would also welcome a comprehensive list of “women’s rights” as they are distinguished from simple non-sexually based rights from anyone, male or female, who considers himself to be a feminist or even just a defender of “women’s rights”.  I can, of course, simply resort to Wikipedia, but I would prefer to utilize the list provided by a self-professed champion of them.</p></div>",
  "content_text": "This was\nan interesting exchange\nover at Susan’s place.  Mike C asked her if  something I wrote merited being described in a certain manner:\nDoes\nthis language from Vox Day\nalso count as misogynistic? I am trying to figure out if this also falls into your categorization of misogynistic?\n“Because women are collectively more short-sighted and more\nself-centered than men, giving them an equal voice in society is\ntantamount to a slow-motion execution for any society.\nThis is not\ntheoretical, it is observable, as the equalitarian societies of Europe\nare already demographically in demise and in the process of losing their\ndemocracies and their property rights.\nI understand that many people believe women’s rights are important.\nBut are they more important than property rights?  Are they more\nimportant than democracy? What those who support women’s rights are\nunderstandably reluctant to accept is that equalitarianism necessarily\nrequires the elimination of democracy, property rights, freedom of\nmovement, and even, in the end, capitalism and most of the tenets of\nWestern civilization.  But like it or not, that is the choice that has\nbeen made, and is being made, even today.\nThe Founding Fathers of the USA were no more mindless sexists than the Conscript Fathers of the Roman Senate.\nThey\nknew full well what would happen if sexual equality was ever granted.\nIt is not a coincidence, still less ironic, that those who built the\ngreatest and freest human societies have always vehemently opposed\nwomen’s rights,\nwhile the totalitarians who most avidly sought to curtail human freedom it have tended to support them.”\nTo which Susan replied:  “Totally.”\nI don’t think this is correct.  I don’t think it’s even possibly correct, in fact, I will assert that the notion is a simple category error. To claim that the observable, demonstrable, and provable\ncontradiction between women’s rights and the rights upon which Western\ncivilization were historically founded could even theoretically be described as misogynistic is tantamount to setting oneself\nagainst logic, against history, and against reality itself.\nAs the Castrate said, it is so or it is not so.  If women’s rights contradict the rights of natural law, or the rights guaranteed by the U.S. Constitution, then they contradict them.  If I am correct, and they do, then it is a simple matter of fact and neither my feelings about women or Susan’s feelings about Martians have anything whatsoever to do with the matter. The idea is not misogynistic for the same reason it is not romantic or anti-semitic or happy or purple. The term simply cannot apply, not even hypothetically.\nBut no one need take my\nword for this.  I plan to methodically prove it, conclusively, in a\nseries of forthcoming posts.  As I mentioned on her blog, I’d even welcome Susan’s contribution, if she would care to provide\nme with what she would consider to be the definitive “women’s rights”.\nI would also welcome a comprehensive list of “women’s rights” as they are distinguished from simple non-sexually based rights from anyone, male or female, who considers himself to be a feminist or even just a defender of “women’s rights”.  I can, of course, simply resort to Wikipedia, but I would prefer to utilize the list provided by a self-professed champion of them.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-05T10:34:00+00:00"
}