{
  "url": "https://voxday.net/2013/04/17/jesus-loves-you-god-not-so-muc/",
  "scraped_at": "2025-12-14T22:26:11.636683",
  "title": "Jesus loves you. God, probably not so much.",
  "date_display": "April 17, 2013",
  "date_iso": "2013-04-17T16:58:00+00:00",
  "date_from_url": "2013-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div itemprop=\"reviewBody\"> Comedians, gay rights activists, and “accomplished journalists” are probably not the right people to consult when you wish to contemplate Christian theology. Meanwhile, <a href=\"http://www.nytimes.com/2013/04/14/books/review/does-jesus-really-love-me-by-jeff-chu.html?partner=rss&amp;emc=rss&amp;smid=tw-nytimes&amp;_r=2&amp;\">the New York Times slanders millions of Christians </a>by falsely and absurdly misrepresenting both their faith and their attitude towards a particular group of notoriously unrepentant sinners.</div><blockquote class=\"tr_bq\"><div itemprop=\"reviewBody\"> The crowd laughs a little nervously when Minchin, an outspoken atheist,<br> begins to sing, “I love Jesus, I love Jesus.” They bought tickets to a<br> comedy show, not a religious revival. Minchin prompts the audience to<br> join him. “Who do you love?” he asks. “Sing it!” Soon the whole crowd is<br> singing “I love Jesus, I love Jesus,” along with Minchin, in a video<br> that has been viewed half a million times on YouTube. </br></br></br></br></br></div><div itemprop=\"reviewBody\"> Then Minchin changes the lyrics: “I love Jesus, I hate faggots,” he<br> sings. “I love Jesus, I hate faggots.” The crowd stops singing along.<br> Minchin looks up from his guitar, pretending not to understand what the<br> problem could be. </br></br></br></div><div itemprop=\"reviewBody\"> “What happened? I just lost you there,” Minchin says. He makes a<br> halfhearted attempt to get the singalong going again before giving up.<br> “Ah, well,” he shrugs. “Maybe these are ideas best shared in churches.” </br></br></div><div itemprop=\"reviewBody\"> Those ideas — loving Jesus means hating gay people — are proclaimed in<br> Christian churches and on Christian television and radio broadcasts. The<br> combined efforts of the Family Research Council, the National<br> Organization for Marriage, “The 700 Club,” the United States Conference<br> of Catholic Bishops, the Westboro Baptist Church, and countless<br> conservative Christian activists, preachers and politicians have<br> succeeded in making antigay bigotry seem synonymous with Christianity. </br></br></br></br></br></br></div><div itemprop=\"reviewBody\"> This can cause a lot of heartache — with sometimes devastating<br> consequences — for gay, lesbian, bisexual and transgender children born<br> into fundamentalist or evangelical Christian families. Such was the case<br> for Jeff Chu, the author of “Does Jesus Really Love Me? A Gay<br> Christian’s Pilgrimage in Search of God in America.” Chu is an<br> accomplished journalist who recently married his male partner. But Chu’s<br> mother, a devout Baptist, didn’t attend her son’s wedding. She still<br> cries herself to sleep every night, Chu writes, tormented by the<br> certainty that her gay son is “lost.” </br></br></br></br></br></br></br></br></div><div itemprop=\"reviewBody\"> As a child, Chu adored the song “Jesus Loves Me.” But does Jesus love<br> him now that he’s an openly gay adult? Chu has his doubts: “There are<br> still moments when I wonder whether my homosexuality is my ticket to<br> hell.”</br></br></br></div></blockquote><p>Does Jesus still love Chu? Absolutely.  Does God hate those who refuse to repent of their abomination?  We have a strong Biblical basis for asserting that, given how many times we are told He hates the wicked.  It isn’t Chu’s homosexuality that is his ticket to Hell, it is his refusal to repent of his sin and his refusal to permit Jesus Christ to stand in his stead in the time of judgment.</p><p>We are all sinners. The very last thing I want is to have to stand behind my personal permanent record and be judged by it.  I want my official record, as far as God’s judgment is concerned, to be that of history’s only sinless man.  The proper question with which one should be concerned isn’t whether Jesus loves one or not, but whether God does.</p><p>This piece is as trivial as it is slanderous.  It is not “antigay bigotry” to claim that unrepentant sinners who not only glory in their sin, but define themselves by it, are headed straight for the eternal incinerator, especially if Hell does not exist.  If I were to say that homosexuals are all destined to be raped by unicorns and leprechauns, no one would consider it bigotry.  This is mere rhetoric, intended to modify Christian behavior to the liking of those who hate Christianity by a transparent attempt at emotional manipulation.</p><p>Either unrepentant homosexuals are Hell-bound or they are not.  No amount of touchy-feely Churchian welcomism will change that either way.  And to the extent that the wicked are welcomed into the Church without being warned of the need to repent, the Church is failing in its Christian duty.  Homosexuality, like almost every other sin, can be forgiven. But before forgiveness can be granted, there must be repentance.</p><p>Liberals always love to cite the example of the adulterous woman spared stoning by Jesus asking who will cast the first stone.  And they always leave off the vital conclusion, where Jesus tells the woman to “go and sin no more”.</p><p>The wickedness of the homosexual community can be seen in its corrosive effect on others.  Consider this passage in light of the requirement Jesus laid upon his followers:</p><p><i>After Benjamin Sullivan-Knoff came out to his parents in his sophomore<br> year of high school, his mother begged her son not to do so publicly.<br> She was working as an associate pastor at a conservative church — an<br> Evangelical Covenant Church — and she feared she would be fired if her<br> son came out. A few months later she reversed herself, asked for her<br> son’s forgiveness and gave him her blessing to come out. “I love this<br> denomination,” Eva Sullivan-Knoff tells Chu, “but I love my son more.” </br></br></br></br></br></br></i></p><p>She loves her son more than her denomination, which is fine. But she has revealed that she is no Christian disciple, she cannot be, as per the words of Jesus Christ himself.<br> <i><br/></i><br> <i>“If anyone comes to me and does not hate his own father and mother and<br> wife and children and brothers and sisters, yes, and even his own life,<br> he cannot be my disciple.”</br></br></i><br> – Luke 14:26</br></br></br></p><p>Christianity is not the easy way.  It is the hard way. We forget that at our peril. And to those Churchians and non-Christians who would attempt to argue with the points presented here, I have a single question: precisely what sins beside homosexual fornication did Jesus Christ declare a man did not need to repent in order to be saved?</p></div>",
  "content_text": "Comedians, gay rights activists, and “accomplished journalists” are probably not the right people to consult when you wish to contemplate Christian theology. Meanwhile,\nthe New York Times slanders millions of Christians\nby falsely and absurdly misrepresenting both their faith and their attitude towards a particular group of notoriously unrepentant sinners.\nThe crowd laughs a little nervously when Minchin, an outspoken atheist,\nbegins to sing, “I love Jesus, I love Jesus.” They bought tickets to a\ncomedy show, not a religious revival. Minchin prompts the audience to\njoin him. “Who do you love?” he asks. “Sing it!” Soon the whole crowd is\nsinging “I love Jesus, I love Jesus,” along with Minchin, in a video\nthat has been viewed half a million times on YouTube.\nThen Minchin changes the lyrics: “I love Jesus, I hate faggots,” he\nsings. “I love Jesus, I hate faggots.” The crowd stops singing along.\nMinchin looks up from his guitar, pretending not to understand what the\nproblem could be.\n“What happened? I just lost you there,” Minchin says. He makes a\nhalfhearted attempt to get the singalong going again before giving up.\n“Ah, well,” he shrugs. “Maybe these are ideas best shared in churches.”\nThose ideas — loving Jesus means hating gay people — are proclaimed in\nChristian churches and on Christian television and radio broadcasts. The\ncombined efforts of the Family Research Council, the National\nOrganization for Marriage, “The 700 Club,” the United States Conference\nof Catholic Bishops, the Westboro Baptist Church, and countless\nconservative Christian activists, preachers and politicians have\nsucceeded in making antigay bigotry seem synonymous with Christianity.\nThis can cause a lot of heartache — with sometimes devastating\nconsequences — for gay, lesbian, bisexual and transgender children born\ninto fundamentalist or evangelical Christian families. Such was the case\nfor Jeff Chu, the author of “Does Jesus Really Love Me? A Gay\nChristian’s Pilgrimage in Search of God in America.” Chu is an\naccomplished journalist who recently married his male partner. But Chu’s\nmother, a devout Baptist, didn’t attend her son’s wedding. She still\ncries herself to sleep every night, Chu writes, tormented by the\ncertainty that her gay son is “lost.”\nAs a child, Chu adored the song “Jesus Loves Me.” But does Jesus love\nhim now that he’s an openly gay adult? Chu has his doubts: “There are\nstill moments when I wonder whether my homosexuality is my ticket to\nhell.”\nDoes Jesus still love Chu? Absolutely.  Does God hate those who refuse to repent of their abomination?  We have a strong Biblical basis for asserting that, given how many times we are told He hates the wicked.  It isn’t Chu’s homosexuality that is his ticket to Hell, it is his refusal to repent of his sin and his refusal to permit Jesus Christ to stand in his stead in the time of judgment.\nWe are all sinners. The very last thing I want is to have to stand behind my personal permanent record and be judged by it.  I want my official record, as far as God’s judgment is concerned, to be that of history’s only sinless man.  The proper question with which one should be concerned isn’t whether Jesus loves one or not, but whether God does.\nThis piece is as trivial as it is slanderous.  It is not “antigay bigotry” to claim that unrepentant sinners who not only glory in their sin, but define themselves by it, are headed straight for the eternal incinerator, especially if Hell does not exist.  If I were to say that homosexuals are all destined to be raped by unicorns and leprechauns, no one would consider it bigotry.  This is mere rhetoric, intended to modify Christian behavior to the liking of those who hate Christianity by a transparent attempt at emotional manipulation.\nEither unrepentant homosexuals are Hell-bound or they are not.  No amount of touchy-feely Churchian welcomism will change that either way.  And to the extent that the wicked are welcomed into the Church without being warned of the need to repent, the Church is failing in its Christian duty.  Homosexuality, like almost every other sin, can be forgiven. But before forgiveness can be granted, there must be repentance.\nLiberals always love to cite the example of the adulterous woman spared stoning by Jesus asking who will cast the first stone.  And they always leave off the vital conclusion, where Jesus tells the woman to “go and sin no more”.\nThe wickedness of the homosexual community can be seen in its corrosive effect on others.  Consider this passage in light of the requirement Jesus laid upon his followers:\nAfter Benjamin Sullivan-Knoff came out to his parents in his sophomore\nyear of high school, his mother begged her son not to do so publicly.\nShe was working as an associate pastor at a conservative church — an\nEvangelical Covenant Church — and she feared she would be fired if her\nson came out. A few months later she reversed herself, asked for her\nson’s forgiveness and gave him her blessing to come out. “I love this\ndenomination,” Eva Sullivan-Knoff tells Chu, “but I love my son more.”\nShe loves her son more than her denomination, which is fine. But she has revealed that she is no Christian disciple, she cannot be, as per the words of Jesus Christ himself.\n“If anyone comes to me and does not hate his own father and mother and\nwife and children and brothers and sisters, yes, and even his own life,\nhe cannot be my disciple.”\n– Luke 14:26\nChristianity is not the easy way.  It is the hard way. We forget that at our peril. And to those Churchians and non-Christians who would attempt to argue with the points presented here, I have a single question: precisely what sins beside homosexual fornication did Jesus Christ declare a man did not need to repent in order to be saved?",
  "tags": [
    "Christianity",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-17T15:58:00+00:00"
}