{
  "url": "https://voxday.net/2013/04/23/john-piper-was-rig/",
  "scraped_at": "2025-12-14T22:26:47.777666",
  "title": "John Piper was right",
  "date_display": "April 23, 2013",
  "date_iso": "2013-04-23T13:00:00+00:00",
  "date_from_url": "2013-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I haven’t changed my mind in the least about any of the things for which I have criticized him, but I do have to commend him for the spiritual perception he showed in his succinct dismissal of Rob Bell. <a href=\"http://thegospelcoalition.org/blogs/justintaylor/2012/03/30/farewell-rob-bell/\">He was interviewed about that last</a> year by Justin Taylor:</p><blockquote class=\"tr_bq\"><p> <b>“You famously tweeted, “Farewell Rob Bell” in response to his promotional video for his book Love Wins. Is there a place for theological reconciliation in the body of Christ?”</b></p><p>“To say yes to that—and you should say yes—would require serious definition. When you say theological reconciliation, you can mean two people with two different theologies working their way through to a common theology. That is their way of being reconciled. That’s what I give most of my energies to. I want to persuade people of what I see in the Bible, and work towards unity in truth. Probably what would be thought when [people] ask that question is: Can two people who maintain their differences in theology then be more reconciled? So, you wouldn’t say farewell; you would say hello. The answer is that it depends on the issues.</p><p>I don’t mind addressing the Rob Bell issue. When I watched the video of Rob Bell that was put up on Justin Taylor’s website, which was, I think, a link to his book on hell, my issue there was not primarily his view of hell. It was his cynicism concerning the Cross of Jesus Christ as a place where the Father atoned for the sins of his children and dealt with his own wrath by punishing me in his son. Rob Bell does not admire that. He doesn’t view the Cross that way, as a penal substitution.”</p></blockquote><p>I detected a distinct whiff of sulfur about Bell from the first time I read a mainstream article lauding his ideas about Hell.  And it became completely obvious that he is one of the wolves in sheep’s clothing about whom the Apostle Paul warned when he declared this last month: <i>“I believe God [is] pulling us ahead into greater and greater<br> affirmation and acceptance of our gay brothers and sisters and pastors<br> and friends and neighbors and coworkers.” </br></br></i></p><p>Substitute any sinful adjective you like for “gay” and it rapidly becomes obvious how blatantly evil Bell’s position is.  The god that he worships is not the God of the Bible, and most certainly is not the Christian God, who is not tolerant, who is not affirming, and who is not accepting of everyone. To claim otherwise is to eliminate the very foundation of the Christian faith, which is that all men are fallen, that Jesus Christ died for man’s sins, and that he offers the only way to the Father.</p><p>Piper was correct. There is no place for the Cross in Bell’s religion.  There is not even any place for Jesus Christ. Whatever it may be, it is not Christianity.</p></div>",
  "content_text": "I haven’t changed my mind in the least about any of the things for which I have criticized him, but I do have to commend him for the spiritual perception he showed in his succinct dismissal of Rob Bell.\nHe was interviewed about that last\nyear by Justin Taylor:\n“You famously tweeted, “Farewell Rob Bell” in response to his promotional video for his book Love Wins. Is there a place for theological reconciliation in the body of Christ?”\n“To say yes to that—and you should say yes—would require serious definition. When you say theological reconciliation, you can mean two people with two different theologies working their way through to a common theology. That is their way of being reconciled. That’s what I give most of my energies to. I want to persuade people of what I see in the Bible, and work towards unity in truth. Probably what would be thought when [people] ask that question is: Can two people who maintain their differences in theology then be more reconciled? So, you wouldn’t say farewell; you would say hello. The answer is that it depends on the issues.\nI don’t mind addressing the Rob Bell issue. When I watched the video of Rob Bell that was put up on Justin Taylor’s website, which was, I think, a link to his book on hell, my issue there was not primarily his view of hell. It was his cynicism concerning the Cross of Jesus Christ as a place where the Father atoned for the sins of his children and dealt with his own wrath by punishing me in his son. Rob Bell does not admire that. He doesn’t view the Cross that way, as a penal substitution.”\nI detected a distinct whiff of sulfur about Bell from the first time I read a mainstream article lauding his ideas about Hell.  And it became completely obvious that he is one of the wolves in sheep’s clothing about whom the Apostle Paul warned when he declared this last month:\n“I believe God [is] pulling us ahead into greater and greater\naffirmation and acceptance of our gay brothers and sisters and pastors\nand friends and neighbors and coworkers.”\nSubstitute any sinful adjective you like for “gay” and it rapidly becomes obvious how blatantly evil Bell’s position is.  The god that he worships is not the God of the Bible, and most certainly is not the Christian God, who is not tolerant, who is not affirming, and who is not accepting of everyone. To claim otherwise is to eliminate the very foundation of the Christian faith, which is that all men are fallen, that Jesus Christ died for man’s sins, and that he offers the only way to the Father.\nPiper was correct. There is no place for the Cross in Bell’s religion.  There is not even any place for Jesus Christ. Whatever it may be, it is not Christianity.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-23T12:00:00+00:00"
}