{
  "url": "https://voxday.net/2013/04/11/koanic-soul-reviews-wardogs-coin/",
  "scraped_at": "2025-12-14T22:25:37.523909",
  "title": "Koanic Soul reviews The Wardog’s Coin",
  "date_display": "April 11, 2013",
  "date_iso": "2013-04-11T18:04:00+00:00",
  "date_from_url": "2013-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we’re on the subject of SF/F and book reviews, I suppose turnabout is fair play. Koanic Soul provides <a href=\"http://www.koanicsoul.com/blog/2013/04/11/review-of-a-wardogs-coin-by-vox-day/\">the Neanderthal perspective on The Wardog’s Coin</a>.  An excerpt:</p><blockquote class=\"tr_bq\"><p> This book contains two short stories, “Wardog’s Coin” and “Qalabi Dawn”. It’s well worth buying as an ebook. Spoilers ahead, so <a href=\"http://www.amazon.com/The-Wardogs-Coin-ebook/dp/B00C1TMVBY/ref=sr_1_1?ie=UTF8&amp;qid=1365671710&amp;sr=8-1&amp;keywords=wardog%27s+coin\">just buy it</a> if you trust me.</p><p>Overall, the story was great and stayed with me. The wargaming bones of<br> the battle make it stick in memory with lucid clarity. The elven combat<br> was awesome, the relative combat strengths of the various troops was<br> clear, the warrior morale of the humans was realistic and rousing….</br></br></br></p><p>There is only one word for Qalabi Dawn – epic. This is Vox at his<br> greatest. Writing alien demon-cat characters. What does this say about<br> him? Figure it out for yourself.</br></br></p></blockquote><p>I understand what he is saying about the order of the two stories, and perhaps he’s right, but my thought was that as the title piece, The Wardog’s Coin was akin to the A-side of a single and therefore had to be first.  Also, I guessed that Qalabi Dawn would tend to come off as a little out there, so I figured it would be wise to put the more accessible story first.</p><p>I personally tend to like Qalabi better, but I’m not surprised that many, if not most of the readers see it otherwise. And I’m pleased that the perspective of the demonspawn comes across as a distinctly alien one, as that was my goal from the start.</p><p>With regards to what Koanic describes as a cliche, I should probably mention that it is a tribute to another author I happen to hold in some regard.  If you haven’t noticed, all of my books end that way.</p></div>",
  "content_text": "Since we’re on the subject of SF/F and book reviews, I suppose turnabout is fair play. Koanic Soul provides\nthe Neanderthal perspective on The Wardog’s Coin\n.  An excerpt:\nThis book contains two short stories, “Wardog’s Coin” and “Qalabi Dawn”. It’s well worth buying as an ebook. Spoilers ahead, so\njust buy it\nif you trust me.\nOverall, the story was great and stayed with me. The wargaming bones of\nthe battle make it stick in memory with lucid clarity. The elven combat\nwas awesome, the relative combat strengths of the various troops was\nclear, the warrior morale of the humans was realistic and rousing….\nThere is only one word for Qalabi Dawn – epic. This is Vox at his\ngreatest. Writing alien demon-cat characters. What does this say about\nhim? Figure it out for yourself.\nI understand what he is saying about the order of the two stories, and perhaps he’s right, but my thought was that as the title piece, The Wardog’s Coin was akin to the A-side of a single and therefore had to be first.  Also, I guessed that Qalabi Dawn would tend to come off as a little out there, so I figured it would be wise to put the more accessible story first.\nI personally tend to like Qalabi better, but I’m not surprised that many, if not most of the readers see it otherwise. And I’m pleased that the perspective of the demonspawn comes across as a distinctly alien one, as that was my goal from the start.\nWith regards to what Koanic describes as a cliche, I should probably mention that it is a tribute to another author I happen to hold in some regard.  If you haven’t noticed, all of my books end that way.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-11T17:04:00+00:00"
}