{
  "url": "https://voxday.net/2013/04/19/lars-walker-reviews-throne-of-bones/",
  "scraped_at": "2025-12-14T22:26:24.294980",
  "title": "Lars Walker reviews A THRONE OF BONES",
  "date_display": "April 19, 2013",
  "date_iso": "2013-04-19T17:00:00+00:00",
  "date_from_url": "2013-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we were discussing George Martin and the aspects of his work which tend to appeal to the Left yesterday, the appearance of this review is a timely one. Lars Walker is the author of the novels that collectively make up <i>The Erling Skjalgsson Saga</i>, and as can be seen <a href=\"http://g-ecx.images-amazon.com/images/G/01/ciu/d1/c0/a9007e0ab0440a7e9d9a71.L._V148635214_SX200_.jpg\">from his picture</a>, is a descendant of Vikings himself. (Ladies, I believe he is single.) This no doubt made it rather painful for him to read through the scenes set in the Iles de Loup.   Nevertheless, he manfully slogged through them in order to write <a href=\"http://brandywinebooks.net/?post_id=5293\">his review of A THRONE OF BONES</a>.</p><blockquote class=\"tr_bq\"><p> Most anyone who starts reading Throne of Bones will realize that it’s very much the same sort of thing as George R. R. Martin’s Song of Fire and Ice books, and Vox makes no denial of this. But he’s trying to do the same sort of thing in a very different way, which for me makes all the difference….</p><p>I enjoyed it immensely. Vox Day isn’t the prose stylist George R. R. Martin is, but he’s not bad. On the plus side we have a complicated, complex story with interesting and sympathetic, fully rounded characters. There are few out-and-out villains – everybody is doing what they think right. And unlike Martin’s stories, the fact that someone is virtuous and noble does not guarantee them a painful and ignominious death. In terms of pure story, Vox Day’s book is much more rewarding. And Christianity is treated not only with respect, but as a true part of the cosmos. Much recommended. </p></blockquote><p>Walker is entirely correct to say that ATOB is very much the same sort of thing as AGOT. It was intended that way from the start.  However, I did not write <i>Arts of Dark and Light</i> to imitate <i>A Song of Ice and Fire</i>, but rather, to create a fantasy epic of similar scope that not only improves upon Martin’s series in terms of characterization, intellectual depth, and storytelling, but also demonstrates the way in which the utilization of a more traditional and historically coherent perspective can permit a less-talented writer to create works capable of surpassing the well-written, but empty, soulless literary edifices constructed by the betrayers of the fantasy tradition created by George MacDonald and so firmly established by JRR Tolkien and CS Lewis.</p><p>Contra the superficial assumptions of those who look only at the rhyming names and the similar heft of the two books, <i>A THRONE OF BONES</i> is not an imitation of <i>A GAME OF THRONES</i>. To the extent that it is relevant to compare the two books, it would be considerably more accurate to describe it as literary criticism in action.  I find it a little ironic that while people often ask critics if they can do any better, on the rare occasion one actually attempts to do so, one is accused of wishing to imitate the object of criticism.</p></div>",
  "content_text": "As we were discussing George Martin and the aspects of his work which tend to appeal to the Left yesterday, the appearance of this review is a timely one. Lars Walker is the author of the novels that collectively make up\nThe Erling Skjalgsson Saga\n, and as can be seen\nfrom his picture\n, is a descendant of Vikings himself. (Ladies, I believe he is single.) This no doubt made it rather painful for him to read through the scenes set in the Iles de Loup.   Nevertheless, he manfully slogged through them in order to write\nhis review of A THRONE OF BONES\n.\nMost anyone who starts reading Throne of Bones will realize that it’s very much the same sort of thing as George R. R. Martin’s Song of Fire and Ice books, and Vox makes no denial of this. But he’s trying to do the same sort of thing in a very different way, which for me makes all the difference….\nI enjoyed it immensely. Vox Day isn’t the prose stylist George R. R. Martin is, but he’s not bad. On the plus side we have a complicated, complex story with interesting and sympathetic, fully rounded characters. There are few out-and-out villains – everybody is doing what they think right. And unlike Martin’s stories, the fact that someone is virtuous and noble does not guarantee them a painful and ignominious death. In terms of pure story, Vox Day’s book is much more rewarding. And Christianity is treated not only with respect, but as a true part of the cosmos. Much recommended.\nWalker is entirely correct to say that ATOB is very much the same sort of thing as AGOT. It was intended that way from the start.  However, I did not write\nArts of Dark and Light\nto imitate\nA Song of Ice and Fire\n, but rather, to create a fantasy epic of similar scope that not only improves upon Martin’s series in terms of characterization, intellectual depth, and storytelling, but also demonstrates the way in which the utilization of a more traditional and historically coherent perspective can permit a less-talented writer to create works capable of surpassing the well-written, but empty, soulless literary edifices constructed by the betrayers of the fantasy tradition created by George MacDonald and so firmly established by JRR Tolkien and CS Lewis.\nContra the superficial assumptions of those who look only at the rhyming names and the similar heft of the two books,\nA THRONE OF BONES\nis not an imitation of\nA GAME OF THRONES\n. To the extent that it is relevant to compare the two books, it would be considerably more accurate to describe it as literary criticism in action.  I find it a little ironic that while people often ask critics if they can do any better, on the rare occasion one actually attempts to do so, one is accused of wishing to imitate the object of criticism.",
  "tags": [
    "books",
    "Selenoth",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-19T16:00:00+00:00"
}