{
  "url": "https://voxday.net/2013/04/06/liberals-giving-awards-to-each-other/",
  "scraped_at": "2025-12-14T22:25:07.747236",
  "title": "Liberals giving awards to each other",
  "date_display": "April 6, 2013",
  "date_iso": "2013-04-06T14:38:00+00:00",
  "date_from_url": "2013-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Justin Landon of Staffer’s Book Review appears to be about as impressed <a href=\"http://www.staffersbookreview.com/2013/04/can-we-stop-talking-about-the-hugos-now.html\">with the Hugo Awards</a> as I am with the SFWA’s Nebula Awards:</p><blockquote class=\"tr_bq\"><p> The Hugos are utter twaddle.</p><p>Although the Hugos present the image of something more cosmopolitan<br> or representative than the standard convention award, it’s becoming<br> increasingly apparent every year that, despite being the most<br> recognizable award in science fiction and fantasy cultural awareness,<br> the Hugos are nothing more than an amalgamation of like minded WorldCon<br> members, or agendized voting blocs, bent on vociferous back patting. I<br> apply that statement broadly, although it is most obviously associated<br> with the down ballot. Before I get too far into <i>that</i> rabbit<br> hole, let me first place ‘best novel’ squarely in my sites where the<br> only explanation is that the average Hugo voter reads somewhere been<br> four and six novels a year.</br></br></br></br></br></br></br></br></br></br></p><p>Often when critics rail against the Hugo’s best novel category it’s<br> to attack lack of sophistication. The Clarke Award, British Science<br> Fiction Award, the Kitschies, Tiptree Award, Philip K. Dick Award, and<br> others spend some time examining science fiction and fantasy literature<br> through a critical lens. Anyone expecting that from the Hugo Award isn’t<br> just off the mark, they might as well be trying to stick ‘it’ in the<br> sarlacc.</br></br></br></br></br></br></p><p>No, the Hugo voter has a certain style it looks for in its<br> fiction. Hugo-style, if you will, is like Gangnam-style only without the<br> distracting Korean guy riding a horse, replaced with Charles Stross and<br> Connie Willis on a podium holding a. . . rocket ship. I admit<br> Gangnam-style doesn’t have nearly as much sex appeal. In other words,<br> Hugo nominated books tend to be recognizable. On the one hand because<br> they are mostly written by Stross, Willis, John Scalzi, China Miéville,<br> Robert Charles Wilson, Lois McMaster Bujold, Ian MacDonald, and active<br> members of the Live Journal community, but also because they fit a<br> certain motif that’s difficult to pin down. I’ll fall back on the old<br> pornography argument, ‘I know it when I see it.”</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I have to admit, I don’t pay any more attention to the Hugo Awards than I do the the Dove Awards, the Christie Awards, the Academy Awards, the Emmy Awards, or the Tony Awards. The only reason I care about the Nebula Awards is because I am a Lifetime member of the organization that gives them out and I find it embarrassing that the SFWA so often honors mediocre novels at the expense of much more worthy ones.</p><p>The only award I’ve truly cared about in the last few years was Adrian Peterson’s MVP award for his heroic performance this past season; yes, it’s a quarterbacks’ league now but if the NFL MVP is only going to go to quarterbacks, then simply rename it the MVQ and be done with it.</p><p>And when I say I don’t care about awards, I mean it quite literally. I didn’t even know that <i>Summa Elvetica</i> had been nominated for an award until I saw it on Wikipedia a few years later, and when Marcher Lord was warned that <i>A Throne of Bones </i>would not be eligible for a certain award if I did not edit some of its more offensive bits, I cheerfully told them to go ahead and disqualify it.  I’m with Raymond Feist on this, who knows perfectly well that he’ll never win an award until he is declared an SFWA Grandmaster, probably after he is safely dead.  He is, quite simply, too successful to merit them.</p><p>Everyone has different goals. Rabbits need the group affirmation that these sorts of political awards offer them. Not-rabbits don’t. Psykosonik once beat out Prince for Best Dance Record at the Minnesota Music Awards for a song I wrote; I didn’t know we’d won until months later because not only did I not bother going, my bandmates who did didn’t even see fit to mention it because they knew I didn’t care. I didn’t even know I had been a three-time Billboard top 40 recording artist for about 16 years until I looked it up a few months ago when I was pointing out the dirty laundry of  the “New York Times bestselling” authors.</p><p>When you are fortunate enough to experience success, you learn to value certain aspects of it and to disvalue others.  My objective is to write a great epic fantasy series that is capable of creating the same feeling in its readers as Dune once created in me. That’s why I simply laugh when people claim I’m jealous of McRapey, or I’m imitating George Martin, or my feelings are wounded that <i>A Throne of Bones</i> wasn’t nominated for any awards.  Because in the game I’m playing, those things don’t even enter into it. They’re not relevant to my metric for success.</p><p>Perhaps I’ll succeed.  Perhaps I’ll fail. Most people would probably, and quite reasonably, bet on the latter. But regardless, talking about how people are performing in the shotput or the pole vault and who is winning those events means absolutely nothing to me over here in the blocks with Frank Herbert, Lloyd Alexander, Susan Cooper, Richard Adams, and Neal Stephenson.</p></div>",
  "content_text": "Justin Landon of Staffer’s Book Review appears to be about as impressed\nwith the Hugo Awards\nas I am with the SFWA’s Nebula Awards:\nThe Hugos are utter twaddle.\nAlthough the Hugos present the image of something more cosmopolitan\nor representative than the standard convention award, it’s becoming\nincreasingly apparent every year that, despite being the most\nrecognizable award in science fiction and fantasy cultural awareness,\nthe Hugos are nothing more than an amalgamation of like minded WorldCon\nmembers, or agendized voting blocs, bent on vociferous back patting. I\napply that statement broadly, although it is most obviously associated\nwith the down ballot. Before I get too far into\nthat\nrabbit\nhole, let me first place ‘best novel’ squarely in my sites where the\nonly explanation is that the average Hugo voter reads somewhere been\nfour and six novels a year.\nOften when critics rail against the Hugo’s best novel category it’s\nto attack lack of sophistication. The Clarke Award, British Science\nFiction Award, the Kitschies, Tiptree Award, Philip K. Dick Award, and\nothers spend some time examining science fiction and fantasy literature\nthrough a critical lens. Anyone expecting that from the Hugo Award isn’t\njust off the mark, they might as well be trying to stick ‘it’ in the\nsarlacc.\nNo, the Hugo voter has a certain style it looks for in its\nfiction. Hugo-style, if you will, is like Gangnam-style only without the\ndistracting Korean guy riding a horse, replaced with Charles Stross and\nConnie Willis on a podium holding a. . . rocket ship. I admit\nGangnam-style doesn’t have nearly as much sex appeal. In other words,\nHugo nominated books tend to be recognizable. On the one hand because\nthey are mostly written by Stross, Willis, John Scalzi, China Miéville,\nRobert Charles Wilson, Lois McMaster Bujold, Ian MacDonald, and active\nmembers of the Live Journal community, but also because they fit a\ncertain motif that’s difficult to pin down. I’ll fall back on the old\npornography argument, ‘I know it when I see it.”\nI have to admit, I don’t pay any more attention to the Hugo Awards than I do the the Dove Awards, the Christie Awards, the Academy Awards, the Emmy Awards, or the Tony Awards. The only reason I care about the Nebula Awards is because I am a Lifetime member of the organization that gives them out and I find it embarrassing that the SFWA so often honors mediocre novels at the expense of much more worthy ones.\nThe only award I’ve truly cared about in the last few years was Adrian Peterson’s MVP award for his heroic performance this past season; yes, it’s a quarterbacks’ league now but if the NFL MVP is only going to go to quarterbacks, then simply rename it the MVQ and be done with it.\nAnd when I say I don’t care about awards, I mean it quite literally. I didn’t even know that\nSumma Elvetica\nhad been nominated for an award until I saw it on Wikipedia a few years later, and when Marcher Lord was warned that\nA Throne of Bones\nwould not be eligible for a certain award if I did not edit some of its more offensive bits, I cheerfully told them to go ahead and disqualify it.  I’m with Raymond Feist on this, who knows perfectly well that he’ll never win an award until he is declared an SFWA Grandmaster, probably after he is safely dead.  He is, quite simply, too successful to merit them.\nEveryone has different goals. Rabbits need the group affirmation that these sorts of political awards offer them. Not-rabbits don’t. Psykosonik once beat out Prince for Best Dance Record at the Minnesota Music Awards for a song I wrote; I didn’t know we’d won until months later because not only did I not bother going, my bandmates who did didn’t even see fit to mention it because they knew I didn’t care. I didn’t even know I had been a three-time Billboard top 40 recording artist for about 16 years until I looked it up a few months ago when I was pointing out the dirty laundry of  the “New York Times bestselling” authors.\nWhen you are fortunate enough to experience success, you learn to value certain aspects of it and to disvalue others.  My objective is to write a great epic fantasy series that is capable of creating the same feeling in its readers as Dune once created in me. That’s why I simply laugh when people claim I’m jealous of McRapey, or I’m imitating George Martin, or my feelings are wounded that\nA Throne of Bones\nwasn’t nominated for any awards.  Because in the game I’m playing, those things don’t even enter into it. They’re not relevant to my metric for success.\nPerhaps I’ll succeed.  Perhaps I’ll fail. Most people would probably, and quite reasonably, bet on the latter. But regardless, talking about how people are performing in the shotput or the pole vault and who is winning those events means absolutely nothing to me over here in the blocks with Frank Herbert, Lloyd Alexander, Susan Cooper, Richard Adams, and Neal Stephenson.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-06T13:38:00+00:00"
}