{
  "url": "https://voxday.net/2013/04/25/mailvox-innumerate-atheists/",
  "scraped_at": "2025-12-14T22:26:58.142297",
  "title": "Mailvox: the innumerate atheists",
  "date_display": "April 25, 2013",
  "date_iso": "2013-04-25T05:30:00+00:00",
  "date_from_url": "2013-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SM has a request that is appropriate for National Autism Awareness Week.  Let’s not forget to be aware of our Socially Autistic friends such as Richard Dawkins and Sam Harris:</p><blockquote class=\"tr_bq\"><p> hey vox, can you show me some evidence that dawkins sucks at math? would be awesome thanks.</p></blockquote><p><i> “The anthropic principle has been an embarrassing problem for secular scientists in recent decades due to the way in which the probability of the universe and Earth just happening to be perfectly suitable for human life is very, very low. The extreme unlikelihood of everything being not too hot, not too cold, not too big, and not too small, to put it very crudely, has often been cited as evidence that the universe has been designed for us, presumably by God. </i></p><p><i>Now, Richard Dawkins is arguably not an individual particularly well-suited to play around with probability. He may not be quite as mathematically handicapped as Sam Harris, but he is known to have some issues in this regard, being openly mocked for his “comic authority” and “fatal attraction” to mathematical concepts by the French mathematician <a href=\"http://www.arn.org/docs/odesign/od172/schutz172.htm\">Marcel-Paul Schützenberger</a>.</i></p><p><i>(“But look, the construction of the relevant space cannot proceed until a preliminary analysis has been carried out, one in which the set of all possible trajectories is assessed, this together with an estimation of their average distance from the specified goal. The preliminary analysis is beyond the reach of empirical study. It presupposes—the same word that seems to recur in theoretical biology—that the biologist (or computer scientist) know the totality of the situation, the properties of the ensemble of trajectories. In terms of mathematical logic, the nature of this space is entirely enigmatic.” )</i></p><p><i>Schützenberger’s contempt for Dawkins’s mathematical abilities is well-founded, as it’s generally not considered to be a good idea to adopt a casual approach to mathematical probability, as Dawkins does with the “one in a billion” chance of something like DNA spontaneously arising which he invents ex nihilo, before reaching the shocking statistical conclusion that if there are a billion billion planets and a one in a billion chance of life spontaneously arising on a planet, then life must exist on a billion planets throughout the universe! Dawkins is genuinely surprised by his astonishing discovery of mathematical division, so much so that he repeats it twice.”</i><br> – TIA p. 151<i> </i></br></p><p>As a bonus, this was the reason behind the reference to Sam Harris:<br> <i>“The first thing one notices is that Sam Harris can’t even manage elementary school math. The percentage for the safest cities determined by state voting patterns is not 62 percent; seventeen blue state cities divided by twenty-five total cities equals 68 percent safe blue cities.</i>“<br> – TIA p. 124</br></br></p></div>",
  "content_text": "SM has a request that is appropriate for National Autism Awareness Week.  Let’s not forget to be aware of our Socially Autistic friends such as Richard Dawkins and Sam Harris:\nhey vox, can you show me some evidence that dawkins sucks at math? would be awesome thanks.\n“The anthropic principle has been an embarrassing problem for secular scientists in recent decades due to the way in which the probability of the universe and Earth just happening to be perfectly suitable for human life is very, very low. The extreme unlikelihood of everything being not too hot, not too cold, not too big, and not too small, to put it very crudely, has often been cited as evidence that the universe has been designed for us, presumably by God.\nNow, Richard Dawkins is arguably not an individual particularly well-suited to play around with probability. He may not be quite as mathematically handicapped as Sam Harris, but he is known to have some issues in this regard, being openly mocked for his “comic authority” and “fatal attraction” to mathematical concepts by the French mathematician\nMarcel-Paul Schützenberger\n.\n(“But look, the construction of the relevant space cannot proceed until a preliminary analysis has been carried out, one in which the set of all possible trajectories is assessed, this together with an estimation of their average distance from the specified goal. The preliminary analysis is beyond the reach of empirical study. It presupposes—the same word that seems to recur in theoretical biology—that the biologist (or computer scientist) know the totality of the situation, the properties of the ensemble of trajectories. In terms of mathematical logic, the nature of this space is entirely enigmatic.” )\nSchützenberger’s contempt for Dawkins’s mathematical abilities is well-founded, as it’s generally not considered to be a good idea to adopt a casual approach to mathematical probability, as Dawkins does with the “one in a billion” chance of something like DNA spontaneously arising which he invents ex nihilo, before reaching the shocking statistical conclusion that if there are a billion billion planets and a one in a billion chance of life spontaneously arising on a planet, then life must exist on a billion planets throughout the universe! Dawkins is genuinely surprised by his astonishing discovery of mathematical division, so much so that he repeats it twice.”\n– TIA p. 151\nAs a bonus, this was the reason behind the reference to Sam Harris:\n“The first thing one notices is that Sam Harris can’t even manage elementary school math. The percentage for the safest cities determined by state voting patterns is not 62 percent; seventeen blue state cities divided by twenty-five total cities equals 68 percent safe blue cities.\n“\n– TIA p. 124",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-25T04:30:00+00:00"
}