{
  "url": "https://voxday.net/2013/04/04/mailvox-combatting-ignorance/",
  "scraped_at": "2025-12-14T22:24:52.931097",
  "title": "Mailvox: combatting ignorance",
  "date_display": "April 4, 2013",
  "date_iso": "2013-04-04T08:26:00+00:00",
  "date_from_url": "2013-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Phoenician, in his imitable style, can’t even understand Wikipedia when he quotes it:</p><blockquote class=\"tr_bq\"><p> <i>“The 2000 Equality amendment to the Military Service law states that “The right of women to serve in any role in the IDF is equal to the right of men.” As of now, 88% to 92% of all roles in the IDF are open to female candidates, while women can be found in 69% of all positions. […]</i></p><p>A combat option for women is the Caracal Battalion, which is a highly operational force that is made up of 70 percent female soldiers. The unit undergoes training like any combat infantry. The IDF commando K9 unit, Oketz, also drafts females as elite combat soldiers.”</p><p>You’re a moron, Dipshit.</p></blockquote><p>I do so enjoy when Pharyngulans comment here.  All they ever manage to do is publicly demonstrate that their IQs are at least two standard deviations below mine.  In this case, he clearly fails to understand the significance of the fact that 8 to 12 percent of the roles in the IDF are closed to women; those are the actual combat roles.  Women in the IDF are simply not permitted to serve in any combat role.  They haven’t served in them since 1948. They are allowed to train for combat, but <a href=\"http://www.your-krav-maga-expert.com/women-in-idf.html\">they are not permitted to actually perform any combat role</a> for the very reasons I originally cited and more.<br> <i><br>“Women serve in support and combat support roles in the IDF, recently they have been allowed additional options but they still do not serve in active combat.  Around the world there has been some discussion about whether or not women should serve in active front-line combat. <b>In Israel it is clear that despite the vast contribution of women in the military, active combat is not an option. </b>This decision is based on the physical and biological differences between men and women but also for moral reasons. As Michal, a combat fitness instructor in the IDF, says, “No one wants to even think of the possibility of an Israeli girl falling into the hands of the enemy.” Our history is already filled with too many such stories of atrocities.</br></i></br></p><p>The Israeli military has always combined the practically of combat with the morality of our Jewish way of life. For political reasons women’s groups have tried to break down barriers but <b>the simple fact is that physically women are not capable of doing the job men do. </b>There was an attempt to integrate women in the Search and Rescue units but it was discovered that a great deal of physical damage was caused to them as a result of the increased effort. Even the girls who were integrated into the anti-aircraft unit suffered great physical damage during the long hikes. They suffered more than 30% more stress factors than the boys.”</p><p>Wake Up is dubious:</p><blockquote class=\"tr_bq\"><p> Congratulations on your exploits in Tekken.</p></blockquote><p>Yeah, it wasn’t a video game, it was a similarly dubious active-duty Marine officer with significant combat experience.  He doesn’t mock the martial arts any more.  Nor would you if you tried to last even one minute against me or any other Dragon from my old dojo.  I’ve seen no shortage of doubters and mockers.  No one ever remained that way after stepping onto the mats and experiencing what a combination of speed, strength, experience, and training can do to the average tough guy.  We never did any choreographed fight demonstrations either.  We simply gave people a pair of gloves and told them to take their best shot.  Most of them did exactly the same thing.  Step-step-cock-grimace-BIG rear hand.  The rest tried the midsection tackle.</p><p>RealMatt, on the other hand, is simply misinformed:</p><blockquote class=\"tr_bq\"><p> The odds of a person trained in every single martial art ever known to man, with little to no real life fight experience, performing well in an actual fight, are very low.</p></blockquote><p>Totally false.  It depends upon the school and the training.  The first time I got into an actual fight after I’d had a few years of training, it took me about ten seconds to incapacitate the guy with an arm bar after breaking his nose.  There is a very real difference between the fighting schools and the non-fighting schools.  I’ve been knocked out and had bones from my nose to my toes broken in training, whereas in the four real fights I was in, no one ever even managed to touch me.  In my experience, heavy contact sparring with someone who is trained is a lot harder than real fighting, as untrained brawlers not only tend to present a myriad of open targets, they advertise what they are going to do.</p><p>For example, they have a tendency to lead with their face, which is when the guy cocks his rear arm back as he leans or actually steps forward.  This is a very, very bad mistake against a trained fighter and usually results in eating a jab.  The instinctive grapplers, on the other hand, like to tackle at the waist.  That is how the aforementioned Marine managed to put himself in position to get his neck snapped so quickly.  Go with the flow, drop the arms, slide the left up and over, grab, twist, and lock.  Then ride to the ground, but carefully.</p><p>However, most men tend to start with punches, so my preference is usually to sidestep and catch the arm as it comes at me, pull it past and pivot to either a) slam the guy face-first into a wall if it is there, or b) keep turning and put him down on the ground in an armbar if it is not.  If the wall is there, I jam his arm up high behind his back while he’s stunned, then turn him and sweep his legs to put him down.  Then I put one knee on the back of his neck while keeping his arm pinned high. I also try to speak reassuringly, telling him to calm down, it’s all right, and so forth. They can’t do anything in that position, but you don’t want them to panic and cause you to break something.  The combination of the shock, the pain, and the helplessness usually causes them to relax in short order.</p><p>The only time this didn’t work without a problem was the second time, because I stopped with the guy pinned against the wall.  He seemed calm enough, so I stepped back and let him go, at which point he lunged at my bouncer friend.  That was how I learned not to stop until the guy is not only temporarily incapacitated, but down as well.</p></div>",
  "content_text": "Phoenician, in his imitable style, can’t even understand Wikipedia when he quotes it:\n“The 2000 Equality amendment to the Military Service law states that “The right of women to serve in any role in the IDF is equal to the right of men.” As of now, 88% to 92% of all roles in the IDF are open to female candidates, while women can be found in 69% of all positions. […]\nA combat option for women is the Caracal Battalion, which is a highly operational force that is made up of 70 percent female soldiers. The unit undergoes training like any combat infantry. The IDF commando K9 unit, Oketz, also drafts females as elite combat soldiers.”\nYou’re a moron, Dipshit.\nI do so enjoy when Pharyngulans comment here.  All they ever manage to do is publicly demonstrate that their IQs are at least two standard deviations below mine.  In this case, he clearly fails to understand the significance of the fact that 8 to 12 percent of the roles in the IDF are closed to women; those are the actual combat roles.  Women in the IDF are simply not permitted to serve in any combat role.  They haven’t served in them since 1948. They are allowed to train for combat, but\nthey are not permitted to actually perform any combat role\nfor the very reasons I originally cited and more.\n“Women serve in support and combat support roles in the IDF, recently they have been allowed additional options but they still do not serve in active combat.  Around the world there has been some discussion about whether or not women should serve in active front-line combat.\nIn Israel it is clear that despite the vast contribution of women in the military, active combat is not an option.\nThis decision is based on the physical and biological differences between men and women but also for moral reasons. As Michal, a combat fitness instructor in the IDF, says, “No one wants to even think of the possibility of an Israeli girl falling into the hands of the enemy.” Our history is already filled with too many such stories of atrocities.\nThe Israeli military has always combined the practically of combat with the morality of our Jewish way of life. For political reasons women’s groups have tried to break down barriers but\nthe simple fact is that physically women are not capable of doing the job men do.\nThere was an attempt to integrate women in the Search and Rescue units but it was discovered that a great deal of physical damage was caused to them as a result of the increased effort. Even the girls who were integrated into the anti-aircraft unit suffered great physical damage during the long hikes. They suffered more than 30% more stress factors than the boys.”\nWake Up is dubious:\nCongratulations on your exploits in Tekken.\nYeah, it wasn’t a video game, it was a similarly dubious active-duty Marine officer with significant combat experience.  He doesn’t mock the martial arts any more.  Nor would you if you tried to last even one minute against me or any other Dragon from my old dojo.  I’ve seen no shortage of doubters and mockers.  No one ever remained that way after stepping onto the mats and experiencing what a combination of speed, strength, experience, and training can do to the average tough guy.  We never did any choreographed fight demonstrations either.  We simply gave people a pair of gloves and told them to take their best shot.  Most of them did exactly the same thing.  Step-step-cock-grimace-BIG rear hand.  The rest tried the midsection tackle.\nRealMatt, on the other hand, is simply misinformed:\nThe odds of a person trained in every single martial art ever known to man, with little to no real life fight experience, performing well in an actual fight, are very low.\nTotally false.  It depends upon the school and the training.  The first time I got into an actual fight after I’d had a few years of training, it took me about ten seconds to incapacitate the guy with an arm bar after breaking his nose.  There is a very real difference between the fighting schools and the non-fighting schools.  I’ve been knocked out and had bones from my nose to my toes broken in training, whereas in the four real fights I was in, no one ever even managed to touch me.  In my experience, heavy contact sparring with someone who is trained is a lot harder than real fighting, as untrained brawlers not only tend to present a myriad of open targets, they advertise what they are going to do.\nFor example, they have a tendency to lead with their face, which is when the guy cocks his rear arm back as he leans or actually steps forward.  This is a very, very bad mistake against a trained fighter and usually results in eating a jab.  The instinctive grapplers, on the other hand, like to tackle at the waist.  That is how the aforementioned Marine managed to put himself in position to get his neck snapped so quickly.  Go with the flow, drop the arms, slide the left up and over, grab, twist, and lock.  Then ride to the ground, but carefully.\nHowever, most men tend to start with punches, so my preference is usually to sidestep and catch the arm as it comes at me, pull it past and pivot to either a) slam the guy face-first into a wall if it is there, or b) keep turning and put him down on the ground in an armbar if it is not.  If the wall is there, I jam his arm up high behind his back while he’s stunned, then turn him and sweep his legs to put him down.  Then I put one knee on the back of his neck while keeping his arm pinned high. I also try to speak reassuringly, telling him to calm down, it’s all right, and so forth. They can’t do anything in that position, but you don’t want them to panic and cause you to break something.  The combination of the shock, the pain, and the helplessness usually causes them to relax in short order.\nThe only time this didn’t work without a problem was the second time, because I stopped with the guy pinned against the wall.  He seemed calm enough, so I stepped back and let him go, at which point he lunged at my bouncer friend.  That was how I learned not to stop until the guy is not only temporarily incapacitated, but down as well.",
  "tags": [
    "mailvox",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-04T07:26:00+00:00"
}