{
  "url": "https://voxday.net/2013/04/24/mailvox-evolution-and-slippery-slope/",
  "scraped_at": "2025-12-14T22:26:51.119721",
  "title": "Mailvox: evolution and the slippery slope",
  "date_display": "April 24, 2013",
  "date_iso": "2013-04-24T05:00:00+00:00",
  "date_from_url": "2013-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Williamson <a href=\"http://www.michaelzwilliamson.com/blog/item/the-fail-it-burns#c\">answered the question I posed to him</a> in response to his claims about creationists.</p><blockquote class=\"tr_bq\"><p> <b>1. How do creationists “pose a serious threat to society”?</b></p><p>Society only functions when the majority of the people agree on basic fundamental ideas. A critical mass of people who believe reason and evidence don’t matter is a slippery slope to tyranny.</p></blockquote><p>Williamson’s reasoning is totally specious here.  The overwhelming majority of Americans were creationists from the very beginning, and yet somehow, with the exception of the Lincoln presidency, managed to avoid slipping into tyranny.  And, as a matter of fact, there is a positive correlation between the number of non-Creationists in the United States and the growth of increasingly intrusive government.</p><p>Williamson is engaging in the very intellectual dishonesty he falsely imputed to me by erroneously attempting to equate “creationists” with “people who believe reason and evidence don’t matter”.  I am a creationist.  I also believe that reason and evidence matter a very great deal indeed.  Williamson has asserted a false dichotomy that my mere existence is sufficient to expose.  And I am very far from the only creationist who not only believes reason and evidence matter, but utilizes them more adroitly than Mr. Williamson does.</p><p>Moreover, Mr. Williamson’s entire argument is based on a demonstrably false assumption that a belief in creationism necessarily conflicts with a belief in evolution by natural selection.  While I am a creationist who is skeptical of the Theorum of Evolution by (probably) Natural Selection as described by Richard Dawkins, it should be obvious that creationism and evolution by natural selection are at least potentially complimentary because natural selection intrinsically requires genes from which to select.  As the brighter sort of evolutionists are fond of pointing out when pressed, evolution says absolutely nothing about the origins of <i>life</i>, it only concerns the transformation of one existing <i>species </i>into another.  Even to a mere +3 SD intelligence like Mr. Williamson, it should be readily apparent that evolution by natural selection cannot possibly take place via the mutation of nonexistent genes.</p><p>Only evolution by natural selection combined with abiogenesis can be considered to be intrinsically opposed to creationism, and even that is debatable given that logic dictates the artificial replication of abiogenesis by scientists would offer more support a creator behind the abiogenesis than it taking place by time and chance alone.</p><blockquote class=\"tr_bq\"><p> <b>2. There are an estimated 1,263,186 animal species and 326,175 plant species in the world. Assuming the age of the Earth is 4.54 billion years, what is the average rate of speciation?</b></p><p>The technical definition of species is somewhat iffy, at times arbitrary, and needs more work to be fleshed out.</p></blockquote><p>Mr. Williamson not only cannot calculate a rate that absolutely must exist if his belief in evolution by natural selection is true, but admits that he cannot even define the species whose origins he strongly implies are incontrovertible. It should be apparent that he is not defending actual quantifiable, testable, and replicable science here, he is defending his irreligious faith in a particular historical science fiction that may or may not have any basis in fact.  That doesn’t mean his faith may not be logically well-founded, it merely means that he cannot even begin to provide scientific evidence for what he is claiming is beyond skepticism. This is philosophy, not modern science.</p><blockquote class=\"tr_bq\"><p> <b>3. How many mutations, on average, are required per speciation?</b></p><p>See above.</p></blockquote><p>It is interesting, is it not, how even the most blindly faithful evolutionist runs from the sort of precision and quantification that is absolutely necessary if something is to be considered genuinely scientific in any meaningful sense?  Being both trained and well-read in economics, the reader can safely believe me, I know pseudo-science when I see it. Biologists like to appeal to physics as the foundation of their claimed authority, but the fact of the matter is that if physicists were as haplessly ignorant and as unable to provide predictive models as evolutionary biologists, no one would take them very seriously either.  This is why <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600/ATHEIST%2BLOGIC.jpg\">Daniel Dennett’s atheist logic</a> is always so amusing: he asserts we are to trust biologists because physicists get amazingly accurate results.</p><blockquote class=\"tr_bq\"><p> <b>4. What scientifically significant predictive model relies primarily upon evolution by natural selection?</b></p><p>Nothing as precise as physics, but holding a life science to that standard is stupid. Our understanding of genetics, animal behavior patterns, and in an incomplete way, social science, are all aided by the concept of natural selection.</p></blockquote><p>Holding a life science to precise standards is stupid?  That should be news to all those idiots working in genetics and medical science. And what about those amazingly accurate results Mr. Dennett promised us? In addition to that insulting blunder, Williamson resorts to trying to blatantly move the goalposts.  But it’s not really his fault. What choice does he have? He can’t cite any scientifically significant predictive models that rely primarily upon evolution by natural selection because they don’t exist.  After more than 150 years, TENS is still a useless and onanistic “science” that has little purpose beyond trying to prove itself.</p><p>Our understanding of genetics was not, and is not, aided by the concept of natural selection. The mindless adherence to evolution by natural selection actually inhibited the initial acceptance of Mendelian genetics, hence the need for the “Neo-Darwinian Synthesis” that finally allowed biologists to move on with the real science while still genuflecting respectfully to Saint Darwin.  However, as I noted, we’re already seeing biologists admit that clinging to Darwin and Darwinism is unhelpful, and it won’t be too terribly long before they admit that the concept of natural selection is largely irrelevant with regards to manipulating genes as well.</p><blockquote class=\"tr_bq\"><p> <b>5. Which of the various human sub-species is the most evolved; i.e. modified by mutation and natural selection from the most recent common human ancestor? Which is the least evolved?</b></p><p>There is no such thing as more evolved or less evolved. Evolution is not a linear progressive process where species “get better” over time. It is an amoral process. Genes either get passed on or they don’t. All evolution can tell is is which traits are more likely to thrive in specific environments. As for which human group has the most mutations from the baseline original human group, no idea.</p></blockquote><p>Oh, Sweet Darwin! Someone obviously didn’t understand the question.  It must be that pesky dearth of IQ points again. Since evolution by natural selection concerns the selection of mutations, there are most certainly “more evolved” and “less evolved” species; the reason the coelocanth is called a “living fossil” is because it has fewer mutations that have been selected over time than most other extant species.  And it would not be possible to produce phylograms if it were not possible to declare which species was more evolved or less evolved from the purported common ancestor.  Williamson not only incorrectly assumed the idea that “more evolved” means “better”, he incorrectly assumed that was the only possible meaning for the term <i>even though I provided him with a different one.</i></p><blockquote class=\"tr_bq\"><p> <b>6. Is the theory of evolution by natural selection strengthened or weakened by the claim that most DNA is devoid of purpose?</b></p><p>Strengthened. Junk DNA would seem to indicate evolution is a chaotic process with some unnecessary leftovers, which weakens the claim of specific intelligent design.</p></blockquote><p>I just wanted to get him on record here.  Remember, the ID model suggests that most DNA is NOT devoid of purpose.  So, if junk DNA turns out to be more than junk, that will show that ID is a successfully predictive model and thereby provide scientific evidence for the idea that creatures on earth did not evolve by natural selection, but were designed.  It will also show that another predictive model based on evolution by natural selection failed. Again.</p><blockquote class=\"tr_bq\"><p> I await any evidence that any creature on Earth is “intelligently” designed.</p><p>The usual response is, “but you don’t know the designer’s criteria,” which is a copout and unfalsifiable.</p><p>Any objective observation shows that every life form on Earth works just well enough to pass on its genes to its offspring. Most of the time. Those that don’t go extinct.</p><p>I’d like to see someone explain the “intelligence” behind a human foot, which no longer works as an effective grasper, and is not nearly as effective as a hoof for walking. Without modern footwear, we’re prone to serious mechanical failure of the joints and bone, usually shortly after our prime reproductive time.</p><p>And tiny babies will clutch with their feet when picked up from a crib, an instinctive hangover from our brachiator ancestors.</p></blockquote><p>Keep an eye on genetic science. As we begin to learn more about how to manipulate genes, then we should begin to discover evidence of past genetic manipulations, if there is in fact any to be discovered.  As for infelicities of design, I fail to see how anyone who has ever used Windows Vista or Windows 8 can claim that suboptimal design is evidence of an absence of either intelligence or design.</p><blockquote class=\"tr_bq\"><p> Religion has really become a bad joke. Physics destroys creation myths. Biology destroys creation myths. Geology destroys creation myths. Either Creation is a tale told to Bronze Age peasants as a way to explain a universe they couldn’t grasp, or this God person is running a serious long con.</p><p>It’s hilarious to watch an alleged “genius” trot out crap that was debunked a half century ago.</p></blockquote><p>I will leave it to the resident physics PhD to demonstrate the absurdity of his claim about physics.  I’ve already shown that biology cannot destroy creation myths because it doesn’t deal with them. As for geology, I can do no better than to quote the immortal words of Dr. Sheldon Cooper, “geology isn’t a real science”.</p><p>I will first mention that I am not a genius, “alleged” or otherwise, as I reject the idea that it is related to a specific IQ and I have no accomplishments that would merit the title. But I fear Mr. Williamson woefully misinterpreted that very significant peer-reviewed paper of fifty years ago that he cites, as it quite clearly not only defended, rather than debunked, the “crap” that I trotted out, but also provided absolutely conclusive scientific evidence for the existence of a Creator God as well as the precise age of the Earth down to the millesecond.  It’s a pity I cannot quite recall the name of the highly reputable scientists who authored it or the exact issue of Nature in which it was published, but perhaps Mr. Williamson could be a lamb and remind us.</p></div>",
  "content_text": "Mike Williamson\nanswered the question I posed to him\nin response to his claims about creationists.\n1. How do creationists “pose a serious threat to society”?\nSociety only functions when the majority of the people agree on basic fundamental ideas. A critical mass of people who believe reason and evidence don’t matter is a slippery slope to tyranny.\nWilliamson’s reasoning is totally specious here.  The overwhelming majority of Americans were creationists from the very beginning, and yet somehow, with the exception of the Lincoln presidency, managed to avoid slipping into tyranny.  And, as a matter of fact, there is a positive correlation between the number of non-Creationists in the United States and the growth of increasingly intrusive government.\nWilliamson is engaging in the very intellectual dishonesty he falsely imputed to me by erroneously attempting to equate “creationists” with “people who believe reason and evidence don’t matter”.  I am a creationist.  I also believe that reason and evidence matter a very great deal indeed.  Williamson has asserted a false dichotomy that my mere existence is sufficient to expose.  And I am very far from the only creationist who not only believes reason and evidence matter, but utilizes them more adroitly than Mr. Williamson does.\nMoreover, Mr. Williamson’s entire argument is based on a demonstrably false assumption that a belief in creationism necessarily conflicts with a belief in evolution by natural selection.  While I am a creationist who is skeptical of the Theorum of Evolution by (probably) Natural Selection as described by Richard Dawkins, it should be obvious that creationism and evolution by natural selection are at least potentially complimentary because natural selection intrinsically requires genes from which to select.  As the brighter sort of evolutionists are fond of pointing out when pressed, evolution says absolutely nothing about the origins of\nlife\n, it only concerns the transformation of one existing\nspecies\ninto another.  Even to a mere +3 SD intelligence like Mr. Williamson, it should be readily apparent that evolution by natural selection cannot possibly take place via the mutation of nonexistent genes.\nOnly evolution by natural selection combined with abiogenesis can be considered to be intrinsically opposed to creationism, and even that is debatable given that logic dictates the artificial replication of abiogenesis by scientists would offer more support a creator behind the abiogenesis than it taking place by time and chance alone.\n2. There are an estimated 1,263,186 animal species and 326,175 plant species in the world. Assuming the age of the Earth is 4.54 billion years, what is the average rate of speciation?\nThe technical definition of species is somewhat iffy, at times arbitrary, and needs more work to be fleshed out.\nMr. Williamson not only cannot calculate a rate that absolutely must exist if his belief in evolution by natural selection is true, but admits that he cannot even define the species whose origins he strongly implies are incontrovertible. It should be apparent that he is not defending actual quantifiable, testable, and replicable science here, he is defending his irreligious faith in a particular historical science fiction that may or may not have any basis in fact.  That doesn’t mean his faith may not be logically well-founded, it merely means that he cannot even begin to provide scientific evidence for what he is claiming is beyond skepticism. This is philosophy, not modern science.\n3. How many mutations, on average, are required per speciation?\nSee above.\nIt is interesting, is it not, how even the most blindly faithful evolutionist runs from the sort of precision and quantification that is absolutely necessary if something is to be considered genuinely scientific in any meaningful sense?  Being both trained and well-read in economics, the reader can safely believe me, I know pseudo-science when I see it. Biologists like to appeal to physics as the foundation of their claimed authority, but the fact of the matter is that if physicists were as haplessly ignorant and as unable to provide predictive models as evolutionary biologists, no one would take them very seriously either.  This is why\nDaniel Dennett’s atheist logic\nis always so amusing: he asserts we are to trust biologists because physicists get amazingly accurate results.\n4. What scientifically significant predictive model relies primarily upon evolution by natural selection?\nNothing as precise as physics, but holding a life science to that standard is stupid. Our understanding of genetics, animal behavior patterns, and in an incomplete way, social science, are all aided by the concept of natural selection.\nHolding a life science to precise standards is stupid?  That should be news to all those idiots working in genetics and medical science. And what about those amazingly accurate results Mr. Dennett promised us? In addition to that insulting blunder, Williamson resorts to trying to blatantly move the goalposts.  But it’s not really his fault. What choice does he have? He can’t cite any scientifically significant predictive models that rely primarily upon evolution by natural selection because they don’t exist.  After more than 150 years, TENS is still a useless and onanistic “science” that has little purpose beyond trying to prove itself.\nOur understanding of genetics was not, and is not, aided by the concept of natural selection. The mindless adherence to evolution by natural selection actually inhibited the initial acceptance of Mendelian genetics, hence the need for the “Neo-Darwinian Synthesis” that finally allowed biologists to move on with the real science while still genuflecting respectfully to Saint Darwin.  However, as I noted, we’re already seeing biologists admit that clinging to Darwin and Darwinism is unhelpful, and it won’t be too terribly long before they admit that the concept of natural selection is largely irrelevant with regards to manipulating genes as well.\n5. Which of the various human sub-species is the most evolved; i.e. modified by mutation and natural selection from the most recent common human ancestor? Which is the least evolved?\nThere is no such thing as more evolved or less evolved. Evolution is not a linear progressive process where species “get better” over time. It is an amoral process. Genes either get passed on or they don’t. All evolution can tell is is which traits are more likely to thrive in specific environments. As for which human group has the most mutations from the baseline original human group, no idea.\nOh, Sweet Darwin! Someone obviously didn’t understand the question.  It must be that pesky dearth of IQ points again. Since evolution by natural selection concerns the selection of mutations, there are most certainly “more evolved” and “less evolved” species; the reason the coelocanth is called a “living fossil” is because it has fewer mutations that have been selected over time than most other extant species.  And it would not be possible to produce phylograms if it were not possible to declare which species was more evolved or less evolved from the purported common ancestor.  Williamson not only incorrectly assumed the idea that “more evolved” means “better”, he incorrectly assumed that was the only possible meaning for the term\neven though I provided him with a different one.\n6. Is the theory of evolution by natural selection strengthened or weakened by the claim that most DNA is devoid of purpose?\nStrengthened. Junk DNA would seem to indicate evolution is a chaotic process with some unnecessary leftovers, which weakens the claim of specific intelligent design.\nI just wanted to get him on record here.  Remember, the ID model suggests that most DNA is NOT devoid of purpose.  So, if junk DNA turns out to be more than junk, that will show that ID is a successfully predictive model and thereby provide scientific evidence for the idea that creatures on earth did not evolve by natural selection, but were designed.  It will also show that another predictive model based on evolution by natural selection failed. Again.\nI await any evidence that any creature on Earth is “intelligently” designed.\nThe usual response is, “but you don’t know the designer’s criteria,” which is a copout and unfalsifiable.\nAny objective observation shows that every life form on Earth works just well enough to pass on its genes to its offspring. Most of the time. Those that don’t go extinct.\nI’d like to see someone explain the “intelligence” behind a human foot, which no longer works as an effective grasper, and is not nearly as effective as a hoof for walking. Without modern footwear, we’re prone to serious mechanical failure of the joints and bone, usually shortly after our prime reproductive time.\nAnd tiny babies will clutch with their feet when picked up from a crib, an instinctive hangover from our brachiator ancestors.\nKeep an eye on genetic science. As we begin to learn more about how to manipulate genes, then we should begin to discover evidence of past genetic manipulations, if there is in fact any to be discovered.  As for infelicities of design, I fail to see how anyone who has ever used Windows Vista or Windows 8 can claim that suboptimal design is evidence of an absence of either intelligence or design.\nReligion has really become a bad joke. Physics destroys creation myths. Biology destroys creation myths. Geology destroys creation myths. Either Creation is a tale told to Bronze Age peasants as a way to explain a universe they couldn’t grasp, or this God person is running a serious long con.\nIt’s hilarious to watch an alleged “genius” trot out crap that was debunked a half century ago.\nI will leave it to the resident physics PhD to demonstrate the absurdity of his claim about physics.  I’ve already shown that biology cannot destroy creation myths because it doesn’t deal with them. As for geology, I can do no better than to quote the immortal words of Dr. Sheldon Cooper, “geology isn’t a real science”.\nI will first mention that I am not a genius, “alleged” or otherwise, as I reject the idea that it is related to a specific IQ and I have no accomplishments that would merit the title. But I fear Mr. Williamson woefully misinterpreted that very significant peer-reviewed paper of fifty years ago that he cites, as it quite clearly not only defended, rather than debunked, the “crap” that I trotted out, but also provided absolutely conclusive scientific evidence for the existence of a Creator God as well as the precise age of the Earth down to the millesecond.  It’s a pity I cannot quite recall the name of the highly reputable scientists who authored it or the exact issue of Nature in which it was published, but perhaps Mr. Williamson could be a lamb and remind us.",
  "tags": [
    "evolution",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-24T04:00:00+00:00"
}