{
  "url": "https://voxday.net/2013/04/15/mcrapey-and-mcracist-react-to-criticism_15/",
  "scraped_at": "2025-12-14T22:25:55.591153",
  "title": "McRapey and McRacist react to criticism",
  "date_display": "April 15, 2013",
  "date_iso": "2013-04-15T05:00:00+00:00",
  "date_from_url": "2013-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James May criticizes <a href=\"http://www.jamesmaystock.com/essays/Pages/Scalzi.html\">two left-wing starlets of science fiction and fantasy</a>:</p><blockquote class=\"tr_bq\"><p> Pretending the 21st century is actually the 19th just doesn’t cut it,<br> no matter how much you argue everyone born before you had the same<br> interest in politicizing and racializing the most innocuous things, or<br> even white people today, who show not the least interest by way of law,<br> institution or mainstream culture in the very things they are accused<br> of. If you wish to group together people as whites, a thing I detest,<br> then it is whites who have created the very laws that protect minorities<br> in America today. In the absence of law, institutions and mainstreams<br> cultural expressions of racial disdain, one must then of course come up<br> with theories which assert the unseen, the underground and the<br> unwitting, showing the “truth” of a thing by its shadow, showing a<br> dearth of cultural morality while at the same time denying such a thing<br> is possible by non-white cultures. And let’s be very clear here: there<br> is no scholarship which can support whites even think of themselves as a<br> culture racially in the 21st century while the exact opposite in regard<br> to Jemisin and advocates like her provides mountains of black<br> symposiums, black organizations and black culture artifacts. There’s<br> even a black scuba divers association if you can believe in that bit of<br> idiocy. And don’t hold your breath waiting for either Scalzi or Jemisin<br> to wring their hands over black basketball players in the NBA<br> overrepresented by 5 times their demography  in America. “Meritocracy”<br> is a slippery word in the hands of racial bigots. Am I to assume that<br> lack of diversity in the NBA is a tacit plot by black players to keep<br> out the white ones, or an example of black privilege?</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>You can’t have this argument two ways – either skin brings nothing to<br> the table or it does. If pedagogic racialists believe diversity in and<br> of itself brings something to the table then it is taking up the<br> opposite argument of what it claims, because those people are still an<br> “other,” just a better one, with innate qualities other races apparently<br> don’t have. But that argument can be turned around in a flash and in<br> the end, it’s just as stupid to ask a man to stand on a pedestal because<br> of his skin as it is to ask him to stand in a ditch. In this light, the<br> obsession the SFWA has with shallow diversity on the one hand while<br> arguing race and gender mean nothing on the other seems sad and rather<br> dark. Content of character, remember that? Gives a stupid and whole new<br> meaning to the term “<a href=\"http://en.wikipedia.org/wiki/The_Uplift_War\">uplift wars</a>.”</br></br></br></br></br></br></br></br></br></br></br></p><p>The idea that Scalzi has what it takes to get inside the head of 100<br> million men based on their skin is an absurd idea and a racist one at<br> that. It’s no surprise to me that it basically amounts, in principle, to<br> the exact opposite of what he says he champions, because, at its heart,<br> political racialism is Orwellian doublethink. Scalzi should be sure to write a follow up where he tells us what 3<br> million Jewish and 20 million black men think. He mustn’t forget to<br> explain how he effortlessly rises above the fray while indulging in the<br> most despicable racial stereotypes, a neat trick. So generic whites are a<br> safe political target. Try the same thought process on Jews. I’m dying<br> to read that one. What about gays? How are they all doing? Does he<br> approve?</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>And this is how the two starlets react to it, on Twitter, naturally.</p><p><i>McRacist: ‏@scalzi What the — ? HAHAHAHA I’m not a Tor author, you putz. <br> </br></i><br> <i>McRapey: @nkjemisin It’s a special piece of writing, isn’t it?</i></br></p><p>McRacist:<br> @scalzi Why do champions of anti-racism (anti-anti-racism?) sound so<br> alike as they endlessly blather on? So much energy, so little *sense.*</br></br></p><p><i>McRapey:<br> @nkjemisin Poor logical skill and underdeveloped rhetorical control are<br> strongly correlated, i.e., I can’t argue but I CAN go on and on.</br></br></i></p><p>Quite<br> the pair of intellectuals, aren’t they.  And such a devastatingly<br> convincing response. McRacist is not a Tor author, ergo she must not be a racist black woman and McRapey isn’t a racist, incoherent gamma male who hates his socio-sexual superiors.  HAHAHAHA<br> EVIL WHITE MALE POWER AND CENTRALITY!  Also, DRAGONS!</br></br></br></p><p>Of<br> course, McRapey is correct.  He can’t argue. That’s why he always talks<br> about his critics instead of directly addressing their criticisms of him.<br> That’s also why he flees from debate, both in third-party venues and on his own blog, which is a pity since he is one of the<br> finest examples of the correlation of poor logical skill and<br> underdeveloped rhetorical control you’ll find anywhere on the Internet.</br></br></br></br></br></p><p><i>Me show all dem me no gamma! Me show dem me no rabbit! Now me haz gammarabbit.com. Agree and amplify DAT, bitchez! No hurtz now… why still hurtz, WHY?</i></p><p>As<br> for McRacist, someone needs to explain to her that the fact that<br> something doesn’t make sense to her doesn’t necessarily mean it doesn’t<br> make sense at all.</br></br></br></p><p>*  *  *</p><p>It may simply mean that she’s not intelligent enough to understand it.</p></div>",
  "content_text": "James May criticizes\ntwo left-wing starlets of science fiction and fantasy\n:\nPretending the 21st century is actually the 19th just doesn’t cut it,\nno matter how much you argue everyone born before you had the same\ninterest in politicizing and racializing the most innocuous things, or\neven white people today, who show not the least interest by way of law,\ninstitution or mainstream culture in the very things they are accused\nof. If you wish to group together people as whites, a thing I detest,\nthen it is whites who have created the very laws that protect minorities\nin America today. In the absence of law, institutions and mainstreams\ncultural expressions of racial disdain, one must then of course come up\nwith theories which assert the unseen, the underground and the\nunwitting, showing the “truth” of a thing by its shadow, showing a\ndearth of cultural morality while at the same time denying such a thing\nis possible by non-white cultures. And let’s be very clear here: there\nis no scholarship which can support whites even think of themselves as a\nculture racially in the 21st century while the exact opposite in regard\nto Jemisin and advocates like her provides mountains of black\nsymposiums, black organizations and black culture artifacts. There’s\neven a black scuba divers association if you can believe in that bit of\nidiocy. And don’t hold your breath waiting for either Scalzi or Jemisin\nto wring their hands over black basketball players in the NBA\noverrepresented by 5 times their demography  in America. “Meritocracy”\nis a slippery word in the hands of racial bigots. Am I to assume that\nlack of diversity in the NBA is a tacit plot by black players to keep\nout the white ones, or an example of black privilege?\nYou can’t have this argument two ways – either skin brings nothing to\nthe table or it does. If pedagogic racialists believe diversity in and\nof itself brings something to the table then it is taking up the\nopposite argument of what it claims, because those people are still an\n“other,” just a better one, with innate qualities other races apparently\ndon’t have. But that argument can be turned around in a flash and in\nthe end, it’s just as stupid to ask a man to stand on a pedestal because\nof his skin as it is to ask him to stand in a ditch. In this light, the\nobsession the SFWA has with shallow diversity on the one hand while\narguing race and gender mean nothing on the other seems sad and rather\ndark. Content of character, remember that? Gives a stupid and whole new\nmeaning to the term “\nuplift wars\n.”\nThe idea that Scalzi has what it takes to get inside the head of 100\nmillion men based on their skin is an absurd idea and a racist one at\nthat. It’s no surprise to me that it basically amounts, in principle, to\nthe exact opposite of what he says he champions, because, at its heart,\npolitical racialism is Orwellian doublethink. Scalzi should be sure to write a follow up where he tells us what 3\nmillion Jewish and 20 million black men think. He mustn’t forget to\nexplain how he effortlessly rises above the fray while indulging in the\nmost despicable racial stereotypes, a neat trick. So generic whites are a\nsafe political target. Try the same thought process on Jews. I’m dying\nto read that one. What about gays? How are they all doing? Does he\napprove?\nAnd this is how the two starlets react to it, on Twitter, naturally.\nMcRacist: ‏@scalzi What the — ? HAHAHAHA I’m not a Tor author, you putz.\nMcRapey: @nkjemisin It’s a special piece of writing, isn’t it?\nMcRacist:\n@scalzi Why do champions of anti-racism (anti-anti-racism?) sound so\nalike as they endlessly blather on? So much energy, so little *sense.*\nMcRapey:\n@nkjemisin Poor logical skill and underdeveloped rhetorical control are\nstrongly correlated, i.e., I can’t argue but I CAN go on and on.\nQuite\nthe pair of intellectuals, aren’t they.  And such a devastatingly\nconvincing response. McRacist is not a Tor author, ergo she must not be a racist black woman and McRapey isn’t a racist, incoherent gamma male who hates his socio-sexual superiors.  HAHAHAHA\nEVIL WHITE MALE POWER AND CENTRALITY!  Also, DRAGONS!\nOf\ncourse, McRapey is correct.  He can’t argue. That’s why he always talks\nabout his critics instead of directly addressing their criticisms of him.\nThat’s also why he flees from debate, both in third-party venues and on his own blog, which is a pity since he is one of the\nfinest examples of the correlation of poor logical skill and\nunderdeveloped rhetorical control you’ll find anywhere on the Internet.\nMe show all dem me no gamma! Me show dem me no rabbit! Now me haz gammarabbit.com. Agree and amplify DAT, bitchez! No hurtz now… why still hurtz, WHY?\nAs\nfor McRacist, someone needs to explain to her that the fact that\nsomething doesn’t make sense to her doesn’t necessarily mean it doesn’t\nmake sense at all.\n*  *  *\nIt may simply mean that she’s not intelligent enough to understand it.",
  "tags": [
    "McRapey",
    "SFWA",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-15T04:00:00+00:00"
}