{
  "url": "https://voxday.net/2013/04/22/mike-williams-is-too-real-smar/",
  "scraped_at": "2025-12-14T22:26:42.644786",
  "title": "Mike Williams is too real smart",
  "date_display": "April 22, 2013",
  "date_iso": "2013-04-22T16:30:00+00:00",
  "date_from_url": "2013-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Williams responds, sort of, although in his response, self-referentially entitled “<a href=\"http://www.michaelzwilliamson.com/blog/item/the-fail-it-burns\">The Fail, It Burns</a>“, he doesn’t actually answer any of the six questions I posed to him:</p><blockquote class=\"tr_bq\"><p> “Mr. Williamson, with all due respect, you don’t appear to realize<br> that you are not only dealing with a number of people here who are<br> smarter than you are, but are also better educated in science than you<br> are. It may help to keep in mind that at Vox Popoli, those who live by<br> the rhetoric tend to die quickly and brutally by the dialectic.”</br></br></br></br></p><p>That’s the funniest thing I’ve read this week. Thanks.</p><p>I was at first interested in your site. I thought I had found the anti-Scalzi.  And in fact, I have. that is not a compliment.</p><p>~~~</p><p>So, first, by what metric does he assume, after one email exchange<br> and a couple of comments that there are a “number of people” there who<br> are smarter than me?</br></br></p><p>It’s certainly not impossible, but per standardized testing, the odds<br> are 99.8% in my favor.  That is a mathematical extraction based on my<br> tested IQ.  So unless his blog is a haven for pure geniuses, it seems<br> unlikely.  Nor have I seen much demonstration of any hard scientific<br> knowledge among his supporters.  Though to be fair, I haven’t read much<br> of his blog and don’t plan to.</br></br></br></br></br></p></blockquote><p>By what metric?  By simple observation. I’ve read his blog. I’ve followed his trains of thought. He’s observably not as smart as I am.  Anyone who reads this exchange can’t help but reach that conclusion. And there are dozens of people who read this blog who are every bit as intelligent as I am and more.  But we don’t even need that metric any longer, as the odds may have been 99.8% in his favor, but he crapped out nevertheless.  As for his claim to not have seen much demonstration of any hard scientific knowledge among the readers here, there was, among other things, a physics PhD and several other individuals who happen to possess advanced hard science degrees whose questions he ignored.  And notice that he thinks the idea that Darwin is dangerous is my idea….</p><p>With all due respect, Mr. Williamson badly underestimated me and the readers of VP, most likely because he is a science fetishist who is, like most  science fetishists, unthinkingly bigoted against Creationists.  Based on his admittedly impressive standardized test scores, which indicate an IQ in the +3 SD range, there are still dozens of people here smarter than he is.  There are at least three, to my certain knowledge, who are +5 SD.  Unlike most blogs, a mere +3SD isn’t even enough make one a big dog here.</p><blockquote class=\"tr_bq\"><p> Given that most of the interest there is in unquantifiable local<br> social issues, devoid of cites or analysis, it’s untestable, but my<br> perception is his belief is incorrect.  There’s a lot of opinion<br> there–some little of which I concur with–but a lot of BS, including<br> the obsession with myth (Creationism) over science.  It even repeats the<br> “Evolution is losing support among scientists!” bleat that’s been<br> around since…Darwin.  Yet every year we have better information,<br> better ability to define what we’re looking at, and better ability to<br> predict what we don’t see.  That’s called “Science.”  He even cutely<br> entitles his response to me, “rhetoric is not science.”  Indeed.  His<br> rhetoric is not science. </br></br></br></br></br></br></br></br></br></br></p></blockquote><p>No, my rhetoric isn’t science.  I have never claimed that it is.  More to the point, Mr. Williamson’s rhetoric isn’t science either and rhetoric, unoriginal rhetoric at that, is all he has offered.  He hasn’t even attempted to engage in dialectical discourse, let alone cited any scientific evidence for anything at all.</p><blockquote class=\"tr_bq\"><p> Second, he seems unaware that for Darwin to be challenged is a<br> POSITIVE thing for science.  It means we’ve refined the theory and have<br> improved precision. Much like the Earth went from spherical to oblate<br> to precisely delineated, and we are now working on equations to explain<br> orogenous upthrust (which isn’t as sexy as it sounds). </br></br></br></br></p></blockquote><p>Unaware?  I’ve repeatedly stated that in order to advance, genetic science will not only HAVE to challenge Darwin, but abandon him entirely.  Of course, he wouldn’t know that, since by his own admission, he hasn’t read much of my blog.  See, Mr. Williamson, this is why I know I am smarter than you are.  I wouldn’t ever make such a foolish and easily disproven assertion.  I’m smart enough to check first.</p><blockquote class=\"tr_bq\"><p> Third, it doesn’t matter how smart or educated either of us is. Facts<br> are facts.  Extrapolations are extrapolations.  And mythic fantasy is<br> mythic fantasy, even when called “religion.”  It is untestable,<br> unprovable, and not scientific.  There’s also an implied assumption that<br> the scientists working in genetics aren’t as smart as…a blogger.<br>  Which again, is not impossible, but is irrelevant.</br></br></br></br></br></p></blockquote><p>True.  Facts are facts. Evidence is evidence. Opinions are irrelevant. But he is absolutely wrong to say that religion is untestable, unprovable, and not scientific.  There are no shortage of testable hypotheses that can be generated from various religions, including Christianity.  Christianity, at the very least, is falsifiable. His inability to recognize this is not a testament to his intelligence.  Moreover, by his own metric, which is to say untestability, he surely must recognize that evolution by natural selection is untestable at present.</p><blockquote class=\"tr_bq\"><p> He knows nothing about me other than our two emails and a couple of<br> comments.  But he knows I’m not as smart as he because I “believe”<br> different things.  In point of fact, I believe very little.  I observe.<br>  If there is no conclusion to be reached, I delay judgment until there<br> is. </br></br></br></br></p></blockquote><p> No, I know he’s not as smart as I am because he takes foolish and easily disproven positions, such as “[Creationists] pose a serious threat to society.”  I repeat my question: How do creationists “pose a serious threat to society”?</p><blockquote class=\"tr_bq\"><p> Fourth, it’s entirely possible to disagree with the modern American<br> left, while being just as idiotic, prejudiced and intellectually<br> dishonest as its worst practitioners…which he ably demonstrates<br> (forex, constantly calling Scalzi “McRapey,” apparently completely<br> missing the point of one of John’s blogs that I do agree with), despite<br> his ability to solve the softball pre-algebra question I tossed at him.<br>  During the Spanish Civil War, the Fascists and the Communists were<br> diametrically opposed, yet largely indistinguishable.  Or in a<br> non-Godwin sense, pick European peasants forced to choose between Viking<br> raiders or the Franks.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Intellectually dishonest? From the gentleman who hasn’t answered a single question posed to him because his feelings are bruised over the fact that he is less intelligent than I am, and than dozens of my readers are?  I find it vastly amusing that so many people claim that I am incapable of recognizing satire in the process of failing to recognize a superior form of it themselves.  Also, and I quote, “<a href=\"http://www.voxday.net/tox/GrooveKittens.mp3\">John Scalzi is a rapist</a>“.</p><blockquote class=\"tr_bq\"><p> And Darwin’s (or any) ideas are only “dangerous” to bleating<br> ideologues. Information falls across a spectrum from factual to<br> opinion, from useful to not.  A truly smart person analyzes the content<br> and comes to a conclusion, adapting the conclusions as needed as new<br> facts are presented.  That, we call “Science.”</br></br></br></br></p></blockquote><p>First, note that Mr. Williamson doesn’t even recognize the obvious reference to Daniel Dennett’s book, <i>Darwin’s Dangerous Idea</i>.  Second, no, merely reaching a conclusion and adapting it as needed is not, by any definition, “Science”. By that definition, quarterbacks are scientists.</p><p>And despite devoting more than 600 words to his response, Mr. Williamson didn’t manage to answer any of the questions I posed to him.  For someone who calls his blog The Sacred Cow Slaughterhouse, Mr. Williamson appears to preserve more than his own fair share of them.  So, I will repeat them.</p><ol><li>How do creationists “pose a serious threat to society”?</li><li>There are an estimated 1,263,186 animal species and 326,175 plant<br> species in the world.  Assuming the age of the Earth is 4.54 billion<br> years, what is the average rate of speciation?</br></br></li><li>How many mutations, on average, are required per speciation?</li><li>What scientifically significant predictive model relies primarily upon evolution by natural selection?</li><li>Which of the various human sub-species is the most evolved; i.e.<br> modified by mutation and natural selection from the most recent common<br> human ancestor? Which is the least evolved?</br></br></li><li>Is the theory of evolution by natural selection strengthened or weakened by the claim that most DNA is devoid of purpose?</li></ol><p>As for being the anti-Scalzi, compliment or not, I most certainly am. How can you tell?  Because I mentioned Mike.  I responded to him in substantive detail. And I have not banished him from my list of Standout Authors.  Why not?  BECAUSE WE ARE NOT RABBITS!  We can handle differences of opinion.  We can engage in discourse, even vicious, acrimonious discourse, without resorting to attempts to exclude and silence.</p><p>Mr. Williamson may not plan to read this blog in the future, but he is always welcome to do so, and to comment here as he sees fit, whether he agrees with me, whether he likes me, and whether he respects me or not. And my opinion of his writing is not dependent upon his view of Creationism or his opinion of me.</p><ol></ol></div>",
  "content_text": "Mike Williams responds, sort of, although in his response, self-referentially entitled “\nThe Fail, It Burns\n“, he doesn’t actually answer any of the six questions I posed to him:\n“Mr. Williamson, with all due respect, you don’t appear to realize\nthat you are not only dealing with a number of people here who are\nsmarter than you are, but are also better educated in science than you\nare. It may help to keep in mind that at Vox Popoli, those who live by\nthe rhetoric tend to die quickly and brutally by the dialectic.”\nThat’s the funniest thing I’ve read this week. Thanks.\nI was at first interested in your site. I thought I had found the anti-Scalzi.  And in fact, I have. that is not a compliment.\n~~~\nSo, first, by what metric does he assume, after one email exchange\nand a couple of comments that there are a “number of people” there who\nare smarter than me?\nIt’s certainly not impossible, but per standardized testing, the odds\nare 99.8% in my favor.  That is a mathematical extraction based on my\ntested IQ.  So unless his blog is a haven for pure geniuses, it seems\nunlikely.  Nor have I seen much demonstration of any hard scientific\nknowledge among his supporters.  Though to be fair, I haven’t read much\nof his blog and don’t plan to.\nBy what metric?  By simple observation. I’ve read his blog. I’ve followed his trains of thought. He’s observably not as smart as I am.  Anyone who reads this exchange can’t help but reach that conclusion. And there are dozens of people who read this blog who are every bit as intelligent as I am and more.  But we don’t even need that metric any longer, as the odds may have been 99.8% in his favor, but he crapped out nevertheless.  As for his claim to not have seen much demonstration of any hard scientific knowledge among the readers here, there was, among other things, a physics PhD and several other individuals who happen to possess advanced hard science degrees whose questions he ignored.  And notice that he thinks the idea that Darwin is dangerous is my idea….\nWith all due respect, Mr. Williamson badly underestimated me and the readers of VP, most likely because he is a science fetishist who is, like most  science fetishists, unthinkingly bigoted against Creationists.  Based on his admittedly impressive standardized test scores, which indicate an IQ in the +3 SD range, there are still dozens of people here smarter than he is.  There are at least three, to my certain knowledge, who are +5 SD.  Unlike most blogs, a mere +3SD isn’t even enough make one a big dog here.\nGiven that most of the interest there is in unquantifiable local\nsocial issues, devoid of cites or analysis, it’s untestable, but my\nperception is his belief is incorrect.  There’s a lot of opinion\nthere–some little of which I concur with–but a lot of BS, including\nthe obsession with myth (Creationism) over science.  It even repeats the\n“Evolution is losing support among scientists!” bleat that’s been\naround since…Darwin.  Yet every year we have better information,\nbetter ability to define what we’re looking at, and better ability to\npredict what we don’t see.  That’s called “Science.”  He even cutely\nentitles his response to me, “rhetoric is not science.”  Indeed.  His\nrhetoric is not science.\nNo, my rhetoric isn’t science.  I have never claimed that it is.  More to the point, Mr. Williamson’s rhetoric isn’t science either and rhetoric, unoriginal rhetoric at that, is all he has offered.  He hasn’t even attempted to engage in dialectical discourse, let alone cited any scientific evidence for anything at all.\nSecond, he seems unaware that for Darwin to be challenged is a\nPOSITIVE thing for science.  It means we’ve refined the theory and have\nimproved precision. Much like the Earth went from spherical to oblate\nto precisely delineated, and we are now working on equations to explain\norogenous upthrust (which isn’t as sexy as it sounds).\nUnaware?  I’ve repeatedly stated that in order to advance, genetic science will not only HAVE to challenge Darwin, but abandon him entirely.  Of course, he wouldn’t know that, since by his own admission, he hasn’t read much of my blog.  See, Mr. Williamson, this is why I know I am smarter than you are.  I wouldn’t ever make such a foolish and easily disproven assertion.  I’m smart enough to check first.\nThird, it doesn’t matter how smart or educated either of us is. Facts\nare facts.  Extrapolations are extrapolations.  And mythic fantasy is\nmythic fantasy, even when called “religion.”  It is untestable,\nunprovable, and not scientific.  There’s also an implied assumption that\nthe scientists working in genetics aren’t as smart as…a blogger.\nWhich again, is not impossible, but is irrelevant.\nTrue.  Facts are facts. Evidence is evidence. Opinions are irrelevant. But he is absolutely wrong to say that religion is untestable, unprovable, and not scientific.  There are no shortage of testable hypotheses that can be generated from various religions, including Christianity.  Christianity, at the very least, is falsifiable. His inability to recognize this is not a testament to his intelligence.  Moreover, by his own metric, which is to say untestability, he surely must recognize that evolution by natural selection is untestable at present.\nHe knows nothing about me other than our two emails and a couple of\ncomments.  But he knows I’m not as smart as he because I “believe”\ndifferent things.  In point of fact, I believe very little.  I observe.\nIf there is no conclusion to be reached, I delay judgment until there\nis.\nNo, I know he’s not as smart as I am because he takes foolish and easily disproven positions, such as “[Creationists] pose a serious threat to society.”  I repeat my question: How do creationists “pose a serious threat to society”?\nFourth, it’s entirely possible to disagree with the modern American\nleft, while being just as idiotic, prejudiced and intellectually\ndishonest as its worst practitioners…which he ably demonstrates\n(forex, constantly calling Scalzi “McRapey,” apparently completely\nmissing the point of one of John’s blogs that I do agree with), despite\nhis ability to solve the softball pre-algebra question I tossed at him.\nDuring the Spanish Civil War, the Fascists and the Communists were\ndiametrically opposed, yet largely indistinguishable.  Or in a\nnon-Godwin sense, pick European peasants forced to choose between Viking\nraiders or the Franks.\nIntellectually dishonest? From the gentleman who hasn’t answered a single question posed to him because his feelings are bruised over the fact that he is less intelligent than I am, and than dozens of my readers are?  I find it vastly amusing that so many people claim that I am incapable of recognizing satire in the process of failing to recognize a superior form of it themselves.  Also, and I quote, “\nJohn Scalzi is a rapist\n“.\nAnd Darwin’s (or any) ideas are only “dangerous” to bleating\nideologues. Information falls across a spectrum from factual to\nopinion, from useful to not.  A truly smart person analyzes the content\nand comes to a conclusion, adapting the conclusions as needed as new\nfacts are presented.  That, we call “Science.”\nFirst, note that Mr. Williamson doesn’t even recognize the obvious reference to Daniel Dennett’s book,\nDarwin’s Dangerous Idea\n.  Second, no, merely reaching a conclusion and adapting it as needed is not, by any definition, “Science”. By that definition, quarterbacks are scientists.\nAnd despite devoting more than 600 words to his response, Mr. Williamson didn’t manage to answer any of the questions I posed to him.  For someone who calls his blog The Sacred Cow Slaughterhouse, Mr. Williamson appears to preserve more than his own fair share of them.  So, I will repeat them.\nHow do creationists “pose a serious threat to society”?\nThere are an estimated 1,263,186 animal species and 326,175 plant\nspecies in the world.  Assuming the age of the Earth is 4.54 billion\nyears, what is the average rate of speciation?\nHow many mutations, on average, are required per speciation?\nWhat scientifically significant predictive model relies primarily upon evolution by natural selection?\nWhich of the various human sub-species is the most evolved; i.e.\nmodified by mutation and natural selection from the most recent common\nhuman ancestor? Which is the least evolved?\nIs the theory of evolution by natural selection strengthened or weakened by the claim that most DNA is devoid of purpose?\nAs for being the anti-Scalzi, compliment or not, I most certainly am. How can you tell?  Because I mentioned Mike.  I responded to him in substantive detail. And I have not banished him from my list of Standout Authors.  Why not?  BECAUSE WE ARE NOT RABBITS!  We can handle differences of opinion.  We can engage in discourse, even vicious, acrimonious discourse, without resorting to attempts to exclude and silence.\nMr. Williamson may not plan to read this blog in the future, but he is always welcome to do so, and to comment here as he sees fit, whether he agrees with me, whether he likes me, and whether he respects me or not. And my opinion of his writing is not dependent upon his view of Creationism or his opinion of me.",
  "tags": [
    "evolution",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-22T15:30:00+00:00"
}