{
  "url": "https://voxday.net/2013/04/10/more-minorities-more-unemploymen/",
  "scraped_at": "2025-12-14T22:25:28.375347",
  "title": "More minorities, more unemployment",
  "date_display": "April 10, 2013",
  "date_iso": "2013-04-10T09:01:00+00:00",
  "date_from_url": "2013-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has always seemed more than a little strange to me that so many Americans blithely assume that browns, blacks, and yellows who relocate to the United States are going to take on all the characteristics of white Americans by the sole virtue of their geographic relocation:</p><blockquote class=\"tr_bq\"><p> Black Entertainment Television (BET) founder <a href=\"http://cnsnews.com/news/article/bet-founder-country-would-never-tolerate-white-unemployment-14-or-15-percent\">Bob Johnson said</a> Tuesday<br> that the nation would “never tolerate white unemployment at 14 or 15<br> percent” and yet unemployment for the black community has been double<br> that of white Americans for over 50 years….</br></br></br></p><p>Johnson said the challenge was to figure out why the unemployment<br> rate for blacks has been so high, “and if that doesn’t change,<br> somebody’s going to have to pay— 34 million African-Americans are not<br> going to leave this country, millions of African-Americans who don’t<br> have jobs.”</br></br></br></br></p><p>“Somebody’s going to have to pay for them. Somebody’s going to have<br> to take care of them, and if somebody’s going to have to take care of<br> them, that money’s got to come from somebody. And whoever’s paying for<br> it is going to be upset about it, and they’re going to start looking for<br> somebody to blame,” Johnson said.</br></br></br></br></p></blockquote><p>It has been understood for decades that the lesser cultural differences between white Protestants and white Catholics have been sufficient to create very different outcomes in various European countries. Hence the phrase “Protestant work ethic”.</p><p>In light of this, is it not worth considering the possibility that the “new normal” of higher unemployment rates and lower labor force participation rates is at least in part the inevitable result of the 1965 and 1986 immigration acts, which have resulted in the massive influx of people with different cultures, and observably different work ethics, than white Protestant Americans?</p><p>In 1991, the Employment-Population Ratio in the USA was four points higher than in Mexico, 61-57.  It was 53 in Nigeria, 50 in France, and 45 in Italy.  This is usually blamed on lack of economic development and capital, but it seems to me that since economic development and capital are consequences of human action, not causes, it is more likely that one reason for the previously advantaged state of the US economy was the result of the unique composition of its predominantly Protestant European labor force.</p><p>Now, there are obviously a wide variety of other factors involved, but all things being equal, does it really make sense to imagine that importing workers from countries that are less productive and less inclined to work is going to increase productivity and decrease unemployment in the long run?  We already know that women are less inclined to work, and work fewer hours when they do, than men.  So, ogic suggests that the more the labor force moves away from being male, white, and Protestant, the more unemployment there will be and the lower the employment-population ratio is likely to fall.</p><p>The “New Normal” of eight percent unemployment and sub-60 percent EPR isn’t necessarily the result of the financial shenanigans or even free trade, it is also partly the result of immigration from countries where the population is less inclined to work hard. Johnson’s comments also lead to the obvious conundrum: if there are fewer people working less hard, how are they going to be able to pay for the increasing number of people not working at all?</p></div>",
  "content_text": "It has always seemed more than a little strange to me that so many Americans blithely assume that browns, blacks, and yellows who relocate to the United States are going to take on all the characteristics of white Americans by the sole virtue of their geographic relocation:\nBlack Entertainment Television (BET) founder\nBob Johnson said\nTuesday\nthat the nation would “never tolerate white unemployment at 14 or 15\npercent” and yet unemployment for the black community has been double\nthat of white Americans for over 50 years….\nJohnson said the challenge was to figure out why the unemployment\nrate for blacks has been so high, “and if that doesn’t change,\nsomebody’s going to have to pay— 34 million African-Americans are not\ngoing to leave this country, millions of African-Americans who don’t\nhave jobs.”\n“Somebody’s going to have to pay for them. Somebody’s going to have\nto take care of them, and if somebody’s going to have to take care of\nthem, that money’s got to come from somebody. And whoever’s paying for\nit is going to be upset about it, and they’re going to start looking for\nsomebody to blame,” Johnson said.\nIt has been understood for decades that the lesser cultural differences between white Protestants and white Catholics have been sufficient to create very different outcomes in various European countries. Hence the phrase “Protestant work ethic”.\nIn light of this, is it not worth considering the possibility that the “new normal” of higher unemployment rates and lower labor force participation rates is at least in part the inevitable result of the 1965 and 1986 immigration acts, which have resulted in the massive influx of people with different cultures, and observably different work ethics, than white Protestant Americans?\nIn 1991, the Employment-Population Ratio in the USA was four points higher than in Mexico, 61-57.  It was 53 in Nigeria, 50 in France, and 45 in Italy.  This is usually blamed on lack of economic development and capital, but it seems to me that since economic development and capital are consequences of human action, not causes, it is more likely that one reason for the previously advantaged state of the US economy was the result of the unique composition of its predominantly Protestant European labor force.\nNow, there are obviously a wide variety of other factors involved, but all things being equal, does it really make sense to imagine that importing workers from countries that are less productive and less inclined to work is going to increase productivity and decrease unemployment in the long run?  We already know that women are less inclined to work, and work fewer hours when they do, than men.  So, ogic suggests that the more the labor force moves away from being male, white, and Protestant, the more unemployment there will be and the lower the employment-population ratio is likely to fall.\nThe “New Normal” of eight percent unemployment and sub-60 percent EPR isn’t necessarily the result of the financial shenanigans or even free trade, it is also partly the result of immigration from countries where the population is less inclined to work hard. Johnson’s comments also lead to the obvious conundrum: if there are fewer people working less hard, how are they going to be able to pay for the increasing number of people not working at all?",
  "tags": [
    "economics",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-10T08:01:00+00:00"
}