{
  "url": "https://voxday.net/2013/04/01/nocturne-nove/",
  "scraped_at": "2025-12-14T22:24:38.583177",
  "title": "Nocturne: a novel",
  "date_display": "April 1, 2013",
  "date_iso": "2013-04-01T14:00:00+00:00",
  "date_from_url": "2013-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sometimes, you just know something is going to turn out a certain way, but even when it does, the fact that it turns out that way doesn’t prevent it from being every bit as deliciously and delightfully funny as you imagined.  As some of you are aware, an anklebiting troll by the name of Will aka Dan aka Dimwit Dan aka Luscinia Hâfez aka Yama the Spacefish has made a habit of denigrating my fiction at every opportunity for years, marks every positive review of my books on Amazon as “unhelpful”, and now claims “give me one minute and I can write a sentence better than anything in <i>The War In Heaven</i>.” </p><p>Fortunately, we can put this hypothesis to the test thanks to the astonishing act of literatury greatness he has committed and graciously made available to the public.  And so, with not inconsiderable pleasure, I am deeply honored to present to you a selection of text from the next great American novel, <a href=\"http://yamathespacefish.deviantart.com/art/Nocturne-chapter-3-105196396\"><i>Nocturne</i></a>, by Will aka Dan aka Yama etc.</p><blockquote class=\"tr_bq\"><p> A young woman with close-cropped hair, dark at the roots and bleached<br> almost white at their tips, held with a band and a gold disk pendant<br> amongst silver chains, dressed in black clothes under a white wool<br> cardigan and midnight blue coat came out of the building. “Spies?” she<br> said, momentarily puzzled and starry-eyed, pushing the door shut. Snow<br> fell in flurries, the flakes were melting on our hair. “No matter,” she<br> said, unsheathing a blade. She sighed, and ran after me, stopping and<br> slashing. I blocked it with my pipe. “You don’t have your patron<br> Cleisourarch to help you. He’s dead by Red hands, impaled with a stake<br> and paraded naked and flayed open through the streets of Mediolanum and<br> dumped in the river. You face me alone. Me, the greatest swordswoman in<br> all of Carantania.”<br> “Marciana, can you support me?” Adrenaline warmed my body.<br> “I don’t know. I’ll try.”<br> “Good.”<br> “Stop! I know them,“ another woman cried. <br> “Anysia?” I asked.<br> “Yeah.”<br> “Uh, I’m terribly sorry,” the woman who attacked us said, her voice<br> languid and melodic. The gold disk on her neck was inset with a large<br> red stone with a carving of an eye at the center of a star and six<br> cabochons of varying tones of green at the points, actually<br> light-emitting diodes. A bead of amber with a fly, like Ava’s, hung from<br> the side of the headband, wrapped in fine gold chains. A sardonyx<br> brooch with a cameo was pinned to her coat. “I heard you walking around<br> up there, and I couldn’t really see you. Thought you were Selinian, or<br> worse, Pannonian agents. I’m Cantianilla, by the way. Cantianilla<br> Vasilescu, if you were wondering. Veridiana told me to wear it with<br> pride because it’s part of who we are, for better and worse. I’m not<br> sure but for what it’s worth, there’s a lot of people with that kind of<br> family name, Vasilescu and Gavrilescu and Stefanescu and a bunch of<br> other people with -escu at the end. Mine reminds me of basilisks. Do you<br> know what a basilisk is? There’s a folktale about a feathered lizard<br> that can turn a man to stone with its gaze. But maybe I’m mixing them up<br> with dinosaurs. Those were real, but they didn’t have a petrifying<br> glare or anything. I see you know Anysia. So, what are your names,<br> wayfarers?”<br> “I’m Marciana. And only Marciana.”<br> “I’m Nicasius<br> Patrescu. Ava calls me Nica. It’s nice, but a little feminine.<br> Marciana’s been my friend ever since we were small children. Are any of<br> the others here?” I asked.<br> “Yes, I heard you say that. It was a bit<br> comforting, since Pannonians think we’re idolators and don’t have names<br> like yours and keep their women in the home as a mandate, but who knows?<br> Nobody really knows who the Synod is. Rumors abound that the Synod<br> members wander the streets of Vindobona as vagrants, that the<br> Magisterium funding the Pannonian Revolutionary Front as a lure for<br> potential traitors to the Church and Nation. Should I believe it? It<br> seems more like an old story than reality, but you know what they say<br> about stories and half-truths. I understand that there are Saugumas, I<br> mean, agents of the Synod in the Pannonian Revolutionary Front, and thus<br> they decentralized it, and everyone can name only the members of their<br> cell. You must forgive me for not trusting you. Eight others are all<br> with us,” Cantianilla said. “Veridiana’s heartbroken. She’s with Ava<br> now. They’re in the basement.”<br> “What happened?” Marciana asked.<br> “Theopemptus happened,” Anysia said.<br> “Curse the house Daubresse until the sun goes bloated and rotten and<br> the stars are shaken from the heavens. Mansuetus died in an attack on<br> the Cleiousarch’s soldiers a day after you left. They had some kind of<br> warmech with them, and I don’t know where they got it, maybe a blue-gray<br> alliance of sorts. A mortar tore him apart. I witnessed it, oh, oh,”<br> Cantianilla said. She seemed less brash once she knew we were friendly.<br> “I’m sorry,” Marciana said. “I know all too well the pain of loss.”<br> “There’s nothing you could do. I mean, we won in the conflict against<br/> the Blues, but victory has a price and many of us wondered if it was<br/> worth it. There’s a stela on the demesne with fifty names on it. If you<br/> could ever go back, you’d notice the number of Pannonian names on it.<br/> They fought valiantly, and their sacrifice for a free Carantania was not<br/> in vain.”</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Great stuff.  FREEDOM!  I particularly enjoyed this line: “Me, the greatest swordswoman in<br/> all of Carantania.” That’s QUALITY literature.  Look out, Doestoevsky!  Now, what do you think the odds are that Cantianillawafer<br/> Vasilfawltytowerescu’s starry eyes are purple?  Five-to-one?  Ten-to-one?</p></div>",
  "content_text": "Sometimes, you just know something is going to turn out a certain way, but even when it does, the fact that it turns out that way doesn’t prevent it from being every bit as deliciously and delightfully funny as you imagined.  As some of you are aware, an anklebiting troll by the name of Will aka Dan aka Dimwit Dan aka Luscinia Hâfez aka Yama the Spacefish has made a habit of denigrating my fiction at every opportunity for years, marks every positive review of my books on Amazon as “unhelpful”, and now claims “give me one minute and I can write a sentence better than anything in\nThe War In Heaven\n.”\nFortunately, we can put this hypothesis to the test thanks to the astonishing act of literatury greatness he has committed and graciously made available to the public.  And so, with not inconsiderable pleasure, I am deeply honored to present to you a selection of text from the next great American novel,\nNocturne\n, by Will aka Dan aka Yama etc.\nA young woman with close-cropped hair, dark at the roots and bleached\nalmost white at their tips, held with a band and a gold disk pendant\namongst silver chains, dressed in black clothes under a white wool\ncardigan and midnight blue coat came out of the building. “Spies?” she\nsaid, momentarily puzzled and starry-eyed, pushing the door shut. Snow\nfell in flurries, the flakes were melting on our hair. “No matter,” she\nsaid, unsheathing a blade. She sighed, and ran after me, stopping and\nslashing. I blocked it with my pipe. “You don’t have your patron\nCleisourarch to help you. He’s dead by Red hands, impaled with a stake\nand paraded naked and flayed open through the streets of Mediolanum and\ndumped in the river. You face me alone. Me, the greatest swordswoman in\nall of Carantania.”\n“Marciana, can you support me?” Adrenaline warmed my body.\n“I don’t know. I’ll try.”\n“Good.”\n“Stop! I know them,“ another woman cried.\n“Anysia?” I asked.\n“Yeah.”\n“Uh, I’m terribly sorry,” the woman who attacked us said, her voice\nlanguid and melodic. The gold disk on her neck was inset with a large\nred stone with a carving of an eye at the center of a star and six\ncabochons of varying tones of green at the points, actually\nlight-emitting diodes. A bead of amber with a fly, like Ava’s, hung from\nthe side of the headband, wrapped in fine gold chains. A sardonyx\nbrooch with a cameo was pinned to her coat. “I heard you walking around\nup there, and I couldn’t really see you. Thought you were Selinian, or\nworse, Pannonian agents. I’m Cantianilla, by the way. Cantianilla\nVasilescu, if you were wondering. Veridiana told me to wear it with\npride because it’s part of who we are, for better and worse. I’m not\nsure but for what it’s worth, there’s a lot of people with that kind of\nfamily name, Vasilescu and Gavrilescu and Stefanescu and a bunch of\nother people with -escu at the end. Mine reminds me of basilisks. Do you\nknow what a basilisk is? There’s a folktale about a feathered lizard\nthat can turn a man to stone with its gaze. But maybe I’m mixing them up\nwith dinosaurs. Those were real, but they didn’t have a petrifying\nglare or anything. I see you know Anysia. So, what are your names,\nwayfarers?”\n“I’m Marciana. And only Marciana.”\n“I’m Nicasius\nPatrescu. Ava calls me Nica. It’s nice, but a little feminine.\nMarciana’s been my friend ever since we were small children. Are any of\nthe others here?” I asked.\n“Yes, I heard you say that. It was a bit\ncomforting, since Pannonians think we’re idolators and don’t have names\nlike yours and keep their women in the home as a mandate, but who knows?\nNobody really knows who the Synod is. Rumors abound that the Synod\nmembers wander the streets of Vindobona as vagrants, that the\nMagisterium funding the Pannonian Revolutionary Front as a lure for\npotential traitors to the Church and Nation. Should I believe it? It\nseems more like an old story than reality, but you know what they say\nabout stories and half-truths. I understand that there are Saugumas, I\nmean, agents of the Synod in the Pannonian Revolutionary Front, and thus\nthey decentralized it, and everyone can name only the members of their\ncell. You must forgive me for not trusting you. Eight others are all\nwith us,” Cantianilla said. “Veridiana’s heartbroken. She’s with Ava\nnow. They’re in the basement.”\n“What happened?” Marciana asked.\n“Theopemptus happened,” Anysia said.\n“Curse the house Daubresse until the sun goes bloated and rotten and\nthe stars are shaken from the heavens. Mansuetus died in an attack on\nthe Cleiousarch’s soldiers a day after you left. They had some kind of\nwarmech with them, and I don’t know where they got it, maybe a blue-gray\nalliance of sorts. A mortar tore him apart. I witnessed it, oh, oh,”\nCantianilla said. She seemed less brash once she knew we were friendly.\n“I’m sorry,” Marciana said. “I know all too well the pain of loss.”\n“There’s nothing you could do. I mean, we won in the conflict against\nthe Blues, but victory has a price and many of us wondered if it was\nworth it. There’s a stela on the demesne with fifty names on it. If you\ncould ever go back, you’d notice the number of Pannonian names on it.\nThey fought valiantly, and their sacrifice for a free Carantania was not\nin vain.”\nGreat stuff.  FREEDOM!  I particularly enjoyed this line: “Me, the greatest swordswoman in\nall of Carantania.” That’s QUALITY literature.  Look out, Doestoevsky!  Now, what do you think the odds are that Cantianillawafer\nVasilfawltytowerescu’s starry eyes are purple?  Five-to-one?  Ten-to-one?",
  "tags": [
    "freakshow",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-01T13:00:00+00:00"
}