{
  "url": "https://voxday.net/2013/04/15/of-peter-paul-and-peng/",
  "scraped_at": "2025-12-14T22:25:59.225583",
  "title": "Of Peter, Paul, and Peng",
  "date_display": "April 15, 2013",
  "date_iso": "2013-04-15T17:00:00+00:00",
  "date_from_url": "2013-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fortunately, as all we good Keynesians know, there is no problem with large quantities of government debt because when interest on the debt is paid out of taxation, there is no direct loss of disposable income.  It’s literally textbook economics!</p><p><i>“The interest on an internal debt is paid by Americans to Americans;<br> there is no direct loss of goods and services. When interest on the debt<br> is paid out of taxation, there is no direct loss of disposable income;<br> Paul receives what Peter loses, and sometimes – but only sometimes –<br> Paul and Peter are one and the same person…. In the future, some of<br> our grandchildren will be giving up goods and services to other<br> grandchildren. That is the nub of the matter. The only way we can impose<br> a direct burden on the future nation as a whole is by incurring an<br> external debt or by passing along less capital equipment to posterity.”</br></br></br></br></br></br></br></br></i><br> – Paul Samuelson, <i>Economics</i>, 1948</br></p><p>So, the USA is in good shape despite Debt/GDP passing 100 percent earlier this year. Or <a href=\"http://hosted.ap.org/dynamic/stories/U/US_FOREIGN_HOLDINGS?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2013-04-15-09-07-09\">is it?</a></p><blockquote class=\"tr_bq\"><div class=\"ap-story-p\"> Foreign demand for<br> U.S. Treasury securities rose to a record level in February, indicating<br> that international investors remain confident in U.S. debt despite<br> budget wrangling in Washington. The Treasury<br> Department said Monday that foreign holdings of U.S. Treasury securities<br> increased 0.3 percent in February from January to a record $5.66<br> trillion. It was the 14th straight monthly increase.</br></br></br></br></br></br></div></blockquote></div>",
  "content_text": "Fortunately, as all we good Keynesians know, there is no problem with large quantities of government debt because when interest on the debt is paid out of taxation, there is no direct loss of disposable income.  It’s literally textbook economics!\n“The interest on an internal debt is paid by Americans to Americans;\nthere is no direct loss of goods and services. When interest on the debt\nis paid out of taxation, there is no direct loss of disposable income;\nPaul receives what Peter loses, and sometimes – but only sometimes –\nPaul and Peter are one and the same person…. In the future, some of\nour grandchildren will be giving up goods and services to other\ngrandchildren. That is the nub of the matter. The only way we can impose\na direct burden on the future nation as a whole is by incurring an\nexternal debt or by passing along less capital equipment to posterity.”\n– Paul Samuelson,\nEconomics\n, 1948\nSo, the USA is in good shape despite Debt/GDP passing 100 percent earlier this year. Or\nis it?\nForeign demand for\nU.S. Treasury securities rose to a record level in February, indicating\nthat international investors remain confident in U.S. debt despite\nbudget wrangling in Washington. The Treasury\nDepartment said Monday that foreign holdings of U.S. Treasury securities\nincreased 0.3 percent in February from January to a record $5.66\ntrillion. It was the 14th straight monthly increase.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-15T16:00:00+00:00"
}