{
  "url": "https://voxday.net/2013/04/28/public-intellectual-godless-intellectua/",
  "scraped_at": "2025-12-14T22:27:15.902171",
  "title": "Public intellectual = godless intellectual",
  "date_display": "April 28, 2013",
  "date_iso": "2013-04-28T10:41:00+00:00",
  "date_from_url": "2013-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his speculation on whether public intellectuals matter, AC Grayling somehow manages to <a href=\"http://www.prospectmagazine.co.uk/magazine/public-intellectual-world-thinkers-ac-grayling/\">avoid noticing the giant elephant voiding its bowels</a> in the room.</p><blockquote class=\"tr_bq\"><p> Can one give a catch-all definition of what it is to be a “public<br> intellectual”? Consider this list: Bertrand Russell, Albert Einstein,<br> Edmund Wilson, Lionel Trilling, Stephen Jay Gould, Norman Mailer, Susan<br> Sontag, Noam Chomsky, Richard Dawkins, indeed anyone on <i>Prospect</i>’s<br> list of people who merit or are thought to merit the label. They have<br> very little in common other than intelligence and engagement, and the<br> fact that they speak out. Those three things, accordingly, might be<br> taken to capture the essence.</br></br></br></br></br></br></br></p></blockquote><p>Very little in common other than intelligence, engagement, and the fact that they speak out?  I don’t know, my highly developed pattern recognition skills suggest to me that there just might be something else these notable public intellectuals all have in common. Let’s look over his list one by one and see what the Internet has to say about their religious beliefs.</p><p>Bertrand Russell = atheist<br> Albert Einstein = agnostic<br> Edmund Wilson = atheist<br> Lionel Trilling = agnostic<br> Stephen Jay Gould = atheist-leaning agnostic<br> Norman Mailer = atheist (during his years as a public intellectual)<br> Susan<br> Sontag = atheist<br> Noam Chomsky = atheist<br> Richard Dawkins = atheist</br></br></br></br></br></br></br></br></br></p><p>My goodness, isn’t that an astonishing surprise! It goes without saying, of course, that A.C. Grayling is himself an atheist.  This failure to note this common point is so massive, and so glaring, that it is either intentional, or worse, an indication of the very small scope of the so-called public intellectual’s perspective. Of course, we should probably keep in mind that Grayling is known for his convenient memory lapses, having once <a href=\"http://www.rationalskepticism.org/nontheism/did-a-c-grayling-debate-craig-or-didn-t-he-t24490.html\">falsely accused William Lane Craig</a> of a false claim to have debated him.</p><p>This leads me to conclude that the correct answer to Grayling’s question is that public intellectuals matter very much to other public intellectuals.  As to their importance to the vast majority of the rest of the world, who don’t give a damn what a few self-important, self-promoting, godless individuals may happen to think about anything, they clearly don’t matter at all.</p><p>As I have previously shown, despite the statistical overrepresentation of the irreligious among the highly intelligent, there are still far more highly intelligent religious individuals than there are highly intelligent irreligious individuals.  To be precise, the ratio of theists with +2SD IQs to atheists with +2 SD IQs <a href=\"http://www.milobookclub.com/2011/01/16/most-atheists-have-sub-norma/\">is more than 10 to one</a>. The more significant question, therefore, is why are all of these much more numerous highly intelligent religious individuals so few and far between <a href=\"http://www.prospectmagazine.co.uk/magazine/world-thinkers-2013/\">on this year’s list</a> of celebrated world thinkers?  Why are so few of them invited to give TED talks?</p><p>Do their religious beliefs somehow negate their intelligence? Or could it be that there some other mysterious factor at work? This is all so very inexplicable in light of the fact that GSS studies over the past 40 years show that the MAJORITY of atheists have IQs of 100 or less.</p></div>",
  "content_text": "In his speculation on whether public intellectuals matter, AC Grayling somehow manages to\navoid noticing the giant elephant voiding its bowels\nin the room.\nCan one give a catch-all definition of what it is to be a “public\nintellectual”? Consider this list: Bertrand Russell, Albert Einstein,\nEdmund Wilson, Lionel Trilling, Stephen Jay Gould, Norman Mailer, Susan\nSontag, Noam Chomsky, Richard Dawkins, indeed anyone on\nProspect\n’s\nlist of people who merit or are thought to merit the label. They have\nvery little in common other than intelligence and engagement, and the\nfact that they speak out. Those three things, accordingly, might be\ntaken to capture the essence.\nVery little in common other than intelligence, engagement, and the fact that they speak out?  I don’t know, my highly developed pattern recognition skills suggest to me that there just might be something else these notable public intellectuals all have in common. Let’s look over his list one by one and see what the Internet has to say about their religious beliefs.\nBertrand Russell = atheist\nAlbert Einstein = agnostic\nEdmund Wilson = atheist\nLionel Trilling = agnostic\nStephen Jay Gould = atheist-leaning agnostic\nNorman Mailer = atheist (during his years as a public intellectual)\nSusan\nSontag = atheist\nNoam Chomsky = atheist\nRichard Dawkins = atheist\nMy goodness, isn’t that an astonishing surprise! It goes without saying, of course, that A.C. Grayling is himself an atheist.  This failure to note this common point is so massive, and so glaring, that it is either intentional, or worse, an indication of the very small scope of the so-called public intellectual’s perspective. Of course, we should probably keep in mind that Grayling is known for his convenient memory lapses, having once\nfalsely accused William Lane Craig\nof a false claim to have debated him.\nThis leads me to conclude that the correct answer to Grayling’s question is that public intellectuals matter very much to other public intellectuals.  As to their importance to the vast majority of the rest of the world, who don’t give a damn what a few self-important, self-promoting, godless individuals may happen to think about anything, they clearly don’t matter at all.\nAs I have previously shown, despite the statistical overrepresentation of the irreligious among the highly intelligent, there are still far more highly intelligent religious individuals than there are highly intelligent irreligious individuals.  To be precise, the ratio of theists with +2SD IQs to atheists with +2 SD IQs\nis more than 10 to one\n. The more significant question, therefore, is why are all of these much more numerous highly intelligent religious individuals so few and far between\non this year’s list\nof celebrated world thinkers?  Why are so few of them invited to give TED talks?\nDo their religious beliefs somehow negate their intelligence? Or could it be that there some other mysterious factor at work? This is all so very inexplicable in light of the fact that GSS studies over the past 40 years show that the MAJORITY of atheists have IQs of 100 or less.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-28T09:41:00+00:00"
}