{
  "url": "https://voxday.net/2013/04/26/reinhart-and-roghoff-respond/",
  "scraped_at": "2025-12-14T22:27:06.686507",
  "title": "Reinhart and Roghoff respond",
  "date_display": "April 26, 2013",
  "date_iso": "2013-04-26T14:30:00+00:00",
  "date_from_url": "2013-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have been following the mini-scandal of sorts in economics ever since the revelation that debt stars Carmen Reinhart and Kenneth Roghoff committed a basic Excel error in their famous paper that served as the basis for their very good 2009 book, This Time It’s Different.  I refrained from jumping into it right away because I think it is usually best to hear what both sides have to say before attempting to reach any kind of judgment on the matter.</p><p>Also, from my neo-Austrian perspective, the basic idea that economic statistics can provide legitimate and meaningful guidelines for policy actions is a dubious one at best. The recent artificial boost to GDP by means of counting R&amp;D expenditures twice, (to put it very, very crudely), is only one of many examples of the futility of attempting to derive economic principles from analyzing government-produced statistics.</p><p>Even so, I tended to suspect that the Neo-Keynesians were exaggerating the significance of the error, since the idea that beyond a certain amount, the addition of more debt will tend to reduce one’s ability to spend is not exactly logically controversial.  The fact that Krugman and others immediately attempted to turn the matter into a policy debate was also suspicious, since the Reinhart and Roghoff paper was hardly the only one published on the subject. And, as it happens, <a href=\"http://www.nytimes.com/2013/04/26/opinion/reinhart-and-rogoff-responding-to-our-critics.html?pagewanted=1&amp;_r=0\">Reinhart and Roghoff’s response</a> indicates that their admitted mistake was considerably less significant than the Keynesians and the inflationistas would like to pretend it is.</p><blockquote class=\"tr_bq\"><p> LAST week, we were sent a sharply worded paper by three researchers from the University of Massachusetts, Amherst, at the same time it was sent to journalists. It asserted serious errors in our article “Growth in a Time of Debt,” published in May 2010 in the Papers and Proceedings of the American Economic Review. In an Op-Ed essay for The New York Times, we have tried to defend our research and refute the distorted policy positions that have been attributed to us. In this appendix, we address the technical issues raised by our critics.</p><p>These critics, Thomas Herndon, Michael Ash and Robert Pollin, identified a spreadsheet calculation error, but also accused us of two “serious errors”: “selective exclusion of available data” and “unconventional weighting of summary statistics.”</p><p>We acknowledged the calculation error in an online statement posted the night we received the article, but we adamantly deny the other accusations.</p><p>They neglected to report that we included both median and average estimates for growth, at various levels of debt in relation to economic output, going back to 1800. Our paper gave significant weight to the median estimates, precisely because they reduce the problem posed by data outliers, a constant source of concern when doing archival research that reaches far back into economic history spanning several periods of war and economic crises.</p><p>When you look at our median estimates, they are actually quite similar to those of the University of Massachusetts researchers. (See the attached table.)</p><p>Moreover, our critics omitted mention of our paper “Public Debt Overhangs: Advanced-Economy Episodes Since 1800,” with Vincent R. Reinhart, published last summer, in The Journal of Economic Perspectives. That paper, which is more thorough than the 2010 paper under attack, gives an average estimate for growth when a country’s debt-to-G.D.P. ratio exceeds 90 percent of 2.3 percent — compared to our critics’ figure of 2.2 percent. (Also see the comparisons posted by the blogger known as F. F. Wiley, including his chart, a copy of which accompanies this essay.)</p><p>Despite the very small actual differences between our critics’ results and ours, some commenters have trumpeted the new paper as a fundamental reassessment of the literature on debt and growth. Our critics have done little to argue otherwise; Mr. Pollin and Mr. Ash made the same claim in an April 17 essay in The Financial Times, where they also ignore our strong exception to the claim by Mr. Herndon, Mr. Ash and Mr. Pollin that we use a “nonconventional weighting procedure.” It is the accusation that our weighting procedure is nonconventional that is itself nonconventional. A leading expert in time series econometrics, James D. Hamilton of the University of California, San Diego, wrote (without consulting us) that “to suggest that there is some deep flaw in the method used by RR or obvious advantage to the alternative favored by HAP is in my opinion quite unjustified.” (He was using the initials for the last names of the economists involved in this matter.)</p><p>Above all, our work hardly amounts to the whole literature on the relationship between debt and growth, which has grown rapidly even since our 2010 paper was published. A number of careful empirical studies have found broadly similar results to ours. But this is not the definitive word, as a smaller number of just as scholarly papers have not found a robust relationship between debt and growth. (Our paper in The Journal of Economic Perspectives included a review of that literature.)</p><p>Researchers at the Bank of International Settlements and the International Monetary Fund have weighed in with their own independent work. The World Economic Outlook published last October by the International Monetary Fund devoted an entire chapter to debt and growth. The most recent update to that outlook, released in April, states: “Much of the empirical work on debt overhangs seeks to identify the ‘overhang threshold’ beyond which the correlation between debt and growth becomes negative. The results are broadly similar: above a threshold of about 95 percent of G.D.P., a 10 percent increase in the ratio of debt to G.D.P. is identified with a decline in annual growth of about 0.15 to 0.20 percent per year.”</p></blockquote><p>It’s important to understand how deep we are into uncharted waters here, as only 8 percent of the postwar observations in advanced economies exceeded 90 percent of GDP and levels over 120 percent are almost unheard of.  But regardless, as Reinhart and Roghoff point out, there are only four options: slow growth and austerity for a<br> very long time, elevated inflation, financial repression and debt<br> restructuring.  And the only one that offers any possibility of success without massive social disruption and violence is the last one.</br></br></p><p>More importantly, as we’ll be discussing in the next round of the Inflation/Deflation debate, policy makers may not have anywhere nearly as much choice in the matter as they believe they have.</p><p>As Zerohedge notes, US Government Debt/GDP presently stands <a href=\"http://www.zerohedge.com/news/2013-04-26/total-us-debt-gdp-105\">at 104.8 percent</a>, up from 103 percent three months ago.</p></div>",
  "content_text": "I have been following the mini-scandal of sorts in economics ever since the revelation that debt stars Carmen Reinhart and Kenneth Roghoff committed a basic Excel error in their famous paper that served as the basis for their very good 2009 book, This Time It’s Different.  I refrained from jumping into it right away because I think it is usually best to hear what both sides have to say before attempting to reach any kind of judgment on the matter.\nAlso, from my neo-Austrian perspective, the basic idea that economic statistics can provide legitimate and meaningful guidelines for policy actions is a dubious one at best. The recent artificial boost to GDP by means of counting R&D expenditures twice, (to put it very, very crudely), is only one of many examples of the futility of attempting to derive economic principles from analyzing government-produced statistics.\nEven so, I tended to suspect that the Neo-Keynesians were exaggerating the significance of the error, since the idea that beyond a certain amount, the addition of more debt will tend to reduce one’s ability to spend is not exactly logically controversial.  The fact that Krugman and others immediately attempted to turn the matter into a policy debate was also suspicious, since the Reinhart and Roghoff paper was hardly the only one published on the subject. And, as it happens,\nReinhart and Roghoff’s response\nindicates that their admitted mistake was considerably less significant than the Keynesians and the inflationistas would like to pretend it is.\nLAST week, we were sent a sharply worded paper by three researchers from the University of Massachusetts, Amherst, at the same time it was sent to journalists. It asserted serious errors in our article “Growth in a Time of Debt,” published in May 2010 in the Papers and Proceedings of the American Economic Review. In an Op-Ed essay for The New York Times, we have tried to defend our research and refute the distorted policy positions that have been attributed to us. In this appendix, we address the technical issues raised by our critics.\nThese critics, Thomas Herndon, Michael Ash and Robert Pollin, identified a spreadsheet calculation error, but also accused us of two “serious errors”: “selective exclusion of available data” and “unconventional weighting of summary statistics.”\nWe acknowledged the calculation error in an online statement posted the night we received the article, but we adamantly deny the other accusations.\nThey neglected to report that we included both median and average estimates for growth, at various levels of debt in relation to economic output, going back to 1800. Our paper gave significant weight to the median estimates, precisely because they reduce the problem posed by data outliers, a constant source of concern when doing archival research that reaches far back into economic history spanning several periods of war and economic crises.\nWhen you look at our median estimates, they are actually quite similar to those of the University of Massachusetts researchers. (See the attached table.)\nMoreover, our critics omitted mention of our paper “Public Debt Overhangs: Advanced-Economy Episodes Since 1800,” with Vincent R. Reinhart, published last summer, in The Journal of Economic Perspectives. That paper, which is more thorough than the 2010 paper under attack, gives an average estimate for growth when a country’s debt-to-G.D.P. ratio exceeds 90 percent of 2.3 percent — compared to our critics’ figure of 2.2 percent. (Also see the comparisons posted by the blogger known as F. F. Wiley, including his chart, a copy of which accompanies this essay.)\nDespite the very small actual differences between our critics’ results and ours, some commenters have trumpeted the new paper as a fundamental reassessment of the literature on debt and growth. Our critics have done little to argue otherwise; Mr. Pollin and Mr. Ash made the same claim in an April 17 essay in The Financial Times, where they also ignore our strong exception to the claim by Mr. Herndon, Mr. Ash and Mr. Pollin that we use a “nonconventional weighting procedure.” It is the accusation that our weighting procedure is nonconventional that is itself nonconventional. A leading expert in time series econometrics, James D. Hamilton of the University of California, San Diego, wrote (without consulting us) that “to suggest that there is some deep flaw in the method used by RR or obvious advantage to the alternative favored by HAP is in my opinion quite unjustified.” (He was using the initials for the last names of the economists involved in this matter.)\nAbove all, our work hardly amounts to the whole literature on the relationship between debt and growth, which has grown rapidly even since our 2010 paper was published. A number of careful empirical studies have found broadly similar results to ours. But this is not the definitive word, as a smaller number of just as scholarly papers have not found a robust relationship between debt and growth. (Our paper in The Journal of Economic Perspectives included a review of that literature.)\nResearchers at the Bank of International Settlements and the International Monetary Fund have weighed in with their own independent work. The World Economic Outlook published last October by the International Monetary Fund devoted an entire chapter to debt and growth. The most recent update to that outlook, released in April, states: “Much of the empirical work on debt overhangs seeks to identify the ‘overhang threshold’ beyond which the correlation between debt and growth becomes negative. The results are broadly similar: above a threshold of about 95 percent of G.D.P., a 10 percent increase in the ratio of debt to G.D.P. is identified with a decline in annual growth of about 0.15 to 0.20 percent per year.”\nIt’s important to understand how deep we are into uncharted waters here, as only 8 percent of the postwar observations in advanced economies exceeded 90 percent of GDP and levels over 120 percent are almost unheard of.  But regardless, as Reinhart and Roghoff point out, there are only four options: slow growth and austerity for a\nvery long time, elevated inflation, financial repression and debt\nrestructuring.  And the only one that offers any possibility of success without massive social disruption and violence is the last one.\nMore importantly, as we’ll be discussing in the next round of the Inflation/Deflation debate, policy makers may not have anywhere nearly as much choice in the matter as they believe they have.\nAs Zerohedge notes, US Government Debt/GDP presently stands\nat 104.8 percent\n, up from 103 percent three months ago.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-26T13:30:00+00:00"
}