{
  "url": "https://voxday.net/2013/04/21/so-much-to-learn/",
  "scraped_at": "2025-12-14T22:26:35.254543",
  "title": "So much to learn",
  "date_display": "April 21, 2013",
  "date_iso": "2013-04-21T09:51:00+00:00",
  "date_from_url": "2013-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jared Diamond, the great prophet of geographical destiny, tells the West that <a href=\"http://www.guardian.co.uk/science/2013/jan/06/jared-diamond-tribal-life-anthropology\">it has much to learn from the tribal people</a> of Papua New Guinea</p><blockquote class=\"tr_bq\"><p> “”I believe the few remaining tribes and nomad groups left on the<br> planet have a great deal to teach us,” he says and it is this belief<br> that inspired <i>The World Until Yesterday</i>.  Some tribal<br> customs, such as widow-strangling, will not be missed, of course. “We<br> should not romanticise traditional societies,” he says. “There are<br> horrible things that we want to avoid, but there wonderful things that<br> we should emulate.”</br></br></br></br></br></br></p><p>Take the example of child rearing. Far from<br> being harsh towards children, many tribes and groups adopt highly<br> permissive attitudes. “I mean permissive in that it is an absolute no-no<br> to punish a child. If a mother or father among African pygmies hits a<br> child, that would be grounds for divorce. There is no physical<br> punishment allowed at all in these societies. If a child plays with a<br> sharp knife and waves it around, so be it. They will cut themselves on<br> some occasions, but society figures it is better for the child to learn<br> the hard way early in life. They are allowed to make their own choices<br> and follow their own interests.””</br></br></br></br></br></br></br></br></br></p></blockquote><p>I consider his theses to be absolutely absurd, but then again, there may be something to be said for the wise people of Papua New Guinea’s <a href=\"http://www.dailymail.co.uk/news/article-2312416/Papua-New-Guinea-gang-rape-U-S-academic-32-attacked-armed-men-hacked-hair-bush-knife-tied-husband-naked-tree.html\">vigorous response to U.S. academics</a>.</p><p><i>“A U.S. academic has been gang raped in Papua New Guinea by nine armed men who hacked off her blonde hair and left her husband tied naked to a tree. The 32-year-old woman, who was conducting research into exotic birds in a remote forest on Karkar Island, was walking along a bush track with her husband and a guide on Friday when they were set upon by the gang armed with knives and rifles. Her husband and the guide were stripped and bound by the men, who then used a bush knife to hack off the woman’s hair before raping her in a terrifying ordeal lasting 20 minutes.”</i></p><p>It would certainly make the average East Coast cocktail party more lively if the sort of overeducated midwits who take Diamond at face value were to follow the example of the noble people of Papua New Guinea in this regard.</p><p>Now, I realize that many doubt my thesis that most of the desirable tenets of Christian civilization will not survive in post-Christian society, but note that in Diamond, we already have a well-regarded, much-honored academic overtly advocating a return to many pagan, pre-civilized customs. But it never seems to occur to those who eagerly anticipate Western post-Christianity that those raised in a pagan society without Christian customs and strictures will not necessarily retain the civilized customs that are inculcated in the secularist or pagan raised in a Christian society.</p><p>It is easy to say, well, we’ll keep the Western strictures against widow-strangling, witch-burning, and academic-raping, we’ll just toss the ones against homosexual-marrying, public fornication, polygamy, and letting children play with loaded guns… wait a minute! The brutal reality is that a society in which most children are “allowed to make their own choices and follow their own interests” is a society where the values, and the resulting societal strictures, will eventually be decided by those semi-feral children and not their overly permissive parents.</p><p>What has long been decried by the civilized Christian West as “the cowardly act of animals” – how very raciss and judgmental – may well become the next “new normal”. No one should be so foolish as to believe that behavioral change on a societal level is either predestined or readily controlled by government bureaucracy. It is easier to destroy than create; it is easier to degrade than strengthen. The progressives who proudly proclaim that the youth of today are much more open to “gay marriage” should keep in mind that in the not-too-distant future, those formerly open-minded youths may well find themselves position of the disregarded, close-minded elderly, listening in horror as the progressives of tomorrow proudly proclaim that the youth are much more open to “sexual services on demand”.</p></div>",
  "content_text": "Jared Diamond, the great prophet of geographical destiny, tells the West that\nit has much to learn from the tribal people\nof Papua New Guinea\n“”I believe the few remaining tribes and nomad groups left on the\nplanet have a great deal to teach us,” he says and it is this belief\nthat inspired\nThe World Until Yesterday\n.  Some tribal\ncustoms, such as widow-strangling, will not be missed, of course. “We\nshould not romanticise traditional societies,” he says. “There are\nhorrible things that we want to avoid, but there wonderful things that\nwe should emulate.”\nTake the example of child rearing. Far from\nbeing harsh towards children, many tribes and groups adopt highly\npermissive attitudes. “I mean permissive in that it is an absolute no-no\nto punish a child. If a mother or father among African pygmies hits a\nchild, that would be grounds for divorce. There is no physical\npunishment allowed at all in these societies. If a child plays with a\nsharp knife and waves it around, so be it. They will cut themselves on\nsome occasions, but society figures it is better for the child to learn\nthe hard way early in life. They are allowed to make their own choices\nand follow their own interests.””\nI consider his theses to be absolutely absurd, but then again, there may be something to be said for the wise people of Papua New Guinea’s\nvigorous response to U.S. academics\n.\n“A U.S. academic has been gang raped in Papua New Guinea by nine armed men who hacked off her blonde hair and left her husband tied naked to a tree. The 32-year-old woman, who was conducting research into exotic birds in a remote forest on Karkar Island, was walking along a bush track with her husband and a guide on Friday when they were set upon by the gang armed with knives and rifles. Her husband and the guide were stripped and bound by the men, who then used a bush knife to hack off the woman’s hair before raping her in a terrifying ordeal lasting 20 minutes.”\nIt would certainly make the average East Coast cocktail party more lively if the sort of overeducated midwits who take Diamond at face value were to follow the example of the noble people of Papua New Guinea in this regard.\nNow, I realize that many doubt my thesis that most of the desirable tenets of Christian civilization will not survive in post-Christian society, but note that in Diamond, we already have a well-regarded, much-honored academic overtly advocating a return to many pagan, pre-civilized customs. But it never seems to occur to those who eagerly anticipate Western post-Christianity that those raised in a pagan society without Christian customs and strictures will not necessarily retain the civilized customs that are inculcated in the secularist or pagan raised in a Christian society.\nIt is easy to say, well, we’ll keep the Western strictures against widow-strangling, witch-burning, and academic-raping, we’ll just toss the ones against homosexual-marrying, public fornication, polygamy, and letting children play with loaded guns… wait a minute! The brutal reality is that a society in which most children are “allowed to make their own choices and follow their own interests” is a society where the values, and the resulting societal strictures, will eventually be decided by those semi-feral children and not their overly permissive parents.\nWhat has long been decried by the civilized Christian West as “the cowardly act of animals” – how very raciss and judgmental – may well become the next “new normal”. No one should be so foolish as to believe that behavioral change on a societal level is either predestined or readily controlled by government bureaucracy. It is easier to destroy than create; it is easier to degrade than strengthen. The progressives who proudly proclaim that the youth of today are much more open to “gay marriage” should keep in mind that in the not-too-distant future, those formerly open-minded youths may well find themselves position of the disregarded, close-minded elderly, listening in horror as the progressives of tomorrow proudly proclaim that the youth are much more open to “sexual services on demand”.",
  "tags": [
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-21T08:51:00+00:00"
}