{
  "url": "https://voxday.net/2013/04/05/speaking-of-category-errors/",
  "scraped_at": "2025-12-14T22:25:00.379407",
  "title": "Speaking of category errors",
  "date_display": "April 5, 2013",
  "date_iso": "2013-04-05T14:00:00+00:00",
  "date_from_url": "2013-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really remarkable how more than 80 years later, Paul Krugman and the Keynesians <a href=\"http://www.nytimes.com/2013/04/05/opinion/Krugman-The-Urge-To-Purge.html?hp\">are STILL attacking Andrew Mellon</a> despite the fact that his liquidationist policies weren’t implemented back in 1929 and they’re not being implemented now:</p><blockquote class=\"tr_bq\"><p> When the Great Depression struck, many influential people argued that the government shouldn’t even try to limit the damage. According to Herbert Hoover, Andrew Mellon, his Treasury secretary, urged him to “Liquidate labor, liquidate stocks, liquidate the farmers. … It will purge the rottenness out of the system.” Don’t try to hasten recovery, warned the famous economist Joseph Schumpeter, because “artificial stimulus leaves part of the work of depressions undone.” </p><div class=\"articleInline runaroundLeft\"></div><div itemprop=\"articleBody\"> Like many economists, I used to quote these past luminaries with a<br> certain smugness. After all, modern macroeconomics had shown how wrong<br> they were, and we wouldn’t repeat the mistakes of the 1930s, would we….</br></br></div><p></p><div itemprop=\"articleBody\"> So what should we be doing? By all means, let’s restore the kind of<br> effective financial regulation that, in the years before the Reagan<br> revolution, helped deter excessive leverage. But that’s about preventing<br> the next crisis. To deal with the crisis that’s already here, we need<br> monetary and fiscal stimulus, to induce those who aren’t too deeply<br> indebted to spend more while the debtors are cutting back. But that prescription is, of course, anathema to Mellonites, who wrongly<br> see it as more of the same policies that got us into this trap. And<br> that, in turn, tells you why liquidationism is such a destructive<br> doctrine: by turning our problems into a morality play of sin and<br> retribution, it helps condemn us to a deeper and longer slump. </br></br></br></br></br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> The bad news is that sin sells. Although the Mellonites have, as I said,<br> been wrong about everything, the notion of macroeconomics as morality<br> play has a visceral appeal that’s hard to fight. Disguise it with a bit<br> of political cross-dressing, and even liberals can fall for it. </br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> But they shouldn’t. Mellon was dead wrong in the 1930s, and his avatars<br> are dead wrong today. Unemployment, not excessive money printing, is<br> what ails us now — and policy should be doing more, not less.</br></br></div></blockquote><p>Notice that despite the complete failure of the concept due to the stagflation of the 1970s, Krugman, ever the True Keynesian, still believes that there is some kind of meaningful tradeoff between unemployment and inflation. There isn’t. Neither printing money nor increasing credit necessarily creates any jobs.</p><p>And how is it possible for liquidationist policies to be failing today when none of the insolvent banks have been liquidated?</p></div>",
  "content_text": "It’s really remarkable how more than 80 years later, Paul Krugman and the Keynesians\nare STILL attacking Andrew Mellon\ndespite the fact that his liquidationist policies weren’t implemented back in 1929 and they’re not being implemented now:\nWhen the Great Depression struck, many influential people argued that the government shouldn’t even try to limit the damage. According to Herbert Hoover, Andrew Mellon, his Treasury secretary, urged him to “Liquidate labor, liquidate stocks, liquidate the farmers. … It will purge the rottenness out of the system.” Don’t try to hasten recovery, warned the famous economist Joseph Schumpeter, because “artificial stimulus leaves part of the work of depressions undone.”\nLike many economists, I used to quote these past luminaries with a\ncertain smugness. After all, modern macroeconomics had shown how wrong\nthey were, and we wouldn’t repeat the mistakes of the 1930s, would we….\nSo what should we be doing? By all means, let’s restore the kind of\neffective financial regulation that, in the years before the Reagan\nrevolution, helped deter excessive leverage. But that’s about preventing\nthe next crisis. To deal with the crisis that’s already here, we need\nmonetary and fiscal stimulus, to induce those who aren’t too deeply\nindebted to spend more while the debtors are cutting back. But that prescription is, of course, anathema to Mellonites, who wrongly\nsee it as more of the same policies that got us into this trap. And\nthat, in turn, tells you why liquidationism is such a destructive\ndoctrine: by turning our problems into a morality play of sin and\nretribution, it helps condemn us to a deeper and longer slump.\nThe bad news is that sin sells. Although the Mellonites have, as I said,\nbeen wrong about everything, the notion of macroeconomics as morality\nplay has a visceral appeal that’s hard to fight. Disguise it with a bit\nof political cross-dressing, and even liberals can fall for it.\nBut they shouldn’t. Mellon was dead wrong in the 1930s, and his avatars\nare dead wrong today. Unemployment, not excessive money printing, is\nwhat ails us now — and policy should be doing more, not less.\nNotice that despite the complete failure of the concept due to the stagflation of the 1970s, Krugman, ever the True Keynesian, still believes that there is some kind of meaningful tradeoff between unemployment and inflation. There isn’t. Neither printing money nor increasing credit necessarily creates any jobs.\nAnd how is it possible for liquidationist policies to be failing today when none of the insolvent banks have been liquidated?",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-05T13:00:00+00:00"
}