{
  "url": "https://voxday.net/2013/04/14/the-ideology-war-in-science-fiction/",
  "scraped_at": "2025-12-14T22:25:51.903799",
  "title": "The ideology war in science fiction",
  "date_display": "April 14, 2013",
  "date_iso": "2013-04-14T08:40:00+00:00",
  "date_from_url": "2013-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sarah Hoyt tries to convince science fiction’s left wing mainstream <a href=\"http://accordingtohoyt.com/2013/04/13/when-the-civil-war-turns-hot/\">to come to grips with the new publishing reality</a> before the ability of the right wing to bypass the gatekeepers does to them what Fox News has done to the ABCNNBCBS media cabal.</p><blockquote class=\"tr_bq\"><p> At its inception science fiction gave free rein to all thoughts of weird thoughts.  To this day science fiction allows a great leeway to personal behavior.  If there is a place on Earth you can show up wearing a live duck and have people ask you about the technical details of the costume, it’s science fiction.  To that extent, fans and other authors are “my people” and it’s a place I can decompress.  Like gays in the bad closet days finding a place they could be themselves, science fiction conventions allow me to be my own weird self without people shying away from me.  As a friend of mine puts it “we are the plaid sheep of our families.”  And the best place to hide is the flock.</p><p>The problem is that any community – ANY community – but particularly an excluded community (see what I did there?) will tend to try to form cohesion along the lines of common thought and common belief.  You might think that Odds would not try to enforce a rigid conformity, but you would be wrong.</p><p>It happened gradually.  Part of it is that most of us are used to be looked at askance and treated like abnormal.  A stunning number of us were bullied as children.  This means we tend to have an over developed empathy with any group identified as “victims.”  That, plus the fact that the publishing gatekeepers are the result of the long march and are – no, this is not under dispute – varying shades of red going from slightly to the right of Lenin to slightly to the left of Stalin. (Why is this not under dispute?  Because of the number of authors who identify themselves as communist.  Because there is in Science Fiction a young communist authors group.  People OPENLY identify as communist, and there’s no repercussion in their careers.  People don’t openly identify as conservative UNLESS they came in at a different time and their careers are secure.  If you think that’s because only leftists are creative or that this means the community is becoming more enlightened, you are part of the problem.  Go to the corner and meditate how identifying with a regime responsible for the death of a hundred million is “enlightened.  Or how any community EVER has achieved uniformity of opinion, unless it is EXTERNAL and enforced by authorities.  Good Lord, even today we have flat Earthers.  BUT you think that everyone who writes science fiction just is magically “left”?  I hope you are a fantasy author.)</p><p>I swear the eighties was a long slog of abused women in science fiction and fantasy books.  They were always abused by their fathers, too, who were tyrannical evil sobs.  The idea that mothers can be horrible parents too, never seemed to occur to these female writers. There was always a sisterhood of women.  As someone who has known any number of ‘orrible mothers, and who went to an all girls’ school the whole “sisterhood of those who possess vaginas” made me want to shred kittens.  (Shuddup.  I didn’t do it.  I’m just saying how mad it made me.  You know how I feel about cats.)  Even when the books were somewhat acceptable otherwise, it annoyed me to the point a lot of them went unread.</p><p>Then came the every woman a hero every man a wimp movement.  (Yes, Athena is more than normal.  Yes, she is strong. She is also hotheaded and foolish and, btw, Kit is far more than a match for her.)  And then…</p><p>Well, every fad of the left falls into science fiction and fantasy books, even the patently, absurdly ridiculous.  Like, oh, for instance, the idea that all male sexuality is dangerous, the idea that a society of women would be peaceful forever, the idea–  Too much to go on.  Suffice it to say the most awarded short story in our history – receiving every award in the field – posits that life in an American Suburb is more exclusionary and worse than life during China’s cultural revolution.</p><p>HOWEVER commentary by someone otherwise respected in the field, in a CHURCH magazine to the extent that homosexuals might have conflicts with being good LDS members occasions cries of “kill the witch.”</p><p>Oh, my people!  Not only are you trying to enforce conformity, but you’re trying to enforce a conformity so out of touch with the rest of society that what you think is right and worthy to publish strikes most people as “OMG, kill.”  Which probably explains the spiraling down print runs.  Those of us already fans and writers yawn, the rest of the world backs away screaming….</p><p>News for my colleagues on the left: For years we’ve put up with<br> whatever you dished out.  We had to.  We didn’t scream, we didn’t<br> complain.  We are even tolerant enough to like your books and admire<br> your artistry, EVEN when we think what you’re proposing is wrong and<br> perhaps evil (a world of all women.  Communitarian worldwide<br> societies.)  We understand the difference between ideas and those who<br> have them.</br></br></br></br></br></br></p><p>It’s harder for you.  Politics is your religion.</p><p>Up till now given a limited output, already pre-vetted, it was easy for<br> you to freeze out anyone who outraged you.  But indie has opened the<br> sluice gates.  You might (for all I know.  Again, when a community is<br> excluded, it goes underground) be a majority in sf writers now for all I<br> know.  I GUARANTEE you’re a tiny minority in the population.  Now that<br> the gates have opened and anyone can write SF and sell well and be<br> admired, it probably won’t be long before you’re a minority in sf/f<br> writing.</br></br></br></br></br></br></br></p><p>However, I URGE you to come to terms as soon as possible.</p></blockquote><p>I have to say that I don’t think Sarah’s warning is going to make any difference at all.  As a result of my campaign for SFWA president, I have spent the last two months in the bowels of the SFWA forums. What I have seen is that the writers who make up the SF/F community are, to an almost unbelievable extent, delusional.  They genuinely believe they are faster when they have been winning races because a vast quantity of other runners have been barred from even lining up in the blocks to run against them.  They genuinely believe that they are special beings with a superior morality, and at the same time, assert that their ideological views are shared by all the decent members of civil society. And they are very nasty pieces of work, bitter from their long experience of social exclusion and their lowly positions on the socio-sexual totem pole.  They are full of hatred themselves, which is why they see hate in even the most genuine and harmless differences of opinion. </p><p>Most of all, they have no ability to conceive of the mere possibility of separating the personal from the political. They attempt to destroy those who disagree with them or cause them to suffer embarrassment; recall that McRapey’s charity campaign wasn’t an attempt to stop me from trolling his blog or to advance any racist, sexist, or homophobic causes, it was to try to stop me from simply mentioning him because <i>I dared to directly quote him</i> and taunt him for his eminently tauntable words. I did nothing more than do to him what he prides himself on doing to others; you all know what resulted from that.</p><p>Nearly two decades ago, a member of the SFWA told me that the battles within science fiction were so bitter because the stakes were so small. But I think he was wrong. It’s more than that. The battles are so bitter because SF/F is largely comprised of gamma males and unattractive women who are very bitter people.  They are openly bitter about their lots in life. They are deeply angry with the world as they have experienced it. The books they write, for the most part, are their wish fulfillment fantasies, places where they finally have the chance to say what they didn’t have the wit to say when it mattered and be the people they couldn’t manage to become in real life. This is why, despite being technically more proficient in some ways, their work is so observably inferior to the science fiction and fantasy of earlier ages that concerned itself with ideas of more grandeur and societal import than the retro-adolescent daydreams of socio-sexually unsuccessful former junior high school students.</p><p>I commend Sarah for her graciousness in attempting to warn those who have repeatedly done their best to professionally shun her and undermine her career. But I can tell her that it will not work; I attempted to do something similar in my current campaign for SFWA President. But my warnings about the coming collapse of the traditional professional publishing business of SF/F – which you will note preceded the failure of Night Shade Books – was met with little more than the usual sneers and rabbits shrieking “not-rabbit, not-rabbit”!</p><p>So leave them to their fate.  Let the rabbits panic as books prices continue to decline, their royalties continue to fall and their publishers stop paying advances before finally going the way of Borders and Night Shade Books. Let them learn if they are able to compete on a playing field that is not heavily tilted in their favor by like-minded ideologues. Let the obese, unhealthy moral degenerates struggle to pay for the increased costs of their health care under the Obamacare regime for which they clamored.</p><p>It’s not our fault. It’s not our concern. And it’s not our problem. The gatekeepers are failing, the gates are swinging open, and the right-wing horde is rapidly approaching the citadel. It won’t be long before the sneering writers of SF/F cease their endless snarking and start crying out for mercy.</p><p>At that point, it will fall to us, we established writers of the right who have somehow managed to surmount every obstacle and survive every stone and missile hurled our way throughout what passes for our literary careers, to remind them that it was their decision to declare “no quarter”. We didn’t make the rules, we are merely playing by the ones they established.  I won’t take any pleasure in their suffering, but neither will I shed any tears.</p><p>I’ve put a list of standout authors on the right sidebar.  Authors like Sarah and Orson Scott Card, genre writers who have been willing, in some manner of speaking, to stand up against the fascists of science fiction and tell them, no, you don’t own science fiction, you don’t own fantasy, you are interlopers and intellectual parasites, and you have polluted the very literature you claimed to love.  I encourage those fans of the genre who are of the right themselves to support those writers who don’t insult you, who don’t despise you, who don’t hate you for your religious faith or your political beliefs.</p><p>Give their books a shot. You won’t like all of them.  I don’t myself.  I will still read China Mieville although he is a Communist lunatic and adore Umberto Eco’s work despite the incoherence of his left-leaning humanism.  But to the extent that I can utilize whatever influence has been granted to me by those who choose to read this blog and support my writing, I will use it to assist those who stand up for Western civilization and human liberty, rather than those who, intentionally or unintentionally, are seeking to destroy it.</p><p>Make no mistake.  The John Scalzis of the science fiction world desperately want to see Western civilization destroyed. They despise it and the conceptual aspects of their work largely consists of their dreams of its demise. But what they fail to realize is that the end of all the things they hate, the end of racism, sexism, morality, religion, and inequality, requires nothing less than the end of humanity itself, and that the end of Western civilization will not be the sexy secular scientopia of their dreams, but a two thousand-year relapse into depravity and pagan darkness.</p></div>",
  "content_text": "Sarah Hoyt tries to convince science fiction’s left wing mainstream\nto come to grips with the new publishing reality\nbefore the ability of the right wing to bypass the gatekeepers does to them what Fox News has done to the ABCNNBCBS media cabal.\nAt its inception science fiction gave free rein to all thoughts of weird thoughts.  To this day science fiction allows a great leeway to personal behavior.  If there is a place on Earth you can show up wearing a live duck and have people ask you about the technical details of the costume, it’s science fiction.  To that extent, fans and other authors are “my people” and it’s a place I can decompress.  Like gays in the bad closet days finding a place they could be themselves, science fiction conventions allow me to be my own weird self without people shying away from me.  As a friend of mine puts it “we are the plaid sheep of our families.”  And the best place to hide is the flock.\nThe problem is that any community – ANY community – but particularly an excluded community (see what I did there?) will tend to try to form cohesion along the lines of common thought and common belief.  You might think that Odds would not try to enforce a rigid conformity, but you would be wrong.\nIt happened gradually.  Part of it is that most of us are used to be looked at askance and treated like abnormal.  A stunning number of us were bullied as children.  This means we tend to have an over developed empathy with any group identified as “victims.”  That, plus the fact that the publishing gatekeepers are the result of the long march and are – no, this is not under dispute – varying shades of red going from slightly to the right of Lenin to slightly to the left of Stalin. (Why is this not under dispute?  Because of the number of authors who identify themselves as communist.  Because there is in Science Fiction a young communist authors group.  People OPENLY identify as communist, and there’s no repercussion in their careers.  People don’t openly identify as conservative UNLESS they came in at a different time and their careers are secure.  If you think that’s because only leftists are creative or that this means the community is becoming more enlightened, you are part of the problem.  Go to the corner and meditate how identifying with a regime responsible for the death of a hundred million is “enlightened.  Or how any community EVER has achieved uniformity of opinion, unless it is EXTERNAL and enforced by authorities.  Good Lord, even today we have flat Earthers.  BUT you think that everyone who writes science fiction just is magically “left”?  I hope you are a fantasy author.)\nI swear the eighties was a long slog of abused women in science fiction and fantasy books.  They were always abused by their fathers, too, who were tyrannical evil sobs.  The idea that mothers can be horrible parents too, never seemed to occur to these female writers. There was always a sisterhood of women.  As someone who has known any number of ‘orrible mothers, and who went to an all girls’ school the whole “sisterhood of those who possess vaginas” made me want to shred kittens.  (Shuddup.  I didn’t do it.  I’m just saying how mad it made me.  You know how I feel about cats.)  Even when the books were somewhat acceptable otherwise, it annoyed me to the point a lot of them went unread.\nThen came the every woman a hero every man a wimp movement.  (Yes, Athena is more than normal.  Yes, she is strong. She is also hotheaded and foolish and, btw, Kit is far more than a match for her.)  And then…\nWell, every fad of the left falls into science fiction and fantasy books, even the patently, absurdly ridiculous.  Like, oh, for instance, the idea that all male sexuality is dangerous, the idea that a society of women would be peaceful forever, the idea–  Too much to go on.  Suffice it to say the most awarded short story in our history – receiving every award in the field – posits that life in an American Suburb is more exclusionary and worse than life during China’s cultural revolution.\nHOWEVER commentary by someone otherwise respected in the field, in a CHURCH magazine to the extent that homosexuals might have conflicts with being good LDS members occasions cries of “kill the witch.”\nOh, my people!  Not only are you trying to enforce conformity, but you’re trying to enforce a conformity so out of touch with the rest of society that what you think is right and worthy to publish strikes most people as “OMG, kill.”  Which probably explains the spiraling down print runs.  Those of us already fans and writers yawn, the rest of the world backs away screaming….\nNews for my colleagues on the left: For years we’ve put up with\nwhatever you dished out.  We had to.  We didn’t scream, we didn’t\ncomplain.  We are even tolerant enough to like your books and admire\nyour artistry, EVEN when we think what you’re proposing is wrong and\nperhaps evil (a world of all women.  Communitarian worldwide\nsocieties.)  We understand the difference between ideas and those who\nhave them.\nIt’s harder for you.  Politics is your religion.\nUp till now given a limited output, already pre-vetted, it was easy for\nyou to freeze out anyone who outraged you.  But indie has opened the\nsluice gates.  You might (for all I know.  Again, when a community is\nexcluded, it goes underground) be a majority in sf writers now for all I\nknow.  I GUARANTEE you’re a tiny minority in the population.  Now that\nthe gates have opened and anyone can write SF and sell well and be\nadmired, it probably won’t be long before you’re a minority in sf/f\nwriting.\nHowever, I URGE you to come to terms as soon as possible.\nI have to say that I don’t think Sarah’s warning is going to make any difference at all.  As a result of my campaign for SFWA president, I have spent the last two months in the bowels of the SFWA forums. What I have seen is that the writers who make up the SF/F community are, to an almost unbelievable extent, delusional.  They genuinely believe they are faster when they have been winning races because a vast quantity of other runners have been barred from even lining up in the blocks to run against them.  They genuinely believe that they are special beings with a superior morality, and at the same time, assert that their ideological views are shared by all the decent members of civil society. And they are very nasty pieces of work, bitter from their long experience of social exclusion and their lowly positions on the socio-sexual totem pole.  They are full of hatred themselves, which is why they see hate in even the most genuine and harmless differences of opinion.\nMost of all, they have no ability to conceive of the mere possibility of separating the personal from the political. They attempt to destroy those who disagree with them or cause them to suffer embarrassment; recall that McRapey’s charity campaign wasn’t an attempt to stop me from trolling his blog or to advance any racist, sexist, or homophobic causes, it was to try to stop me from simply mentioning him because\nI dared to directly quote him\nand taunt him for his eminently tauntable words. I did nothing more than do to him what he prides himself on doing to others; you all know what resulted from that.\nNearly two decades ago, a member of the SFWA told me that the battles within science fiction were so bitter because the stakes were so small. But I think he was wrong. It’s more than that. The battles are so bitter because SF/F is largely comprised of gamma males and unattractive women who are very bitter people.  They are openly bitter about their lots in life. They are deeply angry with the world as they have experienced it. The books they write, for the most part, are their wish fulfillment fantasies, places where they finally have the chance to say what they didn’t have the wit to say when it mattered and be the people they couldn’t manage to become in real life. This is why, despite being technically more proficient in some ways, their work is so observably inferior to the science fiction and fantasy of earlier ages that concerned itself with ideas of more grandeur and societal import than the retro-adolescent daydreams of socio-sexually unsuccessful former junior high school students.\nI commend Sarah for her graciousness in attempting to warn those who have repeatedly done their best to professionally shun her and undermine her career. But I can tell her that it will not work; I attempted to do something similar in my current campaign for SFWA President. But my warnings about the coming collapse of the traditional professional publishing business of SF/F – which you will note preceded the failure of Night Shade Books – was met with little more than the usual sneers and rabbits shrieking “not-rabbit, not-rabbit”!\nSo leave them to their fate.  Let the rabbits panic as books prices continue to decline, their royalties continue to fall and their publishers stop paying advances before finally going the way of Borders and Night Shade Books. Let them learn if they are able to compete on a playing field that is not heavily tilted in their favor by like-minded ideologues. Let the obese, unhealthy moral degenerates struggle to pay for the increased costs of their health care under the Obamacare regime for which they clamored.\nIt’s not our fault. It’s not our concern. And it’s not our problem. The gatekeepers are failing, the gates are swinging open, and the right-wing horde is rapidly approaching the citadel. It won’t be long before the sneering writers of SF/F cease their endless snarking and start crying out for mercy.\nAt that point, it will fall to us, we established writers of the right who have somehow managed to surmount every obstacle and survive every stone and missile hurled our way throughout what passes for our literary careers, to remind them that it was their decision to declare “no quarter”. We didn’t make the rules, we are merely playing by the ones they established.  I won’t take any pleasure in their suffering, but neither will I shed any tears.\nI’ve put a list of standout authors on the right sidebar.  Authors like Sarah and Orson Scott Card, genre writers who have been willing, in some manner of speaking, to stand up against the fascists of science fiction and tell them, no, you don’t own science fiction, you don’t own fantasy, you are interlopers and intellectual parasites, and you have polluted the very literature you claimed to love.  I encourage those fans of the genre who are of the right themselves to support those writers who don’t insult you, who don’t despise you, who don’t hate you for your religious faith or your political beliefs.\nGive their books a shot. You won’t like all of them.  I don’t myself.  I will still read China Mieville although he is a Communist lunatic and adore Umberto Eco’s work despite the incoherence of his left-leaning humanism.  But to the extent that I can utilize whatever influence has been granted to me by those who choose to read this blog and support my writing, I will use it to assist those who stand up for Western civilization and human liberty, rather than those who, intentionally or unintentionally, are seeking to destroy it.\nMake no mistake.  The John Scalzis of the science fiction world desperately want to see Western civilization destroyed. They despise it and the conceptual aspects of their work largely consists of their dreams of its demise. But what they fail to realize is that the end of all the things they hate, the end of racism, sexism, morality, religion, and inequality, requires nothing less than the end of humanity itself, and that the end of Western civilization will not be the sexy secular scientopia of their dreams, but a two thousand-year relapse into depravity and pagan darkness.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-14T07:40:00+00:00"
}