{
  "url": "https://voxday.net/2013/04/12/the-perpetual-motion-money-machine/",
  "scraped_at": "2025-12-14T22:25:39.371011",
  "title": "The perpetual motion money machine",
  "date_display": "April 12, 2013",
  "date_iso": "2013-04-12T07:50:00+00:00",
  "date_from_url": "2013-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As she is one-half of the Reinhart-Roghoff team that has done some excellent work concerning why what Alan Greenspan once called the New Economy was not, in fact, anything new or different, I’m always interested in what Carmen Reinhart has to say.  I don’t necessarily agree with her on policy prescriptions, but her diagnostic take is usually insightful. She was <a href=\"http://www.spiegel.de/international/business/interview-with-harvard-economist-carmen-reinhart-on-financial-repression-a-893213.html\">interviewed by Der Spiegel</a> last week:</p><blockquote class=\"tr_bq\"><p> <b>SPIEGEL:</b> Ms. Reinhart, central banks around the world are<br> flooding the markets with cheap money in order to spur economies and<br> support governments. Are these institutions losing their independence?<br> <b>Reinhart:</b> No central bank will admit it is keeping rates low to<br> help governments out of their debt crises. But in fact they are bending<br> over backwards to help governments to finance their deficits. This is<br> nothing new in history. After World War II, there was a long phase in<br> which central banks were subservient to governments. It has only been<br> since the 1970s that they have become politically more independent. The<br> pendulum seems to be swinging back as a result of the financial crisis. <br> <b>SPIEGEL:</b> Is that true of the European Central Bank as well?<br> <b>Reinhart:</b> Less than for other central banks, but yes. And the crisis isn’t over yet — not in the United States and not in Europe. <br> <b>SPIEGEL:</b> But the danger of such a central bank policy is already well known: It can lead to high inflation. <br> <b>Reinhart:</b> True. But it is certainly more difficult for a central<br> banker to raise interest rates with a debt to gross domestic product<br> ratio of over 100 percent than it is when this ratio stands at 39<br> percent. Therefore, I believe the shift towards less independence of<br> monetary policy is not just a temporary change.<br> <b>SPIEGEL:</b> As a historian who knows the potential long-term<br> consequences very well, doesn’t such short-sighted decision-making<br> frighten you? <br> <b>Reinhart:</b> I am not opposing this change, I am just stating it.<br> You have to deal with the debt overhang one way or the other because the<br> high debt levels are an impediment to growth, they paralyze the<br> financial system and the credit process. One way to cope with this is to<br> write off part of the debt.<br> <b>SPIEGEL:</b> You mean some kind of haircut?<br> <b>Reinhart:</b> Yes. But we are in an environment where politicians are very reluctant to do write-offs. So what happens is that <a class=\"spTextlinkInt\" href=\"http://www.spiegel.de/international/europe/how-central-banks-are-threatening-the-savings-of-normal-germans-a-860021.html\" title=\"money is transferred from savers to borrowers\">money is transferred from savers to borrowers</a> via negative interest rates.<br> <b>SPIEGEL:</b> In other words: When the inflation rate is higher than<br> the interest rates paid on the markets, the debts shrink as if by magic.<br> The downside, though, is that this applies to the savings of normal<br> people. <br> <b>Reinhart:</b> The technical term for this is financial repression.<br> After World War II, all countries that had a big debt overhang relied on<br> financial repression to avoid an explicit default. After the war,<br> governments imposed interest rate ceilings for government bonds.<br> Nowadays they have more sophisticated means.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>The dangerous phase of the crisis that we have now entered is that even mainstream economists who understand the debt-related nature of the problem – and recall that back in 2008-2009, the only people who recognized that it was based on debt were outsiders like Steve Keen and me – are still supporting, however unenthusiastically, the attempt of the central banks to inflate their way out of the problem, even though some of them know it isn’t going to work.</p><p>Why? Because they are desperate.  They know that the alternative is either default and a short but savage depression that will absolutely ruin most of the world’s wealthy and powerful or the collapse of the global financial system and quite likely a fair amount of the various political structures as well. So, they are hoping against hope that the central banks will be successful in inflating their way out, but if one looks at the debt statistics, it is perfectly clear that the strategy is failing because debt/GDP is still growing.</p><p>“In the EU-27 the government debt-to-GDP ratio increased from 80.0 % at<br> the end of 2010 to 82.5 % at the end of 2011, and in the euro area from<br> 85.4 % to 87.3 %…. In the EU-27, total government revenue in 2011 amounted to 44.7 % of GDP<br> (up from 44.1 % of GDP in 2010), and expenditure to 49.1 % of GDP (down<br> from 50.6 % in 2010).”</br></br></br></br></p><p>That’s the savage austerity of which the European Keynesians are complaining. Tax revenues are up 0.6 percent and government spending is down 1.5 percent, but the debt/GDP went up 2.5 percent anyhow.  This is why default, and the concomitant deflation, is inevitable, no matter how much the financial powers-that-be are desperately fighting it off.</p><p>The situation is even worse in the USA and Japan, where the government debt/GDP ratios have risen to 103 percent and 230 percent.  And while we don’t know when the financial engine, increasingly clogged with debt, is going to seize up, we can be certain that sooner or later it will.  It is very unlikely that either Europe or the USA are going to be given more than 20 years to muddle along and continue piling on the debt in the manner that Japan has.</p></div>",
  "content_text": "As she is one-half of the Reinhart-Roghoff team that has done some excellent work concerning why what Alan Greenspan once called the New Economy was not, in fact, anything new or different, I’m always interested in what Carmen Reinhart has to say.  I don’t necessarily agree with her on policy prescriptions, but her diagnostic take is usually insightful. She was\ninterviewed by Der Spiegel\nlast week:\nSPIEGEL:\nMs. Reinhart, central banks around the world are\nflooding the markets with cheap money in order to spur economies and\nsupport governments. Are these institutions losing their independence?\nReinhart:\nNo central bank will admit it is keeping rates low to\nhelp governments out of their debt crises. But in fact they are bending\nover backwards to help governments to finance their deficits. This is\nnothing new in history. After World War II, there was a long phase in\nwhich central banks were subservient to governments. It has only been\nsince the 1970s that they have become politically more independent. The\npendulum seems to be swinging back as a result of the financial crisis.\nSPIEGEL:\nIs that true of the European Central Bank as well?\nReinhart:\nLess than for other central banks, but yes. And the crisis isn’t over yet — not in the United States and not in Europe.\nSPIEGEL:\nBut the danger of such a central bank policy is already well known: It can lead to high inflation.\nReinhart:\nTrue. But it is certainly more difficult for a central\nbanker to raise interest rates with a debt to gross domestic product\nratio of over 100 percent than it is when this ratio stands at 39\npercent. Therefore, I believe the shift towards less independence of\nmonetary policy is not just a temporary change.\nSPIEGEL:\nAs a historian who knows the potential long-term\nconsequences very well, doesn’t such short-sighted decision-making\nfrighten you?\nReinhart:\nI am not opposing this change, I am just stating it.\nYou have to deal with the debt overhang one way or the other because the\nhigh debt levels are an impediment to growth, they paralyze the\nfinancial system and the credit process. One way to cope with this is to\nwrite off part of the debt.\nSPIEGEL:\nYou mean some kind of haircut?\nReinhart:\nYes. But we are in an environment where politicians are very reluctant to do write-offs. So what happens is that\nmoney is transferred from savers to borrowers\nvia negative interest rates.\nSPIEGEL:\nIn other words: When the inflation rate is higher than\nthe interest rates paid on the markets, the debts shrink as if by magic.\nThe downside, though, is that this applies to the savings of normal\npeople.\nReinhart:\nThe technical term for this is financial repression.\nAfter World War II, all countries that had a big debt overhang relied on\nfinancial repression to avoid an explicit default. After the war,\ngovernments imposed interest rate ceilings for government bonds.\nNowadays they have more sophisticated means.\nThe dangerous phase of the crisis that we have now entered is that even mainstream economists who understand the debt-related nature of the problem – and recall that back in 2008-2009, the only people who recognized that it was based on debt were outsiders like Steve Keen and me – are still supporting, however unenthusiastically, the attempt of the central banks to inflate their way out of the problem, even though some of them know it isn’t going to work.\nWhy? Because they are desperate.  They know that the alternative is either default and a short but savage depression that will absolutely ruin most of the world’s wealthy and powerful or the collapse of the global financial system and quite likely a fair amount of the various political structures as well. So, they are hoping against hope that the central banks will be successful in inflating their way out, but if one looks at the debt statistics, it is perfectly clear that the strategy is failing because debt/GDP is still growing.\n“In the EU-27 the government debt-to-GDP ratio increased from 80.0 % at\nthe end of 2010 to 82.5 % at the end of 2011, and in the euro area from\n85.4 % to 87.3 %…. In the EU-27, total government revenue in 2011 amounted to 44.7 % of GDP\n(up from 44.1 % of GDP in 2010), and expenditure to 49.1 % of GDP (down\nfrom 50.6 % in 2010).”\nThat’s the savage austerity of which the European Keynesians are complaining. Tax revenues are up 0.6 percent and government spending is down 1.5 percent, but the debt/GDP went up 2.5 percent anyhow.  This is why default, and the concomitant deflation, is inevitable, no matter how much the financial powers-that-be are desperately fighting it off.\nThe situation is even worse in the USA and Japan, where the government debt/GDP ratios have risen to 103 percent and 230 percent.  And while we don’t know when the financial engine, increasingly clogged with debt, is going to seize up, we can be certain that sooner or later it will.  It is very unlikely that either Europe or the USA are going to be given more than 20 years to muddle along and continue piling on the debt in the manner that Japan has.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-12T06:50:00+00:00"
}