{
  "url": "https://voxday.net/2013/04/27/the-business-of-progressive-science/",
  "scraped_at": "2025-12-14T22:27:14.058019",
  "title": "The business of progressive science",
  "date_display": "April 27, 2013",
  "date_iso": "2013-04-27T17:30:00+00:00",
  "date_from_url": "2013-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Left is forever attempting to cloak its evil lunacies in the veil of scientific authority.  It has been doing so since Marx first claimed his socialism was “scientific”. That is why they so ferociously defend St. Darwin and his holy theorum, why they try to portray political opposition as mental illness, and why, in the end, so many of the scientific studies to which they point <a href=\"http://www.nytimes.com/2013/04/28/magazine/diederik-stapels-audacious-academic-fraud.html?pagewanted=1&amp;_r=0&amp;hp\">turn out to be pure fabrications</a>.</p><blockquote class=\"tr_bq\"><p> Stapel was an academic star in the Netherlands and abroad, the author of<br> several well-regarded studies on human attitudes and behavior. That<br> spring, he published a widely publicized study in Science about an<br> experiment done at the Utrecht train station showing that a trash-filled<br> environment tended to bring out racist tendencies in individuals. And<br> just days earlier, he received more media attention for a study<br> indicating that eating meat made people selfish and less social….</br></br></br></br></br></br></p><div itemprop=\"articleBody\"> Stapel’s fraud may shine a spotlight on dishonesty in science, but<br> scientific fraud is hardly new. The rogues’ gallery of academic liars<br> and cheats features scientific celebrities who have enjoyed similar<br> prominence. The once-celebrated South Korean stem-cell researcher Hwang<br> Woo Suk stunned scientists in his field a few years ago after it was<br> discovered that almost all of the work for which he was known was<br> fraudulent. The prominent Harvard evolutionary biologist Marc Hauser<br> resigned in 2011 during an investigation by the Office of Research<br> Integrity at the Department of Health and Human Services that would end<br> up determining that some of his papers contained fabricated data. </br></br></br></br></br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> Every year, the Office of Research Integrity uncovers numerous<br> instances­ of bad behavior by scientists, ranging from lying on grant<br> applications to using fake images in publications. A <a href=\"http://retractionwatch.wordpress.com/\">blog called Retraction Watch</a><br> publishes a steady stream of posts about papers being retracted by<br> journals because of allegations or evidence of misconduct. </br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> Each case of research fraud that’s uncovered triggers a similar response<br> from scientists. First disbelief, then anger, then a tendency to<br> dismiss the perpetrator as one rotten egg in an otherwise-honest<br> enterprise. But the scientific misconduct that has come to light in<br> recent years suggests at the very least that the number of bad actors in<br> science isn’t as insignificant as many would like to believe. And<br> considered from a more cynical point of view, figures like Hwang and<br> Hauser are not outliers so much as one end on a continuum of dishonest<br> behaviors that extend from the cherry-picking of data to fit a chosen<br> hypothesis — which many researchers admit is commonplace — to outright<br> fabrication. Still, the nature and scale of Stapel’s fraud sets him<br> apart from most other cheating academics. “The extent to which I did it,<br> the longevity of it, makes it extreme,” he told me. “Because it is not<br> one paper or 10 but many more.” </br></br></br></br></br></br></br></br></br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> On a Sunday morning, as we drove to a village near Maastricht to see his<br> parents, Stapel reflected on why his behavior had sparked such outrage<br> in the Netherlands. “People think of scientists as monks in a monastery<br> looking out for the truth,” he said. “People have lost faith in the<br> church, but they haven’t lost faith in science. My behavior shows that<br> science is not holy.”</br></br></br></br></br></div><p> What the public didn’t realize, he said, was that academic science, too, was becoming a business.</p></blockquote><div itemprop=\"articleBody\"> Science, particularly academic science, is now a big business, and it is an unusually corrupt one that is primarily dependent upon the media and government funding.  It has no practical external limitations upon it holding its businessmen accountable. As Stapel’s example demonstrates, there is absolutely nothing – nothing – reliable about it.  This point should be driven home every single time anyone makes the absurd claim that science is the best, or the only, arbiter of truth and reality.<p>Here is how bad the corruption is: Stapel was actually teaching a graduate seminar on research ethics. Notice too that all of the established academics who caught wind of the fraud not only looked the other way, but advised others to do so as well.</p></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> We have a word for real and genuine science that is reliable enough to be trustworthy.  Engineering.<p>“At the end of November, the universities unveiled their final report at a joint news conference: Stapel had committed fraud in at least 55 of his papers, as well as in 10 Ph.D. dissertations written by his students. The students were not culpable, even though their work was now tarnished. The field of psychology was indicted, too, with a finding that Stapel’s fraud went undetected for so long because of “a general culture of careless, selective and uncritical handling of research and data.” If Stapel was solely to blame for making stuff up, the report stated, his peers, journal editors and reviewers of the field’s top journals were to blame for letting him get away with it.”</p></div></div>",
  "content_text": "The Left is forever attempting to cloak its evil lunacies in the veil of scientific authority.  It has been doing so since Marx first claimed his socialism was “scientific”. That is why they so ferociously defend St. Darwin and his holy theorum, why they try to portray political opposition as mental illness, and why, in the end, so many of the scientific studies to which they point\nturn out to be pure fabrications\n.\nStapel was an academic star in the Netherlands and abroad, the author of\nseveral well-regarded studies on human attitudes and behavior. That\nspring, he published a widely publicized study in Science about an\nexperiment done at the Utrecht train station showing that a trash-filled\nenvironment tended to bring out racist tendencies in individuals. And\njust days earlier, he received more media attention for a study\nindicating that eating meat made people selfish and less social….\nStapel’s fraud may shine a spotlight on dishonesty in science, but\nscientific fraud is hardly new. The rogues’ gallery of academic liars\nand cheats features scientific celebrities who have enjoyed similar\nprominence. The once-celebrated South Korean stem-cell researcher Hwang\nWoo Suk stunned scientists in his field a few years ago after it was\ndiscovered that almost all of the work for which he was known was\nfraudulent. The prominent Harvard evolutionary biologist Marc Hauser\nresigned in 2011 during an investigation by the Office of Research\nIntegrity at the Department of Health and Human Services that would end\nup determining that some of his papers contained fabricated data.\nEvery year, the Office of Research Integrity uncovers numerous\ninstances­ of bad behavior by scientists, ranging from lying on grant\napplications to using fake images in publications. A\nblog called Retraction Watch\npublishes a steady stream of posts about papers being retracted by\njournals because of allegations or evidence of misconduct.\nEach case of research fraud that’s uncovered triggers a similar response\nfrom scientists. First disbelief, then anger, then a tendency to\ndismiss the perpetrator as one rotten egg in an otherwise-honest\nenterprise. But the scientific misconduct that has come to light in\nrecent years suggests at the very least that the number of bad actors in\nscience isn’t as insignificant as many would like to believe. And\nconsidered from a more cynical point of view, figures like Hwang and\nHauser are not outliers so much as one end on a continuum of dishonest\nbehaviors that extend from the cherry-picking of data to fit a chosen\nhypothesis — which many researchers admit is commonplace — to outright\nfabrication. Still, the nature and scale of Stapel’s fraud sets him\napart from most other cheating academics. “The extent to which I did it,\nthe longevity of it, makes it extreme,” he told me. “Because it is not\none paper or 10 but many more.”\nOn a Sunday morning, as we drove to a village near Maastricht to see his\nparents, Stapel reflected on why his behavior had sparked such outrage\nin the Netherlands. “People think of scientists as monks in a monastery\nlooking out for the truth,” he said. “People have lost faith in the\nchurch, but they haven’t lost faith in science. My behavior shows that\nscience is not holy.”\nWhat the public didn’t realize, he said, was that academic science, too, was becoming a business.\nScience, particularly academic science, is now a big business, and it is an unusually corrupt one that is primarily dependent upon the media and government funding.  It has no practical external limitations upon it holding its businessmen accountable. As Stapel’s example demonstrates, there is absolutely nothing – nothing – reliable about it.  This point should be driven home every single time anyone makes the absurd claim that science is the best, or the only, arbiter of truth and reality.\nHere is how bad the corruption is: Stapel was actually teaching a graduate seminar on research ethics. Notice too that all of the established academics who caught wind of the fraud not only looked the other way, but advised others to do so as well.\nWe have a word for real and genuine science that is reliable enough to be trustworthy.  Engineering.\n“At the end of November, the universities unveiled their final report at a joint news conference: Stapel had committed fraud in at least 55 of his papers, as well as in 10 Ph.D. dissertations written by his students. The students were not culpable, even though their work was now tarnished. The field of psychology was indicted, too, with a finding that Stapel’s fraud went undetected for so long because of “a general culture of careless, selective and uncritical handling of research and data.” If Stapel was solely to blame for making stuff up, the report stated, his peers, journal editors and reviewers of the field’s top journals were to blame for letting him get away with it.”",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-27T16:30:00+00:00"
}