{
  "url": "https://voxday.net/2013/04/11/the-cancer-in-sff-part-i/",
  "scraped_at": "2025-12-14T22:25:33.837823",
  "title": "The cancer in SF/F, part I",
  "date_display": "April 11, 2013",
  "date_iso": "2013-04-11T09:03:00+00:00",
  "date_from_url": "2013-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Adam Roberts asks <a href=\"http://www.guardian.co.uk/books/2013/apr/08/adam-roberts-political-soul-sf\">who owns the political soul</a> of science fiction</p><blockquote class=\"tr_bq\"><p> I make no apologies for writing science <a href=\"http://www.guardian.co.uk/books/fiction\" title=\"More from guardian.co.uk on Fiction\">fiction</a>.<br> I love the genre with a deep and geeky love. Becoming professor of<br> 19th-century literature at the University of London has done nothing to<br> diminish my capacity for that mode of enthusiasm that fans call “squee”.</br></br></br></p><p>Being<br> a literature professor means, in effect, the government pays me to read<br> books; and, taking my job seriously, I read a lot, in and out of genre.<br> I think the novel is most alive today as a literature of the fantastic:<br> at their worst, SF, fantasy and magic realist novels can be very bad;<br> while at their best, they’re by far the most exciting kinds of writing<br> being published.</br></br></br></br></br></br></p><p>But here’s the thing: my genre divides<br> politically in a manner unlike others. Writers of historical or crime<br> fiction might be rightwing or leftwing, but few would attempt to define<br> those genres as intrinsically left- or right-leaning. SF is different:<br> the genre defines itself according to two diametrically opposed<br> ideological stances.</br></br></br></br></br></p></blockquote><p>Roberts didn’t have to tell us which side he is on: his use of the word “squee” was all that was necessary to let us know that he was of the enscalzied left wing of science fiction.  But his question is more interesting than it might first appear, because although the answer is obvious to anyone who has paid even a modicum of attention to the world of professional, published science fiction over the last 20 years, there is more to it than simply looking at who is getting published, who is winning awards, and who has been running SFWA for the last decade.</p><p>There is no question who presently owns what would be best termed “the trappings” of science fiction.  It is the scalzied manboobs, the cisgendered queers, the obese cat collectors, the Red Diaper socialists, the female imperativists, and the professional race whiners who presently dominate science fiction, not because they have more talent to offer than those on the right, but due to a) science fiction’s longtime affiliation with the secular humanist, sciencistic left and b) the long march through the publishing institutions that has gradually and methodically gone about excluding every editor and author even remotely suspected of harboring views that have been, or may be, deemed ideologically undesirable.</p><p>The long march isn’t the product of my imagination. I first became aware of it when Pocket Books, to their credit, thought it would be a good idea to assign an editor who had at least a modicum of religious awareness to my Eternal Warriors novels, but couldn’t find a single religious individual in house.  They finally had to hire an external editor, a Jewish woman, because the organization’s collective theological knowledge amounted to zero.</p><p>So much for the heirs of the Western intellectual tradition; the reviewer at <i>Black Gate</i> who reviewed <i>Summa Elvetica</i> genuinely believed that the argument presented therein was a real one written by Thomas Aquinas.  However, having read the <i>Summa Theologica</i>, I can assure everyone that while the Angelic Doctor contemplated many issues, the question of whether elves have souls naturally united to them or not was not one of them.</p><p>One need only look at the increasingly mediocre works that have been nominated for, and in some cases even won, science fiction’s highest prizes to realize that the genre is dominated by the ideological left and is in severe decline from both the literary and revenue perspectives.  When <a href=\"http://www.publishersweekly.com/pw/by-topic/industry-news/bookselling/article/55458-big-names-dominated-bestsellers-in-2012.html\">six of the top 10-selling SF books in 2012</a> are either ripped off from an Xbox game or were first published more than a decade ago, it shouldn’t be difficult to observe that there is a very serious problem with the science fiction that is presently being published.</p><p>Now, some will wish to dismiss my observations as the embittered rantings of a fourth-rate fantasy author, even though the sales of one of my books, at around 41,000, would have put me at number three on the 2012 list of bestsellers.  But even if one dismisses me, the problem is that I am far from the only former <i>Asimov </i>and <i>Analog</i> subscriber who no longer bothers to even pirate, let alone buy, <i>The Year’s Best Science Fiction</i> collections because so little of it is worth reading anymore. As an SFWA member, I have a vote for the Nebula, but at least in the case of the Best Novel category, there is simply nothing for which one can credibly vote.</p><p>It is simply impossible to call any of the novels presently up for this year’s Nebula or Hugo the best novel in SF/F with a straight face. And if one of them truly does merit the description, then the genre is in even worse shape than I have observed.  It should not be controversial to suggest that it is highly unlikely that anyone from this year’s class will one day be named a Grandmaster of Science Fiction.</p><p>CS Lewis, JRR Tolkien, HP Lovecraft, Robert E. Howard, and Robert Heinlein could not get published in today’s SF/F publishing environment, which has ironically turned Harlan Ellison’s concept of SF being a place for “dangerous visions” on its head. The fact that the Guardian chose to head the linked article with a picture of Iain M. Banks was particularly apt, as science fiction is today in much the same position as the unfortunate Scottish author, who recently announced that he was terminal with a cancer that had developed unbeknownst to him. (One has to respect his mordant wit; in response to the bad news he asked his longtime girlfriend if she would do him the honor of becoming his widow.) Science fiction is not only terminal, its professional community is still largely ignorant of that readily observable fact.</p><p>Science fiction is dying because it has been invaded by a parasitical and hostile ideology that has metastasized and spread throughout the genre. This ideology is opposed to science because science is weakening the assumptions on which it is founded. It is opposed to heroism because heroism is intrinsically anti-egalitarian. It is opposed to masculinity because its adherents are women and feminized gamma males. It is opposed to Western civilization because Western civilization is Christian.  It is opposed to free discourse because free discourse reveals its many incoherencies, contradictions, and complete flights of fantasy.</p><p>Roberts’s summary of the difference between left and right is accurate, but incomplete: “Heinlein’s imagined interstellar future is an environment designed to<br> valorise the skill sets (self-reliance, engineering competence,<br> willpower, bravery and manliness) that Heinlein prized. Left-leaning<br> Iain M Banks’s Culture novels posit a high-tech geek utopia in which the<br> particular skill sets, ethics and wit‑discourse of SF nerds turn out to<br> be the gold standard of pan-galactic multi-species civilisation.”</br></br></br></br></br></p><p>But it is more than that. Roberts omits to mention that feminism, equalitarianism, cultural relativism, massive central government, unrestrained sexual adventurism, and ideological strawmen are de rigueur for the science fiction of the left.  And that is when it is more than simple romance novels in space or rewritten Regency romances with a modest sprinkling of magic.</p><p>The fact that Roberts considers the genre’s greatest writers to be “Ursula K Le Guin, Octavia Butler, James Tiptree Jr, Margaret Atwood, Karen Joy Fowler, Pat Cadigan, Justina Robson” shows that he is speaking only of the genre’s left and also suffices to show the inferiority of the works produced by that side of the genre. With the exception of Le Guin and Sheldon, no science fiction fan would trade a single Herbert or Heinlein novel for the complete collected works of all the others… well, perhaps some of the later Heinleins.</p><p>The fate that awaits the world of professional published science fiction is that which ultimately befell the art of Socialist Realism. Because it is imposed by a small, centralized group that happened to seize the relevant power, it will collapse and fade away once the group’s power ceases to be relevant.  As it so often does, economic and technological changes have eroded the power of the gatekeeper’s, which is why we can watch the collapse of Nightshade Books and anticipate the coming closure of other publishers and imprints which are infested with the ideological cancer.</p><p>SF/F’s left-wing gatekeepers made the same error that the ABCNNBCBS cabal made when instead of simply reporting the nation’s news, it attempted to turn itself into the propaganda wing of the Democratic Party. But there will be no singular Fox News prison-raping its competitors in the case of SF/F, instead, there will be Glenn Reynold’s army of a thousand Davids, with successful independent authors like <a href=\"http://larrycorreia.wordpress.com/\">Larry Correia</a> and <a href=\"http://www.munchkinwrangler.com/\">Marko Kloos</a> demonstrating to every other writer deemed politically incorrect and/or unpublishable by the gatekeepers that the gates have been torn down. They no longer exist.</p><p>More on why the ongoing collapse of the gatekeepers is not reason for despair, but promises to be very good news for fans of traditional SF/F in part II.</p></div>",
  "content_text": "Adam Roberts asks\nwho owns the political soul\nof science fiction\nI make no apologies for writing science\nfiction\n.\nI love the genre with a deep and geeky love. Becoming professor of\n19th-century literature at the University of London has done nothing to\ndiminish my capacity for that mode of enthusiasm that fans call “squee”.\nBeing\na literature professor means, in effect, the government pays me to read\nbooks; and, taking my job seriously, I read a lot, in and out of genre.\nI think the novel is most alive today as a literature of the fantastic:\nat their worst, SF, fantasy and magic realist novels can be very bad;\nwhile at their best, they’re by far the most exciting kinds of writing\nbeing published.\nBut here’s the thing: my genre divides\npolitically in a manner unlike others. Writers of historical or crime\nfiction might be rightwing or leftwing, but few would attempt to define\nthose genres as intrinsically left- or right-leaning. SF is different:\nthe genre defines itself according to two diametrically opposed\nideological stances.\nRoberts didn’t have to tell us which side he is on: his use of the word “squee” was all that was necessary to let us know that he was of the enscalzied left wing of science fiction.  But his question is more interesting than it might first appear, because although the answer is obvious to anyone who has paid even a modicum of attention to the world of professional, published science fiction over the last 20 years, there is more to it than simply looking at who is getting published, who is winning awards, and who has been running SFWA for the last decade.\nThere is no question who presently owns what would be best termed “the trappings” of science fiction.  It is the scalzied manboobs, the cisgendered queers, the obese cat collectors, the Red Diaper socialists, the female imperativists, and the professional race whiners who presently dominate science fiction, not because they have more talent to offer than those on the right, but due to a) science fiction’s longtime affiliation with the secular humanist, sciencistic left and b) the long march through the publishing institutions that has gradually and methodically gone about excluding every editor and author even remotely suspected of harboring views that have been, or may be, deemed ideologically undesirable.\nThe long march isn’t the product of my imagination. I first became aware of it when Pocket Books, to their credit, thought it would be a good idea to assign an editor who had at least a modicum of religious awareness to my Eternal Warriors novels, but couldn’t find a single religious individual in house.  They finally had to hire an external editor, a Jewish woman, because the organization’s collective theological knowledge amounted to zero.\nSo much for the heirs of the Western intellectual tradition; the reviewer at\nBlack Gate\nwho reviewed\nSumma Elvetica\ngenuinely believed that the argument presented therein was a real one written by Thomas Aquinas.  However, having read the\nSumma Theologica\n, I can assure everyone that while the Angelic Doctor contemplated many issues, the question of whether elves have souls naturally united to them or not was not one of them.\nOne need only look at the increasingly mediocre works that have been nominated for, and in some cases even won, science fiction’s highest prizes to realize that the genre is dominated by the ideological left and is in severe decline from both the literary and revenue perspectives.  When\nsix of the top 10-selling SF books in 2012\nare either ripped off from an Xbox game or were first published more than a decade ago, it shouldn’t be difficult to observe that there is a very serious problem with the science fiction that is presently being published.\nNow, some will wish to dismiss my observations as the embittered rantings of a fourth-rate fantasy author, even though the sales of one of my books, at around 41,000, would have put me at number three on the 2012 list of bestsellers.  But even if one dismisses me, the problem is that I am far from the only former\nAsimov\nand\nAnalog\nsubscriber who no longer bothers to even pirate, let alone buy,\nThe Year’s Best Science Fiction\ncollections because so little of it is worth reading anymore. As an SFWA member, I have a vote for the Nebula, but at least in the case of the Best Novel category, there is simply nothing for which one can credibly vote.\nIt is simply impossible to call any of the novels presently up for this year’s Nebula or Hugo the best novel in SF/F with a straight face. And if one of them truly does merit the description, then the genre is in even worse shape than I have observed.  It should not be controversial to suggest that it is highly unlikely that anyone from this year’s class will one day be named a Grandmaster of Science Fiction.\nCS Lewis, JRR Tolkien, HP Lovecraft, Robert E. Howard, and Robert Heinlein could not get published in today’s SF/F publishing environment, which has ironically turned Harlan Ellison’s concept of SF being a place for “dangerous visions” on its head. The fact that the Guardian chose to head the linked article with a picture of Iain M. Banks was particularly apt, as science fiction is today in much the same position as the unfortunate Scottish author, who recently announced that he was terminal with a cancer that had developed unbeknownst to him. (One has to respect his mordant wit; in response to the bad news he asked his longtime girlfriend if she would do him the honor of becoming his widow.) Science fiction is not only terminal, its professional community is still largely ignorant of that readily observable fact.\nScience fiction is dying because it has been invaded by a parasitical and hostile ideology that has metastasized and spread throughout the genre. This ideology is opposed to science because science is weakening the assumptions on which it is founded. It is opposed to heroism because heroism is intrinsically anti-egalitarian. It is opposed to masculinity because its adherents are women and feminized gamma males. It is opposed to Western civilization because Western civilization is Christian.  It is opposed to free discourse because free discourse reveals its many incoherencies, contradictions, and complete flights of fantasy.\nRoberts’s summary of the difference between left and right is accurate, but incomplete: “Heinlein’s imagined interstellar future is an environment designed to\nvalorise the skill sets (self-reliance, engineering competence,\nwillpower, bravery and manliness) that Heinlein prized. Left-leaning\nIain M Banks’s Culture novels posit a high-tech geek utopia in which the\nparticular skill sets, ethics and wit‑discourse of SF nerds turn out to\nbe the gold standard of pan-galactic multi-species civilisation.”\nBut it is more than that. Roberts omits to mention that feminism, equalitarianism, cultural relativism, massive central government, unrestrained sexual adventurism, and ideological strawmen are de rigueur for the science fiction of the left.  And that is when it is more than simple romance novels in space or rewritten Regency romances with a modest sprinkling of magic.\nThe fact that Roberts considers the genre’s greatest writers to be “Ursula K Le Guin, Octavia Butler, James Tiptree Jr, Margaret Atwood, Karen Joy Fowler, Pat Cadigan, Justina Robson” shows that he is speaking only of the genre’s left and also suffices to show the inferiority of the works produced by that side of the genre. With the exception of Le Guin and Sheldon, no science fiction fan would trade a single Herbert or Heinlein novel for the complete collected works of all the others… well, perhaps some of the later Heinleins.\nThe fate that awaits the world of professional published science fiction is that which ultimately befell the art of Socialist Realism. Because it is imposed by a small, centralized group that happened to seize the relevant power, it will collapse and fade away once the group’s power ceases to be relevant.  As it so often does, economic and technological changes have eroded the power of the gatekeeper’s, which is why we can watch the collapse of Nightshade Books and anticipate the coming closure of other publishers and imprints which are infested with the ideological cancer.\nSF/F’s left-wing gatekeepers made the same error that the ABCNNBCBS cabal made when instead of simply reporting the nation’s news, it attempted to turn itself into the propaganda wing of the Democratic Party. But there will be no singular Fox News prison-raping its competitors in the case of SF/F, instead, there will be Glenn Reynold’s army of a thousand Davids, with successful independent authors like\nLarry Correia\nand\nMarko Kloos\ndemonstrating to every other writer deemed politically incorrect and/or unpublishable by the gatekeepers that the gates have been torn down. They no longer exist.\nMore on why the ongoing collapse of the gatekeepers is not reason for despair, but promises to be very good news for fans of traditional SF/F in part II.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-11T08:03:00+00:00"
}