{
  "url": "https://voxday.net/2013/04/19/the-black-vs-brown-wars/",
  "scraped_at": "2025-12-14T22:26:20.605169",
  "title": "The black vs brown wars",
  "date_display": "April 19, 2013",
  "date_iso": "2013-04-19T08:25:00+00:00",
  "date_from_url": "2013-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not too hard to understand why the Hispanic gangs have methodically gone about <a href=\"http://articles.latimes.com/2013/jan/25/local/la-me-0126-compton-20130126\">ethnically cleansing former black neighborhoods such as Compton</a> for the last 20 years. They have no more desire to live in the vicinity of Africans than white progressives like John Scalzi do, but since most Hispanics can’t afford to buy property in lily-white counties, they have to go to the work of forcibly undoing years of government-sponsored desegregation. And <a href=\"http://newyork.cbslocal.com/2013/04/18/2-female-students-kicked-punched-bloodied-bruised-in-wild-queens-melee/\">this sort of racial violence</a> no doubt provides them with their ruthless determination to not live among blacks.</p><blockquote class=\"tr_bq\"><p> Two eighth grade students are now recovering from a terrifying attack in Queens…. The honor student said she was badly beaten while trying to defend her friend Christina Campos, who was getting punched and kicked by more than a dozen high school students.</p><p>“About seven to 10 girls just started grabbing me and held my hands and just started kicking me in the face,” Gonzalez told CBS 2′s Hazel Sanchez. “They threw cones at me. They hit us with belt buckles, with Timberlands, umbrellas, guys kicking us — like guys, really?”</p><p>The attackers could be seen stomping on Christina Campos’ body and head. Campos said the same group of high school-aged girls jumped her the day before and warned her they’d be back for more. This time boys were throwing punches, too. Campos’ face was bloodied and bruised.</p><p>“They came out of nowhere with so many people,” Campos said.</p><p>“I was scared. I didn’t know what was going to happen to me. Was I going to live after this or was I going to be beat to death?” Gonzalez said.</p><p>Gonzalez was left with two black eyes and a broken nose. She said no bystanders stepped in to help her or her friends. Most, she said, just watched or recorded the brawl.</p></blockquote><p>Educated African-Americans who have never laid a finger on anyone in anger and would never dream of resorting to violence understandably get distressed and offended when this sort of black group violence is contemptuously described as “<a href=\"http://www.urbandictionary.com/define.php?term=Chimp%20Out\">chimping-out</a>“.  But the issue is not the label, however offensive some might find it to be.  It makes no difference if such behavior is called “chimping-out”, “wilding”, or “youthful exuberance”, because the problem is that whatever one calls it, it is not behavior indicative of a people capable of maintaining, or even successfully co-existing in, a civilized society.  At the end of the day, most people are inclined to believe that whatever may you call it, if it quacks like a duck, it is, for all intents and purposes, a duck.</p><p>The problem facing the African community in the USA is three-fold, even if we agree to delicately avert our eyes from all the frightening and very politically incorrect implications of genetic science and human bio-diversity.  First, as the domestic economy worsens, it will be harder on those of African descent than everyone else since they are less likely to have financial and family reserves than other Americans.  Second, with their sky-high illegitimacy rates, low marriage rates, and 3/4 adult male/female ratio, they have very little family infrastructure to guide the intellectual and emotional development of their children. Third, the growing Hispanic population feels absolutely no shame over historical black slavery and is almost completely immune to the race card and the White Guilt upon which the African community has become so dependent.</p><p>Where whites stay their hands and suffer black barbarism out of a misguided sense of shame, browns simply react without hesitation or remorse. I note the percentage of the Queens population that is Hispanic is presently 6.4 points higher, at 27.5 percent, than it was <a href=\"http://socds.huduser.org/Census/race.odb?msacitylist=31100*0600015044*1.0&amp;metro=cbsa\">in Compton in 1980</a>.  Given the fact that there is already an amount of black vs brown racial conflict in Queens, we can probably expect the the African percentage of the population there to decline to less than 10 percent in the next ten years.</p><p>Both Compton and Queens are trivial in themselves, of course, but they are a microcosm of the larger conflict that is already playing out inside the United States, a sizable conflict concerning which white Americans are largely oblivious.</p></div>",
  "content_text": "It’s not too hard to understand why the Hispanic gangs have methodically gone about\nethnically cleansing former black neighborhoods such as Compton\nfor the last 20 years. They have no more desire to live in the vicinity of Africans than white progressives like John Scalzi do, but since most Hispanics can’t afford to buy property in lily-white counties, they have to go to the work of forcibly undoing years of government-sponsored desegregation. And\nthis sort of racial violence\nno doubt provides them with their ruthless determination to not live among blacks.\nTwo eighth grade students are now recovering from a terrifying attack in Queens…. The honor student said she was badly beaten while trying to defend her friend Christina Campos, who was getting punched and kicked by more than a dozen high school students.\n“About seven to 10 girls just started grabbing me and held my hands and just started kicking me in the face,” Gonzalez told CBS 2′s Hazel Sanchez. “They threw cones at me. They hit us with belt buckles, with Timberlands, umbrellas, guys kicking us — like guys, really?”\nThe attackers could be seen stomping on Christina Campos’ body and head. Campos said the same group of high school-aged girls jumped her the day before and warned her they’d be back for more. This time boys were throwing punches, too. Campos’ face was bloodied and bruised.\n“They came out of nowhere with so many people,” Campos said.\n“I was scared. I didn’t know what was going to happen to me. Was I going to live after this or was I going to be beat to death?” Gonzalez said.\nGonzalez was left with two black eyes and a broken nose. She said no bystanders stepped in to help her or her friends. Most, she said, just watched or recorded the brawl.\nEducated African-Americans who have never laid a finger on anyone in anger and would never dream of resorting to violence understandably get distressed and offended when this sort of black group violence is contemptuously described as “\nchimping-out\n“.  But the issue is not the label, however offensive some might find it to be.  It makes no difference if such behavior is called “chimping-out”, “wilding”, or “youthful exuberance”, because the problem is that whatever one calls it, it is not behavior indicative of a people capable of maintaining, or even successfully co-existing in, a civilized society.  At the end of the day, most people are inclined to believe that whatever may you call it, if it quacks like a duck, it is, for all intents and purposes, a duck.\nThe problem facing the African community in the USA is three-fold, even if we agree to delicately avert our eyes from all the frightening and very politically incorrect implications of genetic science and human bio-diversity.  First, as the domestic economy worsens, it will be harder on those of African descent than everyone else since they are less likely to have financial and family reserves than other Americans.  Second, with their sky-high illegitimacy rates, low marriage rates, and 3/4 adult male/female ratio, they have very little family infrastructure to guide the intellectual and emotional development of their children. Third, the growing Hispanic population feels absolutely no shame over historical black slavery and is almost completely immune to the race card and the White Guilt upon which the African community has become so dependent.\nWhere whites stay their hands and suffer black barbarism out of a misguided sense of shame, browns simply react without hesitation or remorse. I note the percentage of the Queens population that is Hispanic is presently 6.4 points higher, at 27.5 percent, than it was\nin Compton in 1980\n.  Given the fact that there is already an amount of black vs brown racial conflict in Queens, we can probably expect the the African percentage of the population there to decline to less than 10 percent in the next ten years.\nBoth Compton and Queens are trivial in themselves, of course, but they are a microcosm of the larger conflict that is already playing out inside the United States, a sizable conflict concerning which white Americans are largely oblivious.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-19T07:25:00+00:00"
}