{
  "url": "https://voxday.net/2013/04/28/the-mediocrity-of-female-sff-writers/",
  "scraped_at": "2025-12-14T22:27:17.728748",
  "title": "From SF/F to R(SF/F)",
  "date_display": "April 28, 2013",
  "date_iso": "2013-04-28T14:15:00+00:00",
  "date_from_url": "2013-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A female SF/F writer <a href=\"http://accordingtohoyt.com/2013/04/27/rats-in-their-heads/\">explains the mediocrity of the modern female SF/F writers</a>:</p><blockquote class=\"tr_bq\"><p> New York Publishing by definition has got the rat of Marxism in their<br> heads.  They always treated writers as widgets anyway.  Round the mid<br> seventies, early eighties they realized that they had more widgets with<br> outies than innies, and they decided to correct it the usual way.  “Buy<br> more women” the cry went out.  And in came not only a barrage of women<br> who had an easier time breaking in than men, but of women who were told<br> what kept them out had been discrimination.  And who, therefore, hated<br> the field they were getting into, because those meanies had kept them<br> out.  Out came an outpouring of “poor me female” writing.  Which in the<br> early nineties caused me to snarl at a Barnes &amp; Noble, “I wish<br> someone would pass a law forbidding women from writing.” After I’d<br> walked up and down a fantasy shelf and found NOT ONE novel that wasn’t<br> about some abused high-magic chick whose father was a monster.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Here we digress from writing in general to genre writing.  It will<br> shock you to realize that different genres appeal to different people,<br> right?  In general romance – by and far the blockbuster of genres –<br> appeals to women.  I know this shocks you, since women are not at all by<br> evolution designed for being fascinated with relationships.  This<br> doesn’t mean men don’t read it.  I know several men who read Romance<br> (and no, it has nothing to do with their orientation) but the<br> proportions are so grossly skewed that if you see someone in public with<br> a romance novel and can’t see what gender they are, you can take a safe<br> bet it’s a woman.  At the other end of this, military fiction is read<br> mostly by men.<br> Fiction is no different than anything else. If one artificially lowers the barriers to entry, one is going automatically to reduce the quality of entrants one accepts. When it was decided, presumably by female editors and executives, that an insufficient number of female authors were being published in the SF/F genre, many women were given publishing contracts primarily on the sole basis of their being better writers than other female wannabes.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p> Now, I disagree with Sarah in that I don’t believe the female writers who entered the genre hated the field or even necessarily wanted to change it much.  I think, to the contrary, that they loved fantasy and science fiction, they merely wanted to “improve” it and make it just a little bit more to their liking.  Hence the shifting focus from ideas, plots, and worldbuilding towards characters and relationships… and romance!</p><p><a href=\"http://www.maryrobinettekowal.com/wp-content/uploads/2013/03/Without-a-Summer-final-220x328.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.maryrobinettekowal.com/wp-content/uploads/2013/03/Without-a-Summer-final-220x328.jpg\" width=\"214\"/></a>This shifting focus didn’t have to be a bad thing. It wasn’t an intrinsic negative. There was certainly some room for considerable improvement with regards to characters, relationships, and style; one cannot read Asimov, Heinlein, Vance, or any of the lesser SF/F authors from the 1950s through the 1970s without being conscious of a certain clunkiness to the prose and a shallowness to the characters.</p><p>The problem was that in far too many cases, the ideas, plot, and worldbuilding aspects were simply thrown out, to such an extent that now, the average “fantasy” novel is little more than a thinly disguised romance novel. In many cases, the “SF/F” publishers aren’t even bothering to disguise it any longer. What is broadly described as “paranormal” fiction actually belongs to the romance genre, not the SF/F genre, as any reasonable examination of its tropes will swiftly reveal.  And the romantic transformation isn’t limited to the necro-bestial sub-genre of fantasy either. Consider the cover of Mary Robinette Kowal’s new novel, <i>Without A Summer</i>. Kowal is the current VP of SFWA. She’s nice, she’s talented, and she’s an award-winning writer. She was even nominated for the Best Novel Nebula in 2010.</p><p>What she isn’t is an SF/F writer.  She’s a romance writer. The marketing department at Tor Books clearly knows that. Both the Handsome Prince and the Pretty Princess with her bluebirds on the cover are straight out of Disney.  Giving a Nebula award to a book like this would be akin to giving Joe Abercrombie the Golden Tea Cosy or whatever award it is the RWA gives out because one of his mentally unstable killers happens to tenderly rape a female captive during a momentary interlude between bloody battles.</p><p>As for me, the last female writer I read was Dr. Helen Smith and her forthcoming book <i>Men on Strike</i>.  The last female <i>novelist </i>I read was Naomi Novik, whose fantasy novels, as should surprise absolutely no one, manage to reduce the broad human tragedy of the Napoleonic Wars to a pretty good tale about a relationship between a man and his accidentally acquired dragon.</p><p>It is due to this transformation from SF/F to R(SF/F) that despite there being more female “SF/F” authors than ever before, none of them compare favorably with the likes of Madeleine L’Engle, Susan Cooper, Ann McCaffrey, Tanith Lee and Lois McMaster Bujold, women who were always more than capable of competing with the men on pure merit alone.</p></div>",
  "content_text": "A female SF/F writer\nexplains the mediocrity of the modern female SF/F writers\n:\nNew York Publishing by definition has got the rat of Marxism in their\nheads.  They always treated writers as widgets anyway.  Round the mid\nseventies, early eighties they realized that they had more widgets with\nouties than innies, and they decided to correct it the usual way.  “Buy\nmore women” the cry went out.  And in came not only a barrage of women\nwho had an easier time breaking in than men, but of women who were told\nwhat kept them out had been discrimination.  And who, therefore, hated\nthe field they were getting into, because those meanies had kept them\nout.  Out came an outpouring of “poor me female” writing.  Which in the\nearly nineties caused me to snarl at a Barnes & Noble, “I wish\nsomeone would pass a law forbidding women from writing.” After I’d\nwalked up and down a fantasy shelf and found NOT ONE novel that wasn’t\nabout some abused high-magic chick whose father was a monster.\nHere we digress from writing in general to genre writing.  It will\nshock you to realize that different genres appeal to different people,\nright?  In general romance – by and far the blockbuster of genres –\nappeals to women.  I know this shocks you, since women are not at all by\nevolution designed for being fascinated with relationships.  This\ndoesn’t mean men don’t read it.  I know several men who read Romance\n(and no, it has nothing to do with their orientation) but the\nproportions are so grossly skewed that if you see someone in public with\na romance novel and can’t see what gender they are, you can take a safe\nbet it’s a woman.  At the other end of this, military fiction is read\nmostly by men.\nFiction is no different than anything else. If one artificially lowers the barriers to entry, one is going automatically to reduce the quality of entrants one accepts. When it was decided, presumably by female editors and executives, that an insufficient number of female authors were being published in the SF/F genre, many women were given publishing contracts primarily on the sole basis of their being better writers than other female wannabes.\nNow, I disagree with Sarah in that I don’t believe the female writers who entered the genre hated the field or even necessarily wanted to change it much.  I think, to the contrary, that they loved fantasy and science fiction, they merely wanted to “improve” it and make it just a little bit more to their liking.  Hence the shifting focus from ideas, plots, and worldbuilding towards characters and relationships… and romance!\nThis shifting focus didn’t have to be a bad thing. It wasn’t an intrinsic negative. There was certainly some room for considerable improvement with regards to characters, relationships, and style; one cannot read Asimov, Heinlein, Vance, or any of the lesser SF/F authors from the 1950s through the 1970s without being conscious of a certain clunkiness to the prose and a shallowness to the characters.\nThe problem was that in far too many cases, the ideas, plot, and worldbuilding aspects were simply thrown out, to such an extent that now, the average “fantasy” novel is little more than a thinly disguised romance novel. In many cases, the “SF/F” publishers aren’t even bothering to disguise it any longer. What is broadly described as “paranormal” fiction actually belongs to the romance genre, not the SF/F genre, as any reasonable examination of its tropes will swiftly reveal.  And the romantic transformation isn’t limited to the necro-bestial sub-genre of fantasy either. Consider the cover of Mary Robinette Kowal’s new novel,\nWithout A Summer\n. Kowal is the current VP of SFWA. She’s nice, she’s talented, and she’s an award-winning writer. She was even nominated for the Best Novel Nebula in 2010.\nWhat she isn’t is an SF/F writer.  She’s a romance writer. The marketing department at Tor Books clearly knows that. Both the Handsome Prince and the Pretty Princess with her bluebirds on the cover are straight out of Disney.  Giving a Nebula award to a book like this would be akin to giving Joe Abercrombie the Golden Tea Cosy or whatever award it is the RWA gives out because one of his mentally unstable killers happens to tenderly rape a female captive during a momentary interlude between bloody battles.\nAs for me, the last female writer I read was Dr. Helen Smith and her forthcoming book\nMen on Strike\n.  The last female\nnovelist\nI read was Naomi Novik, whose fantasy novels, as should surprise absolutely no one, manage to reduce the broad human tragedy of the Napoleonic Wars to a pretty good tale about a relationship between a man and his accidentally acquired dragon.\nIt is due to this transformation from SF/F to R(SF/F) that despite there being more female “SF/F” authors than ever before, none of them compare favorably with the likes of Madeleine L’Engle, Susan Cooper, Ann McCaffrey, Tanith Lee and Lois McMaster Bujold, women who were always more than capable of competing with the men on pure merit alone.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-28T13:15:00+00:00"
}