{
  "url": "https://voxday.net/2013/04/01/theyre-going-to-need-bigger-bank/",
  "scraped_at": "2025-12-14T22:24:36.758727",
  "title": "They’re going to need a bigger bank",
  "date_display": "April 1, 2013",
  "date_iso": "2013-04-01T10:03:00+00:00",
  "date_from_url": "2013-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Glenn Reynolds observes that the Federal Reserve is worried about <a href=\"http://pjmedia.com/instapundit/166241/\">the growing lack of confidence</a> in the banking system. But they don’t seem to have identified the primary threat, which is the one they have created themselves through their own actions.</p><blockquote class=\"tr_bq\"><p> IN RESPONSE TO ELIZABETH’S POST ON CYBERWAR THIS MORNING, I should note that when I was down speaking at the Atlanta Fed, they told me that cyberwar is one of their biggest worries — not so much something that would bring the banking system down as something that would render it untrustworthy, which in some sense is worse, or at least harder to fix.</p></blockquote><p>The problem is that the Fed’s fractional reserve banking system is, quite literally, a confidence game.  And cyberwar isn’t the real issue, the real issue is that events such as MF Global, the refusal to arrest and convict John Corzine, the deposit heist in Cyprus, and the fact that people are finally beginning to realize that the money they have deposited in the banks is not legally theirs have already undermined the necessary confidence to a considerable degree.</p><p>Quite simply, the money isn’t there, it has never been there, but now everyone knows it, not just the sort of freaks and geeks who read dry, dusty tomes like<i> The Theory of Money and Credit</i> for pleasure and make a habit of perusing the latest H.1 report.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.zerohedge.com/sites/default/files/images/user5/imageroot/2013/03/Us%20Fract%20Reserve%20Banking_0.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.zerohedge.com/sites/default/files/images/user5/imageroot/2013/03/Us%20Fract%20Reserve%20Banking_0.jpg\" width=\"282\"/></a></div><p> The fractional reserve system worked beautifully as long as depositors believed that while one bank or another might fail, their money would remain safely within the system and be accessible to them. But the advent of the “too big to fail” banks necessarily destroyed that confidence because the four largest banks in the system, JP Morgan Chase, Bank of America, Citi, and Wells Fargo now account for <a href=\"http://www.statisticbrain.com/largest-banks-by-total-deposits/\">43 percent of all of the deposits in the system</a>.  If they were permitted to fail – and all four appear to be insolvent due to the worthless assets they are still keeping at ludicrously inflated values on their balance sheets – their creditors and shareholders would be severely affected. And that won’t be permitted by Congress because their creditors and shareholders happen to be the wealthiest and most Congressionally influential people in the nation.</p><p>We learned from TARP that the taxpayers would be levied before the creditors and shareholders would be permitted to suffer losses. The Cyprus actions have now made it clear that depositors will be robbed if necessary too. And that is why it is impossible for Americans to have confidence any longer in their banking system.  The Fed will almost surely respond to this lack of confidence in the customary manner: by instituting domestic capital controls and cracking down even more severely on the use of currency that is nominally legal tender. But these actions will only serve to confirm people’s doubts and hasten the inevitable system failure.</p><p>I wrote back in 2008 that Congress had to let the banks fail if they wanted to save the system.  They unwisely didn’t.  They did manage to buy a little time instead, but that time is now running out.  Sooner or later, financial gravity always prevails.</p></div>",
  "content_text": "Glenn Reynolds observes that the Federal Reserve is worried about\nthe growing lack of confidence\nin the banking system. But they don’t seem to have identified the primary threat, which is the one they have created themselves through their own actions.\nIN RESPONSE TO ELIZABETH’S POST ON CYBERWAR THIS MORNING, I should note that when I was down speaking at the Atlanta Fed, they told me that cyberwar is one of their biggest worries — not so much something that would bring the banking system down as something that would render it untrustworthy, which in some sense is worse, or at least harder to fix.\nThe problem is that the Fed’s fractional reserve banking system is, quite literally, a confidence game.  And cyberwar isn’t the real issue, the real issue is that events such as MF Global, the refusal to arrest and convict John Corzine, the deposit heist in Cyprus, and the fact that people are finally beginning to realize that the money they have deposited in the banks is not legally theirs have already undermined the necessary confidence to a considerable degree.\nQuite simply, the money isn’t there, it has never been there, but now everyone knows it, not just the sort of freaks and geeks who read dry, dusty tomes like\nThe Theory of Money and Credit\nfor pleasure and make a habit of perusing the latest H.1 report.\nThe fractional reserve system worked beautifully as long as depositors believed that while one bank or another might fail, their money would remain safely within the system and be accessible to them. But the advent of the “too big to fail” banks necessarily destroyed that confidence because the four largest banks in the system, JP Morgan Chase, Bank of America, Citi, and Wells Fargo now account for\n43 percent of all of the deposits in the system\n.  If they were permitted to fail – and all four appear to be insolvent due to the worthless assets they are still keeping at ludicrously inflated values on their balance sheets – their creditors and shareholders would be severely affected. And that won’t be permitted by Congress because their creditors and shareholders happen to be the wealthiest and most Congressionally influential people in the nation.\nWe learned from TARP that the taxpayers would be levied before the creditors and shareholders would be permitted to suffer losses. The Cyprus actions have now made it clear that depositors will be robbed if necessary too. And that is why it is impossible for Americans to have confidence any longer in their banking system.  The Fed will almost surely respond to this lack of confidence in the customary manner: by instituting domestic capital controls and cracking down even more severely on the use of currency that is nominally legal tender. But these actions will only serve to confirm people’s doubts and hasten the inevitable system failure.\nI wrote back in 2008 that Congress had to let the banks fail if they wanted to save the system.  They unwisely didn’t.  They did manage to buy a little time instead, but that time is now running out.  Sooner or later, financial gravity always prevails.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-01T09:03:00+00:00"
}