{
  "url": "https://voxday.net/2013/04/26/west-hunter-abuses-eo-wilson/",
  "scraped_at": "2025-12-14T22:27:08.517895",
  "title": "West Hunter abuses E.O. Wilson",
  "date_display": "April 26, 2013",
  "date_iso": "2013-04-26T17:04:00+00:00",
  "date_from_url": "2013-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Solely in <a href=\"http://westhunt.wordpress.com/2013/04/09/math-is-hard/\">the <i>mathematical </i>sense</a>, you understand:</p><blockquote class=\"tr_bq\"><p> Lord Kelvin said “I often say that when you can measure what you are<br> speaking about, and express it in numbers, you know something about it;<br> but when you cannot express it in numbers, your knowledge is of a meagre<br> and unsatisfactory kind; it may be the beginning of knowledge, but you<br> have scarcely, in your thoughts, advanced to the stage of <i>science</i>,<br> whatever the matter may be.”  Even those who didn’t have much math<br> sometimes wished that they did.  Chuck Darwin said “I have deeply<br> regretted that I did not proceed far enough at least to understand<br> something of the great leading principles of mathematics;  for men thus<br> endowed seem to have an extra sense.”</br></br></br></br></br></br></br></br></br></p><p>E. O. Wilson would have benefited from having that extra sense. If he<br> had it, he might not have suggested that ridiculous “gay uncle” theory,<br> in which homosexuality pays for itself genetically thru gay men helping<br> their siblings in ways that produce extra nieces and nephews. First,<br> that doesn’t even happen – so much for field work.  Second, it’s<br> impossible.  The relationship coefficients don’t work. Nephews and<br> nieces are only half as closely related as your own kids, so you’d need<br> four extra to break even, rather than two, as with your own kids.  Maybe<br> if Wilson had ever learned to <strong><em>divide by two</em></strong>, he wouldn’t have made this mistake.</br></br></br></br></br></br></br></br></p><p>Biology and softer-headed sciences such as anthropology are<br> absolutely rife with innumerates, and there is a cost.  If I hear one<br> more person say that average growth rates were very low in the old stone<br> age, a teeny tiny fraction of a percent [true], and so anatomically<br> modern humans only left Africa after it filled up, which took a hundred<br> thousand years, I’m gonna scream.  If I hear another anthropologist say<br> that she could understand how a small group could rapidly expand to fill<br> New Zealand, but just can’t see how they could fill up the Americas,<br> whole continents, in a thousand years – lady, they screwed, they had<br> babies, and they walked.  All it took was a weird, unacademic lifestyle<br> in which you raised three kids – pretty easy to do in the Happy Hunting<br> Ground.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is helpful in illustrating why biologists, as well as science fetishists who harbor blind faith in biologists, shy away from the sort of quantifiable questions I posed to Mike Williamson earlier this week.  It’s true that quantification is not the magical be all and end all; economics is riddled by pseudo-quantifiable fictions that lead to bad theory and even worse policies. But without numbers, there is no precision, and without precision, there is no science, there is only, as Lord Kelvin suggested, the beginning of what could, eventually, become science.</p><p>And insofar as it remains unquantifiable and non-numeric, (to say nothing of unfalsifiable), the Theorum of Evolution by (probably) Natural Selection remains a matter of philosophy, not science.</p></div>",
  "content_text": "Solely in\nthe\nmathematical\nsense\n, you understand:\nLord Kelvin said “I often say that when you can measure what you are\nspeaking about, and express it in numbers, you know something about it;\nbut when you cannot express it in numbers, your knowledge is of a meagre\nand unsatisfactory kind; it may be the beginning of knowledge, but you\nhave scarcely, in your thoughts, advanced to the stage of\nscience\n,\nwhatever the matter may be.”  Even those who didn’t have much math\nsometimes wished that they did.  Chuck Darwin said “I have deeply\nregretted that I did not proceed far enough at least to understand\nsomething of the great leading principles of mathematics;  for men thus\nendowed seem to have an extra sense.”\nE. O. Wilson would have benefited from having that extra sense. If he\nhad it, he might not have suggested that ridiculous “gay uncle” theory,\nin which homosexuality pays for itself genetically thru gay men helping\ntheir siblings in ways that produce extra nieces and nephews. First,\nthat doesn’t even happen – so much for field work.  Second, it’s\nimpossible.  The relationship coefficients don’t work. Nephews and\nnieces are only half as closely related as your own kids, so you’d need\nfour extra to break even, rather than two, as with your own kids.  Maybe\nif Wilson had ever learned to\ndivide by two\n, he wouldn’t have made this mistake.\nBiology and softer-headed sciences such as anthropology are\nabsolutely rife with innumerates, and there is a cost.  If I hear one\nmore person say that average growth rates were very low in the old stone\nage, a teeny tiny fraction of a percent [true], and so anatomically\nmodern humans only left Africa after it filled up, which took a hundred\nthousand years, I’m gonna scream.  If I hear another anthropologist say\nthat she could understand how a small group could rapidly expand to fill\nNew Zealand, but just can’t see how they could fill up the Americas,\nwhole continents, in a thousand years – lady, they screwed, they had\nbabies, and they walked.  All it took was a weird, unacademic lifestyle\nin which you raised three kids – pretty easy to do in the Happy Hunting\nGround.\nThis is helpful in illustrating why biologists, as well as science fetishists who harbor blind faith in biologists, shy away from the sort of quantifiable questions I posed to Mike Williamson earlier this week.  It’s true that quantification is not the magical be all and end all; economics is riddled by pseudo-quantifiable fictions that lead to bad theory and even worse policies. But without numbers, there is no precision, and without precision, there is no science, there is only, as Lord Kelvin suggested, the beginning of what could, eventually, become science.\nAnd insofar as it remains unquantifiable and non-numeric, (to say nothing of unfalsifiable), the Theorum of Evolution by (probably) Natural Selection remains a matter of philosophy, not science.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-26T16:04:00+00:00"
}