{
  "url": "https://voxday.net/2013/04/02/womens-rights-are-anti-freedo/",
  "scraped_at": "2025-12-14T22:24:44.082335",
  "title": "Women’s rights are anti-freedom",
  "date_display": "April 2, 2013",
  "date_iso": "2013-04-02T13:00:00+00:00",
  "date_from_url": "2013-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The truth tends to reveal itself over time. Over the last ten years, I’ve observed that the intrinsically anti-freedom authoritarianism of feminism is increasingly out in the open. At this point, only those who aren’t paying attention can still pretend to buy into the idea that feminism and women’s rights are even remotely compatible with Western civilization or resemble anything that the Western intellectual tradition would consider legitimate rights.</p><p>Consider the words of one Barbara, who isn’t shy about speaking for all women when she quite seriously argues “we should be able to make you not offend us”:</p><blockquote class=\"tr_bq\"><p> I think that I can speak for all women when I say that this very<br> important because we cannot offend science fiction fans of other<br> religions.  The right to free speech is irrelevant to women’s rights and<br> freedom of religion.  People need to understand that being offended is a<br> really big deal and that we should be able to make you not offend us.<br> And science fiction cannot be sexist or minority-phobic either.  This is<br> what it is.  Period.</br></br></br></br></br></br></p></blockquote><p>That is the true heart of feminism.  As I wrote when I pointed out that feminists are sub-civilized: <i>“This is what the feminist’s vaunted concept of equality means.  This is<br> what it has always meant: the legal protection of a woman from all and<br> any consequences of her actions.  This includes a woman’s ability to<br> break any contract at will, to steal from anyone as she pleases, and<br> murder even the most innocent without having to even hear a whisper of<br> protest to make her uncomfortable.”</br></br></br></br></br></i></p><p>Barbara helpfully adds an element that I neglected to include, which is that women “should be able to make you not offend” them. Being intellectually incoherent and unjustifiable in the eyes of every rational observer, feminism is necessarily an ideology of force. This is why it has to be resisted every bit as strenuously as other such ideologies, including communism and National Socialism.</p><p>And a science fiction that <i>cannot </i>be sexist or minority-phobic is not science fiction at all, but a dogmatically limited sub-genre in which all literary value is necessarily subservient to ideological whimsy.</p></div>",
  "content_text": "The truth tends to reveal itself over time. Over the last ten years, I’ve observed that the intrinsically anti-freedom authoritarianism of feminism is increasingly out in the open. At this point, only those who aren’t paying attention can still pretend to buy into the idea that feminism and women’s rights are even remotely compatible with Western civilization or resemble anything that the Western intellectual tradition would consider legitimate rights.\nConsider the words of one Barbara, who isn’t shy about speaking for all women when she quite seriously argues “we should be able to make you not offend us”:\nI think that I can speak for all women when I say that this very\nimportant because we cannot offend science fiction fans of other\nreligions.  The right to free speech is irrelevant to women’s rights and\nfreedom of religion.  People need to understand that being offended is a\nreally big deal and that we should be able to make you not offend us.\nAnd science fiction cannot be sexist or minority-phobic either.  This is\nwhat it is.  Period.\nThat is the true heart of feminism.  As I wrote when I pointed out that feminists are sub-civilized:\n“This is what the feminist’s vaunted concept of equality means.  This is\nwhat it has always meant: the legal protection of a woman from all and\nany consequences of her actions.  This includes a woman’s ability to\nbreak any contract at will, to steal from anyone as she pleases, and\nmurder even the most innocent without having to even hear a whisper of\nprotest to make her uncomfortable.”\nBarbara helpfully adds an element that I neglected to include, which is that women “should be able to make you not offend” them. Being intellectually incoherent and unjustifiable in the eyes of every rational observer, feminism is necessarily an ideology of force. This is why it has to be resisted every bit as strenuously as other such ideologies, including communism and National Socialism.\nAnd a science fiction that\ncannot\nbe sexist or minority-phobic is not science fiction at all, but a dogmatically limited sub-genre in which all literary value is necessarily subservient to ideological whimsy.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-02T12:00:00+00:00"
}