{
  "url": "https://voxday.net/2013/04/22/women-love-strong-horse_22/",
  "scraped_at": "2025-12-14T22:26:40.752566",
  "title": "Women love the strong horse",
  "date_display": "April 22, 2013",
  "date_iso": "2013-04-22T12:30:00+00:00",
  "date_from_url": "2013-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the absence<br> of Christians and others of the traditional civilized West willing to stand up against modern trash culture and the<br> third world invasion, women will naturally be drawn to the masculine strength they perceive in<br> Muslims, even skinny, pot-smoking Muslims armed with pressure cookers.<br> After reading “<a href=\"http://amandapalmer.net/blog/20130421/\">a poem for dzhokhar</a>“,<br> it is apparent that Amanda Palmer wants nothing more than to run her<br> hands through the surviving bomber’s dark, curly hair, bury his face in<br> her breasts, and give her all to ease his noble suffering.</br></br></br></br></br></br></br></p><blockquote class=\"tr_bq\"><p> you don’t know where your friends went.<br> you don’t know how to dance but you give it a shot anyway.<br> you don’t know how your life managed to move twenty six miles forward and twenty eight miles back.<br> you don’t know how to pay your debts.<br> you don’t know how to separate from this partnership to escape and finally breathe.<br> you don’t know how come people run their goddamn knees into the ground anyway.<br> you don’t know how to measure the value of the twenty dollar bill clutched in your hurting hand.<br> you don’t know how you walked into this trap so obliviously.<br> you don’t know how to adjust the rearview mirror.<br> you don’t know how to mourn your dead brother.<br> you don’t know how to drive this car.<br> you don’t know the way to new york.<br> you don’t know the way to new york.<br> you don’t know the way to new york.<br> you don’t know the way to new york.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>If the Muslim doesn’t know his way to New York, then obviously Amanda must go to the Muslim.</p><p>She will look beautiful in hijab.</p><p>As one author comments:  <i>“This is our<br> culture, this is our field, this is what’s permissible and expected. May God have mercy on our souls.”</br></i></p><p>I look forward to reading Ms Palmer’s other poems, including “A Hummer for McVeigh” and “Say What You Like About the Tenets of National Socialism, Girl, Those Uniforms Were Hot”.</p><p>UPDATE: Sarah Hoyt adds her two cents on the matter, not so much on the Vogon-like “poetry”, (which frankly, in my opinion, is glorious in its unabashed self-satisfied myopia), but <a href=\"http://accordingtohoyt.com/2013/04/22/what-weve-failed-to-do/\">on the contrast</a> between the reaction of the SF/F community to this versus Orson Scott Card’s insufficient enthusiasm for abnormal sexual relations.</p><blockquote class=\"tr_bq\"><p> Orson Scott Card was near-crucified for expressing an opinion one would EXPECT from someone with his religious beliefs.  (I disagree with his opinion but while religious I’m very odd.  Also, my religion is not his.) HOWEVER it is not only permissible, it is ENCOURAGED to publish a poem empathizing with a mass murderer, who murdered in the name of a religion that HANGS gay people, mutilates women, and aims at world-wide dominance.</p><p>Wait, what?</p><p>But see, the second religion a) has been identified as “of little brown people” which is why we keep getting told being anti-Islam is “racist” – even though most of them look about as dark as I am.  b) it aims to destroy America, and so it must be good, right?</p><p>(And before you tell me the repulsive terrorist-glorifying poem was written by one of my colleague’s wife, not himself.  Yes.  Indeed.  However, DO rest assured that in this field we have to watch what our spouses do too – or we had to.  I frankly can go indie and my give-a-d*mn is broken. – Imagine as a thought experiment that my husband wrote a poem about the Koch brothers, sweet Libertarian bachelors who have not in fact ever killed anyone.  How long do you imagine it would take before ANYONE refused to talk to me at conventions?)</p><p>So this is the way things are.  Why would they upset me, if I’ve always known they’re that way?</p><p>Because I suddenly realized, with a swimming sense of nausea and shame that this is as much our fault as theirs.</p></blockquote><p>She is right. It is our fault. It is our fault for not mocking these lunatics, idiots, and shysters. It is our fault for enabling them. It is our fault for buying their books, watching their movies, and generally supporting them as they shit ceaselessly on our society, our culture, and our civilization. It is our fault for permitting them to have it both ways. It is our fault for not calling them out when they call good evil and evil good. It is our fault for permitting them to blithely pass off talentless hacks as artistic geniuses. It is our fault for letting them first infest, then pollute, then degrade, and finally kill off our literary traditions just as they have attempted to kill off our societal and civilizational traditions.</p><p>We have failed to stand up for the Orson Scott Cards and failed to spit on the Amanda Fucking Palmers.</p><p>The choice is stark. Western civilization or idiot women writing Vogon mash poems to Islamic killers. I would say the choice is simple, but then, as we have learned, MPAI.</p><p>UPDATE 2: Gawker <a href=\"http://gawker.com/amanda-palmers-a-poem-for-dzhokhar-is-the-worst-poem-476820444\">piles on</a>:</p><blockquote class=\"tr_bq\"><p> This weekend, as law-enforcement officers across the country devoted their resources to the manhunt and capture of the dangerous criminal Reese Witherspoon, an actual crime against humanity was being ignored: Musician Amanda Palmer was writing the worst poem ever composed in the English language, “A Poem for Dzhokhar.”</p></blockquote><p>I don’t know that we really needed a litmus test for “are you willing to crawl up Neil Gaiman’s intestinal tract in the faint hope that some of his glamor might rub off on you”, but we appear to have found ourselves one anyhow.</p></div>",
  "content_text": "In the absence\nof Christians and others of the traditional civilized West willing to stand up against modern trash culture and the\nthird world invasion, women will naturally be drawn to the masculine strength they perceive in\nMuslims, even skinny, pot-smoking Muslims armed with pressure cookers.\nAfter reading “\na poem for dzhokhar\n“,\nit is apparent that Amanda Palmer wants nothing more than to run her\nhands through the surviving bomber’s dark, curly hair, bury his face in\nher breasts, and give her all to ease his noble suffering.\nyou don’t know where your friends went.\nyou don’t know how to dance but you give it a shot anyway.\nyou don’t know how your life managed to move twenty six miles forward and twenty eight miles back.\nyou don’t know how to pay your debts.\nyou don’t know how to separate from this partnership to escape and finally breathe.\nyou don’t know how come people run their goddamn knees into the ground anyway.\nyou don’t know how to measure the value of the twenty dollar bill clutched in your hurting hand.\nyou don’t know how you walked into this trap so obliviously.\nyou don’t know how to adjust the rearview mirror.\nyou don’t know how to mourn your dead brother.\nyou don’t know how to drive this car.\nyou don’t know the way to new york.\nyou don’t know the way to new york.\nyou don’t know the way to new york.\nyou don’t know the way to new york.\nIf the Muslim doesn’t know his way to New York, then obviously Amanda must go to the Muslim.\nShe will look beautiful in hijab.\nAs one author comments:\n“This is our\nculture, this is our field, this is what’s permissible and expected. May God have mercy on our souls.”\nI look forward to reading Ms Palmer’s other poems, including “A Hummer for McVeigh” and “Say What You Like About the Tenets of National Socialism, Girl, Those Uniforms Were Hot”.\nUPDATE: Sarah Hoyt adds her two cents on the matter, not so much on the Vogon-like “poetry”, (which frankly, in my opinion, is glorious in its unabashed self-satisfied myopia), but\non the contrast\nbetween the reaction of the SF/F community to this versus Orson Scott Card’s insufficient enthusiasm for abnormal sexual relations.\nOrson Scott Card was near-crucified for expressing an opinion one would EXPECT from someone with his religious beliefs.  (I disagree with his opinion but while religious I’m very odd.  Also, my religion is not his.) HOWEVER it is not only permissible, it is ENCOURAGED to publish a poem empathizing with a mass murderer, who murdered in the name of a religion that HANGS gay people, mutilates women, and aims at world-wide dominance.\nWait, what?\nBut see, the second religion a) has been identified as “of little brown people” which is why we keep getting told being anti-Islam is “racist” – even though most of them look about as dark as I am.  b) it aims to destroy America, and so it must be good, right?\n(And before you tell me the repulsive terrorist-glorifying poem was written by one of my colleague’s wife, not himself.  Yes.  Indeed.  However, DO rest assured that in this field we have to watch what our spouses do too – or we had to.  I frankly can go indie and my give-a-d*mn is broken. – Imagine as a thought experiment that my husband wrote a poem about the Koch brothers, sweet Libertarian bachelors who have not in fact ever killed anyone.  How long do you imagine it would take before ANYONE refused to talk to me at conventions?)\nSo this is the way things are.  Why would they upset me, if I’ve always known they’re that way?\nBecause I suddenly realized, with a swimming sense of nausea and shame that this is as much our fault as theirs.\nShe is right. It is our fault. It is our fault for not mocking these lunatics, idiots, and shysters. It is our fault for enabling them. It is our fault for buying their books, watching their movies, and generally supporting them as they shit ceaselessly on our society, our culture, and our civilization. It is our fault for permitting them to have it both ways. It is our fault for not calling them out when they call good evil and evil good. It is our fault for permitting them to blithely pass off talentless hacks as artistic geniuses. It is our fault for letting them first infest, then pollute, then degrade, and finally kill off our literary traditions just as they have attempted to kill off our societal and civilizational traditions.\nWe have failed to stand up for the Orson Scott Cards and failed to spit on the Amanda Fucking Palmers.\nThe choice is stark. Western civilization or idiot women writing Vogon mash poems to Islamic killers. I would say the choice is simple, but then, as we have learned, MPAI.\nUPDATE 2: Gawker\npiles on\n:\nThis weekend, as law-enforcement officers across the country devoted their resources to the manhunt and capture of the dangerous criminal Reese Witherspoon, an actual crime against humanity was being ignored: Musician Amanda Palmer was writing the worst poem ever composed in the English language, “A Poem for Dzhokhar.”\nI don’t know that we really needed a litmus test for “are you willing to crawl up Neil Gaiman’s intestinal tract in the faint hope that some of his glamor might rub off on you”, but we appear to have found ourselves one anyhow.",
  "tags": [
    "freakshow",
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-04-22T11:30:00+00:00"
}