{
  "url": "https://voxday.net/2005/09/01/eco-on-empire/",
  "scraped_at": "2026-01-08T20:41:30.355068",
  "title": "Eco on empire",
  "date_display": "September 1, 2005",
  "date_iso": "2005-09-01T14:27:00+00:00",
  "date_from_url": "2005-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From LA BUSTINA DI MINERVA, Bompiani, 2000</p><blockquote><p>Un impero e’ sempre costrittivo e autocratico: e’ come un coperchio che preme su di un calderone bollente.  A un certo punto la pressione interna e’ troppo forte e il coperchio salta, e si ha una sorta di eruzione vulcanica.  No sto affatto dicendo che era bene che il coperchio non saltasse, anche perche’ di solita salta per ragioni termiche, e la fisica non e ne’ morale ne’ immorale.  Dico solo che, sino a che non salta, si mantiene un ordine, per opprimente che sia, e quando salta bisogna pagare un prezzo.</p><p>La dissoluzione dell’impero romano ha prodotto una crisi dell’Europa che e’ durata, nella sua forma virulenta, almeno sei secoli….</p><p><em>An empire is always coercive and autocratic: it is like a cover that presses on a boiling cauldron.  At a certain point, the internal pressure is too strong, the cover is blown off and there is a sort of volcanic eruption.  I am not at all saying that it is good when the cover is not blown off, however, because it is usually blown off for thermal reasons and the physics are neither moral nor immoral.  I only say that, until it is blown off, an order is maintained, however oppressive, and when it blows off a price must be paid.</em></p><p>The dissolution of the Roman Empire produced a European crisis that lasted at least six centuries in its most virulent form….</p></blockquote><p>Some Americans believe that such oppression is justified.  But we have no right or claim to the oil in the Middle East or South America, nor is it our responsibility to enforce a modern Pax Romana on the world.  Those who find the pied piper call of the neocons to be compelling would do well to remember how Rome maintained imperial order before acceding to calls to imitate it.</p><p>First, invade.  Second, enslave a statistically significant portion of the indigenous population and establish numerous settlements of American colonists with a strong core of ex-soldiers among them.  Third, ruthlessly exterminate any challengers to the point of permanently destroying their civilization.</p><p>As the great <em>dottore</em> points out, such measures are ultimately futile.  The cauldron will eventually boil over in any case, and the greater the oppression required to maintain control, the greater the eventual ramifications.  The Balkan atrocities were the result of fifty years of Tito’s Yugoslav imperialism, the end result of an American empire in the Middle East would likely be an explosion of radical Islam that would make its 7th century expansion into Europe look like batting practice.</p></div>",
  "content_text": "From LA BUSTINA DI MINERVA, Bompiani, 2000\nUn impero e’ sempre costrittivo e autocratico: e’ come un coperchio che preme su di un calderone bollente.  A un certo punto la pressione interna e’ troppo forte e il coperchio salta, e si ha una sorta di eruzione vulcanica.  No sto affatto dicendo che era bene che il coperchio non saltasse, anche perche’ di solita salta per ragioni termiche, e la fisica non e ne’ morale ne’ immorale.  Dico solo che, sino a che non salta, si mantiene un ordine, per opprimente che sia, e quando salta bisogna pagare un prezzo.\nLa dissoluzione dell’impero romano ha prodotto una crisi dell’Europa che e’ durata, nella sua forma virulenta, almeno sei secoli….\nAn empire is always coercive and autocratic: it is like a cover that presses on a boiling cauldron.  At a certain point, the internal pressure is too strong, the cover is blown off and there is a sort of volcanic eruption.  I am not at all saying that it is good when the cover is not blown off, however, because it is usually blown off for thermal reasons and the physics are neither moral nor immoral.  I only say that, until it is blown off, an order is maintained, however oppressive, and when it blows off a price must be paid.\nThe dissolution of the Roman Empire produced a European crisis that lasted at least six centuries in its most virulent form….\nSome Americans believe that such oppression is justified.  But we have no right or claim to the oil in the Middle East or South America, nor is it our responsibility to enforce a modern Pax Romana on the world.  Those who find the pied piper call of the neocons to be compelling would do well to remember how Rome maintained imperial order before acceding to calls to imitate it.\nFirst, invade.  Second, enslave a statistically significant portion of the indigenous population and establish numerous settlements of American colonists with a strong core of ex-soldiers among them.  Third, ruthlessly exterminate any challengers to the point of permanently destroying their civilization.\nAs the great\ndottore\npoints out, such measures are ultimately futile.  The cauldron will eventually boil over in any case, and the greater the oppression required to maintain control, the greater the eventual ramifications.  The Balkan atrocities were the result of fifty years of Tito’s Yugoslav imperialism, the end result of an American empire in the Middle East would likely be an explosion of radical Islam that would make its 7th century expansion into Europe look like batting practice.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-01T13:27:00+00:00"
}