{
  "url": "https://voxday.net/2005/09/26/human-dolphin-war-begins/",
  "scraped_at": "2026-01-08T20:45:24.374265",
  "title": "The Human-Dolphin war begins",
  "date_display": "September 26, 2005",
  "date_iso": "2005-09-26T07:48:00+00:00",
  "date_from_url": "2005-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Armed dolphins, trained by the US military to shoot terrorists and pinpoint spies underwater, may be missing in the Gulf of Mexico.  Experts who have studied the US navy’s cetacean training exercises claim the 36 mammals could be carrying ‘toxic dart’ guns. Divers and surfers risk attack, they claim, from a species considered to be among the planet’s smartest. The US navy admits it has been training dolphins for military purposes, but has refused to confirm that any are missing.</p><p>Dolphins have been trained in attack-and-kill missions since the Cold War. The US Atlantic bottlenose dolphins have apparently been taught to shoot terrorists attacking military vessels. Their coastal compound was breached during the storm, sweeping them out to sea. But those who have studied the controversial use of dolphins in the US defence programme claim <a href=\"http://observer.guardian.co.uk/international/story/0,6903,1577753,00.html\">it is vital they are caught quickly</a>.</p></blockquote><p>Whatever happened to so long, and thanks for all the fish?  Ungrateful blowholing bastards!</p></div>",
  "content_text": "Armed dolphins, trained by the US military to shoot terrorists and pinpoint spies underwater, may be missing in the Gulf of Mexico.  Experts who have studied the US navy’s cetacean training exercises claim the 36 mammals could be carrying ‘toxic dart’ guns. Divers and surfers risk attack, they claim, from a species considered to be among the planet’s smartest. The US navy admits it has been training dolphins for military purposes, but has refused to confirm that any are missing.\nDolphins have been trained in attack-and-kill missions since the Cold War. The US Atlantic bottlenose dolphins have apparently been taught to shoot terrorists attacking military vessels. Their coastal compound was breached during the storm, sweeping them out to sea. But those who have studied the controversial use of dolphins in the US defence programme claim\nit is vital they are caught quickly\n.\nWhatever happened to so long, and thanks for all the fish?  Ungrateful blowholing bastards!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-26T06:48:00+00:00"
}