{
  "url": "https://voxday.net/2005/09/10/its-happiest-time-of-year/",
  "scraped_at": "2026-01-08T20:42:20.569560",
  "title": "It’s the happiest time of the year",
  "date_display": "September 10, 2005",
  "date_iso": "2005-09-10T08:28:00+00:00",
  "date_from_url": "2005-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>L – St. Louis Rams over San Francisco 49ers<br>L – Carolina Panthers over New Orleans Saints<br>W – Cincinnati Bengals over Cleveland Browns <br>W – New England Patriots over Oakland Raiders<br>W – Pittsburgh Steelers over Tennessee Titans <br>L – Denver Broncos over Miami Dolphins<br>L – San Diego Chargers over Dallas Cowboys<br>W – New York Giants over Arizona Cardinals<br>W – Buffalo Bills over Houston Texans<br>L – New York Jets over Kansas City Chiefs <br>L – Minnesota Vikings over Tampa Bay Buccaneers <br>W – Jacksonville Jaguars over Seattle Seahawks <br>W – Washington Redskins over Chicago Bears <br>L – Green Bay Packers over Detroit Lions <br>W – Indianapolis Colts over Baltimore Ravens <br>Philadelphia Eagles over Atlanta Falcons</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Week One is always tough, since there’s so many unknowns.  These are mostly Chokechain’s picks; we usually leave the first two weeks up to him since he does more offseason research than me and the other eight guys in the league combined.  The three games that make me the most nervous are Philly, Indy and the Jets, the first two cases because I don’t like to rely on hot offenses playing excellent defenses early in the season.  The New England game showed how even the best-prepared teams can be a little rusty in the early going.  The Chiefs, meanwhile, are a bit of a mystery these days, but I suspect Chokechain is probably right and that the Jets solid DEF will slow Priest, Green and Gonzalez enough to win.</p><p>By the way, I’m moderately annoyed by all the sanctimonious emoting from the sportswriters about how we are all Saints fans and how bad they feel about picking against them and so forth.  Well, I’m not and I don’t.  This is the NFL Sunday Ticket, not the Weather Channel, and we are ready for some football.</p><p>UPDATE – How you like that Tennessee run defense now, Nate?  And how about my boy Willie Parker?  As for Mewelde, he was sitting on the bench, as he will until Tice wakes up and decides to start him.</p></div>",
  "content_text": "L – St. Louis Rams over San Francisco 49ers\nL – Carolina Panthers over New Orleans Saints\nW – Cincinnati Bengals over Cleveland Browns\nW – New England Patriots over Oakland Raiders\nW – Pittsburgh Steelers over Tennessee Titans\nL – Denver Broncos over Miami Dolphins\nL – San Diego Chargers over Dallas Cowboys\nW – New York Giants over Arizona Cardinals\nW – Buffalo Bills over Houston Texans\nL – New York Jets over Kansas City Chiefs\nL – Minnesota Vikings over Tampa Bay Buccaneers\nW – Jacksonville Jaguars over Seattle Seahawks\nW – Washington Redskins over Chicago Bears\nL – Green Bay Packers over Detroit Lions\nW – Indianapolis Colts over Baltimore Ravens\nPhiladelphia Eagles over Atlanta Falcons\nWeek One is always tough, since there’s so many unknowns.  These are mostly Chokechain’s picks; we usually leave the first two weeks up to him since he does more offseason research than me and the other eight guys in the league combined.  The three games that make me the most nervous are Philly, Indy and the Jets, the first two cases because I don’t like to rely on hot offenses playing excellent defenses early in the season.  The New England game showed how even the best-prepared teams can be a little rusty in the early going.  The Chiefs, meanwhile, are a bit of a mystery these days, but I suspect Chokechain is probably right and that the Jets solid DEF will slow Priest, Green and Gonzalez enough to win.\nBy the way, I’m moderately annoyed by all the sanctimonious emoting from the sportswriters about how we are all Saints fans and how bad they feel about picking against them and so forth.  Well, I’m not and I don’t.  This is the NFL Sunday Ticket, not the Weather Channel, and we are ready for some football.\nUPDATE – How you like that Tennessee run defense now, Nate?  And how about my boy Willie Parker?  As for Mewelde, he was sitting on the bench, as he will until Tice wakes up and decides to start him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-10T07:28:00+00:00"
}