{
  "url": "https://voxday.net/2005/09/15/land-of-hunted/",
  "scraped_at": "2026-01-08T20:42:49.566528",
  "title": "The land of the hunted",
  "date_display": "September 15, 2005",
  "date_iso": "2005-09-15T20:48:00+00:00",
  "date_from_url": "2005-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Fox News Sunday:</p><blockquote><p>06/17/01, Tony Snow hosting. The lead off guest was Colin Powell, the US Secretary of State. Mr. Powell gave an excellent recitation relevant to foreign affair matters. Mr. Powell was discussing Mr. Bush’s trip to Europe, and was at a point in his recitation covering certain concerns regarding Russia, and Russia being requested to cooperate with the United States to track down lost Nuclear materials and scientists who were unaccounted for after the break up of Russia, that now may be in the hands of, or in the case of the missing scientists, working for adversaries of the USA.  The quote from Mr. Powell: <em>“Finding the Russian scientists may be a problem being that Russia does not have a Social Security System, as here in America, that allows us to monitor, track down and capture an American citizen.”</em></p></blockquote><p>Can anyone verify this quote?  If it’s not an invention of the tinfoil brigade, I would think it tends to eliminate any doubt about what the compassionate conservatives intend to do with implantable chip technology once it’s been tested on enough cows, convicts and nightclubbers.</p><p>UPDATE – yes, it’s a fake. I suspected that it might be, as diplomats generally aren’t known for their blunt speech.  Even the Nazis weren’t inclined to use the Berlin newspapers to announce that they were intending to convert Jewish bones into fertilizer.</p></div>",
  "content_text": "From Fox News Sunday:\n06/17/01, Tony Snow hosting. The lead off guest was Colin Powell, the US Secretary of State. Mr. Powell gave an excellent recitation relevant to foreign affair matters. Mr. Powell was discussing Mr. Bush’s trip to Europe, and was at a point in his recitation covering certain concerns regarding Russia, and Russia being requested to cooperate with the United States to track down lost Nuclear materials and scientists who were unaccounted for after the break up of Russia, that now may be in the hands of, or in the case of the missing scientists, working for adversaries of the USA.  The quote from Mr. Powell:\n“Finding the Russian scientists may be a problem being that Russia does not have a Social Security System, as here in America, that allows us to monitor, track down and capture an American citizen.”\nCan anyone verify this quote?  If it’s not an invention of the tinfoil brigade, I would think it tends to eliminate any doubt about what the compassionate conservatives intend to do with implantable chip technology once it’s been tested on enough cows, convicts and nightclubbers.\nUPDATE – yes, it’s a fake. I suspected that it might be, as diplomats generally aren’t known for their blunt speech.  Even the Nazis weren’t inclined to use the Berlin newspapers to announce that they were intending to convert Jewish bones into fertilizer.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-15T19:48:00+00:00"
}