{
  "url": "https://voxday.net/2005/09/08/liberal-answer-redux/",
  "scraped_at": "2026-01-08T20:42:15.064593",
  "title": "The “liberal” answer redux",
  "date_display": "September 8, 2005",
  "date_iso": "2005-09-08T15:43:00+00:00",
  "date_from_url": "2005-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Brooks offers a prescription for rebuilding New Orleans in the New York Times:</p><blockquote><p>If we just put up new buildings and allow the same people to move back into their old neighborhoods, then urban New Orleans will become just as rundown and dysfunctional as before.</p><p>That’s why the second rule of rebuilding should be: Culturally Integrate. Culturally Integrate. Culturally Integrate. The only chance we have to break the cycle of poverty is to integrate people who lack middle-class skills into neighborhoods with people who possess these skills and who insist on certain standards of behavior.</p></blockquote><p>Can anyone spot the flaw in this argument?  (Hint: it’s the same flaw that caused busing to fail.)  You see, functioning middle-class families don’t like being used as the tools to fix the struggling lower-classes, to say nothing of the completely dysfunctional middle class.</p><p>White people don’t move out of a neighborhood because they fear the nice, middle-class black couple who just moved in or because they are unregenerate racists who don’t want to set eyes on a darkie from their front lawn, they move out because they know that less desirable elements are likely to begin knocking around the neighborhood in a relatively short period of time.</p><p>If the government imposes Mr. Brooks’ cultural integration solution, the first thing you’ll see is a rash of For Sale signs as the white middle class and the black middle class will race each other to escape the meltdown.</p><p>On a tangential note, Fred <a href=\"http://www.fredoneverything.net/KatrinaRiots.shtml\">pointed out this week</a>: <em>“The melding of the races just hasn’t worked and, if examined honestly, shows few signs of working. Fifty years after the Brown decision, blacks remain unassimilated. They appear to be unassimilable. This, after endless programs, after the nation has turned itself on its head trying to encourage, promote, force, or imagine assimilation….  Neither race shows much inclination to associate with the other. Left to themselves, they quickly segregate, in housing, on campus, in night clubs. Only heavy federal pressure produces an appearance of togetherheid.”</em></p><p>Nothing else has worked, so let’s just try the same thing, shall we?  As usual, the “liberal” solution requires modifying intransigent human behavior at gunpoint.  The truly sad thing about this is that Mr. Brooks is supposed to be the house conservative.</p></div>",
  "content_text": "David Brooks offers a prescription for rebuilding New Orleans in the New York Times:\nIf we just put up new buildings and allow the same people to move back into their old neighborhoods, then urban New Orleans will become just as rundown and dysfunctional as before.\nThat’s why the second rule of rebuilding should be: Culturally Integrate. Culturally Integrate. Culturally Integrate. The only chance we have to break the cycle of poverty is to integrate people who lack middle-class skills into neighborhoods with people who possess these skills and who insist on certain standards of behavior.\nCan anyone spot the flaw in this argument?  (Hint: it’s the same flaw that caused busing to fail.)  You see, functioning middle-class families don’t like being used as the tools to fix the struggling lower-classes, to say nothing of the completely dysfunctional middle class.\nWhite people don’t move out of a neighborhood because they fear the nice, middle-class black couple who just moved in or because they are unregenerate racists who don’t want to set eyes on a darkie from their front lawn, they move out because they know that less desirable elements are likely to begin knocking around the neighborhood in a relatively short period of time.\nIf the government imposes Mr. Brooks’ cultural integration solution, the first thing you’ll see is a rash of For Sale signs as the white middle class and the black middle class will race each other to escape the meltdown.\nOn a tangential note, Fred\npointed out this week\n:\n“The melding of the races just hasn’t worked and, if examined honestly, shows few signs of working. Fifty years after the Brown decision, blacks remain unassimilated. They appear to be unassimilable. This, after endless programs, after the nation has turned itself on its head trying to encourage, promote, force, or imagine assimilation….  Neither race shows much inclination to associate with the other. Left to themselves, they quickly segregate, in housing, on campus, in night clubs. Only heavy federal pressure produces an appearance of togetherheid.”\nNothing else has worked, so let’s just try the same thing, shall we?  As usual, the “liberal” solution requires modifying intransigent human behavior at gunpoint.  The truly sad thing about this is that Mr. Brooks is supposed to be the house conservative.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-08T14:43:00+00:00"
}