{
  "url": "https://voxday.net/2005/09/01/mailvox-bulverisms-and-bollocks/",
  "scraped_at": "2026-01-08T20:41:34.103716",
  "title": "Mailvox: Bulverisms and bollocks",
  "date_display": "September 1, 2005",
  "date_iso": "2005-09-01T15:49:00+00:00",
  "date_from_url": "2005-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GN writes::</p><blockquote><p><em>“Like I said, Shapiro may indeed be a chickenhawk, but you aren’t among the men – or women, for that matter – with the moral authority to level that charge at him.”</em></p><p>“No one needs any “moral authority” to do so. A fact is a fact.”</p><p>This is classic Bulverism – YOUR opinion should be judged on your motives for holding it, whereas MINE must be judged on the facts/issues.  However tempting it may be, however true it may be, you simply cannot have an intelligent debate if you resort to Bulverism. We’ve endured this “Shapiro’s motives” thing for over a week now, and it’s only lowered the debate to the point where it could only sink lower if Hitler were invoked.It doesn’t fit the definition of Bulverism at all. No one, Morgan included, has argued that Ben Shapiro does not meet the definition of chickenhawk as it is commonly understood today. They have merely argued that I should not point out that he does meet this definition for various reasons.</p></blockquote><p>Never mind the Sex Pistols, where did I judge Morgan’s statement based on her motives? Alternatively, where have I failed to judge Shapiro’s case based on the facts and issues?  And show, don’t tell.</p><p>I’d like to remind those of you who appear to be future Alzheimer’s candidates that I was RESPONDING to Shapiro’s two columns ON CHICKENHAWKS.  If you have a problem with the fact that the topic has entered the public discourse, then go complain to Shapiro. And Lowry. And Goldberg. Not me.  All of their columns predate mine and I’m sure they’ll be just as patient as I’ve been listening to you endlessly repeat yourselves.  Answer this: how many left-wing columnists devoted columns to the term in the last six months as opposed to defensive neocons to whom the appellation might be applied?  Name them.</p><p>It is utterly and completely moronic to pretend that I launched an attack on Ben Shapiro out of the blue.  Anyone so inclined could have applied the chickenhawk label to him as early as 16 months ago, when in one of his early WND columns the budding young lawyer wrote: <em>“We can ignore the fact that one day the modern-day Nazis – the Islamofascists and their appeasement-minded allies – will storm our gates. We can ignore the fact that the first shots of this war have already been fired….  Or we can recognize that we are in the same situation as the heroes of the ZOB. We can recognize that though the fight is difficult, it is worth fighting.”</em></p><p>Right, so now Chamberlain is Hitler too?  Whatever.  The point is that it was not until Shapiro began repeatedly using his column for egregiously self-serving purposes that I called him out.  And that, my dear GN, is a fact.</p><p>No one ever objects when I, or any other right-wing columnist, use dismissive names to refer to left-wing political figures or columnists, and, ironically enough, nearly everyone objecting to this supposedly unthinkable evil has called me and other posters names that are demonstrably less accurate in the past.  Even the littlest chickenhawk’s words suddenly don’t look so unusually hypocritical when compared with his would-be defenders.</p><p>I don’t know if the obstinacy with which some of you are still defending Shapiro stems from an instinct to protect everyone and everything right-wing, (or perhaps supportive of the war), a fear of having the label applied to you yourself (as two emailers admitted), a simple contrarian instinct or simply a liking for tilting at windmills.  But as you should all know by now, I have no problem with beating a dead horse, grinding it into hamburger, eating it, excreting it, burying it in the ground to rot then digging it up again to beat the crap out of it one more time.</p><p>If you dislike the subject so much, then I strongly suggest you drop it.  And you might want to drop a note to Messrs Goldberg, Lowry and Shapiro to do likewise.</p></div>",
  "content_text": "GN writes::\n“Like I said, Shapiro may indeed be a chickenhawk, but you aren’t among the men – or women, for that matter – with the moral authority to level that charge at him.”\n“No one needs any “moral authority” to do so. A fact is a fact.”\nThis is classic Bulverism – YOUR opinion should be judged on your motives for holding it, whereas MINE must be judged on the facts/issues.  However tempting it may be, however true it may be, you simply cannot have an intelligent debate if you resort to Bulverism. We’ve endured this “Shapiro’s motives” thing for over a week now, and it’s only lowered the debate to the point where it could only sink lower if Hitler were invoked.It doesn’t fit the definition of Bulverism at all. No one, Morgan included, has argued that Ben Shapiro does not meet the definition of chickenhawk as it is commonly understood today. They have merely argued that I should not point out that he does meet this definition for various reasons.\nNever mind the Sex Pistols, where did I judge Morgan’s statement based on her motives? Alternatively, where have I failed to judge Shapiro’s case based on the facts and issues?  And show, don’t tell.\nI’d like to remind those of you who appear to be future Alzheimer’s candidates that I was RESPONDING to Shapiro’s two columns ON CHICKENHAWKS.  If you have a problem with the fact that the topic has entered the public discourse, then go complain to Shapiro. And Lowry. And Goldberg. Not me.  All of their columns predate mine and I’m sure they’ll be just as patient as I’ve been listening to you endlessly repeat yourselves.  Answer this: how many left-wing columnists devoted columns to the term in the last six months as opposed to defensive neocons to whom the appellation might be applied?  Name them.\nIt is utterly and completely moronic to pretend that I launched an attack on Ben Shapiro out of the blue.  Anyone so inclined could have applied the chickenhawk label to him as early as 16 months ago, when in one of his early WND columns the budding young lawyer wrote:\n“We can ignore the fact that one day the modern-day Nazis – the Islamofascists and their appeasement-minded allies – will storm our gates. We can ignore the fact that the first shots of this war have already been fired….  Or we can recognize that we are in the same situation as the heroes of the ZOB. We can recognize that though the fight is difficult, it is worth fighting.”\nRight, so now Chamberlain is Hitler too?  Whatever.  The point is that it was not until Shapiro began repeatedly using his column for egregiously self-serving purposes that I called him out.  And that, my dear GN, is a fact.\nNo one ever objects when I, or any other right-wing columnist, use dismissive names to refer to left-wing political figures or columnists, and, ironically enough, nearly everyone objecting to this supposedly unthinkable evil has called me and other posters names that are demonstrably less accurate in the past.  Even the littlest chickenhawk’s words suddenly don’t look so unusually hypocritical when compared with his would-be defenders.\nI don’t know if the obstinacy with which some of you are still defending Shapiro stems from an instinct to protect everyone and everything right-wing, (or perhaps supportive of the war), a fear of having the label applied to you yourself (as two emailers admitted), a simple contrarian instinct or simply a liking for tilting at windmills.  But as you should all know by now, I have no problem with beating a dead horse, grinding it into hamburger, eating it, excreting it, burying it in the ground to rot then digging it up again to beat the crap out of it one more time.\nIf you dislike the subject so much, then I strongly suggest you drop it.  And you might want to drop a note to Messrs Goldberg, Lowry and Shapiro to do likewise.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-01T14:49:00+00:00"
}