{
  "url": "https://voxday.net/2005/09/03/sweet-harmony-however-incidenta/",
  "scraped_at": "2026-01-08T20:41:48.939921",
  "title": "A sweet harmony, however incidental",
  "date_display": "September 3, 2005",
  "date_iso": "2005-09-03T21:03:00+00:00",
  "date_from_url": "2005-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After I quoted the Sports Guy to kick off my column on <a href=\"http://www.voxday.net/archive/2005/080805.html\">Why Women’s Rights are Wrong</a>, I received a few emails informing me how they were going to tell Simmons on me – oh please, no! – how he was a Kerry voter and would publicly disown any connection with me – not hard since there is none – and made a number of other, similarly whacked-out comments that I can only assume were supposed to pass for threats.</p><p>I don’t know if anyone actually followed through or not, all I know is that Simmons <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/050901\">dropped this one</a> a few days ago:</p><p><em>Let’s end the ongoing charade that this is a mainstream sport.  For the past nine years, the WNBA has been given countless chances, endless promotion, mainstream coverage and truckloads of capital. Has it helped? Absolutely not….</em></p><p>Of course, after nine years of failed promos and cushy television coverage, there needs to be a P.C. reason for the league’s failure that goes beyond something as simple as “it’s just not that much fun to watch.” Hey, let’s turn it into a social issue! As the logic goes, the WNBA needs to stick around because the future of women’s sports is at stake.</p><p>How dare he, the sexist bastard!  Still, if the teetering WNBA means the future of women’s sports is at stake, then I’m afraid that I, in company with the hundreds of NCAA men’s programs murdered by Title IX, won’t be shedding too terribly many tears when David Stern’s successor drops a lighted torch on it.</p></div>",
  "content_text": "After I quoted the Sports Guy to kick off my column on\nWhy Women’s Rights are Wrong\n, I received a few emails informing me how they were going to tell Simmons on me – oh please, no! – how he was a Kerry voter and would publicly disown any connection with me – not hard since there is none – and made a number of other, similarly whacked-out comments that I can only assume were supposed to pass for threats.\nI don’t know if anyone actually followed through or not, all I know is that Simmons\ndropped this one\na few days ago:\nLet’s end the ongoing charade that this is a mainstream sport.  For the past nine years, the WNBA has been given countless chances, endless promotion, mainstream coverage and truckloads of capital. Has it helped? Absolutely not….\nOf course, after nine years of failed promos and cushy television coverage, there needs to be a P.C. reason for the league’s failure that goes beyond something as simple as “it’s just not that much fun to watch.” Hey, let’s turn it into a social issue! As the logic goes, the WNBA needs to stick around because the future of women’s sports is at stake.\nHow dare he, the sexist bastard!  Still, if the teetering WNBA means the future of women’s sports is at stake, then I’m afraid that I, in company with the hundreds of NCAA men’s programs murdered by Title IX, won’t be shedding too terribly many tears when David Stern’s successor drops a lighted torch on it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-03T20:03:00+00:00"
}