{
  "url": "https://voxday.net/2005/09/07/when-they-dont-have-case/",
  "scraped_at": "2026-01-08T20:42:09.539689",
  "title": "When they don’t have a case",
  "date_display": "September 7, 2005",
  "date_iso": "2005-09-07T17:18:00+00:00",
  "date_from_url": "2005-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader responds to the Sports Guy:</p><blockquote><p>More importantly, why do you care so much? You’ve whined about the WNBA something like 10 times this summer. Just quit it already. It’s not fun to read. I can only guess that you harp on this because you feel threatened, and I can’t guess as to why that is. Your sports dominate — football, baseball and basketball. Just let it be. Let the WNBA fans have their WNBA. I don’t watch it, but I don’t care that someone else does. Why do you care?</p></blockquote><p>Simmons posted two pages of responses to his anti-WNBA column, and while <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/050906/wnba1\">the supportive emails</a> are much more fun to read, I was struck by how familiar <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/050906/wnba2\">the critical emails sounded</a>.  Questioning motives is the last resort of the roundly defeated; “well, what do you care, anyhow?” has got to be one of the least effective responses to a facts-based analysis this side of Miss Pandagon’s threat to have unproductive sex with the men of America.</p></div>",
  "content_text": "A reader responds to the Sports Guy:\nMore importantly, why do you care so much? You’ve whined about the WNBA something like 10 times this summer. Just quit it already. It’s not fun to read. I can only guess that you harp on this because you feel threatened, and I can’t guess as to why that is. Your sports dominate — football, baseball and basketball. Just let it be. Let the WNBA fans have their WNBA. I don’t watch it, but I don’t care that someone else does. Why do you care?\nSimmons posted two pages of responses to his anti-WNBA column, and while\nthe supportive emails\nare much more fun to read, I was struck by how familiar\nthe critical emails sounded\n.  Questioning motives is the last resort of the roundly defeated; “well, what do you care, anyhow?” has got to be one of the least effective responses to a facts-based analysis this side of Miss Pandagon’s threat to have unproductive sex with the men of America.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-09-07T16:18:00+00:00"
}