{
  "url": "https://voxday.net/2011/08/14/50-best-sff-works/",
  "scraped_at": "2025-12-13T23:18:58.336733",
  "title": "The 50 best SF/F books and/or series",
  "date_display": "August 14, 2011",
  "date_iso": "2011-08-14T13:27:00+00:00",
  "date_from_url": "2011-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After much discussion of NPR’s 100 greatest science fiction and fantasy works, I was moved to construct my own list of what I consider to be the top 50.  As with all such lists this is somewhat arbitrary, nevertheless it should be taken as the complete, definitive, and conclusive final word on the matter.  I see no purpose in honoring innovation for innovation’s sake when others have subsequently done it better, for example, John Polidori’s <em>The Vampyre</em> and Mary Shelley’s <em>Frankenstein </em>have both been long surpassed as examples of their type, whereas the same is not true for Tolkien’s oft-imitated <em>The Lord of the Rings</em> or Orwell’s <em>Animal Farm</em>.  In some cases, I have chosen to highlight a single book, <em>Dune</em>, for example, whereas in others I have chosen to judge a series as a whole. <em>Night Watch</em> is easily the best of Terry Pratchett’s books, but it cannot be judged fairly in isolation as one has to have a fuller understanding of Ankh-Morpork to fully appreciate the novel.  I have paid zero attention to book sales or authorial reputation, I have read all of the books on the list, and I have tended to rate genuinely amusing books more highly than others might due to the additional degree of difficulty involved.</p><p>I further note that if you happen to disagree with the reverence shown to Mr. Ray Bradbury, you are clearly inhuman, possess no soul, and should consider returning to your home planet.  If you have not read or heard of Tanith Lee, people should throw rocks at you on the street until you rectify the error.  On the other hand, if you have not read Hesse, that is understandable since he’s not traditionally considered a genre author.  But do yourself a favor and read the book anyhow.  And yes, Edgar Allen Poe should by rights be on here somewhere near the top, but the metric is books and/or series, not authors and/or short stories.</p><p>1. <em>The Lord of the Rings</em>, JRR Tolkien<br> 2. <em>Dune</em>, Frank Herbert<br> 3. <em>Dandelion Wine</em>, Ray Bradbury<br> 4. <em>The Chronicles of Narnia</em>, CS Lewis<br> 5. <em>The Glass Bead Game</em>, Hermann Hesse<br> 6. <em>Watership Down</em>, Richard Adams<br> 7. <em>The Dark is Rising</em>, Susan Cooper<br> 8. <em>The Secret Books of Paradys</em>, Tanith Lee<br> 9. <em>The Sprawl Trilogy</em>, William Gibson<br> 10. <em>The Cthulhu Mythos</em>, HP Lovecraft</br></br></br></br></br></br></br></br></br></p><p>Read the rest of the list <a href=\"http://www.blackgate.com/2011/08/14/the-50-best-sff/\">at the Black Gate</a>.</p></div>",
  "content_text": "After much discussion of NPR’s 100 greatest science fiction and fantasy works, I was moved to construct my own list of what I consider to be the top 50.  As with all such lists this is somewhat arbitrary, nevertheless it should be taken as the complete, definitive, and conclusive final word on the matter.  I see no purpose in honoring innovation for innovation’s sake when others have subsequently done it better, for example, John Polidori’s\nThe Vampyre\nand Mary Shelley’s\nFrankenstein\nhave both been long surpassed as examples of their type, whereas the same is not true for Tolkien’s oft-imitated\nThe Lord of the Rings\nor Orwell’s\nAnimal Farm\n.  In some cases, I have chosen to highlight a single book,\nDune\n, for example, whereas in others I have chosen to judge a series as a whole.\nNight Watch\nis easily the best of Terry Pratchett’s books, but it cannot be judged fairly in isolation as one has to have a fuller understanding of Ankh-Morpork to fully appreciate the novel.  I have paid zero attention to book sales or authorial reputation, I have read all of the books on the list, and I have tended to rate genuinely amusing books more highly than others might due to the additional degree of difficulty involved.\nI further note that if you happen to disagree with the reverence shown to Mr. Ray Bradbury, you are clearly inhuman, possess no soul, and should consider returning to your home planet.  If you have not read or heard of Tanith Lee, people should throw rocks at you on the street until you rectify the error.  On the other hand, if you have not read Hesse, that is understandable since he’s not traditionally considered a genre author.  But do yourself a favor and read the book anyhow.  And yes, Edgar Allen Poe should by rights be on here somewhere near the top, but the metric is books and/or series, not authors and/or short stories.\n1.\nThe Lord of the Rings\n, JRR Tolkien\n2.\nDune\n, Frank Herbert\n3.\nDandelion Wine\n, Ray Bradbury\n4.\nThe Chronicles of Narnia\n, CS Lewis\n5.\nThe Glass Bead Game\n, Hermann Hesse\n6.\nWatership Down\n, Richard Adams\n7.\nThe Dark is Rising\n, Susan Cooper\n8.\nThe Secret Books of Paradys\n, Tanith Lee\n9.\nThe Sprawl Trilogy\n, William Gibson\n10.\nThe Cthulhu Mythos\n, HP Lovecraft\nRead the rest of the list\nat the Black Gate\n.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-14T12:27:00+00:00"
}