{
  "url": "https://voxday.net/2011/08/31/all-ur-bikes-are-belong-to-us/",
  "scraped_at": "2025-12-13T23:20:35.346476",
  "title": "All ur bikes are belong to us",
  "date_display": "August 31, 2011",
  "date_iso": "2011-08-31T19:12:00+00:00",
  "date_from_url": "2011-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting to see when one aspect of the overblown Nanny State is at war with another aspect of it.  I think we can safely declare the Green movement dead with <a href=\"http://bikewalktn.blogspot.com/2011/08/arrested-for-riding-bike-to-school.html\">this report of egregious child abuse</a>:</p><blockquote><p>“On August 25th my 10 year daughter arrived home via police officer, requested to speak to me on the front porch of my home. The officer informed me that in his ‘judgement’ it was unsafe for my daughter to ride her bike to school.”</p><p>Ms Tryon called the mayor’s office and the chief of police office in order to determine what laws she was breaking by allowing her daughter to ride her bike to school.  Her daughter’s route to school was reasonably safe.</p><p>Major Verran of the police department returned Ms Tryon’s call.  She said he told me, “He had spoke with the District Attorney’s office who advised that until the officer can speak with Child Protective Services that if I allow my daughter to ride/walk to school I will be breaking the law and treated accordingly.</p><p>She asked, “What law she would be breaking to which the answer was ‘child neglect'”.</p><p>Ms Tryon confirm with Major Verran that her daughter was indeed breaking no laws at any level, but it was Ms Tryon who was breaking the law by allowing her daughter to ride/walk to school. Even though it only takes her daughter 7 – 9 minutes to bicycle to school, she is expected to ride the bus.</p></blockquote><p>By the way, in Big Government Europe, children are not only expected to walk to school, but this time of year there are massive posters put up warning drivers to be careful and on the lookout for schoolchildren walking to and from school.  The only police involvement is to man the crossings at the busy streets.</p><p>As a commenter on another site pointed out, it’s a fascinating charge of child endangerment, especially considering that the schoolbus she will be required to ride doesn’t have seatbelts, much less five-point child safety seats.  But let’s not be too harsh on the police officer.  He’s just concerned for her safety, because the police are all about <a href=\"http://i.dailymail.co.uk/i/pix/2011/08/30/article-0-0DA34A4D00000578-244_468x286.jpg\">protecting and servicing</a>.</p></div>",
  "content_text": "It’s always interesting to see when one aspect of the overblown Nanny State is at war with another aspect of it.  I think we can safely declare the Green movement dead with\nthis report of egregious child abuse\n:\n“On August 25th my 10 year daughter arrived home via police officer, requested to speak to me on the front porch of my home. The officer informed me that in his ‘judgement’ it was unsafe for my daughter to ride her bike to school.”\nMs Tryon called the mayor’s office and the chief of police office in order to determine what laws she was breaking by allowing her daughter to ride her bike to school.  Her daughter’s route to school was reasonably safe.\nMajor Verran of the police department returned Ms Tryon’s call.  She said he told me, “He had spoke with the District Attorney’s office who advised that until the officer can speak with Child Protective Services that if I allow my daughter to ride/walk to school I will be breaking the law and treated accordingly.\nShe asked, “What law she would be breaking to which the answer was ‘child neglect'”.\nMs Tryon confirm with Major Verran that her daughter was indeed breaking no laws at any level, but it was Ms Tryon who was breaking the law by allowing her daughter to ride/walk to school. Even though it only takes her daughter 7 – 9 minutes to bicycle to school, she is expected to ride the bus.\nBy the way, in Big Government Europe, children are not only expected to walk to school, but this time of year there are massive posters put up warning drivers to be careful and on the lookout for schoolchildren walking to and from school.  The only police involvement is to man the crossings at the busy streets.\nAs a commenter on another site pointed out, it’s a fascinating charge of child endangerment, especially considering that the schoolbus she will be required to ride doesn’t have seatbelts, much less five-point child safety seats.  But let’s not be too harsh on the police officer.  He’s just concerned for her safety, because the police are all about\nprotecting and servicing\n.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-31T18:12:00+00:00"
}