{
  "url": "https://voxday.net/2011/08/28/can-one-dodge-dodger/",
  "scraped_at": "2025-12-13T23:20:17.026873",
  "title": "Can one dodge a dodger?",
  "date_display": "August 28, 2011",
  "date_iso": "2011-08-28T08:33:00+00:00",
  "date_from_url": "2011-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One wonders how anyone could conclude <a href=\"http://treesforlunch.blogspot.com/2011/08/science-by-flash-mob.html\">JD is running and hiding from PZ Myers</a>, when the Fowl Atheist is already fully occupied with running and hiding from me?  I attempt to explain the situation to a pair of rather dim-witted Pharyngulans who are having a hard time understanding why those who are not Ann Coulter feel no responsibility to debate PZ concerning what Ann Coulter wrote in one of her books.</p><blockquote><p>Mhich: “I’ve been looking into Vox Day’s blog and he indeed knows nothing about science. Even a fifth grader knows more about science than Vox Day’s.  And another thing: the only person I see that is dodging the challenge is you. If you know so much about evolution and consider Coulter’s book to be accurate, accept the Myer’s challenge. What do you have to lose?”</p><p>Reynold: “Myers mopped the floor with one of you people who supposedly knew something about science, and I posted a link to where Myers shows that Vox is ignorant as hell about science. Now, how about taking Myers up on his challenge? this is my THIRD ATTEMPT to get you to do that.  Or are you still going to dodge?”</p></blockquote><p>Messrs. Reynold and Mhich, why should JD, or anyone else for that matter, answer Myers’s challenge for someone other than Ann Coulter to defend Ann Coulter’s opinion, especially considering that the individual he is accused of “dodging” is known for doing some dodging of his own?  Only Ann Coulter has the responsibility to answer for her own words, the same responsibility that PZ Myers has to answer for his.  JD can no more argue with PZ on her behalf than he can argue with me on PZ’s.  Would you seriously consider it meaningful, or even remotely relevant, if JD were to debate me on PZ’s behalf, even if he relied entirely upon PZ’s written words?</p><p>The claim that JD is “dodging” this nonsensical “challenge” is more than a little ironic considering that PZ Myers is a confirmed coward who has twice dodged public challenges to debate me.  The first time, he ran from <a href=\"http://www.milobookclub.com/2008/06/09/challenge-to-pz-myers/\">the Northern Alliance’s invitation</a> to debate me after complaining that he had never been presented any intelligent arguments for the existence of gods.  Perhaps if he stopped running away to avoid them, he might find one. <a href=\"http://www.milobookclub.com/2009/08/10/mailvox-fowl-atheist-responds/\">He followed that up</a> by running and hiding from an invitation to engage in a written debate concerning the scientific evidence for evolution which specifically addressed his justifications for evading the previous challenge.</p><p>As for your claim that Myers showed I am “ignorant as hell about science”, <a href=\"http://www.milobookclub.com/2011/08/12/lecturing-butterfly-collector/\">my response to the error-filled post you cited</a> suffices to demonstrate that he did nothing of the kind.</p><p>What you clearly do not understand is that, <a href=\"http://scienceblogs.com/pharyngula/2011/05/we_arent_angry_were_effective.php\">by his own admission</a>, PZ relies heavily upon emotional arguments rather than logical ones when he cannot simply appeal to an established scientific consensus. <i>“I’ll also cop to the obvious fact that, knowing that reason will not get through their skills, I’m happy to use emotional arguments as well. Passion is persuasive.”</i> His tendency to rely upon emotional rhetoric and passion rather than reason is precisely why he is afraid to debate people who rely primarily upon logic, because his ability to present reason-based arguments is relatively low.  His ability to utilize reason is simply not equal to the skill of others who make use of it more effectively.  PZ is without question an effective preacher to the godless choir of science fetishists, but he is remarkably unskilled at presenting convincing arguments, let alone conclusive ones, to those who do not already agree with him.  Unlike you, he knows he is not an effective evangelist.</p><p>With regards to the applicability of economics, as Michael Shermer has pointed out in <i>The Mind of the Market</i>, there are far more similarities between economics and evolution than most people realize, dating back to the singular influence of Adam Smith’s Invisible Hand on Darwin’s subsequent articulation of his theory of natural selection.  Moreover, erroneous theories tend to have much in common, especially when they have become mainstream dogma.  As one who has played a small role in demonstrating the critical flaws in Neo-Keynesian/Neo-Classical economic models, I am actually rather well-equipped to identify similar flaws in the Neo-Darwinian conceptual model.  For example, I correctly identified that the natural selection component of the mechanism was a philosophical one, not a scientific one, and therefore potentially scientifically flawed, long before most believers in the Cult of Darwin became aware of the lack of genuine scientific evidence for it and the need to present various <s>epicycles</s>alternative mechanisms.</p><p>I don’t pretend to know anywhere nearly as much about biology as PZ, but it is always a mistake to assume that an individual with a smaller set of facts at his disposal must therefore be less correct regarding the subject.  Aristotelian dialectic may not always be a reliable substitute for science, but it is reliably more effective, more accurate, and more convincing to rational and unbiased observers than science-flavored, emotion-based rhetorical arguments.</p><p>It is more than a little embarrassing to the Pharyngulan community that the object of their regard doesn’t believe he can successfully win a debate with what they believe to be the equivalent of a fourth-grade elementary school student, especially when he continues to take the occasional potshot in my direction from the safety of his blog.  They can manufacture all the excuses and rationalizations for him they like, but the dodging, it is observed.</p></div>",
  "content_text": "One wonders how anyone could conclude\nJD is running and hiding from PZ Myers\n, when the Fowl Atheist is already fully occupied with running and hiding from me?  I attempt to explain the situation to a pair of rather dim-witted Pharyngulans who are having a hard time understanding why those who are not Ann Coulter feel no responsibility to debate PZ concerning what Ann Coulter wrote in one of her books.\nMhich: “I’ve been looking into Vox Day’s blog and he indeed knows nothing about science. Even a fifth grader knows more about science than Vox Day’s.  And another thing: the only person I see that is dodging the challenge is you. If you know so much about evolution and consider Coulter’s book to be accurate, accept the Myer’s challenge. What do you have to lose?”\nReynold: “Myers mopped the floor with one of you people who supposedly knew something about science, and I posted a link to where Myers shows that Vox is ignorant as hell about science. Now, how about taking Myers up on his challenge? this is my THIRD ATTEMPT to get you to do that.  Or are you still going to dodge?”\nMessrs. Reynold and Mhich, why should JD, or anyone else for that matter, answer Myers’s challenge for someone other than Ann Coulter to defend Ann Coulter’s opinion, especially considering that the individual he is accused of “dodging” is known for doing some dodging of his own?  Only Ann Coulter has the responsibility to answer for her own words, the same responsibility that PZ Myers has to answer for his.  JD can no more argue with PZ on her behalf than he can argue with me on PZ’s.  Would you seriously consider it meaningful, or even remotely relevant, if JD were to debate me on PZ’s behalf, even if he relied entirely upon PZ’s written words?\nThe claim that JD is “dodging” this nonsensical “challenge” is more than a little ironic considering that PZ Myers is a confirmed coward who has twice dodged public challenges to debate me.  The first time, he ran from\nthe Northern Alliance’s invitation\nto debate me after complaining that he had never been presented any intelligent arguments for the existence of gods.  Perhaps if he stopped running away to avoid them, he might find one.\nHe followed that up\nby running and hiding from an invitation to engage in a written debate concerning the scientific evidence for evolution which specifically addressed his justifications for evading the previous challenge.\nAs for your claim that Myers showed I am “ignorant as hell about science”,\nmy response to the error-filled post you cited\nsuffices to demonstrate that he did nothing of the kind.\nWhat you clearly do not understand is that,\nby his own admission\n, PZ relies heavily upon emotional arguments rather than logical ones when he cannot simply appeal to an established scientific consensus.\n“I’ll also cop to the obvious fact that, knowing that reason will not get through their skills, I’m happy to use emotional arguments as well. Passion is persuasive.”\nHis tendency to rely upon emotional rhetoric and passion rather than reason is precisely why he is afraid to debate people who rely primarily upon logic, because his ability to present reason-based arguments is relatively low.  His ability to utilize reason is simply not equal to the skill of others who make use of it more effectively.  PZ is without question an effective preacher to the godless choir of science fetishists, but he is remarkably unskilled at presenting convincing arguments, let alone conclusive ones, to those who do not already agree with him.  Unlike you, he knows he is not an effective evangelist.\nWith regards to the applicability of economics, as Michael Shermer has pointed out in\nThe Mind of the Market\n, there are far more similarities between economics and evolution than most people realize, dating back to the singular influence of Adam Smith’s Invisible Hand on Darwin’s subsequent articulation of his theory of natural selection.  Moreover, erroneous theories tend to have much in common, especially when they have become mainstream dogma.  As one who has played a small role in demonstrating the critical flaws in Neo-Keynesian/Neo-Classical economic models, I am actually rather well-equipped to identify similar flaws in the Neo-Darwinian conceptual model.  For example, I correctly identified that the natural selection component of the mechanism was a philosophical one, not a scientific one, and therefore potentially scientifically flawed, long before most believers in the Cult of Darwin became aware of the lack of genuine scientific evidence for it and the need to present various\nepicycles\nalternative mechanisms.\nI don’t pretend to know anywhere nearly as much about biology as PZ, but it is always a mistake to assume that an individual with a smaller set of facts at his disposal must therefore be less correct regarding the subject.  Aristotelian dialectic may not always be a reliable substitute for science, but it is reliably more effective, more accurate, and more convincing to rational and unbiased observers than science-flavored, emotion-based rhetorical arguments.\nIt is more than a little embarrassing to the Pharyngulan community that the object of their regard doesn’t believe he can successfully win a debate with what they believe to be the equivalent of a fourth-grade elementary school student, especially when he continues to take the occasional potshot in my direction from the safety of his blog.  They can manufacture all the excuses and rationalizations for him they like, but the dodging, it is observed.",
  "tags": [
    "Science Reason"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-28T07:33:00+00:00"
}