{
  "url": "https://voxday.net/2011/08/21/conan-torturer/",
  "scraped_at": "2025-12-13T23:19:39.911200",
  "title": "Conan the Torturer",
  "date_display": "August 21, 2011",
  "date_iso": "2011-08-21T09:41:00+00:00",
  "date_from_url": "2011-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The intrepid Leo Grin isn’t what one would call delighted with the new Conan movie:</p><blockquote><p>Saw <i>Conan the Barbarian</i> last night. Revoltingly stupid, incomprehensibly plotted and edited, and overflowing with the kind of quasi-erotic torture porn (seemingly pulled wholesale out of a serial killer’s wet dreams) that’s become a staple of both fantasy literature and Hollywood films this century. Easily one of the worst films I’ve seen during decades of painfully slumming through mediocre genre fare — I daresay even Uwe Boll (the ham-fisted director commonly seen as the modern era’s answer to Ed Wood) has never made anything this irredeemably rotten.</p></blockquote><p>I daresay we can soon expect to hear from the admirers of the New Epic Nihilism informing us that Leo has once again managed to miss the point, that the new <i>Conan the Barbarian</i> film is, in fact, a brilliant reinvention of a genre that had grown tired and stale, that it is admirably adult in its moral ambiguity and creative depravity, and may be the greatest film since <i>Citizen Kane</i>. Which leads me to contemplate two things. First, since when did “adult” come to imply torture, incest, and rape? I mean, I enjoy spending a quiet Saturday night creeping about the bushes at the local university armed with chloroform and a knife in search of a new friend to bring back to my soundproofed playroom as much as anyone, but sometimes one would like a little escapism in one’s fantasy entertainment.  You know, just a simple quest to find the Macguffin, defeat the Foozle, and save the world or something would be nice.</p><p>Read the rest <a href=\"http://www.blackgate.com/2011/08/21/conan-the-torturer/\">at the Black Gate</a>.</p><p>I also thought Sean Stiennon’s recent post on <a href=\"http://www.blackgate.com/2011/08/20/24710/\">Elf Opera in Tang China</a> was worth reading.  He highlights the same problem with current fantasy fiction, albeit from a different perspective, that I first addressed in my essay published in BenBella’s <i>Reinventing Narnia</i>.</p></div>",
  "content_text": "The intrepid Leo Grin isn’t what one would call delighted with the new Conan movie:\nSaw\nConan the Barbarian\nlast night. Revoltingly stupid, incomprehensibly plotted and edited, and overflowing with the kind of quasi-erotic torture porn (seemingly pulled wholesale out of a serial killer’s wet dreams) that’s become a staple of both fantasy literature and Hollywood films this century. Easily one of the worst films I’ve seen during decades of painfully slumming through mediocre genre fare — I daresay even Uwe Boll (the ham-fisted director commonly seen as the modern era’s answer to Ed Wood) has never made anything this irredeemably rotten.\nI daresay we can soon expect to hear from the admirers of the New Epic Nihilism informing us that Leo has once again managed to miss the point, that the new\nConan the Barbarian\nfilm is, in fact, a brilliant reinvention of a genre that had grown tired and stale, that it is admirably adult in its moral ambiguity and creative depravity, and may be the greatest film since\nCitizen Kane\n. Which leads me to contemplate two things. First, since when did “adult” come to imply torture, incest, and rape? I mean, I enjoy spending a quiet Saturday night creeping about the bushes at the local university armed with chloroform and a knife in search of a new friend to bring back to my soundproofed playroom as much as anyone, but sometimes one would like a little escapism in one’s fantasy entertainment.  You know, just a simple quest to find the Macguffin, defeat the Foozle, and save the world or something would be nice.\nRead the rest\nat the Black Gate\n.\nI also thought Sean Stiennon’s recent post on\nElf Opera in Tang China\nwas worth reading.  He highlights the same problem with current fantasy fiction, albeit from a different perspective, that I first addressed in my essay published in BenBella’s\nReinventing Narnia\n.",
  "tags": [
    "Black Gate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-21T08:41:00+00:00"
}