{
  "url": "https://voxday.net/2011/08/25/corruption-usa-2/",
  "scraped_at": "2025-12-13T23:20:04.187479",
  "title": "Corruption USA",
  "date_display": "August 25, 2011",
  "date_iso": "2011-08-25T19:51:00+00:00",
  "date_from_url": "2011-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is unsurprising, but <a href=\"http://www.nytimes.com/2011/08/22/business/schneiderman-is-said-to-face-pressure-to-back-bank-deal.html?_r=1\">seriously bad news</a> even so:</p><blockquote><p>Eric T. Schneiderman, the attorney general of New York, has come under increasing pressure from the Obama administration to drop his opposition to a wide-ranging state settlement with banks over dubious foreclosure practices, according to people briefed on discussions about the deal.</p><p>In recent weeks, Shaun Donovan, the secretary of Housing and Urban Development, and high-level Justice Department officials have been waging an intensifying campaign to try to persuade the attorney general to support the settlement, said the people briefed on the talks….</p><p>Not surprising, the large banks, which are eager to reach a settlement, have grown increasingly frustrated with Mr. Schneiderman. Bank officials recently discussed asking Mr. Donovan for help in changing the attorney general’s mind, according to a person briefed on those talks.  In an interview on Friday, Mr. Donovan defended his discussions with the attorney general, saying they were motivated by a desire to speed up help for troubled homeowners.</p></blockquote><p>In other words, the White House is attempting to shut down the joint 50-state investigation in order to whitewash literally years of massive criminal wrongdoing by the mortgage banks, then change the laws after the fact so that all of the titles they shredded in MERS are magically returned to the banks.  Their problem is that they need to get the 50 state attorney generals to sign off on the deal.  Obviously, most of these champions of the law have already agreed to be bought, so they’re leaning on the last few holdouts now.</p><p>This clearly demonstrates that there is not only no law in the USA anymore, there is barely a <i>pretense</i> at it.  Instead of shutting down the criminal organizations and imprisoning the executives responsible, they will agree upon a small fine and cover up their crimes, which include but are not limited to stealing thousands, if not hundreds of thousands, of houses from homebuyers.</p><p>And the reason they need to get a deal done and let the banks off the hook?  To help homeowners.  Seriously.  That’s the line they’re selling.</p></div>",
  "content_text": "This is unsurprising, but\nseriously bad news\neven so:\nEric T. Schneiderman, the attorney general of New York, has come under increasing pressure from the Obama administration to drop his opposition to a wide-ranging state settlement with banks over dubious foreclosure practices, according to people briefed on discussions about the deal.\nIn recent weeks, Shaun Donovan, the secretary of Housing and Urban Development, and high-level Justice Department officials have been waging an intensifying campaign to try to persuade the attorney general to support the settlement, said the people briefed on the talks….\nNot surprising, the large banks, which are eager to reach a settlement, have grown increasingly frustrated with Mr. Schneiderman. Bank officials recently discussed asking Mr. Donovan for help in changing the attorney general’s mind, according to a person briefed on those talks.  In an interview on Friday, Mr. Donovan defended his discussions with the attorney general, saying they were motivated by a desire to speed up help for troubled homeowners.\nIn other words, the White House is attempting to shut down the joint 50-state investigation in order to whitewash literally years of massive criminal wrongdoing by the mortgage banks, then change the laws after the fact so that all of the titles they shredded in MERS are magically returned to the banks.  Their problem is that they need to get the 50 state attorney generals to sign off on the deal.  Obviously, most of these champions of the law have already agreed to be bought, so they’re leaning on the last few holdouts now.\nThis clearly demonstrates that there is not only no law in the USA anymore, there is barely a\npretense\nat it.  Instead of shutting down the criminal organizations and imprisoning the executives responsible, they will agree upon a small fine and cover up their crimes, which include but are not limited to stealing thousands, if not hundreds of thousands, of houses from homebuyers.\nAnd the reason they need to get a deal done and let the banks off the hook?  To help homeowners.  Seriously.  That’s the line they’re selling.",
  "tags": [
    "banks",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-25T18:51:00+00:00"
}