{
  "url": "https://voxday.net/2011/08/24/darwinist-demands-darwinian-litmus-tes/",
  "scraped_at": "2025-12-13T23:19:56.765979",
  "title": "Darwinist demands Darwinian litmus test",
  "date_display": "August 24, 2011",
  "date_iso": "2011-08-24T18:51:00+00:00",
  "date_from_url": "2011-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In other news, Roger Clemens today announced that “throwing like a girl” should <a href=\"http://www.washingtonpost.com/blogs/on-faith/post/attention-governor-perry-evolution-is-a-fact/2011/08/23/gIQAuIFUYJ_blog.html\">disqualify a politician from the presidency</a>.</p><blockquote><p>A politician’s attitude to evolution is perhaps not directly important in itself. It can have unfortunate consequences on education and science policy but, compared to Perry’s and the Tea Party’s pronouncements on other topics such as economics, taxation, history and sexual politics, their ignorance of evolutionary science might be overlooked. Except that a politician’s attitude to evolution, however peripheral it might seem, is a surprisingly apposite litmus test of more general inadequacy. This is because unlike, say, string theory where scientific opinion is genuinely divided, there is about the fact of evolution no doubt at all. Evolution is a fact, as securely established as any in science, and he who denies it betrays woeful ignorance and lack of education, which likely extends to other fields as well. Evolution is not some recondite backwater of science, ignorance of which would be pardonable. It is the stunningly simple but elegant explanation of our very existence and the existence of every living creature on the planet. Thanks to Darwin, we now understand why we are here and why we are the way we are. You cannot be ignorant of evolution and be a cultivated and adequate citizen of today.</p></blockquote><p>Richard Dawkins again demonstrates that he is an unmitigated moron.  Perry may be an “uneducated ignoramus”, but Dawkins is nothing more than an educated one.  But what is always amusing is his narcissistic myopia.  The entire world is in the midst of an economic meltdown that threatens the global financial system, so naturally he is very, very concerned that the next U.S. president must be a True Believer in the Cult of Darwin.</p><p>If Dawkins actually cared about science, he would be enthusiastically supporting a snake-handling fundamentalist who believed the world was created exactly 6,000 years ago so long as said Creationist was cognizant of economic reality, which none of the current presidential candidates except Ron Paul happen to be.  The ongoing Great Depression 2.0 will do far more damage to science than an outright ban on the teaching of evolution in the public schools ever could.</p><p>The fact is that neither the president nor anyone else actually needs to know a damn thing about evolution or the intrinsically unscientific principle – it is based on logic, not science – that is “natural selection”.  Even biologists who are performing cutting edge work in genetic science don’t necessarily need to know anything about either.  Almost no one does.</p><p>Moreover, Dawkins is a liar.  He lies, and he knows he lies, when he says: “Evolution is a fact, as securely established as any in science.”  Let’s see the scientific experiment that demonstrates that “fact”, then see it replicated three more times for good measure.  Other scientists can manage this effortlessly, so why can’t Mr. Dawkins?  Because, obviously, evolution is not a fact – which Dawkins admits in his most recent book – nor is it anywhere nearly as securely established as a plethora of scientific hypotheses. And that is a fact.  An actual, verifiable one.</p><p>The Cult of Darwin must be getting desperate indeed if they are resorting to attempting to pass off outright lies in this manner.  Moreover, three years after getting spanked on his embrace of the stupid Red State argument, Dawkins still clearly knows nothing about the American political system.  It is not the Republican Party that depends upon the uneducated vote, but the Democratic Party, as CNN exit polls have shown after the 2008, 2004, and 2000 presidential elections.</p><p>“Voters with postgraduate schooling were only 25 percent more likely to vote for the Democratic Party presidential candidate in 2004 while those who did not complete high school were 90 percent more likely to identify themselves as Democrats. Since there are 75 percent more Americans who never completed high school (16.4 percent of adults over twenty-five) than possess an advanced degree (9.4 percent), this means that despite their reputation for being the party of the most highly educated, a Democrat is nevertheless more than twice as likely to be someone who has dropped out of high school than an individual with a master’s degree.”<br> – <i>The Irrational Atheist</i>, pp 18-19</br></p><p>Dawkins concludes: <i>“The ‘evolution question’ deserves a prominent place in the list of questions put to candidates in interviews and public debates during the course of the coming election.”</i></p><p>Absolutely it does.  I would LOVE to see it given a prominent place in the debates.  Because wouldn’t it be amusing to see the look on Dawkins’s face when all the Democrats he admires stand up and deny evolution in perfect lockstep with all the Republican candidates!  And it would be an excellent method of keeping those potentially deadly atheist utopians out of high office.</p></div>",
  "content_text": "In other news, Roger Clemens today announced that “throwing like a girl” should\ndisqualify a politician from the presidency\n.\nA politician’s attitude to evolution is perhaps not directly important in itself. It can have unfortunate consequences on education and science policy but, compared to Perry’s and the Tea Party’s pronouncements on other topics such as economics, taxation, history and sexual politics, their ignorance of evolutionary science might be overlooked. Except that a politician’s attitude to evolution, however peripheral it might seem, is a surprisingly apposite litmus test of more general inadequacy. This is because unlike, say, string theory where scientific opinion is genuinely divided, there is about the fact of evolution no doubt at all. Evolution is a fact, as securely established as any in science, and he who denies it betrays woeful ignorance and lack of education, which likely extends to other fields as well. Evolution is not some recondite backwater of science, ignorance of which would be pardonable. It is the stunningly simple but elegant explanation of our very existence and the existence of every living creature on the planet. Thanks to Darwin, we now understand why we are here and why we are the way we are. You cannot be ignorant of evolution and be a cultivated and adequate citizen of today.\nRichard Dawkins again demonstrates that he is an unmitigated moron.  Perry may be an “uneducated ignoramus”, but Dawkins is nothing more than an educated one.  But what is always amusing is his narcissistic myopia.  The entire world is in the midst of an economic meltdown that threatens the global financial system, so naturally he is very, very concerned that the next U.S. president must be a True Believer in the Cult of Darwin.\nIf Dawkins actually cared about science, he would be enthusiastically supporting a snake-handling fundamentalist who believed the world was created exactly 6,000 years ago so long as said Creationist was cognizant of economic reality, which none of the current presidential candidates except Ron Paul happen to be.  The ongoing Great Depression 2.0 will do far more damage to science than an outright ban on the teaching of evolution in the public schools ever could.\nThe fact is that neither the president nor anyone else actually needs to know a damn thing about evolution or the intrinsically unscientific principle – it is based on logic, not science – that is “natural selection”.  Even biologists who are performing cutting edge work in genetic science don’t necessarily need to know anything about either.  Almost no one does.\nMoreover, Dawkins is a liar.  He lies, and he knows he lies, when he says: “Evolution is a fact, as securely established as any in science.”  Let’s see the scientific experiment that demonstrates that “fact”, then see it replicated three more times for good measure.  Other scientists can manage this effortlessly, so why can’t Mr. Dawkins?  Because, obviously, evolution is not a fact – which Dawkins admits in his most recent book – nor is it anywhere nearly as securely established as a plethora of scientific hypotheses. And that is a fact.  An actual, verifiable one.\nThe Cult of Darwin must be getting desperate indeed if they are resorting to attempting to pass off outright lies in this manner.  Moreover, three years after getting spanked on his embrace of the stupid Red State argument, Dawkins still clearly knows nothing about the American political system.  It is not the Republican Party that depends upon the uneducated vote, but the Democratic Party, as CNN exit polls have shown after the 2008, 2004, and 2000 presidential elections.\n“Voters with postgraduate schooling were only 25 percent more likely to vote for the Democratic Party presidential candidate in 2004 while those who did not complete high school were 90 percent more likely to identify themselves as Democrats. Since there are 75 percent more Americans who never completed high school (16.4 percent of adults over twenty-five) than possess an advanced degree (9.4 percent), this means that despite their reputation for being the party of the most highly educated, a Democrat is nevertheless more than twice as likely to be someone who has dropped out of high school than an individual with a master’s degree.”\n–\nThe Irrational Atheist\n, pp 18-19\nDawkins concludes:\n“The ‘evolution question’ deserves a prominent place in the list of questions put to candidates in interviews and public debates during the course of the coming election.”\nAbsolutely it does.  I would LOVE to see it given a prominent place in the debates.  Because wouldn’t it be amusing to see the look on Dawkins’s face when all the Democrats he admires stand up and deny evolution in perfect lockstep with all the Republican candidates!  And it would be an excellent method of keeping those potentially deadly atheist utopians out of high office.",
  "tags": [
    "atheism",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-24T17:51:00+00:00"
}