{
  "url": "https://voxday.net/2011/08/19/dude-let-it-go-already/",
  "scraped_at": "2025-12-13T23:19:27.070441",
  "title": "The Wangst that Comes After",
  "date_display": "August 19, 2011",
  "date_iso": "2011-08-19T10:38:00+00:00",
  "date_from_url": "2011-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am beginning to conclude that SFWA President-For-Life John Scalzi needs to sit Mr. R.S. Bakker down for <a href=\"http://whatever.scalzi.com/2007/01/13/fans-what-do-we-owe-them/\">a remedial lesson</a> in handling criticism.  I’m not saying Bakker is quite as wangsty as the hapless Laurell K. Hamilton, as was most famously exhibited in her post-<i>Incubus Dreams</i> <a href=\"http://wiki.fandomwank.com/index.php/Laurell_K._Hamilton\">meltdown</a>, but he’s <a href=\"http://rsbakker.wordpress.com/2011/08/17/the-show-must-grate-on/\">definitely beginning</a> to show <a href=\"http://rsbakker.wordpress.com/2011/08/16/sweet-manna/\">serious indications</a> of having the potential to go critical.</p><p>Consider, compare, and contrast the two.</p><p>Hamilton: <i>I’m sure there are other books out there that will make you happier than mine. There are books with less sex in them, God knows. There are books that don’t make you think that hard. Books that don’t push you past that comfortable envelope of the mundane. If you want to be comforted, don’t read my books. They aren’t comfortable books. They are books that push my character and me to the edge and beyond of our comfort zones. If that’s not want you want, then stop reading. Put my books away with other things that frighten and confuse or just piss you off.</i></p><p>Bakker: (1) <i>“These guys are strictly bush league in comparison. There’s nothing anybody’s said that has prickled enough to jarr me from my experimental mindset–yet….  And as far as the books go, I actually think this stuff demonstrates that my writing, for better or worse, is rich enough to support a wild, wild variety of competing interpretations. And most important of all, that it’s actually reaching people who can be outraged.”</i></p><p>(2) <i>“Reading Theo’s review, and you would think someone was being raped every other page (rather than every other other page)! Not only did the sex really, really, really stand out for him, but it really, really, really offended him as well, apparently enough to overpower what he did like about the books. Fair enough, I suppose, but given that the first book is called The Darkness that Comes Before (!), and given that the irrational springs of human action are a primary focus of the book, and given that sex is one of those springs (history and appetite are everywhere: if anything there’s far more ‘history porn’ in the books than sexual porn), you would at least think that he would reference this connection…  I guess he missed it.”</i></p><p>You really have to have read <i>Incubus Dreams</i> to appreciate the full humor of Hamilton’s rant.  How hard does she believe people have to think in order to keep straight who is putting what where?  But first, oversensitive, self-important authors, GET OVER YOURSELVES ALREADY!  To quote the immortal words of Robert Anton Wilson, “Nietzsche masturbates too much.”  Here is an important guideline for the author who is disappointed with a review: if your response to criticism of your work contains the words “comfort zone”,  “interpretation”, or “push”, or if you write more words in response to a review than were contained in the actual review, you are officially engaging in authorial wangst.  Cease and desist.  It is unseemly and neither enhances your reputation nor improves the content of your books.</p><p>Second, Bakker is demonstrating an increasing degree of delusion in repeatedly claiming that no one has presented any arguments to him.  He has required basic factual correction about nearly everything he assumed about me, all of which was part of a totally irrelevant <i>ad hom</i> response anyway.  (One wonders what his response would have been if I’d actually ripped his three books as I have in the cases of Jordan and Goodkind.)  Bakker is too parochial – and I mean that in <a href=\"http://dictionary.reference.com/browse/parochial\">the original sense of the term</a>, as he is quite literally a provincial and for all I know still lives with his mommy in his childhood Canadian home – to grasp that the scope of my international perspective absolutely dwarfs his “I went to grad school in America and my professors told me all this neat stuff” point of view.  What Bakker has only imagined and theorized and read about second-hand is part of my actual experience; the most remarkable thing about humanity around the world is how strikingly <i>similar </i>the attitudes of the Japanese rice farmers are to the dialect-speaking mountain clans of northern Italy and the tobacco-growing farmers of southern France.  The same holds true for the self-overrated educated classes from Harvard and ToDai to Oxford and the Sorbonne.  Seeing a guy who didn’t manage to complete a doctorate at Vanderbilt and can’t tell the difference between a libertarian and a fascist attempt to strike the conventional pose of the latter is simply… well, it’s a little ironic, anyhow.</p><p>Two days ago, I was having dinner with a European ambassador to a large South American country and attempting to convince her, and the international hostage negotiator on my other side, that trained, intelligence-enhanced sharks equipped with laser harnesses were the answer to the growing Somali ship-jacking problem being discussed.*  Yesterday, I was lifting weights with an unemployed African who lives on social benefits and is hoping to somehow avoid eventual deportation.  Today, I’ll go to the recycling center to ask the captain of my calcio team, who is one of the trash men, what time we play our first game of the season.  This range of experience does not tend to lend itself to a closed mind.  Bakker doesn’t realize that what he decries as “certainty” is actually nothing more than experience-informed probability calculation and pattern recognition.  There is no reason one cannot take a logically sound position with confidence without having to assume the total impossibility of error in doing so.</p><p>Third, Bakker can afford to pretend – and it is a pretense, nothing more – to be uncertain about everything because he is a fantasy writer and his positions on pretty much everything are inconsequential.  Those of us who deal with objective real-world issues such as the current price of gold, the ForEx rates, and the $53-trillion inflation/deflation question on a regular basis understand that there are situations concerning which one must make black-and-white decisions even though any degree of certainty about what will happen tomorrow is <i>utterly impossible</i>.  To claim that any sane economist, or any trader, is prone to an unusual degree of epistemic arrogance is not merely stupid, it is profoundly ignorant.  Take that most iron-clad law of economics, the Law of Supply and Demand.  I can cite multiple exceptions to it, beginning with Veblen and conspicuous consumption, off the top of my head.  Even that most closed-minded of economists, Paul Krugman, may sound absolutely certain in his assertive, Nobel Prize-winning pronouncements, but he sounds that way even as he changes his definition of inflation from one column to the next.</p><p>This is why Bakker’s entire attempt to respond to the Black Gate review in the form of an ad hominem attack is not only irrelevant and pointless, it is also incorrect.  Note that Bakker’s pretentious blathering about “epistemic arrogance” is simply a variation on the left-wing <i>meme du saison</i>, <a href=\"http://www.juliansanchez.com/2010/03/26/frum-cocktail-parties-and-the-threat-of-doubt/\">epistemic closure</a>.  I would venture to bet, as Nate has already noted, that I have publicly changed my mind about more intellectually significant issues than Bakker ever has about <i>anything</i>.  That’s a verifiable claim of fact: has Bakker ever a) changed his public position on the legitimacy of a war, b) changed his public position on a core element of his philosophy as I have with regards to Ricardian free trade, the core mechanism for the Austrian business cycle, and before that, Chicago School monetarism or c) actually made a substantive case for any of his ideological assumptions such as human equality, female suffrage, or what he describes as “moral realism”?  Should Bakker’s fanboys be able to demonstrate otherwise, I will readily admit I am wrong… but if they cannot, will they admit that Bakker is?</p><p>The primary difference between Bakker and me is that he insists on operating in relative ignorance while avoiding the use of objective metrics that can be verified by third parties.  I do not.  I read his books before I reached any conclusions about them.  He merely scanned my blog before retreating to his fainting couch.  La, such <i>fascism </i>, such <i>conservatism</i>, among the radical libertarians – Mussolini wept!   I tend to doubt Bakker has ever given as serious credence to someone whose foundational assumptions fundamentally challenge his own as I did in my recent interview with the Post-Keynesian economist Steve Keen.  I suggest Mr. Bakker should <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=332461\">listen to that interview </a>before he further embarrasses himself with more idiotic accusations concerning my “epistemic arrogance”; even if he doesn’t understand economics well enough to comprehend the vast gulf that separates the Austrian from the Post-Keynesian, he is intelligent enough to be aware that there is a substantive difference between the two competing viewpoints.</p><p>The fact is that Bakker’s books, while intelligent and laudably ambitious, are nowhere nearly as deep and complex and sophisticated as he would apparently like to believe.  The fact that the reader does not pick up one aspect or another doesn’t make a book brilliant or render its review incorrect; the Black Gate reviewer of <i>Summa Elvetica</i> erroneously, and rather hilariously, concluded that the philosophical arguments for the Elvish soul that were presented in the structural form of the arguments from the <i>Summa Theologica</i> were actually written by Thomas Aquinas, and yet his review was a fair and judicious one that managed to precisely identify the primary flaw in the book.</p><p>Bakker needs to grow up, both intellectually and emotionally.  He’s not a misunderstood genius whose transgressive work outrages the morally repressed plebs even as it opens their conservative eyes to astonishing new philosophical insights.  Hell, judging by the Internet reaction, my WND columns are far more outrageous and eye-opening than anything Bakker has ever written.  The concepts he is utilizing are neither new nor difficult for anyone with a +1SD IQ to grasp.  His <a href=\"http://asoiaf.westeros.org/index.php/topic/34102-bakker-and-women/page__st__160__p__1677052#entry1677052\">inclination for sockpuppetry</a> is childish and misguided, his sensitivity rivals that of an emo chick, and his philosophy is juvenile.  And yet, he has genuine talent for writing intelligent fantasy.  So, there is still hope for him, as he certainly wouldn’t be the first writer to look back on what he once considered deep and meaningful brilliance with a mortified shudder.</p><p>Any idiot can be uncertain.  “I dunno” is not an indicator of superior intelligence and there is nothing intrinsically intelligent about doubt.  The imperative is to learn enough to be able to ask the relevant questions, which then provide a solid foundation for ascertaining the highest-probability answers.</p><p> *<i>Much hilarity ensued when the hostage negotiator pointed out the fatal flaw in my plan.  He expressed a certain disinclination to find himself 20 years from now wearing an armored scuba suit while negotiating underwater with superintelligent, laser-armed sharks in order to get his client’s ships back.</i></p><p>UPDATE – Sweet Friedrich Nietzsche, but R. Scott Bakker really can be a wangsty little girl. <a href=\"http://rsbakker.wordpress.com/2011/08/19/foil-as-meme-delivery-vehicle/\">Now he’s whining</a> that I have “lot’s and lot’s of theories” about him, which is ironic considering the amount of erroneous psychobabble he has been directing in my direction from the start.  I have no theories, I have merely read his books and observed his behavior.  But, since I make a practice of answering questions, I’ll go ahead and answer the one he wrongly imagines I have been avoiding.</p><p><b>“What makes him think he’s won the Magical Belief and Identity Lottery?”</b></p><p>Oh, I don’t know.  Out of nearly 7 billion people, I’m fortunate to be in the top 1% in the planet with regards to health, wealth, looks, brains, athleticism, and nationality.  My wife is slender, beautiful, lovable, loyal, fertile, and funny.  I meet good people who seem to enjoy my company everywhere I go.  That all seems pretty lucky to me, considering that my entire contribution to the situation was choosing my parents well.  I am grateful and I thank God every day for the ticket He has dealt me.  If I’m not a birth lottery winner, then who is?  The kid in the Congo who just got his hands chopped off and is getting raped for the fourth time today?  To paraphrase the immortal parental wisdom of PJ O’Rourke, anyone in my position had damn well better get down on their knees and pray that life does not become fair.</p><p>As for belief, I don’t concern myself in the slightest with the perfect correspondence of my beliefs with What Is So or not.  They either do or they don’t, but regardless, the Absolute Truth of Creation doesn’t depend upon what I happen to believe it to be at the moment and I don’t think such correspondence is even <i>theoretically</i> possible.  Bakker simply doesn’t understand that I don’t believe his opinion, my opinion, or anyone else’s opinion matters in the least, except in how they happen to affect our decisions and subsequent actions.  See <i>Human Action</i> for details.  If Bakker genuinely wanted to figure out my core outlook on life, he should have simply listened to <i><a href=\"http://www.voxday.net/tox/Psykosonik-Sunyata.mp3\">Sunyata </a></i> in the first place rather than waste his time on perusing the blog.</p></div>",
  "content_text": "I am beginning to conclude that SFWA President-For-Life John Scalzi needs to sit Mr. R.S. Bakker down for\na remedial lesson\nin handling criticism.  I’m not saying Bakker is quite as wangsty as the hapless Laurell K. Hamilton, as was most famously exhibited in her post-\nIncubus Dreams\nmeltdown\n, but he’s\ndefinitely beginning\nto show\nserious indications\nof having the potential to go critical.\nConsider, compare, and contrast the two.\nHamilton:\nI’m sure there are other books out there that will make you happier than mine. There are books with less sex in them, God knows. There are books that don’t make you think that hard. Books that don’t push you past that comfortable envelope of the mundane. If you want to be comforted, don’t read my books. They aren’t comfortable books. They are books that push my character and me to the edge and beyond of our comfort zones. If that’s not want you want, then stop reading. Put my books away with other things that frighten and confuse or just piss you off.\nBakker: (1)\n“These guys are strictly bush league in comparison. There’s nothing anybody’s said that has prickled enough to jarr me from my experimental mindset–yet….  And as far as the books go, I actually think this stuff demonstrates that my writing, for better or worse, is rich enough to support a wild, wild variety of competing interpretations. And most important of all, that it’s actually reaching people who can be outraged.”\n(2)\n“Reading Theo’s review, and you would think someone was being raped every other page (rather than every other other page)! Not only did the sex really, really, really stand out for him, but it really, really, really offended him as well, apparently enough to overpower what he did like about the books. Fair enough, I suppose, but given that the first book is called The Darkness that Comes Before (!), and given that the irrational springs of human action are a primary focus of the book, and given that sex is one of those springs (history and appetite are everywhere: if anything there’s far more ‘history porn’ in the books than sexual porn), you would at least think that he would reference this connection…  I guess he missed it.”\nYou really have to have read\nIncubus Dreams\nto appreciate the full humor of Hamilton’s rant.  How hard does she believe people have to think in order to keep straight who is putting what where?  But first, oversensitive, self-important authors, GET OVER YOURSELVES ALREADY!  To quote the immortal words of Robert Anton Wilson, “Nietzsche masturbates too much.”  Here is an important guideline for the author who is disappointed with a review: if your response to criticism of your work contains the words “comfort zone”,  “interpretation”, or “push”, or if you write more words in response to a review than were contained in the actual review, you are officially engaging in authorial wangst.  Cease and desist.  It is unseemly and neither enhances your reputation nor improves the content of your books.\nSecond, Bakker is demonstrating an increasing degree of delusion in repeatedly claiming that no one has presented any arguments to him.  He has required basic factual correction about nearly everything he assumed about me, all of which was part of a totally irrelevant\nad hom\nresponse anyway.  (One wonders what his response would have been if I’d actually ripped his three books as I have in the cases of Jordan and Goodkind.)  Bakker is too parochial – and I mean that in\nthe original sense of the term\n, as he is quite literally a provincial and for all I know still lives with his mommy in his childhood Canadian home – to grasp that the scope of my international perspective absolutely dwarfs his “I went to grad school in America and my professors told me all this neat stuff” point of view.  What Bakker has only imagined and theorized and read about second-hand is part of my actual experience; the most remarkable thing about humanity around the world is how strikingly\nsimilar\nthe attitudes of the Japanese rice farmers are to the dialect-speaking mountain clans of northern Italy and the tobacco-growing farmers of southern France.  The same holds true for the self-overrated educated classes from Harvard and ToDai to Oxford and the Sorbonne.  Seeing a guy who didn’t manage to complete a doctorate at Vanderbilt and can’t tell the difference between a libertarian and a fascist attempt to strike the conventional pose of the latter is simply… well, it’s a little ironic, anyhow.\nTwo days ago, I was having dinner with a European ambassador to a large South American country and attempting to convince her, and the international hostage negotiator on my other side, that trained, intelligence-enhanced sharks equipped with laser harnesses were the answer to the growing Somali ship-jacking problem being discussed.*  Yesterday, I was lifting weights with an unemployed African who lives on social benefits and is hoping to somehow avoid eventual deportation.  Today, I’ll go to the recycling center to ask the captain of my calcio team, who is one of the trash men, what time we play our first game of the season.  This range of experience does not tend to lend itself to a closed mind.  Bakker doesn’t realize that what he decries as “certainty” is actually nothing more than experience-informed probability calculation and pattern recognition.  There is no reason one cannot take a logically sound position with confidence without having to assume the total impossibility of error in doing so.\nThird, Bakker can afford to pretend – and it is a pretense, nothing more – to be uncertain about everything because he is a fantasy writer and his positions on pretty much everything are inconsequential.  Those of us who deal with objective real-world issues such as the current price of gold, the ForEx rates, and the $53-trillion inflation/deflation question on a regular basis understand that there are situations concerning which one must make black-and-white decisions even though any degree of certainty about what will happen tomorrow is\nutterly impossible\n.  To claim that any sane economist, or any trader, is prone to an unusual degree of epistemic arrogance is not merely stupid, it is profoundly ignorant.  Take that most iron-clad law of economics, the Law of Supply and Demand.  I can cite multiple exceptions to it, beginning with Veblen and conspicuous consumption, off the top of my head.  Even that most closed-minded of economists, Paul Krugman, may sound absolutely certain in his assertive, Nobel Prize-winning pronouncements, but he sounds that way even as he changes his definition of inflation from one column to the next.\nThis is why Bakker’s entire attempt to respond to the Black Gate review in the form of an ad hominem attack is not only irrelevant and pointless, it is also incorrect.  Note that Bakker’s pretentious blathering about “epistemic arrogance” is simply a variation on the left-wing\nmeme du saison\n,\nepistemic closure\n.  I would venture to bet, as Nate has already noted, that I have publicly changed my mind about more intellectually significant issues than Bakker ever has about\nanything\n.  That’s a verifiable claim of fact: has Bakker ever a) changed his public position on the legitimacy of a war, b) changed his public position on a core element of his philosophy as I have with regards to Ricardian free trade, the core mechanism for the Austrian business cycle, and before that, Chicago School monetarism or c) actually made a substantive case for any of his ideological assumptions such as human equality, female suffrage, or what he describes as “moral realism”?  Should Bakker’s fanboys be able to demonstrate otherwise, I will readily admit I am wrong… but if they cannot, will they admit that Bakker is?\nThe primary difference between Bakker and me is that he insists on operating in relative ignorance while avoiding the use of objective metrics that can be verified by third parties.  I do not.  I read his books before I reached any conclusions about them.  He merely scanned my blog before retreating to his fainting couch.  La, such\nfascism\n, such\nconservatism\n, among the radical libertarians – Mussolini wept!   I tend to doubt Bakker has ever given as serious credence to someone whose foundational assumptions fundamentally challenge his own as I did in my recent interview with the Post-Keynesian economist Steve Keen.  I suggest Mr. Bakker should\nlisten to that interview\nbefore he further embarrasses himself with more idiotic accusations concerning my “epistemic arrogance”; even if he doesn’t understand economics well enough to comprehend the vast gulf that separates the Austrian from the Post-Keynesian, he is intelligent enough to be aware that there is a substantive difference between the two competing viewpoints.\nThe fact is that Bakker’s books, while intelligent and laudably ambitious, are nowhere nearly as deep and complex and sophisticated as he would apparently like to believe.  The fact that the reader does not pick up one aspect or another doesn’t make a book brilliant or render its review incorrect; the Black Gate reviewer of\nSumma Elvetica\nerroneously, and rather hilariously, concluded that the philosophical arguments for the Elvish soul that were presented in the structural form of the arguments from the\nSumma Theologica\nwere actually written by Thomas Aquinas, and yet his review was a fair and judicious one that managed to precisely identify the primary flaw in the book.\nBakker needs to grow up, both intellectually and emotionally.  He’s not a misunderstood genius whose transgressive work outrages the morally repressed plebs even as it opens their conservative eyes to astonishing new philosophical insights.  Hell, judging by the Internet reaction, my WND columns are far more outrageous and eye-opening than anything Bakker has ever written.  The concepts he is utilizing are neither new nor difficult for anyone with a +1SD IQ to grasp.  His\ninclination for sockpuppetry\nis childish and misguided, his sensitivity rivals that of an emo chick, and his philosophy is juvenile.  And yet, he has genuine talent for writing intelligent fantasy.  So, there is still hope for him, as he certainly wouldn’t be the first writer to look back on what he once considered deep and meaningful brilliance with a mortified shudder.\nAny idiot can be uncertain.  “I dunno” is not an indicator of superior intelligence and there is nothing intrinsically intelligent about doubt.  The imperative is to learn enough to be able to ask the relevant questions, which then provide a solid foundation for ascertaining the highest-probability answers.\n*\nMuch hilarity ensued when the hostage negotiator pointed out the fatal flaw in my plan.  He expressed a certain disinclination to find himself 20 years from now wearing an armored scuba suit while negotiating underwater with superintelligent, laser-armed sharks in order to get his client’s ships back.\nUPDATE – Sweet Friedrich Nietzsche, but R. Scott Bakker really can be a wangsty little girl.\nNow he’s whining\nthat I have “lot’s and lot’s of theories” about him, which is ironic considering the amount of erroneous psychobabble he has been directing in my direction from the start.  I have no theories, I have merely read his books and observed his behavior.  But, since I make a practice of answering questions, I’ll go ahead and answer the one he wrongly imagines I have been avoiding.\n“What makes him think he’s won the Magical Belief and Identity Lottery?”\nOh, I don’t know.  Out of nearly 7 billion people, I’m fortunate to be in the top 1% in the planet with regards to health, wealth, looks, brains, athleticism, and nationality.  My wife is slender, beautiful, lovable, loyal, fertile, and funny.  I meet good people who seem to enjoy my company everywhere I go.  That all seems pretty lucky to me, considering that my entire contribution to the situation was choosing my parents well.  I am grateful and I thank God every day for the ticket He has dealt me.  If I’m not a birth lottery winner, then who is?  The kid in the Congo who just got his hands chopped off and is getting raped for the fourth time today?  To paraphrase the immortal parental wisdom of PJ O’Rourke, anyone in my position had damn well better get down on their knees and pray that life does not become fair.\nAs for belief, I don’t concern myself in the slightest with the perfect correspondence of my beliefs with What Is So or not.  They either do or they don’t, but regardless, the Absolute Truth of Creation doesn’t depend upon what I happen to believe it to be at the moment and I don’t think such correspondence is even\ntheoretically\npossible.  Bakker simply doesn’t understand that I don’t believe his opinion, my opinion, or anyone else’s opinion matters in the least, except in how they happen to affect our decisions and subsequent actions.  See\nHuman Action\nfor details.  If Bakker genuinely wanted to figure out my core outlook on life, he should have simply listened to\nSunyata\nin the first place rather than waste his time on perusing the blog.",
  "tags": [
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-19T09:38:00+00:00"
}