{
  "url": "https://voxday.net/2011/08/17/good-star/",
  "scraped_at": "2025-12-13T23:19:17.753651",
  "title": "A good start",
  "date_display": "August 17, 2011",
  "date_iso": "2011-08-17T20:30:00+00:00",
  "date_from_url": "2011-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, <a href=\"http://www.nypost.com/p/news/opinion/opedcolumnists/rookie_mistake_EuKsA9DOT1HZoCucMfoCTN\">Rick Perry’s “mistake”</a> is the first thing he’s done that makes me want to think he might not be a complete disaster as president.  (Of course, this posturing is merely for the Tea Party, in private he’s kowtowing before the Fed like all the other candidates not named Ron Paul.)  But the neocons and neoclassicals were quick to leap to the defense of Ben Shalom:</p><blockquote><p>On Monday, 24 hours before the Rasmussen poll would show him up 13 points on Mitt Romney after only three days in the GOP presidential race, Rick Perry made a mistake.  He answered a question in an Iowa field about the Federal Reserve with a waspish threat to Ben Bernanke — something about how in Texas the Fed chairman would be “treated ugly” if he printed more money.</p><p>“Horrifying,” shrieked Binyamin Appelbaum, The New York Times’ chief Washington correspondent. The economist Nouriel Roubini raged that Perry belonged in a mental institution — after he compared the Texas governor to the Norwegian mass murderer….  Yesterday, in refusing to apologize for what he said, Perry didn’t even suggest he’d been speaking lightly. He said instead that this — Fed policy, presumably — was something about which he’s passionate.</p></blockquote><p>Actually, Perry’s comment about Bernanke’s near-treason is a little careless.  The man’s policies aren’t “almost” treasonous as they have without question been to the severe material detriment of the USA and given his expert PhD credentials, there can be little question that his decision to enact those policies was intentional.  He has done far more harm to America and Americans than 100 bin Ladens could have ever done, and worse, he telegraphed his intention to do so before he was appointed to his present office.</p></div>",
  "content_text": "I have to admit,\nRick Perry’s “mistake”\nis the first thing he’s done that makes me want to think he might not be a complete disaster as president.  (Of course, this posturing is merely for the Tea Party, in private he’s kowtowing before the Fed like all the other candidates not named Ron Paul.)  But the neocons and neoclassicals were quick to leap to the defense of Ben Shalom:\nOn Monday, 24 hours before the Rasmussen poll would show him up 13 points on Mitt Romney after only three days in the GOP presidential race, Rick Perry made a mistake.  He answered a question in an Iowa field about the Federal Reserve with a waspish threat to Ben Bernanke — something about how in Texas the Fed chairman would be “treated ugly” if he printed more money.\n“Horrifying,” shrieked Binyamin Appelbaum, The New York Times’ chief Washington correspondent. The economist Nouriel Roubini raged that Perry belonged in a mental institution — after he compared the Texas governor to the Norwegian mass murderer….  Yesterday, in refusing to apologize for what he said, Perry didn’t even suggest he’d been speaking lightly. He said instead that this — Fed policy, presumably — was something about which he’s passionate.\nActually, Perry’s comment about Bernanke’s near-treason is a little careless.  The man’s policies aren’t “almost” treasonous as they have without question been to the severe material detriment of the USA and given his expert PhD credentials, there can be little question that his decision to enact those policies was intentional.  He has done far more harm to America and Americans than 100 bin Ladens could have ever done, and worse, he telegraphed his intention to do so before he was appointed to his present office.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-17T19:30:00+00:00"
}