{
  "url": "https://voxday.net/2011/08/06/i-am-officially-addicted/",
  "scraped_at": "2025-12-13T23:18:15.041349",
  "title": "I am officially addicted",
  "date_display": "August 6, 2011",
  "date_iso": "2011-08-06T15:00:00+00:00",
  "date_from_url": "2011-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I heard <i>Don’t Stop the Sandman</i> a few months ago and thought it was hysterical.  But the entire CD simply takes it to another level and <i>redefines awesome</i>.</p><p> <i>“[T]he sound was achieved when the metal band was stranded on a desert island in 1989 with a CD player, plenty of batteries and the CD collection of a 13 year old girl.”</i> I think my favorite part is when they segue into a Hells Bells riff backing the Madonna lyrics.</p><p>Rock Sugar is like the bastard love-child of Spinal Tap and Tenacious D.  About the only way I can imagine it could ever be topped is if Al Jourgenson, Trent Reznor, and Rob Zombie were to team up and put out a CD covering songs by Britney Spears, the Pussycat Dolls, Girls Aloud, the Spice Girls, and Destiny’s Child.</p><p>They remind me of how it cracked all of us up when Paul threw in a Loverboy guitar riff after the <i>Technojihad</i> chorus without warning.  It was the only time I can remember Mike, who had the freakish robot-like precision required to play live drums along with samples and tightly sequenced electronics, completely missing a beat.</p></div>",
  "content_text": "I heard\nDon’t Stop the Sandman\na few months ago and thought it was hysterical.  But the entire CD simply takes it to another level and\nredefines awesome\n.\n“[T]he sound was achieved when the metal band was stranded on a desert island in 1989 with a CD player, plenty of batteries and the CD collection of a 13 year old girl.”\nI think my favorite part is when they segue into a Hells Bells riff backing the Madonna lyrics.\nRock Sugar is like the bastard love-child of Spinal Tap and Tenacious D.  About the only way I can imagine it could ever be topped is if Al Jourgenson, Trent Reznor, and Rob Zombie were to team up and put out a CD covering songs by Britney Spears, the Pussycat Dolls, Girls Aloud, the Spice Girls, and Destiny’s Child.\nThey remind me of how it cracked all of us up when Paul threw in a Loverboy guitar riff after the\nTechnojihad\nchorus without warning.  It was the only time I can remember Mike, who had the freakish robot-like precision required to play live drums along with samples and tightly sequenced electronics, completely missing a beat.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-06T14:00:00+00:00"
}