{
  "url": "https://voxday.net/2011/08/08/i-am-anti-hero/",
  "scraped_at": "2025-12-13T23:18:26.193294",
  "title": "I am the anti-hero",
  "date_display": "August 8, 2011",
  "date_iso": "2011-08-08T17:00:00+00:00",
  "date_from_url": "2011-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I certainly would have made a point of reviewing R. Scott Bakker’s books sooner if I had any idea that his response to my review would prove <a href=\"http://rsbakker.wordpress.com/2011/08/08/in-contempt-of-contemplation/\">so vastly amusing</a>:</p><blockquote><p>This brings me to what I was most curious about, back when: What would Theo make of the thematics of the trilogy. To be honest, I thought this was where he would spill the most pixilated ink. Why? Because reading his blog, I realized that in many respects I had written the trilogy for him, for people who really, really, really think they’ve won the Magical Belief-and-Identity Lottery.</p><p>And this, if Vox Day is to be believed, is Theo in a nutshell. The Grand Prize Winner. Reading his blog, I had the impression of drawing circles inside of circles:</p><p>Fiscal conservatives…</p><p>Social and fiscal conservatives…</p><p>White, social and fiscal conservatives…</p><p>White, male, social and fiscal conservatives…</p><p>White, male, English-descended, social and fiscal conservatives…</p><p>White, male, English-descended, Anglican, social and fiscal conservatives…</p><p>I’m sure the list goes on, but this was as far as I was able to go. What began as snobbish hilarity quickly turned into consternation and a kind of baffled, dare I say? disgust. Discussions of partitioning America along more ‘rational’ identity-driven lines, of the ‘behavioural profile of African-Americans,’ of the ‘proper place of women,’ of the forced resettlement of immigrants, of the ‘flaws of democracy’ made me realize that Theo had more than a few fascistic leanings. I’m still shaking my head.</p></blockquote><p>While I always appreciate a proper Genetic Fallacy, even more amusing is an inept one.  I had no idea that I was a socially conservative Anglican, but now that I have been apprised of this I shall certainly do my best to acquire a Book of Common Prayer and start writing regular paeans to Sarah Palin and Rick Perry.  I’m not precisely sure what “fiscal conservative” is supposed to mean nowadays, as this tends to sound rather like “gravity conservative” or “knows how to use an Excel spreadsheet” in light of the recent events in political economy.  But I am white, male, and of English descent, to be sure.  He could have even quite reasonably added “arrogant bastard” and “chick magnet” if he felt that would help his case somehow.</p><p>Of course, the Dread Ilk will no doubt see the humor inherent in the idea that the author of <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=47735\">The Morality of Rape</a> could possibly be “really, really, really offended” by its fictional depiction. Apparently Bakker didn’t get the “rape apologist” alert.</p><p>For all that he attempts to strike a contemplative pose, Bakker reveals a parochial and Panglossian view of the world as well as an ironic failure to contemplate its harsh and brutal reality even while attempting to portray it.  And it is entertaining indeed to see the erstwhile champion of a thousand shades of grey proving my previous point about his adherence to a conventional substitute morality; on what basis could an amoralist possibly justify consternation and disgust?  Aesthetics?  As for the idea that a quad-lingual expatriate who has lived everywhere from Japan to Italy is an extreme example of parochialism, well, I can’t say I’m terribly concerned about what a Canadian who grew up in Ontario, went to university in Ontario, did grad school at Vanderbilt, and then moved back to Ontario happens to think on the matter….</p><p>His ideological ignorance is as nonsensical as his failure to understand the difference between diagnosis and prescription.  Being one of the better-known libertarians in the media, <a href=\"http://deathby1000papercuts.com/dbkpreport/2011/07/libertarian-top-50-sites-june-july-2011/\">#25 at the last ranking</a> if I recall correctly, I am much, much farther away from any sort of fascist leanings than Bakker, whose politics appear to be fairly similar to those of the historical Italian <i>Fascisti</i>.  And I should very much like to see Bakker attempt to defend ideas such as democracy being flawless, material sexual equality, and so forth, as it would likely prove even more entertaining than his inability to understand the aesthetic value of morality in fiction.</p><p>But all of this is beside the point.  Either my criticism of his work stands or it does not.  Is my review fair?  Of course it is.  I wouldn’t sacrifice my critical integrity simply to slam someone I disliked intensely and I don’t dislike Bakker.  I don’t even know him.  The more significant question is if my review of <i>The Prince of Nothing</i> is more accurate and relevant than those that have attempted to lionize Bakker as the third coming of George R.R. Martin.  That, I leave to the readers to decide.</p><p>Bakker is a talented wordsmith.  He is a very good world builder.  He is more intelligent than the average genre writer, historically literate, and reasonably well-educated.  Unfortunately, he is also an incompetent and juvenile philosopher who subscribes to an outmoded view of art.  The latter tends to insert itself in the way of the stronger elements of his writing, particularly when it comes to the characters.  Preaching no more lends itself to secular fiction than it does to religious fiction and should Bakker ever decide to control his instinctive desires to lecture and transgress, he will be the better writer for it.</p><p>But that is no concern of mine.  It makes absolutely no difference to me if Bakker chooses to heed the criticism I have offered or not.  I didn’t write <a href=\"http://www.blackgate.com/2011/08/07/the-prince-of-nothing-review/\">the Black Gate review</a> for his benefit and I am quite accustomed to most people ignoring me, regardless of whether I publicly advise them to buy gold at 323.30 (2002) or predict a $43,300 fall in housing prices (2008).  I don’t expect Bakker to agree.  I don’t even expect him to <i>understand</i>.</p><p>Instead of resorting to an ineffective ad hominem response, it would have been much more interesting if Bakker had simply explained why he felt it was so vital to show so much of the sex and rapine that fills his work, what it adds to the story, and why he feels his philosophical meanderings add to the story rather than detracting from it.  However, give Bakker credit for correctly anticipating that I would like his work.  I did.  Being a fan of epic fantasy, I merely find it to be disappointing that he refuses to aim higher.</p></div>",
  "content_text": "I certainly would have made a point of reviewing R. Scott Bakker’s books sooner if I had any idea that his response to my review would prove\nso vastly amusing\n:\nThis brings me to what I was most curious about, back when: What would Theo make of the thematics of the trilogy. To be honest, I thought this was where he would spill the most pixilated ink. Why? Because reading his blog, I realized that in many respects I had written the trilogy for him, for people who really, really, really think they’ve won the Magical Belief-and-Identity Lottery.\nAnd this, if Vox Day is to be believed, is Theo in a nutshell. The Grand Prize Winner. Reading his blog, I had the impression of drawing circles inside of circles:\nFiscal conservatives…\nSocial and fiscal conservatives…\nWhite, social and fiscal conservatives…\nWhite, male, social and fiscal conservatives…\nWhite, male, English-descended, social and fiscal conservatives…\nWhite, male, English-descended, Anglican, social and fiscal conservatives…\nI’m sure the list goes on, but this was as far as I was able to go. What began as snobbish hilarity quickly turned into consternation and a kind of baffled, dare I say? disgust. Discussions of partitioning America along more ‘rational’ identity-driven lines, of the ‘behavioural profile of African-Americans,’ of the ‘proper place of women,’ of the forced resettlement of immigrants, of the ‘flaws of democracy’ made me realize that Theo had more than a few fascistic leanings. I’m still shaking my head.\nWhile I always appreciate a proper Genetic Fallacy, even more amusing is an inept one.  I had no idea that I was a socially conservative Anglican, but now that I have been apprised of this I shall certainly do my best to acquire a Book of Common Prayer and start writing regular paeans to Sarah Palin and Rick Perry.  I’m not precisely sure what “fiscal conservative” is supposed to mean nowadays, as this tends to sound rather like “gravity conservative” or “knows how to use an Excel spreadsheet” in light of the recent events in political economy.  But I am white, male, and of English descent, to be sure.  He could have even quite reasonably added “arrogant bastard” and “chick magnet” if he felt that would help his case somehow.\nOf course, the Dread Ilk will no doubt see the humor inherent in the idea that the author of\nThe Morality of Rape\ncould possibly be “really, really, really offended” by its fictional depiction. Apparently Bakker didn’t get the “rape apologist” alert.\nFor all that he attempts to strike a contemplative pose, Bakker reveals a parochial and Panglossian view of the world as well as an ironic failure to contemplate its harsh and brutal reality even while attempting to portray it.  And it is entertaining indeed to see the erstwhile champion of a thousand shades of grey proving my previous point about his adherence to a conventional substitute morality; on what basis could an amoralist possibly justify consternation and disgust?  Aesthetics?  As for the idea that a quad-lingual expatriate who has lived everywhere from Japan to Italy is an extreme example of parochialism, well, I can’t say I’m terribly concerned about what a Canadian who grew up in Ontario, went to university in Ontario, did grad school at Vanderbilt, and then moved back to Ontario happens to think on the matter….\nHis ideological ignorance is as nonsensical as his failure to understand the difference between diagnosis and prescription.  Being one of the better-known libertarians in the media,\n#25 at the last ranking\nif I recall correctly, I am much, much farther away from any sort of fascist leanings than Bakker, whose politics appear to be fairly similar to those of the historical Italian\nFascisti\n.  And I should very much like to see Bakker attempt to defend ideas such as democracy being flawless, material sexual equality, and so forth, as it would likely prove even more entertaining than his inability to understand the aesthetic value of morality in fiction.\nBut all of this is beside the point.  Either my criticism of his work stands or it does not.  Is my review fair?  Of course it is.  I wouldn’t sacrifice my critical integrity simply to slam someone I disliked intensely and I don’t dislike Bakker.  I don’t even know him.  The more significant question is if my review of\nThe Prince of Nothing\nis more accurate and relevant than those that have attempted to lionize Bakker as the third coming of George R.R. Martin.  That, I leave to the readers to decide.\nBakker is a talented wordsmith.  He is a very good world builder.  He is more intelligent than the average genre writer, historically literate, and reasonably well-educated.  Unfortunately, he is also an incompetent and juvenile philosopher who subscribes to an outmoded view of art.  The latter tends to insert itself in the way of the stronger elements of his writing, particularly when it comes to the characters.  Preaching no more lends itself to secular fiction than it does to religious fiction and should Bakker ever decide to control his instinctive desires to lecture and transgress, he will be the better writer for it.\nBut that is no concern of mine.  It makes absolutely no difference to me if Bakker chooses to heed the criticism I have offered or not.  I didn’t write\nthe Black Gate review\nfor his benefit and I am quite accustomed to most people ignoring me, regardless of whether I publicly advise them to buy gold at 323.30 (2002) or predict a $43,300 fall in housing prices (2008).  I don’t expect Bakker to agree.  I don’t even expect him to\nunderstand\n.\nInstead of resorting to an ineffective ad hominem response, it would have been much more interesting if Bakker had simply explained why he felt it was so vital to show so much of the sex and rapine that fills his work, what it adds to the story, and why he feels his philosophical meanderings add to the story rather than detracting from it.  However, give Bakker credit for correctly anticipating that I would like his work.  I did.  Being a fan of epic fantasy, I merely find it to be disappointing that he refuses to aim higher.",
  "tags": [
    "books",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-08T16:00:00+00:00"
}