{
  "url": "https://voxday.net/2011/08/19/if-you-have-to-ask-you-aren/",
  "scraped_at": "2025-12-13T23:19:28.902404",
  "title": "If you have to ask, you aren’t",
  "date_display": "August 19, 2011",
  "date_iso": "2011-08-19T14:00:00+00:00",
  "date_from_url": "2011-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times unwittingly <a href=\"http://www.nytimes.com/2011/08/14/world/europe/14dutch.html?pagewanted=2&amp;_r=2&amp;src=recg\">underlines the fatal flaw</a> in the multicultural mass immigration:</p><blockquote><p>In the United States, citizenship once granted is never questioned, said Mr. Overbeek of VU University. “But in Europe it’s never quite established, no matter how long you’ve been here. Here it’s still, ‘When did you get here, and when are you going back?’ ”</p><p>East of Amsterdam, in Almere, the youngest city in the Netherlands, 30 percent voted for Mr. Wilders.  Shopping in the city center, Raihsa Sahinoer, 24, born here of Surinamese immigrants, was not surprised. “Wilders says we all have to go back even if we were born here,” she said. “It’s not only about Muslims, it’s about colored people, too.”</p><p>She lives as the Dutch do, she said. “But they tell us if you’re colored, you’re not Dutch.” Does she feel Dutch? “No,” she said, then paused, then asked: “What is Dutch?”</p></blockquote><p>This is exactly what I have been trying to explain with regards to mass immigration.  A woman from Suriname, a man from Mexico, a child from Sweden, none of them has any understanding, or even reason to understand, the various aspects that went into making up historical American society regardless of how long they live in the United States.  That is why they are absolutely guaranteed to transform it, to <i>destroy</i> it, even when they admire it, if they arrive in sufficient numbers.  A garden that can survive the arrival of ten or twenty grasshoppers without incident will be totally destroyed in rapid order by a swarm of locusts.</p><p>The interesting thing is that the Dutch are actively turning against multiculturalism and mass immigration even though the ethnic Dutch are still 80.9% of the population with an immigration rate of 2.55 migrants per 1,000 inhabitants.  Contrast this with the USA, where only 72.4% of the population is even white and the immigration rate is 4.18% per thousand.</p><p>And, of course, the US immigration debate is going in precisely the opposite direction than in Europe, with Democratic and Republican immigration enthusiasts alike lauding the Obama administration’s decision <a href=\"http://www.washingtontimes.com/news/2011/aug/18/new-dhs-rules-cancel-deportations/\">to stop deporting illegal aliens</a>.</p><p><i>Bowing to pressure from immigrant rights activists, the Obama administration said Thursday that it will halt deportation proceedings on a case-by-case basis against illegal immigrants who meet certain criteria, such as attending school, having family in the military or having primary responsible for other family members’ care.</i></p></div>",
  "content_text": "The New York Times unwittingly\nunderlines the fatal flaw\nin the multicultural mass immigration:\nIn the United States, citizenship once granted is never questioned, said Mr. Overbeek of VU University. “But in Europe it’s never quite established, no matter how long you’ve been here. Here it’s still, ‘When did you get here, and when are you going back?’ ”\nEast of Amsterdam, in Almere, the youngest city in the Netherlands, 30 percent voted for Mr. Wilders.  Shopping in the city center, Raihsa Sahinoer, 24, born here of Surinamese immigrants, was not surprised. “Wilders says we all have to go back even if we were born here,” she said. “It’s not only about Muslims, it’s about colored people, too.”\nShe lives as the Dutch do, she said. “But they tell us if you’re colored, you’re not Dutch.” Does she feel Dutch? “No,” she said, then paused, then asked: “What is Dutch?”\nThis is exactly what I have been trying to explain with regards to mass immigration.  A woman from Suriname, a man from Mexico, a child from Sweden, none of them has any understanding, or even reason to understand, the various aspects that went into making up historical American society regardless of how long they live in the United States.  That is why they are absolutely guaranteed to transform it, to\ndestroy\nit, even when they admire it, if they arrive in sufficient numbers.  A garden that can survive the arrival of ten or twenty grasshoppers without incident will be totally destroyed in rapid order by a swarm of locusts.\nThe interesting thing is that the Dutch are actively turning against multiculturalism and mass immigration even though the ethnic Dutch are still 80.9% of the population with an immigration rate of 2.55 migrants per 1,000 inhabitants.  Contrast this with the USA, where only 72.4% of the population is even white and the immigration rate is 4.18% per thousand.\nAnd, of course, the US immigration debate is going in precisely the opposite direction than in Europe, with Democratic and Republican immigration enthusiasts alike lauding the Obama administration’s decision\nto stop deporting illegal aliens\n.\nBowing to pressure from immigrant rights activists, the Obama administration said Thursday that it will halt deportation proceedings on a case-by-case basis against illegal immigrants who meet certain criteria, such as attending school, having family in the military or having primary responsible for other family members’ care.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-19T13:00:00+00:00"
}