{
  "url": "https://voxday.net/2011/08/17/it-would-appear-i-am-not-arrogan/",
  "scraped_at": "2025-12-13T23:19:15.898059",
  "title": "I am not arrogant",
  "date_display": "August 17, 2011",
  "date_iso": "2011-08-17T14:00:00+00:00",
  "date_from_url": "2011-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi <a href=\"http://whatever.scalzi.com/2011/08/11/mckeans-inversion/\">argues the case</a>:</p><blockquote><p>As there already exists a “McKean’s Law” with respect to words (“Any correction of the speech or writing of others will contain at least one grammatical, spelling, or typographical error”), allow me instead to suggest what I will henceforth label “McKean’s Inversion,” to wit:</p><p>The adjective a person says they are is frequently the thing they are not.</p><p>To put it in writing terms, it’s a fine example of “show, don’t tell.” Classy people don’t need to assert they’re classy, they do classy things. Funny people don’t have to assure you they’re funny, they simply make you laugh. Kind people don’t need to verbally advertise their kindness, because it’s evident in their lives. All of which is to say the way to be seen as funny, or kind, or humble, or classy, is to be that thing. And if you are, chances are pretty good other people will note it.</p></blockquote><p>My take?  McKean’s Inversion applies to idiots, the deceitful, and the insecure.  The idea that every cocky chick magnet is a loser with a hard drive full of Japanese schoolgirl porn, that every strutting All-Star is a bench-warming fraud, and every salty ex-Ranger is really a blustering coward is a bizarre mix of Churchianity and middle class fear of failure.  The flaw in the logic is that while X people don’t <i>need</i> to assert X, this does not in any way justify the conclusion that they <i>cannot</i> assert it or that asserting it – a few highly specific cases aside – necessarily implies its negation.</p><p>Who were three of the most infamous trash talkers in the history of the NBA?  Michael Jordan, Larry Bird, and Gary Payton.  Shall we therefore conclude that they were inferior basketball players?  What was the most famous of Babe Ruth’s 714 home runs?  The one he hit in the fifth inning of Game 3 of the 1932 World Series, otherwise known as his “called shot”.  Any high-performance competitor knows there is nothing more demoralizing to an opponent than telling him exactly what you’re going to do to him and then doing precisely that, because it drives home the fact that he hasn’t been tricked or outmaneuvered somehow, he has been beaten by someone who is completely out of his league.</p><p>The fact that the mediocre often overrate themselves doesn’t mean that the superlative are unaware of their own superiority or are unwilling to admit it.  I have never seen false modesty among the genuinely superior; it is, however, quite commonly seen among the merely competent who utilize it in an attempt to be perceived as better than they genuinely are.</p><p>The nonsensical aspect of McKean’s Inversion can be seen in the way that my assertion of my own superior intelligence and breathtaking arrogance is a) sometimes interpreted as evidence that I am really not all that intelligent while b) never being taken as evidence that I am not arrogant.  In other words, it is applied in precisely the same uneven manner as the references to my family by critics who like to stress my relationship to one nationally-known individual, (usually apropos of nothing), while never, ever, mentioning my equally close relationship to another, internationally-known, individual.</p><p>The proof is always and only in the pudding.  “The adjective a person says they are” carries no intrinsic meaning in and of itself, but merely offers a useful means of ascertaining that person’s integrity and capacity for self-judgment when the adjective is compared with independent observation.  I happen to consider people who overrate themselves to be self-deluded and a little pathetic, but I believe people who habitually underrate themselves to be dishonest, manipulative, and intrinsically untrustworthy.  And I am much more wary of the latter than the former.</p><p>There is nothing humble about telling lies to make yourself look better in others’ eyes.</p></div>",
  "content_text": "John Scalzi\nargues the case\n:\nAs there already exists a “McKean’s Law” with respect to words (“Any correction of the speech or writing of others will contain at least one grammatical, spelling, or typographical error”), allow me instead to suggest what I will henceforth label “McKean’s Inversion,” to wit:\nThe adjective a person says they are is frequently the thing they are not.\nTo put it in writing terms, it’s a fine example of “show, don’t tell.” Classy people don’t need to assert they’re classy, they do classy things. Funny people don’t have to assure you they’re funny, they simply make you laugh. Kind people don’t need to verbally advertise their kindness, because it’s evident in their lives. All of which is to say the way to be seen as funny, or kind, or humble, or classy, is to be that thing. And if you are, chances are pretty good other people will note it.\nMy take?  McKean’s Inversion applies to idiots, the deceitful, and the insecure.  The idea that every cocky chick magnet is a loser with a hard drive full of Japanese schoolgirl porn, that every strutting All-Star is a bench-warming fraud, and every salty ex-Ranger is really a blustering coward is a bizarre mix of Churchianity and middle class fear of failure.  The flaw in the logic is that while X people don’t\nneed\nto assert X, this does not in any way justify the conclusion that they\ncannot\nassert it or that asserting it – a few highly specific cases aside – necessarily implies its negation.\nWho were three of the most infamous trash talkers in the history of the NBA?  Michael Jordan, Larry Bird, and Gary Payton.  Shall we therefore conclude that they were inferior basketball players?  What was the most famous of Babe Ruth’s 714 home runs?  The one he hit in the fifth inning of Game 3 of the 1932 World Series, otherwise known as his “called shot”.  Any high-performance competitor knows there is nothing more demoralizing to an opponent than telling him exactly what you’re going to do to him and then doing precisely that, because it drives home the fact that he hasn’t been tricked or outmaneuvered somehow, he has been beaten by someone who is completely out of his league.\nThe fact that the mediocre often overrate themselves doesn’t mean that the superlative are unaware of their own superiority or are unwilling to admit it.  I have never seen false modesty among the genuinely superior; it is, however, quite commonly seen among the merely competent who utilize it in an attempt to be perceived as better than they genuinely are.\nThe nonsensical aspect of McKean’s Inversion can be seen in the way that my assertion of my own superior intelligence and breathtaking arrogance is a) sometimes interpreted as evidence that I am really not all that intelligent while b) never being taken as evidence that I am not arrogant.  In other words, it is applied in precisely the same uneven manner as the references to my family by critics who like to stress my relationship to one nationally-known individual, (usually apropos of nothing), while never, ever, mentioning my equally close relationship to another, internationally-known, individual.\nThe proof is always and only in the pudding.  “The adjective a person says they are” carries no intrinsic meaning in and of itself, but merely offers a useful means of ascertaining that person’s integrity and capacity for self-judgment when the adjective is compared with independent observation.  I happen to consider people who overrate themselves to be self-deluded and a little pathetic, but I believe people who habitually underrate themselves to be dishonest, manipulative, and intrinsically untrustworthy.  And I am much more wary of the latter than the former.\nThere is nothing humble about telling lies to make yourself look better in others’ eyes.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-17T13:00:00+00:00"
}