{
  "url": "https://voxday.net/2011/08/26/krugman-laments-lack-of-inflation/",
  "scraped_at": "2025-12-13T23:20:09.703646",
  "title": "Krugman laments a lack of inflation",
  "date_display": "August 26, 2011",
  "date_iso": "2011-08-26T14:42:00+00:00",
  "date_from_url": "2011-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He also <a href=\"http://www.nytimes.com/2011/08/26/opinion/bernankes-perry-problem.html?_r=1&amp;ref=opinion\">doesn’t anticipate QE3</a> from Jackson Hole:</p><blockquote><p>in 2000 an economist named Ben Bernanke offered a number of proposals for policy at the “zero lower bound.” True, the paper was focused on policy in Japan, not the United States. But America is now very much in a Japan-type economic trap, only more acute. So we learn a lot by asking why Ben Bernanke 2011 isn’t taking the advice of Ben Bernanke 2000.</p><p>Back then, Mr. Bernanke suggested that the Bank of Japan could get Japan’s economy moving with a variety of unconventional policies. These could include: purchases of long-term government debt (to push interest rates, and hence private borrowing costs, down); an announcement that short-term interest rates would stay near zero for an extended period, to further reduce long-term rates; an announcement that the bank was seeking moderate inflation, “setting a target in the 3-4% range for inflation, to be maintained for a number of years,” which would encourage borrowing and discourage people from hoarding cash; and “an attempt to achieve substantial depreciation of the yen,” that is, to reduce the yen’s value in terms of other currencies.</p><p>Was Mr. Bernanke on the right track? I think so — as well I should, since his paper was partly based on my own earlier work. So why isn’t the Fed pursuing the agenda its own chairman once recommended for Japan?</p></blockquote><p>We’ll see what Ben Shalom has to say soon enough.  But I note that gold buyers would have to be salivating at the idea that the Fed would <i>target</i> a 4% inflation rate.  I just wonder why Krugman doesn’t go all the way and call for electronic currency that actually degrades in face value over time.</p><p>And give Rick Perry some credit, if firing that public shot across Bernanke’s bow was sufficient to intimidate him.  And we would be remiss to fail to note <a href=\"http://www.cnbc.com/id/44285105\">another downward revision</a> to GDP.</p><p><i>Gross domestic product growth rose at annual rate of 1.0 percent the Commerce Department said, a downward revision of its prior estimate of 1.3 percent.</i></p><p>Don’t worry, they’ll revise it into negative territory long after the fact, just like they did for 2008.</p><p>UPDATE – <i>“Federal Reserve Chairman Ben S. Bernanke said the central bank still has tools to stimulate the economy without providing details or signaling when or whether policy makers might deploy them.”</i></p><p>Translation: No QE3 until after the autumn round of market crashes.</p></div>",
  "content_text": "He also\ndoesn’t anticipate QE3\nfrom Jackson Hole:\nin 2000 an economist named Ben Bernanke offered a number of proposals for policy at the “zero lower bound.” True, the paper was focused on policy in Japan, not the United States. But America is now very much in a Japan-type economic trap, only more acute. So we learn a lot by asking why Ben Bernanke 2011 isn’t taking the advice of Ben Bernanke 2000.\nBack then, Mr. Bernanke suggested that the Bank of Japan could get Japan’s economy moving with a variety of unconventional policies. These could include: purchases of long-term government debt (to push interest rates, and hence private borrowing costs, down); an announcement that short-term interest rates would stay near zero for an extended period, to further reduce long-term rates; an announcement that the bank was seeking moderate inflation, “setting a target in the 3-4% range for inflation, to be maintained for a number of years,” which would encourage borrowing and discourage people from hoarding cash; and “an attempt to achieve substantial depreciation of the yen,” that is, to reduce the yen’s value in terms of other currencies.\nWas Mr. Bernanke on the right track? I think so — as well I should, since his paper was partly based on my own earlier work. So why isn’t the Fed pursuing the agenda its own chairman once recommended for Japan?\nWe’ll see what Ben Shalom has to say soon enough.  But I note that gold buyers would have to be salivating at the idea that the Fed would\ntarget\na 4% inflation rate.  I just wonder why Krugman doesn’t go all the way and call for electronic currency that actually degrades in face value over time.\nAnd give Rick Perry some credit, if firing that public shot across Bernanke’s bow was sufficient to intimidate him.  And we would be remiss to fail to note\nanother downward revision\nto GDP.\nGross domestic product growth rose at annual rate of 1.0 percent the Commerce Department said, a downward revision of its prior estimate of 1.3 percent.\nDon’t worry, they’ll revise it into negative territory long after the fact, just like they did for 2008.\nUPDATE –\n“Federal Reserve Chairman Ben S. Bernanke said the central bank still has tools to stimulate the economy without providing details or signaling when or whether policy makers might deploy them.”\nTranslation: No QE3 until after the autumn round of market crashes.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-26T13:42:00+00:00"
}