{
  "url": "https://voxday.net/2011/08/12/lecturing-butterfly-collector/",
  "scraped_at": "2025-12-13T23:18:49.107710",
  "title": "Correcting the butterfly collector",
  "date_display": "August 12, 2011",
  "date_iso": "2011-08-12T07:15:00+00:00",
  "date_from_url": "2011-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As various studies have reported, biologists are the least intelligent of the science majors.  And as a perusal of any biology major’s curriculum will show, most of them are completely uneducated in history, in logic, and in philosophy.  There isn’t even much use of the actual scientific method in their “science”; there is a reason that hard scientists have long denigrated them as “butterfly collectors.  While Richard Dawkins is the most notorious example of a biologist who foolishly attempts to opine outside his area of expertise, at least he usually appears to have some idea of what he is talking about when biological evolution is the subject.  PZ Myers, on the other hand, is so intellectually undisciplined that he cannot keep even simple things straight when the subject he teaches at his community college is <a href=\"http://freethoughtblogs.com/pharyngula/2011/08/01/vox-day-and-the-status-of-xiaotingia/\">the topic at hand</a>:</p><blockquote><p>1.  Of course biologists have considered alternate mechanisms! Coyne argues for selection as a mechanism of speciation (by pleiotropic side effects of genes that are selected for other functions), and Futuyma argues for speciation by drift.</p><p>2.  Similarly, mechanisms of abiogenesis have been proposed that suggest selection, but also chance or as a necessary outcome of the physico-chemical properties.</p><p>3.  The structure of DNA was analyzed by its chemistry, not it’s evolutionary history, obviously, but as this paragraph even concedes, the consequences of DNA biochemistry were profoundly important in their effects on evolution.</p><p>4.  Nope. Structure of DNA was determined in 1953; the neo-Darwinian synthesis occurred in the 1930s-1940s with the integration of genetics into evolutionary biology. It was genetics (especially population genetics) that established evolution as the only reasonable explanation for the history of life on earth.</p><p>5.  The precise taxonomic status of Archaeopteryx was not a specific prediction of evolutionary theory. Finding more data in the form of more fossils of feathered dinosaurs strengthens the idea of avian descent from dinosaurs.</p><p>6.  If you examine the family tree of Archaeopteryx and Xiaotingia, what you should see is that the taxonomic re-evaluation of Archeopteryx merely moves it from the Paraves branch to the nearby Deinonychosaurian branch…hardly a “wildly wrong” model.</p><p>7.  Vox Day has not described anything yet which shows evolution being wrong. Adjusting the precise timing of evolutionary events by millions of years is a reasonable response to new data which does not falsify the underlying hypotheses of relatedness.</p><p>8. Again, this discovery does not demonstrate the opposite of what evolutionary biologists have been claiming, and actually makes for a better fit with other data about ancient bird ancestors; moving Archaeopteryx from a first cousin to a second cousin of the ancestor of modern birds isn’t a radical idea that invalidates evolutionary biology.</p><p>The big picture is even more damning for Vox Day. Of course we have huge volumes of information supporting the theory of evolution, that suite of mechanisms and principles that describe the broad course of evolutionary history, including common descent and descent with modification. And also there are a multitude of details that aren’t completely known — we have millions of species on this planet, and only a fraction have been studied in depth. The theory of evolution does not hang on the exact lineage of any two species out of those millions…it hangs on the fact that there is a lineage.</p><p>Vox Day is quite the poseur — he pretends to know better than real scientists, when he can’t even tell the difference between hypothesis and data.</p></blockquote><p>First, let me begin by addressing PZ’s remarkably foolish comment at the end.  He knows perfectly well that I know the difference between hypothesis and data, this is just his characteristic posturing in a groundless attempt to argue from the lectern.  His pretense that anyone, let alone a superintelligence of my confirmed cognitive capacity, might have any difficulty distinguishing the two concepts accomplishes little more than to imply he teaches a remarkably low caliber of student.  Second, I will note that I don’t <i>pretend </i>to know better than real scientists, I often <i>prove</i> that I know better than they do.</p><p>Consider, for example, the public statements of the illustrious Paul Krugman, professor of Economics and International Affairs at the Woodrow Wilson School of Public and International Affairs at Princeton University, Centenary Professor at the London School of Economics, and 2008 recipient of the Nobel Memorial Prize in Economics versus Vox Day, level 72 Dwarf Hunter and one-time Pooyan world champion, concerning the price of gold in 2002, the housing market in 2005, the success of the Obama stimulus plan in 2009, the economic theory of the Austrian School, or even the historical expenditures of the Hoover administration in 1929-1933.  Back when gold cost $325 per ounce, Krugman was declaring gold to be “just a metal” and pushing the Fed to create a housing bubble while I was writing columns urging readers to stay out of real estate and invest in “the barbarous relic” instead.  Gold is now at $1,750.  Case-Shiller is now at 125.41 and falling; it’s already below the 126.13 of Q3-2002.  So you see, Dawkins and Myers are neither the first nor the last scientists to have been my bitches.</p><p>I have no need to rely upon any pretense of superior knowledge when I can cite numerous empirically confirmed demonstrations of it.  PZ would have done much better to question if my <i>proven ability</i> “to know better than real scientists” translates from economics, economic history, and finance to evolutionary biology, global warming, and other quasi-scientific subjects.  No doubt PZ considers himself a real scientist, so let’s see how he did with his seven specific points.</p><p>1.  PZ failed to comprehend the point of what I wrote when I asked when any evolutionist has reconsidered <b>the basic hypothesis that species evolve into different species through natural selection</b> as a result of the falsity of one, ten, or even a hundred predictions based upon it.  Obviously, I am well aware of the existence of proposed “alternate mechanisms”, otherwise I would not openly mock the “Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow” aka TE(p)NSBMGDaGF in the Voxicon.</p><p>The point was not that no one has ever proposed an alternative method, but rather, that alternative methods, (or as I prefer to call them, evolutionary epicycles), are invariably proposed in lieu of contemplating the possibility that the basic hypothesis is simply wrong.  When an astrophysicist or an economist gets a prediction based on a hypothesis wrong, his consequent assumption is usually that the hypothesis is incorrect.  When an evolutionary biologist gets a prediction based on a hypothesis wrong, his consequent assumption is always that the hypothesis cannot possibly be to blame, there must be some missing factor that has not been properly taken into account.  If evolution by natural selection has not taken place, then evolution by some other mechanism must have taken place; the logical conclusion that the core hypothesis is simply incorrect and evolution did not take place is seldom, if ever, considered an option.</p><p>2.  PZ’s answer is completely irrelevant.  There is zero evidence that abiogenesis ever took place, robustly imagined mechanisms for it notwithstanding.  To claim that because there was no life before, but there is now, ergo abiogenesis occurred, is the very sort of philosophy that science has largely come to supplant.  Evolutionists tend to wisely punt on the logically-dictated abiogenetic foundation upon which their materialist assumptions rest, but there is no reason anyone should permit them to do so.  It’s rather like economists who attempt to leave debt out of their equations.  The numbers may all add up nicely without it, but leaving out the most important element tends to call the entire model into question.</p><p>3. PZ could actually have claimed some very limited credit for evolutionary theory on the basis of Linus Pauling’s contribution to the discovery of DNA, but instead he demonstrates that he completely failed to comprehend the point.  It is irrelevant that he believes “the consequences of DNA biochemistry were profoundly important in their effects on evolution”.  That is surely true, but it doesn’t change the truth of my statement that evolutionary theory was not required for the development of DNA.  In fact, it’s rather like saying the consequences of the beheading were profoundly important in their effects on the criminal’s future activities.</p><p>4.  The timeline of Mendelian genetics, the Neo-Darwinian synthesis, and the discovery of DNA are not relevant here.  The salient point is that DNA, which required no assistance from evolutionary theory to develop although it did receive some as per Pauling’s aforementioned contribution, has exploded numerous decades-old assumptions by the evolutionists, including the Tree of Life and the very concept of speciation itself.  As DNA is better understood, (which understanding requires absolutely nothing from evolutionary theory), there is a reasonable probability that it will eventually undermine the entire idea of evolution and not merely the natural selection mechanism.  Still, the only reason evolution is still considered even remotely relevant to actual science that does not revolve around the increasingly futile efforts to provide a solid scientific foundation for a proof of evolution is due to the perceived connection between DNA and TE(p)NSBMGDaGF.  No scientist attempting to improve DNA identification or unravel the mysteries of junk DNA finds it terribly useful to incorporate natural selection into their research.  Indeed, to the extent that researchers concern themselves with the evolutionary utility of “junk DNA”, they are arguably hindering their research by chasing a rotting red herring.  It’s rather like the way Keynesians avidly investigate global savings rates while paying no attention to the various debt/GDP ratios.</p><p>5.  What a load of historically revisionist nonsense.  Anyone who grew up in the 1970s can remember the pride of place that <i>Archaeopteryx </i> held in evolutionary theory.  It was a “missing link”, it was cited as proof of evolution in our elementary school textbooks.  It still has its own Wikipedia entry: <i>“The first remains of Archaeopteryx were discovered just two years after Charles Darwin published On the Origin of Species. Archaeopteryx seemed to confirm Darwin’s theories and has since become a key piece of evidence for the origin of birds, the transitional fossils debate, and confirmation of evolution.”</i> Finding more data in the form of more fossils of feathered dinosaurs suggests that more dinosaurs had feathers, it doesn’t strengthen “the idea of avian descent from dinosaurs”, primarily for what should be the obvious reason that the significant avian is no longer avian.</p><p>6.  PZ skates over the fact that the erstwhile bird is no longer a bird, but merely a another type of dinosaur, means that it is not the transitional species it was once believed to be.  This not only serves to demolish the scientific importance of <i>Archaeopteryx</i>, but also undermines the confirmation of Darwin’s theories that its “first bird” claim once supported.</p><p>7.  This is an absurd statement.  PZ here illustrates why real scientists, whose predictive models are actually expected to perform to high degrees of accuracy, hold the butterfly collectors in scientific contempt.  The reason Daniel Dennett was forced to <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600-h/ATHEIST+LOGIC.jpg\">appeal to astrophysics</a> rather than evolutionary biology when he praises science is because the latter lacks the “amazingly accurate results” that has generated so much respect for the former.  Evolutionary biology has simply never delivered any reasonable predictive results in over 150 years and has been responsible for an incredible number of frauds as well as false predictions.  When Samuelsonian economists attempt to get away with margins of error measured in the billions of dollars – the most recent Q1-2011 revision of GDP amounted to a $225 billion error – people rightly conclude their models are fundamentally flawed.  Given the similar scales involved, there is no reason evolutionary biologists should not be held to the same standard.</p><p>8.  As I wrote in my previous post, this is just another demonstration of the intrinsic unfalsifiability of the butterfly collector’s art.  When he’s wrong, when a bird is not a bird or a transitional species, but merely another dinosaur, it really means he’s more right than ever!  This is ridiculous.  When I said that Hillary Clinton would win the 2008 Democratic nomination, it did not make me more right than ever when Obama actually won it.  It made me wrong.</p><p>As for the supposedly damning big picture, I am perfectly content to await further developments. I further note that as those “huge volumes of information” continue to expand, the evolutionary theorists have been forced to concoct ever more complicated and grandiose evolutionary epicycles to attempt to keep Darwin in the picture.  Both the core concepts of “species” and “natural selection” have been increasingly called into question by advances in genetics, and it will not surprise me if further advances force the eventual junking of TENS in any of its reasonably recognizable forms.</p><p>Still, just to be clear, I am not, nor have I ever been, an evolution <i>denier</i>.  I am merely a strong evolution skeptic, and it is worth noting that my perceptive and public doubts about natural selection are increasingly being supported by firm believers in TE(p)NSBMGDaGF.  One of the many reasons that I remain confirmed in my skepticism to date is the constant historical revisionism of PZ Myers and many other True Believers in the cult of Darwin as well as their staunch refusal to abide by the same standards of evidence that even the practitioners of an arcane quasi-science like economics do.</p><p>As an added bonus, these three comments from the astute economic observers at Pharyngula will likely provide considerably entertainment to those who have read <i>The Return of the Great Depression</i>.</p><p><i>“Well, you gotta give him credit for consistency. He is all wrong about Keynesian economics, too. It is the neo-Keynsians, not the freshwater types, whose models have correctly predicted the economic mess we are in today. The evidence (completely ignored by what Krugman calls the “Very Serious People) is pretty clear about this.”</i><br> – SES</br></p><p><i>I’d trust Vox Day on economics as much as I do on science. Zero.</i><br> – Raven</br></p><p><i>One notes the comparison with pleasure. Keynesian economics, like evolutionary biology, has <a href=\"http://www.milobookclub.com/2011/08/11/you-couldnt-be-more-wrong/\">an outstanding record of success</a>, and has become the foundation for a vast amount of productive work in its field. </i><br> – JRE</br></p></div>",
  "content_text": "As various studies have reported, biologists are the least intelligent of the science majors.  And as a perusal of any biology major’s curriculum will show, most of them are completely uneducated in history, in logic, and in philosophy.  There isn’t even much use of the actual scientific method in their “science”; there is a reason that hard scientists have long denigrated them as “butterfly collectors.  While Richard Dawkins is the most notorious example of a biologist who foolishly attempts to opine outside his area of expertise, at least he usually appears to have some idea of what he is talking about when biological evolution is the subject.  PZ Myers, on the other hand, is so intellectually undisciplined that he cannot keep even simple things straight when the subject he teaches at his community college is\nthe topic at hand\n:\n1.  Of course biologists have considered alternate mechanisms! Coyne argues for selection as a mechanism of speciation (by pleiotropic side effects of genes that are selected for other functions), and Futuyma argues for speciation by drift.\n2.  Similarly, mechanisms of abiogenesis have been proposed that suggest selection, but also chance or as a necessary outcome of the physico-chemical properties.\n3.  The structure of DNA was analyzed by its chemistry, not it’s evolutionary history, obviously, but as this paragraph even concedes, the consequences of DNA biochemistry were profoundly important in their effects on evolution.\n4.  Nope. Structure of DNA was determined in 1953; the neo-Darwinian synthesis occurred in the 1930s-1940s with the integration of genetics into evolutionary biology. It was genetics (especially population genetics) that established evolution as the only reasonable explanation for the history of life on earth.\n5.  The precise taxonomic status of Archaeopteryx was not a specific prediction of evolutionary theory. Finding more data in the form of more fossils of feathered dinosaurs strengthens the idea of avian descent from dinosaurs.\n6.  If you examine the family tree of Archaeopteryx and Xiaotingia, what you should see is that the taxonomic re-evaluation of Archeopteryx merely moves it from the Paraves branch to the nearby Deinonychosaurian branch…hardly a “wildly wrong” model.\n7.  Vox Day has not described anything yet which shows evolution being wrong. Adjusting the precise timing of evolutionary events by millions of years is a reasonable response to new data which does not falsify the underlying hypotheses of relatedness.\n8. Again, this discovery does not demonstrate the opposite of what evolutionary biologists have been claiming, and actually makes for a better fit with other data about ancient bird ancestors; moving Archaeopteryx from a first cousin to a second cousin of the ancestor of modern birds isn’t a radical idea that invalidates evolutionary biology.\nThe big picture is even more damning for Vox Day. Of course we have huge volumes of information supporting the theory of evolution, that suite of mechanisms and principles that describe the broad course of evolutionary history, including common descent and descent with modification. And also there are a multitude of details that aren’t completely known — we have millions of species on this planet, and only a fraction have been studied in depth. The theory of evolution does not hang on the exact lineage of any two species out of those millions…it hangs on the fact that there is a lineage.\nVox Day is quite the poseur — he pretends to know better than real scientists, when he can’t even tell the difference between hypothesis and data.\nFirst, let me begin by addressing PZ’s remarkably foolish comment at the end.  He knows perfectly well that I know the difference between hypothesis and data, this is just his characteristic posturing in a groundless attempt to argue from the lectern.  His pretense that anyone, let alone a superintelligence of my confirmed cognitive capacity, might have any difficulty distinguishing the two concepts accomplishes little more than to imply he teaches a remarkably low caliber of student.  Second, I will note that I don’t\npretend\nto know better than real scientists, I often\nprove\nthat I know better than they do.\nConsider, for example, the public statements of the illustrious Paul Krugman, professor of Economics and International Affairs at the Woodrow Wilson School of Public and International Affairs at Princeton University, Centenary Professor at the London School of Economics, and 2008 recipient of the Nobel Memorial Prize in Economics versus Vox Day, level 72 Dwarf Hunter and one-time Pooyan world champion, concerning the price of gold in 2002, the housing market in 2005, the success of the Obama stimulus plan in 2009, the economic theory of the Austrian School, or even the historical expenditures of the Hoover administration in 1929-1933.  Back when gold cost $325 per ounce, Krugman was declaring gold to be “just a metal” and pushing the Fed to create a housing bubble while I was writing columns urging readers to stay out of real estate and invest in “the barbarous relic” instead.  Gold is now at $1,750.  Case-Shiller is now at 125.41 and falling; it’s already below the 126.13 of Q3-2002.  So you see, Dawkins and Myers are neither the first nor the last scientists to have been my bitches.\nI have no need to rely upon any pretense of superior knowledge when I can cite numerous empirically confirmed demonstrations of it.  PZ would have done much better to question if my\nproven ability\n“to know better than real scientists” translates from economics, economic history, and finance to evolutionary biology, global warming, and other quasi-scientific subjects.  No doubt PZ considers himself a real scientist, so let’s see how he did with his seven specific points.\n1.  PZ failed to comprehend the point of what I wrote when I asked when any evolutionist has reconsidered\nthe basic hypothesis that species evolve into different species through natural selection\nas a result of the falsity of one, ten, or even a hundred predictions based upon it.  Obviously, I am well aware of the existence of proposed “alternate mechanisms”, otherwise I would not openly mock the “Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow” aka TE(p)NSBMGDaGF in the Voxicon.\nThe point was not that no one has ever proposed an alternative method, but rather, that alternative methods, (or as I prefer to call them, evolutionary epicycles), are invariably proposed in lieu of contemplating the possibility that the basic hypothesis is simply wrong.  When an astrophysicist or an economist gets a prediction based on a hypothesis wrong, his consequent assumption is usually that the hypothesis is incorrect.  When an evolutionary biologist gets a prediction based on a hypothesis wrong, his consequent assumption is always that the hypothesis cannot possibly be to blame, there must be some missing factor that has not been properly taken into account.  If evolution by natural selection has not taken place, then evolution by some other mechanism must have taken place; the logical conclusion that the core hypothesis is simply incorrect and evolution did not take place is seldom, if ever, considered an option.\n2.  PZ’s answer is completely irrelevant.  There is zero evidence that abiogenesis ever took place, robustly imagined mechanisms for it notwithstanding.  To claim that because there was no life before, but there is now, ergo abiogenesis occurred, is the very sort of philosophy that science has largely come to supplant.  Evolutionists tend to wisely punt on the logically-dictated abiogenetic foundation upon which their materialist assumptions rest, but there is no reason anyone should permit them to do so.  It’s rather like economists who attempt to leave debt out of their equations.  The numbers may all add up nicely without it, but leaving out the most important element tends to call the entire model into question.\n3. PZ could actually have claimed some very limited credit for evolutionary theory on the basis of Linus Pauling’s contribution to the discovery of DNA, but instead he demonstrates that he completely failed to comprehend the point.  It is irrelevant that he believes “the consequences of DNA biochemistry were profoundly important in their effects on evolution”.  That is surely true, but it doesn’t change the truth of my statement that evolutionary theory was not required for the development of DNA.  In fact, it’s rather like saying the consequences of the beheading were profoundly important in their effects on the criminal’s future activities.\n4.  The timeline of Mendelian genetics, the Neo-Darwinian synthesis, and the discovery of DNA are not relevant here.  The salient point is that DNA, which required no assistance from evolutionary theory to develop although it did receive some as per Pauling’s aforementioned contribution, has exploded numerous decades-old assumptions by the evolutionists, including the Tree of Life and the very concept of speciation itself.  As DNA is better understood, (which understanding requires absolutely nothing from evolutionary theory), there is a reasonable probability that it will eventually undermine the entire idea of evolution and not merely the natural selection mechanism.  Still, the only reason evolution is still considered even remotely relevant to actual science that does not revolve around the increasingly futile efforts to provide a solid scientific foundation for a proof of evolution is due to the perceived connection between DNA and TE(p)NSBMGDaGF.  No scientist attempting to improve DNA identification or unravel the mysteries of junk DNA finds it terribly useful to incorporate natural selection into their research.  Indeed, to the extent that researchers concern themselves with the evolutionary utility of “junk DNA”, they are arguably hindering their research by chasing a rotting red herring.  It’s rather like the way Keynesians avidly investigate global savings rates while paying no attention to the various debt/GDP ratios.\n5.  What a load of historically revisionist nonsense.  Anyone who grew up in the 1970s can remember the pride of place that\nArchaeopteryx\nheld in evolutionary theory.  It was a “missing link”, it was cited as proof of evolution in our elementary school textbooks.  It still has its own Wikipedia entry:\n“The first remains of Archaeopteryx were discovered just two years after Charles Darwin published On the Origin of Species. Archaeopteryx seemed to confirm Darwin’s theories and has since become a key piece of evidence for the origin of birds, the transitional fossils debate, and confirmation of evolution.”\nFinding more data in the form of more fossils of feathered dinosaurs suggests that more dinosaurs had feathers, it doesn’t strengthen “the idea of avian descent from dinosaurs”, primarily for what should be the obvious reason that the significant avian is no longer avian.\n6.  PZ skates over the fact that the erstwhile bird is no longer a bird, but merely a another type of dinosaur, means that it is not the transitional species it was once believed to be.  This not only serves to demolish the scientific importance of\nArchaeopteryx\n, but also undermines the confirmation of Darwin’s theories that its “first bird” claim once supported.\n7.  This is an absurd statement.  PZ here illustrates why real scientists, whose predictive models are actually expected to perform to high degrees of accuracy, hold the butterfly collectors in scientific contempt.  The reason Daniel Dennett was forced to\nappeal to astrophysics\nrather than evolutionary biology when he praises science is because the latter lacks the “amazingly accurate results” that has generated so much respect for the former.  Evolutionary biology has simply never delivered any reasonable predictive results in over 150 years and has been responsible for an incredible number of frauds as well as false predictions.  When Samuelsonian economists attempt to get away with margins of error measured in the billions of dollars – the most recent Q1-2011 revision of GDP amounted to a $225 billion error – people rightly conclude their models are fundamentally flawed.  Given the similar scales involved, there is no reason evolutionary biologists should not be held to the same standard.\n8.  As I wrote in my previous post, this is just another demonstration of the intrinsic unfalsifiability of the butterfly collector’s art.  When he’s wrong, when a bird is not a bird or a transitional species, but merely another dinosaur, it really means he’s more right than ever!  This is ridiculous.  When I said that Hillary Clinton would win the 2008 Democratic nomination, it did not make me more right than ever when Obama actually won it.  It made me wrong.\nAs for the supposedly damning big picture, I am perfectly content to await further developments. I further note that as those “huge volumes of information” continue to expand, the evolutionary theorists have been forced to concoct ever more complicated and grandiose evolutionary epicycles to attempt to keep Darwin in the picture.  Both the core concepts of “species” and “natural selection” have been increasingly called into question by advances in genetics, and it will not surprise me if further advances force the eventual junking of TENS in any of its reasonably recognizable forms.\nStill, just to be clear, I am not, nor have I ever been, an evolution\ndenier\n.  I am merely a strong evolution skeptic, and it is worth noting that my perceptive and public doubts about natural selection are increasingly being supported by firm believers in TE(p)NSBMGDaGF.  One of the many reasons that I remain confirmed in my skepticism to date is the constant historical revisionism of PZ Myers and many other True Believers in the cult of Darwin as well as their staunch refusal to abide by the same standards of evidence that even the practitioners of an arcane quasi-science like economics do.\nAs an added bonus, these three comments from the astute economic observers at Pharyngula will likely provide considerably entertainment to those who have read\nThe Return of the Great Depression\n.\n“Well, you gotta give him credit for consistency. He is all wrong about Keynesian economics, too. It is the neo-Keynsians, not the freshwater types, whose models have correctly predicted the economic mess we are in today. The evidence (completely ignored by what Krugman calls the “Very Serious People) is pretty clear about this.”\n– SES\nI’d trust Vox Day on economics as much as I do on science. Zero.\n– Raven\nOne notes the comparison with pleasure. Keynesian economics, like evolutionary biology, has\nan outstanding record of success\n, and has become the foundation for a vast amount of productive work in its field.\n– JRE",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-12T06:15:00+00:00"
}