{
  "url": "https://voxday.net/2011/08/16/lest-you-think-we-jes/",
  "scraped_at": "2025-12-13T23:19:07.452040",
  "title": "Lest you think we jest",
  "date_display": "August 16, 2011",
  "date_iso": "2011-08-16T11:30:00+00:00",
  "date_from_url": "2011-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve noticed that there is considerably more public discussion of how WWII, and not the New Deal, brought the USA out of the Great Depression.  However, there is still some confusion as it wasn’t the war spending itself that did the trick, but rather <i>the breaking of the windows of the rest of the planet’s industrial infrastructure</i>.  See RGD and Vox’s Broken Window Theory, Revised, which states that Bastiat’s Broken Window is no fallacy, so long as you break all the windows in the next town over as well as the legs of its glaziers.</p><p>So, barring any flattening of an alien planet and the subsequent development of interstellar trade, Paul Krugman’s fantasy of <a href=\"http://newsbusters.org/blogs/noel-sheppard/2011/08/14/paul-krugman-calls-space-aliens-attack-earth-requiring-massive-defens\">preparing for an alien space war</a> is unlikely to lead to economic recovery:</p><blockquote><p>PAUL KRUGMAN, NEW YORK TIMES: Think about World War II, right? That was actually negative social product spending, and yet it brought us out.</p><p>I mean, probably because you want to put these things together, if we say, “Look, we could use some inflation.” Ken and I are both saying that, which is, of course, anathema to a lot of people in Washington but is, in fact, what fhe basic logic says.</p><p>It’s very hard to get inflation in a depressed economy. But if you had a program of government spending plus an expansionary policy by the Fed, you could get that. So, if you think about using all of these things together, you could accomplish, you know, a great deal.</p><p>If we discovered that, you know, space aliens were planning to attack and we needed a massive buildup to counter the space alien threat and really inflation and budget deficits took secondary place to that, this slump would be over in 18 months. And then if we discovered, oops, we made a mistake, there aren’t any aliens, we’d be better –</p><p>ROGOFF: And we need Orson Welles, is what you’re saying.</p><p>KRUGMAN: No, there was a “Twilight Zone” episode like this in which scientists fake an alien threat in order to achieve world peace. Well, this time, we don’t need it, we need it in order to get some fiscal stimulus.</p></blockquote><p>The amazing thing isn’t the fluid way Paul Krugman moves from one fantasy to the next – remember, his inspiration for becoming an economist was Isaac Asimov’s <i>Foundation </i>novels – but that he does so while remaining convinced that he is the only serious economic realist in the debate.  The guy is <i>seriously </i>strange, and at this point, I’m not entirely sure he’s even sane.</p><p>Unless, of course, <a href=\"http://www.milobookclub.com/2011/08/14/um-thats-no-plane/\">that stealthy Death Star</a> is coming our way!</p></div>",
  "content_text": "I’ve noticed that there is considerably more public discussion of how WWII, and not the New Deal, brought the USA out of the Great Depression.  However, there is still some confusion as it wasn’t the war spending itself that did the trick, but rather\nthe breaking of the windows of the rest of the planet’s industrial infrastructure\n.  See RGD and Vox’s Broken Window Theory, Revised, which states that Bastiat’s Broken Window is no fallacy, so long as you break all the windows in the next town over as well as the legs of its glaziers.\nSo, barring any flattening of an alien planet and the subsequent development of interstellar trade, Paul Krugman’s fantasy of\npreparing for an alien space war\nis unlikely to lead to economic recovery:\nPAUL KRUGMAN, NEW YORK TIMES: Think about World War II, right? That was actually negative social product spending, and yet it brought us out.\nI mean, probably because you want to put these things together, if we say, “Look, we could use some inflation.” Ken and I are both saying that, which is, of course, anathema to a lot of people in Washington but is, in fact, what fhe basic logic says.\nIt’s very hard to get inflation in a depressed economy. But if you had a program of government spending plus an expansionary policy by the Fed, you could get that. So, if you think about using all of these things together, you could accomplish, you know, a great deal.\nIf we discovered that, you know, space aliens were planning to attack and we needed a massive buildup to counter the space alien threat and really inflation and budget deficits took secondary place to that, this slump would be over in 18 months. And then if we discovered, oops, we made a mistake, there aren’t any aliens, we’d be better –\nROGOFF: And we need Orson Welles, is what you’re saying.\nKRUGMAN: No, there was a “Twilight Zone” episode like this in which scientists fake an alien threat in order to achieve world peace. Well, this time, we don’t need it, we need it in order to get some fiscal stimulus.\nThe amazing thing isn’t the fluid way Paul Krugman moves from one fantasy to the next – remember, his inspiration for becoming an economist was Isaac Asimov’s\nFoundation\nnovels – but that he does so while remaining convinced that he is the only serious economic realist in the debate.  The guy is\nseriously\nstrange, and at this point, I’m not entirely sure he’s even sane.\nUnless, of course,\nthat stealthy Death Star\nis coming our way!",
  "tags": [
    "economics",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-16T10:30:00+00:00"
}