{
  "url": "https://voxday.net/2011/08/30/let-me-explain-how-this-works/",
  "scraped_at": "2025-12-13T23:20:26.198475",
  "title": "Let me explain how this works",
  "date_display": "August 30, 2011",
  "date_iso": "2011-08-30T10:00:00+00:00",
  "date_from_url": "2011-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Pharyngulan Reynold managed to post <s>six (6)</s> eleven (11) comments without actually answering any of the four questions I posed him:</p><blockquote><p>It’s only been a few hours Vox..I do have to do other things than just post comments on your blog. You can’t start badgering me because I’ve not answered all of your questions after just a few bloody hours! I’ll get to them eventually.</p></blockquote><p>I’m sure you have many other things to do.  Just as I’m sure everyone will be interested in reading those answers when you find the time to answer them.  But if one has time to post six comments, one surely has time to answer four questions.  Just to make things perfectly clear, priority should be given to the four specific questions I have posed.  I’m not badgering him, that’s simply how things work around here; see The Rules on the left sidebar for details if necessary.  Now, it must be recognized that Reynold did make unsuccessful attempts to evade two of the questions by calling them into question, but since the points he made were respectively incorrect and irrelevant, all four questions still remain to be answered.  They are as follows:</p><p><i>1. Would you seriously consider it meaningful, or even remotely relevant, if JD were to debate me on Paul Zachary’s behalf, so long as he felt he has a good understanding of Paul Zachary’s words?</i></p><p>2. If science produces technology, and not the other way around, why was technological advancement almost completely frozen in the Soviet Union for fifty years when they devoted a larger percentage of their GDP to science research than the United States did? (His attempt to argue that Soviet technology was essentially equal to US technology on the basis of the stolen atomic bomb and the space program is verifiably false.  I am also willing to accept an answer which substitutes why the technological level of the Soviet Union “fell significantly behind that of the United States” in lieu of its technological advancement being “almost completely frozen”.)</p><p>3. Is science unnecessary for technological development or am I, in fact, a master of science? (This is in response to his contradictory assertions that science drives technological advancement and my supposed ignorance of science.  As he questioned my technological credentials, which are well-known in the game industry, I referred him to <i>Engadget</i>, which described one of my various technology designs as “the most advanced they had ever seen.”)</p><p>4. Now that I have answered all his questions and proved that “marital rape” can be reasonably defended under the principle of Common Law, is he willing to admit that by his own metric, the adjectives “inane” and “unworthy” no longer apply to me as a potential debate opponent for Paul Zachary Myers?</p><p>Now, for all that Pharyngulans tend to believe that Vox Popoli is the polar opposite of the echo chamber that is Pharyngula, that really is not the case.  Here, one is expected to respond directly to the questions posed; any rationalizations or justifications are to be offered AFTER providing an answer to the question, not in lieu of it.  As I have answered all of his questions, as well as those of his fellow Pharyngulan Mhich, it is perfectly reasonable to expect that they will show me the same courtesy.</p><p>UPDATE – Reynold writes this and then proceeds to spend the rest of the comment, and four subsequent comments, still failing to answer ANY of the four questions.  He points his toes nicely as he dances, though.  Dance, little Pharyngulan, dance!</p><blockquote><p>So, less than one full day and you go and make a post about how I have not answered any of your questions?  Not only is that impatient as hell, but that’s dishonest. I have answered several of your questions.  You just find some excuse to disregard them (see your post above) and then claim that I’ve never answered them.  I was warned that you were a dishonest pr1ck, looks like they were right.</p></blockquote><p>That makes eleven (11) comments and still not a single answer.  First, one cannot be considered to have answered a yes/no question without providing a yes or no.  Nor can one be considered to have answered an either/or question without selecting one of the two options.  Neither can one legitimately answer a question by arguing about the basis for the question.  I haven’t needed any excuse to disregard his answers because <i>he hasn’t actually answered any of the four questions</i>.  Unlike his fellow Pharyngulan, Mhich, who appears to grasp the basic concept of first <i>answering the question</i> and only then proceeding to justify his answer, Reynold has produced nothing but incorrect, unsubstantiated, and invalid excuses for why he shouldn’t have to answer the questions.  Is he being evasive because he fears being pinned down or is he simply that stupid?  At this point, it’s a tough call.  In any event, he will not be commenting here anymore unless and until he provides unequivocal, straightforward answers to the four questions, as per the publicly posted Rules of the Blog.</p><p>UPDATE II – Where is Renee anyway?  This sort of rape talk would normally have her all hot and bothered.</p></div>",
  "content_text": "The Pharyngulan Reynold managed to post\nsix (6)\neleven (11) comments without actually answering any of the four questions I posed him:\nIt’s only been a few hours Vox..I do have to do other things than just post comments on your blog. You can’t start badgering me because I’ve not answered all of your questions after just a few bloody hours! I’ll get to them eventually.\nI’m sure you have many other things to do.  Just as I’m sure everyone will be interested in reading those answers when you find the time to answer them.  But if one has time to post six comments, one surely has time to answer four questions.  Just to make things perfectly clear, priority should be given to the four specific questions I have posed.  I’m not badgering him, that’s simply how things work around here; see The Rules on the left sidebar for details if necessary.  Now, it must be recognized that Reynold did make unsuccessful attempts to evade two of the questions by calling them into question, but since the points he made were respectively incorrect and irrelevant, all four questions still remain to be answered.  They are as follows:\n1. Would you seriously consider it meaningful, or even remotely relevant, if JD were to debate me on Paul Zachary’s behalf, so long as he felt he has a good understanding of Paul Zachary’s words?\n2. If science produces technology, and not the other way around, why was technological advancement almost completely frozen in the Soviet Union for fifty years when they devoted a larger percentage of their GDP to science research than the United States did? (His attempt to argue that Soviet technology was essentially equal to US technology on the basis of the stolen atomic bomb and the space program is verifiably false.  I am also willing to accept an answer which substitutes why the technological level of the Soviet Union “fell significantly behind that of the United States” in lieu of its technological advancement being “almost completely frozen”.)\n3. Is science unnecessary for technological development or am I, in fact, a master of science? (This is in response to his contradictory assertions that science drives technological advancement and my supposed ignorance of science.  As he questioned my technological credentials, which are well-known in the game industry, I referred him to\nEngadget\n, which described one of my various technology designs as “the most advanced they had ever seen.”)\n4. Now that I have answered all his questions and proved that “marital rape” can be reasonably defended under the principle of Common Law, is he willing to admit that by his own metric, the adjectives “inane” and “unworthy” no longer apply to me as a potential debate opponent for Paul Zachary Myers?\nNow, for all that Pharyngulans tend to believe that Vox Popoli is the polar opposite of the echo chamber that is Pharyngula, that really is not the case.  Here, one is expected to respond directly to the questions posed; any rationalizations or justifications are to be offered AFTER providing an answer to the question, not in lieu of it.  As I have answered all of his questions, as well as those of his fellow Pharyngulan Mhich, it is perfectly reasonable to expect that they will show me the same courtesy.\nUPDATE – Reynold writes this and then proceeds to spend the rest of the comment, and four subsequent comments, still failing to answer ANY of the four questions.  He points his toes nicely as he dances, though.  Dance, little Pharyngulan, dance!\nSo, less than one full day and you go and make a post about how I have not answered any of your questions?  Not only is that impatient as hell, but that’s dishonest. I have answered several of your questions.  You just find some excuse to disregard them (see your post above) and then claim that I’ve never answered them.  I was warned that you were a dishonest pr1ck, looks like they were right.\nThat makes eleven (11) comments and still not a single answer.  First, one cannot be considered to have answered a yes/no question without providing a yes or no.  Nor can one be considered to have answered an either/or question without selecting one of the two options.  Neither can one legitimately answer a question by arguing about the basis for the question.  I haven’t needed any excuse to disregard his answers because\nhe hasn’t actually answered any of the four questions\n.  Unlike his fellow Pharyngulan, Mhich, who appears to grasp the basic concept of first\nanswering the question\nand only then proceeding to justify his answer, Reynold has produced nothing but incorrect, unsubstantiated, and invalid excuses for why he shouldn’t have to answer the questions.  Is he being evasive because he fears being pinned down or is he simply that stupid?  At this point, it’s a tough call.  In any event, he will not be commenting here anymore unless and until he provides unequivocal, straightforward answers to the four questions, as per the publicly posted Rules of the Blog.\nUPDATE II – Where is Renee anyway?  This sort of rape talk would normally have her all hot and bothered.",
  "tags": [
    "mailvox",
    "Science Reason"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-30T09:00:00+00:00"
}