{
  "url": "https://voxday.net/2011/08/27/mailvox-concerning-questions/",
  "scraped_at": "2025-12-13T23:20:13.349688",
  "title": "Mailvox: concerning the questions",
  "date_display": "August 27, 2011",
  "date_iso": "2011-08-27T14:28:00+00:00",
  "date_from_url": "2011-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MD has a few follow-up questions:</p><blockquote><p>Enjoyed reading your answers to NYT ‘questioning’  If nothing else, I think you exhibit the (admirable) virtue of honesty.  As you can  probably imagine, a couple of points I need to raise:</p><p>1a) firstly, and most importantly, there is absolutely no way that evolution is ‘a minor aspect of biological science’! I wonder which professor of biological sciences you are quoting?  Evolution is the central and unifying concept of modern biology &amp; medicine.   When you say you are skeptical of evolution, I’m not sure you are clear about on what level you disagree. I too (as a holder of 2  1st  class BSc. s.  &amp; an MSc. in the biological sciences, you could say I am skeptical about some aspects of some hypotheses of evolutionary theory. However, Do you :</p><p>1b)  believe that the Judeo-Christian literal creationist hypotheses are equally likely to be objectively true as the theories of modern evolutionary science?</p><p>1c) On what level do you NOT believe in evolution? I’ve never met anyone that says that the gene pool of one generation is IDENTICAL to the next. The basic premiss of evolutionary theory is that there is a difference (ie a CHANGE in the gene pool).</p><p>1d) From what basis do you say that mainstream scientific theory shouldn’t be taught in public schools?!</p><p>2) I agree that America could be described as a ‘Christian Nation’ as the majority of it’s citizen’s consistently describe themselves as such in all respectable polls that I have seen. [of course we shouldn’t forget that the reason that America is a Christian nation is because the Christians got rid of all the pagans! ]</p><p>However, I feel it is a bit disingenuous of an educated American to say that it was founded by Christians; the founding fathers were clearly a mixture of Christians and deists and agnostics.  In the official words of John Adams : ‘As the Government of the United States of America is not, in any sense, founded on the Christian religion . . . ‘</p><p>3) on the issue of teachers leading students in prayers, I myself have no problem with this. I did have an issue with my daughter being forced to pray at school – which has now been resolved. She has decided not to, but sits amongst her peers as a time of reflection during prayer. (actually, she switches between praying and not praying  – which is, from my perspective, is how it should be.) For me, the most important thing is for my children to be free to form their own beliefs.</p><p>Lastly, I think it’s important for Christians to realise that the reason that I don’t describe myself as a Christian is because the overwhelming majority of THEM have excluded ME (not the other way around), because I happen to believe that Jesus didn’t have magical powers like Harry potter, despite thinking that he was highly likely to have been an admirable and remarkable man in his times.</p></blockquote><p>1a.  Evolution is not the central and unifying concept of modern biology and medicine.  It is almost completely irrelevant to both.  No doctor, and few biologists, need know anything about evolution at all in order to perform their various medical and scientific duties.  Even if you subscribe fully to whatever the Cult of Darwin’s latest dogma happens to be, this is akin to saying that the Greek Classics are the central and unifying concept of economics and plumbing.  The fact that there may be some intellectual relationship, even a direct causal one, doesn’t necessarily make it the least bit relevant today.  Men – religious men, ironically enough – managed to figure out both artificial selection and genetics without any help from evolutionary theory; even if true, it’s almost completely useless.  True or not, evolution’s only significance is philosophical, which is why its advocates invariably sound more like cultists than scientists.</p><p>1b. There are too many hypotheses on both sides for me to possibly say.  I can only say that I believe some form of Creator is far more likely to be objectively true than either abiogenesis or any form of Darwinian evolution.  It may be my technological bias, but I see genes as being more akin to the primitives of a programming language than to pieces of a jigsaw puzzle gradually assembled over time by the processes of natural selection, biased mutation, genetic drift, gene flow, or any other epicyclical mechanism the Darwinian cultists can conceive.  This implies both the creator of the language as well as a programmer or two.</p><p>1c. The level on which I am <i>skeptical</i> of evolution – I do not entirely rule out the possibility – is that any of the various evolutionary mechanisms proposed are sufficient to modify the gene pool to such an extent as to create new and entirely different species regardless of the amount of time involved.</p><p>1d.  There is zero utility in attempting to teach science to schoolchildren who can’t read, can’t do math, and will never be scientists.  They can’t understand it, aren’t interested in it, and have no use for it.  It makes no difference if you’re trying to teach them mainstream scientific theory, iambic tetrameter, or running the 100m dash in five seconds.  It isn’t ever going to happen.  My return question: how can you justify teaching public schoolchildren mainstream scientific theory and not teaching them basic personal economics like how to balance a checkbook or calculate compound interest or basic physical fitness?</p><p>2.  The “mixture of Christians and deists and agnostics” among the Founding Fathers was on the order of 99% to 1%.  It would not merely be disingenuous, it is flat out wrong to state that America was NOT founded by Christians.  There were more Founding Fathers with theological degrees than deists and atheists combined; there were more Founding Fathers who personally translated the Bible than there were deists and atheists combined.  This is why even intelligent, educated atheists often find themselves inadvertently looking very historically illiterate, as they tend to be maleducated in certain areas.  Unfortunately, the reason many are maleducated on this particular issue is due to an all too typical atheist dishonesty with regards to standard word definitions; in this case, whoever constructed the atheist talking point attempted to revise the term “Founding Fathers” to mean a very small number of men, as few as seven “key” Founding Fathers.  This is blatantly incorrect, as there have always been two groups of Founding Fathers, the Signers and the Framers.  In both cases, nearly all of the men involved were Christians.</p><p>In fact, the maleducated atheist opinion doesn’t even rise to the level of Wikipedia: “<i>Of the 55 delegates to the 1787 Constitutional Convention, 49 were Protestants, and three were Roman Catholics.</i>”  And more detailed information <a href=\"http://www.adherents.com/gov/Founding_Fathers_Religion.html\">is readily available</a>.</p><p>3.  Admiration, even belief, is not worship.  Even belief in Jesus Christ’s “magical powers” would not be sufficient to make a Christian.  Even the demons believe, but they do not <i>worship</i>.  No man can exclude a man from the body of Christ except that man himself.</p></div>",
  "content_text": "MD has a few follow-up questions:\nEnjoyed reading your answers to NYT ‘questioning’  If nothing else, I think you exhibit the (admirable) virtue of honesty.  As you can  probably imagine, a couple of points I need to raise:\n1a) firstly, and most importantly, there is absolutely no way that evolution is ‘a minor aspect of biological science’! I wonder which professor of biological sciences you are quoting?  Evolution is the central and unifying concept of modern biology & medicine.   When you say you are skeptical of evolution, I’m not sure you are clear about on what level you disagree. I too (as a holder of 2  1st  class BSc. s.  & an MSc. in the biological sciences, you could say I am skeptical about some aspects of some hypotheses of evolutionary theory. However, Do you :\n1b)  believe that the Judeo-Christian literal creationist hypotheses are equally likely to be objectively true as the theories of modern evolutionary science?\n1c) On what level do you NOT believe in evolution? I’ve never met anyone that says that the gene pool of one generation is IDENTICAL to the next. The basic premiss of evolutionary theory is that there is a difference (ie a CHANGE in the gene pool).\n1d) From what basis do you say that mainstream scientific theory shouldn’t be taught in public schools?!\n2) I agree that America could be described as a ‘Christian Nation’ as the majority of it’s citizen’s consistently describe themselves as such in all respectable polls that I have seen. [of course we shouldn’t forget that the reason that America is a Christian nation is because the Christians got rid of all the pagans! ]\nHowever, I feel it is a bit disingenuous of an educated American to say that it was founded by Christians; the founding fathers were clearly a mixture of Christians and deists and agnostics.  In the official words of John Adams : ‘As the Government of the United States of America is not, in any sense, founded on the Christian religion . . . ‘\n3) on the issue of teachers leading students in prayers, I myself have no problem with this. I did have an issue with my daughter being forced to pray at school – which has now been resolved. She has decided not to, but sits amongst her peers as a time of reflection during prayer. (actually, she switches between praying and not praying  – which is, from my perspective, is how it should be.) For me, the most important thing is for my children to be free to form their own beliefs.\nLastly, I think it’s important for Christians to realise that the reason that I don’t describe myself as a Christian is because the overwhelming majority of THEM have excluded ME (not the other way around), because I happen to believe that Jesus didn’t have magical powers like Harry potter, despite thinking that he was highly likely to have been an admirable and remarkable man in his times.\n1a.  Evolution is not the central and unifying concept of modern biology and medicine.  It is almost completely irrelevant to both.  No doctor, and few biologists, need know anything about evolution at all in order to perform their various medical and scientific duties.  Even if you subscribe fully to whatever the Cult of Darwin’s latest dogma happens to be, this is akin to saying that the Greek Classics are the central and unifying concept of economics and plumbing.  The fact that there may be some intellectual relationship, even a direct causal one, doesn’t necessarily make it the least bit relevant today.  Men – religious men, ironically enough – managed to figure out both artificial selection and genetics without any help from evolutionary theory; even if true, it’s almost completely useless.  True or not, evolution’s only significance is philosophical, which is why its advocates invariably sound more like cultists than scientists.\n1b. There are too many hypotheses on both sides for me to possibly say.  I can only say that I believe some form of Creator is far more likely to be objectively true than either abiogenesis or any form of Darwinian evolution.  It may be my technological bias, but I see genes as being more akin to the primitives of a programming language than to pieces of a jigsaw puzzle gradually assembled over time by the processes of natural selection, biased mutation, genetic drift, gene flow, or any other epicyclical mechanism the Darwinian cultists can conceive.  This implies both the creator of the language as well as a programmer or two.\n1c. The level on which I am\nskeptical\nof evolution – I do not entirely rule out the possibility – is that any of the various evolutionary mechanisms proposed are sufficient to modify the gene pool to such an extent as to create new and entirely different species regardless of the amount of time involved.\n1d.  There is zero utility in attempting to teach science to schoolchildren who can’t read, can’t do math, and will never be scientists.  They can’t understand it, aren’t interested in it, and have no use for it.  It makes no difference if you’re trying to teach them mainstream scientific theory, iambic tetrameter, or running the 100m dash in five seconds.  It isn’t ever going to happen.  My return question: how can you justify teaching public schoolchildren mainstream scientific theory and not teaching them basic personal economics like how to balance a checkbook or calculate compound interest or basic physical fitness?\n2.  The “mixture of Christians and deists and agnostics” among the Founding Fathers was on the order of 99% to 1%.  It would not merely be disingenuous, it is flat out wrong to state that America was NOT founded by Christians.  There were more Founding Fathers with theological degrees than deists and atheists combined; there were more Founding Fathers who personally translated the Bible than there were deists and atheists combined.  This is why even intelligent, educated atheists often find themselves inadvertently looking very historically illiterate, as they tend to be maleducated in certain areas.  Unfortunately, the reason many are maleducated on this particular issue is due to an all too typical atheist dishonesty with regards to standard word definitions; in this case, whoever constructed the atheist talking point attempted to revise the term “Founding Fathers” to mean a very small number of men, as few as seven “key” Founding Fathers.  This is blatantly incorrect, as there have always been two groups of Founding Fathers, the Signers and the Framers.  In both cases, nearly all of the men involved were Christians.\nIn fact, the maleducated atheist opinion doesn’t even rise to the level of Wikipedia: “\nOf the 55 delegates to the 1787 Constitutional Convention, 49 were Protestants, and three were Roman Catholics.\n”  And more detailed information\nis readily available\n.\n3.  Admiration, even belief, is not worship.  Even belief in Jesus Christ’s “magical powers” would not be sufficient to make a Christian.  Even the demons believe, but they do not\nworship\n.  No man can exclude a man from the body of Christ except that man himself.",
  "tags": [
    "Christianity",
    "evolution",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-27T13:28:00+00:00"
}