{
  "url": "https://voxday.net/2011/08/21/mailvox-muslim-my/",
  "scraped_at": "2025-12-13T23:19:38.083718",
  "title": "Mailvox: the Muslim myth",
  "date_display": "August 21, 2011",
  "date_iso": "2011-08-21T00:00:00+00:00",
  "date_from_url": "2011-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The aptly named Sub Specie has fallen for a common legend believed by many of the half-educated and historically illiterate:</p><blockquote><p>“If it weren’t for the goddamn Muslims, we wouldn’t have great ancient literature!!! They preserved it for us, you know. Oh, fcuk, no, you didn’t know…did you? Not only did they preserve all that s#it, but they contributed so much to math, medicine and science (ironically while Europe was a chaotic s#ithole full of rotting bodies).”</p></blockquote><p>It’s always interesting to receive what apparently is intended as a history lesson from someone who quite clearly knows nothing of the Eastern Roman Empire.  The idea of “the Arab transmission of the classics” <a href=\"http://www.wikiislam.net/wiki/Arab_Transmission_of_the_Classics\">is false</a>, as should be readily apparent to those who are aware that most of the ancient works lost to the West were “discovered” in conquered Spain, not the Middle East.  Moreover, it is obvious that the Muslims did not contribute much of their own in the interim period when they possessed the Greek classics and the post-imperial Latins did not.</p><p>“The Arab transmission of the classics is a common and persistent myth that Arabic commentators such as Avicenna and Averroes ‘saved’ the work of Aristotle and other Greek philosophers from destruction. According to the myth, these works would otherwise have perished in the long European dark age between fifth and the tenth centuries, had the Islamic philosophers not preserved them by translating them into Arabic, to be passed on to the Latin philosophers in the West after the reconquest of Spain from the Muslims during the twelve and thirteenth centuries. This is incorrect. It was actually the Byzantines in the East who saved the ancient learning of the Greeks in the original language, and the first Latin texts to be used were translation from the Greek, in the 12th century, rather than, in most cases, the Arabic, which were only used in default of these. “</p></div>",
  "content_text": "The aptly named Sub Specie has fallen for a common legend believed by many of the half-educated and historically illiterate:\n“If it weren’t for the goddamn Muslims, we wouldn’t have great ancient literature!!! They preserved it for us, you know. Oh, fcuk, no, you didn’t know…did you? Not only did they preserve all that s#it, but they contributed so much to math, medicine and science (ironically while Europe was a chaotic s#ithole full of rotting bodies).”\nIt’s always interesting to receive what apparently is intended as a history lesson from someone who quite clearly knows nothing of the Eastern Roman Empire.  The idea of “the Arab transmission of the classics”\nis false\n, as should be readily apparent to those who are aware that most of the ancient works lost to the West were “discovered” in conquered Spain, not the Middle East.  Moreover, it is obvious that the Muslims did not contribute much of their own in the interim period when they possessed the Greek classics and the post-imperial Latins did not.\n“The Arab transmission of the classics is a common and persistent myth that Arabic commentators such as Avicenna and Averroes ‘saved’ the work of Aristotle and other Greek philosophers from destruction. According to the myth, these works would otherwise have perished in the long European dark age between fifth and the tenth centuries, had the Islamic philosophers not preserved them by translating them into Arabic, to be passed on to the Latin philosophers in the West after the reconquest of Spain from the Muslims during the twelve and thirteenth centuries. This is incorrect. It was actually the Byzantines in the East who saved the ancient learning of the Greeks in the original language, and the first Latin texts to be used were translation from the Greek, in the 12th century, rather than, in most cases, the Arabic, which were only used in default of these. “",
  "tags": [
    "history",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-20T23:00:00+00:00"
}