{
  "url": "https://voxday.net/2011/08/02/mailvox-poem-by-little-dick/",
  "scraped_at": "2025-12-13T23:17:45.660347",
  "title": "Mailvox: A poem by Little Dick",
  "date_display": "August 2, 2011",
  "date_iso": "2011-08-02T09:38:00+00:00",
  "date_from_url": "2011-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Every now and then, people ask me why I bother engaging with evangelical atheists.  I trust this email, quoted verbatim and in its entirety, should suffice to answer that question.  It would appear that Little Dick Harris is attempting to convert the world to atheism with poetry.  His magnum opus is entitled “Woo”.</p><p><i><b>Woo</b></i></p><p>The Christian’s Jehovah, the Almighty God,<br> is a capricious and cantankerous sod;<br> he’s a jealous, vain, and incompetent fraud,<br> with the morals of a sadistic tribal war lord.</br></br></br></p><p>For homophobia, misogyny, and genocide too,<br> that old Bible Bogey is the god for you.<br> He’s his own father, and his son, and a ghost too,<br> but there’s even more ridiculous woo.</br></br></br></p><p>Christians claim their god, in his Empyrean lair,<br> is omniscient, omnipotent, beneficent and fair;<br> but, with the problem of theodicy,<br> that dogma is Christian idiocy.</br></br></br></p><p>The Jew’s Yahweh, a wrathful old jerk,<br> set Jews strict rules on when to work,<br> how to dress, and what to sup or sip,<br> and giving baby boys the snip.</br></br></br></p><p>Myths of Bronze Age, goat-herding nomads,<br> metaphorically have them, by the gonads.<br> The Moslem’s Allah, a fierce great djinn,<br> demands under ‘Islam’, literally, ‘Submission’.</br></br></br></p><p>Apostasy is treated just like a crime;<br> they’ll threaten to kill you, to keep you in line,<br> and if you dare draw Mohammad in a comic cartoon,<br> there’ll be riots and killings from here to Khartoum.</br></br></br></p><p>Hindu, Sikh, Jain, and Buddhist,<br> Zoroastrian, Baha’i, Mormon, and Scientologist,<br> Confucianist, Shintoist, and Taoist too,<br> Spiritualist, Wiccan, and the New Ager into woo.</br></br></br></p><p>Yea, verily, those of each and every religion,<br> are mired in the miasma of superstition.<br> So, why should yours be the one true faith,<br> in the magic of a phantasmagorical wraith?</br></br></br></p><p>Belief, without evidence, is just plain crazy,<br> ignorant, stupid, or thoughtlessly lazy.<br> Life derives no purpose, at a theistic god’s direction;<br> evolution really happens, due to Natural Selection.</br></br></br></p><p>I have sent you this poem in the hope that you will read it and realize that some people find your religious beliefs to be unwarranted and absurd.  When I was a small boy, still in short pants, I understood that there was no supporting evidence for religious beliefs, and therefore, such beliefs had no basis in fact.  Later, I realized that religion was a tool for controlling people.  Religion should be a private matter, because when it gains political power, as with any ideology, it becomes a tool for oppression.  Please consider the benefits of rational thought over superstition and wishful thinking.</p><p>Oh, I read it twice, as a matter of fact.  The first time in disbelief, the second time in awe.  My first coherent thought was that the poem doesn’t scan well, commits six rhyming infelicities, reveals the usual ignorance of actual Christian theology, repeats numerous talking points that have been repeatedly shown to be false, and consists of crude doggerel that is never going to be mistaken for Dante or Yeats.  My second thought was that we have a real candidate for the 2012 Richard Dawkins Award on our hands!  Science can inspire art after all!</p><p>My third thought, of course, was that the poet is not one who would recognize a “rational thought” if he spent the next ten years having Aristotle, Aquinas, and Descartes read to him before bedtime.  And then, only then, I began to laugh….</p><p>One of the many amusing things about this email is the way that Little Dick openly admits his lack of faith is quite literally childish.  “When I was a small boy, still in short pants, I understood that there was no supporting evidence for religious beliefs, and therefore, such beliefs had no basis in fact.”  I don’t know about you, but I tend to find this assertion to be just a little less than credible.  What are the chances that, “as a small boy still in short pants”, Little Dick Harris had been able to peruse all of the available evidence that tended to support religious beliefs, whether one uses the term “evidence” properly or not?</p><p>Of course, his poem is a colorful piece of evidence demonstrating, that like every other evangelical atheist, Little Dick is still an emotional and intellectual child throwing a non-stop temper tantrum because the adults simply will not pretend to believe in his imaginary world.</p><p>UPDATE – But wait, there’s more!  A follow-up email has arrived:</p><p><i>Vox, you ask, “What are the chances that, “as a small boy still in short pants”, Little Dick Harris had been able to peruse all of the available evidence that tended to support religious beliefs, whether one uses the term “evidence” properly or not?”</i></p><p>Zero, of course.  What a stupid question.  It isn’t necessary to read all of it, or, as I’ve subsequently discovered, any of it.  Other than, that is, to find out that it’s empty, eristic hermeneutics, &amp; sciolistic casuistry.</p><p>Little Dick noticed that the sort of miracles documented by Bede, clearly, were no longer taking place.  Occasional claims for somewhat more mundane miracles, usually involving apparitions or healing, were obviously without good supporting evidence.  As Hume demanded, extraordinary claims require extraordinary evidence, &amp; it was always lacking.  By the age of twelve, it was plain to me that everything that I was aware of that happened in the world, &amp; the universe, was potentially explicable in terms of natural processes.</p><p>Half a century later, I’ve never once doubted that, except for the realization that we may never be able to explain everything.  Supernatural explanations add nothing of real value to our understanding.  All that they can do is satisfy the wishful thinking of credulous individuals.</p><p>There you have it, from the mouth of the Poet Laureate of Rational Atheism.  You don’t need to examine ANY evidence at all in order to reach a rational conclusion that satisfies the self-styled materialist.  And thus the Worm Ourobos devours his own tail and we finally reach the glorious conclusion of rational materialist epistemology.</p></div>",
  "content_text": "Every now and then, people ask me why I bother engaging with evangelical atheists.  I trust this email, quoted verbatim and in its entirety, should suffice to answer that question.  It would appear that Little Dick Harris is attempting to convert the world to atheism with poetry.  His magnum opus is entitled “Woo”.\nWoo\nThe Christian’s Jehovah, the Almighty God,\nis a capricious and cantankerous sod;\nhe’s a jealous, vain, and incompetent fraud,\nwith the morals of a sadistic tribal war lord.\nFor homophobia, misogyny, and genocide too,\nthat old Bible Bogey is the god for you.\nHe’s his own father, and his son, and a ghost too,\nbut there’s even more ridiculous woo.\nChristians claim their god, in his Empyrean lair,\nis omniscient, omnipotent, beneficent and fair;\nbut, with the problem of theodicy,\nthat dogma is Christian idiocy.\nThe Jew’s Yahweh, a wrathful old jerk,\nset Jews strict rules on when to work,\nhow to dress, and what to sup or sip,\nand giving baby boys the snip.\nMyths of Bronze Age, goat-herding nomads,\nmetaphorically have them, by the gonads.\nThe Moslem’s Allah, a fierce great djinn,\ndemands under ‘Islam’, literally, ‘Submission’.\nApostasy is treated just like a crime;\nthey’ll threaten to kill you, to keep you in line,\nand if you dare draw Mohammad in a comic cartoon,\nthere’ll be riots and killings from here to Khartoum.\nHindu, Sikh, Jain, and Buddhist,\nZoroastrian, Baha’i, Mormon, and Scientologist,\nConfucianist, Shintoist, and Taoist too,\nSpiritualist, Wiccan, and the New Ager into woo.\nYea, verily, those of each and every religion,\nare mired in the miasma of superstition.\nSo, why should yours be the one true faith,\nin the magic of a phantasmagorical wraith?\nBelief, without evidence, is just plain crazy,\nignorant, stupid, or thoughtlessly lazy.\nLife derives no purpose, at a theistic god’s direction;\nevolution really happens, due to Natural Selection.\nI have sent you this poem in the hope that you will read it and realize that some people find your religious beliefs to be unwarranted and absurd.  When I was a small boy, still in short pants, I understood that there was no supporting evidence for religious beliefs, and therefore, such beliefs had no basis in fact.  Later, I realized that religion was a tool for controlling people.  Religion should be a private matter, because when it gains political power, as with any ideology, it becomes a tool for oppression.  Please consider the benefits of rational thought over superstition and wishful thinking.\nOh, I read it twice, as a matter of fact.  The first time in disbelief, the second time in awe.  My first coherent thought was that the poem doesn’t scan well, commits six rhyming infelicities, reveals the usual ignorance of actual Christian theology, repeats numerous talking points that have been repeatedly shown to be false, and consists of crude doggerel that is never going to be mistaken for Dante or Yeats.  My second thought was that we have a real candidate for the 2012 Richard Dawkins Award on our hands!  Science can inspire art after all!\nMy third thought, of course, was that the poet is not one who would recognize a “rational thought” if he spent the next ten years having Aristotle, Aquinas, and Descartes read to him before bedtime.  And then, only then, I began to laugh….\nOne of the many amusing things about this email is the way that Little Dick openly admits his lack of faith is quite literally childish.  “When I was a small boy, still in short pants, I understood that there was no supporting evidence for religious beliefs, and therefore, such beliefs had no basis in fact.”  I don’t know about you, but I tend to find this assertion to be just a little less than credible.  What are the chances that, “as a small boy still in short pants”, Little Dick Harris had been able to peruse all of the available evidence that tended to support religious beliefs, whether one uses the term “evidence” properly or not?\nOf course, his poem is a colorful piece of evidence demonstrating, that like every other evangelical atheist, Little Dick is still an emotional and intellectual child throwing a non-stop temper tantrum because the adults simply will not pretend to believe in his imaginary world.\nUPDATE – But wait, there’s more!  A follow-up email has arrived:\nVox, you ask, “What are the chances that, “as a small boy still in short pants”, Little Dick Harris had been able to peruse all of the available evidence that tended to support religious beliefs, whether one uses the term “evidence” properly or not?”\nZero, of course.  What a stupid question.  It isn’t necessary to read all of it, or, as I’ve subsequently discovered, any of it.  Other than, that is, to find out that it’s empty, eristic hermeneutics, & sciolistic casuistry.\nLittle Dick noticed that the sort of miracles documented by Bede, clearly, were no longer taking place.  Occasional claims for somewhat more mundane miracles, usually involving apparitions or healing, were obviously without good supporting evidence.  As Hume demanded, extraordinary claims require extraordinary evidence, & it was always lacking.  By the age of twelve, it was plain to me that everything that I was aware of that happened in the world, & the universe, was potentially explicable in terms of natural processes.\nHalf a century later, I’ve never once doubted that, except for the realization that we may never be able to explain everything.  Supernatural explanations add nothing of real value to our understanding.  All that they can do is satisfy the wishful thinking of credulous individuals.\nThere you have it, from the mouth of the Poet Laureate of Rational Atheism.  You don’t need to examine ANY evidence at all in order to reach a rational conclusion that satisfies the self-styled materialist.  And thus the Worm Ourobos devours his own tail and we finally reach the glorious conclusion of rational materialist epistemology.",
  "tags": [
    "atheism",
    "mailvox",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-02T08:38:00+00:00"
}