{
  "url": "https://voxday.net/2011/08/06/my-five-highlight-reel-nfl-players/",
  "scraped_at": "2025-12-13T23:18:13.211607",
  "title": "My five highlight reel NFL players",
  "date_display": "August 6, 2011",
  "date_iso": "2011-08-06T10:52:00+00:00",
  "date_from_url": "2011-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Q: Randy Moss’ retirement made me wonder about the five player-specific NFL career highlight films that would be worth buying. My personal list would be Barry Sanders, Deion Sanders, Moss, Brett Favre and Ronnie Lott. There are players with better career numbers, but for “did you see what he just did” moments, these guys have to be at the top of the list.<br> — Eric, Ann Arbor</br></p><p>SG: I like this idea — seems like a natural for iTunes. (My five would be Moss, Barry Sanders, Gale Sayers, O.J. Simpson and Earl Campbell.)</p></blockquote><p>Mine would be: Fran Tarkenton, Randy Moss, Barry Sanders, Reggie White, and Sammy Baugh.</p><p>Tarkenton for the ridiculously long scrambles, Moss for the deep routes, Sanders for the impossible escapes, White for the sacks, and Baugh just to see the all-around QB/DB/punter performance.</p><p>I still remember Reggie White playing against the Vikings.  They called an ill-advised roll-out that called for Cris Carter to go in motion, then stay in and block the free defensive end, who happened to be White.  White didn’t bite on the line feint, but stayed home, then literally threw Carter five yards into Warren Moon with one hand.  He was dragging Moon down when the whistle blew and “in the grasp” was called.  I was at that game with seats on the 20-yard line, the play was right in front of us, and it was the one of the most physically dominating defensive plays I’ve ever seen in the NFL; keep in mind that Carter was neither a small wide receiver nor a bad blocker.  Even the most hard-core Vikings fans roared after that play.</p><p>It’s fascinating how one’s memory remembers things incorrectly.  Until I found the clip, I would have sworn that White a) beat an initial blocker and b) actually knocked Moon down with Carter.</p></div>",
  "content_text": "Q: Randy Moss’ retirement made me wonder about the five player-specific NFL career highlight films that would be worth buying. My personal list would be Barry Sanders, Deion Sanders, Moss, Brett Favre and Ronnie Lott. There are players with better career numbers, but for “did you see what he just did” moments, these guys have to be at the top of the list.\n— Eric, Ann Arbor\nSG: I like this idea — seems like a natural for iTunes. (My five would be Moss, Barry Sanders, Gale Sayers, O.J. Simpson and Earl Campbell.)\nMine would be: Fran Tarkenton, Randy Moss, Barry Sanders, Reggie White, and Sammy Baugh.\nTarkenton for the ridiculously long scrambles, Moss for the deep routes, Sanders for the impossible escapes, White for the sacks, and Baugh just to see the all-around QB/DB/punter performance.\nI still remember Reggie White playing against the Vikings.  They called an ill-advised roll-out that called for Cris Carter to go in motion, then stay in and block the free defensive end, who happened to be White.  White didn’t bite on the line feint, but stayed home, then literally threw Carter five yards into Warren Moon with one hand.  He was dragging Moon down when the whistle blew and “in the grasp” was called.  I was at that game with seats on the 20-yard line, the play was right in front of us, and it was the one of the most physically dominating defensive plays I’ve ever seen in the NFL; keep in mind that Carter was neither a small wide receiver nor a bad blocker.  Even the most hard-core Vikings fans roared after that play.\nIt’s fascinating how one’s memory remembers things incorrectly.  Until I found the clip, I would have sworn that White a) beat an initial blocker and b) actually knocked Moon down with Carter.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-06T09:52:00+00:00"
}