{
  "url": "https://voxday.net/2011/08/18/on-surviving-gossip/",
  "scraped_at": "2025-12-13T23:19:19.603624",
  "title": "On surviving gossip",
  "date_display": "August 18, 2011",
  "date_iso": "2011-08-18T10:22:00+00:00",
  "date_from_url": "2011-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And it doesn’t require Hercule Poirot to determine why men might be <a href=\"http://www.dailymail.co.uk/femail/article-2025905/Women-spend-hours-EVERY-DAY-gossiping-claims-study.html?ITO=1490\">disinclined to pay attention</a>:</p><blockquote><p>The typical woman spends five hours a day – more than a third of her waking hours – chatting and gossiping, a study has revealed.  Whether at home or work women natter for about 298 minutes every day, it found.  Discussing other people’s problems, who is dating who and other people’s children form the basis of most of the chat.</p></blockquote><p>One of the things I find fascinating about social etiquette is the way that what is frowned upon in the Bible, considered a mortal sin by the Catholic Church, and considered to be a deathly bore by nearly half the population is nevertheless considered nearly <i>de rigueur</i> in casual social situations.  Many women don’t seem to understand that gossip is actually less interesting and more painful to most men than listening to an engineer with Asperger’s drone on about thermodynamics or tax law is to most women.</p><p>I’ve mentioned this before, but I still laugh every time I think of my father’s summary of a dinner in which he was seated between two well-known social butterflies.  “Now I know what Hell is like.”</p><p>Now, I don’t personally have a problem with the aforementioned female nattering so long as I am not expected to listen to it.  I am fortunate in that Spacebunny has a relatively low tolerance for it herself.  And sometimes, if it’s occurring in the background while I am reading a book or something, it can even be amusing to track the circular pattern as two women run out of gas on a subject, cast about for a new one, and then find their stride again by simply revisiting a topic that has been discussed already, in some cases repeating the previous discussion almost verbatim.  It’s hilarious.</p><p>This repetition makes no sense to men because they don’t derive the same chemically-derived sense of pleasure from a communication process that has been discovered to release oxytocin and serotonin to the brain.  But once you realize that women who are repeating themselves in this manner are simply doing the equivalent of a lab rat repeatedly hitting the bar that provides it a nice hit of coke, the whole thing makes a lot more sense.  This may help explain why women have a tendency to keep repeating an ineffective punchline when they’re telling a joke or story as if it’s going to be funnier the second or third time.  It appears to be a technique that works effectively in gossip mode that doesn’t translate well to storytelling mode.</p><p>On the other hand, if a woman wishes to be taken seriously by men, she has to avoid doing this sort of thing in front of them at all costs.  There are few things that will relegate a woman to the “pay no attention ever” zone faster than being the sort of woman who is unable to discuss anything except people that she knew in high school or college.  Sometimes, when listening to a female acquaintance babble and burble on about complete strangers, it takes every bit of my conscious focus to refrain from politely asking “on what planet do you believe that I give even the most infinitesimally airborne, electroniscopically small flying fornication about these people, who, based on the distressingly fulsome stream of data you have so thoughtfully provided, are not only terminally uninteresting but quite clearly retarded as well?”</p><p>Or, alternatively, pretending to be plastered to a rock like <a href=\"http://www.youtube.com/watch?v=0B0sFtRTlx4\">the woman in Aliens</a>.</p><p>Anyhow, in the same way it behooves the intellectual to learn something about sports, television, or current events in order to be able to function in society, it is wise for the gossip to do the same in order to not be a crashing, soul-killing bore that no one with an IQ over 100 takes seriously.</p><p>The basic social principle by which I operate is one I believe to be both effective and fair.  If you don’t subject me to a monologue or dialogue about the personal affairs of people I don’t know or don’t care about, I will not subject you to a monologue on the rules of <i>Advanced Squad Leader</i>, the argumentative structure featured in the <i>Summa Theologica</i> of Thomas Aquinas, or the way in which a Japanese naval invasion of the American West Coast in 1942 was an extremely remote improbability bordering on the impossible, being militarily useless, logistically problematic, and historically unplanned.  That seems fair, doesn’t it?</p><p>And thanks to technology, there is an even better solution now readily available to all and sundry.  If people insist on being rude enough to engage in conversations that are intrinsically exclusive by nature, just whip out your phone or ebook reader and happily ignore them.  This is particularly effective if one is being subjected to the most extreme form of gossiper, the “performance conversationalist”.  I’m not saying that men can’t be crashing bores too.  Of course they can be; I probably have exceptional potential in that line myself.  But there is no reason why female bores should be suffered with any less reluctance and resistance than male bores.</p></div>",
  "content_text": "And it doesn’t require Hercule Poirot to determine why men might be\ndisinclined to pay attention\n:\nThe typical woman spends five hours a day – more than a third of her waking hours – chatting and gossiping, a study has revealed.  Whether at home or work women natter for about 298 minutes every day, it found.  Discussing other people’s problems, who is dating who and other people’s children form the basis of most of the chat.\nOne of the things I find fascinating about social etiquette is the way that what is frowned upon in the Bible, considered a mortal sin by the Catholic Church, and considered to be a deathly bore by nearly half the population is nevertheless considered nearly\nde rigueur\nin casual social situations.  Many women don’t seem to understand that gossip is actually less interesting and more painful to most men than listening to an engineer with Asperger’s drone on about thermodynamics or tax law is to most women.\nI’ve mentioned this before, but I still laugh every time I think of my father’s summary of a dinner in which he was seated between two well-known social butterflies.  “Now I know what Hell is like.”\nNow, I don’t personally have a problem with the aforementioned female nattering so long as I am not expected to listen to it.  I am fortunate in that Spacebunny has a relatively low tolerance for it herself.  And sometimes, if it’s occurring in the background while I am reading a book or something, it can even be amusing to track the circular pattern as two women run out of gas on a subject, cast about for a new one, and then find their stride again by simply revisiting a topic that has been discussed already, in some cases repeating the previous discussion almost verbatim.  It’s hilarious.\nThis repetition makes no sense to men because they don’t derive the same chemically-derived sense of pleasure from a communication process that has been discovered to release oxytocin and serotonin to the brain.  But once you realize that women who are repeating themselves in this manner are simply doing the equivalent of a lab rat repeatedly hitting the bar that provides it a nice hit of coke, the whole thing makes a lot more sense.  This may help explain why women have a tendency to keep repeating an ineffective punchline when they’re telling a joke or story as if it’s going to be funnier the second or third time.  It appears to be a technique that works effectively in gossip mode that doesn’t translate well to storytelling mode.\nOn the other hand, if a woman wishes to be taken seriously by men, she has to avoid doing this sort of thing in front of them at all costs.  There are few things that will relegate a woman to the “pay no attention ever” zone faster than being the sort of woman who is unable to discuss anything except people that she knew in high school or college.  Sometimes, when listening to a female acquaintance babble and burble on about complete strangers, it takes every bit of my conscious focus to refrain from politely asking “on what planet do you believe that I give even the most infinitesimally airborne, electroniscopically small flying fornication about these people, who, based on the distressingly fulsome stream of data you have so thoughtfully provided, are not only terminally uninteresting but quite clearly retarded as well?”\nOr, alternatively, pretending to be plastered to a rock like\nthe woman in Aliens\n.\nAnyhow, in the same way it behooves the intellectual to learn something about sports, television, or current events in order to be able to function in society, it is wise for the gossip to do the same in order to not be a crashing, soul-killing bore that no one with an IQ over 100 takes seriously.\nThe basic social principle by which I operate is one I believe to be both effective and fair.  If you don’t subject me to a monologue or dialogue about the personal affairs of people I don’t know or don’t care about, I will not subject you to a monologue on the rules of\nAdvanced Squad Leader\n, the argumentative structure featured in the\nSumma Theologica\nof Thomas Aquinas, or the way in which a Japanese naval invasion of the American West Coast in 1942 was an extremely remote improbability bordering on the impossible, being militarily useless, logistically problematic, and historically unplanned.  That seems fair, doesn’t it?\nAnd thanks to technology, there is an even better solution now readily available to all and sundry.  If people insist on being rude enough to engage in conversations that are intrinsically exclusive by nature, just whip out your phone or ebook reader and happily ignore them.  This is particularly effective if one is being subjected to the most extreme form of gossiper, the “performance conversationalist”.  I’m not saying that men can’t be crashing bores too.  Of course they can be; I probably have exceptional potential in that line myself.  But there is no reason why female bores should be suffered with any less reluctance and resistance than male bores.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-18T09:22:00+00:00"
}