{
  "url": "https://voxday.net/2011/08/27/optimistic-metaphor/",
  "scraped_at": "2025-12-13T23:20:11.527514",
  "title": "An optimistic metaphor",
  "date_display": "August 27, 2011",
  "date_iso": "2011-08-27T07:54:00+00:00",
  "date_from_url": "2011-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joseph Lozito, husband, father, and <a href=\"http://www.badassoftheweek.com/lozito.html\">American badass</a>:</p><blockquote><p>It turns out that Maksim Gelman wasn’t just any nutjob riding pantless on the Subway – he was a bona-fide spree killer in the middle of a 28 hour stabbing rampage that had left four people dead and five more wounded across the boroughs of New York City. Earlier in the weekend, Gelman had done a shitload of crack and murdered his stepfather and his girlfriend’s mom with a knife, stabbed his girlfriend 11 times, ran over a dude with a car, slashed another motorist, and carjacked an unsuspecting couple, stabbing both of them in the process. He was a career criminal who had completely lost his fucking shit, and now he was swinging a goddamned machete around a crowded Subway train filled with women, children, and more innocent bystanders than a superhero comic. And now he’s coming straight for Joseph Lozito, and there isn’t a hell of a lot this Pennsylvania native can do to avoid the confrontation. It’s like a bad 80s movie about gang violence on the Subway, only this was rush hour traffic, real life, and Gelman is definitely not wearing an awesome headband or listening to rad jams blasting from the tape deck on his boombox.</p><p>But Joseph Lozito isn’t just any chump on his way to work, and he sure as shit isn’t about to sit there and let some psychotic madman knife him to death without putting up a fight. This guy is a life-long MMA fan who took his love of the sport to super-fan levels – he’d been to UFC 1 in 1993, never missed a pay-per-view, and celebrated his friggin’ wedding anniversary by taking his wife to see the Ultimate Fighting Championship live.</p><p>He’s also fucking gigantic – standing 6’2″ and weighing in at 260 pounds. Gelman wasn’t going to know what the fuck hit him….  As Gelman approaches, Lozito does the last thing the knife-wielding maniac expected – he attacks.</p></blockquote><p>That’s the best line in the article: “he attacks”.  As my sensei always taught us, “when you go, you go!”  In other words, once the moment for action arrives, commit 100 percent.  Lozito appears to have had little idea what he was doing – a simple arm bar and break would have been significantly safer than a takedown – but that only emphasizes his courage and heroism.</p><p>It’s easy to be pessimistic about Americans.  They tolerate one of the smartest, most predatory political classes in the history of the world.  They pretty much don’t want to do anything except go to work, eat, drink beer, and watch television as their country is overrun by Mexican gangs, Somali jihadists, and people with names like Maksim.</p><p>The country is broke and heading for collapse, but there is still hope for what comes after.  Because despite all its many flaws, America is still the place where MMA was invented, where paintball was invented, and men like Joseph Lozito not only fight when they’re forced to fight, but fight to win.  New York City and Washington DC and Hollywood and San Francisco and Maksim Gelman aren’t America, they’re all tumors indicative of the imported cancer will eventually kill the United States.  The real America is where a man isn’t trying to rule the world or live as a parasite, but merely wants to do his job, do his own thing, and kick your ass if you won’t leave him alone.</p><p>And where were the cops that Gelman confronted first?  New York’s Finest where you’d expect them to be, hiding like little girls and waiting for it to be over: <i>“Two transit cops locked themselves in the train’s front room with the conductor and didn’t immediately open the door when straphangers called for help, because they thought the madman had a gun.”</i></p></div>",
  "content_text": "Joseph Lozito, husband, father, and\nAmerican badass\n:\nIt turns out that Maksim Gelman wasn’t just any nutjob riding pantless on the Subway – he was a bona-fide spree killer in the middle of a 28 hour stabbing rampage that had left four people dead and five more wounded across the boroughs of New York City. Earlier in the weekend, Gelman had done a shitload of crack and murdered his stepfather and his girlfriend’s mom with a knife, stabbed his girlfriend 11 times, ran over a dude with a car, slashed another motorist, and carjacked an unsuspecting couple, stabbing both of them in the process. He was a career criminal who had completely lost his fucking shit, and now he was swinging a goddamned machete around a crowded Subway train filled with women, children, and more innocent bystanders than a superhero comic. And now he’s coming straight for Joseph Lozito, and there isn’t a hell of a lot this Pennsylvania native can do to avoid the confrontation. It’s like a bad 80s movie about gang violence on the Subway, only this was rush hour traffic, real life, and Gelman is definitely not wearing an awesome headband or listening to rad jams blasting from the tape deck on his boombox.\nBut Joseph Lozito isn’t just any chump on his way to work, and he sure as shit isn’t about to sit there and let some psychotic madman knife him to death without putting up a fight. This guy is a life-long MMA fan who took his love of the sport to super-fan levels – he’d been to UFC 1 in 1993, never missed a pay-per-view, and celebrated his friggin’ wedding anniversary by taking his wife to see the Ultimate Fighting Championship live.\nHe’s also fucking gigantic – standing 6’2″ and weighing in at 260 pounds. Gelman wasn’t going to know what the fuck hit him….  As Gelman approaches, Lozito does the last thing the knife-wielding maniac expected – he attacks.\nThat’s the best line in the article: “he attacks”.  As my sensei always taught us, “when you go, you go!”  In other words, once the moment for action arrives, commit 100 percent.  Lozito appears to have had little idea what he was doing – a simple arm bar and break would have been significantly safer than a takedown – but that only emphasizes his courage and heroism.\nIt’s easy to be pessimistic about Americans.  They tolerate one of the smartest, most predatory political classes in the history of the world.  They pretty much don’t want to do anything except go to work, eat, drink beer, and watch television as their country is overrun by Mexican gangs, Somali jihadists, and people with names like Maksim.\nThe country is broke and heading for collapse, but there is still hope for what comes after.  Because despite all its many flaws, America is still the place where MMA was invented, where paintball was invented, and men like Joseph Lozito not only fight when they’re forced to fight, but fight to win.  New York City and Washington DC and Hollywood and San Francisco and Maksim Gelman aren’t America, they’re all tumors indicative of the imported cancer will eventually kill the United States.  The real America is where a man isn’t trying to rule the world or live as a parasite, but merely wants to do his job, do his own thing, and kick your ass if you won’t leave him alone.\nAnd where were the cops that Gelman confronted first?  New York’s Finest where you’d expect them to be, hiding like little girls and waiting for it to be over:\n“Two transit cops locked themselves in the train’s front room with the conductor and didn’t immediately open the door when straphangers called for help, because they thought the madman had a gun.”",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-27T06:54:00+00:00"
}