{
  "url": "https://voxday.net/2011/08/18/perhaps-i-was-wrong/",
  "scraped_at": "2025-12-13T23:19:23.431055",
  "title": "Perhaps I was wrong",
  "date_display": "August 18, 2011",
  "date_iso": "2011-08-18T17:00:00+00:00",
  "date_from_url": "2011-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few days ago, I mentioned that I am working on a “maxi-sequel” to <i>Summa Elvetica</i> entitled <i>Arts of Dark and Light</i>.  Because it is going to be sizable, I was under the impression that Marcher Lord would have little interest in it and that I would have to publish it as an ebook.  Which, of course, is completely fine with me.</p><p>However, it turns out that SE’s publisher, Marcher Lord, has recently published an 1,100-page omnibus edition of a trilogy written by Kathy Tyers.  And it also turns out the main man at MLP is actually more than a little interested in AoDaL, so there is a reasonable possibility that it will be conventionally published when it is finished after all.  We haven’t worked out any of the details yet, and nothing is set in stone, but I thought some of you would be interested to know that there is a decent chance the next book set in Selenoth will be available on dead tree as well as digital.</p></div>",
  "content_text": "A few days ago, I mentioned that I am working on a “maxi-sequel” to\nSumma Elvetica\nentitled\nArts of Dark and Light\n.  Because it is going to be sizable, I was under the impression that Marcher Lord would have little interest in it and that I would have to publish it as an ebook.  Which, of course, is completely fine with me.\nHowever, it turns out that SE’s publisher, Marcher Lord, has recently published an 1,100-page omnibus edition of a trilogy written by Kathy Tyers.  And it also turns out the main man at MLP is actually more than a little interested in AoDaL, so there is a reasonable possibility that it will be conventionally published when it is finished after all.  We haven’t worked out any of the details yet, and nothing is set in stone, but I thought some of you would be interested to know that there is a decent chance the next book set in Selenoth will be available on dead tree as well as digital.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-18T16:00:00+00:00"
}