{
  "url": "https://voxday.net/2011/08/10/prince-of-porn/",
  "scraped_at": "2025-12-13T23:18:35.459169",
  "title": "The Prince of Porn",
  "date_display": "August 10, 2011",
  "date_iso": "2011-08-10T09:20:00+00:00",
  "date_from_url": "2011-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That title isn’t even remotely fair.  But who can be expected to resist such a perfect conjunction of rhetoric and alliteration?  R. Scott Bakker’s <i>The Prince of Nothing</i> is not an erotic trilogy, it is an interesting, original, large-scale fantasy series that happens to incorporate, to its detriment, some pornographic elements and an amount of inept philosophizing.  But since my review sparked <a href=\"http://www.blackgate.com/2011/08/07/the-prince-of-nothing-review/\">a relatively lively debate</a> over whether this is a fair and accurate characterization of the three novels concerned, I thought it would be sensible to appeal to the judgment of an esteemed intellectual who has provided us with a fail-proof method of determining whether a movie is pornographic or not.</p><p>I speak, of course, of Umberto Eco and his famous essay “How to Recognize a Porn Movie”:</p><blockquote><p>Pornographic movies are full of people who climb into cars and drive for miles and miles, couples who waste incredible amounts of time signing in at hotel desks, gentlemen who spend many minutes in elevators before reaching their rooms, girls who sip various drinks and who fiddle interminably with laces and blouses before confessing to each other that they prefer Sappho to Don Juan. To put it simply, crudely, in porn movies, before you can see a healthy screw you have to put up with a documentary that could be sponsored by the Traffic Bureau.</p><p>There are obvious reasons. A movie in which Gilbert did nothing but rape Gilbertina, front, back, and sideways, would be intolerable. Physically, for the actors, and economically, for the producer. And it would also be, psychologically, intolerable for the spectator: for the transgression to work, it must be played out against a background of normality. To depict normality is one of the most difficult things for any artist – whereas portraying deviation, crime, rape, torture, is very easy.</p><p>Therefore the pornographic movie must present normality – essential if the transgression is to have interest – in the way that every spectator conceives it. Therefore, if Gilbert has to take the bus and go from A to B, we will see Gilbert taking the bus and then the bus proceeding from A to B.</p><p>This often irritates the spectators, because they think they would like the unspeakable scenes to be continuous. But this is an illusion on their part. They couldn’t bear a full hour and a half of unspeakable scenes. So the passages of the wasted time are essential.</p><p>I repeat. Go into a movie theater. If, to go from A to B, the characters take longer than you would like, then the film you are seeing is pornographic.</p></blockquote><p>Since both the excruciating crusade to Shimeh and Prince Kellhus’s journey to find his father bordered on the interminable, with the only relief being the occasional battle, philosophical pontification, penetration of the prostitute Esmenet by various parties, or the torture of a Tleilaxu Face Dancer(1), the matter can clearly be regarded as settled.  It is also worth noting that in his essay, Eco points out how “portraying deviation, crime, rape, torture, is very easy”. Ergo, reliance upon them in a literary work is not evidence of a work’s brilliance or greatness or realism, but rather testifies to the author’s incapacity, laziness, deviancy, or limited moral palette.</p><p>We know that Bakker is neither incapable nor lazy.  Aside from his fictional meanderings, we have no reason to believe Bakker is any more deviant than anyone else.  He’s Canadian, not Japanese, after all.(2)  So, we can safely conclude on the basis of <a href=\"http://www.milobookclub.com/2011/02/24/lets-try-this-one-more-time/\">last February’s discourse on uncertainty and amorality</a> that it is his limited moral palette, which stems from the affectation(3) that uncertainty is the highest moral good, that is responsible for Bakker’s frequent resort to pornographic elements in <i>The Prince of Nothing</i>.(4)  There is, after all, little room to appeal to the reader’s emotions or moral sensibilities on the basis of a character’s insufficient uncertainty, indeed, the limitations of this peculiar moral palette is such that it is difficult to even justify any action at all on the part of any character intended to be presented as heroic or ideal.</p><p> (1) Consult skin-spy, whatever.<br> (2) True fact: 95% of all the world’s weirdness comes from Japan.  You’ll see more deviance on a public bus in Tokyo than in a Toronto S&amp;M dungeon.<br> (3) And it is an affectation, nothing more.  It’s always amusing to see how rapidly a post-moralist devolves into vulgar morality when forced to choose between his steadfast disapproval of a traditional moral judgment and his professed uncertainty.<br> (4) Note that I wrote the following months BEFORE reading any of Bakker’s fiction: <i>“Let a hundred nihilistic anti-heroes blossom into the murderous child rapists of their creators’ moralblind fantasies.”</i> That’s how perfectly predictable his “creatively transgressive” attempts to shock the reader into perceiving black amid a thousand shades of grey were.</br></br></br></p></div>",
  "content_text": "That title isn’t even remotely fair.  But who can be expected to resist such a perfect conjunction of rhetoric and alliteration?  R. Scott Bakker’s\nThe Prince of Nothing\nis not an erotic trilogy, it is an interesting, original, large-scale fantasy series that happens to incorporate, to its detriment, some pornographic elements and an amount of inept philosophizing.  But since my review sparked\na relatively lively debate\nover whether this is a fair and accurate characterization of the three novels concerned, I thought it would be sensible to appeal to the judgment of an esteemed intellectual who has provided us with a fail-proof method of determining whether a movie is pornographic or not.\nI speak, of course, of Umberto Eco and his famous essay “How to Recognize a Porn Movie”:\nPornographic movies are full of people who climb into cars and drive for miles and miles, couples who waste incredible amounts of time signing in at hotel desks, gentlemen who spend many minutes in elevators before reaching their rooms, girls who sip various drinks and who fiddle interminably with laces and blouses before confessing to each other that they prefer Sappho to Don Juan. To put it simply, crudely, in porn movies, before you can see a healthy screw you have to put up with a documentary that could be sponsored by the Traffic Bureau.\nThere are obvious reasons. A movie in which Gilbert did nothing but rape Gilbertina, front, back, and sideways, would be intolerable. Physically, for the actors, and economically, for the producer. And it would also be, psychologically, intolerable for the spectator: for the transgression to work, it must be played out against a background of normality. To depict normality is one of the most difficult things for any artist – whereas portraying deviation, crime, rape, torture, is very easy.\nTherefore the pornographic movie must present normality – essential if the transgression is to have interest – in the way that every spectator conceives it. Therefore, if Gilbert has to take the bus and go from A to B, we will see Gilbert taking the bus and then the bus proceeding from A to B.\nThis often irritates the spectators, because they think they would like the unspeakable scenes to be continuous. But this is an illusion on their part. They couldn’t bear a full hour and a half of unspeakable scenes. So the passages of the wasted time are essential.\nI repeat. Go into a movie theater. If, to go from A to B, the characters take longer than you would like, then the film you are seeing is pornographic.\nSince both the excruciating crusade to Shimeh and Prince Kellhus’s journey to find his father bordered on the interminable, with the only relief being the occasional battle, philosophical pontification, penetration of the prostitute Esmenet by various parties, or the torture of a Tleilaxu Face Dancer(1), the matter can clearly be regarded as settled.  It is also worth noting that in his essay, Eco points out how “portraying deviation, crime, rape, torture, is very easy”. Ergo, reliance upon them in a literary work is not evidence of a work’s brilliance or greatness or realism, but rather testifies to the author’s incapacity, laziness, deviancy, or limited moral palette.\nWe know that Bakker is neither incapable nor lazy.  Aside from his fictional meanderings, we have no reason to believe Bakker is any more deviant than anyone else.  He’s Canadian, not Japanese, after all.(2)  So, we can safely conclude on the basis of\nlast February’s discourse on uncertainty and amorality\nthat it is his limited moral palette, which stems from the affectation(3) that uncertainty is the highest moral good, that is responsible for Bakker’s frequent resort to pornographic elements in\nThe Prince of Nothing\n.(4)  There is, after all, little room to appeal to the reader’s emotions or moral sensibilities on the basis of a character’s insufficient uncertainty, indeed, the limitations of this peculiar moral palette is such that it is difficult to even justify any action at all on the part of any character intended to be presented as heroic or ideal.\n(1) Consult skin-spy, whatever.\n(2) True fact: 95% of all the world’s weirdness comes from Japan.  You’ll see more deviance on a public bus in Tokyo than in a Toronto S&M dungeon.\n(3) And it is an affectation, nothing more.  It’s always amusing to see how rapidly a post-moralist devolves into vulgar morality when forced to choose between his steadfast disapproval of a traditional moral judgment and his professed uncertainty.\n(4) Note that I wrote the following months BEFORE reading any of Bakker’s fiction:\n“Let a hundred nihilistic anti-heroes blossom into the murderous child rapists of their creators’ moralblind fantasies.”\nThat’s how perfectly predictable his “creatively transgressive” attempts to shock the reader into perceiving black amid a thousand shades of grey were.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-10T08:20:00+00:00"
}