{
  "url": "https://voxday.net/2011/08/04/proving-opposite-case/",
  "scraped_at": "2025-12-13T23:18:02.232054",
  "title": "Proving the opposite case",
  "date_display": "August 4, 2011",
  "date_iso": "2011-08-04T14:11:00+00:00",
  "date_from_url": "2011-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jane Ziegelman inadvertently manages to present <a href=\"http://www.nytimes.com/2011/08/04/opinion/immigrant-identities-preserved-in-vinegar.html?hp\">an effective case against immigration</a> in the New York Times:</p><blockquote><p>TENSIONS over immigration in Europe are flaring this summer, along with questions about what — whether language, dress or diet — makes a foreigner a citizen. Of course, these questions also have a long history in America.</p><p>One of the biggest battles over assimilation occurred a century ago in New York City, and the battleground was food. Politicians, public health experts and social reformers were alarmed by what they saw as immigrants’ penchant for highly seasoned cooking…. No immigrant food was more reviled than the garlicky, vinegary pickle. Pungent beyond all civilized standards, toxic to both the stomach and the psyche, the pickle was seen as morally suspect….</p><p>Of course, New Yorkers didn’t give up the pickle. By the mid-1920s, immigration quotas had restricted entry to newcomers from Eastern and Southern Europe. Americans became less worried about the “alien hordes,” as they were known, and diet reform efforts subsided. Today, New Yorkers can proudly claim the pickle as a regional specialty.  If this footnote from our culinary past can be read for a moral, it might be this: Our powers of assimilation are greater than we know. We can speak Spanish, eat sushi and still be American. The proof is in the pickle.</p></blockquote><p>Ms Ziegelman obviously thinks that the fact Americans who once shunned the pickle as depraved ethnic food now happily eat them is an indication of immigrant assimilation and therefore evidence that immigration is desirable.  In fact, it proves the exact opposite and underlines the very anti-mass immigration point I have repeatedly made here.</p><p>This is perhaps easier to see if we illustrate the fundamental flaw in her logic utilizing the reductio ad absurdum approach.  Suppose that instead of pickles, we consider the traditional Indian custom of <i>suttee</i>, which involves burning a widow to death on the pyre of her deceased husband.  This is not an American practice, indeed, it is abhorrent to Americans, particularly when it is involuntary.</p><p>But suppose 30 million Indian Hindus immigrated to America and brought their vibrant funeral tradition with them.  And suppose that after a few decades of protesting <i>suttee</i> as a particularly vicious form of murder, Americans gradually became accustomed to the practice.  After all, burning all those useless widows reduced Social Security costs, permitted a more orderly transfer of familial assets to the next generation, and freed up some desirable housing stock that was largely being wasted on elderly women.  It might even help increase the money supply, as elderly, unemployed women tend to neither spend nor invest their money, but prefer to hoard it.</p><p>So, after 100 years, in which a sustained campaign led by third-generation Indian Americans took place, imagine the various legal impositions have been removed.  Many, if not most non-Indian Americans are now cheerfully burning their widowed mothers and grandmothers on pyres; it has become a popular new American funeral tradition.  Now let us revisit the question previously posed.  Is an America where Americans burn widows to death, speak Spanish, and eat pickles and sushi not still America?  To this, the sane and rational mind can only answer: “No, it is not, unless America refers to nothing more than a geographic location.”</p><p>When ethnic and cultural differences survive the immigration process and impose themselves on the broader American population, this is not assimilation, it is the exact opposite of assimilation.  It is transformation.  While some transformations are admittedly more significant than others, Ziegelman’s article is nevertheless a powerful reminder of why mass immigration should not be permitted by any healthy, self-respecting society and why it will destroy the traditional way of life to the extent that the customs and ideologies of those those permitted to immigrate depart from indigenous traditions.</p></div>",
  "content_text": "Jane Ziegelman inadvertently manages to present\nan effective case against immigration\nin the New York Times:\nTENSIONS over immigration in Europe are flaring this summer, along with questions about what — whether language, dress or diet — makes a foreigner a citizen. Of course, these questions also have a long history in America.\nOne of the biggest battles over assimilation occurred a century ago in New York City, and the battleground was food. Politicians, public health experts and social reformers were alarmed by what they saw as immigrants’ penchant for highly seasoned cooking…. No immigrant food was more reviled than the garlicky, vinegary pickle. Pungent beyond all civilized standards, toxic to both the stomach and the psyche, the pickle was seen as morally suspect….\nOf course, New Yorkers didn’t give up the pickle. By the mid-1920s, immigration quotas had restricted entry to newcomers from Eastern and Southern Europe. Americans became less worried about the “alien hordes,” as they were known, and diet reform efforts subsided. Today, New Yorkers can proudly claim the pickle as a regional specialty.  If this footnote from our culinary past can be read for a moral, it might be this: Our powers of assimilation are greater than we know. We can speak Spanish, eat sushi and still be American. The proof is in the pickle.\nMs Ziegelman obviously thinks that the fact Americans who once shunned the pickle as depraved ethnic food now happily eat them is an indication of immigrant assimilation and therefore evidence that immigration is desirable.  In fact, it proves the exact opposite and underlines the very anti-mass immigration point I have repeatedly made here.\nThis is perhaps easier to see if we illustrate the fundamental flaw in her logic utilizing the reductio ad absurdum approach.  Suppose that instead of pickles, we consider the traditional Indian custom of\nsuttee\n, which involves burning a widow to death on the pyre of her deceased husband.  This is not an American practice, indeed, it is abhorrent to Americans, particularly when it is involuntary.\nBut suppose 30 million Indian Hindus immigrated to America and brought their vibrant funeral tradition with them.  And suppose that after a few decades of protesting\nsuttee\nas a particularly vicious form of murder, Americans gradually became accustomed to the practice.  After all, burning all those useless widows reduced Social Security costs, permitted a more orderly transfer of familial assets to the next generation, and freed up some desirable housing stock that was largely being wasted on elderly women.  It might even help increase the money supply, as elderly, unemployed women tend to neither spend nor invest their money, but prefer to hoard it.\nSo, after 100 years, in which a sustained campaign led by third-generation Indian Americans took place, imagine the various legal impositions have been removed.  Many, if not most non-Indian Americans are now cheerfully burning their widowed mothers and grandmothers on pyres; it has become a popular new American funeral tradition.  Now let us revisit the question previously posed.  Is an America where Americans burn widows to death, speak Spanish, and eat pickles and sushi not still America?  To this, the sane and rational mind can only answer: “No, it is not, unless America refers to nothing more than a geographic location.”\nWhen ethnic and cultural differences survive the immigration process and impose themselves on the broader American population, this is not assimilation, it is the exact opposite of assimilation.  It is transformation.  While some transformations are admittedly more significant than others, Ziegelman’s article is nevertheless a powerful reminder of why mass immigration should not be permitted by any healthy, self-respecting society and why it will destroy the traditional way of life to the extent that the customs and ideologies of those those permitted to immigrate depart from indigenous traditions.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-04T13:11:00+00:00"
}