{
  "url": "https://voxday.net/2011/08/20/publishing-update/",
  "scraped_at": "2025-12-13T23:19:34.440035",
  "title": "Publishing update",
  "date_display": "August 20, 2011",
  "date_iso": "2011-08-20T16:23:00+00:00",
  "date_from_url": "2011-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, <i>The Deported</i> has been accepted for publication in the Halloween edition of <i>Stupefying Stories</i>.  This actually marks my third-ever submission of a short story for publication and my first-ever acceptance, as I had a (dreadful) story rejected by Asimov’s in 1989 and a (pretty good) novella rejected by Black Gate in 2009.  (In fairness to John O’Neill, it was a bit of a stretch for BG.)  Ten points to the first one to guess what literary lion’s style is being imitated in the story; if you are one of the few who happen to know already, do keep your mouth shut!</p><p>Second, I’ve been informed by a publisher that they would like to publish the first book in the <i>Arts of Dark and Light</i> series.  I sent them a sample and they particularly liked what they termed the rich depth of the world.  Nothing is final yet, but I see no reason we won’t be able to work things out shortly; I was completely surprised to hear they were interested in publishing such a monster. <i>Arts of Dark and Light</i> is set in the same world as <i>Summa Elvetica: A Casuistry of the Elvish Controversy</i>, but is more accessible and vastly larger in scope.  Translation I: No more untranslated Latin or structural limits set by 700-year old theological treatises.  Translation II: we shall see if I can do any better in producing a work of epic fantasy than the authors of the various works I have criticized in the last few months.</p><p>So, if it turns out well, I shall owe a debt of gratitude to Messrs. Abercrombie, Bakker, Erikson, and Martin, as it was reading their work that first caused me to begin thinking “Sweet Silmarillion, <i>I</i> could do better than this.”  And by Martin, I expect you understand that I am referring to the last two books only, which are significantly inferior to the first three.  Robert Jordan doesn’t count, as I would rather read Jack Torrance’s epic seven times than subject myself again to the deplorable <i>Wheel of Time</i>.  I like to think that the name was a result of Jordan being a sadist who gave fair warning; that series should have been listed in an addendum to the Geneva Convention.</p><p>Anyhow, if nothing else, we already know <i>Arts of Dark and Light</i> will have a gorgeous cover.  So we have that going for us….</p></div>",
  "content_text": "First,\nThe Deported\nhas been accepted for publication in the Halloween edition of\nStupefying Stories\n.  This actually marks my third-ever submission of a short story for publication and my first-ever acceptance, as I had a (dreadful) story rejected by Asimov’s in 1989 and a (pretty good) novella rejected by Black Gate in 2009.  (In fairness to John O’Neill, it was a bit of a stretch for BG.)  Ten points to the first one to guess what literary lion’s style is being imitated in the story; if you are one of the few who happen to know already, do keep your mouth shut!\nSecond, I’ve been informed by a publisher that they would like to publish the first book in the\nArts of Dark and Light\nseries.  I sent them a sample and they particularly liked what they termed the rich depth of the world.  Nothing is final yet, but I see no reason we won’t be able to work things out shortly; I was completely surprised to hear they were interested in publishing such a monster.\nArts of Dark and Light\nis set in the same world as\nSumma Elvetica: A Casuistry of the Elvish Controversy\n, but is more accessible and vastly larger in scope.  Translation I: No more untranslated Latin or structural limits set by 700-year old theological treatises.  Translation II: we shall see if I can do any better in producing a work of epic fantasy than the authors of the various works I have criticized in the last few months.\nSo, if it turns out well, I shall owe a debt of gratitude to Messrs. Abercrombie, Bakker, Erikson, and Martin, as it was reading their work that first caused me to begin thinking “Sweet Silmarillion,\nI\ncould do better than this.”  And by Martin, I expect you understand that I am referring to the last two books only, which are significantly inferior to the first three.  Robert Jordan doesn’t count, as I would rather read Jack Torrance’s epic seven times than subject myself again to the deplorable\nWheel of Time\n.  I like to think that the name was a result of Jordan being a sadist who gave fair warning; that series should have been listed in an addendum to the Geneva Convention.\nAnyhow, if nothing else, we already know\nArts of Dark and Light\nwill have a gorgeous cover.  So we have that going for us….",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-20T15:23:00+00:00"
}