{
  "url": "https://voxday.net/2011/08/02/scales-fall-from-eyes/",
  "scraped_at": "2025-12-13T23:17:47.485659",
  "title": "The scales fall from the eyes",
  "date_display": "August 2, 2011",
  "date_iso": "2011-08-02T14:00:00+00:00",
  "date_from_url": "2011-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Farah now recognizes the reality of <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=328713\">the bi-factional ruling party</a>:</p><blockquote><p>[W]e don’t have two competing parties in Washington. We have one-party governance, totally unresponsive to the will of the people and the rule of law. Republicans and Democrats represent two wings of the same party – both of which, at the end of the day, don’t really covet a return to constitutionally limited government.</p><p>Disaster?</p><p>Catastrophe?</p><p>Outrage?</p><p>Yes, but none of these words even comes close to adequately characterizing the betrayal perpetrated by the Republican establishment in Washington over the last few days.</p><p>The era of big government is back with a vengeance – and apparently here to stay.</p><p>There are no limits. There are no restraints. There is no accountability. There is no end to red ink as far as the eye can see.</p></blockquote><p>As I have been telling you for ten years, voting Republican will NEVER be a panacea for the cornucopia of ills that have rendered America a revenant.  There probably is no panacea, as it is hard to envision any workable solution that does not involve the division of the country into at least three parts.  There simply aren’t the votes to “take back America” because too many nominal Americans dislike historical America, disvalue its freedoms and despise its Constitutional values.</p><p>And, thanks to the post-1965 influx of third-world immigrants, there will never be the votes.  No Hispanic nation, no African nation, no Arabic nation, and very few <i>European</i> nations have EVER placed any value on “the rights of Englishmen” that were asserted in the Declaration of Independence.  One need only read the aberrant parodies of the Declaration in the various UN and EU versions or national constitutions to see this is the case.  Mere change of geographic location has not sufficed to significantly modify the core philosophies or ideologies, or in many cases, <i>even the national identities</i> of those immigrants.</p><p>It is time to pull out of the Republican Party altogether.  This may mean that Obama will win a second term if he is not put out to pasture by the Democratic Party elders during the nomination process.  This will almost surely mean that there will be no meaningful opposition in Washington to the bi-factional ruling party in 2012 and possibly 2014.</p><p>But the complete inability of the Republican Party to do anything of substance, to cut <i>so much as a single dollar</i> from the current amount of spending, means that the “realistic” forty-year strategy of “elect more conservative Republicans” has completely failed.  It failed when Reagan was elected.  It failed in 1994.  It failed when Republicans held the White House and both houses of Congress.  It has failed after the 2010 success of the Tea Party.  Because it is clear that it is no longer even possible to prevent the bi-factional swan dive from the economic Tarpeian Rock, it is time to shift focus and to begin preparing for the post-mortem rebuilding.</p></div>",
  "content_text": "Mr. Farah now recognizes the reality of\nthe bi-factional ruling party\n:\n[W]e don’t have two competing parties in Washington. We have one-party governance, totally unresponsive to the will of the people and the rule of law. Republicans and Democrats represent two wings of the same party – both of which, at the end of the day, don’t really covet a return to constitutionally limited government.\nDisaster?\nCatastrophe?\nOutrage?\nYes, but none of these words even comes close to adequately characterizing the betrayal perpetrated by the Republican establishment in Washington over the last few days.\nThe era of big government is back with a vengeance – and apparently here to stay.\nThere are no limits. There are no restraints. There is no accountability. There is no end to red ink as far as the eye can see.\nAs I have been telling you for ten years, voting Republican will NEVER be a panacea for the cornucopia of ills that have rendered America a revenant.  There probably is no panacea, as it is hard to envision any workable solution that does not involve the division of the country into at least three parts.  There simply aren’t the votes to “take back America” because too many nominal Americans dislike historical America, disvalue its freedoms and despise its Constitutional values.\nAnd, thanks to the post-1965 influx of third-world immigrants, there will never be the votes.  No Hispanic nation, no African nation, no Arabic nation, and very few\nEuropean\nnations have EVER placed any value on “the rights of Englishmen” that were asserted in the Declaration of Independence.  One need only read the aberrant parodies of the Declaration in the various UN and EU versions or national constitutions to see this is the case.  Mere change of geographic location has not sufficed to significantly modify the core philosophies or ideologies, or in many cases,\neven the national identities\nof those immigrants.\nIt is time to pull out of the Republican Party altogether.  This may mean that Obama will win a second term if he is not put out to pasture by the Democratic Party elders during the nomination process.  This will almost surely mean that there will be no meaningful opposition in Washington to the bi-factional ruling party in 2012 and possibly 2014.\nBut the complete inability of the Republican Party to do anything of substance, to cut\nso much as a single dollar\nfrom the current amount of spending, means that the “realistic” forty-year strategy of “elect more conservative Republicans” has completely failed.  It failed when Reagan was elected.  It failed in 1994.  It failed when Republicans held the White House and both houses of Congress.  It has failed after the 2010 success of the Tea Party.  Because it is clear that it is no longer even possible to prevent the bi-factional swan dive from the economic Tarpeian Rock, it is time to shift focus and to begin preparing for the post-mortem rebuilding.",
  "tags": [
    "decline and fall",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-02T13:00:00+00:00"
}