{
  "url": "https://voxday.net/2011/08/30/setting-mr-harris-straig/",
  "scraped_at": "2025-12-13T23:20:29.857128",
  "title": "Setting Mr. Harris straight",
  "date_display": "August 30, 2011",
  "date_iso": "2011-08-30T16:30:00+00:00",
  "date_from_url": "2011-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This promises an amount of amusement, as Sam Harris has unaccountably decided <a href=\"http://www.samharris.org/blog/item/how-rich-is-too-rich/\">to dabble in economics</a>:</p><blockquote><p>I’ve written before about the crisis of inequality in the United States and about the quasi-religious abhorrence of “wealth redistribution” that causes many Americans to oppose tax increases, even on the ultra rich. The conviction that taxation is intrinsically evil has achieved a sadomasochistic fervor in conservative circles—producing the Tea Party, their Republican zombies, and increasingly terrifying failures of governance.</p></blockquote><p>Sam is off to a bad and overly politicized start.  First, Sam simply has it wrong as there is very little conviction that all taxes are intrinsically evil, since most of those opposing the income tax have no problem with a flat tax, sales taxes, or excise taxes.  No one expects the government to do without any funding at all, it is the amount of funding required that is at issue.  Thus, it is not an issue of taxation, but rather one of government spending.  Harris also gets the Tea Party wrong, as it is a rebel force within the Republican Party that is primarily opposed to the pro-spending Republican establishment and is focused on unseating certain types of Republicans during the nomination phase rather than electing Republicans in the general elections.  This should be obvious, as the Tea Party began in opposition to a Republican administration, not a Democratic one.</p><blockquote><p>Happily, not all billionaires are content to hoard their money in silence. Earlier this week, Warren Buffett published an op-ed in the New York Times in which he criticized our current approach to raising revenue. As he has lamented many times before, he is taxed at a lower rate than his secretary is. Many conservatives pretend not to find this embarrassing.</p></blockquote><p>Warren Buffett is a corrupt old bag of shit.  He steals from the American people with the connivance of the Wall Street bankers, the Bush administration, and now the Obama administration.  Witness his little deals with Goldman Sachs and now Bank of America.  To point to Buffett as any sort of moral examplary indicates that Harris has absolutely no idea what he is talking about.  Buffett is the poster boy for how government <i>creates</i> the very income inequality that bothers Harris so.</p><blockquote><p>Conservatives view taxation as a species of theft—and to raise taxes, on anyone for any reason, is simply to steal more. Conservatives also believe that people become rich by creating value for others. Once rich, they cannot help but create more value by investing their wealth and spawning new jobs in the process. We should not punish our best and brightest for their success, and stealing their money is a form of punishment.</p></blockquote><p>How is taking money from others utilizing the threat of violence <i>not</i> a form of theft?  It is true that not all rich people become rich by creating value, of course.  Some inherit it, but more often these days, they do so through government-enabled gambling and government corruption.</p><blockquote><p>Of course, this is just an economic cartoon. We don’t have perfectly efficient markets, and many wealthy people don’t create much in the way of value for others. In fact, as our recent financial crisis has shown, it is possible for a few people to become extraordinarily rich by wrecking the global economy.</p></blockquote><p>Like, for example, Warren Buffett.  Buffett creates nothing, neither do the financial institutions, which presently skim off around 30 percent of all the corporate profit in the USA.</p><blockquote><p>Nevertheless, the basic argument often holds: Many people have amassed fortunes because they (or their parent’s, parent’s, parents) created value. Steve Jobs resurrected Apple Computer and has since produced one gorgeous product after another. It isn’t an accident that millions of us are happy to give him our money.</p><p>But even in the ideal case, where obvious value has been created, how much wealth can one person be allowed to keep? A trillion dollars? Ten trillion? (Fifty trillion is the current GDP of Earth.) Granted, there will be some limit to how fully wealth can concentrate in any society, for the richest possible person must still spend money on something, thereby spreading wealth to others. But there is nothing to prevent the ultra rich from cooking all their meals at home, using vegetables grown in their own gardens, and investing the majority of their assets in China.</p></blockquote><p>And the inevitable atheist tendency towards totalitarianism finally shows through.  Rich people aren’t “allowed to keep money”.  They have it.  It’s theirs.  As in, not yours, Sam.  This is called the principle of private property, and upon it all the wealth of the Western world is founded.  Or rather, was founded before it was turned into collateral in a ponzi scheme.</p><blockquote><p>Bill Gates and Warren Buffet, the two richest men in the United States, each have around $50 billion. Let’s put this number in perspective: They each have a thousand times the amount of money you would have if you were a movie star who had managed to save $50 million over the course of a very successful career. Think of every actor you can name or even dimly recognize, including the rare few who have banked hundreds of millions of dollars in recent years, and run this highlight reel back half a century. Gates and Buffet each have more personal wealth than all of these glamorous men and women—from Bogart and Bacall to Pitt and Jolie—combined.</p><p>In fact, there are people who rank far below Gates and Buffet in net worth, who still make several million dollars a day, every day of the year, and have throughout the current recession.</p></blockquote><p>Some people have more money than others.  Big deal.  I don’t see Sam handing over his royalties to the poor.  If he’s a typical atheist, he gives a lower percentage of his income to charity than Bill Gates or Warren Buffett does.</p><blockquote><p>And there is no reason to think that we have reached the upper bound of wealth inequality, as not every breakthrough in technology creates new jobs. The ultimate labor saving device might be just that—the ultimate labor saving device. Imagine the future Google of robotics or nanotechnology: Its CEO could make Steve Jobs look like a sharecropper, and its products could put tens of millions of people out of work. What would it mean for one person to hold the most valuable patents compatible with the laws of physics and to amass more wealth than everyone else on the Forbes 400 list combined?</p></blockquote><p>This is actually a very good point and something which has concerned me for nearly 20 years.  I remember going over a list of 100 employees with my father and realizing that about 10 of them actually did anything particularly relevant to producing the products we sold. Everyone else was basically talking to other people or filling out forms.</p><blockquote><p>How many Republicans who have vowed not to raise taxes on billionaires would want to live in a country with a trillionaire and 30 percent unemployment? If the answer is “none”—and it really must be—then everyone is in favor of “wealth redistribution.” They just haven’t been forced to admit it.</p></blockquote><p>Dude, they already kind of do.  There may not be a trillionaire yet, but since the Employment-Population Ratio is presently 58.1, that means 41.9% of the population is already not employed.  And if he means U3, as I showed yesterday, that’s already over 15%.  I haven’t recalculated U6, but if that’s not over 30% now, it’s very close.</p><blockquote><p>Yes, we must cut spending and reduce inefficiencies in government—and yes, many things are best accomplished in the private sector. But this does not mean that we can ignore the astonishing gaps in wealth that have opened between the poor and the rich, and between the rich and the ultra rich. Some of your neighbors have no more than $2,000 in total assets (in fact, 40 percent of Americans fall into this category); some have around $2 million; and some have $2 billion (and a few have much more). Each of these gaps represents a thousandfold increase in wealth.</p><p>Some Americans have amassed more wealth than they or their descendants can possibly spend. Who do conservatives think is in a better position to help pull this country back from the brink?</p></blockquote><p>The problem has nothing to do with income inequality.  In fact, the income inequality stems from the real problem, which is the massive quantities of debt in the system.  The  relatively recent increase in income inequality is primarily an artifact of the massive quantities of financial sector debt combined with the way in which the federal government – the very institution Harris imagines using to reduce income equality – is providing a backstop insuring the very wealthiest against the negative consequences of the huge gambles they are taking.  For example, Warren Buffett was probably the primary beneficiary of the federal government’s $85 billion credit line to AIG, $13 billion of which went directly to paying off Goldman Sachs.</p><p>I will address his addendum in a future post.</p></div>",
  "content_text": "This promises an amount of amusement, as Sam Harris has unaccountably decided\nto dabble in economics\n:\nI’ve written before about the crisis of inequality in the United States and about the quasi-religious abhorrence of “wealth redistribution” that causes many Americans to oppose tax increases, even on the ultra rich. The conviction that taxation is intrinsically evil has achieved a sadomasochistic fervor in conservative circles—producing the Tea Party, their Republican zombies, and increasingly terrifying failures of governance.\nSam is off to a bad and overly politicized start.  First, Sam simply has it wrong as there is very little conviction that all taxes are intrinsically evil, since most of those opposing the income tax have no problem with a flat tax, sales taxes, or excise taxes.  No one expects the government to do without any funding at all, it is the amount of funding required that is at issue.  Thus, it is not an issue of taxation, but rather one of government spending.  Harris also gets the Tea Party wrong, as it is a rebel force within the Republican Party that is primarily opposed to the pro-spending Republican establishment and is focused on unseating certain types of Republicans during the nomination phase rather than electing Republicans in the general elections.  This should be obvious, as the Tea Party began in opposition to a Republican administration, not a Democratic one.\nHappily, not all billionaires are content to hoard their money in silence. Earlier this week, Warren Buffett published an op-ed in the New York Times in which he criticized our current approach to raising revenue. As he has lamented many times before, he is taxed at a lower rate than his secretary is. Many conservatives pretend not to find this embarrassing.\nWarren Buffett is a corrupt old bag of shit.  He steals from the American people with the connivance of the Wall Street bankers, the Bush administration, and now the Obama administration.  Witness his little deals with Goldman Sachs and now Bank of America.  To point to Buffett as any sort of moral examplary indicates that Harris has absolutely no idea what he is talking about.  Buffett is the poster boy for how government\ncreates\nthe very income inequality that bothers Harris so.\nConservatives view taxation as a species of theft—and to raise taxes, on anyone for any reason, is simply to steal more. Conservatives also believe that people become rich by creating value for others. Once rich, they cannot help but create more value by investing their wealth and spawning new jobs in the process. We should not punish our best and brightest for their success, and stealing their money is a form of punishment.\nHow is taking money from others utilizing the threat of violence\nnot\na form of theft?  It is true that not all rich people become rich by creating value, of course.  Some inherit it, but more often these days, they do so through government-enabled gambling and government corruption.\nOf course, this is just an economic cartoon. We don’t have perfectly efficient markets, and many wealthy people don’t create much in the way of value for others. In fact, as our recent financial crisis has shown, it is possible for a few people to become extraordinarily rich by wrecking the global economy.\nLike, for example, Warren Buffett.  Buffett creates nothing, neither do the financial institutions, which presently skim off around 30 percent of all the corporate profit in the USA.\nNevertheless, the basic argument often holds: Many people have amassed fortunes because they (or their parent’s, parent’s, parents) created value. Steve Jobs resurrected Apple Computer and has since produced one gorgeous product after another. It isn’t an accident that millions of us are happy to give him our money.\nBut even in the ideal case, where obvious value has been created, how much wealth can one person be allowed to keep? A trillion dollars? Ten trillion? (Fifty trillion is the current GDP of Earth.) Granted, there will be some limit to how fully wealth can concentrate in any society, for the richest possible person must still spend money on something, thereby spreading wealth to others. But there is nothing to prevent the ultra rich from cooking all their meals at home, using vegetables grown in their own gardens, and investing the majority of their assets in China.\nAnd the inevitable atheist tendency towards totalitarianism finally shows through.  Rich people aren’t “allowed to keep money”.  They have it.  It’s theirs.  As in, not yours, Sam.  This is called the principle of private property, and upon it all the wealth of the Western world is founded.  Or rather, was founded before it was turned into collateral in a ponzi scheme.\nBill Gates and Warren Buffet, the two richest men in the United States, each have around $50 billion. Let’s put this number in perspective: They each have a thousand times the amount of money you would have if you were a movie star who had managed to save $50 million over the course of a very successful career. Think of every actor you can name or even dimly recognize, including the rare few who have banked hundreds of millions of dollars in recent years, and run this highlight reel back half a century. Gates and Buffet each have more personal wealth than all of these glamorous men and women—from Bogart and Bacall to Pitt and Jolie—combined.\nIn fact, there are people who rank far below Gates and Buffet in net worth, who still make several million dollars a day, every day of the year, and have throughout the current recession.\nSome people have more money than others.  Big deal.  I don’t see Sam handing over his royalties to the poor.  If he’s a typical atheist, he gives a lower percentage of his income to charity than Bill Gates or Warren Buffett does.\nAnd there is no reason to think that we have reached the upper bound of wealth inequality, as not every breakthrough in technology creates new jobs. The ultimate labor saving device might be just that—the ultimate labor saving device. Imagine the future Google of robotics or nanotechnology: Its CEO could make Steve Jobs look like a sharecropper, and its products could put tens of millions of people out of work. What would it mean for one person to hold the most valuable patents compatible with the laws of physics and to amass more wealth than everyone else on the Forbes 400 list combined?\nThis is actually a very good point and something which has concerned me for nearly 20 years.  I remember going over a list of 100 employees with my father and realizing that about 10 of them actually did anything particularly relevant to producing the products we sold. Everyone else was basically talking to other people or filling out forms.\nHow many Republicans who have vowed not to raise taxes on billionaires would want to live in a country with a trillionaire and 30 percent unemployment? If the answer is “none”—and it really must be—then everyone is in favor of “wealth redistribution.” They just haven’t been forced to admit it.\nDude, they already kind of do.  There may not be a trillionaire yet, but since the Employment-Population Ratio is presently 58.1, that means 41.9% of the population is already not employed.  And if he means U3, as I showed yesterday, that’s already over 15%.  I haven’t recalculated U6, but if that’s not over 30% now, it’s very close.\nYes, we must cut spending and reduce inefficiencies in government—and yes, many things are best accomplished in the private sector. But this does not mean that we can ignore the astonishing gaps in wealth that have opened between the poor and the rich, and between the rich and the ultra rich. Some of your neighbors have no more than $2,000 in total assets (in fact, 40 percent of Americans fall into this category); some have around $2 million; and some have $2 billion (and a few have much more). Each of these gaps represents a thousandfold increase in wealth.\nSome Americans have amassed more wealth than they or their descendants can possibly spend. Who do conservatives think is in a better position to help pull this country back from the brink?\nThe problem has nothing to do with income inequality.  In fact, the income inequality stems from the real problem, which is the massive quantities of debt in the system.  The  relatively recent increase in income inequality is primarily an artifact of the massive quantities of financial sector debt combined with the way in which the federal government – the very institution Harris imagines using to reduce income equality – is providing a backstop insuring the very wealthiest against the negative consequences of the huge gambles they are taking.  For example, Warren Buffett was probably the primary beneficiary of the federal government’s $85 billion credit line to AIG, $13 billion of which went directly to paying off Goldman Sachs.\nI will address his addendum in a future post.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-30T15:30:00+00:00"
}