{
  "url": "https://voxday.net/2011/08/20/solve-for-x/",
  "scraped_at": "2025-12-13T23:19:32.606860",
  "title": "Solve for X",
  "date_display": "August 20, 2011",
  "date_iso": "2011-08-20T13:11:00+00:00",
  "date_from_url": "2011-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If scientists wish to better understand why the rest of humanity sometimes doesn’t view Asimov’s “Nightfall” as a classic cautionary tale, but rather as a cheerful little story with a happy ending, <a href=\"http://www.ahrp.org/cms/content/view/827/9/\">this sort of thing</a> might be why:</p><blockquote><p>The Alliance for Human Research Protection speaks out against a US government-proposed anthrax vaccine experiment on children. Such an experiment would sacrifice children’s welfare, much as canaries sent into the coal mines were sacrificed.  The National Biodefense Science Board,convened a two day meeting of the  Anthrax Vaccine Working Group at the request of the Department of Health and Human Services. The July 7 meeting was open to the public, followed by a closed meeting on July 8.</p></blockquote><p>I propose a new law that dictates any scientist who seriously proposes experiments on unconsenting children that involves lethal diseases be officially stripped of human status and turned over to cosmetic research laboratories.  I mean, precisely how obtuse do you have to be to fail to understand that this sort of thing is simply not done?</p><p><i>“Performing experiments in non-consenting children, especially when they do not have a condition the experiment is designed to address, is carefully regulated.”</i></p><p>Carefully <i>regulated</i>?  Why is it regulated, carefully or not?  It should be completely illegal.  And the Tuskeegee experiment was far from the last time this sort of thing happened, as they’re <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=313393\">still doing similar experiments</a> with clueless, uninformed people even today.</p><p>The amazing thing is that many scientists genuinely believe they should be running the world.  I think a much more relevant debate is whether the rest of the human population should take them out and shoot them in preemptive self-defense now or simply keep a closer eye on the myopic bastards.  The usual arguments about the niftyness of technology and increased populations don’t really matter all that much when the only extant threats to human existence have all been produced by scientists.</p><p>Since so few scientists, and even fewer science fans, have any capacity for comprehending logic, I will put the argument into mathematical terms. It doesn’t matter how many positive integers you add together if in the end, you multiply the sum by zero.</p><p>Here is the test: Sum(1:N)*0 = X.  Solve for X.  Then explain what value of N will cause a change in the value of X.</p></div>",
  "content_text": "If scientists wish to better understand why the rest of humanity sometimes doesn’t view Asimov’s “Nightfall” as a classic cautionary tale, but rather as a cheerful little story with a happy ending,\nthis sort of thing\nmight be why:\nThe Alliance for Human Research Protection speaks out against a US government-proposed anthrax vaccine experiment on children. Such an experiment would sacrifice children’s welfare, much as canaries sent into the coal mines were sacrificed.  The National Biodefense Science Board,convened a two day meeting of the  Anthrax Vaccine Working Group at the request of the Department of Health and Human Services. The July 7 meeting was open to the public, followed by a closed meeting on July 8.\nI propose a new law that dictates any scientist who seriously proposes experiments on unconsenting children that involves lethal diseases be officially stripped of human status and turned over to cosmetic research laboratories.  I mean, precisely how obtuse do you have to be to fail to understand that this sort of thing is simply not done?\n“Performing experiments in non-consenting children, especially when they do not have a condition the experiment is designed to address, is carefully regulated.”\nCarefully\nregulated\n?  Why is it regulated, carefully or not?  It should be completely illegal.  And the Tuskeegee experiment was far from the last time this sort of thing happened, as they’re\nstill doing similar experiments\nwith clueless, uninformed people even today.\nThe amazing thing is that many scientists genuinely believe they should be running the world.  I think a much more relevant debate is whether the rest of the human population should take them out and shoot them in preemptive self-defense now or simply keep a closer eye on the myopic bastards.  The usual arguments about the niftyness of technology and increased populations don’t really matter all that much when the only extant threats to human existence have all been produced by scientists.\nSince so few scientists, and even fewer science fans, have any capacity for comprehending logic, I will put the argument into mathematical terms. It doesn’t matter how many positive integers you add together if in the end, you multiply the sum by zero.\nHere is the test: Sum(1:N)*0 = X.  Solve for X.  Then explain what value of N will cause a change in the value of X.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-20T12:11:00+00:00"
}