{
  "url": "https://voxday.net/2011/08/21/supply-demand-and-interest-rate/",
  "scraped_at": "2025-12-13T23:19:41.746531",
  "title": "Supply, Demand, and the Interest Rate",
  "date_display": "August 21, 2011",
  "date_iso": "2011-08-21T13:30:00+00:00",
  "date_from_url": "2011-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I swear, Neo-Keynesians must never look at debt statistics.  I mean, they literally NEVER seem to look at them!  Our favorite Nobel Prize-winner comments on what is supposed to be the mysterious failure of interest rates to rise in line with the massive expansion of government debt since 2008 and <a href=\"http://krugman.blogs.nytimes.com/2011/08/20/fancy-theorists-of-the-world-unite/\">erroneously concludes that this proves his belief</a> in <s>unicorns</s>the ability of government to borrow indefinitely without affecting interest rates:</p><blockquote><p>I mean, common sense — or at least common sense as the WSJ sees it — would tell you that massive government borrowing would send interest rates soaring. And that’s certainly what the WSJ editorial page told its readers would happen.  Only us fancy-schmancy Keynesians said otherwise; and here’s what actually happened:</p></blockquote><p>Yes, interest rates have declined from 4.7% in 2007 to 2.3% in 2011 even as government borrowing has almost doubled, but what Krugman fails to point out is that the neo-classicals at the WSJ were assuming, incorrectly, that the private demand for debt, (a 12x larger factor), would continue to increase, and therefore increased government borrowing added on top of that would cause overall debt to expand in excess of its average annual post-WWII rate of 8.7%.  This OVERALL increase in demand for debt would increase the price of debt, thereby causing interest rates to rise.  All very sensible and perfectly in line with both post-war economic history and basic economic theory alike.</p><p>However, what the WSJ failed to anticipate was that despite the 82.9% increase in government borrowing since 2008, total debt outstanding only grew 4.8% in 2008 and actually SHRANK 0.32% in 2009 and 0.87% in 2010.  That’s not a liquidity trap, that’s a 22.5% demand gap between the overall amount of debt anticipated and the actual amount borrowed!</p><p>Even an Econ 101 student knows what happens to price when supply goes up and demand goes down.  The price goes down.  Interest rates are at historic lows for the obvious reason that OVERALL demand for debt, relative to GDP, is at historic lows as well, even though the federal government sector has increased rapidly.  The WSJ made what at the time appeared to be a safe and perfectly reasonable assumption, given that between 1946 and 2007, there had never been a single year in which overall debt grew less than 4%.  Their assumption also happened to be absolutely wrong, but the incorrect nature of that assumption does not mean that Krugman and his fancy-schmancy Keynesian-imagined exception to the law of supply and demand is therefore correct.</p></div>",
  "content_text": "I swear, Neo-Keynesians must never look at debt statistics.  I mean, they literally NEVER seem to look at them!  Our favorite Nobel Prize-winner comments on what is supposed to be the mysterious failure of interest rates to rise in line with the massive expansion of government debt since 2008 and\nerroneously concludes that this proves his belief\nin\nunicorns\nthe ability of government to borrow indefinitely without affecting interest rates:\nI mean, common sense — or at least common sense as the WSJ sees it — would tell you that massive government borrowing would send interest rates soaring. And that’s certainly what the WSJ editorial page told its readers would happen.  Only us fancy-schmancy Keynesians said otherwise; and here’s what actually happened:\nYes, interest rates have declined from 4.7% in 2007 to 2.3% in 2011 even as government borrowing has almost doubled, but what Krugman fails to point out is that the neo-classicals at the WSJ were assuming, incorrectly, that the private demand for debt, (a 12x larger factor), would continue to increase, and therefore increased government borrowing added on top of that would cause overall debt to expand in excess of its average annual post-WWII rate of 8.7%.  This OVERALL increase in demand for debt would increase the price of debt, thereby causing interest rates to rise.  All very sensible and perfectly in line with both post-war economic history and basic economic theory alike.\nHowever, what the WSJ failed to anticipate was that despite the 82.9% increase in government borrowing since 2008, total debt outstanding only grew 4.8% in 2008 and actually SHRANK 0.32% in 2009 and 0.87% in 2010.  That’s not a liquidity trap, that’s a 22.5% demand gap between the overall amount of debt anticipated and the actual amount borrowed!\nEven an Econ 101 student knows what happens to price when supply goes up and demand goes down.  The price goes down.  Interest rates are at historic lows for the obvious reason that OVERALL demand for debt, relative to GDP, is at historic lows as well, even though the federal government sector has increased rapidly.  The WSJ made what at the time appeared to be a safe and perfectly reasonable assumption, given that between 1946 and 2007, there had never been a single year in which overall debt grew less than 4%.  Their assumption also happened to be absolutely wrong, but the incorrect nature of that assumption does not mean that Krugman and his fancy-schmancy Keynesian-imagined exception to the law of supply and demand is therefore correct.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-21T12:30:00+00:00"
}