{
  "url": "https://voxday.net/2011/08/31/they-broke-it-can-they-fix-i/",
  "scraped_at": "2025-12-13T23:20:31.680456",
  "title": "Analyzing the Obama “jobs plan”",
  "date_display": "August 31, 2011",
  "date_iso": "2011-08-31T09:13:00+00:00",
  "date_from_url": "2011-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama’s <a href=\"http://www.washingtonpost.com/politics/princeton-economist-tapped-to-head-council-of-economic-advisers/2011/08/29/gIQAhtlPoJ_print.html\">attempt to address unemployment and the economic contraction</a> can best be described as “quixotic”.  Another apt adjective would be “doomed”:</p><blockquote><p>The White House scrambled Monday to finalize a new jobs initiative as President Obama nominated the last member of the economic team that will be charged with carrying it out.  In tapping Alan Krueger, a Princeton University professor and noted labor expert, to be chairman of the Council of Economic Advisers, Obama turned to an economist who officials said was well suited to guide the White House through a jobs crisis….  Obama’s nomination of Krueger would largely reconstitute the economic policy team inside the Treasury Department during the first two years of the administration. At the time, Krueger served as Treasury Secretary Timothy F. Geithner’s top economic adviser. His work overlapped with that of Gene Sperling, who was a top adviser on budget and tax issues.</p></blockquote><p>The Krueger appointment only makes sense, given that Obama’s economic policy team did such an effective job in 2009 and 2010, avoiding the Second Great Depression and subsequently producing seven straight quarters of economic recovery, right?  Let’s look at the elements of the proposed plan:</p><p><b>1.  a tax cut that would directly reward companies for hiring new workers</b></p><p>The big companies already have billions parked in offshore accounts.  The tax cut won’t be big enough to balance the risk and additional expenses that new hires impose on small companies.  Conclusion: irrelevant, but at least it won’t cost anything.</p><p><b>2.  new spending for environmentally friendly construction and for rehabilitating schools</b></p><p>This is just more of the same Samuelsonian stimulus, but not so much that the demand for labor it will create can’t be met by the existing construction labor force that is already half-idle due to the collapse in the real estate markets.  Conclusion: this will increase federal debt and create no new employment.</p><p><b>3.  clean-energy tax cuts.</b></p><p>Actual tax cuts will do nothing.  I’m guessing these are actually subsidies disguised as tax credits.  Conclusion: More federal debt, more malinvestment, no new employment.</p><p><b>4.  programs to target long-term unemployment, potentially including a version of a Georgia unemployment insurance program that pays employers to hire workers who have been unemployed and provides funding for training.</b></p><p>Theoretically more useful, depending upon the industry.  Serious employer-provided training could be a genuinely positive long-term boost to employment if it was combined with import tariffs in manufacturing industries, especially if tighter immigration restrictions were imposed as well.  But since neither trade restrictions nor immigration restrictions will be incorporated and the training will probably be oriented towards low-skill service industry jobs, all of the subsidized positions will disappear as soon as the subsidies do.  Conclusion: expensive and irrelevant.  A 2012 Census would have the same effect and likely prove more useful.</p><p><b>5.  new programs to lift the housing market, such as a refinancing initiative that could pump tens of billions of dollars into the economy.</b></p><p>Conclusion: This is the Bank of America bailout signaled by Warren Buffet’s investment.  I suspect the plan will somehow involve shifting household debt to the federal sector and thereby attempting to encourage homeowners to take on more debt.  This might involve something like a federal guarantee for X amount of debt with administration-approved banks in return for every XY amount of new debt borrowed from <s>BAC</s>those banks.  The Fed and the administration are desperate to get the household sector borrowing again since the trillions in financial sector debt they ate in 2008 didn’t even slow down the decline in financial borrowing.  Conclusion: if large enough, it would trigger a short term spending and employment boost combined with another debt-deflation disaster within three years.</p><p><b>6.  renewing — and potentially expanding — ongoing efforts, such as a two-percentage-point cut in the payroll tax.</b></p><p>Trivial.  They’ll have to eliminate it for at least a five year period  for this to have any effect on unemployment.</p><p>This doesn’t even include the plan to extend “emergency” unemployment benefits, which will tend to <i>increase</i> the unemployment rate.  The only way the Obama administration is going to reduce the unemployment rate is to continue the Bureau of Labor Statistics’s practice of artificially lowering the labor force participation rate to keep U3 below 10 percent.  Of course, the continued decline in the Employment-Population Ratio to pre-1953 levels will expose this predictable shenanigan.</p></div>",
  "content_text": "Obama’s\nattempt to address unemployment and the economic contraction\ncan best be described as “quixotic”.  Another apt adjective would be “doomed”:\nThe White House scrambled Monday to finalize a new jobs initiative as President Obama nominated the last member of the economic team that will be charged with carrying it out.  In tapping Alan Krueger, a Princeton University professor and noted labor expert, to be chairman of the Council of Economic Advisers, Obama turned to an economist who officials said was well suited to guide the White House through a jobs crisis….  Obama’s nomination of Krueger would largely reconstitute the economic policy team inside the Treasury Department during the first two years of the administration. At the time, Krueger served as Treasury Secretary Timothy F. Geithner’s top economic adviser. His work overlapped with that of Gene Sperling, who was a top adviser on budget and tax issues.\nThe Krueger appointment only makes sense, given that Obama’s economic policy team did such an effective job in 2009 and 2010, avoiding the Second Great Depression and subsequently producing seven straight quarters of economic recovery, right?  Let’s look at the elements of the proposed plan:\n1.  a tax cut that would directly reward companies for hiring new workers\nThe big companies already have billions parked in offshore accounts.  The tax cut won’t be big enough to balance the risk and additional expenses that new hires impose on small companies.  Conclusion: irrelevant, but at least it won’t cost anything.\n2.  new spending for environmentally friendly construction and for rehabilitating schools\nThis is just more of the same Samuelsonian stimulus, but not so much that the demand for labor it will create can’t be met by the existing construction labor force that is already half-idle due to the collapse in the real estate markets.  Conclusion: this will increase federal debt and create no new employment.\n3.  clean-energy tax cuts.\nActual tax cuts will do nothing.  I’m guessing these are actually subsidies disguised as tax credits.  Conclusion: More federal debt, more malinvestment, no new employment.\n4.  programs to target long-term unemployment, potentially including a version of a Georgia unemployment insurance program that pays employers to hire workers who have been unemployed and provides funding for training.\nTheoretically more useful, depending upon the industry.  Serious employer-provided training could be a genuinely positive long-term boost to employment if it was combined with import tariffs in manufacturing industries, especially if tighter immigration restrictions were imposed as well.  But since neither trade restrictions nor immigration restrictions will be incorporated and the training will probably be oriented towards low-skill service industry jobs, all of the subsidized positions will disappear as soon as the subsidies do.  Conclusion: expensive and irrelevant.  A 2012 Census would have the same effect and likely prove more useful.\n5.  new programs to lift the housing market, such as a refinancing initiative that could pump tens of billions of dollars into the economy.\nConclusion: This is the Bank of America bailout signaled by Warren Buffet’s investment.  I suspect the plan will somehow involve shifting household debt to the federal sector and thereby attempting to encourage homeowners to take on more debt.  This might involve something like a federal guarantee for X amount of debt with administration-approved banks in return for every XY amount of new debt borrowed from\nBAC\nthose banks.  The Fed and the administration are desperate to get the household sector borrowing again since the trillions in financial sector debt they ate in 2008 didn’t even slow down the decline in financial borrowing.  Conclusion: if large enough, it would trigger a short term spending and employment boost combined with another debt-deflation disaster within three years.\n6.  renewing — and potentially expanding — ongoing efforts, such as a two-percentage-point cut in the payroll tax.\nTrivial.  They’ll have to eliminate it for at least a five year period  for this to have any effect on unemployment.\nThis doesn’t even include the plan to extend “emergency” unemployment benefits, which will tend to\nincrease\nthe unemployment rate.  The only way the Obama administration is going to reduce the unemployment rate is to continue the Bureau of Labor Statistics’s practice of artificially lowering the labor force participation rate to keep U3 below 10 percent.  Of course, the continued decline in the Employment-Population Ratio to pre-1953 levels will expose this predictable shenanigan.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-31T08:13:00+00:00"
}