{
  "url": "https://voxday.net/2011/08/19/tracking-anklebiters/",
  "scraped_at": "2025-12-13T23:19:30.772729",
  "title": "Tracking the anklebiters",
  "date_display": "August 19, 2011",
  "date_iso": "2011-08-19T17:00:00+00:00",
  "date_from_url": "2011-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because it is getting increasingly difficult to keep track of exactly which anklebiter is avoiding what question, I’ve decided to add this handy little reference link to the sidebar so that the keepers of the hammer will know whose comments to continue deleting until they either back up their naked assertions or retract them.  It’s always illuminating to see who can actually support their assertions and who doesn’t even make any attempt to do so.  Unsurprisingly, it is usually the mindless critics who have proven incapable of constructing the most rudimentary arguments in support of their positions.</p><p>BANNED</p><p>Beelzebub:  Trolls under a variety of pseudonyms. Real name Hunt Stoddard.<br> Pawn Takes Queen: Aka “passerby”.<br> Modernguy: hates Spacebunny <br> Bearded Spock: Also used a variety of names.  Appears to be from Finland.  Markku’s evil twin?<br> Will: aka Dan aka Alauda: the SF/F literary troll and legendary committer of “So, what are your names, wayfarers?”<br> Unger: Free trader given to emotional incontinence and demonstrably false assertions.<br> Tad: aka “Writer Gawking”. Homosexual with affinity for Paris and 25 comments/post<br> Phoenician:<br> Whatever/Pharyngula reader and librarian who favors the term “dipshit”<br> and can’t tell the difference between California and Massachusetts, or<br> between science and ethical justifications to not use science.</br></br></br></br></br></br></br></br></br></br></p><p>THE USUAL SUSPECTS</p><p>Holla: Doesn’t know what an “anecdote” is.<br> George: Doesn’t know what “hearsay evidence” is.  Asserts atheists get divorced less often than self-identified Christians. <br> Depkey: Joseph from CL’s blog.  His cunning plan is to troll with what he calls a Taylor persona.<br> James May: Monomania about certain SFWA writers.</br></br></br></p></div>",
  "content_text": "Because it is getting increasingly difficult to keep track of exactly which anklebiter is avoiding what question, I’ve decided to add this handy little reference link to the sidebar so that the keepers of the hammer will know whose comments to continue deleting until they either back up their naked assertions or retract them.  It’s always illuminating to see who can actually support their assertions and who doesn’t even make any attempt to do so.  Unsurprisingly, it is usually the mindless critics who have proven incapable of constructing the most rudimentary arguments in support of their positions.\nBANNED\nBeelzebub:  Trolls under a variety of pseudonyms. Real name Hunt Stoddard.\nPawn Takes Queen: Aka “passerby”.\nModernguy: hates Spacebunny\nBearded Spock: Also used a variety of names.  Appears to be from Finland.  Markku’s evil twin?\nWill: aka Dan aka Alauda: the SF/F literary troll and legendary committer of “So, what are your names, wayfarers?”\nUnger: Free trader given to emotional incontinence and demonstrably false assertions.\nTad: aka “Writer Gawking”. Homosexual with affinity for Paris and 25 comments/post\nPhoenician:\nWhatever/Pharyngula reader and librarian who favors the term “dipshit”\nand can’t tell the difference between California and Massachusetts, or\nbetween science and ethical justifications to not use science.\nTHE USUAL SUSPECTS\nHolla: Doesn’t know what an “anecdote” is.\nGeorge: Doesn’t know what “hearsay evidence” is.  Asserts atheists get divorced less often than self-identified Christians.\nDepkey: Joseph from CL’s blog.  His cunning plan is to troll with what he calls a Taylor persona.\nJames May: Monomania about certain SFWA writers.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-19T16:00:00+00:00"
}