{
  "url": "https://voxday.net/2011/08/20/wangsty-is-still-at-i/",
  "scraped_at": "2025-12-13T23:19:36.256735",
  "title": "Wängsty is still at it",
  "date_display": "August 20, 2011",
  "date_iso": "2011-08-20T19:40:00+00:00",
  "date_from_url": "2011-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which R. Scott Bakker demonstrates that there is <a href=\"http://rsbakker.wordpress.com/2011/08/20/ironies-in-the-fire/\">more fantasy in his philosophy</a> than there is philosophy in his fantasy.</p><blockquote><p>By way of clarification, no one asked him about the ‘absolute’ of anything. I’m not sure I understand, otherwise (and would welcome clarification). Is he saying he doesn’t believe in the question? Or is he saying the truth or falsity doesn’t matter, so long as people do what he wants them to do? Or is he actually biting the bullet, saying, ‘I really don’t know whether my claims are right or wrong, but I don’t care one way or another, so long as people seem to believe me.”</p><p>Or is he simply avoiding the question once again.</p></blockquote><p>It appears I have to write very slowly or Bakker will be again unable to follow what everyone else has understood.  I initially ignored the question because I thought it was rhetorical.  After he started suggesting I was avoiding it, I gave the only answer I considered to be meaningful.  But what I am saying, and what I have believed from the start, is that it is a stupid and irrelevant question.  There is no such thing as “certainty” and Bakker’s entire certainty/uncertainty framework is a false one.  Not only are there no “Grand Prize Winners” in the sense that he means it, I don’t know a single person who genuinely believes they are a Grand Prize Winner either.  The basic philosophical framework he has presented is as fictitious as his novels.</p><p>Here is my return question for him.  (1) What are ten historical examples of “certainty” causing more material harm than uncertainty?</p><blockquote><p>Now, if I were a follower of Theo, I would like to know what the hell he’s talking about. Why should they take someone who doesn’t care about the accuracy of his views of faith seriously? Or, if he does take the accuracy (as opposed to the consequences) of his claims seriously, why should they trust the claims of someone who doesn’t take the likelihood they are wrong seriously.</p></blockquote><p>They take me seriously because I have a strong track record of being much more accurate than the average commentator or media expert over nearly a decade of writing columns.  When your predictions help people make 475% on their investments during a bear market, help them avoid going underwater on their homes by correctly nailing housing prices within $300 one year in advance, and correctly anticipate a global financial crisis several months in advance, it tends to give you a certain amount of credibility.  I am always aware that there is a <i>possibility</i> I am wrong.  Anyone with an IQ over 80 is.  But Bakker can’t seem to grasp the concept of <i>probability</i>.  Everyone is wrong sometimes.  Pataki anyone?  The Lizard Queen?  But the verifiable fact of the matter is that I am wrong far less often than most despite the predictive risks I take, and when I am wrong I am still usually in the general vicinity.</p><p>For example, I predicted that Obama would not be the 2012 Democratic nominee over one year ago.  I said he would be encouraged not to run by the Democratic Party elders.  At the time, everyone thought that was absolutely insane and the prediction was much mocked by many among the Dread Ilk.  While I still may be turn out to be wrong, no one is laughing at it anymore, least of all Obama’s advisors, now that the Washington Post is reporting the very activity that I predicted last year.</p><blockquote><p>One of the things that seems to make democracy such an effective form of governance, for instance, is its capacity for reform, for adapting to new social realities. It’s ugly, it’s prone to error, but the institution is designed to eventually get it right.</p></blockquote><p>Bakker must be a historical illiterate.  Cicero knew better than this more than 2,000 years ago.  The American Founding Fathers knew better more than 200 years ago.  Democracy is not “designed to eventually get it right”, it is designed to eventually collapse into dictatorship.  Also, of all the “democracies” in the world, Switzerland is the only one that is even remotely democratic in the proper sense of the term.  Bakker clearly doesn’t understand that modern pseudo-democracies are structured in such a way as to <i>prevent </i>meaningful reform and periodically release political pressure while ensuring the continued rule of the political elite.</p><p>From De Re Publica:</p><p><i>“I have reasoned thus on the three forms of government, not looking on them in their disorganized and confused conditions, but in their proper and regular administration. These three particular forms, however, contained in themselves from the first, the faults and defects I have mentioned, but they have still more dangerous vices, for there is not one of these three forms of government, which has not a precipitous and slippery passage down to some proximate abuse. For after that king, whom I have called most admirable, or if you please most endurable—after the amiable Cyrus, we behold the barbarous Phalaris, that model of tyranny, to which the monarchical authority is easily abused by a facile and natural inclination. Alongside of the wise aristocracy of Marseilles, we might exhibit the oligarchical faction of the thirty despots, which once existed at Athens. And among the same Athenians, we can shew you, that when unlimited power was cast into the hands of the people, it inflamed the fury of the multitude, and aggravated that universal licence which ruined their state.”</i></p><blockquote><p>The reason science has so outstripped its competitors boils down to creative flexibility in the face of supercomplexity. Multiple researchers with multiple hypotheses, embedded in a system that selects for accuracy. You never ‘go all in’ – rather, you hedge your bets, always realizing the complexity of things is such that you could very well lose. And you listen closely to those making contrary bets around you, realizing that they are at least as likely to be holding the winning hand as you.</p></blockquote><p>This section is simply ridiculous from start to finish.  Bakker obviously knows little about how science and scientists actually operate.  Scientistry is a corrupt and politicized institution that makes increasingly little use of scientody.  He needs to read <i>The Structure of Scientific Revolutions</i> as he clearly isn’t familiar with the problem of scientific paradigms, nor does he realize that the only reason science has been so astonishingly successful in the West is because it has ridden on the back of free enterprise and technological development.  The Soviet Union devoted a higher percentage of its GDP to science than the West did and was still driving 1950s automobiles forty years later.</p><p>It may be true that we are all possessed of three-pound brains.  It is also empirically and historically demonstrable that some individuals put those three pounds to more systematic and effective use than others.</p><p>And I have a second question for Bakker.  (2) On what basis does he assume that I am any more certain, or any less skeptical, than he is?</p><p>BONUS ANSWERS: Eric asked: <i>If human action on earth is of importance, and that action is shaped by belief (both facts asserted in his answer) then that belief and the correctness thereof must “matter.”</i></p><p>When did I say that human action on Earth is of any importance?  I implied precisely the opposite in citing Mises.  Human action only matters, it only CAN matter, in the subjective sense, so the belief and the correctness of the belief can only matter to the acting man, except in that there happen to be any material consequences of those actions to others.</p><p><i>How do we KNOW if we are Acting Correctly?</i></p><p>By ascertaining if the consequences of the action accord harmoniously with the results predicted.  Or, if you prefer, by their fruits you shall know them.</p></div>",
  "content_text": "In which R. Scott Bakker demonstrates that there is\nmore fantasy in his philosophy\nthan there is philosophy in his fantasy.\nBy way of clarification, no one asked him about the ‘absolute’ of anything. I’m not sure I understand, otherwise (and would welcome clarification). Is he saying he doesn’t believe in the question? Or is he saying the truth or falsity doesn’t matter, so long as people do what he wants them to do? Or is he actually biting the bullet, saying, ‘I really don’t know whether my claims are right or wrong, but I don’t care one way or another, so long as people seem to believe me.”\nOr is he simply avoiding the question once again.\nIt appears I have to write very slowly or Bakker will be again unable to follow what everyone else has understood.  I initially ignored the question because I thought it was rhetorical.  After he started suggesting I was avoiding it, I gave the only answer I considered to be meaningful.  But what I am saying, and what I have believed from the start, is that it is a stupid and irrelevant question.  There is no such thing as “certainty” and Bakker’s entire certainty/uncertainty framework is a false one.  Not only are there no “Grand Prize Winners” in the sense that he means it, I don’t know a single person who genuinely believes they are a Grand Prize Winner either.  The basic philosophical framework he has presented is as fictitious as his novels.\nHere is my return question for him.  (1) What are ten historical examples of “certainty” causing more material harm than uncertainty?\nNow, if I were a follower of Theo, I would like to know what the hell he’s talking about. Why should they take someone who doesn’t care about the accuracy of his views of faith seriously? Or, if he does take the accuracy (as opposed to the consequences) of his claims seriously, why should they trust the claims of someone who doesn’t take the likelihood they are wrong seriously.\nThey take me seriously because I have a strong track record of being much more accurate than the average commentator or media expert over nearly a decade of writing columns.  When your predictions help people make 475% on their investments during a bear market, help them avoid going underwater on their homes by correctly nailing housing prices within $300 one year in advance, and correctly anticipate a global financial crisis several months in advance, it tends to give you a certain amount of credibility.  I am always aware that there is a\npossibility\nI am wrong.  Anyone with an IQ over 80 is.  But Bakker can’t seem to grasp the concept of\nprobability\n.  Everyone is wrong sometimes.  Pataki anyone?  The Lizard Queen?  But the verifiable fact of the matter is that I am wrong far less often than most despite the predictive risks I take, and when I am wrong I am still usually in the general vicinity.\nFor example, I predicted that Obama would not be the 2012 Democratic nominee over one year ago.  I said he would be encouraged not to run by the Democratic Party elders.  At the time, everyone thought that was absolutely insane and the prediction was much mocked by many among the Dread Ilk.  While I still may be turn out to be wrong, no one is laughing at it anymore, least of all Obama’s advisors, now that the Washington Post is reporting the very activity that I predicted last year.\nOne of the things that seems to make democracy such an effective form of governance, for instance, is its capacity for reform, for adapting to new social realities. It’s ugly, it’s prone to error, but the institution is designed to eventually get it right.\nBakker must be a historical illiterate.  Cicero knew better than this more than 2,000 years ago.  The American Founding Fathers knew better more than 200 years ago.  Democracy is not “designed to eventually get it right”, it is designed to eventually collapse into dictatorship.  Also, of all the “democracies” in the world, Switzerland is the only one that is even remotely democratic in the proper sense of the term.  Bakker clearly doesn’t understand that modern pseudo-democracies are structured in such a way as to\nprevent\nmeaningful reform and periodically release political pressure while ensuring the continued rule of the political elite.\nFrom De Re Publica:\n“I have reasoned thus on the three forms of government, not looking on them in their disorganized and confused conditions, but in their proper and regular administration. These three particular forms, however, contained in themselves from the first, the faults and defects I have mentioned, but they have still more dangerous vices, for there is not one of these three forms of government, which has not a precipitous and slippery passage down to some proximate abuse. For after that king, whom I have called most admirable, or if you please most endurable—after the amiable Cyrus, we behold the barbarous Phalaris, that model of tyranny, to which the monarchical authority is easily abused by a facile and natural inclination. Alongside of the wise aristocracy of Marseilles, we might exhibit the oligarchical faction of the thirty despots, which once existed at Athens. And among the same Athenians, we can shew you, that when unlimited power was cast into the hands of the people, it inflamed the fury of the multitude, and aggravated that universal licence which ruined their state.”\nThe reason science has so outstripped its competitors boils down to creative flexibility in the face of supercomplexity. Multiple researchers with multiple hypotheses, embedded in a system that selects for accuracy. You never ‘go all in’ – rather, you hedge your bets, always realizing the complexity of things is such that you could very well lose. And you listen closely to those making contrary bets around you, realizing that they are at least as likely to be holding the winning hand as you.\nThis section is simply ridiculous from start to finish.  Bakker obviously knows little about how science and scientists actually operate.  Scientistry is a corrupt and politicized institution that makes increasingly little use of scientody.  He needs to read\nThe Structure of Scientific Revolutions\nas he clearly isn’t familiar with the problem of scientific paradigms, nor does he realize that the only reason science has been so astonishingly successful in the West is because it has ridden on the back of free enterprise and technological development.  The Soviet Union devoted a higher percentage of its GDP to science than the West did and was still driving 1950s automobiles forty years later.\nIt may be true that we are all possessed of three-pound brains.  It is also empirically and historically demonstrable that some individuals put those three pounds to more systematic and effective use than others.\nAnd I have a second question for Bakker.  (2) On what basis does he assume that I am any more certain, or any less skeptical, than he is?\nBONUS ANSWERS: Eric asked:\nIf human action on earth is of importance, and that action is shaped by belief (both facts asserted in his answer) then that belief and the correctness thereof must “matter.”\nWhen did I say that human action on Earth is of any importance?  I implied precisely the opposite in citing Mises.  Human action only matters, it only CAN matter, in the subjective sense, so the belief and the correctness of the belief can only matter to the acting man, except in that there happen to be any material consequences of those actions to others.\nHow do we KNOW if we are Acting Correctly?\nBy ascertaining if the consequences of the action accord harmoniously with the results predicted.  Or, if you prefer, by their fruits you shall know them.",
  "tags": [
    "philosophy",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-20T18:40:00+00:00"
}