{
  "url": "https://voxday.net/2011/08/01/when-im-wrong-it-proves-im-rig/",
  "scraped_at": "2025-12-13T23:17:40.192667",
  "title": "“When I’m wrong it proves I’m right”",
  "date_display": "August 1, 2011",
  "date_iso": "2011-08-01T14:00:00+00:00",
  "date_from_url": "2011-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who make ridiculous assertions that amount to this line of logic should not find it terribly hard to understand why those of us who actually possess working memories tend to be just a little bit skeptical about the reliability of whatever their current positions happen to be.  I know you are probably as shocked as I am that <a href=\"http://scienceblogs.com/pharyngula/2011/07/an_entirely_predictable_outcom.php\">the Fowl Atheist</a> is claiming that the “reevaluation” of <i>Archaeopteryx</i>, the fossil that has been hailed as literally rock-solid proof of evolution since I was being subjected to evolutionary propaganda back in elementary school, doesn’t mean that the legitimacy of either archeological science or TE(p)NSBMGDaGF should be called into question:</p><blockquote><p>We all knew this was coming. Xiaotingia, the newly described feathered dinosaur, suggests a reevaluation of the taxonomic status of Archaeopteryx, so the creationists are stumbling all over each other to crow about the failure of science…which doesn’t make any sense, since reconsidering hypotheses in the light of new evidence is exactly what science is supposed to do.</p></blockquote><p>That’s an interesting claim.  Precisely when has any evolutionist reconsidered either a) the basic hypothesis that species evolve into different species through natural selection or b) the corollary and requisite hypothesis that life evolved from non-life, as a result of the falsity of one, ten, or even a hundred predictions that relied upon one or both of them?  If it weren’t for DNA, which was not discovered or developed with any assistance from evolutionary theory, evolutionary biology would already be openly recognized by every intelligent, rational, science-literate individual as being about as useful as phrenology and astrology.</p><p>Darwinian biologists are very much like Keynesian economists.  It doesn’t matter how many times their predictions fail.  It doesn’t matter how often their models are proven to be wildly wrong.  It doesn’t matter how many times they have been wrong in the past even with the benefit of margins of error consisting of millions of years.  They continue to insist that their position is based on evidence <i>even when the evidence demonstrates precisely the opposite</i> of what they have been claiming.</p><p>An evolutionist is one who is continually convinced, despite past experience, that adding just one more series of magic evolutionary epicycles will somehow make the whole system finally begin to function in a coherent and reliably predictive manner.</p><p>In other, somewhat tangential news, we have discovered that the New Atheist Circle Jerk continues unabated.  Seriously, you can’t even <i>parody</i> these charlatans without them <a href=\"http://scienceblogs.com/pharyngula/2011/07/the_2011_richard_dawkins_award.php\">one-upping you</a>.</p><blockquote><p><b>The 2011 Richard Dawkins Award goes to…</b><br> Category: Godlessness</br></p><p>Who else but Christopher Hitchens?</p></blockquote><p>What a beautiful, beautiful thing.  If I had dared to invent the idea, no one would have believed me.  Out of nearly seven billion people on the planet, Richard Dawkins chose to give out his eponymous award to the third-most amusing recipient.  Second, you understand, would have been awarding it to himself.  But to maximize our collective utility on the happiness-suffering metric, though, he would have had to present the award to Rebecca Watson.</p></div>",
  "content_text": "Those who make ridiculous assertions that amount to this line of logic should not find it terribly hard to understand why those of us who actually possess working memories tend to be just a little bit skeptical about the reliability of whatever their current positions happen to be.  I know you are probably as shocked as I am that\nthe Fowl Atheist\nis claiming that the “reevaluation” of\nArchaeopteryx\n, the fossil that has been hailed as literally rock-solid proof of evolution since I was being subjected to evolutionary propaganda back in elementary school, doesn’t mean that the legitimacy of either archeological science or TE(p)NSBMGDaGF should be called into question:\nWe all knew this was coming. Xiaotingia, the newly described feathered dinosaur, suggests a reevaluation of the taxonomic status of Archaeopteryx, so the creationists are stumbling all over each other to crow about the failure of science…which doesn’t make any sense, since reconsidering hypotheses in the light of new evidence is exactly what science is supposed to do.\nThat’s an interesting claim.  Precisely when has any evolutionist reconsidered either a) the basic hypothesis that species evolve into different species through natural selection or b) the corollary and requisite hypothesis that life evolved from non-life, as a result of the falsity of one, ten, or even a hundred predictions that relied upon one or both of them?  If it weren’t for DNA, which was not discovered or developed with any assistance from evolutionary theory, evolutionary biology would already be openly recognized by every intelligent, rational, science-literate individual as being about as useful as phrenology and astrology.\nDarwinian biologists are very much like Keynesian economists.  It doesn’t matter how many times their predictions fail.  It doesn’t matter how often their models are proven to be wildly wrong.  It doesn’t matter how many times they have been wrong in the past even with the benefit of margins of error consisting of millions of years.  They continue to insist that their position is based on evidence\neven when the evidence demonstrates precisely the opposite\nof what they have been claiming.\nAn evolutionist is one who is continually convinced, despite past experience, that adding just one more series of magic evolutionary epicycles will somehow make the whole system finally begin to function in a coherent and reliably predictive manner.\nIn other, somewhat tangential news, we have discovered that the New Atheist Circle Jerk continues unabated.  Seriously, you can’t even\nparody\nthese charlatans without them\none-upping you\n.\nThe 2011 Richard Dawkins Award goes to…\nCategory: Godlessness\nWho else but Christopher Hitchens?\nWhat a beautiful, beautiful thing.  If I had dared to invent the idea, no one would have believed me.  Out of nearly seven billion people on the planet, Richard Dawkins chose to give out his eponymous award to the third-most amusing recipient.  Second, you understand, would have been awarding it to himself.  But to maximize our collective utility on the happiness-suffering metric, though, he would have had to present the award to Rebecca Watson.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-01T13:00:00+00:00"
}