{
  "url": "https://voxday.net/2011/08/13/you-cannot-be-serious/",
  "scraped_at": "2025-12-13T23:18:54.690198",
  "title": "You CANNOT be serious!",
  "date_display": "August 13, 2011",
  "date_iso": "2011-08-13T12:18:00+00:00",
  "date_from_url": "2011-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The NPR readership’s <a href=\"http://www.npr.org/2011/08/11/139085843/your-picks-top-100-science-fiction-fantasy-books\">top 100 SF/F novels</a>:</p><p>1.  The Lord of the Rings<br> 2.  The Hitchhiker’s Guide to the Galaxy<br> 3.  Ender’s Game<br> 4.  Dune<br> 5.  A Song of Fire and Ice<br> 6.  1984<br> 7.  Fahrenheit 451<br> 8.  The Foundation trilogy<br> 9.  Brave New World<br> 10. American Gods</br></br></br></br></br></br></br></br></br></p><p>It’s a reasonable start, as you can list the top ten without having to bother mentioning the authors.  But which one of these is not like the others?  Neil Gaiman is good, but <i>American Gods</i> does not merit inclusion at that level.  And either <i>Dandelion Wine</i> or <i>The Illustrated Man</i> should be in <i>Fahrenheit 451</i>‘s place.  I think <i>A Song of Fire and Ice</i> is also overrated, especially in light of the way the series has declined over the last two books.  Top 100 yes, top 10, no way.  So is <i>Hitchhiker’s Guide to the Galaxy</i>; it’s top 50 material, not top 10.  I quite like Douglas Adams, but I don’t see how anyone can possibly argue that Hitchhiker’s is better, in any way except that it is funnier, than <i>Watership Down</i>.  In fact, I don’t even consider Hitchhiker’s to be Douglas Adams’s best work; his Dirk Gently novels are much superior.</p><p>The astonishing omissions, not from the top 10, but from the entire list, are <i>The Chronicles of Narnia</i> – absolute top 10, if not top 5 – Susan Cooper’s <i>The Dark is Rising</i> and Lloyd Alexander’s <i>The Chronicles of Prydain</i>.  Piers Anthony’s <i>Xanth </i>is far too low, and while Terry Pratchett shows up twice with two Discworld novels – why, when every other series is listed by series – the best Discworld novel by far is <i>Night Watch</i>.  And no Lovecraft?  Madness.  No Silverberg?  A little more explicable, but still.  No Guy Gavriel Kay?  Understandable, but still a serious omission.  It was good to see Zelazny there, but I would rank his <i>Lord of Light</i> higher than <i>Amber</i>.</p><p>It was interesting to see both the <i>Harry Potter</i> and <i>Twilight </i>series missing from the list.  I very much agree with leaving them off it, but I was still surprised they weren’t there.  I was, however, mystified to see Jim Butcher’s <i>Codex Alera</i> on the list while <i>The Dresden Files</i> was omitted.  I enjoyed the former, but there is no question that the latter is the better series.  And how does <i>The Silmarillion</i> make the list while <i>The Hobbit</i> doesn’t?  And finally, there is no way Robert Jordan’s ghastly <i>The Wheel of Time</i> series should be on the list at all, much less ranked at #12.</p></div>",
  "content_text": "The NPR readership’s\ntop 100 SF/F novels\n:\n1.  The Lord of the Rings\n2.  The Hitchhiker’s Guide to the Galaxy\n3.  Ender’s Game\n4.  Dune\n5.  A Song of Fire and Ice\n6.  1984\n7.  Fahrenheit 451\n8.  The Foundation trilogy\n9.  Brave New World\n10. American Gods\nIt’s a reasonable start, as you can list the top ten without having to bother mentioning the authors.  But which one of these is not like the others?  Neil Gaiman is good, but\nAmerican Gods\ndoes not merit inclusion at that level.  And either\nDandelion Wine\nor\nThe Illustrated Man\nshould be in\nFahrenheit 451\n‘s place.  I think\nA Song of Fire and Ice\nis also overrated, especially in light of the way the series has declined over the last two books.  Top 100 yes, top 10, no way.  So is\nHitchhiker’s Guide to the Galaxy\n; it’s top 50 material, not top 10.  I quite like Douglas Adams, but I don’t see how anyone can possibly argue that Hitchhiker’s is better, in any way except that it is funnier, than\nWatership Down\n.  In fact, I don’t even consider Hitchhiker’s to be Douglas Adams’s best work; his Dirk Gently novels are much superior.\nThe astonishing omissions, not from the top 10, but from the entire list, are\nThe Chronicles of Narnia\n– absolute top 10, if not top 5 – Susan Cooper’s\nThe Dark is Rising\nand Lloyd Alexander’s\nThe Chronicles of Prydain\n.  Piers Anthony’s\nXanth\nis far too low, and while Terry Pratchett shows up twice with two Discworld novels – why, when every other series is listed by series – the best Discworld novel by far is\nNight Watch\n.  And no Lovecraft?  Madness.  No Silverberg?  A little more explicable, but still.  No Guy Gavriel Kay?  Understandable, but still a serious omission.  It was good to see Zelazny there, but I would rank his\nLord of Light\nhigher than\nAmber\n.\nIt was interesting to see both the\nHarry Potter\nand\nTwilight\nseries missing from the list.  I very much agree with leaving them off it, but I was still surprised they weren’t there.  I was, however, mystified to see Jim Butcher’s\nCodex Alera\non the list while\nThe Dresden Files\nwas omitted.  I enjoyed the former, but there is no question that the latter is the better series.  And how does\nThe Silmarillion\nmake the list while\nThe Hobbit\ndoesn’t?  And finally, there is no way Robert Jordan’s ghastly\nThe Wheel of Time\nseries should be on the list at all, much less ranked at #12.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-08-13T11:18:00+00:00"
}