{
  "url": "https://voxday.net/2015/09/26/200-reviews/",
  "scraped_at": "2025-12-17T17:28:05.070838",
  "title": "200 reviews",
  "date_display": "September 26, 2015",
  "date_iso": "2015-09-26T20:56:00+00:00",
  "date_from_url": "2015-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never had a book hit that many Amazon reviews before, so to see it happen in a month is rather pleasant. It’s also good to see that interest has remained high enough to keep <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><b><i>SJWs Always Lie</i></b></a> at #1 in the Political Philosophy category for the whole month since it was first published.</p><p>And speaking of reviews, Jan Weir of American Renaissance <a href=\"http://www.amren.com/features/2015/09/a-field-guide-to-sjws/\">reviewed <b><i>SJWs Always Lie</i></b></a>. It’s a pretty favorable review, although the reviewer is subject to what I think of as Clemens Disease; I’m considerably less famous than Bono, after all, but I don’t often see articles about U2 that say “The pseudonymous singer, Bono (real name: Paul <strike>Hewitt</strike> Hewson). Anyhow, to the review:</p><blockquote class=\"tr_bq\"><p> While SJWs Always Lie is a highly entertaining read, I don’t want to leave the impression that it’s just a witty romp through the SJW jungle. It’s deadly serious about the damage SJWs can do to you and me as we try to get through our workday. One of their favorite venues for mischief-making is the Human Resources department, particularly in large companies that like to remind you from time to time that they have something called a Code of Conduct. This code is invariably vague, with lots of soothing phrases about commitment to equality, a “safe” workplace, and of course “diversity.” This is an open-ended invitation to all sorts of SJW mischief, which often takes the form of a whispering campaign against you, in which both accusation and accuser remain concealed from view. This has happened to the author, who eloquently describes the pit-of-the-stomach anxiety and confusion of being attacked by unseen assailants.</p><p>How to respond? Probably the most valuable part of the book is about what to do and not do if you’re attacked. Don’t apologize. Don’t resign. Fight back.</p><p><i>    Target the enemy at every opportunity. Hit them wherever they show themselves vulnerable. Play as dirty as your conscience will permit. Undermine them, sabotage them, and discredit them. Be ruthless and show them absolutely no mercy. This is not the time for Christian forgiveness because these are people who have not repented, these are people who are trying to destroy you and are quite willing to harm your family and your children in the process. Take them down and take them out without hesitation. If you have any SJWs working under you, fire them . . . .</i></p><p>Mr. Beale also proposes a long-term plan for SJW-proofing our society. I found this the most intriguing part of the book. It displays a level of sociological insight and gravitas that is quite different from the light, snarky tone found in other parts of the book and promoted on the book’s cartoonish cover. The author analyzes the deep rot that the SJWs have caused our institutions, explains how we have made ourselves vulnerable to their control, and tells what we can do to end this vulnerability. His suggestions are too extensive to summarize here, but inter alia, we are enjoined to: Build alternative institutions (e.g., home school your children, create alternatives to SJW-infested Wikipedia); defund and destroy their propaganda centers (e.g., ignore their entertainment media); deny them employment; keep them out of your organizations.</p><p>It’s a bracing call-to-arms, based on an honest concept of justice.</p></blockquote><p>I would be remiss if I failed to mention that, like it or not, I am an American Indian (one brother is out on the rez this week, as it happens), and my great-grandfather did ride with Villa. Damn near got killed with him too. In fact, I was talking to one of my brothers today and he told me a funny story about how he was out raking his lawn recently and someone from his wealthy neighborhood driving by stopped his car and tried to hire him to mow his lawn. My brother wasn’t at all offended; when the guy tried to apologize, he said, “why would I be upset that you think I look Mexican? I <i>am </i>Mexican.”</p><p>I told him that he should have burst out crying and started a Patreon account; apparently that is the correct SJW-approved response to microaggressions these days.</p><p>Despite his height, that brother looks the most Mexican in the family; his equally tall doppleganger works at a Mexican supply store at which I bought a tortilla press last year. Ender actually thought it was his uncle for a moment and was extremely confused about what he was doing there. I look the most Anglo, obviously, whereas another brother looks sufficiently Indian that he was invited to join the American Indian group at his college by strangers.</p><p>Having written a book about speech and thought police, perhaps I’ll have to write a book about race police one of these days.</p></div>",
  "content_text": "I’ve never had a book hit that many Amazon reviews before, so to see it happen in a month is rather pleasant. It’s also good to see that interest has remained high enough to keep\nSJWs Always Lie\nat #1 in the Political Philosophy category for the whole month since it was first published.\nAnd speaking of reviews, Jan Weir of American Renaissance\nreviewed\nSJWs Always Lie\n. It’s a pretty favorable review, although the reviewer is subject to what I think of as Clemens Disease; I’m considerably less famous than Bono, after all, but I don’t often see articles about U2 that say “The pseudonymous singer, Bono (real name: Paul\nHewitt\nHewson). Anyhow, to the review:\nWhile SJWs Always Lie is a highly entertaining read, I don’t want to leave the impression that it’s just a witty romp through the SJW jungle. It’s deadly serious about the damage SJWs can do to you and me as we try to get through our workday. One of their favorite venues for mischief-making is the Human Resources department, particularly in large companies that like to remind you from time to time that they have something called a Code of Conduct. This code is invariably vague, with lots of soothing phrases about commitment to equality, a “safe” workplace, and of course “diversity.” This is an open-ended invitation to all sorts of SJW mischief, which often takes the form of a whispering campaign against you, in which both accusation and accuser remain concealed from view. This has happened to the author, who eloquently describes the pit-of-the-stomach anxiety and confusion of being attacked by unseen assailants.\nHow to respond? Probably the most valuable part of the book is about what to do and not do if you’re attacked. Don’t apologize. Don’t resign. Fight back.\nTarget the enemy at every opportunity. Hit them wherever they show themselves vulnerable. Play as dirty as your conscience will permit. Undermine them, sabotage them, and discredit them. Be ruthless and show them absolutely no mercy. This is not the time for Christian forgiveness because these are people who have not repented, these are people who are trying to destroy you and are quite willing to harm your family and your children in the process. Take them down and take them out without hesitation. If you have any SJWs working under you, fire them . . . .\nMr. Beale also proposes a long-term plan for SJW-proofing our society. I found this the most intriguing part of the book. It displays a level of sociological insight and gravitas that is quite different from the light, snarky tone found in other parts of the book and promoted on the book’s cartoonish cover. The author analyzes the deep rot that the SJWs have caused our institutions, explains how we have made ourselves vulnerable to their control, and tells what we can do to end this vulnerability. His suggestions are too extensive to summarize here, but inter alia, we are enjoined to: Build alternative institutions (e.g., home school your children, create alternatives to SJW-infested Wikipedia); defund and destroy their propaganda centers (e.g., ignore their entertainment media); deny them employment; keep them out of your organizations.\nIt’s a bracing call-to-arms, based on an honest concept of justice.\nI would be remiss if I failed to mention that, like it or not, I am an American Indian (one brother is out on the rez this week, as it happens), and my great-grandfather did ride with Villa. Damn near got killed with him too. In fact, I was talking to one of my brothers today and he told me a funny story about how he was out raking his lawn recently and someone from his wealthy neighborhood driving by stopped his car and tried to hire him to mow his lawn. My brother wasn’t at all offended; when the guy tried to apologize, he said, “why would I be upset that you think I look Mexican? I\nam\nMexican.”\nI told him that he should have burst out crying and started a Patreon account; apparently that is the correct SJW-approved response to microaggressions these days.\nDespite his height, that brother looks the most Mexican in the family; his equally tall doppleganger works at a Mexican supply store at which I bought a tortilla press last year. Ender actually thought it was his uncle for a moment and was extremely confused about what he was doing there. I look the most Anglo, obviously, whereas another brother looks sufficiently Indian that he was invited to join the American Indian group at his college by strangers.\nHaving written a book about speech and thought police, perhaps I’ll have to write a book about race police one of these days.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-26T19:56:00+00:00"
}