{
  "url": "https://voxday.net/2015/09/02/allum-bokhari-reports-on-cultural-war/",
  "scraped_at": "2025-12-17T17:25:19.392831",
  "title": "Scalzi 451",
  "date_display": "September 2, 2015",
  "date_iso": "2015-09-02T21:11:00+00:00",
  "date_from_url": "2015-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://2.bp.blogspot.com/-FyqXJKW1S0k/VedlCsIST-I/AAAAAAAABeE/uVp3a289bbs/s1600/scalzi451.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"411\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/09/scalzi451.jpg\" width=\"640\"/></a></div><p> Allum Bokhari reports on the cultural war <a href=\"http://www.breitbart.com/big-hollywood/2015/09/02/vox-day-book-turns-amazon-kindle-store-into-battleground/\">burning up the Kindle Store</a> for Breitbart.<br/></p><blockquote class=\"tr_bq\"><p> The online culture wars have moved out of comment sections and into Amazon’s Kindle Store.Following the publication of a book by the controversial sci-fi<br> author Vox Day, two parody e-books surged to the top<br> of the store’s top-100 rankings. The first book was a parody of Day’s<br> work, while the other (which has now been removed from Amazon) mocked<br> John Scalzi, one of Day’s critics.</br></br></br></br></p><p>Day’s book is entitled <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i>“SJWs Always Lie: Taking Down the Thought Police”</i></a>,<br> and is intended to be a serious polemic. The book’s summary describes<br> SJWs (Social Justice Warriors — a term for authoritarian progressive<br> activists) as having “plagued mankind for 150 years” and describes how<br> they “invaded one institution of the cultural high ground after<br> another.” It presents itself as a guide to “understanding, anticipating,<br> and surviving SJW attacks.”</br></br></br></br></br></br></p><p>The book includes a foreword from <i>Breitbart</i> associate editor Milo Yiannopoulos and was reviewed positively in the conservative online magazine <i><a href=\"http://www.americanthinker.com/articles/2015/09/fighting_back_against_the_sjws.html\">American Thinker</a>.</i></p><p>Online progressives were not so supportive. Alexandra Erin, a sci-fi<br> writer who described Day’s book as “rehashing old slights”, wrote a<br> short parody of the book for Kindle. Entitled <a href=\"http://www.amazon.com/Scalzi-Popular-Author-Myself-Quite-ebook/dp/B014JSBP7A/ref=zg_bs_156285011_3\"><i>“John<br> Scalzi Is Not A Very Popular Author And I Myself Am Quite Popular: How<br> SJWs Always Lie About Our Comparative Popularity Levels,”</br></br></i></a> the book makes fun of Day’s alleged fixation with the progressive sci-fi author John Scalzi.</br></br></p><p>Scalzi himself appeared to be delighted with the parody,  saying he “loved it already.” He used the book in a <a href=\"http://whatever.scalzi.com/2015/08/27/charity-drive-for-con-or-bust-an-audio-version-of-john-scalzi-is-not-a-very-popular-author-and-i-myself-am-quite-popular-read-by-me/\">fundraising drive</a><br> for a charity promoting diversity at sci-fi conventions, promising to<br> release an audio recording of him reading the book if $2,5000 was raised<br> within three days. The target was successfully met, and<br> Scalzi subsequently uploaded an audio recording.</br></br></br></br></p><p>Supporters of Vox Day responded by releasing their own parody book, entitled <i>“John<br> Scalzi Is A Rapist: Why SJWs Always Lie In Bed Waiting For His Gentle<br> Touch; A Pretty, Pretty Girl Dreams of Her Beloved One While Pondering<br> Gender Identity, Social Justice, and Body Dysmorphia.”</br></br></br></i></p><p>The counter-parody was removed by Amazon today following <a href=\"https://archive.is/up7Zv\">complaints from Scalzi</a>. Prior to its removal, it was the top seller in the “parodies” section of the Kindle store, two places ahead of Erin’s book.</p></blockquote><p>Does Scalzi ever think through the obvious consequences of his actions? I mean, I know I literally wrote the book on it and all, but it was supposed to be RHETORIC. But wow just wow, SJWs really do always double down.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/09/scalzi_bonfire.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/09/scalzi_bonfire.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/09/scalzi_bonfire.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "Allum Bokhari reports on the cultural war\nburning up the Kindle Store\nfor Breitbart.\nThe online culture wars have moved out of comment sections and into Amazon’s Kindle Store.Following the publication of a book by the controversial sci-fi\nauthor Vox Day, two parody e-books surged to the top\nof the store’s top-100 rankings. The first book was a parody of Day’s\nwork, while the other (which has now been removed from Amazon) mocked\nJohn Scalzi, one of Day’s critics.\nDay’s book is entitled\n“SJWs Always Lie: Taking Down the Thought Police”\n,\nand is intended to be a serious polemic. The book’s summary describes\nSJWs (Social Justice Warriors — a term for authoritarian progressive\nactivists) as having “plagued mankind for 150 years” and describes how\nthey “invaded one institution of the cultural high ground after\nanother.” It presents itself as a guide to “understanding, anticipating,\nand surviving SJW attacks.”\nThe book includes a foreword from\nBreitbart\nassociate editor Milo Yiannopoulos and was reviewed positively in the conservative online magazine\nAmerican Thinker\n.\nOnline progressives were not so supportive. Alexandra Erin, a sci-fi\nwriter who described Day’s book as “rehashing old slights”, wrote a\nshort parody of the book for Kindle. Entitled\n“John\nScalzi Is Not A Very Popular Author And I Myself Am Quite Popular: How\nSJWs Always Lie About Our Comparative Popularity Levels,”\nthe book makes fun of Day’s alleged fixation with the progressive sci-fi author John Scalzi.\nScalzi himself appeared to be delighted with the parody,  saying he “loved it already.” He used the book in a\nfundraising drive\nfor a charity promoting diversity at sci-fi conventions, promising to\nrelease an audio recording of him reading the book if $2,5000 was raised\nwithin three days. The target was successfully met, and\nScalzi subsequently uploaded an audio recording.\nSupporters of Vox Day responded by releasing their own parody book, entitled\n“John\nScalzi Is A Rapist: Why SJWs Always Lie In Bed Waiting For His Gentle\nTouch; A Pretty, Pretty Girl Dreams of Her Beloved One While Pondering\nGender Identity, Social Justice, and Body Dysmorphia.”\nThe counter-parody was removed by Amazon today following\ncomplaints from Scalzi\n. Prior to its removal, it was the top seller in the “parodies” section of the Kindle store, two places ahead of Erin’s book.\nDoes Scalzi ever think through the obvious consequences of his actions? I mean, I know I literally wrote the book on it and all, but it was supposed to be RHETORIC. But wow just wow, SJWs really do always double down.",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-02T20:11:00+00:00"
}