{
  "url": "https://voxday.net/2015/09/23/back-from-dead-on-amazon/",
  "scraped_at": "2025-12-17T17:27:42.949886",
  "title": "Back From the Dead on Amazon",
  "date_display": "September 23, 2015",
  "date_iso": "2015-09-23T17:25:00+00:00",
  "date_from_url": "2015-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://3.bp.blogspot.com/-wH5yB_8C7bg/VgAskGyIH2I/AAAAAAAABgA/qRuJ0TGn540/s1600/TSCB_480.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/09/TSCB_480.jpg\" width=\"194\"/></a><a href=\"http://www.amazon.com/Back-Dead-Stars-Came-Book-ebook/dp/B015QBDN5Q/\"><i><b>The Stars Came Back Book One: Back From the Dead </b></i></a>by Rolf Nelson is now available on Amazon and at <a href=\"http://www.castaliahouse.com/downloads/back-from-the-dead/\">Castalia House</a> for $4.99.</p><p>Helton Strom is just a guy between contracts when he runs afoul of both<br> planetary officialdom and space pirates. He is left with nothing but the<br> clothes on his back, and not even a citizenship to his name. Is the<br> ancient, broken-down military surplus starship and the young lady living<br> aboard it the key to a bright future, or will his repairs and new<br> mercenary friends reawaken the demons lurking in the ship’s murky and<br> lethal past?</br></br></br></br></br></br></p><p><a href=\"http://www.amazon.com/Back-Dead-Stars-Came-Book-ebook/dp/B015QBDN5Q/\"><i><b>Back From the Dead</b></i></a> is the first book in <i>The Stars Came Back</i> series.<br> It is a space western, the story of regular folks just trying stay<br> alive, seeking work to earn money for repairs to get to the next job,<br> with no shortage of action and adventure along the way. It is military<br> sci-fi, featuring a company of mercenaries, spaceship combat, mortar and<br> rifle combat, spear-and-shield battle, and post-traumatic stress<br> disorder. And it is a philosophical investigation, pondering everything<br> from the lessons of Achilles to how one stops a bar fight with earplugs.</br></br></br></br></br></br></br></p><p>If you have already read it, I hope you will consider reviewing it on Amazon.</p></div>",
  "content_text": "The Stars Came Back Book One: Back From the Dead\nby Rolf Nelson is now available on Amazon and at\nCastalia House\nfor $4.99.\nHelton Strom is just a guy between contracts when he runs afoul of both\nplanetary officialdom and space pirates. He is left with nothing but the\nclothes on his back, and not even a citizenship to his name. Is the\nancient, broken-down military surplus starship and the young lady living\naboard it the key to a bright future, or will his repairs and new\nmercenary friends reawaken the demons lurking in the ship’s murky and\nlethal past?\nBack From the Dead\nis the first book in\nThe Stars Came Back\nseries.\nIt is a space western, the story of regular folks just trying stay\nalive, seeking work to earn money for repairs to get to the next job,\nwith no shortage of action and adventure along the way. It is military\nsci-fi, featuring a company of mercenaries, spaceship combat, mortar and\nrifle combat, spear-and-shield battle, and post-traumatic stress\ndisorder. And it is a philosophical investigation, pondering everything\nfrom the lessons of Achilles to how one stops a bar fight with earplugs.\nIf you have already read it, I hope you will consider reviewing it on Amazon.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-23T16:25:00+00:00"
}