{
  "url": "https://voxday.net/2015/09/21/back-from-dead/",
  "scraped_at": "2025-12-17T17:27:28.337505",
  "title": "Back From the Dead",
  "date_display": "September 21, 2015",
  "date_iso": "2015-09-21T19:00:00+00:00",
  "date_from_url": "2015-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/09/TSCB_480-1.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/09/TSCB_480-1.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/09/TSCB_480-1.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Helton Strom  is just a guy between contracts when he runs afoul of both planetary officialdom<br> and space pirates. He is left with nothing but the clothes on his back,<br> and not even a citizenship to his name. Is the ancient, broken-down<br> military-surplus starship and the young lady living aboard it the key to<br> a bright future, or will his repairs and new mercenary friends awaken<br> the demons lurking in the ship’s murky and lethal past?</br></br></br></br></br></p><p><a href=\"http://www.castaliahouse.com/downloads/back-from-the-dead/\"><i><b>THE STARS CAME BACK: BACK FROM THE DEAD</b></i></a> is part space-western, the<br> story of folks just trying stay alive, seeking work to earn money for<br> repairs to get to the next job, with no shortage of action and adventure<br> along the way. It is military sci-fi, featuring a company of<br> mercenaries, spaceship combat, mortar and rifle combat, spear-and-shield<br> battle, and post-traumatic stress disorder. And it is a philosophical<br> investigation, pondering everything from the lessons of Achilles to how<br> one stops a bar fight with earplugs.</br></br></br></br></br></br></br></p><p><a href=\"http://www.castaliahouse.com/downloads/back-from-the-dead/\"><i><b>BACK FROM THE DEAD</b></i></a> is the prose rewrite of the first half of the screenplay-format version of the original <a href=\"http://www.amazon.com/Stars-Came-Back-Rolf-Nelson-ebook/dp/B00J3F8Q0O\"><b><i>THE STARS CAME BACK</i></b></a>. Today and tomorrow we are making it available for only $1.99 for anyone who previously purchased the screenplay-format version but would like to read the prose version as well. It is available in both EPUB and Kindle formats. 235 pages, DRM-free.</p><p>Beginning Wednesday, it will be available for $4.99 from Amazon.</p></div>",
  "content_text": "Helton Strom  is just a guy between contracts when he runs afoul of both planetary officialdom\nand space pirates. He is left with nothing but the clothes on his back,\nand not even a citizenship to his name. Is the ancient, broken-down\nmilitary-surplus starship and the young lady living aboard it the key to\na bright future, or will his repairs and new mercenary friends awaken\nthe demons lurking in the ship’s murky and lethal past?\nTHE STARS CAME BACK: BACK FROM THE DEAD\nis part space-western, the\nstory of folks just trying stay alive, seeking work to earn money for\nrepairs to get to the next job, with no shortage of action and adventure\nalong the way. It is military sci-fi, featuring a company of\nmercenaries, spaceship combat, mortar and rifle combat, spear-and-shield\nbattle, and post-traumatic stress disorder. And it is a philosophical\ninvestigation, pondering everything from the lessons of Achilles to how\none stops a bar fight with earplugs.\nBACK FROM THE DEAD\nis the prose rewrite of the first half of the screenplay-format version of the original\nTHE STARS CAME BACK\n. Today and tomorrow we are making it available for only $1.99 for anyone who previously purchased the screenplay-format version but would like to read the prose version as well. It is available in both EPUB and Kindle formats. 235 pages, DRM-free.\nBeginning Wednesday, it will be available for $4.99 from Amazon.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2015-09-21T18:00:00+00:00"
}