{
  "url": "https://voxday.net/2015/09/02/building-next-nazis/",
  "scraped_at": "2025-12-17T17:25:11.108285",
  "title": "Building the next Nazis",
  "date_display": "September 2, 2015",
  "date_iso": "2015-09-02T08:01:00+00:00",
  "date_from_url": "2015-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When the ultra-nationalists take power in Europe, it is the “open borders” advocates and “save the poor refugees” advocates <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/italy/11834743/Murder-of-elderly-couple-in-Sicily-fuels-Italys-growing-anti-immigrant-sentiment.html\">who will be responsible</a>. And we’ll all be lucky if they settle for mass deportations:</p><blockquote class=\"tr_bq\"><p> Italy’s simmering anti-immigrant sentiment has been stoked by the murder of an elderly couple in their home in Sicily, allegedly by an African asylum seeker. Mamadou Kamara, an 18-year-old from the Ivory Coast, allegedly slit the throat of Vincenzo Solano, 68, and then attacked his Spanish-born wife, Mercedes Ibanez, 70.</p><p>Ms Ibanez fell to her death from a second-floor balcony, during a robbery that turned violent.</p><p>Mr Kamara is one of thousands of migrants and refugees living at a vast reception centre at nearby Mineo, in south-eastern Sicily.</p><p>They are accommodated there after arriving by boat from Libya, and wait sometimes for months to have their asylum applications assessed.</p><p>The migrants are allowed to come and go freely from the facility, a former US military base where prostitution, links with organised crime and the trade in illicit goods is said to be rife.</p><p>Mr Kamara, who was rescued in the Mediterranean on June 8 and brought with other migrants to the port of Catania in Sicily, allegedly broke into the pensioners’ flat in the village of Palagonia, six miles away, and slit the throat of Mr Solano….Patience is wearing thin among many Italians, with some of the country’s 20 regions refusing to accommodate any more migrants and centre-Right parties accusing the centre-Left government of Matteo Renzi, the prime minister, of having lost control of the country’s borders.</p></blockquote><p>I think we’re two election cycles away from the end of the pro-EU governments. They may end up shutting down Schengen and taking away the welcome mats, but by then, it will be too little, too late. The anti-immigrant sentiment is rapidly approaching a full boil; mass immigration is invasion. As you will see in an essay that appears in <i>Riding the Red Horse V2</i>, mass immigration is invasion. Mass immigration is occupation. Mass immigration is war.</p></div>",
  "content_text": "When the ultra-nationalists take power in Europe, it is the “open borders” advocates and “save the poor refugees” advocates\nwho will be responsible\n. And we’ll all be lucky if they settle for mass deportations:\nItaly’s simmering anti-immigrant sentiment has been stoked by the murder of an elderly couple in their home in Sicily, allegedly by an African asylum seeker. Mamadou Kamara, an 18-year-old from the Ivory Coast, allegedly slit the throat of Vincenzo Solano, 68, and then attacked his Spanish-born wife, Mercedes Ibanez, 70.\nMs Ibanez fell to her death from a second-floor balcony, during a robbery that turned violent.\nMr Kamara is one of thousands of migrants and refugees living at a vast reception centre at nearby Mineo, in south-eastern Sicily.\nThey are accommodated there after arriving by boat from Libya, and wait sometimes for months to have their asylum applications assessed.\nThe migrants are allowed to come and go freely from the facility, a former US military base where prostitution, links with organised crime and the trade in illicit goods is said to be rife.\nMr Kamara, who was rescued in the Mediterranean on June 8 and brought with other migrants to the port of Catania in Sicily, allegedly broke into the pensioners’ flat in the village of Palagonia, six miles away, and slit the throat of Mr Solano….Patience is wearing thin among many Italians, with some of the country’s 20 regions refusing to accommodate any more migrants and centre-Right parties accusing the centre-Left government of Matteo Renzi, the prime minister, of having lost control of the country’s borders.\nI think we’re two election cycles away from the end of the pro-EU governments. They may end up shutting down Schengen and taking away the welcome mats, but by then, it will be too little, too late. The anti-immigrant sentiment is rapidly approaching a full boil; mass immigration is invasion. As you will see in an essay that appears in\nRiding the Red Horse V2\n, mass immigration is invasion. Mass immigration is occupation. Mass immigration is war.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-02T07:01:00+00:00"
}