{
  "url": "https://voxday.net/2015/09/19/conversation-with-cucky/",
  "scraped_at": "2025-12-17T17:27:14.842862",
  "title": "Conversation with a cucky",
  "date_display": "September 19, 2015",
  "date_iso": "2015-09-19T21:25:00+00:00",
  "date_from_url": "2015-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Charles Martin leaps to the defense of David French. A moderate amount of amusement ensues:</p><blockquote class=\"tr_bq\"><p> Vox Day<br> .@JonahNRO @DavidAFrench The fact that you think you can defend a culture WITHOUT defending a race is what makes you #cuckservative.<br> 24 retweets 46 favorites</br></br></p><p>Charlie Martin<br> @voxday @JonahNRO @DavidAFrench the fact that you think that is what makes you an unlikable dolt.</br></p><p>Vox Day<br> So you say. And yet, I’m smarter and more popular than you are. And on this issue, I’m also correct.</br></p><p>Charlie Martin ‏@chasrmartin<br> I might buy more popular.</br></p><p>Vox Day<br> I have lived in Japan, the USA, and Italy. I have learned the languages. Culture is NOT geography.</br></p><p>Charlie Martin<br> What *is* American culture? “We hold these truths to be self-evident….” That’s not a race.</br></p><p>Vox Day<br> It’s English. The Rights of Englishmen. They believed it was universal. No one else did. Or does.</br></p><p>Vox Day<br> That’s like observing bushido is not a race. That’s true, it is the cultural belief of a race.</br></p><p>Charlie Martin<br> Which is why so many Americans then spoke German. And you wonder why I think you’re a dolt.</br></p><p>Vox Day<br> You’re historically illiterate. A smaller percentage spoke German then than speak Spanish now.</br></p><p>Charlie Martin<br> Now, if all Pekinese are dogs, are all dogs Pekinese?</br></p><p>Vox Day<br> No, but moving a Pekinese to Germany will not make it a German Shepherd. Or a good guard dog.</br></p><p>Charlie Martin<br> And, unlike you, I’m not overcompensating for my fears about my intellectual achievements.</br></p><p>Vox Day<br> No, clearly not. You are a modest man with much to be modest about. What causes your overeating?</br></p></blockquote><p>It’s always funny when the guy trying to strike the superior pose reveals that his level of historical knowledge doesn’t rise to the level of Snopes. It’s not hard to understand why they stick to rhetoric. Dialectic, even in 140-character chunks, is obviously beyond them.</p><p>It’s also informative, because it demonstrates that one doesn’t have to be an SJW to be prone to utilizing SJW-style tactics and rhetoric. The “conservative” version is observably more prone to using pseudo-dialectic, but it’s rhetoric all the same.</p><p>And just to be clear, less than 10 percent of the U.S. population ever spoke German; one-third of Pennsylvanians did at its linguistic peak. Spanish speakers now make up about 16 percent of the U.S. population.</p></div>",
  "content_text": "Charles Martin leaps to the defense of David French. A moderate amount of amusement ensues:\nVox Day\n.@JonahNRO @DavidAFrench The fact that you think you can defend a culture WITHOUT defending a race is what makes you #cuckservative.\n24 retweets 46 favorites\nCharlie Martin\n@voxday @JonahNRO @DavidAFrench the fact that you think that is what makes you an unlikable dolt.\nVox Day\nSo you say. And yet, I’m smarter and more popular than you are. And on this issue, I’m also correct.\nCharlie Martin ‏@chasrmartin\nI might buy more popular.\nVox Day\nI have lived in Japan, the USA, and Italy. I have learned the languages. Culture is NOT geography.\nCharlie Martin\nWhat *is* American culture? “We hold these truths to be self-evident….” That’s not a race.\nVox Day\nIt’s English. The Rights of Englishmen. They believed it was universal. No one else did. Or does.\nVox Day\nThat’s like observing bushido is not a race. That’s true, it is the cultural belief of a race.\nCharlie Martin\nWhich is why so many Americans then spoke German. And you wonder why I think you’re a dolt.\nVox Day\nYou’re historically illiterate. A smaller percentage spoke German then than speak Spanish now.\nCharlie Martin\nNow, if all Pekinese are dogs, are all dogs Pekinese?\nVox Day\nNo, but moving a Pekinese to Germany will not make it a German Shepherd. Or a good guard dog.\nCharlie Martin\nAnd, unlike you, I’m not overcompensating for my fears about my intellectual achievements.\nVox Day\nNo, clearly not. You are a modest man with much to be modest about. What causes your overeating?\nIt’s always funny when the guy trying to strike the superior pose reveals that his level of historical knowledge doesn’t rise to the level of Snopes. It’s not hard to understand why they stick to rhetoric. Dialectic, even in 140-character chunks, is obviously beyond them.\nIt’s also informative, because it demonstrates that one doesn’t have to be an SJW to be prone to utilizing SJW-style tactics and rhetoric. The “conservative” version is observably more prone to using pseudo-dialectic, but it’s rhetoric all the same.\nAnd just to be clear, less than 10 percent of the U.S. population ever spoke German; one-third of Pennsylvanians did at its linguistic peak. Spanish speakers now make up about 16 percent of the U.S. population.",
  "tags": [
    "debate",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-19T20:25:00+00:00"
}