{
  "url": "https://voxday.net/2015/09/02/do-you-really-want-to-hurt-me/",
  "scraped_at": "2025-12-17T17:25:16.446105",
  "title": "Do you really want to hurt me?",
  "date_display": "September 2, 2015",
  "date_iso": "2015-09-02T16:00:00+00:00",
  "date_from_url": "2015-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A four-part series on <a href=\"http://therev3.blogspot.com/2015/08/killing-vox-day-part-one.html\">“Killing Vox Day”</a>. And I have to say, despite his purportedly homicidal intentions, the author says nicer things about me than most of my friends and family do.</p><blockquote class=\"tr_bq\"><p> 1). Vox Day is Honest <br> Whatever you think about Vox Day’s opinions, you cannot deny that he states them publicly and consistently in the face of intense criticism.</br></p><p>Being honest does not mean telling the truth per se. It does not mean that what you say is ultimately correct. Honesty means telling the truth as you see it, based on your best understanding of the situation. Vox is acerbic, biased, and prone to fits of exaggeration, but taking these things into account, he generally says what he thinks to the best of his knowledge.</p><p>If anything, I’ve been stunned by how open Vox Day is about his evil, evil plans. In terms of Hugo strategy in particular, his modus operandi seems to be openly declaring his strategy, openly following through with said strategy, and then laughing at his enemies’ confused responses….</p><p>2). Vox Day is Intelligent (and Sane) <br> One of the things I have noticed about detractors of Vox Day is that they assume Vox is either an idiot or insane. Nothing could be further from the truth.</br></p><p>Vox is an extremely sharp person. He knows how to argue successfully. He can set up a consistent argument, pick out flaws in his opponent’s reasoning, and generally defend intellectual positions that few other people can. Why these positions are difficult to defend hardly matters. What matters is that he has the chops to defend them.</p><p>If you need an example of this, just look at the arguments he presents in any given blog post and the bleating of his supporters in the comments. There is a world of difference. And this is why they keep coming back – because he is very, very good at arguing for them. You don’t rally around a person who consistently loses.</p><p>Another good example is this interview on CSPAN where he gives a logical and eloquent argument for the right of American states to secede from the Union. You can tell that the host was expecting an easy kill against a right-wing nut job and ended up with a lively, intelligent debate.</p><p>Vox likes to credit his years of strategy gaming for these abilities (Advanced Squad Leader in particular). Personally, I like to credit years of playing Cooking Mama for my three Michelin stars and Mario marathons for my six-foot vertical jump. The more likely factor is that Vox is an avid reader – he displays a more than passing familiarity with philosophy, statistical modelling, and yes, military history and tactics (particularly Fourth Generation theory – more on this later).</p><p>Again, this is not to say that his arguments are objectively true, only that he does a good job of flustering, discrediting, and generally taking down his opponents. He can think logically, tactically, and worst of all, strategically. He does not win because of the inherent strength of his positions, but because of his technique in defending them. That is not the behavior of a drooling troglodyte or an insane person.</p></blockquote><p>After seeing the first two parts of the series, I sent the author a copy of SJWs Always Lie, as I thought he might find it to be useful in analyzing my thought processes. As I thought he might, I wasn’t surprised to see he posted <a href=\"http://www.amazon.com/gp/customer-reviews/R92W1QQ6DN25Q/ref=cm_cr_pr_viewpnt?ie=UTF8&amp;ASIN=B014GMBUR4#R92W1QQ6DN25Q\">a fair review</a> of it:</p><blockquote class=\"tr_bq\"><p> This book is a necessary buy for anyone who finds themselves under attack for their politics. Two sections in particular stand out: the anatomy of a SJW attack and the response scripts. It will tell you exactly what to expect, what frame of mind to get in, and how to respond.</p><p>That said, I take exception with Vox’s suggestion later in the book that the antidote to the thought police is an equal and opposite thought police for conservative organizations. I understand his argument that ‘they started it, so it’s fair game,’ but it seems like the opposite of the ideal outcome: un-policed thought.</p><p>I will hasten to add that this is a mere academic consideration when you are under active attack from a group that wants to destroy your good name and livelihood for political reasons. Your first priority is to defend yourself, and this book will help you do just that.</p></blockquote><p>I will point out that the mistake he made in the second paragraph is no different than the one that many, indeed, MOST conservatives make. The tactic is not the outcome. The means is not the end. To achieve the objective of unpoliced thought, we must police our organizations against the SJW thought and speech police. Like the Germans with mustard gas in WWI, they will not abandon the tactic unless and until it is used against them with greater efficacy.</p></div>",
  "content_text": "A four-part series on\n“Killing Vox Day”\n. And I have to say, despite his purportedly homicidal intentions, the author says nicer things about me than most of my friends and family do.\n1). Vox Day is Honest\nWhatever you think about Vox Day’s opinions, you cannot deny that he states them publicly and consistently in the face of intense criticism.\nBeing honest does not mean telling the truth per se. It does not mean that what you say is ultimately correct. Honesty means telling the truth as you see it, based on your best understanding of the situation. Vox is acerbic, biased, and prone to fits of exaggeration, but taking these things into account, he generally says what he thinks to the best of his knowledge.\nIf anything, I’ve been stunned by how open Vox Day is about his evil, evil plans. In terms of Hugo strategy in particular, his modus operandi seems to be openly declaring his strategy, openly following through with said strategy, and then laughing at his enemies’ confused responses….\n2). Vox Day is Intelligent (and Sane)\nOne of the things I have noticed about detractors of Vox Day is that they assume Vox is either an idiot or insane. Nothing could be further from the truth.\nVox is an extremely sharp person. He knows how to argue successfully. He can set up a consistent argument, pick out flaws in his opponent’s reasoning, and generally defend intellectual positions that few other people can. Why these positions are difficult to defend hardly matters. What matters is that he has the chops to defend them.\nIf you need an example of this, just look at the arguments he presents in any given blog post and the bleating of his supporters in the comments. There is a world of difference. And this is why they keep coming back – because he is very, very good at arguing for them. You don’t rally around a person who consistently loses.\nAnother good example is this interview on CSPAN where he gives a logical and eloquent argument for the right of American states to secede from the Union. You can tell that the host was expecting an easy kill against a right-wing nut job and ended up with a lively, intelligent debate.\nVox likes to credit his years of strategy gaming for these abilities (Advanced Squad Leader in particular). Personally, I like to credit years of playing Cooking Mama for my three Michelin stars and Mario marathons for my six-foot vertical jump. The more likely factor is that Vox is an avid reader – he displays a more than passing familiarity with philosophy, statistical modelling, and yes, military history and tactics (particularly Fourth Generation theory – more on this later).\nAgain, this is not to say that his arguments are objectively true, only that he does a good job of flustering, discrediting, and generally taking down his opponents. He can think logically, tactically, and worst of all, strategically. He does not win because of the inherent strength of his positions, but because of his technique in defending them. That is not the behavior of a drooling troglodyte or an insane person.\nAfter seeing the first two parts of the series, I sent the author a copy of SJWs Always Lie, as I thought he might find it to be useful in analyzing my thought processes. As I thought he might, I wasn’t surprised to see he posted\na fair review\nof it:\nThis book is a necessary buy for anyone who finds themselves under attack for their politics. Two sections in particular stand out: the anatomy of a SJW attack and the response scripts. It will tell you exactly what to expect, what frame of mind to get in, and how to respond.\nThat said, I take exception with Vox’s suggestion later in the book that the antidote to the thought police is an equal and opposite thought police for conservative organizations. I understand his argument that ‘they started it, so it’s fair game,’ but it seems like the opposite of the ideal outcome: un-policed thought.\nI will hasten to add that this is a mere academic consideration when you are under active attack from a group that wants to destroy your good name and livelihood for political reasons. Your first priority is to defend yourself, and this book will help you do just that.\nI will point out that the mistake he made in the second paragraph is no different than the one that many, indeed, MOST conservatives make. The tactic is not the outcome. The means is not the end. To achieve the objective of unpoliced thought, we must police our organizations against the SJW thought and speech police. Like the Germans with mustard gas in WWI, they will not abandon the tactic unless and until it is used against them with greater efficacy.",
  "tags": [
    "Book Review"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-02T15:00:00+00:00"
}