{
  "url": "https://voxday.net/2015/09/05/eminently-predictable/",
  "scraped_at": "2025-12-17T17:25:33.155782",
  "title": "Eminently predictable",
  "date_display": "September 5, 2015",
  "date_iso": "2015-09-05T11:24:00+00:00",
  "date_from_url": "2015-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From a comment on a fake review:</p><p>SJW: “STOP, I will light my house on fire if you keep trying to take my award!”<br> VOX: “I don’t want your award. I don’t care”<br> SJW: “You are a terrible person and I will make sure you never work in this field and can never take my award.”<br> VOX: “Meh, I don’t want your award”.<br> SJW: “Hah, see we have kicked you out of our special club. You will never work in this town again. Try telling your kids you not a bad person when you cannot feed them.”<br> VOX: “Let me get this right, you insult me when I don’t want your award, you kick me out of a supposedly enlightened group because I don’t want your award, and if I do actually try to take the award you will burn your house down?”<br> SJW: “Yes that’s right and you’ll feel bad.”<br> VOX: Here’s a road flare, just have to break that top off there and it will light.<br> SJW: This one right here?<br> VOX: Yes, that one and it will light.<br> <i>* SJW starts road flare, house burns *</i><br> SJW: See I told you this would happen.<br>VOX: Yeah, you told me. I still don’t care, but this bonfire is fun and my friends have some more gasoline.<br><i>* VOX points to the Vile Faceless ones, the Dread Ilk and the GG’s are rolling up to the site.*</i></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Meanwhile, even <a href=\"http://therev3.blogspot.com/2015/09/sjws-always-lie-non-review.html?showComment=1441376009271#c7848580406058376363\">the Rev. 3.0 is amazed</a> by how one can tell the SJWs what they ought to do to avoid digging themselves in deeper, then watch them promptly proceed to do it.</p><blockquote class=\"tr_bq\"><p> <i>“What I find really funny is that Vox said exactly the same things your saying now, last spring, at File770.”</i></p><p>Ha. I didn’t know that, but it’s pretty hilarious. He really does tell people the honest truth and then sit back and laugh while they punch themselves. </p></blockquote><p>Usually I’m not laughing. I’m mostly just shaking my head in disbelief. It doesn’t matter how many times you see it over and over and over again, it’s still hard to believe people can be that predictably stupid. Look at the SJW reaction to Sad Puppies 4. After months of complaining about how Sad Puppies was a slate because it had precisely five entries per category, (which wasn’t even true), Kate the Impaler comes out and announces that <a href=\"http://madgeniusclub.com/2015/09/03/introducing-sad-puppies-four-the-bitches-are-back/\">SP4 will have 10 recommendations per category</a>, just as the SJWs were demanding.</p><p>Their reaction? “It’s still a slate!” The lesson is: there is never any pleasing SJWs, so don’t even bother listening to them. Just crush them into dust.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://madgeniusclub.files.wordpress.com/2015/09/sad-puppies-4-robobutch-final.jpg?w=500&amp;h=606\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://madgeniusclub.files.wordpress.com/2015/09/sad-puppies-4-robobutch-final.jpg?w=500&amp;h=606\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://madgeniusclub.files.wordpress.com/2015/09/sad-puppies-4-robobutch-final.jpg?w=500&amp;h=606\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "From a comment on a fake review:\nSJW: “STOP, I will light my house on fire if you keep trying to take my award!”\nVOX: “I don’t want your award. I don’t care”\nSJW: “You are a terrible person and I will make sure you never work in this field and can never take my award.”\nVOX: “Meh, I don’t want your award”.\nSJW: “Hah, see we have kicked you out of our special club. You will never work in this town again. Try telling your kids you not a bad person when you cannot feed them.”\nVOX: “Let me get this right, you insult me when I don’t want your award, you kick me out of a supposedly enlightened group because I don’t want your award, and if I do actually try to take the award you will burn your house down?”\nSJW: “Yes that’s right and you’ll feel bad.”\nVOX: Here’s a road flare, just have to break that top off there and it will light.\nSJW: This one right here?\nVOX: Yes, that one and it will light.\n* SJW starts road flare, house burns *\nSJW: See I told you this would happen.\nVOX: Yeah, you told me. I still don’t care, but this bonfire is fun and my friends have some more gasoline.\n* VOX points to the Vile Faceless ones, the Dread Ilk and the GG’s are rolling up to the site.*\nMeanwhile, even\nthe Rev. 3.0 is amazed\nby how one can tell the SJWs what they ought to do to avoid digging themselves in deeper, then watch them promptly proceed to do it.\n“What I find really funny is that Vox said exactly the same things your saying now, last spring, at File770.”\nHa. I didn’t know that, but it’s pretty hilarious. He really does tell people the honest truth and then sit back and laugh while they punch themselves.\nUsually I’m not laughing. I’m mostly just shaking my head in disbelief. It doesn’t matter how many times you see it over and over and over again, it’s still hard to believe people can be that predictably stupid. Look at the SJW reaction to Sad Puppies 4. After months of complaining about how Sad Puppies was a slate because it had precisely five entries per category, (which wasn’t even true), Kate the Impaler comes out and announces that\nSP4 will have 10 recommendations per category\n, just as the SJWs were demanding.\nTheir reaction? “It’s still a slate!” The lesson is: there is never any pleasing SJWs, so don’t even bother listening to them. Just crush them into dust.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-05T10:24:00+00:00"
}