{
  "url": "https://voxday.net/2015/09/09/hows-that-diversity-thing-working-ou/",
  "scraped_at": "2025-12-17T17:26:01.781363",
  "title": "How’s that diversity thing working out?",
  "date_display": "September 9, 2015",
  "date_iso": "2015-09-09T16:11:00+00:00",
  "date_from_url": "2015-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently diversity isn’t turning out to be as quite as “good for the Jews” as it’s been advertised. But there is no pressing cause for concern, I’m sure that the third worlders invading America will be much better behaved than <a href=\"http://www.dailymail.co.uk/news/article-3225049/Married-Holocaust-survivors-brutally-beaten-savage-Amsterdam-robbery-attackers-shouted-dirty-Jews-left-blinded-confined-wheelchairs.html#ixzz3l3gUdbJ1\">the third worlders invading Europe</a>. And speaking as a son of the Mexican Revolution, I can assure you that <i>La Raza Cósmica</i> is every bit as susceptible to appeals to the Holocaust as the Chinese and other immigrant populations are.</p><blockquote class=\"tr_bq\"><p> Married Holocaust survivors brutally beaten in savage Amsterdam robbery as attackers shouted ‘dirty Jews’ and left them blinded and confined to wheelchairs. Men forced their way into home of Shmuel Blog, 87 and his wife Diana, 86. They beat and kicked the pair and demanded they hand over valuables. Called Mr and Mrs Blog ‘dirty Jews’, tore off their rings and tied them up. Mr Blog was left blinded with a broken thigh and wheelchair-bound for life. Mrs Blog is also confined to a wheelchair suffering from ‘extreme pains’</p></blockquote><p>It seems to me that <a href=\"https://archive.is/jC6iw\">the Learned Elders of Wye</a> would be well advised to reconsider their previous position on homogenous white Christian populations rather than assume that they can simply relocate to Israel and China after America follows the current European example.</p></div>",
  "content_text": "Apparently diversity isn’t turning out to be as quite as “good for the Jews” as it’s been advertised. But there is no pressing cause for concern, I’m sure that the third worlders invading America will be much better behaved than\nthe third worlders invading Europe\n. And speaking as a son of the Mexican Revolution, I can assure you that\nLa Raza Cósmica\nis every bit as susceptible to appeals to the Holocaust as the Chinese and other immigrant populations are.\nMarried Holocaust survivors brutally beaten in savage Amsterdam robbery as attackers shouted ‘dirty Jews’ and left them blinded and confined to wheelchairs. Men forced their way into home of Shmuel Blog, 87 and his wife Diana, 86. They beat and kicked the pair and demanded they hand over valuables. Called Mr and Mrs Blog ‘dirty Jews’, tore off their rings and tied them up. Mr Blog was left blinded with a broken thigh and wheelchair-bound for life. Mrs Blog is also confined to a wheelchair suffering from ‘extreme pains’\nIt seems to me that\nthe Learned Elders of Wye\nwould be well advised to reconsider their previous position on homogenous white Christian populations rather than assume that they can simply relocate to Israel and China after America follows the current European example.",
  "tags": [
    "Vibrancy is our strength",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-09T15:11:00+00:00"
}