{
  "url": "https://voxday.net/2015/09/25/immigration-and-new-job-creation/",
  "scraped_at": "2025-12-17T17:27:54.002510",
  "title": "Immigration and new job creation",
  "date_display": "September 25, 2015",
  "date_iso": "2015-09-25T10:00:00+00:00",
  "date_from_url": "2015-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is why you can’t trust one single thing the media says about immigration. Or, for that matter, economics. First, consider the assertions made in <a href=\"http://thinkprogress.org/politics/2015/07/30/3686282/bernie-sanders-immigration/\">a ThinkProgress articl</a>e attacking Bernie Sanders’s moderate position on immigration. I’ve emphasized the two of interest.</p><blockquote class=\"tr_bq\"><p> Sanders’ position on immigration has been called “complicated” and <b>he has been criticized by immigration activists for supporting the idea that immigrants coming to the U.S. are taking jobs and hurting the economy, a theory that has been proven incorrect.</b> Both of his leading Democratic challengers, Hillary Clinton and Martin O’Malley, have recognized that new immigrants coming to the country actually boost the economy. But Sanders continues to align himself more closely with Democratic positions of the past.</p><p>“I frankly do not believe that we should be bringing in significant numbers of unskilled to workers to compete with [unemployed] kids,” Sanders said. “I want to see these kids get jobs.”</p><p><b>Studies have shown that immigrants actually create jobs for American workers</b>. Researchers recently found that each new immigrant has produced about 1.2 new jobs in the U.S., most of which have gone to native-born workers. And according to the Atlantic, an influx in immigration can cause non-tradable professions — jobs like hospitality and construction that cannot be outsourced — to see a wage increase because the demand for goods and services grows with the expanding population.</p></blockquote><p>Sounds pretty conclusive, doesn’t it? The “theory” that immigrants are taking jobs and hurting the economy has been “proven incorrect”. Not only that, but “studies have shown” that each and every new immigrant creates 1.2 new jobs!</p><p>Second, let’s go and look at the study that provided the basis for these assertions, <a href=\"http://www.nber.org/papers/w21123\">“Are Immigrants a Shot in the Arm for the Local Economy?”</a>, published in April 2015:</p><blockquote class=\"tr_bq\"><p> Most research on the effects of immigration focuses on the effects of immigrants as adding to the supply of labor. By contrast, this paper studies the effects of immigrants on local labor demand, due to the increase in consumer demand for local services created by immigrants. This effect can attenuate downward pressure from immigrants on non-immigrants’ wages, and also benefit non-immigrants by increasing the variety of local services available. For this reason, immigrants can raise native workers’ real wages, and each immigrant could create more than one job. Using US Census data <b>from 1980 to 2000</b>, we find considerable evidence for these effects: <b>Each immigrant creates 1.2 local jobs for local workers, most of them going to native workers</b>, and 62% of these jobs are in non-traded services. Immigrants appear to raise local non-tradables sector wages and to attract native-born workers from elsewhere in the country. Overall, it appears that local workers benefit from the arrival of more immigrants.</p></blockquote><p>Now, to anyone who pays attention to economics, those dates should ring a bell. 1980 to 2000… just happens to closely coincide with the dates of one of the largest debt-funded economic expansions in world history. Not only that, but that period also precedes the U.S. interventions in Afghanistan and Iraq which led to the usual influx of “refugees” from those and other countries, such as Somalia, where U.S. forces were active. From 1980 to 2000, there were 841,149 annual immigrants, 23 percent fewer than the average in the subsequent 15 years.</p><p>Not counting undocumented workers, the U.S. has been “strengthened” by adding an average of 1,090,520 legal immigrants annually, which, when combined with the reports of the study, means that from 2000 to 2015, immigrants should have created 19.6 million new jobs for native workers in addition to supplying approximately 10.6 million new jobs themselves. (The latter must be the case due to the new jobs reportedly going to native workers and is a conservative estimate based on the EPR). This amounts to a total of 30.2 million new jobs created by immigration since 2000.</p><p>Now let’s look at the numbers from 2000 to 2015. In January 2000, the working age population of the United States was 178,259,050 and the Employment-Population Ratio was 64.6, meaning there were 115,155,346 jobs. Therefore, according to the NBER model, the beneficial effects of immigration are such that after 15 more years of it there should be 145,355,346 jobs in 2015.</p><p>In March 2015 the working age population had grown by nearly 15 million to 204,026,416, which is in line with the 10.6 million new immigrant workers, but population grew to nearly 320 million and the EPR fell to 59.3.That works out to 120,987,665 jobs, which is a mere <i>24,367,681 fewer jobs</i> than the NBER model predicted. From 2000 to 2015, 16.4 million new immigrants have created a grand total of 5,832,319 new jobs, which means that either a) over 10 million native Americans have lost their jobs to immigrant labor or b) over two-thirds of the new immigrants are collecting welfare. Either way, these 16.4 million immigrants have not been a boost to the economy.</p><p>I should note that it would have been just as easy to use GDP and wage statistics to disprove some of the other assertions in the first article, but it should suffice to point out that the reason the Federal Reserve has maintained a zero interest rate policy for the last five years is to compensate for insufficient demand, thereby proving that the demand for goods and services has not grown in line with the expanding population.</p><p>The facts are absolutely clear: immigrants do NOT create new jobs for native workers and they do not boost the economy.</p></div>",
  "content_text": "This is why you can’t trust one single thing the media says about immigration. Or, for that matter, economics. First, consider the assertions made in\na ThinkProgress articl\ne attacking Bernie Sanders’s moderate position on immigration. I’ve emphasized the two of interest.\nSanders’ position on immigration has been called “complicated” and\nhe has been criticized by immigration activists for supporting the idea that immigrants coming to the U.S. are taking jobs and hurting the economy, a theory that has been proven incorrect.\nBoth of his leading Democratic challengers, Hillary Clinton and Martin O’Malley, have recognized that new immigrants coming to the country actually boost the economy. But Sanders continues to align himself more closely with Democratic positions of the past.\n“I frankly do not believe that we should be bringing in significant numbers of unskilled to workers to compete with [unemployed] kids,” Sanders said. “I want to see these kids get jobs.”\nStudies have shown that immigrants actually create jobs for American workers\n. Researchers recently found that each new immigrant has produced about 1.2 new jobs in the U.S., most of which have gone to native-born workers. And according to the Atlantic, an influx in immigration can cause non-tradable professions — jobs like hospitality and construction that cannot be outsourced — to see a wage increase because the demand for goods and services grows with the expanding population.\nSounds pretty conclusive, doesn’t it? The “theory” that immigrants are taking jobs and hurting the economy has been “proven incorrect”. Not only that, but “studies have shown” that each and every new immigrant creates 1.2 new jobs!\nSecond, let’s go and look at the study that provided the basis for these assertions,\n“Are Immigrants a Shot in the Arm for the Local Economy?”\n, published in April 2015:\nMost research on the effects of immigration focuses on the effects of immigrants as adding to the supply of labor. By contrast, this paper studies the effects of immigrants on local labor demand, due to the increase in consumer demand for local services created by immigrants. This effect can attenuate downward pressure from immigrants on non-immigrants’ wages, and also benefit non-immigrants by increasing the variety of local services available. For this reason, immigrants can raise native workers’ real wages, and each immigrant could create more than one job. Using US Census data\nfrom 1980 to 2000\n, we find considerable evidence for these effects:\nEach immigrant creates 1.2 local jobs for local workers, most of them going to native workers\n, and 62% of these jobs are in non-traded services. Immigrants appear to raise local non-tradables sector wages and to attract native-born workers from elsewhere in the country. Overall, it appears that local workers benefit from the arrival of more immigrants.\nNow, to anyone who pays attention to economics, those dates should ring a bell. 1980 to 2000… just happens to closely coincide with the dates of one of the largest debt-funded economic expansions in world history. Not only that, but that period also precedes the U.S. interventions in Afghanistan and Iraq which led to the usual influx of “refugees” from those and other countries, such as Somalia, where U.S. forces were active. From 1980 to 2000, there were 841,149 annual immigrants, 23 percent fewer than the average in the subsequent 15 years.\nNot counting undocumented workers, the U.S. has been “strengthened” by adding an average of 1,090,520 legal immigrants annually, which, when combined with the reports of the study, means that from 2000 to 2015, immigrants should have created 19.6 million new jobs for native workers in addition to supplying approximately 10.6 million new jobs themselves. (The latter must be the case due to the new jobs reportedly going to native workers and is a conservative estimate based on the EPR). This amounts to a total of 30.2 million new jobs created by immigration since 2000.\nNow let’s look at the numbers from 2000 to 2015. In January 2000, the working age population of the United States was 178,259,050 and the Employment-Population Ratio was 64.6, meaning there were 115,155,346 jobs. Therefore, according to the NBER model, the beneficial effects of immigration are such that after 15 more years of it there should be 145,355,346 jobs in 2015.\nIn March 2015 the working age population had grown by nearly 15 million to 204,026,416, which is in line with the 10.6 million new immigrant workers, but population grew to nearly 320 million and the EPR fell to 59.3.That works out to 120,987,665 jobs, which is a mere\n24,367,681 fewer jobs\nthan the NBER model predicted. From 2000 to 2015, 16.4 million new immigrants have created a grand total of 5,832,319 new jobs, which means that either a) over 10 million native Americans have lost their jobs to immigrant labor or b) over two-thirds of the new immigrants are collecting welfare. Either way, these 16.4 million immigrants have not been a boost to the economy.\nI should note that it would have been just as easy to use GDP and wage statistics to disprove some of the other assertions in the first article, but it should suffice to point out that the reason the Federal Reserve has maintained a zero interest rate policy for the last five years is to compensate for insufficient demand, thereby proving that the demand for goods and services has not grown in line with the expanding population.\nThe facts are absolutely clear: immigrants do NOT create new jobs for native workers and they do not boost the economy.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-25T09:00:00+00:00"
}