{
  "url": "https://voxday.net/2015/09/08/interview-with-vox-day/",
  "scraped_at": "2025-12-17T17:25:54.453700",
  "title": "Interview with Vox Day",
  "date_display": "September 8, 2015",
  "date_iso": "2015-09-08T12:00:00+00:00",
  "date_from_url": "2015-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Greg Johnson of <i>Counter-Currents</i> interviewed me last night. The MP3 is available there of our discussion, which <a href=\"http://www.counter-currents.com/2015/09/greg-johnson-interviews-vox-day/\">he summarized as follows</a>:</p><blockquote class=\"tr_bq\"><p> Greg Johnson talks to video game designer, musician, blogger, novelist, and publisher Vox Day. Topics include:</p><ul><li>His political outlook and its formation</li><li>Why he is no longer a Libertarian</li><li>“National libertarianism”</li><li>The necessity of borders</li><li>The European refugee crisis</li><li>Why nationalism and tribalism are unstoppable forces</li><li>Illegitimate forms of identity politics</li><li>The problem of white identity in the United States as opposed to European national identities</li><li>His new book <a href=\"http://www.amazon.com/gp/product/B014GMBUR4\"><b><i>SJWs Always Lie</i></b></a></li><li>Why they always lie</li><li>Advice to those who wish to roll back political correctness</li><li>A preview of coming attractions</li></ul></blockquote><p>I think the most interesting part of the interview was when we discussed the problem of “white identity”. I think “whites” are inclined to significantly underperform in identity politics for much the same reason that “Hispanics” and “Asians” do, which is that most people who qualify as white don’t <i>primarily </i>identify as White in the same manner that more cohesive minorities such as Blacks, Jews, Gays, and Women (which actually means Feminists) do.</p><p>Ask a “Hispanic” what he is and he’ll tell you he is Mexican or Guatemalan. Ask an “Asian” what he is and he’ll tell you Chinese or Thai. Ask a “white” and he’ll tell you “mostly German” or “half-this, half-that”. You will almost never hear anyone self-identify as White, nor would you have 30 or 40 years ago. And a man who identifies as “Italian-American” is simply not going to see another man who identifies as “Irish” or “Scandinavian” or “German” as his <i>goombah </i>and proactively engage in nepotistic favoritism on his behalf.</p><p>There is no nationalism without a cohesive nation and there is no tribalism without identification with the specific tribe.</p></div>",
  "content_text": "Greg Johnson of\nCounter-Currents\ninterviewed me last night. The MP3 is available there of our discussion, which\nhe summarized as follows\n:\nGreg Johnson talks to video game designer, musician, blogger, novelist, and publisher Vox Day. Topics include:\nHis political outlook and its formation\nWhy he is no longer a Libertarian\n“National libertarianism”\nThe necessity of borders\nThe European refugee crisis\nWhy nationalism and tribalism are unstoppable forces\nIllegitimate forms of identity politics\nThe problem of white identity in the United States as opposed to European national identities\nHis new book\nSJWs Always Lie\nWhy they always lie\nAdvice to those who wish to roll back political correctness\nA preview of coming attractions\nI think the most interesting part of the interview was when we discussed the problem of “white identity”. I think “whites” are inclined to significantly underperform in identity politics for much the same reason that “Hispanics” and “Asians” do, which is that most people who qualify as white don’t\nprimarily\nidentify as White in the same manner that more cohesive minorities such as Blacks, Jews, Gays, and Women (which actually means Feminists) do.\nAsk a “Hispanic” what he is and he’ll tell you he is Mexican or Guatemalan. Ask an “Asian” what he is and he’ll tell you Chinese or Thai. Ask a “white” and he’ll tell you “mostly German” or “half-this, half-that”. You will almost never hear anyone self-identify as White, nor would you have 30 or 40 years ago. And a man who identifies as “Italian-American” is simply not going to see another man who identifies as “Irish” or “Scandinavian” or “German” as his\ngoombah\nand proactively engage in nepotistic favoritism on his behalf.\nThere is no nationalism without a cohesive nation and there is no tribalism without identification with the specific tribe.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-08T11:00:00+00:00"
}