{
  "url": "https://voxday.net/2015/09/08/invaders-not-refugees/",
  "scraped_at": "2025-12-17T17:25:52.592469",
  "title": "Rent seekers, not refugees",
  "date_display": "September 8, 2015",
  "date_iso": "2015-09-08T08:21:00+00:00",
  "date_from_url": "2015-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point, a lot of Europeans are beginning to think that Vlad the Impaler’s solution is the correct one to <a href=\"http://theconservativetreehouse.com/2015/09/06/raging-horror-confirmed-at-austria-italy-border-mid-east-muslims-refugees-go-on-rampage/\">the violent invasion of Western Europe</a>:</p><blockquote class=\"tr_bq\"><p> I saw an elderly Italian woman in a car that was surrounded by the immigrants. They pulled her by the hair out of the car and wanted to use it to go to Germany. They tried to topple the bus i was in. They threw feces at us, banging on the door for the driver to open it, spat on the glass. My question is- for what purpose? How do they want to assimilate in Germany? For a moment, i felt like in a warzone. I really feel sorry for these people, but if they would reach Poland – I do not think they would receive any understanding from us.</p><p>We spent three hours on the border, but failed to get through. The whole group was later transported back to Italy by the police. The bus is butchered, feces smeared, scratched, broken windows. And this is supposed to be an idea for the demographics? These big powerful hordes?</p><p>Among them there were almost no women and children – the vast majority was aggressive young men. Just yesterday I read the news on all the websites with real compassion, worried about their fate and today after what I saw I am just afraid. And I am happy they do not choose our country as their destination. We Poles are simply not ready to accept these people – neither culturally nor financially. I do not know if anyone is ready. A giant pathology is approaching the EU, one which we have never seen before. And sorry if anyone is offended by this entry.</p><p>A car with humanitarian aid came. Food and water. They just toppled it and stole everything. With megaphones the Austrians announced a message that there is consensus for them to cross over the border – they wanted to register them and let them go on – but they did not understand these messages. None. And it was all the greatest horror … From those few thousand people nobody understood neither Italian nor English, or German, or Russian, or Spanish … What mattered was the law of the fist.</p></blockquote><p>The media coverage is even worse than you think. Do you know why a lot of those “desperate refugees fleeing the Syrian war” are so well-dressed in relatively clean clothes? Because 39 percent of them <a href=\"http://www.ft.com/cms/s/0/598924f0-555d-11e5-9846-de406ccb37f2.html\">are from the Balkans</a>. They’re EASTERN EUROPEAN MUSLIMS, they are not from the Middle East or Africa at all, and they aren’t fleeing anything except the societies they’ve already ruined.</p><blockquote class=\"tr_bq\"><p> About a fifth of asylum seekers to Germany in the first half of the year<br> were from war-torn Syria, giving them a strong claim to refugee status.<br> But about 39 per cent were from the western Balkans and primarily<br> seeking better economic opportunities, giving them little chance of<br> qualifying for asylum.</br></br></br></br></p></blockquote><p>And, of course, one wouldn’t want to offend these poor, helpless, grateful people, so the German girls need to start dressing differently, as one school in Bavaria near a “refugee” shelter has already instructed the parents of its students:</p><blockquote class=\"tr_bq\"><p> “As our school is in the immediate vicinity, it would be appropriate to wear restrained everyday clothes, to avoid conflict. Transparent tops or blouses, short shorts or miniskirts could lead to misunderstandings. In addition, you are asked to refrain from “direct eye contact, ogling, or photographing. Derogatory or racist remarks can not be tolerated in any way.”</p></blockquote><p>This is why the Social Justice ideals of Equality, Diversity, Tolerance, and Progress must be rejected, completely. Because this is exactly where it leads.</p></div>",
  "content_text": "At this point, a lot of Europeans are beginning to think that Vlad the Impaler’s solution is the correct one to\nthe violent invasion of Western Europe\n:\nI saw an elderly Italian woman in a car that was surrounded by the immigrants. They pulled her by the hair out of the car and wanted to use it to go to Germany. They tried to topple the bus i was in. They threw feces at us, banging on the door for the driver to open it, spat on the glass. My question is- for what purpose? How do they want to assimilate in Germany? For a moment, i felt like in a warzone. I really feel sorry for these people, but if they would reach Poland – I do not think they would receive any understanding from us.\nWe spent three hours on the border, but failed to get through. The whole group was later transported back to Italy by the police. The bus is butchered, feces smeared, scratched, broken windows. And this is supposed to be an idea for the demographics? These big powerful hordes?\nAmong them there were almost no women and children – the vast majority was aggressive young men. Just yesterday I read the news on all the websites with real compassion, worried about their fate and today after what I saw I am just afraid. And I am happy they do not choose our country as their destination. We Poles are simply not ready to accept these people – neither culturally nor financially. I do not know if anyone is ready. A giant pathology is approaching the EU, one which we have never seen before. And sorry if anyone is offended by this entry.\nA car with humanitarian aid came. Food and water. They just toppled it and stole everything. With megaphones the Austrians announced a message that there is consensus for them to cross over the border – they wanted to register them and let them go on – but they did not understand these messages. None. And it was all the greatest horror … From those few thousand people nobody understood neither Italian nor English, or German, or Russian, or Spanish … What mattered was the law of the fist.\nThe media coverage is even worse than you think. Do you know why a lot of those “desperate refugees fleeing the Syrian war” are so well-dressed in relatively clean clothes? Because 39 percent of them\nare from the Balkans\n. They’re EASTERN EUROPEAN MUSLIMS, they are not from the Middle East or Africa at all, and they aren’t fleeing anything except the societies they’ve already ruined.\nAbout a fifth of asylum seekers to Germany in the first half of the year\nwere from war-torn Syria, giving them a strong claim to refugee status.\nBut about 39 per cent were from the western Balkans and primarily\nseeking better economic opportunities, giving them little chance of\nqualifying for asylum.\nAnd, of course, one wouldn’t want to offend these poor, helpless, grateful people, so the German girls need to start dressing differently, as one school in Bavaria near a “refugee” shelter has already instructed the parents of its students:\n“As our school is in the immediate vicinity, it would be appropriate to wear restrained everyday clothes, to avoid conflict. Transparent tops or blouses, short shorts or miniskirts could lead to misunderstandings. In addition, you are asked to refrain from “direct eye contact, ogling, or photographing. Derogatory or racist remarks can not be tolerated in any way.”\nThis is why the Social Justice ideals of Equality, Diversity, Tolerance, and Progress must be rejected, completely. Because this is exactly where it leads.",
  "tags": [
    "EU",
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-08T07:21:00+00:00"
}