{
  "url": "https://voxday.net/2015/09/13/mailvox-rhetoric-in-action/",
  "scraped_at": "2025-12-17T17:26:28.176571",
  "title": "Mailvox: Rhetoric in action",
  "date_display": "September 13, 2015",
  "date_iso": "2015-09-13T12:30:00+00:00",
  "date_from_url": "2015-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The lightbulb goes on for IndecisiveEvidence:</p><blockquote class=\"tr_bq\"><p> My first instinct reading <a href=\"http://www.milobookclub.com/2015/09/12/sjws-always-double-down-2/\">that exchange</a> is to shake my head. It’s just you and Kluwe doing catty girl sniping. I’m a troll so I get it but it seems stupid. Then it hit me. You reminded me in the comment thread here. I read your book. You’re exercising the language Sparklepunter speaks. Brilliant. It’s still stupid but now in a completely different light that makes perfect sense.</p></blockquote><p>Rhetoric often strikes those outside its emotional impact range as stupid. Think about the nasty little comment about her new dress that absolutely crushes the teen girl; the same comment made to anyone else might not only seem stupid, but insane. However, as I seem to keep having to point out to those who are quite stupidly attached to the idea that flawless logic and reason are genuinely capable of persuading 100 percent of all human beings of anything, <i>rhetoric is devoid of information content</i>. It is not intended to instruct or inform. It is intended to <i>emotionally influence</i>.</p><p>In the case of adversarial rhetoric, the objective is to cause sufficient emotional pain to the other party to force them to withdraw from the conflict. Now, withdrawal does not necessarily mean that any emotional pain has been caused, but one can usually tell if this is the case or not on the basis of any abrupt alteration of one party’s behavior. Usually, this will be the attacking party suddenly breaking off contact. To utilize the catty girl sniping analogy, whoever bursts into tears and runs away loses status, whoever remains there gains it.</p><p>Kluwe’s rhetoric was unfocused, shallow, and ineffective. He tried to associate me with Nazis, which is neither new to me nor true, and has no more effect on me than the previous five thousand attempts. Recognizing that, he then tried to pick at what he thought would be a sore spot, but I hadn’t spent any time thinking about how to respond to him and having three Hugo No Awards doesn’t bother me in the slightest. After all, I knowingly sought two of them this year. So he moved on to the assertion that my movement, whatever that may be, is failing and that my supporters are rats attempting to disassociate from me.</p><p>Considering that the VFM have grown from 434 strong to 445 in the last few days, the new book is still #1 in Political Philosophy, and the site traffic is on course to set a new monthly record, this was the precise opposite of effective rhetoric, which always has some basis in truth. How terrible do you feel, having been labeled a disloyal rodent by Sparklepunter?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/COx1-4BWUAEj2cG.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"266\" src=\"https://pbs.twimg.com/media/COx1-4BWUAEj2cG.jpg\" width=\"400\"/></a></div><p>Contrast with that my own rhetoric, which associated Kluwe, the father of two young girls, with pedophilia. This had a strong basis in truth, since Kluwe was actively defending a known pedophile in his unprovoked challenge to GamerGate. It was focused, as I continued to harp on that theme, and it was effective, as Kluwe rapidly went from attacking GamerGate and publicly asserting his support for Nyberg to retreating and hitting the mute button in the course of just a few tweets.</p><p>It was somewhat of a pity, because I had some even sharper rhetoric prepared, but it should illustrate that contra the mindless catty girl sniping some erroneously thought it to be, it was effective rhetoric that demoralized an enemy and defeated his rhetorical attack. No one came away from reading that thinking about National Socialism. A dialectical response that cited Nyberg’s various deeds would have been totally ineffective since Kluwe was already familiar with all of the relevant information and had chosen to ignore it.</p><p><i>“Before some audiences not even the possession of the exactest<br> knowledge will make it easy for what we say to produce conviction. For<br> argument based on knowledge implies instruction, and there are people<br> whom one cannot instruct.”</br></br></br></i><br> – Aristotle, <i>Rhetoric </i></br></p><p>I repeat: Meet dialectic with dialectic. Meet rhetoric with rhetoric. Meet pseudo-dialectic with dialectic to expose the rhetoric, then follow it up with rhetoric. Those who tend to favor dialectic very much need to understand that the emotional impact of dialectic in response to rhetoric is every bit as ineffective as the logical impact of rhetoric is in response to dialectic.</p><p>It may help to keep in mind that whenever you try to use information to persuade a rhetoric speaker, you sound like “the train is fine” guy. You may be correct, but you’re totally missing the point.</p></div>",
  "content_text": "The lightbulb goes on for IndecisiveEvidence:\nMy first instinct reading\nthat exchange\nis to shake my head. It’s just you and Kluwe doing catty girl sniping. I’m a troll so I get it but it seems stupid. Then it hit me. You reminded me in the comment thread here. I read your book. You’re exercising the language Sparklepunter speaks. Brilliant. It’s still stupid but now in a completely different light that makes perfect sense.\nRhetoric often strikes those outside its emotional impact range as stupid. Think about the nasty little comment about her new dress that absolutely crushes the teen girl; the same comment made to anyone else might not only seem stupid, but insane. However, as I seem to keep having to point out to those who are quite stupidly attached to the idea that flawless logic and reason are genuinely capable of persuading 100 percent of all human beings of anything,\nrhetoric is devoid of information content\n. It is not intended to instruct or inform. It is intended to\nemotionally influence\n.\nIn the case of adversarial rhetoric, the objective is to cause sufficient emotional pain to the other party to force them to withdraw from the conflict. Now, withdrawal does not necessarily mean that any emotional pain has been caused, but one can usually tell if this is the case or not on the basis of any abrupt alteration of one party’s behavior. Usually, this will be the attacking party suddenly breaking off contact. To utilize the catty girl sniping analogy, whoever bursts into tears and runs away loses status, whoever remains there gains it.\nKluwe’s rhetoric was unfocused, shallow, and ineffective. He tried to associate me with Nazis, which is neither new to me nor true, and has no more effect on me than the previous five thousand attempts. Recognizing that, he then tried to pick at what he thought would be a sore spot, but I hadn’t spent any time thinking about how to respond to him and having three Hugo No Awards doesn’t bother me in the slightest. After all, I knowingly sought two of them this year. So he moved on to the assertion that my movement, whatever that may be, is failing and that my supporters are rats attempting to disassociate from me.\nConsidering that the VFM have grown from 434 strong to 445 in the last few days, the new book is still #1 in Political Philosophy, and the site traffic is on course to set a new monthly record, this was the precise opposite of effective rhetoric, which always has some basis in truth. How terrible do you feel, having been labeled a disloyal rodent by Sparklepunter?\nContrast with that my own rhetoric, which associated Kluwe, the father of two young girls, with pedophilia. This had a strong basis in truth, since Kluwe was actively defending a known pedophile in his unprovoked challenge to GamerGate. It was focused, as I continued to harp on that theme, and it was effective, as Kluwe rapidly went from attacking GamerGate and publicly asserting his support for Nyberg to retreating and hitting the mute button in the course of just a few tweets.\nIt was somewhat of a pity, because I had some even sharper rhetoric prepared, but it should illustrate that contra the mindless catty girl sniping some erroneously thought it to be, it was effective rhetoric that demoralized an enemy and defeated his rhetorical attack. No one came away from reading that thinking about National Socialism. A dialectical response that cited Nyberg’s various deeds would have been totally ineffective since Kluwe was already familiar with all of the relevant information and had chosen to ignore it.\n“Before some audiences not even the possession of the exactest\nknowledge will make it easy for what we say to produce conviction. For\nargument based on knowledge implies instruction, and there are people\nwhom one cannot instruct.”\n– Aristotle,\nRhetoric\nI repeat: Meet dialectic with dialectic. Meet rhetoric with rhetoric. Meet pseudo-dialectic with dialectic to expose the rhetoric, then follow it up with rhetoric. Those who tend to favor dialectic very much need to understand that the emotional impact of dialectic in response to rhetoric is every bit as ineffective as the logical impact of rhetoric is in response to dialectic.\nIt may help to keep in mind that whenever you try to use information to persuade a rhetoric speaker, you sound like “the train is fine” guy. You may be correct, but you’re totally missing the point.",
  "tags": [
    "mailvox",
    "philosophy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-13T11:30:00+00:00"
}