{
  "url": "https://voxday.net/2015/09/23/mailvox-how-sjws-metastasize/",
  "scraped_at": "2025-12-17T17:27:39.309464",
  "title": "Mailvox: how SJWs metastasize",
  "date_display": "September 23, 2015",
  "date_iso": "2015-09-23T12:00:00+00:00",
  "date_from_url": "2015-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An individual familiar with the con scene explains how SJW entryism metastasizes once they take control of an organization and start using it as a vehicle to spread their thought control elsewhere.</p><blockquote class=\"tr_bq\"><p> Greetings from Minnesota. I recently read <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i><b>SJWs Always Lie</b></i></a>, and I noted in particular the parts about entryism and the way Codes of Conduct are weaponized to cull enemies from organizations because it parallels my own experience with the local fan con scene.</p><p>The big fan con, locally, remains CONvergence (“CVG”). Damn near all of the other local fan cons follow its lead and participate in an association with the defacto parent org, the Geek Partnership Society. When this organizational realignment occurred there also came the inclusion of the current Code of Conduct (masked as a simple <a href=\"http://www.convergence-con.org/at-the-con/policies/\">“Harassment” statement</a>), pushes for Costumes Are Not Consent as another fork in the process, and the inclusion of the Atheism Plus crowd via con-within-a-con Skepticon (Rebecca Watson, Amanda Marcotte, and P.Z. Myers are much loved by the ruling clique here.) as a recurring element. I wondered what the hell was going on.</p><p>Well, one of the former CVG con com members is a man by the name of <a href=\"https://plus.google.com/u/0/114670078243424024946/about\">Michael Lee</a> who has recently organized a convention specific to organizers of fan con: <a href=\"http://jofconmsp2015.blogspot.com/2014/09/an-introduction.html\">JOFCon MSP</a>. This con has an explicit Code of Conduct, and I note that this code makes explicit in writing what is in actual practice at CONvergence regarding how its harassment policy is intended to work.</p><p>Furthermore, this is a con catering to the “Secret Masters of Fandom” clique, and many of the current and former CVG con-com members who will attend JOFCon MSP adhere to the SMOFs in large part due to the Torlock crowd being long-time regulars at CVG . The Former Guests of Honor, Visiting Authors, and Attending Professions are listed and I’m sure you’d recognize many of those listed. Yes, this meant any “acceptable” talk of Sad Puppies or Gamergate was NOT in support.</p><p>I offer my above-linked examples as real-world cases worthy of study, as both CVG (in its current status as Local Con of Cons, and therefore a significant point in the con-centric travelling circus that many authors and artists run to earn their living) and this JOFCon seem to possess more influence than they seem. WorldCon is not the only example of SJWs using leverage to fuck up the greater culture; I suspect that they’re using the entire con scene to engineer their poison into the culture.</p><p>I’m telling others sympathetic to the anti-SJW push across all fandoms that attend conventions to check their materials for similar signs of entryism and reconsider the state of organizational integrity for that convention. I would advise professionals to do likewise for conferences related to their interests. Given the alternatives now available, it may be possible to render those too far gone totally irrelevant while others can be reconquered and then purged of the cultists.</p></blockquote><p>Keep this in mind if you are feeling any qualms of conscience about jettisoning an SJW from your club or organization because “he hasn’t done anything yet”. Don’t look at them as individuals because they don’t operate as individuals and they certainly don’t think for themselves; they are merely an invasive tendril of the SJW hive mind that is attempting to force its way into your area of responsibility.</p><p>If you don’t force them out, if you don’t keep them out, they will eventually take you out and take it over. Don’t think you, your organization, or your purpose is too valuable or important, the Narrative ALWAYS comes first and foremost for SJWs.</p><p>And if the SJWs are already running the show, leave. Stop supporting it. If you can summon the manpower to take it back, then do so, but if you can’t, set up your own show in direct competition with it and run them out that way.</p></div>",
  "content_text": "An individual familiar with the con scene explains how SJW entryism metastasizes once they take control of an organization and start using it as a vehicle to spread their thought control elsewhere.\nGreetings from Minnesota. I recently read\nSJWs Always Lie\n, and I noted in particular the parts about entryism and the way Codes of Conduct are weaponized to cull enemies from organizations because it parallels my own experience with the local fan con scene.\nThe big fan con, locally, remains CONvergence (“CVG”). Damn near all of the other local fan cons follow its lead and participate in an association with the defacto parent org, the Geek Partnership Society. When this organizational realignment occurred there also came the inclusion of the current Code of Conduct (masked as a simple\n“Harassment” statement\n), pushes for Costumes Are Not Consent as another fork in the process, and the inclusion of the Atheism Plus crowd via con-within-a-con Skepticon (Rebecca Watson, Amanda Marcotte, and P.Z. Myers are much loved by the ruling clique here.) as a recurring element. I wondered what the hell was going on.\nWell, one of the former CVG con com members is a man by the name of\nMichael Lee\nwho has recently organized a convention specific to organizers of fan con:\nJOFCon MSP\n. This con has an explicit Code of Conduct, and I note that this code makes explicit in writing what is in actual practice at CONvergence regarding how its harassment policy is intended to work.\nFurthermore, this is a con catering to the “Secret Masters of Fandom” clique, and many of the current and former CVG con-com members who will attend JOFCon MSP adhere to the SMOFs in large part due to the Torlock crowd being long-time regulars at CVG . The Former Guests of Honor, Visiting Authors, and Attending Professions are listed and I’m sure you’d recognize many of those listed. Yes, this meant any “acceptable” talk of Sad Puppies or Gamergate was NOT in support.\nI offer my above-linked examples as real-world cases worthy of study, as both CVG (in its current status as Local Con of Cons, and therefore a significant point in the con-centric travelling circus that many authors and artists run to earn their living) and this JOFCon seem to possess more influence than they seem. WorldCon is not the only example of SJWs using leverage to fuck up the greater culture; I suspect that they’re using the entire con scene to engineer their poison into the culture.\nI’m telling others sympathetic to the anti-SJW push across all fandoms that attend conventions to check their materials for similar signs of entryism and reconsider the state of organizational integrity for that convention. I would advise professionals to do likewise for conferences related to their interests. Given the alternatives now available, it may be possible to render those too far gone totally irrelevant while others can be reconquered and then purged of the cultists.\nKeep this in mind if you are feeling any qualms of conscience about jettisoning an SJW from your club or organization because “he hasn’t done anything yet”. Don’t look at them as individuals because they don’t operate as individuals and they certainly don’t think for themselves; they are merely an invasive tendril of the SJW hive mind that is attempting to force its way into your area of responsibility.\nIf you don’t force them out, if you don’t keep them out, they will eventually take you out and take it over. Don’t think you, your organization, or your purpose is too valuable or important, the Narrative ALWAYS comes first and foremost for SJWs.\nAnd if the SJWs are already running the show, leave. Stop supporting it. If you can summon the manpower to take it back, then do so, but if you can’t, set up your own show in direct competition with it and run them out that way.",
  "tags": [
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-23T11:00:00+00:00"
}