{
  "url": "https://voxday.net/2015/09/17/moderation/",
  "scraped_at": "2025-12-17T17:26:57.941243",
  "title": "Moderation is in effect",
  "date_display": "September 17, 2015",
  "date_iso": "2015-09-17T09:17:00+00:00",
  "date_from_url": "2015-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The troll from Hendersonville, Tennesee who goes by Andrew Spooner Jr. is back so I’ve turned the moderation back on until further notice. I suspect we’re dealing with an “off his meds” situation here, because the guy has been posting literally hundreds of comments, many of them vulgar references to African-American genitalia.</p><p>One thing a lot of you probably don’t realize is how much goes on behind the scenes to prevent trolls, lunatics, and attention-seekers from disrupting the discourse here. The three of us, Matt, Markku, and I, deal with these attempted disruptions, both purposeful and incidental, every single day. All your comments will appear in short order, they simply won’t appear instantaneously. We’re not doing this to control your comments, but to prevent them from disappearing in a flood of lunacy.</p><p>To put it in perspective, in the last 26 minutes alone he left 114 comments, many of them identical to this.</p><blockquote class=\"tr_bq\"><p> I am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane. I<br> am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane. I<br> am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane. I<br> am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane. I<br> am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane. I<br> am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane. I<br> am slowly but surely driving Vox Day insane. I am slowly but surely<br> driving Vox Day insane. I am slowly but surely driving Vox Day insane.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Apparently it isn’t only SJWs who psychologically project. His object, in his own words, is to drive away the commenters unless he is permitted to comment without being subject to the rules. <i>“I will drive every last commenter out of here until you take your rules and burn them Vox.”</i></p><p>Needless to say, that’s not going to happen. Here is an archive of <a href=\"https://archive.is/Ih2UB\">his short-lived blog</a> and this is <a href=\"https://archive.is/VQD3C\">his Blogger profile</a>: It appears his address is here:</p><p>119 Crossroad Drive<br> Hendersonville, TN 37075-4801</br></p><p>The Andrew Spooner there is the right age for one who reports being 21 in 2004. He ran a podcast called <a href=\"https://radiofreehendersonville.wordpress.com/featured-artists/\">Radio Free Hendersonville</a> a few years ago. He also has a GoodReads account complete with a picture. His reading list appears to have been influenced by VP, which indicates that we’ve got the correct individual.</p><p>Anyhow, I’m going to contact the Hendersonville police today as this guy has now gone from stalking to aggravated stalking under Tennessee Code 39-17-315 – <i>Stalking, aggravated stalking, and especially aggravated stalking.</i></p><p>Andrew, it’s not about you having anything to hide or not, it’s about the fact that you just committed a Class C felony. You won’t be the first troll of this blog to find himself being interrogated by the police. Hell, you won’t even be the first one named Andrew.</p><p>UPDATE: He’s now up to 1,220 comments in less than five hours and the rate is increasing. He’s reached a rate of up to 25 copy-pasted comments <i>per minute</i>. I have to confess, it’s somewhat fascinating to see the deterioration of a mind in real-time. His spelling began to fall apart about 90 minutes ago.</p><p>UPDATE 2: I received an update from the officer. He returned to Andrew’s house and explained that if the harassment continued, he would have to take out a warrant. Apparently Andrew is not so far gone that he wishes to risk arrest. That appears to have resolved the immediate situation, but to the extent that the uncharacteristic behavior was indicative of a deeper problem, I don’t see how it will resolve anything in the longer term. So, we’ll see.</p></div>",
  "content_text": "The troll from Hendersonville, Tennesee who goes by Andrew Spooner Jr. is back so I’ve turned the moderation back on until further notice. I suspect we’re dealing with an “off his meds” situation here, because the guy has been posting literally hundreds of comments, many of them vulgar references to African-American genitalia.\nOne thing a lot of you probably don’t realize is how much goes on behind the scenes to prevent trolls, lunatics, and attention-seekers from disrupting the discourse here. The three of us, Matt, Markku, and I, deal with these attempted disruptions, both purposeful and incidental, every single day. All your comments will appear in short order, they simply won’t appear instantaneously. We’re not doing this to control your comments, but to prevent them from disappearing in a flood of lunacy.\nTo put it in perspective, in the last 26 minutes alone he left 114 comments, many of them identical to this.\nI am slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane. I\nam slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane. I\nam slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane. I\nam slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane. I\nam slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane. I\nam slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane. I\nam slowly but surely driving Vox Day insane. I am slowly but surely\ndriving Vox Day insane. I am slowly but surely driving Vox Day insane.\nApparently it isn’t only SJWs who psychologically project. His object, in his own words, is to drive away the commenters unless he is permitted to comment without being subject to the rules.\n“I will drive every last commenter out of here until you take your rules and burn them Vox.”\nNeedless to say, that’s not going to happen. Here is an archive of\nhis short-lived blog\nand this is\nhis Blogger profile\n: It appears his address is here:\n119 Crossroad Drive\nHendersonville, TN 37075-4801\nThe Andrew Spooner there is the right age for one who reports being 21 in 2004. He ran a podcast called\nRadio Free Hendersonville\na few years ago. He also has a GoodReads account complete with a picture. His reading list appears to have been influenced by VP, which indicates that we’ve got the correct individual.\nAnyhow, I’m going to contact the Hendersonville police today as this guy has now gone from stalking to aggravated stalking under Tennessee Code 39-17-315 –\nStalking, aggravated stalking, and especially aggravated stalking.\nAndrew, it’s not about you having anything to hide or not, it’s about the fact that you just committed a Class C felony. You won’t be the first troll of this blog to find himself being interrogated by the police. Hell, you won’t even be the first one named Andrew.\nUPDATE: He’s now up to 1,220 comments in less than five hours and the rate is increasing. He’s reached a rate of up to 25 copy-pasted comments\nper minute\n. I have to confess, it’s somewhat fascinating to see the deterioration of a mind in real-time. His spelling began to fall apart about 90 minutes ago.\nUPDATE 2: I received an update from the officer. He returned to Andrew’s house and explained that if the harassment continued, he would have to take out a warrant. Apparently Andrew is not so far gone that he wishes to risk arrest. That appears to have resolved the immediate situation, but to the extent that the uncharacteristic behavior was indicative of a deeper problem, I don’t see how it will resolve anything in the longer term. So, we’ll see.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-17T08:17:00+00:00"
}