{
  "url": "https://voxday.net/2015/09/22/more-lessons-in-rhetoric/",
  "scraped_at": "2025-12-17T17:27:33.833518",
  "title": "More lessons in rhetoric",
  "date_display": "September 22, 2015",
  "date_iso": "2015-09-22T17:36:00+00:00",
  "date_from_url": "2015-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chublie Martin is now into his fourth day of demonstrating that he doesn’t care and he totally isn’t triggered <i>at all</i>:</p><blockquote class=\"tr_bq\"><p> Charlie Martin<br> The funniest part of this is you *still* haven’t thought of anything more creative than fat jokes.</br></p><p>Vox Day<br> It’s funny because you’re fat. And because you’re STILL crying into your gallon tub of Blue Bunny.</br></p><p>Thales<br> Watching @voxday tear down rhetoric speakers is like watching a Kung Fu master fight an overweight couch potato. Literally, in this case.</br></p><p>A Street in Texas<br> quit. Vox is dominating this thread 64RT/127FAV to 2/3</br></p><p>Charlie Martin<br> Go home. You’re not big enough to ride this ride.</br></p><p>Minion 278<br> what is the minimum weight limit, 350lbs?</br></p><p>Vox Day<br> Chublie, ARETHA FRANKLIN isn’t big enough to ride you.</br></p><p>Charlie Martin<br> Oh, don’t forget small penis.</br></p><p>Charlie Martin<br> You could say I have a big nose.</br></p><p>Charlie Martin<br> You could say I dress funny.</br></p><p>Charlie Martin<br> You could say I don’t speak Telegu.</br></p><p>Charlie Martin<br> You could make fun of my beard.</br></p><p>Charlie Martin<br> Mom was Jewish, you could call me a kike.</br></p><p>Charlie Martin<br> Look, I’ll give you some help: racial slurs. You could call me a Muslim,</br></p><p>Charlie Martin<br> I mean, OMG he might make another fat joke.</br></p><p>Vox Day<br> We didn’t make any fat jokes, Chublie. Your mother did.</br></p></blockquote><p>For some reason, those losing a rhetorical battle often resort to the fighting withdrawal of the overwhelmed loser: “real original”. But not only will you search Aristotle in vain for any reference to originality, you will learn that a) truth and b) repetition are among the most potent rhetorical tactics.</p><p>Of course, this isn’t a fair fight. Not only is Mr. Martin considerably less experienced at dealing with intelligent opponents than I am, his real handicap is socio-sexual. Gammas should never take on Alphas and they should never, ever take on Sigmas. An Alpha will stop beating on the Gamma when he feels that the challenge has been dealt with and his dominant position is secured. A Sigma will stop beating on the Gamma when it stops amusing him.</p><p>This can, as we know, take a considerable while.</p></div>",
  "content_text": "Chublie Martin is now into his fourth day of demonstrating that he doesn’t care and he totally isn’t triggered\nat all\n:\nCharlie Martin\nThe funniest part of this is you *still* haven’t thought of anything more creative than fat jokes.\nVox Day\nIt’s funny because you’re fat. And because you’re STILL crying into your gallon tub of Blue Bunny.\nThales\nWatching @voxday tear down rhetoric speakers is like watching a Kung Fu master fight an overweight couch potato. Literally, in this case.\nA Street in Texas\nquit. Vox is dominating this thread 64RT/127FAV to 2/3\nCharlie Martin\nGo home. You’re not big enough to ride this ride.\nMinion 278\nwhat is the minimum weight limit, 350lbs?\nVox Day\nChublie, ARETHA FRANKLIN isn’t big enough to ride you.\nCharlie Martin\nOh, don’t forget small penis.\nCharlie Martin\nYou could say I have a big nose.\nCharlie Martin\nYou could say I dress funny.\nCharlie Martin\nYou could say I don’t speak Telegu.\nCharlie Martin\nYou could make fun of my beard.\nCharlie Martin\nMom was Jewish, you could call me a kike.\nCharlie Martin\nLook, I’ll give you some help: racial slurs. You could call me a Muslim,\nCharlie Martin\nI mean, OMG he might make another fat joke.\nVox Day\nWe didn’t make any fat jokes, Chublie. Your mother did.\nFor some reason, those losing a rhetorical battle often resort to the fighting withdrawal of the overwhelmed loser: “real original”. But not only will you search Aristotle in vain for any reference to originality, you will learn that a) truth and b) repetition are among the most potent rhetorical tactics.\nOf course, this isn’t a fair fight. Not only is Mr. Martin considerably less experienced at dealing with intelligent opponents than I am, his real handicap is socio-sexual. Gammas should never take on Alphas and they should never, ever take on Sigmas. An Alpha will stop beating on the Gamma when he feels that the challenge has been dealt with and his dominant position is secured. A Sigma will stop beating on the Gamma when it stops amusing him.\nThis can, as we know, take a considerable while.",
  "tags": [
    "debate",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-22T16:36:00+00:00"
}