{
  "url": "https://voxday.net/2015/09/27/nero-eviscerates-popeha/",
  "scraped_at": "2025-12-17T17:28:08.729376",
  "title": "Nero eviscerates PopeHat",
  "date_display": "September 27, 2015",
  "date_iso": "2015-09-27T12:03:00+00:00",
  "date_from_url": "2015-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Popehat project–endless, tedious, insufferably smug posts about<br> minutiae–only really works if you read your own goddamn sources.</br></i></p><p><i>Top tip for bloggers whose raison d’etre is smugly correcting others: actually read reports before posting about them.</i></p><p>Milo is referring to <a href=\"https://popehat.com/2015/09/24/a-few-comments-on-the-un-broadband-commissions-cyber-violence-against-women-and-girls-report/#comments\">this amusingly clueless post</a> by Ken White, in which the inveterate champion of free speech flirts with abandoning his principles because a) he doesn’t like #GamerGate, b) he doesn’t like certain GamerGaters, including me, and c) girls had feelbadz! It’s a pity, because the guy has done some genuinely good work defending free speech in the past, but has somehow failed to recognize that SJWs represent one of the most serious enemies that his chosen cause has ever known.</p><p>Ken tried to belatedly explain his failure to bother reading the entire UN report before responding to it in an update.</p><blockquote class=\"tr_bq\"><p> Further information suggests I was far too benefit-of-the doubt here, which is what happens when you write fast and when you generally despise some of the people involved. Some of this is still right, but regard the conclusions and characterizations with skepticism. Taking a second look. See, e.g., the fact that they cited this [footnote 118] for the video game discussion I cite below. When I’m wrong I’m wrong. Will revisit.</p></blockquote><p>Hey, I think we all understand that there is no time for actually “reading” things or ensuring one is accurately “informed” before leaping to the defense of a woman experiencing feelbads; it is a white knight’s pleasure to destroy his own reputation if by doing so he can save a fair maiden from even a single incident of cyberviolence.</p><p>I haven’t read the report myself nor do I have any intention of doing so. I have not hitherto found either the United Nations or Literally Who to be interesting or even remotely credible. But I do find Ken’s excuse-making to be fairly typical of the moderates who are always happy to bend over backward to rationalize the most blatantly dishonest SJW behavior while repeatedly casting aspersions at those who actually stand up to them. And I expect there will be further backtracking on the subject, as I would be very surprised if the SJWs responsible for the report got anything right at all.</p><p>“Cyberviolence” is a false and deceptive issue. I have been the recipient of far more “cyberviolence” and death threats than all of the Literally Whos combined, and for much longer; if it is such a serious issue then why hasn’t the UN or Ken White rushed to <i>my </i>defense at any time in the last 14 years?</p><p>When I reviewed and critiqued the economics study on immigration and jobs here yesterday and the day before, I gave the benefit of the doubt to the economists whose views on immigration creating jobs opposed my own. I interpreted every statistic and every assumption in a manner that favored their perspective, not mine. That is exactly what you must do if you wish to provide a serious analysis that will withstand objective review. But by his own admission, Ken White gives the benefit of the doubt to those who oppose people he generally despises. And that is why, despite his legal work on behalf of free speech, he cannot be considered an intellectually credible individual.</p><p><a href=\"https://popehat.com/2015/09/24/a-few-comments-on-the-un-broadband-commissions-cyber-violence-against-women-and-girls-report/#comment-1324322\">Case in point</a>:</p><blockquote class=\"tr_bq\"><p> So there’s a solution to, that you know. Don’t read the blog any more. Unfollow the Twitter feed. Look for someone whose viewpoint is more acceptable to you. Maybe even write it up yourself.</p><p>But that’s not the GamerGate way.</p><p>Also, note how angry you are, and then look at the original again. I warned that UN speech restrictions are suspicious, I pointed to multiple things to be concerned about, and I even questioned the content at issue — I just didn’t see how crazy the sourcing was, yet. And I suggested that any actual codes that come out of it should be examined carefully.</p><p>But none of that is enough for you. You want hate. It’s not enough for you unless I excoriate the people you hate.</p><p>That’s why normal people don’t take you seriously.</p></blockquote><p>This is deeply amusing coming from an individual who is <i>literally </i>mentally unstable. How would he know what normal people take seriously? Ken, you’re not normal. You’re not honest. You’re not intellectually rigorous. And you’re not credible. People like me would be delighted to continue to ignore you, but you go out of your way to attack us online, both on PopeHat and on Twitter.</p><p>Neither of the two commenters was demanding that Ken hate or excoriate anyone, they were simply expecting him to show at least a modicum of discernment concerning various individuals and institutions widely known to be less than entirely truthful. He failed to do so, and when rightly taken to task for it, he completely mischaracterized their responses.</p><p>Of course, it does make a certain amount of sense that he would side with the SJW whack jobs. Birds of a feather and all that. And as we all know, <i>SJWs always lie</i>.</p></div>",
  "content_text": "The Popehat project–endless, tedious, insufferably smug posts about\nminutiae–only really works if you read your own goddamn sources.\nTop tip for bloggers whose raison d’etre is smugly correcting others: actually read reports before posting about them.\nMilo is referring to\nthis amusingly clueless post\nby Ken White, in which the inveterate champion of free speech flirts with abandoning his principles because a) he doesn’t like #GamerGate, b) he doesn’t like certain GamerGaters, including me, and c) girls had feelbadz! It’s a pity, because the guy has done some genuinely good work defending free speech in the past, but has somehow failed to recognize that SJWs represent one of the most serious enemies that his chosen cause has ever known.\nKen tried to belatedly explain his failure to bother reading the entire UN report before responding to it in an update.\nFurther information suggests I was far too benefit-of-the doubt here, which is what happens when you write fast and when you generally despise some of the people involved. Some of this is still right, but regard the conclusions and characterizations with skepticism. Taking a second look. See, e.g., the fact that they cited this [footnote 118] for the video game discussion I cite below. When I’m wrong I’m wrong. Will revisit.\nHey, I think we all understand that there is no time for actually “reading” things or ensuring one is accurately “informed” before leaping to the defense of a woman experiencing feelbads; it is a white knight’s pleasure to destroy his own reputation if by doing so he can save a fair maiden from even a single incident of cyberviolence.\nI haven’t read the report myself nor do I have any intention of doing so. I have not hitherto found either the United Nations or Literally Who to be interesting or even remotely credible. But I do find Ken’s excuse-making to be fairly typical of the moderates who are always happy to bend over backward to rationalize the most blatantly dishonest SJW behavior while repeatedly casting aspersions at those who actually stand up to them. And I expect there will be further backtracking on the subject, as I would be very surprised if the SJWs responsible for the report got anything right at all.\n“Cyberviolence” is a false and deceptive issue. I have been the recipient of far more “cyberviolence” and death threats than all of the Literally Whos combined, and for much longer; if it is such a serious issue then why hasn’t the UN or Ken White rushed to\nmy\ndefense at any time in the last 14 years?\nWhen I reviewed and critiqued the economics study on immigration and jobs here yesterday and the day before, I gave the benefit of the doubt to the economists whose views on immigration creating jobs opposed my own. I interpreted every statistic and every assumption in a manner that favored their perspective, not mine. That is exactly what you must do if you wish to provide a serious analysis that will withstand objective review. But by his own admission, Ken White gives the benefit of the doubt to those who oppose people he generally despises. And that is why, despite his legal work on behalf of free speech, he cannot be considered an intellectually credible individual.\nCase in point\n:\nSo there’s a solution to, that you know. Don’t read the blog any more. Unfollow the Twitter feed. Look for someone whose viewpoint is more acceptable to you. Maybe even write it up yourself.\nBut that’s not the GamerGate way.\nAlso, note how angry you are, and then look at the original again. I warned that UN speech restrictions are suspicious, I pointed to multiple things to be concerned about, and I even questioned the content at issue — I just didn’t see how crazy the sourcing was, yet. And I suggested that any actual codes that come out of it should be examined carefully.\nBut none of that is enough for you. You want hate. It’s not enough for you unless I excoriate the people you hate.\nThat’s why normal people don’t take you seriously.\nThis is deeply amusing coming from an individual who is\nliterally\nmentally unstable. How would he know what normal people take seriously? Ken, you’re not normal. You’re not honest. You’re not intellectually rigorous. And you’re not credible. People like me would be delighted to continue to ignore you, but you go out of your way to attack us online, both on PopeHat and on Twitter.\nNeither of the two commenters was demanding that Ken hate or excoriate anyone, they were simply expecting him to show at least a modicum of discernment concerning various individuals and institutions widely known to be less than entirely truthful. He failed to do so, and when rightly taken to task for it, he completely mischaracterized their responses.\nOf course, it does make a certain amount of sense that he would side with the SJW whack jobs. Birds of a feather and all that. And as we all know,\nSJWs always lie\n.",
  "tags": [
    "#GamerGate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-27T11:03:00+00:00"
}