{
  "url": "https://voxday.net/2015/09/20/never-apologize-to-sjws/",
  "scraped_at": "2025-12-17T17:27:17.944119",
  "title": "Never apologize to SJWs",
  "date_display": "September 20, 2015",
  "date_iso": "2015-09-20T10:06:00+00:00",
  "date_from_url": "2015-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or to the media, as both Donald Trump and Ann Coulter, among others, <a href=\"http://www.nationalreview.com/article/424239/donald-trump-ann-coulter-no-apologies-conservatism?utm_campaign=trueAnthem%3A+Trending+Content&amp;utm_content=55fd8e6a04d30162e1000001&amp;utm_medium=trueAnthem&amp;utm_source=twitter\">have repeatedly demonstrated</a>:</p><blockquote class=\"tr_bq\"><p> Appearing with Jimmy Fallon on the Tonight Show, Donald Trump was in the mood to tweak his own persona — to a point. “I think apologizing’s a great thing,” he said. “But you have to be wrong. I will absolutely apologize, sometime in the hopefully distant future, if I’m ever wrong.”</p><p>It’s funny because it’s true: Trump’s steadfast refusal to apologize for his controversial antics may be the most striking thing about him. A significant portion of the Republican base craves it, and a handful of pro-Trump conservative pundits does, too. None of them looms larger, perhaps, than Ann Coulter.</p><p>It makes sense. Trump has given political expression to a model of conservative discourse perfected by Coulter and subsequently emulated by Glenn Beck, Mark Levin, Michael Savage, and others: 1) Say something controversial or provocative and get a ton of attention in the process. 2) When the media and the Left inevitably demand an apology, adamantly refuse to provide one, driving your critics batty and burnishing your conservative credentials with the base. It’s been Coulter’s modus operandi for her entire, lucrative career, and now Trump has brought it to the campaign trail: A real conservative never says he’s sorry….</p><p>Coulter has made a fine living with the same mantra for decades. “Never apologize, at least not for what liberals want you to apologize for,” she advised in her 2004 book, How to Talk to a Liberal (If You Must). It’s a rule her critics know she follows all-too-well.</p><p>During the George W. Bush years, Coulter’s use of the terms “raghead” and “faggot” in speeches at CPAC generated some furious reactions but no public contrition. In 2012, the Today Show spotlighted a father who was demanding that she apologize for using the term “retarded,” and cease using it in the future. She insisted she wasn’t really referring to the mentally handicapped and said, “screw them!” when asked about her critics in a radio interview with Alan Colmes. (As recently as this May, Coulter wrote a column entitled, “Knowing What We Know Now, Would You Say Jeb Bush Is Retarded?”) Later that year, a Latino GOP group demanded she apologize for a column entitled, “America Nears el Tipping Pointo.” She declined to do so.</p><p>Coulter’s remarks have attracted the ire of bigger fish on the right, as well. A few months ago, Fox News’s Greta Van Susteren called on her to apologize for saying that South Carolina governor Nikki Haley, who is of Indian Sikh heritage, “is an immigrant and does not understand America’s history.” No such apology was forthcoming.</p></blockquote><p>What I find remarkable is the way that despite the clear and conclusive evidence that a public apology <i>always </i>does more harm than good, people are STILL dumb enough to offer up public apologies. Matt Damon is only the latest to learn this very simple and obvious fact; Brad Torgersen learned the same thing when he made the mistake of apologizing to John Scalzi. As will not surprise anyone who has read <i><b><a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\">SJWs Always Lie</a></b></i>, Scalzi immediately took Brad’s apology and turned it into a weapon he used to launch an attack on the Sad Puppy leader.</p><p>Look at it this way. An apology is a confession. And what do prosecutors do with confessions? <i>They use it to prosecute the person who gave it to them. </i></p><p>If you’re ever being put under pressure to apologize for something, ask yourself this question: What are the real objectives of those who are putting pressure on me? If they happen to be your critics or political opponents, you can be confident their real objectives don’t happen to include your best interests.</p></div>",
  "content_text": "Or to the media, as both Donald Trump and Ann Coulter, among others,\nhave repeatedly demonstrated\n:\nAppearing with Jimmy Fallon on the Tonight Show, Donald Trump was in the mood to tweak his own persona — to a point. “I think apologizing’s a great thing,” he said. “But you have to be wrong. I will absolutely apologize, sometime in the hopefully distant future, if I’m ever wrong.”\nIt’s funny because it’s true: Trump’s steadfast refusal to apologize for his controversial antics may be the most striking thing about him. A significant portion of the Republican base craves it, and a handful of pro-Trump conservative pundits does, too. None of them looms larger, perhaps, than Ann Coulter.\nIt makes sense. Trump has given political expression to a model of conservative discourse perfected by Coulter and subsequently emulated by Glenn Beck, Mark Levin, Michael Savage, and others: 1) Say something controversial or provocative and get a ton of attention in the process. 2) When the media and the Left inevitably demand an apology, adamantly refuse to provide one, driving your critics batty and burnishing your conservative credentials with the base. It’s been Coulter’s modus operandi for her entire, lucrative career, and now Trump has brought it to the campaign trail: A real conservative never says he’s sorry….\nCoulter has made a fine living with the same mantra for decades. “Never apologize, at least not for what liberals want you to apologize for,” she advised in her 2004 book, How to Talk to a Liberal (If You Must). It’s a rule her critics know she follows all-too-well.\nDuring the George W. Bush years, Coulter’s use of the terms “raghead” and “faggot” in speeches at CPAC generated some furious reactions but no public contrition. In 2012, the Today Show spotlighted a father who was demanding that she apologize for using the term “retarded,” and cease using it in the future. She insisted she wasn’t really referring to the mentally handicapped and said, “screw them!” when asked about her critics in a radio interview with Alan Colmes. (As recently as this May, Coulter wrote a column entitled, “Knowing What We Know Now, Would You Say Jeb Bush Is Retarded?”) Later that year, a Latino GOP group demanded she apologize for a column entitled, “America Nears el Tipping Pointo.” She declined to do so.\nCoulter’s remarks have attracted the ire of bigger fish on the right, as well. A few months ago, Fox News’s Greta Van Susteren called on her to apologize for saying that South Carolina governor Nikki Haley, who is of Indian Sikh heritage, “is an immigrant and does not understand America’s history.” No such apology was forthcoming.\nWhat I find remarkable is the way that despite the clear and conclusive evidence that a public apology\nalways\ndoes more harm than good, people are STILL dumb enough to offer up public apologies. Matt Damon is only the latest to learn this very simple and obvious fact; Brad Torgersen learned the same thing when he made the mistake of apologizing to John Scalzi. As will not surprise anyone who has read\nSJWs Always Lie\n, Scalzi immediately took Brad’s apology and turned it into a weapon he used to launch an attack on the Sad Puppy leader.\nLook at it this way. An apology is a confession. And what do prosecutors do with confessions?\nThey use it to prosecute the person who gave it to them.\nIf you’re ever being put under pressure to apologize for something, ask yourself this question: What are the real objectives of those who are putting pressure on me? If they happen to be your critics or political opponents, you can be confident their real objectives don’t happen to include your best interests.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-20T09:06:00+00:00"
}