{
  "url": "https://voxday.net/2015/09/12/on-board-trump-train/",
  "scraped_at": "2025-12-17T17:26:19.751965",
  "title": "On board the Trump train",
  "date_display": "September 12, 2015",
  "date_iso": "2015-09-12T08:52:00+00:00",
  "date_from_url": "2015-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Donald Trump addresses <a href=\"http://blogs.wsj.com/washwire/2015/09/11/donald-trump-says-immigrant-deportations-done-in-two-years/\">the only issue that matters</a>:</p><blockquote class=\"tr_bq\"><p> Donald Trump estimated that it will take 18 months to two years to get the roughly 11 million immigrants living in the U.S. illegally to leave the country, and that he would then build a wall running along the border with Mexico.</p><p>The businessman’s statement made on a call with Alabama Republicans Thursday night added a bit of specificity to the Republican presidential frontrunner’s hardline stance on immigration. Mr. Trump released a six-page policy paper on immigration last month, and reporters have asked for details about how it would work since….</p><p>On the call, Mr. Trump was asked for details about how long it would<br> take to round up illegal immigrants living in the U.S., with the<br> questioner asking if five or ten years was an appropriate timeframe. Mr.<br> Trump said his two year benchmark could be met with “really good<br> management.”</br></br></br></br></p><p>“We have to get them out. If we have wonderful cases, they can come<br> back in but they have to come back in legally,” Mr. Trump said in an<br> audio clip posted on YouTube Thursday night by a person on the call.</br></br></p><p>Mr. Trump’s plan has been denounced by Democrats and many rival<br> Republicans, who have called it impractical and immoral, among other<br> criticisms. Mr. Trump said he would remove illegal immigrants from the country<br> “so fast that your head will spin,” and long before he could embark on<br> his plan to build a wall spanning the 1,900 mile border between the U.S.<br> and Mexico.</br></br></br></br></br></p></blockquote><p>That’s good enough for me. I’d like to see him pledge to begin deporting legal immigrants, but that would probably be too much for the average voter and deporting 11 million invaders is considerably better than any other candidate, Republican or Democrat, is going to do. And furthermore, it’s worth noting that Trump said he intends to deport ALL the illegal invaders, the 11 million is merely an estimate.</p><p>It doesn’t matter what else Trump thinks or how crazy his policies might be. Immigration is now the only issue that matters to America. There is simply no justification for supporting any other Republican candidate. Is it possible that he’s lying? Sure. But we KNOW all the other Republican candidates are, especially Carson, who is anti-gun.</p></div>",
  "content_text": "Donald Trump addresses\nthe only issue that matters\n:\nDonald Trump estimated that it will take 18 months to two years to get the roughly 11 million immigrants living in the U.S. illegally to leave the country, and that he would then build a wall running along the border with Mexico.\nThe businessman’s statement made on a call with Alabama Republicans Thursday night added a bit of specificity to the Republican presidential frontrunner’s hardline stance on immigration. Mr. Trump released a six-page policy paper on immigration last month, and reporters have asked for details about how it would work since….\nOn the call, Mr. Trump was asked for details about how long it would\ntake to round up illegal immigrants living in the U.S., with the\nquestioner asking if five or ten years was an appropriate timeframe. Mr.\nTrump said his two year benchmark could be met with “really good\nmanagement.”\n“We have to get them out. If we have wonderful cases, they can come\nback in but they have to come back in legally,” Mr. Trump said in an\naudio clip posted on YouTube Thursday night by a person on the call.\nMr. Trump’s plan has been denounced by Democrats and many rival\nRepublicans, who have called it impractical and immoral, among other\ncriticisms. Mr. Trump said he would remove illegal immigrants from the country\n“so fast that your head will spin,” and long before he could embark on\nhis plan to build a wall spanning the 1,900 mile border between the U.S.\nand Mexico.\nThat’s good enough for me. I’d like to see him pledge to begin deporting legal immigrants, but that would probably be too much for the average voter and deporting 11 million invaders is considerably better than any other candidate, Republican or Democrat, is going to do. And furthermore, it’s worth noting that Trump said he intends to deport ALL the illegal invaders, the 11 million is merely an estimate.\nIt doesn’t matter what else Trump thinks or how crazy his policies might be. Immigration is now the only issue that matters to America. There is simply no justification for supporting any other Republican candidate. Is it possible that he’s lying? Sure. But we KNOW all the other Republican candidates are, especially Carson, who is anti-gun.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-12T07:52:00+00:00"
}