{
  "url": "https://voxday.net/2015/09/04/one-week-at-1/",
  "scraped_at": "2025-12-17T17:25:28.334455",
  "title": "One week at #1",
  "date_display": "September 4, 2015",
  "date_iso": "2015-09-04T09:21:00+00:00",
  "date_from_url": "2015-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Interest in <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><i><b>SJWs Always Lie: Taking Down the Thought Police</b></i></a> remains strong; it has 132 reviews and ranks in the Amazon top 500, which has been enough to keep it at #1 in Political Philosophy for a solid week now. Thanks to all of you for that; none of that happens without you buying the book, talking it up on Twitter and Facebook, and reviewing it. I hope you will continue to spread the word about it.</p><p>I’m gratified by both the positive responses from the Dread Ilk, #GamerGate, and the Alt-Right as well as the negative responses from the SJWs. Here are two recently published quasi-reviews, <a href=\"http://therev3.blogspot.com/2015/09/sjws-always-lie-non-review.html\">one from the gentleman plotting against me</a>, another from a woman who is a strong supporter of Castalia House.</p><blockquote class=\"tr_bq\"><p> SJWs is primarily a series of Scripts. For PUA manuals, these Scripts are opening lines, moving from one phase to another, shifting venues, et al. In SJWs, the first Script is the anatomy of a SJW attack (Point and Shriek and so on) and the second Script is the proper response (Don’t Apologize and so on).</p><p>There is, of course, more to this book than the two Scripts, but as with PUA literature, it is mostly there either to explain and support the Scripts or to explain and support the Worldview. There are calls to arms and sections on how to SJW-proof an organization, but this is so much window dressing. What really matters are the Scripts and canned routines.</p><p>The breakdown of dialectic vs. rhetoric is a good one, although it does claim that Leftists are incapable of dialectic reason. Again, this may be somewhat justified. After a year of following Vox, I have not yet seen an opponent attack him with a dialectic argument, for whatever reason.</p><p>At the end of the day, SJWs Always Lie will likely do exactly what it set out to do. The culture wars within fandom will escalate, the disqualification arms race will heat up, and both sides will steadily lose the ability to see the other side as human beings. I will never say that both sides are the same, but they do have one thing in common: the constant dehumanization of the other side.</p><p>Vox Day suggests that the only way to combat the intellectual policing of the Left is for the Right to engage in intellectual policing. This is what we have come to, and why I find Vox’s posturing as a hero of free speech disingenuous. Apparently the Hugo SJWs are not the only ones willing to burn down the city to save it.</p></blockquote><p>It’s a fair and intelligent non-review, but I think Rev 3.0 makes the same mistake so many moderates do of confusing the TACTIC with the OBJECTIVE. There is nothing disingenuous about thought-policing SJWs in defense of free speech; how else does he think their attempts to exert control over everyone else’s thoughts and speech are going to be combated?</p><p>Once your opponent introduces tanks to the battlefield, if you do not meet them with anti-tank measures, including more and better tanks, you will lose. Rev 3.0’s implied notion of nobly relying upon <i>even more free speech</i> to combat the SJW speech police reminds me of the WWI French military doctrine that relying upon <i>élan </i>and <i>esprit de corps</i> was the right way to defeat barbed wire, trenches, and emplaced machine guns.</p><p>Isn’t it possible that by utilizing their tactics we will turn into SJWs? It may be theoretically possible but it’s not even remotely likely. We don’t share their ideals, their goals, or their slavering hunger for control over others’ thoughts and words. The Marines didn’t magically transform into Nazis even though they adopted the maneuver warfare tactics that were developed by the Wehrmacht, and we won’t turn into SJWs just because we have turned their own tactics against them.</p><p>As for why they won’t attack me with calm, rational, and reasoned arguments, it is because most of them are incapable of dialectic. The few that can handle it also recognize that I am much, much better at it than they are. They don’t flee from public debate with me because they are afraid they will defeat me too resoundingly and expose my intellectual limitations, but because they fear I will do that to them.</p><p><a href=\"http://www.counter-currents.com/2015/09/is-god-the-new-yoda/\">Ann Sterzinger’s review</a> is rather less coherent, and transforms into a Hugo 2015 summary before transmogrifying entirely into a review of John Wright’s <i>Somewhither</i> in which she rather precisely nails some of the novel’s weaker points. Unless she didn’t.</p><blockquote class=\"tr_bq\"><p> Day’s brand-new nonfiction book on Castalia—SJWs Always Lie: Taking Down the Thought Police—is half Rabid Puppies memoir, half field manual for dealing with the sort of people who repeatedly call Day a white supremacist even though he repeatedly reminds them that he’s part Native American, and won’t shut up about his great-grandfather who was some kind of Mexican war hero.</p></blockquote><p>The negative reaction by the SJWs is very nearly as satisfying, as the only time I have seen levels of butthurt this high was the day that that the 2015 Hugo nominations were made public.</p><ul><li>this is an example of somebody piggybacking on a topic he knows will be popular for his own obvious self-aggrandizement</li><li>The book itself is named after one<br> of his “Three Laws of Social Justice Warriors”, a reference to Asimov’s<br> Three Laws of Robotics </br></br></li><li>Adorable whining from a guy with a hardon about losing at the Hugo’s</li><li>An unintentionally amusing account of how a pudgy, angry, little boy grows up into a pudgy, angry, little man.</li><li>This book is very poorly reasoned and complete garbage.  The title is itself inaccurate and rhetorical fallacy.   </li></ul><p>UPDATE: Greg Johnson has posted a long review <a href=\"http://www.counter-currents.com/2015/09/defeating-the-left/\">at Counter-Currents</a>:</p><blockquote class=\"tr_bq\"><p> At the risk of sounding like the Oprah of the New Right, I want every one of you to buy and read this book. Vox Day has written an indispensable manual for resisting the politically correct witch-hunts of so-called “Social Justice Warriors….</p><p>Chapter 8, “Striking Back at the Thought Police” and Chapter 9, “Winning the Social Justice War,” are the most exciting parts of the book, for Day makes it clear that he is not content with just fending off the Left, but on rolling it back completely. This is what sets him miles apart from mainstream conservatism, which has never conserved anything from the Left, much less taken back lost ground. I will just deal with the highlights of these chapters.</p><p>Day’s first strategic principle is to know oneself and one’s enemy, and act accordingly. Day points out that the Right has a systematic advantage over the Left, because the Left is based on lies; Leftists do not understand themselves or their enemies, but we do.</p><p>One of Day’s most important principles is to reject the ideals of SJWs: equality, diversity, tolerance, and progress. Day flatly rejects equality as a fact or a moral ideal. He flatly rejects the daft notion that diversity is a strength. He does not measure progress in terms of equality and diversity, but in terms of science and technology, and points out that these forms of progress are incompatible with the first two ideals. He dismisses tolerance as “little more than a cloak for SJW entryism,” noting that SJWs always demand it but never practice it.</p><p>Day simply denies the Left the moral standing to judge the Right. He dismisses them as followers of false ideals that lead to injustice and tyranny.  </p></blockquote><ul></ul></div>",
  "content_text": "Interest in\nSJWs Always Lie: Taking Down the Thought Police\nremains strong; it has 132 reviews and ranks in the Amazon top 500, which has been enough to keep it at #1 in Political Philosophy for a solid week now. Thanks to all of you for that; none of that happens without you buying the book, talking it up on Twitter and Facebook, and reviewing it. I hope you will continue to spread the word about it.\nI’m gratified by both the positive responses from the Dread Ilk, #GamerGate, and the Alt-Right as well as the negative responses from the SJWs. Here are two recently published quasi-reviews,\none from the gentleman plotting against me\n, another from a woman who is a strong supporter of Castalia House.\nSJWs is primarily a series of Scripts. For PUA manuals, these Scripts are opening lines, moving from one phase to another, shifting venues, et al. In SJWs, the first Script is the anatomy of a SJW attack (Point and Shriek and so on) and the second Script is the proper response (Don’t Apologize and so on).\nThere is, of course, more to this book than the two Scripts, but as with PUA literature, it is mostly there either to explain and support the Scripts or to explain and support the Worldview. There are calls to arms and sections on how to SJW-proof an organization, but this is so much window dressing. What really matters are the Scripts and canned routines.\nThe breakdown of dialectic vs. rhetoric is a good one, although it does claim that Leftists are incapable of dialectic reason. Again, this may be somewhat justified. After a year of following Vox, I have not yet seen an opponent attack him with a dialectic argument, for whatever reason.\nAt the end of the day, SJWs Always Lie will likely do exactly what it set out to do. The culture wars within fandom will escalate, the disqualification arms race will heat up, and both sides will steadily lose the ability to see the other side as human beings. I will never say that both sides are the same, but they do have one thing in common: the constant dehumanization of the other side.\nVox Day suggests that the only way to combat the intellectual policing of the Left is for the Right to engage in intellectual policing. This is what we have come to, and why I find Vox’s posturing as a hero of free speech disingenuous. Apparently the Hugo SJWs are not the only ones willing to burn down the city to save it.\nIt’s a fair and intelligent non-review, but I think Rev 3.0 makes the same mistake so many moderates do of confusing the TACTIC with the OBJECTIVE. There is nothing disingenuous about thought-policing SJWs in defense of free speech; how else does he think their attempts to exert control over everyone else’s thoughts and speech are going to be combated?\nOnce your opponent introduces tanks to the battlefield, if you do not meet them with anti-tank measures, including more and better tanks, you will lose. Rev 3.0’s implied notion of nobly relying upon\neven more free speech\nto combat the SJW speech police reminds me of the WWI French military doctrine that relying upon\nélan\nand\nesprit de corps\nwas the right way to defeat barbed wire, trenches, and emplaced machine guns.\nIsn’t it possible that by utilizing their tactics we will turn into SJWs? It may be theoretically possible but it’s not even remotely likely. We don’t share their ideals, their goals, or their slavering hunger for control over others’ thoughts and words. The Marines didn’t magically transform into Nazis even though they adopted the maneuver warfare tactics that were developed by the Wehrmacht, and we won’t turn into SJWs just because we have turned their own tactics against them.\nAs for why they won’t attack me with calm, rational, and reasoned arguments, it is because most of them are incapable of dialectic. The few that can handle it also recognize that I am much, much better at it than they are. They don’t flee from public debate with me because they are afraid they will defeat me too resoundingly and expose my intellectual limitations, but because they fear I will do that to them.\nAnn Sterzinger’s review\nis rather less coherent, and transforms into a Hugo 2015 summary before transmogrifying entirely into a review of John Wright’s\nSomewhither\nin which she rather precisely nails some of the novel’s weaker points. Unless she didn’t.\nDay’s brand-new nonfiction book on Castalia—SJWs Always Lie: Taking Down the Thought Police—is half Rabid Puppies memoir, half field manual for dealing with the sort of people who repeatedly call Day a white supremacist even though he repeatedly reminds them that he’s part Native American, and won’t shut up about his great-grandfather who was some kind of Mexican war hero.\nThe negative reaction by the SJWs is very nearly as satisfying, as the only time I have seen levels of butthurt this high was the day that that the 2015 Hugo nominations were made public.\nthis is an example of somebody piggybacking on a topic he knows will be popular for his own obvious self-aggrandizement\nThe book itself is named after one\nof his “Three Laws of Social Justice Warriors”, a reference to Asimov’s\nThree Laws of Robotics\nAdorable whining from a guy with a hardon about losing at the Hugo’s\nAn unintentionally amusing account of how a pudgy, angry, little boy grows up into a pudgy, angry, little man.\nThis book is very poorly reasoned and complete garbage.  The title is itself inaccurate and rhetorical fallacy.\nUPDATE: Greg Johnson has posted a long review\nat Counter-Currents\n:\nAt the risk of sounding like the Oprah of the New Right, I want every one of you to buy and read this book. Vox Day has written an indispensable manual for resisting the politically correct witch-hunts of so-called “Social Justice Warriors….\nChapter 8, “Striking Back at the Thought Police” and Chapter 9, “Winning the Social Justice War,” are the most exciting parts of the book, for Day makes it clear that he is not content with just fending off the Left, but on rolling it back completely. This is what sets him miles apart from mainstream conservatism, which has never conserved anything from the Left, much less taken back lost ground. I will just deal with the highlights of these chapters.\nDay’s first strategic principle is to know oneself and one’s enemy, and act accordingly. Day points out that the Right has a systematic advantage over the Left, because the Left is based on lies; Leftists do not understand themselves or their enemies, but we do.\nOne of Day’s most important principles is to reject the ideals of SJWs: equality, diversity, tolerance, and progress. Day flatly rejects equality as a fact or a moral ideal. He flatly rejects the daft notion that diversity is a strength. He does not measure progress in terms of equality and diversity, but in terms of science and technology, and points out that these forms of progress are incompatible with the first two ideals. He dismisses tolerance as “little more than a cloak for SJW entryism,” noting that SJWs always demand it but never practice it.\nDay simply denies the Left the moral standing to judge the Right. He dismisses them as followers of false ideals that lead to injustice and tyranny.",
  "tags": [
    "Book Review",
    "Castalia House",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-04T08:21:00+00:00"
}