{
  "url": "https://voxday.net/2015/09/01/rape-rape-always-lies/",
  "scraped_at": "2025-12-17T17:25:04.850839",
  "title": "Rape Rape always lies",
  "date_display": "September 1, 2015",
  "date_iso": "2015-09-01T12:00:00+00:00",
  "date_from_url": "2015-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George R. R. Martin tries to revise the Hugo Narrative on his Not A Blog because George R. R. Martin is an SJW, and as the book says, <a href=\"http://grrm.livejournal.com/440444.html\">SJWs always lie</a>:</p><blockquote class=\"tr_bq\"><p> The elimination of slates will be a huge step toward the end of hostilities. But there’s a second step that’s also necessary. One I have touched on many times before. We have to put an end to the name-calling. To the stupid epithets.</p><p>I have seen some hopeful signs on that front in some of the Hugo round-ups I’ve read. Puppies and Puppy sympathizers using terms like Fan (with a capital), or trufan, or anti-Puppy, all of which I am fine with. I am not fine with CHORF, ASP, Puppy-kicker, Morlock, SJW, Social Justice Bully, and some of the other stupid, offensive labels that some Pups (please note, I said SOME) have repeatedly used for describe their opponents since this whole thing began. I am REALLY not fine with the loonies on the Puppy side who find even those insults too mild, and prefer to call us Marxists, Maoists, feminazis, Nazis, Christ-hating Sodomites, and the like. There have been some truly insane analogies coming from the kennels too — comparisons to World War II, to the Nazi death camps, to ethnic cleansing. Guy, come on, cool down. WE ARE ARGUING ABOUT A LITERARY AWARD THAT BEGAN AS AN OLDSMOBILE HOOD ORNAMENT. Even getting voted below No Award is NOT the same as being put on a train to Auschwitz, and when you type shit like that, well…</p><p><i>I remember being called an asshole by you for pointing out that the Sad Puppies’ noms were as legitimate as anyone else’s. A LOT of people associated with the SP have been personally insulted by the Haydens and his crowd. I don’t see any apologies forthcoming, and I don’t expect one from you. And that was after I defended you repeatedly to the Puppies. I still think you’re a great writer, but I’m not so sure that you’re all that decent a man.</i><br> – jordan179</br></p><p>This is the kind of nasty stuff that will make reconciliation impossible. Sweeping statemnts like “a lot of people… have been personally insulted by the Haydens and his crowd” without any specifics or citations makes your assertions suspect from the first. And you can’t even get the names of the people you’re attacking right. They are the Nielsen-Haydens, not the Haydens.<br> – grrm</br></p></blockquote><p>Note that George Martin objects vociferously to his side being called Social Justice Warriors even though it is a name that self-professed SJWs originally gave themselves. Meanwhile, his side calls us “fascists”, “Neo-Nazis”, “thugs”, “sociopaths”, “sexist assbags”, “gibbering follow monkeys”, and “just straight-up assholes”, among many other names.</p><p>My dear GRRM, your side absolutely and unequivocally started this war of words. We, however, are going to finish it. You are not only dishonest, you are demonstrably wrong. You can’t even get the<br> names of the people you’re defending right! They are the Nielsen Haydens,<br> not the Nielsen-Haydens.</br></br></p><p>Those specifics you claimed to want are easily supplied. Almost all of the SJW name-calling long predates any Puppy-related name-calling. The 90 specific quotes provided below range from 2005 to 2015 and are but a few dozen of the hundreds of examples that could be cited.</p><p>So, you can take  your lies, George, and to paraphrase Patrick Nielsen<br> Hayden’s recent advice to John C. Wright, delivered just last week <i>to the man’s wife</i>, stick<br> them up your oversized posterior. You may be rich, but you’re not very smart, you’re not at all honest, and you’re still the same fat rape-obsessed gamma male that you’ve always been.</br></br></p><p>You’re a liar, George. A <i>proven </i>liar. I may be cruel and I may be arrogant and I may occasionally be mistaken, but unlike you, I am not stupid enough to lie about the past in public.</p><p> <a name=\"more\"></a><br> <b>Teresa Nielsen Hayden</b></br></p><p>(1) “It’s really, really obvious that VD is not acquainted with actual women. I don’t just mean sexual relations. I mean he’s had little or no social interaction of any sort.” (http://nielsenhayden.com/electrolite/archives/006122.html#76168)<br> (2) “It’s pretty clear that VD fears and dislikes women, and that his gender theories are a back-formation. It seems perfectly appropriate that he’s a fan of that patently misogynistic suspected female impersonator, Ann Coulter.” (ibid.)<br> (3) “a third-rate intellect” (http://nielsenhayden.com/electrolite/archives/006122.html#76250)<br> (4) “a tad unbalanced” (ibid.)<br> (5) “a generally unpleasant fellow” (ibid.)<br> (6) “Given your stated opinions on women, I’d love to see you take on the RWA. Bring a friend so there’ll be someone to take charge of the remains.”<br> (http://www.antipope.org/charlie/blogstatic/2007/11/sfwa_attempts_to_commit_public.html#comment-12114)<br> (7) “Anybody here in favor of turning Vox Day over to SFWA’s female members? I’d pay money to watch.” (ibid.)<br> (8) “Good heavens. Did you imagine you were worth arguing with? You aren’t.”<br> (http://www.antipope.org/charlie/blogstatic/<br> 2007/11/sfwa_attempts_to_commit_public.html#comment-12155)<br> (9) “Vox Day’s true opinion of women has always been clear to me: he’s terrified of them.” (http://www.antipope.org/charlie/blogstatic/<br> 2007/11/sfwa_attempts_to_commit_public.html#comment-12243)<br> (10) “He is a wuss.” (ibid.)<br> (11) “You’re also a singularly inept sockpuppet, O Bane/Vox/Theeeeeodore.” (ibid.)<br> (12) “out-of-the-closet racist” (http://nkjemisin.com/2008/09/too-late-for-sf/#comment-119)<br> (13) “obviously unbalanced” (ibid.)<br> (14) “been known to put in a good word for the Nazis” (ibid.)<br> (15) “Vox Day is unbalanced. His SFWA candidacy is a symptom, not a practical<br> undertaking.” (https://twitter.com/tnielsenhayden/status/323597546125672448)<br> (16) “I take it you think Cory should instead have taken his arguments to the private SFWA area on SFF Net, a toxic morass where he could have been pointlessly abused at great length by the whole pack of gargoyles: Jerry Pournelle, Andrew Burt, Bud Webster, Will Sanders, et cetera et al.: a stunningly unattractive proposition.”  (See: http://www.antipope.org/charlie/blogstatic/<br> 2007/11/sfwa_attempts_to_commit_public.html#comment-12244)<br> (17)  “I want the Justice Department to declare them a criminal organization<br> and hit them with felony charges. It would not be an excessive response<br> to their actions.” (http://nielsenhayden.com/makinglight/archives/016177.html#4059966)<br> (18) “The self-valorizing sociopath contingent seems to be involved.”<br> (19) “When you invite thugs into your argument, you’re not using them as shock troops; they’re using you as cover. And you’re pretty much guaranteeing that at some point in the future, you’ll wind up feebly protesting that you had no idea they’d do that. And maybe you didn’t; but you did know they were thugs.”</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b> Patrick Nielsen Hayden</b></p><p>(1) “The humor of the situation, in my opinion, is the ongoing degradation of the prestige of the once-coveted Nebula Award. Certainly if I were running a literary award that was widely perceived as being increasingly tarnished by arcane rules, unabashed logrolling, and general ridiculousness, my next move would definitely be to recruit me a yawping borderline anti-Semite and woman-hater for the award’s jury.”<br> (2)  “However, the mere fact someone’s crackpot notions about Jews or women<br> (or crop circles or ancient astronauts) can be defined as in some way<br> “political” doesn’t shield them from mockery.  Nor is it impermissible<br> to raise an amused eyebrow when the organization once run by Damon<br> Knight and Poul Anderson is reduced to running on the volunteer efforts<br> of chuckleheads you’d cross the street to avoid. As I’ve said more than once, I have very mixed feelings.  I do in<br> fact approve of my subculture’s habitual tolerance for head cases of all<br> sorts.  I also periodically feel, after glancing encounters with some<br> of them, like I need to go boil myself in antibiotics.”<br> (3)“An underreported aspect of being around for a long time: the horror of watching your onceadmired elders turn into blithering nincompoops.” – Patrick Nielsen Hayden (See: https://twitter.com/pnh/status/340787331067940864)<br> (4)  “Likewise, many people, me included, think that #Gamergate is an association of terrible human beings that we don’t want to see joining us.”<br> (5) “The SP campaign… rises all the way to “downright evil.””</br></br></br></br></br></br></br></br></br></br></br></br></p><p> <b>SFWA President Steven Gould</b></p><p>(1) “Does this mean we can’t make fun of Vox Day (Or VD as I like to call him) for his distressing use irrational arguments? Of course we can. It’s like finding one of those dishes of leftovers in the back of the refrigerator that is busy creating it’s own little ecosystem. You comment on it, you drop it in the trash, and you don’t swallow it.” – Steve Gould (See: http://nielsenhayden.com/electrolite/archives/006122.html#75922)</p><p><b>SFWA Vice-President Mary Robinette Kowal</b></p><p>(1) “Dear Twelve Rabid Weasels of SFWA, please shut the fuck up. I know you value your freedom of speech. Good on you. However there are 1788 other members of SFWA who also value their freedom of speech and manage to exercise it without being raging assholes…. Please quit. And by “quit” I mean, please quit SFWA in a huff. Please quit and complaining about how SFWA is censoring you for asking you to stop using hate speech. ” – Mary Robinette Kowal (See:<br> http://www.maryrobinettekowal.com/journal/dear-twelve-rabid-weasels-of-sfwa-please-shut-thefuck-up/)</br></p><p>And then there is the name-calling machine that is John Scalzi. Of course, this list of name-calling by Mr. Scalzi – which began before I’d ever heard of him – is mostly taken from my response to the SFWA report published in 2013 and is FAR from complete.</p><p><b>SFWA President John Scalzi</b></p><p>(1) “a jackass, and a fairly ignorant jackass at that”<br> (http://nielsenhayden.com/electrolite/archives/006122.html#75601)<br> (2) “his political jackassery” (ibid.)<br> (3) “of all the dumbassery Beale may be rightly accused of” (http://nielsenhayden.com/electrolite/archives/006122.html#75636)<br> (4) “chucklehead” (ibid.)<br> (5) “We may also equally and more simply posit that Vox has his head up his ass on this matter” (http://nielsenhayden.com/electrolite/archives/006122.html#75912)<br> (6) “the lunatic fringe” (http://nielsenhayden.com/electrolite/archives/006122.html#75914)<br> (7) “the willfully stupid” (ibid.)<br> (8) “your head is pretty far up your ass” (http://nielsenhayden.com/electrolite/archives/006122.html#75924)<br> (9) “when I call you the “lunatic fringe” I am discussing your hypoxic opinion” (ibid.)<br> (10) “I know quite a few devout followers of Christ who would also think you have your head up your ass regarding your opinion” (ibid.)<br> (11) “I’m also happy to say he’s got his head up his ass” (http://nielsenhayden.com/electrolite/archives/006122.html#75933)<br> (12) “I’m happy to grant that in other subjects, he may not exhibit such profound sphincto-cranial tendencies” (ibid.)<br> (13) “there’s a definite head-ass conjunction on his part” (ibid.)<br> (14) “a fascinating example of sphincto-cranial interaction” (ibid.)<br> (15) “You’re a “lunatic fringe”… because you hold a position that is clearly intellectually indefensible, yet appear to give it the same weight as fact.” (ibid.)<br> (16) “You’ll just be feeding his persecution complex. Lots of writers are jerkwads.”<br> (http://nielsenhayden.com/electrolite/archives/006122.html#75941)<br> (17) “his misogynistic jerk-like tendencies”<br> (http://nielsenhayden.com/electrolite/archives/006122.html#75945)<br/> (18) “Vox Day… may yet one day regret his sphincto-cranial position” (ibid.)<br/> (19) “His position isn’t right or left; it’s just stupid and sexist.” (ibid.)<br/> (20) “Nothing he’s written here suggests either sophistication or a sense of irony. The question was whether he was a garden-variety jerk or something else entirely. Looks like he’s in the “something else” camp.” (http://nielsenhayden.com/electrolite/archives/006122.html#75948)<br/> (21) “To restate: Your thesis is wrong and you lack the rhetorical skills to present your thesis in a coherent fashion. Your latter-day attempt to brush off your sexist and ignorant statement as sarcasm is baldly transparent as backtracking; even if it were true, it shows that your use of such devices is appallingly clumsy. Again one wonders how you got your columnist gig, or, alternately, if anyone bothers to edit you, as you so clearly need.” (http://nielsenhayden.com/electrolite/archives/006122.html#75958)<br/> (22) “you have settled into the “bad writer” excuse for your dumbass and sexist statement.” (ibid.)<br/> (23) “we’re back to you having (to put another spin on use my new favorite phrase) a sphincto-cranial event of monumental proportions” (ibid.)<br/> (24) “To massacre Voltaire’s sentiment, Vox may have indefensibly stupid opinions, but I for one would fight for the right for him to be an SFWA member with indefensibly stupid opinions. Lord knows he wouldn’t be the first, or the last.”<br/> (http://nielsenhayden.com/electrolite/archives/006122.html#76006)<br/> (25) “Poor, deluded Vox.” (http://nielsenhayden.com/electrolite/archives/006122.html#76032)<br/> (26) “Silly Tracina. Expecting a logical argument from Vox. If he couldn’t try to change the subject, he wouldn’t be able to argue at all.”<br/> (http://nielsenhayden.com/electrolite/archives/006122.html#76034)<br/> (27) “Either Vox meant what he wrote, in which case he deserves his thumping on the grounds he’s a sexist pig. Or he didn’t mean what he wrote, in which case he deserves a thumping on the grounds he’s an unfathomably poor writer. Either way he deserves a thumping, and a thumping is what he’s getting.”(http://nielsenhayden.com/electrolite/archives/006122.html#76062)<br/> (28) “Now, run back to your comment monkeys and declare victory, Vox. I’m sure they’ll pat down your fur for you.” (ibid.)<br/> (29) “I should check to see if one of the gibbering follow monkeys of that Racist Sexist Homophobic Dipshit who has an adorable mancrush on me has smeared a turd all over one of my comment threads.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/)<br/> (30) “And of course, this is his prerogative; if it makes him feel better about himself and pumps up his social status with his clutch of equally insecure racist sexist homophobic dipshit admirers, then by all means he can spout as much garbage about me as he likes.” (ibid.)<br/> (31) “The pathology of it is pretty standard elementary-school taunting dynamic, which is to call me a name they think is clever (top of the hit parade at the moment is “McRapey,” because the main Racist Sexist Homophobic Dipshit apparently believed this was real, and once it was explained to him what satire was, had to rather embarrassingly suggest he was doing satire too so there, which, again: adorable), followed by generally unimaginative insults regarding my work/position/status, followed by rah-rah plumping for their beloved leader.” (ibid.)<br/> (32) “Also, as a general rule, I’ve been recently avoiding having the primary racist sexist homophobic dipshit’s name in the comment threads, mostly because at this point I just prefer not to have it about, and also because I find “racist sexist homophobic dipshit” is more than adequate at this point in terms of reference. However, to avoid silliness, you may call him by name if you like. I still prefer not have links to his site, however. It’s a hygiene thing.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#<br/> comment-431974)<br/> (33) “If his existence is validated by this particular post, we should all reflect on what sad and wan existence it is. Beyond that, this, post, once written, obviates the need to have to write anything else about this person (or his follow monkeys) again. So there’s that.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#comment-432250)<br/> (34) “My language isn’t particularly abusive. He is in fact a racist and a sexist and a homophobe. The dipshit part accurately describes his personality as far as I can tell. If he doesn’t wish to be described as a racist sexist homophobic dipshit, he can work on not being those things. Let’s just say I won’t be holding my breath on that. As for the idea that the psycho-sexual fixation flows the other way: AH HA HA HA HA HAH HA. Dude, if I’m gonna do a man, it ain’t gonna be that pathetic ball of issues. I don’t do pity fucks.” (http://whatever.scalzi.com/2013/01/31/troll-reportactive-with-increasing-chance-of-stupid/#comment-432614)<br/> (35) “No. The racist sexist homophobic dipshit in question most certainly did appear to believe I was actually outing myself as a rapist, and then frantically backtracked when people pointed out his  error, re-establishing that he’s a racist dipshit in the process.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#comment-432799)<br/> (36) “I mean, I get that the racist sexist homophobic dipshit feels bad about being revealed to be a credulous unsophisticate in front of all his gibbering follow monkeys.” (ibid.)<br/> (37) “Beyond this, the trolls are the gibbering follow monkeys who show up at the site, not the racist sexist homophobic dipshit himself, who at least has the presence of mind to realize he lost his commenting privileges here some time ago and doesn’t darken my door. I’m sure that the racist sexist homophobic dipshit is having a good laugh about the fact I have to deal with the braindead little cretins who detatch from his site and show up here. He’s just the sort of selfaggrandizing<br/> tool to confuse my irritation at having to deal with his play pals with some estimation of his own self-worth. This is what you do when you’re an asshole, as he clearly is.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#comment-432799)<br/> (38) “@scalzi Christ, this whole thing is crackers, but huge respect for turning it into a positive. Can I email you about it for a journo thing? @davidmbarnett Sure. My e-mail is on my site under “Contact Information” in the sidebar.”<br/> (https://twitter.com/davidmbarnett/status/297830195077988353)<br/> (39) “Troll’s comments prompt author to pledge charity donation for every insult. ‘Racist Sexist Homophobic Dipshit’ will cue rewards for civil rights and LGBT groups by attacking John Scalzi. Heavy troll … John Scalzi has an unusual defence against his troll.” (http://www.guardian.co.uk/books/2013/feb/05/trolls-prompt-author-charity-donation)<br/> (40) “there’s a Racist Sexist Homophobic Dipshit out there on the InterWeebs” (underline indicates a link to: http://rationalwiki.org/wiki/Theodore_Beale)<br/> (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshit-problem/)<br/> (41) “I don’t want to have to read the Racist Sexist Homophobic Dipshit’s site” (ibid.)<br/> (42) “even if the Racist Sexist Homophobic Dipshit never mentioned me again” (ibid.)<br/> (43) “But believe me, the racist sexist homophobic dipshit in question will know.”<br/> (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-433514)<br/> (44) “And there’s nothing passive aggressive about what I’m doing to him now. I’m aggressively using his racist sexist homophobic nature to promote causes he almost certainly hates.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-433557)<br/> (45)As noted before, there’s very little I could do one way or another that wouldn’t play into his delusions of grandeur and his desire to be seen as opposing me in some way; the fellow has an infinite capacity for “HA HA HA THIS IS GOING EXACTLY AS I PLANNED.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#<br/> comment-433582)<br/> (46) “This dipshit is going to drag my name through crap no matter whether I ignore him or not.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#<br/> comment-433675)<br/> (47) “The trolls are the gibbering monkey followers of his that wash up on the site. You should still not feed them. The Racist Sexist Homophobic Dipshit doesn’t troll the site; he does all his nonsense from a distance.”(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexisthomophobic-dipshit-problem/#comment-433696)<br/> (48) “Of all the things the Racist Sexist Homophobic Dipshit in question is, my “tormenter” is definitely not one of them.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexisthomophobic-dipshit-problem/#comment-433803)<br/> (49) “At this point I’m done pretending to be nice to the dipshit in question.”<br/> (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-433808)<br/> (50) “Robert, are you trying to give the fellow a race on the dipshit front, or is that just an unintentional side effect of your bad logic here? I’m not going to dispute that giving the dude a slot was not one of my best ideas, to put it mildly, but that doesn’t change the fact you’re engaging in something akin to victim-blaming. One Big Idea slot given doesn’t mean I should just accept this dipshit’s calumny as my just desserts, and you’re being a bit of a truculent dick to suggest so.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobicdipshit-problem/#comment-433888)<br/> (51) “It should be fairly obvious that this is what I am saying about him, and to him. It should likewise be fairly obvious that I don’t give a damn what anyone else thinks as regards the appropriate way to deal with this dipshit.” (http://whatever.scalzi.com/2013/02/02/solving-myracist-sexist-homophobic-dipshit-problem/#comment-434008)<br/> (52) “I’m aware that the Racist Sexist Homophobic Dipshit in question would like me to treat him with any sort of seriousness, and it irritates both him and his gibbering monkey followers that I don’t, I don’t care. I don’t refer to the dipshit by name because it amuses me to call him Racist Sexist Homophobic Dipshit;” (ibid.)<br/> (53) “Obviously, the dipshit is going to do as he pleases…. So let the dipshit max it out; I’ll pay my share gladly.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobicdipshit-problem/#comment-434076)<br/> (54) “Aside from the fact that that would be far more effort than I would want to invest in this dipshit, if I recall correctly he lives in Italy, which would make any of that difficult to arrange.”(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-434199)<br/> (55) “Once again: I don’t care how the racist, sexist, homophobic dipshit in question responds to it.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-434479)<br/> (56) “Guys, let’s not try to analyze him here. Dipshittery happens for all sorts of reasons; on this end, we only have to worry about the results.”(http://whatever.scalzi.com/2013/02/02/solving-myracist-sexist-homophobic-dipshit-problem/#comment-434551)<br/> (57) “Deleted because I don’t have patience for VD’s special brand of complete nonsense on this topic. Stay in your own pit of manstink, would you, Vox? There’s a lad – JS” (http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/#comment-353892) (58) “sociopathic assbag” (http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/)<br/> (59) “I’m sure “Waaaaah! Scalzi deleted my comments on his personal site and said I was a sexist assbag!” will prompt a rush of members to demand my removal.” (http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/#comment-353914)<br/> (60) “Too late. VD’s tribe of sexist assbags came in a little late for that.” (ibid.)<br/> (61) “a bigoted shithole of a human being”<br/> (62) “Vox Day is an asshole who likes being an asshole”<br/> (63) “the bigoted shitheel who used the Sad Puppy slate like a parasitic wasp uses the hollowed-out husk of a tarantula”<br/> (64) “Vox Day is a grasping sociopath”</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "George R. R. Martin tries to revise the Hugo Narrative on his Not A Blog because George R. R. Martin is an SJW, and as the book says,\nSJWs always lie\n:\nThe elimination of slates will be a huge step toward the end of hostilities. But there’s a second step that’s also necessary. One I have touched on many times before. We have to put an end to the name-calling. To the stupid epithets.\nI have seen some hopeful signs on that front in some of the Hugo round-ups I’ve read. Puppies and Puppy sympathizers using terms like Fan (with a capital), or trufan, or anti-Puppy, all of which I am fine with. I am not fine with CHORF, ASP, Puppy-kicker, Morlock, SJW, Social Justice Bully, and some of the other stupid, offensive labels that some Pups (please note, I said SOME) have repeatedly used for describe their opponents since this whole thing began. I am REALLY not fine with the loonies on the Puppy side who find even those insults too mild, and prefer to call us Marxists, Maoists, feminazis, Nazis, Christ-hating Sodomites, and the like. There have been some truly insane analogies coming from the kennels too — comparisons to World War II, to the Nazi death camps, to ethnic cleansing. Guy, come on, cool down. WE ARE ARGUING ABOUT A LITERARY AWARD THAT BEGAN AS AN OLDSMOBILE HOOD ORNAMENT. Even getting voted below No Award is NOT the same as being put on a train to Auschwitz, and when you type shit like that, well…\nI remember being called an asshole by you for pointing out that the Sad Puppies’ noms were as legitimate as anyone else’s. A LOT of people associated with the SP have been personally insulted by the Haydens and his crowd. I don’t see any apologies forthcoming, and I don’t expect one from you. And that was after I defended you repeatedly to the Puppies. I still think you’re a great writer, but I’m not so sure that you’re all that decent a man.\n– jordan179\nThis is the kind of nasty stuff that will make reconciliation impossible. Sweeping statemnts like “a lot of people… have been personally insulted by the Haydens and his crowd” without any specifics or citations makes your assertions suspect from the first. And you can’t even get the names of the people you’re attacking right. They are the Nielsen-Haydens, not the Haydens.\n– grrm\nNote that George Martin objects vociferously to his side being called Social Justice Warriors even though it is a name that self-professed SJWs originally gave themselves. Meanwhile, his side calls us “fascists”, “Neo-Nazis”, “thugs”, “sociopaths”, “sexist assbags”, “gibbering follow monkeys”, and “just straight-up assholes”, among many other names.\nMy dear GRRM, your side absolutely and unequivocally started this war of words. We, however, are going to finish it. You are not only dishonest, you are demonstrably wrong. You can’t even get the\nnames of the people you’re defending right! They are the Nielsen Haydens,\nnot the Nielsen-Haydens.\nThose specifics you claimed to want are easily supplied. Almost all of the SJW name-calling long predates any Puppy-related name-calling. The 90 specific quotes provided below range from 2005 to 2015 and are but a few dozen of the hundreds of examples that could be cited.\nSo, you can take  your lies, George, and to paraphrase Patrick Nielsen\nHayden’s recent advice to John C. Wright, delivered just last week\nto the man’s wife\n, stick\nthem up your oversized posterior. You may be rich, but you’re not very smart, you’re not at all honest, and you’re still the same fat rape-obsessed gamma male that you’ve always been.\nYou’re a liar, George. A\nproven\nliar. I may be cruel and I may be arrogant and I may occasionally be mistaken, but unlike you, I am not stupid enough to lie about the past in public.\nTeresa Nielsen Hayden\n(1) “It’s really, really obvious that VD is not acquainted with actual women. I don’t just mean sexual relations. I mean he’s had little or no social interaction of any sort.” (http://nielsenhayden.com/electrolite/archives/006122.html#76168)\n(2) “It’s pretty clear that VD fears and dislikes women, and that his gender theories are a back-formation. It seems perfectly appropriate that he’s a fan of that patently misogynistic suspected female impersonator, Ann Coulter.” (ibid.)\n(3) “a third-rate intellect” (http://nielsenhayden.com/electrolite/archives/006122.html#76250)\n(4) “a tad unbalanced” (ibid.)\n(5) “a generally unpleasant fellow” (ibid.)\n(6) “Given your stated opinions on women, I’d love to see you take on the RWA. Bring a friend so there’ll be someone to take charge of the remains.”\n(http://www.antipope.org/charlie/blogstatic/2007/11/sfwa_attempts_to_commit_public.html#comment-12114)\n(7) “Anybody here in favor of turning Vox Day over to SFWA’s female members? I’d pay money to watch.” (ibid.)\n(8) “Good heavens. Did you imagine you were worth arguing with? You aren’t.”\n(http://www.antipope.org/charlie/blogstatic/\n2007/11/sfwa_attempts_to_commit_public.html#comment-12155)\n(9) “Vox Day’s true opinion of women has always been clear to me: he’s terrified of them.” (http://www.antipope.org/charlie/blogstatic/\n2007/11/sfwa_attempts_to_commit_public.html#comment-12243)\n(10) “He is a wuss.” (ibid.)\n(11) “You’re also a singularly inept sockpuppet, O Bane/Vox/Theeeeeodore.” (ibid.)\n(12) “out-of-the-closet racist” (http://nkjemisin.com/2008/09/too-late-for-sf/#comment-119)\n(13) “obviously unbalanced” (ibid.)\n(14) “been known to put in a good word for the Nazis” (ibid.)\n(15) “Vox Day is unbalanced. His SFWA candidacy is a symptom, not a practical\nundertaking.” (https://twitter.com/tnielsenhayden/status/323597546125672448)\n(16) “I take it you think Cory should instead have taken his arguments to the private SFWA area on SFF Net, a toxic morass where he could have been pointlessly abused at great length by the whole pack of gargoyles: Jerry Pournelle, Andrew Burt, Bud Webster, Will Sanders, et cetera et al.: a stunningly unattractive proposition.”  (See: http://www.antipope.org/charlie/blogstatic/\n2007/11/sfwa_attempts_to_commit_public.html#comment-12244)\n(17)  “I want the Justice Department to declare them a criminal organization\nand hit them with felony charges. It would not be an excessive response\nto their actions.” (http://nielsenhayden.com/makinglight/archives/016177.html#4059966)\n(18) “The self-valorizing sociopath contingent seems to be involved.”\n(19) “When you invite thugs into your argument, you’re not using them as shock troops; they’re using you as cover. And you’re pretty much guaranteeing that at some point in the future, you’ll wind up feebly protesting that you had no idea they’d do that. And maybe you didn’t; but you did know they were thugs.”\nPatrick Nielsen Hayden\n(1) “The humor of the situation, in my opinion, is the ongoing degradation of the prestige of the once-coveted Nebula Award. Certainly if I were running a literary award that was widely perceived as being increasingly tarnished by arcane rules, unabashed logrolling, and general ridiculousness, my next move would definitely be to recruit me a yawping borderline anti-Semite and woman-hater for the award’s jury.”\n(2)  “However, the mere fact someone’s crackpot notions about Jews or women\n(or crop circles or ancient astronauts) can be defined as in some way\n“political” doesn’t shield them from mockery.  Nor is it impermissible\nto raise an amused eyebrow when the organization once run by Damon\nKnight and Poul Anderson is reduced to running on the volunteer efforts\nof chuckleheads you’d cross the street to avoid. As I’ve said more than once, I have very mixed feelings.  I do in\nfact approve of my subculture’s habitual tolerance for head cases of all\nsorts.  I also periodically feel, after glancing encounters with some\nof them, like I need to go boil myself in antibiotics.”\n(3)“An underreported aspect of being around for a long time: the horror of watching your onceadmired elders turn into blithering nincompoops.” – Patrick Nielsen Hayden (See: https://twitter.com/pnh/status/340787331067940864)\n(4)  “Likewise, many people, me included, think that #Gamergate is an association of terrible human beings that we don’t want to see joining us.”\n(5) “The SP campaign… rises all the way to “downright evil.””\nSFWA President Steven Gould\n(1) “Does this mean we can’t make fun of Vox Day (Or VD as I like to call him) for his distressing use irrational arguments? Of course we can. It’s like finding one of those dishes of leftovers in the back of the refrigerator that is busy creating it’s own little ecosystem. You comment on it, you drop it in the trash, and you don’t swallow it.” – Steve Gould (See: http://nielsenhayden.com/electrolite/archives/006122.html#75922)\nSFWA Vice-President Mary Robinette Kowal\n(1) “Dear Twelve Rabid Weasels of SFWA, please shut the fuck up. I know you value your freedom of speech. Good on you. However there are 1788 other members of SFWA who also value their freedom of speech and manage to exercise it without being raging assholes…. Please quit. And by “quit” I mean, please quit SFWA in a huff. Please quit and complaining about how SFWA is censoring you for asking you to stop using hate speech. ” – Mary Robinette Kowal (See:\nhttp://www.maryrobinettekowal.com/journal/dear-twelve-rabid-weasels-of-sfwa-please-shut-thefuck-up/)\nAnd then there is the name-calling machine that is John Scalzi. Of course, this list of name-calling by Mr. Scalzi – which began before I’d ever heard of him – is mostly taken from my response to the SFWA report published in 2013 and is FAR from complete.\nSFWA President John Scalzi\n(1) “a jackass, and a fairly ignorant jackass at that”\n(http://nielsenhayden.com/electrolite/archives/006122.html#75601)\n(2) “his political jackassery” (ibid.)\n(3) “of all the dumbassery Beale may be rightly accused of” (http://nielsenhayden.com/electrolite/archives/006122.html#75636)\n(4) “chucklehead” (ibid.)\n(5) “We may also equally and more simply posit that Vox has his head up his ass on this matter” (http://nielsenhayden.com/electrolite/archives/006122.html#75912)\n(6) “the lunatic fringe” (http://nielsenhayden.com/electrolite/archives/006122.html#75914)\n(7) “the willfully stupid” (ibid.)\n(8) “your head is pretty far up your ass” (http://nielsenhayden.com/electrolite/archives/006122.html#75924)\n(9) “when I call you the “lunatic fringe” I am discussing your hypoxic opinion” (ibid.)\n(10) “I know quite a few devout followers of Christ who would also think you have your head up your ass regarding your opinion” (ibid.)\n(11) “I’m also happy to say he’s got his head up his ass” (http://nielsenhayden.com/electrolite/archives/006122.html#75933)\n(12) “I’m happy to grant that in other subjects, he may not exhibit such profound sphincto-cranial tendencies” (ibid.)\n(13) “there’s a definite head-ass conjunction on his part” (ibid.)\n(14) “a fascinating example of sphincto-cranial interaction” (ibid.)\n(15) “You’re a “lunatic fringe”… because you hold a position that is clearly intellectually indefensible, yet appear to give it the same weight as fact.” (ibid.)\n(16) “You’ll just be feeding his persecution complex. Lots of writers are jerkwads.”\n(http://nielsenhayden.com/electrolite/archives/006122.html#75941)\n(17) “his misogynistic jerk-like tendencies”\n(http://nielsenhayden.com/electrolite/archives/006122.html#75945)\n(18) “Vox Day… may yet one day regret his sphincto-cranial position” (ibid.)\n(19) “His position isn’t right or left; it’s just stupid and sexist.” (ibid.)\n(20) “Nothing he’s written here suggests either sophistication or a sense of irony. The question was whether he was a garden-variety jerk or something else entirely. Looks like he’s in the “something else” camp.” (http://nielsenhayden.com/electrolite/archives/006122.html#75948)\n(21) “To restate: Your thesis is wrong and you lack the rhetorical skills to present your thesis in a coherent fashion. Your latter-day attempt to brush off your sexist and ignorant statement as sarcasm is baldly transparent as backtracking; even if it were true, it shows that your use of such devices is appallingly clumsy. Again one wonders how you got your columnist gig, or, alternately, if anyone bothers to edit you, as you so clearly need.” (http://nielsenhayden.com/electrolite/archives/006122.html#75958)\n(22) “you have settled into the “bad writer” excuse for your dumbass and sexist statement.” (ibid.)\n(23) “we’re back to you having (to put another spin on use my new favorite phrase) a sphincto-cranial event of monumental proportions” (ibid.)\n(24) “To massacre Voltaire’s sentiment, Vox may have indefensibly stupid opinions, but I for one would fight for the right for him to be an SFWA member with indefensibly stupid opinions. Lord knows he wouldn’t be the first, or the last.”\n(http://nielsenhayden.com/electrolite/archives/006122.html#76006)\n(25) “Poor, deluded Vox.” (http://nielsenhayden.com/electrolite/archives/006122.html#76032)\n(26) “Silly Tracina. Expecting a logical argument from Vox. If he couldn’t try to change the subject, he wouldn’t be able to argue at all.”\n(http://nielsenhayden.com/electrolite/archives/006122.html#76034)\n(27) “Either Vox meant what he wrote, in which case he deserves his thumping on the grounds he’s a sexist pig. Or he didn’t mean what he wrote, in which case he deserves a thumping on the grounds he’s an unfathomably poor writer. Either way he deserves a thumping, and a thumping is what he’s getting.”(http://nielsenhayden.com/electrolite/archives/006122.html#76062)\n(28) “Now, run back to your comment monkeys and declare victory, Vox. I’m sure they’ll pat down your fur for you.” (ibid.)\n(29) “I should check to see if one of the gibbering follow monkeys of that Racist Sexist Homophobic Dipshit who has an adorable mancrush on me has smeared a turd all over one of my comment threads.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/)\n(30) “And of course, this is his prerogative; if it makes him feel better about himself and pumps up his social status with his clutch of equally insecure racist sexist homophobic dipshit admirers, then by all means he can spout as much garbage about me as he likes.” (ibid.)\n(31) “The pathology of it is pretty standard elementary-school taunting dynamic, which is to call me a name they think is clever (top of the hit parade at the moment is “McRapey,” because the main Racist Sexist Homophobic Dipshit apparently believed this was real, and once it was explained to him what satire was, had to rather embarrassingly suggest he was doing satire too so there, which, again: adorable), followed by generally unimaginative insults regarding my work/position/status, followed by rah-rah plumping for their beloved leader.” (ibid.)\n(32) “Also, as a general rule, I’ve been recently avoiding having the primary racist sexist homophobic dipshit’s name in the comment threads, mostly because at this point I just prefer not to have it about, and also because I find “racist sexist homophobic dipshit” is more than adequate at this point in terms of reference. However, to avoid silliness, you may call him by name if you like. I still prefer not have links to his site, however. It’s a hygiene thing.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#\ncomment-431974)\n(33) “If his existence is validated by this particular post, we should all reflect on what sad and wan existence it is. Beyond that, this, post, once written, obviates the need to have to write anything else about this person (or his follow monkeys) again. So there’s that.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#comment-432250)\n(34) “My language isn’t particularly abusive. He is in fact a racist and a sexist and a homophobe. The dipshit part accurately describes his personality as far as I can tell. If he doesn’t wish to be described as a racist sexist homophobic dipshit, he can work on not being those things. Let’s just say I won’t be holding my breath on that. As for the idea that the psycho-sexual fixation flows the other way: AH HA HA HA HA HAH HA. Dude, if I’m gonna do a man, it ain’t gonna be that pathetic ball of issues. I don’t do pity fucks.” (http://whatever.scalzi.com/2013/01/31/troll-reportactive-with-increasing-chance-of-stupid/#comment-432614)\n(35) “No. The racist sexist homophobic dipshit in question most certainly did appear to believe I was actually outing myself as a rapist, and then frantically backtracked when people pointed out his  error, re-establishing that he’s a racist dipshit in the process.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#comment-432799)\n(36) “I mean, I get that the racist sexist homophobic dipshit feels bad about being revealed to be a credulous unsophisticate in front of all his gibbering follow monkeys.” (ibid.)\n(37) “Beyond this, the trolls are the gibbering follow monkeys who show up at the site, not the racist sexist homophobic dipshit himself, who at least has the presence of mind to realize he lost his commenting privileges here some time ago and doesn’t darken my door. I’m sure that the racist sexist homophobic dipshit is having a good laugh about the fact I have to deal with the braindead little cretins who detatch from his site and show up here. He’s just the sort of selfaggrandizing\ntool to confuse my irritation at having to deal with his play pals with some estimation of his own self-worth. This is what you do when you’re an asshole, as he clearly is.” (http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-ofstupid/#comment-432799)\n(38) “@scalzi Christ, this whole thing is crackers, but huge respect for turning it into a positive. Can I email you about it for a journo thing? @davidmbarnett Sure. My e-mail is on my site under “Contact Information” in the sidebar.”\n(https://twitter.com/davidmbarnett/status/297830195077988353)\n(39) “Troll’s comments prompt author to pledge charity donation for every insult. ‘Racist Sexist Homophobic Dipshit’ will cue rewards for civil rights and LGBT groups by attacking John Scalzi. Heavy troll … John Scalzi has an unusual defence against his troll.” (http://www.guardian.co.uk/books/2013/feb/05/trolls-prompt-author-charity-donation)\n(40) “there’s a Racist Sexist Homophobic Dipshit out there on the InterWeebs” (underline indicates a link to: http://rationalwiki.org/wiki/Theodore_Beale)\n(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshit-problem/)\n(41) “I don’t want to have to read the Racist Sexist Homophobic Dipshit’s site” (ibid.)\n(42) “even if the Racist Sexist Homophobic Dipshit never mentioned me again” (ibid.)\n(43) “But believe me, the racist sexist homophobic dipshit in question will know.”\n(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-433514)\n(44) “And there’s nothing passive aggressive about what I’m doing to him now. I’m aggressively using his racist sexist homophobic nature to promote causes he almost certainly hates.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-433557)\n(45)As noted before, there’s very little I could do one way or another that wouldn’t play into his delusions of grandeur and his desire to be seen as opposing me in some way; the fellow has an infinite capacity for “HA HA HA THIS IS GOING EXACTLY AS I PLANNED.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#\ncomment-433582)\n(46) “This dipshit is going to drag my name through crap no matter whether I ignore him or not.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#\ncomment-433675)\n(47) “The trolls are the gibbering monkey followers of his that wash up on the site. You should still not feed them. The Racist Sexist Homophobic Dipshit doesn’t troll the site; he does all his nonsense from a distance.”(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexisthomophobic-dipshit-problem/#comment-433696)\n(48) “Of all the things the Racist Sexist Homophobic Dipshit in question is, my “tormenter” is definitely not one of them.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexisthomophobic-dipshit-problem/#comment-433803)\n(49) “At this point I’m done pretending to be nice to the dipshit in question.”\n(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-433808)\n(50) “Robert, are you trying to give the fellow a race on the dipshit front, or is that just an unintentional side effect of your bad logic here? I’m not going to dispute that giving the dude a slot was not one of my best ideas, to put it mildly, but that doesn’t change the fact you’re engaging in something akin to victim-blaming. One Big Idea slot given doesn’t mean I should just accept this dipshit’s calumny as my just desserts, and you’re being a bit of a truculent dick to suggest so.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobicdipshit-problem/#comment-433888)\n(51) “It should be fairly obvious that this is what I am saying about him, and to him. It should likewise be fairly obvious that I don’t give a damn what anyone else thinks as regards the appropriate way to deal with this dipshit.” (http://whatever.scalzi.com/2013/02/02/solving-myracist-sexist-homophobic-dipshit-problem/#comment-434008)\n(52) “I’m aware that the Racist Sexist Homophobic Dipshit in question would like me to treat him with any sort of seriousness, and it irritates both him and his gibbering monkey followers that I don’t, I don’t care. I don’t refer to the dipshit by name because it amuses me to call him Racist Sexist Homophobic Dipshit;” (ibid.)\n(53) “Obviously, the dipshit is going to do as he pleases…. So let the dipshit max it out; I’ll pay my share gladly.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobicdipshit-problem/#comment-434076)\n(54) “Aside from the fact that that would be far more effort than I would want to invest in this dipshit, if I recall correctly he lives in Italy, which would make any of that difficult to arrange.”(http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-434199)\n(55) “Once again: I don’t care how the racist, sexist, homophobic dipshit in question responds to it.” (http://whatever.scalzi.com/2013/02/02/solving-my-racist-sexist-homophobic-dipshitproblem/#comment-434479)\n(56) “Guys, let’s not try to analyze him here. Dipshittery happens for all sorts of reasons; on this end, we only have to worry about the results.”(http://whatever.scalzi.com/2013/02/02/solving-myracist-sexist-homophobic-dipshit-problem/#comment-434551)\n(57) “Deleted because I don’t have patience for VD’s special brand of complete nonsense on this topic. Stay in your own pit of manstink, would you, Vox? There’s a lad – JS” (http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/#comment-353892) (58) “sociopathic assbag” (http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/)\n(59) “I’m sure “Waaaaah! Scalzi deleted my comments on his personal site and said I was a sexist assbag!” will prompt a rush of members to demand my removal.” (http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/#comment-353914)\n(60) “Too late. VD’s tribe of sexist assbags came in a little late for that.” (ibid.)\n(61) “a bigoted shithole of a human being”\n(62) “Vox Day is an asshole who likes being an asshole”\n(63) “the bigoted shitheel who used the Sad Puppy slate like a parasitic wasp uses the hollowed-out husk of a tarantula”\n(64) “Vox Day is a grasping sociopath”",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-01T11:00:00+00:00"
}