{
  "url": "https://voxday.net/2015/09/21/rise-of-ultras/",
  "scraped_at": "2025-12-17T17:27:22.831300",
  "title": "Rise of the ultras",
  "date_display": "September 21, 2015",
  "date_iso": "2015-09-21T08:40:00+00:00",
  "date_from_url": "2015-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://www.theguardian.com/world/2015/sep/21/neo-fascist-greek-party-election-golden-dawn-third-place\">result of the recent Greek parliamentary election</a> is in line with my prediction of the European ultra-nationalists coming to power in two election cycles.</p><blockquote class=\"tr_bq\"><p> Golden Dawn, one of Europe’s most violent far-right parties, has emerged as one of the biggest winners of Sunday’s general election in Greece, consolidating its presence in parliament and power on the streets. The neo-fascist group came in third with 7% of the vote, behind the triumphant leftwing Syriza and conservative New Democracy….</p><p>“Golden Dawn is a movement of power, it is not a protest movement any<br> more,” the party’s Swastika- tattooed spokesman, Ilias Kasidiaris, told<br> Star TV as it became clear that the extremists had retained their<br> position as the country’s third biggest political force. “Golden Dawn is<br> the only party seeing an increase in its percentage. In October when<br> Greeks begin to experience the consequences of the memorandum and<br> illegal immigration you will see our support increase radically,” said<br> the former marine, berating the country’s mainstream media for<br> boycotting the party.</br></br></br></br></br></br></br></br></p><p>With 18 MPs in the 300-seat house, around 500,000 Greeks cast ballots<br> in favour of Golden Dawn. The organisation performed especially well in<br> Attica, the greater Athens region and the Aegean islands of Lesbos and<br> Kos where voter support doubled. Both islands have been overwhelmed in<br> recent months by thousands of refugees and migrants fleeing conflict and<br> poverty.</br></br></br></br></br></p><p>Golden Dawn’s anti-immigrant stance at a time of mounting fears over<br> Greece’s frontline role in Europe’s biggest humanitarian crisis in<br> recent history, almost certainly helped. The party, portraying itself as<br> the “only nationalist choice” played heavily on fears that Greeks could<br> soon become a minority in their own country. But, so too, did its<br> shrill opposition to the internationally sponsored bailout accords, or<br> memoranda, that the extremists have said amount to “ethnocide” or death<br> of the nation. Polls showed that some 16.6% of those who voted for<br> Golden Dawn were victims of record levels of unemployment – the most<br> grievous side-effect of massive budget cuts and lay-offs enforced as the<br> price of being bailed out to the tune of €326bn creditors in the EU and<br> International Monetary Fund (IMF).</br></br></br></br></br></br></br></br></br></br></br></p><p>“In terms of absolute numbers Golden Dawn was the only party to hold<br> its ground,” said Aristides Hatzis, political commentator and Athens<br> University professor.</br></br></p></blockquote><p>The Fascists and the National Socialists came to power in the 1930s because they were the most credible options available to the Italian and German publics at the time. Don’t confuse the beginnings with the ends; 1933 was not 1941 or even 1939. Fascists were not elected with the idea that they would throw in with German imperialism (it is usually forgotten that Mussolini was an ally of France and Great Britain and only threw in with Germany after Great Britain betrayed Italian interests), and the National Socialists were not elected because they promised they would invade the Soviet Union, slaughter the Jews in Eastern Europe, and get Germany into a war with the USA.</p><p>One can’t learn anything useful about the future prospects of revolutionary parties by what other revolutionary parties did AFTER they came to power, one can only learn about their prospects by looking at what the other parties were doing BEFORE they came to power.</p><p>The worst thing about the established anti-nationalist European parties is that they have failed so spectacularly that even the violently murderous anti-immigrant parties will be preferred to them by even the most sane and civilized elements of the electorate. In a time of invasion, it doesn’t matter how dangerous the only party willing to defend you might be, what matters is that they are the only ones willing to defend you, your family, and your children.</p><p>As for those who are historically ignorant enough to point out that Golden Dawn only won 18 seats in the Greek parliament with 7 percent of the vote and therefore will never come to power, I will type very, very slowly and point out that in 1928, five years before they took power, the National Socialist Workers Party won 12 seats in the German parliament with 2.6 percent of the vote.</p><p>Two election cycles. And then you will see an absolute sea change in Europe. And if the EU attempts to entirely abandon even the pretense of democracy in defense of the invasion, the change will come even faster. And harder.</p></div>",
  "content_text": "The\nresult of the recent Greek parliamentary election\nis in line with my prediction of the European ultra-nationalists coming to power in two election cycles.\nGolden Dawn, one of Europe’s most violent far-right parties, has emerged as one of the biggest winners of Sunday’s general election in Greece, consolidating its presence in parliament and power on the streets. The neo-fascist group came in third with 7% of the vote, behind the triumphant leftwing Syriza and conservative New Democracy….\n“Golden Dawn is a movement of power, it is not a protest movement any\nmore,” the party’s Swastika- tattooed spokesman, Ilias Kasidiaris, told\nStar TV as it became clear that the extremists had retained their\nposition as the country’s third biggest political force. “Golden Dawn is\nthe only party seeing an increase in its percentage. In October when\nGreeks begin to experience the consequences of the memorandum and\nillegal immigration you will see our support increase radically,” said\nthe former marine, berating the country’s mainstream media for\nboycotting the party.\nWith 18 MPs in the 300-seat house, around 500,000 Greeks cast ballots\nin favour of Golden Dawn. The organisation performed especially well in\nAttica, the greater Athens region and the Aegean islands of Lesbos and\nKos where voter support doubled. Both islands have been overwhelmed in\nrecent months by thousands of refugees and migrants fleeing conflict and\npoverty.\nGolden Dawn’s anti-immigrant stance at a time of mounting fears over\nGreece’s frontline role in Europe’s biggest humanitarian crisis in\nrecent history, almost certainly helped. The party, portraying itself as\nthe “only nationalist choice” played heavily on fears that Greeks could\nsoon become a minority in their own country. But, so too, did its\nshrill opposition to the internationally sponsored bailout accords, or\nmemoranda, that the extremists have said amount to “ethnocide” or death\nof the nation. Polls showed that some 16.6% of those who voted for\nGolden Dawn were victims of record levels of unemployment – the most\ngrievous side-effect of massive budget cuts and lay-offs enforced as the\nprice of being bailed out to the tune of €326bn creditors in the EU and\nInternational Monetary Fund (IMF).\n“In terms of absolute numbers Golden Dawn was the only party to hold\nits ground,” said Aristides Hatzis, political commentator and Athens\nUniversity professor.\nThe Fascists and the National Socialists came to power in the 1930s because they were the most credible options available to the Italian and German publics at the time. Don’t confuse the beginnings with the ends; 1933 was not 1941 or even 1939. Fascists were not elected with the idea that they would throw in with German imperialism (it is usually forgotten that Mussolini was an ally of France and Great Britain and only threw in with Germany after Great Britain betrayed Italian interests), and the National Socialists were not elected because they promised they would invade the Soviet Union, slaughter the Jews in Eastern Europe, and get Germany into a war with the USA.\nOne can’t learn anything useful about the future prospects of revolutionary parties by what other revolutionary parties did AFTER they came to power, one can only learn about their prospects by looking at what the other parties were doing BEFORE they came to power.\nThe worst thing about the established anti-nationalist European parties is that they have failed so spectacularly that even the violently murderous anti-immigrant parties will be preferred to them by even the most sane and civilized elements of the electorate. In a time of invasion, it doesn’t matter how dangerous the only party willing to defend you might be, what matters is that they are the only ones willing to defend you, your family, and your children.\nAs for those who are historically ignorant enough to point out that Golden Dawn only won 18 seats in the Greek parliament with 7 percent of the vote and therefore will never come to power, I will type very, very slowly and point out that in 1928, five years before they took power, the National Socialist Workers Party won 12 seats in the German parliament with 2.6 percent of the vote.\nTwo election cycles. And then you will see an absolute sea change in Europe. And if the EU attempts to entirely abandon even the pretense of democracy in defense of the invasion, the change will come even faster. And harder.",
  "tags": [
    "EU",
    "history",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-21T07:40:00+00:00"
}