{
  "url": "https://voxday.net/2015/09/30/russian-airstrikes-in-syria/",
  "scraped_at": "2025-12-17T17:28:27.461710",
  "title": "Russian airstrikes in Syria",
  "date_display": "September 30, 2015",
  "date_iso": "2015-09-30T12:30:00+00:00",
  "date_from_url": "2015-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vladimir Putin <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/russia/11900853/Putin-request-for-use-of-Russian-troops-in-Syria-approved-live.html\">was not bluffing</a>:</p><blockquote class=\"tr_bq\"><p> US officials are now widely briefing that Russia has started carrying out airstrikes in Syria, following a vote by the Moscow’s upper house of parliament this morning approving military action in Syria.</p><p> Valentina Matvienko, the speaker of the Russian upper house of<br> parliament, says senators approved Vladimir Putin’s permission for<br> airstrikes in order to crush the “hydra” of terrorism: <br> <i> </i><br> <i>We proceeded from the fact that first of all it is in the interests of national security of Russia for many reasons. Because<br> if today this hydra is not crushed at its roots, where it is already at<br> war, if we do not destroy “Islamic State” today, Isil could come to<br> threaten the entire world, including Europe and Russia. </br></br></br></i></br></br></br></br></p></blockquote><p>This is very interesting from a grand strategic perspective. Note that Russia is portraying itself as a defender of Europe against Islam, and an ally in that fight, whereas the USA has been actively fostering the Islamic invasion of Europe.</p></div>",
  "content_text": "Vladimir Putin\nwas not bluffing\n:\nUS officials are now widely briefing that Russia has started carrying out airstrikes in Syria, following a vote by the Moscow’s upper house of parliament this morning approving military action in Syria.\nValentina Matvienko, the speaker of the Russian upper house of\nparliament, says senators approved Vladimir Putin’s permission for\nairstrikes in order to crush the “hydra” of terrorism:\nWe proceeded from the fact that first of all it is in the interests of national security of Russia for many reasons. Because\nif today this hydra is not crushed at its roots, where it is already at\nwar, if we do not destroy “Islamic State” today, Isil could come to\nthreaten the entire world, including Europe and Russia.\nThis is very interesting from a grand strategic perspective. Note that Russia is portraying itself as a defender of Europe against Islam, and an ally in that fight, whereas the USA has been actively fostering the Islamic invasion of Europe.",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-30T11:30:00+00:00"
}