{
  "url": "https://voxday.net/2015/09/12/sjws-always-double-down-2/",
  "scraped_at": "2025-12-17T17:26:23.428295",
  "title": "SJWs always double down",
  "date_display": "September 12, 2015",
  "date_iso": "2015-09-12T14:06:00+00:00",
  "date_from_url": "2015-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Seriously, SJWs will even defend self-admitted pedophiles so long as the pedophiles dutifully adhere to the Narrative:</p><blockquote class=\"tr_bq\"><p> Chris Kluwe ‏@ChrisWarcraft<br> This is well written, and #Gamergate’rs, in case it wasn’t blatantly obvious, <a href=\"http://idledillettante.com/2015/09/11/5-reasons-i-stand-with-sarah-nyberg/\">I support @srhbutts</a>. Go drink bleach. <br> 83 retweets 126 favorites</br></br></p><p>Vox Day ‏@voxday<br> @ChrisWarcraft You’re supporting pedophiles now, Kluwe? Put down the Marion Zimmer Bradley novel and seek help. Stat.<br> 27 retweets 69 favorites</br></br></p><p>Chris Kluwe ‏@ChrisWarcraft<br> @voxday How’s it going with your Nazi buddies over there? You guys win that culture war yet? I’m sure it’ll be any day now.</br></p><p> Vox Day ‏@voxday<br> @ChrisWarcraft Better than it’s going with your pedophile pals. Has your wife filed a restraining order to keep you away from children yet?</br></p><p>Chris Kluwe ‏@ChrisWarcraft<br> @voxday Lol, nine hours and that was the best you could do? No wonder No Award kicked your ass at writing.</br></p><p>Vox Day ‏@voxday<br> .@ChrisWarcraft Is it hard to make the school run when you’re not legally allowed within 100 feet of the building?</br></p><p>Chris Kluwe ‏@ChrisWarcraft<br> @voxday Tell me, how does it feel watching your “movement” collapse in real time? Do the rats claw at you on their way off the ship?</br></p><p>Vox Day ‏@voxday<br> .@ChrisWarcraft Tell me, do you see yourself as a misunderstood child inside or are you just a straight-out sexual predator?</br></p><p>Chris Kluwe ‏@ChrisWarcraft<br> @voxday Now you’re just being boring. I have no time for boring. Back to the mute cage! Don’t worry, I’ll let you out after you calm down.</br></p><p>Vox Day ‏@voxday<br> .@ChrisWarcraft One certainly wouldn’t want to cut into your special time uploading pictures to your pedophile pals. Run away now, run away!</br></p></blockquote><p>Strangely enough, Kluwe decided it was best to end the exchange there. <i>Quelle surprise</i>. But SJW doubling-down is not just limited to Twitter. <a href=\"http://publishersweekly.com/pw/by-topic/industry-news/book-deals/article/68042-book-deals-week-of-september-14-2015.html\">From<i> Publishers Weekly</i></a> comes the shocking news that the leading SJW publisher in science fiction has just signed a leading SJW to publish an SJW-message fiction novel. With EPH on the way, I think we can safely predict what one of the two Tor entrants for the 2018 Best Novel will be.</p><p>Post-scarcity was interesting when Stross tackled it in <i>Accelerando</i>. Doctorow desperately wants to be considered an Important Thinker, but he simply doesn’t have the intellect for it. He’s much better at marketing himself than he is at actually coming up with anything new or even interesting.</p><blockquote class=\"tr_bq\"><p> Novelist and outspoken open-source advocate Cory Doctorow sold North American rights to a new novel, <i>Utopia</i>, to Patrick Nielsen Hayden at Tor Books. Hayden brokered the deal with Russell Galen at Scovil Galen Ghosh Literary Agency, and Tor is planning to publish the title in early 2017. The novel, which marks Doctorow’s first solo adult fiction effort since 2009’s <i>Makers</i>, is set in the latter part of this century; Hayden described it as a “big, sprawling story” about what happens when advancements in technology make peace and abundance for all a possibility, allowing humans to “simply walk away from the systems of work and coercive authority that have run the world since agriculture began.”</p></blockquote><p>UPDATE: Of course, it’s not only SJWs who can double down.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/COt5fiaWoAEjzVX.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/COt5fiaWoAEjzVX.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/COt5fiaWoAEjzVX.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "Seriously, SJWs will even defend self-admitted pedophiles so long as the pedophiles dutifully adhere to the Narrative:\nChris Kluwe ‏@ChrisWarcraft\nThis is well written, and #Gamergate’rs, in case it wasn’t blatantly obvious,\nI support @srhbutts\n. Go drink bleach.\n83 retweets 126 favorites\nVox Day ‏@voxday\n@ChrisWarcraft You’re supporting pedophiles now, Kluwe? Put down the Marion Zimmer Bradley novel and seek help. Stat.\n27 retweets 69 favorites\nChris Kluwe ‏@ChrisWarcraft\n@voxday How’s it going with your Nazi buddies over there? You guys win that culture war yet? I’m sure it’ll be any day now.\nVox Day ‏@voxday\n@ChrisWarcraft Better than it’s going with your pedophile pals. Has your wife filed a restraining order to keep you away from children yet?\nChris Kluwe ‏@ChrisWarcraft\n@voxday Lol, nine hours and that was the best you could do? No wonder No Award kicked your ass at writing.\nVox Day ‏@voxday\n.@ChrisWarcraft Is it hard to make the school run when you’re not legally allowed within 100 feet of the building?\nChris Kluwe ‏@ChrisWarcraft\n@voxday Tell me, how does it feel watching your “movement” collapse in real time? Do the rats claw at you on their way off the ship?\nVox Day ‏@voxday\n.@ChrisWarcraft Tell me, do you see yourself as a misunderstood child inside or are you just a straight-out sexual predator?\nChris Kluwe ‏@ChrisWarcraft\n@voxday Now you’re just being boring. I have no time for boring. Back to the mute cage! Don’t worry, I’ll let you out after you calm down.\nVox Day ‏@voxday\n.@ChrisWarcraft One certainly wouldn’t want to cut into your special time uploading pictures to your pedophile pals. Run away now, run away!\nStrangely enough, Kluwe decided it was best to end the exchange there.\nQuelle surprise\n. But SJW doubling-down is not just limited to Twitter.\nFrom\nPublishers Weekly\ncomes the shocking news that the leading SJW publisher in science fiction has just signed a leading SJW to publish an SJW-message fiction novel. With EPH on the way, I think we can safely predict what one of the two Tor entrants for the 2018 Best Novel will be.\nPost-scarcity was interesting when Stross tackled it in\nAccelerando\n. Doctorow desperately wants to be considered an Important Thinker, but he simply doesn’t have the intellect for it. He’s much better at marketing himself than he is at actually coming up with anything new or even interesting.\nNovelist and outspoken open-source advocate Cory Doctorow sold North American rights to a new novel,\nUtopia\n, to Patrick Nielsen Hayden at Tor Books. Hayden brokered the deal with Russell Galen at Scovil Galen Ghosh Literary Agency, and Tor is planning to publish the title in early 2017. The novel, which marks Doctorow’s first solo adult fiction effort since 2009’s\nMakers\n, is set in the latter part of this century; Hayden described it as a “big, sprawling story” about what happens when advancements in technology make peace and abundance for all a possibility, allowing humans to “simply walk away from the systems of work and coercive authority that have run the world since agriculture began.”\nUPDATE: Of course, it’s not only SJWs who can double down.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-12T13:06:00+00:00"
}