{
  "url": "https://voxday.net/2015/09/07/social-justice-convergence-in-action/",
  "scraped_at": "2025-12-17T17:25:45.245078",
  "title": "Social Justice Convergence in action",
  "date_display": "September 7, 2015",
  "date_iso": "2015-09-07T08:09:00+00:00",
  "date_from_url": "2015-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ESPN is <a href=\"http://thebiglead.com/2015/08/05/cord-cutting-declines-in-live-tv-viewership-taking-its-toll-on-espn/\">“in a panic”</a>:</p><blockquote class=\"tr_bq\"><ul><li>Disney Stock Tanks as Cable Revenue Disappoints – The Street</li><li>Disney stock hit on ESPN fears – CNN</li><li>Disney Falls as Revenue Misses, Cable Profit Outlook Darkens – Bloomberg</li></ul><p>The table was set for this bad news in May, and internally, ESPN has been in a panic for quite some time. The cord cutting fears have gone from “potential problem” to “very real problem” faster than anyone imagined. When it became clear Keith Olbermann was leaving in early July, we explored the increasing cord cutting phenomenon, and reported how ESPN is under orders from Disney to pull a total of $350 million out of the budget in 2016 and 2017.</p></blockquote><p>Mark St. Cyr <a href=\"http://www.zerohedge.com/news/2015-09-06/espn-cutting-cord-or-political-turn\">explains one likely reason</a> for the “cord cutting” at Zerohedge:</p><blockquote class=\"tr_bq\"><p> Why wouldn’t ESPN™ (or Disney™ its parent company) go to great efforts to include or push the narrative that “cord cutting” doesn’t necessarily mean “all” that cut have tuned off? In other words: why aren’t numbers from alternative viewing sources highlighted as to show they might not be viewing there – but they are over here? Unless – they aren’t.<br> And if they’re not – why not? After all, there’s probably no other content infringement policing company for copyright and other applicable ownership rights than Disney and all its subsidiaries. You aren’t going to see it for free or on alternative platforms unless they want or allow for it. Period.</br></p><p>This would also imply if they allowed it (anywhere) it would be accounted for ( i.e., click views, etc.) in some manner of form from across the internet to help take the edge off. i.e., Sure we lost millions from cable, but as you can see here, they’ve just migrated over to this service/platform as an alternative. Monetizing the alternative is a work in progress. etc., etc.</p><p>However, that seems not to be the case. The case appears – they’ve not only cut: they’ve tuned out or turned off the programming entirely. Why?</p><p>It’s hard to say. However, if I use myself as an example, I believe I know a large part of the underlying reason:</p><p>ESPN (like a few notable others such as NBC™) has seemingly transformed at near hyper-speed from sports reporting – to political sports reporting. The political edge now rampant throughout the shows, games, interviews, et al is overbearing, overburdening, and overdone.</p></blockquote><p>From <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><b><i>SJWs Always Lie: Taking Down the Thought Police</i></b></a>:</p><p><i>The public schools can no longer educate, so people are turning to homeschooling. The universities can no longer provide liberal arts educations, so people are becoming technology-assisted autodidacts. The banks no longer loan, the state and local governments no longer provide basic public services, the military does not defend the borders, the newspapers no longer provide news, the television networks no longer entertain, and the corporations are increasingly unable to provide employment.</i></p><p><i>Even as the institutions have been invaded and coopted in the interests of social justice, they have been rendered unable to fulfill their primary functions. This is the great internal contradiction that the SJWs will never be able to positively resolve, just as the Soviet communists were never able to resolve the contradiction of socialist calculation that brought down their economy and their empire 69 years after Ludwig von Mises first pointed it out. One might call it the Impossibility of Social Justice Convergence; no man can serve two masters and no institution can effectively serve two different functions. The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.</i></p></div>",
  "content_text": "ESPN is\n“in a panic”\n:\nDisney Stock Tanks as Cable Revenue Disappoints – The Street\nDisney stock hit on ESPN fears – CNN\nDisney Falls as Revenue Misses, Cable Profit Outlook Darkens – Bloomberg\nThe table was set for this bad news in May, and internally, ESPN has been in a panic for quite some time. The cord cutting fears have gone from “potential problem” to “very real problem” faster than anyone imagined. When it became clear Keith Olbermann was leaving in early July, we explored the increasing cord cutting phenomenon, and reported how ESPN is under orders from Disney to pull a total of $350 million out of the budget in 2016 and 2017.\nMark St. Cyr\nexplains one likely reason\nfor the “cord cutting” at Zerohedge:\nWhy wouldn’t ESPN™ (or Disney™ its parent company) go to great efforts to include or push the narrative that “cord cutting” doesn’t necessarily mean “all” that cut have tuned off? In other words: why aren’t numbers from alternative viewing sources highlighted as to show they might not be viewing there – but they are over here? Unless – they aren’t.\nAnd if they’re not – why not? After all, there’s probably no other content infringement policing company for copyright and other applicable ownership rights than Disney and all its subsidiaries. You aren’t going to see it for free or on alternative platforms unless they want or allow for it. Period.\nThis would also imply if they allowed it (anywhere) it would be accounted for ( i.e., click views, etc.) in some manner of form from across the internet to help take the edge off. i.e., Sure we lost millions from cable, but as you can see here, they’ve just migrated over to this service/platform as an alternative. Monetizing the alternative is a work in progress. etc., etc.\nHowever, that seems not to be the case. The case appears – they’ve not only cut: they’ve tuned out or turned off the programming entirely. Why?\nIt’s hard to say. However, if I use myself as an example, I believe I know a large part of the underlying reason:\nESPN (like a few notable others such as NBC™) has seemingly transformed at near hyper-speed from sports reporting – to political sports reporting. The political edge now rampant throughout the shows, games, interviews, et al is overbearing, overburdening, and overdone.\nFrom\nSJWs Always Lie: Taking Down the Thought Police\n:\nThe public schools can no longer educate, so people are turning to homeschooling. The universities can no longer provide liberal arts educations, so people are becoming technology-assisted autodidacts. The banks no longer loan, the state and local governments no longer provide basic public services, the military does not defend the borders, the newspapers no longer provide news, the television networks no longer entertain, and the corporations are increasingly unable to provide employment.\nEven as the institutions have been invaded and coopted in the interests of social justice, they have been rendered unable to fulfill their primary functions. This is the great internal contradiction that the SJWs will never be able to positively resolve, just as the Soviet communists were never able to resolve the contradiction of socialist calculation that brought down their economy and their empire 69 years after Ludwig von Mises first pointed it out. One might call it the Impossibility of Social Justice Convergence; no man can serve two masters and no institution can effectively serve two different functions. The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-07T07:09:00+00:00"
}