{
  "url": "https://voxday.net/2015/09/07/the-democrats-defense-priority/",
  "scraped_at": "2025-12-17T17:25:47.061613",
  "title": "The Democrats’ defense priority",
  "date_display": "September 7, 2015",
  "date_iso": "2015-09-07T12:10:00+00:00",
  "date_from_url": "2015-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know about you, but I doubt the average American will be much reassured by the idea that the “leaders” responsible for national defense are inclined to burst into tears or that the security of another nation <a href=\"http://www.washingtonexaminer.com/dnc-head-wasserman-schultz-chokes-up-announcing-iran-deal-vote/article/2571517\">appears to be their primary concern</a>:</p><blockquote class=\"tr_bq\"><p> The head of the Democratic Party, Rep. Debbie Wasserman Schultz, D-Fla., choked up while discussing her “gut wrenching” decision to vote in favor of the Iran nuclear deal.</p><p>“There’s nothing that’s more important to me, as a Jew, than to ensure Israel’s existence is there throughout our generations,” she said Sunday, choking back tears. Wasserman Schultz announced her vote for the deal, which will ease economic sanctions in return for Iran scaling back its nuclear program, on CNN’s “State of the Union” and in an op-ed for the Miami Herald.</p><p>Holding back tears, Wasserman Schultz said that in her op-ed, she talks about her “Jewish heart and how important this [decision] was to me … as a Jewish mother.”</p><p>“In weighing everything, all the information, I’ve concluded the best thing to do is vote in support of the Iran deal and put Iran years away from being a nuclear state,” she said. The Obama administration secured enough votes this week to ensure the deal will survive efforts to kill it.</p><p>In making her decision, Wasserman Schultz met with President Obama, Vice President Biden, Treasury Secretary Jack Lew, Secretary of State John Kerry and Energy Secretary Ernest Moniz, as well as dozens of intelligence experts. She has been to the Situation Room twenty times in the past two years, she said, and has personally verified with the Obama administration that Iran will have to allow inspectors in to verify that it is scaling back its nuclear capacity and cannot self-inspect.</p><p>Wasserman Schultz said there are “a number of things” in the deal that gave her “angst and pause” and made her decision to vote in favor of it very difficult.</p><p>“I worry that the vigilance over the life of deal may wane … that complacency could set in,” she said. “I worry that the additional resources, no matter how little … Iran could divert to terrorist activity that could cause harm to Jews and others around the world. I worry that we have to make sure that the monitoring is really as gap-free as possible.”</p><p>Despite her discomfiture with the deal, Wasserman Schultz said she is “confident” that she made the right choice.</p><p>“I am confident that the process I have gone through to reach this decision is one that will ensure that Israel will be there forever,” she said.</p></blockquote><p>Being pro-Zionist, I, for one, am pleased to know that Israel’s safety and security is important to American political leaders. I merely regret that <i>America’s</i> safety and security are observably such a trivial matter as far as they are concerned.</p><p> To be fair, Ms Wasserman Schultz did mention in passing that she believes “fervently in protecting America’s national security interests”, they just don’t happen to be as important, or as emotionally moving, to her as ensuring “Israel’s existence is there throughout our generation”.</p><p>It would certainly be nice if America’s political leaders cared even one-half as much about America’s borders as they do about Israel’s.</p></div>",
  "content_text": "I don’t know about you, but I doubt the average American will be much reassured by the idea that the “leaders” responsible for national defense are inclined to burst into tears or that the security of another nation\nappears to be their primary concern\n:\nThe head of the Democratic Party, Rep. Debbie Wasserman Schultz, D-Fla., choked up while discussing her “gut wrenching” decision to vote in favor of the Iran nuclear deal.\n“There’s nothing that’s more important to me, as a Jew, than to ensure Israel’s existence is there throughout our generations,” she said Sunday, choking back tears. Wasserman Schultz announced her vote for the deal, which will ease economic sanctions in return for Iran scaling back its nuclear program, on CNN’s “State of the Union” and in an op-ed for the Miami Herald.\nHolding back tears, Wasserman Schultz said that in her op-ed, she talks about her “Jewish heart and how important this [decision] was to me … as a Jewish mother.”\n“In weighing everything, all the information, I’ve concluded the best thing to do is vote in support of the Iran deal and put Iran years away from being a nuclear state,” she said. The Obama administration secured enough votes this week to ensure the deal will survive efforts to kill it.\nIn making her decision, Wasserman Schultz met with President Obama, Vice President Biden, Treasury Secretary Jack Lew, Secretary of State John Kerry and Energy Secretary Ernest Moniz, as well as dozens of intelligence experts. She has been to the Situation Room twenty times in the past two years, she said, and has personally verified with the Obama administration that Iran will have to allow inspectors in to verify that it is scaling back its nuclear capacity and cannot self-inspect.\nWasserman Schultz said there are “a number of things” in the deal that gave her “angst and pause” and made her decision to vote in favor of it very difficult.\n“I worry that the vigilance over the life of deal may wane … that complacency could set in,” she said. “I worry that the additional resources, no matter how little … Iran could divert to terrorist activity that could cause harm to Jews and others around the world. I worry that we have to make sure that the monitoring is really as gap-free as possible.”\nDespite her discomfiture with the deal, Wasserman Schultz said she is “confident” that she made the right choice.\n“I am confident that the process I have gone through to reach this decision is one that will ensure that Israel will be there forever,” she said.\nBeing pro-Zionist, I, for one, am pleased to know that Israel’s safety and security is important to American political leaders. I merely regret that\nAmerica’s\nsafety and security are observably such a trivial matter as far as they are concerned.\nTo be fair, Ms Wasserman Schultz did mention in passing that she believes “fervently in protecting America’s national security interests”, they just don’t happen to be as important, or as emotionally moving, to her as ensuring “Israel’s existence is there throughout our generation”.\nIt would certainly be nice if America’s political leaders cared even one-half as much about America’s borders as they do about Israel’s.",
  "tags": [
    "politics",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-07T11:10:00+00:00"
}