{
  "url": "https://voxday.net/2015/09/24/the-demonic-demian/",
  "scraped_at": "2025-12-17T17:27:46.640854",
  "title": "The demonic Demian",
  "date_display": "September 24, 2015",
  "date_iso": "2015-09-24T10:01:00+00:00",
  "date_from_url": "2015-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to go back and read books that made an impression on you when you were younger. <i>Demian </i>wasn’t the Hesse novel that made a big impression on me, that was <i>Magister Ludi</i> as the paperback edition I had then called <i>The Glass Bead Game</i>, but it was the first Hesse novel that I read and the one that drew me into becoming a moderately serious Hesse fan.</p><p>However, as much as I enjoyed the books, I did not understand the countercultural appeal of Hesse back then. I was too much a child of the 80s to grasp why <i>Demian </i>and <i>Steppenwolf </i>were so significant to the hippies and the other counterculturals who laid the groundwork for today’s SJWs, most of whom wouldn’t know Hermann Hesse from Rudolf Hess.</p><p>But I was reading <i>Demian </i>at the gym yesterday, and besides developing a newfound respect for James Franco, who wrote a rather amusing introduction to it, I began to understand both that historic countercultural appeal as well as the depth of literally Satanic evil intrinsic to the quasi-Gnostic philosophy expressed in the book. This passage, in particular, caught my attention:</p><blockquote class=\"tr_bq\"><p> Then, at that moment, a memory flashed up within me that almost took my breath away: on that ill-starred evening when my misery had begun, that moment with my father when I had, so to speak, seen right through him and his bright clean world and wisdom, and despised them! Yes, I had imagined on my own that I was Cain and bore the mark, and that the mark was not a disgrace but a badge of honor; I had felt that my wicked misdeed made me superior to my father, higher than the good and pious people in his world.</p><p>It’s not that I had thought it all through, clearly and analytically, at the time; it was just an emotion flaring up, strange stirrings that hurt me but at the same time filled me with pride. Yet all these ideas were contained in the feeling I’d had.</p><p>When I thought about how oddly Demian had spoken of the fearless tribe and the cowards, how strange his interpretation was of the mark on Cain’s forehead, and how marvelously his eyes, his peculiar, grown-up eyes, had lit up when he spoke, the vague thought passed through my mind: This Demian, is he not himself a kind of Cain? Why else would he defend Cain, if he didn’t feel like him? Why does he have such power in his eyes, and why does he speak so scornfully about the “others,” the fearful ones, who after all are actually pious and pleasing to God?</p></blockquote><p>What can be more appealing to young men and women of little accomplishment than the idea that they are the chosen ones, that they are superior by virtue of their weakness and uselessness? What could better suit that collection of worthless parasites than an excuse to take pride in their barbaric rejection of constructive, civilized society? Sinclair’s misdeed was based on pure cowardice, and yet on the basis of nothing more than Demian’s baseless reinterpretation of the Cain story, his multi-faceted cowardice is transformed into heroism, even into a form of demi-godhood!</p><p>I didn’t understand this when I was 15. I took the concept of the “fearless ones” at face value, although fortunately I was not foolish enough to take the philosophy behind it seriously. I haven’t finished re-reading the book yet, but what I’m seeing is that <i>Demian </i>represents a proto-SJW perspective, although one that is considerably more educated and self-aware than modern SJWs because it is shaped in reaction to traditional Western culture and is therefore fully aware of what today’s SJWs do not know.</p><p>Hesse moved beyond this juvenile, reactionary, and self-deluded gnosticism in both <i>Siddhartha </i>and <i>The Glass Bead Game</i>, but the counterculture never did, not even when it became the popular culture. And if the philosophy is considerably more evil than I recalled, I have to say that the writing is even deeper and more insightful than I remembered.</p><p>It’s somewhat remarkable that a man capable of seeing so deeply into his own soul should then go so far afield philosophically, but then, perception is not analysis.</p></div>",
  "content_text": "It’s interesting to go back and read books that made an impression on you when you were younger.\nDemian\nwasn’t the Hesse novel that made a big impression on me, that was\nMagister Ludi\nas the paperback edition I had then called\nThe Glass Bead Game\n, but it was the first Hesse novel that I read and the one that drew me into becoming a moderately serious Hesse fan.\nHowever, as much as I enjoyed the books, I did not understand the countercultural appeal of Hesse back then. I was too much a child of the 80s to grasp why\nDemian\nand\nSteppenwolf\nwere so significant to the hippies and the other counterculturals who laid the groundwork for today’s SJWs, most of whom wouldn’t know Hermann Hesse from Rudolf Hess.\nBut I was reading\nDemian\nat the gym yesterday, and besides developing a newfound respect for James Franco, who wrote a rather amusing introduction to it, I began to understand both that historic countercultural appeal as well as the depth of literally Satanic evil intrinsic to the quasi-Gnostic philosophy expressed in the book. This passage, in particular, caught my attention:\nThen, at that moment, a memory flashed up within me that almost took my breath away: on that ill-starred evening when my misery had begun, that moment with my father when I had, so to speak, seen right through him and his bright clean world and wisdom, and despised them! Yes, I had imagined on my own that I was Cain and bore the mark, and that the mark was not a disgrace but a badge of honor; I had felt that my wicked misdeed made me superior to my father, higher than the good and pious people in his world.\nIt’s not that I had thought it all through, clearly and analytically, at the time; it was just an emotion flaring up, strange stirrings that hurt me but at the same time filled me with pride. Yet all these ideas were contained in the feeling I’d had.\nWhen I thought about how oddly Demian had spoken of the fearless tribe and the cowards, how strange his interpretation was of the mark on Cain’s forehead, and how marvelously his eyes, his peculiar, grown-up eyes, had lit up when he spoke, the vague thought passed through my mind: This Demian, is he not himself a kind of Cain? Why else would he defend Cain, if he didn’t feel like him? Why does he have such power in his eyes, and why does he speak so scornfully about the “others,” the fearful ones, who after all are actually pious and pleasing to God?\nWhat can be more appealing to young men and women of little accomplishment than the idea that they are the chosen ones, that they are superior by virtue of their weakness and uselessness? What could better suit that collection of worthless parasites than an excuse to take pride in their barbaric rejection of constructive, civilized society? Sinclair’s misdeed was based on pure cowardice, and yet on the basis of nothing more than Demian’s baseless reinterpretation of the Cain story, his multi-faceted cowardice is transformed into heroism, even into a form of demi-godhood!\nI didn’t understand this when I was 15. I took the concept of the “fearless ones” at face value, although fortunately I was not foolish enough to take the philosophy behind it seriously. I haven’t finished re-reading the book yet, but what I’m seeing is that\nDemian\nrepresents a proto-SJW perspective, although one that is considerably more educated and self-aware than modern SJWs because it is shaped in reaction to traditional Western culture and is therefore fully aware of what today’s SJWs do not know.\nHesse moved beyond this juvenile, reactionary, and self-deluded gnosticism in both\nSiddhartha\nand\nThe Glass Bead Game\n, but the counterculture never did, not even when it became the popular culture. And if the philosophy is considerably more evil than I recalled, I have to say that the writing is even deeper and more insightful than I remembered.\nIt’s somewhat remarkable that a man capable of seeing so deeply into his own soul should then go so far afield philosophically, but then, perception is not analysis.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-24T09:01:00+00:00"
}