{
  "url": "https://voxday.net/2015/09/09/there-is-no-escape-from-sjw/",
  "scraped_at": "2025-12-17T17:25:59.965608",
  "title": "There is no escape from SJW",
  "date_display": "September 9, 2015",
  "date_iso": "2015-09-09T12:30:00+00:00",
  "date_from_url": "2015-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SJWs are in the process of <a href=\"http://www.telegraph.co.uk/news/celebritynews/11851797/New-James-Bond-gets-a-live-in-girlfriend-and-outspoken-gay-friend.html\">reinventing James Bond</a> to be more to their liking:</p><blockquote class=\"tr_bq\"><p> For decades he has swaggered through life conquering women, chain smoking and saving the world, untroubled by the sensitivities of the 21st century. In a new book, however, James Bond will be getting a dose of modern morality, as author Anthony Horowitz reveals the tricks he used to drag the spy kicking and screaming into the era of political correctness.</p><p>Horowitz, the writer of new Bond novel <i>Trigger Mortis</i>, said he had worked carefully to preserve Ian Fleming’s original character and ensuring his 1950s attitudes remained in tact.</p><p>But he has introduced a cast of new characters to point out the error of his chauvinistic ways, including messages about smoking causing cancer, women who give him a run for his money, and an “outspoken” gay friend.</p><p>Horowitz, who has been given access to Fleming’s own notes to research his latest update, said he had inserted “little twists” to make the story work for modern readers.</p><p> “He does smoke cigarettes, he smokes many many cigarettes. But then what I do is I nudge him with a little reference to a newspaper article he happens to glance at which just reminds him that these things will give him cancer. With women, he has this sort of patronising carnal attitude with them which is absolutely accurate to the Bond of the books. But then by creating very strong women he is given quite a run for his money and his attitudes are challenged. I also gave him a very outspoken gay friend, who chides him and says ‘come on Bond, you’re living in the 20th century now not the Middle Ages.’”</p></blockquote><p>It’s not just science fiction, it’s not just games, it’s not just comics, it is literally everywhere. You cannot escape social justice morality, you can only submit to it or fight it. And one way to do the latter, as this gentleman inadvertently demonstrated, is <a href=\"http://www.theguardian.com/books/2015/sep/08/white-poet-chinese-pen-name-best-american-poetry-2015\">to black-knight it</a>.</p><blockquote class=\"tr_bq\"><p> Controversy has enveloped the prestigious Best American Poetry anthology after it emerged that a white poet had been included in the selection after adopting a Chinese pen name – and that Yi-Fen Chou’s poem was kept in the much sought-after lineup even after the author told editors his real identity was Michael Derrick Hudson.</p><p>At the back of the 2015 edition of The Best American Poetry, which is published today, Yi-Fen Chou is revealed as the pen name of Michael Derrick Hudson, from Indiana. Hudson writes that his poem chosen for the anthology, <i>The Bees, the Flowers, Jesus, Ancient Tigers, Poseidon, Adam and Eve</i>, was rejected under his real name 40 times before he sent it out as Yi-Fen Chou, when it was rejected nine times before getting accepted. “If indeed this is one of the best American poems of 2015, it took quite a bit of effort to get it into print, but I’m nothing if not persistent,” writes Hudson.</p></blockquote><p>At least Mr. Chou has had the sense to avoid apologizing, but it would have been even better if he had simply announced to his critics that he identifies as Chinese and to refer to him as “Michael Hudson” is deadnaming, racist, and wrongskinphobic.</p><p>This identity black-knighting is an excellent way to systematically undermine the SJWs, which is to claim whatever identities you find useful and force them to recognize them in precisely the same manner they declare war to be peace, black to be white, and Bruce to be Caitlyn. The key is to not overdo it or be too obvious – I see way too much stupid “well, I’m a lesbian in a man’s body, ha ha ha” here – and to stick to it relentlessly. If you’re a white writer, you should have at least one ethnic <i>nom de plume</i> to your credit.</p></div>",
  "content_text": "SJWs are in the process of\nreinventing James Bond\nto be more to their liking:\nFor decades he has swaggered through life conquering women, chain smoking and saving the world, untroubled by the sensitivities of the 21st century. In a new book, however, James Bond will be getting a dose of modern morality, as author Anthony Horowitz reveals the tricks he used to drag the spy kicking and screaming into the era of political correctness.\nHorowitz, the writer of new Bond novel\nTrigger Mortis\n, said he had worked carefully to preserve Ian Fleming’s original character and ensuring his 1950s attitudes remained in tact.\nBut he has introduced a cast of new characters to point out the error of his chauvinistic ways, including messages about smoking causing cancer, women who give him a run for his money, and an “outspoken” gay friend.\nHorowitz, who has been given access to Fleming’s own notes to research his latest update, said he had inserted “little twists” to make the story work for modern readers.\n“He does smoke cigarettes, he smokes many many cigarettes. But then what I do is I nudge him with a little reference to a newspaper article he happens to glance at which just reminds him that these things will give him cancer. With women, he has this sort of patronising carnal attitude with them which is absolutely accurate to the Bond of the books. But then by creating very strong women he is given quite a run for his money and his attitudes are challenged. I also gave him a very outspoken gay friend, who chides him and says ‘come on Bond, you’re living in the 20th century now not the Middle Ages.’”\nIt’s not just science fiction, it’s not just games, it’s not just comics, it is literally everywhere. You cannot escape social justice morality, you can only submit to it or fight it. And one way to do the latter, as this gentleman inadvertently demonstrated, is\nto black-knight it\n.\nControversy has enveloped the prestigious Best American Poetry anthology after it emerged that a white poet had been included in the selection after adopting a Chinese pen name – and that Yi-Fen Chou’s poem was kept in the much sought-after lineup even after the author told editors his real identity was Michael Derrick Hudson.\nAt the back of the 2015 edition of The Best American Poetry, which is published today, Yi-Fen Chou is revealed as the pen name of Michael Derrick Hudson, from Indiana. Hudson writes that his poem chosen for the anthology,\nThe Bees, the Flowers, Jesus, Ancient Tigers, Poseidon, Adam and Eve\n, was rejected under his real name 40 times before he sent it out as Yi-Fen Chou, when it was rejected nine times before getting accepted. “If indeed this is one of the best American poems of 2015, it took quite a bit of effort to get it into print, but I’m nothing if not persistent,” writes Hudson.\nAt least Mr. Chou has had the sense to avoid apologizing, but it would have been even better if he had simply announced to his critics that he identifies as Chinese and to refer to him as “Michael Hudson” is deadnaming, racist, and wrongskinphobic.\nThis identity black-knighting is an excellent way to systematically undermine the SJWs, which is to claim whatever identities you find useful and force them to recognize them in precisely the same manner they declare war to be peace, black to be white, and Bruce to be Caitlyn. The key is to not overdo it or be too obvious – I see way too much stupid “well, I’m a lesbian in a man’s body, ha ha ha” here – and to stick to it relentlessly. If you’re a white writer, you should have at least one ethnic\nnom de plume\nto your credit.",
  "tags": [
    "books",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-09T11:30:00+00:00"
}