{
  "url": "https://voxday.net/2015/09/17/third-times-char/",
  "scraped_at": "2025-12-17T17:27:02.733911",
  "title": "Third time’s the charm",
  "date_display": "September 17, 2015",
  "date_iso": "2015-09-17T23:29:00+00:00",
  "date_from_url": "2015-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve put the comments back into moderation again, as I expect Mr. Spooner will be spamming the blog until he is prevented from doing so tomorrow. He was warned by the officer and agreed to comply with the officer’s request after the officer’s second visit, but proved unable to keep his word this evening. As a result, I have compiled a document containing his most recent 1,500+ comments and sent it to the officer. A very brief sample is below.</p><blockquote class=\"tr_bq\"><p> Funny thing about an “echo chamber” Vox: The only real discussion is going on between the self-absorbed moderator and the guy who’s voice he keeps trying to silence. I’m in your head now bitch, and I’m not going anywhere. on Moderation is in effect<br> Andrew Spooner Jr. at 7:41 AM</br></p><p>Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. on Moderation is in effect<br> Andrew Spooner Jr.<br> at 8:20 AM</br></br></p><p>Your wife sucked my dick last night Vox. What a filthy hoe-bag. on Moderation is in effect<br> Andrew Spooner Jr. at 7:23 AM</br></p><p>I am making you own forces turn against you. Little puppet. I’ve been controlling you this whole time. I am your muse. Everything you have comes through me. And now I am instructed to take it all away. I will do so. And I will enjoy it. I will laugh a I do it. Because it is my purpose, and because you asked for it. on Moderation is in effect<br> Andrew Spooner Jr. at 5:39 AM</br></p><p>You can’t doxx someone who has nothing to hide. Which tells me that YOU have something to hide. Thanks for that. on Moderation is in effect<br> Andrew Spooner Jr. at 5:19 AM<br>     <br> I fucked your wife, Vox, and she loved it. Good thing nobody will ever see this post. You have absolutely no proof I ever said it, but you WILL let your temper get the best of you and come after me. on Pseudo-dialectic posturing<br> Andrew Spooner Jr. at 5:17 AM</br></br></br></br></p></blockquote><p>It’s a pity, but Mr. Spooner left me with little choice. So, please leave your comments as usual and Markku, Matt, and I will approve them without too much of a delay. And you might spare a moment to pray for the guy. Something is clearly not right with him and the whole thing stinks of the spiritual world. The Enemy always attacks through weak links, and despite whatever he is going through now, Andrew Spooner has been one of us for years.</p></div>",
  "content_text": "I’ve put the comments back into moderation again, as I expect Mr. Spooner will be spamming the blog until he is prevented from doing so tomorrow. He was warned by the officer and agreed to comply with the officer’s request after the officer’s second visit, but proved unable to keep his word this evening. As a result, I have compiled a document containing his most recent 1,500+ comments and sent it to the officer. A very brief sample is below.\nFunny thing about an “echo chamber” Vox: The only real discussion is going on between the self-absorbed moderator and the guy who’s voice he keeps trying to silence. I’m in your head now bitch, and I’m not going anywhere. on Moderation is in effect\nAndrew Spooner Jr. at 7:41 AM\nNowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. Nowhere to hide. on Moderation is in effect\nAndrew Spooner Jr.\nat 8:20 AM\nYour wife sucked my dick last night Vox. What a filthy hoe-bag. on Moderation is in effect\nAndrew Spooner Jr. at 7:23 AM\nI am making you own forces turn against you. Little puppet. I’ve been controlling you this whole time. I am your muse. Everything you have comes through me. And now I am instructed to take it all away. I will do so. And I will enjoy it. I will laugh a I do it. Because it is my purpose, and because you asked for it. on Moderation is in effect\nAndrew Spooner Jr. at 5:39 AM\nYou can’t doxx someone who has nothing to hide. Which tells me that YOU have something to hide. Thanks for that. on Moderation is in effect\nAndrew Spooner Jr. at 5:19 AM\nI fucked your wife, Vox, and she loved it. Good thing nobody will ever see this post. You have absolutely no proof I ever said it, but you WILL let your temper get the best of you and come after me. on Pseudo-dialectic posturing\nAndrew Spooner Jr. at 5:17 AM\nIt’s a pity, but Mr. Spooner left me with little choice. So, please leave your comments as usual and Markku, Matt, and I will approve them without too much of a delay. And you might spare a moment to pray for the guy. Something is clearly not right with him and the whole thing stinks of the spiritual world. The Enemy always attacks through weak links, and despite whatever he is going through now, Andrew Spooner has been one of us for years.",
  "tags": [
    "freakshow",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-17T22:29:00+00:00"
}