{
  "url": "https://voxday.net/2015/09/20/vox-and-fat-man/",
  "scraped_at": "2025-12-17T17:27:21.254017",
  "title": "Vox and the Fat Man",
  "date_display": "September 20, 2015",
  "date_iso": "2015-09-20T21:36:00+00:00",
  "date_from_url": "2015-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The great Cuck Defender Charlie Martin has been proving that he doesn’t care for two days now. A brief selection:</p><blockquote class=\"tr_bq\"><p> Charlie Martin<br> He’s made a bald assertion to which he himself is a counter-example.  It’s vacuous.</br></p><p>Charlie Martin<br> Vox has made the point that he’s  Italian now. Somehow his “race” hasn’t stopped adopting a new culture</br></p><p>Charlie Martin<br> As with his assertion that I don’t speak German. I answered in my “native” dialect of German.</br></p><p>Charlie Martin<br> And when he realizes he’s made a fool of himself he tries to change the subject.</br></p><p>Charlie Martin<br> And like a lot of “deep thinkers”, when caught out, he gets pissy.</br></p><p>Charlie Martin<br> So he veered to “fatty” — which hurt my feeling when I was six, not so much at 60.</br></p><p>Charlie Martin<br> Like a lot of other Great Men, he’s a childish bully and a shallow, petulant little man.</br></p><p>Charlie Martin<br> like a lot of other Great Men, he’s gotten a collection of sycophants who prefer following to thinking.</br></p><p>Charlie Martin<br> But as Trump, Obama, Sanders, and a million others have demonstrated, followers don’t make you smart.</br></p><p>Vox Day ‏@voxday<br> I’m sure if you just tweet 30 more times, you’ll convince everyone you don’t care, El Chubbo.</br></p><p>Charlie Martin<br> You’re a small little man whose major recent accomplishment was stealing someone else’s idea.</br></p><p>Vox Day ‏@voxday<br> So the Doritos didn’t do the trick? Perhaps you should try pizza, Chubbawumba.</br></p><p>Charlie Martin ‏@chasrmartin<br> And you still can’t get beyond middle school taunts.</br></p><p>Vox Day<br> That is all your butthurt rhetoric merits. I want you to be able to comprehend them, after all.</br></p></blockquote><p>The trick is to leave them to it once they’re triggered. You don’t want to overdo it; that’s just sadistic. Just step in every now and then and give them a little slap to keep them spinning. Like all Gammas, El Chubbo has been looking for an opportunity to “get even” since the last time he was publicly slapped down, which is why he jumped in to white knight David French, but he’s too caught up in his delusion bubble to grasp how far over his head he’s found himself.</p><p>The revelation here is that Charlie Martin has apparently been prone to having weight problems as long as he can remember. That’s the psych tell that explains his otherwise overly defensive behavior. And sure, while it makes perfect logical sense that a petty taunt about his weight should bother him less at 60 than at 6, the emotional reality is that it bothers him <i>more</i>. That’s why it triggered him for two straight days.</p><p>The reason is that after all this time, after all these years, after all his various adult accomplishments and efforts, he’s still dismissed as the little fat boy. It’s not actually my taunts that cause the emotional pain that set him off, it’s the memories of past pain that they induce in him. That’s why they’re called “triggers”.</p><p>It’s also why Gammas find their attempts to trigger me so futile. Notice how their attempts are always all over the place; they are searching, in vain, for something that hurts. Perhaps because they can’t identify with jocks, they never seem to grasp the psychological implication of my not only having been smart as a child, but an elite athlete as well. I’m not saying that I don’t have emotional triggers because we all do. It’s just that mine have absolutely nothing to do with the average intelligent individual’s.</p></div>",
  "content_text": "The great Cuck Defender Charlie Martin has been proving that he doesn’t care for two days now. A brief selection:\nCharlie Martin\nHe’s made a bald assertion to which he himself is a counter-example.  It’s vacuous.\nCharlie Martin\nVox has made the point that he’s  Italian now. Somehow his “race” hasn’t stopped adopting a new culture\nCharlie Martin\nAs with his assertion that I don’t speak German. I answered in my “native” dialect of German.\nCharlie Martin\nAnd when he realizes he’s made a fool of himself he tries to change the subject.\nCharlie Martin\nAnd like a lot of “deep thinkers”, when caught out, he gets pissy.\nCharlie Martin\nSo he veered to “fatty” — which hurt my feeling when I was six, not so much at 60.\nCharlie Martin\nLike a lot of other Great Men, he’s a childish bully and a shallow, petulant little man.\nCharlie Martin\nlike a lot of other Great Men, he’s gotten a collection of sycophants who prefer following to thinking.\nCharlie Martin\nBut as Trump, Obama, Sanders, and a million others have demonstrated, followers don’t make you smart.\nVox Day ‏@voxday\nI’m sure if you just tweet 30 more times, you’ll convince everyone you don’t care, El Chubbo.\nCharlie Martin\nYou’re a small little man whose major recent accomplishment was stealing someone else’s idea.\nVox Day ‏@voxday\nSo the Doritos didn’t do the trick? Perhaps you should try pizza, Chubbawumba.\nCharlie Martin ‏@chasrmartin\nAnd you still can’t get beyond middle school taunts.\nVox Day\nThat is all your butthurt rhetoric merits. I want you to be able to comprehend them, after all.\nThe trick is to leave them to it once they’re triggered. You don’t want to overdo it; that’s just sadistic. Just step in every now and then and give them a little slap to keep them spinning. Like all Gammas, El Chubbo has been looking for an opportunity to “get even” since the last time he was publicly slapped down, which is why he jumped in to white knight David French, but he’s too caught up in his delusion bubble to grasp how far over his head he’s found himself.\nThe revelation here is that Charlie Martin has apparently been prone to having weight problems as long as he can remember. That’s the psych tell that explains his otherwise overly defensive behavior. And sure, while it makes perfect logical sense that a petty taunt about his weight should bother him less at 60 than at 6, the emotional reality is that it bothers him\nmore\n. That’s why it triggered him for two straight days.\nThe reason is that after all this time, after all these years, after all his various adult accomplishments and efforts, he’s still dismissed as the little fat boy. It’s not actually my taunts that cause the emotional pain that set him off, it’s the memories of past pain that they induce in him. That’s why they’re called “triggers”.\nIt’s also why Gammas find their attempts to trigger me so futile. Notice how their attempts are always all over the place; they are searching, in vain, for something that hurts. Perhaps because they can’t identify with jocks, they never seem to grasp the psychological implication of my not only having been smart as a child, but an elite athlete as well. I’m not saying that I don’t have emotional triggers because we all do. It’s just that mine have absolutely nothing to do with the average intelligent individual’s.",
  "tags": [
    "debate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-09-20T20:36:00+00:00"
}