{
  "url": "https://voxday.net/2014/04/28/600-visits-day/",
  "scraped_at": "2025-12-16T12:12:48.487814",
  "title": "600 visits a day!",
  "date_display": "April 28, 2014",
  "date_iso": "2014-04-28T17:00:00+00:00",
  "date_from_url": "2014-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sorry, this was simply too funny not to share. For once, I don’t mean to come across as arrogant; it is an accomplishment to have several hundred readers a day. That being said, it is abundantly clear that these rabbits not only have <a href=\"http://bibliodaze.com/2014/04/vox-day-and-the-hugos-why-we-should-just-say-no/#li-comment-3015\">ZERO concept of the relative readerships involved</a>, and they can’t even bother to take five seconds to figure out the score before hopping to strategerize:</p><blockquote class=\"tr_bq\"><p> My website averages well over 600 visits a day. Based on comments from<br> other fanzine people, I’m guessing that’s more readers than VD’s blog<br> would get even when he provokes a shit storm. Let’s deprive him of the<br> traffic.</br></br></br></p></blockquote><p>Her guess is just a little off, as last Friday’s traffic was 46,456 Google pageviews. Lest you think it was the result of the Hugo Awards, that reflects a massive 12 percent increase from the 41,433 pageviews the Friday before my nomination got their knickers in a profound twist. In fact, one of the ways one can observe how small their little warrens are without them making the numbers public is the way one only sees a fairly small uptick in the blog stats whenever they are performing their usual point-and-shriek routine.</p><p>And, of course, my readership is but a brigade in comparison with the International Lord of Hate’s multitude of divisions.</p><p><b>THE CARL BRANDON AWARDS </b></p><p>But speaking of awards, TC declares “you are BY FAR my favorite PoC author” and reminds us that it is nomination time for the Carl Brandon Awards. The Carl<br> Brandon Parallax Award is for an outstanding work of speculative fiction<br> by a self-identified writer of color. The Carl Brandon Kindred Award is<br> for an outstanding speculative fiction work dealing with race and<br> ethnicity. You may nominate the same work for both awards.</br></br></br></br></p><p><b>My eligible works:</b></p><p>The Hugo-nominated “Opera Vita Aeterna”, from <i>The Last Witchking</i>, published by Marcher Lord Hinterlands, is eligible for both the Parallax Award and the Kindred Award as a short story.</p><p>The<br> Wardog’s Coin, published by Marcher Lord Hinterlands, is eligible for<br> the Parallax Award as a short story collection (one author).</br></br></p><p>QUANTUM MORTIS A Man Disrupted published by Marcher Lord Hinterlands, is eligible for the Parallax Award as a novel.</p><p>QUANTUM MORTIS Gravity Kills published by Marcher Lord Hinterlands, is eligible for the Parallax Award as a novel.</p><p><b>Other eligible works:</b></p><p>I would also remind you that the Hugo-nominated WARBOUND, by Larry Correia, published by Baen Books, is eligible for the Parallax Award as a novel.</p><p>Nominations can be made <a href=\"http://carlbrandon.org/2013noms.html\">here</a>. They cost nothing and can be made by anyone, but they must be made by April 30th.</p></div>",
  "content_text": "I’m sorry, this was simply too funny not to share. For once, I don’t mean to come across as arrogant; it is an accomplishment to have several hundred readers a day. That being said, it is abundantly clear that these rabbits not only have\nZERO concept of the relative readerships involved\n, and they can’t even bother to take five seconds to figure out the score before hopping to strategerize:\nMy website averages well over 600 visits a day. Based on comments from\nother fanzine people, I’m guessing that’s more readers than VD’s blog\nwould get even when he provokes a shit storm. Let’s deprive him of the\ntraffic.\nHer guess is just a little off, as last Friday’s traffic was 46,456 Google pageviews. Lest you think it was the result of the Hugo Awards, that reflects a massive 12 percent increase from the 41,433 pageviews the Friday before my nomination got their knickers in a profound twist. In fact, one of the ways one can observe how small their little warrens are without them making the numbers public is the way one only sees a fairly small uptick in the blog stats whenever they are performing their usual point-and-shriek routine.\nAnd, of course, my readership is but a brigade in comparison with the International Lord of Hate’s multitude of divisions.\nTHE CARL BRANDON AWARDS\nBut speaking of awards, TC declares “you are BY FAR my favorite PoC author” and reminds us that it is nomination time for the Carl Brandon Awards. The Carl\nBrandon Parallax Award is for an outstanding work of speculative fiction\nby a self-identified writer of color. The Carl Brandon Kindred Award is\nfor an outstanding speculative fiction work dealing with race and\nethnicity. You may nominate the same work for both awards.\nMy eligible works:\nThe Hugo-nominated “Opera Vita Aeterna”, from\nThe Last Witchking\n, published by Marcher Lord Hinterlands, is eligible for both the Parallax Award and the Kindred Award as a short story.\nThe\nWardog’s Coin, published by Marcher Lord Hinterlands, is eligible for\nthe Parallax Award as a short story collection (one author).\nQUANTUM MORTIS A Man Disrupted published by Marcher Lord Hinterlands, is eligible for the Parallax Award as a novel.\nQUANTUM MORTIS Gravity Kills published by Marcher Lord Hinterlands, is eligible for the Parallax Award as a novel.\nOther eligible works:\nI would also remind you that the Hugo-nominated WARBOUND, by Larry Correia, published by Baen Books, is eligible for the Parallax Award as a novel.\nNominations can be made\nhere\n. They cost nothing and can be made by anyone, but they must be made by April 30th.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-28T16:00:00+00:00"
}