{
  "url": "https://voxday.net/2014/04/26/a-fair-playing-field/",
  "scraped_at": "2025-12-16T12:12:31.254460",
  "title": "A fair playing field",
  "date_display": "April 26, 2014",
  "date_iso": "2014-04-26T08:48:00+00:00",
  "date_from_url": "2014-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is, I think, important to distinguish between the rabbits who are doing their usual rabbiting and the people at the organization that gives out the Hugo Awards. There may be some ideological overlap, but it is quite clear from everything that I have experienced and observed that the WorldCon people take their responsibilities seriously and have every intention of remaining above the fray. Kevin Standlee, who is one of the site administrators for thehugoawards.org, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2228546\">comments on the matter</a>:</p><blockquote class=\"tr_bq\"><p> I have not seen any serious proposals to attempt to limit eligibility for the Awards based on the content of the works. What I have seen are “right-wing” people saying that they’re sure that “left-wing” people will show up and pass rules prohibiting “those people” (whoever they are) from being on the ballot. These are the sort of oppression fantasy that both the left and right are prone to embracing, and they won’t happen. Even if someone would be so foolish as to try to introduce such a tom-fool motion, I predict it would be shot out of the water faster than you can say “Object to Consideration!”</p><p>I mean this. The regular attendees of the WSFS Business Meeting are a fractious lot who disagree profoundly over many things (there are many people posting here who can probably substantiate this, starting with Our Gracious Hosts), but I’ve seen the meeting’s members stand together as nearly one when this class of proposal comes before the meeting. Indeed, one particular fugghead proposed four bonehead proposals naming an individual and attempting to do something similar to trying to disqualify individuals for the Hugo Awards (albeit it was about Site Selection rather than the Hugos). The four proposals were killed within four minutes. And the fool was naming someone who was not particularly well-liked and was a notorious gadfly. WSFS will stomp on such things, and the entire governance process of the society makes it so difficult to change the rules without being able to get a broad consensus in two widely differing locations (London and Spokane, in the current case) that I dismiss talk of trying to regulate the content of Hugo nominees (as opposed to their technical form) as delusions.</p></blockquote><p>Every communication I have received from the Hugo Packet Administration from the moment they informed me of OVA’s nomination has been professional and polite. “Opera Vita Aeterna” will be in the packet along with the other nominated works, including all 14 volumes of <i>The Wheel of Time</i>, so it’s actually an astonishingly good deal for the $40 price of a supporting membership. And, if you recall, even when the nominations were announced, they were announced by the LonCon representatives in a level and impartial manner.</p><p>My impression is that the Awards people are primarily concerned that everyone follows the rules appropriately. Since Larry and I both did so, they have no inherent problem with our nominations nor do they have any desire to sabotage their own system merely because a few people on the Left don’t happen to be overly enamored of us. Indeed, they seemed to be pleased to announce the fact that a record number of nominating ballots were cast and I have heard they are anticipating a record number of votes for the awards. Supporting membership sales are also up. All three things are historical feathers in LonCon’s cap.</p><p>So, I strongly suggest leaving the Awards people out of it. Many of you have argued that it is important to separate the professional from the personal and the political, and they appear to be doing precisely that, regardless of what their personal sympathies and political inclinations may happen to be. For which, I would think they are to be congratulated, not condemned.</p><p>Now to speak of an unfair playing field. One of the site administrators of Making Light, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2223564\">Abi Sutherland declared</a>:</p><blockquote class=\"tr_bq\"><p> (You know what I would love? adore? enjoy the heck out of?  A genuine Larry Correia fan coming here and <i>enthusing</i> about the work.  Taking about what it <i>is</i>, not what it is not; talking about why they love it rather than why they hate Librul SF and the Libruls who read it. And that is the difference between Correia and Day, in my view.  I can’t picture a Day fan doing that and making it work.)</p></blockquote><p>I think she’s wrong. In fact, I think my fans are every bit as capable of explaining why they love what they love in a positive manner as Larry’s fans. So, if you are inclined to enthuse about one of my works, talk about what it is rather than what it is not, and explain why you love it, I would encourage you to go there and do so. But I will caution you that you will be attacked, ridiculed, insulted, disbelieved, and most likely, disemvoweled by the Toad of Tor, so don’t even think about doing it unless you can remain calm and resist the temptation to respond in kind. Remember, you’re never going to convince the closed minds of the sort that will respond to you, but you can convince the larger numbers of more reasonable people who read in silence.</p></div>",
  "content_text": "It is, I think, important to distinguish between the rabbits who are doing their usual rabbiting and the people at the organization that gives out the Hugo Awards. There may be some ideological overlap, but it is quite clear from everything that I have experienced and observed that the WorldCon people take their responsibilities seriously and have every intention of remaining above the fray. Kevin Standlee, who is one of the site administrators for thehugoawards.org,\ncomments on the matter\n:\nI have not seen any serious proposals to attempt to limit eligibility for the Awards based on the content of the works. What I have seen are “right-wing” people saying that they’re sure that “left-wing” people will show up and pass rules prohibiting “those people” (whoever they are) from being on the ballot. These are the sort of oppression fantasy that both the left and right are prone to embracing, and they won’t happen. Even if someone would be so foolish as to try to introduce such a tom-fool motion, I predict it would be shot out of the water faster than you can say “Object to Consideration!”\nI mean this. The regular attendees of the WSFS Business Meeting are a fractious lot who disagree profoundly over many things (there are many people posting here who can probably substantiate this, starting with Our Gracious Hosts), but I’ve seen the meeting’s members stand together as nearly one when this class of proposal comes before the meeting. Indeed, one particular fugghead proposed four bonehead proposals naming an individual and attempting to do something similar to trying to disqualify individuals for the Hugo Awards (albeit it was about Site Selection rather than the Hugos). The four proposals were killed within four minutes. And the fool was naming someone who was not particularly well-liked and was a notorious gadfly. WSFS will stomp on such things, and the entire governance process of the society makes it so difficult to change the rules without being able to get a broad consensus in two widely differing locations (London and Spokane, in the current case) that I dismiss talk of trying to regulate the content of Hugo nominees (as opposed to their technical form) as delusions.\nEvery communication I have received from the Hugo Packet Administration from the moment they informed me of OVA’s nomination has been professional and polite. “Opera Vita Aeterna” will be in the packet along with the other nominated works, including all 14 volumes of\nThe Wheel of Time\n, so it’s actually an astonishingly good deal for the $40 price of a supporting membership. And, if you recall, even when the nominations were announced, they were announced by the LonCon representatives in a level and impartial manner.\nMy impression is that the Awards people are primarily concerned that everyone follows the rules appropriately. Since Larry and I both did so, they have no inherent problem with our nominations nor do they have any desire to sabotage their own system merely because a few people on the Left don’t happen to be overly enamored of us. Indeed, they seemed to be pleased to announce the fact that a record number of nominating ballots were cast and I have heard they are anticipating a record number of votes for the awards. Supporting membership sales are also up. All three things are historical feathers in LonCon’s cap.\nSo, I strongly suggest leaving the Awards people out of it. Many of you have argued that it is important to separate the professional from the personal and the political, and they appear to be doing precisely that, regardless of what their personal sympathies and political inclinations may happen to be. For which, I would think they are to be congratulated, not condemned.\nNow to speak of an unfair playing field. One of the site administrators of Making Light,\nAbi Sutherland declared\n:\n(You know what I would love? adore? enjoy the heck out of?  A genuine Larry Correia fan coming here and\nenthusing\nabout the work.  Taking about what it\nis\n, not what it is not; talking about why they love it rather than why they hate Librul SF and the Libruls who read it. And that is the difference between Correia and Day, in my view.  I can’t picture a Day fan doing that and making it work.)\nI think she’s wrong. In fact, I think my fans are every bit as capable of explaining why they love what they love in a positive manner as Larry’s fans. So, if you are inclined to enthuse about one of my works, talk about what it is rather than what it is not, and explain why you love it, I would encourage you to go there and do so. But I will caution you that you will be attacked, ridiculed, insulted, disbelieved, and most likely, disemvoweled by the Toad of Tor, so don’t even think about doing it unless you can remain calm and resist the temptation to respond in kind. Remember, you’re never going to convince the closed minds of the sort that will respond to you, but you can convince the larger numbers of more reasonable people who read in silence.",
  "tags": [
    "Hugo Award",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-26T07:48:00+00:00"
}