{
  "url": "https://voxday.net/2014/04/22/a-few-of-my-favorite-tweets/",
  "scraped_at": "2025-12-15T16:53:36.644497",
  "title": "A few of my favorite tweets",
  "date_display": "April 22, 2014",
  "date_iso": "2014-04-22T18:39:00+00:00",
  "date_from_url": "2014-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of the more amusing examples of the open minds on the Left:</p><p><i>Adam Roberts ?@arrroberts </i><br> <i>I’ve never been nominated for a Hugo. Vox Day has been nominated for a Hugo. SF esteems Vox Day more than me. That’s a hard pill to swallow.</i></br></p><p>What can I say? SF likes me! It really likes me!<i> </i></p><p><i>James Worrad ?@jimworrad </i><br> <i>Larry Correia?!? Vox Day? The Tango &amp; Cash of stupid have bust outta jail! #hugoawards </i></br></p><p>Let’s get this straight. I am pronounced a die-hard racist and white supremacist, among other things, for the crime of labeling an African-American author a half-savage, but it is acceptable to call two Hispanic authors stupid criminals? I’m just trying to figure out the rules here.</p><p><i>Luis Vazquez @luisishere</i><br> <i>So many of my favorite works and people nominated for the #HugoAwards this year, but the Vox Day nomination ruins it for me.</i></br></p><p>So much for the White myth of solidarity between People of Color.</p><p><i>Charles Stross@cstross</i><br> <i>Novelette: WTF is Vox Day doing on the shortlist?!?</i></br></p><p>I might ask the same question concerning him. He’s been a fine author in the past, and indeed, I nominated him for several Nebula awards in the past, but the observable fact is that his work has been in modest decline since the halcyon days of “A Colder War” and <i>Accelerando</i>.<br> <i><br/></i><br> <i>I’m really glad I’m not eligible to vote – it’s just depressing to me to see RSHD on a ballot anywhere. Not just because I think he’s a terrible human being, but because I think he’s a terrible writer. But because I do think he’s a terrible human being, it’s depressing to see him on a ballot. It feels like a victory for the bad guys. And even a small victory for him is a victory too many.</i></br></br></p><p>Not a tweet, just a comment at Whatever that amused me. Perhaps I am a terrible writer. Or perhaps not. It’s not for me to say. But it never seems to occur to these sad and depressed critics that perhaps one reason why my work continues to become more popular over time is that it contains something that appeals to people, something that they are clearly unable to see.</p><p><i>As noted, given my experience of his writing I’m not expecting great things, but you never do know and I’m willing to be surprised. However, I also acknowledge a personal dislike of the fellow — I think as a human being he’s a contemptible piece of shit — and I would be lying if I didn’t believe that will have an effect on how I approach the work.</i></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/04/popering.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/popering.jpg\" width=\"243\"/></a></div><p>I thought this was remarkable; for once we are given a glimpse past the John Scalzi mask and its false expression of permanent amusement. For my part, I simply happen to think that he is a fraud and a bit of a con man. Given that I’ve pointed out a few of his self-serving fictions, one would hardly expect him to be pleased with me.</p><p>And then there are the various people who have accused me of the unspeakable crime of being white. Their confusion is understandable, given my fair skin, but also indicative of a failure to grasp human genetics. The news would certainly surprise a number of families on my mother’s side, whose names, were I to disclose them, are not what one would describe as indicative of European descent. But it is reassuring to learn how many white progressives take their duties as Race Police so seriously.</p><p>I was also invited to speak my piece by Harlan Ellison:</p><blockquote class=\"tr_bq\"><p> HEED, IF YOU WILL: I have now received two (2) actual letters (avec postage stamps) and<br> four (4) phone calls, and even one (1) E.Mail concerning someone whose<br> name I had never heard, of whose existence I was blissfully unaware, who aparently has (I was informed) a voluble,<br> busy “blogsite.”  Said person goes by the nom-de-plume “Vox Day.”</br></br></br></p><p>Apparently, said personage has (in the words of at least three (3) of my<br> communicants, who have won MULTIPLE Hugos, Nebulas, Edgars, and on and<br> on) “gamed the Hugo system” and gotten via the tagalong-gang of the<br> website-wad, a chance at, or the actual nomination for, a Hugo.</br></br></br></p><p>I do not know this “Vox Day,” at least under that name.  I do not know<br> what story is under consideration, nor its value or depth of its<br> artistry.  I have no dog in this hunt.</br></br></p><p>Nonetheless, superior writers with creds that would chocke a chimpanzee<br> seem to have their fur bristling.  THEY tell ME this ain’t a good thing,<br> that it appears to be an electronic end-run to get somebody with a<br> fan-base into contention with others who may or may not be doing “the<br> job” better.</br></br></br></br></p><p>I dunno.  I report what is conveyed to me.  It ain’t my fight, and if<br> wannabes and the entrenched desire to unfurl banners and lob chain-link<br> cannonballs at one another…heh heh heh…I’m a SFWA Grand Master with 4<br> Writers Guild Best awards, 102 books, 81/2 Hugos, 5 Nebulas, 2 Edgars and more junk metal and Lucite awards<br> than you could cram into ten cells of a psycho ward…(have you noticed,<br> even at age buttin’up’to 80, I don’t do humility very well)…if<br> there’s a fight, and Big Writers think “Vox Day” is not playing fair,<br> this is a reasoned, smart, informed and rational podium, this site, and I<br> urge strongarm demand cozen and inveigle one and all, including the eye<br> of the storm him/or/herself (hashtag-pseudoinyms are such bullshit) to<br> avail themselves of this forum.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p> TO WHICH I RESPONDED <a href=\"http://harlanellison.com/heboard/unca.php\">ON HIS SITE</a>:</p><p> Thank you for the kind invitation, Mr. Ellison. Let it be known that I<br> categorically deny all accusations of ballot-stuffing, cheating, gaming<br> the system, and indeed, not playing fair, with regards to the 2014 Hugo<br> nomination for Best Novelette.</br></br></br></p><p>I am a professional game designer with millions of games sold. Rest<br> assured that had I wished to game the system, I would have also been<br> nominated for best novel, best novella, and best short story this year,<br> as I had eligible works published in all four categories.</br></br></br></p><p>As you can see from my web site, I also have a popular pair of blogs<br> which average 1.3 million Google pageviews a month. A few – a very small<br> percentage – of my regular readers responded to a post in which I<br> mentioned which works Larry Correia, the popular New York Times<br> bestselling author, was recommending, and added a few recommendations of<br> my own. That was the extent of my “campaign”. My understanding that<br> these actions were no different than various other authors have done in<br> the past and well within the zone of fair play.</br></br></br></br></br></br></br></p><p>I believe what is in the process of happening here is very similar to<br> what happened in the news media when Fox News was first launched. The<br> USA is roughly divided in half ideologically between left and right. But<br> the preponderance of the news media product and the current SF/F<br> product is produced to appeal to the left. So, it should be entirely<br> obvious that products which appeal to the right will tend to be<br> considerably more popular, on average, than products which appeal to the<br> left.</br></br></br></br></br></br></br></p><p>For example, my fellow nominee Charles Stross released a novel in 2012,<br> as did I. He is well-known and well-regarded in the SF/F community; I am<br> not. And yet, while THE APOCALYPSE CODEX has 96 reviews and a 4.3<br> ranking, A THRONE OF BONES, published a few months later, has 142<br> reviews, and a 4.2 ranking. The relevant difference is that until<br> recently, very few of my readers knew, or cared, what a “Hugo” was.</br></br></br></br></br></p><p>Most of the outrage is the simple result of a bunch of old white people<br> who inclined to the left being in denial about the fact that a pair of<br> Hispanic writers who lean right are just as popular as some of the<br> writers they prefer.</br></br></br></p></div>",
  "content_text": "Some of the more amusing examples of the open minds on the Left:\nAdam Roberts ?@arrroberts\nI’ve never been nominated for a Hugo. Vox Day has been nominated for a Hugo. SF esteems Vox Day more than me. That’s a hard pill to swallow.\nWhat can I say? SF likes me! It really likes me!\nJames Worrad ?@jimworrad\nLarry Correia?!? Vox Day? The Tango & Cash of stupid have bust outta jail! #hugoawards\nLet’s get this straight. I am pronounced a die-hard racist and white supremacist, among other things, for the crime of labeling an African-American author a half-savage, but it is acceptable to call two Hispanic authors stupid criminals? I’m just trying to figure out the rules here.\nLuis Vazquez @luisishere\nSo many of my favorite works and people nominated for the #HugoAwards this year, but the Vox Day nomination ruins it for me.\nSo much for the White myth of solidarity between People of Color.\nCharles Stross@cstross\nNovelette: WTF is Vox Day doing on the shortlist?!?\nI might ask the same question concerning him. He’s been a fine author in the past, and indeed, I nominated him for several Nebula awards in the past, but the observable fact is that his work has been in modest decline since the halcyon days of “A Colder War” and\nAccelerando\n.\nI’m really glad I’m not eligible to vote – it’s just depressing to me to see RSHD on a ballot anywhere. Not just because I think he’s a terrible human being, but because I think he’s a terrible writer. But because I do think he’s a terrible human being, it’s depressing to see him on a ballot. It feels like a victory for the bad guys. And even a small victory for him is a victory too many.\nNot a tweet, just a comment at Whatever that amused me. Perhaps I am a terrible writer. Or perhaps not. It’s not for me to say. But it never seems to occur to these sad and depressed critics that perhaps one reason why my work continues to become more popular over time is that it contains something that appeals to people, something that they are clearly unable to see.\nAs noted, given my experience of his writing I’m not expecting great things, but you never do know and I’m willing to be surprised. However, I also acknowledge a personal dislike of the fellow — I think as a human being he’s a contemptible piece of shit — and I would be lying if I didn’t believe that will have an effect on how I approach the work.\nI thought this was remarkable; for once we are given a glimpse past the John Scalzi mask and its false expression of permanent amusement. For my part, I simply happen to think that he is a fraud and a bit of a con man. Given that I’ve pointed out a few of his self-serving fictions, one would hardly expect him to be pleased with me.\nAnd then there are the various people who have accused me of the unspeakable crime of being white. Their confusion is understandable, given my fair skin, but also indicative of a failure to grasp human genetics. The news would certainly surprise a number of families on my mother’s side, whose names, were I to disclose them, are not what one would describe as indicative of European descent. But it is reassuring to learn how many white progressives take their duties as Race Police so seriously.\nI was also invited to speak my piece by Harlan Ellison:\nHEED, IF YOU WILL: I have now received two (2) actual letters (avec postage stamps) and\nfour (4) phone calls, and even one (1) E.Mail concerning someone whose\nname I had never heard, of whose existence I was blissfully unaware, who aparently has (I was informed) a voluble,\nbusy “blogsite.”  Said person goes by the nom-de-plume “Vox Day.”\nApparently, said personage has (in the words of at least three (3) of my\ncommunicants, who have won MULTIPLE Hugos, Nebulas, Edgars, and on and\non) “gamed the Hugo system” and gotten via the tagalong-gang of the\nwebsite-wad, a chance at, or the actual nomination for, a Hugo.\nI do not know this “Vox Day,” at least under that name.  I do not know\nwhat story is under consideration, nor its value or depth of its\nartistry.  I have no dog in this hunt.\nNonetheless, superior writers with creds that would chocke a chimpanzee\nseem to have their fur bristling.  THEY tell ME this ain’t a good thing,\nthat it appears to be an electronic end-run to get somebody with a\nfan-base into contention with others who may or may not be doing “the\njob” better.\nI dunno.  I report what is conveyed to me.  It ain’t my fight, and if\nwannabes and the entrenched desire to unfurl banners and lob chain-link\ncannonballs at one another…heh heh heh…I’m a SFWA Grand Master with 4\nWriters Guild Best awards, 102 books, 81/2 Hugos, 5 Nebulas, 2 Edgars and more junk metal and Lucite awards\nthan you could cram into ten cells of a psycho ward…(have you noticed,\neven at age buttin’up’to 80, I don’t do humility very well)…if\nthere’s a fight, and Big Writers think “Vox Day” is not playing fair,\nthis is a reasoned, smart, informed and rational podium, this site, and I\nurge strongarm demand cozen and inveigle one and all, including the eye\nof the storm him/or/herself (hashtag-pseudoinyms are such bullshit) to\navail themselves of this forum.\nTO WHICH I RESPONDED\nON HIS SITE\n:\nThank you for the kind invitation, Mr. Ellison. Let it be known that I\ncategorically deny all accusations of ballot-stuffing, cheating, gaming\nthe system, and indeed, not playing fair, with regards to the 2014 Hugo\nnomination for Best Novelette.\nI am a professional game designer with millions of games sold. Rest\nassured that had I wished to game the system, I would have also been\nnominated for best novel, best novella, and best short story this year,\nas I had eligible works published in all four categories.\nAs you can see from my web site, I also have a popular pair of blogs\nwhich average 1.3 million Google pageviews a month. A few – a very small\npercentage – of my regular readers responded to a post in which I\nmentioned which works Larry Correia, the popular New York Times\nbestselling author, was recommending, and added a few recommendations of\nmy own. That was the extent of my “campaign”. My understanding that\nthese actions were no different than various other authors have done in\nthe past and well within the zone of fair play.\nI believe what is in the process of happening here is very similar to\nwhat happened in the news media when Fox News was first launched. The\nUSA is roughly divided in half ideologically between left and right. But\nthe preponderance of the news media product and the current SF/F\nproduct is produced to appeal to the left. So, it should be entirely\nobvious that products which appeal to the right will tend to be\nconsiderably more popular, on average, than products which appeal to the\nleft.\nFor example, my fellow nominee Charles Stross released a novel in 2012,\nas did I. He is well-known and well-regarded in the SF/F community; I am\nnot. And yet, while THE APOCALYPSE CODEX has 96 reviews and a 4.3\nranking, A THRONE OF BONES, published a few months later, has 142\nreviews, and a 4.2 ranking. The relevant difference is that until\nrecently, very few of my readers knew, or cared, what a “Hugo” was.\nMost of the outrage is the simple result of a bunch of old white people\nwho inclined to the left being in denial about the fact that a pair of\nHispanic writers who lean right are just as popular as some of the\nwriters they prefer.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-22T17:39:00+00:00"
}