{
  "url": "https://voxday.net/2014/04/28/a-letter-to-sfwa/",
  "scraped_at": "2025-12-16T12:12:46.653515",
  "title": "A letter to the SFWA",
  "date_display": "April 28, 2014",
  "date_iso": "2014-04-28T12:30:00+00:00",
  "date_from_url": "2014-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nebula-nominated author John C. Wright, the author of <i>THE GOLDEN AGE</i> and <i>AWAKE IN THE NIGHT LAND</i>, and one of the most accomplished science fiction writers alive, has publicly <a href=\"http://www.scifiwright.com/2014/04/an-open-letter-to-the-science-fiction-writers-of-america/\">resigned from Science Fiction Writers of America</a>:</p><blockquote class=\"tr_bq\"><p> To whom it may concern,</p><p>It is with no regret whatsoever that I rescind and renounce my membership in SWFA. I wish nothing more to do with the organization and no more contact with it.</p><p>The cause which impels the separation is clear enough: over a period long enough to confirm that this is no mere passing phase, the SWFA leadership and a significant moiety of its membership has departed from the mission of the organization, and, indeed, betrayed it.</p><p>The mission of SWFA was to act as a professional organization, to enhance the prestige of writers in our genre, to deter fraud, and to give mutual aid and support to our professional dreams.</p><p>It was out of loyalty to this mission that I so eagerly joined SWFA immediately upon my first professional sales, and the reason why I was so proud to associate with the luminaries and bold trailblazers in a genre I thought we all loved.</p><p>When SWFA first departed from that mission, I continued for a time to hope the change was not permanent. Recent events have made it clear that there is not reasonable basis for that hope.</p><p>Instead of enhancing the prestige of the genre, the leadership seems bent on holding us up to the jeers of all fair-minded men by behaving as gossips, whiners, and petty totalitarians, and by supporting a political agenda irrelevant to science fiction.</p></blockquote><p>Read the rest of it on his journal. It is a powerful and accurate indictment of the decline of a formerly meritorious organization. SFWA could survive the loss of a minor writer like me without anyone even noticing. But if the very best and most successful writers in the science fiction and fantasy fields see no place for themselves in it, then it is readily apparent that the organization has no reason to exist.</p><p>UPDATE: In the comments on Mr. Wright’s blog, the Hugo-, Campbell-, and Nebula-nominated science fiction author Brad Torgersen announces that he, too, is leaving SFWA.</p><blockquote class=\"tr_bq\"><p> It was with great excitement that I first entered SFWA as a full member<br> in 2011.  It’s with a deflated and resigned sense of sadness that I am<br> letting my SFWA membership lapse in 2014.  Largely for the reasons<br> you’ve cited, John.  Instead of tackling (head on) the job of defending<br> authors’ interests in a publishing industry enduring great change, SFWA<br> contents itself by persecuting individual members for perceived sins of<br> nonconformity, engaging in ideological purity tests (“Your papers . . .<br> they are not in order!”) and impugning the reputations of men (and<br> women) who have devoted their lives to enriching and growing the field.</br></br></br></br></br></br></br></br></p></blockquote></div>",
  "content_text": "Nebula-nominated author John C. Wright, the author of\nTHE GOLDEN AGE\nand\nAWAKE IN THE NIGHT LAND\n, and one of the most accomplished science fiction writers alive, has publicly\nresigned from Science Fiction Writers of America\n:\nTo whom it may concern,\nIt is with no regret whatsoever that I rescind and renounce my membership in SWFA. I wish nothing more to do with the organization and no more contact with it.\nThe cause which impels the separation is clear enough: over a period long enough to confirm that this is no mere passing phase, the SWFA leadership and a significant moiety of its membership has departed from the mission of the organization, and, indeed, betrayed it.\nThe mission of SWFA was to act as a professional organization, to enhance the prestige of writers in our genre, to deter fraud, and to give mutual aid and support to our professional dreams.\nIt was out of loyalty to this mission that I so eagerly joined SWFA immediately upon my first professional sales, and the reason why I was so proud to associate with the luminaries and bold trailblazers in a genre I thought we all loved.\nWhen SWFA first departed from that mission, I continued for a time to hope the change was not permanent. Recent events have made it clear that there is not reasonable basis for that hope.\nInstead of enhancing the prestige of the genre, the leadership seems bent on holding us up to the jeers of all fair-minded men by behaving as gossips, whiners, and petty totalitarians, and by supporting a political agenda irrelevant to science fiction.\nRead the rest of it on his journal. It is a powerful and accurate indictment of the decline of a formerly meritorious organization. SFWA could survive the loss of a minor writer like me without anyone even noticing. But if the very best and most successful writers in the science fiction and fantasy fields see no place for themselves in it, then it is readily apparent that the organization has no reason to exist.\nUPDATE: In the comments on Mr. Wright’s blog, the Hugo-, Campbell-, and Nebula-nominated science fiction author Brad Torgersen announces that he, too, is leaving SFWA.\nIt was with great excitement that I first entered SFWA as a full member\nin 2011.  It’s with a deflated and resigned sense of sadness that I am\nletting my SFWA membership lapse in 2014.  Largely for the reasons\nyou’ve cited, John.  Instead of tackling (head on) the job of defending\nauthors’ interests in a publishing industry enduring great change, SFWA\ncontents itself by persecuting individual members for perceived sins of\nnonconformity, engaging in ideological purity tests (“Your papers . . .\nthey are not in order!”) and impugning the reputations of men (and\nwomen) who have devoted their lives to enriching and growing the field.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-28T11:30:00+00:00"
}