{
  "url": "https://voxday.net/2014/04/14/a-review-of-awake-in-night-land/",
  "scraped_at": "2025-12-15T16:52:43.434512",
  "title": "A review of AWAKE IN THE NIGHT LAND",
  "date_display": "April 14, 2014",
  "date_iso": "2014-04-14T13:00:00+00:00",
  "date_from_url": "2014-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>As part of Night Land Day, I asked Andy Robertson, who founded <a href=\"http://www.thenightland.co.uk/nightmap.html\">The Night Land</a> site and first published the novellas there</i><i>, to share his thoughts on the new book. He went one better and explained both how the site developed as well as his initial reaction to John C. Wright’s forays into the Night Lands, now collected in <a href=\"http://www.amazon.com/dp/B00JM98V60\"><b>AWAKE IN THE NIGHT LAND</b></a>:</i></p><p>The dark, looming, images of the Land had made<br> such an impact on me.  When I started to<br> write stories set in that world, it was as if I<br> remembered a life I had lived in that society,<br> with its prim manners overlaying iron values and<br> its dauntless courage.   I didn’t need<br> to make anything up. I just watched it happen.</br></br></br></br></br></br></p><p>Brett Davidson sent me a story from New<br> Zealand with a background that<br> complemented  and extended my own, and I<br> found the person who would be my principle<br> creative partner.   For years we’ve<br> batted ideas back and forth by email late at<br> night.   Other writers joined us and<br> mostly took their lead from Brett and<br> I. We were building a shared world<br> but one so rich and vivid felt as if we were<br> were discovering something that already<br> existed.  I don’t think I’ve ever had such<br> fun ((while vertical)) in my life.  </br></br></br></br></br></br></br></br></br></br></br></br></p><p>And then I got a new submission, from John C<br> Wright, which was quite apart from all the other<br> Night Land tales.</br></br></p><p>I’d written a fusion of  Hodgson’s vision<br> with cutting-edge science, and tried to evoke a<br> credible Redoubt culture, a culture that might<br> really last ten million years.  <br> Therefore my Redoubt was a society of strict<br> moral codes, an actual functional and enforced<br> marriage contract, strong kinship bonds, and<br> sharply differentiated complementary behavior of<br> men and women. ((It strikes me only now that<br> this is mistaken by some readers for archaism.<br> But of course  it isn’t.  It’s<br> futurism.  Or just realism. No society<br> without these values or something like them can<br> survive more than a couple of<br> generations.))  And I’d written of a<br> society rich in technical and scientific<br> knowledge, including as unremarked givens such<br> familiar SF tropes as nanotechnology,<br> cyborgisation, and Artificial<br> Intelligence.   I had some fun<br> integrating these into Hodgson’s “scientific”<br> formulation of reincarnation and psychic<br> predation.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>I had done my best to reinterpret the Night Land as science fiction, and other writers<br> had followed me.   But  John’s<br> story followed his own dreams.</br></br></p><p>His character names were derived from classical<br> Greek, not generic IndoEuropean sememes. The<br> manners of the society were likewise closely<br> modeled on the ancient pagans. Dozois has called<br> this an air of distanced antiquity, and it works<br> well, but I repeat it’s distinctly different<br> from my own, which is not antique at all. His<br> was not a technically sophisticated society and<br> seemed not to have a scientific attitude to the<br> alien Land that surrounded it. It ran off rote<br> technology and was ignorant of the workings of<br> much of the machinery it depended on. It was<br> doomed and dwindling and dark and candle-lit, a<br> tumbledown place with a hint of Ghormenghast to<br> it. (I know John will hate that comparison, and<br> I apologize). The story was one of childhood<br> friendship, rivalry, disaster and rescue. The<br> writing style was, incidentally, brilliant.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>I bought it and published it in our first<br> hardcopy anthology, ENDLESS LOVE. It got into<br> Dozois’ BEST SF and several other yearly<br> anthlogies and created a minor sensation. There<br> are still places where the first taste of<br/> Hodgson’s work a casual reader will get is the<br/> translation of “Awake in the Night” in that<br/> year’s Dozois, and the story is an entry drug<br/> not only for THE NIGHT LAND but for Hodgson<br/> himself and all his work. This was a story which<br/> Hodgson might have written if he had been a more<br/> gifted weaver of words. John remarked to me at<br/> one point that he was surprised at the story’s<br/> popularity. I think we both understood that<br/> despite its author’s talent, the real power<br/> resided in the way it had stayed faithful to<br/> Hodgson’s own visions, without elaborating them<br/> too much. The whole world could now see and<br/> share Hodgson’s original Night Land. They were<br/> seeing it through John’s eyes, not mine, but<br/> that didn’t matter to me.   This was<br/> what I had set the NightLand website up for.</br></br></br></br></p><p> *****<br/>  <br/> I expected a whole series of tales from John<br/> set in his version of The Night Land, but his<br/> next story was a radical departure from anything<br/> that he or any of the rest of us had ever done.<br/> It surpassed not only Hodgson’s talents but,<br/> damn it, Lovecraft’s.</p><p>When I read “Awake in the<br/> Night” I felt some envy, but when the ms for<br/> “The Last of All Suns” crossed my inbox I felt<br/> something like awe. It’s almost impossible to describe this<br/> story without employing spoilers, because there<br/> is nothing else like it to compare it to or to<br/> hint that it is like.</p><p>Read the whole thing <a href=\"http://www.thenightland.co.uk/nightANL.html\">at The Night Land</a><i>.</i></p></div>",
  "content_text": "As part of Night Land Day, I asked Andy Robertson, who founded\nThe Night Land\nsite and first published the novellas there\n, to share his thoughts on the new book. He went one better and explained both how the site developed as well as his initial reaction to John C. Wright’s forays into the Night Lands, now collected in\nAWAKE IN THE NIGHT LAND\n:\nThe dark, looming, images of the Land had made\nsuch an impact on me.  When I started to\nwrite stories set in that world, it was as if I\nremembered a life I had lived in that society,\nwith its prim manners overlaying iron values and\nits dauntless courage.   I didn’t need\nto make anything up. I just watched it happen.\nBrett Davidson sent me a story from New\nZealand with a background that\ncomplemented  and extended my own, and I\nfound the person who would be my principle\ncreative partner.   For years we’ve\nbatted ideas back and forth by email late at\nnight.   Other writers joined us and\nmostly took their lead from Brett and\nI. We were building a shared world\nbut one so rich and vivid felt as if we were\nwere discovering something that already\nexisted.  I don’t think I’ve ever had such\nfun ((while vertical)) in my life.\nAnd then I got a new submission, from John C\nWright, which was quite apart from all the other\nNight Land tales.\nI’d written a fusion of  Hodgson’s vision\nwith cutting-edge science, and tried to evoke a\ncredible Redoubt culture, a culture that might\nreally last ten million years.\nTherefore my Redoubt was a society of strict\nmoral codes, an actual functional and enforced\nmarriage contract, strong kinship bonds, and\nsharply differentiated complementary behavior of\nmen and women. ((It strikes me only now that\nthis is mistaken by some readers for archaism.\nBut of course  it isn’t.  It’s\nfuturism.  Or just realism. No society\nwithout these values or something like them can\nsurvive more than a couple of\ngenerations.))  And I’d written of a\nsociety rich in technical and scientific\nknowledge, including as unremarked givens such\nfamiliar SF tropes as nanotechnology,\ncyborgisation, and Artificial\nIntelligence.   I had some fun\nintegrating these into Hodgson’s “scientific”\nformulation of reincarnation and psychic\npredation.\nI had done my best to reinterpret the Night Land as science fiction, and other writers\nhad followed me.   But  John’s\nstory followed his own dreams.\nHis character names were derived from classical\nGreek, not generic IndoEuropean sememes. The\nmanners of the society were likewise closely\nmodeled on the ancient pagans. Dozois has called\nthis an air of distanced antiquity, and it works\nwell, but I repeat it’s distinctly different\nfrom my own, which is not antique at all. His\nwas not a technically sophisticated society and\nseemed not to have a scientific attitude to the\nalien Land that surrounded it. It ran off rote\ntechnology and was ignorant of the workings of\nmuch of the machinery it depended on. It was\ndoomed and dwindling and dark and candle-lit, a\ntumbledown place with a hint of Ghormenghast to\nit. (I know John will hate that comparison, and\nI apologize). The story was one of childhood\nfriendship, rivalry, disaster and rescue. The\nwriting style was, incidentally, brilliant.\nI bought it and published it in our first\nhardcopy anthology, ENDLESS LOVE. It got into\nDozois’ BEST SF and several other yearly\nanthlogies and created a minor sensation. There\nare still places where the first taste of\nHodgson’s work a casual reader will get is the\ntranslation of “Awake in the Night” in that\nyear’s Dozois, and the story is an entry drug\nnot only for THE NIGHT LAND but for Hodgson\nhimself and all his work. This was a story which\nHodgson might have written if he had been a more\ngifted weaver of words. John remarked to me at\none point that he was surprised at the story’s\npopularity. I think we both understood that\ndespite its author’s talent, the real power\nresided in the way it had stayed faithful to\nHodgson’s own visions, without elaborating them\ntoo much. The whole world could now see and\nshare Hodgson’s original Night Land. They were\nseeing it through John’s eyes, not mine, but\nthat didn’t matter to me.   This was\nwhat I had set the NightLand website up for.\n*****\nI expected a whole series of tales from John\nset in his version of The Night Land, but his\nnext story was a radical departure from anything\nthat he or any of the rest of us had ever done.\nIt surpassed not only Hodgson’s talents but,\ndamn it, Lovecraft’s.\nWhen I read “Awake in the\nNight” I felt some envy, but when the ms for\n“The Last of All Suns” crossed my inbox I felt\nsomething like awe. It’s almost impossible to describe this\nstory without employing spoilers, because there\nis nothing else like it to compare it to or to\nhint that it is like.\nRead the whole thing\nat The Night Land\n.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-14T12:00:00+00:00"
}