{
  "url": "https://voxday.net/2014/04/23/a-vile-taste-in-her-mou/",
  "scraped_at": "2025-12-15T16:53:44.007671",
  "title": "A vile taste in her mouth",
  "date_display": "April 23, 2014",
  "date_iso": "2014-04-23T17:00:00+00:00",
  "date_from_url": "2014-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Oh my. Anyhow, I found the angst of a fellow Hugo nominee who professes to oppose “award campaigns” to be somewhat amusing:</p><blockquote class=\"tr_bq\"><p> Let me be clear: Vox Day is a despicable person whose repeated racist, sexist, and homophobic behavior towards specific members of the genre community as well as the community as a whole should make all decent human beings recoil from his presence.  That I received my first Hugo nomination on the same ballot that bears his name leaves a vile taste in my mouth.  That the rest of the fiction ballot feels, as several people have noted, as if it’s recapitulating the culture wars only makes this nomination worse, and confirms me in my feeling that the only people who benefit from award campaigns are those with large and devoted fanbases–whether those fanbases are motivated by love of a particular writer, or the desire to stick it to the lefties (or, as is most likely, both).<br> – Abigail Nussbaum, <a href=\"http://wrongquestions.blogspot.com.es/2014/04/the-2014-hugo-awards-thoughts-on.html\">April 20</a></br></p></blockquote><p>Or at least, she opposes them when she isn’t successfully running one of her own, or pimping out the “dozens” of others by various would-be nominees:</p><blockquote class=\"tr_bq\"><p> Even as the award eligibility phenomenon gains steam (and respectability), more and more people are also using the internet to create a more broadly informed voter base.  Dozens of people are posting their Hugo ballots and recommendations (to take a by no means exhaustive sample: Nina Allan, Thea and Ana at The Book Smugglers, Liz Bourke (1, 2, 3, 4), the bloggers of LadyBusiness, Justin Landon, Martin Lewis, Jonathan McCalmont (1, 2), Aidan Moher, Mari Ness, Ian Sales, Jared Shurin, Rachel Swirsky (1, 2, 3), Adam Whitehead).  Blogs like Hugo Award Eligible Art(ists) seek to inform people (like myself) who have little grounding in the category, and make them acquainted with worthwhile nominees.  Existing projects like Writertopia’s Campbell award eligibility page collate information that makes it easier to nominate for an award whose eligibility requirements can seem tricky even if you’re an old hand at this Hugo stuff.  If you’re someone who is interested in voting as more than a single author’s fan, it has never been easier to gain a broad appreciation of the field and its practitioners, even the ones who aren’t superstars.</p><p>I still don’t know whether award eligibility posts are part of the problem or simply a ineffective distraction.  I do think that the efforts I’ve been seeing in the last two months have a real chance of being part of the solution, and I mean to join in.  In the next few weeks, I’ll be posting my own Hugo ballot, a few categories at a time.  (I’ll also be posting links to works that I consider worthwhile on my twitter account.) <br> – Abigail Nussbaum, <a href=\"http://wrongquestions.blogspot.com.es/2014/03/the-2014-hugo-awards-thoughts-on-award.html\">March 6</a></br></p></blockquote><p>The ironic thing about the complaints that Larry and I somehow bought our nominations is that while my massive and energetic campaign consisted of <a href=\"http://www.milobookclub.com/2014/03/26/the-sad-puppy-hugo-slate/\">a single and straightforward post</a>, a blogger at Tor.com actively waged <a href=\"http://www.tor.com/blogs/2014/01/the-wheel-of-time-hugo-award-robert-jordan\">a successful cheerleading effort</a> on behalf of the Tor-published Wheel of Time series:</p><blockquote class=\"tr_bq\"><p> Therefore, O my Peeps, I exhort you: if you can and will, please<br> consider nominating the Wheel of Time series as a whole for the Hugo<br> Award for Best Novel, and spread the word so that others might do the<br> same…. So go! Join! Nominate! Vote! Participate! And maybe help make Hugo<br> history, eh? I can think of worse things to do with your time!</br></br></br></br></p></blockquote><p>Of course, the Dread Ilk know <a href=\"http://www.milobookclub.com/2013/04/06/liberals-giving-awards-to-each-other/\">my actual position</a> on liberals giving awards to each other:</p><blockquote class=\"tr_bq\"><p> Everyone has different goals. Rabbits need the group affirmation that<br> these sorts of political awards offer them. Not-rabbits don’t.<br> Psykosonik once beat out Prince for Best Dance Record at the Minnesota<br> Music Awards for a song I wrote; I didn’t know we’d won until months<br> later because not only did I not bother going to the ceremony, my bandmates who attended didn’t even see fit to mention that we won because they knew I didn’t care. I<br> didn’t even know I had been a three-time Billboard top 40 recording<br> artist for about 16 years until I looked it up a few months ago when I<br> was pointing out the dirty laundry of  the “New York Times bestselling”<br> authors.</br></br></br></br></br></br></br></br></p><p>When you are fortunate enough to experience success, you learn to value<br> certain aspects of it and to disvalue others.  My objective is to write a<br> great epic fantasy series that is capable of creating the same feeling<br> in its readers that <i>Dune </i>once created in me. That’s why I simply laugh<br> when people claim I’m jealous of McRapey, or I’m imitating George<br> Martin, or my feelings are wounded that <i>A Throne of Bones</i> wasn’t<br> nominated for any awards.*  Because in the game I’m playing, those things<br> don’t even enter into it. They’re not relevant to my metric for<br> success.</br></br></br></br></br></br></br></br></p></blockquote><p>That being said, I have thoroughly enjoyed being nominated for the Hugo this year and I sincerely hope that this is merely the first of many such nominations for me and other fine writers upon whom the rabbits gaze upon in terror. I am very much looking forward to attending WorldCon this year and spending lots of quality time with my fellow Hugo nominees there, such as Mr. Charles Stross, who writes: “As a matter of policy I do not talk down/diss Hugo nominees when I myself am on the shortlist. But I shall be waiting for Vox Day in the Hugo Losers Party wearing a<br> kilt and a shit-eating grin, with a bottle of 90-proof distilled<br> schadenfreude that’s got his name on it.”</br></br></p><p>I don’t know. Sounds a little rape-culturey to me. For a nice roundup of the rabbits striking various poses and feeling the heat, check out <a href=\"http://farbeyondreality.com/2014/04/19/2014-hugo-nominations-the-reactions/\">Far Beyond Reality</a>. And since it’s starting to get boring, I think that’s enough about the Hugo Awards for now until I’m able to read through the packet and decide for whom I’ll be voting.</p><p><i>*As it happens, the book was nominated for the 2013 Clive Staples Award. </i></p></div>",
  "content_text": "Oh my. Anyhow, I found the angst of a fellow Hugo nominee who professes to oppose “award campaigns” to be somewhat amusing:\nLet me be clear: Vox Day is a despicable person whose repeated racist, sexist, and homophobic behavior towards specific members of the genre community as well as the community as a whole should make all decent human beings recoil from his presence.  That I received my first Hugo nomination on the same ballot that bears his name leaves a vile taste in my mouth.  That the rest of the fiction ballot feels, as several people have noted, as if it’s recapitulating the culture wars only makes this nomination worse, and confirms me in my feeling that the only people who benefit from award campaigns are those with large and devoted fanbases–whether those fanbases are motivated by love of a particular writer, or the desire to stick it to the lefties (or, as is most likely, both).\n– Abigail Nussbaum,\nApril 20\nOr at least, she opposes them when she isn’t successfully running one of her own, or pimping out the “dozens” of others by various would-be nominees:\nEven as the award eligibility phenomenon gains steam (and respectability), more and more people are also using the internet to create a more broadly informed voter base.  Dozens of people are posting their Hugo ballots and recommendations (to take a by no means exhaustive sample: Nina Allan, Thea and Ana at The Book Smugglers, Liz Bourke (1, 2, 3, 4), the bloggers of LadyBusiness, Justin Landon, Martin Lewis, Jonathan McCalmont (1, 2), Aidan Moher, Mari Ness, Ian Sales, Jared Shurin, Rachel Swirsky (1, 2, 3), Adam Whitehead).  Blogs like Hugo Award Eligible Art(ists) seek to inform people (like myself) who have little grounding in the category, and make them acquainted with worthwhile nominees.  Existing projects like Writertopia’s Campbell award eligibility page collate information that makes it easier to nominate for an award whose eligibility requirements can seem tricky even if you’re an old hand at this Hugo stuff.  If you’re someone who is interested in voting as more than a single author’s fan, it has never been easier to gain a broad appreciation of the field and its practitioners, even the ones who aren’t superstars.\nI still don’t know whether award eligibility posts are part of the problem or simply a ineffective distraction.  I do think that the efforts I’ve been seeing in the last two months have a real chance of being part of the solution, and I mean to join in.  In the next few weeks, I’ll be posting my own Hugo ballot, a few categories at a time.  (I’ll also be posting links to works that I consider worthwhile on my twitter account.)\n– Abigail Nussbaum,\nMarch 6\nThe ironic thing about the complaints that Larry and I somehow bought our nominations is that while my massive and energetic campaign consisted of\na single and straightforward post\n, a blogger at Tor.com actively waged\na successful cheerleading effort\non behalf of the Tor-published Wheel of Time series:\nTherefore, O my Peeps, I exhort you: if you can and will, please\nconsider nominating the Wheel of Time series as a whole for the Hugo\nAward for Best Novel, and spread the word so that others might do the\nsame…. So go! Join! Nominate! Vote! Participate! And maybe help make Hugo\nhistory, eh? I can think of worse things to do with your time!\nOf course, the Dread Ilk know\nmy actual position\non liberals giving awards to each other:\nEveryone has different goals. Rabbits need the group affirmation that\nthese sorts of political awards offer them. Not-rabbits don’t.\nPsykosonik once beat out Prince for Best Dance Record at the Minnesota\nMusic Awards for a song I wrote; I didn’t know we’d won until months\nlater because not only did I not bother going to the ceremony, my bandmates who attended didn’t even see fit to mention that we won because they knew I didn’t care. I\ndidn’t even know I had been a three-time Billboard top 40 recording\nartist for about 16 years until I looked it up a few months ago when I\nwas pointing out the dirty laundry of  the “New York Times bestselling”\nauthors.\nWhen you are fortunate enough to experience success, you learn to value\ncertain aspects of it and to disvalue others.  My objective is to write a\ngreat epic fantasy series that is capable of creating the same feeling\nin its readers that\nDune\nonce created in me. That’s why I simply laugh\nwhen people claim I’m jealous of McRapey, or I’m imitating George\nMartin, or my feelings are wounded that\nA Throne of Bones\nwasn’t\nnominated for any awards.*  Because in the game I’m playing, those things\ndon’t even enter into it. They’re not relevant to my metric for\nsuccess.\nThat being said, I have thoroughly enjoyed being nominated for the Hugo this year and I sincerely hope that this is merely the first of many such nominations for me and other fine writers upon whom the rabbits gaze upon in terror. I am very much looking forward to attending WorldCon this year and spending lots of quality time with my fellow Hugo nominees there, such as Mr. Charles Stross, who writes: “As a matter of policy I do not talk down/diss Hugo nominees when I myself am on the shortlist. But I shall be waiting for Vox Day in the Hugo Losers Party wearing a\nkilt and a shit-eating grin, with a bottle of 90-proof distilled\nschadenfreude that’s got his name on it.”\nI don’t know. Sounds a little rape-culturey to me. For a nice roundup of the rabbits striking various poses and feeling the heat, check out\nFar Beyond Reality\n. And since it’s starting to get boring, I think that’s enough about the Hugo Awards for now until I’m able to read through the packet and decide for whom I’ll be voting.\n*As it happens, the book was nominated for the 2013 Clive Staples Award.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-23T16:00:00+00:00"
}