{
  "url": "https://voxday.net/2014/04/25/amateur-hour/",
  "scraped_at": "2025-12-16T12:12:21.827733",
  "title": "Amateur hour",
  "date_display": "April 25, 2014",
  "date_iso": "2014-04-25T09:26:00+00:00",
  "date_from_url": "2014-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I haven’t written much about the prospective war in Ukraine because it is mostly <a href=\"http://www.buzzfeed.com/maxseddon/ukraines-attempt-to-retake-the-east-fails-miserably\">a military farce</a>:</p><blockquote class=\"tr_bq\"><p> Standing on the hood of an armored personnel carrier as his ashen-faced<br> paratroopers slumped behind him, Col. Alexander Shvets of Ukraine’s<br> 25th Airborne reported back to command on a cheap cell phone.</br></br></p><p>“We’ve been taken captive. They used dirty tricks,” he said. The<br> hundreds of local residents and ragtag militiamen that had surrounded<br> his column of 13 APCs throughout Wednesday bayed. “Look,” he continued,<br> losing his patience. “I’ve been surrounded by a human shield of 500<br> people all day. You don’t know what you’re fucking talking about.”</br></br></br></br></p><p>As the sun set, Shvets and his men — many of whom were reservists<br> called up to help Ukraine regain control of the eastern province of<br> Donetsk from anti-government rebel groups — were allowed to drive back<br> to their base in neighboring Dnipropetrovsk. The day they spent here<br> outside the small town of Kramatorsk, hemmed in by angry residents, was<br> emblematic of the Ukrainian central government’s withering attempt to<br> assert control in the East, now in tatters….</br></br></br></br></br></br></p><div class=\"sub_buzz_desc\"> Ukraine’s “anti-terrorist operation” against<br> anti-government rebels has proved a spectacular debacle. Soldiers<br> refused to move in on rebel-held positions. The rebels captured six<br> APCs, drove the soldiers into Slovyansk flying the Russian flag, and<br> sent them back on dingy buses, dejected, disarmed, and defeated.<br> Self-appointed “self-defense” commanders who couldn’t even agree on<br> which one of them was in charge disarmed and defeated Ukraine’s army.</br></br></br></br></br></br></div></blockquote><p>This government ineptitude is a common theme of late. An elderly rancher forced hundreds of federal agents into retreat. A few hundred civilians captured multiple armored personal carriers. The USA has been pursuing an obviously futile occupation in Afghanistan for 13 years now to little purpose and no avail. Mexico is a failed state where cartels rule entire regions.</p><p>The central governments are exhausted and bankrupt. They’re turning up the tax and regulatory heat around the world even as their corruption becomes ever more apparent. Meanwhile, they are afraid to utilize their heavily militarized agencies because they fear the inevitable backlash that will threaten to destabilize their pretenses to legitimacy. The people over which they nominally rule are fat, decadent, weak, and fearful.</p><p>Fraud and empty gestures are the order of the day. A battalion of troops have been sent to Poland, of all places? A whole battalion to intimidate the Russians, who sent both Napoleon and Hitler running? This would be comical if it wasn’t an obvious harbinger of much more difficult times to come.</p></div>",
  "content_text": "I haven’t written much about the prospective war in Ukraine because it is mostly\na military farce\n:\nStanding on the hood of an armored personnel carrier as his ashen-faced\nparatroopers slumped behind him, Col. Alexander Shvets of Ukraine’s\n25th Airborne reported back to command on a cheap cell phone.\n“We’ve been taken captive. They used dirty tricks,” he said. The\nhundreds of local residents and ragtag militiamen that had surrounded\nhis column of 13 APCs throughout Wednesday bayed. “Look,” he continued,\nlosing his patience. “I’ve been surrounded by a human shield of 500\npeople all day. You don’t know what you’re fucking talking about.”\nAs the sun set, Shvets and his men — many of whom were reservists\ncalled up to help Ukraine regain control of the eastern province of\nDonetsk from anti-government rebel groups — were allowed to drive back\nto their base in neighboring Dnipropetrovsk. The day they spent here\noutside the small town of Kramatorsk, hemmed in by angry residents, was\nemblematic of the Ukrainian central government’s withering attempt to\nassert control in the East, now in tatters….\nUkraine’s “anti-terrorist operation” against\nanti-government rebels has proved a spectacular debacle. Soldiers\nrefused to move in on rebel-held positions. The rebels captured six\nAPCs, drove the soldiers into Slovyansk flying the Russian flag, and\nsent them back on dingy buses, dejected, disarmed, and defeated.\nSelf-appointed “self-defense” commanders who couldn’t even agree on\nwhich one of them was in charge disarmed and defeated Ukraine’s army.\nThis government ineptitude is a common theme of late. An elderly rancher forced hundreds of federal agents into retreat. A few hundred civilians captured multiple armored personal carriers. The USA has been pursuing an obviously futile occupation in Afghanistan for 13 years now to little purpose and no avail. Mexico is a failed state where cartels rule entire regions.\nThe central governments are exhausted and bankrupt. They’re turning up the tax and regulatory heat around the world even as their corruption becomes ever more apparent. Meanwhile, they are afraid to utilize their heavily militarized agencies because they fear the inevitable backlash that will threaten to destabilize their pretenses to legitimacy. The people over which they nominally rule are fat, decadent, weak, and fearful.\nFraud and empty gestures are the order of the day. A battalion of troops have been sent to Poland, of all places? A whole battalion to intimidate the Russians, who sent both Napoleon and Hitler running? This would be comical if it wasn’t an obvious harbinger of much more difficult times to come.",
  "tags": [
    "decline and fall",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-25T08:26:00+00:00"
}