{
  "url": "https://voxday.net/2014/04/16/an-appeal-to-reinstall-firefox/",
  "scraped_at": "2025-12-15T16:52:56.233236",
  "title": "An appeal to reinstall Firefox",
  "date_display": "April 16, 2014",
  "date_iso": "2014-04-16T13:00:00+00:00",
  "date_from_url": "2014-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was asked <a href=\"http://www.reinstallfirefox.com/\">to reconsider my position</a> on uninstalling Mozilla products and refusing to use them in the future:</p><blockquote class=\"tr_bq\"><p> You are probably here because you have been advised to consider reinstalling Firefox. You may, in fact, have uninstalled Firefox as a result of a recent campaign protesting either Brendan Eich’s being appointed CEO of Mozilla, or his supposedly being fired or forced by Mozilla to resign from that position as a result of a donation he made in favor of proposition 8. Brendan Eich did, in fact, resign; however, he did was not fired or forced to resign by Mozilla. Mozilla does not discriminate based on an individual’s personal political or religious beliefs. If you have been told otherwise, I encourage you to evaluate the evidence for yourself. First of all, I would like to point you to Mozilla’s official FAQ on Brendan’s resignation. I realize that some people will insist that this is just a cover story and that he was really forced to resign, in spite of whatever Mozilla may say to the contrary. So I would like to share some additional corroborating evidence. There are many inside sources who corroborate this, but the one I find particularly credible and compelling is Gervase Markham. He is in a unique position as an outspoken Christian and supporter of traditional marriage who works at Mozilla. Gerv has stated that he has it from sources he trusts that Brendan did step down of his own accord and was not forced out. You can <a href=\"http://www.jamesjheaney.com/2014/04/08/re-your-ire-is-misdirected/\">read his full statement</a> on his blog. Finally, I want to remind you of what Mozilla, and Firefox, truly stands for.</p><p>If you are still not convinced, I’d like you to consider one more thing. Consider for a moment, the possibility that Brendan really did step down of his own accord and is not interested in coming back. What more can Mozilla possibly do that would persuade you? Is there any further evidence that would change your mind? It makes sense to treat them with a good faith presumption of truthfulness unless and until there is evidence to the contrary. Why? Because if your mind can not be changed by anything, then they may as well ignore you anyway. There are always people who cannot be swayed by reason or any amount of evidence. Since their minds can’t be changed anyway, we all might as well ignore them and focus on those who can be persuaded by reason. If you are not open to any reasonable evidence, then you make yourself irrelevant to the debate. Don’t be do that. Evaluate the evidence fairly, and when in doubt, treat others with a good faith presumption of truthfulness. Then if evidence persuades you to change your position, it will mean something.</p></blockquote><p>I read this. I read Markham’s piece. I have evaluated the evidence and I am fully informed concerning the relevant facts. And my answer is a staunch and resounding no. I reject Mozilla. I reject what it now stands for.</p><p>I am aware Eich stepped down of his own accord. I am aware he was not fired, that his resignation was not demanded by the Mozilla Board, and that fewer than 10 Mozilla employees publicly demanded his resignation.</p><p>I am also aware that Mozilla’s executive chairwoman Mitchell Baker issued <a href=\"https://blog.mozilla.org/blog/2014/04/03/brendan-eich-steps-down-as-mozilla-ceo/\">this official statement</a> on April 3rd: “Mozilla prides itself on being held to a different standard and, this past week, we didn’t live up to it. We know why people are hurt and angry, and they are right: it’s because we haven’t stayed true to ourselves. We didn’t act like you’d expect Mozilla to act. We didn’t move fast<br> enough to engage with people once the controversy started. We’re sorry.<br> We must do better.”</br></br></p><p>For what is she apologizing, precisely? To whom is she apologizing?</p><p>I am aware that Mozilla claims to “support equality for all.” This is a blatant lie on multiple levels. Mozilla might as reasonably proclaim that it supports unicorns for all or a chicken in every pot. Mozilla clearly does not support the Constitutional right of free association or the right of free speech on the part of those harboring views it considers incompatible with its mission statement.</p><p>I am aware that “Mozilla Supports LGBT Equality”. I don’t and I will not support any organization that claims to do so.</p><p>I am aware that Mozilla has ignored tens of thousands of negative comments from current and former Firefox users and has refused to provide any statement in response to them. I am also aware that it responded quickly and publicly to a much smaller amount of criticism that threatened much less damage to the corporation.</p><p>A supporter of the move to ostracize and oust Brandon Eich declared: “I do think that any individual is free to choose to resign their own job<br> or otherwise not conduct business with someone whom they know has taken<br> an action that they consider unjust.” I agree. That is precisely why I no longer want anything to do with Mozilla and I continue to recommend that everyone #uninstallfirefox.</br></br></p><p>Prior to the #uninstallfirefox campaign began, Mozilla Firefox represented 34 percent of the total pageviews here. That percentage is currently down to 20 percent, so based on last year’s traffic, Mozilla can expect to lose at least 1,835,637 pageviews from the readers here on this site alone, in addition to the pageviews those readers generate on all other sites and whatever pageviews my household machines generate on an annual basis.</p></div>",
  "content_text": "I was asked\nto reconsider my position\non uninstalling Mozilla products and refusing to use them in the future:\nYou are probably here because you have been advised to consider reinstalling Firefox. You may, in fact, have uninstalled Firefox as a result of a recent campaign protesting either Brendan Eich’s being appointed CEO of Mozilla, or his supposedly being fired or forced by Mozilla to resign from that position as a result of a donation he made in favor of proposition 8. Brendan Eich did, in fact, resign; however, he did was not fired or forced to resign by Mozilla. Mozilla does not discriminate based on an individual’s personal political or religious beliefs. If you have been told otherwise, I encourage you to evaluate the evidence for yourself. First of all, I would like to point you to Mozilla’s official FAQ on Brendan’s resignation. I realize that some people will insist that this is just a cover story and that he was really forced to resign, in spite of whatever Mozilla may say to the contrary. So I would like to share some additional corroborating evidence. There are many inside sources who corroborate this, but the one I find particularly credible and compelling is Gervase Markham. He is in a unique position as an outspoken Christian and supporter of traditional marriage who works at Mozilla. Gerv has stated that he has it from sources he trusts that Brendan did step down of his own accord and was not forced out. You can\nread his full statement\non his blog. Finally, I want to remind you of what Mozilla, and Firefox, truly stands for.\nIf you are still not convinced, I’d like you to consider one more thing. Consider for a moment, the possibility that Brendan really did step down of his own accord and is not interested in coming back. What more can Mozilla possibly do that would persuade you? Is there any further evidence that would change your mind? It makes sense to treat them with a good faith presumption of truthfulness unless and until there is evidence to the contrary. Why? Because if your mind can not be changed by anything, then they may as well ignore you anyway. There are always people who cannot be swayed by reason or any amount of evidence. Since their minds can’t be changed anyway, we all might as well ignore them and focus on those who can be persuaded by reason. If you are not open to any reasonable evidence, then you make yourself irrelevant to the debate. Don’t be do that. Evaluate the evidence fairly, and when in doubt, treat others with a good faith presumption of truthfulness. Then if evidence persuades you to change your position, it will mean something.\nI read this. I read Markham’s piece. I have evaluated the evidence and I am fully informed concerning the relevant facts. And my answer is a staunch and resounding no. I reject Mozilla. I reject what it now stands for.\nI am aware Eich stepped down of his own accord. I am aware he was not fired, that his resignation was not demanded by the Mozilla Board, and that fewer than 10 Mozilla employees publicly demanded his resignation.\nI am also aware that Mozilla’s executive chairwoman Mitchell Baker issued\nthis official statement\non April 3rd: “Mozilla prides itself on being held to a different standard and, this past week, we didn’t live up to it. We know why people are hurt and angry, and they are right: it’s because we haven’t stayed true to ourselves. We didn’t act like you’d expect Mozilla to act. We didn’t move fast\nenough to engage with people once the controversy started. We’re sorry.\nWe must do better.”\nFor what is she apologizing, precisely? To whom is she apologizing?\nI am aware that Mozilla claims to “support equality for all.” This is a blatant lie on multiple levels. Mozilla might as reasonably proclaim that it supports unicorns for all or a chicken in every pot. Mozilla clearly does not support the Constitutional right of free association or the right of free speech on the part of those harboring views it considers incompatible with its mission statement.\nI am aware that “Mozilla Supports LGBT Equality”. I don’t and I will not support any organization that claims to do so.\nI am aware that Mozilla has ignored tens of thousands of negative comments from current and former Firefox users and has refused to provide any statement in response to them. I am also aware that it responded quickly and publicly to a much smaller amount of criticism that threatened much less damage to the corporation.\nA supporter of the move to ostracize and oust Brandon Eich declared: “I do think that any individual is free to choose to resign their own job\nor otherwise not conduct business with someone whom they know has taken\nan action that they consider unjust.” I agree. That is precisely why I no longer want anything to do with Mozilla and I continue to recommend that everyone #uninstallfirefox.\nPrior to the #uninstallfirefox campaign began, Mozilla Firefox represented 34 percent of the total pageviews here. That percentage is currently down to 20 percent, so based on last year’s traffic, Mozilla can expect to lose at least 1,835,637 pageviews from the readers here on this site alone, in addition to the pageviews those readers generate on all other sites and whatever pageviews my household machines generate on an annual basis.",
  "tags": [
    "politics",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-16T12:00:00+00:00"
}