{
  "url": "https://voxday.net/2014/04/12/another-hhit-piece/",
  "scraped_at": "2025-12-15T16:52:30.664591",
  "title": "Another hit piece",
  "date_display": "April 12, 2014",
  "date_iso": "2014-04-12T10:25:00+00:00",
  "date_from_url": "2014-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you wonder about the tangible reality of the Blue SF/F- Pink SF/F divide, observe that Damien Walter has penned another hit piece in The Guardian aimed at a right-wing SF author, this time Larry Corriea, entitled “<a href=\"http://www.theguardian.com/books/2014/apr/11/science-fiction-needs-to-reflect-queer-fluid-gender-identity\">Science fiction needs to reflect that the future is queer</a>“.</p><p>Does it now? That is an odd title, especially considering that a queer future is no future at all, given what we know about biology and human reproduction. But let us permit Mr. Walter speak his piece:</p><blockquote class=\"tr_bq\"><p> I spent most of my youth being told to get a haircut. As a boy of slight build who usually had hair down around my shoulders, I looked a bit too much like a girl for the comfort of the home counties. Society gets angry when gender roles are blurred, precisely because those roles are a fragile act put on with clothes, hairstyles and makeup. If they weren’t enforced, clearly defined gender roles would not exist.</p><p>I take comfort in the idea that most of the young men telling others to get a haircut today are rushing home to play at being buxom dark elf warrior maidens in World of Warcraft. Gamer culture has gained a bad reputation for misogyny, but it seems male gamers are more than a little curious about playing out female gender roles. It makes perfect sense. The real world enforces gender roles, but virtual worlds let gamers express the feminine parts of themselves that don’t fit in with their masculine identity.</p></blockquote><p>Solipsism alert! Translation: Effeminate little boy is treated as if he’s a freak and a queer because he looks like a girl. Spends the rest of his life attempting to get back at society because he can’t figure out how to get a haircut and act like the other boys. And apparently he knows so little about online games that he doesn’t realize most male gamers play female characters because: a) if they’re going to spend hours looking at their character’s ass, they would prefer it to be an attractive female one, and, b) people give female characters lots of free stuff.</p><p>As proof of the fact that Walter simply doesn’t know what he is talking about, I note that while there are High Elves, Night Elves, and Blood Elves in <i>World of Warcraft</i>, there are no dark elves. Nor are any of the elves “buxom”.</p><blockquote class=\"tr_bq\"><p> The kind of virtual worlds that video games allow us to enter have been commonplace in science fiction for decades. But the way that the virtual inevitably blurs the representation of sex and gender is never explicitly dealt with. Science fiction is torn between its higher mission to explore the future, and its lower function as mass entertainment. Deep Space Nine may be the gayest Star Trek, but in common with most of sci-fi’s major franchises, it still keeps homosexuality and queerness of all kinds off screen.</p><p>Science fiction novels have gone much further in exploring queer futures. From the 1960s onwards New Wave authors like Joanna Russ, Samuel Delany, Ursula Le Guin and Thomas Disch began to push forward the representation of LGBT themes in science fiction. Russ’s 1975 novel The Female Man used the tool of alternative universes to explore how gender roles are socially constructed. As liberal democracies like Britain welcome their first gay marriages, queer visions of the future look prescient. But despite the success of these authors, SF still clings to an unrealistically straight vision of the future.</p></blockquote><p>First, SF is rife with a broad variety of sexual freaks, fairies, and flamers. If one troubles to count up the number of sexually abnormal characters in SF, there are almost surely more than the two percent that they represent in the real world. Second, Walter’s article is parochial in the extreme. As countries from southern Africa to northern Eurasia criminalize homosexuality, it defies belief to claim that the sexual libertinism that has belatedly infested the demographically dying West is likely to represent the future, much less is <i>certain </i>to do so.</p><blockquote class=\"tr_bq\"><p> When author and historian Alex Dally Macfarlane made a call earlier this year for a vision of <a href=\"http://www.tor.com/blogs/2014/01/post-binary-gender-in-sf-introduction\" title=\"\">post-binary gender in SF</a>,<br> her intelligent argument was met with predictably intractable ignorance<br> from conservative sci-fi fans. For writers and fans like Larry Correia,<br> whose virulent attack on MacFarlane was <a href=\"http://www.jimchines.com/2014/01/fiskception\" title=\"\">excellently dissected by Jim C Hines</a>,<br> sex is a biological imperative and the idea of gender as a social<br> construct is a damn liberal lie! But Correia boils it down to a much<br> simpler argument. However accurate a queer future might be, SF authors<br> must continue to pander to the bigotry of conservative readers if they<br> want to be “commercial”.</br></br></br></br></br></br></br></br></p></blockquote><p>It is readily apparent that Walter is not only a dishonest propagandist, but he is an inept SF author as well. He clearly violates the “Show, Don’t Tell” rule here, as he first claims that Macfarlane’s piece was intelligent – read it, it wasn’t – then claims that it was met with “ignorance” while refusing to provide any actual examples of said “ignorance”. Notice that while he describes <a href=\"http://larrycorreia.wordpress.com/2014/01/28/ending-binary-gender-in-fiction-or-how-to-murder-your-writing-career/\">Larry’s critique</a> as a “virulent attack”, he fails to link to it, instead linking to what he inaccurately describes as McCreepy’s excellent dissection – read it, it wasn’t.</p><blockquote class=\"tr_bq\"><p> Which is of course nonsense. The science fiction novels of Iain M<br> Banks were bestsellers many times over, in part because the future they<br> explored was openly queer. Citizens of Banks’ future society the Culture<br> have the ability to change their sex at will, and frequently shift<br> between sexes and gender roles. Kim Stanley Robinson’s 2312 became both a<br> bestseller and multiple award winner with a vision of the future that<br> included fluid non-binary gender. And Nicola Griffith’s historical epic<br> Hild, nominated for this year’s Nebula awards by members of the SFWA, is<br> built around a bisexual protagonist.</br></br></br></br></br></br></br></br></p><p>The best science<br> fiction literature explores a future of fluid gender identity that is<br> much closer than many imagine. Genetic researchers have already<br> discovered <a href=\"http://blogs.discovermagazine.com/notrocketscience/2011/07/20/one-gene-keeps-mickey-from-turning-into-minnie/\" title=\"\">the two genes that battle to determine the sex of every human</a>,<br> opening the possibility of biological sex change in adult humans at the<br> genetic level. Combine these scientific advances with the changing<br> structure of our society and the gender shifts of virtual worlds and,<br> far from being the lifestyle of a minority, queerness looks very much<br> like the mainstream culture of the future. If science fiction has a role<br> at all, it’s to reflect that reality, not deny it.</br></br></br></br></br></br></br></br></br></p></blockquote><p>First, the novels of Iain M Banks were not bestsellers because the futures they explored were infested with homosexuality. Indeed, sexuality in the Culture was largely irrelevant in light of the irrelevancy of biology, the human body, and indeed, the human mind. Banks’s future was primarily “queer” in that the AI-controlled Culture was sterile and, like Star Trek, required interactions with societies outside the Culture to provide any drama.</p><p>Nicola Griffith’s Hild tends to prove what Larry was saying: despite the benefit of its Nebula nomination and the Guardian coverage, it is presently ranked 42,234 on Amazon. Hardly evidence that “queerness looks very much<br> like the mainstream culture of the future”.</br></p><p>But his various moral and intellectual failings notwithstanding, the most offensive thing that Walter does in this article is question if science fiction has a role at all. It does have a role, an important role, but Walter, being one of the morally vacuous Autumn People described so vividly by Ray Bradbury, will never understand what it is. And the idea that science fiction’s only possible role is to reflect reality is downright laughable; if that were the case, so much for these common SF tropes: faster-than-light travel, alien life, secular societies, peaceful race relations, benign world government, and, of course, legal homosexuality.</p><p>So you see, we’re not the ones drawing the battle line. Though I am, as it happens, quite content to see Pink SF/F go headlong in this direction. Because if it does, it won’t be in the mainstream for long. And we’ll be more than happy to pick up the shattered pieces of what was once their market.</p></div>",
  "content_text": "Lest you wonder about the tangible reality of the Blue SF/F- Pink SF/F divide, observe that Damien Walter has penned another hit piece in The Guardian aimed at a right-wing SF author, this time Larry Corriea, entitled “\nScience fiction needs to reflect that the future is queer\n“.\nDoes it now? That is an odd title, especially considering that a queer future is no future at all, given what we know about biology and human reproduction. But let us permit Mr. Walter speak his piece:\nI spent most of my youth being told to get a haircut. As a boy of slight build who usually had hair down around my shoulders, I looked a bit too much like a girl for the comfort of the home counties. Society gets angry when gender roles are blurred, precisely because those roles are a fragile act put on with clothes, hairstyles and makeup. If they weren’t enforced, clearly defined gender roles would not exist.\nI take comfort in the idea that most of the young men telling others to get a haircut today are rushing home to play at being buxom dark elf warrior maidens in World of Warcraft. Gamer culture has gained a bad reputation for misogyny, but it seems male gamers are more than a little curious about playing out female gender roles. It makes perfect sense. The real world enforces gender roles, but virtual worlds let gamers express the feminine parts of themselves that don’t fit in with their masculine identity.\nSolipsism alert! Translation: Effeminate little boy is treated as if he’s a freak and a queer because he looks like a girl. Spends the rest of his life attempting to get back at society because he can’t figure out how to get a haircut and act like the other boys. And apparently he knows so little about online games that he doesn’t realize most male gamers play female characters because: a) if they’re going to spend hours looking at their character’s ass, they would prefer it to be an attractive female one, and, b) people give female characters lots of free stuff.\nAs proof of the fact that Walter simply doesn’t know what he is talking about, I note that while there are High Elves, Night Elves, and Blood Elves in\nWorld of Warcraft\n, there are no dark elves. Nor are any of the elves “buxom”.\nThe kind of virtual worlds that video games allow us to enter have been commonplace in science fiction for decades. But the way that the virtual inevitably blurs the representation of sex and gender is never explicitly dealt with. Science fiction is torn between its higher mission to explore the future, and its lower function as mass entertainment. Deep Space Nine may be the gayest Star Trek, but in common with most of sci-fi’s major franchises, it still keeps homosexuality and queerness of all kinds off screen.\nScience fiction novels have gone much further in exploring queer futures. From the 1960s onwards New Wave authors like Joanna Russ, Samuel Delany, Ursula Le Guin and Thomas Disch began to push forward the representation of LGBT themes in science fiction. Russ’s 1975 novel The Female Man used the tool of alternative universes to explore how gender roles are socially constructed. As liberal democracies like Britain welcome their first gay marriages, queer visions of the future look prescient. But despite the success of these authors, SF still clings to an unrealistically straight vision of the future.\nFirst, SF is rife with a broad variety of sexual freaks, fairies, and flamers. If one troubles to count up the number of sexually abnormal characters in SF, there are almost surely more than the two percent that they represent in the real world. Second, Walter’s article is parochial in the extreme. As countries from southern Africa to northern Eurasia criminalize homosexuality, it defies belief to claim that the sexual libertinism that has belatedly infested the demographically dying West is likely to represent the future, much less is\ncertain\nto do so.\nWhen author and historian Alex Dally Macfarlane made a call earlier this year for a vision of\npost-binary gender in SF\n,\nher intelligent argument was met with predictably intractable ignorance\nfrom conservative sci-fi fans. For writers and fans like Larry Correia,\nwhose virulent attack on MacFarlane was\nexcellently dissected by Jim C Hines\n,\nsex is a biological imperative and the idea of gender as a social\nconstruct is a damn liberal lie! But Correia boils it down to a much\nsimpler argument. However accurate a queer future might be, SF authors\nmust continue to pander to the bigotry of conservative readers if they\nwant to be “commercial”.\nIt is readily apparent that Walter is not only a dishonest propagandist, but he is an inept SF author as well. He clearly violates the “Show, Don’t Tell” rule here, as he first claims that Macfarlane’s piece was intelligent – read it, it wasn’t – then claims that it was met with “ignorance” while refusing to provide any actual examples of said “ignorance”. Notice that while he describes\nLarry’s critique\nas a “virulent attack”, he fails to link to it, instead linking to what he inaccurately describes as McCreepy’s excellent dissection – read it, it wasn’t.\nWhich is of course nonsense. The science fiction novels of Iain M\nBanks were bestsellers many times over, in part because the future they\nexplored was openly queer. Citizens of Banks’ future society the Culture\nhave the ability to change their sex at will, and frequently shift\nbetween sexes and gender roles. Kim Stanley Robinson’s 2312 became both a\nbestseller and multiple award winner with a vision of the future that\nincluded fluid non-binary gender. And Nicola Griffith’s historical epic\nHild, nominated for this year’s Nebula awards by members of the SFWA, is\nbuilt around a bisexual protagonist.\nThe best science\nfiction literature explores a future of fluid gender identity that is\nmuch closer than many imagine. Genetic researchers have already\ndiscovered\nthe two genes that battle to determine the sex of every human\n,\nopening the possibility of biological sex change in adult humans at the\ngenetic level. Combine these scientific advances with the changing\nstructure of our society and the gender shifts of virtual worlds and,\nfar from being the lifestyle of a minority, queerness looks very much\nlike the mainstream culture of the future. If science fiction has a role\nat all, it’s to reflect that reality, not deny it.\nFirst, the novels of Iain M Banks were not bestsellers because the futures they explored were infested with homosexuality. Indeed, sexuality in the Culture was largely irrelevant in light of the irrelevancy of biology, the human body, and indeed, the human mind. Banks’s future was primarily “queer” in that the AI-controlled Culture was sterile and, like Star Trek, required interactions with societies outside the Culture to provide any drama.\nNicola Griffith’s Hild tends to prove what Larry was saying: despite the benefit of its Nebula nomination and the Guardian coverage, it is presently ranked 42,234 on Amazon. Hardly evidence that “queerness looks very much\nlike the mainstream culture of the future”.\nBut his various moral and intellectual failings notwithstanding, the most offensive thing that Walter does in this article is question if science fiction has a role at all. It does have a role, an important role, but Walter, being one of the morally vacuous Autumn People described so vividly by Ray Bradbury, will never understand what it is. And the idea that science fiction’s only possible role is to reflect reality is downright laughable; if that were the case, so much for these common SF tropes: faster-than-light travel, alien life, secular societies, peaceful race relations, benign world government, and, of course, legal homosexuality.\nSo you see, we’re not the ones drawing the battle line. Though I am, as it happens, quite content to see Pink SF/F go headlong in this direction. Because if it does, it won’t be in the mainstream for long. And we’ll be more than happy to pick up the shattered pieces of what was once their market.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-12T09:25:00+00:00"
}