{
  "url": "https://voxday.net/2014/04/14/awake-in-night-land/",
  "scraped_at": "2025-12-15T16:52:41.599300",
  "title": "AWAKE IN THE NIGHT LAND",
  "date_display": "April 14, 2014",
  "date_iso": "2014-04-14T06:00:00+00:00",
  "date_from_url": "2014-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/dp/B00JM98V60\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/awake_350.png\" width=\"200\"/></a></div><p>As you can imagine, we are proud, pleased, delighted, and deeply honored to announce Castalia House’s publication of <b><i><a href=\"http://www.amazon.com/dp/B00JM98V60\">AWAKE IN THE NIGHT LAND</a></i></b> by John C. Wright. It is, quite simply, one of the best books I have ever had the privilege of reading. If you peruse the Reading Lists on the right sidebar, you can see that I have read a considerable number of SF/F works considered to be of high quality in the last five years alone. So, you can be confident that I know whereof I speak, and I am not exaggerating in the slightest, when I tell you that <b><i><a href=\"http://www.amazon.com/dp/B00JM98V60\">AWAKE IN THE NIGHT LAND</a></i></b> will be one of the best books you read this year if you have the courage to enter one of the most daunting realms in literature.</p><p>It is not an easy book to categorize. Part anthology, part novel, <b><i><a href=\"http://www.amazon.com/dp/B00JM98V60\">AWAKE IN THE NIGHT LAND</a></i></b> consists of four novellas that are tied together in one vast story spanning five million years. It is a masterful combination of three literary subgenres, SF, Fantasy, and Horror. It is set in the world first created in an obscure novel published in 1912 and yet it is far more original than the vast majority of SF/F published in the last fifty years. It is remorselessly grim story set in a more inhumanly horrific environment than anything you are likely to imagine, and yet it is an uplifting tribute to the unquenchable human spirit.</p><p>It is monstrous and glorious and ghastly and magnificent.</p><p>Consider the reactions of the early reviewers:</p><ul><li>“The Last of All Suns” may be the best SF novella I have ever read.  I am not kidding.</li><li>Every now and then someone comes along who not only can say things<br> nicely, but can say _important_ things nicely.  That somebody, in the<br> modern age, is John C. Wright. </br></br></li><li>He projects an atmosphere of hope amid the vast emptiness of a dead world.</li><li>Set millions of years in the future the story and<br> setting can really only be compared to the worst nightmares of<br> Lovecraft. I cannot stress enough, read this book! If you like<br> Lovecraft, the darkest visions of Stephen King, or the visions of H.R.<br> Giger you will love this book. If you like science fiction especially<br> the ‘Dying Earth’ genre of Jack Vance, Leigh Brackett, Michael Moorcock,<br> you will love this book. If you’ve never heard of those authors or those books, read this book.</br></br></br></br></br></br></li></ul><p>I have written a number of books. Never once have I said to you, my readers, “you must read this book”. That is because I have never written a book like this one. There are a very small number of books of which I would say “you must read this book”: <i>The Lord of the Rings</i> by JRR Tolkien. <i>The Glass Bead Game</i> by Hermann Hesse. <i>The Name of the Rose</i> by Umberto Eco. <i>The Lion, the Witch, and the Wardrobe</i> by CS Lewis. <i>The Dark is Rising</i> by Susan Cooper. <i>Dandelion Wine</i> by Ray Bradbury. <i>Watership Down</i> by Richard Adams.</p><p>There were also others that came close, books that I enjoyed very much indeed, but did not quite justify the assertion. <i>Embassytown </i>by China Mieville. <i>Cryptonomicon </i>and <i>Anathem </i>by Neal Stephenson. <i>A Game of Thrones</i> by George Martin. <i>Night Watch </i>by Terry Pratchett. <i>Dune </i>by Frank Herbert.</p><p>I will tell you now that if you appreciate excellent books, then you must read this one. I cannot imagine you will regret it.</p><p>As a child, I was much struck by the quote of the reviewer for <i>The Times</i> in his review of<i> Watership Down</i>:<i> </i>“I announce with trembling pleasure the appearance of a great story.” But I am not so much trembling with pleasure as shaking my head in awe as I announce the appearance of a story that may sit on the shelves in the mighty company of the aforementioned books without feeling shame.</p><p>In addition to the Amazon links provided above, <b><i>Awake in the Night Land</i></b> is also <a href=\"https://www.smashwords.com/books/view/428089\">available in epub format</a> at Smashwords.</p></div>",
  "content_text": "As you can imagine, we are proud, pleased, delighted, and deeply honored to announce Castalia House’s publication of\nAWAKE IN THE NIGHT LAND\nby John C. Wright. It is, quite simply, one of the best books I have ever had the privilege of reading. If you peruse the Reading Lists on the right sidebar, you can see that I have read a considerable number of SF/F works considered to be of high quality in the last five years alone. So, you can be confident that I know whereof I speak, and I am not exaggerating in the slightest, when I tell you that\nAWAKE IN THE NIGHT LAND\nwill be one of the best books you read this year if you have the courage to enter one of the most daunting realms in literature.\nIt is not an easy book to categorize. Part anthology, part novel,\nAWAKE IN THE NIGHT LAND\nconsists of four novellas that are tied together in one vast story spanning five million years. It is a masterful combination of three literary subgenres, SF, Fantasy, and Horror. It is set in the world first created in an obscure novel published in 1912 and yet it is far more original than the vast majority of SF/F published in the last fifty years. It is remorselessly grim story set in a more inhumanly horrific environment than anything you are likely to imagine, and yet it is an uplifting tribute to the unquenchable human spirit.\nIt is monstrous and glorious and ghastly and magnificent.\nConsider the reactions of the early reviewers:\n“The Last of All Suns” may be the best SF novella I have ever read.  I am not kidding.\nEvery now and then someone comes along who not only can say things\nnicely, but can say _important_ things nicely.  That somebody, in the\nmodern age, is John C. Wright.\nHe projects an atmosphere of hope amid the vast emptiness of a dead world.\nSet millions of years in the future the story and\nsetting can really only be compared to the worst nightmares of\nLovecraft. I cannot stress enough, read this book! If you like\nLovecraft, the darkest visions of Stephen King, or the visions of H.R.\nGiger you will love this book. If you like science fiction especially\nthe ‘Dying Earth’ genre of Jack Vance, Leigh Brackett, Michael Moorcock,\nyou will love this book. If you’ve never heard of those authors or those books, read this book.\nI have written a number of books. Never once have I said to you, my readers, “you must read this book”. That is because I have never written a book like this one. There are a very small number of books of which I would say “you must read this book”:\nThe Lord of the Rings\nby JRR Tolkien.\nThe Glass Bead Game\nby Hermann Hesse.\nThe Name of the Rose\nby Umberto Eco.\nThe Lion, the Witch, and the Wardrobe\nby CS Lewis.\nThe Dark is Rising\nby Susan Cooper.\nDandelion Wine\nby Ray Bradbury.\nWatership Down\nby Richard Adams.\nThere were also others that came close, books that I enjoyed very much indeed, but did not quite justify the assertion.\nEmbassytown\nby China Mieville.\nCryptonomicon\nand\nAnathem\nby Neal Stephenson.\nA Game of Thrones\nby George Martin.\nNight Watch\nby Terry Pratchett.\nDune\nby Frank Herbert.\nI will tell you now that if you appreciate excellent books, then you must read this one. I cannot imagine you will regret it.\nAs a child, I was much struck by the quote of the reviewer for\nThe Times\nin his review of\nWatership Down\n:\n“I announce with trembling pleasure the appearance of a great story.” But I am not so much trembling with pleasure as shaking my head in awe as I announce the appearance of a story that may sit on the shelves in the mighty company of the aforementioned books without feeling shame.\nIn addition to the Amazon links provided above,\nAwake in the Night Land\nis also\navailable in epub format\nat Smashwords.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-14T05:00:00+00:00"
}