{
  "url": "https://voxday.net/2014/04/24/castalia-house-store/",
  "scraped_at": "2025-12-15T16:53:49.466753",
  "title": "Castalia House Store",
  "date_display": "April 24, 2014",
  "date_iso": "2014-04-24T17:00:00+00:00",
  "date_from_url": "2014-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ladies and gentlemen, Dread Ilk, casual fans, rubberneckers, anklebiters, and fellow Hugo Award nominees, I am very pleased indeed to announce to you that the Castalia House online store is now open for business.</p><p>Our selection is somewhat scanty at present, as the participation of certain books in Amazon’s Kindle Select program precludes them from being offered at the Castalia store for now. You will look in vain for Lt. Col Tom Kratman. You will offer no sacrifices on any Altars of Hate. Der Verstand werden Sie nicht finden. E li, i ragazzi piangono mai.</p><p>What you will find in <a href=\"http://www.castaliahouse.com/downloads/category/fantasy/\">the Fantasy section</a> is four fine works of fiction, including <i><b>AWAKE IN THE NIGHT LAND</b></i> by John C. Wright. All of them are also DRM-free, in EPUB format. What you will find in <a href=\"http://www.castaliahouse.com/downloads/category/science-fiction/\">the Science Fiction section</a> are two tales of the future, both involving Chief Warrant Officer Graven Tower, MCID-XAR. And, most importantly, what you will find <a href=\"http://www.castaliahouse.com/downloads/category/homeschool/\">in the Homeschool section</a> are the four books that make up the <i><b>ASTRONOMY AND ASTROPHYSICS</b></i> curriculum by Dr. Sarah Salviander. They are also DRM-free, but are in PDF format for easy printing.</p><p>While we have not yet officially announced the curriculum, as we are in the process of having the curriculum reviewed by a number of homeschool sites, I wanted to make it available to VP readers as soon as possible, as I know that there are many homeschoolers here who are presently preparing their coursework for the autumn. It has been declared to be “a top-notch astronomy<br> curriculum” by Laurie Bluedorn of <a href=\"http://www.triviumpursuit.com/bluedorn/\"><i><b>Trivium Pursuit</b></i></a> fame, and is literally serving as the model for other Castalia House curricula, including Physics, Economics, and Military History.</br></p><p>And don’t forget that the Castalia House blog is active too. Today Mascaro <a href=\"http://www.castaliahouse.com/review-fearless-the-lost-fleet-book-2-by-jack-campbell/\">reviews Fearless</a>, the second book in the Lost Fleet series.</p></div>",
  "content_text": "Ladies and gentlemen, Dread Ilk, casual fans, rubberneckers, anklebiters, and fellow Hugo Award nominees, I am very pleased indeed to announce to you that the Castalia House online store is now open for business.\nOur selection is somewhat scanty at present, as the participation of certain books in Amazon’s Kindle Select program precludes them from being offered at the Castalia store for now. You will look in vain for Lt. Col Tom Kratman. You will offer no sacrifices on any Altars of Hate. Der Verstand werden Sie nicht finden. E li, i ragazzi piangono mai.\nWhat you will find in\nthe Fantasy section\nis four fine works of fiction, including\nAWAKE IN THE NIGHT LAND\nby John C. Wright. All of them are also DRM-free, in EPUB format. What you will find in\nthe Science Fiction section\nare two tales of the future, both involving Chief Warrant Officer Graven Tower, MCID-XAR. And, most importantly, what you will find\nin the Homeschool section\nare the four books that make up the\nASTRONOMY AND ASTROPHYSICS\ncurriculum by Dr. Sarah Salviander. They are also DRM-free, but are in PDF format for easy printing.\nWhile we have not yet officially announced the curriculum, as we are in the process of having the curriculum reviewed by a number of homeschool sites, I wanted to make it available to VP readers as soon as possible, as I know that there are many homeschoolers here who are presently preparing their coursework for the autumn. It has been declared to be “a top-notch astronomy\ncurriculum” by Laurie Bluedorn of\nTrivium Pursuit\nfame, and is literally serving as the model for other Castalia House curricula, including Physics, Economics, and Military History.\nAnd don’t forget that the Castalia House blog is active too. Today Mascaro\nreviews Fearless\n, the second book in the Lost Fleet series.",
  "tags": [
    "Castalia House",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-24T16:00:00+00:00"
}