{
  "url": "https://voxday.net/2014/04/21/castalia-house-goes-live/",
  "scraped_at": "2025-12-15T16:53:31.114924",
  "title": "Castalia House Goes Live!",
  "date_display": "April 21, 2014",
  "date_iso": "2014-04-21T17:00:00+00:00",
  "date_from_url": "2014-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of our long-term goals for Castalia House is to make it the premier intellectual driving force in SF/F. That means more than simply publishing intelligent entertaining books by the likes of John C. Wright, Tom Kratman, and Rolf Nelson, and more than the publication of various educational curricula on subjects ranging from Astrophysics to Military History, but also reviewing the current state of the literary sub-genres.</p><p>So, we’re pleased to announce that the Castalia House blog has gone live with its first three daily bloggers. We’ll be adding a few more presently, but these three alone will ensure that the Castalia blog becomes a daily destination for everyone interested in science fiction and fantasy.  From Anson, <a href=\"http://www.castaliahouse.com/review-the-martian-by-andy-weir/\">a book review</a>:</p><blockquote class=\"tr_bq\"><p> REVIEW: The Martian by Andy Weir</p><p>The last few decades have seen a decline in the genre, as the good<br> material has surrendered its space in the bookstores, and foot by foot,<br> rack by rack, has been replaced by bi-curious tattooed lyncanthrope bike<br> chicks, Victorian ladies in steampunk goggles (Victorian only in<br> breeding and couture, sadly), endless Star Trek novelizations, and other<br> varieties of crap.</br></br></br></br></br></p><p>(The last 30 years have not been entirely dark – we’ve been blessed<br> with some of the best space opera ever from the pen of Ian Banks,<br> stunning Weird Fantasy from China Mieville, amazing stuff in multiple<br> genres from Neal Stephenson, and more…but bright spots aside, the hot<br> white hot center, the default worldview of science fiction has dimmed<br> and become less magical, more mundane, and – yes – simultaneously more<br> tacky, more banal, and more despair inducing.)</br></br></br></br></br></br></p><p>I was thrilled to come across a new novel recently that broke from<br> this downward trend.  It’s not the perfect novel (but then again, what<br> is?)</br></br></p></blockquote><p>And from Daniel Eness, <a href=\"http://www.castaliahouse.com/the-secret-to-science-fiction/\">The Secret to Science Fiction</a>:</p><blockquote class=\"tr_bq\"><p> H. Beam Piper — a man so versed in science he could sketch out, on a napkin, an engineering model of Sputnik the day it was announced, and explain it to a table of science enthusiasts — quit near-future science fiction. He did it because the scientific advances of the 1950s were coming so quickly that much of the knowledge he used for his stories felt obsolete to him by the time the magazines went to print. He was fed up with his guesses going bad so quickly like so much produce. That was 60 years ago. Has the world slowed down since then?</p><p>Jeff Sutton’s Apollo at Go suffered the opposite fate: because the NASA missions were so heavily engineered, and Sutton an engineer doing work for NASA…his 1965 “science fiction” book about the first moon landing that would happen in real life four years later now reads more like alternate history, and only a slight alternate at that.</p></blockquote><p>Also, in case you haven’t read it yet, <i><b><a href=\"http://www.amazon.com/Last-Witchking-Vox-Day-ebook/dp/B00I45AE1I\">THE LAST WITCHKING</a></b></i>, which contains the Hugo-nominated novelette “Opera Vita Aeterna”, is a free download today from Amazon.</p><p>And finally, due to the inability to sell pre-formatted PDF files through either Amazon or Smashwords, (yes, we know Smashwords sells PDFs, but they have to be submitted in Word format), we found it necessary to create our own online store. So, if you would like to support us by purchasing epubs directly, you can now do so <a href=\"http://www.castaliahouse.com/downloads/\">at the Castalia House Store</a>. Not everything is available there now, due to the limitations of the Kindle Select program, but you can expect the selections there to grow over time.</p></div>",
  "content_text": "One of our long-term goals for Castalia House is to make it the premier intellectual driving force in SF/F. That means more than simply publishing intelligent entertaining books by the likes of John C. Wright, Tom Kratman, and Rolf Nelson, and more than the publication of various educational curricula on subjects ranging from Astrophysics to Military History, but also reviewing the current state of the literary sub-genres.\nSo, we’re pleased to announce that the Castalia House blog has gone live with its first three daily bloggers. We’ll be adding a few more presently, but these three alone will ensure that the Castalia blog becomes a daily destination for everyone interested in science fiction and fantasy.  From Anson,\na book review\n:\nREVIEW: The Martian by Andy Weir\nThe last few decades have seen a decline in the genre, as the good\nmaterial has surrendered its space in the bookstores, and foot by foot,\nrack by rack, has been replaced by bi-curious tattooed lyncanthrope bike\nchicks, Victorian ladies in steampunk goggles (Victorian only in\nbreeding and couture, sadly), endless Star Trek novelizations, and other\nvarieties of crap.\n(The last 30 years have not been entirely dark – we’ve been blessed\nwith some of the best space opera ever from the pen of Ian Banks,\nstunning Weird Fantasy from China Mieville, amazing stuff in multiple\ngenres from Neal Stephenson, and more…but bright spots aside, the hot\nwhite hot center, the default worldview of science fiction has dimmed\nand become less magical, more mundane, and – yes – simultaneously more\ntacky, more banal, and more despair inducing.)\nI was thrilled to come across a new novel recently that broke from\nthis downward trend.  It’s not the perfect novel (but then again, what\nis?)\nAnd from Daniel Eness,\nThe Secret to Science Fiction\n:\nH. Beam Piper — a man so versed in science he could sketch out, on a napkin, an engineering model of Sputnik the day it was announced, and explain it to a table of science enthusiasts — quit near-future science fiction. He did it because the scientific advances of the 1950s were coming so quickly that much of the knowledge he used for his stories felt obsolete to him by the time the magazines went to print. He was fed up with his guesses going bad so quickly like so much produce. That was 60 years ago. Has the world slowed down since then?\nJeff Sutton’s Apollo at Go suffered the opposite fate: because the NASA missions were so heavily engineered, and Sutton an engineer doing work for NASA…his 1965 “science fiction” book about the first moon landing that would happen in real life four years later now reads more like alternate history, and only a slight alternate at that.\nAlso, in case you haven’t read it yet,\nTHE LAST WITCHKING\n, which contains the Hugo-nominated novelette “Opera Vita Aeterna”, is a free download today from Amazon.\nAnd finally, due to the inability to sell pre-formatted PDF files through either Amazon or Smashwords, (yes, we know Smashwords sells PDFs, but they have to be submitted in Word format), we found it necessary to create our own online store. So, if you would like to support us by purchasing epubs directly, you can now do so\nat the Castalia House Store\n. Not everything is available there now, due to the limitations of the Kindle Select program, but you can expect the selections there to grow over time.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-21T16:00:00+00:00"
}