{
  "url": "https://voxday.net/2014/04/06/day-by-day/",
  "scraped_at": "2025-12-15T16:51:53.882023",
  "title": "Day by Day",
  "date_display": "April 6, 2014",
  "date_iso": "2014-04-06T08:55:00+00:00",
  "date_from_url": "2014-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.daybydaycartoon.com/040614.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.daybydaycartoon.com/040614.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.daybydaycartoon.com/040614.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> I was a little surprised to see that. I already knew that a fair number of people whose names you might recognize have the blog in their regular rotation, as sometimes they send me email, but I had no idea that <a href=\"http://www.daybydaycartoon.com/\">Chris Muir</a> did.</p><p>And speaking of the new intolerant standard for American business, here is a way to let Mozilla know your opinion directly on <a href=\"https://input.mozilla.org/en-US/feedback\">their feedback page</a>. As per <a href=\"http://www.conservativeintel.com/2014/04/04/mozilla-sets-new-company-online-record-for-customer-dissatisfaction/\">Conservative Intelligence Briefing</a>: <i>“If Mozilla was hoping to avoid controversy by edging out former CEO Brendan Eich, the company has most certainly failed. The graph below comes from the feedback page on their site. This chart goes back to when the comment system was adopted, and the highest number of “sad” comments is today, by a factor of about two. The second highest number came yesterday.”</i></p><p>A sample of <a href=\"https://input.mozilla.org/en-US/?selected=7d&amp;date_start=2014-03-28\">the comments posted</a>:<i> </i></p><ul><li>Im still in disbelief at Mozilla inane and intolerant decision to have<br> its CEO step down.  Apparently they value the opinion of LGBT over the<br> first amendment.  Shame </br></br></li><li> Gay folks didn’t struggle to come out of the closet just so that<br> christian folks could now be shoved into it. I’ve uninstalled Firefox<br> after many years of using it and I will never recommend your product to<br> anyone ever again.</br></br></br></li><li> THOUGHT NAZIS will soon reap what they sew … Uninstalled on 23 work<br> and home computers. This is just the beginning you FASCISTS!!! </br></li><li> Giving in to the thought police is unnaceptable. The guy didn’t TREAT<br> any homosexual badly, just donated a modest sum (for an executive) to a<br> campaign that even BARACK ‘GOD OF THE LIBERALS’ OBAMA supported. This<br> isn’t “progress”, this is medieval persecution. Wolf in sheep’s<br> clothing, you are. F*ck you. </br></br></br></br></li><li>It has been great riding with you since 1994. Good luck in your future endeavours.<br> I have uninstalled Mozilla Firefox, Nightly, and Thunderbird<br> No longer willing to support or associate with your products.<br> Thanks.  </br></br></br></li></ul><p>It will be informative to see how long it takes before Mozilla shuts down their feedback page. Like many supporters of the gay rights agenda, they appear to have badly miscalculated the demographic math.</p></div>",
  "content_text": "I was a little surprised to see that. I already knew that a fair number of people whose names you might recognize have the blog in their regular rotation, as sometimes they send me email, but I had no idea that\nChris Muir\ndid.\nAnd speaking of the new intolerant standard for American business, here is a way to let Mozilla know your opinion directly on\ntheir feedback page\n. As per\nConservative Intelligence Briefing\n:\n“If Mozilla was hoping to avoid controversy by edging out former CEO Brendan Eich, the company has most certainly failed. The graph below comes from the feedback page on their site. This chart goes back to when the comment system was adopted, and the highest number of “sad” comments is today, by a factor of about two. The second highest number came yesterday.”\nA sample of\nthe comments posted\n:\nIm still in disbelief at Mozilla inane and intolerant decision to have\nits CEO step down.  Apparently they value the opinion of LGBT over the\nfirst amendment.  Shame\nGay folks didn’t struggle to come out of the closet just so that\nchristian folks could now be shoved into it. I’ve uninstalled Firefox\nafter many years of using it and I will never recommend your product to\nanyone ever again.\nTHOUGHT NAZIS will soon reap what they sew … Uninstalled on 23 work\nand home computers. This is just the beginning you FASCISTS!!!\nGiving in to the thought police is unnaceptable. The guy didn’t TREAT\nany homosexual badly, just donated a modest sum (for an executive) to a\ncampaign that even BARACK ‘GOD OF THE LIBERALS’ OBAMA supported. This\nisn’t “progress”, this is medieval persecution. Wolf in sheep’s\nclothing, you are. F*ck you.\nIt has been great riding with you since 1994. Good luck in your future endeavours.\nI have uninstalled Mozilla Firefox, Nightly, and Thunderbird\nNo longer willing to support or associate with your products.\nThanks.\nIt will be informative to see how long it takes before Mozilla shuts down their feedback page. Like many supporters of the gay rights agenda, they appear to have badly miscalculated the demographic math.",
  "tags": [
    "corpocracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-06T07:55:00+00:00"
}