{
  "url": "https://voxday.net/2014/04/11/dual-loyalty-would-be-improvemen/",
  "scraped_at": "2025-12-15T16:52:27.024131",
  "title": "“Dual loyalty would be an improvement”",
  "date_display": "April 11, 2014",
  "date_iso": "2014-04-11T13:00:00+00:00",
  "date_from_url": "2014-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ann Coulter points out that the big GOP donor Sheldon Alderson <a href=\"http://www.wnd.com/2014/04/competition-for-thee-but-not-for-me/\">advocates immigration and amnesty in the USA</a>, while simultanously supporting border fences and deportations in Israel:</p><blockquote class=\"tr_bq\"><p> Adelson is a big backer of amnesty, telling the Wall Street Journal: “It<br> would be inhumane to send those people back, to send 12 million people<br> out of this country. … So we’ve got to find a way, find a route for<br> those people to get legal citizenship.”</br></br></br></p><p>His newspaper, <i>Israel Today,</i> the largest newspaper in Israel, is wildly patriotic on immigration (and everything else). <i>Israel Today</i> has trumpeted the success of the 15-foot razor-wire<br> fence along Israel’s 140-mile border with Egypt, triumphantly noting<br> last August that, for the first time, “no infiltrations were recorded<br> from the Egyptian border, compared to 193 from the same month last<br> year.”</br></br></br></br></p><p>Adelson himself had suggested just such a policy to the Los Angeles<br> Times last year, saying he wanted to “Put a big fence around our<br> country.” By “our country,” he, of course, meant Israel. In America, he wants<br> illegal immigrants pouring across the border to provide him with an<br> endless supply of cheap labor.</br></br></br></br></p><p>Recently, Israel has been “rounding up” African refugees, giving them<br> $3,500 and plane tickets to Uganda, to encourage them to “self-deport.”<br> <i>Welcome to El Al Airlines. We’re about to begin pre-boarding for<br> Flight 259, offering non-stop, one-way service to Kampala, Uganda. At<br> this time we’d like to invite our premium-plus illegal immigrants to<br> board.</br></br></br></i></br></br></p><p>Wait! I thought we couldn’t “round up” any illegal immigrants! I thought “self-deportation” was a laughable idea!</p></blockquote><p>The amazing thing is that Adelson’s defenders failed to grasp the damning aspect of the quote. Daniel Greenfield of FrontPage <a href=\"http://www.frontpagemag.com/2014/dgreenfield/put-a-big-fence-around-our-country-quoting-sheldon-adelson-out-of-context/\">tries to defend Adelson</a> by pointing out: “The “fence” quote refers to keeping terrorists from the Palestinian<br> Authority out. It certainly isn’t about migrants coming through Egypt.”</br></p><p>That may be, but that’s really not the problem. The problem is that when Mr. Adelson <a href=\"http://articles.latimes.com/2013/may/28/world/la-fg-wn-sheldon-adelson-israel-20130528\">referred to his country</a>, he was talking about Israel, not the USA. Which means that while he may be in possession of a document that says he is a citizen of the United States, he is observably not an American, as evidenced by both the policies he advocates and his own words.</p><p>The problem is not that Mr. Adelson’s critics are anti-Semitic. The problem is that Mr. Adelson is anti-American.</p></div>",
  "content_text": "Ann Coulter points out that the big GOP donor Sheldon Alderson\nadvocates immigration and amnesty in the USA\n, while simultanously supporting border fences and deportations in Israel:\nAdelson is a big backer of amnesty, telling the Wall Street Journal: “It\nwould be inhumane to send those people back, to send 12 million people\nout of this country. … So we’ve got to find a way, find a route for\nthose people to get legal citizenship.”\nHis newspaper,\nIsrael Today,\nthe largest newspaper in Israel, is wildly patriotic on immigration (and everything else).\nIsrael Today\nhas trumpeted the success of the 15-foot razor-wire\nfence along Israel’s 140-mile border with Egypt, triumphantly noting\nlast August that, for the first time, “no infiltrations were recorded\nfrom the Egyptian border, compared to 193 from the same month last\nyear.”\nAdelson himself had suggested just such a policy to the Los Angeles\nTimes last year, saying he wanted to “Put a big fence around our\ncountry.” By “our country,” he, of course, meant Israel. In America, he wants\nillegal immigrants pouring across the border to provide him with an\nendless supply of cheap labor.\nRecently, Israel has been “rounding up” African refugees, giving them\n$3,500 and plane tickets to Uganda, to encourage them to “self-deport.”\nWelcome to El Al Airlines. We’re about to begin pre-boarding for\nFlight 259, offering non-stop, one-way service to Kampala, Uganda. At\nthis time we’d like to invite our premium-plus illegal immigrants to\nboard.\nWait! I thought we couldn’t “round up” any illegal immigrants! I thought “self-deportation” was a laughable idea!\nThe amazing thing is that Adelson’s defenders failed to grasp the damning aspect of the quote. Daniel Greenfield of FrontPage\ntries to defend Adelson\nby pointing out: “The “fence” quote refers to keeping terrorists from the Palestinian\nAuthority out. It certainly isn’t about migrants coming through Egypt.”\nThat may be, but that’s really not the problem. The problem is that when Mr. Adelson\nreferred to his country\n, he was talking about Israel, not the USA. Which means that while he may be in possession of a document that says he is a citizen of the United States, he is observably not an American, as evidenced by both the policies he advocates and his own words.\nThe problem is not that Mr. Adelson’s critics are anti-Semitic. The problem is that Mr. Adelson is anti-American.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-04-11T12:00:00+00:00"
}