{
  "url": "https://voxday.net/2014/04/13/inchoatus-reviews-golden-age/",
  "scraped_at": "2025-12-15T16:52:39.781910",
  "title": "Inchoatus reviewsThe Golden Age",
  "date_display": "April 13, 2014",
  "date_iso": "2014-04-13T21:00:00+00:00",
  "date_from_url": "2014-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a review of John C. Wright’s <i>The Golden Age</i> from an excellent, but sadly defunct SF/F review site called Inchoatus which has been resurrected and posted here courtesy of the Wayback Machine.<i><b> </b></i>I think it is relevant to the forthcoming publication of Mr. Wright’s <i><b>AWAKE IN THE NIGHT LAND </b></i>because much of what the reviewers say about the earlier novel is directly applicable to the current book, which is a fascinating blend of novel and anthology.<i><b><br/></b></i></p><div class=\"MsoNormal\" style=\"margin-bottom: .0001pt; margin-bottom: 0in; margin-left: .5in; margin-right: .5in; margin-top: 0in;\"> <br> <i>“This dazzling first novel is just half of a two-volume saga, so it’s too<br> soon to tell if it will deliver on its audacious promise. It’s already clear,<br> however, that Wright may be this fledgling century’s most important new SF<br> talent… To write honestly about the far future is a similarly heroic deed.<br> Too often, SF paints it as nothing more than the Roman Empire writ large.”</br></br></br></br></i></br></div><div align=\"right\" class=\"MsoNormal\" style=\"margin-bottom: .0001pt; margin-bottom: 0in; margin-left: .5in; margin-right: .5in; margin-top: 0in;\"> –Publisher’s Weekly</div><div class=\"MsoNormal\" style=\"margin-bottom: 5.0pt; margin-left: 0in; margin-right: .5in; margin-top: 0in;\"></div><div class=\"MsoNormal\"> It is a very, very rare thing for PW to attach the word<br> “important” to an author. It’s an adjective that rings in our ears here at <i><br> Inchoatus </br></i>because that’s exactly what we’re trying to do: make speculative<br> fiction important. Here, we agree completely: the themes that Wright brings up and<br> handles are as deftly done as anything else we’ve seen. “Audacious” is another<br> good word to use. There are plenty of writers who write about a “golden age”<br> of technological achievement but it is almost always undercut by corruption,<br> or portrayed through the eyes of the indigent and plain, painted with the<br> brush of the chronically cynical or pessimistic, or perceived from the<br> ashes following some apocalypse. But Wright doesn’t surrender an inch: he gives us<br> humanity at the absolute pinnacle of its achievement and seen through the main<br> character who is the most powerful man in solar system. Very, very few people, that we<br> know of anyway, have dared this.<b style=\"mso-bidi-font-weight: normal;\"><i style=\"mso-bidi-font-style: normal;\"> </i></b><p><b style=\"mso-bidi-font-weight: normal;\"><i style=\"mso-bidi-font-style: normal;\">What We Say</i></b></p><p>There is plenty of “New Wave” science fiction going on and authors keep taking shots at being the definitive voice of this sub-genre. We’ve reviewed several applicants for the position on this site: most notably M. John Harrison’s Light and Dan Simmons’ Ilium while most lamentably John Clute’s Appleseed and Alastair Reynolds’ later offerings of Redemption Ark and Absolution Gap. While we’re not yet ready to crown Wright, this book makes a considered and strategic effort at absorbing all similar works that came before and influencing all subsequent writing in the genre: our very  definition of a great book. So while Wright’s <i>The Golden Age</i> doesn’t assume this mantle all by itself if the conclusion of the series lives up to its promise, then he could be making a the most serious bid we’ve seen yet.</p></br></br></br></br></br></br></br></br></br></br></br></div><p> <i>The Golden Age</i> is a very special book. It’s one of those breathtaking efforts where the author (and it almost has to be a debut effort for the author because only those initiates have the naiveté to think they can pull off stuff like this) unflinchingly announces: “I want to write about this.” And sometimes, that “this” turns out to be have the scope and the daring that would cause the vast majority of sane and experienced writers to give it up after a few trials as hopelessly complex or large.</p><p>But then, those special authors wrap their arms around that scary and impossibly large idea and squeeze. And out pops a genuinely moving story.</p><p><i>The Golden Age</i> is huge in its scope. It takes on nothing less than a humanity that has achieved a kind of pinnacle of technological prowess: immortality is achieved, artificial intelligence is not only achieved but has reached a level of sophistication and service to mankind that genius and perfection are almost routine, engineering efforts of almost irrational scope (such as, for example, living up to 2010: A Space Odyssey’s vision of creating a second sun out of Jupiter) take place, people live in almost perfect freedom–free to pursue any aims that they can imagine so long as they don’t hurt others. Wright takes this universe, reifies it, and makes it unbelievably plausible (“unbelievably plausible” being a hyperbolic paradox we couldn’t resist). Wright hollows out the framework for this future and then pours in all the accoutrements in astonishing detail. No aspect is overlooked. Where Robert Jordan’s Wheel of Time world seems a bit strained and predictable, Wright gives us a soaring, wild place of unfettered imagination. Where Goodkind’s world comes off as contrived and serving the whim of its author, Wright gives us a solar system that creates the characters and drives the plot to some inevitabilities and some other shocking developments. For sheer world-building, only Stephen R. Donaldson’s The Chronicles of Thomas Covenant and perhaps George RR Martin’s A Song of Fire and Ice can match Wright. The only author who stands above him in this regard is Tolkien.</p><p>Even better, and more praiseworthy, are the characters. Helion and Phaethon–and even the sophotechs–are not the kind of protagonists that we’re used to reading about. They’re not the youths destined for greatness learning at the foot of a wise old wizard learning the ways of the Force. They’re not bitter and taciturn men-of-action disguising a hidden pain underneath their martial prowess and brought reluctantly in to the affairs of government like a random weather event. They’re not police, soldiers, or tyrants. They are geniuses capable of daring great things. So many authors don’t want to write about genius precisely because it is hard to write about genius. Yet Wright doesn’t flinch. Helion and Phaethon are the greatest and most ambitious luminaries of their world and Wright opens them up to use and dares us to match their dreams with ours.</p><p>The only similar books where we have similar works of genius character come from Michael Flynn’s Firestar and Ayn Rand’s Atlas Shrugged.</p><p>For those of you who yearn for a similar hero of the individual, you will find it in Phaethon. We open this book at a time when this perfected society is preparing for a tremendous, millennial celebration. Art–and art that can only be visualized and dreamt of in this sort of paradisiacal setting–is reaching a kind of peak where all the libertine sensibilities of the vast consciousnesses of the solar system come together and literally change the way beauty will be perceived and lives led for the next thousand years. Phaethon is here, participating, but faintly bored and troubled. It will soon become apparent that large sections of his memory are missing and that he himself has been complicit in their removal for reasons he cannot understand.</p><p>For this first novel of the trilogy, <i>The Golden Age</i> is a voyage of self-discovery for Phaethon and a reconstruction of his relationship with his father, Helion. It’s an extremely interesting and compelling journey to watch the transformation of Phaethon the elitist, privileged tourist in to what is his true nature: the dominant, arrogant, supremely competent and individualistic hero. While not explicit, Phaethon follows a path of pride, rebellion, and romanticism that is thematically related to the fall of Satan in Paradise Lost whom Milton could not resist from imbuing with entrancing ideals and tempting power.</p><p>But in most ways, <i>The Golden Age</i> follows in the model of Atlas Shrugged in that we have a protagonist who is stubbornly and arrogantly announcing and casting his vision into the teeth of the “will of the majority.” It’s one of the glories of American political thought that we countenance the individual and regard him as a hero in cases such as these and it is this notion that drives the popularity of books like Atlas Shrugged as well as treatises (despite opposing politics) of works like Henry David Thoreau’s Walden (and, we might add, in direct thematic opposition to some “old country” works like Crime and Punishment and The Idylls of the King). It is also the more literary and famous “carlylian hero” (named for Thomas Carlyle) whose rebel hero rails against the inimical and ineluctable forces of nature refusing to capitulate despite certainty of defeat (Moby Dick’s Captain Ahab being one of the most famous of these).</p><p>But unlike Atlas Shrugged, the world around Phaethon is not one of oppressive and encroaching government but a more sinister event of free-thinking peoples within a completely libertarian society literally choosing to ostracize him. Unlike Captain Ahab, it is not the forces of nature that oppose Phaethon but the free-acting citizenry of humanity acting almost with the omnipresence and deterministic features of a force of nature. There is an undercurrent of determinism and human coercion that surfaces in this golden age where mankind has reached its zenith of power and freedom: the claw of Marx still reaches out and grasps the flight of freedom just as Tashtego grasped the sky-hawk as the Pequod sank beneath the Pacific.</p><p>This is an exciting book where deeply detailed future technology is merged with an overwhelming sensibility of the societal and political problems inherent in that kind of a culture that have a peculiar relevance to where we are today. There are only two reasons that we withhold nomination for a seven (at least at this point): First, the work is unfinished and it is not clear yet if Wright can really pull this thing off; second, is the single-mindedness of the plot. Ultimately, works of this nature have to be compared to Tolkien (as unfair as that may be). One of the great achievements of The Lord of the Rings is that so much of the world existed on its own basis and for its own sake. The politics of Rohan, of Gondor, of Mirkwood, of the White Council, of The Lonely Mountain, of Lothlorien, of Fangorn, and even of the Shire existed with a perfectly rational set of individual goals, objectives, and expectations. As they are swept in to the War of the Ring, so are the various agenda brought in and mutated to that singular event. The mythological history of Arda itself shapes the plot. <i>The Golden Age</i>, at least as we perceive the first book, exists differently: all political thought and events seem focused on the deeds of Phaethon and do not seem to have individualized agenda of their own. Are Phaethon and Helion truly the only people of daring in the solar system? Are there not competing interests even among the sophotechs themselves? At some point, it seems as if there should be a world out there which should–at this point–be largely untouched and unconcerned by these events within the Hortatory Council or at least positioned as equal importance. Where are they?</p><p>Finally, we most note, that while the writing is intellectually compelling and the ideas bursting in their intrigue, Wright’s talents lack a certain poetry that Melville and Milton have (perhaps hardly fair to compare Wright to these authors) but also that more contemporary authors Wolfe, Tolkien, and Chiang possess. This criticism of so good a book is perhaps grossly unfair but it should be considered praise that we even think to compare Wright with these other authors.</p><p>And greater success may yet come. This is an awe-inspiring work of speculative fiction and we hope for great things from the succeeding volumes. <br> <b><br>Place in Genre</br></b></br></p><p>Future technologies have been investigated by many different authors attempting many different things. Stephenson’s The Diamond Age, Alastair Reynold’s Revelation Space, and M. John Harrison’s Light are three notable examples of authors attempting to wrestle with the results of future technologies. It is very interesting that both Stephenson and Wright chose Victorian ideals as their principle settings for a future people attempting to deal with their technological wonders. (Let us not forget less notable examples such as Clade by Budz and Altered Carbon by Morgan.) Wright is attempting to eclipse these excellent efforts and he may yet do it. In order to do so, he will have to create his world as a compelling force that sears itself in to the minds of his readers in ways that make it inevitable in our minds that things could turn out any other way. He may succeed! He hasn’t yet with this first novel but he may succeed by the end. If he can, Wright could very literally change the genre itself.</p><p><b>Why You Should Read This</b></p><p>Those readers who are compelled by future world-building of the higher order–that is, fans of those aforementioned authors Stephenson, Reynolds, and Harrison will find themselves eagerly devouring <i>The Golden Age</i>. Additionally, politically minded fans of Ayn Rand, Robert Heinlein, Michael Flynn, and perhaps even authors from the other side of the political spectrum such as Kim Stanley Robinson will find a lot of very interesting moments in this book where such problems as freedom versus the collective and aesthetics versus judgments are treated fairly and completely. Certainly those stubborn adherents of Terry Goodkind–a man who can seem to only echo endlessly and shallowly the arguments of Ayn Rand’s objectivism–should come to Wright’s work and see the subject treated with depth, vigor, and the breaking of new ground.<br> <b><br>Why You Should Pass</br></b></br></p><p>We can’t make any recommendations here. It is one of the best works of science fiction available on the market. The only market to whom there may not be an appeal are to those people who are wholly uninitiated in science fiction to begin with. Some authors, like the aforementioned Robinson, can draw events of colonizing the stars in near-future terms that are capable of appealing to broad audiences. But because of Wright’s completely unflinching manner in approaching his worlds, people unused to dealing with artificial intelligence, consciousnesses existing independently of bodies and stored in mechanisms, and an easy acceptance of changing the world and worlds to fit the needs of a striving humanity, may quickly become lost and drown in the onslaught of new ideas. In short, a certain amount of training may be required to fully appreciate Wright and meet him on the terms that he sets for his readers. This problem–if it is a problem–may ultimately restrict <i>The Golden Age</i> from finding the kind of large-scale audience it might otherwise deserve.</p></div>",
  "content_text": "This is a review of John C. Wright’s\nThe Golden Age\nfrom an excellent, but sadly defunct SF/F review site called Inchoatus which has been resurrected and posted here courtesy of the Wayback Machine.\nI think it is relevant to the forthcoming publication of Mr. Wright’s\nAWAKE IN THE NIGHT LAND\nbecause much of what the reviewers say about the earlier novel is directly applicable to the current book, which is a fascinating blend of novel and anthology.\n“This dazzling first novel is just half of a two-volume saga, so it’s too\nsoon to tell if it will deliver on its audacious promise. It’s already clear,\nhowever, that Wright may be this fledgling century’s most important new SF\ntalent… To write honestly about the far future is a similarly heroic deed.\nToo often, SF paints it as nothing more than the Roman Empire writ large.”\n–Publisher’s Weekly\nIt is a very, very rare thing for PW to attach the word\n“important” to an author. It’s an adjective that rings in our ears here at\nInchoatus\nbecause that’s exactly what we’re trying to do: make speculative\nfiction important. Here, we agree completely: the themes that Wright brings up and\nhandles are as deftly done as anything else we’ve seen. “Audacious” is another\ngood word to use. There are plenty of writers who write about a “golden age”\nof technological achievement but it is almost always undercut by corruption,\nor portrayed through the eyes of the indigent and plain, painted with the\nbrush of the chronically cynical or pessimistic, or perceived from the\nashes following some apocalypse. But Wright doesn’t surrender an inch: he gives us\nhumanity at the absolute pinnacle of its achievement and seen through the main\ncharacter who is the most powerful man in solar system. Very, very few people, that we\nknow of anyway, have dared this.\nWhat We Say\nThere is plenty of “New Wave” science fiction going on and authors keep taking shots at being the definitive voice of this sub-genre. We’ve reviewed several applicants for the position on this site: most notably M. John Harrison’s Light and Dan Simmons’ Ilium while most lamentably John Clute’s Appleseed and Alastair Reynolds’ later offerings of Redemption Ark and Absolution Gap. While we’re not yet ready to crown Wright, this book makes a considered and strategic effort at absorbing all similar works that came before and influencing all subsequent writing in the genre: our very  definition of a great book. So while Wright’s\nThe Golden Age\ndoesn’t assume this mantle all by itself if the conclusion of the series lives up to its promise, then he could be making a the most serious bid we’ve seen yet.\nThe Golden Age\nis a very special book. It’s one of those breathtaking efforts where the author (and it almost has to be a debut effort for the author because only those initiates have the naiveté to think they can pull off stuff like this) unflinchingly announces: “I want to write about this.” And sometimes, that “this” turns out to be have the scope and the daring that would cause the vast majority of sane and experienced writers to give it up after a few trials as hopelessly complex or large.\nBut then, those special authors wrap their arms around that scary and impossibly large idea and squeeze. And out pops a genuinely moving story.\nThe Golden Age\nis huge in its scope. It takes on nothing less than a humanity that has achieved a kind of pinnacle of technological prowess: immortality is achieved, artificial intelligence is not only achieved but has reached a level of sophistication and service to mankind that genius and perfection are almost routine, engineering efforts of almost irrational scope (such as, for example, living up to 2010: A Space Odyssey’s vision of creating a second sun out of Jupiter) take place, people live in almost perfect freedom–free to pursue any aims that they can imagine so long as they don’t hurt others. Wright takes this universe, reifies it, and makes it unbelievably plausible (“unbelievably plausible” being a hyperbolic paradox we couldn’t resist). Wright hollows out the framework for this future and then pours in all the accoutrements in astonishing detail. No aspect is overlooked. Where Robert Jordan’s Wheel of Time world seems a bit strained and predictable, Wright gives us a soaring, wild place of unfettered imagination. Where Goodkind’s world comes off as contrived and serving the whim of its author, Wright gives us a solar system that creates the characters and drives the plot to some inevitabilities and some other shocking developments. For sheer world-building, only Stephen R. Donaldson’s The Chronicles of Thomas Covenant and perhaps George RR Martin’s A Song of Fire and Ice can match Wright. The only author who stands above him in this regard is Tolkien.\nEven better, and more praiseworthy, are the characters. Helion and Phaethon–and even the sophotechs–are not the kind of protagonists that we’re used to reading about. They’re not the youths destined for greatness learning at the foot of a wise old wizard learning the ways of the Force. They’re not bitter and taciturn men-of-action disguising a hidden pain underneath their martial prowess and brought reluctantly in to the affairs of government like a random weather event. They’re not police, soldiers, or tyrants. They are geniuses capable of daring great things. So many authors don’t want to write about genius precisely because it is hard to write about genius. Yet Wright doesn’t flinch. Helion and Phaethon are the greatest and most ambitious luminaries of their world and Wright opens them up to use and dares us to match their dreams with ours.\nThe only similar books where we have similar works of genius character come from Michael Flynn’s Firestar and Ayn Rand’s Atlas Shrugged.\nFor those of you who yearn for a similar hero of the individual, you will find it in Phaethon. We open this book at a time when this perfected society is preparing for a tremendous, millennial celebration. Art–and art that can only be visualized and dreamt of in this sort of paradisiacal setting–is reaching a kind of peak where all the libertine sensibilities of the vast consciousnesses of the solar system come together and literally change the way beauty will be perceived and lives led for the next thousand years. Phaethon is here, participating, but faintly bored and troubled. It will soon become apparent that large sections of his memory are missing and that he himself has been complicit in their removal for reasons he cannot understand.\nFor this first novel of the trilogy,\nThe Golden Age\nis a voyage of self-discovery for Phaethon and a reconstruction of his relationship with his father, Helion. It’s an extremely interesting and compelling journey to watch the transformation of Phaethon the elitist, privileged tourist in to what is his true nature: the dominant, arrogant, supremely competent and individualistic hero. While not explicit, Phaethon follows a path of pride, rebellion, and romanticism that is thematically related to the fall of Satan in Paradise Lost whom Milton could not resist from imbuing with entrancing ideals and tempting power.\nBut in most ways,\nThe Golden Age\nfollows in the model of Atlas Shrugged in that we have a protagonist who is stubbornly and arrogantly announcing and casting his vision into the teeth of the “will of the majority.” It’s one of the glories of American political thought that we countenance the individual and regard him as a hero in cases such as these and it is this notion that drives the popularity of books like Atlas Shrugged as well as treatises (despite opposing politics) of works like Henry David Thoreau’s Walden (and, we might add, in direct thematic opposition to some “old country” works like Crime and Punishment and The Idylls of the King). It is also the more literary and famous “carlylian hero” (named for Thomas Carlyle) whose rebel hero rails against the inimical and ineluctable forces of nature refusing to capitulate despite certainty of defeat (Moby Dick’s Captain Ahab being one of the most famous of these).\nBut unlike Atlas Shrugged, the world around Phaethon is not one of oppressive and encroaching government but a more sinister event of free-thinking peoples within a completely libertarian society literally choosing to ostracize him. Unlike Captain Ahab, it is not the forces of nature that oppose Phaethon but the free-acting citizenry of humanity acting almost with the omnipresence and deterministic features of a force of nature. There is an undercurrent of determinism and human coercion that surfaces in this golden age where mankind has reached its zenith of power and freedom: the claw of Marx still reaches out and grasps the flight of freedom just as Tashtego grasped the sky-hawk as the Pequod sank beneath the Pacific.\nThis is an exciting book where deeply detailed future technology is merged with an overwhelming sensibility of the societal and political problems inherent in that kind of a culture that have a peculiar relevance to where we are today. There are only two reasons that we withhold nomination for a seven (at least at this point): First, the work is unfinished and it is not clear yet if Wright can really pull this thing off; second, is the single-mindedness of the plot. Ultimately, works of this nature have to be compared to Tolkien (as unfair as that may be). One of the great achievements of The Lord of the Rings is that so much of the world existed on its own basis and for its own sake. The politics of Rohan, of Gondor, of Mirkwood, of the White Council, of The Lonely Mountain, of Lothlorien, of Fangorn, and even of the Shire existed with a perfectly rational set of individual goals, objectives, and expectations. As they are swept in to the War of the Ring, so are the various agenda brought in and mutated to that singular event. The mythological history of Arda itself shapes the plot.\nThe Golden Age\n, at least as we perceive the first book, exists differently: all political thought and events seem focused on the deeds of Phaethon and do not seem to have individualized agenda of their own. Are Phaethon and Helion truly the only people of daring in the solar system? Are there not competing interests even among the sophotechs themselves? At some point, it seems as if there should be a world out there which should–at this point–be largely untouched and unconcerned by these events within the Hortatory Council or at least positioned as equal importance. Where are they?\nFinally, we most note, that while the writing is intellectually compelling and the ideas bursting in their intrigue, Wright’s talents lack a certain poetry that Melville and Milton have (perhaps hardly fair to compare Wright to these authors) but also that more contemporary authors Wolfe, Tolkien, and Chiang possess. This criticism of so good a book is perhaps grossly unfair but it should be considered praise that we even think to compare Wright with these other authors.\nAnd greater success may yet come. This is an awe-inspiring work of speculative fiction and we hope for great things from the succeeding volumes.\nPlace in Genre\nFuture technologies have been investigated by many different authors attempting many different things. Stephenson’s The Diamond Age, Alastair Reynold’s Revelation Space, and M. John Harrison’s Light are three notable examples of authors attempting to wrestle with the results of future technologies. It is very interesting that both Stephenson and Wright chose Victorian ideals as their principle settings for a future people attempting to deal with their technological wonders. (Let us not forget less notable examples such as Clade by Budz and Altered Carbon by Morgan.) Wright is attempting to eclipse these excellent efforts and he may yet do it. In order to do so, he will have to create his world as a compelling force that sears itself in to the minds of his readers in ways that make it inevitable in our minds that things could turn out any other way. He may succeed! He hasn’t yet with this first novel but he may succeed by the end. If he can, Wright could very literally change the genre itself.\nWhy You Should Read This\nThose readers who are compelled by future world-building of the higher order–that is, fans of those aforementioned authors Stephenson, Reynolds, and Harrison will find themselves eagerly devouring\nThe Golden Age\n. Additionally, politically minded fans of Ayn Rand, Robert Heinlein, Michael Flynn, and perhaps even authors from the other side of the political spectrum such as Kim Stanley Robinson will find a lot of very interesting moments in this book where such problems as freedom versus the collective and aesthetics versus judgments are treated fairly and completely. Certainly those stubborn adherents of Terry Goodkind–a man who can seem to only echo endlessly and shallowly the arguments of Ayn Rand’s objectivism–should come to Wright’s work and see the subject treated with depth, vigor, and the breaking of new ground.\nWhy You Should Pass\nWe can’t make any recommendations here. It is one of the best works of science fiction available on the market. The only market to whom there may not be an appeal are to those people who are wholly uninitiated in science fiction to begin with. Some authors, like the aforementioned Robinson, can draw events of colonizing the stars in near-future terms that are capable of appealing to broad audiences. But because of Wright’s completely unflinching manner in approaching his worlds, people unused to dealing with artificial intelligence, consciousnesses existing independently of bodies and stored in mechanisms, and an easy acceptance of changing the world and worlds to fit the needs of a striving humanity, may quickly become lost and drown in the onslaught of new ideas. In short, a certain amount of training may be required to fully appreciate Wright and meet him on the terms that he sets for his readers. This problem–if it is a problem–may ultimately restrict\nThe Golden Age\nfrom finding the kind of large-scale audience it might otherwise deserve.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-13T20:00:00+00:00"
}