{
  "url": "https://voxday.net/2014/04/02/italy-arrests-venetian-secessionists/",
  "scraped_at": "2025-12-15T16:51:33.041945",
  "title": "Italy arrests Venetian secessionists",
  "date_display": "April 2, 2014",
  "date_iso": "2014-04-02T17:00:00+00:00",
  "date_from_url": "2014-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> <i><a href=\"http://www.repubblica.it/cronaca/2014/04/02/news/operazione_contro_secessionisti_veneti-82521951/\">ROMA</a> – Blitz dei carabinieri del Ros contro un gruppo secessionista accusato di aver messo in atto “varie iniziative, anche violente”, per ottenere l’indipendenza del Veneto, e non solo. L’accusa mossa dalla Procura di Brescia è quella di terrorismo (270 bis c.p.): 24 i provvedimenti restrittivi, 51 indagati in totale e 33 le perquisizioni ordinate dalla procura della Repubblica di Brescia e che hanno interessato il Veneto. Tra gli indagati nell’operazione anche un leader del movimento dei Forconi e un ex deputato, Franco Rocchetta, già sottosegretario di Stato agli Affari esteri tra il 1994 e il 1995.</i></p><p>ROME – A raid by the military police was conducted against a group of secessionists accused of having put into action “various initiatives, some of them violent” to obtain the independence the region of the Veneto<i>.</i> And in addition, the accusation of terrorism was made by the District Attorney of Brescia: of 51 that were investigated in total, 24 were taken into custody of and 33 were ordered to be searched…. Among those arrested in the operation included a leader of the  Sicilian-based “Pitchfork Movement” and a former member of the Chamber of Deputies, (the Italian House of Representatives), Franco Rocchetta, former undersecretary of the Ministry for Foreign Affairs from 1994 to 1995.</p></blockquote><p>I realize that many Americans will find it difficult to credit, but secessionist movements are literally sweeping the entire range of Europe, from the Crimea in the east to Scotland in the West. It is only a matter of time before the economic contraction and increasing social turmoil lead to similar political developments in the USA, especially as the Obama administration and the Congress exhibit increasing political tone-deafness.</p></div>",
  "content_text": "ROMA\n– Blitz dei carabinieri del Ros contro un gruppo secessionista accusato di aver messo in atto “varie iniziative, anche violente”, per ottenere l’indipendenza del Veneto, e non solo. L’accusa mossa dalla Procura di Brescia è quella di terrorismo (270 bis c.p.): 24 i provvedimenti restrittivi, 51 indagati in totale e 33 le perquisizioni ordinate dalla procura della Repubblica di Brescia e che hanno interessato il Veneto. Tra gli indagati nell’operazione anche un leader del movimento dei Forconi e un ex deputato, Franco Rocchetta, già sottosegretario di Stato agli Affari esteri tra il 1994 e il 1995.\nROME – A raid by the military police was conducted against a group of secessionists accused of having put into action “various initiatives, some of them violent” to obtain the independence the region of the Veneto\n.\nAnd in addition, the accusation of terrorism was made by the District Attorney of Brescia: of 51 that were investigated in total, 24 were taken into custody of and 33 were ordered to be searched…. Among those arrested in the operation included a leader of the  Sicilian-based “Pitchfork Movement” and a former member of the Chamber of Deputies, (the Italian House of Representatives), Franco Rocchetta, former undersecretary of the Ministry for Foreign Affairs from 1994 to 1995.\nI realize that many Americans will find it difficult to credit, but secessionist movements are literally sweeping the entire range of Europe, from the Crimea in the east to Scotland in the West. It is only a matter of time before the economic contraction and increasing social turmoil lead to similar political developments in the USA, especially as the Obama administration and the Congress exhibit increasing political tone-deafness.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-02T16:00:00+00:00"
}