{
  "url": "https://voxday.net/2014/04/14/larry-corriea-drops-bomb/",
  "scraped_at": "2025-12-15T16:52:45.293333",
  "title": "Larry Corriea drops the bomb",
  "date_display": "April 14, 2014",
  "date_iso": "2014-04-14T15:13:00+00:00",
  "date_from_url": "2014-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On behalf of Mr. John C. Wright and encourages his vast horde of heavily armed readers to divert a little of their ammo money towards a copy of <a href=\"http://www.amazon.com/dp/B00JM98V60\">AWAKE IN THE NIGHT LAND</a>:</p><blockquote class=\"tr_bq\"><p> Many of you already know John for being an awesome sci-fi writer. Personally, I found him because of his blog. Like me, John is an out of the closet conservative. Only where I am<br> blunt and sometimes crude, John is eloquent and intellectual. I’m a<br> tetsubo. John is a rapier. I’ve got a lot of respect for his writing,<br> and I don’t say this lightly but I really do believe he is our modern<br> C.S. Lewis….</br></br></br></br></p><p>Right now it is sitting at:<b> Amazon Best Sellers Rank:</b> #10,504 Paid in Kindle Store</p><div class=\"zg_hrsr_item\"> I want to bump that up higher because I think<br> John is a great writer and a voice of reason in the wilderness. So<br> please tell your friends, repost this on your FB or Twitter or whatever<br> you are in to.</br></br></br></div></blockquote><p>Read the rest <a href=\"http://monsterhunternation.com/2014/04/14/book-bomb-john-c-wrights-awake-in-the-night-land/\">at Monster Hunter Nation</a>.</p></div>",
  "content_text": "On behalf of Mr. John C. Wright and encourages his vast horde of heavily armed readers to divert a little of their ammo money towards a copy of\nAWAKE IN THE NIGHT LAND\n:\nMany of you already know John for being an awesome sci-fi writer. Personally, I found him because of his blog. Like me, John is an out of the closet conservative. Only where I am\nblunt and sometimes crude, John is eloquent and intellectual. I’m a\ntetsubo. John is a rapier. I’ve got a lot of respect for his writing,\nand I don’t say this lightly but I really do believe he is our modern\nC.S. Lewis….\nRight now it is sitting at:\nAmazon Best Sellers Rank:\n#10,504 Paid in Kindle Store\nI want to bump that up higher because I think\nJohn is a great writer and a voice of reason in the wilderness. So\nplease tell your friends, repost this on your FB or Twitter or whatever\nyou are in to.\nRead the rest\nat Monster Hunter Nation\n.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-14T14:13:00+00:00"
}