{
  "url": "https://voxday.net/2014/04/18/lions-den-witchfinder/",
  "scraped_at": "2025-12-15T16:53:12.725566",
  "title": "Lions Den: Witchfinder",
  "date_display": "April 18, 2014",
  "date_iso": "2014-04-18T17:00:00+00:00",
  "date_from_url": "2014-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Bandit reviews Sarah Hoyt’s <a href=\"http://www.amazon.com/Witchfinder-Magical-Empires-Sarah-Hoyt-ebook/dp/B00JHNZXZS\"><b>WITCHFINDER</b></a> for the Lion’s Den. And speaking of book reviews, Toni Mascaro has activated the Castalia House blog with<a href=\"http://www.castaliahouse.com/review-the-lost-fleet-series-by-jack-campbell/\"> a review of The Lost Fleet series</a> by Jack Campbell.</i></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://sarahahoyt.com/wp-content/uploads/witchfindercoverfinal1-187x300.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://sarahahoyt.com/wp-content/uploads/witchfindercoverfinal1-187x300.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://sarahahoyt.com/wp-content/uploads/witchfindercoverfinal1-187x300.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Like the title character, I didn’t quite realize what I had first stumbled into when I offered to review <i>WITCHFINDER</i>, written by Sarah A. Hoyt. The blurb gave me the impression of multiverse derring-do — sort of a magical fantasy version of Star Gate. Although I’ve enjoyed a rant or seven on her blog, I had yet to read any of Sarah Hoyt’s published writing, so I thought I’d take the opportunity to introduce myself to her work. It was only afterward that I learned two additional facts:  (1) it had been written to appeal to romance readers, and (2) the book originated as a semi-serious chapter-a-week project on the author’s blog.</p><p>Now, being a horridly privileged cismale, I am not sure I am qualified to judge a romance’s quality. The elements that I’ve come to associate with fantasy romance are definitely all there:  ongoing “tension” in the form of repeatedly noting attraction but ignoring it for the nonce, sexually aberrant secondary characters, wereseals (in effect), inter-species love, and a proliferation of the subsequent half-breed spawn. I cannot tell you how effectively these might have been wielded in order to turn on the intended audience, but I can say that, surprisingly, I wasn’t turned off. I suppose I should clarify that there’s no steamy sex scenes, nor is any of this treated in a way I’d be uncomfortable to allowing my own young adult to read it. (Caveat: there’s a lot of buggery afoot.)</p><p><b>Prose (4/10):</b> Here the novel suffers because of its origin. Written as a weekly blog post, the standard of writing is about as one would expect for a blog post. Presumably written with a quick once-over before hitting “submit,” some sentences end up convoluted and confusing not for any imitation of the stilted regency style (the style itself is very modern in its simplicity) but for the need of some additional drafting. The effect of its origin also goes beyond the occasional typos and broken sentences that have slipped through to jar the reader:  the overall pacing and structure also stutters a bit. This means some chapters feel just a bit too rushed, and one or two were clearly a week in which the author didn’t have much time but had to get <i>something </i>up. A stronger edit could have really tightened this novel and make it run at a good clip, in my opinion. For all this, it is not all so bad to be very bothersome, and I might have given the prose a higher score if it were not for all the darn telling (as opposed to showing) that occurs, particularly when it came to the operation of magic and the abilities of the title character.</p><p><b>Plot (7/10):</b> The plot is amazingly coherent for a story put together piecemeal over a couple of years. It has depth and goes in completely unforeseen directions without feeling disjointed. The predictable reveals set the reader up for the true twists and unexpected reveals further down the line. The reader clearly recognizes that the kingdom is at stake long before the characters catch up, but then the author surprises the reader with the actual purpose of the conspiracy. All loose ends then tie up rather nicely.</p><p><b>Characters (8/10):</b> Unsurprisingly, according to its genre (as per our host’s explanation), the novel’s strongest element is its characters. One of the book’s reviewers on Amazon notes that the characters start as stereotypes of regency fiction and then flesh out into new directions, and I agree with that assessment. Hoyt’s talent really shines in the way that she allows the reader to get to know the characters slowly, presenting false impressions and misconceptions, and then turning them on their head to show the human underneath. In fact, it is the humanity of the characters that really impresses — they all have believable flaws and struggles — particularly since not all of them are completely human. I enjoyed watching Hoyt lift the veil on this or that character’s actions to reveal the understandable motivations beneath.</p><p><b>Ideas (6/10):</b> Three ideas are at work here:  the multiverse, fairy tale magic, and duty. Hoyt ably uses the multiverse concept to suit her purposes, and she also takes the opportunity to make some historical reference jokes. The take on magic is a bit foggy; I personally prefer to understand the rules of magic within a given universe, but these are never clearly explained. A recurring motif in describing the working of magic is the manipulation of the threads that make the tapestry of reality. The ultimate result is that, instead of taking the fantastic and making it seem believable, Hoyt takes the believable (characters) and then dumps it into a tableau of the fantastic. I assume, given the fairy tale theme, that this was intentional; it ends up feeling very much like the magic in fairy tales. Finally, the theme of duty resonates throughout, and the way the author uses the theme to mold the character’s decisions struck me enough to bump up this category’s score. Instead of denigrating duty as just oppressive and foolish, the burden and sometimes-tragedy of duty is acknowledged while still emphasizing and respecting its importance. This treatment of duty has become rare enough that it’s slightly jarring in the same way that the novel’s reasonable and respectful treatment of the sexes and regency customs (in a romance!) also feels slightly odd, but refreshing.</p><p><b>Overall (6/10): </b>I enjoyed reading WITCHFINDER, and might give it<br> to a female friend who likes regency or fantasy romance, but probably<br> would not buy it for myself.</br></br></p><p><b>Sample text: </b><i>“Now, Duke,” Gabriel Penn said, very mildly, but in a tone of worried distraction. He made as though to take a step sideways to pull his companion [Marlon] out of the dirt, or perhaps to succor him, but Seraphim [the Duke] held him fast.</i></p><p>“No, don’t you go trying to cajole me. You know what coils this creature embroiled you in, and you know he can only bring you dishonor and grief. Even if he captured you by dishonorable means, you should know–”</p><p>Gabriel Penn’s eyes flashed with a look not unlike Seraphim’s own when animated with near-uncontrollable fury, and for a moment he showed his teeth, pressed close together. Nell thought he was about to slug the Duke, and for just a second, without thinking, moved to step between them. Then she checked herself. Even on Earth, stepping between two men about to engage in a slugging match was perfectly stupid. But, stepping between two men from Britannia about to engage in a slugging match might be crazier. Not only would they slug it out around or over her, but they would also hold each other responsible for causing her to step in. Their rules of chivalry were complicated, but that one was obvious.</p><p>As she paused, Gabriel reached out and got hold of both of the duke’s arms above the elbow, “Your Grace, you bonehead, listen to me: Marlon Elfborn did not capture me. I went to him to ask for help when I had nowhere else to go.”</p><p>“Well,” Seraphim said, struggling to pull his arms away from his brother’s gripping fingers. “that only proves you’re not competent to run your own affairs. Furthermore–”</p><p>“Yes, I know, furthermore, he interrupted my education, raised the dead and deflowered the family goat. Give over Seraphim, you fool, do. Stop your vendetta and listen to me.”</p><p>“He deflowered what?” Seraphim said, stopping mid-shout and frowning.</p><p>A dark-red blush climbed Gabriel’s cheeks. His eyes darted at Nell, and he actually attempted to bow, which went to show that the training of Britannia men was quite past rationality or sanity even. “I beg your pardon Miss Felix…”</p></div>",
  "content_text": "The Bandit reviews Sarah Hoyt’s\nWITCHFINDER\nfor the Lion’s Den. And speaking of book reviews, Toni Mascaro has activated the Castalia House blog with\na review of The Lost Fleet series\nby Jack Campbell.\nLike the title character, I didn’t quite realize what I had first stumbled into when I offered to review\nWITCHFINDER\n, written by Sarah A. Hoyt. The blurb gave me the impression of multiverse derring-do — sort of a magical fantasy version of Star Gate. Although I’ve enjoyed a rant or seven on her blog, I had yet to read any of Sarah Hoyt’s published writing, so I thought I’d take the opportunity to introduce myself to her work. It was only afterward that I learned two additional facts:  (1) it had been written to appeal to romance readers, and (2) the book originated as a semi-serious chapter-a-week project on the author’s blog.\nNow, being a horridly privileged cismale, I am not sure I am qualified to judge a romance’s quality. The elements that I’ve come to associate with fantasy romance are definitely all there:  ongoing “tension” in the form of repeatedly noting attraction but ignoring it for the nonce, sexually aberrant secondary characters, wereseals (in effect), inter-species love, and a proliferation of the subsequent half-breed spawn. I cannot tell you how effectively these might have been wielded in order to turn on the intended audience, but I can say that, surprisingly, I wasn’t turned off. I suppose I should clarify that there’s no steamy sex scenes, nor is any of this treated in a way I’d be uncomfortable to allowing my own young adult to read it. (Caveat: there’s a lot of buggery afoot.)\nProse (4/10):\nHere the novel suffers because of its origin. Written as a weekly blog post, the standard of writing is about as one would expect for a blog post. Presumably written with a quick once-over before hitting “submit,” some sentences end up convoluted and confusing not for any imitation of the stilted regency style (the style itself is very modern in its simplicity) but for the need of some additional drafting. The effect of its origin also goes beyond the occasional typos and broken sentences that have slipped through to jar the reader:  the overall pacing and structure also stutters a bit. This means some chapters feel just a bit too rushed, and one or two were clearly a week in which the author didn’t have much time but had to get\nsomething\nup. A stronger edit could have really tightened this novel and make it run at a good clip, in my opinion. For all this, it is not all so bad to be very bothersome, and I might have given the prose a higher score if it were not for all the darn telling (as opposed to showing) that occurs, particularly when it came to the operation of magic and the abilities of the title character.\nPlot (7/10):\nThe plot is amazingly coherent for a story put together piecemeal over a couple of years. It has depth and goes in completely unforeseen directions without feeling disjointed. The predictable reveals set the reader up for the true twists and unexpected reveals further down the line. The reader clearly recognizes that the kingdom is at stake long before the characters catch up, but then the author surprises the reader with the actual purpose of the conspiracy. All loose ends then tie up rather nicely.\nCharacters (8/10):\nUnsurprisingly, according to its genre (as per our host’s explanation), the novel’s strongest element is its characters. One of the book’s reviewers on Amazon notes that the characters start as stereotypes of regency fiction and then flesh out into new directions, and I agree with that assessment. Hoyt’s talent really shines in the way that she allows the reader to get to know the characters slowly, presenting false impressions and misconceptions, and then turning them on their head to show the human underneath. In fact, it is the humanity of the characters that really impresses — they all have believable flaws and struggles — particularly since not all of them are completely human. I enjoyed watching Hoyt lift the veil on this or that character’s actions to reveal the understandable motivations beneath.\nIdeas (6/10):\nThree ideas are at work here:  the multiverse, fairy tale magic, and duty. Hoyt ably uses the multiverse concept to suit her purposes, and she also takes the opportunity to make some historical reference jokes. The take on magic is a bit foggy; I personally prefer to understand the rules of magic within a given universe, but these are never clearly explained. A recurring motif in describing the working of magic is the manipulation of the threads that make the tapestry of reality. The ultimate result is that, instead of taking the fantastic and making it seem believable, Hoyt takes the believable (characters) and then dumps it into a tableau of the fantastic. I assume, given the fairy tale theme, that this was intentional; it ends up feeling very much like the magic in fairy tales. Finally, the theme of duty resonates throughout, and the way the author uses the theme to mold the character’s decisions struck me enough to bump up this category’s score. Instead of denigrating duty as just oppressive and foolish, the burden and sometimes-tragedy of duty is acknowledged while still emphasizing and respecting its importance. This treatment of duty has become rare enough that it’s slightly jarring in the same way that the novel’s reasonable and respectful treatment of the sexes and regency customs (in a romance!) also feels slightly odd, but refreshing.\nOverall (6/10):\nI enjoyed reading WITCHFINDER, and might give it\nto a female friend who likes regency or fantasy romance, but probably\nwould not buy it for myself.\nSample text:\n“Now, Duke,” Gabriel Penn said, very mildly, but in a tone of worried distraction. He made as though to take a step sideways to pull his companion [Marlon] out of the dirt, or perhaps to succor him, but Seraphim [the Duke] held him fast.\n“No, don’t you go trying to cajole me. You know what coils this creature embroiled you in, and you know he can only bring you dishonor and grief. Even if he captured you by dishonorable means, you should know–”\nGabriel Penn’s eyes flashed with a look not unlike Seraphim’s own when animated with near-uncontrollable fury, and for a moment he showed his teeth, pressed close together. Nell thought he was about to slug the Duke, and for just a second, without thinking, moved to step between them. Then she checked herself. Even on Earth, stepping between two men about to engage in a slugging match was perfectly stupid. But, stepping between two men from Britannia about to engage in a slugging match might be crazier. Not only would they slug it out around or over her, but they would also hold each other responsible for causing her to step in. Their rules of chivalry were complicated, but that one was obvious.\nAs she paused, Gabriel reached out and got hold of both of the duke’s arms above the elbow, “Your Grace, you bonehead, listen to me: Marlon Elfborn did not capture me. I went to him to ask for help when I had nowhere else to go.”\n“Well,” Seraphim said, struggling to pull his arms away from his brother’s gripping fingers. “that only proves you’re not competent to run your own affairs. Furthermore–”\n“Yes, I know, furthermore, he interrupted my education, raised the dead and deflowered the family goat. Give over Seraphim, you fool, do. Stop your vendetta and listen to me.”\n“He deflowered what?” Seraphim said, stopping mid-shout and frowning.\nA dark-red blush climbed Gabriel’s cheeks. His eyes darted at Nell, and he actually attempted to bow, which went to show that the training of Britannia men was quite past rationality or sanity even. “I beg your pardon Miss Felix…”",
  "tags": [
    "Book Review",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-18T16:00:00+00:00"
}