{
  "url": "https://voxday.net/2014/04/10/lions-den-ix-sarah-hoy/",
  "scraped_at": "2025-12-15T16:52:19.535271",
  "title": "Lion’s Den IX: Sarah Hoyt",
  "date_display": "April 10, 2014",
  "date_iso": "2014-04-10T08:28:00+00:00",
  "date_from_url": "2014-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://sarahahoyt.com/wp-content/uploads/witchfindercoverfinal1-187x300.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://sarahahoyt.com/wp-content/uploads/witchfindercoverfinal1-187x300.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://sarahahoyt.com/wp-content/uploads/witchfindercoverfinal1-187x300.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Sarah Hoyt is dipping her toe into the cold, but liberating waters of independent publishing with her book <i><b><a href=\"http://www.amazon.com/Witchfinder-Magical-Empires-Sarah-Hoyt-ebook/dp/B00JHNZXZS\">WITCHFINDER</a></b></i>. She describes it thusly:</p><p><i>In Avalon, where the world runs on magic, the king of Britannia appoints a witchfinder to rescue unfortunates with magical power from lands where magic is a capital crime. Or he did. But after the royal princess was kidnapped from her cradle twenty years ago, all travel to other universes has been forbidden, and the position of witchfinder abolished. Seraphim Ainsling, Duke of Darkwater, son of the last witchfinder, breaks the edict. He can’t simply let people die for lack of rescue. His stubborn compassion will bring him trouble and disgrace, turmoil and danger — and maybe, just maybe, the greatest reward of all.</i></p><p><b>Sarah adds:</b> This book was very strange. First, it started as an almost joke.  A friend<br> suggested we collaborate on it because, hey, people liked regency fantasies,<br> and we wrote a proposal (which was nothing like this.  For one, it was for a<br> much shorter book) and we sent it to my agent.  My agent first balked at<br> sending it out because “you have a woman from present-day Earth and someone<br> in the regency.  No one will know what to do with it.”  (Apparently she<br> never read things like Diana Wynne Jones Chrestomanci series or the ton of<br> time travel romance books that were so popular in the eighties.  Okay, truth<br> be told, I never read those either, but I DID hear of them.  Impossible not<br> to.)  Then she sent it out under pressure (or at least she said she had) and<br> the rejections agreed with her opinion. So, this book went in the drawer with about fifteen others that never sold<br> in proposal.</br></br></br></br></br></br></br></br></br></br></br></p><p>Two and a half years ago when I started blogging every day (and wasn’t out<br> politically yet) my biggest issue was what to blog about.  (It still is,<br> because there isn’t something that fascinating to me every day.)  So I<br> decided to make Fridays easier by posting a chapter of a novel every Friday. <br> Why Witchfinder?  No idea.  I think it more or less was the first one to<br> come up.  Also, it was definitely not a Baen novel, so no problems with<br> upsetting my publisher.</br></br></br></br></br></br></p><p>I wrote to my friend, asked her if she’d send me a quit-claim on the novel.<br> She did.  I started posting it.  I thought it would be a shortish novel and<br> never come out officially, but I gave people the option of donating $6 and<br> when it was done, I’d edit it and send them an ebook.  I made $5k.  While<br> it’s not the advance I normally get for science fiction and fantasy, it was<br> the advance I got from Prime Crime for mystery.  (SF/F pay me better.)<br> Also, when I sent it out to be edited, my three editors who are two trusted<br> friends and my husband (yes, I know typos escaped.  Part of it was the way<br> it was written.  You should have seen it before) all thought I should<br> publish it.  Which led to my publishing it.</br></br></br></br></br></br></br></br></br></p><p>But structure/plot/possibly typo-ing it all feels very odd to me.  If you’d<br> asked me if I could write a novel a chapter a week over two years, I’d have<br> said you were nuts.  And yet, when I read it (other than continuity typos,<br> like people changing name, which I was still fixing at the last minute) it<br> read as well (or as badly, depending on your opinion!) as any other of my<br> works. Except perhaps the world building got WAY more convoluted than it<br> normally does, because I world build in sudden fits of brilliance and a year<br> and a half is a lot of time for such fits.<br> So, in a way this novel is a first two ways: it’s my first slow-written<br> novel, and my first indie novel.</br></br></br></br></br></br></br></br></br></p><p> <b>VD: </b>If you’re interested in reading WITCHFINDER, writing a review, and sending it to me for posting here, please send me an email with WITCHFINDER in the subject. And if you have any questions for Sarah about her book, please post them in the comments here.</p><p>I’m also looking for 10 launch reviewers for both a)  AWAKE IN THE NIGHT LANDS and b) TRANSHUMAN OR SUBHUMAN. For the former, you’ll need to be able to read it and post a review on Amazon over the coming weekend. Email me with either AWAKE or TRANSHUMAN in the subject, but not both, please.</p></div>",
  "content_text": "Sarah Hoyt is dipping her toe into the cold, but liberating waters of independent publishing with her book\nWITCHFINDER\n. She describes it thusly:\nIn Avalon, where the world runs on magic, the king of Britannia appoints a witchfinder to rescue unfortunates with magical power from lands where magic is a capital crime. Or he did. But after the royal princess was kidnapped from her cradle twenty years ago, all travel to other universes has been forbidden, and the position of witchfinder abolished. Seraphim Ainsling, Duke of Darkwater, son of the last witchfinder, breaks the edict. He can’t simply let people die for lack of rescue. His stubborn compassion will bring him trouble and disgrace, turmoil and danger — and maybe, just maybe, the greatest reward of all.\nSarah adds:\nThis book was very strange. First, it started as an almost joke.  A friend\nsuggested we collaborate on it because, hey, people liked regency fantasies,\nand we wrote a proposal (which was nothing like this.  For one, it was for a\nmuch shorter book) and we sent it to my agent.  My agent first balked at\nsending it out because “you have a woman from present-day Earth and someone\nin the regency.  No one will know what to do with it.”  (Apparently she\nnever read things like Diana Wynne Jones Chrestomanci series or the ton of\ntime travel romance books that were so popular in the eighties.  Okay, truth\nbe told, I never read those either, but I DID hear of them.  Impossible not\nto.)  Then she sent it out under pressure (or at least she said she had) and\nthe rejections agreed with her opinion. So, this book went in the drawer with about fifteen others that never sold\nin proposal.\nTwo and a half years ago when I started blogging every day (and wasn’t out\npolitically yet) my biggest issue was what to blog about.  (It still is,\nbecause there isn’t something that fascinating to me every day.)  So I\ndecided to make Fridays easier by posting a chapter of a novel every Friday.\nWhy Witchfinder?  No idea.  I think it more or less was the first one to\ncome up.  Also, it was definitely not a Baen novel, so no problems with\nupsetting my publisher.\nI wrote to my friend, asked her if she’d send me a quit-claim on the novel.\nShe did.  I started posting it.  I thought it would be a shortish novel and\nnever come out officially, but I gave people the option of donating $6 and\nwhen it was done, I’d edit it and send them an ebook.  I made $5k.  While\nit’s not the advance I normally get for science fiction and fantasy, it was\nthe advance I got from Prime Crime for mystery.  (SF/F pay me better.)\nAlso, when I sent it out to be edited, my three editors who are two trusted\nfriends and my husband (yes, I know typos escaped.  Part of it was the way\nit was written.  You should have seen it before) all thought I should\npublish it.  Which led to my publishing it.\nBut structure/plot/possibly typo-ing it all feels very odd to me.  If you’d\nasked me if I could write a novel a chapter a week over two years, I’d have\nsaid you were nuts.  And yet, when I read it (other than continuity typos,\nlike people changing name, which I was still fixing at the last minute) it\nread as well (or as badly, depending on your opinion!) as any other of my\nworks. Except perhaps the world building got WAY more convoluted than it\nnormally does, because I world build in sudden fits of brilliance and a year\nand a half is a lot of time for such fits.\nSo, in a way this novel is a first two ways: it’s my first slow-written\nnovel, and my first indie novel.\nVD:\nIf you’re interested in reading WITCHFINDER, writing a review, and sending it to me for posting here, please send me an email with WITCHFINDER in the subject. And if you have any questions for Sarah about her book, please post them in the comments here.\nI’m also looking for 10 launch reviewers for both a)  AWAKE IN THE NIGHT LANDS and b) TRANSHUMAN OR SUBHUMAN. For the former, you’ll need to be able to read it and post a review on Amazon over the coming weekend. Email me with either AWAKE or TRANSHUMAN in the subject, but not both, please.",
  "tags": [
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-10T07:28:00+00:00"
}