{
  "url": "https://voxday.net/2014/04/11/live-by-punch-die-by-punc/",
  "scraped_at": "2025-12-15T16:52:28.851520",
  "title": "Live by the punch, die by the punch",
  "date_display": "April 11, 2014",
  "date_iso": "2014-04-11T17:00:00+00:00",
  "date_from_url": "2014-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure which is more amusing, this young woman whining about her well-merited concussion or the people who are shocked that so many people aren’t sympathetic to a poor little woman who didn’t do anything except <a href=\"http://www.news24.com/Multimedia/Video/SouthAfrica/CCTV-footage-of-the-UCT-rugby-player-punching-a-girl-emerges-20140411\">punch a rugby player in the face</a> in the middle of a brawl.</p><p>Everyone with a warrior woman fetish should watch the video, repeatedly, until they get it through their heads that women simply cannot fight men. Too small, too weak, too slow. See the ragdoll-flopping and the way she goes limp? That’s from a single punch from a college-age man she assaulted who didn’t see her attack coming and clearly isn’t a trained fighter. She was lucky she only got a concussion; if he’d aimed a little lower, he’d probably have broken her jaw.</p><p>(Old martial arts trick: don’t aim for the cheekbones on a rear hand cross, aim for the jaw. It’s much harder to crush a cheekbone than to knock the jaw out of alignment. It’s instant incapacitation. Also, uppercuts work better to daze the opponent.)</p><p>This comment was the best: <i>“I must be from a different era. I don’t hit women and I don’t like seeing<br> women being hit. Amazingly so many comments support the guy. Sick<br> world.”</br></br></i></p><p>I, on the other hand, very much enjoy seeing people who initiate violence smacked around, whether they are men or women. Although it is probably funnier when it is women getting flattened, because they seem to think that they have the right to initiate violence without suffering any consequences for it.</p><p>The thing is, it is very, very easy to avoid getting punched in the face. A) Don’t mouth off to anyone bigger than you are. B) Don’t hit anyone. If you are reading this, you are probably aware that I am not the nicest or most easygoing person in the world, but I have never, in my entire life, had anyone hit me back for anything I did or said. There is a very good reason for this: I am civil to strangers and I do not initiate the use of violence.</p><p>That doesn’t mean I won’t wash my hands in your blood if you hand me an engraved invitation by assaulting me, or that I won’t enjoy the sound of bones cracking and the rush of pure adrenaline that physical altercations provide… but I will not start anything. I may even turn the other cheek, if I am feeling particularly inspired. But that’s something to keep in mind. It is simply impossible to know if that quiet, polite guy in the corner, or that gentle giant sitting at the bar, is the sort of adrenaline junkie who happens to get off on the occasional burst of violence.</p><p>What most women don’t understand, either because they fear violence or don’t take it seriously, is that for many, if not most, men, it is a RUSH.</p></div>",
  "content_text": "I’m not sure which is more amusing, this young woman whining about her well-merited concussion or the people who are shocked that so many people aren’t sympathetic to a poor little woman who didn’t do anything except\npunch a rugby player in the face\nin the middle of a brawl.\nEveryone with a warrior woman fetish should watch the video, repeatedly, until they get it through their heads that women simply cannot fight men. Too small, too weak, too slow. See the ragdoll-flopping and the way she goes limp? That’s from a single punch from a college-age man she assaulted who didn’t see her attack coming and clearly isn’t a trained fighter. She was lucky she only got a concussion; if he’d aimed a little lower, he’d probably have broken her jaw.\n(Old martial arts trick: don’t aim for the cheekbones on a rear hand cross, aim for the jaw. It’s much harder to crush a cheekbone than to knock the jaw out of alignment. It’s instant incapacitation. Also, uppercuts work better to daze the opponent.)\nThis comment was the best:\n“I must be from a different era. I don’t hit women and I don’t like seeing\nwomen being hit. Amazingly so many comments support the guy. Sick\nworld.”\nI, on the other hand, very much enjoy seeing people who initiate violence smacked around, whether they are men or women. Although it is probably funnier when it is women getting flattened, because they seem to think that they have the right to initiate violence without suffering any consequences for it.\nThe thing is, it is very, very easy to avoid getting punched in the face. A) Don’t mouth off to anyone bigger than you are. B) Don’t hit anyone. If you are reading this, you are probably aware that I am not the nicest or most easygoing person in the world, but I have never, in my entire life, had anyone hit me back for anything I did or said. There is a very good reason for this: I am civil to strangers and I do not initiate the use of violence.\nThat doesn’t mean I won’t wash my hands in your blood if you hand me an engraved invitation by assaulting me, or that I won’t enjoy the sound of bones cracking and the rush of pure adrenaline that physical altercations provide… but I will not start anything. I may even turn the other cheek, if I am feeling particularly inspired. But that’s something to keep in mind. It is simply impossible to know if that quiet, polite guy in the corner, or that gentle giant sitting at the bar, is the sort of adrenaline junkie who happens to get off on the occasional burst of violence.\nWhat most women don’t understand, either because they fear violence or don’t take it seriously, is that for many, if not most, men, it is a RUSH.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-11T16:00:00+00:00"
}