{
  "url": "https://voxday.net/2014/04/02/mailvox-disqualification-game/",
  "scraped_at": "2025-12-15T16:51:29.386333",
  "title": "Mailvox: the disqualification game",
  "date_display": "April 2, 2014",
  "date_iso": "2014-04-02T08:48:00+00:00",
  "date_from_url": "2014-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stuck in the 1990s, Truth seems to think that successfully tarring someone with “raciss” is still a form of effective disqualification as he attempts to convince Tom Kratman to denounce me for my crimes of BadThink:</p><blockquote class=\"tr_bq\"><p> And how about if the claim of “ignorant half-savage” is based on<br> Vox’s tribe-to-society ratio or whatever it is he calls it?  Would you<br> consider that genetic and therefore racist? Because as I recall, he<br> professes that blacks haven’t had enough time to adapt from savage to<br> social, generationally speaking. Which, is to say, he believes savagery<br> runs too thick in their genes. Would you consider that racist Mr.<br> Kratman?</br></br></br></br></br></br></p><p>I feel like your character is a higher quality than that. Of course, I have only the slightest evidence for that feeling. But I’d like it to be true. I’d love to be able to read a local sci-fi author who’s published through a major outlet. The only other I know of in this area code is Rod Belcher and I enjoyed his work. I’d probably enjoy yours. I’m just not one of those folks who can separate art and artist.</p></blockquote><p>Disqualify… disqualify… disqualify. I find it amusing that Truth appears to think Tom<br> is sufficiently naive to fall for the rabbiting. But neither Tom nor I care what a Random Internet Rabbit defines as “racist”. By Truth’s lights, Tom is already disqualified because he admitted to being scientifically literate about genetic science.</br></p><p>Truth then addressed me:</p><blockquote class=\"tr_bq\"><p> I notice Mr. Kratman didn’t include, “calling black people ignorant half-savages is not racist.” What say you, Vox? Cultural or genetic marker? In the past you’ve said genetic. If not, correct me.</p></blockquote><p>I will first ask a question of my own, which Truth will answer if he wishes to participate in the discussion: Truth, do you assert that there is not a single black individual in the U.S.A. who is an ignorant half-savage?</p><p>Now, in answer to Truth’s question, and contra Tom’s position, my observation is that you cannot possibly separate culture and genetics. It is logical to conclude, and it has been repeatedly observed, that cultural differences are derived from genetics. A society with an average 85 IQ will inevitably feature a very different culture than a society with an average 115 IQ. Among other things, the lower IQ culture will have shorter time preferences and its social mores will feature less consideration of the logical consequences of an individual’s actions. This is why secular progressives tend to equate intelligence with higher forms of civilization.</p><p>But it is also logical to conclude, and it has been also been observed, that genetic differences are derived from culture. A society where women have children at an average age of 18 will have genetically superior children to those produced in a society in which women have children at an average age of 35. Even something as purely cultural as the average number of children a woman bears will have tremendous genetic implications; there is reason to believe that some of the differences between r/selected and K/selected are genetic, and those genetic differences are, in part, derived from the culture that produces them.</p><p>(It must be made clear that this is NOT related to TENS in any way. We’re not dealing with the differences between species here, but intra-species differences for the most part and partial sub-species differences at most. Nor is most of the selection naturally imposed.)</p><p>In any event, the trivial thinkers who look at my time-to-civilization hypothesis and focus on its racial implications aren’t seeing its true scope, much less grasping the potential horror of it. The much more serious aspect of the hypothesis is its implication that civilization is the consequence of a centuries-long eugenic program that eventually, and inevitably, transforms itself into a dysgenic program. If the hypothesis holds, this would not only explode, once and for all, the secular conceit of linear progress, but would provide an elegant explanation for the cyclical rise and fall of civilizations as well as the observed inability of Africans to collectively reach a self-sustainable civilized standard despite the best efforts of well-intentioned individuals of various races for more than 150 years.</p><p>And if the fact that I occasionally contemplate such things offends you to the point that you don’t wish to read anything that I write or edit or publish, well, that leads to the obvious question: what in the name of the 1,200 sister-wives of Shaka Zulu are you doing here? Especially in light of Truth’s self-admitted anti-intellectual outlook:</p><blockquote class=\"tr_bq\"><p> I can deal with the economics, military policies, and other right wing stuff, but dismissing an entire race of humans as ignorant half-savages is beyond my threshold. The history of such thought has given rise to countless atrocities.</p></blockquote><p>First, Truth’s personal thresholds do not dictate objective reality. The only thing that matters is if the observation is true or not. In this particular case, there is a considerable quantity of evidence supporting both the singular example provided, as well as the current state of civilizational progress of the human sub-species concerned. Second, we are discussing the collective mean here. In any group with more than two individuals there will obviously be those who exceed the mean, but that is totally irrelevant in this context.</p><p>As for the appeal to historical atrocity, has it never occurred to Truth that it is reality that dictated those atrocities and not the mere observation of the reality? He is assigning causal value to a consequence. If the savage behavior of a group of savages leads another group to wipe them out, it is not the second group’s belief that the first group was savage that was the causal factor, but rather, the fact that first group was a) savage, and b) aggressive.</p><p>To give one example, Julius Caesar would never have killed one million Gauls and enslaved another million had Gaius Marius not been forced to defend Rome from repeated invasions from the north 50 years prior.</p></div>",
  "content_text": "Stuck in the 1990s, Truth seems to think that successfully tarring someone with “raciss” is still a form of effective disqualification as he attempts to convince Tom Kratman to denounce me for my crimes of BadThink:\nAnd how about if the claim of “ignorant half-savage” is based on\nVox’s tribe-to-society ratio or whatever it is he calls it?  Would you\nconsider that genetic and therefore racist? Because as I recall, he\nprofesses that blacks haven’t had enough time to adapt from savage to\nsocial, generationally speaking. Which, is to say, he believes savagery\nruns too thick in their genes. Would you consider that racist Mr.\nKratman?\nI feel like your character is a higher quality than that. Of course, I have only the slightest evidence for that feeling. But I’d like it to be true. I’d love to be able to read a local sci-fi author who’s published through a major outlet. The only other I know of in this area code is Rod Belcher and I enjoyed his work. I’d probably enjoy yours. I’m just not one of those folks who can separate art and artist.\nDisqualify… disqualify… disqualify. I find it amusing that Truth appears to think Tom\nis sufficiently naive to fall for the rabbiting. But neither Tom nor I care what a Random Internet Rabbit defines as “racist”. By Truth’s lights, Tom is already disqualified because he admitted to being scientifically literate about genetic science.\nTruth then addressed me:\nI notice Mr. Kratman didn’t include, “calling black people ignorant half-savages is not racist.” What say you, Vox? Cultural or genetic marker? In the past you’ve said genetic. If not, correct me.\nI will first ask a question of my own, which Truth will answer if he wishes to participate in the discussion: Truth, do you assert that there is not a single black individual in the U.S.A. who is an ignorant half-savage?\nNow, in answer to Truth’s question, and contra Tom’s position, my observation is that you cannot possibly separate culture and genetics. It is logical to conclude, and it has been repeatedly observed, that cultural differences are derived from genetics. A society with an average 85 IQ will inevitably feature a very different culture than a society with an average 115 IQ. Among other things, the lower IQ culture will have shorter time preferences and its social mores will feature less consideration of the logical consequences of an individual’s actions. This is why secular progressives tend to equate intelligence with higher forms of civilization.\nBut it is also logical to conclude, and it has been also been observed, that genetic differences are derived from culture. A society where women have children at an average age of 18 will have genetically superior children to those produced in a society in which women have children at an average age of 35. Even something as purely cultural as the average number of children a woman bears will have tremendous genetic implications; there is reason to believe that some of the differences between r/selected and K/selected are genetic, and those genetic differences are, in part, derived from the culture that produces them.\n(It must be made clear that this is NOT related to TENS in any way. We’re not dealing with the differences between species here, but intra-species differences for the most part and partial sub-species differences at most. Nor is most of the selection naturally imposed.)\nIn any event, the trivial thinkers who look at my time-to-civilization hypothesis and focus on its racial implications aren’t seeing its true scope, much less grasping the potential horror of it. The much more serious aspect of the hypothesis is its implication that civilization is the consequence of a centuries-long eugenic program that eventually, and inevitably, transforms itself into a dysgenic program. If the hypothesis holds, this would not only explode, once and for all, the secular conceit of linear progress, but would provide an elegant explanation for the cyclical rise and fall of civilizations as well as the observed inability of Africans to collectively reach a self-sustainable civilized standard despite the best efforts of well-intentioned individuals of various races for more than 150 years.\nAnd if the fact that I occasionally contemplate such things offends you to the point that you don’t wish to read anything that I write or edit or publish, well, that leads to the obvious question: what in the name of the 1,200 sister-wives of Shaka Zulu are you doing here? Especially in light of Truth’s self-admitted anti-intellectual outlook:\nI can deal with the economics, military policies, and other right wing stuff, but dismissing an entire race of humans as ignorant half-savages is beyond my threshold. The history of such thought has given rise to countless atrocities.\nFirst, Truth’s personal thresholds do not dictate objective reality. The only thing that matters is if the observation is true or not. In this particular case, there is a considerable quantity of evidence supporting both the singular example provided, as well as the current state of civilizational progress of the human sub-species concerned. Second, we are discussing the collective mean here. In any group with more than two individuals there will obviously be those who exceed the mean, but that is totally irrelevant in this context.\nAs for the appeal to historical atrocity, has it never occurred to Truth that it is reality that dictated those atrocities and not the mere observation of the reality? He is assigning causal value to a consequence. If the savage behavior of a group of savages leads another group to wipe them out, it is not the second group’s belief that the first group was savage that was the causal factor, but rather, the fact that first group was a) savage, and b) aggressive.\nTo give one example, Julius Caesar would never have killed one million Gauls and enslaved another million had Gaius Marius not been forced to defend Rome from repeated invasions from the north 50 years prior.",
  "tags": [
    "decline and fall",
    "history",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-02T07:48:00+00:00"
}