{
  "url": "https://voxday.net/2014/04/29/mailvox-on-surviving-witchhun/",
  "scraped_at": "2025-12-16T12:12:54.415422",
  "title": "Mailvox: on surviving a witchhunt",
  "date_display": "April 29, 2014",
  "date_iso": "2014-04-29T13:35:00+00:00",
  "date_from_url": "2014-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was asked to have a look at <a href=\"http://www.rooshvforum.com/thread-35498.html\">this question on Roosh’s forum</a>, as it is something that more and more people are likely to face in the near future:</p><blockquote class=\"tr_bq\"><p> Witchhunts are becoming more and more common. A full list of people purged from their jobs for their political or social views can be found <a href=\"http://handleshaus.wordpress.com/2013/12/26/bullied-and-badgered-pressured-and-purged/\">here</a>. The most recent and famous is the Modzilla CEO. Now it looks like another tech startup founder is about to go.</p><p>I’m considering putting together an article for ROK on surviving witchhunts, but before I do, I’d like to see how the collective wisdom of the forum would respond to this situation.</p><p>Imagine your RVF account is connected to your real name. A liberal staff writer publishes a viral piece on an unpopular opinion you hold. A former girlfriend spreads a false abuse rumor. An employee part of a protected minority calls you bigoted because you don’t share their politics. The mob realizes you aren’t one of their tribe.</p><p>Whatever the accusation, your off hand comment or personally held view spins into a scandal as cultural elites and twitter mobs call for your resignation. Industry peers begin to distance themselves from you anticipating a purge. What would you do?</p></blockquote><p>As it happened, the tech founder did end up being convinced to fall on his sword. One might well say that I am the wrong man to ask, given that my lifetime membership obviously did not survive the SFWA purge.  (It is listed at number 126 on the list linked above.) On the other hand, having been through the process, perhaps some of my thoughts about it may prove useful.</p><ol><li><b>Recognize that it is happening.</b> In the case of my own purging by SFWA, I was initially caught a little by surprise because my nominal offense was so minor, had previously been committed by literally scores of other members, (including three members of the Board), and carried a specific penalty that had already been applied. It took me nearly a day to realize that they were going to take the inch I had given them and run a marathon with it. By the second day, I knew they intended to expel me at any cost, by any means necessary.</li><li><b>Don’t think that you can reason your way out of it.</b> Most people have the causality backwards. They think the purge is taking place due to whatever it is that they did or said. That’s not the case. It is taking place because of who you are and what you represent to them. The truth is that the faction behind your prospective purge <i>already wanted you out</i> and they are simply using the nominal reason given as an excuse to get rid of you. Despite my long and detailed defense, I never imagined for one second that it would be successful. In presenting it, I had other objectives in mind.</li><li><b>Do not apologize!</b> They will press you hard for an apology and repeatedly imply that if you will just apologize, all will be forgiven. Don’t be fooled! They are simply looking for a public confession that will confirm their accusations, give them PR cover, and provide them with the necessary ammunition to expel you. Apologizing does nothing more than hand them the very weapon they are seeking.</li><li><b>Expose their excesses. </b>Most of the time, these purges are committed at least partially outside the organization’s established rules and forms. You may not be an expert, but some of the people following along will be. Make sure every step in the process, and every piece of communication you receive from them, is publicized. They will pull out all the stops to hide their actions in order to avoid criticism, and in some of the more egregious cases, ridicule. Nine months later, SFWA STILL has not publicly admitted that I was the member expelled by the SFWA Board, and they even filed a DMCA takedown notice against my ISP to hide their accusations against me from public scrutiny. So shine the light of truth on the insects and watch them scurry.</li><li><b>Do not resign!</b> Their real goal is not to formally purge you, but to encourage you to quit on your own. That allows them to publicly wash their hands of it and claim that your decision to leave was not their fault. They will often enlist more reasonable allies to approach you and tell you that it’s not possible for you to continue any more, they will appeal to the good of the organization, and they will go on and on about the importance of an amicable departure. Don’t fall for it. Don’t do their dirty work for them. Make them take the full responsibility for throwing you out, thereby ensuring they have to suffer the long-term consequences of their actions.</li><li><b>Make the rubble bounce.</b> Whether you survive the purge or whether you don’t, observe who has defined himself as ally, enemy, or neutral during the process. The choices will pleasantly surprise you about as often as they disappoint you. Target the enemy at every given opportunity. Benefit your allies at every given opportunity, even if they are the lukest of lukewarm friends. Treat neutrals fairly, assume nothing of them either way, and refrain from judging them or attempting to convince them to take a side. Never forget that it is better to be respected than loved by your allies, and it is better to be feared than respected by your enemies. Your enemies will never love you, so don’t spare a moment’s thought about trying to appease them.</li><li><b>Start nothing, finish everything. </b>Reward your enemies who leave you alone by leaving them in peace. Reward your enemies who insist on continuing hostilities with responses that are disproportionate to their provocations. And never forget, no matter what they do, they cannot touch your mind, they cannot touch your heart, and they cannot touch your soul. Matthew 10:28.</li></ol></div>",
  "content_text": "I was asked to have a look at\nthis question on Roosh’s forum\n, as it is something that more and more people are likely to face in the near future:\nWitchhunts are becoming more and more common. A full list of people purged from their jobs for their political or social views can be found\nhere\n. The most recent and famous is the Modzilla CEO. Now it looks like another tech startup founder is about to go.\nI’m considering putting together an article for ROK on surviving witchhunts, but before I do, I’d like to see how the collective wisdom of the forum would respond to this situation.\nImagine your RVF account is connected to your real name. A liberal staff writer publishes a viral piece on an unpopular opinion you hold. A former girlfriend spreads a false abuse rumor. An employee part of a protected minority calls you bigoted because you don’t share their politics. The mob realizes you aren’t one of their tribe.\nWhatever the accusation, your off hand comment or personally held view spins into a scandal as cultural elites and twitter mobs call for your resignation. Industry peers begin to distance themselves from you anticipating a purge. What would you do?\nAs it happened, the tech founder did end up being convinced to fall on his sword. One might well say that I am the wrong man to ask, given that my lifetime membership obviously did not survive the SFWA purge.  (It is listed at number 126 on the list linked above.) On the other hand, having been through the process, perhaps some of my thoughts about it may prove useful.\nRecognize that it is happening.\nIn the case of my own purging by SFWA, I was initially caught a little by surprise because my nominal offense was so minor, had previously been committed by literally scores of other members, (including three members of the Board), and carried a specific penalty that had already been applied. It took me nearly a day to realize that they were going to take the inch I had given them and run a marathon with it. By the second day, I knew they intended to expel me at any cost, by any means necessary.\nDon’t think that you can reason your way out of it.\nMost people have the causality backwards. They think the purge is taking place due to whatever it is that they did or said. That’s not the case. It is taking place because of who you are and what you represent to them. The truth is that the faction behind your prospective purge\nalready wanted you out\nand they are simply using the nominal reason given as an excuse to get rid of you. Despite my long and detailed defense, I never imagined for one second that it would be successful. In presenting it, I had other objectives in mind.\nDo not apologize!\nThey will press you hard for an apology and repeatedly imply that if you will just apologize, all will be forgiven. Don’t be fooled! They are simply looking for a public confession that will confirm their accusations, give them PR cover, and provide them with the necessary ammunition to expel you. Apologizing does nothing more than hand them the very weapon they are seeking.\nExpose their excesses.\nMost of the time, these purges are committed at least partially outside the organization’s established rules and forms. You may not be an expert, but some of the people following along will be. Make sure every step in the process, and every piece of communication you receive from them, is publicized. They will pull out all the stops to hide their actions in order to avoid criticism, and in some of the more egregious cases, ridicule. Nine months later, SFWA STILL has not publicly admitted that I was the member expelled by the SFWA Board, and they even filed a DMCA takedown notice against my ISP to hide their accusations against me from public scrutiny. So shine the light of truth on the insects and watch them scurry.\nDo not resign!\nTheir real goal is not to formally purge you, but to encourage you to quit on your own. That allows them to publicly wash their hands of it and claim that your decision to leave was not their fault. They will often enlist more reasonable allies to approach you and tell you that it’s not possible for you to continue any more, they will appeal to the good of the organization, and they will go on and on about the importance of an amicable departure. Don’t fall for it. Don’t do their dirty work for them. Make them take the full responsibility for throwing you out, thereby ensuring they have to suffer the long-term consequences of their actions.\nMake the rubble bounce.\nWhether you survive the purge or whether you don’t, observe who has defined himself as ally, enemy, or neutral during the process. The choices will pleasantly surprise you about as often as they disappoint you. Target the enemy at every given opportunity. Benefit your allies at every given opportunity, even if they are the lukest of lukewarm friends. Treat neutrals fairly, assume nothing of them either way, and refrain from judging them or attempting to convince them to take a side. Never forget that it is better to be respected than loved by your allies, and it is better to be feared than respected by your enemies. Your enemies will never love you, so don’t spare a moment’s thought about trying to appease them.\nStart nothing, finish everything.\nReward your enemies who leave you alone by leaving them in peace. Reward your enemies who insist on continuing hostilities with responses that are disproportionate to their provocations. And never forget, no matter what they do, they cannot touch your mind, they cannot touch your heart, and they cannot touch your soul. Matthew 10:28.",
  "tags": [
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-29T12:35:00+00:00"
}