{
  "url": "https://voxday.net/2014/04/26/mailvox-greatest-american-author/",
  "scraped_at": "2025-12-16T12:12:33.099573",
  "title": "Mailvox: The Greatest American Author",
  "date_display": "April 26, 2014",
  "date_iso": "2014-04-26T13:00:00+00:00",
  "date_from_url": "2014-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate poses the question:</p><blockquote class=\"tr_bq\"><p> Faulkner?  Hemingway?  Poe?  Some other? Go. I lean towards Faulkner myself… but I am an inveterate southron rebel.. and so I confess bias.  That doesn’t mean I’m not correct.</p></blockquote><p>I have to admit that I admire Faulkner, for his attitude towards publishers and prizes if nothing else. But I am not especially fond of his work.  Hemingway I find to be considerably overrated, more a product of his self-promotion than anything else. His lean, stripped-down prose was innovative and influential, but I think it has had a seriously deleterious effect on literature. One has only to read John C. Wright to lament the world of rich and expansive prose that we have lost.</p><p>We are all the children of Hemingway and we are the worse off for it.</p><p>I am strongly partial to Edgar Allen Poe, but I am concerned that may be more due to my inclination for the morbid than anything else. Before I cast my vote for him, perhaps we should cast a broader net.</p><p>There is John Updike. No, he is too self-conscious, too inclined towards literary posturing. Everything reads as if he is looking expectantly at the readers and anticipating their approval: “look, Ma, I’s writin’!” John Irving has a way with words, but he wrote essentially the same book over and over, and I found his petty, exaggerated absurdities to be insulting. Saul Bellow is boring and tedious. Philip Roth is perverted, self-absorbed, and tedious.</p><p>There is O. Henry, whose short stories are among the best ever written, but there is more to literary greatness than tight plotting and clever twist endings.</p><p>Neal Stephenson merits being at least mentioned, as I would consider his Reamde to be a legitimate candidate for a Great American Novel. But his grasp of the human condition, to say nothing of his difficulty with endings, is too shaky in comparison with the other greats. Ray Bradbury is the most sentimental American author, and I would argue that <i>Dandelion Wine</i> is the most perfect portrait of the traditional America to which every sane American would like to return, but, like Stephenson, the mere inclusion on the list is sufficient. I would say that Bradbury is the greatest American SF author, however.</p><p>I am an F. Scott Fitzgerald fan, but his work is too little and too light to merit serious consideration. I have not read Thomas Pynchon, and I seriously hope that no one would so foolish as to propose David Foster Wallace with a straight face. Tom Wolfe’s novels have always struck me as cartoons, insightful and observant cartoons, to be sure, but cartoons nevertheless. Kurt Vonnegut is an unfunny clown; I put him below Stephen King. Hell, I’d put him below Stephanie Miller and Laurell K. Hamilton. Jack London might be the quintessentially American writer, but his style was far too limited to merit serious consideration.</p><p>At the end of the day, I don’t see how it is possible to go with anyone but Samuel Clemens, Mark Twain himself. He had the complete package, prose, plot, characters, and commentary on the human condition, in addition to fully representing the American spirit.</p></div>",
  "content_text": "Nate poses the question:\nFaulkner?  Hemingway?  Poe?  Some other? Go. I lean towards Faulkner myself… but I am an inveterate southron rebel.. and so I confess bias.  That doesn’t mean I’m not correct.\nI have to admit that I admire Faulkner, for his attitude towards publishers and prizes if nothing else. But I am not especially fond of his work.  Hemingway I find to be considerably overrated, more a product of his self-promotion than anything else. His lean, stripped-down prose was innovative and influential, but I think it has had a seriously deleterious effect on literature. One has only to read John C. Wright to lament the world of rich and expansive prose that we have lost.\nWe are all the children of Hemingway and we are the worse off for it.\nI am strongly partial to Edgar Allen Poe, but I am concerned that may be more due to my inclination for the morbid than anything else. Before I cast my vote for him, perhaps we should cast a broader net.\nThere is John Updike. No, he is too self-conscious, too inclined towards literary posturing. Everything reads as if he is looking expectantly at the readers and anticipating their approval: “look, Ma, I’s writin’!” John Irving has a way with words, but he wrote essentially the same book over and over, and I found his petty, exaggerated absurdities to be insulting. Saul Bellow is boring and tedious. Philip Roth is perverted, self-absorbed, and tedious.\nThere is O. Henry, whose short stories are among the best ever written, but there is more to literary greatness than tight plotting and clever twist endings.\nNeal Stephenson merits being at least mentioned, as I would consider his Reamde to be a legitimate candidate for a Great American Novel. But his grasp of the human condition, to say nothing of his difficulty with endings, is too shaky in comparison with the other greats. Ray Bradbury is the most sentimental American author, and I would argue that\nDandelion Wine\nis the most perfect portrait of the traditional America to which every sane American would like to return, but, like Stephenson, the mere inclusion on the list is sufficient. I would say that Bradbury is the greatest American SF author, however.\nI am an F. Scott Fitzgerald fan, but his work is too little and too light to merit serious consideration. I have not read Thomas Pynchon, and I seriously hope that no one would so foolish as to propose David Foster Wallace with a straight face. Tom Wolfe’s novels have always struck me as cartoons, insightful and observant cartoons, to be sure, but cartoons nevertheless. Kurt Vonnegut is an unfunny clown; I put him below Stephen King. Hell, I’d put him below Stephanie Miller and Laurell K. Hamilton. Jack London might be the quintessentially American writer, but his style was far too limited to merit serious consideration.\nAt the end of the day, I don’t see how it is possible to go with anyone but Samuel Clemens, Mark Twain himself. He had the complete package, prose, plot, characters, and commentary on the human condition, in addition to fully representing the American spirit.",
  "tags": [
    "mailvox",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-26T12:00:00+00:00"
}