{
  "url": "https://voxday.net/2014/04/04/mailvox-breaking-ceasefire/",
  "scraped_at": "2025-12-15T16:51:44.568409",
  "title": "Mailvox: breaking the ceasefire",
  "date_display": "April 4, 2014",
  "date_iso": "2014-04-04T13:00:00+00:00",
  "date_from_url": "2014-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gara demonstrates that he doesn’t understand the difference between legal right and common practice:</p><blockquote class=\"tr_bq\"><p> <b>Gara: </b>So many people bitching about the whole Mozilla thing. One would expect a self described libertarian like Vox would understand that this is eactly how the free marketplace of ideas is supposed to work. Firefox’s CEO approves of discrimination against same sey couples. And other individuals and companies such as OKCupid responded by exercising their right of free association, declining to support a CEO who holds a viewpoint they found abhorrent. This is how democratic persuasion always operates guys. If you are so angry about it, then try with all means to make your OkCupid boycott work. See if you can get even half the influence they have.</p><p><b>Toby: </b><i>Free marketplace of ideas involve demanding another person to step down from a position/quit from work because of his/her ideas? Gara, are you crazy?</i></p><p><b>Gara: </b>Yes it does. You have all the right to say “If Mr X does not quit his position, I won’t have anything to do with your company anymore”. And the company can they react as they see fit. Liberals have the right to do things like that as much as conservatives do.</p></blockquote><p>What we have here is a left-winger and a right-winger talking past each other. Gara is absolutely right in one sense. OKCupid and the various Mozilla employees were perfectly within their LEGAL rights to behave as they did. No one, to the best of my knowledge, has accused them of criminal activity or called for them to be prosecuted.</p><p>However, Toby is equally correct to observe that it was absolutely crazy for OK Cupid and the various Mozilla employees to exercise their legal rights in that manner. Because while it is LEGAL for employers and businesses to discriminate on the basis of political beliefs and affiliations, it has most certainly not been the ACCEPTED PRACTICE for them to do so openly.</p><p>Indeed, one of the great complaints about the universities and the media is that they secretly impose political litmus tests concerning who is permitted employment in their institutions, and the danger of this practice becoming open knowledge was so great that to this day the universities and media corporations still deny what is statistically undeniable and readily obvious to even the most casual observer.</p><p>But now, thanks to the Eich affair, political employment discrimination is overt, and what was previously only legal is now PUBLIC AND ACCEPTED PRACTICE. It is purge or be purged time. So, if you are an employer in many states, you can now feel free to stop employing every non-critical employee who voted for Obama or is known to be a member of the Democratic Party. And you can impose a political litmus test on your new hires; contact DH for his new service if you don’t want to bother surfing Facebook for incrimination evidence of inappropriate politics.</p><p>What Gara has failed to realize is that there had been a de facto political ceasefire in the corporate world. The Mozilla debacle broke the ceasefire and now the political Right has the ability to return fire with impunity. I doubt it will do so openly yet, but I have no doubt that there will be more than a few unexpected dismissals quietly taking place over the next few months now that corporate executives understand what the new reality is.</p><p>Most conservatives in the corporate community have prided themselves on being “colorblind” with regards to the political spectrum. I suspect that many of them will, sooner or later, understand that they have to abandon that position as being no longer tenable or intellectually justifiable.</p><p>And in keeping with the end to the ceasefire, I have removed Mozilla Firefox from my various systems and devices. I have replaced it with Pale Moon, about which more anon. #uninstallfirefox.</p><p>UPDATE: the ceasefire <a href=\"http://www.breitbart.com/Big-Government/2014/04/03/Google-Executive-Resigns-From-World-Vision-Board-Over-Decision-To-Affirm-Traditional-Marriage\">is observably over</a>:</p><blockquote class=\"tr_bq\"><p> The director of corporate giving for Google Inc. has resigned in protest from the board of a Christian aid organization after the charity reversed its decision to hire employees in same-sex marriages. As the Associated Press reported Thursday, Jacquelline Fuller said in an email Wednesday to AP that while she remains a “huge fan” of the group’s work on behalf of the poor, she resigned Friday “as I disagreed with the decision to exclude gay employees who marry.” </p></blockquote><p>If people are more concerned about homogamy or equality than with helping the poor or basic Christian principles, they should certainly resign from any Christian aid organization. Indeed, they should not be involved with the group in the first place.</p></div>",
  "content_text": "Gara demonstrates that he doesn’t understand the difference between legal right and common practice:\nGara:\nSo many people bitching about the whole Mozilla thing. One would expect a self described libertarian like Vox would understand that this is eactly how the free marketplace of ideas is supposed to work. Firefox’s CEO approves of discrimination against same sey couples. And other individuals and companies such as OKCupid responded by exercising their right of free association, declining to support a CEO who holds a viewpoint they found abhorrent. This is how democratic persuasion always operates guys. If you are so angry about it, then try with all means to make your OkCupid boycott work. See if you can get even half the influence they have.\nToby:\nFree marketplace of ideas involve demanding another person to step down from a position/quit from work because of his/her ideas? Gara, are you crazy?\nGara:\nYes it does. You have all the right to say “If Mr X does not quit his position, I won’t have anything to do with your company anymore”. And the company can they react as they see fit. Liberals have the right to do things like that as much as conservatives do.\nWhat we have here is a left-winger and a right-winger talking past each other. Gara is absolutely right in one sense. OKCupid and the various Mozilla employees were perfectly within their LEGAL rights to behave as they did. No one, to the best of my knowledge, has accused them of criminal activity or called for them to be prosecuted.\nHowever, Toby is equally correct to observe that it was absolutely crazy for OK Cupid and the various Mozilla employees to exercise their legal rights in that manner. Because while it is LEGAL for employers and businesses to discriminate on the basis of political beliefs and affiliations, it has most certainly not been the ACCEPTED PRACTICE for them to do so openly.\nIndeed, one of the great complaints about the universities and the media is that they secretly impose political litmus tests concerning who is permitted employment in their institutions, and the danger of this practice becoming open knowledge was so great that to this day the universities and media corporations still deny what is statistically undeniable and readily obvious to even the most casual observer.\nBut now, thanks to the Eich affair, political employment discrimination is overt, and what was previously only legal is now PUBLIC AND ACCEPTED PRACTICE. It is purge or be purged time. So, if you are an employer in many states, you can now feel free to stop employing every non-critical employee who voted for Obama or is known to be a member of the Democratic Party. And you can impose a political litmus test on your new hires; contact DH for his new service if you don’t want to bother surfing Facebook for incrimination evidence of inappropriate politics.\nWhat Gara has failed to realize is that there had been a de facto political ceasefire in the corporate world. The Mozilla debacle broke the ceasefire and now the political Right has the ability to return fire with impunity. I doubt it will do so openly yet, but I have no doubt that there will be more than a few unexpected dismissals quietly taking place over the next few months now that corporate executives understand what the new reality is.\nMost conservatives in the corporate community have prided themselves on being “colorblind” with regards to the political spectrum. I suspect that many of them will, sooner or later, understand that they have to abandon that position as being no longer tenable or intellectually justifiable.\nAnd in keeping with the end to the ceasefire, I have removed Mozilla Firefox from my various systems and devices. I have replaced it with Pale Moon, about which more anon. #uninstallfirefox.\nUPDATE: the ceasefire\nis observably over\n:\nThe director of corporate giving for Google Inc. has resigned in protest from the board of a Christian aid organization after the charity reversed its decision to hire employees in same-sex marriages. As the Associated Press reported Thursday, Jacquelline Fuller said in an email Wednesday to AP that while she remains a “huge fan” of the group’s work on behalf of the poor, she resigned Friday “as I disagreed with the decision to exclude gay employees who marry.”\nIf people are more concerned about homogamy or equality than with helping the poor or basic Christian principles, they should certainly resign from any Christian aid organization. Indeed, they should not be involved with the group in the first place.",
  "tags": [
    "corpocracy",
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-04T12:00:00+00:00"
}