{
  "url": "https://voxday.net/2014/04/23/more-fun-with-fake-reviews/",
  "scraped_at": "2025-12-15T16:53:38.457221",
  "title": "More fun with fake reviews",
  "date_display": "April 23, 2014",
  "date_iso": "2014-04-23T00:15:00+00:00",
  "date_from_url": "2014-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dave O’Neill is just tired of all those “sorcerer in a monastery discussing theology” books that so permeate SF/F today:</p><p><i><a href=\"http://www.amazon.com/review/RFFOY4ELG1FUG/ref=cm_cr_rdp_perm\"><b>Overwritten and felt derivative</b></a></i><br> <i>To be fair, I was interested because of the Hugo nomination and was<br> curious about the general worlds involved.  I made it about 5% into this<br> on my Kindle before grinding to a halt.  Nothing was all that<br> interesting and didn’t drive me to read more.  If you’re looking for<br> something to read while waiting for more George RR Martin, keep looking<br> would be my advice really.</br></br></br></br></br></i></br></p><p>I suggest that if you’re looking for something to read while waiting for more George RR Martin, perhaps it would make more sense to try the 854-page <i><b>A THRONE OF BONES</b></i> rather than a Hugo-nominated novelette.<i> </i>Good or bad, it’s just not going to take long, not even if you move your lips when you read. What I find amusing about all these hit reviews is that they know they need a few descriptors to justify the one-star rating, but they are seldom smart enough to choose any that actually sound relevant.</p><p>So far we’ve seen “incoherent and unconvincing non-story” as well as “adolescent theology”. And now “derivative”. Derivative of what? <i>The Name of the Rose</i>? <i>A Canticle for Leibowitz</i>? Monk literature isn’t what one would call a massive subgenre. What’s next, complaints about how lame the sex scenes are?</p><p>You can read better fake fake reviews right here on this blog. Consider Kyle’s: <i>“Why can’t these critics at least be competent enough to complain about<br> this story in a manner that, while not necessarily hitting the mark, at<br> least lands in the same galaxy as the dartboard?  If I was going to<br> criticize this (excellent) story then I’d whine about how it was maudlin<br> and sentimental, a fantasy Thomas Kincade painting, exposing the evil<br> crimethink purveyor Vox Day as actually being a sentimental wimp hiding<br> beneath his grandiose bravado projected on the blog.”</br></br></br></br></br></br></i></p></div>",
  "content_text": "Dave O’Neill is just tired of all those “sorcerer in a monastery discussing theology” books that so permeate SF/F today:\nOverwritten and felt derivative\nTo be fair, I was interested because of the Hugo nomination and was\ncurious about the general worlds involved.  I made it about 5% into this\non my Kindle before grinding to a halt.  Nothing was all that\ninteresting and didn’t drive me to read more.  If you’re looking for\nsomething to read while waiting for more George RR Martin, keep looking\nwould be my advice really.\nI suggest that if you’re looking for something to read while waiting for more George RR Martin, perhaps it would make more sense to try the 854-page\nA THRONE OF BONES\nrather than a Hugo-nominated novelette.\nGood or bad, it’s just not going to take long, not even if you move your lips when you read. What I find amusing about all these hit reviews is that they know they need a few descriptors to justify the one-star rating, but they are seldom smart enough to choose any that actually sound relevant.\nSo far we’ve seen “incoherent and unconvincing non-story” as well as “adolescent theology”. And now “derivative”. Derivative of what?\nThe Name of the Rose\n?\nA Canticle for Leibowitz\n? Monk literature isn’t what one would call a massive subgenre. What’s next, complaints about how lame the sex scenes are?\nYou can read better fake fake reviews right here on this blog. Consider Kyle’s:\n“Why can’t these critics at least be competent enough to complain about\nthis story in a manner that, while not necessarily hitting the mark, at\nleast lands in the same galaxy as the dartboard?  If I was going to\ncriticize this (excellent) story then I’d whine about how it was maudlin\nand sentimental, a fantasy Thomas Kincade painting, exposing the evil\ncrimethink purveyor Vox Day as actually being a sentimental wimp hiding\nbeneath his grandiose bravado projected on the blog.”",
  "tags": [
    "anklebiters",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-22T23:15:00+00:00"
}