{
  "url": "https://voxday.net/2014/04/10/neoconnery-is-anti-american/",
  "scraped_at": "2025-12-15T16:52:23.351350",
  "title": "Neoconnery is anti-American",
  "date_display": "April 10, 2014",
  "date_iso": "2014-04-10T17:00:00+00:00",
  "date_from_url": "2014-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Pakistani neocon explains why it is vital for American troops to remain <a href=\"http://www.slate.com/articles/news_and_politics/politics/2014/04/neocons_and_rand_paul_what_libertarians_don_t_understand_about_american.single.html\">at the disposal of Pakistani interests</a>:</p><blockquote class=\"tr_bq\"><p> We neocons have fallen out of favor, not just on the left, where “neocon” is routinely used as a term of abuse, but also on the right, where libertarian-minded conservatives who favor a smaller (and cheaper) military have seized the initiative. Rand Paul, the junior senator from Kentucky, is just one of many Tea Party conservatives who has defined his foreign policy views in opposition to the neocons. And it’s easy to see why….</p><p>Given all of this, why am I still a neocon? Why do I still believe that the U.S. should maintain an overwhelming military edge over all potential rivals, and that we as a country ought to be willing to use our military power in defense of our ideals as well as our interests narrowly defined? There are two reasons: The first is that American strength is the linchpin of a peaceful, economically integrating world; and the second is that we know what it looks like when America embraces amoral realpolitik, and it’s not pretty.</p><p>Like it or not, America’s failure in Iraq does not change the fact that global stability depends on American global leadership, and American global leadership costs money. The United States is at the heart of a dense web of alliances. We extend formal security guarantees to more than 50 countries. Some see these alliances and guarantees as little more than a burden the U.S. can no longer afford. Yet what they actually do is dampen security competition. They reassure partner countries that they needn’t build up their militaries to defend themselves against their neighbors, which then reassures their neighbors that they needn’t build up their militaries. This virtuous cycle is one of the central reasons Western Europe and Japan recovered so quickly after the devastation of World War II, and why globalization has helped ease poverty around the world. For this virtuous cycle to be maintained, however, U.S. security guarantees must be considered credible. It must be clear that when the U.S. makes a security commitment to another country, that commitment will be met. This in turn means that the U.S. military must have the power and the reach to defend countries far from our borders.</p></blockquote><p>It’s not an accident that most of the necons complaining that American isolationists ” don’t understand about American military power—and American morality” are second- and third-generation immigrants. They may be U.S. citizens but they are not Americans and they simply do not understand, at all, George Washington’s warning about entangling alliances.</p><p>Quite to the contrary, they demand more and more entanglement, preferably with their true homelands. As the Baseball, hot dogs, and apple pie-named Reihan Salam admits:</p><blockquote><p> Why insist on moralistic crusades, as neocons are wont to do? I suppose I have a personal reason for doing so. It turns out that this week isn’t just the anniversary of the fall of Baghdad. It is also the 43rd anniversary of a telegram which an American consul general, Archer Blood, took the unusual<br> step of condemning his own government. As Gary Bass recounts in his chilling book The Blood Telegram, Richard Nixon and his chief foreign policy consigliere, Henry Kissinger, enthusiastically backed Pakistan’s military junta in its efforts to not only overturn the results of its country’s first free and fair election, but to massacre hundreds of thousands of Bengalis in an effort to teach what was then a rebellious province a lesson. One of the men who died, as it happens, was my uncle.</br></p><div class=\"text parbase text-10 section\"></div><p>Knowing fully well that he was endangering his career, Blood decried<br> the American failure to defend democracy or to denounce Pakistani<br> atrocities. He also knew that had President Nixon decided to lift a<br> finger, he could have forced Pakistan to stay its hand. Yet it seems<br> that humanitarian considerations never entered the picture for Nixon and<br> Kissinger. They were apparently too taken with treating the world as a<br> chessboard to bother reckoning with the monstrous crimes they were<br> aiding and abetting. Though Pakistan was unable to prevent the emergence<br> of an independent Bangladesh, thanks in large part to India’s decision<br> to intervene, the country remains scarred by the bloodletting. Imagine<br> if a different president hadn’t cheered on Pakistan’s military rulers<br> but rather threatened to use U.S. power in defense of Bengali civilians.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><div class=\"text-11 text parbase section\"></div><p>Neocons are, for the most part, non-Americans who use the United States as a base in order to subvert American national interest in favor of Pakistani, or Israeli, or Iraqi, or Ukrainian national interests. The massacre of hundreds of thousands of barbarians by another group of barbarians is of no concern whatsoever to the American people. And clearly it is a mistake to have allowed men like Mr. Salem to enter the country, because he has repaid his hosts by attempting to involve them in the very violence he fled Pakistan to escape!</p><p>One can’t even properly describe these neocons as traitors, because they are loyal to their nations. The problem is that their nation is not the American nation. What Mr. Salem does not realize is that Rand Paul and most American isolationists understands very well what Mr. Salem and his fellow neocons want. They simply believe in putting American interests first.</p></div>",
  "content_text": "A Pakistani neocon explains why it is vital for American troops to remain\nat the disposal of Pakistani interests\n:\nWe neocons have fallen out of favor, not just on the left, where “neocon” is routinely used as a term of abuse, but also on the right, where libertarian-minded conservatives who favor a smaller (and cheaper) military have seized the initiative. Rand Paul, the junior senator from Kentucky, is just one of many Tea Party conservatives who has defined his foreign policy views in opposition to the neocons. And it’s easy to see why….\nGiven all of this, why am I still a neocon? Why do I still believe that the U.S. should maintain an overwhelming military edge over all potential rivals, and that we as a country ought to be willing to use our military power in defense of our ideals as well as our interests narrowly defined? There are two reasons: The first is that American strength is the linchpin of a peaceful, economically integrating world; and the second is that we know what it looks like when America embraces amoral realpolitik, and it’s not pretty.\nLike it or not, America’s failure in Iraq does not change the fact that global stability depends on American global leadership, and American global leadership costs money. The United States is at the heart of a dense web of alliances. We extend formal security guarantees to more than 50 countries. Some see these alliances and guarantees as little more than a burden the U.S. can no longer afford. Yet what they actually do is dampen security competition. They reassure partner countries that they needn’t build up their militaries to defend themselves against their neighbors, which then reassures their neighbors that they needn’t build up their militaries. This virtuous cycle is one of the central reasons Western Europe and Japan recovered so quickly after the devastation of World War II, and why globalization has helped ease poverty around the world. For this virtuous cycle to be maintained, however, U.S. security guarantees must be considered credible. It must be clear that when the U.S. makes a security commitment to another country, that commitment will be met. This in turn means that the U.S. military must have the power and the reach to defend countries far from our borders.\nIt’s not an accident that most of the necons complaining that American isolationists ” don’t understand about American military power—and American morality” are second- and third-generation immigrants. They may be U.S. citizens but they are not Americans and they simply do not understand, at all, George Washington’s warning about entangling alliances.\nQuite to the contrary, they demand more and more entanglement, preferably with their true homelands. As the Baseball, hot dogs, and apple pie-named Reihan Salam admits:\nWhy insist on moralistic crusades, as neocons are wont to do? I suppose I have a personal reason for doing so. It turns out that this week isn’t just the anniversary of the fall of Baghdad. It is also the 43rd anniversary of a telegram which an American consul general, Archer Blood, took the unusual\nstep of condemning his own government. As Gary Bass recounts in his chilling book The Blood Telegram, Richard Nixon and his chief foreign policy consigliere, Henry Kissinger, enthusiastically backed Pakistan’s military junta in its efforts to not only overturn the results of its country’s first free and fair election, but to massacre hundreds of thousands of Bengalis in an effort to teach what was then a rebellious province a lesson. One of the men who died, as it happens, was my uncle.\nKnowing fully well that he was endangering his career, Blood decried\nthe American failure to defend democracy or to denounce Pakistani\natrocities. He also knew that had President Nixon decided to lift a\nfinger, he could have forced Pakistan to stay its hand. Yet it seems\nthat humanitarian considerations never entered the picture for Nixon and\nKissinger. They were apparently too taken with treating the world as a\nchessboard to bother reckoning with the monstrous crimes they were\naiding and abetting. Though Pakistan was unable to prevent the emergence\nof an independent Bangladesh, thanks in large part to India’s decision\nto intervene, the country remains scarred by the bloodletting. Imagine\nif a different president hadn’t cheered on Pakistan’s military rulers\nbut rather threatened to use U.S. power in defense of Bengali civilians.\nNeocons are, for the most part, non-Americans who use the United States as a base in order to subvert American national interest in favor of Pakistani, or Israeli, or Iraqi, or Ukrainian national interests. The massacre of hundreds of thousands of barbarians by another group of barbarians is of no concern whatsoever to the American people. And clearly it is a mistake to have allowed men like Mr. Salem to enter the country, because he has repaid his hosts by attempting to involve them in the very violence he fled Pakistan to escape!\nOne can’t even properly describe these neocons as traitors, because they are loyal to their nations. The problem is that their nation is not the American nation. What Mr. Salem does not realize is that Rand Paul and most American isolationists understands very well what Mr. Salem and his fellow neocons want. They simply believe in putting American interests first.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-10T16:00:00+00:00"
}