{
  "url": "https://voxday.net/2014/04/13/no-likely-futures/",
  "scraped_at": "2025-12-15T16:52:36.148292",
  "title": "No likely futures",
  "date_display": "April 13, 2014",
  "date_iso": "2014-04-13T15:00:00+00:00",
  "date_from_url": "2014-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve pointed out many times, and demonstrated on more than one occasion, that the Left is considerably less intelligent and educated than it believes itself to be. To further demonstrate the conceit, dishonesty, and self-deception of the Left, consider Damien Walter’s inept responses to criticism of his most recent hit piece aka Guardian column.</p><blockquote class=\"tr_bq\"><p> <b>Commenter:  </b>Not quite sure I agree with the conclusion “The future is queer”. Given the current balance of power in the world, it must as equally be likely that future generations may revert to traditional gender roles, however advanced the tech gets. For example, in 75 to 100 years, it’s quite easy to imagine a society which regards historical sexual freedom as a contributing factor to the failure of our capitalist paradise. Revisionism which twists historical events is not new, and it’s entirely possible some future government/state will twist our present when it’s their history. It’s also worth bearing in mind that the progressive liberalism talked about here affects only a tiny percentage of the world’s population. When the Chinese buy up the UK in a fire sale 50 years from now, how much mind are they going to pay such freedoms?</p><p><b>DamienGWalter:</b> Of course, there are no absolutes when it comes to the future. But putting aside “collapse” scenarios, I can’t see any likely future where gender isn’t radically changed from its current norms. I think expecting otherwise would be like expecting feudal social structures to carry over in to industrial society. We can already see the structural changes being wrought by technology, the social changes are then almost determined.</p></blockquote><p>There are 83 countries where homosexuality is criminalized. There are 20 countries where homogamy has been at least partially legalized. The countries where homosexuality is criminalized have growing populations. The countries where homogamy is legal have declining populations. And yet, Mr. Walter can’t see the possibility of a future where the larger trend is in line with demographic growth.  No wonder he is a mere SF wannabe rather than a bona fide SF writer; his imagination is too limited.</p><p>Any doubts that he was engaging in pure rhetoric are answered in this exchange:</p><blockquote class=\"tr_bq\"><p> <b>Commenter: </b>It’s Larry Correia being discussed, so let’s use his handy Internet Arguing Checklist to examine this article. Points #1 (Skim until Offended), #4 (Disregard Inconvenient Facts), and #5 (Make S——t Up) are fairly well represented here. In particular, compare Damien Walter’s misrepresentation of Correia’s article:<br> <i><br>    But Correia boils it down to a much simpler argument. However accurate a queer future might be, SF authors must continue to pander to the bigotry of conservative readers if they want to be “commercial”.</br></i></br></p><p>to an excerpt from the core of Larry’s actual essay:</p><p><i>    “Now, before we continue I need to establish something about my personal writing philosophy. Science Fiction is SPECULATIVE FICTION. That means we can make up all sorts of crazy stuff and we can twist existing reality to do interesting new things in order to tell the story we want to tell. I’m not against having a story where there are sexes other than male and female or neuters or schmes or hirs or WTF ever or that they flip back and forth or shit… robot sex. Hell, I don’t know. Write whatever tells your story.</i></p><p>    But the important thing there is STORY. Not the cause of the day. STORY.</p><p>For extra entertainment, read Larry’s brilliant counter-fisking of Jim C Hines’s post.</p><p><b>DamienGWalter:</b> Counter-fisking? Hmmm…sounds kinky.</p></blockquote><p>Deep and insightful stuff there. But Walter gave his propagandistic game away in an earlier essay:<i> “The challenge for writers of science fiction today is not to repeat the same dire warnings we have all already heard, or to replicate the naive visions of the genres golden age, but to create visions of the future people can believe in. Perhaps the next Nineteen Eighty-Four, instead of confronting us with our worst fear, will find the imagination to show us our greatest hope.”</i></p><p>What is his greatest hope? Based on his recent column, a queer future. Kathryn Cramer of Tor.com correctly pegged Walter as a propagandist rather than a writer with anything to say about the human condition <a href=\"http://www.tor.com/blogs/2008/09/gloomandsf#more\">on Tor.com</a>.</p><p><i>“Walter says he wants SF to do more than “reflect” the world, but rather fiction that seeks to “influence” it.”</i></p><p>And that is what fundamentally separates Pink SF/F from Blue SF/F.<i> </i>We tell stories to entertain the reader and make him think. They print propaganda to lecture the reader and stop him from thinking.<i> </i>We ask “what if?” They assert “it will be so!”<i><br/></i></p></div>",
  "content_text": "I’ve pointed out many times, and demonstrated on more than one occasion, that the Left is considerably less intelligent and educated than it believes itself to be. To further demonstrate the conceit, dishonesty, and self-deception of the Left, consider Damien Walter’s inept responses to criticism of his most recent hit piece aka Guardian column.\nCommenter:\nNot quite sure I agree with the conclusion “The future is queer”. Given the current balance of power in the world, it must as equally be likely that future generations may revert to traditional gender roles, however advanced the tech gets. For example, in 75 to 100 years, it’s quite easy to imagine a society which regards historical sexual freedom as a contributing factor to the failure of our capitalist paradise. Revisionism which twists historical events is not new, and it’s entirely possible some future government/state will twist our present when it’s their history. It’s also worth bearing in mind that the progressive liberalism talked about here affects only a tiny percentage of the world’s population. When the Chinese buy up the UK in a fire sale 50 years from now, how much mind are they going to pay such freedoms?\nDamienGWalter:\nOf course, there are no absolutes when it comes to the future. But putting aside “collapse” scenarios, I can’t see any likely future where gender isn’t radically changed from its current norms. I think expecting otherwise would be like expecting feudal social structures to carry over in to industrial society. We can already see the structural changes being wrought by technology, the social changes are then almost determined.\nThere are 83 countries where homosexuality is criminalized. There are 20 countries where homogamy has been at least partially legalized. The countries where homosexuality is criminalized have growing populations. The countries where homogamy is legal have declining populations. And yet, Mr. Walter can’t see the possibility of a future where the larger trend is in line with demographic growth.  No wonder he is a mere SF wannabe rather than a bona fide SF writer; his imagination is too limited.\nAny doubts that he was engaging in pure rhetoric are answered in this exchange:\nCommenter:\nIt’s Larry Correia being discussed, so let’s use his handy Internet Arguing Checklist to examine this article. Points #1 (Skim until Offended), #4 (Disregard Inconvenient Facts), and #5 (Make S——t Up) are fairly well represented here. In particular, compare Damien Walter’s misrepresentation of Correia’s article:\nBut Correia boils it down to a much simpler argument. However accurate a queer future might be, SF authors must continue to pander to the bigotry of conservative readers if they want to be “commercial”.\nto an excerpt from the core of Larry’s actual essay:\n“Now, before we continue I need to establish something about my personal writing philosophy. Science Fiction is SPECULATIVE FICTION. That means we can make up all sorts of crazy stuff and we can twist existing reality to do interesting new things in order to tell the story we want to tell. I’m not against having a story where there are sexes other than male and female or neuters or schmes or hirs or WTF ever or that they flip back and forth or shit… robot sex. Hell, I don’t know. Write whatever tells your story.\nBut the important thing there is STORY. Not the cause of the day. STORY.\nFor extra entertainment, read Larry’s brilliant counter-fisking of Jim C Hines’s post.\nDamienGWalter:\nCounter-fisking? Hmmm…sounds kinky.\nDeep and insightful stuff there. But Walter gave his propagandistic game away in an earlier essay:\n“The challenge for writers of science fiction today is not to repeat the same dire warnings we have all already heard, or to replicate the naive visions of the genres golden age, but to create visions of the future people can believe in. Perhaps the next Nineteen Eighty-Four, instead of confronting us with our worst fear, will find the imagination to show us our greatest hope.”\nWhat is his greatest hope? Based on his recent column, a queer future. Kathryn Cramer of Tor.com correctly pegged Walter as a propagandist rather than a writer with anything to say about the human condition\non Tor.com\n.\n“Walter says he wants SF to do more than “reflect” the world, but rather fiction that seeks to “influence” it.”\nAnd that is what fundamentally separates Pink SF/F from Blue SF/F.\nWe tell stories to entertain the reader and make him think. They print propaganda to lecture the reader and stop him from thinking.\nWe ask “what if?” They assert “it will be so!”",
  "tags": [
    "media",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-13T14:00:00+00:00"
}