{
  "url": "https://voxday.net/2014/04/14/on-cover/",
  "scraped_at": "2025-12-15T16:52:48.931687",
  "title": "On the cover",
  "date_display": "April 14, 2014",
  "date_iso": "2014-04-14T20:00:00+00:00",
  "date_from_url": "2014-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jartstar shares his thoughts about how he went about creating the cover for <a href=\"http://www.amazon.com/dp/B00JM98V60\"><b><i>AWAKE IN THE NIGHT LAND</i></b></a>:</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/04/awake_thumbs.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"244\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/awake_thumbs.png\" width=\"320\"/></a></div><p><b><i>Awake in the Night Land</i></b> is one of the finest stories I have ever read, and when I was given the opportunity to design a cover for it I was elated. After presenting a series of thumbnails to Mr. Wright with series of different styles and ideas, he chose a straight forward image with the focal point being The Last Redoubt.</p><p>The challenge was representing a towering, ancient, rusting structure surrounded by a dead and sunless sky encircled by ruins and a wasteland. If the lighting was accurate to the real world and the story it would consist of a silhouetted triangular shape with a dim red glowing horizon and a few bright spots of magma here and there. This would make for a thoroughly uninteresting image which certainly would not work for a book cover. Using some artistic license I brightened up the concept and made a dramatic, disconcerting red sky with the light of the Redoubt fighting against the creeping black around it. </p><p>I certainly hope my version of the Redoubt has done justice to it as described in the story, but more importantly, it should reflect the power of Wright’s superb work. This question of my success can only be answered by the wayfarers who are willing to enter into the dark of the Night Lands and find their way out again.</p><p>On John C. Wright’s Journal, Pinlighter asked about the shape of the pyramid:</p><blockquote class=\"tr_bq\"><p> It’s certainly an effective cover, – I’ll go beyond that, a beautiful<br> cover – but the Redoubt is clearly described in THE NIGHT LAND as being a<br> Pyramid without terraces or steps like that, but looking more like the<br> traditional (Egyptian) pyramid, smoothly tapering to a point.   I am<br> curious as to your motives for not showing it like that. </br></br></br></br></p></blockquote><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2014/04/awake_900.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/awake_900.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/awake_900.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%20320%22%3E%3C/svg%3E\" width=\"200\"/></a><b>VD replies:</b> The change to a more Mayan-style pyramid was my call. As you can see in the thumbs, the original plan was to go by the book. But the simple geometric shape just looked too plain and boring, especially for a central element that was featured so prominently on the cover. So, chalk it down to artistic liberty, in much the same way that the Watcher’s heads are fully exposed rather than on their sides with their faces half-buried as in the text. It’s certainly desirable to get the details right, but not at the expense of making a cover visually tedious. I think Jartstar did a very good job of conveying the ominous spirit of the Night Lands while also expressing its core message of human hope in a visually arresting image; to see it in more detail, just click on the cover.</p></div>",
  "content_text": "Jartstar shares his thoughts about how he went about creating the cover for\nAWAKE IN THE NIGHT LAND\n:\nAwake in the Night Land\nis one of the finest stories I have ever read, and when I was given the opportunity to design a cover for it I was elated. After presenting a series of thumbnails to Mr. Wright with series of different styles and ideas, he chose a straight forward image with the focal point being The Last Redoubt.\nThe challenge was representing a towering, ancient, rusting structure surrounded by a dead and sunless sky encircled by ruins and a wasteland. If the lighting was accurate to the real world and the story it would consist of a silhouetted triangular shape with a dim red glowing horizon and a few bright spots of magma here and there. This would make for a thoroughly uninteresting image which certainly would not work for a book cover. Using some artistic license I brightened up the concept and made a dramatic, disconcerting red sky with the light of the Redoubt fighting against the creeping black around it.\nI certainly hope my version of the Redoubt has done justice to it as described in the story, but more importantly, it should reflect the power of Wright’s superb work. This question of my success can only be answered by the wayfarers who are willing to enter into the dark of the Night Lands and find their way out again.\nOn John C. Wright’s Journal, Pinlighter asked about the shape of the pyramid:\nIt’s certainly an effective cover, – I’ll go beyond that, a beautiful\ncover – but the Redoubt is clearly described in THE NIGHT LAND as being a\nPyramid without terraces or steps like that, but looking more like the\ntraditional (Egyptian) pyramid, smoothly tapering to a point.   I am\ncurious as to your motives for not showing it like that.\nVD replies:\nThe change to a more Mayan-style pyramid was my call. As you can see in the thumbs, the original plan was to go by the book. But the simple geometric shape just looked too plain and boring, especially for a central element that was featured so prominently on the cover. So, chalk it down to artistic liberty, in much the same way that the Watcher’s heads are fully exposed rather than on their sides with their faces half-buried as in the text. It’s certainly desirable to get the details right, but not at the expense of making a cover visually tedious. I think Jartstar did a very good job of conveying the ominous spirit of the Night Lands while also expressing its core message of human hope in a visually arresting image; to see it in more detail, just click on the cover.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-14T19:00:00+00:00"
}