{
  "url": "https://voxday.net/2014/04/27/on-impossibility-of-reconciliation/",
  "scraped_at": "2025-12-16T12:12:42.922609",
  "title": "On the impossibility of reconciliation",
  "date_display": "April 27, 2014",
  "date_iso": "2014-04-27T17:00:00+00:00",
  "date_from_url": "2014-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has largely been forgotten that NK Jemisin’s attack on me in Australia was part of a nominal call for reconciliation in SF/F, and my response to her was a rejection of that call on the grounds of its impossibility. So, you can imagine the amusement that was provided by this exchange between RD Miksa and <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2223564\">one of the Torlings responsible</a> for Making Light after Ms Sutherland expressed her opinion concerning my fans inability to talk about what it is they enjoy about my books.</p><blockquote class=\"tr_bq\"><p> (You know what I would love? adore? enjoy the heck out of?  A genuine Larry Correia fan coming here and <i>enthusing</i> about the work.  Taking about what it <i>is</i>,<br> not what it is not; talking about why they love it rather than why they<br> hate Librul SF and the Libruls who read it. And that is the difference<br> between Correia and Day, in my view.  I can’t picture a Day fan doing<br> that and making it work.)</br></br></br></br></p></blockquote><p>To which <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2239689\">Mr. Miksa’s response</a> was only the most detailed of several, including those from <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2237131\">Mendoscot</a>, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2235321\">Daniel</a>, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2233431\">Whitebirch</a>, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2232918\">Eric Ashley</a>, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2232851\">Trev006</a>, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2232070\">Scottishmentat</a>, and <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2232111\">A VD Fan</a>, to attempt the very thing Ms Sutherland could not picture. Note that he goes into some detail, so if you still have not read Opera Vita Aeterna at this point, you may wish to avoid what follows the jump:</p><blockquote class=\"tr_bq\"><p> Earlier in this discussion, one of the Site Administrators contended that she could not imagine a fan of Vox Day entering this forum and genuinely “enthusing” about his work. Indeed, she essentially claimed that she simply could not picture a Vox Day fan explaining why they like his writing while also making that explanation “work.”</p><p>Now, while it is out of my control as to whether or not the reader decides that my explanation “works”—for what “works” as an explanation, especially when dealing with literary matters, is essentially a subjective matter—it is obviously within my power to explain why I like Day’s writing. And so, I am more than willing to provide my reasons for why I enjoy Day’s literary products. At the same time, I would also like to articulate a few points which I believe are not only highly relevant to this whole discussion surrounding Day’s work and his Hugo nomination, but which should also make certain individuals pause and perhaps reflect upon whether their negative assessment of Day’s character is wholly accurate. In essence, what I will point out is that the very content and ideas embedded in Day’s fiction actually serve as some evidence against the negative epithets (bigot, racist, etc.) that so many people are trying to label him with. Indeed, I contend that many people are so blinded by what they think Day is saying, that they do not realize that his very own fictional works provide us with some evidence that Day’s ideas are very often more nuanced and subtle than what his opponents would wish people to believe.</p><p>Finally, let me just note that since the current debate over Vox Day and his writings has stemmed from his novelette “Opera Vita Aeterna” being nominated for a Hugo Award, I will thus use this novelette as the basis for all my points. I do so for two reasons. First, since this particular novelette is currently being considered for a Hugo Award, it is, at the present time, arguably Day’s most important and prominent work of fiction, thus making it fully appropriate to focus my comments on that particular story. And second, since Day is offering that particular work of fiction for free off his website, anyone and everyone can thus access it, read it for themselves, and determine if the points that I articulate actually match the story.</p><p>So, with this introduction articulated, on to the meat of the matter.</p></blockquote><p> <a name=\"more\"></a></p><blockquote class=\"tr_bq\"><p> <b>Why I Greatly Enjoyed “Opera Vita Aeterna”</b></p><p>    Now, while it is the case that previous commentators have summarized Day’s novelette, let me also do so briefly in order to ensure that we are all on the same page. In essence, “Opera Vita Aeterna” is—in my own words—the story of the land’s most powerful elven mage encountering a religious man of such power and might, that the elven mage, after killing the man, leaves everything he has ever known behind and engages on a quest to find the source of the man’s power, which is God Himself. This quest leads the elven mage to a small religious abbey where he meets with the monks and the local Abbot. Over time, and as they spar over theological and philosophical issues, a tentative friendship grows between the elven mage and the Abbot. However, in the background, a demonic entity, who despises humans in general, and the monks in particular, is constantly striving to have the elven mage return to his homeland. Then, at a certain point, and in an effort to make the elven mage return home, the demonic entity has a group of goblins wipe out the whole abbey while the elven mage is gone. Upon his return, the elven mage finds all the monks killed. In particular, he finds the Abbot murdered right beneath a cross. Seeming this, and screaming at the apparent impotence and apathy of the God of Men, the elven mage demands that God grant the Abbot a place in the afterlife. The story then fast-forwards to a point where it becomes clear that the friendship between the elven mage and the Abbot, and the theological work that this friendship produced, have become critical to the development of the Church as a whole.</p><p>    Now, with this summary complete, let me articulate just some of the reasons why I greatly enjoyed this particular novelette.</p><p>    First, in many ways, the novelette seamlessly blends non-fiction with fiction. What do I mean? I mean that as part of the novelette, we are treated to brief theological and philosophical debates which stimulate the mind and the intellect in a way that most other works do not. Indeed, just as many philosophers in the past would use a dialogue format to bring out their philosophical points, Day does the same thing, but he does so in a manner that does not detract from the story itself. And while I have no doubt that not everyone wants to have a philosophical debate serve as part of a fictional story, I can say that for those of us that do enjoy that type of a narrative, Day does it very well.</p><p>    Second, Day has, in my view, an uncanny ability to combine his fantasy setting with historical accuracy. Now again, what do I mean? I mean that even though Day’s story deals with elves, and goblins, and so on, his depictions of monks and life in the abbey are grounded in the historical reality of how things actually were hundreds of years ago. This, in turn, almost makes it feel like you are receiving a historical education while enjoying a fantastical setting. And once again, while some individuals may not like this strategy of melding historical fiction with fantasy, for those of us that do, Day does did extremely well.</p><p>    Third, Day’s novelette makes you think about life’s deepest questions. In fact, even more so than just this, for people of religious faith, Day’s novelette literally makes you question your religious convictions. Why? Because this novelette does not have a happy ending. It does not give you any easy answers. In fact, if anything, at the end of the novelette, you can sympathize with the atheistic elven mage when he looks up at the cross and curses the apparently weak, impotent, and distant God depicted there. So it is the case that this novelette, short as it may be, makes you think long and hard about the big questions: God, the afterlife, the existence of evil, morality, mortality, the problem of evil, the apparent problem of divine hiddenness, and so on. And since I like to think about these questions, and since I enjoy fiction that makes these questions central, I enjoyed seeing them in Day’s novelette. In addition, I might point out that it is surprising that Day, being a Christian, ends this novelette in the way that he does. You might have expected him to have provided some type of divine intervention to close the story, thus making it more palpable to those of faith. But instead, once you are done reading, you cannot help that think that the atheist elven mage is quite justified in cursing any God who would allow such evil to happen to his own followers. So Day is not afraid to be bold and to go against the grain of his own beliefs, at least partially, when the story requires it.</p><p>    Finally, Day is quite capable in establishing an imaginative setting and in describing it clearly, thus making it easy and enjoyable to picture where and when the story unfolds. I also found the characters to be well-described and that the dialogue matched the traits of the characters very well. So, from a stylistic perspective, I found the story to be more than competent.</p><p>    These, therefore, are but some of the reasons that I enjoyed Day’s novelette. And let me add that, in my view, his novelette is not even his best work. For that, you would need to read A Throne of Bones, which was a work that I devoured in less than two days.</p><p> <b>    Why “Opera Vita Aeterna” Should Make You Think Twice about Vox Day.</b></p><p>    I mentioned earlier that I believe that Day’s fictional work provides his opponents with some evidence that should make them pause and re-think their negative assessment of Day. And while Vox Day needs absolutely no help in defending himself, I nevertheless wish to point out in what way I believe that Day’s novelette does indeed provide evidence against the harsh assessment of his character that is being made by so many individuals. And given that Day has been labeled—by some individuals who disagree with him on certain issues—with just about every single negative and undesirable character trait imaginable in our current cultural climate, it may seem that my claim that Day’s writing should make his opponents re-assess their negative opinion of him somewhat difficult to accept. Nevertheless, I will still offer my reasoning in this matter.</p><p>    Initially, let us start with the reasonable assumption that an author’s personal beliefs, ideas, and philosophy will permeate his writing to some greater or lesser extent. In fact, many people refuse to read Day’s work precisely because they not only object to his views in general, but also because they believe that his fiction will be permeated with those views. And yet, when I read “Opera Vita Aeterna”, some very interesting aspects of the story became particularly prominent given the negative claims being made about Day. And these aspects of the story were all the more interesting in light of fact that they do, at least in part, reflect Day’s views. So let me list just a few of these interesting story elements.</p><p>    First, Day is often labeled as something of a cultural supremacist who is bigoted against non-Western, non-Christian cultures. And yet, in his novelette, what we see is that the Abbot is more than willing to learn and grow from his interactions with the elven mage. In fact, the story literally shows that the Abbot himself, through his long-time interaction with the elven mage, comes to the essentially heretical view that elves have souls, even though this view is not accepted by the Church. At the same time, in the story, the theological interactions between the Abbot and the pagan elven mage, which are written down by the Abbot, eventually become a document that is of great theological significance to the Church, just as the interactions of Saint Thomas Aquinas with the pagan works of Aristotle were of great importance to the actual Church. And what I think that this shows is that Day’s ideas of how cultures interact, and the benefits of such cultural interactions, are subtle, nuanced, and are not so easily categorized as just being an expression of “western cultural supremacism.” His novelette shows the two main characters have a deep respect and tolerance for each other’s cultural tradition, even though there is a clear understanding that certain cultural elements are better than others. Thus, even though the Abbot can understand why the elven mage committed a mercy killing, the Abbot nevertheless still knows that his culture, in seeing such behaviour as a sin, is objectively better than the elven mage’s is. Thus, while Day’s characters have tolerance for each other, they do not let this tolerance dissolve into something as incoherent and indefensible as cultural relativism. So, tolerance and respect for differing cultures and customs is affirmed, but a relativistic out-look about truth, morality, and good is rejected.</p><p>    Second, Day is often caricatured as someone unwilling to consider new ideas and as someone living in an echo-chamber. And while I have never seen Day back down from a debate, I would also point out that his story is precisely meant to show how two completely opposite individuals, with totally opposing views, can, through rational and controlled discussion, be able to think through issues and come to a closer understanding of the truth even though they start their debate at complete opposite sides of an issue. For indeed, at the start of the story, the Abbot literally believes that the elven mage, being soulless, is nothing more than an animal. And yet, through calm, rational discourse, and through their interactions, the Abbot changes his views about the soullessness of elves. At the same time, the elven mage gains a new-found respect for humanity and the intelligence and reasoning skills of human beings. And perhaps this aspect of the story is a cultural and social critique concerning how rational debate, even if harsh, offensive, and unpleasant, is needed in modern society instead of simply mud-slinging and labelling people as “bigots” and “racists” without truly understanding their arguments. After all, it would not be hard to imagine that had another author written Day’s story, then the moment that the elven mage realized that the Abbot considered elves little more than animals, the Abbot would have been labeled a racist bigot who was unworthy of further discussion, consideration, or debate. By contrast, in Day’s version, the elven mage, though offended at being considered little more than an animal, does not shy away from discussing and rationally debating the issue with the Abbot. This is thus a lesson: a view may be offensive and distasteful, but it may also be true, and we will never learn about whether or not that view is true unless we not only engage with the proponents of that view, but also engage with them in a manner that is as impartial as possible, that does not straw-man their arguments, and that seeks to properly understand their point-of-view before condemning it.</p><p>    Third, even though Day is known as a vociferous opponent of theistic unbelief, his story is nevertheless quite sympathetic to the frustration and anger that many individuals feel towards God. He articulates well the emotions and circumstances that would make a person scream at God and curse Him. So again, this fact shows that Day’s views on the subject of God are subtle, and that while he is an opponent of unbelief, he understands it well enough that he can sympathize with the reasoning and emotion behind such unbelief.</p><p>    Now, what these few points are meant to show is that Day’s work is more subtle and nuanced than is normally given credit for. There are themes in his work which show precisely the opposite of bigotry and racism, but rather illustrate how friendship and cultural understanding can develop even in hard circumstances. And as his work is, no doubt, at least a partial reflection of his ideas and thoughts, then this fact should make the individuals that decry him as a bigoted racist truly wonder whether their assessment of him is as accurate as they think. Have they truly considered his arguments or are they just “straw-manning” what he says? Have they looked into the subtleties of his views or have they just scratched the surface of his views and then prematurely labeled him as a “bigot”, etc.? Have they taken his points in the fullness of their context or rather, have they taken quotes out-of-context to make Day’s views appear much worse than they are? Do they understand that Day often employs rhetorical and “for-the-sake-of-argument” argumentative techniques to make his point, or do they rather disregard that fact and simply try to use whatever they can to make Day appear as bad as possible? These are, I contend, valid questions, and those individuals that deride Vox Day should honestly ask and answer these questions for themselves.</p><p> <b>    The Hugo Kerfuffle and the Prescience of “Opera Vita Aeterna”</b></p><p>    Finally, I wish to end on a somewhat humorous note. And this particular bit of humor arises from the fact that Day’s novelette “Opera Vita Aeterna” did, in a way, “predict” what would happen to Day and his novelette if it was nominated for a Hugo Award. Now, what do I mean by this? I mean that in the novelette, the demon entity that wants the elven mage to return to his homeland is embarrassed and dismayed that the elven mage would ever want to consort amongst the filthy, disgusting, and bigoted humans. Indeed, this evil entity does his utmost to ensure that the elven mage returns to his rightful place, even if doing so means harming the humans in the process. And, in a way, we are actually seeing the same sort of thing in the kerfuffle that has arisen since Day’s nomination for the Hugo Award. Many people are embarrassed and dismayed that something like the Hugo Awards would sully itself by consorting with the literary works of an alleged “bigot” and “racist” like Day. Furthermore, many individuals are striving to do their utmost to ensure that Day’s work does not win the award or at least that it is never considered for an award again. Indeed, instead of sitting, reading, and debating Day’s work, and instead of overcoming their sense of “offendedness” in order to consider Day’s ideas rationally and fully, they simply wish to marginalize Day and vote him down, much like the evil entity in Day’s novelette does not even wish to consider the ideas that the humans have to offer, but rather it simply wishes to marginalize the humans and destroy their standing. So I have to admit, I thought that this parallel between Day’s story and what is happening to Day in real-life was humorous enough, in a sad sort of way, that it merited being pointed out.</p></blockquote><p>Despite reality repeatedly trumping her previous failure of imagination, Ms Sutherland made it clear that no matter what was said, she would remain utterly unmoved. In fact, <a href=\"http://nielsenhayden.com/makinglight/archives/015838.html#2232278\">she is still not persuaded</a> to read my work, not so much as even a single novelette. She concludes with an announcement that her mind is firmly closed, along with a shot aimed at the readers of this blog.</p><blockquote class=\"tr_bq\"><p> First of all, I gather my statement at <b>349</b> has been<br> posted as some kind of a challenge somewhere out in the Daysienet.<br> Whilst I appreciate the courtesy that most of the respondents have shown<br> coming here, frankly, the responses do not work for me.</br></br></br></p><p>Indeed, they’ve proven that it’s not worth reading any more of them;<br> Day’s world-building, plotting, and characterization, as described, are<br> really not going to be my cup of tea.  This is even aside from the other<br> issues I have with his behavior in our community (and the rather weird<br> personal dynamics of the community he’s gathered around him).</br></br></br></br></p><p>So thank you, but no thanks.  And when I say <i>no thanks</i>, I mean, <i>and further attempts will be put to the moderation queue, because it’s getting repetitive and rather tiresome.</i></p><p>Secondly, anyone who posts one of these will have all of their comments sent to the moderation queue.</p><p>Thirdly, that means that I’d prefer that the community not respond to<br> them, because it’s not fair to respond to people who can’t answer back.<br> I acknowledge that there are many juicy hooks and useful things to be<br> said, but I’m running out of joy to moderate this discussion.</br></br></br></p></blockquote><p>So, it may be helpful to keep this response in mind when you are tempted to argue for moderation or the use of sweet reason in attempting to appeal to the unreasonable. Not only will they not listen, they will intentionally fail to understand every argument presented. They are not intellectuals, they are ideologues and they are incapable of dialectic. The fact that they often frame their rhetoric in the form of pseudo-dialectic should not mislead you into thinking they are capable of rising above the rhetorical level.</p><p>I observe that Ms Sutherland does not appear to have  loved, adored, or enjoyed the heck out of the very thing she implicitly requested. This is because she is a wormtongue, her words mean nothing to her, and she will never stand by them or accept accountability for them. Aristotle warned you of these people in his <i>Rhetoric</i>. I have repeatedly warned you of them myself. There can be no reconciliation with them because they only reconciliation they will accept is your unconditional and continual surrender to their dynamic petty totalitarianism.</p><p>This does not mean such efforts by Mr. Miska and the others were wasted or misguided. Never forget that for every unreasonable commenter who is unmovable, there are at least a score of silent readers whose opinions are not necessarily carved in stone.</p></div>",
  "content_text": "It has largely been forgotten that NK Jemisin’s attack on me in Australia was part of a nominal call for reconciliation in SF/F, and my response to her was a rejection of that call on the grounds of its impossibility. So, you can imagine the amusement that was provided by this exchange between RD Miksa and\none of the Torlings responsible\nfor Making Light after Ms Sutherland expressed her opinion concerning my fans inability to talk about what it is they enjoy about my books.\n(You know what I would love? adore? enjoy the heck out of?  A genuine Larry Correia fan coming here and\nenthusing\nabout the work.  Taking about what it\nis\n,\nnot what it is not; talking about why they love it rather than why they\nhate Librul SF and the Libruls who read it. And that is the difference\nbetween Correia and Day, in my view.  I can’t picture a Day fan doing\nthat and making it work.)\nTo which\nMr. Miksa’s response\nwas only the most detailed of several, including those from\nMendoscot\n,\nDaniel\n,\nWhitebirch\n,\nEric Ashley\n,\nTrev006\n,\nScottishmentat\n, and\nA VD Fan\n, to attempt the very thing Ms Sutherland could not picture. Note that he goes into some detail, so if you still have not read Opera Vita Aeterna at this point, you may wish to avoid what follows the jump:\nEarlier in this discussion, one of the Site Administrators contended that she could not imagine a fan of Vox Day entering this forum and genuinely “enthusing” about his work. Indeed, she essentially claimed that she simply could not picture a Vox Day fan explaining why they like his writing while also making that explanation “work.”\nNow, while it is out of my control as to whether or not the reader decides that my explanation “works”—for what “works” as an explanation, especially when dealing with literary matters, is essentially a subjective matter—it is obviously within my power to explain why I like Day’s writing. And so, I am more than willing to provide my reasons for why I enjoy Day’s literary products. At the same time, I would also like to articulate a few points which I believe are not only highly relevant to this whole discussion surrounding Day’s work and his Hugo nomination, but which should also make certain individuals pause and perhaps reflect upon whether their negative assessment of Day’s character is wholly accurate. In essence, what I will point out is that the very content and ideas embedded in Day’s fiction actually serve as some evidence against the negative epithets (bigot, racist, etc.) that so many people are trying to label him with. Indeed, I contend that many people are so blinded by what they think Day is saying, that they do not realize that his very own fictional works provide us with some evidence that Day’s ideas are very often more nuanced and subtle than what his opponents would wish people to believe.\nFinally, let me just note that since the current debate over Vox Day and his writings has stemmed from his novelette “Opera Vita Aeterna” being nominated for a Hugo Award, I will thus use this novelette as the basis for all my points. I do so for two reasons. First, since this particular novelette is currently being considered for a Hugo Award, it is, at the present time, arguably Day’s most important and prominent work of fiction, thus making it fully appropriate to focus my comments on that particular story. And second, since Day is offering that particular work of fiction for free off his website, anyone and everyone can thus access it, read it for themselves, and determine if the points that I articulate actually match the story.\nSo, with this introduction articulated, on to the meat of the matter.\nWhy I Greatly Enjoyed “Opera Vita Aeterna”\nNow, while it is the case that previous commentators have summarized Day’s novelette, let me also do so briefly in order to ensure that we are all on the same page. In essence, “Opera Vita Aeterna” is—in my own words—the story of the land’s most powerful elven mage encountering a religious man of such power and might, that the elven mage, after killing the man, leaves everything he has ever known behind and engages on a quest to find the source of the man’s power, which is God Himself. This quest leads the elven mage to a small religious abbey where he meets with the monks and the local Abbot. Over time, and as they spar over theological and philosophical issues, a tentative friendship grows between the elven mage and the Abbot. However, in the background, a demonic entity, who despises humans in general, and the monks in particular, is constantly striving to have the elven mage return to his homeland. Then, at a certain point, and in an effort to make the elven mage return home, the demonic entity has a group of goblins wipe out the whole abbey while the elven mage is gone. Upon his return, the elven mage finds all the monks killed. In particular, he finds the Abbot murdered right beneath a cross. Seeming this, and screaming at the apparent impotence and apathy of the God of Men, the elven mage demands that God grant the Abbot a place in the afterlife. The story then fast-forwards to a point where it becomes clear that the friendship between the elven mage and the Abbot, and the theological work that this friendship produced, have become critical to the development of the Church as a whole.\nNow, with this summary complete, let me articulate just some of the reasons why I greatly enjoyed this particular novelette.\nFirst, in many ways, the novelette seamlessly blends non-fiction with fiction. What do I mean? I mean that as part of the novelette, we are treated to brief theological and philosophical debates which stimulate the mind and the intellect in a way that most other works do not. Indeed, just as many philosophers in the past would use a dialogue format to bring out their philosophical points, Day does the same thing, but he does so in a manner that does not detract from the story itself. And while I have no doubt that not everyone wants to have a philosophical debate serve as part of a fictional story, I can say that for those of us that do enjoy that type of a narrative, Day does it very well.\nSecond, Day has, in my view, an uncanny ability to combine his fantasy setting with historical accuracy. Now again, what do I mean? I mean that even though Day’s story deals with elves, and goblins, and so on, his depictions of monks and life in the abbey are grounded in the historical reality of how things actually were hundreds of years ago. This, in turn, almost makes it feel like you are receiving a historical education while enjoying a fantastical setting. And once again, while some individuals may not like this strategy of melding historical fiction with fantasy, for those of us that do, Day does did extremely well.\nThird, Day’s novelette makes you think about life’s deepest questions. In fact, even more so than just this, for people of religious faith, Day’s novelette literally makes you question your religious convictions. Why? Because this novelette does not have a happy ending. It does not give you any easy answers. In fact, if anything, at the end of the novelette, you can sympathize with the atheistic elven mage when he looks up at the cross and curses the apparently weak, impotent, and distant God depicted there. So it is the case that this novelette, short as it may be, makes you think long and hard about the big questions: God, the afterlife, the existence of evil, morality, mortality, the problem of evil, the apparent problem of divine hiddenness, and so on. And since I like to think about these questions, and since I enjoy fiction that makes these questions central, I enjoyed seeing them in Day’s novelette. In addition, I might point out that it is surprising that Day, being a Christian, ends this novelette in the way that he does. You might have expected him to have provided some type of divine intervention to close the story, thus making it more palpable to those of faith. But instead, once you are done reading, you cannot help that think that the atheist elven mage is quite justified in cursing any God who would allow such evil to happen to his own followers. So Day is not afraid to be bold and to go against the grain of his own beliefs, at least partially, when the story requires it.\nFinally, Day is quite capable in establishing an imaginative setting and in describing it clearly, thus making it easy and enjoyable to picture where and when the story unfolds. I also found the characters to be well-described and that the dialogue matched the traits of the characters very well. So, from a stylistic perspective, I found the story to be more than competent.\nThese, therefore, are but some of the reasons that I enjoyed Day’s novelette. And let me add that, in my view, his novelette is not even his best work. For that, you would need to read A Throne of Bones, which was a work that I devoured in less than two days.\nWhy “Opera Vita Aeterna” Should Make You Think Twice about Vox Day.\nI mentioned earlier that I believe that Day’s fictional work provides his opponents with some evidence that should make them pause and re-think their negative assessment of Day. And while Vox Day needs absolutely no help in defending himself, I nevertheless wish to point out in what way I believe that Day’s novelette does indeed provide evidence against the harsh assessment of his character that is being made by so many individuals. And given that Day has been labeled—by some individuals who disagree with him on certain issues—with just about every single negative and undesirable character trait imaginable in our current cultural climate, it may seem that my claim that Day’s writing should make his opponents re-assess their negative opinion of him somewhat difficult to accept. Nevertheless, I will still offer my reasoning in this matter.\nInitially, let us start with the reasonable assumption that an author’s personal beliefs, ideas, and philosophy will permeate his writing to some greater or lesser extent. In fact, many people refuse to read Day’s work precisely because they not only object to his views in general, but also because they believe that his fiction will be permeated with those views. And yet, when I read “Opera Vita Aeterna”, some very interesting aspects of the story became particularly prominent given the negative claims being made about Day. And these aspects of the story were all the more interesting in light of fact that they do, at least in part, reflect Day’s views. So let me list just a few of these interesting story elements.\nFirst, Day is often labeled as something of a cultural supremacist who is bigoted against non-Western, non-Christian cultures. And yet, in his novelette, what we see is that the Abbot is more than willing to learn and grow from his interactions with the elven mage. In fact, the story literally shows that the Abbot himself, through his long-time interaction with the elven mage, comes to the essentially heretical view that elves have souls, even though this view is not accepted by the Church. At the same time, in the story, the theological interactions between the Abbot and the pagan elven mage, which are written down by the Abbot, eventually become a document that is of great theological significance to the Church, just as the interactions of Saint Thomas Aquinas with the pagan works of Aristotle were of great importance to the actual Church. And what I think that this shows is that Day’s ideas of how cultures interact, and the benefits of such cultural interactions, are subtle, nuanced, and are not so easily categorized as just being an expression of “western cultural supremacism.” His novelette shows the two main characters have a deep respect and tolerance for each other’s cultural tradition, even though there is a clear understanding that certain cultural elements are better than others. Thus, even though the Abbot can understand why the elven mage committed a mercy killing, the Abbot nevertheless still knows that his culture, in seeing such behaviour as a sin, is objectively better than the elven mage’s is. Thus, while Day’s characters have tolerance for each other, they do not let this tolerance dissolve into something as incoherent and indefensible as cultural relativism. So, tolerance and respect for differing cultures and customs is affirmed, but a relativistic out-look about truth, morality, and good is rejected.\nSecond, Day is often caricatured as someone unwilling to consider new ideas and as someone living in an echo-chamber. And while I have never seen Day back down from a debate, I would also point out that his story is precisely meant to show how two completely opposite individuals, with totally opposing views, can, through rational and controlled discussion, be able to think through issues and come to a closer understanding of the truth even though they start their debate at complete opposite sides of an issue. For indeed, at the start of the story, the Abbot literally believes that the elven mage, being soulless, is nothing more than an animal. And yet, through calm, rational discourse, and through their interactions, the Abbot changes his views about the soullessness of elves. At the same time, the elven mage gains a new-found respect for humanity and the intelligence and reasoning skills of human beings. And perhaps this aspect of the story is a cultural and social critique concerning how rational debate, even if harsh, offensive, and unpleasant, is needed in modern society instead of simply mud-slinging and labelling people as “bigots” and “racists” without truly understanding their arguments. After all, it would not be hard to imagine that had another author written Day’s story, then the moment that the elven mage realized that the Abbot considered elves little more than animals, the Abbot would have been labeled a racist bigot who was unworthy of further discussion, consideration, or debate. By contrast, in Day’s version, the elven mage, though offended at being considered little more than an animal, does not shy away from discussing and rationally debating the issue with the Abbot. This is thus a lesson: a view may be offensive and distasteful, but it may also be true, and we will never learn about whether or not that view is true unless we not only engage with the proponents of that view, but also engage with them in a manner that is as impartial as possible, that does not straw-man their arguments, and that seeks to properly understand their point-of-view before condemning it.\nThird, even though Day is known as a vociferous opponent of theistic unbelief, his story is nevertheless quite sympathetic to the frustration and anger that many individuals feel towards God. He articulates well the emotions and circumstances that would make a person scream at God and curse Him. So again, this fact shows that Day’s views on the subject of God are subtle, and that while he is an opponent of unbelief, he understands it well enough that he can sympathize with the reasoning and emotion behind such unbelief.\nNow, what these few points are meant to show is that Day’s work is more subtle and nuanced than is normally given credit for. There are themes in his work which show precisely the opposite of bigotry and racism, but rather illustrate how friendship and cultural understanding can develop even in hard circumstances. And as his work is, no doubt, at least a partial reflection of his ideas and thoughts, then this fact should make the individuals that decry him as a bigoted racist truly wonder whether their assessment of him is as accurate as they think. Have they truly considered his arguments or are they just “straw-manning” what he says? Have they looked into the subtleties of his views or have they just scratched the surface of his views and then prematurely labeled him as a “bigot”, etc.? Have they taken his points in the fullness of their context or rather, have they taken quotes out-of-context to make Day’s views appear much worse than they are? Do they understand that Day often employs rhetorical and “for-the-sake-of-argument” argumentative techniques to make his point, or do they rather disregard that fact and simply try to use whatever they can to make Day appear as bad as possible? These are, I contend, valid questions, and those individuals that deride Vox Day should honestly ask and answer these questions for themselves.\nThe Hugo Kerfuffle and the Prescience of “Opera Vita Aeterna”\nFinally, I wish to end on a somewhat humorous note. And this particular bit of humor arises from the fact that Day’s novelette “Opera Vita Aeterna” did, in a way, “predict” what would happen to Day and his novelette if it was nominated for a Hugo Award. Now, what do I mean by this? I mean that in the novelette, the demon entity that wants the elven mage to return to his homeland is embarrassed and dismayed that the elven mage would ever want to consort amongst the filthy, disgusting, and bigoted humans. Indeed, this evil entity does his utmost to ensure that the elven mage returns to his rightful place, even if doing so means harming the humans in the process. And, in a way, we are actually seeing the same sort of thing in the kerfuffle that has arisen since Day’s nomination for the Hugo Award. Many people are embarrassed and dismayed that something like the Hugo Awards would sully itself by consorting with the literary works of an alleged “bigot” and “racist” like Day. Furthermore, many individuals are striving to do their utmost to ensure that Day’s work does not win the award or at least that it is never considered for an award again. Indeed, instead of sitting, reading, and debating Day’s work, and instead of overcoming their sense of “offendedness” in order to consider Day’s ideas rationally and fully, they simply wish to marginalize Day and vote him down, much like the evil entity in Day’s novelette does not even wish to consider the ideas that the humans have to offer, but rather it simply wishes to marginalize the humans and destroy their standing. So I have to admit, I thought that this parallel between Day’s story and what is happening to Day in real-life was humorous enough, in a sad sort of way, that it merited being pointed out.\nDespite reality repeatedly trumping her previous failure of imagination, Ms Sutherland made it clear that no matter what was said, she would remain utterly unmoved. In fact,\nshe is still not persuaded\nto read my work, not so much as even a single novelette. She concludes with an announcement that her mind is firmly closed, along with a shot aimed at the readers of this blog.\nFirst of all, I gather my statement at\n349\nhas been\nposted as some kind of a challenge somewhere out in the Daysienet.\nWhilst I appreciate the courtesy that most of the respondents have shown\ncoming here, frankly, the responses do not work for me.\nIndeed, they’ve proven that it’s not worth reading any more of them;\nDay’s world-building, plotting, and characterization, as described, are\nreally not going to be my cup of tea.  This is even aside from the other\nissues I have with his behavior in our community (and the rather weird\npersonal dynamics of the community he’s gathered around him).\nSo thank you, but no thanks.  And when I say\nno thanks\n, I mean,\nand further attempts will be put to the moderation queue, because it’s getting repetitive and rather tiresome.\nSecondly, anyone who posts one of these will have all of their comments sent to the moderation queue.\nThirdly, that means that I’d prefer that the community not respond to\nthem, because it’s not fair to respond to people who can’t answer back.\nI acknowledge that there are many juicy hooks and useful things to be\nsaid, but I’m running out of joy to moderate this discussion.\nSo, it may be helpful to keep this response in mind when you are tempted to argue for moderation or the use of sweet reason in attempting to appeal to the unreasonable. Not only will they not listen, they will intentionally fail to understand every argument presented. They are not intellectuals, they are ideologues and they are incapable of dialectic. The fact that they often frame their rhetoric in the form of pseudo-dialectic should not mislead you into thinking they are capable of rising above the rhetorical level.\nI observe that Ms Sutherland does not appear to have  loved, adored, or enjoyed the heck out of the very thing she implicitly requested. This is because she is a wormtongue, her words mean nothing to her, and she will never stand by them or accept accountability for them. Aristotle warned you of these people in his\nRhetoric\n. I have repeatedly warned you of them myself. There can be no reconciliation with them because they only reconciliation they will accept is your unconditional and continual surrender to their dynamic petty totalitarianism.\nThis does not mean such efforts by Mr. Miska and the others were wasted or misguided. Never forget that for every unreasonable commenter who is unmovable, there are at least a score of silent readers whose opinions are not necessarily carved in stone.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-27T16:00:00+00:00"
}