{
  "url": "https://voxday.net/2014/04/20/opera-vita-aeterna/",
  "scraped_at": "2025-12-15T16:53:25.588767",
  "title": "Opera Vita Aeterna",
  "date_display": "April 20, 2014",
  "date_iso": "2014-04-20T17:00:00+00:00",
  "date_from_url": "2014-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.voxday.net/mart/VD_opera.epub\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/opera_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/04/opera_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>I’ve been informed that it is customary to make Hugo-nominated works freely available to the public during the voting stage, so here is <b><a href=\"http://www.voxday.net/mart/VD_opera.epub\">“OPERA VITA AETERNA”</a></b>, a nominee for the 2014 Hugo Award for Best Novelette. Click on the title link or on the cover image to download the free epub. If you prefer Kindle format, there is also <a href=\"http://www.voxday.net/mart/VD_opera.mobi\">a mobi version available</a> for download.</p><p>There has been a fair amount of discussion of the novelette online, almost entirely by people who not only have not read it, but know absolutely nothing about it. I would suggest that anyone who is genuinely interested in excellence in SF/F literature simply read the work and judge it on its merits. And for those who are more interested in thought-policing the genre, they can simply do as some have suggested, “rank a nominated work below “No Award””, and thereby provide us with an accurate measure of the degree to which SF/F fandom is influenced by the politically correct Left.</p><p>From the Amazon reviews of <b><i><a href=\"http://www.amazon.com/The-Last-Witchking-Vox-Day-ebook/dp/B00I45AE1I/ref=cm_cr_pr_product_top\">THE LAST WITCHKING</a></i></b>:</p><ul><li>The masterpiece of the trio, though, is Opera Vita Aeterna. At its core<br> is the dialogue between an aging monk and a long-lived elven sorcerer in<br> unwitting search of his own salvation. Day again employs both allegory<br> and tremendous subtlety as the more experienced and intelligent elf is<br> perplexed and impressed by the power of eternal truth. Aeterna is both<br> clever and touching and might be the best story Day has produced to<br> date. </br></br></br></br></br></br></li><li>Opera Vita Aeterna: This is a brilliant, five-star story, and the<br> best in the book, in my opinion. For me to rate a story as brilliant,<br> it must be beautifully written, have complex characters, and leave me<br> with a note of lingering intangibility. The elf Bessarias is on a quest<br> for God, whom he doesn’t necessarily find. Through his searching,<br> though, he leaves an important legacy behind him. There lies the<br> intangibility–no personal, cathartic moment, but, instead, a glimpse of<br> something far greater.</br></br></br></br></br></br></br></li><li>Opera Vita Aeterna is a deeply catholic work of the height of beauty,<br> the power of events long after the events are forgotten, and the<br> complexity and density of the Christian model of hope. Its most elegant<br> turn is its ability to transform a deft and intriguing story about a<br> strange sorcerer’s encounter with a rural cloister into a meditation on<br> the nature of eternity. It is rare to describe a story as both<br> restrained and florid, but its details are so rich and believable and<br> its voice is so even. Read it, then read it again after reading Summa<br> Elvetica.</br></br></br></br></br></br></br></br></li><li>All too brief, it balances the darkness of this book’s title story with a<br> reminder that though darkness may engulf the world and seem to triumph,<br> within the light there is a power that endures, which darkness cannot<br> comprehend. All together, The Last Witchking is a significant offering by Vox, one I am still digesting and will read again.</br></br></br></li></ul></div>",
  "content_text": "I’ve been informed that it is customary to make Hugo-nominated works freely available to the public during the voting stage, so here is\n“OPERA VITA AETERNA”\n, a nominee for the 2014 Hugo Award for Best Novelette. Click on the title link or on the cover image to download the free epub. If you prefer Kindle format, there is also\na mobi version available\nfor download.\nThere has been a fair amount of discussion of the novelette online, almost entirely by people who not only have not read it, but know absolutely nothing about it. I would suggest that anyone who is genuinely interested in excellence in SF/F literature simply read the work and judge it on its merits. And for those who are more interested in thought-policing the genre, they can simply do as some have suggested, “rank a nominated work below “No Award””, and thereby provide us with an accurate measure of the degree to which SF/F fandom is influenced by the politically correct Left.\nFrom the Amazon reviews of\nTHE LAST WITCHKING\n:\nThe masterpiece of the trio, though, is Opera Vita Aeterna. At its core\nis the dialogue between an aging monk and a long-lived elven sorcerer in\nunwitting search of his own salvation. Day again employs both allegory\nand tremendous subtlety as the more experienced and intelligent elf is\nperplexed and impressed by the power of eternal truth. Aeterna is both\nclever and touching and might be the best story Day has produced to\ndate.\nOpera Vita Aeterna: This is a brilliant, five-star story, and the\nbest in the book, in my opinion. For me to rate a story as brilliant,\nit must be beautifully written, have complex characters, and leave me\nwith a note of lingering intangibility. The elf Bessarias is on a quest\nfor God, whom he doesn’t necessarily find. Through his searching,\nthough, he leaves an important legacy behind him. There lies the\nintangibility–no personal, cathartic moment, but, instead, a glimpse of\nsomething far greater.\nOpera Vita Aeterna is a deeply catholic work of the height of beauty,\nthe power of events long after the events are forgotten, and the\ncomplexity and density of the Christian model of hope. Its most elegant\nturn is its ability to transform a deft and intriguing story about a\nstrange sorcerer’s encounter with a rural cloister into a meditation on\nthe nature of eternity. It is rare to describe a story as both\nrestrained and florid, but its details are so rich and believable and\nits voice is so even. Read it, then read it again after reading Summa\nElvetica.\nAll too brief, it balances the darkness of this book’s title story with a\nreminder that though darkness may engulf the world and seem to triumph,\nwithin the light there is a power that endures, which darkness cannot\ncomprehend. All together, The Last Witchking is a significant offering by Vox, one I am still digesting and will read again.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-20T16:00:00+00:00"
}