{
  "url": "https://voxday.net/2014/04/04/the-true-culprits/",
  "scraped_at": "2025-12-15T16:51:42.732779",
  "title": "The true culprits",
  "date_display": "April 4, 2014",
  "date_iso": "2014-04-04T08:44:00+00:00",
  "date_from_url": "2014-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I predicted when the issue first went public, <a href=\"http://recode.net/2014/04/03/mozilla-co-founder-brendan-eich-resigns-as-ceo-and-also-from-foundation-board/\">Brandon Eich was not saved by his desperate supplication</a> to his critics. But as awful as those critics are, they are not the real culprits in L’affaire d’Eich:</p><blockquote class=\"tr_bq\"><p> Brendan Eich, the well-known techie who has gotten swept up in a controversy about his support of California’s anti-gay marriage law Proposition 8, is resigning as CEO of for-profit Mozilla Corporation and also from the board of the nonprofit foundation which wholly owns it.</p><p>Mozilla confirmed the change in a blog post.</p><p>“Mozilla prides itself on being held to a different standard and, this past week, we didn’t live up to it. We know why people are hurt and angry, and they are right: it’s because we haven’t stayed true to ourselves,” read the post, in part. “We didn’t act like you’d expect Mozilla to act. We didn’t move fast enough to engage with people once the controversy started. We’re sorry. We must do better.”</p><p>In several interviews this week, Eich had insisted that he would not step down from the job he was only recently appointed to, due to the intense backlash over a $1,000 donation he made in 2008 in support of the ballot measure to ban gay marriage.</p><p>“So I don’t want to talk about my personal beliefs because I kept them out of Mozilla all these 15 years we’ve been going,” he said to the Guardian, for example, yesterday. “I don’t believe they’re relevant.”</p><p>Not so, of course. In an interview this morning, Mozilla Executive Chairwoman Mitchell Baker said that Eich’s ability to lead the company that makes the Firefox Web browser had been badly damaged by the continued scrutiny over the hot-button issue, which had actually been known since 2012 inside the Mozilla community.</p><p>“It’s clear that Brendan cannot lead Mozilla in this setting,” said Baker, who added that she would not and could not speak for Eich. “The ability to lead — particularly for the CEO — is fundamental to the role and that is not possible here.”</p></blockquote><p>Now, while it was both wrong and dangerous for the gay fascists to go after Eich, I’m not interested in that aspect of the case here. What is more informative is Eich’s hapless response to the attacks. As I said at the time, Eich’s immediate response should have been to fire his internal critics for insubordination and to attack his external critics through the media. That’s what an effective leader like Steve Jobs or Bill Gates would have done; a leader never backs down from a defensive fight.</p><p>I suspect his critics knew that Eich was weak, both in terms of the lukewarm support he enjoyed from the Mozilla board as well as his personal character. All one had to do was look at his face to see that he is a pleaser, and pleasers tend to handle conflict by immediately resorting to submission. When attacked, they grovel and plead, they don’t fight back.</p><p>The fact is that most people focus on attacking soft targets they believe to be safe and weak. Look at how few bloggers openly criticize me anymore, or even dare to mention my name. Where are all the World o’Craps and Dark Windows and Amandas and PZ Myers and Scienceblogs and Electrolytes and Hayden Nielsens and John Scalzis now? Are we to believe I am simply beneath notice? That seems unlikely given that they were all attacking me directly, by name and with links, when my blog readership was ONE-SIXTH what it is now. The primary difference is that it is now generally appreciated that I am a hard target, and what is more, a hard target that doesn’t hesitate to shoot back.</p><p>Eich was a safe and soft target. He made it clear that he wouldn’t return fire despite his position of power, which emboldened all the critics who might have otherwise feared his potential power, influence, and ability to fire them. So, they promptly piled on, Eich couldn’t take the heat, and promptly resigned. Eich was doomed from the moment of that first inept response because you cannot win a battle when you refuse to take the field.</p><p>The irony is that although they have damaged American corporate culture by sowing seeds that will bear destructive fruit for years and decades to come, Eich’s critics did Mozilla a genuine service by exposing the mistake that was made in promoting a man who had been a very effective technology innovator to the CEO position. Eich was less a victim of the point-and-shriek crowd than the Peter Principle, which states: “in a hierarchy every employee tends to<br> rise to their level of incompetence”.</br></p><p>And now Mozilla is out a perfectly good CTO, Eich has been humiliated and is unemployed, the left-wing lunatics have been encouraged by successfully taking a scalp, and every Christian and conservative in corporate America now knows that it is purge or be purged time. (Don’t forget, small business owners, it is legal under federal law to fire an employee for his Democratic Party affiliations.) All because the Mozilla board did not know its internal candidate well enough to realize that he lacked the backbone to be a CEO-caliber leader. </p><p>That is why the true culprits here are the board members. First they picked the wrong man, then they failed to have his back when he came under fire. This does not bode well for Mozilla.</p></div>",
  "content_text": "As I predicted when the issue first went public,\nBrandon Eich was not saved by his desperate supplication\nto his critics. But as awful as those critics are, they are not the real culprits in L’affaire d’Eich:\nBrendan Eich, the well-known techie who has gotten swept up in a controversy about his support of California’s anti-gay marriage law Proposition 8, is resigning as CEO of for-profit Mozilla Corporation and also from the board of the nonprofit foundation which wholly owns it.\nMozilla confirmed the change in a blog post.\n“Mozilla prides itself on being held to a different standard and, this past week, we didn’t live up to it. We know why people are hurt and angry, and they are right: it’s because we haven’t stayed true to ourselves,” read the post, in part. “We didn’t act like you’d expect Mozilla to act. We didn’t move fast enough to engage with people once the controversy started. We’re sorry. We must do better.”\nIn several interviews this week, Eich had insisted that he would not step down from the job he was only recently appointed to, due to the intense backlash over a $1,000 donation he made in 2008 in support of the ballot measure to ban gay marriage.\n“So I don’t want to talk about my personal beliefs because I kept them out of Mozilla all these 15 years we’ve been going,” he said to the Guardian, for example, yesterday. “I don’t believe they’re relevant.”\nNot so, of course. In an interview this morning, Mozilla Executive Chairwoman Mitchell Baker said that Eich’s ability to lead the company that makes the Firefox Web browser had been badly damaged by the continued scrutiny over the hot-button issue, which had actually been known since 2012 inside the Mozilla community.\n“It’s clear that Brendan cannot lead Mozilla in this setting,” said Baker, who added that she would not and could not speak for Eich. “The ability to lead — particularly for the CEO — is fundamental to the role and that is not possible here.”\nNow, while it was both wrong and dangerous for the gay fascists to go after Eich, I’m not interested in that aspect of the case here. What is more informative is Eich’s hapless response to the attacks. As I said at the time, Eich’s immediate response should have been to fire his internal critics for insubordination and to attack his external critics through the media. That’s what an effective leader like Steve Jobs or Bill Gates would have done; a leader never backs down from a defensive fight.\nI suspect his critics knew that Eich was weak, both in terms of the lukewarm support he enjoyed from the Mozilla board as well as his personal character. All one had to do was look at his face to see that he is a pleaser, and pleasers tend to handle conflict by immediately resorting to submission. When attacked, they grovel and plead, they don’t fight back.\nThe fact is that most people focus on attacking soft targets they believe to be safe and weak. Look at how few bloggers openly criticize me anymore, or even dare to mention my name. Where are all the World o’Craps and Dark Windows and Amandas and PZ Myers and Scienceblogs and Electrolytes and Hayden Nielsens and John Scalzis now? Are we to believe I am simply beneath notice? That seems unlikely given that they were all attacking me directly, by name and with links, when my blog readership was ONE-SIXTH what it is now. The primary difference is that it is now generally appreciated that I am a hard target, and what is more, a hard target that doesn’t hesitate to shoot back.\nEich was a safe and soft target. He made it clear that he wouldn’t return fire despite his position of power, which emboldened all the critics who might have otherwise feared his potential power, influence, and ability to fire them. So, they promptly piled on, Eich couldn’t take the heat, and promptly resigned. Eich was doomed from the moment of that first inept response because you cannot win a battle when you refuse to take the field.\nThe irony is that although they have damaged American corporate culture by sowing seeds that will bear destructive fruit for years and decades to come, Eich’s critics did Mozilla a genuine service by exposing the mistake that was made in promoting a man who had been a very effective technology innovator to the CEO position. Eich was less a victim of the point-and-shriek crowd than the Peter Principle, which states: “in a hierarchy every employee tends to\nrise to their level of incompetence”.\nAnd now Mozilla is out a perfectly good CTO, Eich has been humiliated and is unemployed, the left-wing lunatics have been encouraged by successfully taking a scalp, and every Christian and conservative in corporate America now knows that it is purge or be purged time. (Don’t forget, small business owners, it is legal under federal law to fire an employee for his Democratic Party affiliations.) All because the Mozilla board did not know its internal candidate well enough to realize that he lacked the backbone to be a CEO-caliber leader.\nThat is why the true culprits here are the board members. First they picked the wrong man, then they failed to have his back when he came under fire. This does not bode well for Mozilla.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-04T07:44:00+00:00"
}