{
  "url": "https://voxday.net/2014/04/17/the-unstoppable-terrorist-plan/",
  "scraped_at": "2025-12-15T16:53:07.244778",
  "title": "The unstoppable terrorist plan",
  "date_display": "April 17, 2014",
  "date_iso": "2014-04-17T20:00:00+00:00",
  "date_from_url": "2014-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Al-Qaeda would certainly be wise to heed Napoleon’s famous maxim: “when your enemy is executing a false movement, <a href=\"http://www.theonion.com/articles/fbi-uncovers-alqaeda-plot-to-just-sit-back-and-enj,35788/\">never interrupt him</a>.”</p><blockquote class=\"tr_bq\"><p> Putting the nation on alert against what it has described as a<br> “highly credible terrorist threat,” the FBI announced today that it has<br> uncovered a plot by members of al-Qaeda to sit back and enjoy themselves<br> while the United States collapses of its own accord.</br></br></br></p><p>Multiple<br> intelligence agencies confirmed that the militant Islamist organization<br> and its numerous affiliates intend to carry out a massive, coordinated<br> plan to stand aside and watch America’s increasingly rapid decline, with<br> terrorist operatives across the globe reportedly mobilizing to take it<br> easy, relax, and savor the spectacle as it unfolds.</br></br></br></br></br></p><p>“We have<br> intercepted electronic communication indicating that al-Qaeda members<br> are actively plotting to stay out of the way while America as we know it<br> gradually crumbles under the weight of its own self-inflicted debt and<br> disrepair,” FBI Deputy Director Mark F. Giuliano told the assembled<br> press corps. “If this plan succeeds, it will leave behind a nation with a<br> completely dysfunctional economy, collapsing infrastructure, and a<br> catastrophic health crisis afflicting millions across the nation. We<br> want to emphasize that this danger is very real.”</br></br></br></br></br></br></br></br></p></blockquote><p>And if Al-Qaeda truly wanted to speed up America’s decline and fall, they could do no better than to provide more capital to the financial companies that are relentlessly pillaging the American economy while donating heavily to pro-immigration groups.</p></div>",
  "content_text": "Al-Qaeda would certainly be wise to heed Napoleon’s famous maxim: “when your enemy is executing a false movement,\nnever interrupt him\n.”\nPutting the nation on alert against what it has described as a\n“highly credible terrorist threat,” the FBI announced today that it has\nuncovered a plot by members of al-Qaeda to sit back and enjoy themselves\nwhile the United States collapses of its own accord.\nMultiple\nintelligence agencies confirmed that the militant Islamist organization\nand its numerous affiliates intend to carry out a massive, coordinated\nplan to stand aside and watch America’s increasingly rapid decline, with\nterrorist operatives across the globe reportedly mobilizing to take it\neasy, relax, and savor the spectacle as it unfolds.\n“We have\nintercepted electronic communication indicating that al-Qaeda members\nare actively plotting to stay out of the way while America as we know it\ngradually crumbles under the weight of its own self-inflicted debt and\ndisrepair,” FBI Deputy Director Mark F. Giuliano told the assembled\npress corps. “If this plan succeeds, it will leave behind a nation with a\ncompletely dysfunctional economy, collapsing infrastructure, and a\ncatastrophic health crisis afflicting millions across the nation. We\nwant to emphasize that this danger is very real.”\nAnd if Al-Qaeda truly wanted to speed up America’s decline and fall, they could do no better than to provide more capital to the financial companies that are relentlessly pillaging the American economy while donating heavily to pro-immigration groups.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-17T19:00:00+00:00"
}