{
  "url": "https://voxday.net/2014/04/11/the-abuse-lottery-of-public-schoo/",
  "scraped_at": "2025-12-15T16:52:25.184984",
  "title": "The abuse-lottery of public school",
  "date_display": "April 11, 2014",
  "date_iso": "2014-04-11T08:19:00+00:00",
  "date_from_url": "2014-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a useful statistic about <a href=\"http://chicago.cbslocal.com/2014/04/07/study-middle-school-sex-harassment-widespread-goes-unnoticed-at-school/\">sexual harassment in junior high</a> to keep in your pocket the next time you are asked about homeschooling:</p><blockquote class=\"tr_bq\"><p> An alarming number of instances of inappropriate sexual behavior among middle school students appear to be going unnoticed by teachers and other adults, a new study concludes. The study, written by three University of Illinois researchers, found that 21 percent of the students in the survey experienced some form of physical sexual harassment.</p><p>The students reported instances like being slapped on the buttocks, being rubbed against their bodies sexually or being forced to kiss another student. Much of the behavior happened in open areas, most commonly in the hallways, classrooms or gymnasiums.</p></blockquote><p>And that’s just in junior high. Combine it with four more years high school and the fact that “9.6 percent of students in a national survey reported experiencing<br> educator sexual abuse at some point<br> in their previous k-12 school years”, and there is <i>at least</i> a one-in-three chance that your public school-attending child will be either sexually harassed or sexually abused at school.</br></br></p><p>The irony, of course, is that many of the same people who go nuclear over minor sexual harassment in the workplace will attempt to minimize the significance of sexual harassment at school, as if pre-teen children are more capable of dealing with it than adults.</p><p>One-in-five schoolchildren sexually harassed by other kids by the time they finish junior high. One-in-three schoolchildren sexually harassed or sexually abused by the time they graduate from high school. How little does a mother care about her children that she would voluntarily subject them to that abuse-lottery?</p></div>",
  "content_text": "This is a useful statistic about\nsexual harassment in junior high\nto keep in your pocket the next time you are asked about homeschooling:\nAn alarming number of instances of inappropriate sexual behavior among middle school students appear to be going unnoticed by teachers and other adults, a new study concludes. The study, written by three University of Illinois researchers, found that 21 percent of the students in the survey experienced some form of physical sexual harassment.\nThe students reported instances like being slapped on the buttocks, being rubbed against their bodies sexually or being forced to kiss another student. Much of the behavior happened in open areas, most commonly in the hallways, classrooms or gymnasiums.\nAnd that’s just in junior high. Combine it with four more years high school and the fact that “9.6 percent of students in a national survey reported experiencing\neducator sexual abuse at some point\nin their previous k-12 school years”, and there is\nat least\na one-in-three chance that your public school-attending child will be either sexually harassed or sexually abused at school.\nThe irony, of course, is that many of the same people who go nuclear over minor sexual harassment in the workplace will attempt to minimize the significance of sexual harassment at school, as if pre-teen children are more capable of dealing with it than adults.\nOne-in-five schoolchildren sexually harassed by other kids by the time they finish junior high. One-in-three schoolchildren sexually harassed or sexually abused by the time they graduate from high school. How little does a mother care about her children that she would voluntarily subject them to that abuse-lottery?",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-11T07:19:00+00:00"
}