{
  "url": "https://voxday.net/2014/04/24/the-nominees-speak/",
  "scraped_at": "2025-12-16T12:12:20.007225",
  "title": "The nominees speak",
  "date_display": "April 24, 2014",
  "date_iso": "2014-04-24T22:27:00+00:00",
  "date_from_url": "2014-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brad Torgersen, 2x 2014 Hugo nominee for Best Novella and Best Novelette, <a href=\"http://bradrtorgersen.wordpress.com/2014/04/24/fear-and-loathing-at-the-awards-table-3/\">weighs in on the Hugo kerfluffle</a>:</p><blockquote class=\"tr_bq\"><p> As has often been the case when I observe these kinds of things, I remain puzzled that the group which dubs itself “fandom” (in the parlance of the original Worldcons of yore) and which is always self-analyzing so as to determine how it can bring in more young fans, more diverse fans, and more energetic fans, could react so poorly to Larry Correia bringing Monster Hunter Nation to the Hugo nominations — as if the state of New York were aghast that the state of Texas showed up for a national party caucus during the run-up to a major election.</p><p>Isn’t bringing new people into old-school fandom part of the point of Worldcon?</p><p>But it wasn’t just Monster Hunter Nation that had certain people in fandom riled up. Wheel of Time fans managed to get the entire series (Jordan/Sanderson) on the ballot too — for Best Novel Hugo. Which is not precisely against the rules of the nomination process, but Wheel of Time is a massive series that is almost 30 years old. Seeing it in the Best Novel category alongside the other books for 2014 is highly unusual to say the least. So unusual, in fact, that some people in fandom have chosen to get upset about it; to the same degree those individuals in fandom are upset about Monster Hunter Nation getting the third installment in Larry Correia’s Hard Magic series onto the ballot, with Warbound: Book III of the Grimnoir Chronicles.</p><p>My response to the plaintiffs is: why not?</p></blockquote><p><a href=\"http://monsterhunternation.com/2014/04/24/an-explanation-about-the-hugo-awards-controversy/\">As does Larry Correia</a>, 2014 Hugo nominee for Best Novel:</p><blockquote class=\"tr_bq\"><p> Allow me to explain why the presence of my slate on the Hugo<br> nominations is so controversial. This is complicated and your time is<br> valuable, so short explanation first, longer explanation if you care<br> after.</br></br></br></p><p><b>Short Version:</b></p><ol><li>I said a chunk of the Hugo voters are biased toward the left, and<br> put the author’s politics far ahead of the quality of the work. Those<br> openly on the right are sabotaged. This was denied.</br></br></li><li>So I got some right wingers on the ballot.</li><li>The biased voters immediately got all outraged and mobilized to do exactly what I said they’d do.</li><li>Point made.</li></ol><p>I’ve said for a long time that the awards are biased against authors<br> because of their personal beliefs. Authors can either cheer lead for<br> left wing causes, or they can keep their mouth shut. Open disagreement<br> is not tolerated and will result in being sabotaged and slandered.<br> Message or identity politics has become far more important than<br> entertainment or quality. I was attacked for saying this. I knew that<br> when an admitted right winger got in they would be maligned and<br> politicked against, not for the quality of their art but rather for<br> their unacceptable beliefs.</br></br></br></br></br></br></br></br></p><p>If one of us outspoken types got nominated, the inevitable backlash,<br> outrage, and plans for their sabotage would be very visible. So I<br> decided to prove this bias and launched a campaign I called Sad Puppies<br> (because boring message fiction is the leading cause of Puppy Related<br> Sadness).</br></br></br></br></p><p>The Hugos are supposed to be about honoring the <i>best</i> works,<br> and many of the voters still take this responsibility very seriously. I<br> thank them for this. But basically the Hugos are a popularity contest<br> decided by the attendees of WorldCon. I am a popular writer, however my<br> fans aren’t typical WorldCon attendees. Anyone who pays to purchase a<br> WorldCon membership is allowed to vote. Other writers, bloggers, and<br> even publishing houses have encouraged their fans to get involved in the<br> nomination process before. I simply did the same thing. This<br> controversy arises only because my fans are the <i>wrong</i> kind of fans.</br></br></br></br></br></br></br></br></p></blockquote><p>It’s interesting to see how much more sane and reasonable both men sound than the Torlings and the shrieking pinkshirts offended that their little SF/F sanctum has been invaded by the ideologically impure. In any event, there is considerably more to both posts than the small portions I posted here, so don’t hesitate to click through.</p></div>",
  "content_text": "Brad Torgersen, 2x 2014 Hugo nominee for Best Novella and Best Novelette,\nweighs in on the Hugo kerfluffle\n:\nAs has often been the case when I observe these kinds of things, I remain puzzled that the group which dubs itself “fandom” (in the parlance of the original Worldcons of yore) and which is always self-analyzing so as to determine how it can bring in more young fans, more diverse fans, and more energetic fans, could react so poorly to Larry Correia bringing Monster Hunter Nation to the Hugo nominations — as if the state of New York were aghast that the state of Texas showed up for a national party caucus during the run-up to a major election.\nIsn’t bringing new people into old-school fandom part of the point of Worldcon?\nBut it wasn’t just Monster Hunter Nation that had certain people in fandom riled up. Wheel of Time fans managed to get the entire series (Jordan/Sanderson) on the ballot too — for Best Novel Hugo. Which is not precisely against the rules of the nomination process, but Wheel of Time is a massive series that is almost 30 years old. Seeing it in the Best Novel category alongside the other books for 2014 is highly unusual to say the least. So unusual, in fact, that some people in fandom have chosen to get upset about it; to the same degree those individuals in fandom are upset about Monster Hunter Nation getting the third installment in Larry Correia’s Hard Magic series onto the ballot, with Warbound: Book III of the Grimnoir Chronicles.\nMy response to the plaintiffs is: why not?\nAs does Larry Correia\n, 2014 Hugo nominee for Best Novel:\nAllow me to explain why the presence of my slate on the Hugo\nnominations is so controversial. This is complicated and your time is\nvaluable, so short explanation first, longer explanation if you care\nafter.\nShort Version:\nI said a chunk of the Hugo voters are biased toward the left, and\nput the author’s politics far ahead of the quality of the work. Those\nopenly on the right are sabotaged. This was denied.\nSo I got some right wingers on the ballot.\nThe biased voters immediately got all outraged and mobilized to do exactly what I said they’d do.\nPoint made.\nI’ve said for a long time that the awards are biased against authors\nbecause of their personal beliefs. Authors can either cheer lead for\nleft wing causes, or they can keep their mouth shut. Open disagreement\nis not tolerated and will result in being sabotaged and slandered.\nMessage or identity politics has become far more important than\nentertainment or quality. I was attacked for saying this. I knew that\nwhen an admitted right winger got in they would be maligned and\npoliticked against, not for the quality of their art but rather for\ntheir unacceptable beliefs.\nIf one of us outspoken types got nominated, the inevitable backlash,\noutrage, and plans for their sabotage would be very visible. So I\ndecided to prove this bias and launched a campaign I called Sad Puppies\n(because boring message fiction is the leading cause of Puppy Related\nSadness).\nThe Hugos are supposed to be about honoring the\nbest\nworks,\nand many of the voters still take this responsibility very seriously. I\nthank them for this. But basically the Hugos are a popularity contest\ndecided by the attendees of WorldCon. I am a popular writer, however my\nfans aren’t typical WorldCon attendees. Anyone who pays to purchase a\nWorldCon membership is allowed to vote. Other writers, bloggers, and\neven publishing houses have encouraged their fans to get involved in the\nnomination process before. I simply did the same thing. This\ncontroversy arises only because my fans are the\nwrong\nkind of fans.\nIt’s interesting to see how much more sane and reasonable both men sound than the Torlings and the shrieking pinkshirts offended that their little SF/F sanctum has been invaded by the ideologically impure. In any event, there is considerably more to both posts than the small portions I posted here, so don’t hesitate to click through.",
  "tags": [
    "Hugo Award",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-24T21:27:00+00:00"
}