{
  "url": "https://voxday.net/2014/04/28/the-science-fictional-is-politica/",
  "scraped_at": "2025-12-16T12:12:50.358031",
  "title": "The science fictional is the political",
  "date_display": "April 28, 2014",
  "date_iso": "2014-04-28T18:04:00+00:00",
  "date_from_url": "2014-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Instapundit rightly laments <a href=\"http://www.usatoday.com/story/opinion/2014/04/28/hugo-awards-science-fiction-reading-politics-larry-correia-column/8282843/\">the politicization of science fiction</a> in USA TODAY:</p><blockquote class=\"tr_bq\"><p> There was a time when science fiction was a place to explore new ideas, free of the conventional wisdom of staid, “mundane” society, a place where speculation replaced group think, and where writers as different as libertarian-leaning Robert Heinlein, and left-leaning Isaac Asimov and Arthur Clarke would share readers, magazines, and conventions.</p><p>But then, there was a time when that sort of openness characterized much of American intellectual life. That time seems to be over, judging by the latest science fiction dust-up. Now, apparently, a writer’s politics are the most important thing, and authors with the wrong politics are no longer acceptable, at least to a loud crowd that has apparently colonized much of the world of science fiction fandom.</p></blockquote><p>Unfortunately, the reality is that the Left has politicized science fiction. While there has always been an influential Left <a href=\"http://en.wikipedia.org/wiki/Futurians\">active in science fiction</a> – the Futurians were communists and Trotskyites who believed SF writers “should actively work for the realization of the scientific world-state<br> as the only genuine justification for their activities and existence” – the influence of Jack Campbell, among others, kept that tendency in check.</br></p><p>But the ascendancy of the post-1980s editorial gatekeepers at publishing houses like Tor, followed by the three-time SFWA presidency of a left-wing activist and inveterate self-promoter, caused the Left to assume that they were the only players on the field. They attempted a return to a modified Futurianism, albeit this time in favor of the realization of the post-racial, post-national, post-cultural, omnisexual secular society as the only justification for their activities and existence.</p><p>What is the solution? There are various possibilities, but my answer would be to outwrite them, outsell them, and win all their awards until they beg for mercy and offer a truce. They politicized science fiction, and only they can unpoliticize it. Until then, they’ll have to deal with the fact that we’re not only capable of playing the game according to the new rules, we’re able to play it better than they are.</p><p>Politics don’t belong in science fiction. But we didn’t put them there and we can’t take them out.</p></div>",
  "content_text": "Instapundit rightly laments\nthe politicization of science fiction\nin USA TODAY:\nThere was a time when science fiction was a place to explore new ideas, free of the conventional wisdom of staid, “mundane” society, a place where speculation replaced group think, and where writers as different as libertarian-leaning Robert Heinlein, and left-leaning Isaac Asimov and Arthur Clarke would share readers, magazines, and conventions.\nBut then, there was a time when that sort of openness characterized much of American intellectual life. That time seems to be over, judging by the latest science fiction dust-up. Now, apparently, a writer’s politics are the most important thing, and authors with the wrong politics are no longer acceptable, at least to a loud crowd that has apparently colonized much of the world of science fiction fandom.\nUnfortunately, the reality is that the Left has politicized science fiction. While there has always been an influential Left\nactive in science fiction\n– the Futurians were communists and Trotskyites who believed SF writers “should actively work for the realization of the scientific world-state\nas the only genuine justification for their activities and existence” – the influence of Jack Campbell, among others, kept that tendency in check.\nBut the ascendancy of the post-1980s editorial gatekeepers at publishing houses like Tor, followed by the three-time SFWA presidency of a left-wing activist and inveterate self-promoter, caused the Left to assume that they were the only players on the field. They attempted a return to a modified Futurianism, albeit this time in favor of the realization of the post-racial, post-national, post-cultural, omnisexual secular society as the only justification for their activities and existence.\nWhat is the solution? There are various possibilities, but my answer would be to outwrite them, outsell them, and win all their awards until they beg for mercy and offer a truce. They politicized science fiction, and only they can unpoliticize it. Until then, they’ll have to deal with the fact that we’re not only capable of playing the game according to the new rules, we’re able to play it better than they are.\nPolitics don’t belong in science fiction. But we didn’t put them there and we can’t take them out.",
  "tags": [
    "Hugo Award",
    "media",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-28T17:04:00+00:00"
}