{
  "url": "https://voxday.net/2014/04/30/the-purging-of-donald-tokowitz/",
  "scraped_at": "2025-12-16T12:12:59.973689",
  "title": "The purging of Donald Tokowitz",
  "date_display": "April 30, 2014",
  "date_iso": "2014-04-30T09:02:00+00:00",
  "date_from_url": "2014-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I mentioned when asked yesterday, I neither follow nor care about the NBA. The extent of my knowledge of the league comes from a single Bill Simmons book, and I find it somewhat amusing to see the legions of the politically correct hot in angry pursuit of a rich Jewish lawyer who was the recipient of a Lifetime Achievement Award from the NAACP in 2009. Frankly, I’m a little surprised that we’re not seeing references to the Holocaust yet; the Times of Israel was relatively restrained in its headline: “Jewish owner of NBA team under fire over racist remarks”.</p><p>But I do find it interesting to see how the NBA and the media are very much following the program described in yesterday’s post, <a href=\"http://www.milobookclub.com/2014/04/29/mailvox-on-surviving-witchhun/\">On Surviving a Witchhunt</a>. Let’s compare:</p><ol><li><b>Recognize that it is happening.</b> Mr. Tokowitz, who is apparently quite the fame-whore and loves to put his ugly face in the newspaper, hasn’t been talking to the media. Check.</li><li><b>Don’t think that you can reason your way out of it.</b> As I said, most people have the causality reversed. Doesn’t it seem a little strange that the league should react in such an over-the-top manner to an illegally-recorded conversation that clearly won’t be admissible in any court? I read Bill Simmon’s <i>Book of Basketball</i> and it is clear that Mr. Tokowitz has long been considered the worst owner in basketball and an embarrassment to the league. The league wanted him out long ago and it is unlikely that they would treat any other owners or players this way for a similar faux pas. For example, they have completely ignored Larry Johnson’s much more extremist call for a racially segregated league. Check.</li><li><b>Do not apologize!</b> I wrote that “They will press you hard for an apology and<br> repeatedly imply that if you will just apologize, all will be forgiven.” <i>The Los Angeles City Council voted Tuesday to condemn the racist remarks<br> made by Donald Sterling. The resolution also asks for an apology from<br> Sterling to the city and specifically to Earvin “Magic” Johnson. </br></br></i>Check.</br></li><li><b>Expose their excesses. </b>This is where it will be interesting to see how Tokowitz responds. The league is overreaching legally, and being not only a longtime owner, but a lawyer as well, Tokowitz will be aware of that. He may well be in possession of dirty laundry that the new commissioner doesn’t even know exists; basketball is FAR from the cleanest sport in the world. On the plus side, we may finally learn the real reason for Michael Jordan’s first retirement, which Bill Simmons insists was related to his excessive gambling.</li><li><b>Do not resign!</b> I pointed out that “their real goal is not to formally purge you,<br> but to encourage you to quit on your own.” The league is DESPERATELY hoping that Tokowitz will accept his public shunning and sell the team because they know they don’t have a solid legal case for anything, not even the “lifetime ban”.  (Which, as some have noted, was actually an 18-month ban in the case of Major League Baseball.) There has been some talk of appealing a clause in the NBA constitution that permits a three-quarters vote of the owners to force a sale, but it’s not triggered by “expressing unpopular views in private.” The league could make a better case for forcing the sale due to his having a mistress in the first place, but I very much doubt they want to go down that particular road.</br></li><li><b>Make the rubble bounce.</b> The NBA is in a lot of trouble if Tokowitz, who is old, rich, and apparently shameless, decides on the Samson option. He can probably single-handedly reduce the value of every franchise by 30 percent simply by monkey-wrenching the league through a series of “unfortunate” management and coaching decisions. And that’s without even getting into the ramifications of potential revelations concerning David Stern’s fixing of various drafts and playoff series.</li><li><b>Start nothing, finish everything. </b>I don’t care about the outcome, but I rather hope the old guy simply decides to burn down the NBA around him. It would be entertaining to see what happens when all the owners and many of the major players are repeatedly set up in bugged honey traps and recorded, since I can’t imagine it would be hard to produce a series of equally offensive recordings proving various PC offenses committed by a broad spectrum of NBA figures.</li></ol><p>That being said, after reading about the brouhaha, it seems most likely to me that all of this is nothing more than a league-approved coup d’etat attempt by Magic Johnson and the investors behind him. In the present hypersensitive PC environment, it’s not terribly difficult to whistle up a witch hunt in pursuit of your personal objectives. Steve Sailer <a href=\"http://isteve.blogspot.ch/2014/04/magic-johnson-ultimate-cleanser-sports.html\">connects the dots</a>.</p><blockquote class=\"tr_bq\"><p> Listening closely to the presumably illegally made tapes suggests that the mistress was setting the LA Clippers owner up — she’s the one egging on the racial angle over her photos cuddling with Magic Johnson and Matt Kemp of the Dodgers. Originally, I assumed her minor league lawyer was her mastermind, but the news that Magic and his mysterious Guggenheim Partners backers want control of Sterling’s NBA franchise suggests that there’s a reasonable chance that this whole set-up originated with somebody more high-powered than her Woodland Hills attorney. (This lawyer is so obscure that his office is on Burbank Blvd. rather than on Ventura Blvd.)</p><p>Former Los Angeles Lakers basketball star Magic Johnson was the public frontman for the secretive Guggenheim Partners in paying an outlandish $2 billion to Boston leveraged parking lot robber baron Frank McCourt for the Los Angeles Dodgers baseball team. And now, what do you know, Magic and the Guggenheim Partners are willing to take the Los Angeles Clippers off Donald Sterling’s hands and add it to their nascent Los Angeles sports empire.</p><p>In contrast, the new Guggenheim Partners firm is very high-powered. In<br> fact, the SEC has been trying for a year to figure out if GP is so<br> high-powered that its Los Angeles sports franchise acquisitions are done<br> in illegal collaboration with … well, I won’t mention his name yet,<br> but it’s a smack-yourself-in-the-forehead name out of the history books<br> of Los Angeles and finance.</br></br></br></br></br></p></blockquote><p>That may or may not be the case. But I suspect it would sway public opinion, to some extent, if it were discovered that Miss Stiviano was a honey trap being paid to unearth an excuse that would allow the NBA to turn a franchise in a major media market over to the Guggenheim Partners and Michael Milken.</p><p>Or, alternatively, perhaps this is just his punishment for finally managing to show up Showtime in Los Angeles.</p></div>",
  "content_text": "As I mentioned when asked yesterday, I neither follow nor care about the NBA. The extent of my knowledge of the league comes from a single Bill Simmons book, and I find it somewhat amusing to see the legions of the politically correct hot in angry pursuit of a rich Jewish lawyer who was the recipient of a Lifetime Achievement Award from the NAACP in 2009. Frankly, I’m a little surprised that we’re not seeing references to the Holocaust yet; the Times of Israel was relatively restrained in its headline: “Jewish owner of NBA team under fire over racist remarks”.\nBut I do find it interesting to see how the NBA and the media are very much following the program described in yesterday’s post,\nOn Surviving a Witchhunt\n. Let’s compare:\nRecognize that it is happening.\nMr. Tokowitz, who is apparently quite the fame-whore and loves to put his ugly face in the newspaper, hasn’t been talking to the media. Check.\nDon’t think that you can reason your way out of it.\nAs I said, most people have the causality reversed. Doesn’t it seem a little strange that the league should react in such an over-the-top manner to an illegally-recorded conversation that clearly won’t be admissible in any court? I read Bill Simmon’s\nBook of Basketball\nand it is clear that Mr. Tokowitz has long been considered the worst owner in basketball and an embarrassment to the league. The league wanted him out long ago and it is unlikely that they would treat any other owners or players this way for a similar faux pas. For example, they have completely ignored Larry Johnson’s much more extremist call for a racially segregated league. Check.\nDo not apologize!\nI wrote that “They will press you hard for an apology and\nrepeatedly imply that if you will just apologize, all will be forgiven.”\nThe Los Angeles City Council voted Tuesday to condemn the racist remarks\nmade by Donald Sterling. The resolution also asks for an apology from\nSterling to the city and specifically to Earvin “Magic” Johnson.\nCheck.\nExpose their excesses.\nThis is where it will be interesting to see how Tokowitz responds. The league is overreaching legally, and being not only a longtime owner, but a lawyer as well, Tokowitz will be aware of that. He may well be in possession of dirty laundry that the new commissioner doesn’t even know exists; basketball is FAR from the cleanest sport in the world. On the plus side, we may finally learn the real reason for Michael Jordan’s first retirement, which Bill Simmons insists was related to his excessive gambling.\nDo not resign!\nI pointed out that “their real goal is not to formally purge you,\nbut to encourage you to quit on your own.” The league is DESPERATELY hoping that Tokowitz will accept his public shunning and sell the team because they know they don’t have a solid legal case for anything, not even the “lifetime ban”.  (Which, as some have noted, was actually an 18-month ban in the case of Major League Baseball.) There has been some talk of appealing a clause in the NBA constitution that permits a three-quarters vote of the owners to force a sale, but it’s not triggered by “expressing unpopular views in private.” The league could make a better case for forcing the sale due to his having a mistress in the first place, but I very much doubt they want to go down that particular road.\nMake the rubble bounce.\nThe NBA is in a lot of trouble if Tokowitz, who is old, rich, and apparently shameless, decides on the Samson option. He can probably single-handedly reduce the value of every franchise by 30 percent simply by monkey-wrenching the league through a series of “unfortunate” management and coaching decisions. And that’s without even getting into the ramifications of potential revelations concerning David Stern’s fixing of various drafts and playoff series.\nStart nothing, finish everything.\nI don’t care about the outcome, but I rather hope the old guy simply decides to burn down the NBA around him. It would be entertaining to see what happens when all the owners and many of the major players are repeatedly set up in bugged honey traps and recorded, since I can’t imagine it would be hard to produce a series of equally offensive recordings proving various PC offenses committed by a broad spectrum of NBA figures.\nThat being said, after reading about the brouhaha, it seems most likely to me that all of this is nothing more than a league-approved coup d’etat attempt by Magic Johnson and the investors behind him. In the present hypersensitive PC environment, it’s not terribly difficult to whistle up a witch hunt in pursuit of your personal objectives. Steve Sailer\nconnects the dots\n.\nListening closely to the presumably illegally made tapes suggests that the mistress was setting the LA Clippers owner up — she’s the one egging on the racial angle over her photos cuddling with Magic Johnson and Matt Kemp of the Dodgers. Originally, I assumed her minor league lawyer was her mastermind, but the news that Magic and his mysterious Guggenheim Partners backers want control of Sterling’s NBA franchise suggests that there’s a reasonable chance that this whole set-up originated with somebody more high-powered than her Woodland Hills attorney. (This lawyer is so obscure that his office is on Burbank Blvd. rather than on Ventura Blvd.)\nFormer Los Angeles Lakers basketball star Magic Johnson was the public frontman for the secretive Guggenheim Partners in paying an outlandish $2 billion to Boston leveraged parking lot robber baron Frank McCourt for the Los Angeles Dodgers baseball team. And now, what do you know, Magic and the Guggenheim Partners are willing to take the Los Angeles Clippers off Donald Sterling’s hands and add it to their nascent Los Angeles sports empire.\nIn contrast, the new Guggenheim Partners firm is very high-powered. In\nfact, the SEC has been trying for a year to figure out if GP is so\nhigh-powered that its Los Angeles sports franchise acquisitions are done\nin illegal collaboration with … well, I won’t mention his name yet,\nbut it’s a smack-yourself-in-the-forehead name out of the history books\nof Los Angeles and finance.\nThat may or may not be the case. But I suspect it would sway public opinion, to some extent, if it were discovered that Miss Stiviano was a honey trap being paid to unearth an excuse that would allow the NBA to turn a franchise in a major media market over to the Guggenheim Partners and Michael Milken.\nOr, alternatively, perhaps this is just his punishment for finally managing to show up Showtime in Los Angeles.",
  "tags": [
    "rabbitology",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-30T08:02:00+00:00"
}