{
  "url": "https://voxday.net/2014/04/21/the-darkness-comprehendeth-it-no/",
  "scraped_at": "2025-12-15T16:53:32.938258",
  "title": "The darkness comprehendeth it not",
  "date_display": "April 21, 2014",
  "date_iso": "2014-04-21T20:00:00+00:00",
  "date_from_url": "2014-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Damien Walter, the Guardian contributor who wrote the hit piece about Larry Correia’s blog post without linking to it, and who has never professionally published a novel,<a href=\"https://twitter.com/damiengwalter/status/458322357916950528\"> reviews “Opera Vita Aeterna”</a> and it says considerably more about the reviewer than the work reviewed.</p><blockquote class=\"tr_bq\"><p> I have judged the work not the man, and found it to be an incoherent rant disguised as an unconvincing non-story.</p></blockquote><p>Because I am cruel by nature, I found this amusing. Because I am human, I found it tragic as well. Consider the perspective <a href=\"http://damiengwalter.com/2014/01/10/i-have-arrived-i-am-home-in-the-here-in-the-now/\">from which he reads</a>:</p><blockquote class=\"tr_bq\"><p> I was 30 and, by any measure, deeply unhappy. I’d been pushing down a<br> lot of horrible emotions from a damaging childhood, grief from many<br> losses, and had trapped myself in a life I didn’t fit in to from a<br> desperate need to fit somewhere, anywhere. I had no kind of spiritual<br> practice at all. I was a standard issue atheist, and any encounter I had<br> with religion was edged with inherited and unexamined scorn.<br> Consequentially, I really had no tools to process the pain I was<br> feeling. Today, my argument with the radical atheist rhetoric of people<br> like Richard Dawkins and Daniel Dennett – both of whom I had read<br> heavily at university – is that it leaves the bulk of its believers<br> utterly amputated from their own emotional reality. It certainly had me.<br> I was miserable, and in trying to escape from the causes of the misery<br> I’d driven myself, repeatedly, to the borders of emotional collapse<br> where I had, at long last, collapsed.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Unfortunately, his behavior makes it readily apparent that he has not yet found his way out of his emotional mire. As I pointed out in my tweet to him in response: <i>“Given your deep unhappiness, Damien, it’s not surprising that you found a story about PHILIA incoherent and unconvincing.”</i></p><p>“Opera Vita Aeterna” is a story about love. The love of a friend, the love of knowledge, and the love of God. It should surprise absolutely no one that damaged and deeply unhappy people, who are by their own admission “utterly amputated from their own emotional reality”, cannot relate to it. They cannot even recognize it as a coherent story.</p><p>Of course they find it incoherent and unconvincing! Of course they find it a non-story! For they are lost in misery, their hearts are empty, and they cannot see by the light that comes from within. Regardless of what he may think of the literary quality of the story, I hope that one day Damien will at least be able to comprehend what the story is about.</p></div>",
  "content_text": "Damien Walter, the Guardian contributor who wrote the hit piece about Larry Correia’s blog post without linking to it, and who has never professionally published a novel,\nreviews “Opera Vita Aeterna”\nand it says considerably more about the reviewer than the work reviewed.\nI have judged the work not the man, and found it to be an incoherent rant disguised as an unconvincing non-story.\nBecause I am cruel by nature, I found this amusing. Because I am human, I found it tragic as well. Consider the perspective\nfrom which he reads\n:\nI was 30 and, by any measure, deeply unhappy. I’d been pushing down a\nlot of horrible emotions from a damaging childhood, grief from many\nlosses, and had trapped myself in a life I didn’t fit in to from a\ndesperate need to fit somewhere, anywhere. I had no kind of spiritual\npractice at all. I was a standard issue atheist, and any encounter I had\nwith religion was edged with inherited and unexamined scorn.\nConsequentially, I really had no tools to process the pain I was\nfeeling. Today, my argument with the radical atheist rhetoric of people\nlike Richard Dawkins and Daniel Dennett – both of whom I had read\nheavily at university – is that it leaves the bulk of its believers\nutterly amputated from their own emotional reality. It certainly had me.\nI was miserable, and in trying to escape from the causes of the misery\nI’d driven myself, repeatedly, to the borders of emotional collapse\nwhere I had, at long last, collapsed.\nUnfortunately, his behavior makes it readily apparent that he has not yet found his way out of his emotional mire. As I pointed out in my tweet to him in response:\n“Given your deep unhappiness, Damien, it’s not surprising that you found a story about PHILIA incoherent and unconvincing.”\n“Opera Vita Aeterna” is a story about love. The love of a friend, the love of knowledge, and the love of God. It should surprise absolutely no one that damaged and deeply unhappy people, who are by their own admission “utterly amputated from their own emotional reality”, cannot relate to it. They cannot even recognize it as a coherent story.\nOf course they find it incoherent and unconvincing! Of course they find it a non-story! For they are lost in misery, their hearts are empty, and they cannot see by the light that comes from within. Regardless of what he may think of the literary quality of the story, I hope that one day Damien will at least be able to comprehend what the story is about.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-21T19:00:00+00:00"
}