{
  "url": "https://voxday.net/2014/04/29/the-war-against-coherency/",
  "scraped_at": "2025-12-16T12:12:58.138565",
  "title": "The war against coherency",
  "date_display": "April 29, 2014",
  "date_iso": "2014-04-29T20:00:00+00:00",
  "date_from_url": "2014-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is vastly amusing. John Scalzi has lobbied for Hugos for years,<br> on behalf of himself and others. This is the second year of Sad Puppies.<br> Charles Stross has openly engaged in what he calls “Shameless Hugo<br> nomination touting” and the Toad of Tor has publicly declared that<br> science fiction awards are nothing but “a giant signal saying ‘this is<br> what we love, this is what we value'”. Dozens of pinkshirts have primly announced that they don’t intend to read anything by anyone of whom they disapprove.</br></br></br></br></br></p><p>And David Gerrold somehow<br> concludes that the politicization of science fiction is <a href=\"https://www.facebook.com/david.gerrold/posts/10202838099205887\">my fault?</a></br></p><blockquote class=\"tr_bq\"><p> Coming back to the starting point of the column — if we accept that<br> science fiction awards should not be politicized, then the columnist is<br> blaming the wrong people. He should start by blaming Vox Day the guy who politicized this year’s process in the first place.</br></br></p></blockquote><p>Either Gerrold has lost it or I have powers far beyond my ken. For example, here is a Hugo-related post <a href=\"http://www.tor.com/blogs/2010/03/torcoms-hugo-award-eligible-works\">from 2010</a> that lists “Tor.com’s Hugo Award-eligible works” and pushes Tor novels, editors, and artists.</p><blockquote class=\"tr_bq\"><p> 4. Irene Wednesday March 10, 2010 12:27pm EST<br> Hi Spera,</br></p><p>This post was meant to be specific to the works that Tor.com has published.</p><p>But that doesn’t mean would love for you to consider Tor novels, editors, and artists. You can check out the Tor corporate site here. </p></blockquote><p></p></div>",
  "content_text": "This is vastly amusing. John Scalzi has lobbied for Hugos for years,\non behalf of himself and others. This is the second year of Sad Puppies.\nCharles Stross has openly engaged in what he calls “Shameless Hugo\nnomination touting” and the Toad of Tor has publicly declared that\nscience fiction awards are nothing but “a giant signal saying ‘this is\nwhat we love, this is what we value'”. Dozens of pinkshirts have primly announced that they don’t intend to read anything by anyone of whom they disapprove.\nAnd David Gerrold somehow\nconcludes that the politicization of science fiction is\nmy fault?\nComing back to the starting point of the column — if we accept that\nscience fiction awards should not be politicized, then the columnist is\nblaming the wrong people. He should start by blaming Vox Day the guy who politicized this year’s process in the first place.\nEither Gerrold has lost it or I have powers far beyond my ken. For example, here is a Hugo-related post\nfrom 2010\nthat lists “Tor.com’s Hugo Award-eligible works” and pushes Tor novels, editors, and artists.\n4. Irene Wednesday March 10, 2010 12:27pm EST\nHi Spera,\nThis post was meant to be specific to the works that Tor.com has published.\nBut that doesn’t mean would love for you to consider Tor novels, editors, and artists. You can check out the Tor corporate site here.",
  "tags": [
    "Hugo Award",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-29T19:00:00+00:00"
}