{
  "url": "https://voxday.net/2014/04/07/the-seeds-of-bad-science/",
  "scraped_at": "2025-12-15T16:51:57.506048",
  "title": "The seeds of bad science",
  "date_display": "April 7, 2014",
  "date_iso": "2014-04-07T07:23:00+00:00",
  "date_from_url": "2014-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rupert Darwell <a href=\"http://www.telegraph.co.uk/culture/books/non_fictionreviews/10748667/The-game-is-up-for-climate-change-believers.html\">traces them</a> in a book entitled The Age of Global Warming:</p><blockquote class=\"tr_bq\"><p> The origins of warmism lie in a cocktail of ideas which includes anti-industrial nature worship, post-colonial guilt, a post-Enlightenment belief in scientists as a new priesthood of the truth, a hatred of population growth, a revulsion against the widespread increase in wealth and a belief in world government. It involves a fondness for predicting that energy supplies won’t last much longer (as early as 1909, the US National Conservation Commission reported to Congress that America’s natural gas would be gone in 25 years and its oil by the middle of the century), protest movements which involve dressing up and disappearing into woods (the Kindred of the Kibbo Kift, the Mosleyite Blackshirts who believed in reafforestation) and a dislike of the human race (The Club of Rome’s work Mankind at the Turning-Point said: “The world has cancer and the cancer is man.”).</p><p>These beliefs began to take organised, international, political form in the 1970s. One of the greatest problems, however, was that the ecologists’ attacks on economic growth were unwelcome to the nations they most idolised – the poor ones. The eternal Green paradox is that the concept of the simple, natural life appeals only to countries with tons of money. By a brilliant stroke, the founding fathers developed the concept of “sustainable development”. This meant that poor countries would not have to restrain their own growth, but could force restraint upon the rich ones. This formula was propagated at the first global environmental conference in Stockholm in 1972….</p><p>Scientists, Rupert Darwall complains, have been too ready to embrace the<br> “subjectivity” of the future, and too often have a “cultural aversion to<br> learning from the past”. If they read this tremendous book they will see<br> those lessons set out with painful clarity.</br></br></br></p></blockquote><p>If one wanted to understand the root of my contempt for scientists and scientistry, as opposed to my mere opposition to their pseudo-scientific policies, it can be summarized by Darwall’s statement about their “cultural aversion to<br> learning from the past”.</br></p><p>Scientody is a powerful tool. But history is an even more useful and reliable one with regards to humanity. Because, a few genetic alterations over time notwithstanding, Man remains Man and human nature remains human nature.</p></div>",
  "content_text": "Rupert Darwell\ntraces them\nin a book entitled The Age of Global Warming:\nThe origins of warmism lie in a cocktail of ideas which includes anti-industrial nature worship, post-colonial guilt, a post-Enlightenment belief in scientists as a new priesthood of the truth, a hatred of population growth, a revulsion against the widespread increase in wealth and a belief in world government. It involves a fondness for predicting that energy supplies won’t last much longer (as early as 1909, the US National Conservation Commission reported to Congress that America’s natural gas would be gone in 25 years and its oil by the middle of the century), protest movements which involve dressing up and disappearing into woods (the Kindred of the Kibbo Kift, the Mosleyite Blackshirts who believed in reafforestation) and a dislike of the human race (The Club of Rome’s work Mankind at the Turning-Point said: “The world has cancer and the cancer is man.”).\nThese beliefs began to take organised, international, political form in the 1970s. One of the greatest problems, however, was that the ecologists’ attacks on economic growth were unwelcome to the nations they most idolised – the poor ones. The eternal Green paradox is that the concept of the simple, natural life appeals only to countries with tons of money. By a brilliant stroke, the founding fathers developed the concept of “sustainable development”. This meant that poor countries would not have to restrain their own growth, but could force restraint upon the rich ones. This formula was propagated at the first global environmental conference in Stockholm in 1972….\nScientists, Rupert Darwall complains, have been too ready to embrace the\n“subjectivity” of the future, and too often have a “cultural aversion to\nlearning from the past”. If they read this tremendous book they will see\nthose lessons set out with painful clarity.\nIf one wanted to understand the root of my contempt for scientists and scientistry, as opposed to my mere opposition to their pseudo-scientific policies, it can be summarized by Darwall’s statement about their “cultural aversion to\nlearning from the past”.\nScientody is a powerful tool. But history is an even more useful and reliable one with regards to humanity. Because, a few genetic alterations over time notwithstanding, Man remains Man and human nature remains human nature.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-07T06:23:00+00:00"
}