{
  "url": "https://voxday.net/2014/04/20/the-testimony-of-john-c-wrig/",
  "scraped_at": "2025-12-15T16:53:23.732294",
  "title": "The testimony of John C. Wright",
  "date_display": "April 20, 2014",
  "date_iso": "2014-04-20T13:00:00+00:00",
  "date_from_url": "2014-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>It has been one of the great privileges of my life to make the professional acquaintance of John C. Wright, whom I firmly believe to be the greatest living SF writer. But Mr. Wright is more more than a mere teller of tales like <a href=\"http://www.amazon.com/dp/B00JM98V60\"><b>AWAKE IN THE NIGHT LAND</b></a> and <a href=\"http://www.amazon.com/Golden-Age-John-C-Wright-ebook/dp/B000FA5QJK\"><b>THE GOLDEN AGE</b></a>, he is also a formidable </i>fidei defensor<i>. Six years ago today, he was baptized into the Church<b> </b>in the name of Jesus Christ. This is his testimony, as it was recounted on Free Republic and then <a href=\"http://www.strangenotions.com/wright-conversion/\">Strange Notions</a>. It seems appropriate to post it here today.</i></p><p>My conversion was in two parts: a natural part and a supernatural part. Here is the natural part: first, over a period of two years my hatred toward Christianity eroded due to my philosophical inquiries.</p><p>Rest assured, I take the logical process of philosophy very seriously, and I am impatient with anyone who is not a rigorous and trained thinker. Reason is the tool men use to determine if their statements about reality are valid: there is no other. Those who do not or cannot reason are little better than slaves, because their lives are controlled by the ideas of other men, ideas they have not examined.</p><p>To my surprise and alarm, I found that, step by step, logic drove me to conclusions no modern philosophy shared, but only this ancient and (as I saw it then) corrupt and superstitious foolery called the Church. Each time I followed the argument fearlessly where it lead, it kept leading me, one remorseless rational step at a time, to a position the Church had been maintaining for more than a thousand years. That haunted me.</p><p>Second, I began to notice how shallow, either simply optimistic or simply pessimistic, other philosophies and views of life were.</p><p>The public conduct of my fellow atheists was so lacking in sobriety and gravity that I began to wonder why, if we atheists had a hammerlock on truth, so much of what we said was pointless or naive. I remember listening to a fellow atheist telling me how wonderful the world would be once religion was swept into the dustbin of history, and I realized the chap knew nothing about history. If atheism solved all human woe, then the Soviet Union would have been an empire of joy and dancing bunnies, instead of the land of corpses.</p><p>I would listen to my fellow atheists, and they would sound as innocent of any notion of what real human life was like as the Man from Mars who has never met human beings or even heard clear rumors of them. Then I would read something written by Christian men of letters, Tolkien, Lewis, or G.K. Chesterton, and see a solid understanding of the joys and woes of human life. They were mature men.</p><p>I would look at the rigorous logic of St. Thomas Aquinas, the complexity and thoroughness of his reasoning, and compare that to the scattered and mentally incoherent sentimentality of some poseur like Nietzsche or Sartre. I can tell the difference between a rigorous argument and shrill psychological flatulence. I can see the difference between a dwarf and a giant.<br> <a name=\"more\"></a>My wife is a Christian and is extraordinary patient, logical, and philosophical. For years I would challenge and condemn her beliefs, battering the structure of her conclusions with every argument, analogy, and evidence I could bring to bear. I am a very argumentative man, and I am as fell and subtle as a serpent in debate. All my arts failed against her. At last I was forced to conclude that, like non-Euclidian geometry, her world-view logically followed from its axioms (although the axioms were radically mystical, and I rejected them with contempt). Her persistence compared favorably to the behavior of my fellow atheists, most of whom cannot utter any argument more mentally alert than a silly ad Hominem attack. Once again, I saw that I was confronting a mature and serious world-view, not merely a tissue of fables and superstitions.<br> Third, a friend of mine asked me what evidence, if any, would be sufficient to convince me that the supernatural existed. This question stumped me. My philosophy at the time excluded the contemplation of the supernatural axiomatically: by definition (my definition) even the word “super-natural” was a contradiction in terms. Logic then said that, if my conclusions were definitional, they were circular. I was assuming the conclusion of the subject matter in dispute.</br></br></p><p>Now, my philosophy at the time was as rigorous and exact as 35 years of study could make it (I started philosophy when I was seven). This meant there was no point for reasonable doubt in the foundational structure of my axioms, definitions, and common notions. This meant that, logically, even if God existed, and manifested Himself to me, my philosophy would force me to reject the evidence of my senses, and dismiss any manifestations as a coincidence, hallucination, or dream. Under this hypothetical, my philosophy would force me to an exactly wrong conclusion due to structural errors of assumption.</p><p>A philosopher (and I mean a serious and manly philosopher, not a sophomoric boy) does not use philosophy to flinch away from truth or hide from it. A philosophy composed of structural false-to-facts assumptions is insupportable.</p><p>A philosopher goes where the truth leads, and has no patience with mere emotion.</p><p>But it was impossible, logically impossible, that I should ever believe in such nonsense as to believe in the supernatural. It would be a miracle to get me to believe in miracles.</p><p>So I prayed. “Dear God, I know (because I can prove it with the certainty that a geometer can prove opposite angles are equal) that you do not exist. Nonetheless, as a scholar, I am forced to entertain the hypothetical possibility that I am mistaken. So just in case I am mistaken, please reveal yourself to me in some fashion that will prove your case. If you do not answer, I can safely assume that either you do not care whether I believe in you, or that you have no power to produce evidence to persuade me. The former argues you not beneficent, the latter not omnipotent: in either case unworthy of worship. If you do not exist, this prayer is merely words in the air, and I lose nothing but a bit of my dignity. Thanking you in advance for your kind cooperation in this matter, John Wright.”</p><p>I had a heart attack two days later. God obviously has a sense of humor as well as a sense of timing.</p><p>Now for the supernatural part.</p><p>My wife called someone from her Church, which is a denomination that practices healing through prayer. My wife read a passage from their writings, and the pain vanished. If this was a coincidence, then, by God, I could use more coincidences like that in my life.</p><p>Feeling fit, I nonetheless went to the hospital, so find out what had happened to me. The diagnosis was grave, and a quintuple bypass heart surgery was ordered. So I was in the hospital for a few days.</p><p>Those were the happiest days of my life. A sense of peace and confidence, a peace that passes all understanding, like a field of energy entered my body. I grew aware of a spiritual dimension of reality of which I had hitherto been unaware. It was like a man born blind suddenly receiving sight.</p><p>The Truth to which my lifetime as a philosopher had been devoted turned out to be a living thing. It turned and looked at me. Something from beyond the reach of time and space, more fundamental than reality, reached across the universe and broke into my soul and changed me. This was not a case of defense and prosecution laying out evidence for my reason to pick through: I was altered down to the root of my being.</p><p>It was like falling in love. If you have not been in love, I cannot explain it. If you have, you will raise a glass with me in toast.</p><p>Naturally, I was overjoyed. First, I discovered that the death sentence under which all life suffers no longer applied to me. The governor, so to speak, had phoned. Second, imagine how puffed up with pride you’d be to find out you were the son of Caesar, and all the empire would be yours. How much more, then, to find out you were the child of God?</p><p>I was also able to perform, for the first time in my life, the act which I had studied philosophy all my life to perform, which is, to put aside all fear of death. The Roman Stoics, whom I so admire, speak volumes about this philosophical fortitude. But their lessons could not teach me this virtue. The blessing of the Holy Spirit could and did impart it to me, as a gift. So the thing I’ve been seeking my whole life was now mine.</p><p>Then, just to make sure I was flooded with evidence, I received three visions like Scrooge being visited by three ghosts. I was not drugged or semiconscious, I was perfectly alert and in my right wits.</p><p>It was not a dream. I have had dreams every night of my life. I know what a dream is. It was not a hallucination. I know someone who suffers from hallucinations, and I know the signs. Those signs were not present here.</p><p>Then, just to make even more sure that I was flooded with overwhelming evidence, I had a religious experience. This is separate from the visions, and took place several days after my release from the hospital, when my health was moderately well. I was not taking any pain-killers, by the way, because I found that prayer could banish pain in moments.</p><p>During this experience, I became aware of the origin of all thought, the underlying oneness of the universe, the nature of time: the paradox of determinism and free will was resolved for me. I saw and experienced part of the workings of a mind infinitely superior to mine, a mind able to count every atom in the universe, filled with paternal love and jovial good humor. The cosmos created by the thought of this mind was as intricate as a symphony, with themes and reflections repeating themselves forward and backward through time: prophecy is the awareness that a current theme is the foreshadowing of the same theme destined to emerge with greater clarity later. A prophet is one who is in tune, so to speak, with the music of the cosmos.</p><p>The illusionary nature of pain, and the logical impossibility of death, were part of the things I was shown.</p><p>Now, as far as these experiences go, they are not unique. They are not even unusual. More people have had religious experiences than have seen the far side of the moon. Dogmas disagree, but mystics are strangely (I am tempted to say mystically) in agreement.</p><p>The things I was shown have echoes both in pagan and Christian tradition, both Eastern and Western (although, with apologies to my pagan friends, I see that Christianity is the clearest expression of these themes, and also has a logical and ethical character other religions expressions lack).</p><p>Further, the world view implied by taking this vision seriously (1) gives supernatural sanction to conclusions only painfully reached by logic (2) supports and justifies a mature rather than simplistic world-view (3) fits in with the majority traditions not merely of the West, but also, in a limited way, with the East.</p><p>As a side issue, the solution of various philosophical conundrums, like the problem of the one and the many, mind-body duality, determinism and indeterminism, and so on, is an added benefit. If you are familiar with such things, I follow the panentheist idealism of Bishop Berkeley; and, no, Mr. Johnson does not refute him merely by kicking a stone.</p><p>From that time to this, I have had prayers answered and seen miracles: each individually could be explained away as a coincidence by a skeptic, but not taken as a whole. From that time to this, I continue to be aware of the Holy Spirit within me, like feeling a heartbeat. It is a primary impression coming not through the medium of the senses: an intuitive axiom, like the knowledge of one’s own self-being.</p><p>This, then, is the final answer to your question: it would not be rational for me to doubt something of which I am aware on a primary and fundamental level.</p><p>Occam’s razor cuts out hallucination or dream as a likely explanation for my experiences. In order to fit these experiences into an atheist framework, I would have to resort to endless ad hoc explanations: this lacks the elegance of geometers and parsimony of philosophers.</p><p>I would also have to assume all the great thinkers of history were fools. While I was perfectly content to support this belief back in my atheist days, this is a flattering conceit difficult to maintain seriously.</p><p>On a pragmatic level, I am somewhat more useful to my fellow man than before, and certainly more charitable. If it is a daydream, why wake me up? My neighbors will not thank you if I stop believing in the mystical brotherhood of man.</p><p>Besides, the atheist non-god is not going to send me to non-hell for my lapse of non-faith if it should turn out that I am mistaken.</p></div>",
  "content_text": "It has been one of the great privileges of my life to make the professional acquaintance of John C. Wright, whom I firmly believe to be the greatest living SF writer. But Mr. Wright is more more than a mere teller of tales like\nAWAKE IN THE NIGHT LAND\nand\nTHE GOLDEN AGE\n, he is also a formidable\nfidei defensor\n. Six years ago today, he was baptized into the Church\nin the name of Jesus Christ. This is his testimony, as it was recounted on Free Republic and then\nStrange Notions\n. It seems appropriate to post it here today.\nMy conversion was in two parts: a natural part and a supernatural part. Here is the natural part: first, over a period of two years my hatred toward Christianity eroded due to my philosophical inquiries.\nRest assured, I take the logical process of philosophy very seriously, and I am impatient with anyone who is not a rigorous and trained thinker. Reason is the tool men use to determine if their statements about reality are valid: there is no other. Those who do not or cannot reason are little better than slaves, because their lives are controlled by the ideas of other men, ideas they have not examined.\nTo my surprise and alarm, I found that, step by step, logic drove me to conclusions no modern philosophy shared, but only this ancient and (as I saw it then) corrupt and superstitious foolery called the Church. Each time I followed the argument fearlessly where it lead, it kept leading me, one remorseless rational step at a time, to a position the Church had been maintaining for more than a thousand years. That haunted me.\nSecond, I began to notice how shallow, either simply optimistic or simply pessimistic, other philosophies and views of life were.\nThe public conduct of my fellow atheists was so lacking in sobriety and gravity that I began to wonder why, if we atheists had a hammerlock on truth, so much of what we said was pointless or naive. I remember listening to a fellow atheist telling me how wonderful the world would be once religion was swept into the dustbin of history, and I realized the chap knew nothing about history. If atheism solved all human woe, then the Soviet Union would have been an empire of joy and dancing bunnies, instead of the land of corpses.\nI would listen to my fellow atheists, and they would sound as innocent of any notion of what real human life was like as the Man from Mars who has never met human beings or even heard clear rumors of them. Then I would read something written by Christian men of letters, Tolkien, Lewis, or G.K. Chesterton, and see a solid understanding of the joys and woes of human life. They were mature men.\nI would look at the rigorous logic of St. Thomas Aquinas, the complexity and thoroughness of his reasoning, and compare that to the scattered and mentally incoherent sentimentality of some poseur like Nietzsche or Sartre. I can tell the difference between a rigorous argument and shrill psychological flatulence. I can see the difference between a dwarf and a giant.\nMy wife is a Christian and is extraordinary patient, logical, and philosophical. For years I would challenge and condemn her beliefs, battering the structure of her conclusions with every argument, analogy, and evidence I could bring to bear. I am a very argumentative man, and I am as fell and subtle as a serpent in debate. All my arts failed against her. At last I was forced to conclude that, like non-Euclidian geometry, her world-view logically followed from its axioms (although the axioms were radically mystical, and I rejected them with contempt). Her persistence compared favorably to the behavior of my fellow atheists, most of whom cannot utter any argument more mentally alert than a silly ad Hominem attack. Once again, I saw that I was confronting a mature and serious world-view, not merely a tissue of fables and superstitions.\nThird, a friend of mine asked me what evidence, if any, would be sufficient to convince me that the supernatural existed. This question stumped me. My philosophy at the time excluded the contemplation of the supernatural axiomatically: by definition (my definition) even the word “super-natural” was a contradiction in terms. Logic then said that, if my conclusions were definitional, they were circular. I was assuming the conclusion of the subject matter in dispute.\nNow, my philosophy at the time was as rigorous and exact as 35 years of study could make it (I started philosophy when I was seven). This meant there was no point for reasonable doubt in the foundational structure of my axioms, definitions, and common notions. This meant that, logically, even if God existed, and manifested Himself to me, my philosophy would force me to reject the evidence of my senses, and dismiss any manifestations as a coincidence, hallucination, or dream. Under this hypothetical, my philosophy would force me to an exactly wrong conclusion due to structural errors of assumption.\nA philosopher (and I mean a serious and manly philosopher, not a sophomoric boy) does not use philosophy to flinch away from truth or hide from it. A philosophy composed of structural false-to-facts assumptions is insupportable.\nA philosopher goes where the truth leads, and has no patience with mere emotion.\nBut it was impossible, logically impossible, that I should ever believe in such nonsense as to believe in the supernatural. It would be a miracle to get me to believe in miracles.\nSo I prayed. “Dear God, I know (because I can prove it with the certainty that a geometer can prove opposite angles are equal) that you do not exist. Nonetheless, as a scholar, I am forced to entertain the hypothetical possibility that I am mistaken. So just in case I am mistaken, please reveal yourself to me in some fashion that will prove your case. If you do not answer, I can safely assume that either you do not care whether I believe in you, or that you have no power to produce evidence to persuade me. The former argues you not beneficent, the latter not omnipotent: in either case unworthy of worship. If you do not exist, this prayer is merely words in the air, and I lose nothing but a bit of my dignity. Thanking you in advance for your kind cooperation in this matter, John Wright.”\nI had a heart attack two days later. God obviously has a sense of humor as well as a sense of timing.\nNow for the supernatural part.\nMy wife called someone from her Church, which is a denomination that practices healing through prayer. My wife read a passage from their writings, and the pain vanished. If this was a coincidence, then, by God, I could use more coincidences like that in my life.\nFeeling fit, I nonetheless went to the hospital, so find out what had happened to me. The diagnosis was grave, and a quintuple bypass heart surgery was ordered. So I was in the hospital for a few days.\nThose were the happiest days of my life. A sense of peace and confidence, a peace that passes all understanding, like a field of energy entered my body. I grew aware of a spiritual dimension of reality of which I had hitherto been unaware. It was like a man born blind suddenly receiving sight.\nThe Truth to which my lifetime as a philosopher had been devoted turned out to be a living thing. It turned and looked at me. Something from beyond the reach of time and space, more fundamental than reality, reached across the universe and broke into my soul and changed me. This was not a case of defense and prosecution laying out evidence for my reason to pick through: I was altered down to the root of my being.\nIt was like falling in love. If you have not been in love, I cannot explain it. If you have, you will raise a glass with me in toast.\nNaturally, I was overjoyed. First, I discovered that the death sentence under which all life suffers no longer applied to me. The governor, so to speak, had phoned. Second, imagine how puffed up with pride you’d be to find out you were the son of Caesar, and all the empire would be yours. How much more, then, to find out you were the child of God?\nI was also able to perform, for the first time in my life, the act which I had studied philosophy all my life to perform, which is, to put aside all fear of death. The Roman Stoics, whom I so admire, speak volumes about this philosophical fortitude. But their lessons could not teach me this virtue. The blessing of the Holy Spirit could and did impart it to me, as a gift. So the thing I’ve been seeking my whole life was now mine.\nThen, just to make sure I was flooded with evidence, I received three visions like Scrooge being visited by three ghosts. I was not drugged or semiconscious, I was perfectly alert and in my right wits.\nIt was not a dream. I have had dreams every night of my life. I know what a dream is. It was not a hallucination. I know someone who suffers from hallucinations, and I know the signs. Those signs were not present here.\nThen, just to make even more sure that I was flooded with overwhelming evidence, I had a religious experience. This is separate from the visions, and took place several days after my release from the hospital, when my health was moderately well. I was not taking any pain-killers, by the way, because I found that prayer could banish pain in moments.\nDuring this experience, I became aware of the origin of all thought, the underlying oneness of the universe, the nature of time: the paradox of determinism and free will was resolved for me. I saw and experienced part of the workings of a mind infinitely superior to mine, a mind able to count every atom in the universe, filled with paternal love and jovial good humor. The cosmos created by the thought of this mind was as intricate as a symphony, with themes and reflections repeating themselves forward and backward through time: prophecy is the awareness that a current theme is the foreshadowing of the same theme destined to emerge with greater clarity later. A prophet is one who is in tune, so to speak, with the music of the cosmos.\nThe illusionary nature of pain, and the logical impossibility of death, were part of the things I was shown.\nNow, as far as these experiences go, they are not unique. They are not even unusual. More people have had religious experiences than have seen the far side of the moon. Dogmas disagree, but mystics are strangely (I am tempted to say mystically) in agreement.\nThe things I was shown have echoes both in pagan and Christian tradition, both Eastern and Western (although, with apologies to my pagan friends, I see that Christianity is the clearest expression of these themes, and also has a logical and ethical character other religions expressions lack).\nFurther, the world view implied by taking this vision seriously (1) gives supernatural sanction to conclusions only painfully reached by logic (2) supports and justifies a mature rather than simplistic world-view (3) fits in with the majority traditions not merely of the West, but also, in a limited way, with the East.\nAs a side issue, the solution of various philosophical conundrums, like the problem of the one and the many, mind-body duality, determinism and indeterminism, and so on, is an added benefit. If you are familiar with such things, I follow the panentheist idealism of Bishop Berkeley; and, no, Mr. Johnson does not refute him merely by kicking a stone.\nFrom that time to this, I have had prayers answered and seen miracles: each individually could be explained away as a coincidence by a skeptic, but not taken as a whole. From that time to this, I continue to be aware of the Holy Spirit within me, like feeling a heartbeat. It is a primary impression coming not through the medium of the senses: an intuitive axiom, like the knowledge of one’s own self-being.\nThis, then, is the final answer to your question: it would not be rational for me to doubt something of which I am aware on a primary and fundamental level.\nOccam’s razor cuts out hallucination or dream as a likely explanation for my experiences. In order to fit these experiences into an atheist framework, I would have to resort to endless ad hoc explanations: this lacks the elegance of geometers and parsimony of philosophers.\nI would also have to assume all the great thinkers of history were fools. While I was perfectly content to support this belief back in my atheist days, this is a flattering conceit difficult to maintain seriously.\nOn a pragmatic level, I am somewhat more useful to my fellow man than before, and certainly more charitable. If it is a daydream, why wake me up? My neighbors will not thank you if I stop believing in the mystical brotherhood of man.\nBesides, the atheist non-god is not going to send me to non-hell for my lapse of non-faith if it should turn out that I am mistaken.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-20T12:00:00+00:00"
}