{
  "url": "https://voxday.net/2014/04/21/thoughts-on-hugo-nomination/",
  "scraped_at": "2025-12-15T16:53:27.449705",
  "title": "Thoughts on the Hugo nomination",
  "date_display": "April 21, 2014",
  "date_iso": "2014-04-21T09:05:00+00:00",
  "date_from_url": "2014-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><ol><li>SF fandom has no grasp of how small it is. The repeated accusations of cheating by purchasing multiple memberships and ballot-stuffing demonstrate that the accusers haven’t even bothered to look at the Feedburner icon or click on the Sitemeter icon here. Last year it took only 38 votes to make it onto the Best Novelette ballot; the top vote-getting nominee had all of 89 votes. Meanwhile, the vast quantity of upset and offended goodthinkers visiting here via do-not-link to gawk at the evidence of my being “the antithesis of all that is good and decent” led to a gargantuan 6.9 percent increase in traffic here, which is to say, 758 additional Sitemeter visits out of nearly 12,000.</li><li>It’s a lot harder to win a Hugo than to get nominated. To win, one needs about 400 votes under normal circumstances. But since the votes are ranked in order of preference and there is an active campaign to vote No Award above “Opera Vita Aeterna”, I’d need more than that. Translation: thanks very much for all the expressions of support, but don’t buy a membership to vote for me unless you’re also planning to get involved on the nomination end next year. If you want to express your support, I’d much rather you spend that money on Castalia House books by John, Tom, and Rolf. For $40 you can buy most of our English catalog… some of it directly from the store we are opening later today.</li><li>Win or lose the awards, Sad Puppies has served its purpose. The purpose of Sad Puppies, as Larry repeatedly explained, was three-fold. First, to test if the award process was fraudulent or not. To the credit of the LonCon people, we have learned it was not. Second, to prove that the awards are a mere popularity contest, contra the insistence of those who have repeatedly asserted they are evidence of literary quality and the intrinsic superiority of the nominated works. We have shown that it is. And third, to prove that the SF/F Right is more popular in the genre than the gatekeepers have insisted. We have demonstrated that to be the case.</li><li>People hate me a lot more than they hate Larry Correia. This is very troubling to the International Lord of Hate. I suspected as much, but I thought the ratio would be more like 65/35 than 90/10. That being said, I have little doubt that Larry will manage to level out that ratio somewhat by this time next year.</li><li>SF progressives believe they are qualified to police race and ethnicity. Many of them can’t seem to wrap their heads around the fact that I am a Person of Color by every definition. It’s amusing that they think my labeling a lying African-American woman a “half-savage” proves my racism, but them calling a pair of Hispanic men all sorts of names, including “savage” and “uncivilized”, somehow proves they are not racist. </li><li>If they are unhappy now, they are really going to be unhappy in the future. I paid no attention to the nominations last year. The Dread Ilk barely paid any attention to the nominations this year. As we’ve previously seen to be the case, the progressives really don’t understand that their frantic attempts to belittle and disqualify us only makes us stronger, harder, and more numerous.</li><li>Many Hugo voters have declared they will not read the novelette and it<br> is already apparent that some of those who read “Opera Vita Aeterna”<br> will not do so honestly. For example, one “reviewer” wrote: <i>“I skip a little tedious adolescent Theology talk in Act Two, Plus a<br> Silly Epilogue that I think VD thinks is Dramatic…. His point (I think) is that God Is Real.  And So R Demons.<br> The plot is pointless.   The writing is dull  and bad.”  </br></br></i>But anyone<br> who has read the story knows that the plot is far from pointless. And<br> anyone who is sufficiently educated will recognize that the theology is<br> not “adolescent”, it is paraphrased Thomas Aquinas from the<i> Summa Theologica</i>.</br></br></br></br></br></li><li>I appreciate the nomination. It’s nice to receive the recognition and it is certainly useful in much the same way as my Mensa membership. But, having recently edited two books by a much superior writer who should, by any reasonable standard, already have several Hugo wins under his belt, it’s hard to view the process as anything but seriously flawed.</li><li><i>The Wheel of Time</i> is dreadful. It has always been dreadful, in sum and in part. I find it mildly amazing that people are more offended about my novelette being nominated than that gigantic insult to literature.</li><li>The title of the novelette is no more Latin than “Vox Popoli”. It’s a blend of Italian and Latin.</li><li>A man is defined by his enemies as well as by his friends. I feel extraordinarily fortunate indeed to have had this opportunity to observe the quality of both. It is not at all a bad thing to be personally disliked and viewed as “a contemptible piece of shit” by the likes of Mr. Scalzi and company. It is the approval of the wormtongues that a man should fear, not their hatred.</li></ol></div>",
  "content_text": "SF fandom has no grasp of how small it is. The repeated accusations of cheating by purchasing multiple memberships and ballot-stuffing demonstrate that the accusers haven’t even bothered to look at the Feedburner icon or click on the Sitemeter icon here. Last year it took only 38 votes to make it onto the Best Novelette ballot; the top vote-getting nominee had all of 89 votes. Meanwhile, the vast quantity of upset and offended goodthinkers visiting here via do-not-link to gawk at the evidence of my being “the antithesis of all that is good and decent” led to a gargantuan 6.9 percent increase in traffic here, which is to say, 758 additional Sitemeter visits out of nearly 12,000.\nIt’s a lot harder to win a Hugo than to get nominated. To win, one needs about 400 votes under normal circumstances. But since the votes are ranked in order of preference and there is an active campaign to vote No Award above “Opera Vita Aeterna”, I’d need more than that. Translation: thanks very much for all the expressions of support, but don’t buy a membership to vote for me unless you’re also planning to get involved on the nomination end next year. If you want to express your support, I’d much rather you spend that money on Castalia House books by John, Tom, and Rolf. For $40 you can buy most of our English catalog… some of it directly from the store we are opening later today.\nWin or lose the awards, Sad Puppies has served its purpose. The purpose of Sad Puppies, as Larry repeatedly explained, was three-fold. First, to test if the award process was fraudulent or not. To the credit of the LonCon people, we have learned it was not. Second, to prove that the awards are a mere popularity contest, contra the insistence of those who have repeatedly asserted they are evidence of literary quality and the intrinsic superiority of the nominated works. We have shown that it is. And third, to prove that the SF/F Right is more popular in the genre than the gatekeepers have insisted. We have demonstrated that to be the case.\nPeople hate me a lot more than they hate Larry Correia. This is very troubling to the International Lord of Hate. I suspected as much, but I thought the ratio would be more like 65/35 than 90/10. That being said, I have little doubt that Larry will manage to level out that ratio somewhat by this time next year.\nSF progressives believe they are qualified to police race and ethnicity. Many of them can’t seem to wrap their heads around the fact that I am a Person of Color by every definition. It’s amusing that they think my labeling a lying African-American woman a “half-savage” proves my racism, but them calling a pair of Hispanic men all sorts of names, including “savage” and “uncivilized”, somehow proves they are not racist.\nIf they are unhappy now, they are really going to be unhappy in the future. I paid no attention to the nominations last year. The Dread Ilk barely paid any attention to the nominations this year. As we’ve previously seen to be the case, the progressives really don’t understand that their frantic attempts to belittle and disqualify us only makes us stronger, harder, and more numerous.\nMany Hugo voters have declared they will not read the novelette and it\nis already apparent that some of those who read “Opera Vita Aeterna”\nwill not do so honestly. For example, one “reviewer” wrote:\n“I skip a little tedious adolescent Theology talk in Act Two, Plus a\nSilly Epilogue that I think VD thinks is Dramatic…. His point (I think) is that God Is Real.  And So R Demons.\nThe plot is pointless.   The writing is dull  and bad.”\nBut anyone\nwho has read the story knows that the plot is far from pointless. And\nanyone who is sufficiently educated will recognize that the theology is\nnot “adolescent”, it is paraphrased Thomas Aquinas from the\nSumma Theologica\n.\nI appreciate the nomination. It’s nice to receive the recognition and it is certainly useful in much the same way as my Mensa membership. But, having recently edited two books by a much superior writer who should, by any reasonable standard, already have several Hugo wins under his belt, it’s hard to view the process as anything but seriously flawed.\nThe Wheel of Time\nis dreadful. It has always been dreadful, in sum and in part. I find it mildly amazing that people are more offended about my novelette being nominated than that gigantic insult to literature.\nThe title of the novelette is no more Latin than “Vox Popoli”. It’s a blend of Italian and Latin.\nA man is defined by his enemies as well as by his friends. I feel extraordinarily fortunate indeed to have had this opportunity to observe the quality of both. It is not at all a bad thing to be personally disliked and viewed as “a contemptible piece of shit” by the likes of Mr. Scalzi and company. It is the approval of the wormtongues that a man should fear, not their hatred.",
  "tags": [
    "freakshow",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-21T08:05:00+00:00"
}