{
  "url": "https://voxday.net/2014/04/07/two-more-bankers-down/",
  "scraped_at": "2025-12-15T16:51:59.319389",
  "title": "Two more bankers down",
  "date_display": "April 7, 2014",
  "date_iso": "2014-04-07T17:50:00+00:00",
  "date_from_url": "2014-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1.A mere two weeks since former JPMorgan banker, Kenneth Bellando jumped to his death, Bloomberg reports that<b><br> the former CEO of Dutch Bank ABN Amro (and his wife and daughter)<a href=\"http://www.zerohedge.com/news/2014-04-05/abn-amro-ex-ceo-found-dead\"> were found dead</a> at their home after a possible “family tragedy.”</br></b><br> This expands the dismal list of senior financial services executive<br> deaths to 12 in the last few months. The 57-year-old Jan Peter<br> Schmittmann, was reportedly discovered by his other daughter when she<br> arrived home that morning. <b>Police declined to comment on the cirumstances of his (and his wife and daughter’s) death.</b></br></br></br></br></p><p>2.  Over the weekend the world was gripped by the drama surrounding the mysterious murder-homicide of<br> the former CEO of Dutch bank ABN Amro and members of his family, and<br> whether there is more foul play than meets the eye. However, that is<br> nothing compared to what just happened in the tiny, and all too quiet<br> Principality of Lichtenstein, <b>where moments ago the CEO of local<br> financial institution Bank Frick &amp; Co. AG, Juergen Frick, <a href=\"http://www.zerohedge.com/news/2014-04-07/ceo-liechtenstein-bank-frick-murdered\">was shot dead</a> in the underground garage of the bank located in the city of<br> Balzers. </br></br></b></br></br></br></br></p><p>I don’t even have any theories at this point.<b> </b>It’s a moment of High Weirdness as the various deaths are more random and outlandish than one would expect to find in a thriller. But regardless of what is actually taking place, it does seem readily apparent that we are not dealing with a normal situation in the financial world here.<b></b><br> <b><br/></b>Even the most inventive fiction writer would struggle to fit the demise of European bankers, a CIA agent, and Peaches Geldof all into the same novel.</br></p></div>",
  "content_text": "1.A mere two weeks since former JPMorgan banker, Kenneth Bellando jumped to his death, Bloomberg reports that\nthe former CEO of Dutch Bank ABN Amro (and his wife and daughter)\nwere found dead\nat their home after a possible “family tragedy.”\nThis expands the dismal list of senior financial services executive\ndeaths to 12 in the last few months. The 57-year-old Jan Peter\nSchmittmann, was reportedly discovered by his other daughter when she\narrived home that morning.\nPolice declined to comment on the cirumstances of his (and his wife and daughter’s) death.\n2.  Over the weekend the world was gripped by the drama surrounding the mysterious murder-homicide of\nthe former CEO of Dutch bank ABN Amro and members of his family, and\nwhether there is more foul play than meets the eye. However, that is\nnothing compared to what just happened in the tiny, and all too quiet\nPrincipality of Lichtenstein,\nwhere moments ago the CEO of local\nfinancial institution Bank Frick & Co. AG, Juergen Frick,\nwas shot dead\nin the underground garage of the bank located in the city of\nBalzers.\nI don’t even have any theories at this point.\nIt’s a moment of High Weirdness as the various deaths are more random and outlandish than one would expect to find in a thriller. But regardless of what is actually taking place, it does seem readily apparent that we are not dealing with a normal situation in the financial world here.\nEven the most inventive fiction writer would struggle to fit the demise of European bankers, a CIA agent, and Peaches Geldof all into the same novel.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-07T16:50:00+00:00"
}