{
  "url": "https://voxday.net/2014/04/09/uninstalled/",
  "scraped_at": "2025-12-15T16:52:15.903658",
  "title": "#uninstalled",
  "date_display": "April 9, 2014",
  "date_iso": "2014-04-09T13:00:00+00:00",
  "date_from_url": "2014-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Firefox on Vox Popoli: 20 percent, down from 34 percent.<br> Firefox on Alpha Game: 22 percent, down from 30 percent.</br></p><p>I wouldn’t be surprised if the Eich debacle turns out to be the biggest negative for Mozilla since Google introduced Chrome. Chrome is actually down one percentage point, from 27 to 26 percent, as Pale Moon now accounts for 7 percent of the traffic here and 3 percent at AG.</p><p>There are even some suspicions that Mozilla is attempting to mitigate the size of the negative reports by manipulating its feedback reports: “C’mon Mozilla, I KNOW the UNHAPPY count exceeded 23,000 yesterday (8th),<br> others saw 50K for 7 day total.  You can manipulate your own feedback<br> forum if you choose to do so, but you cannot manipulate your market<br> share. You COULD publish a full and unreserved apology, and reinstate<br> your fine ex-CEO. That might POSSIBLY stop the rot, and save your<br> organisation from going under.”</br></br></br></br></br></p><p>And that is why it is important to #uninstallfirefox. It is the best way to prevent Mozilla from controlling the narrative in a friendly mainstream media, which has been much quieter about the backlash than about the initial criticism of Eich.</p></div>",
  "content_text": "Firefox on Vox Popoli: 20 percent, down from 34 percent.\nFirefox on Alpha Game: 22 percent, down from 30 percent.\nI wouldn’t be surprised if the Eich debacle turns out to be the biggest negative for Mozilla since Google introduced Chrome. Chrome is actually down one percentage point, from 27 to 26 percent, as Pale Moon now accounts for 7 percent of the traffic here and 3 percent at AG.\nThere are even some suspicions that Mozilla is attempting to mitigate the size of the negative reports by manipulating its feedback reports: “C’mon Mozilla, I KNOW the UNHAPPY count exceeded 23,000 yesterday (8th),\nothers saw 50K for 7 day total.  You can manipulate your own feedback\nforum if you choose to do so, but you cannot manipulate your market\nshare. You COULD publish a full and unreserved apology, and reinstate\nyour fine ex-CEO. That might POSSIBLY stop the rot, and save your\norganisation from going under.”\nAnd that is why it is important to #uninstallfirefox. It is the best way to prevent Mozilla from controlling the narrative in a friendly mainstream media, which has been much quieter about the backlash than about the initial criticism of Eich.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-04-09T12:00:00+00:00"
}