{
  "url": "https://voxday.net/2017/01/19/a-failure-of-dialectic/",
  "scraped_at": "2025-12-18T02:15:35.617381",
  "title": "A failure of dialectic",
  "date_display": "January 19, 2017",
  "date_iso": "2017-01-19T10:13:00+00:00",
  "date_from_url": "2017-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This account of feminism perverting theology is an excellent example of <a href=\"https://dalrock.wordpress.com/2017/01/17/surely-they-will-be-reasonable-once-they-see-how-reasonable-we-are/\">the way in which dialectic is impotent</a> when faced with a literally unreasonable opponent:</p><blockquote><p> The meaning of <i>head </i>in Ephesians 5 is critical not for egalitarians, nor even for traditionalists.  Even if <i>head </i>meant “source” in Ephesians 5, the passage still tells wives to submit to their husbands, and it is merely one of many which does so.  Egalitarians are lost even if they win this argument, and traditionalists are largely unfazed even if they somehow lost it.  On the other hand, the meaning of the word <i>head </i>is critical for complementarians, because complementarians twist themselves into knots to avoid telling wives to submit to their husbands out of a fear of seeming harsh, demeaning, and male supremacist.  The only way complementarians can sound traditional while avoiding preaching submission is to focus all of their energies on the responsibility of the husband to act in such a way that his wife naturally wants to submit.  This is not the biblical model of marriage, it is the complementarian model of marriage.  The closest to a biblical justification for this invention is the word <i>head </i>in Eph 5.  This is true despite the fact that even the word headship is discomforting to complementarians, who have coined the term servant leader and focus on cartoonish chivalry.</p><p>Even so, Grudem has done a great service by vigorously refuting the spurious claim about <i>head</i>.<br> <i><br/></i><br> <i>Why did I do this? So that commentaries, Greek lexicons, and Bible translations in future generations will accurately teach and translate a crucial verse in the word of God. If head equals “authority over” as has been shown now in over sixty examples, then the ballgame is over. And even today, twenty-four years after my first article, there are still zero examples where a person is called “head” of someone else and is not in authority over that person. Zero.</i></br></br></p><p>But as Grudem notes, despite the original claim being made without evidence, and having been thoroughly debunked, the Bible is not (and never was) the issue:<br> <i><br/></i><br> <i>That kind of evidence would normally settle the debate forever in ordinary exegesis of ordinary verses.</i><br> <i><br/></i><br> <i>But this is not an ordinary verse. Because the evangelical feminists cannot lose this verse, they continue to ignore or deny the evidence. I think that is very significant.</i><br> <i><br/></i><br> <i>It now seems to me that, for some people in this dispute who have thought through the issue and are committed to the egalitarian cause and have the academic knowledge to evaluate the evidence for themselves, what the Bible says on this question is not decisive. And, sadly, InterVarsity Press (USA), in spite of being given evidence of multiple factual errors in Catherine Kroeger’s article on “head” in Dictionary of Paul and His Letters,5 still continues to refuse to make any changes to the article.</i></br></br></br></br></br></br></p><p>Grudem goes on to recount his recollection of the founding of the CBMW.  I won’t summarize it here, but you can read it in the linked piece.  After the CBMW was founded, Grudem had his second major learning experience with egalitarians. Christians for Biblical Equality (CBE) asked for CBMW leadership to meet with them in an effort to find common ground.  At CBE’s urging the CBMW created what they expected would be a joint statement on abuse.  The CBMW leadership did not seem to understand that feminists are very open that their focus on abuse is about eradicating headship, not on actual abuse.  Even worse, the CBE was merely trying to take the CBMW off message, and had no interest in a mutual statement:</p><p><i>As we talked, there seemed to be agreement that one thing we could do together would be for both organizations to agree publicly that abuse within marriage is wrong. So we agreed to work on a joint statement on abuse. After the meeting, Mary Kassian drafted such a statement, and we got some feedback from the CBE people, and we were going to issue it. But, then on October 10, 1994, we received a letter from them saying that their board had considered it, and they would not join with us in the joint statement opposing abuse. I was shocked and disappointed when the letter came. I wondered then if their highest goal in this issue was to be faithful to Scripture above all and stop the horrors of abuse, or was to promote the egalitarian agenda. We ended up publishing the statement ourselves in CBMW NEWS (later renamed The Journal for Biblical Manhood and Womanhood).</i></p><p>Even after this, Grudem seems to have still expected good faith from egalitarians.  In yet another incident, Grudem and the CBMW were assured that the gender neutral version of the NIV had been scrapped:<br> <i><br/></i><br> <i>But just before the meeting began, the IBS issued a statement saying they had “abandoned all plans” for changes in gender-related language in future editions of the NIV. So we thought the controversy was done and the NIV would remain faithful in its translation of gender-related language in the Bible.</i><br> <i><br/></i><br> <i>Little did we know, however, that the Committee on Bible Translation for the NIV had not “abandoned all plans”! Far from it! Unknown to anyone outside their circles, for the next four years the Committee on Bible Translation, apparently with the quiet cooperation of people at Zondervan and the International Bible Society, continued working to produce a gender-neutral NIV. They had publicly “abandoned all plans,” but privately they were going full-steam ahead. Then suddenly in 2001, they announced unilaterally they were abandoning the agreement not to publish gender related changes in the NIV, and they published the TNIV New Testament in 2001 and the whole Bible in 2005.</i></br></br></br></br></p><p>In his conclusion Grudem says he originally thought the whole feminist rebellion would blow over once he and others carefully explained the correct meaning of Scripture:</p><p><i>I am surprised that this controversy has gone on so long. In the late 80s and early 90s when we began this, I expected that this would probably be over in ten years. By force of argument, by use of facts, by careful exegesis, by the power of the clear word of God, by the truth, I expected the entire church would be persuaded, the battle for the purity of the church would be won, and egalitarian advocates would be marginalized and have no significant influence. But it has not completely happened yet!</i></p><p>Unspoken in this (and complementarianism at large) is an attitude that Christian feminists are not rebelling against God in a pattern that dates back to the fall, but are the natural reaction to a suddenly harsh generation of Christian men.  This is why Grudem and his colleagues repeatedly fell for the feminist ruses, and why to this day they are most concerned with showing how reasonable they are.</p></blockquote><p>I have a simple and efficient metric that permits me to avoid such problems. Any time anyone relies on “equality” for <i>any </i>aspect of their argument, I assume they are, at best, deluded, and on average, dishonest. I take arguments that appeal to, or rely upon, equality, about as seriously as those that rely upon “unicorns” or “leprechauns” as their justifications.</p><p>I have yet to see anyone make an honest and compelling argument that utilized equality. It is an intrinsically evil concept that <i>always </i>leads even otherwise honest men astray.</p><p>Mr. Grudem could have saved himself 21 years of pointless argument by applying this extraordinarily reliable metric. But at least he did the rest of us the favor of demonstrating that Churchian equalitarianism is every bit as evil and deceptive as its worldly counterpart, and that it is only a matter of time before Christian feminism drops the adjective as well as the concept of Scriptural authority.</p><p>What a pity that even Biblical scholars don’t know how to utilize the wisdom of Proverbs.</p><p><i>A continual dripping on a very rainy day and a contentious woman are alike; Whoever restrains her restrains the wind, and grasps oil with his right hand.</i><br> – Proverbs 27:15-16</br></p></div>",
  "content_text": "This account of feminism perverting theology is an excellent example of\nthe way in which dialectic is impotent\nwhen faced with a literally unreasonable opponent:\nThe meaning of\nhead\nin Ephesians 5 is critical not for egalitarians, nor even for traditionalists.  Even if\nhead\nmeant “source” in Ephesians 5, the passage still tells wives to submit to their husbands, and it is merely one of many which does so.  Egalitarians are lost even if they win this argument, and traditionalists are largely unfazed even if they somehow lost it.  On the other hand, the meaning of the word\nhead\nis critical for complementarians, because complementarians twist themselves into knots to avoid telling wives to submit to their husbands out of a fear of seeming harsh, demeaning, and male supremacist.  The only way complementarians can sound traditional while avoiding preaching submission is to focus all of their energies on the responsibility of the husband to act in such a way that his wife naturally wants to submit.  This is not the biblical model of marriage, it is the complementarian model of marriage.  The closest to a biblical justification for this invention is the word\nhead\nin Eph 5.  This is true despite the fact that even the word headship is discomforting to complementarians, who have coined the term servant leader and focus on cartoonish chivalry.\nEven so, Grudem has done a great service by vigorously refuting the spurious claim about\nhead\n.\nWhy did I do this? So that commentaries, Greek lexicons, and Bible translations in future generations will accurately teach and translate a crucial verse in the word of God. If head equals “authority over” as has been shown now in over sixty examples, then the ballgame is over. And even today, twenty-four years after my first article, there are still zero examples where a person is called “head” of someone else and is not in authority over that person. Zero.\nBut as Grudem notes, despite the original claim being made without evidence, and having been thoroughly debunked, the Bible is not (and never was) the issue:\nThat kind of evidence would normally settle the debate forever in ordinary exegesis of ordinary verses.\nBut this is not an ordinary verse. Because the evangelical feminists cannot lose this verse, they continue to ignore or deny the evidence. I think that is very significant.\nIt now seems to me that, for some people in this dispute who have thought through the issue and are committed to the egalitarian cause and have the academic knowledge to evaluate the evidence for themselves, what the Bible says on this question is not decisive. And, sadly, InterVarsity Press (USA), in spite of being given evidence of multiple factual errors in Catherine Kroeger’s article on “head” in Dictionary of Paul and His Letters,5 still continues to refuse to make any changes to the article.\nGrudem goes on to recount his recollection of the founding of the CBMW.  I won’t summarize it here, but you can read it in the linked piece.  After the CBMW was founded, Grudem had his second major learning experience with egalitarians. Christians for Biblical Equality (CBE) asked for CBMW leadership to meet with them in an effort to find common ground.  At CBE’s urging the CBMW created what they expected would be a joint statement on abuse.  The CBMW leadership did not seem to understand that feminists are very open that their focus on abuse is about eradicating headship, not on actual abuse.  Even worse, the CBE was merely trying to take the CBMW off message, and had no interest in a mutual statement:\nAs we talked, there seemed to be agreement that one thing we could do together would be for both organizations to agree publicly that abuse within marriage is wrong. So we agreed to work on a joint statement on abuse. After the meeting, Mary Kassian drafted such a statement, and we got some feedback from the CBE people, and we were going to issue it. But, then on October 10, 1994, we received a letter from them saying that their board had considered it, and they would not join with us in the joint statement opposing abuse. I was shocked and disappointed when the letter came. I wondered then if their highest goal in this issue was to be faithful to Scripture above all and stop the horrors of abuse, or was to promote the egalitarian agenda. We ended up publishing the statement ourselves in CBMW NEWS (later renamed The Journal for Biblical Manhood and Womanhood).\nEven after this, Grudem seems to have still expected good faith from egalitarians.  In yet another incident, Grudem and the CBMW were assured that the gender neutral version of the NIV had been scrapped:\nBut just before the meeting began, the IBS issued a statement saying they had “abandoned all plans” for changes in gender-related language in future editions of the NIV. So we thought the controversy was done and the NIV would remain faithful in its translation of gender-related language in the Bible.\nLittle did we know, however, that the Committee on Bible Translation for the NIV had not “abandoned all plans”! Far from it! Unknown to anyone outside their circles, for the next four years the Committee on Bible Translation, apparently with the quiet cooperation of people at Zondervan and the International Bible Society, continued working to produce a gender-neutral NIV. They had publicly “abandoned all plans,” but privately they were going full-steam ahead. Then suddenly in 2001, they announced unilaterally they were abandoning the agreement not to publish gender related changes in the NIV, and they published the TNIV New Testament in 2001 and the whole Bible in 2005.\nIn his conclusion Grudem says he originally thought the whole feminist rebellion would blow over once he and others carefully explained the correct meaning of Scripture:\nI am surprised that this controversy has gone on so long. In the late 80s and early 90s when we began this, I expected that this would probably be over in ten years. By force of argument, by use of facts, by careful exegesis, by the power of the clear word of God, by the truth, I expected the entire church would be persuaded, the battle for the purity of the church would be won, and egalitarian advocates would be marginalized and have no significant influence. But it has not completely happened yet!\nUnspoken in this (and complementarianism at large) is an attitude that Christian feminists are not rebelling against God in a pattern that dates back to the fall, but are the natural reaction to a suddenly harsh generation of Christian men.  This is why Grudem and his colleagues repeatedly fell for the feminist ruses, and why to this day they are most concerned with showing how reasonable they are.\nI have a simple and efficient metric that permits me to avoid such problems. Any time anyone relies on “equality” for\nany\naspect of their argument, I assume they are, at best, deluded, and on average, dishonest. I take arguments that appeal to, or rely upon, equality, about as seriously as those that rely upon “unicorns” or “leprechauns” as their justifications.\nI have yet to see anyone make an honest and compelling argument that utilized equality. It is an intrinsically evil concept that\nalways\nleads even otherwise honest men astray.\nMr. Grudem could have saved himself 21 years of pointless argument by applying this extraordinarily reliable metric. But at least he did the rest of us the favor of demonstrating that Churchian equalitarianism is every bit as evil and deceptive as its worldly counterpart, and that it is only a matter of time before Christian feminism drops the adjective as well as the concept of Scriptural authority.\nWhat a pity that even Biblical scholars don’t know how to utilize the wisdom of Proverbs.\nA continual dripping on a very rainy day and a contentious woman are alike; Whoever restrains her restrains the wind, and grasps oil with his right hand.\n– Proverbs 27:15-16",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-19T10:13:00+00:00"
}