{
  "url": "https://voxday.net/2017/01/05/a-new-hypothesis/",
  "scraped_at": "2025-12-18T02:13:31.396245",
  "title": "A new hypothesis",
  "date_display": "January 5, 2017",
  "date_iso": "2017-01-05T08:43:00+00:00",
  "date_from_url": "2017-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scientists discover <a href=\"https://www.irishtimes.com/news/science/dublin-based-scientists-find-an-area-of-the-brain-linked-to-autism-1.2925359\">a physical manifestation of autism</a>:</p><blockquote><p> A team of scientists has discovered that a particular region of the brain is affected in those with autism spectrum disorder (ASD). They believe that finding the brain region which causes social deficits in those with the condition could point towards new types of therapies. The team included scientists based at ETH Zürich, Trinity College Dublin, Oxford University and Royal Holloway.</p><p>They ran MRI brain scans on people with ASD, and on healthy volunteers, in an attempt to track down the brain region linked to some of the behaviours seen in those with ASD and find differences between the two groups.</p><p>Dr Joshua Henk Balsters, the team leader, is based at ETH Zürich but performed much of the research at Trinity while working as a postdoctoral research fellow. He described how ASD can disturb normal personal exchanges. “The ability to understand how other people make decisions and what happens to them as a result is key to successful social interaction,” he said. “A big part of social interaction is to try and understand another person’s point of view. You need to understand another person’s perspective and that is very difficult if you have ASD.”</p><p>The researchers identified changes in a region called the gyrus of the anterior cingulate cortex, a part of the brain that responds when someone else experiences something surprising. They published their findings in the current edition of the journal Brain.</p></blockquote><p>My new hypothesis is that scientists will eventually discover that people with these changes in the gyrus of the anterior cingulate cortex also happen to possess a statistically significant predilection towards atheism. Remember, there have been two university studies based on <a href=\"http://www.milobookclub.com/2007/08/02/socially-autistic-atheis/\">my original 2007 hypothesis</a> that there is a correlation between ASD and atheism, and both studies achieved results that tended to support the hypothesis.</p><p>Sam Harris had it backwards. Atheists and theists don’t think differently due to their beliefs, but atheists have different beliefs due to their abnormal brain structure. It’s neither superior reason nor a dedication to logic that tends to produce an atheist, but rather, a lack of ability to grasp the perspective of others. There are other causal factors, of course; this does not explain the “mad at Dad” atheist or the “I will brook no limitations on my sexual behavior” atheist, but it does explain the spergey, socially clumsy sort that bring up their active disbelief at every opportunity.</p></div>",
  "content_text": "Scientists discover\na physical manifestation of autism\n:\nA team of scientists has discovered that a particular region of the brain is affected in those with autism spectrum disorder (ASD). They believe that finding the brain region which causes social deficits in those with the condition could point towards new types of therapies. The team included scientists based at ETH Zürich, Trinity College Dublin, Oxford University and Royal Holloway.\nThey ran MRI brain scans on people with ASD, and on healthy volunteers, in an attempt to track down the brain region linked to some of the behaviours seen in those with ASD and find differences between the two groups.\nDr Joshua Henk Balsters, the team leader, is based at ETH Zürich but performed much of the research at Trinity while working as a postdoctoral research fellow. He described how ASD can disturb normal personal exchanges. “The ability to understand how other people make decisions and what happens to them as a result is key to successful social interaction,” he said. “A big part of social interaction is to try and understand another person’s point of view. You need to understand another person’s perspective and that is very difficult if you have ASD.”\nThe researchers identified changes in a region called the gyrus of the anterior cingulate cortex, a part of the brain that responds when someone else experiences something surprising. They published their findings in the current edition of the journal Brain.\nMy new hypothesis is that scientists will eventually discover that people with these changes in the gyrus of the anterior cingulate cortex also happen to possess a statistically significant predilection towards atheism. Remember, there have been two university studies based on\nmy original 2007 hypothesis\nthat there is a correlation between ASD and atheism, and both studies achieved results that tended to support the hypothesis.\nSam Harris had it backwards. Atheists and theists don’t think differently due to their beliefs, but atheists have different beliefs due to their abnormal brain structure. It’s neither superior reason nor a dedication to logic that tends to produce an atheist, but rather, a lack of ability to grasp the perspective of others. There are other causal factors, of course; this does not explain the “mad at Dad” atheist or the “I will brook no limitations on my sexual behavior” atheist, but it does explain the spergey, socially clumsy sort that bring up their active disbelief at every opportunity.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-05T08:43:00+00:00"
}