{
  "url": "https://voxday.net/2017/01/29/alt-right-or-surrender/",
  "scraped_at": "2025-12-18T06:59:03.180543",
  "title": "Alt-Right or surrender",
  "date_display": "January 29, 2017",
  "date_iso": "2017-01-29T09:51:00+00:00",
  "date_from_url": "2017-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"tr_bq\"> <a href=\"http://thezman.com/wordpress/?p=9487#comments\">This is a trenchant observation</a> that explains the emptiness of civic nationalism and why there is no actual alternative to the Alt-Right anymore. Identity politics are no more a choice than war is a choice once the enemy is marching. It is demographics, and awareness of demographics, that distinguish between identity and ideology, and the post-1965 US demographics no longer permit one to ignore the reality of identity politics:</div><blockquote><p> This is, in the realm of practical politics, why the Buckley crowd is circling the drain as a political force. Way back in the 60’s, they could not bring themselves to challenge the implausible claims by the Left with regards to civil rights. Instead, they picked the losing hand of state’s rights, hoping to avoid facing the Left over the “negro question.” As a result, they ceded the moral high ground to the Left with regards to race and identity. No amount of legal precedent could stand in the way of social justice!</p><p>Ever since, the Buckley-ites have had to fight the Left while acknowledging that the Left is their moral superior and the arbiter of civil morality. That’s a battle that can never be won as the other side will simply declare your latest position to be heresy and out of bounds. No matter how logical and right your position, it can never withstand the moral authorities saying it is wrong. That’s why the Left has won every battle in the culture war. They can thunder, “you may have facts, but we have righteousness!”</p><p>There’s another problem with what Milo and Sam Harris are saying. Let’s stipulate that identity politics are a bad thing. Is playing that card better or worse than losing to the Left as they relentlessly play the identity politics game? Unless you have a serious mental illness, you have to see that the Left is nothing but identity politics now and they are winning. Just turn on the TV. Just look at the best seller list. The people of the New Religion hate white people, particularly white men and they will not be talked out of it.</p><p>The question that faces every man is not “what sort of society do I want for myself and my children?” That’s a lie and it has always been a lie. The question is “What are my choices and how do I achieve my preferred option?” The choice pushed by our betters is a world run by Black Lives Matters and women dressed as vaginas. If the other option is white pride, white nationalism and white supremacy, it is not hard to see how this is going to go.</p><p>All of the howling and complaining from the Official Right about the rise of the so-called alt-right is due to the unanswered question from the Milo piece. If the identity politics of the alt-right are bad, what’s the other option? If the answer is submission, which has been the case for the last three decades, at least, then the response is not just going to be “no” it is going to be “hell no!” No amount of moral preening is going to work because that is the thing people are rebelling against. What’s left is what is always what’s left and that’s force.</p></blockquote><p>And that is why I have been saying that the Alt-Right Revolution is inevitable. I’m not trying to talk anyone into it. I’m not proselytizing or preaching. I am observing the historical trends playing out the way they reliably do.</p><p>Civic nationalism was stricken and fatally wounded in 1965. It has been bleeding out ever since, and both the conservatives and the New Right are fighting a hopeless battle to prevent not only the people of the Right, but the white nations, from abandoning ideology for identity because that is what they have to do if they, and the Western civilization they created, are going to survive.</p><p>There is no real conflict between the Alt-Right and the Alt-Lite. The latter are going to join us in time. It’s actually testimony to their human decency that they struggle with accepting the dark reality that the post-1965 demographics have thrust upon us. They are like the nice white people in Iowa who can’t understand why people in Texas or California might have any problem with those hard-working Mexicans with their exotic food coming to America in search of a better life. Once a few thousand metaphorical Somalis and Nigerians move into their conceptual neighborhood, they’ll not only understand, they’ll become even more militant than we are.</p><p>Look, merely encountering Somalis at the mall convinced hundreds of thousands of Minnesotans to vote for a Republican presidential candidate that the media called racist. Unless you’ve grown up in Lutheran Scandihoovia, you can’t possibly understand the significance of that. That is the power of identity politics.</p><p><i>“The reality is, if you force everyone to play identity politics, if you insist in pitting whites against blacks, women against men, straights against gays, the reality is you guys are gonna win.”</i><br> – Milo Yiannopoulos</br></p><p>Precisely. In fact, the only flaw in Milo’s analysis is the idea that we have a choice. We don’t. This isn’t a recent observation on my part, as I specifically warned everyone <a href=\"http://www.milobookclub.com/2013/03/21/elephants-never-learn/\">four years ago</a> that identity politics were, not only inevitable, but already the dominant form of US politics.</p><blockquote><p> US politics are now an identity game.  Democrats have already established that they are the brown, black, and yellow party, so unless Republicans realize that they are, whether they like it or not, the white party, and begin to plan their strategy accordingly, they not only cannot win intentionally, they aren’t really even in the game.  It’s like watching a rugby team trying to play football without bothering to learn what the rules are. It is long past time for conservatives to realize that one cannot continue to play by centuries-old Anglo-Saxon rules after one permits a large quantity of non-Anglos who neither know nor care about those rules to invade the playing field.  The great irony is that the Republicans of the sort one finds on the Wall Street Journal editorial page, who cling to the outdated notion of a creedal United States, genuinely consider themselves to be pragmatists.</p></blockquote></div>",
  "content_text": "This is a trenchant observation\nthat explains the emptiness of civic nationalism and why there is no actual alternative to the Alt-Right anymore. Identity politics are no more a choice than war is a choice once the enemy is marching. It is demographics, and awareness of demographics, that distinguish between identity and ideology, and the post-1965 US demographics no longer permit one to ignore the reality of identity politics:\nThis is, in the realm of practical politics, why the Buckley crowd is circling the drain as a political force. Way back in the 60’s, they could not bring themselves to challenge the implausible claims by the Left with regards to civil rights. Instead, they picked the losing hand of state’s rights, hoping to avoid facing the Left over the “negro question.” As a result, they ceded the moral high ground to the Left with regards to race and identity. No amount of legal precedent could stand in the way of social justice!\nEver since, the Buckley-ites have had to fight the Left while acknowledging that the Left is their moral superior and the arbiter of civil morality. That’s a battle that can never be won as the other side will simply declare your latest position to be heresy and out of bounds. No matter how logical and right your position, it can never withstand the moral authorities saying it is wrong. That’s why the Left has won every battle in the culture war. They can thunder, “you may have facts, but we have righteousness!”\nThere’s another problem with what Milo and Sam Harris are saying. Let’s stipulate that identity politics are a bad thing. Is playing that card better or worse than losing to the Left as they relentlessly play the identity politics game? Unless you have a serious mental illness, you have to see that the Left is nothing but identity politics now and they are winning. Just turn on the TV. Just look at the best seller list. The people of the New Religion hate white people, particularly white men and they will not be talked out of it.\nThe question that faces every man is not “what sort of society do I want for myself and my children?” That’s a lie and it has always been a lie. The question is “What are my choices and how do I achieve my preferred option?” The choice pushed by our betters is a world run by Black Lives Matters and women dressed as vaginas. If the other option is white pride, white nationalism and white supremacy, it is not hard to see how this is going to go.\nAll of the howling and complaining from the Official Right about the rise of the so-called alt-right is due to the unanswered question from the Milo piece. If the identity politics of the alt-right are bad, what’s the other option? If the answer is submission, which has been the case for the last three decades, at least, then the response is not just going to be “no” it is going to be “hell no!” No amount of moral preening is going to work because that is the thing people are rebelling against. What’s left is what is always what’s left and that’s force.\nAnd that is why I have been saying that the Alt-Right Revolution is inevitable. I’m not trying to talk anyone into it. I’m not proselytizing or preaching. I am observing the historical trends playing out the way they reliably do.\nCivic nationalism was stricken and fatally wounded in 1965. It has been bleeding out ever since, and both the conservatives and the New Right are fighting a hopeless battle to prevent not only the people of the Right, but the white nations, from abandoning ideology for identity because that is what they have to do if they, and the Western civilization they created, are going to survive.\nThere is no real conflict between the Alt-Right and the Alt-Lite. The latter are going to join us in time. It’s actually testimony to their human decency that they struggle with accepting the dark reality that the post-1965 demographics have thrust upon us. They are like the nice white people in Iowa who can’t understand why people in Texas or California might have any problem with those hard-working Mexicans with their exotic food coming to America in search of a better life. Once a few thousand metaphorical Somalis and Nigerians move into their conceptual neighborhood, they’ll not only understand, they’ll become even more militant than we are.\nLook, merely encountering Somalis at the mall convinced hundreds of thousands of Minnesotans to vote for a Republican presidential candidate that the media called racist. Unless you’ve grown up in Lutheran Scandihoovia, you can’t possibly understand the significance of that. That is the power of identity politics.\n“The reality is, if you force everyone to play identity politics, if you insist in pitting whites against blacks, women against men, straights against gays, the reality is you guys are gonna win.”\n– Milo Yiannopoulos\nPrecisely. In fact, the only flaw in Milo’s analysis is the idea that we have a choice. We don’t. This isn’t a recent observation on my part, as I specifically warned everyone\nfour years ago\nthat identity politics were, not only inevitable, but already the dominant form of US politics.\nUS politics are now an identity game.  Democrats have already established that they are the brown, black, and yellow party, so unless Republicans realize that they are, whether they like it or not, the white party, and begin to plan their strategy accordingly, they not only cannot win intentionally, they aren’t really even in the game.  It’s like watching a rugby team trying to play football without bothering to learn what the rules are. It is long past time for conservatives to realize that one cannot continue to play by centuries-old Anglo-Saxon rules after one permits a large quantity of non-Anglos who neither know nor care about those rules to invade the playing field.  The great irony is that the Republicans of the sort one finds on the Wall Street Journal editorial page, who cling to the outdated notion of a creedal United States, genuinely consider themselves to be pragmatists.",
  "tags": [
    "#AltRight",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-29T09:51:00+00:00"
}