{
  "url": "https://voxday.net/2017/01/21/an-acceptable-tactic/",
  "scraped_at": "2025-12-18T06:57:45.087137",
  "title": "An acceptable tactic",
  "date_display": "January 21, 2017",
  "date_iso": "2017-01-21T01:33:00+00:00",
  "date_from_url": "2017-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently the Left isn’t taking Breitbart’s warning seriously about <a href=\"https://twitter.com/MrTrunney/status/822580347409932290\">punching back</a> twice as hard. It’s strange, but none of them have ever tried to punch me or Mike Cernovich despite many threats to do so over the years. Of course, if one of us hits you, you’re not only likely to go down and stay down, based on past experience, something is probably going to get broken in the process.</p><p>That being said, it’s long past time for the Right to be prepared for these petty attacks at public events, with at least four martial arts-trained bodyguards armed with street-legal melee weapons, and, in states with carry laws, two or more concealed-carry licensees. I always anticipate the possibility of street violence from the Left at public events; when we hosted GGinParis, I hired a number of martial artists to cover all entries and patrol the immediate vicinity. I also had a reasonable supply of legal weaponry on hand and made contact with the police station one block away so that they would know who we were and that we were minding our own business.</p><p>And when doing an interview in public, be sure to have at least one spotter keeping an eye out for potential trouble approaching. Two is better. Also, don’t <i>ever </i>leave your back exposed. The reporter is going to distract you from people moving around you, so first position yourself with your back to a wall if possible, or a car if not.</p><p>This article, <a href=\"https://status451.com/2017/01/20/days-of-rage/\">Days of Rage</a>, goes into some detail concerning the political violence of the 1970s that is potentially relevant to today’s troubling environment, except for one thing. We are not our parents or our grandparents. We are not only willing to fight the Left, but are willing to fight them effectively, and within the constraints of the law, when they attack us. We are not unarmed and we are not unprepared. Far more of us have training and many vets even have combat experience. And there is absolutely <i>nothing </i>“Nazi” about self-defense.</p><blockquote><p> If at any point in 2017 Trump supporters are harmed or harrassed like the rally in Chicago, expect Righties to get very interested in forming street defense leagues: goons and headhunters to make Black Bloc spit teeth. And they’ll be purely defensive. For a while. But they’re human. So then they’ll think about getting proactive.</p><p>Bluntly: this is dangerous. The people who do it for the Left are literal Communists. What kind of Righties will it draw? Oh, I dunno, I’m guessing people who’re comfortable with violence, who don’t mind breaking norms or being arrested…</p><p>…if you’re now thinking, “Oh shit,” well, guess what? So am I.</p><p>If streetfights start happening on a regular basis on American streets, our democracy will corrode very quickly. We’ll see rapid radicalization at both poles, meaning normalization of political extremists.</p><p>The usual story American politics tells of how extremists get politically normalized is, to say the least, inaccurate. “Extremists get normalized bc the mainstream says things so beyond the pale it invites extremes.” ie, “Republicans make Nazis.” Bullshit.</p><p>How extremists really get mainstreamed: because the extremists have organization, logistics, and manpower that the mainstream finds useful.</p><p>Mainstream Lefties happily go to protests they favor that are organized by the literal Stalinists of ANSWER &amp; the Worker’s World Party. Why? The commies are really good at getting people signs and making sure there are enough port-a-potties. When you’re great at organizing signs &amp; port-a-potties, Lefties overlook that you’re into an ideology that murdered a hundred million people.</p><p>So how far would this go? Would mainstream Nazi-hating Righties be ok w/ literal Nazis on the streetfighting squads that keep them safe?</p><p>I dunno; how’d you feel about folks who voluntarily get their bodies between your peaceful gathering and a crowd trying to intimidate you?</p><p>Lefties could keep that very human thing from happening. But they’d have to de-escalate. And they won’t. Mellow out on college campuses? Quit disrupting righty events? No chance. It’s too much fun. So the hard Left is going to do more to normalize literal Nazis in America than anyone since Charles Lindbergh.</p></blockquote><p>Get fit. Get hard. And always be prepared.</p></div>",
  "content_text": "Apparently the Left isn’t taking Breitbart’s warning seriously about\npunching back\ntwice as hard. It’s strange, but none of them have ever tried to punch me or Mike Cernovich despite many threats to do so over the years. Of course, if one of us hits you, you’re not only likely to go down and stay down, based on past experience, something is probably going to get broken in the process.\nThat being said, it’s long past time for the Right to be prepared for these petty attacks at public events, with at least four martial arts-trained bodyguards armed with street-legal melee weapons, and, in states with carry laws, two or more concealed-carry licensees. I always anticipate the possibility of street violence from the Left at public events; when we hosted GGinParis, I hired a number of martial artists to cover all entries and patrol the immediate vicinity. I also had a reasonable supply of legal weaponry on hand and made contact with the police station one block away so that they would know who we were and that we were minding our own business.\nAnd when doing an interview in public, be sure to have at least one spotter keeping an eye out for potential trouble approaching. Two is better. Also, don’t\never\nleave your back exposed. The reporter is going to distract you from people moving around you, so first position yourself with your back to a wall if possible, or a car if not.\nThis article,\nDays of Rage\n, goes into some detail concerning the political violence of the 1970s that is potentially relevant to today’s troubling environment, except for one thing. We are not our parents or our grandparents. We are not only willing to fight the Left, but are willing to fight them effectively, and within the constraints of the law, when they attack us. We are not unarmed and we are not unprepared. Far more of us have training and many vets even have combat experience. And there is absolutely\nnothing\n“Nazi” about self-defense.\nIf at any point in 2017 Trump supporters are harmed or harrassed like the rally in Chicago, expect Righties to get very interested in forming street defense leagues: goons and headhunters to make Black Bloc spit teeth. And they’ll be purely defensive. For a while. But they’re human. So then they’ll think about getting proactive.\nBluntly: this is dangerous. The people who do it for the Left are literal Communists. What kind of Righties will it draw? Oh, I dunno, I’m guessing people who’re comfortable with violence, who don’t mind breaking norms or being arrested…\n…if you’re now thinking, “Oh shit,” well, guess what? So am I.\nIf streetfights start happening on a regular basis on American streets, our democracy will corrode very quickly. We’ll see rapid radicalization at both poles, meaning normalization of political extremists.\nThe usual story American politics tells of how extremists get politically normalized is, to say the least, inaccurate. “Extremists get normalized bc the mainstream says things so beyond the pale it invites extremes.” ie, “Republicans make Nazis.” Bullshit.\nHow extremists really get mainstreamed: because the extremists have organization, logistics, and manpower that the mainstream finds useful.\nMainstream Lefties happily go to protests they favor that are organized by the literal Stalinists of ANSWER & the Worker’s World Party. Why? The commies are really good at getting people signs and making sure there are enough port-a-potties. When you’re great at organizing signs & port-a-potties, Lefties overlook that you’re into an ideology that murdered a hundred million people.\nSo how far would this go? Would mainstream Nazi-hating Righties be ok w/ literal Nazis on the streetfighting squads that keep them safe?\nI dunno; how’d you feel about folks who voluntarily get their bodies between your peaceful gathering and a crowd trying to intimidate you?\nLefties could keep that very human thing from happening. But they’d have to de-escalate. And they won’t. Mellow out on college campuses? Quit disrupting righty events? No chance. It’s too much fun. So the hard Left is going to do more to normalize literal Nazis in America than anyone since Charles Lindbergh.\nGet fit. Get hard. And always be prepared.",
  "tags": [
    "SJW",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-21T01:33:00+00:00"
}