{
  "url": "https://voxday.net/2017/01/21/attack-but-politely-please/",
  "scraped_at": "2025-12-18T06:57:48.396025",
  "title": "Attack, but politely, please",
  "date_display": "January 21, 2017",
  "date_iso": "2017-01-21T13:00:00+00:00",
  "date_from_url": "2017-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The cucks are trying,<i> so hard</i>, to wrap their heads around how one can fight back successfully against the Left. And yet, <a href=\"https://www.conservativereview.com/commentary/2017/01/another-trump-lesson-for-republicans-do-not-give-your-critics-an-inch\">they are still failing</a>, because they are intellectual cowards more concerned with means than ends:</p><blockquote><p> We ought to take a page from the playbook of Trump, who has almost singularly provided us with a golden opportunity to redefine the terms of battle, no longer fighting on leftist ground. For Republicans and conservatives has been liberated from the PC thought police. We are free to fight back when vicious charges are leveled at us designed to instill fear and chill dissent.</p><p>As former speaker Newt Gingrich has perceptively noted, Trump has been a masterful media manipulator, getting media members to chase so-called “shiny objects” — “Can you believe Trump said X!?” ad nauseam.</p><p>Mr. Trump’s version of stray voltage has a number of effects beyond just causing chaos and distracting his opponents. When everything is an outrage, nothing is an outrage. And when everything is an outrage, you expose yourself as a purely partisan actor, turning off large swaths of the American public.</p><p>Trump’s lack of fear of touching politically incorrect third rails that millions of Americans felt, but which had not been articulated so bluntly by a national politician, served him well. Incidentally, it also allowed him to shift the Overton Window on critical issues like immigration and Islamic supremacism.</p><p>When attacked for taking these positions, unlike those to come before him, Trump did not avoid the fray. Rather, he jumped into it, counterpunching.</p><p>Lulled into a false sense of security by Republicans who fought with their hands tied behind their backs, constrained by suicidal rules of political engagement for decades, the Left did not know how to react when hit.</p><p>Leftists could not believe that a political opponent had the gall to actually fight tooth and nail.</p><p>Trump does not give an inch to his critics, and neither should any other Republican. He defines the rules of engagement, and so should all on the Right.</p><p>Watching the confirmation hearings to date, we see many on the Left jabbing as if we are in a pre-Trump world. Their questions all hew to the same old narrative that if you are not a racist, sexist, or bigot, then you are an out-of-touch plutocrat or a shill for some special interest or other.</p><p>Like Trump, Republicans should challenge these charges head on. They should take issue with the Left’s premises from the start, showing that it is the Left who is projecting when it tries to discredit those who believe in capitalism, the power of the individual, and the sanctity of the individual’s rights, the rule of law, national sovereignty, federalism, and the Judeo-Christian morality on which the country is based.</p><p>When leftists attack an attorney general designate because he is a white male from the South, they should be attacked for judging based on color of skin (rather than content of character) and for trying to bruise an appointee who will not stand for open borders, selective law enforcement, and politicized justice.</p><p>When leftists attack a secretary of education designate because her family is wealthy, they should be attacked for their anti-capitalism and hypocrisy, and their real desire to bloody an appointee because she believes that the Left’s own constituents — and indeed all Americans — should have the opportunity to send their kids to superior schools, rather than being doomed to a subpar education because it mollifies a teachers union.</p><p>These attacks are designed to put not only the appointees, but also all right-thinking people on the defensive — to fear reflexively a false premise because those premises have prevailed among the progressives who dominated media, academia, and government for decades.</p><p>We should no longer live in fear — for the Left thrives when we self-censor and accept its baseless premises.</p></blockquote><p>They ought to take a page from Trump, but they won’t, because they STILL accept the baseless premises of the Left. Consider the cucking on display even in this exhortation to be bold and fearless and willing to fight:</p><ul><li><i>The Judeo-Christian morality on which the country is based.</i> There is no “Judeo-Christian morality”. Nor is the country based on the nonexistent concept. The USA was founded by Christians on the basis of predominantly Protestant values. Judaism, which is considerably more than the Mosaic Law, had, and has, nothing to do with the American nation or the founding of the USA. These appeals to the teachings of Judeo Christ rather than Jesus Christ are the certain sign of the cuck.</li><li><i>they should be attacked for judging based on color of skin</i>. Dems are the real racists! Cucks never learn, they only project their fear of being accused of racism on everyone else.</li><li><i>they should be attacked for their anti-capitalism and hypocrisy. </i>Call them commies! And hypocrites! Because that has worked so well for the last 50 years, right?</li></ul><p>The ironic thing is that Donald Trump NEVER utilizes these feeble forms of limp-wristed hand-waving. He goes after them where it hurts, in a direct and aggressive manner that inevitably make the cucks complain that he is rude and boorish and hurtful.</p><p>Forget conservatism. Conservatives don’t fight. Their failure to do so, their <i>inevitable </i>failure to conserve anything, is why the Alt-Right exists in the first place.</p></div>",
  "content_text": "The cucks are trying,\nso hard\n, to wrap their heads around how one can fight back successfully against the Left. And yet,\nthey are still failing\n, because they are intellectual cowards more concerned with means than ends:\nWe ought to take a page from the playbook of Trump, who has almost singularly provided us with a golden opportunity to redefine the terms of battle, no longer fighting on leftist ground. For Republicans and conservatives has been liberated from the PC thought police. We are free to fight back when vicious charges are leveled at us designed to instill fear and chill dissent.\nAs former speaker Newt Gingrich has perceptively noted, Trump has been a masterful media manipulator, getting media members to chase so-called “shiny objects” — “Can you believe Trump said X!?” ad nauseam.\nMr. Trump’s version of stray voltage has a number of effects beyond just causing chaos and distracting his opponents. When everything is an outrage, nothing is an outrage. And when everything is an outrage, you expose yourself as a purely partisan actor, turning off large swaths of the American public.\nTrump’s lack of fear of touching politically incorrect third rails that millions of Americans felt, but which had not been articulated so bluntly by a national politician, served him well. Incidentally, it also allowed him to shift the Overton Window on critical issues like immigration and Islamic supremacism.\nWhen attacked for taking these positions, unlike those to come before him, Trump did not avoid the fray. Rather, he jumped into it, counterpunching.\nLulled into a false sense of security by Republicans who fought with their hands tied behind their backs, constrained by suicidal rules of political engagement for decades, the Left did not know how to react when hit.\nLeftists could not believe that a political opponent had the gall to actually fight tooth and nail.\nTrump does not give an inch to his critics, and neither should any other Republican. He defines the rules of engagement, and so should all on the Right.\nWatching the confirmation hearings to date, we see many on the Left jabbing as if we are in a pre-Trump world. Their questions all hew to the same old narrative that if you are not a racist, sexist, or bigot, then you are an out-of-touch plutocrat or a shill for some special interest or other.\nLike Trump, Republicans should challenge these charges head on. They should take issue with the Left’s premises from the start, showing that it is the Left who is projecting when it tries to discredit those who believe in capitalism, the power of the individual, and the sanctity of the individual’s rights, the rule of law, national sovereignty, federalism, and the Judeo-Christian morality on which the country is based.\nWhen leftists attack an attorney general designate because he is a white male from the South, they should be attacked for judging based on color of skin (rather than content of character) and for trying to bruise an appointee who will not stand for open borders, selective law enforcement, and politicized justice.\nWhen leftists attack a secretary of education designate because her family is wealthy, they should be attacked for their anti-capitalism and hypocrisy, and their real desire to bloody an appointee because she believes that the Left’s own constituents — and indeed all Americans — should have the opportunity to send their kids to superior schools, rather than being doomed to a subpar education because it mollifies a teachers union.\nThese attacks are designed to put not only the appointees, but also all right-thinking people on the defensive — to fear reflexively a false premise because those premises have prevailed among the progressives who dominated media, academia, and government for decades.\nWe should no longer live in fear — for the Left thrives when we self-censor and accept its baseless premises.\nThey ought to take a page from Trump, but they won’t, because they STILL accept the baseless premises of the Left. Consider the cucking on display even in this exhortation to be bold and fearless and willing to fight:\nThe Judeo-Christian morality on which the country is based.\nThere is no “Judeo-Christian morality”. Nor is the country based on the nonexistent concept. The USA was founded by Christians on the basis of predominantly Protestant values. Judaism, which is considerably more than the Mosaic Law, had, and has, nothing to do with the American nation or the founding of the USA. These appeals to the teachings of Judeo Christ rather than Jesus Christ are the certain sign of the cuck.\nthey should be attacked for judging based on color of skin\n. Dems are the real racists! Cucks never learn, they only project their fear of being accused of racism on everyone else.\nthey should be attacked for their anti-capitalism and hypocrisy.\nCall them commies! And hypocrites! Because that has worked so well for the last 50 years, right?\nThe ironic thing is that Donald Trump NEVER utilizes these feeble forms of limp-wristed hand-waving. He goes after them where it hurts, in a direct and aggressive manner that inevitably make the cucks complain that he is rude and boorish and hurtful.\nForget conservatism. Conservatives don’t fight. Their failure to do so, their\ninevitable\nfailure to conserve anything, is why the Alt-Right exists in the first place.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-21T13:00:00+00:00"
}