{
  "url": "https://voxday.net/2017/01/26/collected-columns-forewords/",
  "scraped_at": "2025-12-18T06:58:30.030387",
  "title": "Collected Columns forewords",
  "date_display": "January 26, 2017",
  "date_iso": "2017-01-26T02:01:00+00:00",
  "date_from_url": "2017-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re one of those who expressed interest in writing one last week, please feel free to do so and submit it via email. I’ll need at least two, one for the 2001-2005 period, the other for the 2006-2008 period. I’ll select the best two and use them; I may post selections from the others here on the blog when it’s launch time. Keep it to around 1500 words, they aren’t Penguin Classics, after all.</p><p>Longtime readers who were actually reading the columns as they were published only, please. While it is customary to have other media figures write these things – and someone who shall remain nameless at present graciously penned a very thoughtful one for SJWADD – I thought that in this case, it would be more meaningful to provide the readers’ perspective on them. Thanks very much.<br> UPDATE: Speaking of the collected columns, if anyone would transcribe the John Julius Norwich, Karl Denninger, Ian Fletcher, and Steve Keen interviews from Voxiversity, I would appreciate that. If you’re doing one of them, mention it in the comments here so that no one else does it too. I’m going to put the collected interviews in one of the three volumes.</br></p></div>",
  "content_text": "If you’re one of those who expressed interest in writing one last week, please feel free to do so and submit it via email. I’ll need at least two, one for the 2001-2005 period, the other for the 2006-2008 period. I’ll select the best two and use them; I may post selections from the others here on the blog when it’s launch time. Keep it to around 1500 words, they aren’t Penguin Classics, after all.\nLongtime readers who were actually reading the columns as they were published only, please. While it is customary to have other media figures write these things – and someone who shall remain nameless at present graciously penned a very thoughtful one for SJWADD – I thought that in this case, it would be more meaningful to provide the readers’ perspective on them. Thanks very much.\nUPDATE: Speaking of the collected columns, if anyone would transcribe the John Julius Norwich, Karl Denninger, Ian Fletcher, and Steve Keen interviews from Voxiversity, I would appreciate that. If you’re doing one of them, mention it in the comments here so that no one else does it too. I’m going to put the collected interviews in one of the three volumes.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-26T02:01:00+00:00"
}