{
  "url": "https://voxday.net/2017/01/04/cuck-star-or-fighter/",
  "scraped_at": "2025-12-18T02:13:20.321920",
  "title": "Con star or fighter?",
  "date_display": "January 4, 2017",
  "date_iso": "2017-01-04T02:10:00+00:00",
  "date_from_url": "2017-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Todd Kincannon explains the difference on Gab:</p><blockquote><p> Todd Kincannon · @ToddKincannon<br> If you are ever wondering whether somebody is a real fighter or just a Conservative Media Star™ (or wannabe), ask me. Ann Coulter, fighter. A.J. Delgado, fighter. John Derbyshire, fighter. Everybody at Taki’s Magazine and @VDare, fighters. 99% of National Review, Conservative Media Stars™.</br></p><p>Todd Kincannon · @ToddKincannon<br> I’ve always thought military analogies in politics are lame, but here we go: I fought in the trenches to get Trump elected. The Trump people know who I am and what I did. All of them think Bill Mitchell is a useless clown who did nothing but run his mouth to people who were already voting Trump.</br></p><p>Todd Kincannon · @ToddKincannon<br> Tweeting “Rah Rah Sis Boom Bah” stuff all day does not tangibly help the cause. That’s all Bill Mitchell has ever done, and all he appears capable of doing, either due to a lack of brains, a lack of balls, or both. My money’s on both.</br></p><p>Todd Kincannon · @ToddKincannon<br> People who only preach to the converted are not useful allies in fighting the Left, especially when their entire goal is to become a Conservative Media Star™. That’s Bill Mitchell. People like that are useless and always have been. And there are a helluva lot of them.</br></p><p>Todd Kincannon · @ToddKincannon<br> Bill Mitchell, Erick Erickson, Jonah Goldberg, Kurt Schlichter, George Will, Charles Krauthammer, Glenn Beck, and many, many more, far too many to name. All each cares about is being a Conservative Media Star™. Not one of them actually cares if we accomplish anything in fighting the Left.</br></p><p>Todd Kincannon · @ToddKincannon<br> Seriously, the number one word associated with Bill Mitchell in real Trump operative circles is “clown.” The number two word associated with Bill Mitchell by actual Trump operatives is “who?”</br></p><p>Todd Kincannon · @ToddKincannon<br> There is a third category of people who are fighters but not for the things we believe in. Bill Kristol is an example. He’s a true fighter, but he fights for the globalists. I respect Bill Kristol, though I strongly disagree with him. I do not respect the Conservative Media Star™ crowd.</br></p></blockquote><p>I’m not part of the Trump People, nor am I an actual Trump operative, but I have to confess, when this Bill Mitchell stuff blew up on social media as the post-election drama du jour, my reaction was most definitely “who?”</p><p>Followed by: “I don’t care.” I still have no idea who he is. NB: This is not an invitation to inform me. I rest content in my ignorance of the matter.</p></div>",
  "content_text": "Todd Kincannon explains the difference on Gab:\nTodd Kincannon · @ToddKincannon\nIf you are ever wondering whether somebody is a real fighter or just a Conservative Media Star™ (or wannabe), ask me. Ann Coulter, fighter. A.J. Delgado, fighter. John Derbyshire, fighter. Everybody at Taki’s Magazine and @VDare, fighters. 99% of National Review, Conservative Media Stars™.\nTodd Kincannon · @ToddKincannon\nI’ve always thought military analogies in politics are lame, but here we go: I fought in the trenches to get Trump elected. The Trump people know who I am and what I did. All of them think Bill Mitchell is a useless clown who did nothing but run his mouth to people who were already voting Trump.\nTodd Kincannon · @ToddKincannon\nTweeting “Rah Rah Sis Boom Bah” stuff all day does not tangibly help the cause. That’s all Bill Mitchell has ever done, and all he appears capable of doing, either due to a lack of brains, a lack of balls, or both. My money’s on both.\nTodd Kincannon · @ToddKincannon\nPeople who only preach to the converted are not useful allies in fighting the Left, especially when their entire goal is to become a Conservative Media Star™. That’s Bill Mitchell. People like that are useless and always have been. And there are a helluva lot of them.\nTodd Kincannon · @ToddKincannon\nBill Mitchell, Erick Erickson, Jonah Goldberg, Kurt Schlichter, George Will, Charles Krauthammer, Glenn Beck, and many, many more, far too many to name. All each cares about is being a Conservative Media Star™. Not one of them actually cares if we accomplish anything in fighting the Left.\nTodd Kincannon · @ToddKincannon\nSeriously, the number one word associated with Bill Mitchell in real Trump operative circles is “clown.” The number two word associated with Bill Mitchell by actual Trump operatives is “who?”\nTodd Kincannon · @ToddKincannon\nThere is a third category of people who are fighters but not for the things we believe in. Bill Kristol is an example. He’s a true fighter, but he fights for the globalists. I respect Bill Kristol, though I strongly disagree with him. I do not respect the Conservative Media Star™ crowd.\nI’m not part of the Trump People, nor am I an actual Trump operative, but I have to confess, when this Bill Mitchell stuff blew up on social media as the post-election drama du jour, my reaction was most definitely “who?”\nFollowed by: “I don’t care.” I still have no idea who he is. NB: This is not an invitation to inform me. I rest content in my ignorance of the matter.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-04T02:10:00+00:00"
}