{
  "url": "https://voxday.net/2017/01/31/do-not-disobey-god-emperor/",
  "scraped_at": "2025-12-18T06:59:28.400318",
  "title": "Do not disobey the God-Emperor",
  "date_display": "January 31, 2017",
  "date_iso": "2017-01-31T13:00:00+00:00",
  "date_from_url": "2017-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"tr_bq\"> Did I not tell you to <a href=\"https://gab.ai/voxday/posts/4652848\">take the under</a>? Trump didn’t even wait 12 hours to fire his insubordinate Acting Attorney General. And his Immigration and Customs Enforcement Director Daniel Ragsdale two hours later. So, who wants to strike a pose next? Do you feel lucky, punks?</div><blockquote><p> Our Constitution vests all executive power — not some of it, all of it — in the president of the United States. Executive-branch officials do not have their own power. They are delegated by the president to execute his power. If they object to the president’s policies, their choice is clear: salute and enforce the president’s directives, or honorably resign. There is no third way. No one knows this better than high-ranking officials of the Department of Justice.</p><p>That is why President Trump was right to fire Acting Attorney General Sally Yates. Over the weekend, President Trump issued an executive order temporarily restricting the admission into the United States of aliens from various Muslim-majority countries, as well as aliens from Syria and elsewhere who are claiming refugee status. Naturally, this has triggered protests by Democrats and the Left. They erroneously claim that Trump’s executive order violates the Constitution, statutory law, American tradition, and human decency.</p><p>For inexplicable reasons, the new president left Yates in place to run the Justice Department in anticipation of the confirmation of Senator Jeff Sessions. A faithful Obama-appointed progressive, Yates obviously knew which way the political wind was blowing in her tribe. Like most Democrats, Yates objects to the president’s executive order. Fair enough. But she is not a political operative, she was a Justice Department official — the highest such official. If her opposition to the president’s policy was as deeply held as she says, her choice was clear: enforce the president’s policy or quit.</p><p>Instead, she chose insubordination: Knowing she would be out the moment Senator Sessions is confirmed, she announced on Monday night that the Justice Department would not enforce the president’s order. She did not issue this statement on the grounds that the order is illegal. She declined to take a definitive position on that question. She rested her decision, rather, on her disagreement with the justice of the order. Now, she’ll be a left-wing hero, influential beyond her heretofore status as a nameless bureaucrat.</p><p>To make an analogy, there are many federal judges who oppose abortion. They apply Roe v. Wade even though they disagree with it intensely, because their duty is to obey superior courts. As every official in the Justice Department knows, if one disagrees with the law one is called upon to apply, or the policy one is bound to enforce, one is free to resign. Staying on while undermining government policy is not an act of courage. It is an act of sabotage.</p></blockquote><p>It’s so typical of the Never-Trump cucks at <i>National Review</i> to try to portray the God-Emperor’s decisive action as some sort of failure when the truth is that the process served his narrative and demonstrated, to the entire nation, how faithless and corrupt his internal enemies are.</p><p>This is a good example of why the cucks and cons and mods are all so hapless. They are <i>driven </i>by their absolute fear of Left’s Narrative. Who gives a damn if Sally Yates is “a left-wing hero”? They even admit that she showed herself to be a faithless and unprofessional weasel. It will be easy to destroy her politically if she tries to use her grandstanding as a springboard to electoral office, but regardless, it is irrelevant to the Right whom the Left chooses as their champions. If not her, it will only be someone else, even if they have to manufacture one ex nihilo.</p><p>And, more importantly, her action justifies the God-Emperor launching an internal inquisition to root out any other Yates-types still embedded in the bureaucracy. What she has handed him, in fact, is his best excuse to go after the Deep State since getting elected. And, better yet, she has also shown the entire world what happens when you cross the God-Emperor. Which is important, because the God-Emperor is at war with the America-haters <a href=\"https://theintercept.com/2017/01/30/asylum-officials-and-state-department-in-turmoil-there-are-people-literally-crying-in-the-office-here/\">in the bureaucracy</a>.</p><blockquote><p> While President Donald Trump’s executive order on immigration has left families wondering when they will see their loved ones again, drawing condemnation from leaders around the globe, the administration’s actions have also impacted another group: career U.S. officials working on asylum and refugee cases as well as foreign policy.</p><p>“There are people literally crying in the office here,” said a senior U.S. immigration official who spoke to The Intercept on condition of anonymity.</p><p>Interviews and internal communications obtained by The Intercept reveal how American personnel tasked with aiding the planet’s most vulnerable populations and representing the country in the international arena are learning bit by bit, through emails and confounding directives, how the jobs they signed up for are being steadily eroded.</p><p>The immigration official said that staffers at one Department of Homeland Security office were devastated when they arrived at work Monday morning to find an email, circulated among DHS leadership over the weekend, informing department personnel that they would no longer be permitted to adjudicate any immigration claims from the seven countries targeted by Trump’s travel ban, including petitions for asylum, permanent residency, or naturalization….</p><p>It was a move many within the government had feared, the official said — a so-called “security hold” that would essentially paralyze the asylum and immigration process for those fleeing some of the world’s most volatile places. “Permission to work, adjust status to a citizen or a permanent resident, any immigration form they have will stay in limbo,” the official explained. “We know what is coming. These cases will all likely be denied after significant waits.”</p></blockquote><p>If the oppomedia is upset now, just wait until the more serious immigration bans are put in place and the repatriations begin. <i>Don’t hate, repatriate. </i><br> <i><br/></i><br> In other news, the oppomedia is learning that they can only push their anti-Trump agenda so far:</br></br></p><blockquote><p> Bart Hubbuch, formerly of the <i>New York Post</i>, tweeted that he was fired for tweeting “my personal belief that Donald Trump becoming President of the United States is a national tragedy.” In since-deleted tweets, Hubbuch compared the inauguration of Trump to 9/11 and Pearl Harbor. The <i>Post </i>confirmed to WEEI that the publication no longer has a “business relationship” with Hubbuch.</p></blockquote><p> UPDATE: In light of the Monday Night Massacre that has triggered all of the Baby Boomers who were there <strike>at Woodstock</strike> when Nixon fired Archibald Cox, and has caused all the self-important bureaucrats who thought they would play “Yes, President” with the God-Emperor to wet themselves, I’m going to hazard a guess that the rumored “dissent memo” will never be signed and released.</p><blockquote class=\"tr_bq\"><p> In recent days, drafts of a dissent memo have been circulating among diplomats and associates abroad expressing concern that the new restrictions — which Trump said would help “keep America safe” — are un-American and will actually paralyze efforts to stop terrorist attacks in the U.S. </p></blockquote><p>Please, please, PLEASE sign it and release it, brave diplomats and associates abroad. Doing so will save the God-Emperor’s inquisitors so much time and effort! The days of making policy decisions on the basis of threats from below are over.</p></div>",
  "content_text": "Did I not tell you to\ntake the under\n? Trump didn’t even wait 12 hours to fire his insubordinate Acting Attorney General. And his Immigration and Customs Enforcement Director Daniel Ragsdale two hours later. So, who wants to strike a pose next? Do you feel lucky, punks?\nOur Constitution vests all executive power — not some of it, all of it — in the president of the United States. Executive-branch officials do not have their own power. They are delegated by the president to execute his power. If they object to the president’s policies, their choice is clear: salute and enforce the president’s directives, or honorably resign. There is no third way. No one knows this better than high-ranking officials of the Department of Justice.\nThat is why President Trump was right to fire Acting Attorney General Sally Yates. Over the weekend, President Trump issued an executive order temporarily restricting the admission into the United States of aliens from various Muslim-majority countries, as well as aliens from Syria and elsewhere who are claiming refugee status. Naturally, this has triggered protests by Democrats and the Left. They erroneously claim that Trump’s executive order violates the Constitution, statutory law, American tradition, and human decency.\nFor inexplicable reasons, the new president left Yates in place to run the Justice Department in anticipation of the confirmation of Senator Jeff Sessions. A faithful Obama-appointed progressive, Yates obviously knew which way the political wind was blowing in her tribe. Like most Democrats, Yates objects to the president’s executive order. Fair enough. But she is not a political operative, she was a Justice Department official — the highest such official. If her opposition to the president’s policy was as deeply held as she says, her choice was clear: enforce the president’s policy or quit.\nInstead, she chose insubordination: Knowing she would be out the moment Senator Sessions is confirmed, she announced on Monday night that the Justice Department would not enforce the president’s order. She did not issue this statement on the grounds that the order is illegal. She declined to take a definitive position on that question. She rested her decision, rather, on her disagreement with the justice of the order. Now, she’ll be a left-wing hero, influential beyond her heretofore status as a nameless bureaucrat.\nTo make an analogy, there are many federal judges who oppose abortion. They apply Roe v. Wade even though they disagree with it intensely, because their duty is to obey superior courts. As every official in the Justice Department knows, if one disagrees with the law one is called upon to apply, or the policy one is bound to enforce, one is free to resign. Staying on while undermining government policy is not an act of courage. It is an act of sabotage.\nIt’s so typical of the Never-Trump cucks at\nNational Review\nto try to portray the God-Emperor’s decisive action as some sort of failure when the truth is that the process served his narrative and demonstrated, to the entire nation, how faithless and corrupt his internal enemies are.\nThis is a good example of why the cucks and cons and mods are all so hapless. They are\ndriven\nby their absolute fear of Left’s Narrative. Who gives a damn if Sally Yates is “a left-wing hero”? They even admit that she showed herself to be a faithless and unprofessional weasel. It will be easy to destroy her politically if she tries to use her grandstanding as a springboard to electoral office, but regardless, it is irrelevant to the Right whom the Left chooses as their champions. If not her, it will only be someone else, even if they have to manufacture one ex nihilo.\nAnd, more importantly, her action justifies the God-Emperor launching an internal inquisition to root out any other Yates-types still embedded in the bureaucracy. What she has handed him, in fact, is his best excuse to go after the Deep State since getting elected. And, better yet, she has also shown the entire world what happens when you cross the God-Emperor. Which is important, because the God-Emperor is at war with the America-haters\nin the bureaucracy\n.\nWhile President Donald Trump’s executive order on immigration has left families wondering when they will see their loved ones again, drawing condemnation from leaders around the globe, the administration’s actions have also impacted another group: career U.S. officials working on asylum and refugee cases as well as foreign policy.\n“There are people literally crying in the office here,” said a senior U.S. immigration official who spoke to The Intercept on condition of anonymity.\nInterviews and internal communications obtained by The Intercept reveal how American personnel tasked with aiding the planet’s most vulnerable populations and representing the country in the international arena are learning bit by bit, through emails and confounding directives, how the jobs they signed up for are being steadily eroded.\nThe immigration official said that staffers at one Department of Homeland Security office were devastated when they arrived at work Monday morning to find an email, circulated among DHS leadership over the weekend, informing department personnel that they would no longer be permitted to adjudicate any immigration claims from the seven countries targeted by Trump’s travel ban, including petitions for asylum, permanent residency, or naturalization….\nIt was a move many within the government had feared, the official said — a so-called “security hold” that would essentially paralyze the asylum and immigration process for those fleeing some of the world’s most volatile places. “Permission to work, adjust status to a citizen or a permanent resident, any immigration form they have will stay in limbo,” the official explained. “We know what is coming. These cases will all likely be denied after significant waits.”\nIf the oppomedia is upset now, just wait until the more serious immigration bans are put in place and the repatriations begin.\nDon’t hate, repatriate.\nIn other news, the oppomedia is learning that they can only push their anti-Trump agenda so far:\nBart Hubbuch, formerly of the\nNew York Post\n, tweeted that he was fired for tweeting “my personal belief that Donald Trump becoming President of the United States is a national tragedy.” In since-deleted tweets, Hubbuch compared the inauguration of Trump to 9/11 and Pearl Harbor. The\nPost\nconfirmed to WEEI that the publication no longer has a “business relationship” with Hubbuch.\nUPDATE: In light of the Monday Night Massacre that has triggered all of the Baby Boomers who were there\nat Woodstock\nwhen Nixon fired Archibald Cox, and has caused all the self-important bureaucrats who thought they would play “Yes, President” with the God-Emperor to wet themselves, I’m going to hazard a guess that the rumored “dissent memo” will never be signed and released.\nIn recent days, drafts of a dissent memo have been circulating among diplomats and associates abroad expressing concern that the new restrictions — which Trump said would help “keep America safe” — are un-American and will actually paralyze efforts to stop terrorist attacks in the U.S.\nPlease, please, PLEASE sign it and release it, brave diplomats and associates abroad. Doing so will save the God-Emperor’s inquisitors so much time and effort! The days of making policy decisions on the basis of threats from below are over.",
  "tags": [
    "law",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-31T13:00:00+00:00"
}