{
  "url": "https://voxday.net/2017/01/25/everyone-is-fair-game/",
  "scraped_at": "2025-12-18T06:58:22.440816",
  "title": "Everyone is fair game",
  "date_display": "January 25, 2017",
  "date_iso": "2017-01-25T11:55:00+00:00",
  "date_from_url": "2017-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An unusual liberal takes the time to think through <a href=\"http://www.mediaite.com/online/dont-attack-nazis-and-dont-praise-those-who-do/\">the consequences of identity-justified violence</a>:</p><blockquote><p> It was an eye-opening reaction. The reason I penned the tweet was because I thought the liberal consensus that serves as the bedrock of the American society was intact. I had this whole spiel planned about how if we as a society endorse violence against one Nazi, we’re responsible if it leads to worse violence, maybe even murder, where do you draw the line, blah blah blah. I thought it was more or less self-evident that you don’t murder people on the street for expressing views you don’t like. I thought we were all the same page, and I was wrong.</p><p>What was most depressing is that the pro-violence responses came almost uniformly from liberals. I suppose that isn’t that shocking: 51% of modern Democrats believe the government should ban hateful speech entirely. The more intelligent responses phrased it this way: Nazis are so violent, so dangerous, so outside the mainstream, they don’t deserve the usual protections afforded to political speech, including protection from violence. Still, it is sad to see so many liberal Americans abandoning one of the founding suppositions of liberalism at the dawn of an administration where it will be more necessary than ever before.</p><p>The hypocrisy is blinding. Nazis, you see, are fascist, jackbooted thugs who suppress others’ liberties and murder those they find despicable. To stop this threat, we must become fascist, jackbooted thugs who suppress others’ liberties and murder those we find despicable. The cure isn’t worse than the disease, it is the disease. (And yes, this all comes after Donald Trump was rightfully savaged by the same people for openly calling for violence against protesters)</p><p>Even if you buy the lesser notion that Nazis deserved to be punched in the face, who decides who the Nazis are? Spencer swears up and down that he’s not a Nazi. That’s obviously a questionable claim. But the number of people in American politics who are called Nazis or racists and protest that they aren’t is… well, everyone at this point.</p><p>Going by many people’s judgment, Donald Trump is a Nazi. Before he was a Nazi, Obama and Bush were the Nazis, Reagan was a Nazi, William F. Buckley was a crypto-fascist as I recall. Today, dozens of people have called me a Nazi.</p></blockquote><p>This is just the dawn of open identity-driven violence. Today, the hypocritical Left believes violence is justified so long as the target can be accused of being a Nazi, which includes everyone from Tomorrow, it will believe violence is justified so long as the target appears white.</p><p>And that’s when the responsive violence begins, and the Saxon begins to hate. This is why the rise of the Alt-Right is inevitable. Neither conservatives nor the Alt-Lite have any conceptual means of even beginning to deal with this <i>inevitable </i>situation. Their entire strategy, such as it is, relies upon hoping that what always happens in multiethnic states doesn’t happen here, because Melting Pot, Constitution, and Magic Dirt.</p><p>But the demographic and socionomic trends could not be more clear.</p><p>The irony is that despite their awareness of the intractability of the situation in the Middle East, and their own 200-year failure to successfully integrate Africans, most Americans, even those nominally on the Right, still believe it is possible to be invaded by 65 million+ foreigners without the state collapsing amidst violence. And the idea that magic interracial relationships are somehow going to make this transformation possible is <i>exceptionally </i>stupid. All the television shows and broadcast commercials notwithstanding, there is probably not much more interracial procreation taking place now than there was prior to the 20th century. Sounds hard to believe? Remember, depending upon the study, black Americans are between one-fifth and one-quarter European.</p><p>All of this means Round Two is almost certainly going to be more vicious than Round One. And only the Alt-Right has the conceptual model to predict and make sense of these events as they develop.</p></div>",
  "content_text": "An unusual liberal takes the time to think through\nthe consequences of identity-justified violence\n:\nIt was an eye-opening reaction. The reason I penned the tweet was because I thought the liberal consensus that serves as the bedrock of the American society was intact. I had this whole spiel planned about how if we as a society endorse violence against one Nazi, we’re responsible if it leads to worse violence, maybe even murder, where do you draw the line, blah blah blah. I thought it was more or less self-evident that you don’t murder people on the street for expressing views you don’t like. I thought we were all the same page, and I was wrong.\nWhat was most depressing is that the pro-violence responses came almost uniformly from liberals. I suppose that isn’t that shocking: 51% of modern Democrats believe the government should ban hateful speech entirely. The more intelligent responses phrased it this way: Nazis are so violent, so dangerous, so outside the mainstream, they don’t deserve the usual protections afforded to political speech, including protection from violence. Still, it is sad to see so many liberal Americans abandoning one of the founding suppositions of liberalism at the dawn of an administration where it will be more necessary than ever before.\nThe hypocrisy is blinding. Nazis, you see, are fascist, jackbooted thugs who suppress others’ liberties and murder those they find despicable. To stop this threat, we must become fascist, jackbooted thugs who suppress others’ liberties and murder those we find despicable. The cure isn’t worse than the disease, it is the disease. (And yes, this all comes after Donald Trump was rightfully savaged by the same people for openly calling for violence against protesters)\nEven if you buy the lesser notion that Nazis deserved to be punched in the face, who decides who the Nazis are? Spencer swears up and down that he’s not a Nazi. That’s obviously a questionable claim. But the number of people in American politics who are called Nazis or racists and protest that they aren’t is… well, everyone at this point.\nGoing by many people’s judgment, Donald Trump is a Nazi. Before he was a Nazi, Obama and Bush were the Nazis, Reagan was a Nazi, William F. Buckley was a crypto-fascist as I recall. Today, dozens of people have called me a Nazi.\nThis is just the dawn of open identity-driven violence. Today, the hypocritical Left believes violence is justified so long as the target can be accused of being a Nazi, which includes everyone from Tomorrow, it will believe violence is justified so long as the target appears white.\nAnd that’s when the responsive violence begins, and the Saxon begins to hate. This is why the rise of the Alt-Right is inevitable. Neither conservatives nor the Alt-Lite have any conceptual means of even beginning to deal with this\ninevitable\nsituation. Their entire strategy, such as it is, relies upon hoping that what always happens in multiethnic states doesn’t happen here, because Melting Pot, Constitution, and Magic Dirt.\nBut the demographic and socionomic trends could not be more clear.\nThe irony is that despite their awareness of the intractability of the situation in the Middle East, and their own 200-year failure to successfully integrate Africans, most Americans, even those nominally on the Right, still believe it is possible to be invaded by 65 million+ foreigners without the state collapsing amidst violence. And the idea that magic interracial relationships are somehow going to make this transformation possible is\nexceptionally\nstupid. All the television shows and broadcast commercials notwithstanding, there is probably not much more interracial procreation taking place now than there was prior to the 20th century. Sounds hard to believe? Remember, depending upon the study, black Americans are between one-fifth and one-quarter European.\nAll of this means Round Two is almost certainly going to be more vicious than Round One. And only the Alt-Right has the conceptual model to predict and make sense of these events as they develop.",
  "tags": [
    "#AltRight",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-25T11:55:00+00:00"
}