{
  "url": "https://voxday.net/2017/01/09/for-record/",
  "scraped_at": "2025-12-18T02:14:05.566144",
  "title": "Anklebiters",
  "date_display": "January 9, 2017",
  "date_iso": "2017-01-09T00:56:00+00:00",
  "date_from_url": "2017-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can always tell the gammas by their <i>constant </i>posturing. It’s not even remotely a surprise how they talk about people when they think no one will notice. Laguna Beach turns out to be every bit the phony many people here thought he was.</p><blockquote class=\"tr_bq\"><p> Laguna Beach Fogey<br> His supporters who call themselves The Dread Ilk are the biggest bunch of faggots on the Right today. Totally insufferable.</br></p></blockquote><p>He was already banned from here, but he’s now banned from Alpha Game as well. He won’t be missed. As John Scalzi learned, you can insult me and I’ll often let it slide, but I will never ignore a slight directed at the Dread Ilk.</p><p>And after reading the various comments on Hunter Wallace’s site, I won’t bother responding to him either. I don’t engage in discourse with people who accuse me of lying. What is the point? And as I’ve said before, I’d much rather stand with dependable allies such as Mike, Milo, Stefan, and Roosh than with the sort of people I’ve come across who are in the Alt-White.</p><p>I’m going to expand my policy on drama to the Alt-White in general. There is clearly no benefit to paying any attention to them whatsoever. Let them keep the shekels and the audience that they keep claiming I, and others, want to steal. I simply don’t have the time or the patience for this never-ending nonsense.</p></div>",
  "content_text": "You can always tell the gammas by their\nconstant\nposturing. It’s not even remotely a surprise how they talk about people when they think no one will notice. Laguna Beach turns out to be every bit the phony many people here thought he was.\nLaguna Beach Fogey\nHis supporters who call themselves The Dread Ilk are the biggest bunch of faggots on the Right today. Totally insufferable.\nHe was already banned from here, but he’s now banned from Alpha Game as well. He won’t be missed. As John Scalzi learned, you can insult me and I’ll often let it slide, but I will never ignore a slight directed at the Dread Ilk.\nAnd after reading the various comments on Hunter Wallace’s site, I won’t bother responding to him either. I don’t engage in discourse with people who accuse me of lying. What is the point? And as I’ve said before, I’d much rather stand with dependable allies such as Mike, Milo, Stefan, and Roosh than with the sort of people I’ve come across who are in the Alt-White.\nI’m going to expand my policy on drama to the Alt-White in general. There is clearly no benefit to paying any attention to them whatsoever. Let them keep the shekels and the audience that they keep claiming I, and others, want to steal. I simply don’t have the time or the patience for this never-ending nonsense.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-09T00:56:00+00:00"
}