{
  "url": "https://voxday.net/2017/01/04/how-big-is-your-brand/",
  "scraped_at": "2025-12-18T02:13:23.994785",
  "title": "How big is your brand?",
  "date_display": "January 4, 2017",
  "date_iso": "2017-01-04T13:09:00+00:00",
  "date_from_url": "2017-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Castalia author Mike Cernovich <a href=\"https://www.dangerandplay.com/mike-cernovichs-brand-is-dead/\">puts things in perspective</a>:</p><blockquote><p> You can monitor my brand in real-time on Amazon by watching my sales rank. You can do this for any author. Amazon ranks books based on how many copies have been sold over the past hour to 24 hours.</p><ul><li>Mike Cernovich, Gorilla Mindset – #9,431</li><li>Robert Cialdini, Pre-Suasion: A Revolutionary Way to Influence and Persuade Kindle Edition by  #5,476</li><li>Scott Adams, How to Fail at Almost Everything and Still Win Big: Kind of the Story of My Life – #6,548</li><li>Lena Dunham, Not That Kind of Girl: A Young Woman Tells You What She’s “Learned” – #23,209</li><li>MILO, Dangerous – #897</li><li>Donald Trump, The Art of the Deal – #1,646</li><li>Hillary Clinton, Stronger Together – #152,422</li><li>Mike Cernovich, MAGA Mindset – #47,065</li><li>Ben Shapiro, True Allegiance –  #40,936</li><li>Vox Day, SJWs Always Lie – #5,022</li><li>Mike Cernovich, Danger &amp; Play: Essays on Masculinity – #27,356</li></ul><p>For those keeping track at home. I’ve surpassed Ben Shapiro, who had a ten-year head start on me and also has many billionaire sugar daddies, and am on par with Vox, whose IQ is way higher than mine and who has been writing longer than I have. (He’s my editor, proof that I work with the best!)</p><p>My brand is bigger than a Hillary Clinton surrogate (Lena Dunham) who had her own TV show, and not as large as MILO, Trump, or Scott Adams.</p><p>MILO is a once-in-a-generation talent, so there’s no competing with him, ever. No one can.</p></blockquote><p>Amazon sales rank is much more relevant than the mainstream publishers, and the authors published by them, want to admit it is. Yes, it doesn’t capture all possible sales, but the fact is that it captures far more than is required for a statistically relevant sample.</p><p>And while it is only a snapshot in time, and cannot capture the conventional sales from major publishers made via the bookstores, it is a vastly more accurate, and comprehensive, picture than that provided by the newspaper bestseller lists, or, God forbid, the SJW-converged awards. As Spacebunny mentioned to me yesterday, <a href=\"https://infogalactic.com/info/Newbery_Medal\">the Newbery Medal</a> used to be an indicator of great books you should read, like <i>The Black Cauldron</i>, <i>A Wrinkle in Time</i> and<i> The Dark is Rising</i>. Now it is a reliable indicator of books you should avoid reading at all costs.</p><p>But the fact of the matter is that the Amazon rankings correctly indicate that bestselling authors such as Vaughn Heppner (#1,005), B.V. Larson (#884), and David VanDyke (#2,058) have bigger personal brands, and are much bigger influences on SF readers, than conventional authors such as John Scalzi (#8,062), Charles Stross (#9,127), and even China Mieville (#28,169), especially since the latter are heavily reliant upon their publisher’s brands, distribution, and marketing efforts. Sure, more people recognize the names of the latter trio, but far more people actually buy and read books published by the former. And that’s the aspect of brand that counts.</p><p>At Castalia, we’re intent on building up the personal brands of our authors, not churning through authors with one predatory two-book deal after another, sitting on the rights as long as possible, then begrudgingly purchasing the mercenary allegiance of those who sell the best. Whether an author sells 50,000 books or 25 books, if we like the quality they are producing, we’ll keep working with them. That’s why you almost always see the authors we’ve published bring us additional books. And also that’s why we’ve invited our authors to begin blogging at <a href=\"http://www.castaliahouse.com/posts/\">the Castalia House blog</a>, including Nick Cole, David the Good, Peter Grant, and Mr. John C. Wright, Esq.</p><p>Our goal this year is to make Castalia House the best, most intelligent, SF/F-related site on the Internet. I hope you’ll be a part of that.</p></div>",
  "content_text": "Castalia author Mike Cernovich\nputs things in perspective\n:\nYou can monitor my brand in real-time on Amazon by watching my sales rank. You can do this for any author. Amazon ranks books based on how many copies have been sold over the past hour to 24 hours.\nMike Cernovich, Gorilla Mindset – #9,431\nRobert Cialdini, Pre-Suasion: A Revolutionary Way to Influence and Persuade Kindle Edition by  #5,476\nScott Adams, How to Fail at Almost Everything and Still Win Big: Kind of the Story of My Life – #6,548\nLena Dunham, Not That Kind of Girl: A Young Woman Tells You What She’s “Learned” – #23,209\nMILO, Dangerous – #897\nDonald Trump, The Art of the Deal – #1,646\nHillary Clinton, Stronger Together – #152,422\nMike Cernovich, MAGA Mindset – #47,065\nBen Shapiro, True Allegiance –  #40,936\nVox Day, SJWs Always Lie – #5,022\nMike Cernovich, Danger & Play: Essays on Masculinity – #27,356\nFor those keeping track at home. I’ve surpassed Ben Shapiro, who had a ten-year head start on me and also has many billionaire sugar daddies, and am on par with Vox, whose IQ is way higher than mine and who has been writing longer than I have. (He’s my editor, proof that I work with the best!)\nMy brand is bigger than a Hillary Clinton surrogate (Lena Dunham) who had her own TV show, and not as large as MILO, Trump, or Scott Adams.\nMILO is a once-in-a-generation talent, so there’s no competing with him, ever. No one can.\nAmazon sales rank is much more relevant than the mainstream publishers, and the authors published by them, want to admit it is. Yes, it doesn’t capture all possible sales, but the fact is that it captures far more than is required for a statistically relevant sample.\nAnd while it is only a snapshot in time, and cannot capture the conventional sales from major publishers made via the bookstores, it is a vastly more accurate, and comprehensive, picture than that provided by the newspaper bestseller lists, or, God forbid, the SJW-converged awards. As Spacebunny mentioned to me yesterday,\nthe Newbery Medal\nused to be an indicator of great books you should read, like\nThe Black Cauldron\n,\nA Wrinkle in Time\nand\nThe Dark is Rising\n. Now it is a reliable indicator of books you should avoid reading at all costs.\nBut the fact of the matter is that the Amazon rankings correctly indicate that bestselling authors such as Vaughn Heppner (#1,005), B.V. Larson (#884), and David VanDyke (#2,058) have bigger personal brands, and are much bigger influences on SF readers, than conventional authors such as John Scalzi (#8,062), Charles Stross (#9,127), and even China Mieville (#28,169), especially since the latter are heavily reliant upon their publisher’s brands, distribution, and marketing efforts. Sure, more people recognize the names of the latter trio, but far more people actually buy and read books published by the former. And that’s the aspect of brand that counts.\nAt Castalia, we’re intent on building up the personal brands of our authors, not churning through authors with one predatory two-book deal after another, sitting on the rights as long as possible, then begrudgingly purchasing the mercenary allegiance of those who sell the best. Whether an author sells 50,000 books or 25 books, if we like the quality they are producing, we’ll keep working with them. That’s why you almost always see the authors we’ve published bring us additional books. And also that’s why we’ve invited our authors to begin blogging at\nthe Castalia House blog\n, including Nick Cole, David the Good, Peter Grant, and Mr. John C. Wright, Esq.\nOur goal this year is to make Castalia House the best, most intelligent, SF/F-related site on the Internet. I hope you’ll be a part of that.",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-04T13:09:00+00:00"
}