{
  "url": "https://voxday.net/2017/01/06/incoherencies-and-alt-rig/",
  "scraped_at": "2025-12-18T02:13:43.797146",
  "title": "Incoherencies and the Alt-Right",
  "date_display": "January 6, 2017",
  "date_iso": "2017-01-06T13:00:00+00:00",
  "date_from_url": "2017-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>The Alt-Right is both dangerous and pathetic.</b></p><p>That’s a neat trick. <a href=\"https://www.irishtimes.com/opinion/una-mullally-why-the-irish-times-should-not-have-published-nicholas-pell-1.2926726\">Una Mullally is amusingly incoherent</a> in her frothing-mad attempt to simultaneously dismiss the Alt-Right while warning of the dire danger it presents:</p><blockquote><p> What you actually need to know about the so-called “Alt-right movement” is that it is a cohort of pathetic but dangerous right-wingers trying – and often succeeding – in making their opinions more palatable to the mainstream over the past couple of years. The Irish Times was wrong to publish the article by Nicholas Pell. There are of course many ways to talk about the so-called “Alt-right” – a purposefully fluffy term for white supremacists, fascists, Nazis and others – but publishing a racist, misogynistic, trolling glossary is not one of them. I do not believe we should be interested in humouring fascism. I believe we should be invested in destroying it….</p><p>Meanwhile, the so called “Alt-right” – again, a rage-filled, whining, impossibly sensitive and overly-emotional cohort of white supremacists, racists, anti-women internet trolls, Nazis, conspiracy theorists, anti-Semites and more – is effectively trolling the media, contesting reality with fake news, writing off any kind of criticism as liberal whining, refusing to engage, harassing critics and adopting playground tactics to interviews so that when the words they say are presented back to them, they pretend never to have uttered them.</p><p>Having successfully mastered dog-whistle politics, the “Alt-right” has gained the confidence to drop euphemisms or insinuation and be outright bald in its beliefs. It thinks it has the upper hand, that its idiotic and circular debating techniques are smart, that it can say something and call “irony” or “humour” as a defence. But it is transparent and cringingly juvenile. And it is also dangerous.</p></blockquote><p><b>The Alt-Right is both White Nationalist and Neo-Nazi.</b></p><p>Because most people are not only idiots, but historically ignorant, they forget that National Socialism was, first and foremost, a pan-Germanic supremacist movement that violently looked down on every other white nation, including the Eastern and Southern Europeans. They also didn’t hesitate to make war on Western and Northern Europeans on the basis of their belief in Teutonic supremacy. Considering that the Swiss were described contemptuously as “a mongrel race” unworthy of the Greater German nation, what do you think the Nazis made of the even more mongrelized Americans? “White Nationalist Nazi” is a rhetorical left-wing conflation that doesn’t survive even rudimentary contemplation of the historical and conceptual realities.</p><p>Furthermore, as I’ve repeatedly pointed out, “white nationalism” is an American phenomenon that is the direct result of this American mongrelization, and pan-racial bonhomie notwithstanding, it is not compatible with the actual European nations either. As a consequence of their experience with the EU, most European nationalists want nothing to do with any globalist or pan-nationalist schemes. Ironically, this European/American distinction tends to upset both white and civic nationalist Americans, who are proud to be “part-Dutch” or “part-Irish” or “100 percent Swedish”, only to discover that Europeans don’t consider their distant American kin to be part of their various nations; after all, the Americans can’t even <i>speak the language</i>.</p><p>So, pan-white pan-nationalism is not, and will never be, viable anywhere outside of the United States, where a second white American identity is gradually being forged under the pressure of immigration and anti-white hatred. Meanwhile, Nazism, historical or neo, is not even a coherent concept once removed from its pan-Germanic context; one might as reasonably describe oneself as a Palestinian or a first-century Roman legionary as to claim on is a Nazi on the basis of being at war with global Jewry. Regardless, one cannot be both a white nationalist and a neo-Nazi, any more than one can be a libertarian and a neo-Communist or a red-tailed hawk and a fish.</p><p>The correct description of the Alt-Right is neither white nationalist nor pan-nationalist, but <i>omni-nationalist</i>. White nationalism is, obviously, an integral element of the Alt-Right, and it is supported by all white Alt-Rightists, but the Alt-Right also supports Hungarian nationalism, and Japanese nationalism, and even, in almost every case, Israeli nationalism. The Alt-Right does not want a pan-white nation to rule the world; it has learned from the failures of British, Spanish, French, Japanese, German, Soviet, and American imperialism.</p><p>NB: I ran the <a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">16 Points of the Alt-Right</a> by an academic expert on Fascism and National Socialism. His conclusion? While he did not agree with most of the 16 Points, he also observed that they contained <i>nothing </i>that could credibly described as neo-Nazi. <i>Nothing</i>. His words, not mine.<br> <b><br/></b><br> <b>The Alt-Right is Fascist</b></br></br></p><p>This is simply ridiculous. The Alt-Right is even less influenced by historical Italian Fascism than it is by historical German National Socialism. The Alt-Right is a political philosophy of the Right, it is not of the right side of the European Left. It certainly doesn’t believe in proportional political representation for women; indeed, it tends to be considerably more populist and genuinely democratic than the liberal democrats, let alone the Fascists.</p><p>One of the great ironies is that self-styled “antifas” would enthusiastically support the greater part of the actual Fascist program. When one considers their self-ignorance, it should be no surprise that they get the Alt-Right so hopelessly wrong.</p><p><b>The Alt-Right avoids debate</b></p><p>This is a flat-out lie and an inversion of the truth. The media is desperate to avoid any genuine discussion of what the Alt-Right actually believes, because they know its political philosophy is not only of great and growing appeal to many across the West, but is the only credible political philosophy in light of the obvious failures of communism, socialism, liberalism, multiculturalism, globalism, and representatism. That is why Mullally and others are so panicked by a simple partial glossary of Alt-Right terminology; it is the same reason that the New York Times <a href=\"http://www.milobookclub.com/2016/12/11/the-fake-news-on-alt-rig/\">failed to include a single answer</a> to the questions they asked me about the Alt-Right in the article it ran last month.</p><p>This is <a href=\"https://www.irishtimes.com/opinion/angela-nagle-what-the-alt-right-is-really-all-about-1.2926929\">a more intelligent take</a> on the Alt-Right, although Angela Nagle fails to grasp that the zero-sum tribal antagonism of identity groups is a necessary and inevitable consequence of the universalist ideas that have, by being put into practice, destroyed the national cohesion of the Western nations and presently threaten Western civilization.</p><blockquote><p> A new generation of liberal left-identitarians display chilling levels of pack pleasure when conducting career-ending, life-destroying hate campaigns against people for minor infringements against the liberal moral code such as off-colour jokes. Some examples were chronicled in Jon Ronson’s So You’ve Been Publicly Shamed. I think what has led so many young white men in the US in particular to openly flirt with the Alt-right online is a sense that one may as well be hung for a sheep as a lamb. Why grovel when you can join an anonymous army of trolls to fight back with pure offensiveness. This is what the Alt-right offers.</p><p>But like the US socialist writer Shuja Haider recently argued: “It should go without saying that left-liberal identity politics and Alt-right white nationalism are not comparable. The problem is that they are compatible.” Tumblr needs 4chan just as neo-masculinist misogynists need a perpetual supply of listicles about man-splaining, and the Alt-right needs finger wagging “Dear white people” liberal commentary to denigrate ordinary white people at every opportunity. None of them would make sense without the other. While Spencer’s plans are unlikely to catch on any time soon, the emergence of the Alt-right should warn us of a now imminent nightmare vision of what the coming years might hold – a public arena emptied of any civility, universalist ideas or openly competing political visions beyond a zero-sum tribal antagonism of identity groups, in which the boundaries of acceptable thought will shrink further while the purged will amass in the fetid forums of the Alt-right.</p></blockquote><p>The fact is that it doesn’t really matter what people say about the Alt-Right, what it is called, who is hailed as its leader du jour, or whether the media is honest about it. The great waves of history are in motion, and there is very little we can do besides observe them and describe their effects.</p></div>",
  "content_text": "The Alt-Right is both dangerous and pathetic.\nThat’s a neat trick.\nUna Mullally is amusingly incoherent\nin her frothing-mad attempt to simultaneously dismiss the Alt-Right while warning of the dire danger it presents:\nWhat you actually need to know about the so-called “Alt-right movement” is that it is a cohort of pathetic but dangerous right-wingers trying – and often succeeding – in making their opinions more palatable to the mainstream over the past couple of years. The Irish Times was wrong to publish the article by Nicholas Pell. There are of course many ways to talk about the so-called “Alt-right” – a purposefully fluffy term for white supremacists, fascists, Nazis and others – but publishing a racist, misogynistic, trolling glossary is not one of them. I do not believe we should be interested in humouring fascism. I believe we should be invested in destroying it….\nMeanwhile, the so called “Alt-right” – again, a rage-filled, whining, impossibly sensitive and overly-emotional cohort of white supremacists, racists, anti-women internet trolls, Nazis, conspiracy theorists, anti-Semites and more – is effectively trolling the media, contesting reality with fake news, writing off any kind of criticism as liberal whining, refusing to engage, harassing critics and adopting playground tactics to interviews so that when the words they say are presented back to them, they pretend never to have uttered them.\nHaving successfully mastered dog-whistle politics, the “Alt-right” has gained the confidence to drop euphemisms or insinuation and be outright bald in its beliefs. It thinks it has the upper hand, that its idiotic and circular debating techniques are smart, that it can say something and call “irony” or “humour” as a defence. But it is transparent and cringingly juvenile. And it is also dangerous.\nThe Alt-Right is both White Nationalist and Neo-Nazi.\nBecause most people are not only idiots, but historically ignorant, they forget that National Socialism was, first and foremost, a pan-Germanic supremacist movement that violently looked down on every other white nation, including the Eastern and Southern Europeans. They also didn’t hesitate to make war on Western and Northern Europeans on the basis of their belief in Teutonic supremacy. Considering that the Swiss were described contemptuously as “a mongrel race” unworthy of the Greater German nation, what do you think the Nazis made of the even more mongrelized Americans? “White Nationalist Nazi” is a rhetorical left-wing conflation that doesn’t survive even rudimentary contemplation of the historical and conceptual realities.\nFurthermore, as I’ve repeatedly pointed out, “white nationalism” is an American phenomenon that is the direct result of this American mongrelization, and pan-racial bonhomie notwithstanding, it is not compatible with the actual European nations either. As a consequence of their experience with the EU, most European nationalists want nothing to do with any globalist or pan-nationalist schemes. Ironically, this European/American distinction tends to upset both white and civic nationalist Americans, who are proud to be “part-Dutch” or “part-Irish” or “100 percent Swedish”, only to discover that Europeans don’t consider their distant American kin to be part of their various nations; after all, the Americans can’t even\nspeak the language\n.\nSo, pan-white pan-nationalism is not, and will never be, viable anywhere outside of the United States, where a second white American identity is gradually being forged under the pressure of immigration and anti-white hatred. Meanwhile, Nazism, historical or neo, is not even a coherent concept once removed from its pan-Germanic context; one might as reasonably describe oneself as a Palestinian or a first-century Roman legionary as to claim on is a Nazi on the basis of being at war with global Jewry. Regardless, one cannot be both a white nationalist and a neo-Nazi, any more than one can be a libertarian and a neo-Communist or a red-tailed hawk and a fish.\nThe correct description of the Alt-Right is neither white nationalist nor pan-nationalist, but\nomni-nationalist\n. White nationalism is, obviously, an integral element of the Alt-Right, and it is supported by all white Alt-Rightists, but the Alt-Right also supports Hungarian nationalism, and Japanese nationalism, and even, in almost every case, Israeli nationalism. The Alt-Right does not want a pan-white nation to rule the world; it has learned from the failures of British, Spanish, French, Japanese, German, Soviet, and American imperialism.\nNB: I ran the\n16 Points of the Alt-Right\nby an academic expert on Fascism and National Socialism. His conclusion? While he did not agree with most of the 16 Points, he also observed that they contained\nnothing\nthat could credibly described as neo-Nazi.\nNothing\n. His words, not mine.\nThe Alt-Right is Fascist\nThis is simply ridiculous. The Alt-Right is even less influenced by historical Italian Fascism than it is by historical German National Socialism. The Alt-Right is a political philosophy of the Right, it is not of the right side of the European Left. It certainly doesn’t believe in proportional political representation for women; indeed, it tends to be considerably more populist and genuinely democratic than the liberal democrats, let alone the Fascists.\nOne of the great ironies is that self-styled “antifas” would enthusiastically support the greater part of the actual Fascist program. When one considers their self-ignorance, it should be no surprise that they get the Alt-Right so hopelessly wrong.\nThe Alt-Right avoids debate\nThis is a flat-out lie and an inversion of the truth. The media is desperate to avoid any genuine discussion of what the Alt-Right actually believes, because they know its political philosophy is not only of great and growing appeal to many across the West, but is the only credible political philosophy in light of the obvious failures of communism, socialism, liberalism, multiculturalism, globalism, and representatism. That is why Mullally and others are so panicked by a simple partial glossary of Alt-Right terminology; it is the same reason that the New York Times\nfailed to include a single answer\nto the questions they asked me about the Alt-Right in the article it ran last month.\nThis is\na more intelligent take\non the Alt-Right, although Angela Nagle fails to grasp that the zero-sum tribal antagonism of identity groups is a necessary and inevitable consequence of the universalist ideas that have, by being put into practice, destroyed the national cohesion of the Western nations and presently threaten Western civilization.\nA new generation of liberal left-identitarians display chilling levels of pack pleasure when conducting career-ending, life-destroying hate campaigns against people for minor infringements against the liberal moral code such as off-colour jokes. Some examples were chronicled in Jon Ronson’s So You’ve Been Publicly Shamed. I think what has led so many young white men in the US in particular to openly flirt with the Alt-right online is a sense that one may as well be hung for a sheep as a lamb. Why grovel when you can join an anonymous army of trolls to fight back with pure offensiveness. This is what the Alt-right offers.\nBut like the US socialist writer Shuja Haider recently argued: “It should go without saying that left-liberal identity politics and Alt-right white nationalism are not comparable. The problem is that they are compatible.” Tumblr needs 4chan just as neo-masculinist misogynists need a perpetual supply of listicles about man-splaining, and the Alt-right needs finger wagging “Dear white people” liberal commentary to denigrate ordinary white people at every opportunity. None of them would make sense without the other. While Spencer’s plans are unlikely to catch on any time soon, the emergence of the Alt-right should warn us of a now imminent nightmare vision of what the coming years might hold – a public arena emptied of any civility, universalist ideas or openly competing political visions beyond a zero-sum tribal antagonism of identity groups, in which the boundaries of acceptable thought will shrink further while the purged will amass in the fetid forums of the Alt-right.\nThe fact is that it doesn’t really matter what people say about the Alt-Right, what it is called, who is hailed as its leader du jour, or whether the media is honest about it. The great waves of history are in motion, and there is very little we can do besides observe them and describe their effects.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-06T13:00:00+00:00"
}