{
  "url": "https://voxday.net/2017/01/28/islam-and-immigration-historians-view/",
  "scraped_at": "2025-12-18T06:58:55.927299",
  "title": "Islam and immigration: a historian’s view",
  "date_display": "January 28, 2017",
  "date_iso": "2017-01-28T12:12:00+00:00",
  "date_from_url": "2017-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in 2011, during my abortive experiment with doing a podcast, I had the privilege to interview my favorite historian, John Julius Norwich, whose Byzantine trilogy has pride of place on my bookshelves between the final volume of the 1911 <i>Encyclopedia Britannica</i> and the <i>Summa Theologica</i>. In preparation for the publication of the three volumes of my collected columns, we discovered that there was room to include the complete version of selected interviews at the end of Volume III, which will cover from 2010-2012.</p><p>Thanks to Were-Puppy, who has manfully taken on the task of transcribing them. Here is a section of my interview with Lord Norwich concerning a subject that is more than a little<i> </i>relevant today.</p><blockquote><p> <b>After a long period of relative peace, Islam appears to have entered another expansionary phase.  Is this something the West is better equipped to handle, now that it has become increasingly secular?</b></p><p>I don’t think it’s at all better equipped to handle it. No, I think it may be worse equipped. I find what I see going on around me in this respect very, very worrying indeed.  I had thought, until ten years ago, perhaps until 9/11, that the years of religious wars were virtually now, at long long last, over. The last place they continued, really, was in Ireland where there was still this violent Protestant-Catholic division. And killings were still going on on quite an important scale.  But when that was settled, well, it hasn’t actually been completely settled now, as we know, it still goes on. But we thought it had been settled then. And I thought good, now we really don’t need to worry about religious wars anymore. We are all okay, we know where we stand. That’s fine.</p><p>And then suddenly there comes this tremendous axe swing of Muslim fundamentalism, and 9/11, and all that, and suddenly we’re back to the beginning.  I go quite often to the Middle East, and to parts of the Muslim world, particularly to Turkey. Turkey was a completely secular state, as you know, after the First World War.  And it was as much as your career was worth to be seen going into a mosque. But now the prime minister goes to the mosque every Friday. Everyone is wearing head scarves and a lot of young women at the university are earing even more, wearing those awful pale pastel-colored overcoats to the ankle. That has always been a particularly ugly Muslim fashion, I think.</p><p>There was so many of these girls I saw, about seven or eight years ago, wandering around in those clothes. But there were also quite a few who weren’t, which meant those who were were doing it because they wanted to, not because someone told them, or forced them to do so. They were doing it voluntarily, because they felt happier that way. That worries me. It leads ultimately to excess. And we now have that ridiculous situation where you see Muslim women now, far more than ever in my lifetime, wearing vast black tents covering everything except the slits for the eyes.</p><p>A lot of these women are trying to apply to become school teachers in England. It seems to me there is no way you can teach without showing your face.  You know, you can’t just have a voice emerging from a black tent. You need a person, you need a personality, you need a character you can identify with. I’m very worried by this trend, because it’s getting worse.  In London, every single year, there are more of these black-tented ladies around, you know.</p><p><b>Looking at it from the historical perspective, not the political perspective, but the historical perspective, there are about 500,000 immigrants arriving every year in Great Britain. What is the outcome that this sort of mass migration is likely to have? </b><br> <b><br/></b><br> It really depends, I think, on the proportion that decides to integrate. Who decides to say, okay we’re in England now, we’ll lead an ordinary English life, we won’t wear black tents or veils or anything, we’ll put ourselves through school and university. And that’s fine. Those people will obviously get absorbed.  But for every one of those, I don’t know how many there are of the other side, who do not want to be absorbed, who want to go on carrying on with their Muslim ways of life. And this will lead to a greater and greater gulf in the population of the country.</br></br></p><p><b>From a historical perspective, does the culture usually tend to change the immigrants, or do the immigrants tend to change the culture?</b></p><p>I think it works both ways. There are a lot of cases where the immigrants have actually changed the culture, when there has been an enormous immigration. It depends on the size of the immigration. If it’s quite a small immigration, then I think on the whole, it doesn’t really affect the culture very much. But with a really huge one, of course, it can really swamp it.  And that’s what I’m hoping is not going to happen in this country. But I’m very much afraid it is.</p></blockquote><p> I can’t help but wonder what Lord Norwich must make of London’s Muslim mayor….</p></div>",
  "content_text": "Back in 2011, during my abortive experiment with doing a podcast, I had the privilege to interview my favorite historian, John Julius Norwich, whose Byzantine trilogy has pride of place on my bookshelves between the final volume of the 1911\nEncyclopedia Britannica\nand the\nSumma Theologica\n. In preparation for the publication of the three volumes of my collected columns, we discovered that there was room to include the complete version of selected interviews at the end of Volume III, which will cover from 2010-2012.\nThanks to Were-Puppy, who has manfully taken on the task of transcribing them. Here is a section of my interview with Lord Norwich concerning a subject that is more than a little\nrelevant today.\nAfter a long period of relative peace, Islam appears to have entered another expansionary phase.  Is this something the West is better equipped to handle, now that it has become increasingly secular?\nI don’t think it’s at all better equipped to handle it. No, I think it may be worse equipped. I find what I see going on around me in this respect very, very worrying indeed.  I had thought, until ten years ago, perhaps until 9/11, that the years of religious wars were virtually now, at long long last, over. The last place they continued, really, was in Ireland where there was still this violent Protestant-Catholic division. And killings were still going on on quite an important scale.  But when that was settled, well, it hasn’t actually been completely settled now, as we know, it still goes on. But we thought it had been settled then. And I thought good, now we really don’t need to worry about religious wars anymore. We are all okay, we know where we stand. That’s fine.\nAnd then suddenly there comes this tremendous axe swing of Muslim fundamentalism, and 9/11, and all that, and suddenly we’re back to the beginning.  I go quite often to the Middle East, and to parts of the Muslim world, particularly to Turkey. Turkey was a completely secular state, as you know, after the First World War.  And it was as much as your career was worth to be seen going into a mosque. But now the prime minister goes to the mosque every Friday. Everyone is wearing head scarves and a lot of young women at the university are earing even more, wearing those awful pale pastel-colored overcoats to the ankle. That has always been a particularly ugly Muslim fashion, I think.\nThere was so many of these girls I saw, about seven or eight years ago, wandering around in those clothes. But there were also quite a few who weren’t, which meant those who were were doing it because they wanted to, not because someone told them, or forced them to do so. They were doing it voluntarily, because they felt happier that way. That worries me. It leads ultimately to excess. And we now have that ridiculous situation where you see Muslim women now, far more than ever in my lifetime, wearing vast black tents covering everything except the slits for the eyes.\nA lot of these women are trying to apply to become school teachers in England. It seems to me there is no way you can teach without showing your face.  You know, you can’t just have a voice emerging from a black tent. You need a person, you need a personality, you need a character you can identify with. I’m very worried by this trend, because it’s getting worse.  In London, every single year, there are more of these black-tented ladies around, you know.\nLooking at it from the historical perspective, not the political perspective, but the historical perspective, there are about 500,000 immigrants arriving every year in Great Britain. What is the outcome that this sort of mass migration is likely to have?\nIt really depends, I think, on the proportion that decides to integrate. Who decides to say, okay we’re in England now, we’ll lead an ordinary English life, we won’t wear black tents or veils or anything, we’ll put ourselves through school and university. And that’s fine. Those people will obviously get absorbed.  But for every one of those, I don’t know how many there are of the other side, who do not want to be absorbed, who want to go on carrying on with their Muslim ways of life. And this will lead to a greater and greater gulf in the population of the country.\nFrom a historical perspective, does the culture usually tend to change the immigrants, or do the immigrants tend to change the culture?\nI think it works both ways. There are a lot of cases where the immigrants have actually changed the culture, when there has been an enormous immigration. It depends on the size of the immigration. If it’s quite a small immigration, then I think on the whole, it doesn’t really affect the culture very much. But with a really huge one, of course, it can really swamp it.  And that’s what I’m hoping is not going to happen in this country. But I’m very much afraid it is.\nI can’t help but wonder what Lord Norwich must make of London’s Muslim mayor….",
  "tags": [
    "history",
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-28T12:12:00+00:00"
}