{
  "url": "https://voxday.net/2017/01/28/jews-are-enemy-of-old-europe/",
  "scraped_at": "2025-12-18T06:58:57.753816",
  "title": "Jews are the enemy of “Old Europe”",
  "date_display": "January 28, 2017",
  "date_iso": "2017-01-28T15:00:00+00:00",
  "date_from_url": "2017-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/vsJYGoRHA-U\" width=\"512\"></iframe></div><p> “We see ourselves together, fighting together, with our Muslim brothers,” said the rabbi. “They are our natural allies.”</p><p>That simply could not be more clear. Benjamin Netanyahu, the Prime Minister of Israel, is absolutely correct. Europe’s Jews belong in Israel, not in Europe. They certainly deserve absolutely no protection from “their Muslim brothers” with whom they are “fighting alongside”, or from anyone else, for that matter. They are, <i>by their own declaration</i>, the enemy of Old Europe. They hope to establish “a New Europe” with their “Muslim brothers”.</p><p>There is no “Jewish question” here because there is nothing to question. To paraphrase Moshe Feiglin, if someone declares himself to be your enemy, one should do him the courtesy of taking him seriously.</p><p>I’m pro-Israel, and pro-Israeli nationalism, and I rather like Zehut’s focus on identity in Israeli politics, but I am first and foremost on the side of Old Europe, America, and Western Civilization. If that makes me an enemy, so be it. Whether you are Jewish, or Israeli, or just a conservative subscriber to the mythical Judeo-Christian values, how can you <i>possibly </i>align yourself with these people and still consider yourself to be on the side of America, Christianity, or the West?</p><p>Whose side are you on? The Alt-Right knows. We stand for the survival of Christendom, the European nations, and the West.</p></div>",
  "content_text": "“We see ourselves together, fighting together, with our Muslim brothers,” said the rabbi. “They are our natural allies.”\nThat simply could not be more clear. Benjamin Netanyahu, the Prime Minister of Israel, is absolutely correct. Europe’s Jews belong in Israel, not in Europe. They certainly deserve absolutely no protection from “their Muslim brothers” with whom they are “fighting alongside”, or from anyone else, for that matter. They are,\nby their own declaration\n, the enemy of Old Europe. They hope to establish “a New Europe” with their “Muslim brothers”.\nThere is no “Jewish question” here because there is nothing to question. To paraphrase Moshe Feiglin, if someone declares himself to be your enemy, one should do him the courtesy of taking him seriously.\nI’m pro-Israel, and pro-Israeli nationalism, and I rather like Zehut’s focus on identity in Israeli politics, but I am first and foremost on the side of Old Europe, America, and Western Civilization. If that makes me an enemy, so be it. Whether you are Jewish, or Israeli, or just a conservative subscriber to the mythical Judeo-Christian values, how can you\npossibly\nalign yourself with these people and still consider yourself to be on the side of America, Christianity, or the West?\nWhose side are you on? The Alt-Right knows. We stand for the survival of Christendom, the European nations, and the West.",
  "tags": [
    "#AltRight",
    "EU",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-28T15:00:00+00:00"
}