{
  "url": "https://voxday.net/2017/01/23/mailvox-women-and-sjws/",
  "scraped_at": "2025-12-18T06:58:02.991387",
  "title": "Mailvox: women and SJWs",
  "date_display": "January 23, 2017",
  "date_iso": "2017-01-23T10:17:00+00:00",
  "date_from_url": "2017-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ER seeks advice on how to go about fighting female SJWs:</p><blockquote><p> I just listened to your periscope today and had several epiphanies so thank you, I couldn’t be more thrilled you’re hoping to do more of them.</p><p>My conundrum is this, I can grasp and admire the gamer gate/Trump tactics and appreciate the explanations about rhetoric and dialectic (your blog inspired me to read Aristotle, Cernovich and Scott Adams). But most of what I see working for all of you guys doesn’t translate well into the more passive-aggressive ways of my social circles which are predominantly female.  It caught my attention when you said more people would witness the victories of Trump and Milo and see a way out…to follow their model of winning so we can stop losing. But even if I tried what you do with Scalzi…well maybe I’m just a wimp, but I can’t do it.  It’s too aggressive for me pull off.</p><p>I’ve tried to watch what other “red pill” women do on twitter and facebook, but the Anne Coulter model seems to work best for the strong, no-holds-barred ENTJ type of woman. As much as I respect or admire them, it doesn’t seem to work for the more average woman.</p><p>I would just stay quietly in the background except that I see SJWism taking over even my conservative christian and homeschooling circles.  Those of us moms who voted Trump or who could be described as AltWest try feebly to defend ourselves but we don’t do it well.</p><p>Any thoughts or tips on how women can engage in effective rhetoric? It seems we’ve found ourselves in this battle whether we want to be here or not.</p></blockquote><p>If you can’t utilize the heavy artillery, then all that remains is to use the weapons that you are willing and able to use. Take the passive-aggressive tactics of your SJW enemies as a model and use them to pursue your own objectives. Engage in your own whisper campaigns. Exclude those whom you know to be on the other side. Behave like Mean Girls and Heathers to bully and badger the other women into complying to your will. Tear them down psychologically with little passive-aggressive comments and damn them with faint praise and back-handed compliments.</p><p>Anyone who is attacked has three choices: fight, submit, or run away. Now, no advice is going to help those who are simply going to submit or run away. The key is to understand that once you’re under assault, minding your own business ceases to be an option for you. <i>Being left alone and going along to get along is no longer an option.</i> You must accept that. Now, I’ve yet to see a woman who is totally incapable of getting nasty and passive-aggressive when sufficiently motivated, so I recommend that ER and other women in her position simply unleash their inner bitches and start fighting back using the natural weapons that God gave them.</p><p>If you don’t think you can do it, ask your husband. He might be able to refresh your memory and remind you of certain tactics that are clearly at your disposal.</p><p>Remember, these SJW women are attacking you, your organizations, your families, your children, and your way of life. They are attempting to destroy the things you value and love. If you were capable of tearing down girls in 8th grade because they were prettier than you were, or because Billy the quarterback liked Sherry the cheerleader better than you, you are certainly capable of fighting back in this situation too.</p><p>You don’t have to fight like me, or Milo, or Donald Trump. You probably can’t. And that’s fine, the important thing is to make up your mind to stand your ground and fight with what you have. The fact that you don’t have a mechsuit armed with nuclear missiles doesn’t mean you can’t smile nicely at an SJW and greet her with flowery words before driving a wooden stake into her heart.</p></div>",
  "content_text": "ER seeks advice on how to go about fighting female SJWs:\nI just listened to your periscope today and had several epiphanies so thank you, I couldn’t be more thrilled you’re hoping to do more of them.\nMy conundrum is this, I can grasp and admire the gamer gate/Trump tactics and appreciate the explanations about rhetoric and dialectic (your blog inspired me to read Aristotle, Cernovich and Scott Adams). But most of what I see working for all of you guys doesn’t translate well into the more passive-aggressive ways of my social circles which are predominantly female.  It caught my attention when you said more people would witness the victories of Trump and Milo and see a way out…to follow their model of winning so we can stop losing. But even if I tried what you do with Scalzi…well maybe I’m just a wimp, but I can’t do it.  It’s too aggressive for me pull off.\nI’ve tried to watch what other “red pill” women do on twitter and facebook, but the Anne Coulter model seems to work best for the strong, no-holds-barred ENTJ type of woman. As much as I respect or admire them, it doesn’t seem to work for the more average woman.\nI would just stay quietly in the background except that I see SJWism taking over even my conservative christian and homeschooling circles.  Those of us moms who voted Trump or who could be described as AltWest try feebly to defend ourselves but we don’t do it well.\nAny thoughts or tips on how women can engage in effective rhetoric? It seems we’ve found ourselves in this battle whether we want to be here or not.\nIf you can’t utilize the heavy artillery, then all that remains is to use the weapons that you are willing and able to use. Take the passive-aggressive tactics of your SJW enemies as a model and use them to pursue your own objectives. Engage in your own whisper campaigns. Exclude those whom you know to be on the other side. Behave like Mean Girls and Heathers to bully and badger the other women into complying to your will. Tear them down psychologically with little passive-aggressive comments and damn them with faint praise and back-handed compliments.\nAnyone who is attacked has three choices: fight, submit, or run away. Now, no advice is going to help those who are simply going to submit or run away. The key is to understand that once you’re under assault, minding your own business ceases to be an option for you.\nBeing left alone and going along to get along is no longer an option.\nYou must accept that. Now, I’ve yet to see a woman who is totally incapable of getting nasty and passive-aggressive when sufficiently motivated, so I recommend that ER and other women in her position simply unleash their inner bitches and start fighting back using the natural weapons that God gave them.\nIf you don’t think you can do it, ask your husband. He might be able to refresh your memory and remind you of certain tactics that are clearly at your disposal.\nRemember, these SJW women are attacking you, your organizations, your families, your children, and your way of life. They are attempting to destroy the things you value and love. If you were capable of tearing down girls in 8th grade because they were prettier than you were, or because Billy the quarterback liked Sherry the cheerleader better than you, you are certainly capable of fighting back in this situation too.\nYou don’t have to fight like me, or Milo, or Donald Trump. You probably can’t. And that’s fine, the important thing is to make up your mind to stand your ground and fight with what you have. The fact that you don’t have a mechsuit armed with nuclear missiles doesn’t mean you can’t smile nicely at an SJW and greet her with flowery words before driving a wooden stake into her heart.",
  "tags": [
    "#AltWest",
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-23T10:17:00+00:00"
}