{
  "url": "https://voxday.net/2017/01/13/mailvox-siding-with-obama/",
  "scraped_at": "2025-12-18T02:14:47.309607",
  "title": "Mailvox: siding with Obama",
  "date_display": "January 13, 2017",
  "date_iso": "2017-01-13T16:00:00+00:00",
  "date_from_url": "2017-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Does John C. Wright really believe that everyone who sets foot on U.S. soil should automatically be granted U.S. citizenship? Or only those who are citizens of countries he describes as a “slave state”?</p><blockquote><p> I recall the days when you referred to yourself as a libertarian, Vox. Now your obsession has reached a point where, given a choice between siding with Castro’s slave state or rethinking your position on racial matters, you side with Castro. Given a choice between siding with Obama, who fundamentally hates every thing you love and who desecrates everything you hold sacred, and rethinking your position on race, you side with Obama.</p><p>On a personal note, the Left stopped seeming like humans to me and started seeming like remorseless enemy monsters in human form was when I heard them applauding the midnight military style raid on the house of Elian Gonzales, and cheering the news that the child would be returned to the island sized concentration camp. They hate liberty that much, the Left. They hate humanity, hate life, hate reason,truth and beauty.</p><p>Yet each of them was born as an innocent wee babe,cute and cuddly and poopy as were we all.</p><p>What changed them? What turns men into monsters?</p><p>I suggest that it is the lure of simple, elegant, powerful ideas which become like idols to them. The idol demands a small sacrifice at first, then more, then more.</p><p>I have always wondered why the first time one of them found his powerful idea and his cause was leading him into siding with what he himself despised and knew to be wrong, no friend warned him.</p></blockquote><p>First, even when I described myself as a libertarian, I was always careful to reject the capital-L. And even though I voted Libertarian, I did not join the party. Why? Because I rejected both abortion rights and open borders, two strongly held Libertarian positions.</p><p>After reading Ian Fletcher’s book, then going through the actual free trade arguments of both the classical and Austrian economists and realizing how outmoded and riddled with flaws they were, I began to understand that libertarianism was every bit as utopian, and every bit as impossible, as communism. It’s not an accident that adherents of both ideologies rely heavily upon Panglossian hypotheticals, because real-world observations reliably illustrate their total dysfunctionality.</p><p>It was possible to argue for communism before technology replaced human labor. It was possible to argue for libertarianism before technology made it possible for immigrants to cheaply travel from one continent to another and remain in contact with their homelands. Now, both ideologies are obviously false and incorrect.</p><p>Second, consider the logical consequences of Mr. Wright’s stance. Should fathers be deprived of their children and relinquish their paternal rights because the late mother happens to live in a different country? Should all natives of oppressive governments have the right to automatic legal residence in the United States? After all, there are worse governments than the Cuban government; Cuba is only one of 50 countries listed in the Not Free category by Freedom House.</p><p>Cuba’s freedom rating is more than twice as high as the Central African Republic, five times higher than that of Uzbekistan, and virtually identical to that of China. How can Mr. Wright morally justify offering automatic residence to 11.2 million Cubans while denying it to 31 million Uzbekis and 4.7 million Central Africans who are objectively worse off? Given his reasoning, how can he possibly deny the right of residence in the USA to any of the 1.3 billion people of China?</p><p>There is absolutely no reason for me to even begin to consider rethinking my position on race. My position relies entirely on observable facts, sound reason, and the current state of science. The fact that I might, in this one instance, happen to think Obama acted in the American national interest, even if he did so for the wrong reasons, is not in any way relevant to my rational perspective on racial matters. If anyone has a racial obsession here, it is certainly not me.</p><p>Indeed, I found it to be both interesting and informative that Mr. Wright looks at this as a question of race rather than one of justice, national interest, or even demographic pragmatism, especially in light of the observations of Osric Pearl, a second-generation Cuban immigrant, in that particular regard.</p><blockquote><p> American of Cuban descent, second generation. I have a few thoughts.</p><p>First, I agree with Obama’s decision even if I think it was done in bad faith. The US has enough people and it doesn’t need any more. The ones who have been arriving as of late have not been the best and the brightest, and have added nothing to the US except for more debt through social services and depressed wages.</p><p>Second, I know that this was done because of the elections. Obama is a petty man. Had Hillary won, Obama probably would have sat this one through and let Hillary take it down. Cubans hate the Clintons anyway, so there would be no love lost there. But Steve Sailor has this right, Cubans went for Trump 54%. They voted for him with the same percentage as white women. So yeah, a petty move by a petty man. Although good was done, it was still done under false presences. Had this been an honest move, he would have done it before the election, right around the time relations with Cuba were normalized.</p><p>Third, and this isn’t something anyone here is going to like to hear, but it must be said. For the poster who stated that the “Exile” should now go back, the “Exile” is dead. Literally. Those Cubans who considered themselves “The Exile” were baby boomers/greatest generation of which most have died. The last member of that generation is my grandmother who is so old she can neither speak nor move. Their children, the Baby Boomers, either came to the US as young children or were born here. They are somewhat culturally Cuban, but this is the gist, the Cuba which they are culturally a part of is no longer alive. CUBA, is dead. Dead dead dead. They may think they are Cubans, but most Cubans don’t acknowledge them as such. Indeed, they are very different in values and appearance.</p><p>And this is connected to my Fourth point. It’s very interesting that in a blog like this, and others, where race matters and where differences of race are considered, few people consider this dynamic in another country, like say, Cuba. If anyone were to scan the faces of those who went to Fidel’s funeral, one would see a sea of black people. When one of my family members visited in the 90’s, she came back with rolls of tape and a sad heart. “It’s just not the same,” she said. I wonder why. A great aunt, not quite so PC, asked while watching the video of the trip what “all those black people are doing there.” The people who made Cuba what it is, the White/mostly white Spaniards are gone. That means Cuba is gone. This is a tough pill to swallow because no one likes to admit these things since to admit them, one would have to discuss difficult issues about race.</p><p>It’s been white flight since ’56. I know this because the Cubans I grew up with don’t look anything like the majority of Cubans who live in Cuba right now. There is no way that second and third generation children will go there and fell at home. This is very different from going back to Europe and being surrounded by a people and a culture who are familiar. As a comparison, my Aunt who found Cuba too Different to visit again goes to Spain all the time and thinks its great.</p><p>I am honest enough to admit this, but most Cubans are not. Instead, they will find some excuse or other to stay here. A few recent arrivals who can’t cut it may go back, but those who were born here of the original three waves will be in no hurry to go. I suspect that the man whose half-Cuban niece considered going to Cuba after Castro’s death will have a mysterious change of heart if she ever seriously entertains the idea and does a few preliminary visits. She may never speak the reason, because to do so will mean she will cross the bounds of social respectability, but she will know it in her heart. Namely, that the Cubans who live in Cuba look nothing like her Cuban parent and extended family. She may as well move to Detroit, with nicer black people.</p><p>Race matters. Even in Cuba.</p><p>Fifth, Socialism isn’t dead there. Castro’s death changes nothing. The family is still very much in power, and a successor has been named upon Raul’s death. The majority black/mulatto population backs and happily does their bidding even though the ruling class is almost entirely white.</p><p>Cuba is dead to me. But it isn’t just dead to me, it is dead, period.</p></blockquote><p>From a recent <a href=\"https://www.amazon.com/gp/customer-reviews/R3D2XQMOPFW3R8/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=9527065720\">review of <i>Cuckservative</i></a>:</p><blockquote><p> It’s truly mind-boggling that a so-called “conservative” would support open borders, since immigrants typically vote Democrat, and support things like higher taxes, a higher minimum wage, more welfare, hate speech laws, gun control, and even Sharia law in the case of some Muslims. Immigrants also typically have a higher birthrate than the native white population of the United States, the GOP’s main voting bloc. But fear of being called racist (or xenophobic, or white nationalist, or nativist or some other magic word) is enough to make people like Mitt Romney, John McCain, Paul Ryan, Jeb Bush, Mitch McConnell, John Boehner, Glenn Beck, Erick Erickson, Jonah Goldberg, and Bill O’Reilly (who actually supports birthright citizenship) kowtow to the left’s immigration agenda. That, or some of these cuckservatives are financially beholden to corporate donors who benefit from cheap foreign labor. Either way, cuckservatives remind me of a quote paraphrased from the Roman orator Cicero:</p><p><i>“A nation can survive its fools, and even the ambitious. But it cannot survive treason from within. An enemy at the gates is less formidable, for he is known and carries his banner openly. But the traitor moves amongst those within the gate freely, his sly whispers rustling through all the alleys, heard in the very halls of government itself. For the traitor appears not a traitor; he speaks in accents familiar to his victims, and he wears their face and their arguments, he appeals to the baseness that lies deep in the hearts of all men. He rots the soul of a nation, he works secretly and unknown in the night to undermine the pillars of the city, he infects the body politic so that it can no longer resist. A murderer is less to fear.”</i></p></blockquote><p>I submit that if anyone has made an idol of any ideas, it is those who still have faith in the demonstrably false notions of human equality and propositional nations.</p></div>",
  "content_text": "Does John C. Wright really believe that everyone who sets foot on U.S. soil should automatically be granted U.S. citizenship? Or only those who are citizens of countries he describes as a “slave state”?\nI recall the days when you referred to yourself as a libertarian, Vox. Now your obsession has reached a point where, given a choice between siding with Castro’s slave state or rethinking your position on racial matters, you side with Castro. Given a choice between siding with Obama, who fundamentally hates every thing you love and who desecrates everything you hold sacred, and rethinking your position on race, you side with Obama.\nOn a personal note, the Left stopped seeming like humans to me and started seeming like remorseless enemy monsters in human form was when I heard them applauding the midnight military style raid on the house of Elian Gonzales, and cheering the news that the child would be returned to the island sized concentration camp. They hate liberty that much, the Left. They hate humanity, hate life, hate reason,truth and beauty.\nYet each of them was born as an innocent wee babe,cute and cuddly and poopy as were we all.\nWhat changed them? What turns men into monsters?\nI suggest that it is the lure of simple, elegant, powerful ideas which become like idols to them. The idol demands a small sacrifice at first, then more, then more.\nI have always wondered why the first time one of them found his powerful idea and his cause was leading him into siding with what he himself despised and knew to be wrong, no friend warned him.\nFirst, even when I described myself as a libertarian, I was always careful to reject the capital-L. And even though I voted Libertarian, I did not join the party. Why? Because I rejected both abortion rights and open borders, two strongly held Libertarian positions.\nAfter reading Ian Fletcher’s book, then going through the actual free trade arguments of both the classical and Austrian economists and realizing how outmoded and riddled with flaws they were, I began to understand that libertarianism was every bit as utopian, and every bit as impossible, as communism. It’s not an accident that adherents of both ideologies rely heavily upon Panglossian hypotheticals, because real-world observations reliably illustrate their total dysfunctionality.\nIt was possible to argue for communism before technology replaced human labor. It was possible to argue for libertarianism before technology made it possible for immigrants to cheaply travel from one continent to another and remain in contact with their homelands. Now, both ideologies are obviously false and incorrect.\nSecond, consider the logical consequences of Mr. Wright’s stance. Should fathers be deprived of their children and relinquish their paternal rights because the late mother happens to live in a different country? Should all natives of oppressive governments have the right to automatic legal residence in the United States? After all, there are worse governments than the Cuban government; Cuba is only one of 50 countries listed in the Not Free category by Freedom House.\nCuba’s freedom rating is more than twice as high as the Central African Republic, five times higher than that of Uzbekistan, and virtually identical to that of China. How can Mr. Wright morally justify offering automatic residence to 11.2 million Cubans while denying it to 31 million Uzbekis and 4.7 million Central Africans who are objectively worse off? Given his reasoning, how can he possibly deny the right of residence in the USA to any of the 1.3 billion people of China?\nThere is absolutely no reason for me to even begin to consider rethinking my position on race. My position relies entirely on observable facts, sound reason, and the current state of science. The fact that I might, in this one instance, happen to think Obama acted in the American national interest, even if he did so for the wrong reasons, is not in any way relevant to my rational perspective on racial matters. If anyone has a racial obsession here, it is certainly not me.\nIndeed, I found it to be both interesting and informative that Mr. Wright looks at this as a question of race rather than one of justice, national interest, or even demographic pragmatism, especially in light of the observations of Osric Pearl, a second-generation Cuban immigrant, in that particular regard.\nAmerican of Cuban descent, second generation. I have a few thoughts.\nFirst, I agree with Obama’s decision even if I think it was done in bad faith. The US has enough people and it doesn’t need any more. The ones who have been arriving as of late have not been the best and the brightest, and have added nothing to the US except for more debt through social services and depressed wages.\nSecond, I know that this was done because of the elections. Obama is a petty man. Had Hillary won, Obama probably would have sat this one through and let Hillary take it down. Cubans hate the Clintons anyway, so there would be no love lost there. But Steve Sailor has this right, Cubans went for Trump 54%. They voted for him with the same percentage as white women. So yeah, a petty move by a petty man. Although good was done, it was still done under false presences. Had this been an honest move, he would have done it before the election, right around the time relations with Cuba were normalized.\nThird, and this isn’t something anyone here is going to like to hear, but it must be said. For the poster who stated that the “Exile” should now go back, the “Exile” is dead. Literally. Those Cubans who considered themselves “The Exile” were baby boomers/greatest generation of which most have died. The last member of that generation is my grandmother who is so old she can neither speak nor move. Their children, the Baby Boomers, either came to the US as young children or were born here. They are somewhat culturally Cuban, but this is the gist, the Cuba which they are culturally a part of is no longer alive. CUBA, is dead. Dead dead dead. They may think they are Cubans, but most Cubans don’t acknowledge them as such. Indeed, they are very different in values and appearance.\nAnd this is connected to my Fourth point. It’s very interesting that in a blog like this, and others, where race matters and where differences of race are considered, few people consider this dynamic in another country, like say, Cuba. If anyone were to scan the faces of those who went to Fidel’s funeral, one would see a sea of black people. When one of my family members visited in the 90’s, she came back with rolls of tape and a sad heart. “It’s just not the same,” she said. I wonder why. A great aunt, not quite so PC, asked while watching the video of the trip what “all those black people are doing there.” The people who made Cuba what it is, the White/mostly white Spaniards are gone. That means Cuba is gone. This is a tough pill to swallow because no one likes to admit these things since to admit them, one would have to discuss difficult issues about race.\nIt’s been white flight since ’56. I know this because the Cubans I grew up with don’t look anything like the majority of Cubans who live in Cuba right now. There is no way that second and third generation children will go there and fell at home. This is very different from going back to Europe and being surrounded by a people and a culture who are familiar. As a comparison, my Aunt who found Cuba too Different to visit again goes to Spain all the time and thinks its great.\nI am honest enough to admit this, but most Cubans are not. Instead, they will find some excuse or other to stay here. A few recent arrivals who can’t cut it may go back, but those who were born here of the original three waves will be in no hurry to go. I suspect that the man whose half-Cuban niece considered going to Cuba after Castro’s death will have a mysterious change of heart if she ever seriously entertains the idea and does a few preliminary visits. She may never speak the reason, because to do so will mean she will cross the bounds of social respectability, but she will know it in her heart. Namely, that the Cubans who live in Cuba look nothing like her Cuban parent and extended family. She may as well move to Detroit, with nicer black people.\nRace matters. Even in Cuba.\nFifth, Socialism isn’t dead there. Castro’s death changes nothing. The family is still very much in power, and a successor has been named upon Raul’s death. The majority black/mulatto population backs and happily does their bidding even though the ruling class is almost entirely white.\nCuba is dead to me. But it isn’t just dead to me, it is dead, period.\nFrom a recent\nreview of\nCuckservative\n:\nIt’s truly mind-boggling that a so-called “conservative” would support open borders, since immigrants typically vote Democrat, and support things like higher taxes, a higher minimum wage, more welfare, hate speech laws, gun control, and even Sharia law in the case of some Muslims. Immigrants also typically have a higher birthrate than the native white population of the United States, the GOP’s main voting bloc. But fear of being called racist (or xenophobic, or white nationalist, or nativist or some other magic word) is enough to make people like Mitt Romney, John McCain, Paul Ryan, Jeb Bush, Mitch McConnell, John Boehner, Glenn Beck, Erick Erickson, Jonah Goldberg, and Bill O’Reilly (who actually supports birthright citizenship) kowtow to the left’s immigration agenda. That, or some of these cuckservatives are financially beholden to corporate donors who benefit from cheap foreign labor. Either way, cuckservatives remind me of a quote paraphrased from the Roman orator Cicero:\n“A nation can survive its fools, and even the ambitious. But it cannot survive treason from within. An enemy at the gates is less formidable, for he is known and carries his banner openly. But the traitor moves amongst those within the gate freely, his sly whispers rustling through all the alleys, heard in the very halls of government itself. For the traitor appears not a traitor; he speaks in accents familiar to his victims, and he wears their face and their arguments, he appeals to the baseness that lies deep in the hearts of all men. He rots the soul of a nation, he works secretly and unknown in the night to undermine the pillars of the city, he infects the body politic so that it can no longer resist. A murderer is less to fear.”\nI submit that if anyone has made an idol of any ideas, it is those who still have faith in the demonstrably false notions of human equality and propositional nations.",
  "tags": [
    "immigration",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-13T16:00:00+00:00"
}