{
  "url": "https://voxday.net/2017/01/15/mailvox-illustrated-shiv/",
  "scraped_at": "2025-12-18T02:15:05.836392",
  "title": "Mailvox: the illustrated shiv",
  "date_display": "January 15, 2017",
  "date_iso": "2017-01-15T16:00:00+00:00",
  "date_from_url": "2017-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VFM #7634 wasn’t entirely sure to whom Literally Who’s self-outing as… something was referring.</p><blockquote class=\"tr_bq\"><p> I’m confused… is this another post about Scalzi?</p></blockquote><p>No, as it happens, <a href=\"https://heartiste.wordpress.com/2017/01/11/the-debased-beta/\">THIS is a tremendous post about the most important author in science fiction history</a>, the Fifth of the Big Three, the biggest, baddest, bestselling dog at Tor Books, the man with more Hugo nominations than Arthur C. Clarke or Jerry Pournelle and more Hugo Awards than Ray Bradbury, A.E. van Vogt, Lester del Rey, Gregory Benford, Norman Spinrad, Terry Pratchett and Iain M. Banks <i>combined</i>, the writer whose innovative “he said, he said, he said” structure has shocked and awed and intimidated the entire science fiction writing community and forever altered the way it approaches writing dialogue.</p><blockquote><p> Our case study today is John Scalzi, a quisling male emblematic of so much that has gone haywire with White American men (and their beards).</p><p>Exhibit A: This is Scalzi’s Christmas card. He signed off on it. He approved of it. This is how he wants the world to see him.</p><p>Exhibit B: Scalzi in love. Here Scalzi is in the submissive position, an obvious inferior looking up to his wifely better.</p><p>Exhibit C: Scalzi smooches. Kissing upward and nuzzling his doughy face into hard manjawline, eyes closed as his hunky lady peers into the middle distance looking burdened with the weight of the world (or for an escape from her husband’s octopus lips), Scalzi eagerly inverts the sexual polarity, taking on the role of the woman in his marriage, ceding all the T to his wife.</p><p>Exhibit D: Serious Scalzi. Scalzi tries to look serious (ie like a normal man), but is still out-mugged by his wife, who looks more serious, and tougher, than him.</p></blockquote><p>People have mostly given up trying to sell the narrative, but I always found it bizarre when people tried to claim that I envied John Scalzi. On what planet, and for what reason, would I, or <i>any </i>man, ever envy a gamma male like <i>that</i>?</p><p>I find the most interesting thing about Scalzi to be the fact that he somehow managed to delay the inevitable gamma self-implosion until he reached a much higher level of success than is conventionally the case. This suggests that his implosion, when it inevitably comes, is going to be <i>absolutely spectacular</i>.</p><p>The best part of the Chateau post is the comments from the women there.</p><ul><li><i>What I really despise about this guy is that he’s contributing to the further ruin of science fiction. So why do these mannish women latch on to these beta guys? Seeing stuff like this out of a man makes me hurt inside. It’s instinctive, like being scared of rattlesnakes. How do women kill them in themselves, and why would they want to?</i></li><li><i>Exhibit B made my ovaries shrivel.</i></li><li><i>Who’s that gay bloke standing next to the giant woman?</i></li></ul><p>Some might fear that the lack of compassion and respect shown in this post might cost Heartiste any chance of being nominated for the Vox Day Mutual Respect Award from The Vox Day Center for Mutual Respect. However, I would observe that the metric for the Vox Day Mutual Respect Award given out by The Vox Day Center for Mutual Respect is “showing compassion and respect” for one’s “fellow man”, and therefore, due to the subject’s observable lack of any identifiable signs of actual manhood, it would not be correct to hold this post against le Chateau.</p><p>Thank you for caring.</p></div>",
  "content_text": "VFM #7634 wasn’t entirely sure to whom Literally Who’s self-outing as… something was referring.\nI’m confused… is this another post about Scalzi?\nNo, as it happens,\nTHIS is a tremendous post about the most important author in science fiction history\n, the Fifth of the Big Three, the biggest, baddest, bestselling dog at Tor Books, the man with more Hugo nominations than Arthur C. Clarke or Jerry Pournelle and more Hugo Awards than Ray Bradbury, A.E. van Vogt, Lester del Rey, Gregory Benford, Norman Spinrad, Terry Pratchett and Iain M. Banks\ncombined\n, the writer whose innovative “he said, he said, he said” structure has shocked and awed and intimidated the entire science fiction writing community and forever altered the way it approaches writing dialogue.\nOur case study today is John Scalzi, a quisling male emblematic of so much that has gone haywire with White American men (and their beards).\nExhibit A: This is Scalzi’s Christmas card. He signed off on it. He approved of it. This is how he wants the world to see him.\nExhibit B: Scalzi in love. Here Scalzi is in the submissive position, an obvious inferior looking up to his wifely better.\nExhibit C: Scalzi smooches. Kissing upward and nuzzling his doughy face into hard manjawline, eyes closed as his hunky lady peers into the middle distance looking burdened with the weight of the world (or for an escape from her husband’s octopus lips), Scalzi eagerly inverts the sexual polarity, taking on the role of the woman in his marriage, ceding all the T to his wife.\nExhibit D: Serious Scalzi. Scalzi tries to look serious (ie like a normal man), but is still out-mugged by his wife, who looks more serious, and tougher, than him.\nPeople have mostly given up trying to sell the narrative, but I always found it bizarre when people tried to claim that I envied John Scalzi. On what planet, and for what reason, would I, or\nany\nman, ever envy a gamma male like\nthat\n?\nI find the most interesting thing about Scalzi to be the fact that he somehow managed to delay the inevitable gamma self-implosion until he reached a much higher level of success than is conventionally the case. This suggests that his implosion, when it inevitably comes, is going to be\nabsolutely spectacular\n.\nThe best part of the Chateau post is the comments from the women there.\nWhat I really despise about this guy is that he’s contributing to the further ruin of science fiction. So why do these mannish women latch on to these beta guys? Seeing stuff like this out of a man makes me hurt inside. It’s instinctive, like being scared of rattlesnakes. How do women kill them in themselves, and why would they want to?\nExhibit B made my ovaries shrivel.\nWho’s that gay bloke standing next to the giant woman?\nSome might fear that the lack of compassion and respect shown in this post might cost Heartiste any chance of being nominated for the Vox Day Mutual Respect Award from The Vox Day Center for Mutual Respect. However, I would observe that the metric for the Vox Day Mutual Respect Award given out by The Vox Day Center for Mutual Respect is “showing compassion and respect” for one’s “fellow man”, and therefore, due to the subject’s observable lack of any identifiable signs of actual manhood, it would not be correct to hold this post against le Chateau.\nThank you for caring.",
  "tags": [
    "mailvox",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-15T16:00:00+00:00"
}