{
  "url": "https://voxday.net/2017/01/19/mcrapey-responds/",
  "scraped_at": "2025-12-18T02:15:39.263136",
  "title": "McRapey responds",
  "date_display": "January 19, 2017",
  "date_iso": "2017-01-19T16:00:00+00:00",
  "date_from_url": "2017-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi has bravely risen <a href=\"https://heartiste.wordpress.com/2017/01/18/the-uxorious-male/\">to defend his ritual public humiliations</a> of his wife against the Chateau’s speciesist scorn:</p><blockquote><p> John Scalzi ✔ @scalzi<br> 1. Incidentally, it’s a thing with alt-right types to try to run down my marriage, ie, HOW DARE YOU BE BESOTTED WITH YOUR WIFE YOU BETA CUCK<br> 10:59 PM – 17 Jan 2017</br></br></p><p>John Scalzi ✔ @scalzi<br> 2. And it really just makes me giggle. Yes, you sad little boys. I’m married to a strong awesome equal partner, for 21 years now. How awful!<br> 11:01 PM – 17 Jan 2017</br></br></p><p>John Scalzi ✔ @scalzi<br> 3. I mean, honestly. I’m not sure how HA HA LOOK AT THIS LOSER WHO DELIGHTS IN HIS MARRIAGE is supposed to be an insult. To ME, anyway.<br> 11:04 PM – 17 Jan 2017</br></br></p><p>John Scalzi ✔ @scalzi<br> 4. Mind you, if being happy with my wife sends them into paroxysms of fury, well, I guess that’s a bonus? But otherwise: Silly little boys.<br> 11:06 PM – 17 Jan 2017</br></br></p><p> John Scalzi ✔ @scalzi<br> 5. In sum: Yeah, being married to my wife is super-fabulous. I’d do it again in a heartbeat, any day of the week. And twice on Sundays.<br> 11:14 PM – 17 Jan 2017</br></br></p></blockquote><p>You have to see the wedding day picture to believe it. It’s hilarious. As Heartiste observed: <i>I haven’t seen a “lean out” like that since Sheryl Sandberg’s husband set his treadmill speed to “the sweet relief of marital release”.</i><br> <i><br/></i><br> John, no one is running down your marriage, much less sent into “paroxysms of fury” over your ongoing experiment in interspecies relations. We think it’s great that you’re so happily married to an orc, or half-troll, or whatever it is. No one begrudges you that. We just think it’s funny. Especially when you brag about <a href=\"http://www.milobookclub.com/2014/07/02/hiding-behind-gir/\">how strong your offspring are</a>.</br></br></p><blockquote><p> HALF-ORCS<br> <i>These orc–human crossbreeds can be found in either orc or human society (where their status varies according to local sentiments), or in communities of their own. Half-orcs usually inherit a good blend of the physical characteristics of their parents. They are as tall as humans and a little heavier, thanks to their muscle.</i><br>     +2 Strength, –2 Intelligence, –2 Charisma.</br></br></p></blockquote></div>",
  "content_text": "John Scalzi has bravely risen\nto defend his ritual public humiliations\nof his wife against the Chateau’s speciesist scorn:\nJohn Scalzi ✔ @scalzi\n1. Incidentally, it’s a thing with alt-right types to try to run down my marriage, ie, HOW DARE YOU BE BESOTTED WITH YOUR WIFE YOU BETA CUCK\n10:59 PM – 17 Jan 2017\nJohn Scalzi ✔ @scalzi\n2. And it really just makes me giggle. Yes, you sad little boys. I’m married to a strong awesome equal partner, for 21 years now. How awful!\n11:01 PM – 17 Jan 2017\nJohn Scalzi ✔ @scalzi\n3. I mean, honestly. I’m not sure how HA HA LOOK AT THIS LOSER WHO DELIGHTS IN HIS MARRIAGE is supposed to be an insult. To ME, anyway.\n11:04 PM – 17 Jan 2017\nJohn Scalzi ✔ @scalzi\n4. Mind you, if being happy with my wife sends them into paroxysms of fury, well, I guess that’s a bonus? But otherwise: Silly little boys.\n11:06 PM – 17 Jan 2017\nJohn Scalzi ✔ @scalzi\n5. In sum: Yeah, being married to my wife is super-fabulous. I’d do it again in a heartbeat, any day of the week. And twice on Sundays.\n11:14 PM – 17 Jan 2017\nYou have to see the wedding day picture to believe it. It’s hilarious. As Heartiste observed:\nI haven’t seen a “lean out” like that since Sheryl Sandberg’s husband set his treadmill speed to “the sweet relief of marital release”.\nJohn, no one is running down your marriage, much less sent into “paroxysms of fury” over your ongoing experiment in interspecies relations. We think it’s great that you’re so happily married to an orc, or half-troll, or whatever it is. No one begrudges you that. We just think it’s funny. Especially when you brag about\nhow strong your offspring are\n.\nHALF-ORCS\nThese orc–human crossbreeds can be found in either orc or human society (where their status varies according to local sentiments), or in communities of their own. Half-orcs usually inherit a good blend of the physical characteristics of their parents. They are as tall as humans and a little heavier, thanks to their muscle.\n+2 Strength, –2 Intelligence, –2 Charisma.",
  "tags": [
    "Alpha Game",
    "McRapey",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-19T16:00:00+00:00"
}