{
  "url": "https://voxday.net/2017/01/11/metafake-news/",
  "scraped_at": "2025-12-18T02:14:23.829583",
  "title": "Metafake news and golden journalism",
  "date_display": "January 11, 2017",
  "date_iso": "2017-01-11T10:11:00+00:00",
  "date_from_url": "2017-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently it’s not that hard to provoke the mainstream media into <a href=\"http://www.dailymail.co.uk/news/article-4107738/Intelligence-chief-told-Trump-Kremlin-spies-claim-compromising-material-personal-life-including-claims-degrading-sex-acts-Moscow-hotel.html\">eviscerating itself</a>:<br/></p><blockquote><p> The saga over alleged Russian interference in the U.S. elections took another sinister turn Tuesday, as it was claimed that U.S. intelligence officials provided President-elect Donald Trump with a charge that the Russians had obtained dirt on him.</p><p>U.S. officials allegedly included a two-page synopsis of ‘kompromat’ – Russian for compromising material – as part of their security briefing of Trump on Friday.</p><p>The material was based on memos compiled by a British intelligence operative who was considered ‘credible’ by the U.S. intelligence community, CNN reported. Disclosure FBI sat on damaging allegations will enrage Democrats after Comey went public with Anthony Weiner material just before election</p><p>What is believed to be the 35-page document itself was published by Buzzfeed, which pointed out that it contained errors. Little of its contents can be independently verified, while there has been no official confirmation of the details of the briefing and Donald Trump has branded the claims as ‘fake’.</p><p>The document claims Russian sources told the operative that they had extensive material on the now president-elect – including a secret film of him in the suite where President Obama stayed in Moscow, watching prostitutes committing degrading sex acts on the bed where the president slept.</p><p>Trump himself has already dismissed the claims, tweeting: ‘FAKE NEWS – A TOTAL POLITICAL WITCH HUNT!’</p></blockquote><p>See, now THIS is how you mock the media and take away its credibility and power, not NAZI-Larping. Let’s just say any time you manage to get Rick Wilson, the CIA, and CNN to bite – and inspire a formal denial from the Kremlin – you have achieved MegaTroll status. One simply has to give the media what they desperately want in a multilayer package that sounds sufficiently believable to them.</p><p>MILO himself is looking on with appreciation and thinking, “damn, this guy is good! I mean, like ME good!”</p><p>It’s really rather remarkable that neither the conservative nor the mainstream media have developed any ability to scent the presence of channers at work yet. This tends to support the notion that they mostly consist of hypersolipsistic women and socially challenged gamma males, neither of whom have any idea how humans actually work.</p><p>From <a href=\"http://pastebin.com/XjteDsMm\">Writeup for Cernovich</a>:</p><blockquote><p> On january 10, Buzzfeed posted a story under the byline of Ken Bensinger, Mark Schoofs and Miriam elder titled “these reports Allege Trump Has Deep Ties To Russia” and posted a link to a document alleging, among other things, that russia has been cultivating trump for 5+ years, that trump has been in constant contact with the kremlin for information on his opponents, and perhaps most inflammatory, that there are many recorded instances of blackmail of trump in sexual misconduct. A prominent claim is that trump rented the presidential suite of the Ritz Carlton Hotel in moscow, where he knew that the Obamas had slept in; he them hired a number of prostitutes to perform a ‘golden shower’ (pissplay) on the bed and in the room.</p><p>Noted #nevertrump voice Rick Wilson later <a href=\"https://twitter.com/TheRickWilson/status/818982395202379777\">commented on twitter</a>, stating that the report “gave a new meaning to Wikileaks” and that <a href=\"https://twitter.com/TheRickWilson/status/818983514335047680\">the report was the reason</a> everybody was fighting so hard against the election of Trump.</p><p>The remarkable thing? It’s all fake. And not only fake; it’s a prank perpetuated by 4chan, on Rick Wilson himself. A post on 4chan <a href=\"http://archive.4plebs.org/pol/thread/94704894/#94705224\">on october 26</a> stated “mfw managed to convince CTR and certain (((journalists))) on Twitter there’ll be an October surprise on Trump this Friday” along with a picture of a smug face with a hash name.<br> <a href=\"https://archive.4plebs.org/pol/thread/95568919/#95571329\"><br/></a><br> <a href=\"https://archive.4plebs.org/pol/thread/95568919/#95571329\">on november 1</a>, a person without a picture but is assumed to be the same person posted “So they took what I told Rick Wilson and added a Russian spy angle to it. They still believe it. Guys, they’re truly fucking desperate – there’s no remaining Trump scandal that’s credible.”</br></br></p><p><a href=\"http://boards.4chan.org/pol/thread/106514445#p106520376\">on january 10</a>, moments after the story broke and began to gain traction on social media, a person with the same smug grin face, and the same hash title for the picture, stated “I didn’t think they’d take it so far.”</p><p>This story has taken on something of a life of it’s own. Going through Rick Wilson’s twitter, you can find many different stories from the time that he had shown the story to a wide number of anti-trump news sources, trying to find a news organization that would actually publish the story. During that time period, he referred to it often as ‘the thing’, and often playing coy with followers on the content with the story with anybody who was not also a #Nevertrumper. Unconfirmed sources has people as high up as John McCain giving the story to FBI Director James Comey to attempt to verify the story. Given that Rick Wilson runs in Establishment circles, it is not an impossible scenario that long-serving senators are falling for what amounts to a 4chan troll trump supporter creating an ironic October Surprise out of wholecloth to punk a GOPe pundit who derogatorily referred to them as single men who masturbate to anime.</p></blockquote><p>I remember Rick Wilson’s “October Surprise” hints and assuming that they would amount to nothing. But I was wrong. /pol/ <a href=\"https://archive.4plebs.org/pol/search/text/rick%20wilson/start/2016-09-01/order/asc/page/17/\">rickrolled him</a>. This truly exceeds expectations.</p><p>UPDATE: The Kremlin <a href=\"http://www.dailymail.co.uk/news/article-4108784/Kremlin-DENIES-claims-kept-blackmail-dossier-Trump-saying-reports-compromising-files-no-fiction.html\">has officially denied the story</a>.</p><p>UPDATE: Even a cursory read should have been sufficient to determine the report was fake. From <a href=\"https://pjmedia.com/instapundit/254241/\">Instapundit</a>: <i>British intelligence describes events surrounding the “World Cup Soccer tournament.” </i>This is a dead giveaway. First, the Brits don’t say “soccer”. Second, as far as the Brits are concerned, there is only one World Cup. “World Cup Soccer tournament” sounds about as credible as “The National Tackle Football Premier Cup”.</p><p>UPDATE: <a href=\"http://www.dailywire.com/news/12313/hours-trumps-press-conference-cnn-and-buzzfeed-hit-john-nolte\">Jake Tapper was involved</a> in CNN pushing the story. He must be really desperate to move the focus away from Pizzagate. I wonder why?</p><p>UPDATE: <i>Downing Street sought to distance itself from a report – apparently compiled by a former MI6 operative – claiming the Russians have a file of incriminating material on the president-elect.</i></p></div>",
  "content_text": "Apparently it’s not that hard to provoke the mainstream media into\neviscerating itself\n:\nThe saga over alleged Russian interference in the U.S. elections took another sinister turn Tuesday, as it was claimed that U.S. intelligence officials provided President-elect Donald Trump with a charge that the Russians had obtained dirt on him.\nU.S. officials allegedly included a two-page synopsis of ‘kompromat’ – Russian for compromising material – as part of their security briefing of Trump on Friday.\nThe material was based on memos compiled by a British intelligence operative who was considered ‘credible’ by the U.S. intelligence community, CNN reported. Disclosure FBI sat on damaging allegations will enrage Democrats after Comey went public with Anthony Weiner material just before election\nWhat is believed to be the 35-page document itself was published by Buzzfeed, which pointed out that it contained errors. Little of its contents can be independently verified, while there has been no official confirmation of the details of the briefing and Donald Trump has branded the claims as ‘fake’.\nThe document claims Russian sources told the operative that they had extensive material on the now president-elect – including a secret film of him in the suite where President Obama stayed in Moscow, watching prostitutes committing degrading sex acts on the bed where the president slept.\nTrump himself has already dismissed the claims, tweeting: ‘FAKE NEWS – A TOTAL POLITICAL WITCH HUNT!’\nSee, now THIS is how you mock the media and take away its credibility and power, not NAZI-Larping. Let’s just say any time you manage to get Rick Wilson, the CIA, and CNN to bite – and inspire a formal denial from the Kremlin – you have achieved MegaTroll status. One simply has to give the media what they desperately want in a multilayer package that sounds sufficiently believable to them.\nMILO himself is looking on with appreciation and thinking, “damn, this guy is good! I mean, like ME good!”\nIt’s really rather remarkable that neither the conservative nor the mainstream media have developed any ability to scent the presence of channers at work yet. This tends to support the notion that they mostly consist of hypersolipsistic women and socially challenged gamma males, neither of whom have any idea how humans actually work.\nFrom\nWriteup for Cernovich\n:\nOn january 10, Buzzfeed posted a story under the byline of Ken Bensinger, Mark Schoofs and Miriam elder titled “these reports Allege Trump Has Deep Ties To Russia” and posted a link to a document alleging, among other things, that russia has been cultivating trump for 5+ years, that trump has been in constant contact with the kremlin for information on his opponents, and perhaps most inflammatory, that there are many recorded instances of blackmail of trump in sexual misconduct. A prominent claim is that trump rented the presidential suite of the Ritz Carlton Hotel in moscow, where he knew that the Obamas had slept in; he them hired a number of prostitutes to perform a ‘golden shower’ (pissplay) on the bed and in the room.\nNoted #nevertrump voice Rick Wilson later\ncommented on twitter\n, stating that the report “gave a new meaning to Wikileaks” and that\nthe report was the reason\neverybody was fighting so hard against the election of Trump.\nThe remarkable thing? It’s all fake. And not only fake; it’s a prank perpetuated by 4chan, on Rick Wilson himself. A post on 4chan\non october 26\nstated “mfw managed to convince CTR and certain (((journalists))) on Twitter there’ll be an October surprise on Trump this Friday” along with a picture of a smug face with a hash name.\non november 1\n, a person without a picture but is assumed to be the same person posted “So they took what I told Rick Wilson and added a Russian spy angle to it. They still believe it. Guys, they’re truly fucking desperate – there’s no remaining Trump scandal that’s credible.”\non january 10\n, moments after the story broke and began to gain traction on social media, a person with the same smug grin face, and the same hash title for the picture, stated “I didn’t think they’d take it so far.”\nThis story has taken on something of a life of it’s own. Going through Rick Wilson’s twitter, you can find many different stories from the time that he had shown the story to a wide number of anti-trump news sources, trying to find a news organization that would actually publish the story. During that time period, he referred to it often as ‘the thing’, and often playing coy with followers on the content with the story with anybody who was not also a #Nevertrumper. Unconfirmed sources has people as high up as John McCain giving the story to FBI Director James Comey to attempt to verify the story. Given that Rick Wilson runs in Establishment circles, it is not an impossible scenario that long-serving senators are falling for what amounts to a 4chan troll trump supporter creating an ironic October Surprise out of wholecloth to punk a GOPe pundit who derogatorily referred to them as single men who masturbate to anime.\nI remember Rick Wilson’s “October Surprise” hints and assuming that they would amount to nothing. But I was wrong. /pol/\nrickrolled him\n. This truly exceeds expectations.\nUPDATE: The Kremlin\nhas officially denied the story\n.\nUPDATE: Even a cursory read should have been sufficient to determine the report was fake. From\nInstapundit\n:\nBritish intelligence describes events surrounding the “World Cup Soccer tournament.”\nThis is a dead giveaway. First, the Brits don’t say “soccer”. Second, as far as the Brits are concerned, there is only one World Cup. “World Cup Soccer tournament” sounds about as credible as “The National Tackle Football Premier Cup”.\nUPDATE:\nJake Tapper was involved\nin CNN pushing the story. He must be really desperate to move the focus away from Pizzagate. I wonder why?\nUPDATE:\nDowning Street sought to distance itself from a report – apparently compiled by a former MI6 operative – claiming the Russians have a file of incriminating material on the president-elect.",
  "tags": [
    "conspiracy",
    "media",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-11T10:11:00+00:00"
}