{
  "url": "https://voxday.net/2017/01/10/muh-constitution-he-cucked-cuckingly/",
  "scraped_at": "2025-12-18T02:14:21.962937",
  "title": "“Muh Constitution,” he cucked, cuckingly",
  "date_display": "January 10, 2017",
  "date_iso": "2017-01-10T21:38:00+00:00",
  "date_from_url": "2017-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alex Rawls has absolutely no idea what the U.S. Constitution is or for whom it was written:</p><blockquote class=\"tr_bq\"><p> The CONSTITUTION does not define a white ethnostate. It is no contradiction of the constitution to welcome many of those from other races that share a commitment to liberty under law and to Christian morality (which most religions other than Islam do in large degree).</p></blockquote><p>Alex is absolutely and utterly wrong. The Constitution doesn’t define a white ethnostate, it clearly establishes a BRITISH ethnostate. It exists solely to defend the rights and liberties of the genetic descendants of the Founders and <i>no one else</i>. It does not welcome anyone and it does not indicate any interest in any other race or nation regardless of their commitment to anything, much less “liberty under law” or “Christian morality”.</p><p>The purpose of the Constitution is laid out in the Preamble:<br> <i><br/></i><br> <i>We the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.</i></br></br></p><p>Many, if not most, descendants of immigrants are not the Posterity of the then-People of the United States. Neither are people living in Mexico, Germany, Israel, or even Great Britain. The U.S. Constitution was not written for them, nor was it ever intended to secure the Blessings of Liberty for them.</p><p>The idea that the Constitution was intended to do anything at all for immigrants, resident aliens, or foreigners is as absurd as the idea that its emanations and penumbras provide them with an unalienable right to an abortion. The fact that courts have declared otherwise is totally irrelevant.</p><p>The proposition nation is a lie. There is no such thing, there never was any such thing, and there never will be any such thing.</p></div>",
  "content_text": "Alex Rawls has absolutely no idea what the U.S. Constitution is or for whom it was written:\nThe CONSTITUTION does not define a white ethnostate. It is no contradiction of the constitution to welcome many of those from other races that share a commitment to liberty under law and to Christian morality (which most religions other than Islam do in large degree).\nAlex is absolutely and utterly wrong. The Constitution doesn’t define a white ethnostate, it clearly establishes a BRITISH ethnostate. It exists solely to defend the rights and liberties of the genetic descendants of the Founders and\nno one else\n. It does not welcome anyone and it does not indicate any interest in any other race or nation regardless of their commitment to anything, much less “liberty under law” or “Christian morality”.\nThe purpose of the Constitution is laid out in the Preamble:\nWe the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.\nMany, if not most, descendants of immigrants are not the Posterity of the then-People of the United States. Neither are people living in Mexico, Germany, Israel, or even Great Britain. The U.S. Constitution was not written for them, nor was it ever intended to secure the Blessings of Liberty for them.\nThe idea that the Constitution was intended to do anything at all for immigrants, resident aliens, or foreigners is as absurd as the idea that its emanations and penumbras provide them with an unalienable right to an abortion. The fact that courts have declared otherwise is totally irrelevant.\nThe proposition nation is a lie. There is no such thing, there never was any such thing, and there never will be any such thing.",
  "tags": [
    "cuckservative",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-10T21:38:00+00:00"
}