{
  "url": "https://voxday.net/2017/01/19/musing-on-meditations/",
  "scraped_at": "2025-12-18T02:15:42.921798",
  "title": "Musing on meditations",
  "date_display": "January 19, 2017",
  "date_iso": "2017-01-19T19:30:00+00:00",
  "date_from_url": "2017-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Someone on Gab asked me if I would write a book of philosophy, and suggested something similar to one written by one of my intellectual heroes, Marcus Aurelius. His <i>Meditations </i>have been a significant influence on my thinking since high school, particularly this deeply meaningful piece of advice, with which he began Book Two in the Staniforth translation:</p><p><i>Begin each day by telling yourself: today I shall be meeting with interference, ingratitude, insolence, disloyalty, ill-will, and selfishness—all of them due to the offenders’ ignorance of what is good or evil. But for my part I have long perceived the nature of good and its nobility, the nature of evil and its meanness, and also the nature of the culprit himself, who is my brother (not in the physical sense, but as a fellow-creature similarly endowed with reason and a share of the divine); therefore none of those things can injure me, for nobody can implicate me in what is degrading.</i></p><p>Those who have read <i>Meditations </i>can probably see how the very way I live has been influenced by them; it was somewhat startling to listen to a song recently and realize that I’d written these words with my friend Paul more than 20 years ago. Much to my surprise, it’s become one of my favorites in retrospect.</p><p><i>Over sea, under stone</i><br> <i>I will find myself alone</i><br> <i>All I’ve seen and all I’ve known</i><br> <i>In a dream far from home</i><br> <i>I still find myself alone</i><br> <i><br/></i><br> <i>In this place there’s nobody inside</i><br> <i>In this place there’s nobody outside</i><br> <i>I find myself alone</i></br></br></br></br></br></br></br></br></p><p>It seems we really do shape our future through our imaginations. Of course, what the non-reader of <i>Meditations </i>might fail to understand is that this is not a mournful song about loneliness, but rather a contemplative one about the need to abandon the world and its deafening, disharmonious distractions in order to find oneself, or rather, to honestly face the truth about oneself and one’s place in Creation.</p><p>A man must be able to look honestly inside before he can look accurately outside.</p><p>I don’t think I am ready yet to take on the task of writing my own <i>Meditations</i>. But I do have the sense that one day, I will be able to do so, though whether it will be before or after I attempt my magnum opus of economics philosophy written in the Aquinan form, I cannot say. In the meantime, perhaps the following ten aphorisms may be of some utility to a reader or two.</p><ul><li>Tell yourself the unvarnished truth, even if you cannot bring yourself to admit it to anyone else.</li><li>We are all being deceived, in some matters, by someone, at all times.</li><li>An unsound foundation will never produce a sound conclusion. When a conclusion strikes you as dubious, look hard at the underlying assumptions supporting it.</li><li>Evil existed in the past. It will exist in the future. You are not going to eliminate it. You are not even going to eliminate it in yourself.</li><li>No amount of pleasure will ever satisfy a man. No amount of comfort will ever satisfy a woman.</li><li>Status is a dangerous and addictive psychological drug. Be deeply wary of it.</li><li>Leadership requires a surfeit of ego, because the good leader must be able to sacrifice his own for the benefit of his subordinates when need be.</li><li>Never trust an insecure man. Sooner or later, his fears will cause him to turn on those to whom he is closest.</li><li>The weak will always attempt to outlaw the strong.</li><li>Never stay down. Even the dead can haunt their killers.</li></ul></div>",
  "content_text": "Someone on Gab asked me if I would write a book of philosophy, and suggested something similar to one written by one of my intellectual heroes, Marcus Aurelius. His\nMeditations\nhave been a significant influence on my thinking since high school, particularly this deeply meaningful piece of advice, with which he began Book Two in the Staniforth translation:\nBegin each day by telling yourself: today I shall be meeting with interference, ingratitude, insolence, disloyalty, ill-will, and selfishness—all of them due to the offenders’ ignorance of what is good or evil. But for my part I have long perceived the nature of good and its nobility, the nature of evil and its meanness, and also the nature of the culprit himself, who is my brother (not in the physical sense, but as a fellow-creature similarly endowed with reason and a share of the divine); therefore none of those things can injure me, for nobody can implicate me in what is degrading.\nThose who have read\nMeditations\ncan probably see how the very way I live has been influenced by them; it was somewhat startling to listen to a song recently and realize that I’d written these words with my friend Paul more than 20 years ago. Much to my surprise, it’s become one of my favorites in retrospect.\nOver sea, under stone\nI will find myself alone\nAll I’ve seen and all I’ve known\nIn a dream far from home\nI still find myself alone\nIn this place there’s nobody inside\nIn this place there’s nobody outside\nI find myself alone\nIt seems we really do shape our future through our imaginations. Of course, what the non-reader of\nMeditations\nmight fail to understand is that this is not a mournful song about loneliness, but rather a contemplative one about the need to abandon the world and its deafening, disharmonious distractions in order to find oneself, or rather, to honestly face the truth about oneself and one’s place in Creation.\nA man must be able to look honestly inside before he can look accurately outside.\nI don’t think I am ready yet to take on the task of writing my own\nMeditations\n. But I do have the sense that one day, I will be able to do so, though whether it will be before or after I attempt my magnum opus of economics philosophy written in the Aquinan form, I cannot say. In the meantime, perhaps the following ten aphorisms may be of some utility to a reader or two.\nTell yourself the unvarnished truth, even if you cannot bring yourself to admit it to anyone else.\nWe are all being deceived, in some matters, by someone, at all times.\nAn unsound foundation will never produce a sound conclusion. When a conclusion strikes you as dubious, look hard at the underlying assumptions supporting it.\nEvil existed in the past. It will exist in the future. You are not going to eliminate it. You are not even going to eliminate it in yourself.\nNo amount of pleasure will ever satisfy a man. No amount of comfort will ever satisfy a woman.\nStatus is a dangerous and addictive psychological drug. Be deeply wary of it.\nLeadership requires a surfeit of ego, because the good leader must be able to sacrifice his own for the benefit of his subordinates when need be.\nNever trust an insecure man. Sooner or later, his fears will cause him to turn on those to whom he is closest.\nThe weak will always attempt to outlaw the strong.\nNever stay down. Even the dead can haunt their killers.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-19T19:30:00+00:00"
}