{
  "url": "https://voxday.net/2017/01/14/nearly-as-good/",
  "scraped_at": "2025-12-18T02:14:54.830847",
  "title": "“nearly as good”",
  "date_display": "January 14, 2017",
  "date_iso": "2017-01-14T13:00:00+00:00",
  "date_from_url": "2017-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those reviewing <b><i><a href=\"http://amzn.to/2hgubn2\">A Sea of Skulls</a></i></b> should really be a little more careful. Such positive reviews bid fair to cause more than a few SF-SJWs to stroke out. <a href=\"https://didactsreach.blogspot.com/2017/01/book-review-sea-of-skulls-by-vox-day.html\">Didact’s Reach reviews<i> A Sea of Skulls</i></a> and finds it to be rather better than one might expect:</p><blockquote><p> If the critics found ATOB a bit difficult to stomach because it proved to be such an effective demonstration of what a (supposedly) less skilled but (definitely) more disciplined writer could do when compared with GRRM’s declining powers, they are going to very quickly find that <b><i><a href=\"http://amzn.to/2hgubn2\">A Sea of Skulls</a></i></b> will be an even bigger shock to their worldview.</p><p>For with this book, Vox Day has not merely matched George R. R. Martin’s fantasy writing skills and output. He has exceeded him, by miles, leaving old Rape Rape wheezing and panting in the dust.</p><p>In fact, I am willing to go so far as to argue that, with this book, Vox Day has catapulted himself into the storied and rarefied rank of writers that sits just below The Master himself.</p><p>That’s right, I went there. I just said that Vox Day has written a book that is nearly as good as J. R. R. Tolkien’s work.</p><p>Not as good. But not terribly far off, either.</p><p>From one fantasy fan to another, praise simply does not come any higher than that….</p><p>This book is, quite simply, an extraordinary achievement. With it, Vox has separated himself from all of his contemporary rivals and has clearly laid down a marker for everyone else to match- and I personally don’t think anyone will be able to do so for years, maybe decades, to come. What he has written here is far more than merely a great book. It is a masterclass of what high fantasy could actually be.</p></blockquote><p>That’s just an excerpt. Read <a href=\"https://didactsreach.blogspot.com/2017/01/book-review-sea-of-skulls-by-vox-day.html\">the whole thing there</a>. Of course, what may be the biggest testimony in favor of the growing consensus that the <a href=\"http://amzn.to/2iLEUmG\">ARTS OF DARK AND LIGHT</a> series has unexpectedly become the best epic fantasy series going is the total silence on the part of those who usually don’t hesitate to speak out critically every time I recommend a book, or, in some cases, exhale. Just as SF/F sites like Black Gate and File 770 inexplicably have <i>nothing </i>to say about many of the very best-selling authors in science fiction, SF authors such as Vaughn Heppner and B.V. Larson, who have sold literal <i>millions </i>of books, they are silent on the subject of a massive epic fantasy saga that some readers now consider to be the best to have appeared in decades.</p><p>Now, I am under absolutely no illusion that my work will ever reach the lofty height of Tolkien’s. It can’t. It won’t. Tolkien’s grasp of history, myth, and language are deeper than mine, and the greatness of his work reflects that. <i>The Lord of the Rings</i> is the greatest work of science fiction and fantasy fiction, and, based on my extensive reading of fiction dating back to Homer and the Lady Murasaki, it will remain so for the foreseeable future.</p><p>But that does not mean that it cannot be exceeded in various areas, some of which happen to be particular strengths of mine. The martial aspects, the magic systems, the politics, and the socio-sexuality are all elements that can be improved upon. Even the philosophy of evil, in my estimation, is rather on the thin side; who would actually <i>want </i>to serve Sauron? I never found Saruman’s switching sides to be terribly convincing; yes, everyone wants to be on the winning side, but what is the point of being a lieutenant of evil if it requires living in squalor surrounded by orcs?</p><p>If nothing else, elf chicks are hotter. So are human chicks, and, arguably, dwarf chicks, for that matter. Is living in a mud pit surrounded by howling, bestial orcs really the way a quasi-immortal wants to spend the rest of his days? I’m just not seeing a credible motivation there.</p><p>And let’s not even get started on the whole “fly in on a squadron of eagles and drop the One Ring in Mount Doom” strategy.</p><p>Anyhow, it’s very flattering, and encouraging, to see the latest installment in the series has been so well-received. Fans needn’t be concerned that any such praise will go to my head, as to the contrary, it has inspired me to buckle down, grit my teeth, and try to raise my game even more. When even those who openly detest me are willing to admit that AODAL is markedly better than ASOIAF and genuinely merits comparison to <i>The Lord of the Rings</i>, then perhaps I’ll be willing to contemplate a little coasting.</p><p>In the meantime, I have about another one million words to write before AODAL will be finished. The only proper verdict at this point is: it’s too soon to tell. I’m barely one-third of the way through the monster. I expect it will be around 1,660,000 words in the end.</p></div>",
  "content_text": "Those reviewing\nA Sea of Skulls\nshould really be a little more careful. Such positive reviews bid fair to cause more than a few SF-SJWs to stroke out.\nDidact’s Reach reviews\nA Sea of Skulls\nand finds it to be rather better than one might expect:\nIf the critics found ATOB a bit difficult to stomach because it proved to be such an effective demonstration of what a (supposedly) less skilled but (definitely) more disciplined writer could do when compared with GRRM’s declining powers, they are going to very quickly find that\nA Sea of Skulls\nwill be an even bigger shock to their worldview.\nFor with this book, Vox Day has not merely matched George R. R. Martin’s fantasy writing skills and output. He has exceeded him, by miles, leaving old Rape Rape wheezing and panting in the dust.\nIn fact, I am willing to go so far as to argue that, with this book, Vox Day has catapulted himself into the storied and rarefied rank of writers that sits just below The Master himself.\nThat’s right, I went there. I just said that Vox Day has written a book that is nearly as good as J. R. R. Tolkien’s work.\nNot as good. But not terribly far off, either.\nFrom one fantasy fan to another, praise simply does not come any higher than that….\nThis book is, quite simply, an extraordinary achievement. With it, Vox has separated himself from all of his contemporary rivals and has clearly laid down a marker for everyone else to match- and I personally don’t think anyone will be able to do so for years, maybe decades, to come. What he has written here is far more than merely a great book. It is a masterclass of what high fantasy could actually be.\nThat’s just an excerpt. Read\nthe whole thing there\n. Of course, what may be the biggest testimony in favor of the growing consensus that the\nARTS OF DARK AND LIGHT\nseries has unexpectedly become the best epic fantasy series going is the total silence on the part of those who usually don’t hesitate to speak out critically every time I recommend a book, or, in some cases, exhale. Just as SF/F sites like Black Gate and File 770 inexplicably have\nnothing\nto say about many of the very best-selling authors in science fiction, SF authors such as Vaughn Heppner and B.V. Larson, who have sold literal\nmillions\nof books, they are silent on the subject of a massive epic fantasy saga that some readers now consider to be the best to have appeared in decades.\nNow, I am under absolutely no illusion that my work will ever reach the lofty height of Tolkien’s. It can’t. It won’t. Tolkien’s grasp of history, myth, and language are deeper than mine, and the greatness of his work reflects that.\nThe Lord of the Rings\nis the greatest work of science fiction and fantasy fiction, and, based on my extensive reading of fiction dating back to Homer and the Lady Murasaki, it will remain so for the foreseeable future.\nBut that does not mean that it cannot be exceeded in various areas, some of which happen to be particular strengths of mine. The martial aspects, the magic systems, the politics, and the socio-sexuality are all elements that can be improved upon. Even the philosophy of evil, in my estimation, is rather on the thin side; who would actually\nwant\nto serve Sauron? I never found Saruman’s switching sides to be terribly convincing; yes, everyone wants to be on the winning side, but what is the point of being a lieutenant of evil if it requires living in squalor surrounded by orcs?\nIf nothing else, elf chicks are hotter. So are human chicks, and, arguably, dwarf chicks, for that matter. Is living in a mud pit surrounded by howling, bestial orcs really the way a quasi-immortal wants to spend the rest of his days? I’m just not seeing a credible motivation there.\nAnd let’s not even get started on the whole “fly in on a squadron of eagles and drop the One Ring in Mount Doom” strategy.\nAnyhow, it’s very flattering, and encouraging, to see the latest installment in the series has been so well-received. Fans needn’t be concerned that any such praise will go to my head, as to the contrary, it has inspired me to buckle down, grit my teeth, and try to raise my game even more. When even those who openly detest me are willing to admit that AODAL is markedly better than ASOIAF and genuinely merits comparison to\nThe Lord of the Rings\n, then perhaps I’ll be willing to contemplate a little coasting.\nIn the meantime, I have about another one million words to write before AODAL will be finished. The only proper verdict at this point is: it’s too soon to tell. I’m barely one-third of the way through the monster. I expect it will be around 1,660,000 words in the end.",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-14T13:00:00+00:00"
}