{
  "url": "https://voxday.net/2017/01/23/new-pizzagate-allegations/",
  "scraped_at": "2025-12-18T06:58:09.991653",
  "title": "New Pizzagate allegations",
  "date_display": "January 23, 2017",
  "date_iso": "2017-01-23T18:33:00+00:00",
  "date_from_url": "2017-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A former employee of Comet Ping Pong <a href=\"https://steemit.com/pizzagate/@abortionburger/victim-comes-forward-i-was-sexually-assaulted-by-james-alefantis\">alleges he was assaulted</a> by the individual at the center of the Pizzagate scandal, and also alleges that he was not the man’s only victim:</p><blockquote><p> Eight years ago, a young college student (who wishes to keep his name anonymous) worked at Comet Ping Pong. He reached out to Alefantis as a friend, who then allegedly drugged and sexually assaulted him. The user also goes further to claim that around the same time, Alefantis was caught by former business partner Carole Greenwood assaulting her young son in the kitchen of Comet Ping Pong. While unproven, the timeline does indeed add up with Greenwood’s abrupt abandonment of Comet, citing “urgent family matters”. We can also confirm via a Washington Post article written in 2003 that Greenwood does have a son who would have been 17-18 years old in 2008. Greenwood was unavailable for an interview. According to the accuser, another employee witnessed the assault of Greenwood’s son. Those reports were allegedly swept under the rug by the DC police.</p></blockquote><p>Considering that there are recent reports out of Belgium and Norway, <a href=\"http://www.tnp.no/norway/panorama/5403-pedophile-abuse-network-operation-darkroom-shakes-norway\">including dozens of arrests</a>, that involve politicians and child pornography, the fact that there is so much media panic over the mere mention of the term “Pizzagate” is, in itself, rather suspicious. It is also reminiscent of the British establishment’s covering up the crimes of known pedophiles such as TV personality Jimmy Savile and <a href=\"http://www.telegraph.co.uk/news/politics/liberaldemocrats/10775341/Cyril-Smith-the-predatory-paedophile-protected-by-establishment.html\">Member of Parliament Cyril Smith</a> for four decades.</p><p>David Seaman <a href=\"https://www.youtube.com/watch?v=_3JSSuF1G8o\">has some thoughts on the latest revelations</a> and the media’s utter unwillingness to even look into the allegations.</p></div>",
  "content_text": "A former employee of Comet Ping Pong\nalleges he was assaulted\nby the individual at the center of the Pizzagate scandal, and also alleges that he was not the man’s only victim:\nEight years ago, a young college student (who wishes to keep his name anonymous) worked at Comet Ping Pong. He reached out to Alefantis as a friend, who then allegedly drugged and sexually assaulted him. The user also goes further to claim that around the same time, Alefantis was caught by former business partner Carole Greenwood assaulting her young son in the kitchen of Comet Ping Pong. While unproven, the timeline does indeed add up with Greenwood’s abrupt abandonment of Comet, citing “urgent family matters”. We can also confirm via a Washington Post article written in 2003 that Greenwood does have a son who would have been 17-18 years old in 2008. Greenwood was unavailable for an interview. According to the accuser, another employee witnessed the assault of Greenwood’s son. Those reports were allegedly swept under the rug by the DC police.\nConsidering that there are recent reports out of Belgium and Norway,\nincluding dozens of arrests\n, that involve politicians and child pornography, the fact that there is so much media panic over the mere mention of the term “Pizzagate” is, in itself, rather suspicious. It is also reminiscent of the British establishment’s covering up the crimes of known pedophiles such as TV personality Jimmy Savile and\nMember of Parliament Cyril Smith\nfor four decades.\nDavid Seaman\nhas some thoughts on the latest revelations\nand the media’s utter unwillingness to even look into the allegations.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-23T18:33:00+00:00"
}