{
  "url": "https://voxday.net/2017/01/15/no-apologies/",
  "scraped_at": "2025-12-18T02:15:02.173239",
  "title": "No apologies",
  "date_display": "January 15, 2017",
  "date_iso": "2017-01-15T10:34:00+00:00",
  "date_from_url": "2017-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hater Foz Meadows refuses to apologize to the Jewish people for her despicable insult to Holocaust survivers. So hateful! Incredibly, she sneeringly waves off public demands for an apology as <a href=\"https://archive.is/JfoMf\">“batshit ridiculous”</a>.</p><p>Have you ever heard <i>anything </i>so nakedly anti-semitic? Sad!</p><p>And in the meantime, Literally Who isn’t taking Literally Wu’s latest bid for public attention lying down and <a href=\"https://archive.is/DimDb\">has come back strong</a> by coming out as… something nameless that appears to be somehow related to ambiguous non-cisgendered cross-dressing special snowflake status.</p><blockquote><p> I’m going to tell you something I’ve been afraid to say for basically ever. And it’s gonna be messy, and it’s gonna go to some dark places (including eating disorders so pls be advised) because I’m barfing my heart out onto the page and hoping I can do it fast enough that I won’t reconsider, or hold back. I can’t say all this without first pausing to say this is only my story, and it’s a privilege that I am able to share it. I want to gently remind people that I’m only trying to speak for me and my own experiences, and in no way does that change or speak to others’ realities. I’m coming out (holy shit typing that made me anxious), so this is just my story.</p><p>My entire life I’ve not been a girl or a woman.</p><p>Growing up, I’d have hissyfits over being talked to or referred to as a girl. People have had to remind me that they see me as a girl or a woman my entire life, because it doesn’t exist in my head. All that ever has is “this isn’t me”.</p><p>When I was 12, I started smoking cigarettes because I thought they’d make my voice lower, and I was tired of hearing a high alien pitch come out of my face. About a year later, I started starving myself because i wanted to look like anything other than a girl, and because I didn’t identify with being a boy either. The closest thing I could find to what looked “right” was the waif thin androgynous body type, and when combined with my hatred of my own body I developed a full on eating disorder that I never told anyone about. At one point, I hovered around 100lbs, despairing that my hips were still wide, my shoulders and chest still broad, and that I’d be an hourglass no matter how much I starved.</p><p>I managed to recover, mostly, but the hatred of my own body remained, strong enough that I still can’t objectively see myself in the mirror with any sort of accuracy. I found out recently I’ve been wearing the wrong size of everything, always overestimating, always going baggier, always trying to hide what I’d been so ashamed of.</p></blockquote><p>There is more. Oh, there is <i>so much mor</i>e than you could ever want to imagine. But it inspires a very important question, which is: how is Literally Who 2 going to respond to <i>this</i>? Let’s face it, it’s going to be hard to top the competition from the other two professional victims, especially when they’ve shown themselves more than willing to match death threat with death threat, and terrified-flight-from-home with terrified-flight-from-home, in the past.</p><p>I should think, at a bare minimum, LW2 is going to have to come out as a transgendered male rape victim and run for the U.S. Senate just to stay in the game.</p></div>",
  "content_text": "Hater Foz Meadows refuses to apologize to the Jewish people for her despicable insult to Holocaust survivers. So hateful! Incredibly, she sneeringly waves off public demands for an apology as\n“batshit ridiculous”\n.\nHave you ever heard\nanything\nso nakedly anti-semitic? Sad!\nAnd in the meantime, Literally Who isn’t taking Literally Wu’s latest bid for public attention lying down and\nhas come back strong\nby coming out as… something nameless that appears to be somehow related to ambiguous non-cisgendered cross-dressing special snowflake status.\nI’m going to tell you something I’ve been afraid to say for basically ever. And it’s gonna be messy, and it’s gonna go to some dark places (including eating disorders so pls be advised) because I’m barfing my heart out onto the page and hoping I can do it fast enough that I won’t reconsider, or hold back. I can’t say all this without first pausing to say this is only my story, and it’s a privilege that I am able to share it. I want to gently remind people that I’m only trying to speak for me and my own experiences, and in no way does that change or speak to others’ realities. I’m coming out (holy shit typing that made me anxious), so this is just my story.\nMy entire life I’ve not been a girl or a woman.\nGrowing up, I’d have hissyfits over being talked to or referred to as a girl. People have had to remind me that they see me as a girl or a woman my entire life, because it doesn’t exist in my head. All that ever has is “this isn’t me”.\nWhen I was 12, I started smoking cigarettes because I thought they’d make my voice lower, and I was tired of hearing a high alien pitch come out of my face. About a year later, I started starving myself because i wanted to look like anything other than a girl, and because I didn’t identify with being a boy either. The closest thing I could find to what looked “right” was the waif thin androgynous body type, and when combined with my hatred of my own body I developed a full on eating disorder that I never told anyone about. At one point, I hovered around 100lbs, despairing that my hips were still wide, my shoulders and chest still broad, and that I’d be an hourglass no matter how much I starved.\nI managed to recover, mostly, but the hatred of my own body remained, strong enough that I still can’t objectively see myself in the mirror with any sort of accuracy. I found out recently I’ve been wearing the wrong size of everything, always overestimating, always going baggier, always trying to hide what I’d been so ashamed of.\nThere is more. Oh, there is\nso much mor\ne than you could ever want to imagine. But it inspires a very important question, which is: how is Literally Who 2 going to respond to\nthis\n? Let’s face it, it’s going to be hard to top the competition from the other two professional victims, especially when they’ve shown themselves more than willing to match death threat with death threat, and terrified-flight-from-home with terrified-flight-from-home, in the past.\nI should think, at a bare minimum, LW2 is going to have to come out as a transgendered male rape victim and run for the U.S. Senate just to stay in the game.",
  "tags": [
    "#GamerGate",
    "SJW",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-15T10:34:00+00:00"
}