{
  "url": "https://voxday.net/2017/01/17/pity-poor-never-trumpers/",
  "scraped_at": "2025-12-18T02:15:18.087420",
  "title": "Pity the poor Never Trumpers",
  "date_display": "January 17, 2017",
  "date_iso": "2017-01-17T13:00:00+00:00",
  "date_from_url": "2017-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given their inability to grasp the relationship between action and consequence, to say nothing of their inability to predict events, one could argue there is a case for the God-Emperor Ascendant to <a href=\"https://archive.fo/7HHkz#selection-4123.0-4147.70\">leave the Never Trumpers Never Employed</a> even if he was inclined to let bygones be bygones.</p><blockquote><p> They are some of the biggest names in the Republican national security firmament, veterans of past GOP administrations who say, if called upon by President-elect Donald Trump, they stand ready to serve their country again.</p><p>But their phones aren’t ringing. Their entreaties to Trump Tower in New York have mostly gone unanswered. In Trump world, these establishment all-stars say they are “PNG” — personae non gratae.</p><p>Their transgression was signing one or both of two public “Never Trump” letters during the campaign, declaring they would not vote for Trump and calling his candidacy a danger to the nation. One letter, with 122 names, was published by War on the Rocks, a website devoted to national security commentary, during the primary season in March. The other, with 50 names, including some repeat signatories, was published by the New York Times during the general-election campaign in August.</p><p>Now, just days before Trump is sworn in as the nation’s 45th president, the letter signers fear they have been added to another document, this one private — a purported blacklist compiled by Trump’s political advisers….</p><p>The conflict was exacerbated shortly after the election when Eliot Cohen, a State Department counselor during the Bush administration who had helped organize the War on the Rocks letter, aired new criticism of the Trump transition. In an opinion column for The Washington Post in November, Cohen said that a friend on the transition team had asked him to provide names of potential job candidates — with the stipulation that he include no one who signed either of the letters.</p><p>Cohen wrote that he became convinced there were “pent-up resentments” among members of the Trump team, and he warned young policy experts against working for the administration. Cohen has had no further communications with the transition team.</p><p>“Believe me — my phone is not ringing,” he said in a recent interview.</p></blockquote><p>Forget not being hired. These jokers should be worried about being renditioned and droned. After all, they have called the President-Elect of the United States of America “a danger to the nation”.</p><p>And what nation would that be, exactly?</p><p>The fact that they are so utterly clueless as to be surprised that they are not being offered employment by the very man they attacked so viciously and so publicly should alone be enough to prevent <i>anyone </i>from hiring them, not just the Trump administration.</p><p>In any event, once more the God-Emperor Ascendant is demonstrating his wisdom by refusing to place his trust in the bureaucratic elite that hates him and will fight him at every opportunity. I don’t think Trump is going to disappoint his supporters, I think he is going to delight them by exceeding their expectations.</p></div>",
  "content_text": "Given their inability to grasp the relationship between action and consequence, to say nothing of their inability to predict events, one could argue there is a case for the God-Emperor Ascendant to\nleave the Never Trumpers Never Employed\neven if he was inclined to let bygones be bygones.\nThey are some of the biggest names in the Republican national security firmament, veterans of past GOP administrations who say, if called upon by President-elect Donald Trump, they stand ready to serve their country again.\nBut their phones aren’t ringing. Their entreaties to Trump Tower in New York have mostly gone unanswered. In Trump world, these establishment all-stars say they are “PNG” — personae non gratae.\nTheir transgression was signing one or both of two public “Never Trump” letters during the campaign, declaring they would not vote for Trump and calling his candidacy a danger to the nation. One letter, with 122 names, was published by War on the Rocks, a website devoted to national security commentary, during the primary season in March. The other, with 50 names, including some repeat signatories, was published by the New York Times during the general-election campaign in August.\nNow, just days before Trump is sworn in as the nation’s 45th president, the letter signers fear they have been added to another document, this one private — a purported blacklist compiled by Trump’s political advisers….\nThe conflict was exacerbated shortly after the election when Eliot Cohen, a State Department counselor during the Bush administration who had helped organize the War on the Rocks letter, aired new criticism of the Trump transition. In an opinion column for The Washington Post in November, Cohen said that a friend on the transition team had asked him to provide names of potential job candidates — with the stipulation that he include no one who signed either of the letters.\nCohen wrote that he became convinced there were “pent-up resentments” among members of the Trump team, and he warned young policy experts against working for the administration. Cohen has had no further communications with the transition team.\n“Believe me — my phone is not ringing,” he said in a recent interview.\nForget not being hired. These jokers should be worried about being renditioned and droned. After all, they have called the President-Elect of the United States of America “a danger to the nation”.\nAnd what nation would that be, exactly?\nThe fact that they are so utterly clueless as to be surprised that they are not being offered employment by the very man they attacked so viciously and so publicly should alone be enough to prevent\nanyone\nfrom hiring them, not just the Trump administration.\nIn any event, once more the God-Emperor Ascendant is demonstrating his wisdom by refusing to place his trust in the bureaucratic elite that hates him and will fight him at every opportunity. I don’t think Trump is going to disappoint his supporters, I think he is going to delight them by exceeding their expectations.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-17T13:00:00+00:00"
}