{
  "url": "https://voxday.net/2017/01/19/pull-some-hair/",
  "scraped_at": "2025-12-18T02:15:37.444958",
  "title": "Pull some hair",
  "date_display": "January 19, 2017",
  "date_iso": "2017-01-19T13:00:00+00:00",
  "date_from_url": "2017-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Glenn Reynolds has some sage advice for the Right facing an increasingly deranged Left and squadrons of SJWs resolutely doubling down:</p><blockquote><p> Progressives Destroyed Normalcy And Now They’re Shocked Trump Isn’t Normal. Choose the form of your Destructor. But I disagree with the thesis of this piece that people on the right should embrace civility and normalcy. Civility and normalcy are privileges that require a broad consensus. Conservatives have been utter failures at “conserving” these traits.</p><p>Here’s <a href=\"http://www.washingtonexaminer.com/sunday-reflection-repeal-the-hollywood-tax-cuts/article/2503964\">my take</a>:</p><p><i>There’s an old joke about a boy who complains to his mother that his little sister keeps pulling his hair.</i><br> <i><br/></i><br> <i>“Oh,” responds the mother, “she doesn’t know that it hurts.”</i><br> <i><br/></i><br> <i>A few minutes later, the mother hears the girl scream and runs into the other room. “She knows now,” the boy explains.</i><br> <i><br/></i><br> <i>There’s a lesson for Republicans in that old joke, if they’re smart enough to absorb it.</i></br></br></br></br></br></br></p><p>I think that Trump is smart enough. Go pull some hair.</p></blockquote><p>Conservatives and moderates – or if you prefer, losers – are always concerned more about form than substance. They subscribe to the Fallacy of Nice, which is that wickedness stems from ill-treatment, and therefore good will result from kindness. This reliably fails, because it requires ignoring both observable human behavior as well as the entire written history of Man. Glenn is absolutely right to disagree with <a href=\"http://thefederalist.com/2017/01/18/progressives-destroyed-normalcy-shocked-trump-isnt-normal/\">the Federalist article</a>, which concludes, in typically idiotic fashion:</p><blockquote><p> Conservatives, Don’t Use the Tactics of the Left</p><p>A big part of what conservatives are meant to conserve is decency, decorum, and respect. We should oppose shouting expletives at those we disagree with. We should oppose public shaming and boycotts. We should oppose cruel mockery as a legitimate means to achieve our ends.</p><p>Those on the alt-right and their apologists tell us that we must use the Left’s tactics to defeat them. This is wrong. It’s wrong because there is no distinction between tactics and politics, you cannot defeat something by becoming it.</p></blockquote><p>What shameless dishonesty. I don’t know what I despise more about conservatives, their fecklessness or their smug, shameless, self-righteous dishonesty. Tactics are not politics are not objectives are not ideals; just as the US Marines did not become the Wehrmacht by adopting maneuver warfare, the Alt-Right will not become SJWs due to the effective use of rhetoric and going on the offensive. The fact that the ends <i>may or may not justify</i> the means does not mean that the ends <i>are </i>the means.</p><p>American conservatism is a failed political posture; it can reasonably be described as the political philosophy of failure. That is why the Alt-Right is the only reasonable political philosophy for anyone who wishes to oppose the madness of SJWs and the Left’s dream of a fully converged social justice state. Nothing else offers more than the promise – usually false – of holding one’s political ground.</p><p>In this vein, I absolutely adore Glenn’s idea of restoring the 20 percent tax on motion picture theater gross revenues and applying it to all Hollywood products. Trump and the GOP should institute it immediately. Tax EVERY Democrat-dominated industry at the highest rate applied by the US tax code; after all, Democrats just love high taxes.</p><p>Pull some hair. Kick some ass. Bring more cowbell. Remember, the Alt-Right doesn’t believe in noble defeat, it believes in WINNING.</p></div>",
  "content_text": "Glenn Reynolds has some sage advice for the Right facing an increasingly deranged Left and squadrons of SJWs resolutely doubling down:\nProgressives Destroyed Normalcy And Now They’re Shocked Trump Isn’t Normal. Choose the form of your Destructor. But I disagree with the thesis of this piece that people on the right should embrace civility and normalcy. Civility and normalcy are privileges that require a broad consensus. Conservatives have been utter failures at “conserving” these traits.\nHere’s\nmy take\n:\nThere’s an old joke about a boy who complains to his mother that his little sister keeps pulling his hair.\n“Oh,” responds the mother, “she doesn’t know that it hurts.”\nA few minutes later, the mother hears the girl scream and runs into the other room. “She knows now,” the boy explains.\nThere’s a lesson for Republicans in that old joke, if they’re smart enough to absorb it.\nI think that Trump is smart enough. Go pull some hair.\nConservatives and moderates – or if you prefer, losers – are always concerned more about form than substance. They subscribe to the Fallacy of Nice, which is that wickedness stems from ill-treatment, and therefore good will result from kindness. This reliably fails, because it requires ignoring both observable human behavior as well as the entire written history of Man. Glenn is absolutely right to disagree with\nthe Federalist article\n, which concludes, in typically idiotic fashion:\nConservatives, Don’t Use the Tactics of the Left\nA big part of what conservatives are meant to conserve is decency, decorum, and respect. We should oppose shouting expletives at those we disagree with. We should oppose public shaming and boycotts. We should oppose cruel mockery as a legitimate means to achieve our ends.\nThose on the alt-right and their apologists tell us that we must use the Left’s tactics to defeat them. This is wrong. It’s wrong because there is no distinction between tactics and politics, you cannot defeat something by becoming it.\nWhat shameless dishonesty. I don’t know what I despise more about conservatives, their fecklessness or their smug, shameless, self-righteous dishonesty. Tactics are not politics are not objectives are not ideals; just as the US Marines did not become the Wehrmacht by adopting maneuver warfare, the Alt-Right will not become SJWs due to the effective use of rhetoric and going on the offensive. The fact that the ends\nmay or may not justify\nthe means does not mean that the ends\nare\nthe means.\nAmerican conservatism is a failed political posture; it can reasonably be described as the political philosophy of failure. That is why the Alt-Right is the only reasonable political philosophy for anyone who wishes to oppose the madness of SJWs and the Left’s dream of a fully converged social justice state. Nothing else offers more than the promise – usually false – of holding one’s political ground.\nIn this vein, I absolutely adore Glenn’s idea of restoring the 20 percent tax on motion picture theater gross revenues and applying it to all Hollywood products. Trump and the GOP should institute it immediately. Tax EVERY Democrat-dominated industry at the highest rate applied by the US tax code; after all, Democrats just love high taxes.\nPull some hair. Kick some ass. Bring more cowbell. Remember, the Alt-Right doesn’t believe in noble defeat, it believes in WINNING.",
  "tags": [
    "#AltRight",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-19T13:00:00+00:00"
}