{
  "url": "https://voxday.net/2017/01/02/the-price-of-thought-policing/",
  "scraped_at": "2025-12-18T02:13:09.214836",
  "title": "The price of thought-policing",
  "date_display": "January 2, 2017",
  "date_iso": "2017-01-02T18:30:00+00:00",
  "date_from_url": "2017-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is eternal vigilance. Fortunately, several intrepid Wikipedia admins are up to the task of patrolling the Wikipedia page devoted to me. It’s rather amusing; first David Gerard, who is an admin and is so neutral on the subject that he cited <i>Phil Sandifier</i> as a reliable source, <a href=\"https://en.wikipedia.org/w/index.php?title=Vox_Day&amp;type=revision&amp;diff=753891836&amp;oldid=753865234\">removed all references to Infogalactic</a> and tried to deny my involvement with it.</p><ul><li>(single source and that questionable; see talk page. it is entirely unclear this warrants mention *at all*, let alone two subsections. get consensus for inclusion first.)</li><li>(rm infogalactic – cut’n’paste of multiply-deleted article, closest it has to third-party coverage is one Breitbart article; not notable in mainstream or its field)</li></ul><p>He even tried to justify his own patrolling of the page on the basis of his own bias.</p><p><i>I might note, I just today published a negative review of a Castalia book on Phil’s site, so I hold the WSJ-certified typical opinion of Vox Day, but that I find doubles my caution and I’m second guessing myself</i> – David Gerard (talk) 00:37, 10 September 2016 (UTC)</p><p>However, when editors kept putting mentions of Infogalactic on the page, he finally gave up, although he was careful to add an irrelevant detail concerning something we have not only never denied, but have repeatedly pointed out to others.</p><p><i>In 2016 Day launched an online encyclopedia called Infogalactic,[25] forking the content of Wikipedia.</i></p><p>This is how the Wikipedia admins police thought there, by constant nibbling away at the edges. Infogalaxians chronicles how two admins, David Gerard and Dragonfly Sixtyseven <a href=\"https://infogalactic.blogspot.com/2017/01/what-wikipedia-admins-do.html\">slash repeatedly away at the page</a> over the course of a week in the interest of removing all the material they think they can justify removing.</p><p>The reason they do all this repeated nibbling and sausage slicing is because the editors eventually start to notice something isn’t right.</p><blockquote class=\"tr_bq\"><ul><li>Day published his recommendations in his blog, which is the primary source but in the article, this is now also documented through secondary sources, i.e. SF magazines. I think it’s a good idea to include both, as it allows the reader to independently verify the information. The primary sources show that respected publications like Slate and the Guardian in this case are clearly unreliable. Pkeets (talk) 16:55, 7 September 2016 (UTC)</li><li>I’m kind of appalled looking at some of these articles from sources that are usually considered reliable. It looks like they didn’t even talk to Day when writing these articles about him. Kelly hi! 17:24, 7 September 2016 (UTC)</li><li>Or, do any research about the subject. They seem to have worked off assumptions. That means identifying bias and reliability in the sources will be important in establishing a neutral POV info in the article. Pkeets (talk) 19:09, 7 September 2016 (UTC)</li></ul></blockquote><p>I’m far from the only individual targeted in this way. Another tactic, which was previously utilized unsuccessfully against my page, is the “denial of notability”. In this case, they use the fact that the mainstream media ignores massively successful self-published authors – in this case, one of the top 20 SF authors on Amazon – in order to claim that they are not notable <a href=\"https://archive.is/MqgmK\">and delete the page</a>.</p><blockquote><p> Wikipedia:Articles for deletion/B. V. Larson</p><p>The following discussion is an archived debate of the proposed deletion of the article below. Please do not modify it. Subsequent comments should be made on the appropriate discussion page (such as the article’s talk page or in a deletion review). No further edits should be made to this page.<br> The result was delete. The “keep” arguments are considerably weaker in terms of policy and guidelines, and often add up to “but he’s very commercially successful, so he must be notable”. Well, not according to our inclusion guidelines, as Tokyogirl79 points out. Her thorough analysis of the available sources hasn’t been seriously addressed by those wanting to keep the article, which also weakens their side of the argument.  Sandstein  17:13, 31 August 2015 (UTC)</br></p><p>Non notable author with no adequate references for notability. none of his books are held in more than 80 libraries a/c Worldcat; Technomancer has 79, and the others are fewer than 20. DGG ( talk ) 21:00, 15 August 2015 (UTC)</p><p>Delete References now on page (Amazon.com, Audible.com) cannot support ntability. He gets a few press mentions, Here: [1],and here: [2], news google search on his name [3], but not enough to source a page or support notability.E.M.Gregory (talk) 15:01, 16 August 2015 (UTC)</p><p>Delete. I found the same results: he’s brought up occasionally as a WP:TRIVIAL mention, but sadly he has never received the type of coverage that Wikipedia would require to satisfy notability guidelines for authors. He’s pretty much one of many authors whose works are self-published (either partially or entirely) or indie that has a fan following, but not one large enough to attract attention from places Wikipedia would consider reliable. Most of the sources I found were either WP:SPS or in places like SFFAudio, which are kind of squiffy as far as whether or not they’d pass Wikipedia’s fairly strict verification guidelines. Tokyogirl79 (｡◕‿◕｡) 08:13, 18 August 2015 (UTC)</p><p>Your argument is well-reasoned, but the sources still don’t add up, from what I can see. Essentially, in the reliable sources (newspapers, mainly, and the one book) Larson is merely “name-checked” — that is he is mentioned by name in sentences like: “…self-published writers including B.V. Larson and A.G. Riddle.” And that’s all. What we need is for there to be an article ABOUT him, or at least that goes into some depth, in such a source. That’s what WP requires for notability. Sources that aren’t neutral (like Kindle, which publishes him and therefore has a vested interest in making him look good), can’t be used; nor can personal web sites and blogs. One of the sources starts out “Guess what! My cousin Brian is also a science fiction and fantasy author!” That’s obviously not a neutral source. I agree with you that it’s unfair that self-published authors don’t get more attention, but until they start getting reviews in established sources, we have no reasoned way to separate wheat from chaff — and, quite honestly, from the few self-published books I’ve opened up, there’s a lot of chaff. LaMona (talk) 18:37, 28 August 2015 (UTC)</p></blockquote><p>I would think that going platinum as an author would be one adequate way to separate the wheat from the chaff; selling a million books is inherently notable. This is why Infogalactic is so important, and why it will be necessary for us to ruthlessly crack down on admins and editors who want to play the same shady game of shaping a particular narrative to suit themselves, regardless of what it is.</p></div>",
  "content_text": "Is eternal vigilance. Fortunately, several intrepid Wikipedia admins are up to the task of patrolling the Wikipedia page devoted to me. It’s rather amusing; first David Gerard, who is an admin and is so neutral on the subject that he cited\nPhil Sandifier\nas a reliable source,\nremoved all references to Infogalactic\nand tried to deny my involvement with it.\n(single source and that questionable; see talk page. it is entirely unclear this warrants mention *at all*, let alone two subsections. get consensus for inclusion first.)\n(rm infogalactic – cut’n’paste of multiply-deleted article, closest it has to third-party coverage is one Breitbart article; not notable in mainstream or its field)\nHe even tried to justify his own patrolling of the page on the basis of his own bias.\nI might note, I just today published a negative review of a Castalia book on Phil’s site, so I hold the WSJ-certified typical opinion of Vox Day, but that I find doubles my caution and I’m second guessing myself\n– David Gerard (talk) 00:37, 10 September 2016 (UTC)\nHowever, when editors kept putting mentions of Infogalactic on the page, he finally gave up, although he was careful to add an irrelevant detail concerning something we have not only never denied, but have repeatedly pointed out to others.\nIn 2016 Day launched an online encyclopedia called Infogalactic,[25] forking the content of Wikipedia.\nThis is how the Wikipedia admins police thought there, by constant nibbling away at the edges. Infogalaxians chronicles how two admins, David Gerard and Dragonfly Sixtyseven\nslash repeatedly away at the page\nover the course of a week in the interest of removing all the material they think they can justify removing.\nThe reason they do all this repeated nibbling and sausage slicing is because the editors eventually start to notice something isn’t right.\nDay published his recommendations in his blog, which is the primary source but in the article, this is now also documented through secondary sources, i.e. SF magazines. I think it’s a good idea to include both, as it allows the reader to independently verify the information. The primary sources show that respected publications like Slate and the Guardian in this case are clearly unreliable. Pkeets (talk) 16:55, 7 September 2016 (UTC)\nI’m kind of appalled looking at some of these articles from sources that are usually considered reliable. It looks like they didn’t even talk to Day when writing these articles about him. Kelly hi! 17:24, 7 September 2016 (UTC)\nOr, do any research about the subject. They seem to have worked off assumptions. That means identifying bias and reliability in the sources will be important in establishing a neutral POV info in the article. Pkeets (talk) 19:09, 7 September 2016 (UTC)\nI’m far from the only individual targeted in this way. Another tactic, which was previously utilized unsuccessfully against my page, is the “denial of notability”. In this case, they use the fact that the mainstream media ignores massively successful self-published authors – in this case, one of the top 20 SF authors on Amazon – in order to claim that they are not notable\nand delete the page\n.\nWikipedia:Articles for deletion/B. V. Larson\nThe following discussion is an archived debate of the proposed deletion of the article below. Please do not modify it. Subsequent comments should be made on the appropriate discussion page (such as the article’s talk page or in a deletion review). No further edits should be made to this page.\nThe result was delete. The “keep” arguments are considerably weaker in terms of policy and guidelines, and often add up to “but he’s very commercially successful, so he must be notable”. Well, not according to our inclusion guidelines, as Tokyogirl79 points out. Her thorough analysis of the available sources hasn’t been seriously addressed by those wanting to keep the article, which also weakens their side of the argument.  Sandstein  17:13, 31 August 2015 (UTC)\nNon notable author with no adequate references for notability. none of his books are held in more than 80 libraries a/c Worldcat; Technomancer has 79, and the others are fewer than 20. DGG ( talk ) 21:00, 15 August 2015 (UTC)\nDelete References now on page (Amazon.com, Audible.com) cannot support ntability. He gets a few press mentions, Here: [1],and here: [2], news google search on his name [3], but not enough to source a page or support notability.E.M.Gregory (talk) 15:01, 16 August 2015 (UTC)\nDelete. I found the same results: he’s brought up occasionally as a WP:TRIVIAL mention, but sadly he has never received the type of coverage that Wikipedia would require to satisfy notability guidelines for authors. He’s pretty much one of many authors whose works are self-published (either partially or entirely) or indie that has a fan following, but not one large enough to attract attention from places Wikipedia would consider reliable. Most of the sources I found were either WP:SPS or in places like SFFAudio, which are kind of squiffy as far as whether or not they’d pass Wikipedia’s fairly strict verification guidelines. Tokyogirl79 (｡◕‿◕｡) 08:13, 18 August 2015 (UTC)\nYour argument is well-reasoned, but the sources still don’t add up, from what I can see. Essentially, in the reliable sources (newspapers, mainly, and the one book) Larson is merely “name-checked” — that is he is mentioned by name in sentences like: “…self-published writers including B.V. Larson and A.G. Riddle.” And that’s all. What we need is for there to be an article ABOUT him, or at least that goes into some depth, in such a source. That’s what WP requires for notability. Sources that aren’t neutral (like Kindle, which publishes him and therefore has a vested interest in making him look good), can’t be used; nor can personal web sites and blogs. One of the sources starts out “Guess what! My cousin Brian is also a science fiction and fantasy author!” That’s obviously not a neutral source. I agree with you that it’s unfair that self-published authors don’t get more attention, but until they start getting reviews in established sources, we have no reasoned way to separate wheat from chaff — and, quite honestly, from the few self-published books I’ve opened up, there’s a lot of chaff. LaMona (talk) 18:37, 28 August 2015 (UTC)\nI would think that going platinum as an author would be one adequate way to separate the wheat from the chaff; selling a million books is inherently notable. This is why Infogalactic is so important, and why it will be necessary for us to ruthlessly crack down on admins and editors who want to play the same shady game of shaping a particular narrative to suit themselves, regardless of what it is.",
  "tags": [
    "Infogalactic",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-02T18:30:00+00:00"
}