{
  "url": "https://voxday.net/2017/01/27/the-winning-will-continue/",
  "scraped_at": "2025-12-18T06:58:45.723308",
  "title": "The winning will continue",
  "date_display": "January 27, 2017",
  "date_iso": "2017-01-27T16:00:00+00:00",
  "date_from_url": "2017-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The medias, both conservative and mainstream, are shocked and awed to witness Trump actually <a href=\"http://thehill.com/homenews/administration/316411-surprise-trump-doing-what-he-said-he-would\">doing what he said he would</a> do:</p><blockquote><p> In his first frantic week at the White House, Donald Trump is doing almost exactly what he promised to do during his campaign, stunning those who thought he’d adapt his style as president.</p><p>Trump has signed an executive order to begin building a wall on the Mexican border and doubled down on his promise to renegotiate the North American Free Trade Agreement and repeal ObamaCare.</p><p>Actions to temporarily suspend visas for people coming to the United States from a number of Muslim nations are expected to come soon.</p><p>Trump hasn’t stopped tweeting either, nor has he quit his habit of launching into new fights seemingly on a whim. Much of his first week in office has been dominated by his claims, without any evidence, that massive voter fraud cost him a popular vote victory to Hillary Clinton. On Wednesday, he announced a “major investigation” into his unsubstantiated claims about voter fraud.</p><p>President Obama famously said that “elections have consequences” in explaining to Republicans why he was moving forward with a nearly $1 trillion stimulus plan and his signature healthcare bill. Now Trump is showing Washington and the world the truth of Obama’s words.</p><p>During the campaign, Trump’s critics dismissed his ambitious agenda as rhetoric that he’d back away from once in office.</p><p>If candidate Trump beat the odds and made it to the White House, they said, The Trump Show will surely grind to a halt once he’s confronted with the realities of governing.</p><p>It hasn’t turned out like that at all.</p><p>“Enough all talk, no action. We have to deliver,” Trump told Republican lawmakers Thursday. “This is our chance to achieve great and lasting change for our beloved nation.”</p></blockquote><p>I like that fact that Viceroy Mike Pence has already put Congress on alert that it is not going to be permitted to slow the God-Emperor’s onslaught. Donald Trump clearly understands what is at stake, and it appears that he is providing <a href=\"http://www.theaustralian.com.au/business/news/lets-stand-together-and-halt-eclipse-of-the-west-says-may-to-trump/news-story/cb252e5cb0cca7766a2a7056910ff5d4\">a salient example to other Western leaders</a>, putting some steel in the spine of hitherto unreliable leaders such as British Prime Minister Theresa May, who said “let’s stand together and halt eclipse of the West.”</p><p>Strong words, although I would have preferred her to say that she is committed to Making England Great Again. If she was wise, she would offer Scotland another vote, encourage them to pursue independence, then have the Parliament vote on Brexit. However, given the Conservative majority in the House of Commons, that’s not actually necessary. All she really has to do is refuse to let the MPs vote freely, as the Labor Party is already committed to supporting Brexit by Labour leader Jeremy Corbyn, and Parliamentary endorsement for Brexit as well as the invocation of Article 50 will be secured.</p></div>",
  "content_text": "The medias, both conservative and mainstream, are shocked and awed to witness Trump actually\ndoing what he said he would\ndo:\nIn his first frantic week at the White House, Donald Trump is doing almost exactly what he promised to do during his campaign, stunning those who thought he’d adapt his style as president.\nTrump has signed an executive order to begin building a wall on the Mexican border and doubled down on his promise to renegotiate the North American Free Trade Agreement and repeal ObamaCare.\nActions to temporarily suspend visas for people coming to the United States from a number of Muslim nations are expected to come soon.\nTrump hasn’t stopped tweeting either, nor has he quit his habit of launching into new fights seemingly on a whim. Much of his first week in office has been dominated by his claims, without any evidence, that massive voter fraud cost him a popular vote victory to Hillary Clinton. On Wednesday, he announced a “major investigation” into his unsubstantiated claims about voter fraud.\nPresident Obama famously said that “elections have consequences” in explaining to Republicans why he was moving forward with a nearly $1 trillion stimulus plan and his signature healthcare bill. Now Trump is showing Washington and the world the truth of Obama’s words.\nDuring the campaign, Trump’s critics dismissed his ambitious agenda as rhetoric that he’d back away from once in office.\nIf candidate Trump beat the odds and made it to the White House, they said, The Trump Show will surely grind to a halt once he’s confronted with the realities of governing.\nIt hasn’t turned out like that at all.\n“Enough all talk, no action. We have to deliver,” Trump told Republican lawmakers Thursday. “This is our chance to achieve great and lasting change for our beloved nation.”\nI like that fact that Viceroy Mike Pence has already put Congress on alert that it is not going to be permitted to slow the God-Emperor’s onslaught. Donald Trump clearly understands what is at stake, and it appears that he is providing\na salient example to other Western leaders\n, putting some steel in the spine of hitherto unreliable leaders such as British Prime Minister Theresa May, who said “let’s stand together and halt eclipse of the West.”\nStrong words, although I would have preferred her to say that she is committed to Making England Great Again. If she was wise, she would offer Scotland another vote, encourage them to pursue independence, then have the Parliament vote on Brexit. However, given the Conservative majority in the House of Commons, that’s not actually necessary. All she really has to do is refuse to let the MPs vote freely, as the Labor Party is already committed to supporting Brexit by Labour leader Jeremy Corbyn, and Parliamentary endorsement for Brexit as well as the invocation of Article 50 will be secured.",
  "tags": [
    "media",
    "politics",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-27T16:00:00+00:00"
}