{
  "url": "https://voxday.net/2017/01/12/the-deep-states-war/",
  "scraped_at": "2025-12-18T02:14:33.008316",
  "title": "The Deep State’s war",
  "date_display": "January 12, 2017",
  "date_iso": "2017-01-12T10:11:00+00:00",
  "date_from_url": "2017-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Against <a href=\"https://theintercept.com/2017/01/11/the-deep-state-goes-to-war-with-president-elect-using-unverified-claims-as-dems-cheer/\">Donald Trump and democracy</a> in America:</p><blockquote><p> FOR MONTHS, the CIA, with unprecedented clarity, overtly threw its weight behind Hillary Clinton’s candidacy and sought to defeat Donald Trump. In August, former acting CIA Director Michael Morell announced his endorsement of Clinton in the New York Times and claimed that “Mr. Putin had recruited Mr. Trump as an unwitting agent of the Russian Federation.” The CIA and NSA director under George W. Bush, Gen. Michael Hayden, also endorsed Clinton, and went to the Washington Post to warn, in the week before the election, that “Donald Trump really does sound a lot like Vladimir Putin,” adding that Trump is “the useful fool, some naif, manipulated by Moscow, secretly held in contempt, but whose blind support is happily accepted and exploited.”</p><p>It is not hard to understand why the CIA preferred Clinton over Trump. Clinton was critical of Obama for restraining the CIA’s proxy war in Syria and was eager to expand that war, while Trump denounced it. Clinton clearly wanted a harder line than Obama took against the CIA’s long-standing foes in Moscow, while Trump wanted improved relations and greater cooperation. In general, Clinton defended and intended to extend the decadeslong international military order on which the CIA and Pentagon’s preeminence depends, while Trump — through a still-uncertain mix of instability and extremist conviction — posed a threat to it.</p><p>Whatever one’s views are on those debates, it is the democratic framework — the presidential election, the confirmation process, congressional leaders, judicial proceedings, citizen activism and protest, civil disobedience — that should determine how they are resolved. All of those policy disputes were debated out in the open; the public heard them; and Trump won. Nobody should crave the rule of Deep State overlords.</p><p>Yet craving Deep State rule is exactly what prominent Democratic operatives and media figures are doing. Any doubt about that is now dispelled. Just last week, Chuck Schumer issued a warning to Trump, telling Rachel Maddow that Trump was being “really dumb” by challenging the unelected intelligence community because of all the ways they possess to destroy those who dare to stand up to them:</p><p>And last night, many Democrats openly embraced and celebrated what was, so plainly, an attempt by the Deep State to sabotage an elected official who had defied it: ironically, its own form of blackmail.</p></blockquote><p>Greenwald warns about what will happen if the Deep State’s claims turn out to be, not only unverified, but false. <i>“Many people will conclude, with Trump’s encouragement, that large media outlets and anti-Trump factions inside the government are deploying “Fake News” to destroy him. In the eyes of many people, that will forever discredit — render impotent — future journalistic exposés that are based on actual, corroborated wrongdoing.”</i></p><p>The example he chose – Trump lawyer Michael Cohen’s trip to Prague – has already been shown to be false. So, what Greenwald should have said is that many people will <i>correctly </i>conclude that the media and the Deep State are utilizing Fake News to attack the God-Emperor Ascendant, and that they are doing so in vain.</p></div>",
  "content_text": "Against\nDonald Trump and democracy\nin America:\nFOR MONTHS, the CIA, with unprecedented clarity, overtly threw its weight behind Hillary Clinton’s candidacy and sought to defeat Donald Trump. In August, former acting CIA Director Michael Morell announced his endorsement of Clinton in the New York Times and claimed that “Mr. Putin had recruited Mr. Trump as an unwitting agent of the Russian Federation.” The CIA and NSA director under George W. Bush, Gen. Michael Hayden, also endorsed Clinton, and went to the Washington Post to warn, in the week before the election, that “Donald Trump really does sound a lot like Vladimir Putin,” adding that Trump is “the useful fool, some naif, manipulated by Moscow, secretly held in contempt, but whose blind support is happily accepted and exploited.”\nIt is not hard to understand why the CIA preferred Clinton over Trump. Clinton was critical of Obama for restraining the CIA’s proxy war in Syria and was eager to expand that war, while Trump denounced it. Clinton clearly wanted a harder line than Obama took against the CIA’s long-standing foes in Moscow, while Trump wanted improved relations and greater cooperation. In general, Clinton defended and intended to extend the decadeslong international military order on which the CIA and Pentagon’s preeminence depends, while Trump — through a still-uncertain mix of instability and extremist conviction — posed a threat to it.\nWhatever one’s views are on those debates, it is the democratic framework — the presidential election, the confirmation process, congressional leaders, judicial proceedings, citizen activism and protest, civil disobedience — that should determine how they are resolved. All of those policy disputes were debated out in the open; the public heard them; and Trump won. Nobody should crave the rule of Deep State overlords.\nYet craving Deep State rule is exactly what prominent Democratic operatives and media figures are doing. Any doubt about that is now dispelled. Just last week, Chuck Schumer issued a warning to Trump, telling Rachel Maddow that Trump was being “really dumb” by challenging the unelected intelligence community because of all the ways they possess to destroy those who dare to stand up to them:\nAnd last night, many Democrats openly embraced and celebrated what was, so plainly, an attempt by the Deep State to sabotage an elected official who had defied it: ironically, its own form of blackmail.\nGreenwald warns about what will happen if the Deep State’s claims turn out to be, not only unverified, but false.\n“Many people will conclude, with Trump’s encouragement, that large media outlets and anti-Trump factions inside the government are deploying “Fake News” to destroy him. In the eyes of many people, that will forever discredit — render impotent — future journalistic exposés that are based on actual, corroborated wrongdoing.”\nThe example he chose – Trump lawyer Michael Cohen’s trip to Prague – has already been shown to be false. So, what Greenwald should have said is that many people will\ncorrectly\nconclude that the media and the Deep State are utilizing Fake News to attack the God-Emperor Ascendant, and that they are doing so in vain.",
  "tags": [
    "conspiracy",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-12T10:11:00+00:00"
}