{
  "url": "https://voxday.net/2017/01/11/the-fear-of-woman/",
  "scraped_at": "2025-12-18T02:14:25.664671",
  "title": "The fear of woman",
  "date_display": "January 11, 2017",
  "date_iso": "2017-01-11T13:00:00+00:00",
  "date_from_url": "2017-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is the beginning of dyscivilization. Pastor Doug Wilson addresses one way in which modern Churchians <a href=\"https://dougwils.com/s7-engaging-the-culture/fear-woman-bringeth-two-three-snares.html\">have attempted to neuter the Christian man</a>.</p><blockquote><p> If over the course of a few months of pastoral counseling, say, I encounter three instances of husbands and fathers getting angry in the home, you can expect that problem to start showing up in sermons—either in sermons on anger, or passing illustrations about anger in sermons on something else. My assumption is that the instances I have found out about are the tip of the iceberg.</p><p>Now suppose—just suppose—the presenting problem in three marriages I am trying to help is the problem of lazy and idle housewives. Is there any practical way, without becoming a Pariah for the Ages, to preach on “Lazy Housewives”? I could get myself into a fit of the giggles just thinking about it.</p><p>Anything said along these lines will be immediately translated into an “attack on all women.” The violent response will insist that what you said about a small subset of women is to be understood by the entire world as an attack on all women, and the violent response will be led by women who also insist that they are every bit as rational as men, and should therefore be trusted to preach and teach and handle the text of Scripture, and they will do this when they have just finished parsing a statement that some mammals are marsupials into the clownish doctrine that all mammals are marsupials, and how dare you say that all mammals have pouches? Whales don’t have pouches, you maroon.</p><p>The reason for this reaction is that Satan hates women, and does not want them to have any pastoral care. He does not want them to have husbands who protect them. He wants them to be surrounded by feckless cowards, who refuse to tell them the truth.</p><p>He wants them to have men in their lives who would rather lie than lead.</p></blockquote><p>I don’t know if I can go along with this hateful attack on women. After all, did not Judeo-Christ say: <i>“I do not permit a husband to criticize or to assign blame to his wife; he must be silent in his servant-leadership. For Adam was formed first, then Eve.”</i><br> <i><br/></i><br> I am confident all right-thinking Churchians will agree with me that it is both wrong and sinful for a man to criticize any woman, but particularly a woman to whom he is, or was formerly, married, and that the proper role of a husband is to provide, without complaint, for his wife and his wife’s son.</br></br></p></div>",
  "content_text": "Is the beginning of dyscivilization. Pastor Doug Wilson addresses one way in which modern Churchians\nhave attempted to neuter the Christian man\n.\nIf over the course of a few months of pastoral counseling, say, I encounter three instances of husbands and fathers getting angry in the home, you can expect that problem to start showing up in sermons—either in sermons on anger, or passing illustrations about anger in sermons on something else. My assumption is that the instances I have found out about are the tip of the iceberg.\nNow suppose—just suppose—the presenting problem in three marriages I am trying to help is the problem of lazy and idle housewives. Is there any practical way, without becoming a Pariah for the Ages, to preach on “Lazy Housewives”? I could get myself into a fit of the giggles just thinking about it.\nAnything said along these lines will be immediately translated into an “attack on all women.” The violent response will insist that what you said about a small subset of women is to be understood by the entire world as an attack on all women, and the violent response will be led by women who also insist that they are every bit as rational as men, and should therefore be trusted to preach and teach and handle the text of Scripture, and they will do this when they have just finished parsing a statement that some mammals are marsupials into the clownish doctrine that all mammals are marsupials, and how dare you say that all mammals have pouches? Whales don’t have pouches, you maroon.\nThe reason for this reaction is that Satan hates women, and does not want them to have any pastoral care. He does not want them to have husbands who protect them. He wants them to be surrounded by feckless cowards, who refuse to tell them the truth.\nHe wants them to have men in their lives who would rather lie than lead.\nI don’t know if I can go along with this hateful attack on women. After all, did not Judeo-Christ say:\n“I do not permit a husband to criticize or to assign blame to his wife; he must be silent in his servant-leadership. For Adam was formed first, then Eve.”\nI am confident all right-thinking Churchians will agree with me that it is both wrong and sinful for a man to criticize any woman, but particularly a woman to whom he is, or was formerly, married, and that the proper role of a husband is to provide, without complaint, for his wife and his wife’s son.",
  "tags": [
    "Christianity",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-11T13:00:00+00:00"
}