{
  "url": "https://voxday.net/2017/01/14/they-canceled-milo/",
  "scraped_at": "2025-12-18T02:14:52.873565",
  "title": "They canceled MILO",
  "date_display": "January 14, 2017",
  "date_iso": "2017-01-14T10:53:00+00:00",
  "date_from_url": "2017-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SJWs at UC-Davis <a href=\"http://www.breitbart.com/milo/2017/01/13/reports-leftists-pull-hammers-milo-uc-davis-event-smash-windows/\">shut down MILO’s event</a> there:</p><blockquote><p> MILO’s event at the University of California, Davis has been cancelled after protesters tore down barricades and engaged in scuffles outside the venue. A camerman for ABC10 was also attacked with hot coffee. ABC-7 reports “violent interactions with protesters.” Video footage shows protesters jumping barricades and throwing them towards police.<br> <b><br/></b><br> <b>Milo Yiannopoulos</b><br> <i>My event at UC Davis tonight has been cancelled after violence from left-wing protestors. There are reports of hammers, smashed windows and barricades being torn away. The campus police can’t guarantee anyone’s safety so I’m not being allowed anywhere near the building. Stay safe, everyone.</i></br></br></br></p><p>“We were told by the chief of Davis police that they could not guarantee the safety of the students, the speaker, or the police officers if the event should go ahead. As the organisation hosting the event, we would have been held personally responsible for any harm caused as a result of its taking place. We were therefore forced to cancel the event.”<br> – Gabrielle McDowell, vice chair of the UC Davis College Republicans.</br></p></blockquote><p>SJWs are going to SJW. This is precisely why we show them no breathing room, no mercy, and no quarter. None whatsoever.</p></div>",
  "content_text": "SJWs at UC-Davis\nshut down MILO’s event\nthere:\nMILO’s event at the University of California, Davis has been cancelled after protesters tore down barricades and engaged in scuffles outside the venue. A camerman for ABC10 was also attacked with hot coffee. ABC-7 reports “violent interactions with protesters.” Video footage shows protesters jumping barricades and throwing them towards police.\nMilo Yiannopoulos\nMy event at UC Davis tonight has been cancelled after violence from left-wing protestors. There are reports of hammers, smashed windows and barricades being torn away. The campus police can’t guarantee anyone’s safety so I’m not being allowed anywhere near the building. Stay safe, everyone.\n“We were told by the chief of Davis police that they could not guarantee the safety of the students, the speaker, or the police officers if the event should go ahead. As the organisation hosting the event, we would have been held personally responsible for any harm caused as a result of its taking place. We were therefore forced to cancel the event.”\n– Gabrielle McDowell, vice chair of the UC Davis College Republicans.\nSJWs are going to SJW. This is precisely why we show them no breathing room, no mercy, and no quarter. None whatsoever.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-14T10:53:00+00:00"
}