{
  "url": "https://voxday.net/2017/01/01/traffic-report-2016/",
  "scraped_at": "2025-12-18T02:12:55.179894",
  "title": "Traffic report 2016",
  "date_display": "January 1, 2017",
  "date_iso": "2017-01-01T11:27:00+00:00",
  "date_from_url": "2017-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last year I mentioned that I believed 2016 was going to be “absolutely extraordinary”. And it turned out to be exactly that, as the God-Emperor Ascendant’s unexpected success in the early primary turned into a Super Tuesday victory that became a nomination and eventual election. More excellent authors joined Castalia House, Infogalactic and Gab were launched, I finally got some new Selenoth out the door, and Milo became the bestselling author on all of Amazon. Incredible.</p><p>In 2016, Vox Popoli had 25,817,343 pageviews and Alpha Game 5,332,285 for a total of 31,149,628<br> Google pageviews. The blogs are now running at a average rate of 85,341 daily pageviews, up from an average 56,923 last year. The running annual pageview totals are as follows:</br></p><p>2008: 3,496,757<br> 2009: 4,414,801<br> 2010: 4,827,183<br> 2011: 5,969,066<br> 2012: 7,774,074<br> 2013: 13,111,695<br> 2014: 15,693,622<br> 2015: 20,776,969<br> 2016: 31,149,628</br></br></br></br></br></br></br></br></p><p>I very much appreciate the part you have all played in making that happen. On Twitter, I picked up an additional 21,000 followers, but that has proved irrelevant since I stopped using it in favor of Gab, where I now have 14,006 followers. We’ve been making so many server-related changes at Infogalactic of late that the statistics are a bit wonky, but it already has average daily traffic in excess of 90,000 pageviews. The Burn Unit is now 173 subscribers strong and we’re hoping to increase that to 1,000 by the end of the year while making serious progress in Phase Two. Dark Lord Designs now features <a href=\"https://crypto.fashion/collections/dark-lord-designs\">11 different t-shirt and sweatshirt designs</a> in a variety of colors.</p><p>Castalia House grew from 37 titles, including 5 in print and 1 in audiobook, to 65, with 19 titles in print and 8 in audiobook. Book sales increased 54 percent, with print now accounting for 21 percent of the total. The three new editors made a big difference, although we did not get three of the books out that I anticipated releasing this time last year. This year, we’re looking forward to publishing new fiction from John C. Wright, Nick Cole, B.V. Larson and David VanDyke, Peter Grant, Mojo Mori, Stefan Molyneux, and Martin van Creveld, as well as non-fiction from Jerry Pournelle, Jeffro Johnson, Mike Cernovich, Vox Day, and Martin van Creveld.</p><p>Yes, that’s correct. Castalia House will be publishing a novel by Martin van Creveld, which I believe will be his debut novel. I think I can guarantee that the subject matter will blow everyone’s minds. Think CS Lewis meets Robert Graves. We’ll also get the Eternal Warriors trilogy out this year, in ebook and in print, as well as the three volumes that comprise the Collected Columns from my WND days. I anticipate publishing two additional non-fiction books this year, plus the complete print edition of <i>A Sea of Skulls</i>.</p><p>Thanks to all of you who continue to support VP and all of its various endeavors. Thanks to the VFM for your mindless obedience and ever-burning hatred for the SJW enemy, thanks to the Dread Ilk for your awe-inspiring loyalty, thanks to the Brainstormers for your support and advice, thanks to the Original Galaxians, Techstars, Burn Unit and Phase 2 donators for making Infogalactic possible, thanks to the Rabid Puppies for your gleeful and wanton destruction, and thanks especially to the entire Castalia House team of authors, editors, proofreaders, and volunteers.</p><p>We may not be responsible for the God-Emperor’s ascension, but we are, without question, making a substantive difference in many people’s lives around the world. As good as 2016 was – and it was very good – I anticipate an even better 2017, as more Dread Ilk begin to spread their dark wings, launch their own initiatives, and begin rampaging across the land. In closing, I will note that it’s inspiring to see John Scalzi courageously keeping his nonexistent chin up <a href=\"https://archive.is/30kFc\">despite another 11 percent decline</a> in traffic at The Most Important Blog in Science Fiction Ever, a 38 percent decline from its 2012 peak that has brought it back to late-2009 levels of traffic. So brave. Thank you for this.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://4.bp.blogspot.com/-NlQJlvZuvEc/WGjjyasMpJI/AAAAAAAACRE/9pyJI0y74g0-mvjGNp9BdORkySCmRnniwCLcB/s1600/2008-2016.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"223\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/01/2008-2016.png\" width=\"400\"/></a></div></div>",
  "content_text": "Last year I mentioned that I believed 2016 was going to be “absolutely extraordinary”. And it turned out to be exactly that, as the God-Emperor Ascendant’s unexpected success in the early primary turned into a Super Tuesday victory that became a nomination and eventual election. More excellent authors joined Castalia House, Infogalactic and Gab were launched, I finally got some new Selenoth out the door, and Milo became the bestselling author on all of Amazon. Incredible.\nIn 2016, Vox Popoli had 25,817,343 pageviews and Alpha Game 5,332,285 for a total of 31,149,628\nGoogle pageviews. The blogs are now running at a average rate of 85,341 daily pageviews, up from an average 56,923 last year. The running annual pageview totals are as follows:\n2008: 3,496,757\n2009: 4,414,801\n2010: 4,827,183\n2011: 5,969,066\n2012: 7,774,074\n2013: 13,111,695\n2014: 15,693,622\n2015: 20,776,969\n2016: 31,149,628\nI very much appreciate the part you have all played in making that happen. On Twitter, I picked up an additional 21,000 followers, but that has proved irrelevant since I stopped using it in favor of Gab, where I now have 14,006 followers. We’ve been making so many server-related changes at Infogalactic of late that the statistics are a bit wonky, but it already has average daily traffic in excess of 90,000 pageviews. The Burn Unit is now 173 subscribers strong and we’re hoping to increase that to 1,000 by the end of the year while making serious progress in Phase Two. Dark Lord Designs now features\n11 different t-shirt and sweatshirt designs\nin a variety of colors.\nCastalia House grew from 37 titles, including 5 in print and 1 in audiobook, to 65, with 19 titles in print and 8 in audiobook. Book sales increased 54 percent, with print now accounting for 21 percent of the total. The three new editors made a big difference, although we did not get three of the books out that I anticipated releasing this time last year. This year, we’re looking forward to publishing new fiction from John C. Wright, Nick Cole, B.V. Larson and David VanDyke, Peter Grant, Mojo Mori, Stefan Molyneux, and Martin van Creveld, as well as non-fiction from Jerry Pournelle, Jeffro Johnson, Mike Cernovich, Vox Day, and Martin van Creveld.\nYes, that’s correct. Castalia House will be publishing a novel by Martin van Creveld, which I believe will be his debut novel. I think I can guarantee that the subject matter will blow everyone’s minds. Think CS Lewis meets Robert Graves. We’ll also get the Eternal Warriors trilogy out this year, in ebook and in print, as well as the three volumes that comprise the Collected Columns from my WND days. I anticipate publishing two additional non-fiction books this year, plus the complete print edition of\nA Sea of Skulls\n.\nThanks to all of you who continue to support VP and all of its various endeavors. Thanks to the VFM for your mindless obedience and ever-burning hatred for the SJW enemy, thanks to the Dread Ilk for your awe-inspiring loyalty, thanks to the Brainstormers for your support and advice, thanks to the Original Galaxians, Techstars, Burn Unit and Phase 2 donators for making Infogalactic possible, thanks to the Rabid Puppies for your gleeful and wanton destruction, and thanks especially to the entire Castalia House team of authors, editors, proofreaders, and volunteers.\nWe may not be responsible for the God-Emperor’s ascension, but we are, without question, making a substantive difference in many people’s lives around the world. As good as 2016 was – and it was very good – I anticipate an even better 2017, as more Dread Ilk begin to spread their dark wings, launch their own initiatives, and begin rampaging across the land. In closing, I will note that it’s inspiring to see John Scalzi courageously keeping his nonexistent chin up\ndespite another 11 percent decline\nin traffic at The Most Important Blog in Science Fiction Ever, a 38 percent decline from its 2012 peak that has brought it back to late-2009 levels of traffic. So brave. Thank you for this.",
  "tags": [
    "Board Report",
    "ELoE"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-01-01T11:27:00+00:00"
}