{
  "url": "https://voxday.net/2017/12/24/a-christmas-parody/",
  "scraped_at": "2025-12-19T10:36:27.012307",
  "title": "A Christmas parody",
  "date_display": "December 24, 2017",
  "date_iso": "2017-12-24T21:00:00+00:00",
  "date_from_url": "2017-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve seldom been more proud of my progeny. We went to a local church tonight for a Christmas Eve service, but instead of the intellectually formidable young pastor who normally preaches there, it was a woman who apparently serves the church in some administrative capacity officiating.</p><p>As you might expect, she promptly began talking about herself, then talked about herself some more, then invited all the children to come forward in order to bask in her proximity. She proceeded to completely ignore the congregants in favor of trying to charm the children, prompting me to observe that women in religious leadership inevitably resort to either a) entertaining the children or b) sacrificing them.</p><p>After about half an hour of this performance art, one child commented that the ersatz pastor had yet to mention either God or Jesus Christ. And when she did finally get around to addressing Christmas, it was to tell the story <i>from the perspective of a 12-year-old girl living in Bethlehem</i>. For a moment, I thought I was going to have to physically restrain another child from going full “bullwhips in the Temple” on the woman; we finally left in the middle of her animated monologue about what that first Christmas would have felt like to her younger self had her she been there before any of the kids removed a shoe and winged it at her head. Nor were we the only people who walked out early.</p><p>The rest of the family was surprised when we returned home much earlier than expected, but as I pointed out, we would have had a considerably more genuine Christian experience had we simply stayed home and watched A Charlie Brown Christmas again. But for all of that, it was an early Christmas present for me in seeing first-hand how the younger generation is more than ready to go full Deus Vult on the cursed churchians.</p><p>And speaking of <a href=\"https://www.redstate.com/sarah-rumpf/2017/12/24/thats-what-christmas-is-all-about/\">the unlikely Christmas cartoon classic</a>:</p><blockquote><p>Peanuts creator Charles Schulz was a man of deep faith, and was unwavering in his insistence that the Christmas special featuring his beloved characters also feature the reason for the holiday itself: the birth of Jesus Christ.</p><p>Schulz ingeniously developed the script so that Linus’ soliloquy about angels telling the shepherds the good news about the Savior’s birth is central to the plot. There is no way to edit out the Bible verse and still have the story make sense. Tweaks have been made to the special over the years — minor edits to color and sound effects, references to sponsor Coca-Cola removed after the original broadcast — but Jesus always remained.</p><p>And so we have this wonderful annual reminder of the true meaning of Christmas, delivered by a child’s voice in an animated cartoon.</p></blockquote><p><i>Glory to God in the highest, and on earth peace and goodwill towards men. </i></p></div>",
  "content_text": "I’ve seldom been more proud of my progeny. We went to a local church tonight for a Christmas Eve service, but instead of the intellectually formidable young pastor who normally preaches there, it was a woman who apparently serves the church in some administrative capacity officiating.\nAs you might expect, she promptly began talking about herself, then talked about herself some more, then invited all the children to come forward in order to bask in her proximity. She proceeded to completely ignore the congregants in favor of trying to charm the children, prompting me to observe that women in religious leadership inevitably resort to either a) entertaining the children or b) sacrificing them.\nAfter about half an hour of this performance art, one child commented that the ersatz pastor had yet to mention either God or Jesus Christ. And when she did finally get around to addressing Christmas, it was to tell the story\nfrom the perspective of a 12-year-old girl living in Bethlehem\n. For a moment, I thought I was going to have to physically restrain another child from going full “bullwhips in the Temple” on the woman; we finally left in the middle of her animated monologue about what that first Christmas would have felt like to her younger self had her she been there before any of the kids removed a shoe and winged it at her head. Nor were we the only people who walked out early.\nThe rest of the family was surprised when we returned home much earlier than expected, but as I pointed out, we would have had a considerably more genuine Christian experience had we simply stayed home and watched A Charlie Brown Christmas again. But for all of that, it was an early Christmas present for me in seeing first-hand how the younger generation is more than ready to go full Deus Vult on the cursed churchians.\nAnd speaking of\nthe unlikely Christmas cartoon classic\n:\nPeanuts creator Charles Schulz was a man of deep faith, and was unwavering in his insistence that the Christmas special featuring his beloved characters also feature the reason for the holiday itself: the birth of Jesus Christ.\nSchulz ingeniously developed the script so that Linus’ soliloquy about angels telling the shepherds the good news about the Savior’s birth is central to the plot. There is no way to edit out the Bible verse and still have the story make sense. Tweaks have been made to the special over the years — minor edits to color and sound effects, references to sponsor Coca-Cola removed after the original broadcast — but Jesus always remained.\nAnd so we have this wonderful annual reminder of the true meaning of Christmas, delivered by a child’s voice in an animated cartoon.\nGlory to God in the highest, and on earth peace and goodwill towards men.",
  "tags": [
    "Christianity",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-24T21:00:00+00:00"
}