{
  "url": "https://voxday.net/2017/12/05/a-coverup-at-the-opera/",
  "scraped_at": "2025-12-19T10:33:56.089102",
  "title": "A coverup at the opera",
  "date_display": "December 5, 2017",
  "date_iso": "2017-12-05T13:00:00+00:00",
  "date_from_url": "2017-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that (((James Levine)))’s co-ethnics have been protecting <a href=\"https://archive.fo/4XGK8\">the Metropolitan Opera’s abusive homosexual conductor</a> and paying off his victims for decades.</p><blockquote><p>As the Metropolitan Opera reeled from the suspension of its longtime conductor James Levine over sexual misconduct accusations, a fourth man came forward Monday saying that Mr. Levine had sexually abused him decades ago, when the man was a student.</p><p>Met officials scrambled to deal with the cascade of accusations, emailing donors to assure them that the Met will be taking “all appropriate actions” — even as the opera house came under sharp criticism for not investigating Mr. Levine after learning in 2016 of a police inquiry into a report of sexual abuse against him.</p><p>The Ravinia Festival also announced Monday night that it had “severed all ties” with Mr. Levine, its former music director, who had planned to begin a five-year term as conductor laureate in the summer of 2018. “We are deeply troubled and saddened by the allegations and sympathize with everyone who has been hurt,” the festival said in a statement.</p><p>The man who made the new accusations Monday, Albin Ifsich, said he had been abused by Mr. Levine beginning in 1968, when Mr. Ifsich was 20 and attending the Meadow Brook School of Music, a summer program in Michigan where Mr. Levine was a rising star on the faculty. He said that the abuse continued for several years after he joined a tight-knit clique of young musicians who followed Mr. Levine in Cleveland and later New York….</p><p>In the email to Met donors, Ann Ziff, the chairwoman of the Met’s board of directors, and Judith-Ann Corrente, its president and chief executive officer, wrote that they had been “deeply disturbed” by the reports about Mr. Levine. A recipient of the email shared it with The Times on Monday night.</p><p>“Together with general manager Peter Gelb, we are committed to a complete investigation of the allegations against Mr. Levine, and we would like to assure you and all of the Met’s loyal donors that the company will be taking all appropriate actions,” the two Met officials wrote in the email. “We also want to assure you that we will never lose focus on our artistic mission to continue to deliver performances of the highest artistic level to our audience.”</p><p>Some opera lovers and others took to social media to question whether the Met knew about troubling behavior by Mr. Levine and why Mr. Gelb and other leaders did not investigate him before now, given disturbing rumors about his private life that had long circulated in music circles.</p><p>Mr. Gelb, in an interview, dismissed rumors circulating online that the Met had reached settlements in the past with the families of abuse victims as untrue.</p><p>“Since I’ve been at the Met there has not been a single instance of somebody coming forward to make a complaint, ever, about Levine in recent Met history,” Mr. Gelb said. “And if you talk to the previous general managers about their watches, they say the same.”</p><p>“There have been no complaints and no settlements, and this has been verified by the Met’s finance office, our development office,” he said.</p></blockquote><p>Perhaps Mr. Gelb is telling the truth. Or perhaps he is playing semantic games with the word “recent”. Certainly there is contradictory information being spread around Twitter and elsewhere. From the timeline of David Hines‏ @hradzka:</p><blockquote><p>For those who missed it, James Levine — music prodigy, acclaimed conductor, music director 1976–2016; artistic director 1986–2004; music director emeritus 2016–present — had a scandal break involving abuse of a 15yo boy. Except if you had any serious New York classical music scene people on your TL, you saw them *freaking the hell out* because they knew how huge the story was. There were lots and lots and lots and lots of rumors about Levine and boys, but nobody knew anything actionable because nobody knew any victims.</p><p>One of the top music execs in the country told me 20 years ago when I asked “it’s all true, there have been millions paid in settlements.” I believed him. Levine has led an extremely sordid life that would have landed anyone else in prison long ago. Because the people who did know were either paid off, or doing the paying off.</p><p>One of the great conductors in the world and yet, at some point, he stopped conducting in Europe. Didn’t anyone wonder why? That’s a rare thing. I always assumed it was his health, but a friend with close ties to the industry said earlier tonight on Facebook that he’d heard Levine had actually been banned from visiting England.</p><p>That is absolutely true. And it’s not the only place. The shit he did in Munich when he was there. Ernst Rohm level stuff. Basically, there’s no way anybody in a position of power at the Met during his tenure didn’t know, and if the payouts were at “millions of dollars” *twenty years ago…*</p></blockquote><p>So, which is more probable, the decades of rumors are completely false and have no basis in fact or this is yet another example of one (((gentleman))) in a position of power covering for another (((one)))? Ask yourself this question: if the Metropolitan Opera is telling the truth, how is it possible that so many accusers from so long ago have come forward so quickly, and Levine has only been suspended? It appears his (((defenders))) are <i>still </i>trying to protect him, even as they claim that he’s already stepped down, he’s old news, and actually, they aren’t entirely sure to whom you might even be referring.</p><p>The cracks in the Pizzagate wall continue to grow. Note that director (((Bryan Singer))) went inexplicably AWOL from his current film project before <a href=\"https://archive.fo/eCBsD\">being fired from it yesterday</a>. The filthy creatures know their lies and their behavior is going to be exposed sooner or later and they are beginning to panic. Given the way in which past hints have turned out to be correct, it appears everyone from Steven Spielberg and George Lucas to Jared Leto, James Franco, and Don Henley will be going down, and that’s just the world of entertainment.</p></div>",
  "content_text": "It appears that (((James Levine)))’s co-ethnics have been protecting\nthe Metropolitan Opera’s abusive homosexual conductor\nand paying off his victims for decades.\nAs the Metropolitan Opera reeled from the suspension of its longtime conductor James Levine over sexual misconduct accusations, a fourth man came forward Monday saying that Mr. Levine had sexually abused him decades ago, when the man was a student.\nMet officials scrambled to deal with the cascade of accusations, emailing donors to assure them that the Met will be taking “all appropriate actions” — even as the opera house came under sharp criticism for not investigating Mr. Levine after learning in 2016 of a police inquiry into a report of sexual abuse against him.\nThe Ravinia Festival also announced Monday night that it had “severed all ties” with Mr. Levine, its former music director, who had planned to begin a five-year term as conductor laureate in the summer of 2018. “We are deeply troubled and saddened by the allegations and sympathize with everyone who has been hurt,” the festival said in a statement.\nThe man who made the new accusations Monday, Albin Ifsich, said he had been abused by Mr. Levine beginning in 1968, when Mr. Ifsich was 20 and attending the Meadow Brook School of Music, a summer program in Michigan where Mr. Levine was a rising star on the faculty. He said that the abuse continued for several years after he joined a tight-knit clique of young musicians who followed Mr. Levine in Cleveland and later New York….\nIn the email to Met donors, Ann Ziff, the chairwoman of the Met’s board of directors, and Judith-Ann Corrente, its president and chief executive officer, wrote that they had been “deeply disturbed” by the reports about Mr. Levine. A recipient of the email shared it with The Times on Monday night.\n“Together with general manager Peter Gelb, we are committed to a complete investigation of the allegations against Mr. Levine, and we would like to assure you and all of the Met’s loyal donors that the company will be taking all appropriate actions,” the two Met officials wrote in the email. “We also want to assure you that we will never lose focus on our artistic mission to continue to deliver performances of the highest artistic level to our audience.”\nSome opera lovers and others took to social media to question whether the Met knew about troubling behavior by Mr. Levine and why Mr. Gelb and other leaders did not investigate him before now, given disturbing rumors about his private life that had long circulated in music circles.\nMr. Gelb, in an interview, dismissed rumors circulating online that the Met had reached settlements in the past with the families of abuse victims as untrue.\n“Since I’ve been at the Met there has not been a single instance of somebody coming forward to make a complaint, ever, about Levine in recent Met history,” Mr. Gelb said. “And if you talk to the previous general managers about their watches, they say the same.”\n“There have been no complaints and no settlements, and this has been verified by the Met’s finance office, our development office,” he said.\nPerhaps Mr. Gelb is telling the truth. Or perhaps he is playing semantic games with the word “recent”. Certainly there is contradictory information being spread around Twitter and elsewhere. From the timeline of David Hines‏ @hradzka:\nFor those who missed it, James Levine — music prodigy, acclaimed conductor, music director 1976–2016; artistic director 1986–2004; music director emeritus 2016–present — had a scandal break involving abuse of a 15yo boy. Except if you had any serious New York classical music scene people on your TL, you saw them *freaking the hell out* because they knew how huge the story was. There were lots and lots and lots and lots of rumors about Levine and boys, but nobody knew anything actionable because nobody knew any victims.\nOne of the top music execs in the country told me 20 years ago when I asked “it’s all true, there have been millions paid in settlements.” I believed him. Levine has led an extremely sordid life that would have landed anyone else in prison long ago. Because the people who did know were either paid off, or doing the paying off.\nOne of the great conductors in the world and yet, at some point, he stopped conducting in Europe. Didn’t anyone wonder why? That’s a rare thing. I always assumed it was his health, but a friend with close ties to the industry said earlier tonight on Facebook that he’d heard Levine had actually been banned from visiting England.\nThat is absolutely true. And it’s not the only place. The shit he did in Munich when he was there. Ernst Rohm level stuff. Basically, there’s no way anybody in a position of power at the Met during his tenure didn’t know, and if the payouts were at “millions of dollars” *twenty years ago…*\nSo, which is more probable, the decades of rumors are completely false and have no basis in fact or this is yet another example of one (((gentleman))) in a position of power covering for another (((one)))? Ask yourself this question: if the Metropolitan Opera is telling the truth, how is it possible that so many accusers from so long ago have come forward so quickly, and Levine has only been suspended? It appears his (((defenders))) are\nstill\ntrying to protect him, even as they claim that he’s already stepped down, he’s old news, and actually, they aren’t entirely sure to whom you might even be referring.\nThe cracks in the Pizzagate wall continue to grow. Note that director (((Bryan Singer))) went inexplicably AWOL from his current film project before\nbeing fired from it yesterday\n. The filthy creatures know their lies and their behavior is going to be exposed sooner or later and they are beginning to panic. Given the way in which past hints have turned out to be correct, it appears everyone from Steven Spielberg and George Lucas to Jared Leto, James Franco, and Don Henley will be going down, and that’s just the world of entertainment.",
  "tags": [
    "freakshow",
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-05T13:00:00+00:00"
}