{
  "url": "https://voxday.net/2017/12/07/a-masterpiece-in-progress/",
  "scraped_at": "2025-12-19T10:34:15.611016",
  "title": "A masterpiece in progress",
  "date_display": "December 7, 2017",
  "date_iso": "2017-12-07T18:00:00+00:00",
  "date_from_url": "2017-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Professor Steve Keen, aka The Greatest Living Economist, has graciously permitted me to quote some of the very first words from his <i>Principles of Political Economy</i>, which Castalia House will be publishing sometime in the next five years:</p><blockquote><p><b>The True Father of Economics</b></p><p><i>Labor without Energy is a Corpse;</i><br><i>Capital without Energy is a Statue</i></br></p><p>Economics went astray from the very first sentence of Adam Smith’s <i>Wealth of Nations</i> in 1776:</p><p>“The annual labour of every nation”, Smith asserted, “is the fund which originally supplies it with all the necessaries and conveniences of life which it annually consumes, and which consist always, either in the immediate produce of that labour, or in what is purchased with that produce from other nations.”</p><p>This paragraph mimicked the structure, and even the cadence (though not the brevity), of the opening sentence of Richard Cantillon’s 1730 treatise <i>Essai sur la Nature du Commerce en Général</i> (which Smith read). However, Smith made one crucial substitution: he asserted that “Labor … is the fund” from which our wealth springs, whereas Cantillon asserted that it was Land:</p><p>“Land”, Cantillon began, “is the source or matter from which all wealth is drawn; man’s labor provides the form for its production, and wealth in itself is nothing but the food, conveniences, and pleasures of life.”</p><p>Both these assertions are strictly false. The true source of the wealth that humanity has generated from production is neither Labor nor Land, but the Energy that humanity’s production systems harness and turn into useful work (now known as “Exergy”). However, Smith’s assertion is irredeemably false, whereas Cantillon’s merely needs generalization to make it consistent with the fundamental laws of the universe known as the Laws of Thermodynamics.</p><p>These Laws are still poorly known by economists, which in part explains why economic theory has managed to be in conflict with them for so long. Illustrating why this is so, and why it is crucial, will take time and effort on your part to understand them (if you do not already). But the fact that no theory that contradicts them can be taken seriously was stated eloquently by the physicist Arthur Eddington in his 1928 book for lay readers <i>The Nature of the Physical World</i>:</p><p><i>The law that entropy always increases—the second law of thermodynamics—holds, I think, the supreme position among the laws of Nature. If someone points out to you that your pet theory of the universe is in disagreement with Maxwell’s equations—then so much the worse for Maxwell’s equations. If it is found to be contradicted by observations—well, these experimentalists do bungle things sometimes. But if your theory is found to be against the second law of thermodynamics I can give you no hope; there is nothing for it but to collapse in deepest humiliation.</i></p><p>On this undeniable basis, the only pre-2016 economic theory of production which does not have to “collapse in deepest humiliation” is that of Richard Cantillon and the School to which he belonged, the Physiocrats.</p></blockquote><p>That’s right. Steve Keen is taking economics all the way back to Cantillon and building upon that as a much stronger foundation! Now do you understand why I am so enthusiastic about a book that isn’t even written yet? This is <i>exactly</i> the sort of book that Castalia House was founded to publish.</p></div>",
  "content_text": "Professor Steve Keen, aka The Greatest Living Economist, has graciously permitted me to quote some of the very first words from his\nPrinciples of Political Economy\n, which Castalia House will be publishing sometime in the next five years:\nThe True Father of Economics\nLabor without Energy is a Corpse;\nCapital without Energy is a Statue\nEconomics went astray from the very first sentence of Adam Smith’s\nWealth of Nations\nin 1776:\n“The annual labour of every nation”, Smith asserted, “is the fund which originally supplies it with all the necessaries and conveniences of life which it annually consumes, and which consist always, either in the immediate produce of that labour, or in what is purchased with that produce from other nations.”\nThis paragraph mimicked the structure, and even the cadence (though not the brevity), of the opening sentence of Richard Cantillon’s 1730 treatise\nEssai sur la Nature du Commerce en Général\n(which Smith read). However, Smith made one crucial substitution: he asserted that “Labor … is the fund” from which our wealth springs, whereas Cantillon asserted that it was Land:\n“Land”, Cantillon began, “is the source or matter from which all wealth is drawn; man’s labor provides the form for its production, and wealth in itself is nothing but the food, conveniences, and pleasures of life.”\nBoth these assertions are strictly false. The true source of the wealth that humanity has generated from production is neither Labor nor Land, but the Energy that humanity’s production systems harness and turn into useful work (now known as “Exergy”). However, Smith’s assertion is irredeemably false, whereas Cantillon’s merely needs generalization to make it consistent with the fundamental laws of the universe known as the Laws of Thermodynamics.\nThese Laws are still poorly known by economists, which in part explains why economic theory has managed to be in conflict with them for so long. Illustrating why this is so, and why it is crucial, will take time and effort on your part to understand them (if you do not already). But the fact that no theory that contradicts them can be taken seriously was stated eloquently by the physicist Arthur Eddington in his 1928 book for lay readers\nThe Nature of the Physical World\n:\nThe law that entropy always increases—the second law of thermodynamics—holds, I think, the supreme position among the laws of Nature. If someone points out to you that your pet theory of the universe is in disagreement with Maxwell’s equations—then so much the worse for Maxwell’s equations. If it is found to be contradicted by observations—well, these experimentalists do bungle things sometimes. But if your theory is found to be against the second law of thermodynamics I can give you no hope; there is nothing for it but to collapse in deepest humiliation.\nOn this undeniable basis, the only pre-2016 economic theory of production which does not have to “collapse in deepest humiliation” is that of Richard Cantillon and the School to which he belonged, the Physiocrats.\nThat’s right. Steve Keen is taking economics all the way back to Cantillon and building upon that as a much stronger foundation! Now do you understand why I am so enthusiastic about a book that isn’t even written yet? This is\nexactly\nthe sort of book that Castalia House was founded to publish.",
  "tags": [
    "CastaliaHouse",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-07T18:00:00+00:00"
}