{
  "url": "https://voxday.net/2017/12/14/amazon-goes-after-fake-reviewers/",
  "scraped_at": "2025-12-19T10:35:02.167751",
  "title": "Amazon goes after fake reviewers",
  "date_display": "December 14, 2017",
  "date_iso": "2017-12-14T10:55:00+00:00",
  "date_from_url": "2017-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amanda at Mad Genius Club alerts us to <a href=\"https://madgeniusclub.com/2017/12/10/amazon-review-policy-change-more/\">a major change in policy</a> at Amazon:</p><blockquote><p>Since Amazon first opened its virtual doors, there have been concerns about reviews. Not just for books but for all the products sold through its site. It is no secret that authors have paid for reviews — and some still do. Or that there have been fake accounts set up to give sock puppet reviews. There have been stories about sellers and manufacturers planting fake reviews as well, all in the hopes of bolstering their product rankings and ratings. From time to time, Amazon has taken steps to combat this trend. One of the last times they did it, they brought in a weighted review system. This one differentiates between “verified purchasers” and those who did not buy the product viz Amazon. Now there is a new policy in place, once that should help — at least until a new way around it is found.</p><p>Simply put, Amazon now requires you to purchase a minimum of $50 worth of books or other products before you can leave a review or answer questions about a product. These purchases, and it looks like it is a cumulative amount, must be purchased via credit card or debit card — gift cards won’t count. This means someone can’t set up a fake account, buy themselves a gift card and use it to get around the policy.<br><i><br/></i><i>Eligibility</i><br><i>To contribute to Customer Reviews or Customer Answers, Spark, or to follow other contributors, you must have spent at least $50 on Amazon.com using a valid credit or debit card. Prime subscriptions and promotional discounts don’t qualify towards the $50 minimum. In addition, to contribute to Spark you must also have a paid Prime subscription (free trials do no qualify). You do not need to meet this requirement to read content posted by other contributors or post Customer Questions, create or modify Profile pages, Lists, or Registries</i></br></br></p><p>Whether this change will work in the long run, I don’t know. But, for now, I welcome it.</p></blockquote><p>As a frequent target of fake reviewers, I think this is fantastic. It should work brilliantly, because fake reviewers almost invariably try to hide their identities. Now that reviews will be tied to actual Amazon accounts, it’s very easy for Amazon to see whether the reviewer has a pattern of reviewing books that he has actually bought or not as well as giving Amazon the ability to deny the fake reviewer future access to Amazon’s retail channel if he makes a habit of regularly posting fake reviews or is the recipient of a large number of complaints about abusive reviews.</p><p>It was pretty clear that Amazon was already beginning to target fake reviews earlier this year. One SJW who left a fake review of SJWAL back in June even complained about <a href=\"https://www.amazon.com/gp/customer-reviews/R1ZCZ30QFJAOGP/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B014GMBUR4\">his previous fake review being removed</a> by Amazon.</p><blockquote class=\"tr_bq\"><p>Interesting that VD presents himself as an enemy of the “thought police”–he has already had my review taken down once, simply because it was negative. SAD!</p></blockquote><p>First, I did not take the review down, Amazon did. And they did so, not because it was negative, but because it was obviously <i>fake</i>. Demonstrating, once more, that SJWs always lie. And given that SJWADD, published in October, has no fake reviews while the most recent fake reviews for SJWAL and ATOB are both from October 2017, I conclude that it was Amazon’s more aggressive policing of fake reviews this fall that led to this new policy. I also think Amanda’s wish for Kindle Unlimited subscribers to be permitted to post reviews is unwise because in my experience, I have already seen how some KU subscribers will download a book they have no intention of reading in order to be able to post a fake review that is marked as a Verified Purchase.</p><p>Since Amazon can see exactly how many pages a KU subscriber has read of the book he nominally reviewed, I have no doubt that they saw enough reviews being posted by KU non-readers to decide that KU subscribers cannot be trusted to post honest reviews. Amazon also appears to understand how permitting KU subscribers to post reviews creates a disincentive for authors to put their books in Kindle Select.</p><p>Amazon’s decision is an excellent application of Taleb’s “skin in the game” and I expect it will significantly improve the quality of Amazon’s reviews.</p><p>Speaking of Amazon, now that I’m able to return to finishing a certain extended edition, I’ve decided to celebrate by making <b><i><a href=\"http://amzn.to/1THmHo5\">A THRONE OF BONES</a></i></b> free on Amazon tomorrow and the rest of this weekend. And if you’ve already read it, then perhaps you should consider getting <a href=\"http://amzn.to/2h9Emd9\">the hardcover</a> for your bookshelves.</p></div>",
  "content_text": "Amanda at Mad Genius Club alerts us to\na major change in policy\nat Amazon:\nSince Amazon first opened its virtual doors, there have been concerns about reviews. Not just for books but for all the products sold through its site. It is no secret that authors have paid for reviews — and some still do. Or that there have been fake accounts set up to give sock puppet reviews. There have been stories about sellers and manufacturers planting fake reviews as well, all in the hopes of bolstering their product rankings and ratings. From time to time, Amazon has taken steps to combat this trend. One of the last times they did it, they brought in a weighted review system. This one differentiates between “verified purchasers” and those who did not buy the product viz Amazon. Now there is a new policy in place, once that should help — at least until a new way around it is found.\nSimply put, Amazon now requires you to purchase a minimum of $50 worth of books or other products before you can leave a review or answer questions about a product. These purchases, and it looks like it is a cumulative amount, must be purchased via credit card or debit card — gift cards won’t count. This means someone can’t set up a fake account, buy themselves a gift card and use it to get around the policy.\nEligibility\nTo contribute to Customer Reviews or Customer Answers, Spark, or to follow other contributors, you must have spent at least $50 on Amazon.com using a valid credit or debit card. Prime subscriptions and promotional discounts don’t qualify towards the $50 minimum. In addition, to contribute to Spark you must also have a paid Prime subscription (free trials do no qualify). You do not need to meet this requirement to read content posted by other contributors or post Customer Questions, create or modify Profile pages, Lists, or Registries\nWhether this change will work in the long run, I don’t know. But, for now, I welcome it.\nAs a frequent target of fake reviewers, I think this is fantastic. It should work brilliantly, because fake reviewers almost invariably try to hide their identities. Now that reviews will be tied to actual Amazon accounts, it’s very easy for Amazon to see whether the reviewer has a pattern of reviewing books that he has actually bought or not as well as giving Amazon the ability to deny the fake reviewer future access to Amazon’s retail channel if he makes a habit of regularly posting fake reviews or is the recipient of a large number of complaints about abusive reviews.\nIt was pretty clear that Amazon was already beginning to target fake reviews earlier this year. One SJW who left a fake review of SJWAL back in June even complained about\nhis previous fake review being removed\nby Amazon.\nInteresting that VD presents himself as an enemy of the “thought police”–he has already had my review taken down once, simply because it was negative. SAD!\nFirst, I did not take the review down, Amazon did. And they did so, not because it was negative, but because it was obviously\nfake\n. Demonstrating, once more, that SJWs always lie. And given that SJWADD, published in October, has no fake reviews while the most recent fake reviews for SJWAL and ATOB are both from October 2017, I conclude that it was Amazon’s more aggressive policing of fake reviews this fall that led to this new policy. I also think Amanda’s wish for Kindle Unlimited subscribers to be permitted to post reviews is unwise because in my experience, I have already seen how some KU subscribers will download a book they have no intention of reading in order to be able to post a fake review that is marked as a Verified Purchase.\nSince Amazon can see exactly how many pages a KU subscriber has read of the book he nominally reviewed, I have no doubt that they saw enough reviews being posted by KU non-readers to decide that KU subscribers cannot be trusted to post honest reviews. Amazon also appears to understand how permitting KU subscribers to post reviews creates a disincentive for authors to put their books in Kindle Select.\nAmazon’s decision is an excellent application of Taleb’s “skin in the game” and I expect it will significantly improve the quality of Amazon’s reviews.\nSpeaking of Amazon, now that I’m able to return to finishing a certain extended edition, I’ve decided to celebrate by making\nA THRONE OF BONES\nfree on Amazon tomorrow and the rest of this weekend. And if you’ve already read it, then perhaps you should consider getting\nthe hardcover\nfor your bookshelves.",
  "tags": [
    "BookReview",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-14T10:55:00+00:00"
}