{
  "url": "https://voxday.net/2017/12/27/beyond-improbable/",
  "scraped_at": "2025-12-19T10:36:43.385850",
  "title": "Beyond improbable",
  "date_display": "December 27, 2017",
  "date_iso": "2017-12-27T19:03:00+00:00",
  "date_from_url": "2017-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, as you may recall, the Christmas adverts in the UK were <a href=\"http://voxday.blogspot.com/2017/11/happy-sjwmas.html\">suspiciously interethnic this year</a>. Six of the major retailers, John Lewis, Marks &amp; Spencer, Debenham’s, Sainesbury and Tesco, all just happened to feature interethnic couples who, despite the fairly complex web of interethnic relations tracked by Her Majesty’s Government, all just happened to be of the black man-white woman variety.</p><p>Now, I am fully accustomed to the usual excuse-mongering about how interethnicity simply reflects modern society and how anyone who finds this to be suspicious, unlikely, improbable, or indeed, anything less than <i>inspiring </i>is a dirty, double-dyed racist who is unfit to live in any civilized society. Nevertheless, I thought that I would run the numbers to see just how likely it would be for six major commercials to just happen to feature that particular interethnic combination.</p><p>There are nine recognized interethnic combinations that are capable of describing the full range of couples shown in the commercials. They are:</p><ul><li>White and Black Caribbean with White British</li><li>White and Black Caribbean with Other White</li><li>White and Black African with White British</li><li>White and Black African with Other White</li><li> African with White British</li><li>African with Other White</li><li>Caribbean with White British</li><li>Caribbean with White Other</li><li>Other Black with White British</li></ul><p>The grand total of individuals on the right column <a href=\"https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/marriagecohabitationandcivilpartnerships/articles/whatdoesthe2011censustellusaboutinterethnicrelationships/2014-07-03#most-common-inter-ethnic-relationships\">involved in such relationships in the United Kingdom </a>is 156,000. Since the statistics are not divided by sex, but the actors in the commercials are, we must divide that number by two; observe we’re keeping the number of sexes to two rather than, say, 37, in order to keep this reasonably simple. That gives us 78,000.</p><p>However, the total number of UK individuals involved in relationships is 25,555,555. Dividing 78k by 25.6M gives us 0.3 percent. So, there is a one in 327 chance that such a BM/WW couple would randomly appear in an advert. However, we are dealing with not one, not two, but SIX commercials.</p><p>Multiplied out, my calculator does not display that many zeroes, but to put it another way, there is a one in 1,237,350,745,449,354 chance that these particular adverts just happened to reflect reality. That is one in 1.2 quadrillion.</p><p>Which is the mathematical way of saying, “why yes, that is indeed SJW convergence I espy.”</p></div>",
  "content_text": "So, as you may recall, the Christmas adverts in the UK were\nsuspiciously interethnic this year\n. Six of the major retailers, John Lewis, Marks & Spencer, Debenham’s, Sainesbury and Tesco, all just happened to feature interethnic couples who, despite the fairly complex web of interethnic relations tracked by Her Majesty’s Government, all just happened to be of the black man-white woman variety.\nNow, I am fully accustomed to the usual excuse-mongering about how interethnicity simply reflects modern society and how anyone who finds this to be suspicious, unlikely, improbable, or indeed, anything less than\ninspiring\nis a dirty, double-dyed racist who is unfit to live in any civilized society. Nevertheless, I thought that I would run the numbers to see just how likely it would be for six major commercials to just happen to feature that particular interethnic combination.\nThere are nine recognized interethnic combinations that are capable of describing the full range of couples shown in the commercials. They are:\nWhite and Black Caribbean with White British\nWhite and Black Caribbean with Other White\nWhite and Black African with White British\nWhite and Black African with Other White\nAfrican with White British\nAfrican with Other White\nCaribbean with White British\nCaribbean with White Other\nOther Black with White British\nThe grand total of individuals on the right column\ninvolved in such relationships in the United Kingdom\nis 156,000. Since the statistics are not divided by sex, but the actors in the commercials are, we must divide that number by two; observe we’re keeping the number of sexes to two rather than, say, 37, in order to keep this reasonably simple. That gives us 78,000.\nHowever, the total number of UK individuals involved in relationships is 25,555,555. Dividing 78k by 25.6M gives us 0.3 percent. So, there is a one in 327 chance that such a BM/WW couple would randomly appear in an advert. However, we are dealing with not one, not two, but SIX commercials.\nMultiplied out, my calculator does not display that many zeroes, but to put it another way, there is a one in 1,237,350,745,449,354 chance that these particular adverts just happened to reflect reality. That is one in 1.2 quadrillion.\nWhich is the mathematical way of saying, “why yes, that is indeed SJW convergence I espy.”",
  "tags": [
    "corpocracy",
    "SJW",
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-27T19:03:00+00:00"
}