{
  "url": "https://voxday.net/2017/12/10/castalia-direct-print-editions/",
  "scraped_at": "2025-12-19T10:34:32.478647",
  "title": "Castalia Direct print editions",
  "date_display": "December 10, 2017",
  "date_iso": "2017-12-10T12:44:00+00:00",
  "date_from_url": "2017-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"float: right; margin: 18px; position: relative; width: 185px;\"><a href=\"http://aerbook.com/maker/productcard-166614-1875.html?addtocart=9780689829833\" rel=\"noopener\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://aerbook.s3.amazonaws.com/covers/medium/9780689829833.jpg\" style=\"margin: 0px; width: 185px;\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://aerbook.s3.amazonaws.com/covers/medium/9780689829833.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"margin: 0px; width: 185px;\"/></a></div><p>Just in time for Christmas, it is now possible to order print editions <a href=\"https://www.aerbook.com/store/castalia/Castalia_House/6072\">directly from Castalia House</a> through our partnership with Aerbook. At least, it is if you happen to live in the USA. So, those of you who have indicated that you’d like an alternative to ordering from Amazon can now do so, and will even, in most circumstances, get a discount from $1 to $3 dollars, depending upon the book in question.</p><p>For example, the trade paperback of <b><i><a href=\"https://aerbook.com/maker/productcard-3080605-1875.html\">A THRONE OF BONES</a></i></b> is $25.99 instead of the usual $27.99. You will also be able to purchase books from both my Reading List and my Recommended Books List, although that will take a little time to put together. The shipping costs are based on your location, but they are reasonable. In a very few cases, such as <a href=\"https://aerbook.com/maker/productcard-2789879-1875.html\"><i>The Ames Archives</i> by Peter Grant</a>, the price is actually a little higher than the retail price because we set a lower than usual retail price and discount structure.</p><p>Not all of our books are in the system yet, but we’re working getting them in there. Castalia authors who are interested in selling their print editions from their own sites should get in touch, as we can put together widgets for your site that will pull the listings directly from the <a href=\"https://www.aerbook.com/store/castalia\">Castalia Direct Bookstore</a>, including your books that <a href=\"https://www.aerbook.com/store/castalia/John_C_Wright/6077\">we don’t publish</a>. And, of course, this will be another way to buy the 24-page comics that we’ll be putting on the market next year.</p><p>UPDATE: For those who might be interested, I’ve added <a href=\"https://www.aerbook.com/store/castalia/Japanese_Literature/6078\">a Japanese literature section</a> which includes many of the books I’ve read in the last three years. And no, I have no idea why six different editions of <i>Kokoro </i>were available but not a single one of <i>Sanshiro</i>.</p></div>",
  "content_text": "Just in time for Christmas, it is now possible to order print editions\ndirectly from Castalia House\nthrough our partnership with Aerbook. At least, it is if you happen to live in the USA. So, those of you who have indicated that you’d like an alternative to ordering from Amazon can now do so, and will even, in most circumstances, get a discount from $1 to $3 dollars, depending upon the book in question.\nFor example, the trade paperback of\nA THRONE OF BONES\nis $25.99 instead of the usual $27.99. You will also be able to purchase books from both my Reading List and my Recommended Books List, although that will take a little time to put together. The shipping costs are based on your location, but they are reasonable. In a very few cases, such as\nThe Ames Archives\nby Peter Grant\n, the price is actually a little higher than the retail price because we set a lower than usual retail price and discount structure.\nNot all of our books are in the system yet, but we’re working getting them in there. Castalia authors who are interested in selling their print editions from their own sites should get in touch, as we can put together widgets for your site that will pull the listings directly from the\nCastalia Direct Bookstore\n, including your books that\nwe don’t publish\n. And, of course, this will be another way to buy the 24-page comics that we’ll be putting on the market next year.\nUPDATE: For those who might be interested, I’ve added\na Japanese literature section\nwhich includes many of the books I’ve read in the last three years. And no, I have no idea why six different editions of\nKokoro\nwere available but not a single one of\nSanshiro\n.",
  "tags": [
    "books",
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-10T12:44:00+00:00"
}