{
  "url": "https://voxday.net/2017/12/08/covering-for-the-monsters/",
  "scraped_at": "2025-12-19T10:34:23.441171",
  "title": "Covering for the monsters",
  "date_display": "December 8, 2017",
  "date_iso": "2017-12-08T16:00:00+00:00",
  "date_from_url": "2017-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Inadvertently and out of good intentions, I have no doubt. But women like Claire Berlinski <a href=\"https://www.the-american-interest.com/2017/12/06/the-warlock-hunt/\">are covering for the monsters</a> all the same:</p><blockquote><p>We are a culture historically disposed to moral panics and sexual hysterias. Not long ago we firmly convinced ourselves that our children were being ritually raped by Satanists. In recent years, especially, we have become prone to replacing complex thought with shallow slogans. We live in times of extremism, and black-and-white thinking. We should have the self-awareness to suspect that the events of recent weeks may not be an aspect of our growing enlightenment, but rather our growing enamorment with extremism.</p><p>We should certainly realize by now that a moral panic mixed with an internet mob is a menace. When the mob descends on a target of prominence, it’s as good as a death sentence, socially and professionally. None of us lead lives so faultless that we cannot be targeted this way. “Show me the man, and I’ll show you the crime.”</p><p>Your computer can be hacked. Do you want to live in the kind of paranoid society where everyone wonders—Who’s next? To whom is it safe to speak freely? What would this joke sound like in a deposition? Do you think only the men who have done something truly foul are at risk? Don’t kid yourself. Once this starts, it doesn’t stop. The Perp Walk awaits us all.</p><p>Given the events of recent weeks, we can be certain of this: From now on, men with any instinct for self-preservation will cease to speak of anything personal, anything sexual, in our presence. They will make no bawdy jokes when we are listening. They will adopt in our presence great deference to our exquisite sensitivity and frailty. Many women seem positively joyful at this prospect. The Revolution has at last been achieved! But how could this be the world we want? Isn’t this the world we escaped?</p><p>Who could blame a man who does not enjoy the company of women under these circumstances, who would just rather not have women in the workplace at all? This is a world in which the Mike Pence rule—“Never be alone with a woman”—seems eminently sensible. Such a world is not good for women, however—as many women were quick to point out when we learned of the Mike Pence rule. Our success and advancement relies upon the personal and informal relationships we have with our colleagues and supervisors. But who, in this climate, could blame a venerable Oxford don for refusing to take the risk of teaching a young woman, one-on-one, with no witnesses? Mine was the first generation of women allowed the privilege of unchaperoned tutorials with Balliol’s dons. Will mine also be the last?</p></blockquote><p>Yes, and it should be the last. The grand feminist experiment in sexual equality has failed, brutally. It failed faster than communism. It failed faster than civic nationalism. It failed faster than multiculturalism. Feminism is literally the dumbest, most destructive ideology that has ever been invented, which is no surprise because it was invented by the most neurotic women history has ever known.</p><p>And the more we learn about (((Hollywood))) and Washington and Berkeley and London, the more it is clear that not only were those “moral panics” and “sexual hysterias” justified, they were merely scratching the surface of a diseased evil that runs much deeper and wider under the surface of society than most normal Americans realized. Consider the following passage from <i>The Last Closet</i>, in which one member of science-fiction fandom describes the reaction of the Berkeley science-fiction community to the public behavior of Marion Zimmer Bradley’s husband.</p><blockquote><p>At first Berkeley was indifferent to Walter’s sex life. This gradually began to change. There were two main causes for this. At a GGFS meeting at the S’s, S walked into her son’s bedroom—age 13—to find him in bed with Walter with Walter’s arm around him. They were watching TV. (Walter is incredible.)  S wasn’t about to take this. She didn’t make a scene at the time, but from then on, someone else was anti-Walter. Thenceforth the S kids were under instructions to retire into their room and barricade the door with furniture whenever Walter was in the house. They did too. S wanted to ban Walter from the house entirely but Alva felt great reluctance to reject any fan.</p><p>Most people were rather amused by this incident, feeling that the kid could say “No” and even if he said “Yes” the experience probably wouldn’t hurt him any. After all, Walter is so child-like himself that it would be just as if the kid were playing around with another kid. And quite apart from the sexual connotations some people were outraged that an adult could prefer the society of children to that of adults, as Walter does.</p><p>The second cause was Walter’s sex play with 3-year old P. He had her trained up to the point where she would take off her clothes the minute she saw him. He would then “rub her down” and all that. I recall one occasion—a fairly large gathering at the Nelsons — in which he also used a pencil, rubbing the eraser back and forth in the general area of the vagina, not quite masturbating her.</p></blockquote><p>What I have learned from editing Moira Greyland’s book is that where there is sulfuric smoke of this nature, there is not merely a fire, there is a raging inferno. What is really worse for women, sacrificing a few career opportunities for the evolutionary dead ends in the workplace or sacrificing women as young as three to the depraved appetites of sexual predators?</p></div>",
  "content_text": "Inadvertently and out of good intentions, I have no doubt. But women like Claire Berlinski\nare covering for the monsters\nall the same:\nWe are a culture historically disposed to moral panics and sexual hysterias. Not long ago we firmly convinced ourselves that our children were being ritually raped by Satanists. In recent years, especially, we have become prone to replacing complex thought with shallow slogans. We live in times of extremism, and black-and-white thinking. We should have the self-awareness to suspect that the events of recent weeks may not be an aspect of our growing enlightenment, but rather our growing enamorment with extremism.\nWe should certainly realize by now that a moral panic mixed with an internet mob is a menace. When the mob descends on a target of prominence, it’s as good as a death sentence, socially and professionally. None of us lead lives so faultless that we cannot be targeted this way. “Show me the man, and I’ll show you the crime.”\nYour computer can be hacked. Do you want to live in the kind of paranoid society where everyone wonders—Who’s next? To whom is it safe to speak freely? What would this joke sound like in a deposition? Do you think only the men who have done something truly foul are at risk? Don’t kid yourself. Once this starts, it doesn’t stop. The Perp Walk awaits us all.\nGiven the events of recent weeks, we can be certain of this: From now on, men with any instinct for self-preservation will cease to speak of anything personal, anything sexual, in our presence. They will make no bawdy jokes when we are listening. They will adopt in our presence great deference to our exquisite sensitivity and frailty. Many women seem positively joyful at this prospect. The Revolution has at last been achieved! But how could this be the world we want? Isn’t this the world we escaped?\nWho could blame a man who does not enjoy the company of women under these circumstances, who would just rather not have women in the workplace at all? This is a world in which the Mike Pence rule—“Never be alone with a woman”—seems eminently sensible. Such a world is not good for women, however—as many women were quick to point out when we learned of the Mike Pence rule. Our success and advancement relies upon the personal and informal relationships we have with our colleagues and supervisors. But who, in this climate, could blame a venerable Oxford don for refusing to take the risk of teaching a young woman, one-on-one, with no witnesses? Mine was the first generation of women allowed the privilege of unchaperoned tutorials with Balliol’s dons. Will mine also be the last?\nYes, and it should be the last. The grand feminist experiment in sexual equality has failed, brutally. It failed faster than communism. It failed faster than civic nationalism. It failed faster than multiculturalism. Feminism is literally the dumbest, most destructive ideology that has ever been invented, which is no surprise because it was invented by the most neurotic women history has ever known.\nAnd the more we learn about (((Hollywood))) and Washington and Berkeley and London, the more it is clear that not only were those “moral panics” and “sexual hysterias” justified, they were merely scratching the surface of a diseased evil that runs much deeper and wider under the surface of society than most normal Americans realized. Consider the following passage from\nThe Last Closet\n, in which one member of science-fiction fandom describes the reaction of the Berkeley science-fiction community to the public behavior of Marion Zimmer Bradley’s husband.\nAt first Berkeley was indifferent to Walter’s sex life. This gradually began to change. There were two main causes for this. At a GGFS meeting at the S’s, S walked into her son’s bedroom—age 13—to find him in bed with Walter with Walter’s arm around him. They were watching TV. (Walter is incredible.)  S wasn’t about to take this. She didn’t make a scene at the time, but from then on, someone else was anti-Walter. Thenceforth the S kids were under instructions to retire into their room and barricade the door with furniture whenever Walter was in the house. They did too. S wanted to ban Walter from the house entirely but Alva felt great reluctance to reject any fan.\nMost people were rather amused by this incident, feeling that the kid could say “No” and even if he said “Yes” the experience probably wouldn’t hurt him any. After all, Walter is so child-like himself that it would be just as if the kid were playing around with another kid. And quite apart from the sexual connotations some people were outraged that an adult could prefer the society of children to that of adults, as Walter does.\nThe second cause was Walter’s sex play with 3-year old P. He had her trained up to the point where she would take off her clothes the minute she saw him. He would then “rub her down” and all that. I recall one occasion—a fairly large gathering at the Nelsons — in which he also used a pencil, rubbing the eraser back and forth in the general area of the vagina, not quite masturbating her.\nWhat I have learned from editing Moira Greyland’s book is that where there is sulfuric smoke of this nature, there is not merely a fire, there is a raging inferno. What is really worse for women, sacrificing a few career opportunities for the evolutionary dead ends in the workplace or sacrificing women as young as three to the depraved appetites of sexual predators?",
  "tags": [
    "society",
    "trainwreck",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-08T16:00:00+00:00"
}