{
  "url": "https://voxday.net/2017/12/31/credit-where-credit-is-due-2/",
  "scraped_at": "2025-12-19T10:37:07.388019",
  "title": "Credit where credit is due",
  "date_display": "December 31, 2017",
  "date_iso": "2017-12-31T13:21:00+00:00",
  "date_from_url": "2017-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always embarrassing when writers who have never worked a single day in their lives at any business that actually makes anything try to <a href=\"http://www.nationalreview.com/article/454942/donald-trump-policy-victories-republicans-who-deserves-credit\">opine on matters related to management</a>:</p><blockquote><p>Conservative writer Roger Simon argues that all “remaining Never Trumpers” must apologize for being wrong about the president. He chalks up Trump’s “astoundingly successful” first year to the fact the president is a “quick study.”</p><p>But what evidence is there that Trump has actually learned the art of presidential management?</p><p>Aside from the mandatory flattery required of Republican elected officials, there’s remarkably little testimony that Trump has involved himself in the process of governing. Tax reform was carried across the finish line by the GOP congressional leadership. Net neutrality was repealed by independent Republicans at the Federal Communications Commission. Foreign policy is a more mixed bag. If the president deserves credit for the defeat of Islamic State, it’s because he let “the generals” do their thing. On the other hand, credit (or blame) for recognizing Jerusalem as the capital of Israel or pulling out of the Trans-Pacific Partnership and the Paris accord on climate change certainly goes to him.</p><p>In general, it seems to me that Trump’s success (such as it is) is less attributable to sudden mastery of the issues than to staying out of the way of rank-and-file Republican policymakers, activists, and bureaucrats.</p></blockquote><p>What Goldberg fails to recognize is that staying out of the way of competent subordinates is the key to the art of all successful executive management. Donald Trump is the exact opposite of <strike>Richard Nixon</strike> Lyndon Johnson, who didn’t hesitate to get on the phone with a lieutenant in the field in Vietnam in setting a ridiculous new standard for micromanagement in foreign policy.</p><p>Micromanagers like LBJ reliably fail for the obvious reason that no one can know everything, master everything, prioritize everything, and be everywhere at once. Only Reagan had similarly developed delegation skills, but he did not choose his subordinates as well as Trump has, and more importantly, Reagan did not hold his subordinates accountable the way Trump does.</p><p>None of this should be a surprise. Back in November 2016, I observed, <i>“The God-Emperor is absolutely ruthless when it comes to taking action on underperforming team members. He doesn’t care how it looks, he just shuffles the deck and draws.”</i></p><p>That’s why I expected, and continue to expect, the Trump presidency to be vastly more successful than anyone anticipated. It’s why I expect him to easily win re-election in 2020. The great CEOs have always been able to master the delicate balance between staying out of their subordinates’ way and stepping in to deal with matters themselves when personal intervention becomes necessary. And lacking business experience as he does, Jonah completely fails to understand Trump’s demonstrated mastery of this balance, as he absurdly credits <i>the Republican establishment </i>for Trump’s success.</p><blockquote class=\"tr_bq\"><p>To listen to Trump’s cheerleaders, the biggest obstacle to conservative victories is the party establishment, when in reality it looks more like it’s running the show.</p></blockquote><p>Not only is the GOPe not running the show anymore, it has been largely broken to heel by Trump, as evidenced by the Republican Congress’s sudden ability to pass tax reform after repeatedly failing to do anything. The large number of pre-2018 retirements and resignations will further demonstrate that the GOPe is no longer in control, as will the success of Trump-endorsed candidates in the Congressional and Senatorial elections.</p></div>",
  "content_text": "It’s always embarrassing when writers who have never worked a single day in their lives at any business that actually makes anything try to\nopine on matters related to management\n:\nConservative writer Roger Simon argues that all “remaining Never Trumpers” must apologize for being wrong about the president. He chalks up Trump’s “astoundingly successful” first year to the fact the president is a “quick study.”\nBut what evidence is there that Trump has actually learned the art of presidential management?\nAside from the mandatory flattery required of Republican elected officials, there’s remarkably little testimony that Trump has involved himself in the process of governing. Tax reform was carried across the finish line by the GOP congressional leadership. Net neutrality was repealed by independent Republicans at the Federal Communications Commission. Foreign policy is a more mixed bag. If the president deserves credit for the defeat of Islamic State, it’s because he let “the generals” do their thing. On the other hand, credit (or blame) for recognizing Jerusalem as the capital of Israel or pulling out of the Trans-Pacific Partnership and the Paris accord on climate change certainly goes to him.\nIn general, it seems to me that Trump’s success (such as it is) is less attributable to sudden mastery of the issues than to staying out of the way of rank-and-file Republican policymakers, activists, and bureaucrats.\nWhat Goldberg fails to recognize is that staying out of the way of competent subordinates is the key to the art of all successful executive management. Donald Trump is the exact opposite of\nRichard Nixon\nLyndon Johnson, who didn’t hesitate to get on the phone with a lieutenant in the field in Vietnam in setting a ridiculous new standard for micromanagement in foreign policy.\nMicromanagers like LBJ reliably fail for the obvious reason that no one can know everything, master everything, prioritize everything, and be everywhere at once. Only Reagan had similarly developed delegation skills, but he did not choose his subordinates as well as Trump has, and more importantly, Reagan did not hold his subordinates accountable the way Trump does.\nNone of this should be a surprise. Back in November 2016, I observed,\n“The God-Emperor is absolutely ruthless when it comes to taking action on underperforming team members. He doesn’t care how it looks, he just shuffles the deck and draws.”\nThat’s why I expected, and continue to expect, the Trump presidency to be vastly more successful than anyone anticipated. It’s why I expect him to easily win re-election in 2020. The great CEOs have always been able to master the delicate balance between staying out of their subordinates’ way and stepping in to deal with matters themselves when personal intervention becomes necessary. And lacking business experience as he does, Jonah completely fails to understand Trump’s demonstrated mastery of this balance, as he absurdly credits\nthe Republican establishment\nfor Trump’s success.\nTo listen to Trump’s cheerleaders, the biggest obstacle to conservative victories is the party establishment, when in reality it looks more like it’s running the show.\nNot only is the GOPe not running the show anymore, it has been largely broken to heel by Trump, as evidenced by the Republican Congress’s sudden ability to pass tax reform after repeatedly failing to do anything. The large number of pre-2018 retirements and resignations will further demonstrate that the GOPe is no longer in control, as will the success of Trump-endorsed candidates in the Congressional and Senatorial elections.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-31T13:21:00+00:00"
}