{
  "url": "https://voxday.net/2017/12/05/deal-with-it-commies/",
  "scraped_at": "2025-12-19T10:33:54.596723",
  "title": "Deal with it, commies",
  "date_display": "December 5, 2017",
  "date_iso": "2017-12-05T09:54:00+00:00",
  "date_from_url": "2017-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lefties are deeply upset to discover that their labor is of so little value that they can be literally replaced for nothing:</p><blockquote><p>#LAWeekly fired their staff in favor of unpaid “contributors.” If you are an aspiring writer, and you submit to them, you are insuring it becomes impossible to make a living in this field.<br>– Jennifer Wright‏</br></p><p>As with music, just because you love something so much that you’d do it for free, doesn’t mean that you don’t deserve to be paid for your hard work that makes other people money.<br>– Zack Stentz</br></p></blockquote><p>See, the problem is supply and demand. The labor theory of value is false. There is no intrinsic value in one’s labor that merits automatic compensation. In cases such as this, the value of the channel greatly exceeds the value of the indistinguishable content flowing through it.</p><p>We have firsthand experience of this. We have a perfectly functioning store that sells – or as is increasingly the case, sold – ebooks that are superior to the ebooks that Amazon sells. Unlike Amazon, we don’t DRM the epubs sold there, whereas Amazon converts exactly the same epub into a proprietary format that can only be read on a Kindle device or application. The price is exactly the same.</p><p>And yet, we sell literally 100 times more books through Amazon because that is how people almost uniformly prefer to buy them. In fact, we have learned that we even do better giving Amazon exclusive distribution rights and permitting them to give books away to its KU subscribers and then compensate us for those who actually read them at about one-half the page rate that would be equivalent to a book sale than we do selling our books on our own store. More than<i> three times </i>better<i>.</i></p><p>Of course, this preference for the dominant channel will sooner or later lead to the usual monopoly-related problems, which is why we will continue to maintain our digital storefront. But as long as the channel is more valuable than the content, content providers will be at risk by those willing to provide cheaper, or even free, substitutes. And the more that content is readily available, the less one is going to be compensated for it.</p><p>Steve Keen may have disproved the inescapability of the Law of Supply &amp; Demand, but that doesn’t mean it is never relevant, only that it may not always be applicable to a given situation. But in this particular case, there is clearly more demand for free labor than there is for expensive labor. The writers and musicians affected would be wise to contemplate why their work is so easily replaced by free substitutes; the irony is that the free music available today is often superior in quality to that for which one must pay up front.</p><div style=\"text-align: left;\">Case in point: Erock’s instrumental version of Let It Go is a joyful thing of beauty that surpasses Leo Moracchioli’s <a href=\"https://www.youtube.com/watch?v=so49WpSj9bo\">very good metal cover</a>, and both of them are far more interesting than the Disney-published version available in the stores. I don’t know that I’ve ever seen a better combination of technical pyrotechnics with staying completely within the melodic framework of a song. Note to aspiring young guitarists: if you want to make an unforgettable impression on the girls in your town, <i>learn to play this.</i></div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><iframe allow=\"encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" gesture=\"media\" height=\"280\" src=\"https://www.youtube.com/embed/usPoug7NcZo\" width=\"512\"></iframe></div></div>",
  "content_text": "Lefties are deeply upset to discover that their labor is of so little value that they can be literally replaced for nothing:\n#LAWeekly fired their staff in favor of unpaid “contributors.” If you are an aspiring writer, and you submit to them, you are insuring it becomes impossible to make a living in this field.\n– Jennifer Wright‏\nAs with music, just because you love something so much that you’d do it for free, doesn’t mean that you don’t deserve to be paid for your hard work that makes other people money.\n– Zack Stentz\nSee, the problem is supply and demand. The labor theory of value is false. There is no intrinsic value in one’s labor that merits automatic compensation. In cases such as this, the value of the channel greatly exceeds the value of the indistinguishable content flowing through it.\nWe have firsthand experience of this. We have a perfectly functioning store that sells – or as is increasingly the case, sold – ebooks that are superior to the ebooks that Amazon sells. Unlike Amazon, we don’t DRM the epubs sold there, whereas Amazon converts exactly the same epub into a proprietary format that can only be read on a Kindle device or application. The price is exactly the same.\nAnd yet, we sell literally 100 times more books through Amazon because that is how people almost uniformly prefer to buy them. In fact, we have learned that we even do better giving Amazon exclusive distribution rights and permitting them to give books away to its KU subscribers and then compensate us for those who actually read them at about one-half the page rate that would be equivalent to a book sale than we do selling our books on our own store. More than\nthree times\nbetter\n.\nOf course, this preference for the dominant channel will sooner or later lead to the usual monopoly-related problems, which is why we will continue to maintain our digital storefront. But as long as the channel is more valuable than the content, content providers will be at risk by those willing to provide cheaper, or even free, substitutes. And the more that content is readily available, the less one is going to be compensated for it.\nSteve Keen may have disproved the inescapability of the Law of Supply & Demand, but that doesn’t mean it is never relevant, only that it may not always be applicable to a given situation. But in this particular case, there is clearly more demand for free labor than there is for expensive labor. The writers and musicians affected would be wise to contemplate why their work is so easily replaced by free substitutes; the irony is that the free music available today is often superior in quality to that for which one must pay up front.\nCase in point: Erock’s instrumental version of Let It Go is a joyful thing of beauty that surpasses Leo Moracchioli’s\nvery good metal cover\n, and both of them are far more interesting than the Disney-published version available in the stores. I don’t know that I’ve ever seen a better combination of technical pyrotechnics with staying completely within the melodic framework of a song. Note to aspiring young guitarists: if you want to make an unforgettable impression on the girls in your town,\nlearn to play this.",
  "tags": [
    "economics",
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-05T09:54:00+00:00"
}