{
  "url": "https://voxday.net/2017/12/14/denying-the-faith/",
  "scraped_at": "2025-12-19T10:35:08.087994",
  "title": "Denying the faith",
  "date_display": "December 14, 2017",
  "date_iso": "2017-12-14T21:00:00+00:00",
  "date_from_url": "2017-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Churchian cucks destroying their families with their virtue-signaling little know <a href=\"https://alphagameplan.blogspot.com/2017/12/worse-than-unbelievers.html\">the evil they are doing</a>:</p><blockquote><p>I heard of a very good, decent family who regularly shared how they were called to have “an open house.” They hosted events, had people over for lunch, and enjoyed great discussions around the table with interesting people. All decent things to do.</p><p>Yet their desire to be hospitable went farther than it should have. They also rented a room to a foreign college student (they viewed this as a ministry opportunity), took in homeless men and let people in need stay in their home for months or even years at a time.</p><p>And their children paid for it. One of the sons was deliberately exposed to homosexual pornography as a young teenager thanks to their international renter (who, after leaving the house, came out as gay much to the Christian family’s surprise). Another of the family’s daughters left home early since she was uncomfortable with how one of the homeless men the parents helped had a habit of showing up in the yard outside her bedroom window.</p><p>Another time I heard the story of a Christian family who allowed a Russian exchange student to stay with them as a chance to “witness.” The night before he returned to Russia, he raped their teenage daughter.</p><p>Yet another Christian parent sent his young brain-damaged daughter to a special school program where she was raped by two boys who rode with her on the bus.</p><p>With tears in his eyes, he “forgave them.”</p><p>To hell with that.</p></blockquote><p>The Bible is very clear that a man’s responsibility is<i> to his family first</i>, then to his ministry. That’s why Paul praised those with the gift of celibacy, because they are able to prioritize their service to God. But one is not doing right, or serving God, by putting one’s ministry ahead of one’s family. As Lee Jackson reminds us, those doing so are actually denying the faith.</p><p>One more thing. It is not your place to forgive a crime committed against your child. To the contrary, you should be begging forgiveness for your failure to protect them.</p></div>",
  "content_text": "The Churchian cucks destroying their families with their virtue-signaling little know\nthe evil they are doing\n:\nI heard of a very good, decent family who regularly shared how they were called to have “an open house.” They hosted events, had people over for lunch, and enjoyed great discussions around the table with interesting people. All decent things to do.\nYet their desire to be hospitable went farther than it should have. They also rented a room to a foreign college student (they viewed this as a ministry opportunity), took in homeless men and let people in need stay in their home for months or even years at a time.\nAnd their children paid for it. One of the sons was deliberately exposed to homosexual pornography as a young teenager thanks to their international renter (who, after leaving the house, came out as gay much to the Christian family’s surprise). Another of the family’s daughters left home early since she was uncomfortable with how one of the homeless men the parents helped had a habit of showing up in the yard outside her bedroom window.\nAnother time I heard the story of a Christian family who allowed a Russian exchange student to stay with them as a chance to “witness.” The night before he returned to Russia, he raped their teenage daughter.\nYet another Christian parent sent his young brain-damaged daughter to a special school program where she was raped by two boys who rode with her on the bus.\nWith tears in his eyes, he “forgave them.”\nTo hell with that.\nThe Bible is very clear that a man’s responsibility is\nto his family first\n, then to his ministry. That’s why Paul praised those with the gift of celibacy, because they are able to prioritize their service to God. But one is not doing right, or serving God, by putting one’s ministry ahead of one’s family. As Lee Jackson reminds us, those doing so are actually denying the faith.\nOne more thing. It is not your place to forgive a crime committed against your child. To the contrary, you should be begging forgiveness for your failure to protect them.",
  "tags": [
    "AlphaGame",
    "Christianity",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-14T21:00:00+00:00"
}