{
  "url": "https://voxday.net/2017/12/15/equality-means-the-girls-must-win/",
  "scraped_at": "2025-12-19T10:35:11.040706",
  "title": "“Equality” means the girls must win",
  "date_display": "December 15, 2017",
  "date_iso": "2017-12-15T13:00:00+00:00",
  "date_from_url": "2017-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AD relates a tale of competition, such as it is:</p><blockquote><p>Last year, my homeschooled son participated in a team puzzle-solving competition at the local college.  He had a blast, and when the alert came out for the event this year, he was the first to sign up.  My daughter wasn’t old enough last year, but was the second person to sign up this year.</p><p>The woman running the groups this year contacted my wife last night to inform her that my son had been cut from the team.  “Why?”</p><p>The woman admitted that my son had done quite well last year, had not upset or annoyed anyone, contributed heavily, and was definitely an asset to the team.  After quite a bit of beating around the bush, the woman finally admitted that the rest of the team was entirely female and she was afraid that they “might feel uncomfortable with one boy in the group.”</p><p>“So, you’re telling me that you cut my son from the team solely because he is MALE?”</p><p>“Um…well…er…yes, I guess.”</p><p>The punch line…the woman asked if my daughter would mind being the only girl on an otherwise all-male team.</p><p>The woman delayed talking to us (due to “bad email address, sorry”) until it was far too late to form a team of our own.</p><p>My son quit on the spot, knowing he was not welcome.  My daughter immediately quit in solidarity with her brother.  Both are looking forward to next year, when they form their own separate homeschoolers team and get even for the insult.</p></blockquote><p>That’s the spirit. And this is an example of why no man should ever be chivalrous in competition with women. Crush the opposite sex without mercy every time they dare to step foot on a level playing field. Because far too few of them have any intention of playing fair with men and boys.</p><p>I’ve mentioned before that when I coached a boy’s soccer team, we once played in a tournament against all-girls team that was blatantly favored by the referee, so much so that my players were being called for <i>their </i>fouls and even had a goal disallowed for a nonexistent foul AFTER the goal was scored. And this was <i>after </i>I’d taken out all my starters since we were up 3-0.</p><p>So, I taught the opposing coach, the referee, and my boys a lesson by putting all of the starters back in and telling them to score at will. I don’t remember what the final score was, but it was in the teens and the girls never even came close to scoring. The boys were brutally unmerciful; both the starters and the subs were <i>furious </i>and each unnecessary goal was cheered as if  it was the winning one. The lesson was this: those who don’t play fair don’t merit any sporting mercy.</p><p>I don’t have any objection to genuinely gifted girls who really need to play with the boys in order to fully develop their skills. My favorite player on one of Ender’s teams a few years ago is now a junior international and will probably be called up to the women’s national team within the next two years. But in 42 years of playing soccer, she is the only girl I ever met who merited that sort of accommodation.</p><p>Anyhow, I hope the reader’s homeschooled team goes in and crushes the competition, particularly the team that wouldn’t have him.</p></div>",
  "content_text": "AD relates a tale of competition, such as it is:\nLast year, my homeschooled son participated in a team puzzle-solving competition at the local college.  He had a blast, and when the alert came out for the event this year, he was the first to sign up.  My daughter wasn’t old enough last year, but was the second person to sign up this year.\nThe woman running the groups this year contacted my wife last night to inform her that my son had been cut from the team.  “Why?”\nThe woman admitted that my son had done quite well last year, had not upset or annoyed anyone, contributed heavily, and was definitely an asset to the team.  After quite a bit of beating around the bush, the woman finally admitted that the rest of the team was entirely female and she was afraid that they “might feel uncomfortable with one boy in the group.”\n“So, you’re telling me that you cut my son from the team solely because he is MALE?”\n“Um…well…er…yes, I guess.”\nThe punch line…the woman asked if my daughter would mind being the only girl on an otherwise all-male team.\nThe woman delayed talking to us (due to “bad email address, sorry”) until it was far too late to form a team of our own.\nMy son quit on the spot, knowing he was not welcome.  My daughter immediately quit in solidarity with her brother.  Both are looking forward to next year, when they form their own separate homeschoolers team and get even for the insult.\nThat’s the spirit. And this is an example of why no man should ever be chivalrous in competition with women. Crush the opposite sex without mercy every time they dare to step foot on a level playing field. Because far too few of them have any intention of playing fair with men and boys.\nI’ve mentioned before that when I coached a boy’s soccer team, we once played in a tournament against all-girls team that was blatantly favored by the referee, so much so that my players were being called for\ntheir\nfouls and even had a goal disallowed for a nonexistent foul AFTER the goal was scored. And this was\nafter\nI’d taken out all my starters since we were up 3-0.\nSo, I taught the opposing coach, the referee, and my boys a lesson by putting all of the starters back in and telling them to score at will. I don’t remember what the final score was, but it was in the teens and the girls never even came close to scoring. The boys were brutally unmerciful; both the starters and the subs were\nfurious\nand each unnecessary goal was cheered as if  it was the winning one. The lesson was this: those who don’t play fair don’t merit any sporting mercy.\nI don’t have any objection to genuinely gifted girls who really need to play with the boys in order to fully develop their skills. My favorite player on one of Ender’s teams a few years ago is now a junior international and will probably be called up to the women’s national team within the next two years. But in 42 years of playing soccer, she is the only girl I ever met who merited that sort of accommodation.\nAnyhow, I hope the reader’s homeschooled team goes in and crushes the competition, particularly the team that wouldn’t have him.",
  "tags": [
    "mailvox",
    "sports",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-15T13:00:00+00:00"
}