{
  "url": "https://voxday.net/2017/12/16/excerpt-a-throne-of-bones/",
  "scraped_at": "2025-12-19T10:35:15.492462",
  "title": "EXCERPT: A Throne of Bones",
  "date_display": "December 16, 2017",
  "date_iso": "2017-12-16T00:54:00+00:00",
  "date_from_url": "2017-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Here is an excerpt from the 924-page epic fantasy <a href=\"http://amzn.to/1THmHo5\">A THRONE OF BONES</a>. Which, by the way, is a free download today and the rest of the weekend. Also available in <a href=\"http://amzn.to/2h9Emd9\">hardcover</a> and <a href=\"http://amzn.to/2gfyzU2\">paperback</a>.</i></p><p>The ebb and flow of battle always seemed to follow a similar pattern, Corvus thought as he watched the ragged ranks of the goblin army march into what he intended to be the field of slaughter. A less experienced commander might be impressed by the huge quantity of armed troops as they moved, apparently inexorably, across the very meadow over which he’d ridden the day before. There were an awful lot of them, between four and five to every man of his, but the numbers were almost unimportant once a critical mass was achieved.</p><p>It was surprising how little actual killing occurred while the outcome of the battle was still in doubt, when the two front lines crashed into each other and sword met with sword. No, most of the bloodshed would take place after one side broke, its will shattered by the iron resolve of the enemy, and what had moments before been an army dissolved into a fleeing crowd of frightened individuals.</p><p>That was the moment for which every general worth his salt planned, anticipated, and feared. It was the moment in which every decision, every purchase, every piece of equipment, every hour of weapons drill and unit maneuver, was thrown into the cauldron of Fate and the bitch-goddess stirred up her bloody witches brew, seasoned it according to her whim, and served it to you. You had no choice but to swallow it.</p><p>He was determined that his would not be the side that broke.</p><p>At the moment when he caught sight of the sleek sinuous forms of the wolves slinking through the tall grass below, it was too late to regret splitting his two cavalry wings. It was too late to wonder if he should have stationed more of the artillery on the heights to his right instead of behind him in the center. It was too late to consider if he should have positioned the second and fifth cohorts on either side of the first cohort instead of the fourth and sixth.</p><p>That was the worst part of being a general. Everyone else in the legion, from the tribunes to the lowliest legionary, believed you were in command. Only you knew you weren’t. In truth, you were little more than a helpless observer, watching as the events you’d earlier put in motion played themselves out without much in the way of guidance from you or respect for your intentions. It wasn’t what he did in the heat of battle, but what he had done to prepare for it, that mattered.</p><p>And yet, he was entirely confident that it would be the goblin commander who would be drinking Fortune’s bitter draught tonight. Legio XVII might be green, but they damn sure had stouter hearts than goblins, who, despite the beating drums that urged them forward, continued to slow their march as they came closer to the Amorran lines.</p><p>The goblin advance slowed, then slowed some more, and finally came to a complete halt about fifty paces from the ground where the first cohort stood, steadfast, flanked on either side by the fourth and sixth cohorts. The drums stopped.</p><p>Corvus heard the primus pilus shout, a loud cry that was echoed by five hundred voices chanting in response. The centuries in the neighboring cohorts began to pick it up as well. A thousand voices chanted a single word, then slammed the butt of their spears twice on the ground, then repeated it again. Then two thousand voices, then three thousand.</p><p>“Legion!” Thump-thump. “Legion!”</p><p>Men stomped their feet, clapped their hands, slammed their gauntleted fists into their steel breastplates. The very hill upon which Corvus stood seemed to shake with the echoes, but not as much as the goblins. Their front ranks were visibly quivering with fear.</p><p>“Legion!” Thump-thump. “Legion!”</p><p>It sounded as if his men were summoning some ancient demon of war—no, an army of demons—from the bowels of the earth.</p><p>“Legion!” Thump-thump. “Legion!”</p><p>Corvus nodded slowly, pleased. No one, least of all the enemy ranks lined up against them, would imagine these were men who had never seen battle before. Saturnius’s centurions had done their work well.</p><p>He glanced to the left. As expected, the goblin commander had divided his wolves between the two flanks, and their right wing looked no more eager to rush forward into the teeth of the infantry fortifying the thin line of horse than their foot was to come to grips with the cohorts in the center. On the right, he saw a desultory exchange of missiles was taking place, but it was nothing to cause him any concern for the safety of two young tribunes he had stationed atop the hill there.</p><p>But if the goblin masses were intimidated, their commander was not. His response was spectacular, if not particularly effective. A strange humming filled the air, gradually swelling until the Amorran chanting began to break up as the legionaries wondered what it was. Then, with the sound of a thunderclap, purple fire arched from the goblin rear over their lines and exploded in the midst of the first cohort. He saw men fly into the air, heard other men scream, burned by the shaman’s fire. The goblin drums began to thunder again.</p><p>“Ballistari!” Saturnius turned around and screamed at the optio who commanded the artillery. “Cassabus, find me that devil-spawned bugger and flatten him now!”</p><p>Corvus squinted and attempt to see where the shaman might be, but he shrugged and gave it up after a moment. The sharpest eyes in the legion were assigned to the artillery squads, and if they couldn’t spot the goblin, his aging eyes certainly wouldn’t be up to the task either.</p><p>Saturnius’s face turned redder with each of the two subsequent magical blasts, both of which ripped small holes in the Amorran ranks. But despite their alarming effects on the morale of the troops forced to stand there helplessly enduring the magical barrage, Corvus knew the shaman wasn’t doing them any significant harm.</p><p>“They have him, legate!” Cassabus called down to an irate Saturnius. “First cohort, loose!”</p><p>There was a loud thrumming sound and the shriek of much-abused wood as the supports absorbed the force of heavy slings slamming down, one after the other.</p><p>Ten huge rocks sailed over the heads of the Amorran infantry—and the greater part of the goblin infantry as well. All crashed down into a remarkably small area and left little more than smears of green ruin behind them as they bounced and tumbled to an eventual halt well behind the enemy’s rear.</p><p>“Well done, Cassabus,” Corvus shouted to the optio. “Commend your men!”</p><p>He doubted the man could hear him over the creaking of the onagers as the ballistarii rewound their huge coils, but Cassabus saw Corvus was shouting at him, and the optio raised his fist triumphantly.</p><p>“That’ll do for the bastard,” Saturnius said with satisfaction, his complexion gradually returning to something more resembling its customary color. “And it should give any of his little bastard friends second thoughts about throwing that devil’s fire about willy-nilly.”</p><p>“Who needs Michaelines when you’ve got mules?” Corvus laughed at the sour expression on the legate’s face. No matter how well things were going, Saturnius was always foul-tempered throughout the course of a battle.</p><p>“At least we’ve got a few lads who can hit the broad side of a barn,” Saturnius said. “But I don’t know what those bloody scorpios thought they were trying to hit.”</p><p>Corvus looked behind them, momentarily confused. Sure enough, four of the scorpio squads were reloading their giant crossbows. He hadn’t even realized they had loosed their bolts.</p><p>A horn sounded, and a great purple cloud appeared out of nowhere before exploding harmlessly well over the heads of the first cohort.</p><p>It was a signal, not an attack. The goblin lines began to move forward again. There was a piercing scream, followed by another, and soon all the wretched breeds were running, shrieking like the souls of the damned as they rushed madly toward the black shields of the waiting legion. Finally, the battle would be truly joined.</p><p>Corvus glanced at Marcus Saturnius, who was scowling furiously. How many times had they witnessed this together, Corvus thought. It was always the same. It didn’t matter if you were fighting men or goblins, elves or orcs. All the sights and sounds and strategies and tactics were eventually reduced to this: two lines coming together into one.</p><p>Without any signal from either of them, as if the onrushing goblins had crossed some invisible line, a roar went up from the centurions, and a murderous flock of flying serpents leaped into the air from the first two Amorran ranks as the centuries hurled their spears.</p><p>The goblins fought with courage, but man-for-man they were much weaker than the legionaries. Their weapons were seldom able to pierce the Amorran armor, and their own armor couldn’t withstand the forged steel of the legionary blades and spearheads. And whereas a wounded goblin was prone to be crushed under the feet of his comrades as they pressed forward, a wounded legionary was quickly extracted by the men behind him and assisted, or carried if need be, to the medici positioned to the left of the reserve cohorts.</p><p>Corvus saw Saturnius looking pensive as the pressing goblins fell back momentarily following an extraordinary, but ultimately futile, effort that had seen several men in the front ranks fall, including a centurion from the sixth cohort, at the cost of more than one hundred goblins. Saturnius whispered thoughtfully to himself, then abruptly turned and said something to his draconarius, who blew four rapid notes in a signal that was acknowledged in ragged succession by the centuries fighting below.</p><p>After the last horn sounded, the ballistarii launched their missiles en masse just over the helmets of their own troops and into the enemy’s front lines. The three embattled cohorts used the resulting disarray among the goblins to rotate their first three lines of troops back and exchange them with the three lines that had been waiting, more or less patiently, for their own turn at the bloody mill.</p><p>“Nicely done,” Corvus complimented his subordinate. “They might have been on the parade ground.”</p><p>“They’d damn well better have gotten it right,” Saturnius growled. “I didn’t spend four months standing over them making them practice every day, rain or shine, for my own health. And those two centuries from the bloody sixth still tried to go right instead of left! I’ll have their centurions’ guts to lace my sandals tomorrow.”</p><p>Corvus smiled. Things were going well indeed if Saturnius was cursing his troops instead of the enemy. And unless he missed his guess, the century that bumbled its withdrawal had lost its centurion only moments before. Considering that this was their first battle and they had just lost their officer, the century from the sixth were doing well to have merely muffed a rotation. That was the ultimate tribute any unit could pay its commander, to maintain its discipline even in his absence.</p><p>Another hour or two, perhaps three more rotations, and the goblins would wear themselves out. Due to their observable lack of discipline and reluctance to come to grips, Corvus suspected the goblin cavalry would be the first to withdraw. They would use their superior speed to run away rather than screen the infantry’s retreat as they should. Then the rear ranks of the infantry would begin to melt away, until the front ones, realizing they were being abandoned, would take fright, throw down their arms, and try to flee.</p><p>And then the slaughter would begin.</p></div>",
  "content_text": "Here is an excerpt from the 924-page epic fantasy\nA THRONE OF BONES\n. Which, by the way, is a free download today and the rest of the weekend. Also available in\nhardcover\nand\npaperback\n.\nThe ebb and flow of battle always seemed to follow a similar pattern, Corvus thought as he watched the ragged ranks of the goblin army march into what he intended to be the field of slaughter. A less experienced commander might be impressed by the huge quantity of armed troops as they moved, apparently inexorably, across the very meadow over which he’d ridden the day before. There were an awful lot of them, between four and five to every man of his, but the numbers were almost unimportant once a critical mass was achieved.\nIt was surprising how little actual killing occurred while the outcome of the battle was still in doubt, when the two front lines crashed into each other and sword met with sword. No, most of the bloodshed would take place after one side broke, its will shattered by the iron resolve of the enemy, and what had moments before been an army dissolved into a fleeing crowd of frightened individuals.\nThat was the moment for which every general worth his salt planned, anticipated, and feared. It was the moment in which every decision, every purchase, every piece of equipment, every hour of weapons drill and unit maneuver, was thrown into the cauldron of Fate and the bitch-goddess stirred up her bloody witches brew, seasoned it according to her whim, and served it to you. You had no choice but to swallow it.\nHe was determined that his would not be the side that broke.\nAt the moment when he caught sight of the sleek sinuous forms of the wolves slinking through the tall grass below, it was too late to regret splitting his two cavalry wings. It was too late to wonder if he should have stationed more of the artillery on the heights to his right instead of behind him in the center. It was too late to consider if he should have positioned the second and fifth cohorts on either side of the first cohort instead of the fourth and sixth.\nThat was the worst part of being a general. Everyone else in the legion, from the tribunes to the lowliest legionary, believed you were in command. Only you knew you weren’t. In truth, you were little more than a helpless observer, watching as the events you’d earlier put in motion played themselves out without much in the way of guidance from you or respect for your intentions. It wasn’t what he did in the heat of battle, but what he had done to prepare for it, that mattered.\nAnd yet, he was entirely confident that it would be the goblin commander who would be drinking Fortune’s bitter draught tonight. Legio XVII might be green, but they damn sure had stouter hearts than goblins, who, despite the beating drums that urged them forward, continued to slow their march as they came closer to the Amorran lines.\nThe goblin advance slowed, then slowed some more, and finally came to a complete halt about fifty paces from the ground where the first cohort stood, steadfast, flanked on either side by the fourth and sixth cohorts. The drums stopped.\nCorvus heard the primus pilus shout, a loud cry that was echoed by five hundred voices chanting in response. The centuries in the neighboring cohorts began to pick it up as well. A thousand voices chanted a single word, then slammed the butt of their spears twice on the ground, then repeated it again. Then two thousand voices, then three thousand.\n“Legion!” Thump-thump. “Legion!”\nMen stomped their feet, clapped their hands, slammed their gauntleted fists into their steel breastplates. The very hill upon which Corvus stood seemed to shake with the echoes, but not as much as the goblins. Their front ranks were visibly quivering with fear.\n“Legion!” Thump-thump. “Legion!”\nIt sounded as if his men were summoning some ancient demon of war—no, an army of demons—from the bowels of the earth.\n“Legion!” Thump-thump. “Legion!”\nCorvus nodded slowly, pleased. No one, least of all the enemy ranks lined up against them, would imagine these were men who had never seen battle before. Saturnius’s centurions had done their work well.\nHe glanced to the left. As expected, the goblin commander had divided his wolves between the two flanks, and their right wing looked no more eager to rush forward into the teeth of the infantry fortifying the thin line of horse than their foot was to come to grips with the cohorts in the center. On the right, he saw a desultory exchange of missiles was taking place, but it was nothing to cause him any concern for the safety of two young tribunes he had stationed atop the hill there.\nBut if the goblin masses were intimidated, their commander was not. His response was spectacular, if not particularly effective. A strange humming filled the air, gradually swelling until the Amorran chanting began to break up as the legionaries wondered what it was. Then, with the sound of a thunderclap, purple fire arched from the goblin rear over their lines and exploded in the midst of the first cohort. He saw men fly into the air, heard other men scream, burned by the shaman’s fire. The goblin drums began to thunder again.\n“Ballistari!” Saturnius turned around and screamed at the optio who commanded the artillery. “Cassabus, find me that devil-spawned bugger and flatten him now!”\nCorvus squinted and attempt to see where the shaman might be, but he shrugged and gave it up after a moment. The sharpest eyes in the legion were assigned to the artillery squads, and if they couldn’t spot the goblin, his aging eyes certainly wouldn’t be up to the task either.\nSaturnius’s face turned redder with each of the two subsequent magical blasts, both of which ripped small holes in the Amorran ranks. But despite their alarming effects on the morale of the troops forced to stand there helplessly enduring the magical barrage, Corvus knew the shaman wasn’t doing them any significant harm.\n“They have him, legate!” Cassabus called down to an irate Saturnius. “First cohort, loose!”\nThere was a loud thrumming sound and the shriek of much-abused wood as the supports absorbed the force of heavy slings slamming down, one after the other.\nTen huge rocks sailed over the heads of the Amorran infantry—and the greater part of the goblin infantry as well. All crashed down into a remarkably small area and left little more than smears of green ruin behind them as they bounced and tumbled to an eventual halt well behind the enemy’s rear.\n“Well done, Cassabus,” Corvus shouted to the optio. “Commend your men!”\nHe doubted the man could hear him over the creaking of the onagers as the ballistarii rewound their huge coils, but Cassabus saw Corvus was shouting at him, and the optio raised his fist triumphantly.\n“That’ll do for the bastard,” Saturnius said with satisfaction, his complexion gradually returning to something more resembling its customary color. “And it should give any of his little bastard friends second thoughts about throwing that devil’s fire about willy-nilly.”\n“Who needs Michaelines when you’ve got mules?” Corvus laughed at the sour expression on the legate’s face. No matter how well things were going, Saturnius was always foul-tempered throughout the course of a battle.\n“At least we’ve got a few lads who can hit the broad side of a barn,” Saturnius said. “But I don’t know what those bloody scorpios thought they were trying to hit.”\nCorvus looked behind them, momentarily confused. Sure enough, four of the scorpio squads were reloading their giant crossbows. He hadn’t even realized they had loosed their bolts.\nA horn sounded, and a great purple cloud appeared out of nowhere before exploding harmlessly well over the heads of the first cohort.\nIt was a signal, not an attack. The goblin lines began to move forward again. There was a piercing scream, followed by another, and soon all the wretched breeds were running, shrieking like the souls of the damned as they rushed madly toward the black shields of the waiting legion. Finally, the battle would be truly joined.\nCorvus glanced at Marcus Saturnius, who was scowling furiously. How many times had they witnessed this together, Corvus thought. It was always the same. It didn’t matter if you were fighting men or goblins, elves or orcs. All the sights and sounds and strategies and tactics were eventually reduced to this: two lines coming together into one.\nWithout any signal from either of them, as if the onrushing goblins had crossed some invisible line, a roar went up from the centurions, and a murderous flock of flying serpents leaped into the air from the first two Amorran ranks as the centuries hurled their spears.\nThe goblins fought with courage, but man-for-man they were much weaker than the legionaries. Their weapons were seldom able to pierce the Amorran armor, and their own armor couldn’t withstand the forged steel of the legionary blades and spearheads. And whereas a wounded goblin was prone to be crushed under the feet of his comrades as they pressed forward, a wounded legionary was quickly extracted by the men behind him and assisted, or carried if need be, to the medici positioned to the left of the reserve cohorts.\nCorvus saw Saturnius looking pensive as the pressing goblins fell back momentarily following an extraordinary, but ultimately futile, effort that had seen several men in the front ranks fall, including a centurion from the sixth cohort, at the cost of more than one hundred goblins. Saturnius whispered thoughtfully to himself, then abruptly turned and said something to his draconarius, who blew four rapid notes in a signal that was acknowledged in ragged succession by the centuries fighting below.\nAfter the last horn sounded, the ballistarii launched their missiles en masse just over the helmets of their own troops and into the enemy’s front lines. The three embattled cohorts used the resulting disarray among the goblins to rotate their first three lines of troops back and exchange them with the three lines that had been waiting, more or less patiently, for their own turn at the bloody mill.\n“Nicely done,” Corvus complimented his subordinate. “They might have been on the parade ground.”\n“They’d damn well better have gotten it right,” Saturnius growled. “I didn’t spend four months standing over them making them practice every day, rain or shine, for my own health. And those two centuries from the bloody sixth still tried to go right instead of left! I’ll have their centurions’ guts to lace my sandals tomorrow.”\nCorvus smiled. Things were going well indeed if Saturnius was cursing his troops instead of the enemy. And unless he missed his guess, the century that bumbled its withdrawal had lost its centurion only moments before. Considering that this was their first battle and they had just lost their officer, the century from the sixth were doing well to have merely muffed a rotation. That was the ultimate tribute any unit could pay its commander, to maintain its discipline even in his absence.\nAnother hour or two, perhaps three more rotations, and the goblins would wear themselves out. Due to their observable lack of discipline and reluctance to come to grips, Corvus suspected the goblin cavalry would be the first to withdraw. They would use their superior speed to run away rather than screen the infantry’s retreat as they should. Then the rear ranks of the infantry would begin to melt away, until the front ones, realizing they were being abandoned, would take fright, throw down their arms, and try to flee.\nAnd then the slaughter would begin.",
  "tags": [
    "books",
    "CastaliaHouse",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-16T00:54:00+00:00"
}