{
  "url": "https://voxday.net/2017/12/02/fair-enough/",
  "scraped_at": "2025-12-19T10:33:38.164112",
  "title": "Fair enough",
  "date_display": "December 2, 2017",
  "date_iso": "2017-12-02T18:00:00+00:00",
  "date_from_url": "2017-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derb highlights <a href=\"http://www.unz.com/jderbyshire/november-diary-mencken-club-dissolution-of-the-universities-etc/\">a line of demarcation</a>:</p><blockquote><p>Since I have no clue what the Alt Right perspective is, I went for inspiration to someone who believes he does know. This is the blogger Vox Day, who last year published a 16-point Alt Right Manifesto. In my address to the Mencken Club I read off Vox Day’s points and passed comment on each one.</p><p>As a format for a talk, this has somewhat of cheating about it; but spirits were so high, nobody minded, and my talk went over well with the audience.</p><p>Not so much with Vox Day, <a href=\"http://www.unz.com/jderbyshire/november-diary-mencken-club-dissolution-of-the-universities-etc/\">who picked nits with my comments</a> on his website a few days later. That’s okay, and all in good argumentative combat. I respect Vox Day as an ally in the Cultural Counterrevolution, as well as a writer of wit and courage. We disagree about many things, but our disagreements are cordial.</p><p>Our deepest disagreement is anyway just temperamental. In the language of We Are Doomed, Chapter 7: he’s a religionist, I’m a biologian. He thinks the universe cares about the human race, and even about individual persons; I see no evidence of either thing. He thinks we are a unique creation, kissed with magic; I think we’re smart chimps.</p><p>There’s no use arguing about this. The difference is, as I said, temperamental, most likely genetic. It shouldn’t stop us liking and respecting each other, and acknowledging that both personality types have a part to play in the Cultural Counterrevolution.</p></blockquote><p>I could not agree more with the general sentiment. I like and respect Derb, who remains one of my favorite Dissident Right writers as well as the author of <a href=\"https://www.amazon.com/Prime-Obsession-Bernhard-Greatest-Mathematics/dp/0452285259\">the only math book I have ever really enjoyed reading</a>. I am no more troubled by the fact that we disagree on this, that, and the other thing than I am by the fact that my sexual preferences happen to differ <i>considerably </i>from my friend Milo’s.</p><p>That being said, contra Derb, I do think it can be useful to argue about these things, even when our opposing positions are intractable. I do see real value in intellectual opponents who can disagree vehemently and yet still get along on a personal level. My economic arguments have been honed by opponents like Nate and Dr. James Miller, as well as the guy who challenged me to review Henry Hazlitt’s arguments.</p><p>Not so much, however, by this next fellow. As is so often the case when someone thinks he has caught me out in a mistake, he has only demonstrated his inability to understand what I have written or the conclusions that naturally follow. For some reason, this gentlemen elected to CC me in his email to John Derbyshire, in which he claimed that I had inadvertently made the opposite of the case I was making without anyone even noticing. Except himself, of course.</p><p>One would think that would have been his first clue…Note that this is written by a community college professor, demonstrating once more that the self-professed intellectual elite is actually composed of midwits who overestimate their own capabilities and don’t understand their own subjects very well:</p><blockquote><p>John,</p><p>Having embarrassed myself in our emails and at our single meeting (AmRen15) I had been resolved to communicate with you less, but you suffer fools gladly so I venture again with this.</p><p>I am not an “economic ignoramus” having taught micro- and macro- for eleven years (community college, adjunct faculty – more public service than income source) but I have long had the exact same question as the one you posed:  Why does free trade require free movement of peoples? I note from the Vox Day response that it does not, though he would be surprised by that reading.</p><p>He wrote two paragraphs.  In the first he wrote “by definition” and so creates a tautology:  Free trade requires that trade be free.  More specifically, an engineer who travels to install a piece of equipment and the returns home is not a migrant.  There is nothing about the importation of automobiles (or any other merchandise) that requires the importation of people.  Call it the difference between free trade and absolutely free trade.</p><p>To wit:  If Americans drink Mexican beer, it is because we import the beer.  The beer has cost components that are relevant to the manufacturer in Mexico but irrelevant to the gringo imbiber, such as direct materials, direct labor and overhead.  (I am a CPA too.)  The Budweiser employee in Saint Louis may see his hours cut back due to the good efforts of the Dos Equis employee south of the border, but no economist without an agenda would call that “importing labor.”</p><p>In the case of “absolutely free trade” where factors of production can cross borders as freely as merchandise, theoretical economics predicts “factor price equalization” and we would expect brewer employees both north and south of the border to be paid the same wage in equilibrium.  In his second paragraph, he writes of “maximum efficiencies” and “maximum growth potential” – very theoretical stuff.</p><p>But he gives the game away where he writes “any failure to restrict this travel will necessarily create inefficiencies” (though he of course meant “any travel restriction will necessarily create inefficiencies”) which concedes a key point:  Free trade in merchandise without free trade in all factors of production (e.g. labor) is still beneficial to both parties, even if not maximally.</p><p>Imagine a world where ethnocontinents are stable but comparative advantages differ.  Africa could send gold to North America in exchange for computers and both would benefit.  If there are no North American gold miners, we can live with that small inefficiency reflected in a slightly higher price of gold.  We could have all the gold be want simply by importing it.  And if the Africans use Dell computers to enslave and murder each other, that has no weight in calculating gains from trade.</p><p>Trump is wrong on trade; it is not a zero-sum game.  As I had preached for eleven years, “trade fosters peace” because both parties develop an interest in a friendly on-going relationship.  However, trade (excepting “absolutely free trade” comprehending factor mobility) does not demand emigration/immigration.  Indeed, a person relocating internationally is not an act of “trade.”  Build the wall, yes, but run railroads through it.</p></blockquote><p>There is no game to be given away. I conceded absolutely nothing. Let’s look closely at this “key point”.</p><blockquote class=\"tr_bq\"><p>But he gives the game away where he writes “any failure to restrict this travel will necessarily create inefficiencies” (though he of course meant “any travel restriction will necessarily create inefficiencies”) which concedes a key point:  Free trade in merchandise without free trade in all factors of production (e.g. labor) is still beneficial to both parties, even if not maximally. </p></blockquote><p>Now, what two points is the clueless professor failing to take into account here? And beyond that, speaking of “very theoretical stuff”, where is the evidence that free trade in goods without free trade in labor is even materially possible in a world where inexpensive global travel is available to the average laborer? I observe that the free traders have it entirely backwards now, as their theory does not even <i>begin </i>to account for the fact that labor can now move more easily, more inexpensively, and more freely than goods can.</p></div>",
  "content_text": "Derb highlights\na line of demarcation\n:\nSince I have no clue what the Alt Right perspective is, I went for inspiration to someone who believes he does know. This is the blogger Vox Day, who last year published a 16-point Alt Right Manifesto. In my address to the Mencken Club I read off Vox Day’s points and passed comment on each one.\nAs a format for a talk, this has somewhat of cheating about it; but spirits were so high, nobody minded, and my talk went over well with the audience.\nNot so much with Vox Day,\nwho picked nits with my comments\non his website a few days later. That’s okay, and all in good argumentative combat. I respect Vox Day as an ally in the Cultural Counterrevolution, as well as a writer of wit and courage. We disagree about many things, but our disagreements are cordial.\nOur deepest disagreement is anyway just temperamental. In the language of We Are Doomed, Chapter 7: he’s a religionist, I’m a biologian. He thinks the universe cares about the human race, and even about individual persons; I see no evidence of either thing. He thinks we are a unique creation, kissed with magic; I think we’re smart chimps.\nThere’s no use arguing about this. The difference is, as I said, temperamental, most likely genetic. It shouldn’t stop us liking and respecting each other, and acknowledging that both personality types have a part to play in the Cultural Counterrevolution.\nI could not agree more with the general sentiment. I like and respect Derb, who remains one of my favorite Dissident Right writers as well as the author of\nthe only math book I have ever really enjoyed reading\n. I am no more troubled by the fact that we disagree on this, that, and the other thing than I am by the fact that my sexual preferences happen to differ\nconsiderably\nfrom my friend Milo’s.\nThat being said, contra Derb, I do think it can be useful to argue about these things, even when our opposing positions are intractable. I do see real value in intellectual opponents who can disagree vehemently and yet still get along on a personal level. My economic arguments have been honed by opponents like Nate and Dr. James Miller, as well as the guy who challenged me to review Henry Hazlitt’s arguments.\nNot so much, however, by this next fellow. As is so often the case when someone thinks he has caught me out in a mistake, he has only demonstrated his inability to understand what I have written or the conclusions that naturally follow. For some reason, this gentlemen elected to CC me in his email to John Derbyshire, in which he claimed that I had inadvertently made the opposite of the case I was making without anyone even noticing. Except himself, of course.\nOne would think that would have been his first clue…Note that this is written by a community college professor, demonstrating once more that the self-professed intellectual elite is actually composed of midwits who overestimate their own capabilities and don’t understand their own subjects very well:\nJohn,\nHaving embarrassed myself in our emails and at our single meeting (AmRen15) I had been resolved to communicate with you less, but you suffer fools gladly so I venture again with this.\nI am not an “economic ignoramus” having taught micro- and macro- for eleven years (community college, adjunct faculty – more public service than income source) but I have long had the exact same question as the one you posed:  Why does free trade require free movement of peoples? I note from the Vox Day response that it does not, though he would be surprised by that reading.\nHe wrote two paragraphs.  In the first he wrote “by definition” and so creates a tautology:  Free trade requires that trade be free.  More specifically, an engineer who travels to install a piece of equipment and the returns home is not a migrant.  There is nothing about the importation of automobiles (or any other merchandise) that requires the importation of people.  Call it the difference between free trade and absolutely free trade.\nTo wit:  If Americans drink Mexican beer, it is because we import the beer.  The beer has cost components that are relevant to the manufacturer in Mexico but irrelevant to the gringo imbiber, such as direct materials, direct labor and overhead.  (I am a CPA too.)  The Budweiser employee in Saint Louis may see his hours cut back due to the good efforts of the Dos Equis employee south of the border, but no economist without an agenda would call that “importing labor.”\nIn the case of “absolutely free trade” where factors of production can cross borders as freely as merchandise, theoretical economics predicts “factor price equalization” and we would expect brewer employees both north and south of the border to be paid the same wage in equilibrium.  In his second paragraph, he writes of “maximum efficiencies” and “maximum growth potential” – very theoretical stuff.\nBut he gives the game away where he writes “any failure to restrict this travel will necessarily create inefficiencies” (though he of course meant “any travel restriction will necessarily create inefficiencies”) which concedes a key point:  Free trade in merchandise without free trade in all factors of production (e.g. labor) is still beneficial to both parties, even if not maximally.\nImagine a world where ethnocontinents are stable but comparative advantages differ.  Africa could send gold to North America in exchange for computers and both would benefit.  If there are no North American gold miners, we can live with that small inefficiency reflected in a slightly higher price of gold.  We could have all the gold be want simply by importing it.  And if the Africans use Dell computers to enslave and murder each other, that has no weight in calculating gains from trade.\nTrump is wrong on trade; it is not a zero-sum game.  As I had preached for eleven years, “trade fosters peace” because both parties develop an interest in a friendly on-going relationship.  However, trade (excepting “absolutely free trade” comprehending factor mobility) does not demand emigration/immigration.  Indeed, a person relocating internationally is not an act of “trade.”  Build the wall, yes, but run railroads through it.\nThere is no game to be given away. I conceded absolutely nothing. Let’s look closely at this “key point”.\nBut he gives the game away where he writes “any failure to restrict this travel will necessarily create inefficiencies” (though he of course meant “any travel restriction will necessarily create inefficiencies”) which concedes a key point:  Free trade in merchandise without free trade in all factors of production (e.g. labor) is still beneficial to both parties, even if not maximally.\nNow, what two points is the clueless professor failing to take into account here? And beyond that, speaking of “very theoretical stuff”, where is the evidence that free trade in goods without free trade in labor is even materially possible in a world where inexpensive global travel is available to the average laborer? I observe that the free traders have it entirely backwards now, as their theory does not even\nbegin\nto account for the fact that labor can now move more easily, more inexpensively, and more freely than goods can.",
  "tags": [
    "economics",
    "freetrade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-02T18:00:00+00:00"
}