{
  "url": "https://voxday.net/2017/12/28/four-million-pageviews/",
  "scraped_at": "2025-12-19T10:36:49.246056",
  "title": "FOUR MILLION PAGEVIEWS",
  "date_display": "December 28, 2017",
  "date_iso": "2017-12-28T20:36:00+00:00",
  "date_from_url": "2017-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The not-at-all-solipsistic John Scalzi is given cause to suspect that <a href=\"https://whatever.scalzi.com/2017/12/28/2017-top-ten-whatever-posts-social-media-stats/\">blogs are dead</a>:</p><blockquote><p>As I noted in early July, visitorship to Whatever — as in people actually clicking through to the front page of the site — has undergone a collapse this year. I speculated as to why at the link, so if you’re interested in that, check it out there, but the relevant bit now is that I estimated in July I would end up with about 4 million visits to the site in 2017. As of right this minute (6:18 am, 12/28/17), Whatever’s visitorship for the year is: 4,110,902. Right in line with my expectations.</p><p>Am I worried? Well, no. One, four million visits in a year to a personal site is still nothing to sneeze at.</p><p>I will note that there is a very high correlation between the most visited pieces on the site this year and my linking to it on other social media, most notably Twitter. Twitter and Facebook are also consistently the top non-search-related sites (by far) for referrals to my site. This strongly suggests something I’ve long suspected, which is that Twitter and Facebook have at this point largely consumed and digested the former blogosphere, enough so that at this point, I wonder if I should even call Whatever a “blog” anymore. The name is beginning to get a fusty smell to it.</p></blockquote><p>Sure, that’s possible, I suppose. On the other hand, the decline from <a href=\"https://whatever.scalzi.com/2012/12/25/eight-million-views-for-2012/\">8 million pageviews in 2012</a> to 4 million in 2017 – I’m sure we’re all shocked to discover Scalzi is being deceptive again, this time by substituting “visits” for “pageviews” – in addition to the 30,953,348 “visitorship for the year” that VP has <i>as of right this minute</i> tends to suggest that intelligent people who like to read commentary simply aren’t all that interested in Whatever anymore. It appears I am far from the only person who once read Whatever back in the day who no longer does so.</p><p>But the posturing is informative, as it demonstrates a classic Gamma perspective. You see, the Gamma doesn’t mind at all that he’s observably in deep decline, <i>so long as the decline is right in line with his expectation</i>s.</p><p>Secret King wins again!</p><p>UPDATE: Scalzi realizes he got caught… again.</p><p><a href=\"https://twitter.com/scalzi/status/946556433839030273\">John Scalzi@scalzi</a><br><i>TFW someone mewls pathetically and at ridiculous length about a terminology error you made on your site, but he has a point, so you correct the error.</i><br><i><br/></i>If it was anyone else, I would have assumed it was simply a mistake, but in this case, we’re dealing with someone who blatantly lied to both <i>Lightspeed </i>and <i>The New York Times </i>about his site traffic in the past. So, one can’t reasonably give him the benefit of the doubt.</br></br></p><p>That being said, good for him for correcting his error. Let’s hope this will lead him to correct his previous “errors”.</p></div>",
  "content_text": "The not-at-all-solipsistic John Scalzi is given cause to suspect that\nblogs are dead\n:\nAs I noted in early July, visitorship to Whatever — as in people actually clicking through to the front page of the site — has undergone a collapse this year. I speculated as to why at the link, so if you’re interested in that, check it out there, but the relevant bit now is that I estimated in July I would end up with about 4 million visits to the site in 2017. As of right this minute (6:18 am, 12/28/17), Whatever’s visitorship for the year is: 4,110,902. Right in line with my expectations.\nAm I worried? Well, no. One, four million visits in a year to a personal site is still nothing to sneeze at.\nI will note that there is a very high correlation between the most visited pieces on the site this year and my linking to it on other social media, most notably Twitter. Twitter and Facebook are also consistently the top non-search-related sites (by far) for referrals to my site. This strongly suggests something I’ve long suspected, which is that Twitter and Facebook have at this point largely consumed and digested the former blogosphere, enough so that at this point, I wonder if I should even call Whatever a “blog” anymore. The name is beginning to get a fusty smell to it.\nSure, that’s possible, I suppose. On the other hand, the decline from\n8 million pageviews in 2012\nto 4 million in 2017 – I’m sure we’re all shocked to discover Scalzi is being deceptive again, this time by substituting “visits” for “pageviews” – in addition to the 30,953,348 “visitorship for the year” that VP has\nas of right this minute\ntends to suggest that intelligent people who like to read commentary simply aren’t all that interested in Whatever anymore. It appears I am far from the only person who once read Whatever back in the day who no longer does so.\nBut the posturing is informative, as it demonstrates a classic Gamma perspective. You see, the Gamma doesn’t mind at all that he’s observably in deep decline,\nso long as the decline is right in line with his expectation\ns.\nSecret King wins again!\nUPDATE: Scalzi realizes he got caught… again.\nJohn Scalzi@scalzi\nTFW someone mewls pathetically and at ridiculous length about a terminology error you made on your site, but he has a point, so you correct the error.\nIf it was anyone else, I would have assumed it was simply a mistake, but in this case, we’re dealing with someone who blatantly lied to both\nLightspeed\nand\nThe New York Times\nabout his site traffic in the past. So, one can’t reasonably give him the benefit of the doubt.\nThat being said, good for him for correcting his error. Let’s hope this will lead him to correct his previous “errors”.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-28T20:36:00+00:00"
}