{
  "url": "https://voxday.net/2017/12/03/keep-your-intellectual-canon-loaded/",
  "scraped_at": "2025-12-19T10:33:42.615464",
  "title": "Keep your intellectual canon loaded",
  "date_display": "December 3, 2017",
  "date_iso": "2017-12-03T13:00:00+00:00",
  "date_from_url": "2017-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the most recent reviews of <b><i><a href=\"http://amzn.to/2xt9dWb\">SJWs Always Double Down</a></i></b>, still the #1 Political Philosophy bestseller:</p><ul><li><i>Great book. I especially enjoyed the portion explaining the fallacies with the given examples. Does tend to be a little dry at times, but a good read nevertheless.</i></li><li><i>Vox Day is an excellent author. Subject well researched and presented. I am learning a lot!</i></li><li><i>Five Stars. Eye opening. Well written.</i></li><li><i>If you have read the first installation in this series – <a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a> – you know what to expect. But perhaps you might think that you already know what is in this book. Well, yes and no. A lot of the stuff will be familiar to those who have followed the SJW wars, but the tactical and strategic details spelled out in the different chapters on how to identify, resist and deal with SJW infiltrators is worth the price. Even after participating, the section on the strategic thinking behind the Puppies’ takedown of the Hugo Awards was an eye opener for me.</i></li><li><i>Knowing how SJW’s infiltrate and destroy organizations from within is invaluable information in an age where virtue-signaling is more important that delivering products and services.</i></li></ul><p>Since Christmas is coming, it may be worth remembering that both SJWAL and SJWADD are now available <a href=\"http://amzn.to/2yM2nAP\">in paperback</a>, so it’s easy to put them in the hands of family members and colleagues who you suspect may be targeted by SJWs in the coming year. Or better yet, who happen to be in a position to do something about the SJWs already infesting their organizations.</p><p>Remember, 2018 is the year that SJWs and the rest of the Left are going to be amping up the rhetoric and the political intensity in the hopes of taking back some of the ground they’ve lost since 2015. We can safely expect the temperature of the cultural cold war, and the number of metaphorical casualties, to rise as a result.</p></div>",
  "content_text": "From the most recent reviews of\nSJWs Always Double Down\n, still the #1 Political Philosophy bestseller:\nGreat book. I especially enjoyed the portion explaining the fallacies with the given examples. Does tend to be a little dry at times, but a good read nevertheless.\nVox Day is an excellent author. Subject well researched and presented. I am learning a lot!\nFive Stars. Eye opening. Well written.\nIf you have read the first installation in this series –\nSJWs Always Lie\n– you know what to expect. But perhaps you might think that you already know what is in this book. Well, yes and no. A lot of the stuff will be familiar to those who have followed the SJW wars, but the tactical and strategic details spelled out in the different chapters on how to identify, resist and deal with SJW infiltrators is worth the price. Even after participating, the section on the strategic thinking behind the Puppies’ takedown of the Hugo Awards was an eye opener for me.\nKnowing how SJW’s infiltrate and destroy organizations from within is invaluable information in an age where virtue-signaling is more important that delivering products and services.\nSince Christmas is coming, it may be worth remembering that both SJWAL and SJWADD are now available\nin paperback\n, so it’s easy to put them in the hands of family members and colleagues who you suspect may be targeted by SJWs in the coming year. Or better yet, who happen to be in a position to do something about the SJWs already infesting their organizations.\nRemember, 2018 is the year that SJWs and the rest of the Left are going to be amping up the rhetoric and the political intensity in the hopes of taking back some of the ground they’ve lost since 2015. We can safely expect the temperature of the cultural cold war, and the number of metaphorical casualties, to rise as a result.",
  "tags": [
    "books",
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-03T13:00:00+00:00"
}