{
  "url": "https://voxday.net/2017/12/24/like-a-prince-to-the-slaughter/",
  "scraped_at": "2025-12-19T10:36:24.026322",
  "title": "Like a prince to the slaughter",
  "date_display": "December 24, 2017",
  "date_iso": "2017-12-24T17:10:00+00:00",
  "date_from_url": "2017-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is increasingly evident that Meghan Markle <a href=\"http://www.dailymail.co.uk/news/article-5209945/Prince-Harry-miss-traditional-royal-Boxing-Day-shoot.html\">is going to chew up Prince Harry</a> before she spits him out and walks off with millions. She is a female superpredator – there are even fairly reliable rumors that she did an amount of escorting before her big television break – and he clearly has absolutely no idea what he is in for. I find it astonishing that the monarchy is permitting him to marry this woman even though there is almost no chance he’ll ever get anywhere near the throne.</p><blockquote><p>Prince Harry will not be taking part in the traditional royal Boxing Day shoot because he doesn’t want to upset his fiancee Meghan Markle.</p><p>The 33-year-old was just 12 when he took part in his first festive shoot but has pulled out because Miss Markle is a keen animal rights campaigner.</p><p>Miss Markle, 36, doesn’t like hunting and Prince Harry is said to have shocked gamekeepers at Sandringham after he informed them he won’t be there on December 26.</p><p>Instead, his brother Prince William, 35, and 69-year-old father Prince Charles, will take part in the shoot. A royal source told The Sun: ‘The Boxing Day shoot was always going to be a tricky issue. Meghan is a keen animal rights campaigner and doesn’t like hunting in any form. ‘Harry loves it and has always been out there on Boxing Day. But if it means breaking with long-standing royal traditions to avoid upsetting her, so be it.</p></blockquote><p>This promises to be the worst ending for an English royal since King Charles I met the headman. And, you may recall, that started with an unwise wedding too. It’s just… embarrassing, really.</p></div>",
  "content_text": "It is increasingly evident that Meghan Markle\nis going to chew up Prince Harry\nbefore she spits him out and walks off with millions. She is a female superpredator – there are even fairly reliable rumors that she did an amount of escorting before her big television break – and he clearly has absolutely no idea what he is in for. I find it astonishing that the monarchy is permitting him to marry this woman even though there is almost no chance he’ll ever get anywhere near the throne.\nPrince Harry will not be taking part in the traditional royal Boxing Day shoot because he doesn’t want to upset his fiancee Meghan Markle.\nThe 33-year-old was just 12 when he took part in his first festive shoot but has pulled out because Miss Markle is a keen animal rights campaigner.\nMiss Markle, 36, doesn’t like hunting and Prince Harry is said to have shocked gamekeepers at Sandringham after he informed them he won’t be there on December 26.\nInstead, his brother Prince William, 35, and 69-year-old father Prince Charles, will take part in the shoot. A royal source told The Sun: ‘The Boxing Day shoot was always going to be a tricky issue. Meghan is a keen animal rights campaigner and doesn’t like hunting in any form. ‘Harry loves it and has always been out there on Boxing Day. But if it means breaking with long-standing royal traditions to avoid upsetting her, so be it.\nThis promises to be the worst ending for an English royal since King Charles I met the headman. And, you may recall, that started with an unwise wedding too. It’s just… embarrassing, really.",
  "tags": [
    "AlphaGame",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-24T17:10:00+00:00"
}