{
  "url": "https://voxday.net/2017/12/22/mailvox-feel-the-rage/",
  "scraped_at": "2025-12-19T10:36:06.232205",
  "title": "Mailvox: feel the rage",
  "date_display": "December 22, 2017",
  "date_iso": "2017-12-22T18:48:00+00:00",
  "date_from_url": "2017-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GW wonders about the socio-sexuality of skepticism:</p><blockquote><p>Perhaps you haven’t been following the debacle between the YouTube race realists and the skeptic community, but I would love to hear your view on the main instigator of it, Kraut and Tea. His infantile attacks on imagined ghosts of the Alt-Right, blatant hypocrisy in regards to the principles of not deplatforming or doxxing people, and smug overestimation of his level of expertise in biology and statistics seem like classic symptoms of a Gamma’s wounded ego. That he also refuses to silence his tongue when thoroughly outmatched is just more proof of his status.</p><p>It makes me think the “online skeptic” nowadays is predisposed towards being Gamma. What else can explain their lack of conviction? Their unwillingness to argue the believer or race realist in good faith?</p></blockquote><p>There is no question that the average “internet atheist” is a Gamma. More than a few are Omegas. Both scientific studies that looked into my original hypothesis about atheism being a consequence of being on the autism spectrum found correlations between an inability to make social connections and an inability to feel spiritual connections.</p><p>This sort of aggressive atheist are akin to the blind man who not only insists that everyone else is lying about their ability “to see”, but also that they are inferior to him due to their inability to come to terms with their blindness. And then proceeds to try to poke out their eyes.</p><p>I have no intrinsic problem with people who don’t believe what I do about God or anything else. But I utterly despise those who first proclaim that religion is a crutch, <i>then promptly attempt to kick out that crutch</i> from others who are reliant upon it. They are nasty little creatures.</p></div>",
  "content_text": "GW wonders about the socio-sexuality of skepticism:\nPerhaps you haven’t been following the debacle between the YouTube race realists and the skeptic community, but I would love to hear your view on the main instigator of it, Kraut and Tea. His infantile attacks on imagined ghosts of the Alt-Right, blatant hypocrisy in regards to the principles of not deplatforming or doxxing people, and smug overestimation of his level of expertise in biology and statistics seem like classic symptoms of a Gamma’s wounded ego. That he also refuses to silence his tongue when thoroughly outmatched is just more proof of his status.\nIt makes me think the “online skeptic” nowadays is predisposed towards being Gamma. What else can explain their lack of conviction? Their unwillingness to argue the believer or race realist in good faith?\nThere is no question that the average “internet atheist” is a Gamma. More than a few are Omegas. Both scientific studies that looked into my original hypothesis about atheism being a consequence of being on the autism spectrum found correlations between an inability to make social connections and an inability to feel spiritual connections.\nThis sort of aggressive atheist are akin to the blind man who not only insists that everyone else is lying about their ability “to see”, but also that they are inferior to him due to their inability to come to terms with their blindness. And then proceeds to try to poke out their eyes.\nI have no intrinsic problem with people who don’t believe what I do about God or anything else. But I utterly despise those who first proclaim that religion is a crutch,\nthen promptly attempt to kick out that crutch\nfrom others who are reliant upon it. They are nasty little creatures.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-22T18:48:00+00:00"
}