{
  "url": "https://voxday.net/2017/12/09/mailvox-low-morale-men/",
  "scraped_at": "2025-12-19T10:34:24.939641",
  "title": "Mailvox: low morale men",
  "date_display": "December 9, 2017",
  "date_iso": "2017-12-09T09:38:00+00:00",
  "date_from_url": "2017-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JAG defends MGTOW:</p><blockquote><p>This is why I don’t look down my nose at the MGTOW guys. Most of them are MGTOW because women have become so toxic through feminism that they are no longer attractive. Plus, many of these guys have seen their brothers, fathers, uncles, etc., utterly destroyed by the feminist court system that makes the man an indentured servant for the rest of his life after taking everything else away from him all because the woman got bored or some other ridiculous reason.</p><p>I realize that this is not a popular opinion around here, but those are my reasons for being sympathetic to the MGTOWs. How could you blame them, really? I know that lack of breeding is the biggest issue many have with them, but they are staunch allies when it comes to the issue of feminism.</p></blockquote><p>How could you blame them? Easily. MGTOW are low morale cowards. From the societal and civilizational perspective they are useless parasites who, by their fecklessness, are helping the barbarians win the civilization war. Sure, they’re vastly to be preferred to the feminists, foreigners, globalists, and anti-Christians who are actively waging war against Western civilization, but they are passively refusing to defend it in any way.</p><p>How are they any better than the very Western women they excoriate? They are, in fact, observably worse, as both are in it merely for themselves but at least the women may produce the next generation of Western children, even if they will surely raise them in a sub-optimal manner. Neither the feral woman nor the fearful MGTOW is capable of maintaining the civilization whose toys they enjoy.</p><p>If we aren’t sympathetic to soldiers who run the moment they see the first casualties in their unit, we should not be sympathetic to men who run from women because they saw someone taken down by a toxic woman. The truth is that men often suffer the legal order they deserve, because they tolerate it. Would any Roman patrician have meekly submitted to being made an indentured servant at the whim of his wife and the word of a judge?</p><p>No. He would have killed the judge, the wife, and everyone who assisted either of them, then calmly gone home and opened his veins in the bath. That’s why Roman law permitted patriarchs to kill those under their authority who crossed them in any way – because they were going to do it anyway and the maintenance of legal order in their society relied upon acknowledging that reality.</p><p>But the modern man values his toys more than his honor. That’s why no one, including the legal system, respects his possession of either. Men could end the entire divorce machine in 30 days if they chose, but instead, they prefer to live alone as indentured servants or in fear of becoming an indentured servant. I am not saying “wife up those sluts”, I am merely saying that living one’s life in fear of <i>potentially </i>wifing up a woman who <i>may </i>turn out to be less than entirely faithful <i>and </i>interested in playing the divorce lottery is not worthy of respect or emulation.</p><p>A man of the West takes risks. A man of the Wests molds his wife and his children. A man of the West is willing to fight for his honor, his family, and his civilization. Success is not guaranteed. But then, when, in the entire history of Man, has it <i>ever </i>been guaranteed? For millennia, young men of honor have fought and died for what they believe. But for what, if anything, would an MGTOW risk breaking a fingernail?</p></div>",
  "content_text": "JAG defends MGTOW:\nThis is why I don’t look down my nose at the MGTOW guys. Most of them are MGTOW because women have become so toxic through feminism that they are no longer attractive. Plus, many of these guys have seen their brothers, fathers, uncles, etc., utterly destroyed by the feminist court system that makes the man an indentured servant for the rest of his life after taking everything else away from him all because the woman got bored or some other ridiculous reason.\nI realize that this is not a popular opinion around here, but those are my reasons for being sympathetic to the MGTOWs. How could you blame them, really? I know that lack of breeding is the biggest issue many have with them, but they are staunch allies when it comes to the issue of feminism.\nHow could you blame them? Easily. MGTOW are low morale cowards. From the societal and civilizational perspective they are useless parasites who, by their fecklessness, are helping the barbarians win the civilization war. Sure, they’re vastly to be preferred to the feminists, foreigners, globalists, and anti-Christians who are actively waging war against Western civilization, but they are passively refusing to defend it in any way.\nHow are they any better than the very Western women they excoriate? They are, in fact, observably worse, as both are in it merely for themselves but at least the women may produce the next generation of Western children, even if they will surely raise them in a sub-optimal manner. Neither the feral woman nor the fearful MGTOW is capable of maintaining the civilization whose toys they enjoy.\nIf we aren’t sympathetic to soldiers who run the moment they see the first casualties in their unit, we should not be sympathetic to men who run from women because they saw someone taken down by a toxic woman. The truth is that men often suffer the legal order they deserve, because they tolerate it. Would any Roman patrician have meekly submitted to being made an indentured servant at the whim of his wife and the word of a judge?\nNo. He would have killed the judge, the wife, and everyone who assisted either of them, then calmly gone home and opened his veins in the bath. That’s why Roman law permitted patriarchs to kill those under their authority who crossed them in any way – because they were going to do it anyway and the maintenance of legal order in their society relied upon acknowledging that reality.\nBut the modern man values his toys more than his honor. That’s why no one, including the legal system, respects his possession of either. Men could end the entire divorce machine in 30 days if they chose, but instead, they prefer to live alone as indentured servants or in fear of becoming an indentured servant. I am not saying “wife up those sluts”, I am merely saying that living one’s life in fear of\npotentially\nwifing up a woman who\nmay\nturn out to be less than entirely faithful\nand\ninterested in playing the divorce lottery is not worthy of respect or emulation.\nA man of the West takes risks. A man of the Wests molds his wife and his children. A man of the West is willing to fight for his honor, his family, and his civilization. Success is not guaranteed. But then, when, in the entire history of Man, has it\never\nbeen guaranteed? For millennia, young men of honor have fought and died for what they believe. But for what, if anything, would an MGTOW risk breaking a fingernail?",
  "tags": [
    "declineandfall",
    "mailvox",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-09T09:38:00+00:00"
}