{
  "url": "https://voxday.net/2017/12/04/mailvox-do-not-correct-me/",
  "scraped_at": "2025-12-19T10:33:50.107665",
  "title": "Mailvox: do not “correct” me",
  "date_display": "December 4, 2017",
  "date_iso": "2017-12-04T16:00:00+00:00",
  "date_from_url": "2017-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I so despise the sort of midwit who leaps upon every possible opportunity to “correct” someone in order to show off how smart he is, and in doing so, demonstrates his own ignorance. Add in a dash of smug passive-aggression if you want to maximize the annoyance factor. Here is a suggestion: if you think I’ve gotten something wrong, <i>look it up</i>. If the 14 years of this blog serve as a reliable guide, there is about a 98 percent chance you are wrong.</p><blockquote><p>VD: We can only hope that he will treat them in much the same way Sulla treated his political opponents</p><p>valiance: The way *Marius* treated his political opponents, surely?</p><p>VD: No.</p></blockquote><p>From Infogalactic: <a href=\"https://infogalactic.com/info/Sulla\">Sulla</a></p><p>At the end of 82 BC or the beginning of 81 BC, the Senate appointed Sulla dictator legibus faciendis et reipublicae constituendae causa (“dictator for the making of laws and for the settling of the constitution”). The “Assembly of the People” subsequently ratified the decision, with no limit set on his time in office. Sulla had total control of the city and republic of Rome, except for Hispania (which Marius’s general Quintus Sertorius had established as an independent state). This unusual appointment (used hitherto only in times of extreme danger to the city, such as during the Second Punic War, and then only for 6-month periods) represented an exception to Rome’s policy of not giving total power to a single individual. Sulla can be seen as setting the precedent for Julius Caesar’s dictatorship, and for the eventual end of the Republic under Augustus.</p><p>In total control of the city and its affairs, Sulla instituted a series of proscriptions (a program of executing those whom he perceived as enemies of the state). Plutarch states in his “Life” of Sulla (XXXI): “Sulla now began to make blood flow, and he filled the city with deaths without number or limit”, further alleging that many of the murdered victims had nothing to do with Sulla, though Sulla killed them to “please his adherents”.</p><p>“Sulla immediately proscribed eighty persons without communicating with any magistrate. As this caused a general murmur, he let one day pass, and then proscribed two hundred and twenty more, and again on the third day as many. In an harangue to the people, he said, with reference to these measures, that he had proscribed all he could think of, and as to those who now escaped his memory, he would proscribe them at some future time.” -Plutarch, Life of Sulla (XXXI)</p><p>The proscriptions are widely perceived as a response to similar killings which Marius and Cinna had implemented while they controlled the Republic during Sulla’s absence. Proscribing or outlawing every one of those whom he perceived to have acted against the best interests of the Republic while he was in the East, Sulla ordered some 1,500 nobles (i.e., senators and equites) executed, although it is estimated that as many as 9,000 people were killed. The purge went on for several months. Helping or sheltering a proscribed person was punishable by death, while killing a proscribed person was rewarded with two talents. Family members of the proscribed were not excluded from punishment, and slaves were not excluded from rewards. As a result, “husbands were butchered in the arms of their wives, sons in the arms of their mothers”. The majority of the proscribed had not been enemies of Sulla, but instead were killed for their property, which was confiscated and auctioned off. The proceeds from auctioned property more than made up for the cost of rewarding those who killed the proscribed, making Sulla even wealthier. Possibly to protect himself from future political retribution, Sulla had the sons and grandsons of the proscribed banned from running for political office, a restriction not removed for over 30 years.</p></div>",
  "content_text": "I so despise the sort of midwit who leaps upon every possible opportunity to “correct” someone in order to show off how smart he is, and in doing so, demonstrates his own ignorance. Add in a dash of smug passive-aggression if you want to maximize the annoyance factor. Here is a suggestion: if you think I’ve gotten something wrong,\nlook it up\n. If the 14 years of this blog serve as a reliable guide, there is about a 98 percent chance you are wrong.\nVD: We can only hope that he will treat them in much the same way Sulla treated his political opponents\nvaliance: The way *Marius* treated his political opponents, surely?\nVD: No.\nFrom Infogalactic:\nSulla\nAt the end of 82 BC or the beginning of 81 BC, the Senate appointed Sulla dictator legibus faciendis et reipublicae constituendae causa (“dictator for the making of laws and for the settling of the constitution”). The “Assembly of the People” subsequently ratified the decision, with no limit set on his time in office. Sulla had total control of the city and republic of Rome, except for Hispania (which Marius’s general Quintus Sertorius had established as an independent state). This unusual appointment (used hitherto only in times of extreme danger to the city, such as during the Second Punic War, and then only for 6-month periods) represented an exception to Rome’s policy of not giving total power to a single individual. Sulla can be seen as setting the precedent for Julius Caesar’s dictatorship, and for the eventual end of the Republic under Augustus.\nIn total control of the city and its affairs, Sulla instituted a series of proscriptions (a program of executing those whom he perceived as enemies of the state). Plutarch states in his “Life” of Sulla (XXXI): “Sulla now began to make blood flow, and he filled the city with deaths without number or limit”, further alleging that many of the murdered victims had nothing to do with Sulla, though Sulla killed them to “please his adherents”.\n“Sulla immediately proscribed eighty persons without communicating with any magistrate. As this caused a general murmur, he let one day pass, and then proscribed two hundred and twenty more, and again on the third day as many. In an harangue to the people, he said, with reference to these measures, that he had proscribed all he could think of, and as to those who now escaped his memory, he would proscribe them at some future time.” -Plutarch, Life of Sulla (XXXI)\nThe proscriptions are widely perceived as a response to similar killings which Marius and Cinna had implemented while they controlled the Republic during Sulla’s absence. Proscribing or outlawing every one of those whom he perceived to have acted against the best interests of the Republic while he was in the East, Sulla ordered some 1,500 nobles (i.e., senators and equites) executed, although it is estimated that as many as 9,000 people were killed. The purge went on for several months. Helping or sheltering a proscribed person was punishable by death, while killing a proscribed person was rewarded with two talents. Family members of the proscribed were not excluded from punishment, and slaves were not excluded from rewards. As a result, “husbands were butchered in the arms of their wives, sons in the arms of their mothers”. The majority of the proscribed had not been enemies of Sulla, but instead were killed for their property, which was confiscated and auctioned off. The proceeds from auctioned property more than made up for the cost of rewarding those who killed the proscribed, making Sulla even wealthier. Possibly to protect himself from future political retribution, Sulla had the sons and grandsons of the proscribed banned from running for political office, a restriction not removed for over 30 years.",
  "tags": [
    "history",
    "mailvox",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-04T16:00:00+00:00"
}