{
  "url": "https://voxday.net/2017/12/03/mailvox-back-for-more/",
  "scraped_at": "2025-12-19T10:33:41.150147",
  "title": "Mailvox: back for more",
  "date_display": "December 3, 2017",
  "date_iso": "2017-12-03T10:41:00+00:00",
  "date_from_url": "2017-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It never ceases to amaze me how these idiots read a single paragraph I have written on a subject and then assume that it comprises the totality of my thoughts on the matter. Yesterday’s emailer, Donny, decides to come back for more</p><blockquote><p>I see that you have published my email to you and John.  Well, that’s fine.  I wish I had clarified that my public service at a community college was in addition to my regular job (commodities trader) and those eleven years ended twenty years ago.  You and some of your commenters had fun with that.</p><p>To the matter at hand, John’s speech at Mencken asked:  “I’d like to see a good logical proof of the proposition that free trade requires free movement of peoples.”</p><p>Your November 9th post (which I discovered from a link in John’s December 1st posting) responded in two paragraphs.  In the first you write “free trade requires the free movement of peoples.”  No, it doesn’t, except in a pedantic “by definition” sense.  As commenter Austin Ballast said, “You still have blinders on VD. Free trade in goods does not require free trade in people, assuming people are not the goods.”</p><p>Without regard to minutia such as one commenter’s (SAK) concern for a foreign nation making the chips in our missiles, the big picture on trade is that it is beneficial to both parties trading.  That big picture remains even if we tighten against visa over-stayers, chain-migration and Rio Grande swimmers.</p><p>In your second paragraph you speak of “maximum efficiencies theoretically provided” and “maximum growth potential” but less than maximum is still mutually beneficial in the big picture sense.  I made these points in my email to John which I copied to you as a matter of courtesy, since the two of you are so deferential to each other.</p><p>In response to my email, you ask, “what two points is the clueless professor failing to take into account here?” as if simply asking makes your points.  Again, Austin Ballast, “VD, you treat this idea more as an axiom than something you have really proven. That is a basic flaw. It may seem obvious to you, but that does not make it true.”</p><p>Then you ask, “where is the evidence that free trade in goods without free trade in labor is even materially possible” which is facile.  I agree that visa over-stayers, chain-migration and Rio Grande swimmers are a challenge, but why does that prevent the trade of a container of computers for Africa in exchange for a sum of gold?</p><p>Your bullying manner may appeal to the members of your audience with a sadistic bent but I am not distracted from the fact that you have been twice unresponsive to the challenge John posed:  “I’d like to see a good logical proof of the proposition that free trade requires free movement of peoples.”</p></blockquote><p>It’s not so much that I am sadistic as these stubborn ignoramuses tend to be masochistic. Donny isn’t distracted from the fact that I’m repeatedly unresponsive to demands to provide a good logical proof of the proposition that water is wet. Just as being wet is an attribute of water, the free movement of labor is an intrinsic attribute of free trade. What Donny complains is a “pedantic ‘by definition’ sense” is literally <i>what free trade is</i>. Every argument, every economic law, that supports the free trade in x also supports free trade in y. All of them. No exceptions.</p><p>Austin Ballast’s comment is particularly stupid. He is projecting the blinders he mentions, because his statement is simply irrelevant. He might as well have said “free trade in cars does not require free trade in computers.” But it does, for the obvious reason that if you are engaged in trading cars without restriction but restricting trade in computers, <i>you are not engaged in free trade</i>. You are simply doing what nearly all states have done for all of human history in restricting the trade in some goods while permitting it in others.</p><p>What Donny and some other advocates of “free trade in goods, but not capital, services, or labor” want is to be able to draw the line in a different place than other trade protectionists, but dishonestly avail themselves of the rhetoric of free trade and the ability to appeal emotionally to the language of freedom and liberty.</p><p>But as he has asked for an actual proof, I will provide him with a logically unassailable one, one with which he will quibble, but in vain. After all, what can be easier than to prove that water is wet?</p><ol><li>The sole justification for distinguishing in economic theory between domestic and foreign trade is to be found in the fact that in the case of the former there is free mobility of capital and labor, whereas this is not true with regards to the commerce between nations.</li><li>The basis for restricting the free trade in goods between nations is an invisible judicial line that separates one nation from the other.</li><li>The same logic and ethics apply to people who want to trade on both sides of the invisible judicial line known as a national border, which renders this basis for restricting the free trade in goods between nations both false and illegitimate.</li><li>Because the basis for restricting the free trade in goods between nations is false and illegitimate, it cannot logically or ethically restrict that free trade in goods.</li><li>This invisible judicial line that cannot logically or ethically restrict the free trade in goods between nations does not magically materialize when labor and capital cross it.</li><li>Therefore, there is no legitimate justification for distinguishing between domestic and foreign trade in economic theory.</li><li>Therefore, any logical, ethical, or theoretical argument for the free trade in goods encompasses the free trade in capital and labor as well.</li></ol><p>Those who are sufficiently well-educated in economics will recognize the sources of at least three of those points as well as their impeccably free trade credentials. Unlike Donny and Austin, I do not attack strawmen of my own imagination, but rather, the actual arguments made by the strongest proponents.</p><p>What both of them failed to grasp is that simply mentioning the fact that there are beneficial <i>aspects </i>to free trade, limited or not, does not mean that free trade is <i>net beneficial</i>, even if it is limited only to goods or a given set of goods. I do not deny that free trade benefits certain parties, the point is that it also harms other parties whose costs are never factored into the equation. The point that I was making  when I referred to the maximum efficiencies provided is that the argument for economic efficiency to which free traders so often appeal – free trade is good for the economy – <i>necessarily </i>and <i>intrinsically </i>includes the free movement of labor and capital. If one is going to appeal to the good of the economy as a whole without considering the costs to various elements of the economy, then it is every bit as reasonable to argue for the free movement of labor combined with restricting the movement of goods as it is to argue the reverse.</p><p>Indeed, if we are to use GDP as our primary metric as so many free trade advocates do, one can make a considerably stronger case for free trade in labor combined with a restricted trade in goods than one can for the reverse.</p></div>",
  "content_text": "It never ceases to amaze me how these idiots read a single paragraph I have written on a subject and then assume that it comprises the totality of my thoughts on the matter. Yesterday’s emailer, Donny, decides to come back for more\nI see that you have published my email to you and John.  Well, that’s fine.  I wish I had clarified that my public service at a community college was in addition to my regular job (commodities trader) and those eleven years ended twenty years ago.  You and some of your commenters had fun with that.\nTo the matter at hand, John’s speech at Mencken asked:  “I’d like to see a good logical proof of the proposition that free trade requires free movement of peoples.”\nYour November 9th post (which I discovered from a link in John’s December 1st posting) responded in two paragraphs.  In the first you write “free trade requires the free movement of peoples.”  No, it doesn’t, except in a pedantic “by definition” sense.  As commenter Austin Ballast said, “You still have blinders on VD. Free trade in goods does not require free trade in people, assuming people are not the goods.”\nWithout regard to minutia such as one commenter’s (SAK) concern for a foreign nation making the chips in our missiles, the big picture on trade is that it is beneficial to both parties trading.  That big picture remains even if we tighten against visa over-stayers, chain-migration and Rio Grande swimmers.\nIn your second paragraph you speak of “maximum efficiencies theoretically provided” and “maximum growth potential” but less than maximum is still mutually beneficial in the big picture sense.  I made these points in my email to John which I copied to you as a matter of courtesy, since the two of you are so deferential to each other.\nIn response to my email, you ask, “what two points is the clueless professor failing to take into account here?” as if simply asking makes your points.  Again, Austin Ballast, “VD, you treat this idea more as an axiom than something you have really proven. That is a basic flaw. It may seem obvious to you, but that does not make it true.”\nThen you ask, “where is the evidence that free trade in goods without free trade in labor is even materially possible” which is facile.  I agree that visa over-stayers, chain-migration and Rio Grande swimmers are a challenge, but why does that prevent the trade of a container of computers for Africa in exchange for a sum of gold?\nYour bullying manner may appeal to the members of your audience with a sadistic bent but I am not distracted from the fact that you have been twice unresponsive to the challenge John posed:  “I’d like to see a good logical proof of the proposition that free trade requires free movement of peoples.”\nIt’s not so much that I am sadistic as these stubborn ignoramuses tend to be masochistic. Donny isn’t distracted from the fact that I’m repeatedly unresponsive to demands to provide a good logical proof of the proposition that water is wet. Just as being wet is an attribute of water, the free movement of labor is an intrinsic attribute of free trade. What Donny complains is a “pedantic ‘by definition’ sense” is literally\nwhat free trade is\n. Every argument, every economic law, that supports the free trade in x also supports free trade in y. All of them. No exceptions.\nAustin Ballast’s comment is particularly stupid. He is projecting the blinders he mentions, because his statement is simply irrelevant. He might as well have said “free trade in cars does not require free trade in computers.” But it does, for the obvious reason that if you are engaged in trading cars without restriction but restricting trade in computers,\nyou are not engaged in free trade\n. You are simply doing what nearly all states have done for all of human history in restricting the trade in some goods while permitting it in others.\nWhat Donny and some other advocates of “free trade in goods, but not capital, services, or labor” want is to be able to draw the line in a different place than other trade protectionists, but dishonestly avail themselves of the rhetoric of free trade and the ability to appeal emotionally to the language of freedom and liberty.\nBut as he has asked for an actual proof, I will provide him with a logically unassailable one, one with which he will quibble, but in vain. After all, what can be easier than to prove that water is wet?\nThe sole justification for distinguishing in economic theory between domestic and foreign trade is to be found in the fact that in the case of the former there is free mobility of capital and labor, whereas this is not true with regards to the commerce between nations.\nThe basis for restricting the free trade in goods between nations is an invisible judicial line that separates one nation from the other.\nThe same logic and ethics apply to people who want to trade on both sides of the invisible judicial line known as a national border, which renders this basis for restricting the free trade in goods between nations both false and illegitimate.\nBecause the basis for restricting the free trade in goods between nations is false and illegitimate, it cannot logically or ethically restrict that free trade in goods.\nThis invisible judicial line that cannot logically or ethically restrict the free trade in goods between nations does not magically materialize when labor and capital cross it.\nTherefore, there is no legitimate justification for distinguishing between domestic and foreign trade in economic theory.\nTherefore, any logical, ethical, or theoretical argument for the free trade in goods encompasses the free trade in capital and labor as well.\nThose who are sufficiently well-educated in economics will recognize the sources of at least three of those points as well as their impeccably free trade credentials. Unlike Donny and Austin, I do not attack strawmen of my own imagination, but rather, the actual arguments made by the strongest proponents.\nWhat both of them failed to grasp is that simply mentioning the fact that there are beneficial\naspects\nto free trade, limited or not, does not mean that free trade is\nnet beneficial\n, even if it is limited only to goods or a given set of goods. I do not deny that free trade benefits certain parties, the point is that it also harms other parties whose costs are never factored into the equation. The point that I was making  when I referred to the maximum efficiencies provided is that the argument for economic efficiency to which free traders so often appeal – free trade is good for the economy –\nnecessarily\nand\nintrinsically\nincludes the free movement of labor and capital. If one is going to appeal to the good of the economy as a whole without considering the costs to various elements of the economy, then it is every bit as reasonable to argue for the free movement of labor combined with restricting the movement of goods as it is to argue the reverse.\nIndeed, if we are to use GDP as our primary metric as so many free trade advocates do, one can make a considerably stronger case for free trade in labor combined with a restricted trade in goods than one can for the reverse.",
  "tags": [
    "economics",
    "freetrade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-03T10:41:00+00:00"
}