{
  "url": "https://voxday.net/2017/12/06/mailvox-throwing-girls-to-the-wolves/",
  "scraped_at": "2025-12-19T10:34:02.002795",
  "title": "Mailvox: throwing girls to the wolves",
  "date_display": "December 6, 2017",
  "date_iso": "2017-12-06T10:16:00+00:00",
  "date_from_url": "2017-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rollory disapproves of men protecting their daughters. He claims Dalrock does too, although I would not be so sure of that.</p><blockquote><p>This is the sort of thing Dalrock rips to shreds every chance he gets. I don’t always agree with every detail of his argument but it’s definitely worth thinking about.</p><p>The message this shirt is sending is “I belong to my daddy, not to the young man who might otherwise be interested.” It’s crazy for the young woman, it’s crazy for the father, and any young man who is sane will receive the message loud and clear and stay far away, choosing instead another girl whose father ISN’T playing the overprotective sexually jealous guardian.</p><p>An excess of suitable young grooms needing ever stricter winnowing is not at all the problem facing marriageable young women today. Again, Dalrock has covered this, and continues to do so.</p></blockquote><p>Dalrock is good on many subjects, particularly on the Church and feminism, but if Rollory is correct and <a href=\"https://crypto.fashion/products/that-red-dot-on-your-chest-means-my-daddy-is-watching-ladies-tee-v-neck\">the message on this t-shirt</a> is the sort of thing that Dalrock rips to shreds every chance he gets, then he doesn’t understand female psychology very well, nor would he appear to have daughters or sisters. It may help to keep in mind that <a href=\"http://voxday.blogspot.com/2009/09/daddy-is-watching.html\">this is the original context</a> of the phrase.</p><ol><li><i>Take a position on high ground somewhere in the middle with clean sight lines of the entire route.</i></li><li><i>Load a round into your .50 caliber rifle.</i></li><li><i>Take the lens covers off the scope.</i></li><li><i>Watch as your little girl walks off to school by herself.</i></li></ol><p>There is nothing crazy about a father being protective of his daughters. There is nothing even remotely crazy about a young woman wanting to feel protected by her daddy. While people can, and do, go too far – and anything that is more suited for a wedding or a high school prom is going too far – there is nothing overprotective or “sexually jealous” about paternal protectiveness; anyone leaping to that conclusion is raising <i>serious</i> questions about their own psychosexual issues. The ironic thing about citing Dalrock in this regard is that Dalrock regularly complains about “feral” young women; he even has a category called <a href=\"https://dalrock.wordpress.com/category/feral-females/\">Feral Females</a>.</p><p>Now, where do you suppose feral young women come from, families where men protect their daughters or families where men simply throw their daughters to the vagaries of sexual selection, to fend off the predators as best they can on their own? The symbolism of the t-shirt is less about winnowing the suitable young grooms, than it is about giving the daughter the strength and the permission to say “no” to the wrong ones in the full knowledge that her father will have her back.</p><p>But as it happens, the real target of the message is not men. The t-shirt is actually status-signaling on the part of the daughter, or the wife, when that version of the t-shirt is ready. It is less a warning to young men than it is bragging to other young women that <i>she </i>is valued, that <i>she </i>is loved, and that <i>she </i>is worthy of protection by a man who is strong enough to provide it for her. Both Dalrock and Rollory appear to have forgotten that support and protection are the two primary male roles in every relationship with women and children, and that stable young women really do treasure those things.</p><p>I suspect a telling determinant will be who loves these shirts and who hates them. My prediction is that good girls from strong families will love the message and feminists will <i>furiously </i>hate it. The more interesting question, and one to which I do not have an answer, is: why do men like Dalrock and Rollory dislike it so much?</p><p>Regardless, King Edward’s motto is appropriate.<br><i><br/></i><i>Honi soit qui mal y pense.</i><br><i><br/></i><br>UPDATE: since we’re discussing the shirt, I should mention that <a href=\"https://crypto.fashion/collections/dark-lord-designs/products/that-red-dot-on-your-chest-means-my-daddy-is-watching-ladies-tee-v-neck\">the long-sleeve crewneck version</a> is now available as well.</br></br></br></p></div>",
  "content_text": "Rollory disapproves of men protecting their daughters. He claims Dalrock does too, although I would not be so sure of that.\nThis is the sort of thing Dalrock rips to shreds every chance he gets. I don’t always agree with every detail of his argument but it’s definitely worth thinking about.\nThe message this shirt is sending is “I belong to my daddy, not to the young man who might otherwise be interested.” It’s crazy for the young woman, it’s crazy for the father, and any young man who is sane will receive the message loud and clear and stay far away, choosing instead another girl whose father ISN’T playing the overprotective sexually jealous guardian.\nAn excess of suitable young grooms needing ever stricter winnowing is not at all the problem facing marriageable young women today. Again, Dalrock has covered this, and continues to do so.\nDalrock is good on many subjects, particularly on the Church and feminism, but if Rollory is correct and\nthe message on this t-shirt\nis the sort of thing that Dalrock rips to shreds every chance he gets, then he doesn’t understand female psychology very well, nor would he appear to have daughters or sisters. It may help to keep in mind that\nthis is the original context\nof the phrase.\nTake a position on high ground somewhere in the middle with clean sight lines of the entire route.\nLoad a round into your .50 caliber rifle.\nTake the lens covers off the scope.\nWatch as your little girl walks off to school by herself.\nThere is nothing crazy about a father being protective of his daughters. There is nothing even remotely crazy about a young woman wanting to feel protected by her daddy. While people can, and do, go too far – and anything that is more suited for a wedding or a high school prom is going too far – there is nothing overprotective or “sexually jealous” about paternal protectiveness; anyone leaping to that conclusion is raising\nserious\nquestions about their own psychosexual issues. The ironic thing about citing Dalrock in this regard is that Dalrock regularly complains about “feral” young women; he even has a category called\nFeral Females\n.\nNow, where do you suppose feral young women come from, families where men protect their daughters or families where men simply throw their daughters to the vagaries of sexual selection, to fend off the predators as best they can on their own? The symbolism of the t-shirt is less about winnowing the suitable young grooms, than it is about giving the daughter the strength and the permission to say “no” to the wrong ones in the full knowledge that her father will have her back.\nBut as it happens, the real target of the message is not men. The t-shirt is actually status-signaling on the part of the daughter, or the wife, when that version of the t-shirt is ready. It is less a warning to young men than it is bragging to other young women that\nshe\nis valued, that\nshe\nis loved, and that\nshe\nis worthy of protection by a man who is strong enough to provide it for her. Both Dalrock and Rollory appear to have forgotten that support and protection are the two primary male roles in every relationship with women and children, and that stable young women really do treasure those things.\nI suspect a telling determinant will be who loves these shirts and who hates them. My prediction is that good girls from strong families will love the message and feminists will\nfuriously\nhate it. The more interesting question, and one to which I do not have an answer, is: why do men like Dalrock and Rollory dislike it so much?\nRegardless, King Edward’s motto is appropriate.\nHoni soit qui mal y pense.\nUPDATE: since we’re discussing the shirt, I should mention that\nthe long-sleeve crewneck version\nis now available as well.",
  "tags": [
    "mailvox",
    "society",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-06T10:16:00+00:00"
}