{
  "url": "https://voxday.net/2017/12/01/miscarriage-of-justice-or-prosecutorial-overreach/",
  "scraped_at": "2025-12-19T10:33:29.340847",
  "title": "Miscarriage of justice or prosecutorial overreach",
  "date_display": "December 1, 2017",
  "date_iso": "2017-12-01T18:07:00+00:00",
  "date_from_url": "2017-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Both, I tend to think, in the case of <a href=\"http://sanfrancisco.cbslocal.com/2017/11/30/jury-reaches-verdict-in-steinle-murder-trial/\">the death of Kate Steinle</a>:</p><blockquote><p>Jurors Thursday afternoon acquitted the illegal immigrant accused of killing Kate Steinle as she walked with her father on a crowded San Francisco pier of all charges except for felony possession of a firearm.</p><p>A spokesperson for the Superior Court of California made the announcement that the jury had reached a verdict shortly after 3 p.m. Shortly after 4:30 p.m., the shocking verdict was announced that Jose Ines Garcia Zarate was found not guilty of all charges except for the gun possession charge.</p><p>The jury of six women and six men considered charges against Garcia Zarate that include murder, assault with a deadly weapon and being a felon in possession of a firearm in the death of Steinle, a 32-year-old Pleasanton native and San Francisco resident.</p></blockquote><p>The problem is that the killing quite clearly wasn’t Murder One. Unless the prosecutor wanted to argue that the killer was some sort of Deadshot-style supervillain utilizing a bank shot, there is no reasonable way to claim that a <i>ricochet </i>was an intentional murder. Nor would it appear likely that any assault was intended; what I can’t understand is why there was no conviction for manslaughter.</p><p>That being said, the fact that the man was in the country at all after being deported is inexcusable. Given that illegal immigrants – and legal immigrants, for that matter – have no rights under the U.S. Constitution despite what the Supreme Interpreters claim – there is no reason why a felony or even a misdemeanor conviction by an illegal immigrant should not be a capital offense.</p><p>But regardless, one thing is clear. BUILD THE WALL!</p></div>",
  "content_text": "Both, I tend to think, in the case of\nthe death of Kate Steinle\n:\nJurors Thursday afternoon acquitted the illegal immigrant accused of killing Kate Steinle as she walked with her father on a crowded San Francisco pier of all charges except for felony possession of a firearm.\nA spokesperson for the Superior Court of California made the announcement that the jury had reached a verdict shortly after 3 p.m. Shortly after 4:30 p.m., the shocking verdict was announced that Jose Ines Garcia Zarate was found not guilty of all charges except for the gun possession charge.\nThe jury of six women and six men considered charges against Garcia Zarate that include murder, assault with a deadly weapon and being a felon in possession of a firearm in the death of Steinle, a 32-year-old Pleasanton native and San Francisco resident.\nThe problem is that the killing quite clearly wasn’t Murder One. Unless the prosecutor wanted to argue that the killer was some sort of Deadshot-style supervillain utilizing a bank shot, there is no reasonable way to claim that a\nricochet\nwas an intentional murder. Nor would it appear likely that any assault was intended; what I can’t understand is why there was no conviction for manslaughter.\nThat being said, the fact that the man was in the country at all after being deported is inexcusable. Given that illegal immigrants – and legal immigrants, for that matter – have no rights under the U.S. Constitution despite what the Supreme Interpreters claim – there is no reason why a felony or even a misdemeanor conviction by an illegal immigrant should not be a capital offense.\nBut regardless, one thing is clear. BUILD THE WALL!",
  "tags": [
    "immigration",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-01T18:07:00+00:00"
}