{
  "url": "https://voxday.net/2017/12/19/panic-in-dc/",
  "scraped_at": "2025-12-19T10:35:43.681453",
  "title": "Panic in DC",
  "date_display": "December 19, 2017",
  "date_iso": "2017-12-19T12:00:00+00:00",
  "date_from_url": "2017-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bizarre train derailment in Washington was reportedly in retaliation for the God-Emperor’s action in Atlanta. It appears that the bad actors are attempting to flee the USA, as we have been told that the end is near, there are now 19 operations in action, and 12 more proffered deals were rejected yesterday.</p><p>And above all, <i>trust the Grand Inquisitor</i>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://i0.kym-cdn.com/photos/images/original/000/855/340/23b.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"599\" data-original-width=\"599\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://i0.kym-cdn.com/photos/images/original/000/855/340/23b.jpg\" width=\"400\"/></a></div><p>It is not insignificant that the God-Emperor recited these words yesterday. They were both a reminder and a warning: <i>“With this strategy, we are calling for a great reawakening of America, a resurgence of confidence, and a rebirth of patriotism, prosperity, and pride. And we are returning to the wisdom of our founders.  In America, the people govern, the people rule, and the people are sovereign.”</i></p><p>Translation: The Deep State does not govern, the globalists do not rule, and Satan is not sovereign.</p><p>UPDATE: I’ve been told that George Soros has been arrested – there is some belief that he was the target of the Atlanta operation – and that Al-Waleed bin Talal is now in US custody as well, but be aware these reports have <u>NOT</u> been confirmed. This may explain the recent Twitter crackdown as well as the Washington Post leaks; it appears the media is desperately attempting to concoct some sort of anti-Trump narrative to defend the Deep State by provoking a Constitutional crisis if/when the Clintons are arrested. Given Speaker Ryan’s unexpected announcement that he’ll be stepping down from Congress next year, that attempt appears to be an abortive one.</p><p>(And really, no one finds anything suspicious about Ryan’s announced resignation in light of how long almost every previous Speaker has presided? Even John Boehner, who resigned after only four years, lasted longer.)</p><p>Again, we can’t know if any of this is true or if it is merely wishful thinking on the part of patriots. This can be easily rebutted by simply demonstrating that George Soros is out and about somewhere, although I note that he hasn’t tweeted since November 26th. Regardless, events do appear to be coming to a head of sorts, and if even one-quarter of what is being discussed happens, it’s going to be important to be able to put these things in context for the great majority of Americans who will be caught completely off-guard by them.</p><p>UPDATE: This would appear to be pertinent.</p><blockquote class=\"tr_bq\"><p>A MISSILE fired at Saudi Arabia’s capital Riyadh was shot down moments before it hit a royal palace today. Mohammed Abdussalam said on Twitter that a Volcano 2-H ballistic missile was fired towards al-Yamama royal palace.</p></blockquote><p>I wonder who was in it.</p></div>",
  "content_text": "The bizarre train derailment in Washington was reportedly in retaliation for the God-Emperor’s action in Atlanta. It appears that the bad actors are attempting to flee the USA, as we have been told that the end is near, there are now 19 operations in action, and 12 more proffered deals were rejected yesterday.\nAnd above all,\ntrust the Grand Inquisitor\n.\nIt is not insignificant that the God-Emperor recited these words yesterday. They were both a reminder and a warning:\n“With this strategy, we are calling for a great reawakening of America, a resurgence of confidence, and a rebirth of patriotism, prosperity, and pride. And we are returning to the wisdom of our founders.  In America, the people govern, the people rule, and the people are sovereign.”\nTranslation: The Deep State does not govern, the globalists do not rule, and Satan is not sovereign.\nUPDATE: I’ve been told that George Soros has been arrested – there is some belief that he was the target of the Atlanta operation – and that Al-Waleed bin Talal is now in US custody as well, but be aware these reports have\nNOT\nbeen confirmed. This may explain the recent Twitter crackdown as well as the Washington Post leaks; it appears the media is desperately attempting to concoct some sort of anti-Trump narrative to defend the Deep State by provoking a Constitutional crisis if/when the Clintons are arrested. Given Speaker Ryan’s unexpected announcement that he’ll be stepping down from Congress next year, that attempt appears to be an abortive one.\n(And really, no one finds anything suspicious about Ryan’s announced resignation in light of how long almost every previous Speaker has presided? Even John Boehner, who resigned after only four years, lasted longer.)\nAgain, we can’t know if any of this is true or if it is merely wishful thinking on the part of patriots. This can be easily rebutted by simply demonstrating that George Soros is out and about somewhere, although I note that he hasn’t tweeted since November 26th. Regardless, events do appear to be coming to a head of sorts, and if even one-quarter of what is being discussed happens, it’s going to be important to be able to put these things in context for the great majority of Americans who will be caught completely off-guard by them.\nUPDATE: This would appear to be pertinent.\nA MISSILE fired at Saudi Arabia’s capital Riyadh was shot down moments before it hit a royal palace today. Mohammed Abdussalam said on Twitter that a Volcano 2-H ballistic missile was fired towards al-Yamama royal palace.\nI wonder who was in it.",
  "tags": [
    "conspiracy",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-19T12:00:00+00:00"
}