{
  "url": "https://voxday.net/2017/12/20/spammees-double-down/",
  "scraped_at": "2025-12-19T10:35:49.608682",
  "title": "Spammees double down",
  "date_display": "December 20, 2017",
  "date_iso": "2017-12-20T09:14:00+00:00",
  "date_from_url": "2017-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of you have been complaining that Blogger has tightened its spam filters and you’ve been getting caught up in it. First of all, this is true and it is why we have been seeing less spam and fewer trolls of late. Second, I am completely unsympathetic because <i>this is exactly what I told you would happen</i> if you touched the poop. You were warned, you couldn’t control yourself, you did it, and now you’re suffering the consequences.</p><p>Third, if you’re dumb enough to try to defeat the spam filters by – and I cannot believe I actually have to point this out to anyone – <i>reposting exactly the same comment that was previously spammed</i>, all you’re doing is confirming to the spam filters that you are a spammer. You’re actually making the situation worse for yourself, because while the moderators can remove a single spammed comment from the filters, reposted comments get deleted, which strengthens the filters’ confidence that your comments are, indeed, spam that merits removal.</p><p>In the event that your comment fails to appear or mysteriously vanishes, the correct thing to do is nothing. Do not alert me or the moderators. Do not attempt to immediately comment again and absolutely do not repost your cut-and-pasted comment. If a single comment from a known commenter is seen in the spam, it will eventually be seen and restored by the moderators and the spam filters will gradually learn over time that your comments are not spam. In the meantime, rest assured that the other readers will do their best to survive despite being temporarily bereft of your valuable insights.</p></div>",
  "content_text": "Some of you have been complaining that Blogger has tightened its spam filters and you’ve been getting caught up in it. First of all, this is true and it is why we have been seeing less spam and fewer trolls of late. Second, I am completely unsympathetic because\nthis is exactly what I told you would happen\nif you touched the poop. You were warned, you couldn’t control yourself, you did it, and now you’re suffering the consequences.\nThird, if you’re dumb enough to try to defeat the spam filters by – and I cannot believe I actually have to point this out to anyone –\nreposting exactly the same comment that was previously spammed\n, all you’re doing is confirming to the spam filters that you are a spammer. You’re actually making the situation worse for yourself, because while the moderators can remove a single spammed comment from the filters, reposted comments get deleted, which strengthens the filters’ confidence that your comments are, indeed, spam that merits removal.\nIn the event that your comment fails to appear or mysteriously vanishes, the correct thing to do is nothing. Do not alert me or the moderators. Do not attempt to immediately comment again and absolutely do not repost your cut-and-pasted comment. If a single comment from a known commenter is seen in the spam, it will eventually be seen and restored by the moderators and the spam filters will gradually learn over time that your comments are not spam. In the meantime, rest assured that the other readers will do their best to survive despite being temporarily bereft of your valuable insights.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-20T09:14:00+00:00"
}