{
  "url": "https://voxday.net/2017/12/18/star-wars-is-not-science-fiction/",
  "scraped_at": "2025-12-19T10:35:33.340229",
  "title": "Star Wars is not science fiction",
  "date_display": "December 18, 2017",
  "date_iso": "2017-12-18T13:00:00+00:00",
  "date_from_url": "2017-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk, who knows a thing or two about science fiction, explains:</p><p><i>Vox, my young friend, I should think that you of all people would appreciate the true genius of J. J. Abrams. If he’d chosen to go into music he would have been one of those guys who said “Screw actually learning to play an instrument” and parked himself in a recording studio with a drum machine, a sampler, two turntables and a microphone, and then spent his days churning out hit single after hit single by sampling, looping, and remixing earlier hit singles.</i><br><i><br/></i><i>Instead, he chose to go into film-making, where he is doing exactly the same thing: compositing together commercially successful movies by lifting scenes, bits of business, and entire set pieces from earlier successful movies. He is the first fully realized hip-hop filmmaker.</i><br><i><br/></i><i>I should think you of all people would appreciate that.</i><br><i><br/></i><i>By the way, <a href=\"http://stupefyingstories.blogspot.com/2017/12/a-little-something-for-weekend_16.html\">here’s my review</a>: </i></br></br></br></p><blockquote><p>Saw this movie, we did. Long, it is. Impossible to write a substantive review without including spoilers, it may be. Nonetheless, try I will.</p><p>In the interests of full disclosure, though, I must lead off this review by pointing out that I contributed not one but two essays to David Brin’s <i>Star Wars on Trial</i>, the first arguing in favor of the original Star Wars trilogy as a watershed moment in cinematic history and the second absolutely slagging the prequel trilogy as childish tripe. So I come into this review with a long history as both a consumer and critic of Star Wars entertainment products, and I will put my greatest heresy on the table right now:</p><p><b>Star Wars is not science fiction.</b></p><p>Sure, it looks like science fiction. It sounds like science fiction. And based on that guy in the wookiee costume who was ahead of us in the concession line, it even smells like science fiction, or at least like the third day of a furry fandom convention.</p><p>But Star Wars is not science fiction. It’s a long-winded heroic magical fantasy saga that happens to take place in a world cluttered up with lots of sci-fi props and set dressings. If considered as science fiction, there is not one thing in the entire Star Wars universe that bears close scrutiny, because if you think about it at all seriously, the seams split and all the nonsense comes pouring out.</p></blockquote><p>Read the rest of it there. It is… informative. As for J.J. Abrams, I appreciate that he is good at what he does. I just don’t like what he does. That stupid “mystery box” formula of his is the sure sign of a storytelling charlatan.</p></div>",
  "content_text": "The Original Cyberpunk, who knows a thing or two about science fiction, explains:\nVox, my young friend, I should think that you of all people would appreciate the true genius of J. J. Abrams. If he’d chosen to go into music he would have been one of those guys who said “Screw actually learning to play an instrument” and parked himself in a recording studio with a drum machine, a sampler, two turntables and a microphone, and then spent his days churning out hit single after hit single by sampling, looping, and remixing earlier hit singles.\nInstead, he chose to go into film-making, where he is doing exactly the same thing: compositing together commercially successful movies by lifting scenes, bits of business, and entire set pieces from earlier successful movies. He is the first fully realized hip-hop filmmaker.\nI should think you of all people would appreciate that.\nBy the way,\nhere’s my review\n:\nSaw this movie, we did. Long, it is. Impossible to write a substantive review without including spoilers, it may be. Nonetheless, try I will.\nIn the interests of full disclosure, though, I must lead off this review by pointing out that I contributed not one but two essays to David Brin’s\nStar Wars on Trial\n, the first arguing in favor of the original Star Wars trilogy as a watershed moment in cinematic history and the second absolutely slagging the prequel trilogy as childish tripe. So I come into this review with a long history as both a consumer and critic of Star Wars entertainment products, and I will put my greatest heresy on the table right now:\nStar Wars is not science fiction.\nSure, it looks like science fiction. It sounds like science fiction. And based on that guy in the wookiee costume who was ahead of us in the concession line, it even smells like science fiction, or at least like the third day of a furry fandom convention.\nBut Star Wars is not science fiction. It’s a long-winded heroic magical fantasy saga that happens to take place in a world cluttered up with lots of sci-fi props and set dressings. If considered as science fiction, there is not one thing in the entire Star Wars universe that bears close scrutiny, because if you think about it at all seriously, the seams split and all the nonsense comes pouring out.\nRead the rest of it there. It is… informative. As for J.J. Abrams, I appreciate that he is good at what he does. I just don’t like what he does. That stupid “mystery box” formula of his is the sure sign of a storytelling charlatan.",
  "tags": [
    "mailvox",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-18T13:00:00+00:00"
}