{
  "url": "https://voxday.net/2017/12/15/the-sickness-in-the-sfwa/",
  "scraped_at": "2025-12-19T10:35:13.992132",
  "title": "The sickness in the SFWA",
  "date_display": "December 15, 2017",
  "date_iso": "2017-12-15T18:00:00+00:00",
  "date_from_url": "2017-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Believe it or not, the current President of the SFWA is defending the pedophiles and child molesters of her organization and attempting to sweep Moira Greyland’s damning bestseller under the rug, probably because they have never expelled its inactive members who are convicted pedophiles or looked into the behavior of its Grand Masters such as Arthur C. Clarke and Samuel Delaney. <a href=\"http://delarroz.com/?p=1873\">John Del Arroz has more</a> about the vile behavior of Cat Rambo.</p><blockquote><p>It’s no wonder these people are so obsessed with “harassment policies”. One innocuous off-color joke by a Tor editor several years ago sent all of fandom spiraling and signalling. He was fired and ostracized from conventions after that. But it’s as they say, SJWs always project. The reason they focus so hard on what they call harassment, is they have far darker skeletons in their closets.  They know the actions they and their friends engage in, and so they have a hyper focus on the public appearance, the social element. They witch hunt average men to call harassers, all while on the other hand promoting the most deviant, pornographic lifestyles imaginable. Ironically, my wife, a far more beautiful woman than anyone you’ll see at a sci-fi con, has only had problems with men creeping on her and going over the line twice in her life — both by self-professed male feminist science fiction professionals and at science fiction conventions.</p><p>It was no wonder that yesterday, SFWA President Cat Rambo made a vile attempt to downplay Moira’s story of the abuse she suffered at the hands of Marion Zimmer Bradley. To someone like Rambo, MZB’s identity as a feminist and gay icon is far more important than the real human who was hurt. In her capacity at SFWA, Rambo should be championing Moira, a  best seller with a related work in the field — instead, she downplays the relevance in order to make more politically charged and wholly irrelevant attacks on the president. She’ll go so far as to protect the pedophiles in sci-fi that she’ll label anyone concerned over what happened to a real human being “alt-right” in order to dismiss them.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://delarroz.com/wp-content/uploads/2017/12/DRDyD7IUMAE4tb_.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"131\" data-original-width=\"800\" decoding=\"async\" height=\"65\" src=\"http://delarroz.com/wp-content/uploads/2017/12/DRDyD7IUMAE4tb_.jpg\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"131\" data-original-width=\"800\" data-src=\"http://delarroz.com/wp-content/uploads/2017/12/DRDyD7IUMAE4tb_.jpg\" decoding=\"async\" height=\"65\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20800%20131%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p>Sick. She refuses to disavow a dead pedophile and deflects. Why? We can only speculate, but from what I’ve observed in Sci-Fi fandom in conjunction with Moira’s story, MZB and Breen are not isolated incidents. The exposure of their story frightens the gatekeepers of the industry who have pushed an agenda of this lifestyle for decades.</p></blockquote><p>Cat Rambo is a complete trainwreck. She makes Stephen Gould look sane by comparison, and Gould actually honored<i> the author of </i><a href=\"https://www.amazon.com/Modern-Erotic-Classics-Samuel-Delany-ebook/dp/B0119PD272\"><i>Hogg</i> </a>by naming him an SFWA Grand Master.<i> </i>I have never been so proud to be the first SFWA Life Member to have had the SFWA Board vote for my expulsion. What sane, psychosexually healthy individual would want <i>anything </i>to do with such a deviant-filled degenerate organization?</p><p>Twitter <a href=\"https://twitter.com/Catrambo/status/941424039838474241\">was unimpressed</a>.</p><blockquote><p>J_Ishiro‏ @J_Ishiro<br>The SFWA and World Fantasy are so quick to condemn #hplovecraft’s racist opinions, yet won’t touch Marion Zimmer Bradley’s ACTUAL CRIMES? In her daughter’s own words, Bradley was a monster.</br></p><p>An Eclectic Scribe: Richard Paolinelli‏ @ScribesShade<br> Actually, just wondering how many more of them are being sheltered by the SFWA now like the one you just referenced. BTW, I never supported either Moore or Trump so your deflection attempt, much like your leadership of @SFWA, seems to be a complete failure.</br></p><p>superversivesf‏ @superversivesf<br>It is rather telling that you decline to denounce the behaviour of convicted pedophiles and child abusers with “What does it matter at this point?” WTF is wrong with you?</br></p><p>Henry Vogel‏ @HenryVogel_<br>SFWA Pres, who believes it’s more important to dig up a 60-year-old corpse than deal with the 20-year-old one in her organization’s basement.</br></p><p>BADKarma‏ @karmalysing<br>The Fascist Left, where viciously denouncing the victims of pervert abusive pedophiles is “being on the right side of history” if said pedophiles happen to be homosexual and famous.</br></p></blockquote><p>What’s Cat Rambo going to do for an encore, name the corpse of Marion Zimmer Bradley the 2018 Damon Knight Grand Master, then dig her up for the ceremony? If Rambo isn’t pressured to resign by the SFWA membership, that will speak <i>absolute volumes</i> about the deviants and pedophiles who are still lurking in their midst.</p></div>",
  "content_text": "Believe it or not, the current President of the SFWA is defending the pedophiles and child molesters of her organization and attempting to sweep Moira Greyland’s damning bestseller under the rug, probably because they have never expelled its inactive members who are convicted pedophiles or looked into the behavior of its Grand Masters such as Arthur C. Clarke and Samuel Delaney.\nJohn Del Arroz has more\nabout the vile behavior of Cat Rambo.\nIt’s no wonder these people are so obsessed with “harassment policies”. One innocuous off-color joke by a Tor editor several years ago sent all of fandom spiraling and signalling. He was fired and ostracized from conventions after that. But it’s as they say, SJWs always project. The reason they focus so hard on what they call harassment, is they have far darker skeletons in their closets.  They know the actions they and their friends engage in, and so they have a hyper focus on the public appearance, the social element. They witch hunt average men to call harassers, all while on the other hand promoting the most deviant, pornographic lifestyles imaginable. Ironically, my wife, a far more beautiful woman than anyone you’ll see at a sci-fi con, has only had problems with men creeping on her and going over the line twice in her life — both by self-professed male feminist science fiction professionals and at science fiction conventions.\nIt was no wonder that yesterday, SFWA President Cat Rambo made a vile attempt to downplay Moira’s story of the abuse she suffered at the hands of Marion Zimmer Bradley. To someone like Rambo, MZB’s identity as a feminist and gay icon is far more important than the real human who was hurt. In her capacity at SFWA, Rambo should be championing Moira, a  best seller with a related work in the field — instead, she downplays the relevance in order to make more politically charged and wholly irrelevant attacks on the president. She’ll go so far as to protect the pedophiles in sci-fi that she’ll label anyone concerned over what happened to a real human being “alt-right” in order to dismiss them.\nSick. She refuses to disavow a dead pedophile and deflects. Why? We can only speculate, but from what I’ve observed in Sci-Fi fandom in conjunction with Moira’s story, MZB and Breen are not isolated incidents. The exposure of their story frightens the gatekeepers of the industry who have pushed an agenda of this lifestyle for decades.\nCat Rambo is a complete trainwreck. She makes Stephen Gould look sane by comparison, and Gould actually honored\nthe author of\nHogg\nby naming him an SFWA Grand Master.\nI have never been so proud to be the first SFWA Life Member to have had the SFWA Board vote for my expulsion. What sane, psychosexually healthy individual would want\nanything\nto do with such a deviant-filled degenerate organization?\nTwitter\nwas unimpressed\n.\nJ_Ishiro‏ @J_Ishiro\nThe SFWA and World Fantasy are so quick to condemn #hplovecraft’s racist opinions, yet won’t touch Marion Zimmer Bradley’s ACTUAL CRIMES? In her daughter’s own words, Bradley was a monster.\nAn Eclectic Scribe: Richard Paolinelli‏ @ScribesShade\nActually, just wondering how many more of them are being sheltered by the SFWA now like the one you just referenced. BTW, I never supported either Moore or Trump so your deflection attempt, much like your leadership of @SFWA, seems to be a complete failure.\nsuperversivesf‏ @superversivesf\nIt is rather telling that you decline to denounce the behaviour of convicted pedophiles and child abusers with “What does it matter at this point?” WTF is wrong with you?\nHenry Vogel‏ @HenryVogel_\nSFWA Pres, who believes it’s more important to dig up a 60-year-old corpse than deal with the 20-year-old one in her organization’s basement.\nBADKarma‏ @karmalysing\nThe Fascist Left, where viciously denouncing the victims of pervert abusive pedophiles is “being on the right side of history” if said pedophiles happen to be homosexual and famous.\nWhat’s Cat Rambo going to do for an encore, name the corpse of Marion Zimmer Bradley the 2018 Damon Knight Grand Master, then dig her up for the ceremony? If Rambo isn’t pressured to resign by the SFWA membership, that will speak\nabsolute volumes\nabout the deviants and pedophiles who are still lurking in their midst.",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-15T18:00:00+00:00"
}