{
  "url": "https://voxday.net/2017/12/18/this-is-what-winning-looks-like-2/",
  "scraped_at": "2025-12-19T10:35:31.858296",
  "title": "This is what winning looks like",
  "date_display": "December 18, 2017",
  "date_iso": "2017-12-18T10:42:00+00:00",
  "date_from_url": "2017-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A readers sends an example of Generation Zyklon <a href=\"https://pbs.twimg.com/media/DRRzVjmXkAM_Ley.jpg\">upsetting a guidance counselor</a>. It appears to be an actual, first-hand account from an SJW school counselor and his terrifying encounters with the fed-up, disaffected and angry white kids who never got to experience the economic prosperity nor the ethnically homogeneous homelands that their Baby Boomer, and, to a lesser extent, Gen X predecessors enjoyed.</p><blockquote><p>I work as a counselor at a school where there’s a lot of 4chan-esque right wing boys who are coming up. The previous generation a year or two ago wasn’t too bad, but this generation coming up now is much more right wing.</p><p>My question is, how the fuck do I deal with this shit? How am I supposed to honestly give council to a kid with a pepe shirt on. How do I talk to these kids who literally come to me and rant about affirmative action? 2 years ago these types barely existed and now they are everywhere, not only men but women too. They literally cannot control their right wing beliefs, they talk about it constantly, everywhere. They can’t have a discussion about fucking math without bringing up how women hate math and science and that is why they are unsuccessful. They can’t talk about english classes without talking about colleges are wiping away white authors because of cultural marxism. A kid came to me and ranted that his history classes ‘blamed white people too much’ for tragedies in the past and that made him uncomfortable.</p><p>I know my job is that people can come to me with whatever possible problems they want, no matter how controversial. But this is getting fucking out of hand. How do I do this?</p></blockquote><p>I don’t expect you to do anything, Mr. Guidance Counselor. I expect you to continue to be irrelevant and outdated. But in the meantime, you might direct those promising young students to the 16 Points of the Alt Right, because the Alt-Right is an inevitable consequence of the 1965 Naturalization Act.</p><p>Still not tired.</p></div>",
  "content_text": "A readers sends an example of Generation Zyklon\nupsetting a guidance counselor\n. It appears to be an actual, first-hand account from an SJW school counselor and his terrifying encounters with the fed-up, disaffected and angry white kids who never got to experience the economic prosperity nor the ethnically homogeneous homelands that their Baby Boomer, and, to a lesser extent, Gen X predecessors enjoyed.\nI work as a counselor at a school where there’s a lot of 4chan-esque right wing boys who are coming up. The previous generation a year or two ago wasn’t too bad, but this generation coming up now is much more right wing.\nMy question is, how the fuck do I deal with this shit? How am I supposed to honestly give council to a kid with a pepe shirt on. How do I talk to these kids who literally come to me and rant about affirmative action? 2 years ago these types barely existed and now they are everywhere, not only men but women too. They literally cannot control their right wing beliefs, they talk about it constantly, everywhere. They can’t have a discussion about fucking math without bringing up how women hate math and science and that is why they are unsuccessful. They can’t talk about english classes without talking about colleges are wiping away white authors because of cultural marxism. A kid came to me and ranted that his history classes ‘blamed white people too much’ for tragedies in the past and that made him uncomfortable.\nI know my job is that people can come to me with whatever possible problems they want, no matter how controversial. But this is getting fucking out of hand. How do I do this?\nI don’t expect you to do anything, Mr. Guidance Counselor. I expect you to continue to be irrelevant and outdated. But in the meantime, you might direct those promising young students to the 16 Points of the Alt Right, because the Alt-Right is an inevitable consequence of the 1965 Naturalization Act.\nStill not tired.",
  "tags": [
    "#AltRight",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-18T10:42:00+00:00"
}