{
  "url": "https://voxday.net/2017/12/31/why-the-last-closet-matters/",
  "scraped_at": "2025-12-19T10:37:04.412071",
  "title": "Why THE LAST CLOSET matters",
  "date_display": "December 31, 2017",
  "date_iso": "2017-12-31T09:48:00+00:00",
  "date_from_url": "2017-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>More young women than you would probably believe were <a href=\"https://electricliterature.com/the-book-that-made-me-a-feminist-was-written-by-an-abuser-4c6891f548cf\">heavily influenced by the twisted psyche </a>of Marion Zimmer Bradley.</p><blockquote><p>I still cannot imagine anything more perfectly aligned with my thirteen-year-old sensibilities than Marion Zimmer Bradley’s masterpiece. Bradley opened my eyes to the idea that, when we look at the past, we are only ever seeing a small part of it — and usually, what we are seeing excludes the experiences of women. Encountering the vain, self-serving, diabolical Morgan le Fay transformed into the priestess Morgaine compelled me to question other received narratives in which women are to blame for the failures of men. The Mists of Avalon also gave me a glimpse of spiritual possibilities beyond male-dominated, male-defined religions. In retrospect, I can see that it gave me ways of seeing that helped me find the feminine even within patriarchal systems while studying religion as an undergrad. The impact of this book lingers in my feminism, certainly, but it also influenced my scholarly interest in folklore, and it still informs my personal spirituality.</p><p>But my primary reaction to The Mists of Avalon, when I first read it, wasn’t intellectual; it was emotional. Like The Once and Future King, Bradley’s novel follows its protagonist from childhood into old age. I sympathized with the girl Morgaine, and her adolescent experiences hinted at frustrations I was just beginning to feel. The moment when Morgaine and Lancelet are, finally, about to become lovers — and then Gwenhwyfar, blonde and fair and lithe and helpless, stumbles into Avalon… No matter how many times I revisit this scene, it still crushes me. This isn’t a story about the pretty girl, the princess. It’s the story of the smart girl who becomes a powerful woman. Even so, Bradley brings nuance to these characters. She shows us Morgaine doing foolish, selfish things, and she shows us that Gwenhwyfar’s position is an impossible one. Doom hangs over Arthur’s glorious reign, just as fate rules many a legend and fable. There is no happy ending for anyone at Camelot — there never has been — but Bradley shows us real people struggling against their destiny, and she shows us that it’s not just impersonal fortune to blame for their inevitable downfall. Instead, it’s systems of oppression. By the time I left home for a women’s college in 1989, I’d reread The Mists of Avalon several times. I arrived ready to smash the patriarchy.</p></blockquote><p>It’s easy to claim that the book is not the author, because that is true. But in cases such as this, it is impossible to separate the theme, and more importantly, the message, of the book from the beliefs of the author. There are those authors who are intellectually ruthless enough to accurately represent beliefs they do not hold, but there are not very many such others and Marion Zimmer Bradley was certainly not one of them.</p><p>Her personal ideosyncracies not only informed, they <i>dictated </i>the nature of her works, which amounted to pure feminist propaganda. This is readily apparent in even her earliest writings. You cannot read <i>The Mists of Avalon</i> without realizing that it stems from the bitterness of a plain little dark-haired woman who cannot attract the handsome warriors and hates the tall pretty blonde girls who do. It’s essentially a medieval female <i>Revenge of the Nerds</i>. No wonder it was popular in feminist and proto-feminist circles.</p><p>And it was popular despite its twisted sexuality and its infamous scene of ritualized child abuse, a scene that its fans still defend as “a description of people who have passed beyond the normal world and into the sacred time of a fertility ritual.”</p><p>But the abuse of children is no more justifiable in that context than it was at Greyhaven, especially when there is absolutely no anthropological basis for it. And that is why <i>The Last Closet </i>is important, because it exposes the lie behind which so much evil hides itself.</p></div>",
  "content_text": "More young women than you would probably believe were\nheavily influenced by the twisted psyche\nof Marion Zimmer Bradley.\nI still cannot imagine anything more perfectly aligned with my thirteen-year-old sensibilities than Marion Zimmer Bradley’s masterpiece. Bradley opened my eyes to the idea that, when we look at the past, we are only ever seeing a small part of it — and usually, what we are seeing excludes the experiences of women. Encountering the vain, self-serving, diabolical Morgan le Fay transformed into the priestess Morgaine compelled me to question other received narratives in which women are to blame for the failures of men. The Mists of Avalon also gave me a glimpse of spiritual possibilities beyond male-dominated, male-defined religions. In retrospect, I can see that it gave me ways of seeing that helped me find the feminine even within patriarchal systems while studying religion as an undergrad. The impact of this book lingers in my feminism, certainly, but it also influenced my scholarly interest in folklore, and it still informs my personal spirituality.\nBut my primary reaction to The Mists of Avalon, when I first read it, wasn’t intellectual; it was emotional. Like The Once and Future King, Bradley’s novel follows its protagonist from childhood into old age. I sympathized with the girl Morgaine, and her adolescent experiences hinted at frustrations I was just beginning to feel. The moment when Morgaine and Lancelet are, finally, about to become lovers — and then Gwenhwyfar, blonde and fair and lithe and helpless, stumbles into Avalon… No matter how many times I revisit this scene, it still crushes me. This isn’t a story about the pretty girl, the princess. It’s the story of the smart girl who becomes a powerful woman. Even so, Bradley brings nuance to these characters. She shows us Morgaine doing foolish, selfish things, and she shows us that Gwenhwyfar’s position is an impossible one. Doom hangs over Arthur’s glorious reign, just as fate rules many a legend and fable. There is no happy ending for anyone at Camelot — there never has been — but Bradley shows us real people struggling against their destiny, and she shows us that it’s not just impersonal fortune to blame for their inevitable downfall. Instead, it’s systems of oppression. By the time I left home for a women’s college in 1989, I’d reread The Mists of Avalon several times. I arrived ready to smash the patriarchy.\nIt’s easy to claim that the book is not the author, because that is true. But in cases such as this, it is impossible to separate the theme, and more importantly, the message, of the book from the beliefs of the author. There are those authors who are intellectually ruthless enough to accurately represent beliefs they do not hold, but there are not very many such others and Marion Zimmer Bradley was certainly not one of them.\nHer personal ideosyncracies not only informed, they\ndictated\nthe nature of her works, which amounted to pure feminist propaganda. This is readily apparent in even her earliest writings. You cannot read\nThe Mists of Avalon\nwithout realizing that it stems from the bitterness of a plain little dark-haired woman who cannot attract the handsome warriors and hates the tall pretty blonde girls who do. It’s essentially a medieval female\nRevenge of the Nerds\n. No wonder it was popular in feminist and proto-feminist circles.\nAnd it was popular despite its twisted sexuality and its infamous scene of ritualized child abuse, a scene that its fans still defend as “a description of people who have passed beyond the normal world and into the sacred time of a fertility ritual.”\nBut the abuse of children is no more justifiable in that context than it was at Greyhaven, especially when there is absolutely no anthropological basis for it. And that is why\nThe Last Closet\nis important, because it exposes the lie behind which so much evil hides itself.",
  "tags": [
    "books",
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-12-31T09:48:00+00:00"
}