{
  "url": "https://voxday.net/2016/04/02/a-jewish-case-for-white-nationalis/",
  "scraped_at": "2025-12-17T17:52:14.211777",
  "title": "A Jewish case for white nationalism",
  "date_display": "April 2, 2016",
  "date_iso": "2016-04-02T12:00:00+00:00",
  "date_from_url": "2016-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mytheos Holt explains why Donald Trump appeals to so many dispossessed and disadvantaged whites, as well as <a href=\"http://thefederalist.com/2016/03/30/the-intellectual-case-for-trump-i-why-the-white-nationalist-support/\">why white nationalism is on the rise</a>:</p><blockquote class=\"tr_bq\"><p> This brings me to the first and, arguably, the most important lesson<br> that Sylvia taught me about what drives people into the arms of white<br> nationalism: that urge comes not from economic dispossession, nor<br> spiritual dispossession, but cultural dispossession.</br></br></br></p><p>No, I don’t mean the sort of “where has my country gone”<br> ignorance that I and my fellow coastal cosmopolitans like to mock over<br> cocktails. I mean the sorts of people who are attracted to white<br> nationalism are people whose own communities have been hollowed out by<br> economic and cultural forces beyond their control, and who are now<br> adrift in a society they perceive to be universally hostile to their<br> heritage for no good reason.</br></br></br></br></br></br></p><div> That heritage, as white nationalists in America see it, is the<br> heritage of Western civilization. If you wonder what that means (which<br> is reasonable), let me spell it out: It means historically Western<br> European cultural norms. Specifically, norms like respect for agents of<br> the law, aspirational pride in work, willingness to accept the<br> consequences of one’s actions, disdain for laziness and welfarism, and<br> reproductive responsibility (i.e., not having children you can’t afford<br> to keep).</br></br></br></br></br></br></br></div></blockquote><div><blockquote><p> They respect these norms not merely because these are what their own<br> communities follow, but also because they think these norms make<br> constitutional government, liberty, and classical republicanism<br> possible. If you have to pick between the two, defend the norms every<br> day, since temporary cessations of liberty will naturally recover if<br> they’re still in place, whereas the institutions without the norms will<br> become meaningless: the Constitution will become a pointless scrap of<br> paper to which people pay only lip service, and constitutional<br> government will become bureaucracy hiding behind the fig leaf of a<br> separation of powers.</br></br></br></br></br></br></br></br></br></p><p>Where this otherwise perfectly respectable, conservative pride<br> in Western culture atrophies into white nationalism when the person<br> holding it comes to believe that respect for liberal Western<br> civilization is inextricably tied to one’s race. One particularly<br> irreverent white nationalist YouTube <a href=\"https://www.youtube.com/watch?v=jcUZrDX5P7A\">songster</a> sums this attitude up in a video mocking libertarians: “It’s not that freedom is bad/But only whites think it’s rad.”</br></br></br></br></p><div> Moreover, and this cannot be stated enough: these people genuinely<br> believe that to be proud of the history of Western European<br> accomplishment, and one’s own descent from the people responsible, is<br> taboo in modern America. If you look at what cultural studies<br> departments, much of modern media, left-wing college students, and the<br> crazy wing of the Democratic Party says, this is probably at least<br> partially accurate. Unfortunately, however, it’s not just leftists who<br> are responsible for the rise of white nationalism in communities like<br> Sylvia’s. We conservatives bear some blame too, though in this case,<br> largely because of misunderstandings of how our own behavior is<br> perceived.</br></br></br></br></br></br></br></br></br></br></div></blockquote><p>It’s a fairly honest assessment, although I would say that it is not a misunderstanding of how conservative behavior is perceived, but rather a straightforward failure of conservatism to defend or conserve Western civilization. Conservatism is not, as Red Eagle and I chronicled in <i>Cuckservative: How “Conservatives” Betrayed America</i>, a set of principles or a coherent ideology. It is an attitude, and more, it is an attitude that is intrinsically incapable of holding its ground against the forces that assail both Western civilization and the various white nations that built and value it.</p><p>Now, I am not a white nationalist for the obvious reason that I am a red nationalist. Also, and more importantly, there is no white nation; only in America can anyone even contemplate the concept. When one lives in Europe, it is considerably more clear that the English nation is not the German nation is not the Dutch nation is not the Italian nation.</p><p>However, just as the Jews who historically considered themselves German discovered that it didn’t matter what they considered themselves to be, many Americans of various European descents are learning that in the eyes of those who hate and envy them, they are nothing more than “white”. And, as Holt observes, it should be no surprise that they are beginning to band together and respond to the tribalist attacks on them with a tribalism of their own.</p><p>But whether it is intellectually coherent or not, white nationalism is entirely Constitutional. Freedom of Association is an unalienable and Constitutional right. Diversity, imposed and involuntary, is intrinsically anti-Constitutional, anti-American, anti-human rights, and anti-Western Civilization.</p><p>Perhaps it takes a Jew to understand that if white nationalism is immoral, so is Jewish nationalism and the State of Israel.</p></div></div>",
  "content_text": "Mytheos Holt explains why Donald Trump appeals to so many dispossessed and disadvantaged whites, as well as\nwhy white nationalism is on the rise\n:\nThis brings me to the first and, arguably, the most important lesson\nthat Sylvia taught me about what drives people into the arms of white\nnationalism: that urge comes not from economic dispossession, nor\nspiritual dispossession, but cultural dispossession.\nNo, I don’t mean the sort of “where has my country gone”\nignorance that I and my fellow coastal cosmopolitans like to mock over\ncocktails. I mean the sorts of people who are attracted to white\nnationalism are people whose own communities have been hollowed out by\neconomic and cultural forces beyond their control, and who are now\nadrift in a society they perceive to be universally hostile to their\nheritage for no good reason.\nThat heritage, as white nationalists in America see it, is the\nheritage of Western civilization. If you wonder what that means (which\nis reasonable), let me spell it out: It means historically Western\nEuropean cultural norms. Specifically, norms like respect for agents of\nthe law, aspirational pride in work, willingness to accept the\nconsequences of one’s actions, disdain for laziness and welfarism, and\nreproductive responsibility (i.e., not having children you can’t afford\nto keep).\nThey respect these norms not merely because these are what their own\ncommunities follow, but also because they think these norms make\nconstitutional government, liberty, and classical republicanism\npossible. If you have to pick between the two, defend the norms every\nday, since temporary cessations of liberty will naturally recover if\nthey’re still in place, whereas the institutions without the norms will\nbecome meaningless: the Constitution will become a pointless scrap of\npaper to which people pay only lip service, and constitutional\ngovernment will become bureaucracy hiding behind the fig leaf of a\nseparation of powers.\nWhere this otherwise perfectly respectable, conservative pride\nin Western culture atrophies into white nationalism when the person\nholding it comes to believe that respect for liberal Western\ncivilization is inextricably tied to one’s race. One particularly\nirreverent white nationalist YouTube\nsongster\nsums this attitude up in a video mocking libertarians: “It’s not that freedom is bad/But only whites think it’s rad.”\nMoreover, and this cannot be stated enough: these people genuinely\nbelieve that to be proud of the history of Western European\naccomplishment, and one’s own descent from the people responsible, is\ntaboo in modern America. If you look at what cultural studies\ndepartments, much of modern media, left-wing college students, and the\ncrazy wing of the Democratic Party says, this is probably at least\npartially accurate. Unfortunately, however, it’s not just leftists who\nare responsible for the rise of white nationalism in communities like\nSylvia’s. We conservatives bear some blame too, though in this case,\nlargely because of misunderstandings of how our own behavior is\nperceived.\nIt’s a fairly honest assessment, although I would say that it is not a misunderstanding of how conservative behavior is perceived, but rather a straightforward failure of conservatism to defend or conserve Western civilization. Conservatism is not, as Red Eagle and I chronicled in\nCuckservative: How “Conservatives” Betrayed America\n, a set of principles or a coherent ideology. It is an attitude, and more, it is an attitude that is intrinsically incapable of holding its ground against the forces that assail both Western civilization and the various white nations that built and value it.\nNow, I am not a white nationalist for the obvious reason that I am a red nationalist. Also, and more importantly, there is no white nation; only in America can anyone even contemplate the concept. When one lives in Europe, it is considerably more clear that the English nation is not the German nation is not the Dutch nation is not the Italian nation.\nHowever, just as the Jews who historically considered themselves German discovered that it didn’t matter what they considered themselves to be, many Americans of various European descents are learning that in the eyes of those who hate and envy them, they are nothing more than “white”. And, as Holt observes, it should be no surprise that they are beginning to band together and respond to the tribalist attacks on them with a tribalism of their own.\nBut whether it is intellectually coherent or not, white nationalism is entirely Constitutional. Freedom of Association is an unalienable and Constitutional right. Diversity, imposed and involuntary, is intrinsically anti-Constitutional, anti-American, anti-human rights, and anti-Western Civilization.\nPerhaps it takes a Jew to understand that if white nationalism is immoral, so is Jewish nationalism and the State of Israel.",
  "tags": [
    "immigration",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-02T11:00:00+00:00"
}