{
  "url": "https://voxday.net/2016/04/21/a-question-for-readers/",
  "scraped_at": "2025-12-17T17:54:40.817935",
  "title": "A question for the readers",
  "date_display": "April 21, 2016",
  "date_iso": "2016-04-21T17:00:00+00:00",
  "date_from_url": "2016-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Which would you rather have first, <i>A Sea of Skulls</i> or <i>SJWs Always Double Down</i>? I’ve been focusing on the former, given how long Selenoth fans have been waiting, but it occurs to me that it might make sense to, you know, actually ask the core market what it prefers.</p><p>On a somewhat related note, the first novel in what could reasonably, but will not be, described as a New Heinlein series, <i>Mutiny in Space</i> by Rod Walker, will be published soon. It’s an intentional attempt to capture the style and spirit of Robert Heinlein’s classic SF juveniles. I think you’ll find it is <i>considerably</i> more successful in doing so than some of the previously declared New Heinleins.</p><p> UPDATE: The readers have spoken. The current schedule will remain in place. First <i>A Sea of Skulls</i>, then <i>SJWs Always Double Down</i>.</p></div>",
  "content_text": "Which would you rather have first,\nA Sea of Skulls\nor\nSJWs Always Double Down\n? I’ve been focusing on the former, given how long Selenoth fans have been waiting, but it occurs to me that it might make sense to, you know, actually ask the core market what it prefers.\nOn a somewhat related note, the first novel in what could reasonably, but will not be, described as a New Heinlein series,\nMutiny in Space\nby Rod Walker, will be published soon. It’s an intentional attempt to capture the style and spirit of Robert Heinlein’s classic SF juveniles. I think you’ll find it is\nconsiderably\nmore successful in doing so than some of the previously declared New Heinleins.\nUPDATE: The readers have spoken. The current schedule will remain in place. First\nA Sea of Skulls\n, then\nSJWs Always Double Down\n.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-21T16:00:00+00:00"
}