{
  "url": "https://voxday.net/2016/04/12/alt-tech-and-alt-society/",
  "scraped_at": "2025-12-17T17:53:25.219400",
  "title": "Alt-Tech and Alt-Society",
  "date_display": "April 12, 2016",
  "date_iso": "2016-04-12T12:00:00+00:00",
  "date_from_url": "2016-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Eventually, the Alt-Right is going to transform into an entirely alternative society. The reason this will happen is due to the totalitarian nature of social justice. Notice that I used the term social justice, and not SJW.</p><p>Social justice inherently requires totalitarianism because it demands both total convergence and total compliance. This is why SJWs are just as likely to attack Stephen Fry as they are to attack Curtis Yarvin despite the vast ideological and identitational differences between the two men. The sin both men have committed are the same: a refusal to submit to the current social justice Narrative.</p><p>The reason societies devolve into civil war, split up, and eventually segregate is because it is no longer possible for one group to live in close quarters with another group. And it appears we are rapidly approaching the point where SJWs and non serviams can no longer occupy the same social media space because the latter are not permitted, <a href=\"http://theralphretort.com/reddit-suspended-posting-vox-days-sjw-list-4012016/\">as The Ralph Retort reports</a>:</p><blockquote class=\"tr_bq\"><p> I had been trying to spend more time on the subreddit I setup lately, which is called SJWsAtWork. After Twitter suspended the account I had made for it, due to false spam reports, I kinda got out of the habit of posting stuff over there. Last night, I made a new account (@SJWAlert) and then went to post some new stories on SJWsAtWork itself. One of those was a link to Vox Day’s new site, SJW List. I had no idea this would be a controversial move, but it ended up getting my entire Reddit account suspended.</p><p>Honestly, Reddit is sort of a shithole, so I’m not too broken up about it. Still, I’m kinda pissed for the small community we have going on over there. I’m still going to continue posting with my new account, and I will get put back on the mod team by one of the other mods, but it’s just annoying. There was no sort of warning at all, just a straight permanent suspension.</p></blockquote><p>The Alt-Right is still taking shape. But unless it develops the Alt-Tech and successfully creates its own alternative technological and infrastructural institutions, it will suffer the same fate as other minority groups that have been subjugated and forced to choose between submission and elimination.</p><p>Reddit isn’t the only SJW-owned institution to act this way. Facebook just <a href=\"http://www.avoiceformen.com/a-voice-for-men/facebook-removes-avfms-page/\">no-platformed A Voice For Men yesterday</a> as well:</p><blockquote class=\"tr_bq\"><p> The A Voice for Men FaceBook page was unpublished by FaceBook today. No reason was given other than a generic inference that we were in violation of their community standards. I find no reason to believe that this means anything but the fact that we were in violation of their feminist based rules for speech.</p></blockquote><p> This does not yet mean an Alt-Society is necessary. We can still drive the SJWs out, and indeed, their insistence on converging the organizations they infest significantly improves our chances of reclaiming control of society so long as stop supporting them and we keep them out of the new institutions and organizations. That is why they are so terrified of the SJW List and that is why they have been attacking it relentlessly almost since the moment of its creation.</p><p>Stop using Facebook. Stop using Reddit. Stop using Wikipedia. Only use platforms that play fair – say what you will about Google, but they are not in the business of no-platforming and silencing people – and start building and supporting and using alternatives to the fully converged platforms.</p></div>",
  "content_text": "Eventually, the Alt-Right is going to transform into an entirely alternative society. The reason this will happen is due to the totalitarian nature of social justice. Notice that I used the term social justice, and not SJW.\nSocial justice inherently requires totalitarianism because it demands both total convergence and total compliance. This is why SJWs are just as likely to attack Stephen Fry as they are to attack Curtis Yarvin despite the vast ideological and identitational differences between the two men. The sin both men have committed are the same: a refusal to submit to the current social justice Narrative.\nThe reason societies devolve into civil war, split up, and eventually segregate is because it is no longer possible for one group to live in close quarters with another group. And it appears we are rapidly approaching the point where SJWs and non serviams can no longer occupy the same social media space because the latter are not permitted,\nas The Ralph Retort reports\n:\nI had been trying to spend more time on the subreddit I setup lately, which is called SJWsAtWork. After Twitter suspended the account I had made for it, due to false spam reports, I kinda got out of the habit of posting stuff over there. Last night, I made a new account (@SJWAlert) and then went to post some new stories on SJWsAtWork itself. One of those was a link to Vox Day’s new site, SJW List. I had no idea this would be a controversial move, but it ended up getting my entire Reddit account suspended.\nHonestly, Reddit is sort of a shithole, so I’m not too broken up about it. Still, I’m kinda pissed for the small community we have going on over there. I’m still going to continue posting with my new account, and I will get put back on the mod team by one of the other mods, but it’s just annoying. There was no sort of warning at all, just a straight permanent suspension.\nThe Alt-Right is still taking shape. But unless it develops the Alt-Tech and successfully creates its own alternative technological and infrastructural institutions, it will suffer the same fate as other minority groups that have been subjugated and forced to choose between submission and elimination.\nReddit isn’t the only SJW-owned institution to act this way. Facebook just\nno-platformed A Voice For Men yesterday\nas well:\nThe A Voice for Men FaceBook page was unpublished by FaceBook today. No reason was given other than a generic inference that we were in violation of their community standards. I find no reason to believe that this means anything but the fact that we were in violation of their feminist based rules for speech.\nThis does not yet mean an Alt-Society is necessary. We can still drive the SJWs out, and indeed, their insistence on converging the organizations they infest significantly improves our chances of reclaiming control of society so long as stop supporting them and we keep them out of the new institutions and organizations. That is why they are so terrified of the SJW List and that is why they have been attacking it relentlessly almost since the moment of its creation.\nStop using Facebook. Stop using Reddit. Stop using Wikipedia. Only use platforms that play fair – say what you will about Google, but they are not in the business of no-platforming and silencing people – and start building and supporting and using alternatives to the fully converged platforms.",
  "tags": [
    "SJW",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-12T11:00:00+00:00"
}