{
  "url": "https://voxday.net/2016/04/23/april-brainstorm-tonig/",
  "scraped_at": "2025-12-17T17:54:53.660573",
  "title": "April Brainstorm tonight",
  "date_display": "April 23, 2016",
  "date_iso": "2016-04-23T16:10:00+00:00",
  "date_from_url": "2016-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just a reminder for Brainstorm members that there is a closed event tonight. Check your email for details. Tonight will feature a guest speaker, William S. Lind, who will address the divergence between the events depicted in his novel <i>Victoria</i> and the massive demographic changes that we’ve seen in the last decade.</p><p>We will also be discussing recent developments in Project Big Fork and a few other issues. I’ve completed the review of the recent debate transcript and sent it off to Dr. Miller for approval; it should go out to members by Tuesday at the latest. It’s better than I remembered; if Dr. Miller is amenable, we may publish it as a $2.99 epamphlet.</p><p>UPDATE: I’m pleased to be able to say that Dr. Miller is, indeed, amenable. So it should be out reasonably soon.</p><p>As for those who are not Brainstorm members, you are invited to the Rabid Puppies Hugo Nomination Party, which will start at 12:30 PM Eastern on Tuesday, April 26th. If you can make it, you can <a href=\"https://attendee.gotowebinar.com/register/4536383040097508610\">register for it here</a>. Thanks to the new member signups, I was able to bump up the seats to 1,000, so there should be room for almost everyone; at the last Rabid Puppies Party, 750 more people tried to register than were able to attend.</p><p>So register and keep the prosecco cold and handy in case the Puppies do well.</p></div>",
  "content_text": "Just a reminder for Brainstorm members that there is a closed event tonight. Check your email for details. Tonight will feature a guest speaker, William S. Lind, who will address the divergence between the events depicted in his novel\nVictoria\nand the massive demographic changes that we’ve seen in the last decade.\nWe will also be discussing recent developments in Project Big Fork and a few other issues. I’ve completed the review of the recent debate transcript and sent it off to Dr. Miller for approval; it should go out to members by Tuesday at the latest. It’s better than I remembered; if Dr. Miller is amenable, we may publish it as a $2.99 epamphlet.\nUPDATE: I’m pleased to be able to say that Dr. Miller is, indeed, amenable. So it should be out reasonably soon.\nAs for those who are not Brainstorm members, you are invited to the Rabid Puppies Hugo Nomination Party, which will start at 12:30 PM Eastern on Tuesday, April 26th. If you can make it, you can\nregister for it here\n. Thanks to the new member signups, I was able to bump up the seats to 1,000, so there should be room for almost everyone; at the last Rabid Puppies Party, 750 more people tried to register than were able to attend.\nSo register and keep the prosecco cold and handy in case the Puppies do well.",
  "tags": [
    "Brainstorm"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-23T15:10:00+00:00"
}