{
  "url": "https://voxday.net/2016/04/06/beamdog-ceo-statemen/",
  "scraped_at": "2025-12-17T17:52:49.538513",
  "title": "Beamdog CEO statement on Baldur’s Gate Gate",
  "date_display": "April 6, 2016",
  "date_iso": "2016-04-06T23:48:00+00:00",
  "date_from_url": "2016-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Trent Oster, CEO of Beamdog, <a href=\"https://forums.beamdog.com/discussion/51161/beamdog-statement-on-siege-of-dragonspear\">releases a statement</a> concerning <i>Siege of Dragonspear</i>.</p><blockquote class=\"tr_bq\"><p> I’m Trent Oster, CEO of Beamdog.</p><p>First off, everyone here is ecstatic to have shipped Baldur’s Gate: Siege of Dragonspear. Siege represents years of hard work by a dedicated team that we grew from a combination of home grown talent, original Baldur’s Gate modders and former Bioware developers.  Siege of Dragonspear represents more than 25 hours of new Baldur’s Gate gameplay, and more than 500,000 words of writing. I’m proud of our team for launching this great expansion.</p><p>We’ve received feedback around Mizhena, a supporting character who reveals she is transgender. In retrospect, it would have been better served if we had introduced a transgender character with more development. This is a lesson we will be carrying forward in our development as creators and we will be improving this character in a future update.</p><p>The last few days have showed us how passionately many of our fans care for our games. We’ve had a lot of great feedback from players who love the expansion and are having a great time experiencing the first new Baldur’s Gate story in 15 years. While we appreciate all feedback we receive from our fans, both positive as well as negative, some of the negative feedback has focused not on Siege of Dragonspear but on individual developers at Beamdog — to the point of online threats and harassment.</p><p>I just want to make it crystal clear that Beamdog does not condone this behavior, and moreover that it will not have the desired effect as we stand behind all our developers 100%. We created the game as a group, and moving forward we’ll work on the game’s issues as a group, which I believe is exactly as it should be.</p><p>We’ve received valuable feedback around some bugs we failed to catch for ship. We’re hard at work right now patching up the issues that slipped through and we’re striving to ship fixes and improvements quickly. We will provide a complete list of the issues we plan to address in our next update. Issues of note we are addressing are:</p><p>Multiplayer – We are acting on reports of multiplayer issues and hope to have this fixed in the next update.</p><p>Minsc – Minsc has a line which generated controversy. Looking back on the line, we agree with the feedback from our community, it has nothing to do with his character and we will be removing the line.</p><p>We hope all our players continue to enjoy Siege of Dragonspear and we look forward to providing an update in the near future.</p><p>Regards,<br> -Trent</br></p></blockquote><p>This is, to put it bluntly, bullshit. It’s a feeble attempt at damage control. There is no apology for calling critics “small minded”, there is no apology to those who have been banned from the forums, there is no apology for the inept writing or attempting to cram Social Justice Games, as the responsible writer called them, down the throats of <i>Baldur’s Gate</i> fans, and most of all, there is no announcement that the Social Justice Game writer and creator Amber Scott is no longer employed by Beamdog.</p><p>This simply isn’t good enough, Mr. Oster. It doesn’t indicate that you understand in any way what the core problem is or why so many fans of <i>Baldur’s Gate</i> were appalled by what your company did with the license.</p><p>Here is my advice: get rid of Scott and whatever other SJWs are waging their little cultural war on gamers at your expense, hire some better writers, and publicly assure fans of the series that you will not continue to utilize<i> </i>the <i>Baldur’s Gate</i> license to add diversity, preach about refugees or other current political issues, or advocate for social justice, and I’ll be happy to buy your games.</p><p>If we want to get preached at, we’ll go to church. If we want to get lectured, we’ll go to college. A game is no place for SJW culture war campaigns.</p><p>This is the damning bit: “we stand behind all our developers 100%”</p><p>Too bad. We stand against them. Because they stand against us.</p><p> UPDATE: <a href=\"https://www.reddit.com/r/KotakuInAction/comments/4dp5ow/steam_accepted_my_bgee_refund_request_after_forum/\">Steam is accepting refunds</a> from those who purchased the game or the Enhanced Editions and are unhappy with Beamdog’s public statements.</p><blockquote class=\"tr_bq\"><p> <b>Steam accepted my BG:EE refund request after forum ban with more than 2 hrs played</b></p><p>Explained I had more playtime and I was aware of that, and that I would have been glad to eat the mistake had I simply made a bad purchase – but that after being banned on their forums and called a ‘harasser’ for no good reason than disagreeing that I’d had enough of the company.</p><p>BAM, refund approved within 30m, despite it being 9:30pm on a Wednesday.</p><p>Tomorrow, I’ll be drafting an open letter that contains relevant elements of various digital distribution platforms ToS’ that everyone can copy and send to Steam, Amazon, GoG, GMG, and all the different platforms Beamdog is selling their product on, along with detailed information including archives and screenshots which are now deleted, showing a conscious attempt on the part of Beamdog to manipulate user reviews across various platforms. Which violates EVERYONES policies, basically.</p></blockquote><p>ADDENDUM: <a href=\"http://www.killerbetties.com/killer-women-jennifer-hepler/\">This Q&amp;A</a> says it all about SJWs in games. “Killer” is right. From an interview with a former senior writer at Bioware:</p><blockquote class=\"tr_bq\"><p> <i>What is your least favorite thing about working in the industry?</i></p><p>Playing the games. This is probably a terrible thing to admit, but it has definitely been the single most difficult thing for me. I came into the job out of a love of writing, not a love of playing games. While I enjoy the interactive aspects of gaming, if a game doesn’t have a good story, it’s very hard for me to get interested in playing it. Similarly, I’m really terrible at so many things which most games use incessantly — I have awful hand-eye coordination, I don’t like tactics, I don’t like fighting, I don’t like keeping track of inventory, and I can’t read a game map to save my life. This makes it very difficult for me to play to the myriad games I really should be keeping up on as our competition.</p><p><i>If you could tell developers of games to make sure to put one thing in games to appeal to a broader audience which includes women, what would that one thing be?</i></p><p>A fast-forward button. Games almost always include a way to “button through” dialogue without paying attention, because they understand that some players don’t enjoy listening to dialogue and they don’t want to stop their fun. Yet they persist in practically coming into your living room and forcing you to play through the combats even if you’re a player who only enjoys the dialogue. In a game with sufficient story to be interesting without the fighting, there is no reason on earth that you can’t have a little button at the corner of the screen that you can click to skip to the end of the fighting.</p></blockquote><p>Dani Bunton wept.</p></div>",
  "content_text": "Trent Oster, CEO of Beamdog,\nreleases a statement\nconcerning\nSiege of Dragonspear\n.\nI’m Trent Oster, CEO of Beamdog.\nFirst off, everyone here is ecstatic to have shipped Baldur’s Gate: Siege of Dragonspear. Siege represents years of hard work by a dedicated team that we grew from a combination of home grown talent, original Baldur’s Gate modders and former Bioware developers.  Siege of Dragonspear represents more than 25 hours of new Baldur’s Gate gameplay, and more than 500,000 words of writing. I’m proud of our team for launching this great expansion.\nWe’ve received feedback around Mizhena, a supporting character who reveals she is transgender. In retrospect, it would have been better served if we had introduced a transgender character with more development. This is a lesson we will be carrying forward in our development as creators and we will be improving this character in a future update.\nThe last few days have showed us how passionately many of our fans care for our games. We’ve had a lot of great feedback from players who love the expansion and are having a great time experiencing the first new Baldur’s Gate story in 15 years. While we appreciate all feedback we receive from our fans, both positive as well as negative, some of the negative feedback has focused not on Siege of Dragonspear but on individual developers at Beamdog — to the point of online threats and harassment.\nI just want to make it crystal clear that Beamdog does not condone this behavior, and moreover that it will not have the desired effect as we stand behind all our developers 100%. We created the game as a group, and moving forward we’ll work on the game’s issues as a group, which I believe is exactly as it should be.\nWe’ve received valuable feedback around some bugs we failed to catch for ship. We’re hard at work right now patching up the issues that slipped through and we’re striving to ship fixes and improvements quickly. We will provide a complete list of the issues we plan to address in our next update. Issues of note we are addressing are:\nMultiplayer – We are acting on reports of multiplayer issues and hope to have this fixed in the next update.\nMinsc – Minsc has a line which generated controversy. Looking back on the line, we agree with the feedback from our community, it has nothing to do with his character and we will be removing the line.\nWe hope all our players continue to enjoy Siege of Dragonspear and we look forward to providing an update in the near future.\nRegards,\n-Trent\nThis is, to put it bluntly, bullshit. It’s a feeble attempt at damage control. There is no apology for calling critics “small minded”, there is no apology to those who have been banned from the forums, there is no apology for the inept writing or attempting to cram Social Justice Games, as the responsible writer called them, down the throats of\nBaldur’s Gate\nfans, and most of all, there is no announcement that the Social Justice Game writer and creator Amber Scott is no longer employed by Beamdog.\nThis simply isn’t good enough, Mr. Oster. It doesn’t indicate that you understand in any way what the core problem is or why so many fans of\nBaldur’s Gate\nwere appalled by what your company did with the license.\nHere is my advice: get rid of Scott and whatever other SJWs are waging their little cultural war on gamers at your expense, hire some better writers, and publicly assure fans of the series that you will not continue to utilize\nthe\nBaldur’s Gate\nlicense to add diversity, preach about refugees or other current political issues, or advocate for social justice, and I’ll be happy to buy your games.\nIf we want to get preached at, we’ll go to church. If we want to get lectured, we’ll go to college. A game is no place for SJW culture war campaigns.\nThis is the damning bit: “we stand behind all our developers 100%”\nToo bad. We stand against them. Because they stand against us.\nUPDATE:\nSteam is accepting refunds\nfrom those who purchased the game or the Enhanced Editions and are unhappy with Beamdog’s public statements.\nSteam accepted my BG:EE refund request after forum ban with more than 2 hrs played\nExplained I had more playtime and I was aware of that, and that I would have been glad to eat the mistake had I simply made a bad purchase – but that after being banned on their forums and called a ‘harasser’ for no good reason than disagreeing that I’d had enough of the company.\nBAM, refund approved within 30m, despite it being 9:30pm on a Wednesday.\nTomorrow, I’ll be drafting an open letter that contains relevant elements of various digital distribution platforms ToS’ that everyone can copy and send to Steam, Amazon, GoG, GMG, and all the different platforms Beamdog is selling their product on, along with detailed information including archives and screenshots which are now deleted, showing a conscious attempt on the part of Beamdog to manipulate user reviews across various platforms. Which violates EVERYONES policies, basically.\nADDENDUM:\nThis Q&A\nsays it all about SJWs in games. “Killer” is right. From an interview with a former senior writer at Bioware:\nWhat is your least favorite thing about working in the industry?\nPlaying the games. This is probably a terrible thing to admit, but it has definitely been the single most difficult thing for me. I came into the job out of a love of writing, not a love of playing games. While I enjoy the interactive aspects of gaming, if a game doesn’t have a good story, it’s very hard for me to get interested in playing it. Similarly, I’m really terrible at so many things which most games use incessantly — I have awful hand-eye coordination, I don’t like tactics, I don’t like fighting, I don’t like keeping track of inventory, and I can’t read a game map to save my life. This makes it very difficult for me to play to the myriad games I really should be keeping up on as our competition.\nIf you could tell developers of games to make sure to put one thing in games to appeal to a broader audience which includes women, what would that one thing be?\nA fast-forward button. Games almost always include a way to “button through” dialogue without paying attention, because they understand that some players don’t enjoy listening to dialogue and they don’t want to stop their fun. Yet they persist in practically coming into your living room and forcing you to play through the combats even if you’re a player who only enjoys the dialogue. In a game with sufficient story to be interesting without the fighting, there is no reason on earth that you can’t have a little button at the corner of the screen that you can click to skip to the end of the fighting.\nDani Bunton wept.",
  "tags": [
    "#GamerGate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-06T22:48:00+00:00"
}