{
  "url": "https://voxday.net/2016/04/24/billy-gibbons-on-fellow-guitar-player/",
  "scraped_at": "2025-12-17T17:55:05.257250",
  "title": "Billy Gibbons on a fellow guitar player",
  "date_display": "April 24, 2016",
  "date_iso": "2016-04-24T22:41:00+00:00",
  "date_from_url": "2016-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought this was fascinating, being <a href=\"https://www.washingtonpost.com/news/arts-and-entertainment/wp/2016/04/22/defying-description-zz-tops-billy-gibbons-on-prince-the-sensational-guitarist/\">the perspective of one great guitar player</a> on another:</p><blockquote class=\"tr_bq\"><p> <b>So much has been said about Prince but I do think it’s important to remember that his guitar playing was, I don’t know, just sensational. Tell me how you’d describe it.</b></p><p>Well, to borrow your word, sensational is about as close a description of Prince’s guitar playing as words might allow. I believe that the feeling one was left with, if afforded the luxury of actually seeing Prince perform … we’d be looking for other superlatives. Because it’s almost got to the point of defying description.</p><p><b>You had an interesting encounter with Prince.</b></p><p>It was following the Rock and Roll Hall of Fame 25th anniversary celebration [in 2009]. They had a two night grand hurrah at Madison Square Garden and I was invited to perform with Jeff Beck. And following that appearance, I found myself back at the hotel and I wandered off in search of some late-night grub and my favorite 24-hour joint was shut down for unknown reasons. I tiptoed across the street to the Tiger Bar. I was just standing at the front and I was approached by a rather large gentleman and he said, ‘You’re wanted at the corner table.’ And there was Prince sitting all by his lonesome. And I gave him a brief tip of the hat and sat down and said, ‘Hey man, it’s so good to see you.’ He said, ‘It’s so good to see you. Let’s talk about guitar playing.’ I said, ‘Why not?’ And in the next two hours we really dove into the depth of his intent, interest and focus toward technique and tone. I left that evening even more mesmerized than I’d previously been, just knowing the sincerity that Prince kept toward his playing, his performing and his all-around showmanship.<br> <b><br>You’re a little bit older, you come from Texas and I’d imagine you first learned about Prince in the early ’80s, when you were both MTV stars.</br></b></br></p><p>As you may remember, he began bubbling up without a lot of advance fanfare. There was just this vague knowledge of this new guy on the scene called Prince. And then, of course, we all got our world rocked when “Purple Rain” showed up at the theaters. Even today, I’m struggling to try and emulate that guitar introduction to “When Doves Cry.” It’s just a testament to his extraordinary technique.<br> <b><br>Wait. When you say emulate — you mean you try to play it and you can’t?</br></b></br></p><p>I continually come back to attempting to piece together each and every one of those segments. And it’s very short. It’s not an extended solo by any means. But the way it is delivered. There’s certainly no way to write it. You’ve just got to dive in and feel it to see if you could come close.</p></blockquote><p>What I find so interesting about these tributes from famous musicians is that they almost precisely echo what I’d heard from so many less well-known musicians around the Minneapolis scene in the early 1990s. Most of you probably never heard about Power of Seven, which was my short-lived effort to improve the music in the game industry, which ended up in little more than a few soundtracks for SSI and Bungie. But the Seven referred to the seven individuals originally involved, one of whom was Mike Koppelman, who engineered, mixed, and mastered <i>Diamonds and Pearls</i> before going on to found Bitstream Underground.</p><p>He, and others like the member of The Revolution who recorded a single with Paul Sebastian before we founded Psykosonik, always spoke about Prince and his attention to detail in awed, almost reverential tones. So, I’m not surprised to hear that even a great guitarist like Billy Gibbons was impressed by his knowledge and technique.</p><p>This is why I, and others, find it irritating when people dismiss him as being just a pop star. It’s like calling Mozart just a piano player. There is both talent and skill that goes into both musical performance and composition, and virtuosos of either are extremely rare. An individual who is a true virtuoso of both is practically a unicorn. Then throw in the voice, the multiple instruments, the engineering, the conceptual sensibilities… it’s literally unimaginable to me. I can more easily grasp Julius Caesar or Socrates.</p><p>And while one cannot reasonably expect Prince’s music to survive the test of time in the manner that Mozart’s has, one also cannot say that he did not make the most of the incredible talents he was given. Like everyone else who had anything to do with music in Minneapolis, I am absolutely itching to know <i>what is in that vault</i>. It’s been said for literally decades that he was putting his best stuff in there rather than let Warner Bros. have it, and said by some who are known to have actually heard a few of the tracks. And Prince being Prince, the chances are good that quite a lot of it is actually finished work, rather than bits and pieces of various song ideas.</p><p>Can you imagine if there is another <i>Purple Rain</i> in there? Or another two or three?</p></div>",
  "content_text": "I thought this was fascinating, being\nthe perspective of one great guitar player\non another:\nSo much has been said about Prince but I do think it’s important to remember that his guitar playing was, I don’t know, just sensational. Tell me how you’d describe it.\nWell, to borrow your word, sensational is about as close a description of Prince’s guitar playing as words might allow. I believe that the feeling one was left with, if afforded the luxury of actually seeing Prince perform … we’d be looking for other superlatives. Because it’s almost got to the point of defying description.\nYou had an interesting encounter with Prince.\nIt was following the Rock and Roll Hall of Fame 25th anniversary celebration [in 2009]. They had a two night grand hurrah at Madison Square Garden and I was invited to perform with Jeff Beck. And following that appearance, I found myself back at the hotel and I wandered off in search of some late-night grub and my favorite 24-hour joint was shut down for unknown reasons. I tiptoed across the street to the Tiger Bar. I was just standing at the front and I was approached by a rather large gentleman and he said, ‘You’re wanted at the corner table.’ And there was Prince sitting all by his lonesome. And I gave him a brief tip of the hat and sat down and said, ‘Hey man, it’s so good to see you.’ He said, ‘It’s so good to see you. Let’s talk about guitar playing.’ I said, ‘Why not?’ And in the next two hours we really dove into the depth of his intent, interest and focus toward technique and tone. I left that evening even more mesmerized than I’d previously been, just knowing the sincerity that Prince kept toward his playing, his performing and his all-around showmanship.\nYou’re a little bit older, you come from Texas and I’d imagine you first learned about Prince in the early ’80s, when you were both MTV stars.\nAs you may remember, he began bubbling up without a lot of advance fanfare. There was just this vague knowledge of this new guy on the scene called Prince. And then, of course, we all got our world rocked when “Purple Rain” showed up at the theaters. Even today, I’m struggling to try and emulate that guitar introduction to “When Doves Cry.” It’s just a testament to his extraordinary technique.\nWait. When you say emulate — you mean you try to play it and you can’t?\nI continually come back to attempting to piece together each and every one of those segments. And it’s very short. It’s not an extended solo by any means. But the way it is delivered. There’s certainly no way to write it. You’ve just got to dive in and feel it to see if you could come close.\nWhat I find so interesting about these tributes from famous musicians is that they almost precisely echo what I’d heard from so many less well-known musicians around the Minneapolis scene in the early 1990s. Most of you probably never heard about Power of Seven, which was my short-lived effort to improve the music in the game industry, which ended up in little more than a few soundtracks for SSI and Bungie. But the Seven referred to the seven individuals originally involved, one of whom was Mike Koppelman, who engineered, mixed, and mastered\nDiamonds and Pearls\nbefore going on to found Bitstream Underground.\nHe, and others like the member of The Revolution who recorded a single with Paul Sebastian before we founded Psykosonik, always spoke about Prince and his attention to detail in awed, almost reverential tones. So, I’m not surprised to hear that even a great guitarist like Billy Gibbons was impressed by his knowledge and technique.\nThis is why I, and others, find it irritating when people dismiss him as being just a pop star. It’s like calling Mozart just a piano player. There is both talent and skill that goes into both musical performance and composition, and virtuosos of either are extremely rare. An individual who is a true virtuoso of both is practically a unicorn. Then throw in the voice, the multiple instruments, the engineering, the conceptual sensibilities… it’s literally unimaginable to me. I can more easily grasp Julius Caesar or Socrates.\nAnd while one cannot reasonably expect Prince’s music to survive the test of time in the manner that Mozart’s has, one also cannot say that he did not make the most of the incredible talents he was given. Like everyone else who had anything to do with music in Minneapolis, I am absolutely itching to know\nwhat is in that vault\n. It’s been said for literally decades that he was putting his best stuff in there rather than let Warner Bros. have it, and said by some who are known to have actually heard a few of the tracks. And Prince being Prince, the chances are good that quite a lot of it is actually finished work, rather than bits and pieces of various song ideas.\nCan you imagine if there is another\nPurple Rain\nin there? Or another two or three?",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-24T21:41:00+00:00"
}