{
  "url": "https://voxday.net/2016/04/23/bleeding-purple/",
  "scraped_at": "2025-12-17T17:54:55.488951",
  "title": "Bleeding purple",
  "date_display": "April 23, 2016",
  "date_iso": "2016-04-23T18:14:00+00:00",
  "date_from_url": "2016-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not often I miss being in Minnesota. But I would have liked to have been back <a href=\"http://www.dailymail.co.uk/news/article-3552361/Pop-icon-Prince-dead-57-entertainment-website-TMZ.html\">at First Avenue last night</a> for the party celebrating Prince’s life and music. I can’t think of a better place for it.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.dailymail.co.uk/i/pix/2016/04/22/13/336CE23A00000578-3552361-image-a-80_1461327022225.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"260\" src=\"http://i.dailymail.co.uk/i/pix/2016/04/22/13/336CE23A00000578-3552361-image-a-80_1461327022225.jpg\" width=\"400\"/></a></div><p> I talked to several of my friends from Minnesota over the last day, some of whom are still there and some of whom are not. And it’s been bittersweet to see how all of them, at least to this extent, still bleed purple. It’s a little hard to explain the sense of loss to non-Minnesotans, because it’s simply not about celebrity worship or the death of a popstar, as so many people understandably, but mistakenly, think.</p><p>It feels more like losing a cousin of whom you were inordinately proud, in part because he was so proud to bear your name and be a part of your family. Practically everyone I know had some casual connection with Prince, be it a chance encounter somewhere, a friend who worked for him, or a mutual acquaintance. It’s not a very big city, after all.</p><p>Minnesota, and Minneapolis in particular, has always had an irrelevancy complex. And not without reason; everyone at my East Coast-populated university seemed to be astonished that Big Chilly and I were not some sort of lumberjacks or farmers, while we were surprised at how… backwards they were, especially with regards to music.</p><p>But Prince not only put Minneapolis on the map, he genuinely loved the city, the state, and the people. And in that place, at that time, with that particular demographic mix, people really did genuinely transcend the usual racial issues; it took me several years away from Minnesota and six months in Tokyo to understand that certain differences actually were relevant, and just as importantly, mattered greatly to nearly everyone of any color. Perhaps only in Minnesota would a black man describing someone not liking “his kind” be referring to work habits and not race.</p><p>Prince was a part of that, both cause and effect. It was interesting to hear both his manager and some of his black bandmates talk about how growing up in a 95 percent white community affected the development of his music; they listened to KQ92 and all the classic rock just like we did because there simply wasn’t anything else on the radio besides news, classical, and terrible 70s pop on KS95. In Minneapolis, we didn’t even understand the concept of “crossover” music because it was considered normal to have a black bassist in a white band or a white guitarist in a black one; in fact, one of the members of the larval form of Psykosonik was black.</p><p>Don’t think I’m saying this as some form of virtue-signaling; you know I<br> don’t believe in that. I’m simply trying to describe the innocent, and<br> fundamentally naive, mindset of the time, which is probably not<br> unrelated today to disastrous things like the settlement of Somalis on the West Bank or Liberians in Coon Rapids. (I know, I know,<br> oh, the irony.) There is probably an interesting historical study to be done there regarding the optimal level of a minority group in a population.</br></br></br></br></p><p>As for Prince, there was a sort of etiquette everyone understood concerning him. You did NOT make a big deal about him. You didn’t tell him you were a fan, you didn’t tell him you loved his music, and you didn’t take pictures of him, you simply said “hi, Prince”. He would usually smile, accept the homage implicit in the recognition, and go about his business. If he wanted to talk to you, he’d send his bodyguard over to let you know. On more than one occasion, I had to warn out-of-town guests not to react to him being around, but everyone in Minneapolis just seemed to understand that Prince was not to be bothered. Maybe it has to do with the Scandinavian ethic, I don’t know. It’s just how it was.</p><p>It is sad that such a beloved son of the city died alone in his incredible studio-mansion. But I have no doubt that he knew his hometown loved him, as the photo above shows. I know many, perhaps even most of you, won’t grasp what Prince meant to his fellow Minnesotans, but even if you don’t, try to understand that we are mourning one of our own.</p></div>",
  "content_text": "It’s not often I miss being in Minnesota. But I would have liked to have been back\nat First Avenue last night\nfor the party celebrating Prince’s life and music. I can’t think of a better place for it.\nI talked to several of my friends from Minnesota over the last day, some of whom are still there and some of whom are not. And it’s been bittersweet to see how all of them, at least to this extent, still bleed purple. It’s a little hard to explain the sense of loss to non-Minnesotans, because it’s simply not about celebrity worship or the death of a popstar, as so many people understandably, but mistakenly, think.\nIt feels more like losing a cousin of whom you were inordinately proud, in part because he was so proud to bear your name and be a part of your family. Practically everyone I know had some casual connection with Prince, be it a chance encounter somewhere, a friend who worked for him, or a mutual acquaintance. It’s not a very big city, after all.\nMinnesota, and Minneapolis in particular, has always had an irrelevancy complex. And not without reason; everyone at my East Coast-populated university seemed to be astonished that Big Chilly and I were not some sort of lumberjacks or farmers, while we were surprised at how… backwards they were, especially with regards to music.\nBut Prince not only put Minneapolis on the map, he genuinely loved the city, the state, and the people. And in that place, at that time, with that particular demographic mix, people really did genuinely transcend the usual racial issues; it took me several years away from Minnesota and six months in Tokyo to understand that certain differences actually were relevant, and just as importantly, mattered greatly to nearly everyone of any color. Perhaps only in Minnesota would a black man describing someone not liking “his kind” be referring to work habits and not race.\nPrince was a part of that, both cause and effect. It was interesting to hear both his manager and some of his black bandmates talk about how growing up in a 95 percent white community affected the development of his music; they listened to KQ92 and all the classic rock just like we did because there simply wasn’t anything else on the radio besides news, classical, and terrible 70s pop on KS95. In Minneapolis, we didn’t even understand the concept of “crossover” music because it was considered normal to have a black bassist in a white band or a white guitarist in a black one; in fact, one of the members of the larval form of Psykosonik was black.\nDon’t think I’m saying this as some form of virtue-signaling; you know I\ndon’t believe in that. I’m simply trying to describe the innocent, and\nfundamentally naive, mindset of the time, which is probably not\nunrelated today to disastrous things like the settlement of Somalis on the West Bank or Liberians in Coon Rapids. (I know, I know,\noh, the irony.) There is probably an interesting historical study to be done there regarding the optimal level of a minority group in a population.\nAs for Prince, there was a sort of etiquette everyone understood concerning him. You did NOT make a big deal about him. You didn’t tell him you were a fan, you didn’t tell him you loved his music, and you didn’t take pictures of him, you simply said “hi, Prince”. He would usually smile, accept the homage implicit in the recognition, and go about his business. If he wanted to talk to you, he’d send his bodyguard over to let you know. On more than one occasion, I had to warn out-of-town guests not to react to him being around, but everyone in Minneapolis just seemed to understand that Prince was not to be bothered. Maybe it has to do with the Scandinavian ethic, I don’t know. It’s just how it was.\nIt is sad that such a beloved son of the city died alone in his incredible studio-mansion. But I have no doubt that he knew his hometown loved him, as the photo above shows. I know many, perhaps even most of you, won’t grasp what Prince meant to his fellow Minnesotans, but even if you don’t, try to understand that we are mourning one of our own.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-23T17:14:00+00:00"
}