{
  "url": "https://voxday.net/2016/04/13/brainstorm-debate-free-trade/",
  "scraped_at": "2025-12-17T17:53:34.015863",
  "title": "Brainstorm debate: Free Trade",
  "date_display": "April 13, 2016",
  "date_iso": "2016-04-13T09:32:00+00:00",
  "date_from_url": "2016-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I mentioned, tonight at 7 PM Eastern I’ll be debating Dr. James Miller, Associate Professor of Economics at Smith College, on the topic of free trade. Dr. Miller has a PhD from the University of Chicago and is the author of <i>Game Theory at Work</i> and <i>Singularity Rising: Surviving and Thriving in a Smarter, Richer, and More Dangerous World</i>.</p><p>There are 440 seats left, so if you’re interested and you plan to attend, you can <a href=\"https://attendee.gotowebinar.com/register/550160808033926913\">register for the free event here</a>. </p><p>This promises to be interesting. PhD from THE monetarist school vs BS from a econ department of Keynesians and socialists. Game Theorist vs Game Designer. Academic vs gamer.</p><p>The folks on Twitter don’t appear to like my chances of success. The worst odds that have been given against me are 68-1. On the other hand, Nate refuses to throw in the towel<i>: Speaking as someone who’s actually debated you. I’m going to say the poor bastard has no idea what he’s in for.</i></p><p>So, whose chances do <i>you</i> like better? Looking at it objectively, I’d have to say that if I can somehow manage to win this one in a convincing fashion, I’m probably smarter than I think I am. There is only one way to find out.</p></div>",
  "content_text": "As I mentioned, tonight at 7 PM Eastern I’ll be debating Dr. James Miller, Associate Professor of Economics at Smith College, on the topic of free trade. Dr. Miller has a PhD from the University of Chicago and is the author of\nGame Theory at Work\nand\nSingularity Rising: Surviving and Thriving in a Smarter, Richer, and More Dangerous World\n.\nThere are 440 seats left, so if you’re interested and you plan to attend, you can\nregister for the free event here\n.\nThis promises to be interesting. PhD from THE monetarist school vs BS from a econ department of Keynesians and socialists. Game Theorist vs Game Designer. Academic vs gamer.\nThe folks on Twitter don’t appear to like my chances of success. The worst odds that have been given against me are 68-1. On the other hand, Nate refuses to throw in the towel\n: Speaking as someone who’s actually debated you. I’m going to say the poor bastard has no idea what he’s in for.\nSo, whose chances do\nyou\nlike better? Looking at it objectively, I’d have to say that if I can somehow manage to win this one in a convincing fashion, I’m probably smarter than I think I am. There is only one way to find out.",
  "tags": [
    "Brainstorm",
    "debate",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-13T08:32:00+00:00"
}