{
  "url": "https://voxday.net/2016/04/01/chaos-horizon-predicts-best-nove/",
  "scraped_at": "2025-12-17T17:52:05.750185",
  "title": "Chaos Horizon predicts Best Novel finalists",
  "date_display": "April 1, 2016",
  "date_iso": "2016-04-01T09:38:00+00:00",
  "date_from_url": "2016-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I respected the work that Brandon Kempner does at Chaos Horizon even before he went six for six in correctly predicting all the novels nominated for the 2016 Nebula Awards. Sure, the SJWs are getting more than a little predictable, but even so, that was an impressive performance.</p><p>He’s onto the 2016 Hugo Awards now, for which the nominations are now closed, and he has attempted to sort out how the three major factions, the <a href=\"https://chaoshorizon.wordpress.com/2016/03/30/estimating-the-2016-hugo-nominations-part-3/\">Not-Puppies</a>, the <a href=\"https://chaoshorizon.wordpress.com/2016/03/29/estimating-the-2016-hugo-nominations-part-2/\">Rabid Puppies</a>, and the <a href=\"https://chaoshorizon.wordpress.com/2016/03/31/estimating-the-2016-hugo-nominations-part-4/\">Sad Puppies</a>, are going to turn out in order to predict the Best Novel shortlist that will be announced on April 26th.</p><p>Some of his assumptions, all of which are reasonable, but not necessarily correct, are as follows:</p><ul><li>Turnout will be higher than normal, but generally in line with past percentages of total eligibility.</li><li>There is no whisper slate among one or more groups of Puppykickers.</li><li>The Rabid Puppies are subject to normal group indiscipline.</li><li>The 2016 Sad Puppy list indicates how 2015 Sad Puppies will vote.</li></ul><p>The latter is the most questionable assumption, and is almost certainly incorrect. The others are more reasonable and may well hold. His numbers indicate a maximum turnout of 709 nominations for the top Not-Puppy novel, 440 for all of the Rabid Puppy novels, and 360 for the top Sad Puppy novel. And although there is no formal Not-Puppy list, as noted before, the behavior of the SF-SJWs in fandom is so predictable that he was able to assemble the equivalent of the Not-Puppy slate, which is as follows:</p><ul><li><i>Uprooted</i>, Naomi Novik</li><li><i>Ancillary Mercy</i>, Ann Leckie</li><li> <i>The Fifth Season</i>, NK Jemisin<i> </i></li><li><i>Aurora</i>, Kim Stanley Robinson<i> </i></li><li><i>Seveneves</i>, Neal Stephenson</li></ul><p>Note that I correctly identified <a href=\"http://www.milobookclub.com/2015/12/24/you-dont-say-2/\">three of them</a> back in December. The notable omission is any novel published by Tor Books; if Chaos Horizon is correct, 2016 would mark only the third time since 1997 that Tor Books was not represented on the Best Novel shortlist. (This may explain the Torlings’ determination to push through EPH and guarantee Tor a permanent slot on the shortlist.)</p><p>Chaos Horizon presented 27 possible models. I selected max Not-Puppy, max Rabid Puppy, and max-min Sad Puppy to come up with these results, with the first five qualifying for the Best Novel shortlist.</p><p>918 <i><b>Seveneves</b></i><br> 853 <i>Uprooted</i><br> 800 <i><b>Somewhither</b></i><br> 782 <i><b>The Aeronaut’s Windlass</b></i><br> 774 <i>Ancillary Mercy</i><br> 522 <i>The Fifth Season</i><br> 522 <i>Aurora</i><br> 480 <i><b>Golden Son</b></i><br> 440<i><b> Agent of the Imperium </b></i></br></br></br></br></br></br></br></br></p><p>This was in line with Chaos Horizon’s own conclusions, which were revealed in the comments of <a href=\"https://chaoshorizon.wordpress.com/2016/03/31/estimating-the-2016-hugo-nominations-part-4/\">his most recent post</a>:</p><blockquote class=\"tr_bq\"><p> Jacob:<br> My prediction of the five nominees: <i>Uprooted</i>, <i>Seveneves</i>, <i>The Aeronaut’s Windlass</i>, <i>Somewither</i>, and <i>Ancillary Mercy</i></br></p><p>chaoshorizon:<br> Way to spoil the surprise! But that’s what I think as well.</br></p></blockquote><p>However, no one should start celebrating or cursing their stars yet. I suspect the Hugos will turn out to be less easily predicted than the Nebulas. First, the Rabid Puppies may outperform. A disciplined Rabid Puppy performance combined with half the Sad Puppies turning Rabid would mean <i>Golden Son</i> (which may be the best SF novel of the entire lot) would get 810 votes, which would allow it to knock <i>Ancillary Mercy</i> off the shortlist. Combine that with a half-hearted Not-Puppy effort, and the much-feared Rabid Puppy sweep becomes theoretically conceivable.</p><p>On the other hand, if the Puppykickers show the same ability to march in lockstep on the nominations that they did in voting No Award last year, even <i>Seveneves</i> won’t be nominated. In that case, we’ll probably see <i>Barsk</i>, <i>The Fifth Season</i>, and <i>The Traitor Baru Cormorant</i> in addition to <i>Uprooted</i> and <i>Ancillary Mercy</i>. And then there is always the possibility that one or more authors decline a nomination and render the entire nomination process irrelevant.</p><p>NOTA BENE: as Marc DuQuesne points out, the predicted outcome can be accurately characterized as a Puppy sweep, since both <i>Ancillary Mercy</i> and <i>Uprooted</i> appear on the Sad Puppy list. However, since only <i>Uprooted</i><br> appears in the Sad Puppy top five, I don’t think that would be a<br> reasonable characterization of a shortlist containing the Leckie book.</br></br></p><p>Regardless three of five in Best Novel (four of five if we count SP) would exceed last year’s net Puppy performance, and would be quite satisfying in light of our known numerical disadvantage versus the entirety of SF fandom. It would also suffice to put EPH through, which would be very useful by guaranteeing the Puppies a permanent seat on the Hugo Security Council. And considering that <i>Uprooted</i> is not only a Sad Puppy recommendation but a pretty good fantasy to which I gave serious consideration to putting on the Rabid Puppies list, if Chaos Horizon is right, we would be very pleased should the outcome he anticipates come to pass.</p></div>",
  "content_text": "I respected the work that Brandon Kempner does at Chaos Horizon even before he went six for six in correctly predicting all the novels nominated for the 2016 Nebula Awards. Sure, the SJWs are getting more than a little predictable, but even so, that was an impressive performance.\nHe’s onto the 2016 Hugo Awards now, for which the nominations are now closed, and he has attempted to sort out how the three major factions, the\nNot-Puppies\n, the\nRabid Puppies\n, and the\nSad Puppies\n, are going to turn out in order to predict the Best Novel shortlist that will be announced on April 26th.\nSome of his assumptions, all of which are reasonable, but not necessarily correct, are as follows:\nTurnout will be higher than normal, but generally in line with past percentages of total eligibility.\nThere is no whisper slate among one or more groups of Puppykickers.\nThe Rabid Puppies are subject to normal group indiscipline.\nThe 2016 Sad Puppy list indicates how 2015 Sad Puppies will vote.\nThe latter is the most questionable assumption, and is almost certainly incorrect. The others are more reasonable and may well hold. His numbers indicate a maximum turnout of 709 nominations for the top Not-Puppy novel, 440 for all of the Rabid Puppy novels, and 360 for the top Sad Puppy novel. And although there is no formal Not-Puppy list, as noted before, the behavior of the SF-SJWs in fandom is so predictable that he was able to assemble the equivalent of the Not-Puppy slate, which is as follows:\nUprooted\n, Naomi Novik\nAncillary Mercy\n, Ann Leckie\nThe Fifth Season\n, NK Jemisin\nAurora\n, Kim Stanley Robinson\nSeveneves\n, Neal Stephenson\nNote that I correctly identified\nthree of them\nback in December. The notable omission is any novel published by Tor Books; if Chaos Horizon is correct, 2016 would mark only the third time since 1997 that Tor Books was not represented on the Best Novel shortlist. (This may explain the Torlings’ determination to push through EPH and guarantee Tor a permanent slot on the shortlist.)\nChaos Horizon presented 27 possible models. I selected max Not-Puppy, max Rabid Puppy, and max-min Sad Puppy to come up with these results, with the first five qualifying for the Best Novel shortlist.\n918\nSeveneves\n853\nUprooted\n800\nSomewhither\n782\nThe Aeronaut’s Windlass\n774\nAncillary Mercy\n522\nThe Fifth Season\n522\nAurora\n480\nGolden Son\n440\nAgent of the Imperium\nThis was in line with Chaos Horizon’s own conclusions, which were revealed in the comments of\nhis most recent post\n:\nJacob:\nMy prediction of the five nominees:\nUprooted\n,\nSeveneves\n,\nThe Aeronaut’s Windlass\n,\nSomewither\n, and\nAncillary Mercy\nchaoshorizon:\nWay to spoil the surprise! But that’s what I think as well.\nHowever, no one should start celebrating or cursing their stars yet. I suspect the Hugos will turn out to be less easily predicted than the Nebulas. First, the Rabid Puppies may outperform. A disciplined Rabid Puppy performance combined with half the Sad Puppies turning Rabid would mean\nGolden Son\n(which may be the best SF novel of the entire lot) would get 810 votes, which would allow it to knock\nAncillary Mercy\noff the shortlist. Combine that with a half-hearted Not-Puppy effort, and the much-feared Rabid Puppy sweep becomes theoretically conceivable.\nOn the other hand, if the Puppykickers show the same ability to march in lockstep on the nominations that they did in voting No Award last year, even\nSeveneves\nwon’t be nominated. In that case, we’ll probably see\nBarsk\n,\nThe Fifth Season\n, and\nThe Traitor Baru Cormorant\nin addition to\nUprooted\nand\nAncillary Mercy\n. And then there is always the possibility that one or more authors decline a nomination and render the entire nomination process irrelevant.\nNOTA BENE: as Marc DuQuesne points out, the predicted outcome can be accurately characterized as a Puppy sweep, since both\nAncillary Mercy\nand\nUprooted\nappear on the Sad Puppy list. However, since only\nUprooted\nappears in the Sad Puppy top five, I don’t think that would be a\nreasonable characterization of a shortlist containing the Leckie book.\nRegardless three of five in Best Novel (four of five if we count SP) would exceed last year’s net Puppy performance, and would be quite satisfying in light of our known numerical disadvantage versus the entirety of SF fandom. It would also suffice to put EPH through, which would be very useful by guaranteeing the Puppies a permanent seat on the Hugo Security Council. And considering that\nUprooted\nis not only a Sad Puppy recommendation but a pretty good fantasy to which I gave serious consideration to putting on the Rabid Puppies list, if Chaos Horizon is right, we would be very pleased should the outcome he anticipates come to pass.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-01T08:38:00+00:00"
}