{
  "url": "https://voxday.net/2016/04/11/civil-war-in-europe/",
  "scraped_at": "2025-12-17T17:53:18.291877",
  "title": "Civil war in Europe",
  "date_display": "April 11, 2016",
  "date_iso": "2016-04-11T12:00:00+00:00",
  "date_from_url": "2016-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Danish professor’s warning:</p><blockquote class=\"tr_bq\"><p> Writing in the Danish newspaper <u>Jyllands-Posten</u>, Professor Helmuth Nyborg, who is an expert in the connection between hormones and intelligence, discussed his previous research on how, “The effect of Europeans having few children and immigrants with low IQ” would lead to “Westerners (being) a minority in Europe, and that the average IQ drops so much that prosperity, democracy and civilization is threatened”.</p><p>Nyborg has previously asserted that low IQ migrants arriving from non-western countries leads to a decline in the average intelligence of western societies and therefore a drop in living standards and rising crime rates.</p><p>“In 2016, the current immigration policy gives us three alternatives – submission, repatriation or civil war. Unless Europe starts to lead a responsible family, immigration and integration policy, stated by the theory of evolution, I think civil war is most likely,” writes Nyborg.</p><p>Nyborg goes on to caution that simply referring to “right-wing extremism” will not make the chronic problems caused by overpopulation and failed multicultural policies disappear, warning that ethnic Europeans will be a minority in their own countries by 2050.</p><p>Ethnically homogeneous, civilized and democratic societies in Europe will be a thing of the past unless there is an “honorable repatriation” of migrants, warns Nyborg.</p></blockquote><p>I concur. And I’ll go much further. I think civil war in the USA is even more likely. The war in Europe isn’t going to be much of a contest; Reconquista 2.0 will take 1/100th the time that its predecessor did. But the USA is considerably more divided, and considerably more muddled, than even the most heavily invaded European nation.</p><p>This shouldn’t surprise anyone. As Martin van Creveld demonstrated in “Migration and War”, mass immigration is almost invariably connected to war in one way or another.</p></div>",
  "content_text": "A Danish professor’s warning:\nWriting in the Danish newspaper\nJyllands-Posten\n, Professor Helmuth Nyborg, who is an expert in the connection between hormones and intelligence, discussed his previous research on how, “The effect of Europeans having few children and immigrants with low IQ” would lead to “Westerners (being) a minority in Europe, and that the average IQ drops so much that prosperity, democracy and civilization is threatened”.\nNyborg has previously asserted that low IQ migrants arriving from non-western countries leads to a decline in the average intelligence of western societies and therefore a drop in living standards and rising crime rates.\n“In 2016, the current immigration policy gives us three alternatives – submission, repatriation or civil war. Unless Europe starts to lead a responsible family, immigration and integration policy, stated by the theory of evolution, I think civil war is most likely,” writes Nyborg.\nNyborg goes on to caution that simply referring to “right-wing extremism” will not make the chronic problems caused by overpopulation and failed multicultural policies disappear, warning that ethnic Europeans will be a minority in their own countries by 2050.\nEthnically homogeneous, civilized and democratic societies in Europe will be a thing of the past unless there is an “honorable repatriation” of migrants, warns Nyborg.\nI concur. And I’ll go much further. I think civil war in the USA is even more likely. The war in Europe isn’t going to be much of a contest; Reconquista 2.0 will take 1/100th the time that its predecessor did. But the USA is considerably more divided, and considerably more muddled, than even the most heavily invaded European nation.\nThis shouldn’t surprise anyone. As Martin van Creveld demonstrated in “Migration and War”, mass immigration is almost invariably connected to war in one way or another.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-11T11:00:00+00:00"
}