{
  "url": "https://voxday.net/2016/04/04/clarkhat-knocks-back-sjws/",
  "scraped_at": "2025-12-17T17:52:27.873288",
  "title": "ClarkHat knocks back SJWs",
  "date_display": "April 4, 2016",
  "date_iso": "2016-04-04T11:00:00+00:00",
  "date_from_url": "2016-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Good to see ClarkHat come out roaring in his first post-Popehat anti-SJW campaign. ESR <a href=\"http://esr.ibiblio.org/?p=7095\">explains the situation</a>:</p><blockquote class=\"tr_bq\"><p>  In brief: LambdaConf, a technical conference on functional programming, accepted a presentation proposal about a language called Urbit, from a guy named Curtis Yarvin. I’ve looked at Urbit: it is very weird, but rather interesting, and certainly a worthy topic for a functional programming conference.</p><p>And then all hell broke loose. For Curtis Yarvin is better known as Mencius Moldbug, author of eccentric and erudite political rents and a focus of intense hatred by humorless leftists. Me, I’ve never been able to figure out how much of what Moldbug writes he actually believes; his writing seems designed to leave a reader guessing as to whether he’s really serious or executing the most brilliantly satirical long-term troll-job in the history of the Internet.</p><p>A mob of SJWs, spearheaded by a no-shit self-described Communist named Jon Sterling, descended on LambdaConf demanding that they cancel Yarvin’s talk, pretending that he (rather than, say, the Communist) posed a safety threat to other conference-goers. The conference’s principal organizers, headed up one John de Goes, quite properly refused to cancel the talk, observing that Yarvin was there to talk about his code and not his politics.</p><p>I think they conceded to much to the SJWs, actually, by asking Yarvin to issue a statement about his views on violence. Nobody asked Jon Sterling whether he was down with that whole liquidation of the kulaks thing, after all, and if a Communist who likes to tweet about sending capitalists to “hard labor in the North” gets a pass it is not easy to see why any apologia was required from a man with no history of advocating violence at all.</p><p>But, ultimately, they did make the right decision: to judge Yarvin’s talk proposal by its technical merit alone. This is the hacker way.</p><p>The SJWs then attempted to pressure LambdaConf’s sponsors into withdrawing their support so the conference would have to be canceled. Several sponsors withdrew (I don’t know details about who; my sources for this part are secondhand).</p><p>So far, so wearily familiar – Marxist thugs versus free expression, with free expression’s chances not looking so hot. But there’s where the story gets good. Meredith Patterson and her friends at the blog Status 451 organized a counterpunch. They launched an IndieGoGo campaign <a href=\"https://www.indiegogo.com/projects/save-lambdaconf-and-an-open-society--3#/\">Save LambdaConf …and an open society</a>.</p></blockquote><p>The campaign is already fully funded. But I thought some of you in the tech world might like to know about it, and be a part of it. There are many ways to help fund the alt-right’s war against the SJWs, and helping those who are victims of their successful attacks is an important <i>defensive</i> strategy, as it will embolden those who are standing up to them.</p><p>And good for LambdaConf for standing by its speakers rather than caving to the SJW-converged sponsors. This is how cultural wars are won, one hard-earned victory after another.</p></div>",
  "content_text": "Good to see ClarkHat come out roaring in his first post-Popehat anti-SJW campaign. ESR\nexplains the situation\n:\nIn brief: LambdaConf, a technical conference on functional programming, accepted a presentation proposal about a language called Urbit, from a guy named Curtis Yarvin. I’ve looked at Urbit: it is very weird, but rather interesting, and certainly a worthy topic for a functional programming conference.\nAnd then all hell broke loose. For Curtis Yarvin is better known as Mencius Moldbug, author of eccentric and erudite political rents and a focus of intense hatred by humorless leftists. Me, I’ve never been able to figure out how much of what Moldbug writes he actually believes; his writing seems designed to leave a reader guessing as to whether he’s really serious or executing the most brilliantly satirical long-term troll-job in the history of the Internet.\nA mob of SJWs, spearheaded by a no-shit self-described Communist named Jon Sterling, descended on LambdaConf demanding that they cancel Yarvin’s talk, pretending that he (rather than, say, the Communist) posed a safety threat to other conference-goers. The conference’s principal organizers, headed up one John de Goes, quite properly refused to cancel the talk, observing that Yarvin was there to talk about his code and not his politics.\nI think they conceded to much to the SJWs, actually, by asking Yarvin to issue a statement about his views on violence. Nobody asked Jon Sterling whether he was down with that whole liquidation of the kulaks thing, after all, and if a Communist who likes to tweet about sending capitalists to “hard labor in the North” gets a pass it is not easy to see why any apologia was required from a man with no history of advocating violence at all.\nBut, ultimately, they did make the right decision: to judge Yarvin’s talk proposal by its technical merit alone. This is the hacker way.\nThe SJWs then attempted to pressure LambdaConf’s sponsors into withdrawing their support so the conference would have to be canceled. Several sponsors withdrew (I don’t know details about who; my sources for this part are secondhand).\nSo far, so wearily familiar – Marxist thugs versus free expression, with free expression’s chances not looking so hot. But there’s where the story gets good. Meredith Patterson and her friends at the blog Status 451 organized a counterpunch. They launched an IndieGoGo campaign\nSave LambdaConf …and an open society\n.\nThe campaign is already fully funded. But I thought some of you in the tech world might like to know about it, and be a part of it. There are many ways to help fund the alt-right’s war against the SJWs, and helping those who are victims of their successful attacks is an important\ndefensive\nstrategy, as it will embolden those who are standing up to them.\nAnd good for LambdaConf for standing by its speakers rather than caving to the SJW-converged sponsors. This is how cultural wars are won, one hard-earned victory after another.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-04T10:00:00+00:00"
}