{
  "url": "https://voxday.net/2016/04/21/convergence-at-espn/",
  "scraped_at": "2025-12-17T17:54:37.102576",
  "title": "Convergence at ESPN",
  "date_display": "April 21, 2016",
  "date_iso": "2016-04-21T15:00:00+00:00",
  "date_from_url": "2016-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no secret that ESPN is fully SJW-converged. But now they’re not even bothering to hide it:</p><blockquote class=\"tr_bq\"><p> ESPN has fired Curt Schilling over his recent anti-transgender comments on social media.</p><p>Schilling, a baseball analyst for ESPN and former Boston Red Sox pitcher, shared a Facebook post this week that lampooned critics of recent laws passed in North Carolina and other states restricting transgender men and women from using the public restrooms that correspond with their gender preferences. Schilling added his own comment to the post, criticizing transgender people.</p><p>“A man is a man no matter what they call themselves,” Schilling wrote. “I don’t care what they are, who they sleep with, men’s room was designed for the penis, women’s not so much. Now you need laws telling us differently? Pathetic.”</p><p>The original post featured a man in a wig with his breasts exposed, captioned, “LET HIM IN! to the restroom with your daughter or else you’re a narrow-minded, judgmental, unloving racist bigot who needs to die.”</p><p>After first announcing Wednesday that it would review Schilling’s comments, ESPN announced later in the day that it had fired him. “ESPN is an inclusive company,” the network said in a statement. “Curt Schilling has been advised that his conduct was unacceptable and his employment with ESPN has been terminated.”</p></blockquote><p>I quit reading ESPN years ago. But they are clearly an excellent demonstration of my Impossibility of SJW Convergence in action, which states: <i>The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function. </i></p><p>ESPN can’t even employ an intelligent Hall-of-Fame commentator to discuss baseball if he doesn’t publicly submit to the SJW Narrative. That is full convergence. Sports is no longer ESPN’s primary function.</p></div>",
  "content_text": "It’s no secret that ESPN is fully SJW-converged. But now they’re not even bothering to hide it:\nESPN has fired Curt Schilling over his recent anti-transgender comments on social media.\nSchilling, a baseball analyst for ESPN and former Boston Red Sox pitcher, shared a Facebook post this week that lampooned critics of recent laws passed in North Carolina and other states restricting transgender men and women from using the public restrooms that correspond with their gender preferences. Schilling added his own comment to the post, criticizing transgender people.\n“A man is a man no matter what they call themselves,” Schilling wrote. “I don’t care what they are, who they sleep with, men’s room was designed for the penis, women’s not so much. Now you need laws telling us differently? Pathetic.”\nThe original post featured a man in a wig with his breasts exposed, captioned, “LET HIM IN! to the restroom with your daughter or else you’re a narrow-minded, judgmental, unloving racist bigot who needs to die.”\nAfter first announcing Wednesday that it would review Schilling’s comments, ESPN announced later in the day that it had fired him. “ESPN is an inclusive company,” the network said in a statement. “Curt Schilling has been advised that his conduct was unacceptable and his employment with ESPN has been terminated.”\nI quit reading ESPN years ago. But they are clearly an excellent demonstration of my Impossibility of SJW Convergence in action, which states:\nThe more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.\nESPN can’t even employ an intelligent Hall-of-Fame commentator to discuss baseball if he doesn’t publicly submit to the SJW Narrative. That is full convergence. Sports is no longer ESPN’s primary function.",
  "tags": [
    "corpocracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-21T14:00:00+00:00"
}