{
  "url": "https://voxday.net/2016/04/13/dr-jerry-pournelle-wins-2016-heinlein/",
  "scraped_at": "2025-12-17T17:53:37.111724",
  "title": "Dr. Jerry Pournelle wins 2016 Heinlein Memorial award",
  "date_display": "April 13, 2016",
  "date_iso": "2016-04-13T13:00:00+00:00",
  "date_from_url": "2016-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I am very pleased to see Dr. Pournelle recognized for his many contributions to Man’s exploration and development of space. It has been one of the great privileges of my life to have the opportunity to work with such a brilliant man and he continues to be an inspiration to those of us who believe in the importance of Man and Western civilization. Congratulations, Dr. Pournelle! – Vox</i></p><p>The National Space Society takes great pleasure in announcing that<br> its 2016 Robert A. Heinlein Memorial Award has been won by acclaimed<br> science fiction author Dr. Jerry Pournelle. This prestigious award<br> selected by an international vote of NSS members will be presented to<br> Dr. Jerry Pournelle at the 2016 International Space Development<br> Conference (ISDC).The public is welcome to<br> attend the conference and see the award presentation at the Sheraton<br> Puerto Rico Hotel and Casino in San Juan, Puerto Rico. The ISDC will run<br> from May 18-22, 2016.</br></br></br></br></br></br></br></br></p><p><strong>About Dr. Jerry Pournelle</strong></p><p>This award recognizes Dr. Jerry Pournelle’s many years of support for<br> space science, exploration, development and settlement and his close<br> association with Robert Heinlein. He was active in the NSS predecessor,<br> the L5 Society, during its early years. Jerry served as co-chair of the<br> very first ISDC, NSS secretary, and as a Board member.</br></br></br></br></p><p>Jerry was also Chair of the Citizen’s Advisory Council on National<br> Space Policy. This group was active during the 1980s and was one of the<br> most effective groups promoting specific space related policy positions<br> at that time. Robert Heinlein was also an active member of that group.<br> The group’s early support of missile defense eventually led to the<br> perceived need for an inexpensive launcher. The briefing that he and two<br> others gave to then Vice President Quayle was instrumental in getting<br> the approval of the DC-X program, overcoming widespread skepticism about<br> the project. Jerry was present at White Sands on September 11, 1993<br> when the first large rocket, the DC-X vehicle, was reused.</br></br></br></br></br></br></br></br></br></p><p>Jerry has consistently supported the vision of self-sustaining human<br> settlements in space and on planetary surfaces, and as part of a free,<br> spacefaring civilization, which is at the very heart of the space<br> movement. Jerry’s work as a science fiction author, focusing on science<br> fiction with realistic physics, has contributed to a better<br> understanding of the limitations and the abilities of human space<br> operations. Few have made such a rich contribution to these fields.</br></br></br></br></br></br></p><p><strong>About the Robert A. Heinlein Award</strong></p><p>This award is presented once every two years for lifetime achievement<br> in promoting the goal of a free, spacefaring civilization. The winner<br> is decided by the vote of the entire NSS membership, not by the awards<br> committee. The award consists of a miniature signal cannon, on a<br> mahogany base with a black granite inlay and a brass plaque as shown.<br> The award concept came from Robert Heinlein’s classic book The Moon is a<br> Harsh Mistress. Some of the early award winners include Sir Arthur C.<br> Clarke, Carl Sagan, Neil Armstrong and Elon Musk. More information about<br> this award and the past winners is <a class=\"external\" href=\"http://www.nss.org/news/releases/NSS_Release_20160412_pournelle.html\" rel=\"nofollow noopener\" target=\"_blank\">here</a>.</br></br></br></br></br></br></br></br></p></div>",
  "content_text": "I am very pleased to see Dr. Pournelle recognized for his many contributions to Man’s exploration and development of space. It has been one of the great privileges of my life to have the opportunity to work with such a brilliant man and he continues to be an inspiration to those of us who believe in the importance of Man and Western civilization. Congratulations, Dr. Pournelle! – Vox\nThe National Space Society takes great pleasure in announcing that\nits 2016 Robert A. Heinlein Memorial Award has been won by acclaimed\nscience fiction author Dr. Jerry Pournelle. This prestigious award\nselected by an international vote of NSS members will be presented to\nDr. Jerry Pournelle at the 2016 International Space Development\nConference (ISDC).The public is welcome to\nattend the conference and see the award presentation at the Sheraton\nPuerto Rico Hotel and Casino in San Juan, Puerto Rico. The ISDC will run\nfrom May 18-22, 2016.\nAbout Dr. Jerry Pournelle\nThis award recognizes Dr. Jerry Pournelle’s many years of support for\nspace science, exploration, development and settlement and his close\nassociation with Robert Heinlein. He was active in the NSS predecessor,\nthe L5 Society, during its early years. Jerry served as co-chair of the\nvery first ISDC, NSS secretary, and as a Board member.\nJerry was also Chair of the Citizen’s Advisory Council on National\nSpace Policy. This group was active during the 1980s and was one of the\nmost effective groups promoting specific space related policy positions\nat that time. Robert Heinlein was also an active member of that group.\nThe group’s early support of missile defense eventually led to the\nperceived need for an inexpensive launcher. The briefing that he and two\nothers gave to then Vice President Quayle was instrumental in getting\nthe approval of the DC-X program, overcoming widespread skepticism about\nthe project. Jerry was present at White Sands on September 11, 1993\nwhen the first large rocket, the DC-X vehicle, was reused.\nJerry has consistently supported the vision of self-sustaining human\nsettlements in space and on planetary surfaces, and as part of a free,\nspacefaring civilization, which is at the very heart of the space\nmovement. Jerry’s work as a science fiction author, focusing on science\nfiction with realistic physics, has contributed to a better\nunderstanding of the limitations and the abilities of human space\noperations. Few have made such a rich contribution to these fields.\nAbout the Robert A. Heinlein Award\nThis award is presented once every two years for lifetime achievement\nin promoting the goal of a free, spacefaring civilization. The winner\nis decided by the vote of the entire NSS membership, not by the awards\ncommittee. The award consists of a miniature signal cannon, on a\nmahogany base with a black granite inlay and a brass plaque as shown.\nThe award concept came from Robert Heinlein’s classic book The Moon is a\nHarsh Mistress. Some of the early award winners include Sir Arthur C.\nClarke, Carl Sagan, Neil Armstrong and Elon Musk. More information about\nthis award and the past winners is\nhere\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2016-04-13T12:00:00+00:00"
}