{
  "url": "https://voxday.net/2016/04/01/feminist-faux-cons-drink-kool-aid/",
  "scraped_at": "2025-12-17T17:52:09.047602",
  "title": "Feminist faux-cons drink the Kool-aid",
  "date_display": "April 1, 2016",
  "date_iso": "2016-04-01T14:00:00+00:00",
  "date_from_url": "2016-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You will probably note that <a href=\"http://www.dangerandplay.com/2016/03/30/16-feminists-who-have-taken-over-conservative-media/#comments\">NONE of these women</a> have ever been featured on this blog, with the exception of Dana Loesch, aka Mamalogues, who once played the part of a punching bag when she took umbrage concerning my lack of respect for mommyblogging. That’s because none of them are anything but feminists of one wave or another who are attempting to make media careers out of the female imperative.</p><blockquote class=\"tr_bq\"><p> Female Media Members ask Trump Campaign to Fire Core Lewandowski</p><p>The press is to have an adversarial, yet civil approach to those in, or running, for elected office. Never in this line of work is it acceptable to respond to reasonable and legitimate questioning with use of physical force. The photographs, audio, videos, and witness accounts documenting the treatment of Michelle Fields by Corey Lewandowski, Donald Trump’s campaign manager, are inexcusable and unprofessional. Donald Trump should immediately remove Lewandowski from his campaign. However unlike the Trump campaign, we believe in making a statement on the record to clearly highlight the difference between right and wrong,” it concludes.</p><p>Signed.</p><p>Dana Loesch (Radio America, Blaze TV)<br> Katie Pavlich, (Townhall, Fox News)<br> Meghan McCain, (America Now Radio, Cosmopolitan, Fox News)<br> S.E. Cupp, ( New York Daily News, Glamour, CNN)<br> Mary Katharine Ham, (CNN, The Federalist)<br> Christine Rosen, (New Atlantis, Commentary)<br> Christina Hoff Sommers, (American Enterprise Institute)<br> Bethany Mandel, (The Federalist, Acculturated)<br> Emily Zanotti, (American Spectator)<br> Elisha Krauss, (Ben Shapiro’s radio co-host)<br> Karol Markowicz, (New York Post)<br> Kristen Soltis Anderson, (Washington Examiner)<br> Mona Charen, (Ethics and Public Policy Center, Creators Syndicate)<br> Sarah Rumpf, (freelance)<br> Brooke Rogers, (National Review)<br> Mary Chastain, (Breitbart)</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Now notice who is not on it. Ann Coulter. Helen Smith. Ilana Mercer. Camille Paglia. Even Michelle Malkin, who was my original model for a conservative media whore, had more sense than to sign on to this collective conservative career suicide note. If I were a right-wing publisher, I would no sooner rely upon any of them to contribute than the average Jezebelle.</p><p>The only real disappointment is Christina Hoff Sommers, but this demonstrates that no woman who calls herself a feminist of ANY kind should be trusted to reliably stand up to the Sisterhood.</p></div>",
  "content_text": "You will probably note that\nNONE of these women\nhave ever been featured on this blog, with the exception of Dana Loesch, aka Mamalogues, who once played the part of a punching bag when she took umbrage concerning my lack of respect for mommyblogging. That’s because none of them are anything but feminists of one wave or another who are attempting to make media careers out of the female imperative.\nFemale Media Members ask Trump Campaign to Fire Core Lewandowski\nThe press is to have an adversarial, yet civil approach to those in, or running, for elected office. Never in this line of work is it acceptable to respond to reasonable and legitimate questioning with use of physical force. The photographs, audio, videos, and witness accounts documenting the treatment of Michelle Fields by Corey Lewandowski, Donald Trump’s campaign manager, are inexcusable and unprofessional. Donald Trump should immediately remove Lewandowski from his campaign. However unlike the Trump campaign, we believe in making a statement on the record to clearly highlight the difference between right and wrong,” it concludes.\nSigned.\nDana Loesch (Radio America, Blaze TV)\nKatie Pavlich, (Townhall, Fox News)\nMeghan McCain, (America Now Radio, Cosmopolitan, Fox News)\nS.E. Cupp, ( New York Daily News, Glamour, CNN)\nMary Katharine Ham, (CNN, The Federalist)\nChristine Rosen, (New Atlantis, Commentary)\nChristina Hoff Sommers, (American Enterprise Institute)\nBethany Mandel, (The Federalist, Acculturated)\nEmily Zanotti, (American Spectator)\nElisha Krauss, (Ben Shapiro’s radio co-host)\nKarol Markowicz, (New York Post)\nKristen Soltis Anderson, (Washington Examiner)\nMona Charen, (Ethics and Public Policy Center, Creators Syndicate)\nSarah Rumpf, (freelance)\nBrooke Rogers, (National Review)\nMary Chastain, (Breitbart)\nNow notice who is not on it. Ann Coulter. Helen Smith. Ilana Mercer. Camille Paglia. Even Michelle Malkin, who was my original model for a conservative media whore, had more sense than to sign on to this collective conservative career suicide note. If I were a right-wing publisher, I would no sooner rely upon any of them to contribute than the average Jezebelle.\nThe only real disappointment is Christina Hoff Sommers, but this demonstrates that no woman who calls herself a feminist of ANY kind should be trusted to reliably stand up to the Sisterhood.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-01T13:00:00+00:00"
}