{
  "url": "https://voxday.net/2016/04/24/fighting-fire-with-fire/",
  "scraped_at": "2025-12-17T17:55:03.435774",
  "title": "Fighting fire with fire",
  "date_display": "April 24, 2016",
  "date_iso": "2016-04-24T17:00:00+00:00",
  "date_from_url": "2016-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And doing so in a legitimate manner. Allen Davis <a href=\"https://www.lewrockwell.com/2016/04/allan-davis/blockbots-blacklists/\">considers blockbots and blacklists</a> at Lew Rockwell:</p><blockquote class=\"tr_bq\"><p> “Are you, or have you ever been, a supporter of Gamergate, NotYourShield, Sad Puppies, Rabid Puppies, Men’s Rights Activists, Ron Paul, Donald Trump, White Supremacists, etc, etc etc?”</p><p>Blacklists have come a long way since the bygone days of McCarthy…. In a blog post, Vox Day suggested creating a list of confirmed SJWs, and his blog readers set about to create it.  Within a few hours, <a href=\"http://sjwlist.com/\">SJWList.com</a> was being populated by a staff of volunteers.</p><p>Being added to SJWList has very specific criteria; the person in question needs to be “…on the record supporting censorship of some kind (no platforming, government censorship, or disemploying people).”  SJWList is structured as a Wiki, so each individual listed has their own page, linked to their statements and actions and thereby justifying their inclusion.</p><p>Criticism of SJWList has been vocal, as might be expected. Reddit suspended @TheRalph’s account for simply posting a link to SJWList.com.  Accusations have ranged from “building a list of people to harass” to “”sinking to their level” to “becoming SJW by adopting their own tactics.” </p><p>The crew and supporters of SJWList, however, view it as more of a response to SJW tactics, an entirely acceptable escalation in the “arms race” that is the ongoing culture war.  As Brandon Eich, Tim Hunt, and many others can all attest, the social justice warriors have declared “track what they say or do and get them fired for it” a valid tactic. </p><p>If one side in a war uses poison gas, while the other side refuses to “stoop to that level,” then they will cheerfully be the moral, upright, and dead, losers of the war.  The only way to convince the first side to stop using poison gas is to retaliate in kind.</p></blockquote><p>He’s absolutely right. As Tom Kratman has pointed out, reprisals have usually been considered a legitimate and justified response to both escalations and even war crimes.</p><p>Frits Kalshoven <a href=\"http://www.crimesofwar.org/a-z-guide/reprisal/\">writes about reprisals</a>: <i>When a belligerent party is hurt by conduct on the part of its adversary that it regards as a grave breach or systematic encroachment of the laws of armed conflict, one possibility is to retaliate by means of an action that itself violates the same body of law. While recourse to such retaliatory action can be arbitrary and in total disregard of any constraints, rules of customary law have developed in the past that provide the limits within which retaliation could be regarded as a legitimate reprisal. The main elements of this customary “right of reprisal” are: subsidiarity (failure of all other available means), notice (formal warning of the planned action), proportionality (the damage and suffering inflicted on the adverse party not to exceed the level of damage and suffering resulting from its unlawful conduct), temporary character (termination of the reprisal when the adversary stops violating the law). </i></p><p>As can be seen in the Davis article, which notes the difference between the SJW-created blockbot and the SJW List, even if one considers the list to be an expose rather than a hiring guide, the SJW List still fits all four limits of a legitimate reprisal: subsidiarity, notice, proportionality, and temporary character.</p><p>I have repeatedly warned SJWs that every tactic they utilize will be utilized against them. And since they have not only declared people’s employment to be fair game, but repeatedly acted in attempts to disemploy everyone from police officers to programmers, from students to scientists, it is entirely legitimate to target their jobs and their careers.</p><p>Indeed, the mere fact of being openly sympathetic to any social justice cause should now be sufficient to give serious pause to anyone contemplating any form of a relationship, however fleeting, with an SJW.</p><div id=\"stcpDiv\" style=\"left: -1988px; position: absolute; top: -1999px;\"> When<br> a belligerent party is hurt by conduct on the part of its adversary<br> that it regards as a grave breach or systematic encroachment of the laws<br> of armed conflict, one possibility is to retaliate by means of an<br> action that itself violates the same body of law. While recourse to such<br> retaliatory action can be arbitrary and in total disregard of any<br> constraints, rules of customary law have developed in the past that<br> provide the limits within which retaliation could be regarded as a<br> legitimate reprisal. The main elements of this customary “right of<br> reprisal” are: subsidiarity (failure of all other available means),<br> notice (formal warning of the planned action), proportionality (the<br> damage and suffering inflicted on the adverse party not to exceed the<br> level of damage and suffering resulting from its unlawful conduct),<br> temporary character (termination of the reprisal when the adversary<br> stops violating the law). – See more at:<br> http://www.crimesofwar.org/a-z-guide/reprisal/#sthash.Hfd61ZIT.dpuf</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div id=\"stcpDiv\" style=\"left: -1988px; position: absolute; top: -1999px;\"> When<br> a belligerent party is hurt by conduct on the part of its adversary<br> that it regards as a grave breach or systematic encroachment of the laws<br> of armed conflict, one possibility is to retaliate by means of an<br> action that itself violates the same body of law. While recourse to such<br> retaliatory action can be arbitrary and in total disregard of any<br> constraints, rules of customary law have developed in the past that<br> provide the limits within which retaliation could be regarded as a<br> legitimate reprisal. The main elements of this customary “right of<br> reprisal” are: subsidiarity (failure of all other available means),<br> notice (formal warning of the planned action), proportionality (the<br> damage and suffering inflicted on the adverse party not to exceed the<br> level of damage and suffering resulting from its unlawful conduct),<br> temporary character (termination of the reprisal when the adversary<br> stops violating the law). – See more at:<br> http://www.crimesofwar.org/a-z-guide/reprisal/#sthash.Hfd61ZIT.dpuf</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div></div>",
  "content_text": "And doing so in a legitimate manner. Allen Davis\nconsiders blockbots and blacklists\nat Lew Rockwell:\n“Are you, or have you ever been, a supporter of Gamergate, NotYourShield, Sad Puppies, Rabid Puppies, Men’s Rights Activists, Ron Paul, Donald Trump, White Supremacists, etc, etc etc?”\nBlacklists have come a long way since the bygone days of McCarthy…. In a blog post, Vox Day suggested creating a list of confirmed SJWs, and his blog readers set about to create it.  Within a few hours,\nSJWList.com\nwas being populated by a staff of volunteers.\nBeing added to SJWList has very specific criteria; the person in question needs to be “…on the record supporting censorship of some kind (no platforming, government censorship, or disemploying people).”  SJWList is structured as a Wiki, so each individual listed has their own page, linked to their statements and actions and thereby justifying their inclusion.\nCriticism of SJWList has been vocal, as might be expected. Reddit suspended @TheRalph’s account for simply posting a link to SJWList.com.  Accusations have ranged from “building a list of people to harass” to “”sinking to their level” to “becoming SJW by adopting their own tactics.”\nThe crew and supporters of SJWList, however, view it as more of a response to SJW tactics, an entirely acceptable escalation in the “arms race” that is the ongoing culture war.  As Brandon Eich, Tim Hunt, and many others can all attest, the social justice warriors have declared “track what they say or do and get them fired for it” a valid tactic.\nIf one side in a war uses poison gas, while the other side refuses to “stoop to that level,” then they will cheerfully be the moral, upright, and dead, losers of the war.  The only way to convince the first side to stop using poison gas is to retaliate in kind.\nHe’s absolutely right. As Tom Kratman has pointed out, reprisals have usually been considered a legitimate and justified response to both escalations and even war crimes.\nFrits Kalshoven\nwrites about reprisals\n:\nWhen a belligerent party is hurt by conduct on the part of its adversary that it regards as a grave breach or systematic encroachment of the laws of armed conflict, one possibility is to retaliate by means of an action that itself violates the same body of law. While recourse to such retaliatory action can be arbitrary and in total disregard of any constraints, rules of customary law have developed in the past that provide the limits within which retaliation could be regarded as a legitimate reprisal. The main elements of this customary “right of reprisal” are: subsidiarity (failure of all other available means), notice (formal warning of the planned action), proportionality (the damage and suffering inflicted on the adverse party not to exceed the level of damage and suffering resulting from its unlawful conduct), temporary character (termination of the reprisal when the adversary stops violating the law).\nAs can be seen in the Davis article, which notes the difference between the SJW-created blockbot and the SJW List, even if one considers the list to be an expose rather than a hiring guide, the SJW List still fits all four limits of a legitimate reprisal: subsidiarity, notice, proportionality, and temporary character.\nI have repeatedly warned SJWs that every tactic they utilize will be utilized against them. And since they have not only declared people’s employment to be fair game, but repeatedly acted in attempts to disemploy everyone from police officers to programmers, from students to scientists, it is entirely legitimate to target their jobs and their careers.\nIndeed, the mere fact of being openly sympathetic to any social justice cause should now be sufficient to give serious pause to anyone contemplating any form of a relationship, however fleeting, with an SJW.\nWhen\na belligerent party is hurt by conduct on the part of its adversary\nthat it regards as a grave breach or systematic encroachment of the laws\nof armed conflict, one possibility is to retaliate by means of an\naction that itself violates the same body of law. While recourse to such\nretaliatory action can be arbitrary and in total disregard of any\nconstraints, rules of customary law have developed in the past that\nprovide the limits within which retaliation could be regarded as a\nlegitimate reprisal. The main elements of this customary “right of\nreprisal” are: subsidiarity (failure of all other available means),\nnotice (formal warning of the planned action), proportionality (the\ndamage and suffering inflicted on the adverse party not to exceed the\nlevel of damage and suffering resulting from its unlawful conduct),\ntemporary character (termination of the reprisal when the adversary\nstops violating the law). – See more at:\nhttp://www.crimesofwar.org/a-z-guide/reprisal/#sthash.Hfd61ZIT.dpuf\nWhen\na belligerent party is hurt by conduct on the part of its adversary\nthat it regards as a grave breach or systematic encroachment of the laws\nof armed conflict, one possibility is to retaliate by means of an\naction that itself violates the same body of law. While recourse to such\nretaliatory action can be arbitrary and in total disregard of any\nconstraints, rules of customary law have developed in the past that\nprovide the limits within which retaliation could be regarded as a\nlegitimate reprisal. The main elements of this customary “right of\nreprisal” are: subsidiarity (failure of all other available means),\nnotice (formal warning of the planned action), proportionality (the\ndamage and suffering inflicted on the adverse party not to exceed the\nlevel of damage and suffering resulting from its unlawful conduct),\ntemporary character (termination of the reprisal when the adversary\nstops violating the law). – See more at:\nhttp://www.crimesofwar.org/a-z-guide/reprisal/#sthash.Hfd61ZIT.dpuf",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-24T16:00:00+00:00"
}