{
  "url": "https://voxday.net/2016/04/28/gearing-up-for-vol-xi/",
  "scraped_at": "2025-12-17T17:55:40.161518",
  "title": "Gearing up for Vol. XI",
  "date_display": "April 28, 2016",
  "date_iso": "2016-04-28T10:01:00+00:00",
  "date_from_url": "2016-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am very pleased to observe that <a href=\"https://www.jerrypournelle.com/chaosmanor/there-will-be-war-vol-xi-manic-mode-continues-trump-and-other-matters/\">Jerry Pournelle has pre-announced a new volume</a> in his legendary <i>There Will Be War</i> series:</p><blockquote class=\"tr_bq\"><p> Shortly we will announce that <i>There Will Be War, Volume XI</i> will be published in November and is now open for submissions. It’s not the formal announcement because I don’t have the web addresses for formal submission. I don’t open attachments to emails to me (obviously with some exceptions which I’m not going to tell you) because I only read plaintext in Outlook, so sending me stories to Chaos Manor isn’t going to work; I’m sure I’ll have the web addresses very shortly.</p><p>Publisher is Castalia House. There will be an omnibus hardbound edition (with Vol. XII) and eBook editions. We buy non-exclusive anthology rights only: that means we buy previously published works, and if you send an original work – a lot of people do – understand that if it is accepted you still have first serial rights until after November, after which they no longer exist for anyone. Payment on acceptance is an advance against royalties: royalties vary in this strange age, so it’s hard to say exactly, but they are competitive, and contributors receive a pro-rata share of half what I receive.</p><p>My contribution is a volume introduction, and individual story introductions. I have been known to make editorial suggestions, particularly to original contributions. I have also been known to make other contributions, fiction and non-fiction, as I find necessary.</p><p>The series has done well, even the nearly thirty-year-old volumes. Three stories in Volume X were nominated for Hugo Awards.</p></blockquote><p>We’ll get on the email addresses for submissions and whatnot this weekend. In the meantime, this means we’re going to need slush readers for it, so if you’ve got the time and you wish to volunteer to be the first line of defense, please email me with VOL XI in the title.  Last year’s readers did an excellent job, so the bar is high. Every reader should expect to read between 20 and 30 short stories in six months.</p><p>Nota Bene: If you’re thinking of submitting once the floodgates open, that’s great, but DO NOT SEND ANYTHING THAT IS NOT MILITARY SCIENCE FICTION. I cannot stress this enough. I couldn’t believe how many stories we were sent that were obviously and totally unsuitable for the anthology series. Don’t waste your time. Don’t waste our time. And keep in mind that Jerry is no respecter of persons. I’m the assistant editor, one of my stories, submitted anonymously, passed the slush readers, and Jerry didn’t hesitate to reject it anyhow. He rejected big names. He rejected very big names. He rejected unknown names. He has nothing left to prove and he has high standards, so keep that in mind before you send in anything less than your best.</p><p>And yes, we’re still doing <i>Riding the Red Horse Vol. 2</i>. Things have just been a little chaotic, that’s all. Tom and I need to sit down and figure out how many stories we’ve got already, and how many more we need.</p><p>A few mostly unrelated items to address while I’m at it:</p><ol><li><strike>Can someone email me the .mobi of <i>The Return of the Great Depression</i>?</strike> Update: Got it, thank you.</li><li>We have some exciting new authors to announce at Castalia House very soon. Three, to be precise.</li><li>Is anyone interested in a three- or six-month marketing internship? As you’ve probably noticed, I’m pretty good at that sort of thing, but my bandwidth is increasingly limited and I don’t do one-tenth the marketing that I should do. That’s about all the time that would be necessary to learn everything involved. My thought is to have a revolving marketing internship, in order to maximize the number of Ilk who are up to speed on these things.</li><li>Four words: Brainstorm. Steve Keen. Soon.</li></ol></div>",
  "content_text": "I am very pleased to observe that\nJerry Pournelle has pre-announced a new volume\nin his legendary\nThere Will Be War\nseries:\nShortly we will announce that\nThere Will Be War, Volume XI\nwill be published in November and is now open for submissions. It’s not the formal announcement because I don’t have the web addresses for formal submission. I don’t open attachments to emails to me (obviously with some exceptions which I’m not going to tell you) because I only read plaintext in Outlook, so sending me stories to Chaos Manor isn’t going to work; I’m sure I’ll have the web addresses very shortly.\nPublisher is Castalia House. There will be an omnibus hardbound edition (with Vol. XII) and eBook editions. We buy non-exclusive anthology rights only: that means we buy previously published works, and if you send an original work – a lot of people do – understand that if it is accepted you still have first serial rights until after November, after which they no longer exist for anyone. Payment on acceptance is an advance against royalties: royalties vary in this strange age, so it’s hard to say exactly, but they are competitive, and contributors receive a pro-rata share of half what I receive.\nMy contribution is a volume introduction, and individual story introductions. I have been known to make editorial suggestions, particularly to original contributions. I have also been known to make other contributions, fiction and non-fiction, as I find necessary.\nThe series has done well, even the nearly thirty-year-old volumes. Three stories in Volume X were nominated for Hugo Awards.\nWe’ll get on the email addresses for submissions and whatnot this weekend. In the meantime, this means we’re going to need slush readers for it, so if you’ve got the time and you wish to volunteer to be the first line of defense, please email me with VOL XI in the title.  Last year’s readers did an excellent job, so the bar is high. Every reader should expect to read between 20 and 30 short stories in six months.\nNota Bene: If you’re thinking of submitting once the floodgates open, that’s great, but DO NOT SEND ANYTHING THAT IS NOT MILITARY SCIENCE FICTION. I cannot stress this enough. I couldn’t believe how many stories we were sent that were obviously and totally unsuitable for the anthology series. Don’t waste your time. Don’t waste our time. And keep in mind that Jerry is no respecter of persons. I’m the assistant editor, one of my stories, submitted anonymously, passed the slush readers, and Jerry didn’t hesitate to reject it anyhow. He rejected big names. He rejected very big names. He rejected unknown names. He has nothing left to prove and he has high standards, so keep that in mind before you send in anything less than your best.\nAnd yes, we’re still doing\nRiding the Red Horse Vol. 2\n. Things have just been a little chaotic, that’s all. Tom and I need to sit down and figure out how many stories we’ve got already, and how many more we need.\nA few mostly unrelated items to address while I’m at it:\nCan someone email me the .mobi of\nThe Return of the Great Depression\n?\nUpdate: Got it, thank you.\nWe have some exciting new authors to announce at Castalia House very soon. Three, to be precise.\nIs anyone interested in a three- or six-month marketing internship? As you’ve probably noticed, I’m pretty good at that sort of thing, but my bandwidth is increasingly limited and I don’t do one-tenth the marketing that I should do. That’s about all the time that would be necessary to learn everything involved. My thought is to have a revolving marketing internship, in order to maximize the number of Ilk who are up to speed on these things.\nFour words: Brainstorm. Steve Keen. Soon.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-28T09:01:00+00:00"
}