{
  "url": "https://voxday.net/2016/04/18/god-robo/",
  "scraped_at": "2025-12-17T17:54:08.786449",
  "title": "GOD, ROBOT",
  "date_display": "April 18, 2016",
  "date_iso": "2016-04-18T08:15:00+00:00",
  "date_from_url": "2016-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://4.bp.blogspot.com/-Uns9J4Jb6Js/VxSXRLQSalI/AAAAAAAAB5w/V5ApHTz7zdwYHkkbsnBzy-L5HG704uxagCLcB/s1600/God%2BRobot_480.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/04/GodRobot_480.jpg\" width=\"250\"/></a></div><p><i>It is the year 6080 AD. Detective Theseus Hollywell has at last discovered the hiding place of William Locke, a notorious fugitive from justice who has been hunted for decades after committing unspeakable crimes.</i><br> <i><br/></i><br> <i>But Locke has a trick up his sleeve, one that the detective couldn’t expect: He has a story to tell.</i><br> <i><br/></i><br> <i>This is the tale of the theobots, the robotic beings created to love God and Man with a perfection no mere mortal could achieve. In ten stories by eight different science fiction authors, Locke recounts the role of the theobots throughout history, from the purposes for which they were originally created to their ultimate role in deciding the fate of Man, the galaxy, and one lost and tortured soul.</i></br></br></br></br></p><p><a href=\"http://amzn.to/1NhYLbf\"><b><i>GOD, ROBOT</i></b></a> is a themed collection of intertwined stories from some of the best known names in superversive science fiction. Written in the tradition of Isaac Asimov’s Three Laws of Robotics and edited by Anthony Marchetta, the book contains stories by John C. Wright, Steve Rzasa, Joshua Young, L. Jagi Lamplighter, and others.</p><p><a href=\"http://amzn.to/1NhYLbf\"><b><i>GOD, ROBOT</i></b></a> is 162 pages, is DRM-free, and is available on Amazon. Note: One story in the collection, “The Logfile” by Vox Day, was previously published in <i>The Altar of Hate</i>.</p><p>UPDATE: From the Amazon reviews:</p><blockquote class=\"tr_bq\"><p> FIVE STARS. This one pleasantly surprised me. I don’t mind<br> Asimov-style sci-fi and find the basic concept of the three laws of<br> robotics very interesting, but it’s not my favorite subgenre, and I felt<br> I could guess where things were going to go before I read it. It took a<br> few pages, but in spite of my initial reservations I was drawn in by<br> the multi-part sequential story which takes the well-known three laws<br> and posits what might happen if two more laws were added… the greatest<br> commandments of scripture–love God above all, and love your neighbor<br> as yourself–and builds an alternate future based on the<br> theologically-aware robot race that results and seeks its own place in<br> God’s creation.<i> </i></br></br></br></br></br></br></br></br></br></br></p></blockquote></div>",
  "content_text": "It is the year 6080 AD. Detective Theseus Hollywell has at last discovered the hiding place of William Locke, a notorious fugitive from justice who has been hunted for decades after committing unspeakable crimes.\nBut Locke has a trick up his sleeve, one that the detective couldn’t expect: He has a story to tell.\nThis is the tale of the theobots, the robotic beings created to love God and Man with a perfection no mere mortal could achieve. In ten stories by eight different science fiction authors, Locke recounts the role of the theobots throughout history, from the purposes for which they were originally created to their ultimate role in deciding the fate of Man, the galaxy, and one lost and tortured soul.\nGOD, ROBOT\nis a themed collection of intertwined stories from some of the best known names in superversive science fiction. Written in the tradition of Isaac Asimov’s Three Laws of Robotics and edited by Anthony Marchetta, the book contains stories by John C. Wright, Steve Rzasa, Joshua Young, L. Jagi Lamplighter, and others.\nGOD, ROBOT\nis 162 pages, is DRM-free, and is available on Amazon. Note: One story in the collection, “The Logfile” by Vox Day, was previously published in\nThe Altar of Hate\n.\nUPDATE: From the Amazon reviews:\nFIVE STARS. This one pleasantly surprised me. I don’t mind\nAsimov-style sci-fi and find the basic concept of the three laws of\nrobotics very interesting, but it’s not my favorite subgenre, and I felt\nI could guess where things were going to go before I read it. It took a\nfew pages, but in spite of my initial reservations I was drawn in by\nthe multi-part sequential story which takes the well-known three laws\nand posits what might happen if two more laws were added… the greatest\ncommandments of scripture–love God above all, and love your neighbor\nas yourself–and builds an alternate future based on the\ntheologically-aware robot race that results and seeks its own place in\nGod’s creation.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-18T07:15:00+00:00"
}