{
  "url": "https://voxday.net/2016/04/04/liberals-not-conservatives-hate-science/",
  "scraped_at": "2025-12-17T17:52:31.556980",
  "title": "Liberals, not conservatives, hate science",
  "date_display": "April 4, 2016",
  "date_iso": "2016-04-04T17:00:00+00:00",
  "date_from_url": "2016-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Maddox has amply demonstrated, they don’t “fucking love science”, they like pictures that remind them of science. <a href=\"http://nymag.com/scienceofus/2015/12/when-liberals-attack-social-science.html\">Actual science, they hate</a>, because it’s not careful of their precious feelings and tends to gradually destroy their sacred narratives:</p><blockquote class=\"tr_bq\"><p> I first read <i>Galileo’s Middle Finger: Heretics, Activists, and the Search for Justice in Science</i> when I was home for Thanksgiving, and I often left it lying around the house when I was doing other stuff. At one point, my dad picked it up off a table and started reading the back-jacket copy. “That’s an amazing book so far,” I said. “It’s about the politicization of science.” “Oh,” my dad responded. “You mean like Republicans and climate change?”</p><p>That exchange perfectly sums up why anyone who is interested in how tricky a construct “truth” has become in 2015 should read Alice Dreger’s book. No, it isn’t about climate change, but my dad could be excused for thinking any book about the politicization of science must be about conservatives. Many liberals, after all, have convinced themselves that it’s conservatives who attack science in the name of politics, while they would never do such a thing. <i>Galileo’s Middle Finger</i> corrects this misperception in a rather jarring fashion, and that’s why it’s one of the most important social-science books of 2015.</p><p>At its core, <i>Galileo’s Middle Finger</i> is about what happens when science and dogma collide — specifically, what happens when science makes a claim that doesn’t fit into an activist community’s accepted worldview. And many of Dreger’s most interesting, explosive examples of this phenomenon involve liberals, not conservatives, fighting tooth and nail against open scientific inquiry.</p></blockquote><p>It’s probably not a book anyone who reads this blog regularly needs to read, but it may be one that most of us would like to give to someone we know. As Nassim Taleb explains, what passes for science simply isn’t really science and <a href=\"https://www.facebook.com/nntaleb/posts/10153658794008375\">it certainly isn’t reliable</a>.</p><blockquote class=\"tr_bq\"><p> What we are seeing worldwide, from India to the UK to the US, is the rebellion against the inner circle of no-skin-in-the-game policymaking “clerks” and journalists-insiders, that class of paternalistic semi-intellectual experts with some Ivy league, Oxford-Cambridge, or similar label-driven education who are telling the rest of us 1) what to do, 2) what to eat, 3) how to speak, 4) how to think… and 5) who to vote for.</p><p>With psychology papers replicating less than 40%, dietary advice reversing after 30y of fatphobia, macroeconomic analysis working worse than astrology, microeconomic papers wrong 40% of the time, the appointment of Bernanke who was less than clueless of the risks, and pharmaceutical trials replicating only 1/5th of the time, people are perfectly entitled to rely on their own ancestral instinct and listen to their grandmothers with a better track record than these policymaking goons.</p><p>Indeed one can see that these academico-bureaucrats wanting to run our lives aren’t even rigorous, whether in medical statistics or policymaking. I have shown that most of what Cass-Sunstein-Richard Thaler types call “rational” or “irrational” comes from misunderstanding of probability theory.</p></blockquote></div>",
  "content_text": "As Maddox has amply demonstrated, they don’t “fucking love science”, they like pictures that remind them of science.\nActual science, they hate\n, because it’s not careful of their precious feelings and tends to gradually destroy their sacred narratives:\nI first read\nGalileo’s Middle Finger: Heretics, Activists, and the Search for Justice in Science\nwhen I was home for Thanksgiving, and I often left it lying around the house when I was doing other stuff. At one point, my dad picked it up off a table and started reading the back-jacket copy. “That’s an amazing book so far,” I said. “It’s about the politicization of science.” “Oh,” my dad responded. “You mean like Republicans and climate change?”\nThat exchange perfectly sums up why anyone who is interested in how tricky a construct “truth” has become in 2015 should read Alice Dreger’s book. No, it isn’t about climate change, but my dad could be excused for thinking any book about the politicization of science must be about conservatives. Many liberals, after all, have convinced themselves that it’s conservatives who attack science in the name of politics, while they would never do such a thing.\nGalileo’s Middle Finger\ncorrects this misperception in a rather jarring fashion, and that’s why it’s one of the most important social-science books of 2015.\nAt its core,\nGalileo’s Middle Finger\nis about what happens when science and dogma collide — specifically, what happens when science makes a claim that doesn’t fit into an activist community’s accepted worldview. And many of Dreger’s most interesting, explosive examples of this phenomenon involve liberals, not conservatives, fighting tooth and nail against open scientific inquiry.\nIt’s probably not a book anyone who reads this blog regularly needs to read, but it may be one that most of us would like to give to someone we know. As Nassim Taleb explains, what passes for science simply isn’t really science and\nit certainly isn’t reliable\n.\nWhat we are seeing worldwide, from India to the UK to the US, is the rebellion against the inner circle of no-skin-in-the-game policymaking “clerks” and journalists-insiders, that class of paternalistic semi-intellectual experts with some Ivy league, Oxford-Cambridge, or similar label-driven education who are telling the rest of us 1) what to do, 2) what to eat, 3) how to speak, 4) how to think… and 5) who to vote for.\nWith psychology papers replicating less than 40%, dietary advice reversing after 30y of fatphobia, macroeconomic analysis working worse than astrology, microeconomic papers wrong 40% of the time, the appointment of Bernanke who was less than clueless of the risks, and pharmaceutical trials replicating only 1/5th of the time, people are perfectly entitled to rely on their own ancestral instinct and listen to their grandmothers with a better track record than these policymaking goons.\nIndeed one can see that these academico-bureaucrats wanting to run our lives aren’t even rigorous, whether in medical statistics or policymaking. I have shown that most of what Cass-Sunstein-Richard Thaler types call “rational” or “irrational” comes from misunderstanding of probability theory.",
  "tags": [
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-04T16:00:00+00:00"
}