{
  "url": "https://voxday.net/2016/04/27/making-hugos-great-again/",
  "scraped_at": "2025-12-17T17:55:29.861508",
  "title": "Making the Hugos great again",
  "date_display": "April 27, 2016",
  "date_iso": "2016-04-27T12:00:00+00:00",
  "date_from_url": "2016-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://3.bp.blogspot.com/-zT-D085Pmpk/VyCfvhRRFsI/AAAAAAAAB7k/-wA6ZJ7b3tQ1Svxn2ZAipOUZ3kRWslcvQCLcB/s1600/RP_2016_mail2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"208\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/04/RP_2016_mail2.png\" width=\"640\"/></a></div><p>  A roundup of reactions to the Rabid Puppies rampaging through the 2016 Hugo Awards. <a href=\"https://www.jerrypournelle.com/chaosmanor/manic-hugo-nomination-trump-roman-ice-age-after-roman-warm-and-many-other-important-matters/\">Jerry Pournelle’s nomination</a> alone makes the whole effort worthwhile:</p><blockquote class=\"tr_bq\"><p> I seem to have been nominated for a Hugo. “Best Editor, Short Form”. The only work mentioned for the year 2015 is <i>There Will Be War, Volume X</i>” released in November. It is of course a continuation of the <i>There Will Be War</i> series which appeared in the 1980’s and early 90’s, of which the first four volumes were recreated with a new preface during 2015; the rest are scheduled to come out in the next couple of years. I’ve edited a lot of anthologies, starting with 2020 Vision in 1973 (I think it will come out in reprint with new a introduction and afterword’s by the surviving authors next year. I did a series of anthologies with Jim Baen that was pretty popular, and one-off anthologies like Black Holes and The Survival of Freedom, amounting to more than twenty over the years, but this is the first time anyone has ever nominated me for an editing Hugo – and actually the first time I ever thought of it myself.</p><p>When I first started in this racket, Best Editor Hugo usually meant one for the current editor of Analog or Galaxy. That spread around over the years, but it meant Editor in the sense of someone employed with the title of Editor, not a working writer who put together anthologies, sometimes for a lark.</p><p>I used to get Hugo nominations all the time in my early days, but I never won. My Black Holes story came close, but I lost to Niven’s “Hole Man”. Ursula LeGuin beat me for novella. There were others. Our collaborations routinely got nominated, but again usually came second, so at one point I was irked enough to say “Money will get you through times of no Hugo’s much better than Hugo’s will get you through times of no money,” and put whatever promotion efforts I had time for into afternoon and late night talk radio shows and stuff like that. Which worked for sales, but not for Hugo awards. I’m unlikely to get this one – I’m a good editor but that’s hardly my primary occupation – but I admit I’d like to. I was already going to Kansas City this August, so I’ll be there, but I doubt there’s much need to write a thank you speech.</p></blockquote><p>One of the reasons I never paid any attention to the Hugos in the past was due to their tendency to overlook excellence such as the There Will Be War series, one of the best and most influential science fiction anthologies series ever created. I’m delighted we were able to pay collective homage to the SF great; having worked closely with him over the past year, I can testify that he is still a <i>much</i> better editor than most of the award-winning editors of the past 30 years.</p><p>David Barnett’s <a href=\"http://www.theguardian.com/books/2016/apr/26/hugo-awards-shortlist-rightwing-campaign-sad-rabid-puppies?utm_source=twitterfeed&amp;utm_medium=twitter\">story in <i>The Guardian</i></a> was almost balanced and mostly stuck to the facts, which is rather remarkable considering that he is a Tor author. Sure, there are a few errors, such as the fact that SJWs Always Lie is a political philosophy bestseller, not “an essay”, and “parody of erotic dinosaur fiction” is redundant, but he also, almost uniquely, went to the trouble of <a href=\"http://www.theguardian.com/books/2016/apr/26/the-hugo-awards-george-rr-martin-vox-day-and-alastair-reynolds-on-the-prizes-future\">asking me what I thought</a> about the awards, rather than asking my opponents what they imagined I thought.</p><p>It would appear that Barnett actually understood what I told him about the consequences of last year’s ludicrous media coverage, and applied that understanding. <i>“I think they [the Puppies campaigns] have successfully exposed the<br> extent of the ideological bias in science fiction and fantasy<br> publishing, and in the media. The media coverage last year was so insane<br> and so over the top that it significantly boosted support for the Rabid<br> Puppies.”</br></br></br></br></i></p><blockquote class=\"tr_bq\"><p> The annual Hugo awards for the best science fiction of the year have once again been riven by controversy, as a concerted campaign by a conservative lobby has dominated the ballot.</p><p>The Sad Puppies and Rabid Puppies movements, which both separately campaign against a perceived bias towards liberal and leftwing science-fiction and fantasy authors, have managed to get the majority of their preferred nominations on to the final ballot, announced today.</p><p>This means that voters on the prestigious awards will now be choosing from a shortlist which includes SJWs Always Lie, an essay about “social justice warriors” by Rabid Puppies campaign leader Vox Day; a self-published parody of erotic dinosaur fiction called Space Raptor Butt Invasion, by Chuck Tingle; and My Little Pony cartoon The Cutie Map….</p><p>The Puppies factions will undoubtedly be celebrating their successes on the ballot, but for many people engaged in the science-fiction and fantasy genres this news will not be well-received. The Hugo awards, once the watchword of quality in the SFF world, appear to have been utterly derailed for the second year running.</p></blockquote><p>Another Tor author, McRapey, <a href=\"http://www.latimes.com/books/jacketcopy/la-et-jc-john-scalzi-hugo-award-nominations-20160426-story.html\">was up to his usual tricks</a>, attempting to minimize everything, including his own award-pimping and campaigning. Isn’t it fascinating how many Tor authors are out there attempting to shape the media narrative? How utterly unexpected!</p><blockquote class=\"tr_bq\"><p> <b>The Hugo finalists: John Scalzi on why the sad puppies can’t take credit for Neil Gaiman’s success</b></p><p>The Puppies will no doubt be happy to take credit for the appearance of these works and others on the finalist list. But, as with “Guardians of the Galaxy” last year, their endorsement probably doesn’t count for much in the grand scheme of things. “Seveneves,” one of the most talked-about science fiction books of 2015, was already a heavy favorite for an appearance on the finalist list for best novel.</p><p>Likewise, Gaiman’s long-awaited return to the beloved Sandman universe means his finalist listing in best graphic novel was the closest thing to a shoo-in that the Hugos have. If “The Martian” hadn’t been a finalist in its category (best dramatic presentation, long form), people would have been stunned.</p><p>In these cases as in several others, the Puppies are running in front of an existing parade and claiming to lead it. Few who know the field or the Hugos would give the slates credit for highlighting works and authors already well-appreciated in the genre, many of which have appeared this year as finalists for other awards or on bestseller lists.</p></blockquote><p>Of course the Sad Puppies can’t take any credit for Neil Gaiman’s nomination. The Rabid Puppies were responsible! As for whether Gaiman would have been nominated without RP support, they like to claim that sort of thing, but we’ll have to wait and see what the numbers say. Given their past record of ignoring popular, bestselling works, that’s hardly a given. In any event, as we proved last year in Best Novel, even when we don’t control the category, we still have the ability to decide who will win and who will lose when the SJWs don’t No Award the category.</p><p>In other news, we have a runner! Tom Mays belatedly decided <a href=\"http://file770.com/?p=28662\">to go the way of Marko Kloos</a>. Not the brightest move; the time for virtue-signaling is <i>before</i> the nominations are awarded. It’s no big deal, not everyone can take the heat, although I suspect Tom is simply more of a Sad Puppy who hasn’t woken up to the cultural war yet. I was more interested to see that Black Gate caved and decided to accept their nomination this year; John O’Neill is a smart guy, he knows perfectly well that the nomination is well-merited, he grasps the genetic fallacy, and I suspect he has come to terms with the fact that the Rabid Puppies are not going away any time soon.</p><p>It’s a bit amusing to see the SJWs suggesting hopefully that EPH is going to somehow “solve” the “problem of the Puppies”. Do they really think I didn’t know, from the start, that they were going to change the rules? Or that I don’t know, better than they do, what the consequences will be?</p><p>The real question of this year’s awards is on what basis the administrators disqualified all five computer game nominations in the Best Dramatic Presentation categories. That bears investigation. But these are minor concerns, as for me the three most important factors are these:</p><ol><li> The rocks are being overturned and the long-hidden problem of pedophilia in science fiction is finally beginning to be exposed. This is the real story.</li><li> Jerry Pournelle being recognized for his excellent and ground-breaking editorial work.</li><li>SPACE RAPTOR BUTT INVASION!</li></ol><p>I don’t know if we’ll see more than five categories no-awarded this year, but it doesn’t matter. They didn’t think the Rabid Puppies could do it this year, but once more, the Puppies demonstrated that the SJW Narrative is a false one and the oft-repeated insistence that everyone subscribes to it is a lie.</p><p>I also sent out a press release:</p><p><a name=\"more\"></a></p><h1 style=\"color: #202020; display: block; font-family: Helvetica; font-size: 26px; font-style: normal; font-weight: bold; letter-spacing: normal; line-height: 125%; margin: 0; padding: 0; text-align: center;\"> <b>RABID PUPPIES<br> Make the 2016 Hugos Great</br></b></h1><div style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; color: #202020; font-family: Helvetica; font-size: 16px; line-height: 150%; margin: 10px 0; mso-line-height-rule: exactly; padding: 0; text-align: left;\"> Much<br> to the surprise of the social justice warriors in the science fiction<br> community, who believed stern disapproval and a record voter turnout<br> would suffice to leash the Rabid Puppies, the nominations for the 2016<br> Hugo Awards were once more dominated by the corybantic canines. 64 of<br> the Supreme Dark Lord’s 81 recommendations made the 2016 shortlist, an<br> increase of 6 from last year’s 58 finalists.<p>“I’m not even remotely surprised to learn that the Rabid Puppies did so<br> well,” said Vox Day, as he mopped his brow with the flayed skin of an<br> SJW after an arduous night of celebrating his fourth and fifth<br> nominations. “For over 20 years, the mainstream science-fiction<br> publishers have been trying to pass off romance in space and left-wing<br> diversity lectures as science fiction. Support for the Puppies is a<br> popular reaction to mediocrities and absurdities being presented as the<br> very best that the field has to offer.”</br></br></br></br></br></br></br></p><p>Many of the finalists were delighted by the news. Chuck Tingle, author<br> of “Space Raptor Butt Invasion”, nominated for Best Short Story,<br> tweeted: “understand<b> </b>#HUGOAWARDS<b> </b>nominate Space Raptor Butt Invasion as best book ever. This PROVES that we exhist in the first layer of tingleverse!”</br></br></p><p>Others were less pleased. Tor Books author David Barnett declared in <i>The Guardian</i>:<br> “The Hugo awards, once the watchword of quality in the SFF world,<br> appear to have been utterly derailed for the second year running.”</br></br></p><p>Some of the more notable Hugo Award finalists include:</p></br></br></br></br></br></br></div><ul><li style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; mso-line-height-rule: exactly;\">Moira<br> Greyland’s account of her childhood abuse at the hands of her mother,<br> the award-winning science fiction writer Marion Zimmer Bradley,<br> nominated in Best Related Work.</br></br></br></li><li style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; mso-line-height-rule: exactly;\">SF great Jerry Pournelle, whose groundbreaking <i>There Will Be War</i> series returned after a 25-year absence due to the end of the Cold War, nominated in Best Editor, Short Form.</li><li style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; mso-line-height-rule: exactly;\">“Space<br> Raptor Butt Invasion” by Chuck Tingle, a sensuous space romance that is<br> a tribute to true diversity in science fiction, nominated in Best Short<br> Story.</br></br></br></li><li style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; mso-line-height-rule: exactly;\"><i>SJWs Always Lie: Taking Down the Thought Police</i>, the political philosophy bestseller by Vox Day, nominated in Best Related Work.</li><li style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; mso-line-height-rule: exactly;\"><i style=\"border: 0px none white; font-family: inherit; font-size: 100%; font-style: italic; font-weight: inherit; margin: 0px; outline: invert none 0px; padding: 0px; vertical-align: baseline;\">My Little Pony, Friendship is Magic</i>, Season 5, Episodes 1-2, “The Cutie Map”, nominated in Best Dramatic Presentation, Short Form.</li></ul><p>The official list of the finalists in all 16 categories, including the<br> 2016 Campbell Award for Best New Writer, can be found here: <a href=\"http://www.thehugoawards.org/hugo-history/2016-hugo-awards/\" rel=\"noopener\" style=\"-ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; color: #2baadf; font-weight: normal; mso-line-height-rule: exactly; text-decoration: underline;\" target=\"_blank\">2016 Hugo Nominations</a>.</br></p></div>",
  "content_text": "A roundup of reactions to the Rabid Puppies rampaging through the 2016 Hugo Awards.\nJerry Pournelle’s nomination\nalone makes the whole effort worthwhile:\nI seem to have been nominated for a Hugo. “Best Editor, Short Form”. The only work mentioned for the year 2015 is\nThere Will Be War, Volume X\n” released in November. It is of course a continuation of the\nThere Will Be War\nseries which appeared in the 1980’s and early 90’s, of which the first four volumes were recreated with a new preface during 2015; the rest are scheduled to come out in the next couple of years. I’ve edited a lot of anthologies, starting with 2020 Vision in 1973 (I think it will come out in reprint with new a introduction and afterword’s by the surviving authors next year. I did a series of anthologies with Jim Baen that was pretty popular, and one-off anthologies like Black Holes and The Survival of Freedom, amounting to more than twenty over the years, but this is the first time anyone has ever nominated me for an editing Hugo – and actually the first time I ever thought of it myself.\nWhen I first started in this racket, Best Editor Hugo usually meant one for the current editor of Analog or Galaxy. That spread around over the years, but it meant Editor in the sense of someone employed with the title of Editor, not a working writer who put together anthologies, sometimes for a lark.\nI used to get Hugo nominations all the time in my early days, but I never won. My Black Holes story came close, but I lost to Niven’s “Hole Man”. Ursula LeGuin beat me for novella. There were others. Our collaborations routinely got nominated, but again usually came second, so at one point I was irked enough to say “Money will get you through times of no Hugo’s much better than Hugo’s will get you through times of no money,” and put whatever promotion efforts I had time for into afternoon and late night talk radio shows and stuff like that. Which worked for sales, but not for Hugo awards. I’m unlikely to get this one – I’m a good editor but that’s hardly my primary occupation – but I admit I’d like to. I was already going to Kansas City this August, so I’ll be there, but I doubt there’s much need to write a thank you speech.\nOne of the reasons I never paid any attention to the Hugos in the past was due to their tendency to overlook excellence such as the There Will Be War series, one of the best and most influential science fiction anthologies series ever created. I’m delighted we were able to pay collective homage to the SF great; having worked closely with him over the past year, I can testify that he is still a\nmuch\nbetter editor than most of the award-winning editors of the past 30 years.\nDavid Barnett’s\nstory in\nThe Guardian\nwas almost balanced and mostly stuck to the facts, which is rather remarkable considering that he is a Tor author. Sure, there are a few errors, such as the fact that SJWs Always Lie is a political philosophy bestseller, not “an essay”, and “parody of erotic dinosaur fiction” is redundant, but he also, almost uniquely, went to the trouble of\nasking me what I thought\nabout the awards, rather than asking my opponents what they imagined I thought.\nIt would appear that Barnett actually understood what I told him about the consequences of last year’s ludicrous media coverage, and applied that understanding.\n“I think they [the Puppies campaigns] have successfully exposed the\nextent of the ideological bias in science fiction and fantasy\npublishing, and in the media. The media coverage last year was so insane\nand so over the top that it significantly boosted support for the Rabid\nPuppies.”\nThe annual Hugo awards for the best science fiction of the year have once again been riven by controversy, as a concerted campaign by a conservative lobby has dominated the ballot.\nThe Sad Puppies and Rabid Puppies movements, which both separately campaign against a perceived bias towards liberal and leftwing science-fiction and fantasy authors, have managed to get the majority of their preferred nominations on to the final ballot, announced today.\nThis means that voters on the prestigious awards will now be choosing from a shortlist which includes SJWs Always Lie, an essay about “social justice warriors” by Rabid Puppies campaign leader Vox Day; a self-published parody of erotic dinosaur fiction called Space Raptor Butt Invasion, by Chuck Tingle; and My Little Pony cartoon The Cutie Map….\nThe Puppies factions will undoubtedly be celebrating their successes on the ballot, but for many people engaged in the science-fiction and fantasy genres this news will not be well-received. The Hugo awards, once the watchword of quality in the SFF world, appear to have been utterly derailed for the second year running.\nAnother Tor author, McRapey,\nwas up to his usual tricks\n, attempting to minimize everything, including his own award-pimping and campaigning. Isn’t it fascinating how many Tor authors are out there attempting to shape the media narrative? How utterly unexpected!\nThe Hugo finalists: John Scalzi on why the sad puppies can’t take credit for Neil Gaiman’s success\nThe Puppies will no doubt be happy to take credit for the appearance of these works and others on the finalist list. But, as with “Guardians of the Galaxy” last year, their endorsement probably doesn’t count for much in the grand scheme of things. “Seveneves,” one of the most talked-about science fiction books of 2015, was already a heavy favorite for an appearance on the finalist list for best novel.\nLikewise, Gaiman’s long-awaited return to the beloved Sandman universe means his finalist listing in best graphic novel was the closest thing to a shoo-in that the Hugos have. If “The Martian” hadn’t been a finalist in its category (best dramatic presentation, long form), people would have been stunned.\nIn these cases as in several others, the Puppies are running in front of an existing parade and claiming to lead it. Few who know the field or the Hugos would give the slates credit for highlighting works and authors already well-appreciated in the genre, many of which have appeared this year as finalists for other awards or on bestseller lists.\nOf course the Sad Puppies can’t take any credit for Neil Gaiman’s nomination. The Rabid Puppies were responsible! As for whether Gaiman would have been nominated without RP support, they like to claim that sort of thing, but we’ll have to wait and see what the numbers say. Given their past record of ignoring popular, bestselling works, that’s hardly a given. In any event, as we proved last year in Best Novel, even when we don’t control the category, we still have the ability to decide who will win and who will lose when the SJWs don’t No Award the category.\nIn other news, we have a runner! Tom Mays belatedly decided\nto go the way of Marko Kloos\n. Not the brightest move; the time for virtue-signaling is\nbefore\nthe nominations are awarded. It’s no big deal, not everyone can take the heat, although I suspect Tom is simply more of a Sad Puppy who hasn’t woken up to the cultural war yet. I was more interested to see that Black Gate caved and decided to accept their nomination this year; John O’Neill is a smart guy, he knows perfectly well that the nomination is well-merited, he grasps the genetic fallacy, and I suspect he has come to terms with the fact that the Rabid Puppies are not going away any time soon.\nIt’s a bit amusing to see the SJWs suggesting hopefully that EPH is going to somehow “solve” the “problem of the Puppies”. Do they really think I didn’t know, from the start, that they were going to change the rules? Or that I don’t know, better than they do, what the consequences will be?\nThe real question of this year’s awards is on what basis the administrators disqualified all five computer game nominations in the Best Dramatic Presentation categories. That bears investigation. But these are minor concerns, as for me the three most important factors are these:\nThe rocks are being overturned and the long-hidden problem of pedophilia in science fiction is finally beginning to be exposed. This is the real story.\nJerry Pournelle being recognized for his excellent and ground-breaking editorial work.\nSPACE RAPTOR BUTT INVASION!\nI don’t know if we’ll see more than five categories no-awarded this year, but it doesn’t matter. They didn’t think the Rabid Puppies could do it this year, but once more, the Puppies demonstrated that the SJW Narrative is a false one and the oft-repeated insistence that everyone subscribes to it is a lie.\nI also sent out a press release:\nRABID PUPPIES\nMake the 2016 Hugos Great\nMuch\nto the surprise of the social justice warriors in the science fiction\ncommunity, who believed stern disapproval and a record voter turnout\nwould suffice to leash the Rabid Puppies, the nominations for the 2016\nHugo Awards were once more dominated by the corybantic canines. 64 of\nthe Supreme Dark Lord’s 81 recommendations made the 2016 shortlist, an\nincrease of 6 from last year’s 58 finalists.\n“I’m not even remotely surprised to learn that the Rabid Puppies did so\nwell,” said Vox Day, as he mopped his brow with the flayed skin of an\nSJW after an arduous night of celebrating his fourth and fifth\nnominations. “For over 20 years, the mainstream science-fiction\npublishers have been trying to pass off romance in space and left-wing\ndiversity lectures as science fiction. Support for the Puppies is a\npopular reaction to mediocrities and absurdities being presented as the\nvery best that the field has to offer.”\nMany of the finalists were delighted by the news. Chuck Tingle, author\nof “Space Raptor Butt Invasion”, nominated for Best Short Story,\ntweeted: “understand\n#HUGOAWARDS\nnominate Space Raptor Butt Invasion as best book ever. This PROVES that we exhist in the first layer of tingleverse!”\nOthers were less pleased. Tor Books author David Barnett declared in\nThe Guardian\n:\n“The Hugo awards, once the watchword of quality in the SFF world,\nappear to have been utterly derailed for the second year running.”\nSome of the more notable Hugo Award finalists include:\nMoira\nGreyland’s account of her childhood abuse at the hands of her mother,\nthe award-winning science fiction writer Marion Zimmer Bradley,\nnominated in Best Related Work.\nSF great Jerry Pournelle, whose groundbreaking\nThere Will Be War\nseries returned after a 25-year absence due to the end of the Cold War, nominated in Best Editor, Short Form.\n“Space\nRaptor Butt Invasion” by Chuck Tingle, a sensuous space romance that is\na tribute to true diversity in science fiction, nominated in Best Short\nStory.\nSJWs Always Lie: Taking Down the Thought Police\n, the political philosophy bestseller by Vox Day, nominated in Best Related Work.\nMy Little Pony, Friendship is Magic\n, Season 5, Episodes 1-2, “The Cutie Map”, nominated in Best Dramatic Presentation, Short Form.\nThe official list of the finalists in all 16 categories, including the\n2016 Campbell Award for Best New Writer, can be found here:\n2016 Hugo Nominations\n.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-27T11:00:00+00:00"
}