{
  "url": "https://voxday.net/2016/04/17/names-are-harassment-now/",
  "scraped_at": "2025-12-17T17:54:05.031311",
  "title": "Names are harassment now",
  "date_display": "April 17, 2016",
  "date_iso": "2016-04-17T12:00:00+00:00",
  "date_from_url": "2016-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always amusing what contortions SJWs will twist themselves into in order to try to justify their actions beyond “me no likee”. Reddit is <a href=\"https://www.reddit.com/r/SocialJusticeInAction/comments/4edc0m/regarding_the_sjw_list/\">suspending accounts for linking to pages</a> “posting the personal information (including the full names) of non-public people.”</p><blockquote class=\"tr_bq\"><p> As some of you may know, there is a list of “confirmed SJWs” being passed around on various sites.</p><p>Do not post or link to it on Reddit. It’s considered personal information, and you will likely have your accounts suspended for it.</p><p>We already had one user post it here, and it was removed earlier today by the admins, and the account suspended. Similar issue happened on /r/SJWsAtWork, as well.</p><p>This was the ruling given to us:</p><p><i>    Our rules aren’t just against connecting IRL names to reddit user names, they are also against posting the personal information (including the full names) of non-public people.</i></p><p>Just wanted to give y’all a heads-up as to what’s going on, so none of you lose your accounts or think that we’re censoring it.</p></blockquote><p>The funny thing is that despite their attempts to justify banning anyone who links to a list of which they don’t approve, and thereby creating a rule that requires the banning of anyone who links to any page with just one individual’s full name on it, the rule doesn’t actually apply to <a href=\"http://sjwlist.com/\">The Complete List of SJW</a> because it doesn’t feature full names.</p><p>It does, however, ban anyone from linking to Facebook, among other sites. Not that it will be applied that way by the moderators, of course, because SJW.</p><p>It seems the primitive magicians were right. There is dark power in the knowledge of true names!</p></div>",
  "content_text": "It’s always amusing what contortions SJWs will twist themselves into in order to try to justify their actions beyond “me no likee”. Reddit is\nsuspending accounts for linking to pages\n“posting the personal information (including the full names) of non-public people.”\nAs some of you may know, there is a list of “confirmed SJWs” being passed around on various sites.\nDo not post or link to it on Reddit. It’s considered personal information, and you will likely have your accounts suspended for it.\nWe already had one user post it here, and it was removed earlier today by the admins, and the account suspended. Similar issue happened on /r/SJWsAtWork, as well.\nThis was the ruling given to us:\nOur rules aren’t just against connecting IRL names to reddit user names, they are also against posting the personal information (including the full names) of non-public people.\nJust wanted to give y’all a heads-up as to what’s going on, so none of you lose your accounts or think that we’re censoring it.\nThe funny thing is that despite their attempts to justify banning anyone who links to a list of which they don’t approve, and thereby creating a rule that requires the banning of anyone who links to any page with just one individual’s full name on it, the rule doesn’t actually apply to\nThe Complete List of SJW\nbecause it doesn’t feature full names.\nIt does, however, ban anyone from linking to Facebook, among other sites. Not that it will be applied that way by the moderators, of course, because SJW.\nIt seems the primitive magicians were right. There is dark power in the knowledge of true names!",
  "tags": [
    "SJW",
    "technology",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-17T11:00:00+00:00"
}