{
  "url": "https://voxday.net/2016/04/29/nfl-draft-2016/",
  "scraped_at": "2025-12-17T17:55:46.430693",
  "title": "NFL Draft 2016",
  "date_display": "April 29, 2016",
  "date_iso": "2016-04-29T12:28:00+00:00",
  "date_from_url": "2016-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Vikings <a href=\"http://www.cbssports.com/nfl/eye-on-football/25570118/nfl-draft-grades-2016-vikings-get-an-a-for-drafting-laquon-treadwell-at-no-23\">select Laquon Treadwell</a>, WR:</p><blockquote class=\"tr_bq\"><p> COMPARES TO: Dez Bryant, Dallas<br> Cowboys – Treadwell shows a Bryant-like skillset with his size and<br> athleticism combination to be a mismatch against cornerbacks on the<br> outside.</br></br></br></p><p>IN OUR VIEW: Treadwell has exceptional ballskills and<br> catching radius with strong hands to pluck away from his body or scoop<br> off his shoelaces – if the throw is anywhere within a few feet of his<br> body, he’ll attack it. He isn’t a sudden athlete, but plays with<br> athletic twitch and power to be a threat after the catch.</br></br></br></br></p><p>Immediately,<br> Treadwell should fit in as a possession type of receiver alongside<br> Stefon Diggs. With improved route-running, though, Treadwell could turn<br> into a downfield threat, even without top-notch speed.</br></br></br></p><p>With Teddy<br> Bridgewater, the Vikings offense isn’t built around the deep ball.<br> Treadwell should be effective in the middle of the field and, perhaps<br> most importantly, in the red zone.</br></br></br></p></blockquote><p>The analysts seem to like the pick, anyhow. We do need another possession receiver; burners are wasted given the limitations of Bridgewater’s arm. I’m a little suprised at Goff going number one, but if you have the chance to take a top QB prospect, you simply have to do so in today’s league.</p><p>And word of warning, if you feel the need to comment about how you don’t like/approve of NFL football on an NFL post, I will spam the comment. I’m done tolerating off-topic narcissists who apparently believe anyone cares about their opinion.</p></div>",
  "content_text": "The Vikings\nselect Laquon Treadwell\n, WR:\nCOMPARES TO: Dez Bryant, Dallas\nCowboys – Treadwell shows a Bryant-like skillset with his size and\nathleticism combination to be a mismatch against cornerbacks on the\noutside.\nIN OUR VIEW: Treadwell has exceptional ballskills and\ncatching radius with strong hands to pluck away from his body or scoop\noff his shoelaces – if the throw is anywhere within a few feet of his\nbody, he’ll attack it. He isn’t a sudden athlete, but plays with\nathletic twitch and power to be a threat after the catch.\nImmediately,\nTreadwell should fit in as a possession type of receiver alongside\nStefon Diggs. With improved route-running, though, Treadwell could turn\ninto a downfield threat, even without top-notch speed.\nWith Teddy\nBridgewater, the Vikings offense isn’t built around the deep ball.\nTreadwell should be effective in the middle of the field and, perhaps\nmost importantly, in the red zone.\nThe analysts seem to like the pick, anyhow. We do need another possession receiver; burners are wasted given the limitations of Bridgewater’s arm. I’m a little suprised at Goff going number one, but if you have the chance to take a top QB prospect, you simply have to do so in today’s league.\nAnd word of warning, if you feel the need to comment about how you don’t like/approve of NFL football on an NFL post, I will spam the comment. I’m done tolerating off-topic narcissists who apparently believe anyone cares about their opinion.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-29T11:28:00+00:00"
}