{
  "url": "https://voxday.net/2016/04/14/notes-on-free-trade-debate/",
  "scraped_at": "2025-12-17T17:53:44.135949",
  "title": "Notes on the free trade debate",
  "date_display": "April 14, 2016",
  "date_iso": "2016-04-14T12:00:00+00:00",
  "date_from_url": "2016-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, Dr. Miller has graciously provided <a href=\"https://soundcloud.com/user-519115521/vox-day-free-trade-debate\">the audio of our debate at Future Strategist</a>, which, among other things, once more demonstrates the astuteness of my decision to avoid pursuing a career in radio or anything that involves speaking in public. It’s as if the more clearly I am able to think through these complicated issues, the harder I find verbally articulating the path through them. At this point, I have to expect that if I ever come to correctly grok the fullness of all the myriad pros and cons of free trade, my verbal explanations will be reduced to seemingly nonsensical word bursts.</p><p><i>move… you know… war… people… um, mask of credit!</i></p><p>Second, since I didn’t have any reason to fully cite a few of the more interesting quotes I’d found, (for, as Spacebunny observes, a very particular definition of interesting) I thought some of you might find reading them to be illuminating. Since Dr. Miller didn’t put much effort into distinguishing between free trade in goods and free trade in labor, there wasn’t any point in doing more than mentioning these statements in passing. But many free traders do attempt to make the distinction, which is why I believe they are worth noting.<br> <b><br/></b><br> <b>Milton Friedman, “What is America” lecture at Stanford:</b></br></br></p><p><i>There is no doubt that free and open immigration is the right policy in a libertarian state, but in a welfare state it is a different story: the supply of immigrants will become infinite. Your proposal that someone only be able to come for employment is a good one but it would not solve the problem completely. The real hitch is in denying social benefits to the immigrants who are here. Look, for example, at the obvious, immediate, practical example of illegal Mexican immigration. Now, that Mexican immigration, over the border, is a good thing. It’s a good thing for the illegal immigrants. It’s a good thing for the United States. It’s a good thing for the citizens of the country. But, it’s only good so long as it’s illegal.</i></p><p><b>Ludwig von Mises, </b><i><b>Liberalism</b></i><b>, Chapter 8. Freedom of Movement </b><i></i></p><p>The natural conditions of production and, concomitantly, the productivity of labor are more favorable, and, as a consequence, wage rates are higher, in the United States than in vast areas of Europe. In the absence of immigration barriers, European workers would emigrate to the United States in great numbers to look for jobs. The American immigration laws make this exceptionally difficult. Thus, the wages of labor in the United States are kept above the height that they would reach if there were full freedom of migration, whereas in Europe they are depressed below this height. On the one hand, the American worker gains; on the other hand, the European worker loses.</p><p>However, it would be a mistake to consider the consequences of immigration barriers exclusively from the point of view of their immediate effect on wages. They go further. As a result of the relative oversupply of labor in areas with comparatively unfavorable conditions of production, and the relative shortage of labor in areas in which the conditions of production are comparatively favorable, production is further expanded in the former and more restricted in the latter than would be the case if there were full freedom of migration. Thus, <b>the effects of restricting this freedom are just the same as those of a protective tariff.</b> In one part of the world comparatively favorable opportunities for production are not utilized, while in another part of the world less favorable opportunities for production are being exploited. Looked at from the standpoint of humanity, the result is a lowering of the productivity of human labor, a reduction in the supply of goods at the disposal of mankind. Attempts to justify on economic grounds the policy of restricting immigration are therefore doomed from the outset. <b>There cannot be the slightest doubt that migration barriers diminish the productivity of human labor.  </b></p><p><b>Gary North, “Tariffs as Welfare-State Economics”, Mises Institute</b></p><p><i>The ethics and economics of restricted trade surely apply to the person who wants to trade on the other side of the invisible line known as a national border. If the arguments for restricted trade apply to the American economy, then surely they apply to the other nation’s economy. Logic and ethics do not change just because we cross an invisible judicial line.</i>… <i>Any time a government sends out a man with a badge and a gun to restrict trade, this is an act of war. Nobody should favor a restriction on other people’s trade unless the results of that trade are comparable to the results of trade during wartime.</i></p><p>What I find interesting about these defenders of the free movement of people, or if you prefer, free trade in labor and services, is that although the greatest among them, Ludwig von Mises, clearly recognized the potential flaw in his pro-free trade position, he not only uncharacteristically chose to wave it away, but to the extent he considered it at all, he reached what is now obviously a completely wrong conclusion.</p><p><i>This issue is of the most momentous significance for the future of the world. Indeed, the fate of civilization depends on its satisfactory resolution. It is clear that no solution of the problem of immigration is possible if one adheres to the ideal of the interventionist state, which meddles in every field of human activity, or to that of the socialist state. Only the adoption of the liberal program could make the problem of immigration, which today seems insoluble, completely disappear. In an Australia governed according to liberal principles, what difficulties could arise from the fact that in some parts of the continent Japanese and in other parts Englishmen were in the majority?</i></p><p>To continue from my observation in last night’s debate, this is a 20th century defense of an 18th century argument that sounds utterly insane in the face of 21st century realities. Consider the application of this argument to current events:</p><p><i>In a Sweden governed according to liberal principles, what difficulties could arise from the fact that in some parts of the country Syrians and in other parts Swedes were in the majority?</i></p><p>What difficulties indeed?  Anyhow, it has become increasingly apparent to me that the lack of concern about national sovereignty shown by free traders is akin to that demonstrated by libertarians, and reflects a fundamental conflation of the concept of “the nation” with the concept of “the state”. They simply don’t understand that their positions are <i>logically</i> self-refuting in addition to being empirically false.</p><p>UPDATE: The paper I mentioned, <i>Trade Wars, Trade Negotiations and Applied Game Theory</i>, by Glenn W. Harrison and E. E. Rutström, <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwjxl5i-ko7MAhXEtBoKHcrCCYgQFggdMAA&amp;url=http%3A%2F%2Fwww.jstor.org%2Fstable%2F2233549&amp;usg=AFQjCNGILrOzQgfLqVkwdYkb5sdUbQfdRw&amp;sig2=ayFu0__KJSeAH_O1UOflqw\">can be found here</a>.  <i><br/></i></p></div>",
  "content_text": "First, Dr. Miller has graciously provided\nthe audio of our debate at Future Strategist\n, which, among other things, once more demonstrates the astuteness of my decision to avoid pursuing a career in radio or anything that involves speaking in public. It’s as if the more clearly I am able to think through these complicated issues, the harder I find verbally articulating the path through them. At this point, I have to expect that if I ever come to correctly grok the fullness of all the myriad pros and cons of free trade, my verbal explanations will be reduced to seemingly nonsensical word bursts.\nmove… you know… war… people… um, mask of credit!\nSecond, since I didn’t have any reason to fully cite a few of the more interesting quotes I’d found, (for, as Spacebunny observes, a very particular definition of interesting) I thought some of you might find reading them to be illuminating. Since Dr. Miller didn’t put much effort into distinguishing between free trade in goods and free trade in labor, there wasn’t any point in doing more than mentioning these statements in passing. But many free traders do attempt to make the distinction, which is why I believe they are worth noting.\nMilton Friedman, “What is America” lecture at Stanford:\nThere is no doubt that free and open immigration is the right policy in a libertarian state, but in a welfare state it is a different story: the supply of immigrants will become infinite. Your proposal that someone only be able to come for employment is a good one but it would not solve the problem completely. The real hitch is in denying social benefits to the immigrants who are here. Look, for example, at the obvious, immediate, practical example of illegal Mexican immigration. Now, that Mexican immigration, over the border, is a good thing. It’s a good thing for the illegal immigrants. It’s a good thing for the United States. It’s a good thing for the citizens of the country. But, it’s only good so long as it’s illegal.\nLudwig von Mises,\nLiberalism\n, Chapter 8. Freedom of Movement\nThe natural conditions of production and, concomitantly, the productivity of labor are more favorable, and, as a consequence, wage rates are higher, in the United States than in vast areas of Europe. In the absence of immigration barriers, European workers would emigrate to the United States in great numbers to look for jobs. The American immigration laws make this exceptionally difficult. Thus, the wages of labor in the United States are kept above the height that they would reach if there were full freedom of migration, whereas in Europe they are depressed below this height. On the one hand, the American worker gains; on the other hand, the European worker loses.\nHowever, it would be a mistake to consider the consequences of immigration barriers exclusively from the point of view of their immediate effect on wages. They go further. As a result of the relative oversupply of labor in areas with comparatively unfavorable conditions of production, and the relative shortage of labor in areas in which the conditions of production are comparatively favorable, production is further expanded in the former and more restricted in the latter than would be the case if there were full freedom of migration. Thus,\nthe effects of restricting this freedom are just the same as those of a protective tariff.\nIn one part of the world comparatively favorable opportunities for production are not utilized, while in another part of the world less favorable opportunities for production are being exploited. Looked at from the standpoint of humanity, the result is a lowering of the productivity of human labor, a reduction in the supply of goods at the disposal of mankind. Attempts to justify on economic grounds the policy of restricting immigration are therefore doomed from the outset.\nThere cannot be the slightest doubt that migration barriers diminish the productivity of human labor.\nGary North, “Tariffs as Welfare-State Economics”, Mises Institute\nThe ethics and economics of restricted trade surely apply to the person who wants to trade on the other side of the invisible line known as a national border. If the arguments for restricted trade apply to the American economy, then surely they apply to the other nation’s economy. Logic and ethics do not change just because we cross an invisible judicial line.\n…\nAny time a government sends out a man with a badge and a gun to restrict trade, this is an act of war. Nobody should favor a restriction on other people’s trade unless the results of that trade are comparable to the results of trade during wartime.\nWhat I find interesting about these defenders of the free movement of people, or if you prefer, free trade in labor and services, is that although the greatest among them, Ludwig von Mises, clearly recognized the potential flaw in his pro-free trade position, he not only uncharacteristically chose to wave it away, but to the extent he considered it at all, he reached what is now obviously a completely wrong conclusion.\nThis issue is of the most momentous significance for the future of the world. Indeed, the fate of civilization depends on its satisfactory resolution. It is clear that no solution of the problem of immigration is possible if one adheres to the ideal of the interventionist state, which meddles in every field of human activity, or to that of the socialist state. Only the adoption of the liberal program could make the problem of immigration, which today seems insoluble, completely disappear. In an Australia governed according to liberal principles, what difficulties could arise from the fact that in some parts of the continent Japanese and in other parts Englishmen were in the majority?\nTo continue from my observation in last night’s debate, this is a 20th century defense of an 18th century argument that sounds utterly insane in the face of 21st century realities. Consider the application of this argument to current events:\nIn a Sweden governed according to liberal principles, what difficulties could arise from the fact that in some parts of the country Syrians and in other parts Swedes were in the majority?\nWhat difficulties indeed?  Anyhow, it has become increasingly apparent to me that the lack of concern about national sovereignty shown by free traders is akin to that demonstrated by libertarians, and reflects a fundamental conflation of the concept of “the nation” with the concept of “the state”. They simply don’t understand that their positions are\nlogically\nself-refuting in addition to being empirically false.\nUPDATE: The paper I mentioned,\nTrade Wars, Trade Negotiations and Applied Game Theory\n, by Glenn W. Harrison and E. E. Rutström,\ncan be found here\n.",
  "tags": [
    "debate",
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-14T11:00:00+00:00"
}