{
  "url": "https://voxday.net/2016/04/08/scientistry-and-sciensophy/",
  "scraped_at": "2025-12-17T17:52:57.568752",
  "title": "Scientistry and sciensophy",
  "date_display": "April 8, 2016",
  "date_iso": "2016-04-08T12:00:00+00:00",
  "date_from_url": "2016-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep <a href=\"http://www.theguardian.com/society/2016/apr/07/the-sugar-conspiracy-robert-lustig-john-yudkin\">this sordid history of scientific consensus</a> in mind every time you hear the AGW/CC charlatans selling their global government scam on that basis:</p><blockquote class=\"tr_bq\"><p> In 1980, after long consultation with some of America’s most senior nutrition scientists, the US government issued its first Dietary Guidelines. The guidelines shaped the diets of hundreds of millions of people. Doctors base their advice on them, food companies develop products to comply with them. Their influence extends beyond the US. In 1983, the UK government issued advice that closely followed the American example.</p><p>The most prominent recommendation of both governments was to cut back on saturated fats and cholesterol (this was the first time that the public had been advised to eat less of something, rather than enough of everything). Consumers dutifully obeyed. We replaced steak and sausages with pasta and rice, butter with margarine and vegetable oils, eggs with muesli, and milk with low-fat milk or orange juice. But instead of becoming healthier, we grew fatter and sicker.</p><p>Look at a graph of postwar obesity rates and it becomes clear that something changed after 1980. In the US, the line rises very gradually until, in the early 1980s, it takes off like an aeroplane. Just 12% of Americans were obese in 1950, 15% in 1980, 35% by 2000. In the UK, the line is flat for decades until the mid-1980s, at which point it also turns towards the sky. Only 6% of Britons were obese in 1980. In the next 20 years that figure more than trebled. Today, two thirds of Britons are either obese or overweight, making this the fattest country in the EU. Type 2 diabetes, closely related to obesity, has risen in tandem in both countries.</p><p>At best, we can conclude that the official guidelines did not achieve their objective; at worst, they led to a decades-long health catastrophe. Naturally, then, a search for culprits has ensued. Scientists are conventionally apolitical figures, but these days, nutrition researchers write editorials and books that resemble liberal activist tracts, fizzing with righteous denunciations of “big sugar” and fast food. Nobody could have predicted, it is said, how the food manufacturers would respond to the injunction against fat – selling us low-fat yoghurts bulked up with sugar, and cakes infused with liver-corroding transfats.</p><p>Nutrition scientists are angry with the press for distorting their findings, politicians for failing to heed them, and the rest of us for overeating and under-exercising. In short, everyone – business, media, politicians, consumers – is to blame. Everyone, that is, except scientists….</p><p><b>In a 2015 paper titled</b> Does Science Advance One<br> Funeral at a Time?, a team of scholars at the National Bureau of<br> Economic Research sought an empirical basis for a remark made by the<br> physicist Max Planck: “A new scientific truth does not triumph by<br> convincing its opponents and making them see the light, but rather<br> because its opponents eventually die, and a new generation grows up that<br> is familiar with it.”</br></br></br></br></br></br></p><p>The researchers identified more than 12,000 “elite” scientists from<br> different fields. The criteria for elite status included funding, number<br> of publications, and whether they were members of the National<br> Academies of Science or the Institute of Medicine. Searching obituaries,<br> the team found 452 who had died before retirement. They then looked to<br> see what happened to the fields from which these celebrated scientists<br> had unexpectedly departed, by analysing publishing patterns.</br></br></br></br></br></br></p><p>What they found confirmed the truth of Planck’s maxim. Junior<br> researchers who had worked closely with the elite scientists, authoring<br> papers with them, published less. At the same time, there was a marked<br> increase in papers by newcomers to the field, who were less likely to<br> cite the work of the deceased eminence. The articles by these newcomers<br> were substantive and influential, attracting a high number of citations.<br> They moved the whole field along.</br></br></br></br></br></br></p><p>A scientist is part of what the Polish philosopher of science Ludwik<br> Fleck called a “thought collective”: a group of people exchanging ideas<br> in a mutually comprehensible idiom. The group, suggested Fleck,<br> inevitably develops a mind of its own, as the individuals in it converge<br> on a way of communicating, thinking and feeling.</br></br></br></br></p><p>This makes scientific inquiry prone to the eternal rules of human<br> social life: deference to the charismatic, herding towards majority<br> opinion, punishment for deviance, and intense discomfort with admitting<br> to error. Of course, such tendencies are precisely what the scientific<br> method was invented to correct for, and over the long run, it does a<br> good job of it. In the long run, however, we’re all dead, quite possibly<br> sooner than we would be if we hadn’t been following a diet based on<br> poor advice.</br></br></br></br></br></br></br></p></blockquote><p>It is always necessary – it is absolutely vital – to carefully distinguish between scientody, or the scientific method, and scientistry, which is the scientific profession. The evils described in this article are not indicative of any problems with scientody, they are the consequence of the inevitable and intrinsic flaws with scientistry.</p><p>To simply call everything “science” is to be misleading, often, but not always, in innocence. Science has no authority, and increasingly, it is an intentional and deceitful bait-and-switch, in which the overly credulous are led to believe that because an individual with certain credentials is asserting something, that statement is supported by documentary evidence gathered through the scientific method of hypothesis, experiment, and successful replication.</p><p>In most – not many, but most – cases, that is simply not the case. Even if you don’t use these neologisms to <i>describe </i>the three aspects of science, you must learn to <i>distinguish </i>between them or you will repeatedly fall for this intentional bait-and-switch. In order of reliability, the three aspects of science are:</p><ul><li>Scientody: the process</li><li>Scientage: the knowledge base</li><li>Scientistry: the profession</li></ul><p>We might also coin a new term, sciensophy, as practiced by sciensophists, which is most definitely <i>not </i>an aspect of science, to describe the pseudoscience of “the social sciences”, as they do not involve any scientody and their additions to scientage have proven to be generally unreliable. Economics, nutrition, and medicine all tend to fall into this category.</p></div>",
  "content_text": "Keep\nthis sordid history of scientific consensus\nin mind every time you hear the AGW/CC charlatans selling their global government scam on that basis:\nIn 1980, after long consultation with some of America’s most senior nutrition scientists, the US government issued its first Dietary Guidelines. The guidelines shaped the diets of hundreds of millions of people. Doctors base their advice on them, food companies develop products to comply with them. Their influence extends beyond the US. In 1983, the UK government issued advice that closely followed the American example.\nThe most prominent recommendation of both governments was to cut back on saturated fats and cholesterol (this was the first time that the public had been advised to eat less of something, rather than enough of everything). Consumers dutifully obeyed. We replaced steak and sausages with pasta and rice, butter with margarine and vegetable oils, eggs with muesli, and milk with low-fat milk or orange juice. But instead of becoming healthier, we grew fatter and sicker.\nLook at a graph of postwar obesity rates and it becomes clear that something changed after 1980. In the US, the line rises very gradually until, in the early 1980s, it takes off like an aeroplane. Just 12% of Americans were obese in 1950, 15% in 1980, 35% by 2000. In the UK, the line is flat for decades until the mid-1980s, at which point it also turns towards the sky. Only 6% of Britons were obese in 1980. In the next 20 years that figure more than trebled. Today, two thirds of Britons are either obese or overweight, making this the fattest country in the EU. Type 2 diabetes, closely related to obesity, has risen in tandem in both countries.\nAt best, we can conclude that the official guidelines did not achieve their objective; at worst, they led to a decades-long health catastrophe. Naturally, then, a search for culprits has ensued. Scientists are conventionally apolitical figures, but these days, nutrition researchers write editorials and books that resemble liberal activist tracts, fizzing with righteous denunciations of “big sugar” and fast food. Nobody could have predicted, it is said, how the food manufacturers would respond to the injunction against fat – selling us low-fat yoghurts bulked up with sugar, and cakes infused with liver-corroding transfats.\nNutrition scientists are angry with the press for distorting their findings, politicians for failing to heed them, and the rest of us for overeating and under-exercising. In short, everyone – business, media, politicians, consumers – is to blame. Everyone, that is, except scientists….\nIn a 2015 paper titled\nDoes Science Advance One\nFuneral at a Time?, a team of scholars at the National Bureau of\nEconomic Research sought an empirical basis for a remark made by the\nphysicist Max Planck: “A new scientific truth does not triumph by\nconvincing its opponents and making them see the light, but rather\nbecause its opponents eventually die, and a new generation grows up that\nis familiar with it.”\nThe researchers identified more than 12,000 “elite” scientists from\ndifferent fields. The criteria for elite status included funding, number\nof publications, and whether they were members of the National\nAcademies of Science or the Institute of Medicine. Searching obituaries,\nthe team found 452 who had died before retirement. They then looked to\nsee what happened to the fields from which these celebrated scientists\nhad unexpectedly departed, by analysing publishing patterns.\nWhat they found confirmed the truth of Planck’s maxim. Junior\nresearchers who had worked closely with the elite scientists, authoring\npapers with them, published less. At the same time, there was a marked\nincrease in papers by newcomers to the field, who were less likely to\ncite the work of the deceased eminence. The articles by these newcomers\nwere substantive and influential, attracting a high number of citations.\nThey moved the whole field along.\nA scientist is part of what the Polish philosopher of science Ludwik\nFleck called a “thought collective”: a group of people exchanging ideas\nin a mutually comprehensible idiom. The group, suggested Fleck,\ninevitably develops a mind of its own, as the individuals in it converge\non a way of communicating, thinking and feeling.\nThis makes scientific inquiry prone to the eternal rules of human\nsocial life: deference to the charismatic, herding towards majority\nopinion, punishment for deviance, and intense discomfort with admitting\nto error. Of course, such tendencies are precisely what the scientific\nmethod was invented to correct for, and over the long run, it does a\ngood job of it. In the long run, however, we’re all dead, quite possibly\nsooner than we would be if we hadn’t been following a diet based on\npoor advice.\nIt is always necessary – it is absolutely vital – to carefully distinguish between scientody, or the scientific method, and scientistry, which is the scientific profession. The evils described in this article are not indicative of any problems with scientody, they are the consequence of the inevitable and intrinsic flaws with scientistry.\nTo simply call everything “science” is to be misleading, often, but not always, in innocence. Science has no authority, and increasingly, it is an intentional and deceitful bait-and-switch, in which the overly credulous are led to believe that because an individual with certain credentials is asserting something, that statement is supported by documentary evidence gathered through the scientific method of hypothesis, experiment, and successful replication.\nIn most – not many, but most – cases, that is simply not the case. Even if you don’t use these neologisms to\ndescribe\nthe three aspects of science, you must learn to\ndistinguish\nbetween them or you will repeatedly fall for this intentional bait-and-switch. In order of reliability, the three aspects of science are:\nScientody: the process\nScientage: the knowledge base\nScientistry: the profession\nWe might also coin a new term, sciensophy, as practiced by sciensophists, which is most definitely\nnot\nan aspect of science, to describe the pseudoscience of “the social sciences”, as they do not involve any scientody and their additions to scientage have proven to be generally unreliable. Economics, nutrition, and medicine all tend to fall into this category.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-08T11:00:00+00:00"
}