{
  "url": "https://voxday.net/2016/04/10/sjw-attack-on-jim-butcher/",
  "scraped_at": "2025-12-17T17:53:09.693792",
  "title": "SJW attack on Jim Butcher",
  "date_display": "April 10, 2016",
  "date_iso": "2016-04-10T09:29:00+00:00",
  "date_from_url": "2016-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://en.wikipedia.org/w/index.php?title=Jim_Butcher&amp;oldid=714502808\">one of the many, many reasons</a> that an alternative to SJW-run Wikipedia is badly needed. To the admins’ credit, at least it has been tagged as “persistent vandalism”.</p><p>It seems to have less to do with his inclusion on the Rabid Puppies list than it does with some SJW activist with a particular axe to grind at a literary celebrity’s expense, but it tends to demonstrate that anyone, no matter how publicly apolitical, is subject to SJW attack.</p><blockquote class=\"tr_bq\"><p> <u>Personal life</u></p><p>Butcher was born in Independence, Missouri, in 1971.[1] He is the youngest of three children, having two older sisters. He lives in Independence, MO, and has one son.</p><p>[Information about Butcher’s personal life redacted.]</p><p>Following Spencer’s lead, the moderators of the /r/dresdenfiles sub-Reddit proceeded to threaten any posters making negative comments regarding Butcher with a ban and deletion of their content.[3]</p><p>Many Reddit users protested, alleging that the moderators’ actions constituted censorship, a practice that is generally regarded as anathema by artists, authors, and others in the creative fields.</p><p>In response, the /r/dresdenfiles moderators proceeded to codify their censorship by requiring users meet certain requirements prior to being able to post comments and also that new users or users with ‘unpopular’ points of view must have their comments approved by a moderator before publishing.[4]</p><p>On or around April 9, 2016, several of Butcher’s fans posted an open letter requesting that Butcher comment on the North Carolina transgender law. Other fans requested that Butcher adopt a more public stance, similar to the actions of Bruce Springsteen.</p><p>There have been many concerns by Butcher’s fans that Butcher’s books were not friendly to LGBT issues.[5][6][7]</p><p>The /r/dresdenfiles moderators proceeded to delete and censor all comments regarding Butcher’s views on LGBT issues, under the posture that those comments were “spam” or “shitposts.” [8]</p><p>The /r/dresdenfiles moderators proceeded to post in other sub-reddits regarding LGBT issues and political issues in order to discredit the legitimate concerns of Butcher’s LGBT-friendly fans. [9][10]</p></blockquote><p>This is the great challenge of crowd-sourcing, as we’ve already seen on <a href=\"http://sjwlist.com/\">The Complete List of SJW</a>. The problem is less the purely destructive vandals, who are easily anticipated and blocked, than those who see an opportunity to hijack the platform and try to use it for their own particular interests.</p><p>It would be good if we were also able to identify people like the vandal responsible for adding this to the page about Butcher.</p><p>As a general rule, if it is even necessary for you to explain your position, let alone rationalize or justify it, it does not belong on a wiki. The moment you find yourself telling someone “well, this is okay because”, the moment you even use the word “because”, just stop and give it up. If it’s not so absolutely obvious that there is no need to explain it, then it does not belong.</p><p>If you’re going to contribute to The Complete List of SJW, an excellent place to find SJWs is to look for quotes in articles by SJW journalists. For example, this <a href=\"http://www.inc.com/tess-townsend/indiegogo-campaign-funding-tech-conference-white-nationalist.html\">pair </a>of <a href=\"http://www.inc.com/tess-townsend/why-it-matters-that-an-obscure-programming-conference-is-hosting-mencius-moldbug.html\">articles </a>by SJW journalist Tess Townsend, who is running interference for the LambdaConf no-platform campaign, exposes several SJWs. They will readily hang themselves by their own words through their endorsements of no-platforming people on SJW grounds.</p><p>Also, Cynic in Chief: a) email me and b) lock it down now. We need admins.</p></div>",
  "content_text": "This is\none of the many, many reasons\nthat an alternative to SJW-run Wikipedia is badly needed. To the admins’ credit, at least it has been tagged as “persistent vandalism”.\nIt seems to have less to do with his inclusion on the Rabid Puppies list than it does with some SJW activist with a particular axe to grind at a literary celebrity’s expense, but it tends to demonstrate that anyone, no matter how publicly apolitical, is subject to SJW attack.\nPersonal life\nButcher was born in Independence, Missouri, in 1971.[1] He is the youngest of three children, having two older sisters. He lives in Independence, MO, and has one son.\n[Information about Butcher’s personal life redacted.]\nFollowing Spencer’s lead, the moderators of the /r/dresdenfiles sub-Reddit proceeded to threaten any posters making negative comments regarding Butcher with a ban and deletion of their content.[3]\nMany Reddit users protested, alleging that the moderators’ actions constituted censorship, a practice that is generally regarded as anathema by artists, authors, and others in the creative fields.\nIn response, the /r/dresdenfiles moderators proceeded to codify their censorship by requiring users meet certain requirements prior to being able to post comments and also that new users or users with ‘unpopular’ points of view must have their comments approved by a moderator before publishing.[4]\nOn or around April 9, 2016, several of Butcher’s fans posted an open letter requesting that Butcher comment on the North Carolina transgender law. Other fans requested that Butcher adopt a more public stance, similar to the actions of Bruce Springsteen.\nThere have been many concerns by Butcher’s fans that Butcher’s books were not friendly to LGBT issues.[5][6][7]\nThe /r/dresdenfiles moderators proceeded to delete and censor all comments regarding Butcher’s views on LGBT issues, under the posture that those comments were “spam” or “shitposts.” [8]\nThe /r/dresdenfiles moderators proceeded to post in other sub-reddits regarding LGBT issues and political issues in order to discredit the legitimate concerns of Butcher’s LGBT-friendly fans. [9][10]\nThis is the great challenge of crowd-sourcing, as we’ve already seen on\nThe Complete List of SJW\n. The problem is less the purely destructive vandals, who are easily anticipated and blocked, than those who see an opportunity to hijack the platform and try to use it for their own particular interests.\nIt would be good if we were also able to identify people like the vandal responsible for adding this to the page about Butcher.\nAs a general rule, if it is even necessary for you to explain your position, let alone rationalize or justify it, it does not belong on a wiki. The moment you find yourself telling someone “well, this is okay because”, the moment you even use the word “because”, just stop and give it up. If it’s not so absolutely obvious that there is no need to explain it, then it does not belong.\nIf you’re going to contribute to The Complete List of SJW, an excellent place to find SJWs is to look for quotes in articles by SJW journalists. For example, this\npair\nof\narticles\nby SJW journalist Tess Townsend, who is running interference for the LambdaConf no-platform campaign, exposes several SJWs. They will readily hang themselves by their own words through their endorsements of no-platforming people on SJW grounds.\nAlso, Cynic in Chief: a) email me and b) lock it down now. We need admins.",
  "tags": [
    "Puppies",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-10T08:29:00+00:00"
}