{
  "url": "https://voxday.net/2016/04/29/sjws-ruin-watership-down/",
  "scraped_at": "2025-12-17T17:55:44.572264",
  "title": "SJWs ruin Watership Down",
  "date_display": "April 29, 2016",
  "date_iso": "2016-04-29T08:41:00+00:00",
  "date_from_url": "2016-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This sort of cultural and creative degradation is why I will never show even a modicum of mercy to SJWs. This is why there is no place for them in any civilized society. They are pure <i>hraka</i>. They are pollution. They infest every organization they are permitted to enter and <a href=\"http://www.telegraph.co.uk/news/2016/04/27/bbc-remake-watership-down-with-less-violence-to-avoid-scarring-c/\">they infect everything they touch</a>.</p><blockquote class=\"tr_bq\"><p> It was the film that traumatised a generation of children, with its much-loved rabbit characters slain on screen in graphic and memorable scenes. But the story of <i>Watership Down</i> is to be remade for a new era, as programme-makers promise to tone down its most brutal images.</p><p>The BBC has teamed up with Netflix for one of the most expensive mini-series ever made for the small screen, and the first animated four-part drama of its kind.The show’s executive producer told the Telegraph the 2017 version will not just tone down the levels of on-screen violence to make it more appropriate for children, but give a boost to its female characters.</p><p>Female rabbits including Clover, played by Gemma Arterton, Strawberry, played by Olivia Colman, and Hyzenthlay, played by Anne-Marie Duff, will get a dose of doe power, as it were, to allow them to display their own heroics alongside their male co-stars.</p></blockquote><p>This is why we need our own institutions. This is why we need to keep every single SJW out. They destroy everything in the interests of convergence. That is their sole objective and their primary activity.</p><p>This is also why I will never sell the movie rights to my books. I won’t risk putting them in SJW hands. In time, we will build our own studios. Castalia is just the start.</p></div>",
  "content_text": "This sort of cultural and creative degradation is why I will never show even a modicum of mercy to SJWs. This is why there is no place for them in any civilized society. They are pure\nhraka\n. They are pollution. They infest every organization they are permitted to enter and\nthey infect everything they touch\n.\nIt was the film that traumatised a generation of children, with its much-loved rabbit characters slain on screen in graphic and memorable scenes. But the story of\nWatership Down\nis to be remade for a new era, as programme-makers promise to tone down its most brutal images.\nThe BBC has teamed up with Netflix for one of the most expensive mini-series ever made for the small screen, and the first animated four-part drama of its kind.The show’s executive producer told the Telegraph the 2017 version will not just tone down the levels of on-screen violence to make it more appropriate for children, but give a boost to its female characters.\nFemale rabbits including Clover, played by Gemma Arterton, Strawberry, played by Olivia Colman, and Hyzenthlay, played by Anne-Marie Duff, will get a dose of doe power, as it were, to allow them to display their own heroics alongside their male co-stars.\nThis is why we need our own institutions. This is why we need to keep every single SJW out. They destroy everything in the interests of convergence. That is their sole objective and their primary activity.\nThis is also why I will never sell the movie rights to my books. I won’t risk putting them in SJW hands. In time, we will build our own studios. Castalia is just the start.",
  "tags": [
    "movies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-29T07:41:00+00:00"
}