{
  "url": "https://voxday.net/2016/04/09/sjws-do-not-like-lig/",
  "scraped_at": "2025-12-17T17:53:06.398574",
  "title": "SJWs fear exposure",
  "date_display": "April 9, 2016",
  "date_iso": "2016-04-09T17:41:00+00:00",
  "date_from_url": "2016-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been interesting to see the reaction of SJWs on Twitter to <a href=\"http://sjwlist.com/\">The Complete List of SJW</a>. The mere announcement of its existence has both SJWs and moderates alarmed:</p><blockquote class=\"tr_bq\"><p> time cube denier @yung_kacho<br> oh vox. never stop being batshit insane</br></p><p>Ana @ #SweetsJam @SpaceDoctorPhD<br> Excuse me, why am I not on your blacklist? Can’t even bully people properly, what a mess.</br></p><p>/wooo/’sDolphZiggler @DZwooo<br> “Have you now, or ever been, a Social Justice Warrior?”</br></p><p>Mariconcito @armlessphelan<br> You’re an idiot. You don’t fight censorship and blacklists with censorship and blacklists.</br></p><p>Big Dog Barack @BarackSaysWooo<br> I HAVE IN MY HANDS A LIST OF 50 STATE REPRESENTATIVES WHO HAVE TIES TO THE SJW PARTY</br></p><p> /M/ischief Reborn @Mischief_Arises<br> Can you build a waiting list for the gas chamber and put yourself on it? Thanks</br></p><p>Anonymous Damn Crow @CrowReturns1<br> What is this? A list of people you plan to harass? Don’t even think about it.</br></p><p>Anonymous Damn Crow @CrowReturns1<br> Looks like a list of people targeted for harassment</br></p><p>Anonymous Damn Crow Retweeted Supreme Dark Lord<br> This is a list of people targeted for harassment. Really sucks. #Anonymous</br></p><p>deepseadiva @thedeepseadiva<br> LMAOO this is the funniest thing I’ve ever seen</br></p><p>Nightwing @Daltimus_Prime<br> HAHAHAHAHAHAHAHA HOLY SHIT. Whatever happened to “being the bigger person” and “not stooping to their level?”</br></p></blockquote><p>Notice the wide variety of conventional responses. We have the Lolipop response, the “I’m telling Dad” response, the “it’s not me, it’s you” response, the “aren’t you above this?” response, and the McCarthy response.</p><p>Translation: the idea that their actions will be tracked and they will be identified and potentially held responsible scares them.</p><p>This is why it is absolutely vital to be accurate and conservative in identifying SJWs. They are going to try to transform what is quite clearly a list of harassers into a false claim of being harassed. Don’t give them any ammo; only definite and self-defined SJWs who can be <i>confirmed </i>to have attempted to disemploy or no-platform people in defense of social justice ideals should be included. And take the time to provide the archived evidence of their SJW activity or self-designation. The stricter we are, the more effective the list will be over time.</p><p>As for the idea of not stooping to their level, I am the Supreme Dark Lord of the Evil Legion of Evil. We delve deeper than they even imagine.</p></div>",
  "content_text": "It’s been interesting to see the reaction of SJWs on Twitter to\nThe Complete List of SJW\n. The mere announcement of its existence has both SJWs and moderates alarmed:\ntime cube denier @yung_kacho\noh vox. never stop being batshit insane\nAna @ #SweetsJam @SpaceDoctorPhD\nExcuse me, why am I not on your blacklist? Can’t even bully people properly, what a mess.\n/wooo/’sDolphZiggler @DZwooo\n“Have you now, or ever been, a Social Justice Warrior?”\nMariconcito @armlessphelan\nYou’re an idiot. You don’t fight censorship and blacklists with censorship and blacklists.\nBig Dog Barack @BarackSaysWooo\nI HAVE IN MY HANDS A LIST OF 50 STATE REPRESENTATIVES WHO HAVE TIES TO THE SJW PARTY\n/M/ischief Reborn @Mischief_Arises\nCan you build a waiting list for the gas chamber and put yourself on it? Thanks\nAnonymous Damn Crow @CrowReturns1\nWhat is this? A list of people you plan to harass? Don’t even think about it.\nAnonymous Damn Crow @CrowReturns1\nLooks like a list of people targeted for harassment\nAnonymous Damn Crow Retweeted Supreme Dark Lord\nThis is a list of people targeted for harassment. Really sucks. #Anonymous\ndeepseadiva @thedeepseadiva\nLMAOO this is the funniest thing I’ve ever seen\nNightwing @Daltimus_Prime\nHAHAHAHAHAHAHAHA HOLY SHIT. Whatever happened to “being the bigger person” and “not stooping to their level?”\nNotice the wide variety of conventional responses. We have the Lolipop response, the “I’m telling Dad” response, the “it’s not me, it’s you” response, the “aren’t you above this?” response, and the McCarthy response.\nTranslation: the idea that their actions will be tracked and they will be identified and potentially held responsible scares them.\nThis is why it is absolutely vital to be accurate and conservative in identifying SJWs. They are going to try to transform what is quite clearly a list of harassers into a false claim of being harassed. Don’t give them any ammo; only definite and self-defined SJWs who can be\nconfirmed\nto have attempted to disemploy or no-platform people in defense of social justice ideals should be included. And take the time to provide the archived evidence of their SJW activity or self-designation. The stricter we are, the more effective the list will be over time.\nAs for the idea of not stooping to their level, I am the Supreme Dark Lord of the Evil Legion of Evil. We delve deeper than they even imagine.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-09T16:41:00+00:00"
}