{
  "url": "https://voxday.net/2016/04/03/sjws-retroconverging-games/",
  "scraped_at": "2025-12-17T17:52:19.122326",
  "title": "SJWs retroconverging games",
  "date_display": "April 3, 2016",
  "date_iso": "2016-04-03T10:32:00+00:00",
  "date_from_url": "2016-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I saw that the Enhanced Editions of Baldur’s Gate were on sale at Good Old Games and put them in my cart. However, in between that and clicking through to checkout, <a href=\"https://twitter.com/EscapeVelo/status/716350008237301760\">a tweet by Escape Velocity</a> drew my attention to this interview with a writer at Beamdog concerning the expansion they’d created in the process of enhancing the original games.</p><p>And by “enhancing” them, of course, <a href=\"http://kotaku.com/the-struggle-to-bring-back-baldur-s-gate-after-17-years-1768303595\">they mean “converging” them</a>:</p><blockquote class=\"tr_bq\"><p> “If there was something for the original <i>Baldur’s Gate</i> that<br> just doesn’t mesh for modern day gamers like the sexism, [we tried to<br> address that],” said writer Amber Scott. “In the original there’s a lot<br> of jokes at women’s expense. Or if not a lot, there’s a couple, like<br> Safana was just a sex object in BG 1, and Jaheira was the nagging wife<br> and that was played for comedy. We were able to say, ‘No, that’s not<br> really the kind of story we want to make.’ In <i>Siege of Dragonspear</i>, Safana gets her own little storyline, she got a way better personality upgrade. If people don’t like that, then too bad.”</br></br></br></br></br></br></p><p>“I got to write a little tender, romance-y side quest for Khalid and<br> Jaheira where you could learn a little bit about how their marriage<br> works and how they really feel about each other.”</br></br></p><p>There’s also four new companions, one of whom is gay, one of whom is bisexual.</p></blockquote><p>They loved the games so much they just needed to remake them in their own converged image. Consider <a href=\"http://8ch.net/v/src/1459637909298.webm\">this absurd example</a>.</p><p>We don’t like that. We won’t play it. Too bad.</p></div>",
  "content_text": "I saw that the Enhanced Editions of Baldur’s Gate were on sale at Good Old Games and put them in my cart. However, in between that and clicking through to checkout,\na tweet by Escape Velocity\ndrew my attention to this interview with a writer at Beamdog concerning the expansion they’d created in the process of enhancing the original games.\nAnd by “enhancing” them, of course,\nthey mean “converging” them\n:\n“If there was something for the original\nBaldur’s Gate\nthat\njust doesn’t mesh for modern day gamers like the sexism, [we tried to\naddress that],” said writer Amber Scott. “In the original there’s a lot\nof jokes at women’s expense. Or if not a lot, there’s a couple, like\nSafana was just a sex object in BG 1, and Jaheira was the nagging wife\nand that was played for comedy. We were able to say, ‘No, that’s not\nreally the kind of story we want to make.’ In\nSiege of Dragonspear\n, Safana gets her own little storyline, she got a way better personality upgrade. If people don’t like that, then too bad.”\n“I got to write a little tender, romance-y side quest for Khalid and\nJaheira where you could learn a little bit about how their marriage\nworks and how they really feel about each other.”\nThere’s also four new companions, one of whom is gay, one of whom is bisexual.\nThey loved the games so much they just needed to remake them in their own converged image. Consider\nthis absurd example\n.\nWe don’t like that. We won’t play it. Too bad.",
  "tags": [
    "games",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-03T09:32:00+00:00"
}