{
  "url": "https://voxday.net/2016/04/20/star-citizen-final-nai/",
  "scraped_at": "2025-12-17T17:54:28.516953",
  "title": "Star Citizen: the final nail",
  "date_display": "April 20, 2016",
  "date_iso": "2016-04-20T15:02:00+00:00",
  "date_from_url": "2016-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derek Smart explains why he believes Chris Roberts’s statement about a “minimum viable product” is <a href=\"http://www.dereksmart.org/forums/topic/star-citizen-extinction-level-event/#post-3131\">an extinction level event</a>:</p><blockquote class=\"tr_bq\"><p> <strong>WHY I BELIEVE THIS TO BE THE FINAL NAIL IN THE STAR CITIZEN COFFIN</strong>.</p><p>None<br> of the arguments people are making are relevant. And White Knights,<br> Shitizens, and Shillizens are doing what they always do: obfuscate,<br> attack, confuse, distort.</br></br></br></p><p>These are what’s relevant; all the points from my <a href=\"http://www.dereksmart.org/2016/04/star-citizen-the-ele/\" rel=\"nofollow noopener\" target=\"_blank\">latest blog</a>.</p><p>1)<br> The game he originally pitched simply cannot be built once he increased<br> the scope. Period. All the features already cut out, are evidence of<br> this.<br> 2) The CryEngine which he chose to build the game with, is<br> simply not capable of building it. And yes, even though they now have a<br> custom version of it, that’s more about re-inventing the wheel, than it<br> is about making sure the wheel is still round. The latter being the<br> basis of using a core engine from which a custom engine is derived.<br> 3) Following my first <a href=\"http://www.dereksmart.org/2015/07/interstellar-citizens/\" rel=\"nofollow noopener\" target=\"_blank\">July 2015 blog</a> in which I made the statements I said as:</br></br></br></br></br></br></br></br></br></p><blockquote><p> “<em>Without<br> disrespect to anyone, I’m just going to say it: it is my opinion that,<br> this game, as has been pitched, will never get made. Ever. There<br> isn’t a single publisher or developer on this planet who could build<br> this game as pitched, let alone for anything less than $150 million. The original vision which I backed in 2012? Yes, that was totally doable. This new vision? Not a chance.</br></br></br></br></em><br> <em>The technical scope of this game surpasses GTAV, not to mention the likes of Halo. Do you have any idea what those games cost to make and how long they took? Do<br> you know how many games which cost $50 million to make took almost five<br> years to release? And they were nowhere in scope as Star Citizen?</br></br></em>“</br></p></blockquote><p>He wrote <a href=\"https://robertsspaceindustries.com/comm-link/transmission/14839-Letter-From-The-Chairman\" rel=\"nofollow noopener\" target=\"_blank\">an entire missive</a> and said this:</p><blockquote><p> “<em>You<br> all know that already; you’ve lived that. You’ve seen Star Citizen<br> evolve and start to come together. You’ve watched our atoms form<br> molecules, our modules form a real, playable game (that you can boot up<br> and play today!). There are people out there who are going to tell you<br> that this is all a BAD THING. That it’s ‘feature creep’ and we should<br> make a smaller, less impressive game for the sake of having it out more<br> quickly or in order to meet artificial deadlines. Now I’ll answer those<br> claims in one word: Bullshit!</br></br></br></br></br></br></br></br></em><br> <em>Star Citizen matters<br> BECAUSE it is big, because it is a bold dream. It is something everyone<br> else is scared to try. You didn’t back Star Citizen because you want<br> what you’ve seen before. You’re here and reading this because we are<br> willing to go big, to do the things that terrify publishers. You’ve<br> trusted us with your money so we can build a game, not line our pockets.<br> And we sure as hell didn’t run this campaign so we could put that money<br> in the bank, guarantee ourselves a profit and turn out some flimsy<br> replica of a game I’ve made before. You went all in supporting us and<br> we’ve gone all in making the game. Is Star Citizen today a bigger goal<br> than I imagined in 2012? Absolutely. Is that a bad thing? Absolutely<br> not: it’s the whole damn point.</br></br></br></br></br></br></br></br></br></br></br></em>“</br></p></blockquote><p>As with all his<br> previous statements and promises, you can flush this one down the<br> toilet too. Chris evolved to be more of a salesman, than a game<br> developer/designer. And a patently dishonest one.<br> How coincidental is it that – again – shortly after my latest blog dropped, and which I said this:</br></br></br></br></p><blockquote><p> <em>“And<br> as I have stated before, Chris being a dreamer, I don’t believe that he<br> set out to scam gamers. However, the only right thing that he can do<br> now is to come clean, explain to the backers what he can and cannot do,<br> what went wrong and how, provide the financials to the backers who are<br> entitled to it, and stop taking money for a project he knows all too<br> well that he simply cannot deliver as originally promised.”</br></br></br></br></br></br></em></p></blockquote><p>He does this latest <a href=\"https://www.youtube.com/watch?v=vJoHlCc4Y7E\" rel=\"nofollow noopener\" target=\"_blank\">104TC</a> in which he reveals that the short-term goal is to deliver a MVP.</p><blockquote><p> “<em>So,<br> really what we’re doing with Star Citizen is we’re working on the game,<br> adding features for an incredibly ambitious design – I don’t think<br> there is any other game that is trying to do as much as we’re trying to<br> do.  So, degree of difficulty 11, not 10.  And, we’ll have what we<br> determine is a minimum viable product feature list for what you would<br> call Star Citizen the commercial release which is basically when you<br> say, “Okay, we’ve gotten to this point and we’ve still got plans to add a<br> lot more cool stuff and more content and more functionality and more<br> features…” – Which by the way includes some of the later stretch goals<br> we have because not all of that is going to be for ‘absolutely right<br> here’ on the commercial release.  But we’ll have something that we’ll<br> think, ‘Okay yeah, not everyone can play it but it doesn’t matter – you<br> can load it up, it plays really well, it’s really stable, there’s lots<br> of content, there’s lots of fun things to do, different professions,<br> lots of places to go, we’ve got a really good ecosystem.’  So, when we<br> get to that point that’s when we would say, “Now it’s not alpha, it’s<br/> not beta, it’s Star Citizen 1.0.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></em>”</p></blockquote></blockquote><p>We spent two hours discussing this at Brainstorm a few months ago, and considering the way in which Derek managed to impress even his most inveterate skeptics and haters with his expertise and technical observations during that session, I see absolutely no reason to doubt him now.</p></div>",
  "content_text": "Derek Smart explains why he believes Chris Roberts’s statement about a “minimum viable product” is\nan extinction level event\n:\nWHY I BELIEVE THIS TO BE THE FINAL NAIL IN THE STAR CITIZEN COFFIN\n.\nNone\nof the arguments people are making are relevant. And White Knights,\nShitizens, and Shillizens are doing what they always do: obfuscate,\nattack, confuse, distort.\nThese are what’s relevant; all the points from my\nlatest blog\n.\n1)\nThe game he originally pitched simply cannot be built once he increased\nthe scope. Period. All the features already cut out, are evidence of\nthis.\n2) The CryEngine which he chose to build the game with, is\nsimply not capable of building it. And yes, even though they now have a\ncustom version of it, that’s more about re-inventing the wheel, than it\nis about making sure the wheel is still round. The latter being the\nbasis of using a core engine from which a custom engine is derived.\n3) Following my first\nJuly 2015 blog\nin which I made the statements I said as:\n“\nWithout\ndisrespect to anyone, I’m just going to say it: it is my opinion that,\nthis game, as has been pitched, will never get made. Ever. There\nisn’t a single publisher or developer on this planet who could build\nthis game as pitched, let alone for anything less than $150 million. The original vision which I backed in 2012? Yes, that was totally doable. This new vision? Not a chance.\nThe technical scope of this game surpasses GTAV, not to mention the likes of Halo. Do you have any idea what those games cost to make and how long they took? Do\nyou know how many games which cost $50 million to make took almost five\nyears to release? And they were nowhere in scope as Star Citizen?\n“\nHe wrote\nan entire missive\nand said this:\n“\nYou\nall know that already; you’ve lived that. You’ve seen Star Citizen\nevolve and start to come together. You’ve watched our atoms form\nmolecules, our modules form a real, playable game (that you can boot up\nand play today!). There are people out there who are going to tell you\nthat this is all a BAD THING. That it’s ‘feature creep’ and we should\nmake a smaller, less impressive game for the sake of having it out more\nquickly or in order to meet artificial deadlines. Now I’ll answer those\nclaims in one word: Bullshit!\nStar Citizen matters\nBECAUSE it is big, because it is a bold dream. It is something everyone\nelse is scared to try. You didn’t back Star Citizen because you want\nwhat you’ve seen before. You’re here and reading this because we are\nwilling to go big, to do the things that terrify publishers. You’ve\ntrusted us with your money so we can build a game, not line our pockets.\nAnd we sure as hell didn’t run this campaign so we could put that money\nin the bank, guarantee ourselves a profit and turn out some flimsy\nreplica of a game I’ve made before. You went all in supporting us and\nwe’ve gone all in making the game. Is Star Citizen today a bigger goal\nthan I imagined in 2012? Absolutely. Is that a bad thing? Absolutely\nnot: it’s the whole damn point.\n“\nAs with all his\nprevious statements and promises, you can flush this one down the\ntoilet too. Chris evolved to be more of a salesman, than a game\ndeveloper/designer. And a patently dishonest one.\nHow coincidental is it that – again – shortly after my latest blog dropped, and which I said this:\n“And\nas I have stated before, Chris being a dreamer, I don’t believe that he\nset out to scam gamers. However, the only right thing that he can do\nnow is to come clean, explain to the backers what he can and cannot do,\nwhat went wrong and how, provide the financials to the backers who are\nentitled to it, and stop taking money for a project he knows all too\nwell that he simply cannot deliver as originally promised.”\nHe does this latest\n104TC\nin which he reveals that the short-term goal is to deliver a MVP.\n“\nSo,\nreally what we’re doing with Star Citizen is we’re working on the game,\nadding features for an incredibly ambitious design – I don’t think\nthere is any other game that is trying to do as much as we’re trying to\ndo.  So, degree of difficulty 11, not 10.  And, we’ll have what we\ndetermine is a minimum viable product feature list for what you would\ncall Star Citizen the commercial release which is basically when you\nsay, “Okay, we’ve gotten to this point and we’ve still got plans to add a\nlot more cool stuff and more content and more functionality and more\nfeatures…” – Which by the way includes some of the later stretch goals\nwe have because not all of that is going to be for ‘absolutely right\nhere’ on the commercial release.  But we’ll have something that we’ll\nthink, ‘Okay yeah, not everyone can play it but it doesn’t matter – you\ncan load it up, it plays really well, it’s really stable, there’s lots\nof content, there’s lots of fun things to do, different professions,\nlots of places to go, we’ve got a really good ecosystem.’  So, when we\nget to that point that’s when we would say, “Now it’s not alpha, it’s\nnot beta, it’s Star Citizen 1.0.\n”\nWe spent two hours discussing this at Brainstorm a few months ago, and considering the way in which Derek managed to impress even his most inveterate skeptics and haters with his expertise and technical observations during that session, I see absolutely no reason to doubt him now.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-20T14:02:00+00:00"
}