{
  "url": "https://voxday.net/2016/04/28/the-big-winners-were-rabid-puppies/",
  "scraped_at": "2025-12-17T17:55:38.693446",
  "title": "“The big winners were the Rabid Puppies”",
  "date_display": "April 28, 2016",
  "date_iso": "2016-04-28T05:00:00+00:00",
  "date_from_url": "2016-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always find it amusing how <a href=\"http://www.latimes.com/books/jacketcopy/la-et-jc-hugos-puppies-20160427-snap-htmlstory.html\">the media is always quick</a> to point out that NK Jemisin is black, but they never seem to mention the fact that I am an American Indian. Perhaps I need to publicly exhibit more scalps. They also never get around to mentioning why I was criticizing the ignorant, half-savage Jemisin, which is because she is a) a low-IQ cretin, b) a liar, and, c) had repeatedly attacked me sans provocation or even knowledge of who she was.</p><blockquote class=\"tr_bq\"><p> Rabid Puppies leader Vox Day, a self-described libertarian, has criticized best-selling science fiction writer N.K. Jemisin, who is black, as  an “ignorant half-savage,” writing, “Unlike the white males she excoriates, there is no evidence to be found anywhere on the planet that a society of NK Jemisins is capable of building an advanced civilization, or even successfully maintaining one without significant external support from those white males.”</p><p>George R.R. Martin has criticized both the puppies’ agenda and their aesthetic. “When the Hugo ballot came out last year, it was not just a right-wing ballot, it was a bad ballot,” he told the Guardian prior to Tuesday’s finalist announcement.</p><p>The Rabid Puppies, the more extreme of the two groups, this year created a slate of potential nominees that they urged Hugo voters to nominate. Out of 81 recommendations on that slate, 64 ended up shortlisted.</p><p>Day, who calls himself “Supreme Dark Lord, Evil Legion of Evil,” wasted no time in gloating. A news release sent by Day reads in part: “‘I’m not even remotely surprised to learn that the Rabid Puppies did so well,’ said Vox Day, as he mopped his brow with the flayed skin of an SJW after an arduous night of celebrating his fourth and fifth nominations.”</p></blockquote><p>That being said, full props to Mr. Schaub, who did his research, provided a grammatically correct quote about Jemisin instead of a cherry-picked sentence fragment, and actually quoted the Bloggerblaster.</p><p>He’s not on our side, obviously, and yet it’s a much better article than most. The only thing he really got wrong is the idea that I expected Chuck Tingle’s nomination to outrage my critics. I don’t give a quantum of a damn what my critics thought about it. Some things are worth doing simply because they are amusing.</p><p>I should also point out that I don’t call myself “Supreme Dark Lord”. That is merely how I am acknowledged by the Evil Legion of Evil, and, of course, the Vile Faceless Minions.</p><p>Meanwhile, George RR Martin completely fails to realize that he is already playing my game as he <a href=\"http://grrm.livejournal.com/483848.html83848.html\">contemplates the 2016 Hugo Awards</a>:</p><blockquote class=\"tr_bq\"><p> The big winners were the Rabid Puppies, whose choices completely<br> dominated the list.  The Rabids had nominees in every category, I<br> believe, and in a few categories they had <i><b>ALL</b></i> the<br> nominees…. The Rabids used a new tactic this year. They nominated<br> legitimate, quality works in addition to the dross. Works by writers<br> like Stephen King, Neil Gaiman, Neal Stephenson, Alastair Reynolds<br> (Reynolds went public well before the nominations asking NOT to be<br> slated, but they slated him anyway), Andy Weir, and several others. Some<br> of these writers are apolitical (like Weir), while others are known to<br> oppose everything that VD stands for (Gaiman, Stephenson, King). One has<br> to think they were deliberately targeted.</br></br></br></br></br></br></br></br></br></br></p><p>In some of<br> the online comments I’ve seen, these writers are being called “shields.”<br> I’ve even read some people calling for them to withdraw, simply because<br> they were on VD’s list.</br></br></br></p><p>Withdrawing is the LAST thing they should do.</p><p>I<br> urge them all to stand their ground. They wrote good books, stories,<br> graphic novels, they did NOT take part in any slate. In some cases they<br> were largely unaware of all this. In other cases they explicitly<br> denounced the slates ahead of time (Reynolds, again). Punishing them…<br> demanding they turn down this honor… simply because VD listed them is<br> insane.</br></br></br></br></br></br></p><p>Marko Kloos and Annie Bellet did the right<br> thing by withdrawing last year. Their was an ethical and courageous act;<br> I applauded them then and I applaud them now. But this is a different<br> year and a different situation. Given the well-known political views of<br> some of these writers, it seems plain to me that VD and the Rabids<br> picked them deliberately, in hopes they would withdraw, or would be<br> voted under No Award. They would probably have put Scalzi (VD’s best<br> bro) on the ballot too, but he outsmarted them and withdrew before they<br> could.</br></br></br></br></br></br></br></br></p><p>I am rather hoping that several of them win.<br> Based on quality alone, some deserve to. Sure, VD will claim that as a<br> victory, but as last year proves, he claims everything as a victory.<br> We’ll know the truth. The only real victory for him would be having any<br> of these fine writers pull out. Let’s not play his game.</br></br></br></br></p></blockquote><p>It’s<br> always amusing to see people like Rape Rape, who has no idea<br> whatsoever  about my motivations, my strategies, or my objectives,<br> trying to declare what my victory conditions are, and how it is impossible for me to reach them.</br></br></br></p><p>I desperately want to win Hugos. I don’t care about the Hugos. I want to destroy the Hugos. It pains me to have to point out that they obviously can’t all be correct.</p></div>",
  "content_text": "I always find it amusing how\nthe media is always quick\nto point out that NK Jemisin is black, but they never seem to mention the fact that I am an American Indian. Perhaps I need to publicly exhibit more scalps. They also never get around to mentioning why I was criticizing the ignorant, half-savage Jemisin, which is because she is a) a low-IQ cretin, b) a liar, and, c) had repeatedly attacked me sans provocation or even knowledge of who she was.\nRabid Puppies leader Vox Day, a self-described libertarian, has criticized best-selling science fiction writer N.K. Jemisin, who is black, as  an “ignorant half-savage,” writing, “Unlike the white males she excoriates, there is no evidence to be found anywhere on the planet that a society of NK Jemisins is capable of building an advanced civilization, or even successfully maintaining one without significant external support from those white males.”\nGeorge R.R. Martin has criticized both the puppies’ agenda and their aesthetic. “When the Hugo ballot came out last year, it was not just a right-wing ballot, it was a bad ballot,” he told the Guardian prior to Tuesday’s finalist announcement.\nThe Rabid Puppies, the more extreme of the two groups, this year created a slate of potential nominees that they urged Hugo voters to nominate. Out of 81 recommendations on that slate, 64 ended up shortlisted.\nDay, who calls himself “Supreme Dark Lord, Evil Legion of Evil,” wasted no time in gloating. A news release sent by Day reads in part: “‘I’m not even remotely surprised to learn that the Rabid Puppies did so well,’ said Vox Day, as he mopped his brow with the flayed skin of an SJW after an arduous night of celebrating his fourth and fifth nominations.”\nThat being said, full props to Mr. Schaub, who did his research, provided a grammatically correct quote about Jemisin instead of a cherry-picked sentence fragment, and actually quoted the Bloggerblaster.\nHe’s not on our side, obviously, and yet it’s a much better article than most. The only thing he really got wrong is the idea that I expected Chuck Tingle’s nomination to outrage my critics. I don’t give a quantum of a damn what my critics thought about it. Some things are worth doing simply because they are amusing.\nI should also point out that I don’t call myself “Supreme Dark Lord”. That is merely how I am acknowledged by the Evil Legion of Evil, and, of course, the Vile Faceless Minions.\nMeanwhile, George RR Martin completely fails to realize that he is already playing my game as he\ncontemplates the 2016 Hugo Awards\n:\nThe big winners were the Rabid Puppies, whose choices completely\ndominated the list.  The Rabids had nominees in every category, I\nbelieve, and in a few categories they had\nALL\nthe\nnominees…. The Rabids used a new tactic this year. They nominated\nlegitimate, quality works in addition to the dross. Works by writers\nlike Stephen King, Neil Gaiman, Neal Stephenson, Alastair Reynolds\n(Reynolds went public well before the nominations asking NOT to be\nslated, but they slated him anyway), Andy Weir, and several others. Some\nof these writers are apolitical (like Weir), while others are known to\noppose everything that VD stands for (Gaiman, Stephenson, King). One has\nto think they were deliberately targeted.\nIn some of\nthe online comments I’ve seen, these writers are being called “shields.”\nI’ve even read some people calling for them to withdraw, simply because\nthey were on VD’s list.\nWithdrawing is the LAST thing they should do.\nI\nurge them all to stand their ground. They wrote good books, stories,\ngraphic novels, they did NOT take part in any slate. In some cases they\nwere largely unaware of all this. In other cases they explicitly\ndenounced the slates ahead of time (Reynolds, again). Punishing them…\ndemanding they turn down this honor… simply because VD listed them is\ninsane.\nMarko Kloos and Annie Bellet did the right\nthing by withdrawing last year. Their was an ethical and courageous act;\nI applauded them then and I applaud them now. But this is a different\nyear and a different situation. Given the well-known political views of\nsome of these writers, it seems plain to me that VD and the Rabids\npicked them deliberately, in hopes they would withdraw, or would be\nvoted under No Award. They would probably have put Scalzi (VD’s best\nbro) on the ballot too, but he outsmarted them and withdrew before they\ncould.\nI am rather hoping that several of them win.\nBased on quality alone, some deserve to. Sure, VD will claim that as a\nvictory, but as last year proves, he claims everything as a victory.\nWe’ll know the truth. The only real victory for him would be having any\nof these fine writers pull out. Let’s not play his game.\nIt’s\nalways amusing to see people like Rape Rape, who has no idea\nwhatsoever  about my motivations, my strategies, or my objectives,\ntrying to declare what my victory conditions are, and how it is impossible for me to reach them.\nI desperately want to win Hugos. I don’t care about the Hugos. I want to destroy the Hugos. It pains me to have to point out that they obviously can’t all be correct.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-28T04:00:00+00:00"
}