{
  "url": "https://voxday.net/2016/04/26/they-cant-say-we-didnt-warn-the/",
  "scraped_at": "2025-12-17T17:55:25.004462",
  "title": "They can’t say we didn’t warn them",
  "date_display": "April 26, 2016",
  "date_iso": "2016-04-26T23:06:00+00:00",
  "date_from_url": "2016-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CCM2H3uWgAMyLXj.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/CCM2H3uWgAMyLXj.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CCM2H3uWgAMyLXj.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> Some of you may recall this back on <a href=\"http://www.milobookclub.com/2015/08/23/hugo-2015-results/\">August 23, 2015</a>:<br> <i><br/></i><br> <i>No doubt George Martin, John Scalzi, David Gerrold, The Guardian, and<br> the rest of the SJWs will try to portray this as a resounding defeat for<br> us, but keep this in mind: the side that resorts to a scorched earth<br> strategy is the one that is losing and in retreat. All they have<br> accomplished is to convert many Sad Puppies into Rabid Puppies.</br></br></br></br></i><br> <i><br> </br></i><br> <i>They have talked about sending us a message, and we have heard it. I<br> don’t know about you, but the message I heard was “bring more Puppies.”</br></i></br></br></br></br></p><p>Give them credit where it is due. They made a serious effort, leading to 4,032 nominating ballots this year, nearly twice as many as last year’s record total.<i> </i>It didn’t matter. We heard the message. We brought more Puppies.<i></i></p><p>Well done, all of you Rabids. Very well done. According to Mike Glyer, the Rabid Puppies placed 64 of its 81 recommendations on the final ballot. I understand we actually would have done a little better than that were it not for the odd withdrawal or disqualification. (I’ll do my own count tomorrow; David Barnett had it at 62 of 80 in the <i>Guardian</i>.) You understand, as the other side does not, that there is no end to cultural war. They still think we can be intimidated, or shamed, or guilted somehow, because those are the tactics that have worked for their kind for decades, if not generations.<br> <i><br/></i><br> But we are immune to such things. Let them scoff, let them minimize, let them posture, let them cry, it makes absolutely no difference what they do or what they say. There is nothing that they can do except vote No Award and change the rules<i>. </i><br> <i><br/></i><br> We have succeeded in breaking the Tor cabal’s deleterious death grip on science fiction. Next year, the next phase will begin. And we will be ready for it.</br></br></br></br></p><p>Are you not entertained? And more importantly, <i>are you in?</i></p></div>",
  "content_text": "Some of you may recall this back on\nAugust 23, 2015\n:\nNo doubt George Martin, John Scalzi, David Gerrold, The Guardian, and\nthe rest of the SJWs will try to portray this as a resounding defeat for\nus, but keep this in mind: the side that resorts to a scorched earth\nstrategy is the one that is losing and in retreat. All they have\naccomplished is to convert many Sad Puppies into Rabid Puppies.\nThey have talked about sending us a message, and we have heard it. I\ndon’t know about you, but the message I heard was “bring more Puppies.”\nGive them credit where it is due. They made a serious effort, leading to 4,032 nominating ballots this year, nearly twice as many as last year’s record total.\nIt didn’t matter. We heard the message. We brought more Puppies.\nWell done, all of you Rabids. Very well done. According to Mike Glyer, the Rabid Puppies placed 64 of its 81 recommendations on the final ballot. I understand we actually would have done a little better than that were it not for the odd withdrawal or disqualification. (I’ll do my own count tomorrow; David Barnett had it at 62 of 80 in the\nGuardian\n.) You understand, as the other side does not, that there is no end to cultural war. They still think we can be intimidated, or shamed, or guilted somehow, because those are the tactics that have worked for their kind for decades, if not generations.\nBut we are immune to such things. Let them scoff, let them minimize, let them posture, let them cry, it makes absolutely no difference what they do or what they say. There is nothing that they can do except vote No Award and change the rules\n.\nWe have succeeded in breaking the Tor cabal’s deleterious death grip on science fiction. Next year, the next phase will begin. And we will be ready for it.\nAre you not entertained? And more importantly,\nare you in?",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-26T22:06:00+00:00"
}