{
  "url": "https://voxday.net/2016/04/27/why-theyre-terrified/",
  "scraped_at": "2025-12-17T17:55:33.832644",
  "title": "Why they’re terrified",
  "date_display": "April 27, 2016",
  "date_iso": "2016-04-27T17:43:00+00:00",
  "date_from_url": "2016-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard for those outside the science fiction publishing world to understand why so many of the people inside it are a such a collection of mentally unstable freakshows. Part of it is the genre; many of these people are simply not fit to function in the real world. You have only to look at a picture from any science fiction convention to understand this; you will not see a group of more heavily medicated people outside of a hospital or a hard-core rave.</p><p>But part of it is the human reaction to stress. And the publishing world has become increasingly stressful over the last 20 years, because it is in pretty severe contraction. The dumbing down of the West thanks to the diversity they love so much combined with the growth of video games and other visual entertainment options means there are fewer readers than before. The decline of the midlist, the advent of Amazon, and the explosion of independent publishing means that far fewer people can make a living in the traditional publishing market.</p><p>Hugh Howey and Author Earnings have been doing a great job tracking the decline of traditional publishing. And <a href=\"http://authorearnings.com/report/february-2016-author-earnings-report/\">in their most recent report</a>, they show that the Big Five are rapidly approaching one-half the size of the independent publishing market.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://authorearnings.com/wp-content/uploads/2016/01/author-earnings-trend-20160110.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"375\" src=\"http://authorearnings.com/wp-content/uploads/2016/01/author-earnings-trend-20160110.png\" width=\"400\"/></a></div><p> <i>The most important graph for authors shows the rapidly diverging rate of<br> ebook author income by publishing path. The Big 5 publishers are now<br> providing less than a quarter of the dollars earned by creatives for<br> their ebook sales. Indies are taking close to half. As detailed in<br> previous reports, higher prices and other missteps are a likely<br> contributor to this accelerating trend, but the reality may be that<br> major publishers simply are finding it difficult to compete with indie<br> authors on diversity, price, quality, and frequency of publication, as<br> this divergence has been increasing for the last two years — well before<br> the Big Five’s return to no-discount agency pricing. But as we can see,<br> the transfer of market share in author earnings from Big Five to indies<br> did steepen significantly after the Big Five’s 2015 reinstatement of<br> agency ebook pricing.</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>That chart is spectacular. That purple line marks a <i>cataclysmic</i> decline. At this rate, traditionally published authors would realize ZERO income from ebooks by January 2019. Now, that’s not going to happen, I don’t think, unless traditional publishers either a) all go out of business, b) stop selling ebooks, or c) give all their ebooks away for free.</p><p>This is exactly what I was talking about when I said that Kindle Unlimited is going to kill the mainstream publishers. They can’t compete with it, and since there is a finite and shrinking supply of readers, every Kindle Unlimited sale is a strike against them.</p><p>But it’s worse than that. I just got a royalty statement from one of my traditional publishers. Not only is it a very good reminder of why working with Castalia House is a MUCH better deal than working with a traditional publishing house – I’d have made nearly 3X more on a Castalia deal than I did on this one – but it demonstrates that their business model simply cannot compete with ours.</p><p>Here is the simple fact. In <i>eight years</i>, the non-fiction book I published with them, has sold exactly <i>two-thirds</i> as many copies as SJWAL has sold in <i>eight months</i>. And ironically, the older book, which has sold thousands fewer copies, is the one that anyone would have expected to sell more. So, even though it’s not precisely apples-to-apples, the point is that an ebook-focused micropublisher can already provably sell as many books as a traditional independent publisher.</p><p>In other words, they are bringing literally nothing to the table for me any longer. The Big Five theoretically still have advantages, but what is the use of having a formidable retail distribution infrastructure when there are no bookstores to carry your product? What is the use of being able to sell into Barnes &amp; Noble when the retailer has cut down the size of the genre section to one-tenth of what it used to be?</p><p>Sure, there will be a few blockbusters, but for literally everyone else, the traditional model offers them nothing. That is why the traditional publishers, and the traditionally published, are panicking. That’s why they are scratching and clawing for every award and every distinction that might help keep their heads above water.</p><p>That is why they are drowning. They call us a “tiny” publishing house, and in infrastructure and overhead terms, they are absolutely right. But we are growing nearly 100 percent year-on-year, we are growing at their expense.</p><p>And more importantly, we know that’s not because of us, that’s because of you. We understand, as they do not, that we can’t force anything on you. We can’t, and won’t, try to tell you that space romance is science fiction, that left-wing diversity lectures are entertaining, and we don’t believe you owe us anything.</p><p>For the first time in decades, they are being forced to compete for their readers with genuinely different competitors, and it should come as small surprise that they neither enjoy the experience nor are they any good at it.</p></div>",
  "content_text": "It’s hard for those outside the science fiction publishing world to understand why so many of the people inside it are a such a collection of mentally unstable freakshows. Part of it is the genre; many of these people are simply not fit to function in the real world. You have only to look at a picture from any science fiction convention to understand this; you will not see a group of more heavily medicated people outside of a hospital or a hard-core rave.\nBut part of it is the human reaction to stress. And the publishing world has become increasingly stressful over the last 20 years, because it is in pretty severe contraction. The dumbing down of the West thanks to the diversity they love so much combined with the growth of video games and other visual entertainment options means there are fewer readers than before. The decline of the midlist, the advent of Amazon, and the explosion of independent publishing means that far fewer people can make a living in the traditional publishing market.\nHugh Howey and Author Earnings have been doing a great job tracking the decline of traditional publishing. And\nin their most recent report\n, they show that the Big Five are rapidly approaching one-half the size of the independent publishing market.\nThe most important graph for authors shows the rapidly diverging rate of\nebook author income by publishing path. The Big 5 publishers are now\nproviding less than a quarter of the dollars earned by creatives for\ntheir ebook sales. Indies are taking close to half. As detailed in\nprevious reports, higher prices and other missteps are a likely\ncontributor to this accelerating trend, but the reality may be that\nmajor publishers simply are finding it difficult to compete with indie\nauthors on diversity, price, quality, and frequency of publication, as\nthis divergence has been increasing for the last two years — well before\nthe Big Five’s return to no-discount agency pricing. But as we can see,\nthe transfer of market share in author earnings from Big Five to indies\ndid steepen significantly after the Big Five’s 2015 reinstatement of\nagency ebook pricing.\nThat chart is spectacular. That purple line marks a\ncataclysmic\ndecline. At this rate, traditionally published authors would realize ZERO income from ebooks by January 2019. Now, that’s not going to happen, I don’t think, unless traditional publishers either a) all go out of business, b) stop selling ebooks, or c) give all their ebooks away for free.\nThis is exactly what I was talking about when I said that Kindle Unlimited is going to kill the mainstream publishers. They can’t compete with it, and since there is a finite and shrinking supply of readers, every Kindle Unlimited sale is a strike against them.\nBut it’s worse than that. I just got a royalty statement from one of my traditional publishers. Not only is it a very good reminder of why working with Castalia House is a MUCH better deal than working with a traditional publishing house – I’d have made nearly 3X more on a Castalia deal than I did on this one – but it demonstrates that their business model simply cannot compete with ours.\nHere is the simple fact. In\neight years\n, the non-fiction book I published with them, has sold exactly\ntwo-thirds\nas many copies as SJWAL has sold in\neight months\n. And ironically, the older book, which has sold thousands fewer copies, is the one that anyone would have expected to sell more. So, even though it’s not precisely apples-to-apples, the point is that an ebook-focused micropublisher can already provably sell as many books as a traditional independent publisher.\nIn other words, they are bringing literally nothing to the table for me any longer. The Big Five theoretically still have advantages, but what is the use of having a formidable retail distribution infrastructure when there are no bookstores to carry your product? What is the use of being able to sell into Barnes & Noble when the retailer has cut down the size of the genre section to one-tenth of what it used to be?\nSure, there will be a few blockbusters, but for literally everyone else, the traditional model offers them nothing. That is why the traditional publishers, and the traditionally published, are panicking. That’s why they are scratching and clawing for every award and every distinction that might help keep their heads above water.\nThat is why they are drowning. They call us a “tiny” publishing house, and in infrastructure and overhead terms, they are absolutely right. But we are growing nearly 100 percent year-on-year, we are growing at their expense.\nAnd more importantly, we know that’s not because of us, that’s because of you. We understand, as they do not, that we can’t force anything on you. We can’t, and won’t, try to tell you that space romance is science fiction, that left-wing diversity lectures are entertaining, and we don’t believe you owe us anything.\nFor the first time in decades, they are being forced to compete for their readers with genuinely different competitors, and it should come as small surprise that they neither enjoy the experience nor are they any good at it.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-04-27T16:43:00+00:00"
}