{
  "url": "https://voxday.net/2024/09/26/a-futile-warning/",
  "scraped_at": "2026-01-08T19:24:18.956501",
  "title": "A Futile Warning",
  "date_display": "September 26, 2024",
  "date_iso": "2024-09-26T12:21:18+00:00",
  "date_from_url": "2024-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As this lengthy article in <em>Foreign Affairs</em> suggests, some of the smarter clowns realize that <a href=\"https://www.foreignaffairs.com/russia/battle-brics\">BRICS isn’t going away</a>, and that as long as Clown World continues to rule in such a shamelessly hypocritical and unbalanced manner, most of the unaligned nations of the global East and South will choose BRICS over subjugation to Clown World.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The technology competition between China and the United States may lead to the erection of a digital iron curtain and the emergence of two separate and incompatible technological spheres, which would make fence-sitting more challenging. Finding a common denominator in the grouping will become more difficult, particularly on sensitive geopolitical issues such as the war in Ukraine. Those differences might make the bloc less influential on the international stage, even as its efforts to advance alternative currencies to the U.S. dollar gather strength.</p><p>For the United States and other Western powers, the dynamics inside BRICS underline the necessity of taking the grouping—and the underlying dissatisfaction with the current order—seriously. It is entirely reasonable for rising powers such as Brazil to search for hedging options and to feel dissatisfied with how the United States has steered the existing system. Western powers should focus on not making things worse by, for example, trying to scare middle powers away from joining BRICS, which smacks of paternalism and quasi-colonial interference. In the same way, Western attempts to warn middle powers in the global South about being too dependent on China have proved ineffective.</p><p>Western countries can do more to not alienate those middle powers seeking greater space for maneuver and to ensure that BRICS does not become an anti-Western bloc. They should spell out more clearly how certain sanctions relate to violations of international law, and try to be consistent in applying those sanctions against all violators—not just against geopolitical adversaries. Countries in the global South want to escape the hegemony of the dollar when they see Western countries, for instance, freezing Russian central bank reserves in 2022 as a response to the invasion of Ukraine but receiving no punishment for similarly unlawful military interventions in the Middle East and Africa. Wealthy countries can also be better problem solvers for poorer countries, including by sharing technology and assisting with the green transition. And the West should make more genuine efforts to democratize the global order, such as by doing away with the anachronistic tradition that only Europeans head the IMF and only U.S. citizens lead the World Bank.</p><p>Such actions would build trust and undermine Chinese and Russian attempts to enlist the global South to an anti-Western cause. Rather than bemoaning the emergence of the BRICS, the West should court those member states that have a stake in making sure that the grouping does not become an overtly anti-Western outfit intent on undermining the global order.</p></blockquote><p>It’s somewhat amusing that after admitting how all of the previous predictions of the inevitable failure of BRICS for the last 18 years have been wrong, the <em>Foreign Affairs</em> analysts point to the material signs of its success – more than 40 countries asking for permission to join BRICS – as evidence the expansion of the group’s membership and influence will somehow damage the international bloc by reducing the cohesiveness between the neutral faction (Brazil and India) and the anti-Clown faction (China, Iran, and Russia). This, of course, completely misses the point, which is that neither faction has any intention of submitting to, or obeying, the hypocritical and self-serving dictates of the so-called “neoliberal rules-based global order” that we call Clown World.</p><p>And the solution recommended is impossible at the present. By any and every standard of so-called “international law”, Israel should be as heavily sanctioned by the “rules-based world order” as Russia is. Israel is observably bombing civilians in Lebanon and engaging in ethnic cleansing in Palestine, while Russia is fighting a war to defend Russians living in historically Russian territory who were under attack for more than a decade by the foreign, Clown World-installed, Kiev regime. Every sanction that has been applied to Russia should, under any sane, rational, or fair standard, have also been applied to Israel. Even more egregiously, many of those anti-Russian sanctions have also been applied to Belarus, which hasn’t done anything at all to any of its neighbors.</p><p><a href=\"https://simplicius76.substack.com/p/sitrep-92424-pr-tour-sours-as-ukraines\">Simplicius notes</a>: <em>Israel continues to pummel Lebanon, proving itself to be the only country in the world that can literally bomb and invade all of its neighbors at will without serious international consequences. Note I said consequences, not ‘condemnation’. There’s plenty of the latter to go around, but it doesn’t lead to anything tangible because all global institutions are co-opted, captured, and compromised by the Hydra, and as such only pay lip service to tragedies perpetrated by their clients and masters alike. Isn’t it interesting how—just to take one small example of many—the Chess world’s FIDE organization has banned not only Russia but even Belarus merely as offhand accomplice, yet Israel, for an actual holocaust it’s committing on its neighbors, has not been banned. The same goes for the Olympics, EuroVision, and other contests; it’s quite incredible when you think about it.</em></p><p>It’s not as if anyone doesn’t notice this. Regardless of how far you think Israel’s right to defend itself should extend, everyone around the world has seen that the rules of the “rules-based world order” are unjust and are applied unevenly, which is why they quite naturally no longer want any part of it. Because, obviously, if major powers like China and Russia can be sanctioned, how much more easily can smaller nations be subjected to the same treatment if they don’t submit slavishly to Clown World’s unending demands?</p><p>The rulers of Clown World have simply never understood that the king is not above the law, he is more strictly bound by the law than any of his subjects. And when he refuses to be bound by the law, he ceases to be legitimate and thereby loses the Mandate of Heaven.</p><p>Unless Clown World ceases to be what it is, the rest of the world will prefer the alternative, any alternative, that promises not to punish them for doing no more than pursuing their reasonable national interests. Which is why, I suspect, more than a few nations that are presently under the domination of Clown World will seek to free themselves from it, beginning with Turkiye, and followed soon after, one would expect, by Hungary and Switzerland.</p><p><em><a href=\"https://socialgalactic.com/micropost/e9d031cf-bf89-43e6-80bf-8fcdfcb2ec46\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As this lengthy article in\nForeign Affairs\nsuggests, some of the smarter clowns realize that\nBRICS isn’t going away\n, and that as long as Clown World continues to rule in such a shamelessly hypocritical and unbalanced manner, most of the unaligned nations of the global East and South will choose BRICS over subjugation to Clown World.\nThe technology competition between China and the United States may lead to the erection of a digital iron curtain and the emergence of two separate and incompatible technological spheres, which would make fence-sitting more challenging. Finding a common denominator in the grouping will become more difficult, particularly on sensitive geopolitical issues such as the war in Ukraine. Those differences might make the bloc less influential on the international stage, even as its efforts to advance alternative currencies to the U.S. dollar gather strength.\nFor the United States and other Western powers, the dynamics inside BRICS underline the necessity of taking the grouping—and the underlying dissatisfaction with the current order—seriously. It is entirely reasonable for rising powers such as Brazil to search for hedging options and to feel dissatisfied with how the United States has steered the existing system. Western powers should focus on not making things worse by, for example, trying to scare middle powers away from joining BRICS, which smacks of paternalism and quasi-colonial interference. In the same way, Western attempts to warn middle powers in the global South about being too dependent on China have proved ineffective.\nWestern countries can do more to not alienate those middle powers seeking greater space for maneuver and to ensure that BRICS does not become an anti-Western bloc. They should spell out more clearly how certain sanctions relate to violations of international law, and try to be consistent in applying those sanctions against all violators—not just against geopolitical adversaries. Countries in the global South want to escape the hegemony of the dollar when they see Western countries, for instance, freezing Russian central bank reserves in 2022 as a response to the invasion of Ukraine but receiving no punishment for similarly unlawful military interventions in the Middle East and Africa. Wealthy countries can also be better problem solvers for poorer countries, including by sharing technology and assisting with the green transition. And the West should make more genuine efforts to democratize the global order, such as by doing away with the anachronistic tradition that only Europeans head the IMF and only U.S. citizens lead the World Bank.\nSuch actions would build trust and undermine Chinese and Russian attempts to enlist the global South to an anti-Western cause. Rather than bemoaning the emergence of the BRICS, the West should court those member states that have a stake in making sure that the grouping does not become an overtly anti-Western outfit intent on undermining the global order.\nIt’s somewhat amusing that after admitting how all of the previous predictions of the inevitable failure of BRICS for the last 18 years have been wrong, the\nForeign Affairs\nanalysts point to the material signs of its success – more than 40 countries asking for permission to join BRICS – as evidence the expansion of the group’s membership and influence will somehow damage the international bloc by reducing the cohesiveness between the neutral faction (Brazil and India) and the anti-Clown faction (China, Iran, and Russia). This, of course, completely misses the point, which is that neither faction has any intention of submitting to, or obeying, the hypocritical and self-serving dictates of the so-called “neoliberal rules-based global order” that we call Clown World.\nAnd the solution recommended is impossible at the present. By any and every standard of so-called “international law”, Israel should be as heavily sanctioned by the “rules-based world order” as Russia is. Israel is observably bombing civilians in Lebanon and engaging in ethnic cleansing in Palestine, while Russia is fighting a war to defend Russians living in historically Russian territory who were under attack for more than a decade by the foreign, Clown World-installed, Kiev regime. Every sanction that has been applied to Russia should, under any sane, rational, or fair standard, have also been applied to Israel. Even more egregiously, many of those anti-Russian sanctions have also been applied to Belarus, which hasn’t done anything at all to any of its neighbors.\nSimplicius notes\n:\nIsrael continues to pummel Lebanon, proving itself to be the only country in the world that can literally bomb and invade all of its neighbors at will without serious international consequences. Note I said consequences, not ‘condemnation’. There’s plenty of the latter to go around, but it doesn’t lead to anything tangible because all global institutions are co-opted, captured, and compromised by the Hydra, and as such only pay lip service to tragedies perpetrated by their clients and masters alike. Isn’t it interesting how—just to take one small example of many—the Chess world’s FIDE organization has banned not only Russia but even Belarus merely as offhand accomplice, yet Israel, for an actual holocaust it’s committing on its neighbors, has not been banned. The same goes for the Olympics, EuroVision, and other contests; it’s quite incredible when you think about it.\nIt’s not as if anyone doesn’t notice this. Regardless of how far you think Israel’s right to defend itself should extend, everyone around the world has seen that the rules of the “rules-based world order” are unjust and are applied unevenly, which is why they quite naturally no longer want any part of it. Because, obviously, if major powers like China and Russia can be sanctioned, how much more easily can smaller nations be subjected to the same treatment if they don’t submit slavishly to Clown World’s unending demands?\nThe rulers of Clown World have simply never understood that the king is not above the law, he is more strictly bound by the law than any of his subjects. And when he refuses to be bound by the law, he ceases to be legitimate and thereby loses the Mandate of Heaven.\nUnless Clown World ceases to be what it is, the rest of the world will prefer the alternative, any alternative, that promises not to punish them for doing no more than pursuing their reasonable national interests. Which is why, I suspect, more than a few nations that are presently under the domination of Clown World will seek to free themselves from it, beginning with Turkiye, and followed soon after, one would expect, by Hungary and Switzerland.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "economics",
    "globalism",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-26T12:26:29+00:00"
}