{
  "url": "https://voxday.net/2024/09/06/an-incorrect-theory/",
  "scraped_at": "2026-01-08T19:21:54.452750",
  "title": "An Incorrect Theory",
  "date_display": "September 6, 2024",
  "date_iso": "2024-09-06T14:10:26+00:00",
  "date_from_url": "2024-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Author Devon Eriksen expounds his theory of <a href=\"https://x.com/Devon_Eriksen_/status/1831714435549057245\">why George R. R. Martin can’t finish</a> <em>A Song of Ice and Fire</em>. While he’s correct that Martin cannot, and almost certainly will not, finish it by himself before he dies, he’s totally and utterly incorrect as to the reason. He’s also wrong about what the saga “actually wants to be”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Here’s what Song of Ice and Fire actually wants to be, and why George can’t finish it. The Song of Ice and Fire isn’t actually supposed to be dark, Machiavellian, hopeless, or a subversion of Tolkien at all. It’s just supposed to <em>start </em>that way. The details may be complex, but the formula is simple. Low-fantasy version of the British Isles, torn apart by multi-sided Machiavellian power struggle, loosely based on the War of the Roses. Things are bad because of Machiavellian power struggle. In the background, subtle hints of external, magical, otherworldly threat. Warring factions scoff and ignore it as first.</p><p>Enter the high-fantasy tropes; prophesied hero emerges to unite the morally-grey factions into an unambiguously-good pro-civilization force to confront and defeat the unambiguously-evil threat to all life. Full transition, in the end, to epic Tolkienesque high fantasy, played straight rather than subverted. Heroism triumphant, humanity triumphant, realm unified in peace and prosperity. Roll credits.</p><p>Were the story to be completed thus, completed as it wants to be completed, as it yearns to be completed, every dark, gritty, Machiavellian moment would be fully justified. Every chapter and scene filled with thugs and villains and no heroes at all would be fully justified. Because they would merely serve to emphasize the rarity of heroes, and the need for them. Because they would make the arrival of a true hero that much more satisfying when, late but not too late, he arrived. ASOIAF doesn’t really want to be a subversion of Tolkien at all. It wants to be a path out of darkness and into light. It wants to be a study in how Tolkien is deeply relevant, even to a gritty, morally grey world.</p><p>This is what George knows it needs to be. But George cannot write it. Why? Because he’s a socialist. And a boomer. Socialism’s motivational core is envy, and its one underlying rule is “thou shalt not be better than me”. The boomer’s single guiding principle is “whatever makes me feel pleasure right now is good, and whatever makes me feel bad right now is evil”. Take these together, and you get someone who has a real problem with heroes. Heroes are, by definition, the best of us, at least on some dimension, and if your underlying motivation is envy, standing next to one is gonna make you feel bad. This means that socialists, boomers, and socialist boomers tend not to want to believe in heroes and heroism. They want to convince themselves that anything which appears good is secretly evil, actually, and that anyone who makes them feel or look bad is obviously evil because reasons. So when they see a hero, they tend to call him a fascist. (Of course, when they see a fascist, they also call him a fascist, but that’s just coincidence, because they’ll call anything fascist… random passers-by, buildings, rocks, trees, squirrels, anything.) Because they want to feel morally superior to him. The only way they can admit that someone has a moral compass at all is if they can feel superior to him in some other way, usually by portraying them as naive, and hence doomed to failure because he is not empowered by cynicism and selfishness, to pursue the most efficient path to… whatever.</p><p>So if ol’ George thinks that everyone who appears good is either secretly evil, or openly stupid, then writing a character with heroic impulses is gonna be tough, and writing about how they succeed… impossible. This is why George can write characters with noble motives (Jon Snow, Eddard Stark, etc), but he keeps making them fail. You see, in George’s world, heroism must be a sham or a weakness, because then George’s own bad character is <em>wisdom and enlightenment</em>, instead of just <em>lack of moral virtue</em>. If heroes are all frauds or suckers, then George is being smart, because he has seen through the whole heroism thing. If heroes are real, and they do sometimes succeed, and they do make the world better for everyone, then George is just a fat, lazy, cynical old man who doesn’t wanna finish his art for the sake of art or integrity, because he only ever wanted money, and now he has more than he knows what to do with.</p><p>In order to finish the story, George would need to have an awakening of virtue. He would first have to develop a sense of integrity — a desire to fulfill his promises, even when no one can or will punish him for not doing so. He would then have to develop a sense of humility — because to write a better person than he is, he would have to admit to himself that there is such a thing, that people can be better, and that trying to be better is an actual worthy goal, not just the act of falling for a con game run to control you. The longer someone goes without admitting to their faults, the harder those faults are to admit to, because they have been more deeply invested in. And this means he would also have to develop the courage to admit to himself that he is, in fact, a fat lazy cynical old coward, and that Tolkien, whom he envies and despises, was the far better man all along.</p></blockquote><p>This sort of thinking appeals to many fans of Tolkien who rightly consider Martin to be a lesser author, and correctly deem ASOIAF to be a lesser work, despite its much greater length, than LOTR. But it is incorrect, and not only is it incorrect, but it is irrelevant.</p><p>Eriksen is describing a work that he would write, if he was able to write an epic fantasy saga, which he is unlikely to be able to do. As Haruki Murakami observes, the longer the work, the deeper into oneself one has to delve, and the more laborious the effort required. As one of the very few who has written short stories, novels, and an epic fantasy saga, I can testify that it is as difficult to go from writing novels to epics as it is to go from writing short stories to novels.</p><p>Nihilism is not the problem. Envy of Tolkien is not the problem. Lack of virtue is not the problem. Morality, cowardice, and a refusal to admit to his own faults are not the problem.</p><p>To the contrary, Martin’s dilemma is chiefly a technical one related to the structure of the books that has been obvious since the release of the fourth book in the series. Consider the POV breakdown of <em>A Game of Thrones</em>, the first book of ASOIAF.</p><ol class=\"wp-block-list\"><li>15 Ned 53,920 18.3% 3,595</li><li>11 Catelyn 44,522 15.1% 4,047</li><li>10 Daenerys 38,142 12.9% 3,814</li><li>09 Jon 37,480 12.7% 4,164</li><li>09 Tyrion 35,340 12.0% 3,927</li><li>07 Bran 26,980 9.1% 3,854</li><li>06 Sansa 23,560 8.0% 3,927</li><li>05 Arya 21,110 7.2% 4,222</li></ol><p>Eight perspective characters, with Ned accounting for 15 chapters and 18.3 percent of the focus. Only Ned was eliminated by the end of the book, so Martin entered the second book of the series with a very manageable seven characters. He adds three characters to reach 10, then two more in the third for 12, however, he only continues the stories of three of those 12 characters as he introduces 10 more in the fourth book.</p><p>By the end of <em>A Dance with Dragons</em>, Martin had divided up his increasingly out-of-control story amidst 18 perspective characters and entered <em>The Winds of Winter</em> with up to 30(!) potential perspective characters whose stories require at least some degree of resolution! Ironically for an author whose biggest claim to literary fame is for his willingness to kill off his characters, Martin’s main problem is that he doesn’t kill off enough anywhere nearly enough of them. How do you satisfactorily close out a series when you can only devote an average of two chapters to each character?</p><p>Constrast this with my POV discipline in <em>Arts of Dark and Light</em>. There are seven perspective characters in <em>A Throne of Bones</em>, not counting the crows or the prologue. One of those characters died, leaving six. I added four new perspective characters in <em>A Sea of Skulls</em> for a total of 10, but three characters did not survive the second book, leaving me with a perfectly manageable seven perspective characters whose stories require resolution by the end of the final book.</p><p>The seeds of Martin’s present predicament were clearly sown in <em>A Feast for Crows</em>, when he unnecessarily introduced 10 new characters while failing to follow the stories of nine of his previous perspective characters. That’s why <em>A Dance with Dragons</em> was both a) even longer than the previous books and b) so disappointing. Indeed, that was the book that convinced me that I could not only write an epic fantasy myself, but write a better one than Martin.</p><p>The structural issue isn’t the only problem, of course. The other problem is that Martin divulged the ending via the HBO show and everyone hated it. So Martin should have gone back to the drawing board and come up with a different ending, but he is too old and too fat to have the strength required for the task.</p><p><em>As physical strength declines, there is a subtle decline in mental fitness, too. Mental agility and emotional flexibility are lost. Once when I was interviewed by a young writer I declared that “once a writer puts on fat, it’s all over.” This was a bit hyperbolic , and of course there are exceptions, but I do believe that for the most part it’s true. Whether it is actual physical fat or metaphoric fat.</em><br/>– Haruki Murakami, <em>Novelist as a Vocation</em></p><p>In conclusion, Martin is facing an extraordinarily difficult task of resolving two major problems at a time when he has probably never been less able to address them. Throw in his existing wealth and fame, and it should not be difficult to ascertain why he is very unlikely to ever finish his epic.</p><p>If you’re interested in this topic, you can see how I rated <a href=\"https://voxday.net/2017/08/30/compression-and-decompression/\">the various authors of epic fantasy</a> back in 2017. If you feel I missed anyone significant, do bring them to my attention.</p><p><em><a href=\"https://social.infogalactic.com/micropost/89afe99a-fc97-4e07-a6c4-04891ee69aa3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Author Devon Eriksen expounds his theory of\nwhy George R. R. Martin can’t finish\nA Song of Ice and Fire\n. While he’s correct that Martin cannot, and almost certainly will not, finish it by himself before he dies, he’s totally and utterly incorrect as to the reason. He’s also wrong about what the saga “actually wants to be”.\nHere’s what Song of Ice and Fire actually wants to be, and why George can’t finish it. The Song of Ice and Fire isn’t actually supposed to be dark, Machiavellian, hopeless, or a subversion of Tolkien at all. It’s just supposed to\nstart\nthat way. The details may be complex, but the formula is simple. Low-fantasy version of the British Isles, torn apart by multi-sided Machiavellian power struggle, loosely based on the War of the Roses. Things are bad because of Machiavellian power struggle. In the background, subtle hints of external, magical, otherworldly threat. Warring factions scoff and ignore it as first.\nEnter the high-fantasy tropes; prophesied hero emerges to unite the morally-grey factions into an unambiguously-good pro-civilization force to confront and defeat the unambiguously-evil threat to all life. Full transition, in the end, to epic Tolkienesque high fantasy, played straight rather than subverted. Heroism triumphant, humanity triumphant, realm unified in peace and prosperity. Roll credits.\nWere the story to be completed thus, completed as it wants to be completed, as it yearns to be completed, every dark, gritty, Machiavellian moment would be fully justified. Every chapter and scene filled with thugs and villains and no heroes at all would be fully justified. Because they would merely serve to emphasize the rarity of heroes, and the need for them. Because they would make the arrival of a true hero that much more satisfying when, late but not too late, he arrived. ASOIAF doesn’t really want to be a subversion of Tolkien at all. It wants to be a path out of darkness and into light. It wants to be a study in how Tolkien is deeply relevant, even to a gritty, morally grey world.\nThis is what George knows it needs to be. But George cannot write it. Why? Because he’s a socialist. And a boomer. Socialism’s motivational core is envy, and its one underlying rule is “thou shalt not be better than me”. The boomer’s single guiding principle is “whatever makes me feel pleasure right now is good, and whatever makes me feel bad right now is evil”. Take these together, and you get someone who has a real problem with heroes. Heroes are, by definition, the best of us, at least on some dimension, and if your underlying motivation is envy, standing next to one is gonna make you feel bad. This means that socialists, boomers, and socialist boomers tend not to want to believe in heroes and heroism. They want to convince themselves that anything which appears good is secretly evil, actually, and that anyone who makes them feel or look bad is obviously evil because reasons. So when they see a hero, they tend to call him a fascist. (Of course, when they see a fascist, they also call him a fascist, but that’s just coincidence, because they’ll call anything fascist… random passers-by, buildings, rocks, trees, squirrels, anything.) Because they want to feel morally superior to him. The only way they can admit that someone has a moral compass at all is if they can feel superior to him in some other way, usually by portraying them as naive, and hence doomed to failure because he is not empowered by cynicism and selfishness, to pursue the most efficient path to… whatever.\nSo if ol’ George thinks that everyone who appears good is either secretly evil, or openly stupid, then writing a character with heroic impulses is gonna be tough, and writing about how they succeed… impossible. This is why George can write characters with noble motives (Jon Snow, Eddard Stark, etc), but he keeps making them fail. You see, in George’s world, heroism must be a sham or a weakness, because then George’s own bad character is\nwisdom and enlightenment\n, instead of just\nlack of moral virtue\n. If heroes are all frauds or suckers, then George is being smart, because he has seen through the whole heroism thing. If heroes are real, and they do sometimes succeed, and they do make the world better for everyone, then George is just a fat, lazy, cynical old man who doesn’t wanna finish his art for the sake of art or integrity, because he only ever wanted money, and now he has more than he knows what to do with.\nIn order to finish the story, George would need to have an awakening of virtue. He would first have to develop a sense of integrity — a desire to fulfill his promises, even when no one can or will punish him for not doing so. He would then have to develop a sense of humility — because to write a better person than he is, he would have to admit to himself that there is such a thing, that people can be better, and that trying to be better is an actual worthy goal, not just the act of falling for a con game run to control you. The longer someone goes without admitting to their faults, the harder those faults are to admit to, because they have been more deeply invested in. And this means he would also have to develop the courage to admit to himself that he is, in fact, a fat lazy cynical old coward, and that Tolkien, whom he envies and despises, was the far better man all along.\nThis sort of thinking appeals to many fans of Tolkien who rightly consider Martin to be a lesser author, and correctly deem ASOIAF to be a lesser work, despite its much greater length, than LOTR. But it is incorrect, and not only is it incorrect, but it is irrelevant.\nEriksen is describing a work that he would write, if he was able to write an epic fantasy saga, which he is unlikely to be able to do. As Haruki Murakami observes, the longer the work, the deeper into oneself one has to delve, and the more laborious the effort required. As one of the very few who has written short stories, novels, and an epic fantasy saga, I can testify that it is as difficult to go from writing novels to epics as it is to go from writing short stories to novels.\nNihilism is not the problem. Envy of Tolkien is not the problem. Lack of virtue is not the problem. Morality, cowardice, and a refusal to admit to his own faults are not the problem.\nTo the contrary, Martin’s dilemma is chiefly a technical one related to the structure of the books that has been obvious since the release of the fourth book in the series. Consider the POV breakdown of\nA Game of Thrones\n, the first book of ASOIAF.\n15 Ned 53,920 18.3% 3,595\n11 Catelyn 44,522 15.1% 4,047\n10 Daenerys 38,142 12.9% 3,814\n09 Jon 37,480 12.7% 4,164\n09 Tyrion 35,340 12.0% 3,927\n07 Bran 26,980 9.1% 3,854\n06 Sansa 23,560 8.0% 3,927\n05 Arya 21,110 7.2% 4,222\nEight perspective characters, with Ned accounting for 15 chapters and 18.3 percent of the focus. Only Ned was eliminated by the end of the book, so Martin entered the second book of the series with a very manageable seven characters. He adds three characters to reach 10, then two more in the third for 12, however, he only continues the stories of three of those 12 characters as he introduces 10 more in the fourth book.\nBy the end of\nA Dance with Dragons\n, Martin had divided up his increasingly out-of-control story amidst 18 perspective characters and entered\nThe Winds of Winter\nwith up to 30(!) potential perspective characters whose stories require at least some degree of resolution! Ironically for an author whose biggest claim to literary fame is for his willingness to kill off his characters, Martin’s main problem is that he doesn’t kill off enough anywhere nearly enough of them. How do you satisfactorily close out a series when you can only devote an average of two chapters to each character?\nConstrast this with my POV discipline in\nArts of Dark and Light\n. There are seven perspective characters in\nA Throne of Bones\n, not counting the crows or the prologue. One of those characters died, leaving six. I added four new perspective characters in\nA Sea of Skulls\nfor a total of 10, but three characters did not survive the second book, leaving me with a perfectly manageable seven perspective characters whose stories require resolution by the end of the final book.\nThe seeds of Martin’s present predicament were clearly sown in\nA Feast for Crows\n, when he unnecessarily introduced 10 new characters while failing to follow the stories of nine of his previous perspective characters. That’s why\nA Dance with Dragons\nwas both a) even longer than the previous books and b) so disappointing. Indeed, that was the book that convinced me that I could not only write an epic fantasy myself, but write a better one than Martin.\nThe structural issue isn’t the only problem, of course. The other problem is that Martin divulged the ending via the HBO show and everyone hated it. So Martin should have gone back to the drawing board and come up with a different ending, but he is too old and too fat to have the strength required for the task.\nAs physical strength declines, there is a subtle decline in mental fitness, too. Mental agility and emotional flexibility are lost. Once when I was interviewed by a young writer I declared that “once a writer puts on fat, it’s all over.” This was a bit hyperbolic , and of course there are exceptions, but I do believe that for the most part it’s true. Whether it is actual physical fat or metaphoric fat.\n– Haruki Murakami,\nNovelist as a Vocation\nIn conclusion, Martin is facing an extraordinarily difficult task of resolving two major problems at a time when he has probably never been less able to address them. Throw in his existing wealth and fame, and it should not be difficult to ascertain why he is very unlikely to ever finish his epic.\nIf you’re interested in this topic, you can see how I rated\nthe various authors of epic fantasy\nback in 2017. If you feel I missed anyone significant, do bring them to my attention.\nDISCUSS ON SG",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-06T14:17:15+00:00"
}