{
  "url": "https://voxday.net/2024/09/09/china-rejects-clown-world/",
  "scraped_at": "2026-01-08T19:22:11.831637",
  "title": "China Rejects Clown World",
  "date_display": "September 9, 2024",
  "date_iso": "2024-09-09T10:02:57+00:00",
  "date_from_url": "2024-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And all of <a href=\"https://www.mfa.gov.cn/eng/xw/fyrbt/lxjzh/202409/t20240906_11486608.html\">its globalist pomps</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>According to the US Department of State, the PRC Ministry of Civil Affairs has notified the American government that since August 28, civil affairs departments across China will no longer carry out foreign adoption work. Could you confirm the stop? And if so, could you elaborate on it?</em></p><p><strong>Mao Ning: </strong>The Chinese government has adjusted its cross-border adoption policy. Henceafter, apart from the adoption of a child or stepchild from one’s collateral relatives by blood of the same generation and up to the third degree of kinship by foreigners coming to China, China will not send children abroad for adoption. This is also in line with the spirit of relevant international covenants. We express our appreciation to those foreign governments and families, who wish to adopt Chinese children, for their good intention and the love and kindness they have shown.</p></blockquote><p>This is a strong statement of Chinese nationalism. It’s a rejection of the concept that an individual’s “nation” is whatever a piece of paper says it is and that one’s identity is chiefly determined by geography rather than blood. This is an important step in combatting the concept of <em>economy uber alles</em>, the globalist philosophy which regards human beings as nothing more than interchangeable cogs in the global finance machine.</p><p>I doubt it’s an accident that the rise of Russia coincides with the Russian ban on US adoptions in 2012.</p><p><em><a href=\"https://social.infogalactic.com/micropost/acc863fa-6f42-46d4-b534-419594dd9204\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And all of\nits globalist pomps\n:\nAccording to the US Department of State, the PRC Ministry of Civil Affairs has notified the American government that since August 28, civil affairs departments across China will no longer carry out foreign adoption work. Could you confirm the stop? And if so, could you elaborate on it?\nMao Ning:\nThe Chinese government has adjusted its cross-border adoption policy. Henceafter, apart from the adoption of a child or stepchild from one’s collateral relatives by blood of the same generation and up to the third degree of kinship by foreigners coming to China, China will not send children abroad for adoption. This is also in line with the spirit of relevant international covenants. We express our appreciation to those foreign governments and families, who wish to adopt Chinese children, for their good intention and the love and kindness they have shown.\nThis is a strong statement of Chinese nationalism. It’s a rejection of the concept that an individual’s “nation” is whatever a piece of paper says it is and that one’s identity is chiefly determined by geography rather than blood. This is an important step in combatting the concept of\neconomy uber alles\n, the globalist philosophy which regards human beings as nothing more than interchangeable cogs in the global finance machine.\nI doubt it’s an accident that the rise of Russia coincides with the Russian ban on US adoptions in 2012.\nDISCUSS ON SG",
  "tags": [
    "China",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-09T10:02:59+00:00"
}