{
  "url": "https://voxday.net/2024/09/12/clown-worlds-candidate/",
  "scraped_at": "2026-01-08T19:22:30.277911",
  "title": "Clown World’s Candidate",
  "date_display": "September 12, 2024",
  "date_iso": "2024-09-12T00:56:17+00:00",
  "date_from_url": "2024-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been paying closer attention – well, any attention is closer attention – to the LDP leadership contest this time around because it’s clear that there is a Japanese faction that wants to break from US control and align with the sovereign nations. However, it’s now evident that the leading candidate <a href=\"https://japantoday.com/category/politics/japan-leading-pm-candidate-koizumi-vows-to-respect-boj's-independence-media-says\">is not aligned</a> with that faction.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Japan’s former Environment Minister and leading prime ministerial candidate Shinjiro Koizumi said he would respect the central bank’s independence in setting monetary policy if he is chosen to lead the country, according to a television program on Wednesday.</p><p>“I will respect the Bank of Japan’s independence,” Koizumi was quoted as saying in the BS 11 program, adding that he would focus on ensuring smooth dialogue and communication between the government and the central bank.</p><p>He ranked as the most favored candidate to become the next LDP leader in a poll taken by the Nikkei newspaper on Aug 21-22, followed by former Defense Minister Shigeru Ishiba.</p></blockquote><p>If you don’t see the connection, read Richard Werner’s <em>Princes of the Yen</em>. An independent central bank is always reliable evidence of a nation’s submission to Clown World.</p><p>Sooner or later, the Japanese will decide the decline of US naval power is sufficient to go their own way, at which time it will be a very, very bad time to be a gaijin in Japan, if the last time the Japanese decided to break with foreign influences is any guide.</p><p><em><a href=\"https://social.infogalactic.com/micropost/39ccfa82-92bf-42ca-8573-fcf1e27df336\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’ve been paying closer attention – well, any attention is closer attention – to the LDP leadership contest this time around because it’s clear that there is a Japanese faction that wants to break from US control and align with the sovereign nations. However, it’s now evident that the leading candidate\nis not aligned\nwith that faction.\nJapan’s former Environment Minister and leading prime ministerial candidate Shinjiro Koizumi said he would respect the central bank’s independence in setting monetary policy if he is chosen to lead the country, according to a television program on Wednesday.\n“I will respect the Bank of Japan’s independence,” Koizumi was quoted as saying in the BS 11 program, adding that he would focus on ensuring smooth dialogue and communication between the government and the central bank.\nHe ranked as the most favored candidate to become the next LDP leader in a poll taken by the Nikkei newspaper on Aug 21-22, followed by former Defense Minister Shigeru Ishiba.\nIf you don’t see the connection, read Richard Werner’s\nPrinces of the Yen\n. An independent central bank is always reliable evidence of a nation’s submission to Clown World.\nSooner or later, the Japanese will decide the decline of US naval power is sufficient to go their own way, at which time it will be a very, very bad time to be a gaijin in Japan, if the last time the Japanese decided to break with foreign influences is any guide.\nDISCUSS ON SG",
  "tags": [
    "Asia"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-12T00:56:19+00:00"
}