{
  "url": "https://voxday.net/2024/09/05/clowns-are-falling/",
  "scraped_at": "2026-01-08T19:21:48.873050",
  "title": "Clowns are Falling",
  "date_display": "September 5, 2024",
  "date_iso": "2024-09-05T09:42:17+00:00",
  "date_from_url": "2024-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sweden’s Foreign Minister <a href=\"https://www.rt.com/news/603534-sweden-foreign-minister-billstrom-resigns/\">unexpectedly resigned</a> on the same day that the Kiev regime fired what seems to be about half of its cabinet.</p><p>Tobias Billstrom, who oversaw Sweden’s accession to NATO, has announced his resignation as foreign minister and retirement from politics, offering no reason for the move. Billstrom, 50, was first elected to the Swedish parliament in 2002 and was appointed foreign minister in 2022… As his biggest achievement over the past two years, Billstrom listed Sweden’s abandonment of its 200-year neutrality to join NATO “after a long and sometimes challenging process.”</p><p>I suspect the reason for his sudden resignation is that more Swedish “instructors” were killed in the recent double-Iskander <a href=\"https://simplicius76.substack.com/p/massive-iskander-attack-sends-rats\">missile strike in Poltava</a> than have been reported. The number of KIA is officially 41, but Ukrainian locals are reporting up to 760 bodies in the morgue. To go from 200 years of safe neutrality to losing dozens of military officers in a single Russian strike is a catastrophe that the leading advocate of abandoning neutrality would have to be held responsible.</p><p>One hopes that the utterly deluded Swiss politicians who are so desperate to follow Sweden’s lead will learn from Billstrom’s example and abandon their insane campaign to sign Switzerland up for the same sort of military and economic devastation that is facing the NATO slave-nations.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9c6ee64e-a9fb-4afd-b1ec-6c756be04179\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Sweden’s Foreign Minister\nunexpectedly resigned\non the same day that the Kiev regime fired what seems to be about half of its cabinet.\nTobias Billstrom, who oversaw Sweden’s accession to NATO, has announced his resignation as foreign minister and retirement from politics, offering no reason for the move. Billstrom, 50, was first elected to the Swedish parliament in 2002 and was appointed foreign minister in 2022… As his biggest achievement over the past two years, Billstrom listed Sweden’s abandonment of its 200-year neutrality to join NATO “after a long and sometimes challenging process.”\nI suspect the reason for his sudden resignation is that more Swedish “instructors” were killed in the recent double-Iskander\nmissile strike in Poltava\nthan have been reported. The number of KIA is officially 41, but Ukrainian locals are reporting up to 760 bodies in the morgue. To go from 200 years of safe neutrality to losing dozens of military officers in a single Russian strike is a catastrophe that the leading advocate of abandoning neutrality would have to be held responsible.\nOne hopes that the utterly deluded Swiss politicians who are so desperate to follow Sweden’s lead will learn from Billstrom’s example and abandon their insane campaign to sign Switzerland up for the same sort of military and economic devastation that is facing the NATO slave-nations.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-05T09:42:19+00:00"
}