{
  "url": "https://voxday.net/2024/09/22/der-knochenthron/",
  "scraped_at": "2026-01-08T19:23:50.955354",
  "title": "DER KNOCHENTHRON",
  "date_display": "September 22, 2024",
  "date_iso": "2024-09-22T13:17:48+00:00",
  "date_from_url": "2024-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>“Wer bist du?”</em></p><p><em>Ahenobarbus starrte auf das verblichene Gemälde in dem vergoldeten Rahmen vor ihm an der Wand. Die flackernden Kerzen warfen einen unheimlichen Schein auf die Szene: Sechs bewaffnete Männer standen über dem Leichnam eines weiteren Mannes. Ahenobarbus, oder wie andere ihn ehrfürchtig nannten, Seine Heiligkeit Barmherzigkeit IV, konnte den Blick nicht von ihm wenden. Das Opfer war nackt. Sechs Mörder waren auf dem Bild zu sehen, aber der Körper wies sieben Wunden auf. Einer hatte zweimal zugestochen.</em></p><p><em>“Warum haben sie dich getötet?”</em></p><p>– <em><a href=\"https://castalialibrary.substack.com/p/der-knochenthron-001\">DER KNOCHENTHRON</a></em></p><p>Thanks to the intrepid efforts of a gentleman who shall only be noted as H until such time as he wishes to take public credit, we are rapidly approaching the completion of the German translation of <em>A THRONE OF BONES</em>, a vast and mighty endeavor indeed. Hardcover and ebook editions of both it and the German translation of <em>SUMMA ELVETICA</em> will be released in the new year, and we also anticipate a very limited leatherbound print run from Éditions Alpines after the German language <em>HEIDI </em>is finally shipped to backers of the bindery. Finnish editions will also be published in hardcover and ebook.</p><p>We have therefore added an Alpines section to the Castalia Library substack for those who wish to keep up to date on the various foreign language leatherbound editions, and as a bonus for those who wish to follow it, we are offering <a href=\"https://castalialibrary.substack.com/p/der-knochenthron-001\">a daily serialization of <em>DER KNOCHENTHRON</em></a> in that section. Since we don’t wish to bombard English-only speakers with foreign language emails, it is necessary to opt in to the Alpines emails even if you are already a Castalia Library substack subscriber. You can do so in your Subscription Notifications for Castalia Library as shown below:</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-64595\" decoding=\"async\" fetchpriority=\"high\" height=\"210\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/09/image-30.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/09/image-30.png 512w, https://voxday.net/wp-content/uploads/2024/09/image-30-300x123.png 300w\" width=\"512\"/></figure></div><p>Now that the bindery is going operational, we’re finally going to start doing some of the things we’ve been planning to do for the last four years. Among them are a) <em>The Iliad</em> and <em>The Odyssey</em>, b) Chinese classics, c) <em>Heidi</em>, <em>Der Knochentron</em>, and other German books, d) French classics, and e) sets and one-offs for modern authors and publishers. We also expect to get completely caught up on the Library subscription as we already are on the History subscription.</p><p>In addition to completing the last two books in the Junior Classics next year, we are also contemplating the possibility and practicality of adding two additional volumes to the set.</p><p>And if there are any native French or Italian speakers with a flair for literature and a bit of a masochistic streak who happen to be feeling ambitious, we’d certainly welcome any volunteers. Unfortunately, the massive size of the books combined with the smaller markets don’t allow the economics of hiring professional translators to work at this point.</p><p><em><a href=\"https://socialgalactic.com/micropost/53aed416-d3c6-4e9d-8b3b-0c50409295bf\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "“Wer bist du?”\nAhenobarbus starrte auf das verblichene Gemälde in dem vergoldeten Rahmen vor ihm an der Wand. Die flackernden Kerzen warfen einen unheimlichen Schein auf die Szene: Sechs bewaffnete Männer standen über dem Leichnam eines weiteren Mannes. Ahenobarbus, oder wie andere ihn ehrfürchtig nannten, Seine Heiligkeit Barmherzigkeit IV, konnte den Blick nicht von ihm wenden. Das Opfer war nackt. Sechs Mörder waren auf dem Bild zu sehen, aber der Körper wies sieben Wunden auf. Einer hatte zweimal zugestochen.\n“Warum haben sie dich getötet?”\n–\nDER KNOCHENTHRON\nThanks to the intrepid efforts of a gentleman who shall only be noted as H until such time as he wishes to take public credit, we are rapidly approaching the completion of the German translation of\nA THRONE OF BONES\n, a vast and mighty endeavor indeed. Hardcover and ebook editions of both it and the German translation of\nSUMMA ELVETICA\nwill be released in the new year, and we also anticipate a very limited leatherbound print run from Éditions Alpines after the German language\nHEIDI\nis finally shipped to backers of the bindery. Finnish editions will also be published in hardcover and ebook.\nWe have therefore added an Alpines section to the Castalia Library substack for those who wish to keep up to date on the various foreign language leatherbound editions, and as a bonus for those who wish to follow it, we are offering\na daily serialization of\nDER KNOCHENTHRON\nin that section. Since we don’t wish to bombard English-only speakers with foreign language emails, it is necessary to opt in to the Alpines emails even if you are already a Castalia Library substack subscriber. You can do so in your Subscription Notifications for Castalia Library as shown below:\nNow that the bindery is going operational, we’re finally going to start doing some of the things we’ve been planning to do for the last four years. Among them are a)\nThe Iliad\nand\nThe Odyssey\n, b) Chinese classics, c)\nHeidi\n,\nDer Knochentron\n, and other German books, d) French classics, and e) sets and one-offs for modern authors and publishers. We also expect to get completely caught up on the Library subscription as we already are on the History subscription.\nIn addition to completing the last two books in the Junior Classics next year, we are also contemplating the possibility and practicality of adding two additional volumes to the set.\nAnd if there are any native French or Italian speakers with a flair for literature and a bit of a masochistic streak who happen to be feeling ambitious, we’d certainly welcome any volunteers. Unfortunately, the massive size of the books combined with the smaller markets don’t allow the economics of hiring professional translators to work at this point.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-22T13:30:30+00:00"
}