{
  "url": "https://voxday.net/2024/09/29/disordered-and-unaccountable/",
  "scraped_at": "2026-01-08T19:24:37.371397",
  "title": "Disordered and Unaccountable",
  "date_display": "September 29, 2024",
  "date_iso": "2024-09-29T10:08:52+00:00",
  "date_from_url": "2024-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Never have any sympathy for atheists, who are the “fools” often described in the Bible. Because atheists aren’t just socially-disabled retards, they’re self-destructive socially-disabled retards <a href=\"https://www.huffpost.com/entry/atheism-has-a-suicide-problem_b_5a2a902ee4b022ec613b812b\">who blame everyone else</a> for their own self-destructive actions:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Atheism Has a Suicide Problem</p><p>Depression is a serious problem with in the greater atheist community and far too often, that depression has led to suicide. This is something many of my fellow atheists often don’t like to admit, but it is true. I know a lot of atheists, myself included, would all like to believe that atheists are happier people than religious believers and in many ways we are. But we also have to accept the reality that in some very important ways we are not.</p><p>There are of course many valid reasons why atheists are sometimes more prone to suicide than religious believers. Interestingly enough, one of those reasons is religious believers themselves. We live in a world dominated by people who often fervently believe ancient superstitions and who many times demonize, harass, ostracize, and disown those who lack belief in those ancient superstitions. Atheists on the receiving end of this treatment are understandably stressed and isolated. They often experience anxiety and depression as a result.</p></blockquote><p>Atheists want to believe they’re happier and smarter while by every single measure of mental health, they are observably unhappier and unhealthier. They’re less likely to ever get married or to have children, while they’re much more likely to be depressed, to be gay, to take illegal drugs, to be on antidepressants, and to kill themselves. And then they blame the religious for their own intrinsic flaws.</p><p>If atheism was a disease, there would be a pill for it. At its core, it is an anti-life pseudo-philosophy which scientific  mental disorder that prevents the sufferer from recognizing the marks of the Creator in His Creation. This is why, <a href=\"https://voxday.net/2007/08/02/socially-autistic-atheis/\">as I was the first</a> to hypothesize, <a href=\"https://www.psychologytoday.com/us/blog/psyched/201205/does-autism-lead-to-atheism\">multiple studies have found</a> that atheism is very strongly correlated with mental disability: <em>“neurotypical subjects were 10 times as likely to strongly endorse God.”</em></p><p>The lesson is this: one should not take the arguments and assertions of atheists any more seriously than one does those of any other mentally-disabled individual. There is a very good reason that the arguments put forth by their greatest champions are uniformly inept.</p><p><em><a href=\"https://socialgalactic.com/micropost/bd0b4a38-5517-4b0b-8878-04bed144f4db\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Never have any sympathy for atheists, who are the “fools” often described in the Bible. Because atheists aren’t just socially-disabled retards, they’re self-destructive socially-disabled retards\nwho blame everyone else\nfor their own self-destructive actions:\nAtheism Has a Suicide Problem\nDepression is a serious problem with in the greater atheist community and far too often, that depression has led to suicide. This is something many of my fellow atheists often don’t like to admit, but it is true. I know a lot of atheists, myself included, would all like to believe that atheists are happier people than religious believers and in many ways we are. But we also have to accept the reality that in some very important ways we are not.\nThere are of course many valid reasons why atheists are sometimes more prone to suicide than religious believers. Interestingly enough, one of those reasons is religious believers themselves. We live in a world dominated by people who often fervently believe ancient superstitions and who many times demonize, harass, ostracize, and disown those who lack belief in those ancient superstitions. Atheists on the receiving end of this treatment are understandably stressed and isolated. They often experience anxiety and depression as a result.\nAtheists want to believe they’re happier and smarter while by every single measure of mental health, they are observably unhappier and unhealthier. They’re less likely to ever get married or to have children, while they’re much more likely to be depressed, to be gay, to take illegal drugs, to be on antidepressants, and to kill themselves. And then they blame the religious for their own intrinsic flaws.\nIf atheism was a disease, there would be a pill for it. At its core, it is an anti-life pseudo-philosophy which scientific  mental disorder that prevents the sufferer from recognizing the marks of the Creator in His Creation. This is why,\nas I was the first\nto hypothesize,\nmultiple studies have found\nthat atheism is very strongly correlated with mental disability:\n“neurotypical subjects were 10 times as likely to strongly endorse God.”\nThe lesson is this: one should not take the arguments and assertions of atheists any more seriously than one does those of any other mentally-disabled individual. There is a very good reason that the arguments put forth by their greatest champions are uniformly inept.\nDISCUSS ON SG",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-29T10:08:54+00:00"
}