{
  "url": "https://voxday.net/2024/09/30/stretch-goal-2/",
  "scraped_at": "2026-01-08T19:24:44.716967",
  "title": "Stretch Goal 2",
  "date_display": "September 30, 2024",
  "date_iso": "2024-09-30T12:19:52+00:00",
  "date_from_url": "2024-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that the campaign has blown past its first stretch goal, it’s time to announce <a href=\"https://www.kickstarter.com/projects/arkhaven/hypergamouse-volume-1\">Stretch Goal #2</a>. And that is a six-page introduction which will include all of the original HYPERGAMOUSE cartoons. This will increase the length of the regular editions to 124 pages and the coffee table book to 234 pages. Stretch Goal #2 is set at $60,000; the campaign is currently at 65 percent of that.</p><p>Below is an image of Mari as she was first conceived by the original artist on the left, and Mari as she was subsequently illustrated by Lacey Fairchild on the right. This introduction will make Volume 1 a comprehensive historical collection, and <a href=\"https://www.kickstarter.com/projects/arkhaven/hypergamouse-volume-1\">one well worth backing</a> in order to add to one’s library. Imagine if an original first edition of <em>PEANUTS</em> had ever been produced in this manner and what that would be worth today.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.kickstarter.com/projects/arkhaven/hypergamouse-volume-1\"><img alt=\"\" class=\"wp-image-64700\" decoding=\"async\" fetchpriority=\"high\" height=\"184\" src=\"https://voxday.net/wp-content/uploads/2024/09/image-38.png\" width=\"295\"/></a></figure></div><p><em>Fandom Pulse</em> recently published <a href=\"https://fandompulse.substack.com/p/arkhaven-comics-quietly-makes-waves\">a nice article on the history of Arkhaven</a> and the Hypergamouse campaign:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>While Eric July and Ethan Van Sciver often dominate the conversation of the ant-woke sphere in comics, Arkhaven Comics has been building infrastructure and systems to produce thousands of pages of quality content in a host of different genres. Their Webtoon competitor website has reached over 15 million views, and their latest Kickstarter campaign, <em>Hypergamouse</em>, is a huge success after its first day live.</p><p>Arkhaven started in 2017 as a response to the woke nightmare that Marvel and DC Comics had become. Writer and publisher Vox Day created a crowdfund that shook the comic industry, with <em>Alt-Hero</em> raising more than $250,000 in its initial offering, which spawned a whole line of comics. Creators like Ya Boi Zack and Ethan Van Sciver saw the incredible amount a company could make on crowdfunding and ventured into their own books the year after Vox Day launched the first ComicsGate project, capitalizing on the momentum here.</p><p>But Vox Day didn’t stop there. He teamed up with many creators, including industry veteran Chuck Dixon, who’s been creating an incredible amount of work through Arkhaven’s site, including fan favorites such as <em>My Sister Suprema</em> and <em>Something Big</em>.</p><p>Another hit on the Arkhaven website has been Lacey Fairchild’s <em>Hypergamouse</em>. A comedy strip focused on the socio-sexual hierarchy, Fairchild combines the anthropomorphic slice-of-life humor of old newspaper comics with modern theming, making <em>Hypergamouse </em>something special for readers.</p></blockquote><p>In the interest of precision, I would point out that calling <em>Alt-Hero</em> the first ComicsGate project is correct in the original sense of the term that referred to a consciously anti-mainstream independent comic. Obviously, it predated both the term and the trademark, and the only Arkhaven project that was even tangentially related to ComicsGateTM was the original publication of <em>Gun Ghoul</em>, which was very briefly produced under a ComicsGate imprint. Old school gamers will immediately recognize the significance of the colors.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><noscript><img alt=\"\" class=\"wp-image-64710\" decoding=\"async\" height=\"300\" sizes=\"(max-width: 300px) 100vw, 300px\" src=\"https://voxday.net/wp-content/uploads/2024/09/image-42.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/09/image-42.png 300w, https://voxday.net/wp-content/uploads/2024/09/image-42-150x150.png 150w\" width=\"300\"/></noscript><img alt=\"\" class=\"lazyload wp-image-64710\" data-sizes=\"(max-width: 300px) 100vw, 300px\" data-src=\"https://voxday.net/wp-content/uploads/2024/09/image-42.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2024/09/image-42.png 300w, https://voxday.net/wp-content/uploads/2024/09/image-42-150x150.png 150w\" decoding=\"async\" height=\"300\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20300%20300%22%3E%3C/svg%3E\" width=\"300\"/></figure></div><p>I think it’s also worth noting that Arktoons will hit 16 million views in October. And speaking of Arktoons, looks who’s back and rolling with <a href=\"https://www.arkhaven.com/comics/action/black-five/6-rolling-thunder\">a new chapter on Arktoons</a> again.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.arkhaven.com/comics/action/black-five/6-rolling-thunder\"><noscript><img alt=\"\" class=\"wp-image-64708\" decoding=\"async\" height=\"330\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/09/image-41.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/09/image-41.png 512w, https://voxday.net/wp-content/uploads/2024/09/image-41-300x193.png 300w\" width=\"512\"/></noscript><img alt=\"\" class=\"lazyload wp-image-64708\" data-sizes=\"(max-width: 512px) 100vw, 512px\" data-src=\"https://voxday.net/wp-content/uploads/2024/09/image-41.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2024/09/image-41.png 512w, https://voxday.net/wp-content/uploads/2024/09/image-41-300x193.png 300w\" decoding=\"async\" height=\"330\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20330%22%3E%3C/svg%3E\" width=\"512\"/></a></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/f5b9c6eb-6c95-4a75-b9ac-f18793829079\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Now that the campaign has blown past its first stretch goal, it’s time to announce\nStretch Goal #2\n. And that is a six-page introduction which will include all of the original HYPERGAMOUSE cartoons. This will increase the length of the regular editions to 124 pages and the coffee table book to 234 pages. Stretch Goal #2 is set at $60,000; the campaign is currently at 65 percent of that.\nBelow is an image of Mari as she was first conceived by the original artist on the left, and Mari as she was subsequently illustrated by Lacey Fairchild on the right. This introduction will make Volume 1 a comprehensive historical collection, and\none well worth backing\nin order to add to one’s library. Imagine if an original first edition of\nPEANUTS\nhad ever been produced in this manner and what that would be worth today.\nFandom Pulse\nrecently published\na nice article on the history of Arkhaven\nand the Hypergamouse campaign:\nWhile Eric July and Ethan Van Sciver often dominate the conversation of the ant-woke sphere in comics, Arkhaven Comics has been building infrastructure and systems to produce thousands of pages of quality content in a host of different genres. Their Webtoon competitor website has reached over 15 million views, and their latest Kickstarter campaign,\nHypergamouse\n, is a huge success after its first day live.\nArkhaven started in 2017 as a response to the woke nightmare that Marvel and DC Comics had become. Writer and publisher Vox Day created a crowdfund that shook the comic industry, with\nAlt-Hero\nraising more than $250,000 in its initial offering, which spawned a whole line of comics. Creators like Ya Boi Zack and Ethan Van Sciver saw the incredible amount a company could make on crowdfunding and ventured into their own books the year after Vox Day launched the first ComicsGate project, capitalizing on the momentum here.\nBut Vox Day didn’t stop there. He teamed up with many creators, including industry veteran Chuck Dixon, who’s been creating an incredible amount of work through Arkhaven’s site, including fan favorites such as\nMy Sister Suprema\nand\nSomething Big\n.\nAnother hit on the Arkhaven website has been Lacey Fairchild’s\nHypergamouse\n. A comedy strip focused on the socio-sexual hierarchy, Fairchild combines the anthropomorphic slice-of-life humor of old newspaper comics with modern theming, making\nHypergamouse\nsomething special for readers.\nIn the interest of precision, I would point out that calling\nAlt-Hero\nthe first ComicsGate project is correct in the original sense of the term that referred to a consciously anti-mainstream independent comic. Obviously, it predated both the term and the trademark, and the only Arkhaven project that was even tangentially related to ComicsGateTM was the original publication of\nGun Ghoul\n, which was very briefly produced under a ComicsGate imprint. Old school gamers will immediately recognize the significance of the colors.\nI think it’s also worth noting that Arktoons will hit 16 million views in October. And speaking of Arktoons, looks who’s back and rolling with\na new chapter on Arktoons\nagain.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-30T18:02:15+00:00"
}