{
  "url": "https://voxday.net/2024/09/04/synonym-not-subset/",
  "scraped_at": "2026-01-08T19:21:46.662319",
  "title": "Synonym, Not Subset",
  "date_display": "September 4, 2024",
  "date_iso": "2024-09-04T23:12:08+00:00",
  "date_from_url": "2024-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the benefits of the serialization of <em>The Cambridge Medieval History</em> is the way in which basic principles are illustrated clearly without the confusion of emotional ties and identity allegiances. Here we see the way in which the Arian controversy was made significantly and unnecessarily worse over a period of decades due to <a href=\"https://castalialibrary.substack.com/p/the-cambridge-medieval-history-i-b20\">the reliable unwillingness of conservatives</a> to do what definitely needed to be done.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Eastern reaction was therefore mainly conservative. The Arians were the tail of the party; they were not outcasts only because conservative hesitation at the Nicene Creed kept open the back door of the Church for them. For thirty years they had to shelter themselves behind the conservatives. It was not till 357 that they ventured to have a policy of their own; and then they broke up the anti-Nicene coalition at once. The strength of Arianism was that while it claimed to be Christian, it brought together and to their logical results all the elements of heathenism in the current Christian thought.</p><p>So the reaction rested not only on conservative timidity, but on the heathen influences around. And heathenism was still a living power in the world, strong in numbers, and still stronger in the imposing memories of history. Christianity was still an upstart on Caesar’s throne, and no man could yet be sure that victory would not sway back to the side of the immortal gods. So the Nicene age was pre-eminently an age of waverers; and every waverer leaned to Arianism as a <em>via media</em> between Christianity and heathenism. The Court also leaned to Arianism. The genuine Arians indeed were not more pliant than the Nicenes; but conservatives are always open to the influence of a Court, and the intriguers of the Court (and under Constantius they were legion) found it their interest to unsettle the Nicene decisions — in the name of conservatism forsooth.</p></blockquote><p>Conservatism isn’t an actual philosophy or ideology, in any time or place. It is simply the cowardly preference for the status quo, for a temporary peace, and above all, for the approval of the authorities. Here is one modern example of conservative openness to the influence of a Court: the false and stupid distinction between legal and illegal immigration. We’ve all heard it many times; some of us may have even said it ourselves: <em>“I’m all for LEGAL immigration, the problem is ILLEGAL immigration”</em>.</p><p>No, the problem is people from different nations, religions, languages, and cultures invading the land and gradually replacing the natives, their religion, their language, and their culture. Whether that invasion takes place with the blessing of the Court or not <em>is totally irrelevant</em> with regard to the inevitable consequences. But the conservative is always more concerned about the present opinion of the Court than he is about the future consequences of his lack of action.</p><p>So, it’s informative to see that conservatives have always been part of the problem, even dating back to the year 327 AD, because it allows us to conclude that they cannot, and will not, ever be a significant part of the solution. Cuckservative is not a subset of conservative, it is a synonym.</p><p><em><a href=\"https://social.infogalactic.com/micropost/bb997fe7-04f8-4824-b51d-90ed9155f887\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One of the benefits of the serialization of\nThe Cambridge Medieval History\nis the way in which basic principles are illustrated clearly without the confusion of emotional ties and identity allegiances. Here we see the way in which the Arian controversy was made significantly and unnecessarily worse over a period of decades due to\nthe reliable unwillingness of conservatives\nto do what definitely needed to be done.\nThe Eastern reaction was therefore mainly conservative. The Arians were the tail of the party; they were not outcasts only because conservative hesitation at the Nicene Creed kept open the back door of the Church for them. For thirty years they had to shelter themselves behind the conservatives. It was not till 357 that they ventured to have a policy of their own; and then they broke up the anti-Nicene coalition at once. The strength of Arianism was that while it claimed to be Christian, it brought together and to their logical results all the elements of heathenism in the current Christian thought.\nSo the reaction rested not only on conservative timidity, but on the heathen influences around. And heathenism was still a living power in the world, strong in numbers, and still stronger in the imposing memories of history. Christianity was still an upstart on Caesar’s throne, and no man could yet be sure that victory would not sway back to the side of the immortal gods. So the Nicene age was pre-eminently an age of waverers; and every waverer leaned to Arianism as a\nvia media\nbetween Christianity and heathenism. The Court also leaned to Arianism. The genuine Arians indeed were not more pliant than the Nicenes; but conservatives are always open to the influence of a Court, and the intriguers of the Court (and under Constantius they were legion) found it their interest to unsettle the Nicene decisions — in the name of conservatism forsooth.\nConservatism isn’t an actual philosophy or ideology, in any time or place. It is simply the cowardly preference for the status quo, for a temporary peace, and above all, for the approval of the authorities. Here is one modern example of conservative openness to the influence of a Court: the false and stupid distinction between legal and illegal immigration. We’ve all heard it many times; some of us may have even said it ourselves:\n“I’m all for LEGAL immigration, the problem is ILLEGAL immigration”\n.\nNo, the problem is people from different nations, religions, languages, and cultures invading the land and gradually replacing the natives, their religion, their language, and their culture. Whether that invasion takes place with the blessing of the Court or not\nis totally irrelevant\nwith regard to the inevitable consequences. But the conservative is always more concerned about the present opinion of the Court than he is about the future consequences of his lack of action.\nSo, it’s informative to see that conservatives have always been part of the problem, even dating back to the year 327 AD, because it allows us to conclude that they cannot, and will not, ever be a significant part of the solution. Cuckservative is not a subset of conservative, it is a synonym.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "cuckservative",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-04T23:12:34+00:00"
}