{
  "url": "https://voxday.net/2024/09/21/systemic-failure/",
  "scraped_at": "2026-01-08T19:23:45.066668",
  "title": "Systemic Failure",
  "date_display": "September 21, 2024",
  "date_iso": "2024-09-21T23:35:10+00:00",
  "date_from_url": "2024-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The ramifications of the vaxx are now beginning to put the hospitals <a href=\"https://www.midwesterndoctor.com/cp/149215906\">under even worse strain</a> than they were during Covid.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><ul class=\"wp-block-list\"><li>An increasingly noticeable number of doctors and nurses and staff have “died suddenly,” “died unexpectedly,” or have become disabled and ill from injuries and/or cancer. The youth and health of these employees have been increasingly remarked on amongst staff (not to mention the deluge of previously healthy and/or young patients they are now presenting with severe and/or atypical (for that age) illnesses. Remember, cancer used to largely be a disease of aging.</li><li>Consequently, the suspected role of the vaccines in most of the deaths is more of an open secret and of growing concern among staff there. To wit, Ohio State University Medical Center (OSUMC) also recently stopped emailing out obituaries of prominent or veteran employees when they die. Why you ask? Because of both the number of them as well as the comments posted by employees that began openly calling out the likelihood that the vaccines were a cause (i.e. they would point out the dates of the decedents vaccination and their death). Unsurprisingly, she also told me OSUMC would quickly censor any posts of that nature (despite containing no foul language, personal attacks, or threats). From a phone conversation we had: <em>“Yes, this is huge. Lots of internal cases of death and disabilities. They quit posting internal obits for staff. The comments underneath them were showing that people knew why everyone was dropping dead for baffling reasons. So those went away.”</em></li><li>A number of physicians (the most noticeable of them being superspecialists who cannot be replaced easily), besides dying, are also leaving due to disability or retiring due to health reasons.</li><li>She is hearing of a growing number of lawsuits by family members of these physicians against OSUMC for the mandates which led to the deaths or disabilities.</li><li>One lawsuit was filed by a widow of a physician who dropped dead suddenly. Interestingly, she demanded an autopsy with staining for spike protein and the heart was found “loaded with spike.”</li><li>Outcomes of organ transplant patients have been plummeting since the mRNA campaign. It got so bad that, in a complete reversal from two years ago where the programs had insisted on both donors and recipients getting jabbed, at OHSUMC they apparently no longer require or recommend mRNA vaccines to recipients and may be prioritizing organs from unvaccinated donors. Whoa. Apparently one of the reasons is that recipients were developing new “systemic” conditions that were not typical or expected in transplant patients previously.</li><li>Minutes of administrative and policy committee meetings are no longer openly available on the internal OSUMC website and are instead only available if you “sign in” (presumably so they know who is looking up these minutes).</li><li>Cancers are exploding, causing massive strain on oncology services. Particularly glioblastomas to the brain as well as to the spine. Also, case managers for the large number of cancer patients were stating they were not retiring due to the patient volume in need.</li></ul></blockquote><p>I saw a video in which a nurse stated that she was one of only three unvaccinated heath care workers at employed at the hospital, and talked about the similarly horrific state of affairs she was observing there. Neither the media nor the government is coming clean yet, but it appears we’re rapidly approaching the time when they won’t have any choice but to do so.</p><p><em><a href=\"https://socialgalactic.com/micropost/37bee85a-8d08-408e-9e1b-0f014c1e07d3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The ramifications of the vaxx are now beginning to put the hospitals\nunder even worse strain\nthan they were during Covid.\nAn increasingly noticeable number of doctors and nurses and staff have “died suddenly,” “died unexpectedly,” or have become disabled and ill from injuries and/or cancer. The youth and health of these employees have been increasingly remarked on amongst staff (not to mention the deluge of previously healthy and/or young patients they are now presenting with severe and/or atypical (for that age) illnesses. Remember, cancer used to largely be a disease of aging.\nConsequently, the suspected role of the vaccines in most of the deaths is more of an open secret and of growing concern among staff there. To wit, Ohio State University Medical Center (OSUMC) also recently stopped emailing out obituaries of prominent or veteran employees when they die. Why you ask? Because of both the number of them as well as the comments posted by employees that began openly calling out the likelihood that the vaccines were a cause (i.e. they would point out the dates of the decedents vaccination and their death). Unsurprisingly, she also told me OSUMC would quickly censor any posts of that nature (despite containing no foul language, personal attacks, or threats). From a phone conversation we had:\n“Yes, this is huge. Lots of internal cases of death and disabilities. They quit posting internal obits for staff. The comments underneath them were showing that people knew why everyone was dropping dead for baffling reasons. So those went away.”\nA number of physicians (the most noticeable of them being superspecialists who cannot be replaced easily), besides dying, are also leaving due to disability or retiring due to health reasons.\nShe is hearing of a growing number of lawsuits by family members of these physicians against OSUMC for the mandates which led to the deaths or disabilities.\nOne lawsuit was filed by a widow of a physician who dropped dead suddenly. Interestingly, she demanded an autopsy with staining for spike protein and the heart was found “loaded with spike.”\nOutcomes of organ transplant patients have been plummeting since the mRNA campaign. It got so bad that, in a complete reversal from two years ago where the programs had insisted on both donors and recipients getting jabbed, at OHSUMC they apparently no longer require or recommend mRNA vaccines to recipients and may be prioritizing organs from unvaccinated donors. Whoa. Apparently one of the reasons is that recipients were developing new “systemic” conditions that were not typical or expected in transplant patients previously.\nMinutes of administrative and policy committee meetings are no longer openly available on the internal OSUMC website and are instead only available if you “sign in” (presumably so they know who is looking up these minutes).\nCancers are exploding, causing massive strain on oncology services. Particularly glioblastomas to the brain as well as to the spine. Also, case managers for the large number of cancer patients were stating they were not retiring due to the patient volume in need.\nI saw a video in which a nurse stated that she was one of only three unvaccinated heath care workers at employed at the hospital, and talked about the similarly horrific state of affairs she was observing there. Neither the media nor the government is coming clean yet, but it appears we’re rapidly approaching the time when they won’t have any choice but to do so.\nDISCUSS ON SG",
  "tags": [
    "health care",
    "trainwreck",
    "Vaxx"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-21T23:35:37+00:00"
}