{
  "url": "https://voxday.net/2024/09/06/the-evil-of-copyright-stands/",
  "scraped_at": "2026-01-08T19:21:58.136993",
  "title": "The Evil of Copyright Stands",
  "date_display": "September 6, 2024",
  "date_iso": "2024-09-06T21:40:09+00:00",
  "date_from_url": "2024-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Internet Archive <a href=\"https://www.avclub.com/internet-archive-loses-appeal-against-publishers-copyright\">lost its appeal</a> in its copyright case against Hachette, HarperCollins, John Wiley and Penguin Random House.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Internet Archive has lost its appeal in the copyright case against Hachette and three other publishers. The Second Circuit Court of Appeals affirmed the previous decision, from March 2023, that the Internet Archive’s Open Library program qualifies as copyright infringement. Hachette, HarperCollins, Penguin Random House, and Wiley initially filed a lawsuit against the popular nonprofit organization in 2020.</p><p>“This appeal presents the following question: Is it ‘fair use” for a nonprofit organization to scan copyright-protected print books in their entirety, and distribute those digital copies online, in full, for free, subject to a one-to-one owned-to-loaned ratio between its print copies and the digital copies it makes available at any given time, all without authorization from the copyright-holding publishers or authors?” Wednesday’s decision reads. “Applying the relevant provisions of the Copyright Act as well as binding Supreme Court and Second Circuit precedent, we conclude the answer is no.”</p><p>The court rejected most of the Internet Archive’s defense, including the notion that the archive provides a public service. “While IA claims that prohibiting its practices would harm consumers and researchers, allowing its practices would―and does―harm authors,” the decision reads. “With each digital book IA disseminates, it deprives Publishers and authors of the revenues due to them as compensation for their unique creations. Though IA and its amici may lament the consolidation of editorial power and criticize Publishers for being motivated by profits, behind Publishers stand authors who are entitled to compensation for the reproduction of their works and whose ‘private motivation’ ultimately serve[s] the cause of promoting broad public availability of literature, music, and the other arts.”</p></blockquote><p>This isn’t going to protect authors. This isn’t going to protect consumers. Like most “law” it does nothing but protect the financial interest of large transnational corporations at the expense of the very works that are being “protected”.</p><p>What comes of “copyright protection” is abominations like Amazon’s raping of Tolkien’s work and Disney’s destruction of <em>Star Wars</em>. Meanwhile, most works are lost to the ravages of history, because their “protection” combined with their unprofitability means the corporate copyright holders see no reason to produce or publish them. The fact that the “protection” extends 70 years beyond the life of the author makes it perfectly clear that this isn’t about the preserving the rights of the author to be compensated.</p><p>And yes, I have taken steps to ensure that my works, at least, will never be acquired by the usual suspects.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6733d5b8-34d6-483d-bd85-dfc62b6bae45\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Internet Archive\nlost its appeal\nin its copyright case against Hachette, HarperCollins, John Wiley and Penguin Random House.\nThe Internet Archive has lost its appeal in the copyright case against Hachette and three other publishers. The Second Circuit Court of Appeals affirmed the previous decision, from March 2023, that the Internet Archive’s Open Library program qualifies as copyright infringement. Hachette, HarperCollins, Penguin Random House, and Wiley initially filed a lawsuit against the popular nonprofit organization in 2020.\n“This appeal presents the following question: Is it ‘fair use” for a nonprofit organization to scan copyright-protected print books in their entirety, and distribute those digital copies online, in full, for free, subject to a one-to-one owned-to-loaned ratio between its print copies and the digital copies it makes available at any given time, all without authorization from the copyright-holding publishers or authors?” Wednesday’s decision reads. “Applying the relevant provisions of the Copyright Act as well as binding Supreme Court and Second Circuit precedent, we conclude the answer is no.”\nThe court rejected most of the Internet Archive’s defense, including the notion that the archive provides a public service. “While IA claims that prohibiting its practices would harm consumers and researchers, allowing its practices would―and does―harm authors,” the decision reads. “With each digital book IA disseminates, it deprives Publishers and authors of the revenues due to them as compensation for their unique creations. Though IA and its amici may lament the consolidation of editorial power and criticize Publishers for being motivated by profits, behind Publishers stand authors who are entitled to compensation for the reproduction of their works and whose ‘private motivation’ ultimately serve[s] the cause of promoting broad public availability of literature, music, and the other arts.”\nThis isn’t going to protect authors. This isn’t going to protect consumers. Like most “law” it does nothing but protect the financial interest of large transnational corporations at the expense of the very works that are being “protected”.\nWhat comes of “copyright protection” is abominations like Amazon’s raping of Tolkien’s work and Disney’s destruction of\nStar Wars\n. Meanwhile, most works are lost to the ravages of history, because their “protection” combined with their unprofitability means the corporate copyright holders see no reason to produce or publish them. The fact that the “protection” extends 70 years beyond the life of the author makes it perfectly clear that this isn’t about the preserving the rights of the author to be compensated.\nAnd yes, I have taken steps to ensure that my works, at least, will never be acquired by the usual suspects.\nDISCUSS ON SG",
  "tags": [
    "books",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-06T21:41:39+00:00"
}