{
  "url": "https://voxday.net/2024/09/22/the-end-of-awe/",
  "scraped_at": "2026-01-08T19:23:46.902583",
  "title": "The End of Awe",
  "date_display": "September 22, 2024",
  "date_iso": "2024-09-22T11:33:03+00:00",
  "date_from_url": "2024-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Western militaries are just beginning to understand that asymmetric warfare has not only undermined their historical advantage over their adversaries, <a href=\"https://smoothiex12.blogspot.com/2024/09/it-is-more-than-that.html\">but has eliminated it completely</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>You just need to be a little bit aware of what the so-called “US air force glory” consists of. And it consists of such specific “feats” that completely explain all the current troubles with the training of Ukrainian pilots on the F-16. The fact is that the US Air Force, as well as all other NATO countries, fought all their previous wars at the end of the 20th – beginning of the 21st centuries in such fabulously comfortable conditions that they could even fly there on brooms, and with a good chance of completing a combat mission. All those countries that they designated as targets for their bombing in the last thirty years were very different. But in one thing they all look the same. All these countries either did not have any air defense at all, or even had it, but in such a quantitative and qualitative state that it was enough for a very short time. And then, after the suppression of this almost symbolic air defense, a real massacre of the innocents began. This happened twice in Iraq, once in Yugoslavia, and finally in the most defenseless Afghanistan. In the latter case, there was absolutely no air defense, which, firstly, allowed bombing this country with absolute impunity. And secondly, sending the newest F-35B carrier-based strike fighters there to test their combat capabilities.</em></p><p>The problem with the US CAS (Close Air Support) on the modern battlefield of the 21st century is that it is not survivable against immediate frontline distributed AD based on a staggering plethora of advanced and networked hardware such as S1 Pantsir, Tor M2, Buk-M2-3 and AD artillery systems such as Tunguska et al. It will also be severely jammed and denied accurate approach in the absence of GPS. The whole idea that the USAF will be defeated even before it even takes off and then defeated before completion of the mission doesn’t sit well with US generals whose combat record even against supremely inferior enemy is dismal. This is not an exaggeration, it is hard cold reality and that is what drives these sore losers like Hodges into the arms of sheer delusion. Then, let it be no surprise in observing Ben Hodges and his “colleagues” such as Keane, Petraeus and others resorting to the name calling and offering military “advice” which no responsible competent military leader would ever give, especially when having no clue about Russia and her historic warfare experience which dwarfs that of the United States. USMA at West Point used to be a decent engineering school. Not anymore…</p></blockquote><p>The US Air Force hasn’t fought any air battles that came anywhere close to peer status since the Battle of Midway in 1942. In the Korean War, the US had 1,172 aircraft in the Pacific to oppose a North Korean People’s Air Force (KPAF) that consisted of only 132 aircraft. While the US and its allies lost 8,540 aircraft during the Vietnam War, almost all of them were lost to anti-aircraft artillery; the North Vietnamese captured four times more South Vietnamese aircraft than they lost during the war: 877 to 159.</p><p>The great Israeli general Moshe Dayan attributed the formidable reputation of the Israeli Defense Forces to “fighting Arabs”. In like manner, US military might always relied upon the fact that it was fighting armies without air forces. In 47 years, the US Air Force was never once put to the test by its sole rival, the VVS of the Soviet Union.</p><p>So, for 82 years, the US military enjoyed complete air supremacy over the battlefield. But the relentless advancement of air defense technology has now rendered the modern battlefield unflyable and strategic air-to-ground bombing campaigns impossible. If the NATO air force were to attempt to strike the Russian ground forces the way the Israelis are launching air strikes on Lebanon, it would be wiped out. And Israel can’t enter Iranian or Syrian air space anymore without having its jets shot down.</p><p>Since their primacy was based on the assumption of permanent air supremacy, the NATO militaries are now as barren strategically as their arsenals are empty. But it is clear that the generals and strategists of Clown World haven’t even begun to think through all the implications of the new military realities that the Chinese and Russian practitioners of the art of war have been gradually bringing about in the 25 years since <em>Unrestricted Warfare</em> was first published.</p><p><em><a href=\"https://socialgalactic.com/micropost/b2855b54-aa6c-44c5-aaa7-bba012b7981f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Western militaries are just beginning to understand that asymmetric warfare has not only undermined their historical advantage over their adversaries,\nbut has eliminated it completely\n.\nYou just need to be a little bit aware of what the so-called “US air force glory” consists of. And it consists of such specific “feats” that completely explain all the current troubles with the training of Ukrainian pilots on the F-16. The fact is that the US Air Force, as well as all other NATO countries, fought all their previous wars at the end of the 20th – beginning of the 21st centuries in such fabulously comfortable conditions that they could even fly there on brooms, and with a good chance of completing a combat mission. All those countries that they designated as targets for their bombing in the last thirty years were very different. But in one thing they all look the same. All these countries either did not have any air defense at all, or even had it, but in such a quantitative and qualitative state that it was enough for a very short time. And then, after the suppression of this almost symbolic air defense, a real massacre of the innocents began. This happened twice in Iraq, once in Yugoslavia, and finally in the most defenseless Afghanistan. In the latter case, there was absolutely no air defense, which, firstly, allowed bombing this country with absolute impunity. And secondly, sending the newest F-35B carrier-based strike fighters there to test their combat capabilities.\nThe problem with the US CAS (Close Air Support) on the modern battlefield of the 21st century is that it is not survivable against immediate frontline distributed AD based on a staggering plethora of advanced and networked hardware such as S1 Pantsir, Tor M2, Buk-M2-3 and AD artillery systems such as Tunguska et al. It will also be severely jammed and denied accurate approach in the absence of GPS. The whole idea that the USAF will be defeated even before it even takes off and then defeated before completion of the mission doesn’t sit well with US generals whose combat record even against supremely inferior enemy is dismal. This is not an exaggeration, it is hard cold reality and that is what drives these sore losers like Hodges into the arms of sheer delusion. Then, let it be no surprise in observing Ben Hodges and his “colleagues” such as Keane, Petraeus and others resorting to the name calling and offering military “advice” which no responsible competent military leader would ever give, especially when having no clue about Russia and her historic warfare experience which dwarfs that of the United States. USMA at West Point used to be a decent engineering school. Not anymore…\nThe US Air Force hasn’t fought any air battles that came anywhere close to peer status since the Battle of Midway in 1942. In the Korean War, the US had 1,172 aircraft in the Pacific to oppose a North Korean People’s Air Force (KPAF) that consisted of only 132 aircraft. While the US and its allies lost 8,540 aircraft during the Vietnam War, almost all of them were lost to anti-aircraft artillery; the North Vietnamese captured four times more South Vietnamese aircraft than they lost during the war: 877 to 159.\nThe great Israeli general Moshe Dayan attributed the formidable reputation of the Israeli Defense Forces to “fighting Arabs”. In like manner, US military might always relied upon the fact that it was fighting armies without air forces. In 47 years, the US Air Force was never once put to the test by its sole rival, the VVS of the Soviet Union.\nSo, for 82 years, the US military enjoyed complete air supremacy over the battlefield. But the relentless advancement of air defense technology has now rendered the modern battlefield unflyable and strategic air-to-ground bombing campaigns impossible. If the NATO air force were to attempt to strike the Russian ground forces the way the Israelis are launching air strikes on Lebanon, it would be wiped out. And Israel can’t enter Iranian or Syrian air space anymore without having its jets shot down.\nSince their primacy was based on the assumption of permanent air supremacy, the NATO militaries are now as barren strategically as their arsenals are empty. But it is clear that the generals and strategists of Clown World haven’t even begun to think through all the implications of the new military realities that the Chinese and Russian practitioners of the art of war have been gradually bringing about in the 25 years since\nUnrestricted Warfare\nwas first published.\nDISCUSS ON SG",
  "tags": [
    "history",
    "technology",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-22T11:33:05+00:00"
}