{
  "url": "https://voxday.net/2024/09/02/the-fear-of-all-conspiracies/",
  "scraped_at": "2026-01-08T19:21:30.147077",
  "title": "The Fear of All Conspiracies",
  "date_display": "September 2, 2024",
  "date_iso": "2024-09-02T12:45:56+00:00",
  "date_from_url": "2024-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James Delingpole explains how experience, and the determination to search for the truth, <a href=\"https://delingpole.substack.com/p/discrediting-our-cause\">will inevitably lead a man</a> to dismiss <em>a priori</em> the Official History of Clown World as it is represented by the mainstream Narrative:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I am now in my late fifties and for most of my life there were various things I believed with absolute certainty: that man had landed (several times) on the moon; that JFK was assassinated by a lone gunman called Lee Harvey Oswald; that the Titanic was sunk by an iceberg; and so on.</p><p>More recently, I have to come to realise that the official narrative on all these events has holes in it even bigger than an iceberg through a reinforced steel hull.</p><p>I achieved this new understanding by the simple process of looking at the evidence. It was hard won knowledge, as knowledge which contradicts the official version of events invariably is. You’re up against a vast, intricate, well-funded system of organised deception. You are not, for example, just going to be able to type into Google ‘Did man really land on the moon?’ because the algorithms are going to be weighted in favour of telling you that man did. So is the publishing industry. So is the entertainment industry – ‘Giant steps are what you take…walking on the moon’, etc. So are all the ‘respectable’ academics and other ‘expert’ talking heads. Yet, put in the hours and you’ll get there in the end because, as the Earl of Oxford and his scriptorium once so famously put it, the truth will out.</p><p>No matter how great the obstacles which have been erected, by conspiratorial design, to prevent you attaining that truth, there’s really only one guaranteed to prevent you from succeeding. That obstacle is the little voice in your head that says: “No, I’m not going to go there. I already know what I know. I don’t need any pesky new evidence which might shake my belief system to its foundations. I’m happy where I am, thank you very much.”</p><p>This is how Normies think. They are unwilling to take the first step on to what Neil Kramer calls the ‘Staircase of Disbelief’ because they understand, if even only on a subconscious level, that once they have done so they can never turn back. It’s not outlandish conspiracy theories they fear. It’s ALL conspiracies – for they understand instinctively that this is a zero sum game.</p></blockquote><p>He’s right. Never attribute to accident, coincidence, or stupidity that which is reasonably explained by the malice of Man’s satanic would-be rulers. I have often observed that the one and only thing we can be absolutely certain did not occur is whatever the Official Story declares to be the case. As a natural follow-on to his rational skepticism about the Official Clown World Mythology, he goes on <a href=\"https://delingpole.substack.com/p/theres-something-you-need-to-know\">to contemplate the bizarre world</a> of what he calls Elite Gender Inversion:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>That goes some way to answering the question “But why would They do it?” They do it for the same reasons They do all the other stuff They do: because they hate us, because they like tormenting us, because it’s a way of confusing us, of manipulating us, and because it’s yet another way to discourage us from reproducing.</p><p>But there’s another reason too and this is maybe the most important one of all: because it’s part of Their religion.</p><p>This is why I keep saying that if you don’t understand the spiritual dimension of what’s happening in the world right now (and has been since forever) then you cannot call yourself truly Awake. I say this not because I’m a Christian (as is, not so surprisingly, Mr E) but because until you realise that everything goes back to age old struggle between the God of the Bible and the Fallen Angels who inspired the Babylonian Mystery Religions you’ll be missing the intellectual, philosophical and religious framework that makes it all make sense.</p><p>All these Hollywood stars pretending to be the opposite sex – and raising their girl children as boys and their boy children as girls; all those US presidents like Obama (and, according to Mr E, every other male president from George Washington onwards – and including Trump) who marry men in drag; they don’t do this crazy stuff just for the shits and giggles, you realise. They do it for the same reasons Christians take communion and try to be more like Christ: because their religion demands it.</p></blockquote><p>I don’t pretend to know who is, and who isn’t, what they purport to be. Is Joe Rogan actually Jo Rogan? Sure, he is extraordinarily short for a man, but what about that male pattern baldness. And I will always think Sandra Bullock is adorable, though I will admit it was a little strange that they had her wearing a little sarong in <em>Miss Congeniality</em> when all the other candidates were in bikinis. I have also thought that Taylor Swift looked weird from the start, and she’s only looking stranger and stranger as time goes on.</p><p>But who is what is not really the point, and Delingpole points us to the salient fact: this is a satanic pagan religion. These elite baphomets are neither male nor female, they are pure non-binary evil. Know that they are wicked, and they are part of the supernatural plan to dethrone God and enslave Man in his sin forever. And they will be successful to a sufficient extent that when the White Rider returns, this time with a sword, he will ride through rivers of blood.</p><p>Our job is to resist them until the divine cavalry arrives. So speak the truth, as best you understand it, and do not fear them or their wicked masters. Because if they were not afraid of us and our King, they would not need to hide in plain sight.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-64334\" decoding=\"async\" fetchpriority=\"high\" height=\"216\" sizes=\"(max-width: 503px) 100vw, 503px\" src=\"https://voxday.net/wp-content/uploads/2024/09/image-7.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/09/image-7.png 503w, https://voxday.net/wp-content/uploads/2024/09/image-7-300x129.png 300w\" width=\"503\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/992180bc-e770-4a9f-8cb2-d777da903dda\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "James Delingpole explains how experience, and the determination to search for the truth,\nwill inevitably lead a man\nto dismiss\na priori\nthe Official History of Clown World as it is represented by the mainstream Narrative:\nI am now in my late fifties and for most of my life there were various things I believed with absolute certainty: that man had landed (several times) on the moon; that JFK was assassinated by a lone gunman called Lee Harvey Oswald; that the Titanic was sunk by an iceberg; and so on.\nMore recently, I have to come to realise that the official narrative on all these events has holes in it even bigger than an iceberg through a reinforced steel hull.\nI achieved this new understanding by the simple process of looking at the evidence. It was hard won knowledge, as knowledge which contradicts the official version of events invariably is. You’re up against a vast, intricate, well-funded system of organised deception. You are not, for example, just going to be able to type into Google ‘Did man really land on the moon?’ because the algorithms are going to be weighted in favour of telling you that man did. So is the publishing industry. So is the entertainment industry – ‘Giant steps are what you take…walking on the moon’, etc. So are all the ‘respectable’ academics and other ‘expert’ talking heads. Yet, put in the hours and you’ll get there in the end because, as the Earl of Oxford and his scriptorium once so famously put it, the truth will out.\nNo matter how great the obstacles which have been erected, by conspiratorial design, to prevent you attaining that truth, there’s really only one guaranteed to prevent you from succeeding. That obstacle is the little voice in your head that says: “No, I’m not going to go there. I already know what I know. I don’t need any pesky new evidence which might shake my belief system to its foundations. I’m happy where I am, thank you very much.”\nThis is how Normies think. They are unwilling to take the first step on to what Neil Kramer calls the ‘Staircase of Disbelief’ because they understand, if even only on a subconscious level, that once they have done so they can never turn back. It’s not outlandish conspiracy theories they fear. It’s ALL conspiracies – for they understand instinctively that this is a zero sum game.\nHe’s right. Never attribute to accident, coincidence, or stupidity that which is reasonably explained by the malice of Man’s satanic would-be rulers. I have often observed that the one and only thing we can be absolutely certain did not occur is whatever the Official Story declares to be the case. As a natural follow-on to his rational skepticism about the Official Clown World Mythology, he goes on\nto contemplate the bizarre world\nof what he calls Elite Gender Inversion:\nThat goes some way to answering the question “But why would They do it?” They do it for the same reasons They do all the other stuff They do: because they hate us, because they like tormenting us, because it’s a way of confusing us, of manipulating us, and because it’s yet another way to discourage us from reproducing.\nBut there’s another reason too and this is maybe the most important one of all: because it’s part of Their religion.\nThis is why I keep saying that if you don’t understand the spiritual dimension of what’s happening in the world right now (and has been since forever) then you cannot call yourself truly Awake. I say this not because I’m a Christian (as is, not so surprisingly, Mr E) but because until you realise that everything goes back to age old struggle between the God of the Bible and the Fallen Angels who inspired the Babylonian Mystery Religions you’ll be missing the intellectual, philosophical and religious framework that makes it all make sense.\nAll these Hollywood stars pretending to be the opposite sex – and raising their girl children as boys and their boy children as girls; all those US presidents like Obama (and, according to Mr E, every other male president from George Washington onwards – and including Trump) who marry men in drag; they don’t do this crazy stuff just for the shits and giggles, you realise. They do it for the same reasons Christians take communion and try to be more like Christ: because their religion demands it.\nI don’t pretend to know who is, and who isn’t, what they purport to be. Is Joe Rogan actually Jo Rogan? Sure, he is extraordinarily short for a man, but what about that male pattern baldness. And I will always think Sandra Bullock is adorable, though I will admit it was a little strange that they had her wearing a little sarong in\nMiss Congeniality\nwhen all the other candidates were in bikinis. I have also thought that Taylor Swift looked weird from the start, and she’s only looking stranger and stranger as time goes on.\nBut who is what is not really the point, and Delingpole points us to the salient fact: this is a satanic pagan religion. These elite baphomets are neither male nor female, they are pure non-binary evil. Know that they are wicked, and they are part of the supernatural plan to dethrone God and enslave Man in his sin forever. And they will be successful to a sufficient extent that when the White Rider returns, this time with a sword, he will ride through rivers of blood.\nOur job is to resist them until the divine cavalry arrives. So speak the truth, as best you understand it, and do not fear them or their wicked masters. Because if they were not afraid of us and our King, they would not need to hide in plain sight.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "judeo-christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-02T12:45:58+00:00"
}