{
  "url": "https://voxday.net/2024/09/01/when-retconning-works/",
  "scraped_at": "2026-01-08T19:21:24.631426",
  "title": "When Retconning Works",
  "date_display": "September 1, 2024",
  "date_iso": "2024-09-01T19:01:42+00:00",
  "date_from_url": "2024-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Inverse contemplates <a href=\"https://www.inverse.com/entertainment/tolkien-canon-hunt-for-gollum\">the retconnning of Gollum</a>:</em></p><p>In the 1937 version, Gollum is just a weird creature.</p><p>From the original <em>Hobbit </em>(1937):</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>But funnily enough he [Bilbo] need not have been alarmed. For one thing Gollum had learned long ago was to never cheat at the riddle-game, which is a sacred one and of immense antiquity.</em></p></blockquote><p>From the revised <em>Hobbit</em> (1951, 1965, et al.):</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>He knew of course, the riddle-game was sacred and of immense antiquity and even wicked creatures were afraid to cheat when they played it. But he [Bilbo] felt he could not trust this slimy thing [Gollum] to keep any promise at a pinch. Any excuse would do for him to slide out of it. And after all that last question had not been a genuine riddle according to the ancient laws.”</em></p></blockquote><p>Tolkien tinkered with “Riddles in the Dark” up until 1966, making him something of a George Lucas; continually modifying his story to fit with his other books.In the first, 1937 <em>Hobbit</em>, Gollum’s love of the Ring isn’t connected to any, deeper, sinister meaning. Tolkien initially mentioned in passing that “…if you slipped the ring on your finger, you were invisible…”. But in the 1951 revisions, when Gollum’s attitude became more intense, it became a “ring of power,” and the after-effects of using the ring would make you “shaky and faint.”</p><p>Without Tolkien utterly revising Gollum — and thus, revising the Ring — nothing about <em>The Lord of the Rings</em> would make sense, and arguably, the entirety of Middle-earth would be far less interesting. If Gollum had remained a curious, silly little creature who possessed a whimsical magic ring, it’s doubtful we’d all be obsessed with this wonderful fantasy world today. It’s also unlikely that, had Tolkien not utterly retconned Gollum and the One Ring, we’d even be talking about the careers of Peter Jackson and Andy Serkis.</p><p>So while the impending creation of <em>The Hunt for Gollum</em> might, for some, feel like a strange, unnecessary prequel at best (and a blasphemous retcon at worst), there is a massive and pivotal precedent to mess with Gollum’s story, straight from Professor Tolkien himself.</p><div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container is-layout-constrained wp-block-group-is-layout-constrained\"><p><em><a href=\"https://social.infogalactic.com/micropost/9f28fa65-2681-4639-b127-7d98c2f99ddc\">DISCUSS ON SG</a></em></p></div></div></div>",
  "content_text": "Inverse contemplates\nthe retconnning of Gollum\n:\nIn the 1937 version, Gollum is just a weird creature.\nFrom the original\nHobbit\n(1937):\nBut funnily enough he [Bilbo] need not have been alarmed. For one thing Gollum had learned long ago was to never cheat at the riddle-game, which is a sacred one and of immense antiquity.\nFrom the revised\nHobbit\n(1951, 1965, et al.):\nHe knew of course, the riddle-game was sacred and of immense antiquity and even wicked creatures were afraid to cheat when they played it. But he [Bilbo] felt he could not trust this slimy thing [Gollum] to keep any promise at a pinch. Any excuse would do for him to slide out of it. And after all that last question had not been a genuine riddle according to the ancient laws.”\nTolkien tinkered with “Riddles in the Dark” up until 1966, making him something of a George Lucas; continually modifying his story to fit with his other books.In the first, 1937\nHobbit\n, Gollum’s love of the Ring isn’t connected to any, deeper, sinister meaning. Tolkien initially mentioned in passing that “…if you slipped the ring on your finger, you were invisible…”. But in the 1951 revisions, when Gollum’s attitude became more intense, it became a “ring of power,” and the after-effects of using the ring would make you “shaky and faint.”\nWithout Tolkien utterly revising Gollum — and thus, revising the Ring — nothing about\nThe Lord of the Rings\nwould make sense, and arguably, the entirety of Middle-earth would be far less interesting. If Gollum had remained a curious, silly little creature who possessed a whimsical magic ring, it’s doubtful we’d all be obsessed with this wonderful fantasy world today. It’s also unlikely that, had Tolkien not utterly retconned Gollum and the One Ring, we’d even be talking about the careers of Peter Jackson and Andy Serkis.\nSo while the impending creation of\nThe Hunt for Gollum\nmight, for some, feel like a strange, unnecessary prequel at best (and a blasphemous retcon at worst), there is a massive and pivotal precedent to mess with Gollum’s story, straight from Professor Tolkien himself.\nDISCUSS ON SG",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-09-01T19:01:44+00:00"
}