{
  "url": "https://voxday.net/2025/07/17/about-that-analytical-thinking/",
  "scraped_at": "2026-01-08T20:25:37.761136",
  "title": "About That “Analytical Thinking”",
  "date_display": "July 17, 2025",
  "date_iso": "2025-07-17T12:06:24+00:00",
  "date_from_url": "2025-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A lot of people <a href=\"https://studyfinds.org/why-many-americans-still-think-darwin-was-wrong-on-evolution-yet-british-dont/\">are going to be in for a very unpleasant surprise</a> once the Narrative finally accepts that the neo-Darwinian theory of evolution by natural selection and various other epicycles is a complete and utter nonstarter:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>According to thinktank Pew Research Center data from 2020, only 64% of Americans accept that “humans and other living things have evolved over time.” Meanwhile, 73% of Brits are fine with the idea that they share a common ancestor with chimpanzees. That nine-percentage-point gap might not sound like much, but it represents millions of people who think Charles Darwin was peddling fake news.</p><p>From 1985 to 2010, Americans were in what researchers call a statistical dead heat between acceptance and rejection of evolution — which is academic speak for people couldn’t decide if we were descended from apes or Adam and Eve..</p><p>Here’s where things get psychologically fascinating. Research into misinformation and cognitive biases suggests that fundamentalism operates on a principle known as motivated reasoning. This means selectively interpreting evidence to reach predetermined conclusions. And a 2018 review of social and computer science research also found that fake news seems to spread because it confirms what people already want to believe.</p><p>Evolution denial may work the same way. Religious fundamentalism is what researchers call “the strongest predictor” for rejection of evolution. A 2019 study of 900 participants found that belief in fake news headlines was associated with delusionality, dogmatism, religious fundamentalism and reduced analytic thinking.</p><p>High personal religiosity, as seen in the U.S., reinforced by communities of like-minded believers, can create resistance to evolutionary science. This pattern is pronounced among Southern Baptists — the largest Protestant denomination in the US — where 61% believe the Bible is the literal word of God, compared to 31% of Americans overall. The persistence of this conflict is fueled by organized creationist movements that reinforce religious skepticism.</p><p>Brain imaging studies show that people with fundamentalist beliefs seem to have reduced activity in the dorsolateral prefrontal cortex — the brain region responsible for cognitive flexibility and analytical thinking. When this area is damaged or less active, people become more prone to accepting claims without sufficient evidence and show increased resistance to changing their beliefs when presented with contradictory information. Studies of brain-injured patients show damage to prefrontal networks that normally help us question information may lead to increased fundamentalist beliefs and reduced skepticism.</p></blockquote><p>This is the midwit’s customary pseudo-scientific attempt to appeal to the nonexistent authority of SCIENCE, or rather, scientistry. Of course, as I demonstrated in copious detail <a href=\"https://unauthorized.tv/video/927725/\">on last night’s Darkstream</a>, with the assistance of ChatGPI, there is absolutely no way evolutionary biologists can argue that all of the evolutionary mechanisms they can invent can even begin to account for human genetic diversity due to the material constraints on human reproduction that their models do not even begin to take into account.</p><p><em>The logistics of human reproduction and descent limit how fast any allele can spread, no matter how advantageous. Selection might determine whether a mutation survives, but demographics determine whether it fixates—and your point is that Genghis Khan sets the upper bound, which is still far below what fixation would require. Fixation in humans in &lt;40 generations is, barring some extreme and hypothetical bottleneck, essentially impossible.</em></p><p>No wonder the scientists are all so terrified of artificial intelligence. It is methodically eliminating their ability to snow the masses and demolishing their most cherished false narratives.</p><p><em><a href=\"https://socialgalactic.com/micropost/7bdbd69e-8a2e-48e5-a922-7e771880c173\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A lot of people\nare going to be in for a very unpleasant surprise\nonce the Narrative finally accepts that the neo-Darwinian theory of evolution by natural selection and various other epicycles is a complete and utter nonstarter:\nAccording to thinktank Pew Research Center data from 2020, only 64% of Americans accept that “humans and other living things have evolved over time.” Meanwhile, 73% of Brits are fine with the idea that they share a common ancestor with chimpanzees. That nine-percentage-point gap might not sound like much, but it represents millions of people who think Charles Darwin was peddling fake news.\nFrom 1985 to 2010, Americans were in what researchers call a statistical dead heat between acceptance and rejection of evolution — which is academic speak for people couldn’t decide if we were descended from apes or Adam and Eve..\nHere’s where things get psychologically fascinating. Research into misinformation and cognitive biases suggests that fundamentalism operates on a principle known as motivated reasoning. This means selectively interpreting evidence to reach predetermined conclusions. And a 2018 review of social and computer science research also found that fake news seems to spread because it confirms what people already want to believe.\nEvolution denial may work the same way. Religious fundamentalism is what researchers call “the strongest predictor” for rejection of evolution. A 2019 study of 900 participants found that belief in fake news headlines was associated with delusionality, dogmatism, religious fundamentalism and reduced analytic thinking.\nHigh personal religiosity, as seen in the U.S., reinforced by communities of like-minded believers, can create resistance to evolutionary science. This pattern is pronounced among Southern Baptists — the largest Protestant denomination in the US — where 61% believe the Bible is the literal word of God, compared to 31% of Americans overall. The persistence of this conflict is fueled by organized creationist movements that reinforce religious skepticism.\nBrain imaging studies show that people with fundamentalist beliefs seem to have reduced activity in the dorsolateral prefrontal cortex — the brain region responsible for cognitive flexibility and analytical thinking. When this area is damaged or less active, people become more prone to accepting claims without sufficient evidence and show increased resistance to changing their beliefs when presented with contradictory information. Studies of brain-injured patients show damage to prefrontal networks that normally help us question information may lead to increased fundamentalist beliefs and reduced skepticism.\nThis is the midwit’s customary pseudo-scientific attempt to appeal to the nonexistent authority of SCIENCE, or rather, scientistry. Of course, as I demonstrated in copious detail\non last night’s Darkstream\n, with the assistance of ChatGPI, there is absolutely no way evolutionary biologists can argue that all of the evolutionary mechanisms they can invent can even begin to account for human genetic diversity due to the material constraints on human reproduction that their models do not even begin to take into account.\nThe logistics of human reproduction and descent limit how fast any allele can spread, no matter how advantageous. Selection might determine whether a mutation survives, but demographics determine whether it fixates—and your point is that Genghis Khan sets the upper bound, which is still far below what fixation would require. Fixation in humans in <40 generations is, barring some extreme and hypothetical bottleneck, essentially impossible.\nNo wonder the scientists are all so terrified of artificial intelligence. It is methodically eliminating their ability to snow the masses and demolishing their most cherished false narratives.\nDISCUSS ON SG",
  "tags": [
    "AI",
    "Darkstream",
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-17T12:06:26+00:00"
}