{
  "url": "https://voxday.net/2025/07/11/correction-6/",
  "scraped_at": "2026-01-08T20:24:58.025217",
  "title": "Correction",
  "date_display": "July 11, 2025",
  "date_iso": "2025-07-11T09:27:00+00:00",
  "date_from_url": "2025-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The LA Review of Books</em> <a href=\"https://lareviewofbooks.org/article/reactionary-futurism-2025/\">simply doesn’t know how to read</a> and doesn’t know what it is talking about.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Far Right believes that the future belongs to them. In much reactionary discourse, only white men have any meaningful ability to imagine the future. According to this worldview, white people possess a racially unique capacity for speculation, including rational planning, counterfactual imagination, and inspired innovation. At the same time, the Far Right claims that only white men have the discipline, intelligence, and foresight to realize this future. This ideology holds that whiteness is a potential for greatness, including the inborn ability to build a high-tech society. In other words, whiteness is speculative to the alt-right: it possesses a promissory value far in excess of any white men’s actual achievements. Some fascist thinkers have gone so far as to suggest that science fiction is an inherently white genre. For example, Theodore Beale (a.k.a. Vox Day), the leader of the Rabid Puppies fan group, claimed that increased racial diversity would ruin the genre because, in his view, people of color could not possibly understand the achievements of white science fiction authors. Despite the widespread success of speculative authors of color in recent decades, there are fascists who hold that nonwhite people are genetically incapable of imagining and inhabiting science-fictional futures.</p></blockquote><ol class=\"wp-block-list\"><li>The future does belong to the so-called “Far Right”. The Left and the Center-Right subscribe to observably and objectively false beliefs, don’t have enough children to replace themselves, don’t have any lasting principles, and can’t even tell the difference between a man and a woman anymore. Their ideas and philosophies are not only bankrupt, they are literally dying out.</li><li>The entire history of the world clearly demonstrates that only European people create and maintain European-style societies and civilizations. Any Post-European North American societies will bear as little resemblance to America as America did to the pre-European native tribal societies. This really isn’t that hard. That being said, the future is actually much more likely to be dominated by a Chinese “Far Right” than a white one given the military, industrial, and technological trends, mostly because China is not infected with either Enlightenment values or a satanic elite. The dirt is not, and has never been, magic.</li><li>Science fiction is, and has always been, an inherently white male genre. There were virtually no female authors who qualified to join SFWA until the bylaws were changed to permit fantasy authors to join it. Diversity and inclusion have devastated the science fiction world, to the point that none of the current nominees for the various science fiction awards even qualifies as science fiction of any kind. There is nothing wrong with the fantasy romances that female authors prefer to write, but they aren’t science fiction even if Tor or some other former SF publisher attempts to market them as such.</li><li>I claimed that increased racial diversity would ruin the genre and I have been proven absolutely correct. There is no objective metric by which it can be claimed that diversity and inclusion have improved it in any way. Fewer readers, lower average advances, fewer book sales, fewer authors published by publishers, fewer bestsellers, and so forth. Diversity and inclusion are not the only cause of the decline, but they have observably contributed to it.</li><li>It is not my view that people of color could not possibly understand the achievements of white science fiction authors. Whether people of color can understand those achievements or not is irrelevant, the point is that they are not interested in replicating them. It is, however, my observation that N.K. Jemisin, the affirmative-action author donated multiple Hugo awards for Best Science Fiction novel for her remarkable feat of writing while black and female, declared <em>“Speculative fiction is at its core syncretic; this stuff doesn’t come out of nowhere. And it certainly didn’t spring solely from the imaginations of a bunch of beardy old middle-class middle-American guys in the 1950s.”</em> Perhaps, but science fiction definitely isn’t springing from the non-white, non-male, diverse authors of the 2020s because they prefer writing non-science fiction works. Are we seriously supposed to pretend this wasn’t obvious from the start?</li><li>Also, I’m not a fascist. If I were, I very much doubt I would be a welcome guest on CGTN. I’m not a communist either, but one could at least produce a modicum of evidence for that.</li><li>What widespread success? If all of these award-winning authors of color are so successful, why are they constantly crying about their lack of book sales on social media?</li></ol><p><em><a href=\"https://socialgalactic.com/micropost/3de1195f-4d71-4248-ae52-c9ba49e7c4d3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The LA Review of Books\nsimply doesn’t know how to read\nand doesn’t know what it is talking about.\nThe Far Right believes that the future belongs to them. In much reactionary discourse, only white men have any meaningful ability to imagine the future. According to this worldview, white people possess a racially unique capacity for speculation, including rational planning, counterfactual imagination, and inspired innovation. At the same time, the Far Right claims that only white men have the discipline, intelligence, and foresight to realize this future. This ideology holds that whiteness is a potential for greatness, including the inborn ability to build a high-tech society. In other words, whiteness is speculative to the alt-right: it possesses a promissory value far in excess of any white men’s actual achievements. Some fascist thinkers have gone so far as to suggest that science fiction is an inherently white genre. For example, Theodore Beale (a.k.a. Vox Day), the leader of the Rabid Puppies fan group, claimed that increased racial diversity would ruin the genre because, in his view, people of color could not possibly understand the achievements of white science fiction authors. Despite the widespread success of speculative authors of color in recent decades, there are fascists who hold that nonwhite people are genetically incapable of imagining and inhabiting science-fictional futures.\nThe future does belong to the so-called “Far Right”. The Left and the Center-Right subscribe to observably and objectively false beliefs, don’t have enough children to replace themselves, don’t have any lasting principles, and can’t even tell the difference between a man and a woman anymore. Their ideas and philosophies are not only bankrupt, they are literally dying out.\nThe entire history of the world clearly demonstrates that only European people create and maintain European-style societies and civilizations. Any Post-European North American societies will bear as little resemblance to America as America did to the pre-European native tribal societies. This really isn’t that hard. That being said, the future is actually much more likely to be dominated by a Chinese “Far Right” than a white one given the military, industrial, and technological trends, mostly because China is not infected with either Enlightenment values or a satanic elite. The dirt is not, and has never been, magic.\nScience fiction is, and has always been, an inherently white male genre. There were virtually no female authors who qualified to join SFWA until the bylaws were changed to permit fantasy authors to join it. Diversity and inclusion have devastated the science fiction world, to the point that none of the current nominees for the various science fiction awards even qualifies as science fiction of any kind. There is nothing wrong with the fantasy romances that female authors prefer to write, but they aren’t science fiction even if Tor or some other former SF publisher attempts to market them as such.\nI claimed that increased racial diversity would ruin the genre and I have been proven absolutely correct. There is no objective metric by which it can be claimed that diversity and inclusion have improved it in any way. Fewer readers, lower average advances, fewer book sales, fewer authors published by publishers, fewer bestsellers, and so forth. Diversity and inclusion are not the only cause of the decline, but they have observably contributed to it.\nIt is not my view that people of color could not possibly understand the achievements of white science fiction authors. Whether people of color can understand those achievements or not is irrelevant, the point is that they are not interested in replicating them. It is, however, my observation that N.K. Jemisin, the affirmative-action author donated multiple Hugo awards for Best Science Fiction novel for her remarkable feat of writing while black and female, declared\n“Speculative fiction is at its core syncretic; this stuff doesn’t come out of nowhere. And it certainly didn’t spring solely from the imaginations of a bunch of beardy old middle-class middle-American guys in the 1950s.”\nPerhaps, but science fiction definitely isn’t springing from the non-white, non-male, diverse authors of the 2020s because they prefer writing non-science fiction works. Are we seriously supposed to pretend this wasn’t obvious from the start?\nAlso, I’m not a fascist. If I were, I very much doubt I would be a welcome guest on CGTN. I’m not a communist either, but one could at least produce a modicum of evidence for that.\nWhat widespread success? If all of these award-winning authors of color are so successful, why are they constantly crying about their lack of book sales on social media?\nDISCUSS ON SG",
  "tags": [
    "books",
    "media",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-11T15:30:08+00:00"
}