{
  "url": "https://voxday.net/2025/07/19/on-self-determination-and-failed-rhetoric/",
  "scraped_at": "2026-01-08T20:25:53.938519",
  "title": "On Self-Determination and Failed Rhetoric",
  "date_display": "July 19, 2025",
  "date_iso": "2025-07-19T19:14:45+00:00",
  "date_from_url": "2025-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We are told that Taiwan is an international flash point and the USA is honor-bound to defend Tawian against reunification with the mainland because, and I quote: <em>“Taiwan’s 23 million people deserve self-determination”</em>.</p><p>Why didn’t the 9,103,332 people of the Confederate States of America deserve self-determination?</p><p>Why don’t the 4,543,126 people of Palestine deserve self-determination?</p><p>Why didn’t the 10.3 million people of the separatist oblasts of Ukraine deserve self-determination?</p><p>Why don’t the 8,012,231 people of Catalunya deserve self-determination?</p><p>Self-determination is just another Enlightenment inversion. It means that Clown World will claim it is a <em>casus belli</em> whenever it wants a war, and use military force to deny whenever it fears losing control. Unless the USA is going to go to war with Israel, Ukraine, and Spain, and permit the former-Confederate states to depart the Union in peace, it has absolutely no business claiming any right or responsibility to “defend” one part of China from the rest of it.</p><p><em><a href=\"https://socialgalactic.com/micropost/2f4e9d4e-dbd6-45a9-83f2-8323174ad806\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We are told that Taiwan is an international flash point and the USA is honor-bound to defend Tawian against reunification with the mainland because, and I quote:\n“Taiwan’s 23 million people deserve self-determination”\n.\nWhy didn’t the 9,103,332 people of the Confederate States of America deserve self-determination?\nWhy don’t the 4,543,126 people of Palestine deserve self-determination?\nWhy didn’t the 10.3 million people of the separatist oblasts of Ukraine deserve self-determination?\nWhy don’t the 8,012,231 people of Catalunya deserve self-determination?\nSelf-determination is just another Enlightenment inversion. It means that Clown World will claim it is a\ncasus belli\nwhenever it wants a war, and use military force to deny whenever it fears losing control. Unless the USA is going to go to war with Israel, Ukraine, and Spain, and permit the former-Confederate states to depart the Union in peace, it has absolutely no business claiming any right or responsibility to “defend” one part of China from the rest of it.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "history",
    "rhetoric",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-20T00:04:08+00:00"
}