{
  "url": "https://voxday.net/2025/07/25/rhetoric-and-pride/",
  "scraped_at": "2026-01-08T20:26:33.149819",
  "title": "Rhetoric and Pride",
  "date_display": "July 25, 2025",
  "date_iso": "2025-07-25T16:31:52+00:00",
  "date_from_url": "2025-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always fascinating to see how those inclined toward rhetoric will always find a way to declare something to be bad, even if it requires a complete inversion of common, every-day terminology. This exchange was in the comments in Sigma Game, after I made <a href=\"https://sigmagame.substack.com/p/there-is-no-emotional-safety\">an observation that applies generally</a> to a large class of people.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>EM: <em>Nothing like painting with a broad brush, lol. I’ve never met anyone so certain of every single thing they say.</em></p><p>VD: That’s because if I’m not certain, I don’t say anything. You should try it.</p><p>EM: <em>Only a fool is so certain of every single thing they say. I hope you hear the pride in your own words. That is a dangerous stance, my friend. Humility would be a good medicine.</em></p><p>VD: You have it completely backwards. Only a fool blurts out his thoughts when he knows little and opines in ignorance. I have 22 years of daily experience with hundreds of people who dislike me intensely dissecting every single word I write in order to discredit me or expose any weakness in my arguments. There is no pride in knowing when to speak and when to remain silent. What you mistake for pride is just absolute confidence based on the experience of having been repeatedly challenged and tested over a period of decades.</p></blockquote><p>Now, obviously even the local midwits know perfectly well what’s going on here. But the interesting thing is the way that the rhetorical attacker doesn’t hesitate to invert the idea that remaining reticent about sharing one’s opinion and refusing to opine in ignorance is somehow based in pride rather than intellectual humility and the recognition that one’s opinion might well be wrong.</p><p>For example, I was very hesitant to do more than ask questions when I happened to notice the first anomalies in evolutionary scientistry, such as the inability of biologists, professors, and teachers to understand the concept that there not only is an average rate of evolution by natural selection, but that there absolutely has to be. Even after that first glimpse of innumeracy and philosophical inepititude, ittook years of cautious inquiry and detailed reading of various papers and books  before I was confident enough in my reasoning, certain enough in my conclusions, to publicly challenge the likes of JF Gariepy and point out the mathematical impossibility of mainstream evolutionary theory.</p><p>And now, of course, all of those evolutionists who were so eager to lecture me on a subject they presumed I did not understand not only don’t want to answer any of my questions anymore, they are in full retreat from the very strong point they have defended for decades.</p><p>I am referring here, of course, to their headlong retreat to randomness, which is vastly amusing to anyone who recalls Dawkins’s passionate, but inept, attempt to argue that natural selection “is the very opposite of random”.</p><p>Those who have been here since 2008 will also notice that I no longer attempt to calculate the impact of debt on the economy despite a respectable past record. That’s because I don’t have the relevant information anymore; the Federal Reserve’s changes to its reporting has deprived me of the data I require to even begin formulating an opinion. So, I don’t say anything because I don’t know anything.</p><p>But to the rhetorical, intellectual humility can be pride for the same reason that black can be white and war can be peace. Because there is no information content in rhetoric, it’s merely an attempt to emotionally manipulate other individuals.</p><p><em><a href=\"https://socialgalactic.com/micropost/7fa022ff-4fee-46a2-8307-1b3300f338ca\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s always fascinating to see how those inclined toward rhetoric will always find a way to declare something to be bad, even if it requires a complete inversion of common, every-day terminology. This exchange was in the comments in Sigma Game, after I made\nan observation that applies generally\nto a large class of people.\nEM:\nNothing like painting with a broad brush, lol. I’ve never met anyone so certain of every single thing they say.\nVD: That’s because if I’m not certain, I don’t say anything. You should try it.\nEM:\nOnly a fool is so certain of every single thing they say. I hope you hear the pride in your own words. That is a dangerous stance, my friend. Humility would be a good medicine.\nVD: You have it completely backwards. Only a fool blurts out his thoughts when he knows little and opines in ignorance. I have 22 years of daily experience with hundreds of people who dislike me intensely dissecting every single word I write in order to discredit me or expose any weakness in my arguments. There is no pride in knowing when to speak and when to remain silent. What you mistake for pride is just absolute confidence based on the experience of having been repeatedly challenged and tested over a period of decades.\nNow, obviously even the local midwits know perfectly well what’s going on here. But the interesting thing is the way that the rhetorical attacker doesn’t hesitate to invert the idea that remaining reticent about sharing one’s opinion and refusing to opine in ignorance is somehow based in pride rather than intellectual humility and the recognition that one’s opinion might well be wrong.\nFor example, I was very hesitant to do more than ask questions when I happened to notice the first anomalies in evolutionary scientistry, such as the inability of biologists, professors, and teachers to understand the concept that there not only is an average rate of evolution by natural selection, but that there absolutely has to be. Even after that first glimpse of innumeracy and philosophical inepititude, ittook years of cautious inquiry and detailed reading of various papers and books  before I was confident enough in my reasoning, certain enough in my conclusions, to publicly challenge the likes of JF Gariepy and point out the mathematical impossibility of mainstream evolutionary theory.\nAnd now, of course, all of those evolutionists who were so eager to lecture me on a subject they presumed I did not understand not only don’t want to answer any of my questions anymore, they are in full retreat from the very strong point they have defended for decades.\nI am referring here, of course, to their headlong retreat to randomness, which is vastly amusing to anyone who recalls Dawkins’s passionate, but inept, attempt to argue that natural selection “is the very opposite of random”.\nThose who have been here since 2008 will also notice that I no longer attempt to calculate the impact of debt on the economy despite a respectable past record. That’s because I don’t have the relevant information anymore; the Federal Reserve’s changes to its reporting has deprived me of the data I require to even begin formulating an opinion. So, I don’t say anything because I don’t know anything.\nBut to the rhetorical, intellectual humility can be pride for the same reason that black can be white and war can be peace. Because there is no information content in rhetoric, it’s merely an attempt to emotionally manipulate other individuals.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-25T16:31:54+00:00"
}