{
  "url": "https://voxday.net/2025/07/24/rip-julian-lefay/",
  "scraped_at": "2026-01-08T20:26:20.256645",
  "title": "RIP Julian LeFay",
  "date_display": "July 24, 2025",
  "date_iso": "2025-07-24T12:23:55+00:00",
  "date_from_url": "2025-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Legendary Elder Scrolls creator Julian LeFay passes away at 59. Julian LeFay, the designer largely credited with helping shape the vision of fan favorite Elder Scrolls franchise, has passed away at the age of 59.</em></p><p>This is a hard one to hear. I was friends with Bennie for years, and it will probably surprise a lot of people to learn that we even worked together for 18 months on what was supposed to be a launch title for the Sega Dreamcast.</p><p>He left Bethesda to come work for Fenris Wolf after we signed a $1.5 million deal with Sega to provide its first RPG for its new Katana system after our original producer at GT moved to Sega of America and made signing us one of his first orders of business. I’d licensed the rights to <em>Traveller</em> from Marc Miller, and Julian was not only tired of working at Bethesda after his friend Vijay had left for Microsoft, but was very excited to take his innovative design concepts into a science fiction space for the first time.</p><p>And, of course, he liked the idea of working with me and my partner, as we’d hung out together at various CGDCs and E3s for four or five years by that point. He, Vijay, Bobby Prince from id, and Carter from Spectrum Holobyte were the people I spent the most time with at the Westin and the various other locations outside of the CGW crew.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-68134\" decoding=\"async\" fetchpriority=\"high\" height=\"288\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/07/image-14.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/07/image-14.png 512w, https://voxday.net/wp-content/uploads/2025/07/image-14-300x169.png 300w\" width=\"512\"/></figure></div><p>Unfortunately, Sega of Japan eliminated Sega of America and cancelled all ten launch titles that SOA had in development, including ours, about one year prior to the launch of the Dreamcast, in favor of spending the $100 million that had been budgeted for those games on putting the Dreamcast logo on the front of the Arsenal FC jerseys. This was, of course, a terrible decision that was much-mocked in the industry, and helped contribute to the failure of the Dreamcast to compete with the original Sony PlayStation despite its technical superiorities.</p><p>I still remember Julian, Kurt (from SOA) and I laughing about the fake headline in a parody newsletter given out at CGDC that read: “SEGA REFUSES TO REVEAL PLANS FOR SELF-IMMOLATION” or something to that effect. It wasn’t quite so funny when I got the phone call from Kurt telling me that a) he had been let go, b) SOA was being shut down by SOJ, and c) <em>Traveller</em> was canceled. In retrospect, that was the beginning of the end for my time in the game industry, as GT’s collapse followed Sega of America’s by about 18 months.</p><p>So Julian and I never finished our game. We talked once or twice about possibly working together, and I think he ended up getting back together with Vijay toward the end, but things never managed to quite work out. It’s truly a pity, because I think that what we could have – what we WOULD have – achieved would have been truly epic, in fact, more epic than Epic.</p><p>It is truly the end of an era. Julian LeFay is gone, but he should never be forgotten by the gaming community. He never received the plaudits of Richard Garriott, John Romero, or Sid Meier, but he was genuinely one of the great designers of the era. He always imagined things on a larger scope than most of us were able to conceptualize. He set the standard for complex randomized environments and laid some of the conceptual foundations for both the MMO and all modern games that incorporate random elements as part of their design.</p><p><em><a href=\"https://socialgalactic.com/micropost/948029ac-22c5-4712-8e3a-44aa32fbd459\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Legendary Elder Scrolls creator Julian LeFay passes away at 59. Julian LeFay, the designer largely credited with helping shape the vision of fan favorite Elder Scrolls franchise, has passed away at the age of 59.\nThis is a hard one to hear. I was friends with Bennie for years, and it will probably surprise a lot of people to learn that we even worked together for 18 months on what was supposed to be a launch title for the Sega Dreamcast.\nHe left Bethesda to come work for Fenris Wolf after we signed a $1.5 million deal with Sega to provide its first RPG for its new Katana system after our original producer at GT moved to Sega of America and made signing us one of his first orders of business. I’d licensed the rights to\nTraveller\nfrom Marc Miller, and Julian was not only tired of working at Bethesda after his friend Vijay had left for Microsoft, but was very excited to take his innovative design concepts into a science fiction space for the first time.\nAnd, of course, he liked the idea of working with me and my partner, as we’d hung out together at various CGDCs and E3s for four or five years by that point. He, Vijay, Bobby Prince from id, and Carter from Spectrum Holobyte were the people I spent the most time with at the Westin and the various other locations outside of the CGW crew.\nUnfortunately, Sega of Japan eliminated Sega of America and cancelled all ten launch titles that SOA had in development, including ours, about one year prior to the launch of the Dreamcast, in favor of spending the $100 million that had been budgeted for those games on putting the Dreamcast logo on the front of the Arsenal FC jerseys. This was, of course, a terrible decision that was much-mocked in the industry, and helped contribute to the failure of the Dreamcast to compete with the original Sony PlayStation despite its technical superiorities.\nI still remember Julian, Kurt (from SOA) and I laughing about the fake headline in a parody newsletter given out at CGDC that read: “SEGA REFUSES TO REVEAL PLANS FOR SELF-IMMOLATION” or something to that effect. It wasn’t quite so funny when I got the phone call from Kurt telling me that a) he had been let go, b) SOA was being shut down by SOJ, and c)\nTraveller\nwas canceled. In retrospect, that was the beginning of the end for my time in the game industry, as GT’s collapse followed Sega of America’s by about 18 months.\nSo Julian and I never finished our game. We talked once or twice about possibly working together, and I think he ended up getting back together with Vijay toward the end, but things never managed to quite work out. It’s truly a pity, because I think that what we could have – what we WOULD have – achieved would have been truly epic, in fact, more epic than Epic.\nIt is truly the end of an era. Julian LeFay is gone, but he should never be forgotten by the gaming community. He never received the plaudits of Richard Garriott, John Romero, or Sid Meier, but he was genuinely one of the great designers of the era. He always imagined things on a larger scope than most of us were able to conceptualize. He set the standard for complex randomized environments and laid some of the conceptual foundations for both the MMO and all modern games that incorporate random elements as part of their design.\nDISCUSS ON SG",
  "tags": [
    "games",
    "history",
    "RIP"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-24T12:23:56+00:00"
}