{
  "url": "https://voxday.net/2025/07/10/shots-fired-shots-fired/",
  "scraped_at": "2026-01-08T20:24:52.519185",
  "title": "Shots Fired! Shots Fired!",
  "date_display": "July 10, 2025",
  "date_iso": "2025-07-10T15:16:22+00:00",
  "date_from_url": "2025-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Much like the way the air grows still and the sky takes on a greenish tinge, <a href=\"https://fandompulse.substack.com/p/who-can-write-a-monster-hunter-international\">one can almost feel the inevitable Facebook rant</a> coming.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>With Larry Correia announcing he would be launching a Kickstarter for his new Ark Press venture, a Baen Books insider reached out to Fandom Pulse to vent how similar the series seemed to their hit with him, Monster Hunter International. With Correia taking his own successful work and doing a spin on it for Ark Press, one has to wonder with AI writing becoming as good as it is, who can do MHI better: AI, or Larry Correia himself?</p><p>Artificial Intelligence has become increasingly good at writing with giant leaps up in the technological prowess over the last year, especially with the help of Claude Sonnet and Claude Opus 4.0 delivering prose levels many never thought possible.</p><p>Vox Day has been experimenting with AI to no small degree, making full albums out of music on Suno and testing the capabilities on short stories ranging from styles of Neil Gaiman, to John Scalzi, and even Larry Correia, pioneering the future in AI art.</p><p>Meanwhile, in traditional publishing, it appears as if Baen Books is in massive trouble as Correia sees the proverbial writing on the wall and has taken moves to diversify out of his long-time publisher and now announced he’s going to be kickstarting a series, American Paladin, that sounds very similar to Monster Hunter International, his long-time gun urban fantasy series that’s been a hit with Baen over the years.</p><p>Ark Press, his new publisher which is owned by mega-billionaire Peter Thiel, seemed to want an MHI-style story out of Correia to launch the press, and they’ve advertised its similarities as well.</p><p>Since Correia is taking his hit series and giving a new take on it, the question is, can AI build a better modern iteration of MHI than Larry Correia himself can given its new found prowess?</p><p>Vox Day has already been working on this with a serialized novel called Monster Control Inc. In this, he’s trained AI to write in Larry Correia’s style to provide a signature version that reads enough like Correia that if you didn’t know it was written by AI, you might think it’s Correia’s novels.</p></blockquote><p>Just to be clear, <em>Monster Control Incorporated</em> utilizes a judicious blend of literary seasonings, one of which is Larry Correia’s. But because the objective was to utilize a Gamma protagonist, and since Larry is the most Delta author who ever wrote a Delta self-insert since Louis Lamour laid down his prolific pen, it was necessary to bring in other elements in order to capture that inimitable Gamma snark, passive-aggressiveness, and relentless obsession with unattainable women.</p><p>I also didn’t think that Larry’s signature gun porn was desirable in this case, although I certainly did utilize that in my non-AI Quantum Mortis novel, <em>A Man Disrupted</em>, and to such an extent that more than one review even asserted that I had outcorreia’d Correia himself, although I think that was not actually true and was merely an overenthusiastic response to my incorporation of orbital artillery into a police procedural.</p><p>It will be an interesting test, though. Can one of the leading critics of textual AI write a better pastiche of his own style than an AI can? <a href=\"https://sigmagame.substack.com/p/gamma-fiction\">Read Monster Control Incorporated</a> and find out!</p><p><em>I’ve been walking my crush home since last week to protect her from all the creeps walking around. Next week I’m going to introduce myself to her.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/1e098f7c-88bb-4761-b071-11e981ef9f88\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Much like the way the air grows still and the sky takes on a greenish tinge,\none can almost feel the inevitable Facebook rant\ncoming.\nWith Larry Correia announcing he would be launching a Kickstarter for his new Ark Press venture, a Baen Books insider reached out to Fandom Pulse to vent how similar the series seemed to their hit with him, Monster Hunter International. With Correia taking his own successful work and doing a spin on it for Ark Press, one has to wonder with AI writing becoming as good as it is, who can do MHI better: AI, or Larry Correia himself?\nArtificial Intelligence has become increasingly good at writing with giant leaps up in the technological prowess over the last year, especially with the help of Claude Sonnet and Claude Opus 4.0 delivering prose levels many never thought possible.\nVox Day has been experimenting with AI to no small degree, making full albums out of music on Suno and testing the capabilities on short stories ranging from styles of Neil Gaiman, to John Scalzi, and even Larry Correia, pioneering the future in AI art.\nMeanwhile, in traditional publishing, it appears as if Baen Books is in massive trouble as Correia sees the proverbial writing on the wall and has taken moves to diversify out of his long-time publisher and now announced he’s going to be kickstarting a series, American Paladin, that sounds very similar to Monster Hunter International, his long-time gun urban fantasy series that’s been a hit with Baen over the years.\nArk Press, his new publisher which is owned by mega-billionaire Peter Thiel, seemed to want an MHI-style story out of Correia to launch the press, and they’ve advertised its similarities as well.\nSince Correia is taking his hit series and giving a new take on it, the question is, can AI build a better modern iteration of MHI than Larry Correia himself can given its new found prowess?\nVox Day has already been working on this with a serialized novel called Monster Control Inc. In this, he’s trained AI to write in Larry Correia’s style to provide a signature version that reads enough like Correia that if you didn’t know it was written by AI, you might think it’s Correia’s novels.\nJust to be clear,\nMonster Control Incorporated\nutilizes a judicious blend of literary seasonings, one of which is Larry Correia’s. But because the objective was to utilize a Gamma protagonist, and since Larry is the most Delta author who ever wrote a Delta self-insert since Louis Lamour laid down his prolific pen, it was necessary to bring in other elements in order to capture that inimitable Gamma snark, passive-aggressiveness, and relentless obsession with unattainable women.\nI also didn’t think that Larry’s signature gun porn was desirable in this case, although I certainly did utilize that in my non-AI Quantum Mortis novel,\nA Man Disrupted\n, and to such an extent that more than one review even asserted that I had outcorreia’d Correia himself, although I think that was not actually true and was merely an overenthusiastic response to my incorporation of orbital artillery into a police procedural.\nIt will be an interesting test, though. Can one of the leading critics of textual AI write a better pastiche of his own style than an AI can?\nRead Monster Control Incorporated\nand find out!\nI’ve been walking my crush home since last week to protect her from all the creeps walking around. Next week I’m going to introduce myself to her.\nDISCUSS ON SG",
  "tags": [
    "AI",
    "books",
    "Sigma Game",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-10T15:16:23+00:00"
}