{
  "url": "https://voxday.net/2025/07/12/the-police-are-part-of-the-problem/",
  "scraped_at": "2026-01-08T20:25:03.976184",
  "title": "The Police are Part of the Problem",
  "date_display": "July 12, 2025",
  "date_iso": "2025-07-12T11:34:50+00:00",
  "date_from_url": "2025-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The police have forgotten that their primary responsibility is to “provide order” which means protecting the criminal class from public retribution, so <a href=\"https://x.com/DonShift3/status/1942581039047795116\">the threat of their quitting en masse</a> in the event of an insurrection is neither credible nor something to be feared.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>If police officers become targets during an insurrection, that is if they believe that simply wearing the badge puts a crosshair on their back, they will quit. Not all of them, and not all at once, but enough to matter. It will break the fragile illusion that someone will always be there when you call 911. Because here’s the dirty secret: being a cop isn’t the military. You can’t force someone to stay. They can quit, they can call in sick, ride the clock, or quietly decide to stop risking their lives for a public that suddenly sees them as the enemy and they will.</p><p>We’ve already seen the preview. During the Christopher Dorner manhunt, police across Southern California pulled back. Operations changed overnight. Civilian patrols were pulled and traffic stops disappeared. Cops stopped patrolling alone. Agencies went into defense mode, not enforcement. And that was just for one man—one rogue ex-cop with a manifesto and a rifle not a real, widespread war on police.</p><p>Now imagine a coordinated campaign of violence against police, or even just the fear of one. Even a few targeted killings would be enough to provoke the same institutional panic. Commanders would prioritize officer safety over crime prevention. SWAT teams would be called out for routine calls. Cops would avoid public contact, adopt “high threat” tactics, and start treating everyone like a potential ambush. Patrols would thin, enforcement would evaporate, and criminals would flouish in the resulting void.</p><p>That vacuum in public safety will not go unnoticed. The public will feel it, especially the law-abiding people who thought they didn’t need the police—until the police stopped showing up. When the perception of risk outweighs the paycheck, officers will disengage. And once the public sees what a police-less society actually looks like, opportunists will act. Criminals will take advantage of those unable to defend themselves. And you would-be vigilantes looking to clean house will suddenly find out it’s not so fun being in Condition Orange all the time and that there are much bigger, badder fish out there.</p></blockquote><p>The police aren’t protecting the public at all because they’re not even remotely capable of it. If you want absolute and conclusive proof of this, watch <a href=\"https://youtu.be/JDOKB0Hl9OY\">the OnlyCops analysis of the Boulder police’s 2021 response</a> to a crazy immigrant with a rifle and a pistol who shot up a supermarket, killing 10 people and one police officer. The image below shows what the police think a tactical response to a single shooter looks like; their Napoleonic approach make the US Marines’ WWII tactic of “storm the beaches” look downright strategic; at least the Marines attacked in line rather than column.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-67998\" decoding=\"async\" fetchpriority=\"high\" height=\"311\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/07/image-6.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/07/image-6.png 512w, https://voxday.net/wp-content/uploads/2025/07/image-6-300x182.png 300w\" width=\"512\"/></figure></div><p>That picture was taken after two of the first three police, including that woman, had tried entering the front door, very slowly without taking cover, and then retreated outside at first contact about 30 feet inside the store. The first two police left the third policeman to die before finally returning with reinforcements and trying to hide behind each other; moments after this picture, the gunman opened fire and they all ran away again.</p><p>The observable reality is that the only protection and order that the police actually provide is the illusion of protection and order. Two deer hunters could have taken out the lunatic in less than one-third the time that dozens of Boulder police and their SWAT team finally managed to wound and arrest the man; it took them more than 15 minutes to even try flanking the guy despite the fact that there were dozens of innocent people and a dying police officer inside.</p><p>Remember, to the police, both a predator seeking to prey on the public and the members of the public defending themselves and delivering justice on their own behalf are “criminals”. So, when the policeman claims that “criminals would flourish in the resulting void” he’s not talking about gangs and hoods, he’s actually talking about working- and middle-class neighborhood protection squads driving out the predators and parasites that have infiltrated their society.</p><p>It’s not the criminals that the police and the politicians fear, it’s the regular people sick and tired of being subjected to crime. Notice how they always come down like a ton of bricks on so-called “white nationalists” and “right-wing extremists” and spend three-quarters of their resources trying to infiltrate and suppress them while simultaneously permitting minorities and liberals to burn down half the city without even trying to intervene.</p><p><em><a href=\"https://socialgalactic.com/micropost/3bbc130d-3cd1-4939-8d72-a32a92bc3f45\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The police have forgotten that their primary responsibility is to “provide order” which means protecting the criminal class from public retribution, so\nthe threat of their quitting en masse\nin the event of an insurrection is neither credible nor something to be feared.\nIf police officers become targets during an insurrection, that is if they believe that simply wearing the badge puts a crosshair on their back, they will quit. Not all of them, and not all at once, but enough to matter. It will break the fragile illusion that someone will always be there when you call 911. Because here’s the dirty secret: being a cop isn’t the military. You can’t force someone to stay. They can quit, they can call in sick, ride the clock, or quietly decide to stop risking their lives for a public that suddenly sees them as the enemy and they will.\nWe’ve already seen the preview. During the Christopher Dorner manhunt, police across Southern California pulled back. Operations changed overnight. Civilian patrols were pulled and traffic stops disappeared. Cops stopped patrolling alone. Agencies went into defense mode, not enforcement. And that was just for one man—one rogue ex-cop with a manifesto and a rifle not a real, widespread war on police.\nNow imagine a coordinated campaign of violence against police, or even just the fear of one. Even a few targeted killings would be enough to provoke the same institutional panic. Commanders would prioritize officer safety over crime prevention. SWAT teams would be called out for routine calls. Cops would avoid public contact, adopt “high threat” tactics, and start treating everyone like a potential ambush. Patrols would thin, enforcement would evaporate, and criminals would flouish in the resulting void.\nThat vacuum in public safety will not go unnoticed. The public will feel it, especially the law-abiding people who thought they didn’t need the police—until the police stopped showing up. When the perception of risk outweighs the paycheck, officers will disengage. And once the public sees what a police-less society actually looks like, opportunists will act. Criminals will take advantage of those unable to defend themselves. And you would-be vigilantes looking to clean house will suddenly find out it’s not so fun being in Condition Orange all the time and that there are much bigger, badder fish out there.\nThe police aren’t protecting the public at all because they’re not even remotely capable of it. If you want absolute and conclusive proof of this, watch\nthe OnlyCops analysis of the Boulder police’s 2021 response\nto a crazy immigrant with a rifle and a pistol who shot up a supermarket, killing 10 people and one police officer. The image below shows what the police think a tactical response to a single shooter looks like; their Napoleonic approach make the US Marines’ WWII tactic of “storm the beaches” look downright strategic; at least the Marines attacked in line rather than column.\nThat picture was taken after two of the first three police, including that woman, had tried entering the front door, very slowly without taking cover, and then retreated outside at first contact about 30 feet inside the store. The first two police left the third policeman to die before finally returning with reinforcements and trying to hide behind each other; moments after this picture, the gunman opened fire and they all ran away again.\nThe observable reality is that the only protection and order that the police actually provide is the illusion of protection and order. Two deer hunters could have taken out the lunatic in less than one-third the time that dozens of Boulder police and their SWAT team finally managed to wound and arrest the man; it took them more than 15 minutes to even try flanking the guy despite the fact that there were dozens of innocent people and a dying police officer inside.\nRemember, to the police, both a predator seeking to prey on the public and the members of the public defending themselves and delivering justice on their own behalf are “criminals”. So, when the policeman claims that “criminals would flourish in the resulting void” he’s not talking about gangs and hoods, he’s actually talking about working- and middle-class neighborhood protection squads driving out the predators and parasites that have infiltrated their society.\nIt’s not the criminals that the police and the politicians fear, it’s the regular people sick and tired of being subjected to crime. Notice how they always come down like a ton of bricks on so-called “white nationalists” and “right-wing extremists” and spend three-quarters of their resources trying to infiltrate and suppress them while simultaneously permitting minorities and liberals to burn down half the city without even trying to intervene.\nDISCUSS ON SG",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-12T13:37:26+00:00"
}