{
  "url": "https://voxday.net/2025/07/16/the-conservative-case-for-social-justice/",
  "scraped_at": "2026-01-08T20:25:28.122104",
  "title": "The Conservative Case for Social Justice",
  "date_display": "July 16, 2025",
  "date_iso": "2025-07-16T09:46:12+00:00",
  "date_from_url": "2025-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This attempt to sell conservatives on <a href=\"https://xcancel.com/jollyheretic/status/1944745628954742810\">social justice being a natural good</a> and a beneficial component of human evolution is an excellent example of why it is important to reject the rhetoric of both the openly wicked and their gatekeeping defenders alike.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>What if Wokeness isn’t just a sign of cultural collapse—but an evolutionary mechanism? In Woke Eugenics, we argue that what’s called “Woke” ideology—social justice, antiracism, transgenderism, radical feminism—isn’t simply madness. It’s a deeply Darwinian process.</p><p>Beneath the surface, Wokeness functions as a form of unconscious negative selection. It disproportionately appeals to the genetically maladaptive: the low in intelligence, the highly neurotic, the physically unhealthy, the narcissistic, and the mentally disordered. And crucially—it encourages them to sterilise themselves. Through childlessness, gender confusion, “body positivity,” antinatalism, casual sex, and identity-based victimhood, Wokeness seduces the most evolutionarily vulnerable segments of the population into ideological self-destruction. They don’t reproduce. They don’t build families. They often don’t survive.</p><p>Meanwhile, those immune to Wokeness—often traditional, religious, future-oriented, group-loyal individuals—are more likely to be genetically and psychologically healthy. They are the ones who marry, have children, and pass on their values. Wokeness, then, polarises society and accelerates the selective removal of its weakest links. You might hate Wokeness. You might see it as chaos. But what if that chaos is how nature does her housekeeping? This is not a collapse. It’s a filter.</p><p>J.O.A. Rayner-Hilles and I lay out this thesis in detail in Woke Eugenics, and in the lecture linked below. If you’re willing to think evolutionarily—and ruthlessly—you may never see the modern world the same way again.</p></blockquote><p>This is retarded pseudoscience that is meant to placate midwitted conservatives and help them accept social justice convergence. It’s an extreme example of the usual sort of nonsense that gatekeepers like Jordan Peterson and Ben Shapiro are constantly emitting. Note that the full title of the book is: <em>Woke Eugenics: How Social Justice is a Mask for Social Darwinism</em>.</p><p>First, there are no “Darwinian processes”. There are no “evolutionary mechanisms”. Evolution by natural selection has never happened and is not happening now because it is mathematically impossible. Based on the genetic spread of Genghis Khan’s genes over 40 generations, the earliest the first mutation to appear in a child born after the birth of Jesus Christ will be able to fixate across the entire human race will be 12,975 years from now. And there is no allele for social justice or satanry, at least, there isn’t as far as we presently know.</p><p>Second, the ridiculous term “woke” is nothing more than a rhetorical cloak for “social justice”, which is an Enlightenment-era description of total moral inversion and satanic rule over society. The so-called “Jolly Heretic” is advocating the benefits of “satanic eugenics” which doesn’t sound quite so harmless when put that way, does it.</p><p>Third, social justice intrinsically, and by definition, involves <em>forcing </em>all individuals and institutions to abide by its inverted morality, hence the term “convergence” which is coined on the basis of the John Stuart Mill quote that defined social justice.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Society should treat all equally well who have deserved equally well of it, that is, who have deserved equally well absolutely. This is the highest abstract standard of social and distributive justice; towards which all institutions, and the efforts of all virtuous citizens should be made in the utmost degree to converge.</em></p></blockquote><h6 class=\"wp-block-heading\" id=\"john-stuart-mill-utilitarianism\">—John Stuart Mill, <em>Utilitarianism</em></h6><p>Note that phrase in particular: “should be made in the utmost degree to converge”. So, no, relying upon a nonexistent and mathematically-impossible process to defeat a totalitarian assault on American society by encouraging it is such an obviously retarded idea that it suggests those putting it out there are the active enemies of Christendom, Americans, and freedom alike.</p><p><em><a href=\"https://socialgalactic.com/micropost/83c179ea-bc03-4140-a0ab-b1f467a2458b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This attempt to sell conservatives on\nsocial justice being a natural good\nand a beneficial component of human evolution is an excellent example of why it is important to reject the rhetoric of both the openly wicked and their gatekeeping defenders alike.\nWhat if Wokeness isn’t just a sign of cultural collapse—but an evolutionary mechanism? In Woke Eugenics, we argue that what’s called “Woke” ideology—social justice, antiracism, transgenderism, radical feminism—isn’t simply madness. It’s a deeply Darwinian process.\nBeneath the surface, Wokeness functions as a form of unconscious negative selection. It disproportionately appeals to the genetically maladaptive: the low in intelligence, the highly neurotic, the physically unhealthy, the narcissistic, and the mentally disordered. And crucially—it encourages them to sterilise themselves. Through childlessness, gender confusion, “body positivity,” antinatalism, casual sex, and identity-based victimhood, Wokeness seduces the most evolutionarily vulnerable segments of the population into ideological self-destruction. They don’t reproduce. They don’t build families. They often don’t survive.\nMeanwhile, those immune to Wokeness—often traditional, religious, future-oriented, group-loyal individuals—are more likely to be genetically and psychologically healthy. They are the ones who marry, have children, and pass on their values. Wokeness, then, polarises society and accelerates the selective removal of its weakest links. You might hate Wokeness. You might see it as chaos. But what if that chaos is how nature does her housekeeping? This is not a collapse. It’s a filter.\nJ.O.A. Rayner-Hilles and I lay out this thesis in detail in Woke Eugenics, and in the lecture linked below. If you’re willing to think evolutionarily—and ruthlessly—you may never see the modern world the same way again.\nThis is retarded pseudoscience that is meant to placate midwitted conservatives and help them accept social justice convergence. It’s an extreme example of the usual sort of nonsense that gatekeepers like Jordan Peterson and Ben Shapiro are constantly emitting. Note that the full title of the book is:\nWoke Eugenics: How Social Justice is a Mask for Social Darwinism\n.\nFirst, there are no “Darwinian processes”. There are no “evolutionary mechanisms”. Evolution by natural selection has never happened and is not happening now because it is mathematically impossible. Based on the genetic spread of Genghis Khan’s genes over 40 generations, the earliest the first mutation to appear in a child born after the birth of Jesus Christ will be able to fixate across the entire human race will be 12,975 years from now. And there is no allele for social justice or satanry, at least, there isn’t as far as we presently know.\nSecond, the ridiculous term “woke” is nothing more than a rhetorical cloak for “social justice”, which is an Enlightenment-era description of total moral inversion and satanic rule over society. The so-called “Jolly Heretic” is advocating the benefits of “satanic eugenics” which doesn’t sound quite so harmless when put that way, does it.\nThird, social justice intrinsically, and by definition, involves\nforcing\nall individuals and institutions to abide by its inverted morality, hence the term “convergence” which is coined on the basis of the John Stuart Mill quote that defined social justice.\nSociety should treat all equally well who have deserved equally well of it, that is, who have deserved equally well absolutely. This is the highest abstract standard of social and distributive justice; towards which all institutions, and the efforts of all virtuous citizens should be made in the utmost degree to converge.\n—John Stuart Mill,\nUtilitarianism\nNote that phrase in particular: “should be made in the utmost degree to converge”. So, no, relying upon a nonexistent and mathematically-impossible process to defeat a totalitarian assault on American society by encouraging it is such an obviously retarded idea that it suggests those putting it out there are the active enemies of Christendom, Americans, and freedom alike.\nDISCUSS ON SG",
  "tags": [
    "cuckservative",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-16T09:51:11+00:00"
}