{
  "url": "https://voxday.net/2025/07/19/there-are-no-good-guys/",
  "scraped_at": "2026-01-08T20:25:52.065461",
  "title": "There are No Good Guys",
  "date_display": "July 19, 2025",
  "date_iso": "2025-07-19T13:04:39+00:00",
  "date_from_url": "2025-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least, they are nowhere to be found <a href=\"https://unclejohnsband.substack.com/p/scripting-confusion\">in Clown World or in the rebel faction</a> that is Techno-Clown World 2.0.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>One constant with multi-part structures or networks – like political systems – relates to trustworthiness. Any dishonesty – contradictions, logical impossibilities, hand-waving, misinformation, rhetorical answers for factual questions, etc. –<em> indicates the whole formation isn’t what it presents itself as</em>. Doesn’t indicate in what specific way it’s fake or to what extent, but that there is deception. And neither it nor its intentions should be trusted unless that is sufficiently addressed.</p><p>For example, disinterest in politics began with the childhood recognition that [the party process] and [the spirit of a representative constitutional republic] are incompatible. There’s nowhere to go in-system from that. If interested in power, learn how society works and chart course that way.</p><p>For those who like labels I describe this approach as <strong>reality-facing</strong>. FTS-1. Information processors and learners who have different beliefs and knowledge bases but don’t accept House of Lies screens as <em>a priori</em> truth. In a psychotic kaleidoscope of late Clown, this leads to what Vox Day calls <em>omni-narrational skepticism</em>. Where every one of the just-so narratives supporting the House of Lies on any level are suspect…</p><p>Big picture, the goal still looks like managing the Clown collapse with a mix of autarkic fortifying and leveraging what dwindling advantages remain. At least until AI managed control systems are in place.2</p><p>Readers know I 100% favor long-term reindustrialization and force-motivating non-producers off checks and into work. But the strategic &amp; logistical level moves aren’t happening that would have had to if real industrial rebirth was on the table. Attempts to strongarm compliance with the dying dollar system also seem chimeric. Remember, they’re running the House of Lies now. What they say is emotionally resonant because it’s Scripted. The Show we were told to enjoy. Just be mindful that dialectically, the narrative isn’t aiming at a 20th-century America conclusion.</p></blockquote><p>In fairness, they never promised to lift a finger about restoring America, only making it “great”, for whatever bizarre satanic inversion of the term that means. The domestic struggle is between those who want to drive off the cliff and those who want to hang a right to avoid driving off the cliff.</p><p>Actually turning back isn’t on their radar.</p><p><em><a href=\"https://socialgalactic.com/micropost/facd78fb-b51a-4ac6-bf59-7c21dd47fbe5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "At least, they are nowhere to be found\nin Clown World or in the rebel faction\nthat is Techno-Clown World 2.0.\nOne constant with multi-part structures or networks – like political systems – relates to trustworthiness. Any dishonesty – contradictions, logical impossibilities, hand-waving, misinformation, rhetorical answers for factual questions, etc. –\nindicates the whole formation isn’t what it presents itself as\n. Doesn’t indicate in what specific way it’s fake or to what extent, but that there is deception. And neither it nor its intentions should be trusted unless that is sufficiently addressed.\nFor example, disinterest in politics began with the childhood recognition that [the party process] and [the spirit of a representative constitutional republic] are incompatible. There’s nowhere to go in-system from that. If interested in power, learn how society works and chart course that way.\nFor those who like labels I describe this approach as\nreality-facing\n. FTS-1. Information processors and learners who have different beliefs and knowledge bases but don’t accept House of Lies screens as\na priori\ntruth. In a psychotic kaleidoscope of late Clown, this leads to what Vox Day calls\nomni-narrational skepticism\n. Where every one of the just-so narratives supporting the House of Lies on any level are suspect…\nBig picture, the goal still looks like managing the Clown collapse with a mix of autarkic fortifying and leveraging what dwindling advantages remain. At least until AI managed control systems are in place.2\nReaders know I 100% favor long-term reindustrialization and force-motivating non-producers off checks and into work. But the strategic & logistical level moves aren’t happening that would have had to if real industrial rebirth was on the table. Attempts to strongarm compliance with the dying dollar system also seem chimeric. Remember, they’re running the House of Lies now. What they say is emotionally resonant because it’s Scripted. The Show we were told to enjoy. Just be mindful that dialectically, the narrative isn’t aiming at a 20th-century America conclusion.\nIn fairness, they never promised to lift a finger about restoring America, only making it “great”, for whatever bizarre satanic inversion of the term that means. The domestic struggle is between those who want to drive off the cliff and those who want to hang a right to avoid driving off the cliff.\nActually turning back isn’t on their radar.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "decline and fall",
    "ONS"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-07-19T13:06:08+00:00"
}