{
  "url": "https://voxday.net/2017/05/02/16/",
  "scraped_at": "2025-12-18T07:12:25.814077",
  "title": "Альтернативні праві : 16 тез",
  "date_display": "May 2, 2017",
  "date_iso": "2017-05-02T07:00:00+00:00",
  "date_from_url": "2017-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Альтернативні праві : 16 тез</p><p>1.Альтернативні праві належать до правих політичних течій як в американському, так і в європейському значенні цього терміну. Соціалісти не є альтернативними правими. Прогресивні не є альтернативними правими. Ліберали не є альтернативними правими. Комуністи, марксисти, марксіанці, культуро-марксисти і неоконсерватори теж не є альтернативними правими.</p><p>2.Альтернативні праві стали АЛЬТЕРНАТИВОЮ консервативному мейнстріму в США, який номінально виражений «Десятьма консервативними принципами» Рассела Кірка, але в дійсності виродився до прогресизму. Вони також стали альтернативою лібертаріанству.</p><p>3. Альтернативні праві не сповідують оборонного світогляду, відкидаючи саму ідею благородної і принципової поразки. Це філософія зорієнтована на рух вперед і наступ, в усіх значеннях цього терміну. Альтернативні праві вірять у перемогу завдяки наполегливості і збереженню гармонії із наукою, реальністю, культурною традицією і уроками історії.</p><p>4. Альтернативні праві вважають Західну цивілізацію вершинним здобутком людства і підтримують три її стовпи: християнство, європейські нації і греко-римську спадщину.</p><p>5. Альтернативні праві прямо і відкрито націоналістичні. Вони підтримують усі націоналізми і право всіх націй на існування в гомогенному середовищі, не порушеному іноземними вторгненням та імміграцією.</p><p>6. Альтернативні праві – проти глобалізму. Вони протистоять усім групам, які працюють на ідеали глобалізму чи його завдання.</p><p>7. Альтернативні праві проти егалітаризму. Вони відкидають ідею рівності з тієї ж причини, що й байки про існування єдинорогів чи лепреконів, і відзначають, що людської рівності не існує в жодній зі сфер людської діяльності: чи то юридичній, чи то матеріальній, інтелектуальній, сексуальній чи духовній.</p><p>8. Альтернативні праві орієнтуються на науку. Вони зазвичай визнають сучасні наукові результати із застереженнями: в майбутньому їх можна буде переглянути і змінити; наукові кола теж піддатливі до корупції, а так званий науковий консенсус спирається не на науковість, а на демократію. Тож висновки в рамках цього консенсусу – ненаукові.</p><p>9. Альтернативні праві вірять, що ідентичність &gt; культура &gt; політика.</p><p>10. Альтернативні праві протистоять домінуванню однієї етнічної групи над іншою, особливо на своїй рідній землі. Альтернативні праві перебувають в опозиції до інородців, які прагнуть досягти вагомого впливу на місцевих мешканців шляхом клановості чи іншим способом.</p><p>11. Альтернативні праві розуміють, що різноманітність + близькість = війна.</p><p>12. Альтернативним правим все одно, що ви про них думаєте.</p><p>13. Альтернативні праві відкидають міжнародну вільну торгівлю і вільне переміщення людей, якого вимагає режим вільної торгівлі. Переваги внутрішньої національної вільної торгівлі не гарантують переваг міжнародної вільної торгівлі.</p><p>14. Альтернативні праві вважають, що ми маємо забезпечити існування білих людей і майбутнє для білих дітей.</p><p>15. Альтернативні праві не вважають, що якась одна раса, нація чи інша спільнота людей має перевагу і першість над іншими. Кожна раса, нація і людська спільнота має свої сильні риси і слабкості, а також – суверенне право жити у спокої в рамках власної національної культури.</p><p>16. Альтернативні праві цінують мир між різними націями і протистоять війнам, які є спробами нав’язати цінності однієї нації іншій, а також спробами винищити окремі нації шляхом власне війни, геноциду, імміграції і генетичної асиміляції.</p><p>Альтернативні праві – це західна ідеологія, яка вірить у науку, історію, дійсність та право генетичної нації існувати і урядувати у своїх інтересах.</p><p>Святий покровитель консерваторів Рассел Кірк писав: «Велика лінія поділу в сучасній політиці, як уже вказував Ерік Воґелін, пролягає не поміж лібералами і<br> прихильниками тоталітаризму. Ні, на одному боці цієї межі перебувають ті чоловіки і жінки, які приймають існуючий порядок як єдиний можливий, не помічають нічого, окрім своїх матеріальних потреб і вважають, що можуть чинити все, що їм заманеться зі спадщиною людства. На іншому боці межі – ті люди, які розуміють, що світ тримається на тривалому моральному порядку, незмінності людської природи та відчутті високого обов’язку перед духовним і громадянським порядком».</br></p><p>Якщо це й було колись правдою, то тепер усе інакше. Лінія поділу в сучасній політиці пролягла поміж чоловіками і жінками, які вірять, що визначальне значення має їхня нестійка точка зору, і тими, хто вважає, що таке значення має їхня генетична спадщина.  Альтернативні праві розуміють, що перше завжди програє другому, оскільки приречене змінюватися.</p></div>",
  "content_text": "Альтернативні праві : 16 тез\n1.Альтернативні праві належать до правих політичних течій як в американському, так і в європейському значенні цього терміну. Соціалісти не є альтернативними правими. Прогресивні не є альтернативними правими. Ліберали не є альтернативними правими. Комуністи, марксисти, марксіанці, культуро-марксисти і неоконсерватори теж не є альтернативними правими.\n2.Альтернативні праві стали АЛЬТЕРНАТИВОЮ консервативному мейнстріму в США, який номінально виражений «Десятьма консервативними принципами» Рассела Кірка, але в дійсності виродився до прогресизму. Вони також стали альтернативою лібертаріанству.\n3. Альтернативні праві не сповідують оборонного світогляду, відкидаючи саму ідею благородної і принципової поразки. Це філософія зорієнтована на рух вперед і наступ, в усіх значеннях цього терміну. Альтернативні праві вірять у перемогу завдяки наполегливості і збереженню гармонії із наукою, реальністю, культурною традицією і уроками історії.\n4. Альтернативні праві вважають Західну цивілізацію вершинним здобутком людства і підтримують три її стовпи: християнство, європейські нації і греко-римську спадщину.\n5. Альтернативні праві прямо і відкрито націоналістичні. Вони підтримують усі націоналізми і право всіх націй на існування в гомогенному середовищі, не порушеному іноземними вторгненням та імміграцією.\n6. Альтернативні праві – проти глобалізму. Вони протистоять усім групам, які працюють на ідеали глобалізму чи його завдання.\n7. Альтернативні праві проти егалітаризму. Вони відкидають ідею рівності з тієї ж причини, що й байки про існування єдинорогів чи лепреконів, і відзначають, що людської рівності не існує в жодній зі сфер людської діяльності: чи то юридичній, чи то матеріальній, інтелектуальній, сексуальній чи духовній.\n8. Альтернативні праві орієнтуються на науку. Вони зазвичай визнають сучасні наукові результати із застереженнями: в майбутньому їх можна буде переглянути і змінити; наукові кола теж піддатливі до корупції, а так званий науковий консенсус спирається не на науковість, а на демократію. Тож висновки в рамках цього консенсусу – ненаукові.\n9. Альтернативні праві вірять, що ідентичність > культура > політика.\n10. Альтернативні праві протистоять домінуванню однієї етнічної групи над іншою, особливо на своїй рідній землі. Альтернативні праві перебувають в опозиції до інородців, які прагнуть досягти вагомого впливу на місцевих мешканців шляхом клановості чи іншим способом.\n11. Альтернативні праві розуміють, що різноманітність + близькість = війна.\n12. Альтернативним правим все одно, що ви про них думаєте.\n13. Альтернативні праві відкидають міжнародну вільну торгівлю і вільне переміщення людей, якого вимагає режим вільної торгівлі. Переваги внутрішньої національної вільної торгівлі не гарантують переваг міжнародної вільної торгівлі.\n14. Альтернативні праві вважають, що ми маємо забезпечити існування білих людей і майбутнє для білих дітей.\n15. Альтернативні праві не вважають, що якась одна раса, нація чи інша спільнота людей має перевагу і першість над іншими. Кожна раса, нація і людська спільнота має свої сильні риси і слабкості, а також – суверенне право жити у спокої в рамках власної національної культури.\n16. Альтернативні праві цінують мир між різними націями і протистоять війнам, які є спробами нав’язати цінності однієї нації іншій, а також спробами винищити окремі нації шляхом власне війни, геноциду, імміграції і генетичної асиміляції.\nАльтернативні праві – це західна ідеологія, яка вірить у науку, історію, дійсність та право генетичної нації існувати і урядувати у своїх інтересах.\nСвятий покровитель консерваторів Рассел Кірк писав: «Велика лінія поділу в сучасній політиці, як уже вказував Ерік Воґелін, пролягає не поміж лібералами і\nприхильниками тоталітаризму. Ні, на одному боці цієї межі перебувають ті чоловіки і жінки, які приймають існуючий порядок як єдиний можливий, не помічають нічого, окрім своїх матеріальних потреб і вважають, що можуть чинити все, що їм заманеться зі спадщиною людства. На іншому боці межі – ті люди, які розуміють, що світ тримається на тривалому моральному порядку, незмінності людської природи та відчутті високого обов’язку перед духовним і громадянським порядком».\nЯкщо це й було колись правдою, то тепер усе інакше. Лінія поділу в сучасній політиці пролягла поміж чоловіками і жінками, які вірять, що визначальне значення має їхня нестійка точка зору, і тими, хто вважає, що таке значення має їхня генетична спадщина.  Альтернативні праві розуміють, що перше завжди програє другому, оскільки приречене змінюватися.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-02T06:00:00+00:00"
}