{
  "url": "https://voxday.net/2017/05/13/a-fascinating-historical-revision/",
  "scraped_at": "2025-12-18T07:13:57.200411",
  "title": "A fascinating historical revision",
  "date_display": "May 13, 2017",
  "date_iso": "2017-05-13T03:42:00+00:00",
  "date_from_url": "2017-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The idea that the “Arab Conquests” <a href=\"http://www.newenglishreview.org/custpage.cfm/frm/160197/sec_id/160197\">might have actually been Persian</a> may explain, in part, why Iran believes it should be the center of the Islamic world:</p><blockquote><p> The two greatest powers in the Middle East at the beginning of the seventh century were Byzantium and Sassanian Persia. In 602 the Persian king Chosroes (Khosrau) II went to war against the Byzantine usurper Phocas, who had earlier murdered Chosroes’ friend and father-in-law the Emperor Maurice. The war did not end with the death of Phocas (610), but continued into the reign of Heraclius, and was to prove ruinous to the Byzantines. Jerusalem was taken by the Persians in 614, a disaster which was quickly followed by the loss of most of Asia Minor between 616 and 618 and Egypt in 619/20. Chosroes II now equalled the achievements of his Persian predecessors in the sixth century BC, with his forces marching across North Africa to annex the Libyan province of Cyrenaea in 621. The story told by the Byzantines of how Heraclius, in the face of this overwhelming calamity, rallied his armies and reconquered all the lost territories – only to lose the same territories again to the Arabs from 632 onwards – has a ring of fantasy about it, and historians have long viewed it with scepticism. Certainly there is no doubting the power and influence of the Persians in this epoch.</p><p>The earliest Islam, as revealed by archaeology, is in fact profoundly Persian; and indeed the first trace of Islam recovered in excavation are coins of Sassanian Persian design bearing the image either of Chosroes II (d. 628) or of his grandson Yazdegerd III (d. 651). On one side we find the portrait of the king, on the reverse the picture of a Zoroastrian Fire Temple. The only thing that marks these out as Islamic is the legend besm Allah (in the name of God), written in the Syriac script, beside the Fire Temple. (The Arabic script did not then exist). According to the Encyclopdaedia Iranica:</p><p><i>“These coins usually have a portrait of a Sasanian emperor with an honorific inscription and various ornaments. To the right of the portrait is a ruler’s or governor’s name written in Pahlavi script. On the reverse there is a Zoroastrian fire altar with attendants on either side. At the far left is the year of issue expressed in words, and at the right is the place of minting. In all these features, the Arab-Sasanian coinages are similar to Sasanian silver drahms. The major difference between the two series is the presence of some additional Arabic inscription on most coins issued under Muslim authority, but some coins with no Arabic can still be attributed to the Islamic period. The Arab-Sasanian coinages are not imitations, since they were surely designed and manufactured by the same people as the late Sasanian issues, illustrating the continuity of administration and economic life in the early years of Muslim rule in Iran.” </i>(“Arab-Sasanian Coins,” Encyclopdaedia Iranica, at www.iranica.com/articles/arab-sasanian-coins)</p><p>Note the remark: “The Arab-Sasanian coinages are not imitations,” but were “designed and manufactured by the same people as the late Sasanian issues.” We note also that the date provided on these artefacts is written in Persian script, and it would appear that those who minted the coins, native Persians, did not understand Arabic.</p></blockquote><p>It would also explain the seeming, and relatively sudden, vanishing of what had been for more than 1500 years one of the great world powers, if it was not a vanishing, but a mere transformation.</p></div>",
  "content_text": "The idea that the “Arab Conquests”\nmight have actually been Persian\nmay explain, in part, why Iran believes it should be the center of the Islamic world:\nThe two greatest powers in the Middle East at the beginning of the seventh century were Byzantium and Sassanian Persia. In 602 the Persian king Chosroes (Khosrau) II went to war against the Byzantine usurper Phocas, who had earlier murdered Chosroes’ friend and father-in-law the Emperor Maurice. The war did not end with the death of Phocas (610), but continued into the reign of Heraclius, and was to prove ruinous to the Byzantines. Jerusalem was taken by the Persians in 614, a disaster which was quickly followed by the loss of most of Asia Minor between 616 and 618 and Egypt in 619/20. Chosroes II now equalled the achievements of his Persian predecessors in the sixth century BC, with his forces marching across North Africa to annex the Libyan province of Cyrenaea in 621. The story told by the Byzantines of how Heraclius, in the face of this overwhelming calamity, rallied his armies and reconquered all the lost territories – only to lose the same territories again to the Arabs from 632 onwards – has a ring of fantasy about it, and historians have long viewed it with scepticism. Certainly there is no doubting the power and influence of the Persians in this epoch.\nThe earliest Islam, as revealed by archaeology, is in fact profoundly Persian; and indeed the first trace of Islam recovered in excavation are coins of Sassanian Persian design bearing the image either of Chosroes II (d. 628) or of his grandson Yazdegerd III (d. 651). On one side we find the portrait of the king, on the reverse the picture of a Zoroastrian Fire Temple. The only thing that marks these out as Islamic is the legend besm Allah (in the name of God), written in the Syriac script, beside the Fire Temple. (The Arabic script did not then exist). According to the Encyclopdaedia Iranica:\n“These coins usually have a portrait of a Sasanian emperor with an honorific inscription and various ornaments. To the right of the portrait is a ruler’s or governor’s name written in Pahlavi script. On the reverse there is a Zoroastrian fire altar with attendants on either side. At the far left is the year of issue expressed in words, and at the right is the place of minting. In all these features, the Arab-Sasanian coinages are similar to Sasanian silver drahms. The major difference between the two series is the presence of some additional Arabic inscription on most coins issued under Muslim authority, but some coins with no Arabic can still be attributed to the Islamic period. The Arab-Sasanian coinages are not imitations, since they were surely designed and manufactured by the same people as the late Sasanian issues, illustrating the continuity of administration and economic life in the early years of Muslim rule in Iran.”\n(“Arab-Sasanian Coins,” Encyclopdaedia Iranica, at www.iranica.com/articles/arab-sasanian-coins)\nNote the remark: “The Arab-Sasanian coinages are not imitations,” but were “designed and manufactured by the same people as the late Sasanian issues.” We note also that the date provided on these artefacts is written in Persian script, and it would appear that those who minted the coins, native Persians, did not understand Arabic.\nIt would also explain the seeming, and relatively sudden, vanishing of what had been for more than 1500 years one of the great world powers, if it was not a vanishing, but a mere transformation.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-13T02:42:00+00:00"
}