{
  "url": "https://voxday.net/2017/05/29/alt-right-antecedents/",
  "scraped_at": "2025-12-18T07:16:01.557689",
  "title": "Alt-Right antecedents",
  "date_display": "May 29, 2017",
  "date_iso": "2017-05-29T09:52:00+00:00",
  "date_from_url": "2017-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we’re preparing for the release of <i>The Collected Columns, Vol. 2</i>, it’s interesting to see that an observer, who commented on the conceptual development of the Alt-Right, was correct to note that the ideas were often there prior to the label being applied. Consider this 2006 column, entitled <i>The Vanishing Conservative</i>, which, prior to both the coining of the term and the publication of Cuckservative 10 years later, anticipates the decline of the conservative movement.</p><blockquote><p> I am not a conservative. While I respect genuine conservatives and appreciate the value of conserving cultural traditions, the Christian faith, and the foundations of Western civilization, conservatives have always struck me as the political equivalent of <i>catenaccio</i>.</p><p>Invented by the Austrian coach of the Swiss national team, the defense-oriented system was embraced by the Italians and used in Italy for over three decades, hence the name. But over time, attack-minded strategies were developed in response, most notably Holland’s famous Total Football System, which broke down the bolted door. No manager actually implements <i>catenaccio </i>today and references to it are mostly ironic and situational, made, for example, when a team is protecting a lead or is overmatched and playing for a tie.</p><p>The problem with both <i>catenaccio </i>and conservatism is that any positive movement is largely the result of luck, not purpose. They are defensive strategies, and as any military historian will tell you; defense never beats offense, it only staves off defeat for a time. In the end, even the most intrepid defenders will weary and the gates will finally fall to the barbarians.</p><p>Although it sounds ludicrous in a time when conservatives nominally rule the airwaves, the legislative, judicial and executive branches; 2006 may well be one day viewed as a low point for the American conservative. For politics is not mathematics and it knows no transitive law. It is true that many institutions and individuals are Republican, and certainly the Republican Party is supposed to be America’s conservative party, but this does not equal conservative dominance of the political scene.</p><p>For neither the institutions nor the individuals can be relied upon to work toward conservative goals. Most of the conservative actions taken in the last 20 years can be best described as holding actions, not actions intended to lower the rising tide of central government influence or combat societal devolution.</p><p>The malaise is movement-wide. Indeed, it is debatable as to which group is in worse shape, the “conservative” politicians or the “conservative” commentariat. While the leftward drift of the administration and the Congress have not escaped notice despite the best efforts of its cheerleaders to play it down; the abandonment of principle in favor of pragmatism has caused many in the so-called conservative media to do the likewise.</p><p>Just this week, one could listen to Michael Medved playing the left’s favorite game of denouncing another commentator—me, actually—as a Nazi while watching nominal conservatives falling all over each other in the competition to be the most outraged by Ann Coulter’s precision-guided comments about the ever-grieving “Witches of East Brunswick.”</p><p>(Given that there are thousands of people who lost loved ones in the September 11 attacks who Coulter did not criticize, it is more than a little disingenuous to pretend that her criticism is somehow inappropriate or misplaced. And just what is the statute of limitations on celebrity-victim status anyhow?)</p><p>Indeed, what with Michelle Malkin pushing FDR’s internment program, Ben Shapiro, Sean Hannity and numerous others pushing Woodrow Wilson’s foreign policy, Larry Kudlow pushing Richard Nixon’s monetary policies and the editors of National Review harboring a Harry Truman-style crush on the United Nations, one has to wonder if a liberal media is redundant these days.</p><p>The word “liberal” once meant something very different than it does today. It rather looks as if the concept of a “conservative” is in the process of undergoing similar etymological evolution. Regardless, it appears the bolted door has been unlocked and is hanging open on loose hinges.</p></blockquote><p>Of course, my understanding then was not what it is now. <a href=\"http://www.wnd.com/2006/06/36568/\">In the original column</a>, I referred to the nonexistent “Judeo-Christian ethic” rather than “Christian faith” and to “civilizations” rather than “Western civilization”.</p><p>Ironically, conservatives left behind by the Alt-Right now often defend Judeo-Christian churchianity in the place of genuine Christian values.</p></div>",
  "content_text": "As we’re preparing for the release of\nThe Collected Columns, Vol. 2\n, it’s interesting to see that an observer, who commented on the conceptual development of the Alt-Right, was correct to note that the ideas were often there prior to the label being applied. Consider this 2006 column, entitled\nThe Vanishing Conservative\n, which, prior to both the coining of the term and the publication of Cuckservative 10 years later, anticipates the decline of the conservative movement.\nI am not a conservative. While I respect genuine conservatives and appreciate the value of conserving cultural traditions, the Christian faith, and the foundations of Western civilization, conservatives have always struck me as the political equivalent of\ncatenaccio\n.\nInvented by the Austrian coach of the Swiss national team, the defense-oriented system was embraced by the Italians and used in Italy for over three decades, hence the name. But over time, attack-minded strategies were developed in response, most notably Holland’s famous Total Football System, which broke down the bolted door. No manager actually implements\ncatenaccio\ntoday and references to it are mostly ironic and situational, made, for example, when a team is protecting a lead or is overmatched and playing for a tie.\nThe problem with both\ncatenaccio\nand conservatism is that any positive movement is largely the result of luck, not purpose. They are defensive strategies, and as any military historian will tell you; defense never beats offense, it only staves off defeat for a time. In the end, even the most intrepid defenders will weary and the gates will finally fall to the barbarians.\nAlthough it sounds ludicrous in a time when conservatives nominally rule the airwaves, the legislative, judicial and executive branches; 2006 may well be one day viewed as a low point for the American conservative. For politics is not mathematics and it knows no transitive law. It is true that many institutions and individuals are Republican, and certainly the Republican Party is supposed to be America’s conservative party, but this does not equal conservative dominance of the political scene.\nFor neither the institutions nor the individuals can be relied upon to work toward conservative goals. Most of the conservative actions taken in the last 20 years can be best described as holding actions, not actions intended to lower the rising tide of central government influence or combat societal devolution.\nThe malaise is movement-wide. Indeed, it is debatable as to which group is in worse shape, the “conservative” politicians or the “conservative” commentariat. While the leftward drift of the administration and the Congress have not escaped notice despite the best efforts of its cheerleaders to play it down; the abandonment of principle in favor of pragmatism has caused many in the so-called conservative media to do the likewise.\nJust this week, one could listen to Michael Medved playing the left’s favorite game of denouncing another commentator—me, actually—as a Nazi while watching nominal conservatives falling all over each other in the competition to be the most outraged by Ann Coulter’s precision-guided comments about the ever-grieving “Witches of East Brunswick.”\n(Given that there are thousands of people who lost loved ones in the September 11 attacks who Coulter did not criticize, it is more than a little disingenuous to pretend that her criticism is somehow inappropriate or misplaced. And just what is the statute of limitations on celebrity-victim status anyhow?)\nIndeed, what with Michelle Malkin pushing FDR’s internment program, Ben Shapiro, Sean Hannity and numerous others pushing Woodrow Wilson’s foreign policy, Larry Kudlow pushing Richard Nixon’s monetary policies and the editors of National Review harboring a Harry Truman-style crush on the United Nations, one has to wonder if a liberal media is redundant these days.\nThe word “liberal” once meant something very different than it does today. It rather looks as if the concept of a “conservative” is in the process of undergoing similar etymological evolution. Regardless, it appears the bolted door has been unlocked and is hanging open on loose hinges.\nOf course, my understanding then was not what it is now.\nIn the original column\n, I referred to the nonexistent “Judeo-Christian ethic” rather than “Christian faith” and to “civilizations” rather than “Western civilization”.\nIronically, conservatives left behind by the Alt-Right now often defend Judeo-Christian churchianity in the place of genuine Christian values.",
  "tags": [
    "#AltRight",
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-29T08:52:00+00:00"
}