{
  "url": "https://voxday.net/2017/05/01/announcing-infogalactic-tec/",
  "scraped_at": "2025-12-18T07:12:14.866556",
  "title": "Announcing Infogalactic Tech",
  "date_display": "May 1, 2017",
  "date_iso": "2017-05-01T08:41:00+00:00",
  "date_from_url": "2017-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Following fast on the heels of Infogalactic News, the Techstars and Infogalactic News team are pleased to announce the launch of <a href=\"https://technews.infogalactic.com/\">Infogalactic Tech</a>, for all your daily tech-related headlines. This will likely include game-related news as well, at least until we put together an Infogalactic Game team. Technology is increasingly converged, which is why we are going to need to develop and support new Alt-Tech news sites.</p><p>If you have a site that you believe merits being permanently linked at the bottom, please email technews-at-infogalactic-dot-com or make a suggestion in the comments. We will also be adding link suggestion boxes to both News and Tech at some point in the near future. As always, if you wish to support these ongoing developments in Alt-Tech and Alt-Media, please join the <a href=\"http://infogalactic.com/info/Infogalactic:Donations\">Burn Unit</a>. As people continue to join, we’re going to be able to keep doing more.</p><p>On a not-entirely-related note, I’ve begun blogging about some of the design and development challenges we’re facing with GameBrain and our other games, and how we’re deciding to address them. This really isn’t extra work; it’s more akin to thinking out loud about stuff we’re already doing. The DevGame post today <a href=\"https://devgamecourse.blogspot.com/2017/05/3-strike-challenge.html\">poses the 3-strike challenge</a>, which concerns how to end a multiplayer game that is based on a 3-strike system.</p></div>",
  "content_text": "Following fast on the heels of Infogalactic News, the Techstars and Infogalactic News team are pleased to announce the launch of\nInfogalactic Tech\n, for all your daily tech-related headlines. This will likely include game-related news as well, at least until we put together an Infogalactic Game team. Technology is increasingly converged, which is why we are going to need to develop and support new Alt-Tech news sites.\nIf you have a site that you believe merits being permanently linked at the bottom, please email technews-at-infogalactic-dot-com or make a suggestion in the comments. We will also be adding link suggestion boxes to both News and Tech at some point in the near future. As always, if you wish to support these ongoing developments in Alt-Tech and Alt-Media, please join the\nBurn Unit\n. As people continue to join, we’re going to be able to keep doing more.\nOn a not-entirely-related note, I’ve begun blogging about some of the design and development challenges we’re facing with GameBrain and our other games, and how we’re deciding to address them. This really isn’t extra work; it’s more akin to thinking out loud about stuff we’re already doing. The DevGame post today\nposes the 3-strike challenge\n, which concerns how to end a multiplayer game that is based on a 3-strike system.",
  "tags": [
    "#AltTech",
    "games",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-01T07:41:00+00:00"
}