{
  "url": "https://voxday.net/2017/05/01/conservatives-move-rig/",
  "scraped_at": "2025-12-18T07:12:16.708017",
  "title": "Conservatives move right",
  "date_display": "May 1, 2017",
  "date_iso": "2017-05-01T11:00:00+00:00",
  "date_from_url": "2017-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Z-man <a href=\"http://thezman.com/wordpress/?p=10159\">observes the very transformation</a> I have been predicting for some time now as the bankruptcy of the conservative movement becomes more and more obvious to everyone on the Right:</p><blockquote><p> The real lesson, the one most useful to the alt-right, is seeing the controlled opposition confirm what many have been pointing out for years now. As soon as things got a little tough, the College Republicans folded their tents and blamed the “extremists” of the alt-right. The Young American Foundation, a Conservative Inc. racket to recruit college students, made a show of “defending free speech” but made sure they did not offer any material support. It was just another way to raise money for their racket.</p><p>In contrast, a handful of rednecks down south were able to force Auburn to host the notorious Richard Spencer, a guy everyone seems to think is Hitler in a cardigan. They went to court and quickly forced the school to honor its legal obligations. They were also able to rally a security force and get the cops to enforce public order. The result being a peaceful and orderly event. Conservative Inc. has tens of millions in cash at their disposal and an army of elite educated lawyers and they could not even defend Coulter.</p><p>What they could do though, is attack Ann Coulter when she correctly pointed out that the summer soldiers of Conservative Inc ran and hid as soon as things got difficult. David French is a mentally unbalanced crackpot, but he does speak for the dwindling number of Buckley Conservatives, who claim to be the vanguard of anti-Progressive forces in America. French speaks for all of the so-called conservatives when he is more upset at Coulter’s noticing than he is at black clad thugs shutting down her speech.</p><p>The whole affair is insignificant in isolation, but it is a another reminder to those who have begun the journey away from Buckley Conservatism, Libertarianism and boomer politics that those well-paid heroes of the Right never win these fights. They invest so heavily in the symbolism of conservatism because they conserve nothing but their own place at Lefty’s table. At best they are well-intentioned losers. At worst, they are willing props deployed by the ruling orthodoxy to disrupt the opposition.</p><p>The people in the dissident movements are not without their problems and many of them are certainly nuts, but that’s the nature of outsider movements. What’s increasingly clear is the fact that it is the outsider movements who are scoring the victories. They are the people changing minds and forcing the the fight onto the turf of Lefty. It’s not the dorks in blue blazers mooning over photos of Reagan. It’s the guys with home made armor decorated with sun wheels and cartoon frogs.</p><p>The other day, an old friend, who was a “happy warrior” type, mostly in the libertarian wing of the Buckley Right, quoted Mike Cernovich to me. I cautioned him to not take everything Cerno says at face value and he responded with, “Hey, no enemies on the Right.” A year ago he probably would have sided with David French or at least frowned upon the alt-right guys raising hell. When given the choice between those who are not afraid to be called a heretic and those who live in fear of it, people naturally choose the former over the latter.</p></blockquote><p>As I said in the Darkstream the other night, it’s going to be very important for the Alt-Right to be patient and allow the civic nationalists, the conservatives, the libertarians, and those with various identity complications the time to process the information and work their way through the emotions that their senses of grief, loss, betrayal, and despair will likely inspire. It’s natural for people to instinctively side with family over nation, even when that instinct is at war with what they know intellectually and can see happening all around them.</p><p>Ironically, the reasons behind the Alt-Lite’s very rejection of the Alt-Right case often tend to materially support it.</p><p>As for the Alt-Retards who have been showing up here lately – and yes, I will use that term and permit use of it by the VFM and Dread Ilk here <i>and here only</i> as long as various Alt-Retards continue to violate the truce we had established with the Alt-White here – they provide the Alt-Right with an excellent model of what not to do and how not to win people over to your side. (Translation: don’t use it on Twitter and Gab, or on your own sites, at least not yet.) Also, I should note that I will respond accordingly to Alt-Retards who attack me on Gab.</p><p>You’d think they would have learned their lesson, but then, if they were intelligent, they wouldn’t be running around wearing swastika panties on their heads.</p><p>Anyhow, the more complicated one’s identity, and the more ethnically and culturally intertwined one’s family, the more frightening the global rise of nationalism is going to be, and the more “what about MEEEEE” is going to be sole perspective initially utilized to consider events. But eventually, reality will intrude, as it always does. Nothing we do or say or think is going to change the fact that liberalism has failed, conservativism has failed, civic nationalism has failed, multiculturalism has failed, and globalism has failed. Like feminism and communism, all five of these ideologies contained the seeds of their own destruction within themselves. Internal incoherency is why ideologies fail; we are merely observers of the inevitable failures.</p><p>The correct response is not to condemn adherents of these failed ideologies for their past choices, much less for who they are, but rather, to give them time to observe, understand, and accept the reality of the changing historical trends, and to calmly offer the viable alternative. No one capable of dialectic makes an ideological shift of this magnitude overnight; I didn’t and you probably didn’t either. So, be patient and be calm, no matter what ludicrous arguments or outrageous accusations they happen to make. It’s not you with whom they are upset, it’s just their denial speaking.</p></div>",
  "content_text": "The Z-man\nobserves the very transformation\nI have been predicting for some time now as the bankruptcy of the conservative movement becomes more and more obvious to everyone on the Right:\nThe real lesson, the one most useful to the alt-right, is seeing the controlled opposition confirm what many have been pointing out for years now. As soon as things got a little tough, the College Republicans folded their tents and blamed the “extremists” of the alt-right. The Young American Foundation, a Conservative Inc. racket to recruit college students, made a show of “defending free speech” but made sure they did not offer any material support. It was just another way to raise money for their racket.\nIn contrast, a handful of rednecks down south were able to force Auburn to host the notorious Richard Spencer, a guy everyone seems to think is Hitler in a cardigan. They went to court and quickly forced the school to honor its legal obligations. They were also able to rally a security force and get the cops to enforce public order. The result being a peaceful and orderly event. Conservative Inc. has tens of millions in cash at their disposal and an army of elite educated lawyers and they could not even defend Coulter.\nWhat they could do though, is attack Ann Coulter when she correctly pointed out that the summer soldiers of Conservative Inc ran and hid as soon as things got difficult. David French is a mentally unbalanced crackpot, but he does speak for the dwindling number of Buckley Conservatives, who claim to be the vanguard of anti-Progressive forces in America. French speaks for all of the so-called conservatives when he is more upset at Coulter’s noticing than he is at black clad thugs shutting down her speech.\nThe whole affair is insignificant in isolation, but it is a another reminder to those who have begun the journey away from Buckley Conservatism, Libertarianism and boomer politics that those well-paid heroes of the Right never win these fights. They invest so heavily in the symbolism of conservatism because they conserve nothing but their own place at Lefty’s table. At best they are well-intentioned losers. At worst, they are willing props deployed by the ruling orthodoxy to disrupt the opposition.\nThe people in the dissident movements are not without their problems and many of them are certainly nuts, but that’s the nature of outsider movements. What’s increasingly clear is the fact that it is the outsider movements who are scoring the victories. They are the people changing minds and forcing the the fight onto the turf of Lefty. It’s not the dorks in blue blazers mooning over photos of Reagan. It’s the guys with home made armor decorated with sun wheels and cartoon frogs.\nThe other day, an old friend, who was a “happy warrior” type, mostly in the libertarian wing of the Buckley Right, quoted Mike Cernovich to me. I cautioned him to not take everything Cerno says at face value and he responded with, “Hey, no enemies on the Right.” A year ago he probably would have sided with David French or at least frowned upon the alt-right guys raising hell. When given the choice between those who are not afraid to be called a heretic and those who live in fear of it, people naturally choose the former over the latter.\nAs I said in the Darkstream the other night, it’s going to be very important for the Alt-Right to be patient and allow the civic nationalists, the conservatives, the libertarians, and those with various identity complications the time to process the information and work their way through the emotions that their senses of grief, loss, betrayal, and despair will likely inspire. It’s natural for people to instinctively side with family over nation, even when that instinct is at war with what they know intellectually and can see happening all around them.\nIronically, the reasons behind the Alt-Lite’s very rejection of the Alt-Right case often tend to materially support it.\nAs for the Alt-Retards who have been showing up here lately – and yes, I will use that term and permit use of it by the VFM and Dread Ilk here\nand here only\nas long as various Alt-Retards continue to violate the truce we had established with the Alt-White here – they provide the Alt-Right with an excellent model of what not to do and how not to win people over to your side. (Translation: don’t use it on Twitter and Gab, or on your own sites, at least not yet.) Also, I should note that I will respond accordingly to Alt-Retards who attack me on Gab.\nYou’d think they would have learned their lesson, but then, if they were intelligent, they wouldn’t be running around wearing swastika panties on their heads.\nAnyhow, the more complicated one’s identity, and the more ethnically and culturally intertwined one’s family, the more frightening the global rise of nationalism is going to be, and the more “what about MEEEEE” is going to be sole perspective initially utilized to consider events. But eventually, reality will intrude, as it always does. Nothing we do or say or think is going to change the fact that liberalism has failed, conservativism has failed, civic nationalism has failed, multiculturalism has failed, and globalism has failed. Like feminism and communism, all five of these ideologies contained the seeds of their own destruction within themselves. Internal incoherency is why ideologies fail; we are merely observers of the inevitable failures.\nThe correct response is not to condemn adherents of these failed ideologies for their past choices, much less for who they are, but rather, to give them time to observe, understand, and accept the reality of the changing historical trends, and to calmly offer the viable alternative. No one capable of dialectic makes an ideological shift of this magnitude overnight; I didn’t and you probably didn’t either. So, be patient and be calm, no matter what ludicrous arguments or outrageous accusations they happen to make. It’s not you with whom they are upset, it’s just their denial speaking.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-01T10:00:00+00:00"
}