{
  "url": "https://voxday.net/2017/05/03/how-bad-must-it-ge/",
  "scraped_at": "2025-12-18T07:12:38.697096",
  "title": "How bad must it get?",
  "date_display": "May 3, 2017",
  "date_iso": "2017-05-03T09:57:00+00:00",
  "date_from_url": "2017-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Two National Review cucks <a href=\"http://www.theamericanconservative.com/dreher/sullys-sympathy-for-neoreaction/\">admit some sympathy</a> for the “reactionaries”:</p><blockquote><p> Andrew Sullivan: <i>And is it any wonder that reactionaries are gaining strength? Within the space of 50 years, America has gone from segregation to dizzying multiculturalism; from traditional family structures to widespread divorce, cohabitation, and sexual liberty; from a few respected sources of information to an endless stream of peer-to-peer media; from careers in one company for life to an ever-accelerating need to retrain and regroup; from a patriarchy to (incomplete) gender equality; from homosexuality as a sin to homophobia as a taboo; from Christianity being the common culture to a secularism no society has ever sustained before ours.</i></p><p>Rod Dreher: I give Sullivan a lot of credit here. It hardly needs to be pointed out that he, as a gay man, has been one of the great beneficiaries of these changes. Yet he recognizes the staggering revolutionary nature of these changes — and, because he doesn’t believe that his homosexuality is the only relevant part of his identity, he also feels the loss of the old world, to a certain extent. He grasps the self-serving delusion embraced by so many Westerners today: that progress is not only inevitable, but always a good thing. Indeed, that’s why they call it “progress.”</p><p><i>But what if the changes are not progress at all, but rather regress?</i> To call it “progress” is to have a fixed goal in mind, and to believe that we are steadily moving in that inevitable direction. The British political philosopher John Gray has powerfully criticized the modern view of progress, calling it (rightly) a secularization of the Christian belief that history is headed toward a fixed conclusion. Marxism adopted this worldview, and reframed the End of History as the realization of Full Communism, and the withering of the State. Progressives today, both of the liberal and conservative variety, accept unthinkingly that history is moving towards a global paradise of free markets and free individuals all exercising maximal Choice. In this sense, there is less difference between Ronald Reagan and Hillary Clinton than between Ronald Reagan and a contemporary reactionary.</p><p>Sully is not, however, a neoreactionary:</p><p>Sullivan: <i>This, of course, is not to defend the neo-reactionary response. Their veiled racism is disturbing, and their pessimism a solipsistic pathology. When Anton finds nothing in modernity to celebrate but, as he put it to me, “nice restaurants, good wine, a high standard of living,” it comes off as a kind of pose, deliberately blind to all the constant renewals of life and culture around us. When Houellebecq has one of his characters sigh, “For a man to bring a child into the world now is meaningless,” I chortle. When Dreher hyperventilates that today’s youngsters “could be one of the last generations of this thing called Western civilization” and that American Christians today must “live lives prepared to suffer severe hardship, even death, for our faith,” I take my dogs for a walk. When Yarvin insists that “if the 20th century does not go down in history as the golden age of awful government, it is only because the future holds some fresher hell for us,” I check my Instagram account. There is something hysterical here, too manically certain, bleaker than any human being can bear for long.</i></p><p>Well, to be clear, I don’t at all agree with Yarvin or Houellebecq, and I don’t think I agree with Anton either. Only a few years before I was born, in my Southern town apartheid was legal, and black citizens lived under a reign of terror. I’m serious: read this 1964 magazine article describing events in my own town.  A few years back, I met three Freedom Riders who had been part of those events. It really happened. Thank God those days are over.</p><p>Yet we cannot easily dismiss the words that a melancholy older black man, a taxi driver, said to me in 1993 as he drove me down a decimated avenue of Washington, DC, which was then at the peak of its murder epidemic. He told me about what it was like for him growing up in segregated DC. He pointed to storefronts and buildings that were now vacant and decaying. “That was a bakery, and that was a drugstore,” he said. “Black-owned. We had something back then.” On and on he went, describing the way this blasted-out part of town looked in his youth, and cursing the young black men who do nothing but sell drugs and shoot each other. I squirmed in the back seat listening to this older black man tell these stories to me, a young white man, but he didn’t hold back. I got the feeling that he wasn’t even paying attention to me, but was rather just musing aloud. He ended by telling me that he wasn’t sure at all that there had been progress. Yes, segregation was gone, but look around you, son, at what we black folks in DC have lost in the last thirty years.</p><p>That is a reactionary sentiment. And it’s important. I did not experience that old black taxi driver calling for the return of segregation, or lamenting its passing. I experienced him as a man aware of  human tragedy. The progressive narrative requires that the old man’s views be suppressed. But he knew what he saw all around him.</p></blockquote><p>It’s really rather remarkable what these self-styled conservatives are willing to give up so that no one will call them, or their society, racist. Is the complete economic collapse of that block in Washington DC really a price worth paying to end segregation? Is the decline of Black America into a dependent feral state really worth the superficial integration and pretend equality it now enjoys?</p><p>One has to ask the question, at what point is the price of this social progress too high? Do we really have to wait until Africans are raping infants and butchering people on the street in order to practice mutu before we decide that perhaps they should not be permitted to live amongst us? Do we really have to wait until Jews own 100 percent of all the corporations and real estate before we decide that perhaps they should not be permitted to engage in usury? Do we really have to wait before Muslims impose sharia across the entire West before we decide that Charles Martel and the Spanish reconquistadors had the right idea? Do we really need to permit the Chinese to take 100 percent of the college enrollment before we decide that submitting to the rule of a Chinese provincial elite is not in our best interests?</p><p>Obviously, all of these things cannot happen; each one tends to preclude the others. But the point remains: how far is too far? The reactionary says: things have gone too far. The cuckservative says: things haven’t gone so far that it is worth risking the possibility that someone will call me racist.</p><p>Of course, the fact that Rod Dreher and Andrew Sullivan are beginning to openly admit that there is a point to “neoreaction” is an early indicator that even the cuckservatives are beginning to crack. It is already clear to everyone that the liberal democratic order has failed. Sooner, rather than later, even the cuckiest of cucks will be forced to acknowledge that what they once considered enlightened moral and social progress is, in fact, dyscivilizational regress.</p><p>Soon we will all be Alt-Right.</p></div>",
  "content_text": "Two National Review cucks\nadmit some sympathy\nfor the “reactionaries”:\nAndrew Sullivan:\nAnd is it any wonder that reactionaries are gaining strength? Within the space of 50 years, America has gone from segregation to dizzying multiculturalism; from traditional family structures to widespread divorce, cohabitation, and sexual liberty; from a few respected sources of information to an endless stream of peer-to-peer media; from careers in one company for life to an ever-accelerating need to retrain and regroup; from a patriarchy to (incomplete) gender equality; from homosexuality as a sin to homophobia as a taboo; from Christianity being the common culture to a secularism no society has ever sustained before ours.\nRod Dreher: I give Sullivan a lot of credit here. It hardly needs to be pointed out that he, as a gay man, has been one of the great beneficiaries of these changes. Yet he recognizes the staggering revolutionary nature of these changes — and, because he doesn’t believe that his homosexuality is the only relevant part of his identity, he also feels the loss of the old world, to a certain extent. He grasps the self-serving delusion embraced by so many Westerners today: that progress is not only inevitable, but always a good thing. Indeed, that’s why they call it “progress.”\nBut what if the changes are not progress at all, but rather regress?\nTo call it “progress” is to have a fixed goal in mind, and to believe that we are steadily moving in that inevitable direction. The British political philosopher John Gray has powerfully criticized the modern view of progress, calling it (rightly) a secularization of the Christian belief that history is headed toward a fixed conclusion. Marxism adopted this worldview, and reframed the End of History as the realization of Full Communism, and the withering of the State. Progressives today, both of the liberal and conservative variety, accept unthinkingly that history is moving towards a global paradise of free markets and free individuals all exercising maximal Choice. In this sense, there is less difference between Ronald Reagan and Hillary Clinton than between Ronald Reagan and a contemporary reactionary.\nSully is not, however, a neoreactionary:\nSullivan:\nThis, of course, is not to defend the neo-reactionary response. Their veiled racism is disturbing, and their pessimism a solipsistic pathology. When Anton finds nothing in modernity to celebrate but, as he put it to me, “nice restaurants, good wine, a high standard of living,” it comes off as a kind of pose, deliberately blind to all the constant renewals of life and culture around us. When Houellebecq has one of his characters sigh, “For a man to bring a child into the world now is meaningless,” I chortle. When Dreher hyperventilates that today’s youngsters “could be one of the last generations of this thing called Western civilization” and that American Christians today must “live lives prepared to suffer severe hardship, even death, for our faith,” I take my dogs for a walk. When Yarvin insists that “if the 20th century does not go down in history as the golden age of awful government, it is only because the future holds some fresher hell for us,” I check my Instagram account. There is something hysterical here, too manically certain, bleaker than any human being can bear for long.\nWell, to be clear, I don’t at all agree with Yarvin or Houellebecq, and I don’t think I agree with Anton either. Only a few years before I was born, in my Southern town apartheid was legal, and black citizens lived under a reign of terror. I’m serious: read this 1964 magazine article describing events in my own town.  A few years back, I met three Freedom Riders who had been part of those events. It really happened. Thank God those days are over.\nYet we cannot easily dismiss the words that a melancholy older black man, a taxi driver, said to me in 1993 as he drove me down a decimated avenue of Washington, DC, which was then at the peak of its murder epidemic. He told me about what it was like for him growing up in segregated DC. He pointed to storefronts and buildings that were now vacant and decaying. “That was a bakery, and that was a drugstore,” he said. “Black-owned. We had something back then.” On and on he went, describing the way this blasted-out part of town looked in his youth, and cursing the young black men who do nothing but sell drugs and shoot each other. I squirmed in the back seat listening to this older black man tell these stories to me, a young white man, but he didn’t hold back. I got the feeling that he wasn’t even paying attention to me, but was rather just musing aloud. He ended by telling me that he wasn’t sure at all that there had been progress. Yes, segregation was gone, but look around you, son, at what we black folks in DC have lost in the last thirty years.\nThat is a reactionary sentiment. And it’s important. I did not experience that old black taxi driver calling for the return of segregation, or lamenting its passing. I experienced him as a man aware of  human tragedy. The progressive narrative requires that the old man’s views be suppressed. But he knew what he saw all around him.\nIt’s really rather remarkable what these self-styled conservatives are willing to give up so that no one will call them, or their society, racist. Is the complete economic collapse of that block in Washington DC really a price worth paying to end segregation? Is the decline of Black America into a dependent feral state really worth the superficial integration and pretend equality it now enjoys?\nOne has to ask the question, at what point is the price of this social progress too high? Do we really have to wait until Africans are raping infants and butchering people on the street in order to practice mutu before we decide that perhaps they should not be permitted to live amongst us? Do we really have to wait until Jews own 100 percent of all the corporations and real estate before we decide that perhaps they should not be permitted to engage in usury? Do we really have to wait before Muslims impose sharia across the entire West before we decide that Charles Martel and the Spanish reconquistadors had the right idea? Do we really need to permit the Chinese to take 100 percent of the college enrollment before we decide that submitting to the rule of a Chinese provincial elite is not in our best interests?\nObviously, all of these things cannot happen; each one tends to preclude the others. But the point remains: how far is too far? The reactionary says: things have gone too far. The cuckservative says: things haven’t gone so far that it is worth risking the possibility that someone will call me racist.\nOf course, the fact that Rod Dreher and Andrew Sullivan are beginning to openly admit that there is a point to “neoreaction” is an early indicator that even the cuckservatives are beginning to crack. It is already clear to everyone that the liberal democratic order has failed. Sooner, rather than later, even the cuckiest of cucks will be forced to acknowledge that what they once considered enlightened moral and social progress is, in fact, dyscivilizational regress.\nSoon we will all be Alt-Right.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-03T08:57:00+00:00"
}