{
  "url": "https://voxday.net/2017/05/02/like-monkeys-studying-space-shuttle/",
  "scraped_at": "2025-12-18T07:12:27.670735",
  "title": "Like monkeys studying the space shuttle",
  "date_display": "May 2, 2017",
  "date_iso": "2017-05-02T10:32:00+00:00",
  "date_from_url": "2017-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I will say this for New York Magazine. They certainly expended no shortage of man-hours and digital ink on <a href=\"http://nymag.com/daily/intelligencer/2017/04/beyond-alt-understanding-the-new-far-right.html\">a long and detailed piece about the Alt-Right</a> by Simon Van Zuylen-Wood, Noreen Malone, Max Read, Andrew Sullivan, Park Macdougald, Jason Willick, Mark Jacobson, Maureen O’Connor, Gabriel Sherman, Ben Crair, Nick Richardson, and Mark O’connell with Claire Landsbaum, Jordan Larson, Amelia Schonbek, Matt Stieb, Nick Tabor, James D. Walsh:</p><blockquote><p> To understand this new right, it helps to see it not as a fringe movement, but a powerful counterculture.</p><p>When did the right wing get so bizarre? Consider: For a brief and confusing moment earlier this year, milk somehow became a charged symbol of both white supremacy and support for Donald Trump. The details are postmodern, absurdist, and ominous — not unlike the forces that brought them about. In January, the actor Shia LaBeouf mounted an art installation designed to protest the president. The next month, neo-Nazis who organized on the message board 4chan crashed the show, where they started chugging from milk jugs — because northern Europeans digest milk well, or because milk is … white. In other words, an innocent dairy beverage as old as time had been conscripted as a Donald Trump surrogate on the internet. It was yet another message-board in-joke — freighted with political meaning — suddenly in the news.</p><p>But weirdness, perhaps, is what happens when a movement grows very quickly and without any strong ideological direction — from a disciplined party, from traditional institutions like churches and chambers of Congress, from anything more organized than the insurrectionist internet.</p><p>Here in America, in trying to describe our brand of the reactionary wave currently tsunami-ing the entire developed world, we’ve leaned on the term alt-right, which had been coined by white supremacists. Richard Spencer, the most press-hungry of that group, takes credit for it. For much of last year, the term was often used as shorthand for “racists, but … young?” Which is helpful, as far as it goes, but the full reality is much more complicated. The alt-right — or the new right, if you prefer to sound more like Tom Wolfe than Kurt Cobain, or the radical right, to properly acknowledge its break from mainstream conservatism — is a coalition comprised of movements like neo-reaction, certain strands of libertarianism, tech triumphalism, and even the extreme-populist wing of the Republican Party. All share with Spencer’s white-ethno-nativism the ideals of isolationism, protectionism, and nationalism: a closed nation-state. Along the way, the coalition swept up “men’s rights” advocates and anti-Semites and cruel angry teenagers and conspiracy theorists and a few fiendishly clever far-right websites and harassing hashtags and even a U.S. congressman or two. Not to mention the White House.</p><p>But to approach the big messy tent of the new retrograde right — the international brigade of nativist-nationalists, tech-savvy anti-globalists, the porn-loving gender traditionalists — as primarily a political movement is to wildly underestimate its scope. Reactionary energy helped deliver all three branches of government to a Republican Party in the grips of an alt-right-curious anti-PC bomb-thrower the faithful called their “god-emperor” (or at least helped him along with last year’s affirmative action for white people, a.k.a. the Electoral College). But at no point during the campaign, even, could you have mistaken the unruly energy on the right for anything so organized as a party or as purposeful as a protest movement. It was — and is — a counterculture. One formed in the spirit of opposition to everything the existing Establishment stood for: globalist, technocratic liberal elitism. The amazing thing is, in November, for the first time in American electoral history, the counterculture won everything.</p></blockquote><p>It’s the usual discredit-diminish-and-disqualify hit piece, of course. And while people have noticed some curious omissions – <i>Guess whose name does not appear in a huge 20-part article on the Alt Right?  Hint: he’s the author of 16 Points of the Alt Right.</i> – the much more serious flaw is the near-complete unwillingness of the 20 or so authors to actually quote anyone who is Alt-Right, or even in the Alt-Right’s orbit, about what it is and what it stands for.</p><p><a href=\"http://www.acting-man.com/blog/media/2017/04/emperor-T.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.acting-man.com/blog/media/2017/04/emperor-T.jpg\" width=\"320\"/></a>Instead, they all ran out to get quotes from academics and others openly hostile to the Alt-Right, in order to better pontificate to their readers about what it is they think we believe and why we pose such a dire threat to the established political order. It’s rather like the sort of college course that is designed to provide the course taker with the sense that he knows the subject matter without actually teaching him anything about it. The one thing the small army of co-authors did get right, however, is to observe the fact that the Alt-Right is both a broad-based cultural phenomenon and a nationalist political philosophy, not a “branded movement” or a specific ideology.</p><p>It’s a pity that no one thought to send any of these indefatigable ideological spelunkers <a href=\"http://www.milobookclub.com/2016/11/24/alt-right-what-it-is/\">the version of the 16 Points</a> best suited to their ability to understand the Alt-Right. And considering on their bizarre musings about the term <i>cuckservative</i>, you’d think it would have occurred to one of them to at least <a href=\"http://amzn.to/1tkcuFi\">check Amazon</a>. But the most egregious failure is without question their inexplicable inability to grasp the source of the God-Emperor meme.</p><p>Speaking of the <i><a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">16 Points of the Alt-Right</a></i>, I should mention that I finally got the Ukrainian translation posted earlier today, as well as the Esperanto and Irish translations. You can find them on the right sidebar as UK, EO, and GA.</p></div>",
  "content_text": "I will say this for New York Magazine. They certainly expended no shortage of man-hours and digital ink on\na long and detailed piece about the Alt-Right\nby Simon Van Zuylen-Wood, Noreen Malone, Max Read, Andrew Sullivan, Park Macdougald, Jason Willick, Mark Jacobson, Maureen O’Connor, Gabriel Sherman, Ben Crair, Nick Richardson, and Mark O’connell with Claire Landsbaum, Jordan Larson, Amelia Schonbek, Matt Stieb, Nick Tabor, James D. Walsh:\nTo understand this new right, it helps to see it not as a fringe movement, but a powerful counterculture.\nWhen did the right wing get so bizarre? Consider: For a brief and confusing moment earlier this year, milk somehow became a charged symbol of both white supremacy and support for Donald Trump. The details are postmodern, absurdist, and ominous — not unlike the forces that brought them about. In January, the actor Shia LaBeouf mounted an art installation designed to protest the president. The next month, neo-Nazis who organized on the message board 4chan crashed the show, where they started chugging from milk jugs — because northern Europeans digest milk well, or because milk is … white. In other words, an innocent dairy beverage as old as time had been conscripted as a Donald Trump surrogate on the internet. It was yet another message-board in-joke — freighted with political meaning — suddenly in the news.\nBut weirdness, perhaps, is what happens when a movement grows very quickly and without any strong ideological direction — from a disciplined party, from traditional institutions like churches and chambers of Congress, from anything more organized than the insurrectionist internet.\nHere in America, in trying to describe our brand of the reactionary wave currently tsunami-ing the entire developed world, we’ve leaned on the term alt-right, which had been coined by white supremacists. Richard Spencer, the most press-hungry of that group, takes credit for it. For much of last year, the term was often used as shorthand for “racists, but … young?” Which is helpful, as far as it goes, but the full reality is much more complicated. The alt-right — or the new right, if you prefer to sound more like Tom Wolfe than Kurt Cobain, or the radical right, to properly acknowledge its break from mainstream conservatism — is a coalition comprised of movements like neo-reaction, certain strands of libertarianism, tech triumphalism, and even the extreme-populist wing of the Republican Party. All share with Spencer’s white-ethno-nativism the ideals of isolationism, protectionism, and nationalism: a closed nation-state. Along the way, the coalition swept up “men’s rights” advocates and anti-Semites and cruel angry teenagers and conspiracy theorists and a few fiendishly clever far-right websites and harassing hashtags and even a U.S. congressman or two. Not to mention the White House.\nBut to approach the big messy tent of the new retrograde right — the international brigade of nativist-nationalists, tech-savvy anti-globalists, the porn-loving gender traditionalists — as primarily a political movement is to wildly underestimate its scope. Reactionary energy helped deliver all three branches of government to a Republican Party in the grips of an alt-right-curious anti-PC bomb-thrower the faithful called their “god-emperor” (or at least helped him along with last year’s affirmative action for white people, a.k.a. the Electoral College). But at no point during the campaign, even, could you have mistaken the unruly energy on the right for anything so organized as a party or as purposeful as a protest movement. It was — and is — a counterculture. One formed in the spirit of opposition to everything the existing Establishment stood for: globalist, technocratic liberal elitism. The amazing thing is, in November, for the first time in American electoral history, the counterculture won everything.\nIt’s the usual discredit-diminish-and-disqualify hit piece, of course. And while people have noticed some curious omissions –\nGuess whose name does not appear in a huge 20-part article on the Alt Right?  Hint: he’s the author of 16 Points of the Alt Right.\n– the much more serious flaw is the near-complete unwillingness of the 20 or so authors to actually quote anyone who is Alt-Right, or even in the Alt-Right’s orbit, about what it is and what it stands for.\nInstead, they all ran out to get quotes from academics and others openly hostile to the Alt-Right, in order to better pontificate to their readers about what it is they think we believe and why we pose such a dire threat to the established political order. It’s rather like the sort of college course that is designed to provide the course taker with the sense that he knows the subject matter without actually teaching him anything about it. The one thing the small army of co-authors did get right, however, is to observe the fact that the Alt-Right is both a broad-based cultural phenomenon and a nationalist political philosophy, not a “branded movement” or a specific ideology.\nIt’s a pity that no one thought to send any of these indefatigable ideological spelunkers\nthe version of the 16 Points\nbest suited to their ability to understand the Alt-Right. And considering on their bizarre musings about the term\ncuckservative\n, you’d think it would have occurred to one of them to at least\ncheck Amazon\n. But the most egregious failure is without question their inexplicable inability to grasp the source of the God-Emperor meme.\nSpeaking of the\n16 Points of the Alt-Right\n, I should mention that I finally got the Ukrainian translation posted earlier today, as well as the Esperanto and Irish translations. You can find them on the right sidebar as UK, EO, and GA.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-02T09:32:00+00:00"
}