{
  "url": "https://voxday.net/2017/05/23/mailvox-breivik-saint-or-monster/",
  "scraped_at": "2025-12-18T07:15:20.246020",
  "title": "Mailvox: Breivik: saint or monster?",
  "date_display": "May 23, 2017",
  "date_iso": "2017-05-23T15:50:00+00:00",
  "date_from_url": "2017-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Norwegian asks about St. Breivik:</p><blockquote><p> What I still not have clear for me, is your standing concerning AB Breivik, and that actually troubles me somehow. I am self a Norwegian, I live in Oslo, and what happened 22/7/11 made a deep and difficult impression on my mind. Breivik shot down in cold blood 69 people on that island, and the majority of the victims were  teenagers (children, I could say), which «guilt» was to be an offspring of a member of the social democrat party (Arbeiderpartiet). I have indirectly heard an eyewitness reporting about a child scared to death, and with blood pouring from a wound in the throat while slowly dying.</p><p>For me, Breivik doesn’t represent any positive and decent quality, and he neither represent any legitimate way of doing resistance against a fallen political class and elite. Maybe I have misunderstood, but if you somehow make a hero out of Breivik, that makes it so difficult for me to do what I much would like to do: to make you one of several good teachers in my life.</p><p>Somehow I can look at Breivik (and other terrorists) as (almost impersonal) expressions of tidal waves in our history. But simultaneously, I can do nothing else than look at their actual actions as utterly horrific. As I see it (and feel it), no one devout to God would never ever could have done what Breivik did, and no one would neither could defend his actions.</p></blockquote><p>First, let me say that I have family members who are a) devout Christians, b) good men, and c) are responsible for killing considerably more people than Anders Breivik. I also have a number of friends whose confirmed kills are in double-digits. Nor am I at all persuaded by the notion that the God who loved David, who slew “his ten thousands”, or the Jesus who praised the faith of the Roman centurion, is anywhere nearly as appalled by war as most men would like to believe.</p><p>From a philosophical perspective, I tend to regard the Norwegians, and the “Norwegians”, killed by Breivik as having been more culpable on average than the average Japanese, Korean, or Chinese infantryman were. And don’t forget, the Viet Cong were no more professional soldiers than were the Quisling Youth on Utoya, <i><a href=\"https://cherrieswriter.wordpress.com/2016/03/08/8-facts-about-the-vietnam-war-from-a-former-viet-cong-soldier/\">and most of them were even younger</a></i>.</p><p>Breivik did not target innocents. He didn’t attack teenagers at a pop concert or families enjoying a night out on a public promenade. He struck a highly effective blow against the political machine that <i>is still actively engaged</i> in attacking his people and attempting to eradicate them. If you don’t believe violence is a legitimate way of resisting invasion, if you don’t think that making war on those making war on you is permissible, that’s your prerogative, but your opinion is both ahistorical and irrelevant.</p><p>The fact is that Anders Breivik not only gave up his freedom to strike back at the quislings who are actively seeking to destroy your nation and your people, but he did so alone, and in the full knowledge that he would be hated for it by many of the very people he sought to save.</p><p>You may recall that someone once said something about the quality of the love that such a self-sacrifice requires. Can you <i>honestly </i>say that it was nothing but simple hatred that inspired him?</p><p>Of course, those who are not religious cannot fathom that kind of love, which is why they simply deem him mad, and a monster, and try to avoid thinking about the future. I don’t expect you to simply accept my perspective, but it might give you some food for further thought. While he did a terrible thing, it is far more terrible that he was put into a position where he felt the need to do it in the first place. Focus your anger, and your disgust, for those who knowingly created the untenable situation.</p><p>In any event, my expectation is that if the West, and Norway, survive the ongoing clash of civilizations, Breivik will be considered its first hero. And if it does not, well, then Breivik will be regarded in much the same way that Robert E. Lee, Jefferson Davis, and P.G.T. Beauregard are presently regarded in New Orleans, as an evil monster who was “on the wrong side of humanity.”</p><p>And just to be clear for the excessively slow, although I am not a Catholic, I am aware that Mr. Breivik has not died, been beatified, or canonized. Nor do I believe in praying to intercessors.</p><p> UPDATE: It is clear to me that a few readers here simply do not understand what war is. I direct your attention to Clausewitz and ask you this: was Breivik practicing “politics by other means” or not?</p></div>",
  "content_text": "A Norwegian asks about St. Breivik:\nWhat I still not have clear for me, is your standing concerning AB Breivik, and that actually troubles me somehow. I am self a Norwegian, I live in Oslo, and what happened 22/7/11 made a deep and difficult impression on my mind. Breivik shot down in cold blood 69 people on that island, and the majority of the victims were  teenagers (children, I could say), which «guilt» was to be an offspring of a member of the social democrat party (Arbeiderpartiet). I have indirectly heard an eyewitness reporting about a child scared to death, and with blood pouring from a wound in the throat while slowly dying.\nFor me, Breivik doesn’t represent any positive and decent quality, and he neither represent any legitimate way of doing resistance against a fallen political class and elite. Maybe I have misunderstood, but if you somehow make a hero out of Breivik, that makes it so difficult for me to do what I much would like to do: to make you one of several good teachers in my life.\nSomehow I can look at Breivik (and other terrorists) as (almost impersonal) expressions of tidal waves in our history. But simultaneously, I can do nothing else than look at their actual actions as utterly horrific. As I see it (and feel it), no one devout to God would never ever could have done what Breivik did, and no one would neither could defend his actions.\nFirst, let me say that I have family members who are a) devout Christians, b) good men, and c) are responsible for killing considerably more people than Anders Breivik. I also have a number of friends whose confirmed kills are in double-digits. Nor am I at all persuaded by the notion that the God who loved David, who slew “his ten thousands”, or the Jesus who praised the faith of the Roman centurion, is anywhere nearly as appalled by war as most men would like to believe.\nFrom a philosophical perspective, I tend to regard the Norwegians, and the “Norwegians”, killed by Breivik as having been more culpable on average than the average Japanese, Korean, or Chinese infantryman were. And don’t forget, the Viet Cong were no more professional soldiers than were the Quisling Youth on Utoya,\nand most of them were even younger\n.\nBreivik did not target innocents. He didn’t attack teenagers at a pop concert or families enjoying a night out on a public promenade. He struck a highly effective blow against the political machine that\nis still actively engaged\nin attacking his people and attempting to eradicate them. If you don’t believe violence is a legitimate way of resisting invasion, if you don’t think that making war on those making war on you is permissible, that’s your prerogative, but your opinion is both ahistorical and irrelevant.\nThe fact is that Anders Breivik not only gave up his freedom to strike back at the quislings who are actively seeking to destroy your nation and your people, but he did so alone, and in the full knowledge that he would be hated for it by many of the very people he sought to save.\nYou may recall that someone once said something about the quality of the love that such a self-sacrifice requires. Can you\nhonestly\nsay that it was nothing but simple hatred that inspired him?\nOf course, those who are not religious cannot fathom that kind of love, which is why they simply deem him mad, and a monster, and try to avoid thinking about the future. I don’t expect you to simply accept my perspective, but it might give you some food for further thought. While he did a terrible thing, it is far more terrible that he was put into a position where he felt the need to do it in the first place. Focus your anger, and your disgust, for those who knowingly created the untenable situation.\nIn any event, my expectation is that if the West, and Norway, survive the ongoing clash of civilizations, Breivik will be considered its first hero. And if it does not, well, then Breivik will be regarded in much the same way that Robert E. Lee, Jefferson Davis, and P.G.T. Beauregard are presently regarded in New Orleans, as an evil monster who was “on the wrong side of humanity.”\nAnd just to be clear for the excessively slow, although I am not a Catholic, I am aware that Mr. Breivik has not died, been beatified, or canonized. Nor do I believe in praying to intercessors.\nUPDATE: It is clear to me that a few readers here simply do not understand what war is. I direct your attention to Clausewitz and ask you this: was Breivik practicing “politics by other means” or not?",
  "tags": [
    "philosophy",
    "religion",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-23T14:50:00+00:00"
}