{
  "url": "https://voxday.net/2017/05/30/the-happiest-day/",
  "scraped_at": "2025-12-18T07:16:12.177957",
  "title": "The happiest day",
  "date_display": "May 30, 2017",
  "date_iso": "2017-05-30T12:00:00+00:00",
  "date_from_url": "2017-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is, without question, the happiest day of Rod Dreher’s life. <a href=\"http://www.theamericanconservative.com/dreher/black-like-me-dreher-dna/\">NO ONE WILL EVER CALL HIM RACIST AGAIN!</a></p><blockquote><p> This is amazing information. Focusing on the slave ancestor, this means that under the so-called “one drop rule” that was the law in some Southern states in Jim Crow times, I and my children would have been considered black, and subjected to segregation and persecution. Of course it’s highly unlikely that anyone would have known, not even us back then. Our physical appearance is, um, very white. But had genetic testing been around at that time, and had my ancestors been subject to it, the state would have learned that despite the whiteness of their skin, some of them were black, according to the law, and treated them unjustly.</p><p>I don’t know if my slave ancestor descends from my maternal or paternal line. My father is dead, but my mother is alive. I hope she will do the 23andme test to see what her ancestry is. That will tell me which line my African grandparent came from. Still, it’s almost certain that some of my ancestors fought a war whose goal in large part was to keep descendants of other ancestors enslaved. Genetically speaking, the story of the African slaves in North America is my story and my children’s story, too. And somewhere in this country, I may have black distant cousins alive today.</p></blockquote><p>Amazing indeed. Speaking as someone who is considerably more American Indian than Rod is African-American, I regret to inform him that it doesn’t actually work that way.</p><p>But nevertheless, I’d like to sincerely congratulate Mr. Dreher on his newly discovered blackness. This fraction of a percent of African DNA he possesses absolutely trumps a wife’s black son, a mulatto grandchild, a predilection for black men, or a token black adoptee. Take that, Rick Wilson and Nick Searcy! Try as you might, <i>you can’t outcuck the Cuckmeister</i>.</p></div>",
  "content_text": "This is, without question, the happiest day of Rod Dreher’s life.\nNO ONE WILL EVER CALL HIM RACIST AGAIN!\nThis is amazing information. Focusing on the slave ancestor, this means that under the so-called “one drop rule” that was the law in some Southern states in Jim Crow times, I and my children would have been considered black, and subjected to segregation and persecution. Of course it’s highly unlikely that anyone would have known, not even us back then. Our physical appearance is, um, very white. But had genetic testing been around at that time, and had my ancestors been subject to it, the state would have learned that despite the whiteness of their skin, some of them were black, according to the law, and treated them unjustly.\nI don’t know if my slave ancestor descends from my maternal or paternal line. My father is dead, but my mother is alive. I hope she will do the 23andme test to see what her ancestry is. That will tell me which line my African grandparent came from. Still, it’s almost certain that some of my ancestors fought a war whose goal in large part was to keep descendants of other ancestors enslaved. Genetically speaking, the story of the African slaves in North America is my story and my children’s story, too. And somewhere in this country, I may have black distant cousins alive today.\nAmazing indeed. Speaking as someone who is considerably more American Indian than Rod is African-American, I regret to inform him that it doesn’t actually work that way.\nBut nevertheless, I’d like to sincerely congratulate Mr. Dreher on his newly discovered blackness. This fraction of a percent of African DNA he possesses absolutely trumps a wife’s black son, a mulatto grandchild, a predilection for black men, or a token black adoptee. Take that, Rick Wilson and Nick Searcy! Try as you might,\nyou can’t outcuck the Cuckmeister\n.",
  "tags": [
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-30T11:00:00+00:00"
}