{
  "url": "https://voxday.net/2017/05/29/the-war-on-frats/",
  "scraped_at": "2025-12-18T07:16:05.204454",
  "title": "The war on frats",
  "date_display": "May 29, 2017",
  "date_iso": "2017-05-29T16:11:00+00:00",
  "date_from_url": "2017-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Zman makes an important observation concerning <a href=\"http://thezman.com/wordpress/?p=10395\">how SJWs arrange to put themselves in authority</a> over others, usually with the help of foolish moderates:</p><blockquote><p> The war on fraternities is also a good study of how the Left operates to undermine traditional institutions. It used to be that frats were self-funded, independent organizations. In many cases, they operated off campus to avoid trouble with college authorities. Those Penn State frats, for example, are off-campus in privately owned houses. This arms-length relationship started to end when colleges “offered” to help the frats collect dues and enforce their rules. Fraternity payments became a part of the tuition bill.</p><p>What was pitched as a goodwill gesture to help fraternities, quickly turned into a beachhead for Progressive nutters to impose their rules. The Prog mind always seeks to first gain entry into the organization. From there, they begin to agitate for changes that open the door for their coreligionists. In the case of fraternities, they imposed rules on how the frats select members and maintain discipline. Colleges are now beginning the process of forcing fraternities to admit women, thus eliminating their reason to exist.</p><p>There are two lessons to be drawn from the jihad against white men on campus. One is that there can never be any negotiating with the Progs. A negotiation means both sides seek a resolution, but Progs seek only one end and that is your death, even if it means their death. Whatever American Progressivism was in the past, it is now a nihilistic death cult. The Progs sitting down with the campus frats to work out rules, do so with a singular goal and that is the elimination of white males from the college campus.</p><p>The other thing is Progs enjoy their own hypocrisy. They relish it, so pointing it out to them has the opposite effect from what is intended. The defenders of Greek life point out that male sportsballers tend to go rapey on campus, yet no one is trying to shut down the football team. Progs find this energizing. It means they are in control and therefore can arbitrarily enforce the rules. Appeals to administrative consistency are blood in the water for the Progs.</p></blockquote><p>Always, always, <i>always </i>be extremely suspicious of those who are eager to help you somehow. We’re very careful with our volunteers, and wary of giving them too much responsibility too soon, for precisely this reason.</p></div>",
  "content_text": "The Zman makes an important observation concerning\nhow SJWs arrange to put themselves in authority\nover others, usually with the help of foolish moderates:\nThe war on fraternities is also a good study of how the Left operates to undermine traditional institutions. It used to be that frats were self-funded, independent organizations. In many cases, they operated off campus to avoid trouble with college authorities. Those Penn State frats, for example, are off-campus in privately owned houses. This arms-length relationship started to end when colleges “offered” to help the frats collect dues and enforce their rules. Fraternity payments became a part of the tuition bill.\nWhat was pitched as a goodwill gesture to help fraternities, quickly turned into a beachhead for Progressive nutters to impose their rules. The Prog mind always seeks to first gain entry into the organization. From there, they begin to agitate for changes that open the door for their coreligionists. In the case of fraternities, they imposed rules on how the frats select members and maintain discipline. Colleges are now beginning the process of forcing fraternities to admit women, thus eliminating their reason to exist.\nThere are two lessons to be drawn from the jihad against white men on campus. One is that there can never be any negotiating with the Progs. A negotiation means both sides seek a resolution, but Progs seek only one end and that is your death, even if it means their death. Whatever American Progressivism was in the past, it is now a nihilistic death cult. The Progs sitting down with the campus frats to work out rules, do so with a singular goal and that is the elimination of white males from the college campus.\nThe other thing is Progs enjoy their own hypocrisy. They relish it, so pointing it out to them has the opposite effect from what is intended. The defenders of Greek life point out that male sportsballers tend to go rapey on campus, yet no one is trying to shut down the football team. Progs find this energizing. It means they are in control and therefore can arbitrarily enforce the rules. Appeals to administrative consistency are blood in the water for the Progs.\nAlways, always,\nalways\nbe extremely suspicious of those who are eager to help you somehow. We’re very careful with our volunteers, and wary of giving them too much responsibility too soon, for precisely this reason.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-29T15:11:00+00:00"
}