{
  "url": "https://voxday.net/2017/05/05/the-strength-of-argumen/",
  "scraped_at": "2025-12-18T07:12:55.551056",
  "title": "The strength of an argument",
  "date_display": "May 5, 2017",
  "date_iso": "2017-05-05T10:22:00+00:00",
  "date_from_url": "2017-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://startingstrength.com/article/the-truth-about-the-starting-strength-method\">In a recent article</a>, well-known strength guru Mark Rippetoe quoted my recent comments about the known unreliability of science in light of the recent series of scandals concerning fraudulent peer review. This generated a modicum of, if not hilarity, at least hysteria.</p><blockquote class=\"tr_bq\"><p> The blogger Vox Day in his recent column makes an excellent point about published “science” and the peer-review process that generates it. In the field of the “exercise sciences” in particular we find an astonishing paucity of truly useful information with which to improve human performance. Instead, we rely on what is essentially an “engineering” approach – the application of physiology (the general-kind, not the exercise-kind), arithmetic, logic, analysis, and experience tempered by observation and constant adjustment for process optimization to the problem of how to improve human performance. The application of these engineering principles to the problem of human performance has yielded the Starting Strength Method, which is testable, reliable science.</p></blockquote><p>One thing that many people, both scientists and uncredentialed laymen fail to understand is that science is not, fundamentally, about <i>knowledge</i>. It primarily concerns <i>understanding</i>. What Rippetoe is saying here is that in the field of exercise science, men like him know what works and what doesn’t. The paucity of “truly useful information” to which he refers is the deeper scientific understanding required to further improve upon what is already known.</p><p>The primary utility of science is not being able to say that something works, much less to make something work, but rather, to explain why it works. Or, conversely, to explain why something should work if the theory is put into application. This, of course, is why it is so easy for non-scientists to detect scientific fraud; when the theory is put into application and it fails, this is fairly strong evidence that the theory, i.e. the science, is incorrect.</p><p>Engineering is the acid test of science.</p><p>However, as I said, many people don’t understand what science is, or comprehend its limits. To them, it is simply a form of secular magic that must be completely trusted <i>or it will stop working. </i>Which, one presumes, might explain <a href=\"http://startingstrength.com/resources/forum/articles-and-platform-videos/73246-truth-starting-strength-method.html\">the hysterical reaction from several of Rippetoe’s readers</a> to the mention of my name like a vampire unexpectedly encountering garlic.</p><blockquote class=\"tr_bq\"><p> Vox Day? Who is this clown and how does he have an opinion about the peer review process for publishing scientific articles? Many journals publish reviewer comments as well as the author response. If you want to understand peer review without actually doing science and going through the publishing process, look at the reviews for an article in an open source journal. Here is an example: https://elifesciences.org/content/5/e20797 (scroll down to ‘Decision letter’ and ‘Author response’). Vox Day wouldn’t understand a single sentence of this correspondence, so his criticism of the peer-review process as well as his interpretation of the distinction between science and engineering is useless. Science is not about ‘credentials’; it is about experimental DATA! The real currency of science is data—a Nobel Laureate’s theory can be proven wrong by a first-year grad student with data. </p></blockquote><p>That all sounds very nice in theory, but like every other human endeavor, science is given to corruption and fraud. Nor does his handwaving refute anything that I said, or anything that the article to which I linked – and which he obviously did not read – said. Furthermore, his statement that science is about DATA, not credentials, is precisely why my terms for the different aspects of science are necessary. Scientody may concern data, but one won’t get very far in scientistry without credentials these days.</p><p>It’s also telling that while he feigns not knowing who I am, he seems to have a surprisingly strong opinion on the limits of my understanding. Of course, we all know what the real issue is for the science fetishists. As always, they prove my point about the intrinsic unreliability of any human endeavor:</p><blockquote class=\"tr_bq\"><p> Vox Day is a really really bad example (or good, in the sense that he is extremely informative). Look at his stance on evolutionary biology — something I know a little about (not my field of science, I am a mathematician and computer scientist, but I’ve dabbled around). Because some people make errors in peer review, he sees this as *evidence* that the world was created 6000 years ago or so. (I may be misrepresenting and overstating his stance; this is for the purpose of illustrating his logic). Quoting a person who — by my humble opinion — is in dire need of psychiatric intervention is a bit of a disappointment to me.</p></blockquote><p>The problem with his “logic” is that not only is that not my stance on evolutionary biology, but I don’t believe there is any evidence that the world was created 6,000 years ago. I am not a Young Earth Creationist, I have never subscribed to Bishop Ussher’s estimate for the age of the Earth, and the so-called “logic” being illustrated has literally nothing to do with me or my simple observation that professional science is riddled with fraud and corruption. It’s really rather remarkable how these fetishists can work the Scopes Trial into anything that so much as tangentially references any aspect of science.</p><p>It’s even more remarkable that, on the mere basis of “dabbling around”, this gentlemen feels capable of assuming his own expertise in the very different fields of both evolutionary biology and psychiatry. But then, just as laymen seldom understand the limits of science, scientists seldom understand how foolish they look when they venture forth from the boundaries of their little specialties. No more so than when they unwisely, and apparently without even realizing it, wander into the realm of philosophy.</p><blockquote class=\"tr_bq\"><p> Vox Day’s comment makes it clear that he forms and expresses strong opinions about topics on which he has very limited, superficial knowledge—a quick ‘google scholar’ search shows that he has never published a scientific article. He didn’t even provide evidence or examples for any of his claims. He is the pretty much the exact opposite of the type of person I respect.</p></blockquote><p>The science fetishist always values evidence, valid or not, over mere truth. Which is ironic, given that the very metric upon which he relies, is,<i> as was pointed out in the original post</i>, not just intrinsically flawed, but known to be susceptible to fraud. What value is it to have published a scientific article when they are, statistically speaking, about as likely to be credible as a coin toss?</p><p>In any event, Rippetoe was having none of it, and indeed, seemed to be amused by the weird and feeble protests being offered.</p><blockquote><p> <i>I have huge admiration for Rip and was crushed to seem him propagate an anti-science message.</i></p><p>Here is the quote from the evil arch-nemesis of science Vox Day I used to introduce the piece:</p><p><i>All of the arguments about the presumed reliability of science are ridiculous and easily shown to be false. Science is no more “self-correcting” than accounting. Peer review is more commonly known as “proofreading” by the rest of the publishing industry and is not even theoretically a means of ensuring accuracy or correctness. And scientists are observably less trustworthy than nearly anyone except lawyers, politicians, and used car salesmen; at least prostitutes are honest about their pursuit of “grants” and “funding.” </i><i>These days, the scientific process is mainly honored in the breach by professional, credentialed scientists. And we have a word for testable, reliable science. That word is “engineering.”</i></p><p>What is it about this entirely accurate summary of the situation within the vast majority of the academic/governmental science establishment that leads you to be “crushed” by my use of this as analogy to what we’re doing in contrast to the ExFizz people?</p></blockquote><p>I don’t need to read a peer-reviewed scientific article to know that Mark Rippetoe knows whereof he speaks. Nor do I need to publish a peer-reviewed scientific article to speak the truth. These science fetishists are committing an all-too-common philosophical error when they try to substitute the measure of a thing for the thing itself.</p><p>Of course, those who have read <a href=\"http://amzn.to/1sBYA10\">SJWAL</a> know perfectly well what was actually being communicated beneath all the rhetoric as well as the purpose for it. This was merely an impromptu divide-and-discredit campaign meant to prevent the more dangerous party from being “qualified” by the more popular party.</p></div>",
  "content_text": "In a recent article\n, well-known strength guru Mark Rippetoe quoted my recent comments about the known unreliability of science in light of the recent series of scandals concerning fraudulent peer review. This generated a modicum of, if not hilarity, at least hysteria.\nThe blogger Vox Day in his recent column makes an excellent point about published “science” and the peer-review process that generates it. In the field of the “exercise sciences” in particular we find an astonishing paucity of truly useful information with which to improve human performance. Instead, we rely on what is essentially an “engineering” approach – the application of physiology (the general-kind, not the exercise-kind), arithmetic, logic, analysis, and experience tempered by observation and constant adjustment for process optimization to the problem of how to improve human performance. The application of these engineering principles to the problem of human performance has yielded the Starting Strength Method, which is testable, reliable science.\nOne thing that many people, both scientists and uncredentialed laymen fail to understand is that science is not, fundamentally, about\nknowledge\n. It primarily concerns\nunderstanding\n. What Rippetoe is saying here is that in the field of exercise science, men like him know what works and what doesn’t. The paucity of “truly useful information” to which he refers is the deeper scientific understanding required to further improve upon what is already known.\nThe primary utility of science is not being able to say that something works, much less to make something work, but rather, to explain why it works. Or, conversely, to explain why something should work if the theory is put into application. This, of course, is why it is so easy for non-scientists to detect scientific fraud; when the theory is put into application and it fails, this is fairly strong evidence that the theory, i.e. the science, is incorrect.\nEngineering is the acid test of science.\nHowever, as I said, many people don’t understand what science is, or comprehend its limits. To them, it is simply a form of secular magic that must be completely trusted\nor it will stop working.\nWhich, one presumes, might explain\nthe hysterical reaction from several of Rippetoe’s readers\nto the mention of my name like a vampire unexpectedly encountering garlic.\nVox Day? Who is this clown and how does he have an opinion about the peer review process for publishing scientific articles? Many journals publish reviewer comments as well as the author response. If you want to understand peer review without actually doing science and going through the publishing process, look at the reviews for an article in an open source journal. Here is an example: https://elifesciences.org/content/5/e20797 (scroll down to ‘Decision letter’ and ‘Author response’). Vox Day wouldn’t understand a single sentence of this correspondence, so his criticism of the peer-review process as well as his interpretation of the distinction between science and engineering is useless. Science is not about ‘credentials’; it is about experimental DATA! The real currency of science is data—a Nobel Laureate’s theory can be proven wrong by a first-year grad student with data.\nThat all sounds very nice in theory, but like every other human endeavor, science is given to corruption and fraud. Nor does his handwaving refute anything that I said, or anything that the article to which I linked – and which he obviously did not read – said. Furthermore, his statement that science is about DATA, not credentials, is precisely why my terms for the different aspects of science are necessary. Scientody may concern data, but one won’t get very far in scientistry without credentials these days.\nIt’s also telling that while he feigns not knowing who I am, he seems to have a surprisingly strong opinion on the limits of my understanding. Of course, we all know what the real issue is for the science fetishists. As always, they prove my point about the intrinsic unreliability of any human endeavor:\nVox Day is a really really bad example (or good, in the sense that he is extremely informative). Look at his stance on evolutionary biology — something I know a little about (not my field of science, I am a mathematician and computer scientist, but I’ve dabbled around). Because some people make errors in peer review, he sees this as *evidence* that the world was created 6000 years ago or so. (I may be misrepresenting and overstating his stance; this is for the purpose of illustrating his logic). Quoting a person who — by my humble opinion — is in dire need of psychiatric intervention is a bit of a disappointment to me.\nThe problem with his “logic” is that not only is that not my stance on evolutionary biology, but I don’t believe there is any evidence that the world was created 6,000 years ago. I am not a Young Earth Creationist, I have never subscribed to Bishop Ussher’s estimate for the age of the Earth, and the so-called “logic” being illustrated has literally nothing to do with me or my simple observation that professional science is riddled with fraud and corruption. It’s really rather remarkable how these fetishists can work the Scopes Trial into anything that so much as tangentially references any aspect of science.\nIt’s even more remarkable that, on the mere basis of “dabbling around”, this gentlemen feels capable of assuming his own expertise in the very different fields of both evolutionary biology and psychiatry. But then, just as laymen seldom understand the limits of science, scientists seldom understand how foolish they look when they venture forth from the boundaries of their little specialties. No more so than when they unwisely, and apparently without even realizing it, wander into the realm of philosophy.\nVox Day’s comment makes it clear that he forms and expresses strong opinions about topics on which he has very limited, superficial knowledge—a quick ‘google scholar’ search shows that he has never published a scientific article. He didn’t even provide evidence or examples for any of his claims. He is the pretty much the exact opposite of the type of person I respect.\nThe science fetishist always values evidence, valid or not, over mere truth. Which is ironic, given that the very metric upon which he relies, is,\nas was pointed out in the original post\n, not just intrinsically flawed, but known to be susceptible to fraud. What value is it to have published a scientific article when they are, statistically speaking, about as likely to be credible as a coin toss?\nIn any event, Rippetoe was having none of it, and indeed, seemed to be amused by the weird and feeble protests being offered.\nI have huge admiration for Rip and was crushed to seem him propagate an anti-science message.\nHere is the quote from the evil arch-nemesis of science Vox Day I used to introduce the piece:\nAll of the arguments about the presumed reliability of science are ridiculous and easily shown to be false. Science is no more “self-correcting” than accounting. Peer review is more commonly known as “proofreading” by the rest of the publishing industry and is not even theoretically a means of ensuring accuracy or correctness. And scientists are observably less trustworthy than nearly anyone except lawyers, politicians, and used car salesmen; at least prostitutes are honest about their pursuit of “grants” and “funding.”\nThese days, the scientific process is mainly honored in the breach by professional, credentialed scientists. And we have a word for testable, reliable science. That word is “engineering.”\nWhat is it about this entirely accurate summary of the situation within the vast majority of the academic/governmental science establishment that leads you to be “crushed” by my use of this as analogy to what we’re doing in contrast to the ExFizz people?\nI don’t need to read a peer-reviewed scientific article to know that Mark Rippetoe knows whereof he speaks. Nor do I need to publish a peer-reviewed scientific article to speak the truth. These science fetishists are committing an all-too-common philosophical error when they try to substitute the measure of a thing for the thing itself.\nOf course, those who have read\nSJWAL\nknow perfectly well what was actually being communicated beneath all the rhetoric as well as the purpose for it. This was merely an impromptu divide-and-discredit campaign meant to prevent the more dangerous party from being “qualified” by the more popular party.",
  "tags": [
    "philosophy",
    "science",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-05T09:22:00+00:00"
}