{
  "url": "https://voxday.net/2017/05/16/they-should-have-read-sjwa/",
  "scraped_at": "2025-12-18T07:14:25.618017",
  "title": "They should have read SJWAL",
  "date_display": "May 16, 2017",
  "date_iso": "2017-05-16T15:00:00+00:00",
  "date_from_url": "2017-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When I said no one is safe from SJW attack, I really meant NO ONE. Not even <a href=\"https://archive.fo/DK58r#selection-2433.0-2437.275\">an uber-PC gay punk genderqueer rock band</a> that uses bizarre pronouns and speaks fluent SJW about “taking up space” and “empowering” people.</p><p><a href=\"https://imgbb.com/\"><noscript><img alt=\"dec beach tweets\" border=\"0\" decoding=\"async\" src=\"https://image.ibb.co/bLnt6Q/dec_beach_tweets.jpg\"/></noscript><img alt=\"dec beach tweets\" border=\"0\" class=\"lazyload\" data-src=\"https://image.ibb.co/bLnt6Q/dec_beach_tweets.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></p><p>One guess as to how effective these apologies were…. Needless to say, the witch hunt continued, until a random woman made ALLEGATIONS about DOZENS OF INCIDENTS, including one in which Mx. Hopkins – <i>yes, seriously</i> – is alleged to have SMEARED MAKEUP on the face of a woman getting ready for a show WITHOUT CONSENT!</p><p>(Hold me, Ralph. I’m so triggered…. I feel faint.)</p><p>See, xou can be as gay and flamboyant and politically correct and pronoun-insane as one can possibly be. In the end, x’re still a WHITE MALE, xour actions of six years ago are problematic, and the thought police will be coming for xour career.</p><blockquote class=\"tr_bq\"><p> Since the allegations, initially posted to a private Facebook group and later on Twitter by a user known as Kitty Cordero-Kolin, several companies and musicians affiliated with the band have ended their relationships. An album-release show at Rough Trade in Brooklyn was canceled, and several artists who were slated to support PWR BTTM on its coming United States tour announced they will no longer participate. The band was also dropped by its management agency, Salty Artist Management. Polyvinyl, which put out “Pageant,” announced on Saturday it would no longer work with PWR BTTM, or sell or distribute its album, in hard copy and on streaming services. It will offer refunds to those who purchased “Pageant” from the label, and plans to make donations to two organizations that combat sexual and anti-LBGT violence.</p></blockquote><p>Now, I’m not shedding any tears for these two idiotic freaks. The SJWs can light xem on fire and throw xem off the top of the Empire State Building for all I care. But the point is that <i>no one</i>, no matter how hard one may supplicate and submit to the Narrative, is ever safe from the cultural revolutionaries of social justice.</p></div>",
  "content_text": "When I said no one is safe from SJW attack, I really meant NO ONE. Not even\nan uber-PC gay punk genderqueer rock band\nthat uses bizarre pronouns and speaks fluent SJW about “taking up space” and “empowering” people.\nOne guess as to how effective these apologies were…. Needless to say, the witch hunt continued, until a random woman made ALLEGATIONS about DOZENS OF INCIDENTS, including one in which Mx. Hopkins –\nyes, seriously\n– is alleged to have SMEARED MAKEUP on the face of a woman getting ready for a show WITHOUT CONSENT!\n(Hold me, Ralph. I’m so triggered…. I feel faint.)\nSee, xou can be as gay and flamboyant and politically correct and pronoun-insane as one can possibly be. In the end, x’re still a WHITE MALE, xour actions of six years ago are problematic, and the thought police will be coming for xour career.\nSince the allegations, initially posted to a private Facebook group and later on Twitter by a user known as Kitty Cordero-Kolin, several companies and musicians affiliated with the band have ended their relationships. An album-release show at Rough Trade in Brooklyn was canceled, and several artists who were slated to support PWR BTTM on its coming United States tour announced they will no longer participate. The band was also dropped by its management agency, Salty Artist Management. Polyvinyl, which put out “Pageant,” announced on Saturday it would no longer work with PWR BTTM, or sell or distribute its album, in hard copy and on streaming services. It will offer refunds to those who purchased “Pageant” from the label, and plans to make donations to two organizations that combat sexual and anti-LBGT violence.\nNow, I’m not shedding any tears for these two idiotic freaks. The SJWs can light xem on fire and throw xem off the top of the Empire State Building for all I care. But the point is that\nno one\n, no matter how hard one may supplicate and submit to the Narrative, is ever safe from the cultural revolutionaries of social justice.",
  "tags": [
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-16T14:00:00+00:00"
}