{
  "url": "https://voxday.net/2017/05/18/white-house-in-shut-down-mode/",
  "scraped_at": "2025-12-18T07:14:39.824149",
  "title": "White House in shut-down mode",
  "date_display": "May 18, 2017",
  "date_iso": "2017-05-18T12:00:00+00:00",
  "date_from_url": "2017-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Cernovich reveals the real reason why Washington is freaking out, and why there is a major investigation into the leaks:</p><p><i>“The reason the White House went nuts about the Washington Post story: The person who leaked that story to the Washington Post leaked WAY MORE information than Trump actually talked about, including information necessary to identify the sources. Everyone is spooked.”</i></p><p>Mike says not to believe any of the media claims to have sources, because no one in the White House is talking to anyone outside anymore because the leaks to the Washington Post burned the intelligence sources.</p><p>He doesn’t know who the source is, but his three leading theories are that the source was Kris Bauman, the National Security Council advisor on Israel-Palestinian matters. The second possibility is David Laufman, the Chief of Counterespionage at the FBI, an Obama donor responsible for clearing Hillary Clinton on the “independent” email probe. And the third is McMaster, Petraeus’s protege.</p><p>Mike ranks the likelihood this way:</p><ol><li>Laufman</li><li>McMaster-Petraeus</li><li>Bowman</li></ol><p>Andrew Napolitano explains the legal perspective:<br/></p><blockquote><p> Under federal law, the president can declassify any secrets, even the most highly sensitive and guarded ones. He can do so by whispering the secret into someone’s ear or by formally removing the secret from its classified status. But because he did not do the latter, the secret is still a secret — yet The Washington Post has this material and may now legally reveal it.</p><p>How can a newspaper reveal a top secret that the president has not made public? If someone reveals the secret to the newspaper, it can. <b>The person who did so in this case committed a felony</b>, and the president is right to be angered over it. That person is probably a member of the intelligence community bent on frustrating or destabilizing or controlling the Trump presidency. Because that person gave it to the Post and because there is enormous public interest in knowing what Trump told the Russians, the Post is free to publish it.</p></blockquote></div>",
  "content_text": "Mike Cernovich reveals the real reason why Washington is freaking out, and why there is a major investigation into the leaks:\n“The reason the White House went nuts about the Washington Post story: The person who leaked that story to the Washington Post leaked WAY MORE information than Trump actually talked about, including information necessary to identify the sources. Everyone is spooked.”\nMike says not to believe any of the media claims to have sources, because no one in the White House is talking to anyone outside anymore because the leaks to the Washington Post burned the intelligence sources.\nHe doesn’t know who the source is, but his three leading theories are that the source was Kris Bauman, the National Security Council advisor on Israel-Palestinian matters. The second possibility is David Laufman, the Chief of Counterespionage at the FBI, an Obama donor responsible for clearing Hillary Clinton on the “independent” email probe. And the third is McMaster, Petraeus’s protege.\nMike ranks the likelihood this way:\nLaufman\nMcMaster-Petraeus\nBowman\nAndrew Napolitano explains the legal perspective:\nUnder federal law, the president can declassify any secrets, even the most highly sensitive and guarded ones. He can do so by whispering the secret into someone’s ear or by formally removing the secret from its classified status. But because he did not do the latter, the secret is still a secret — yet The Washington Post has this material and may now legally reveal it.\nHow can a newspaper reveal a top secret that the president has not made public? If someone reveals the secret to the newspaper, it can.\nThe person who did so in this case committed a felony\n, and the president is right to be angered over it. That person is probably a member of the intelligence community bent on frustrating or destabilizing or controlling the Trump presidency. Because that person gave it to the Post and because there is enormous public interest in knowing what Trump told the Russians, the Post is free to publish it.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-05-18T11:00:00+00:00"
}