{
  "url": "https://voxday.net/2023/04/24/a-wargame-in-washington/",
  "scraped_at": "2026-01-08T13:54:40.071507",
  "title": "A Wargame in Washington",
  "date_display": "April 24, 2023",
  "date_iso": "2023-04-24T10:07:15+00:00",
  "date_from_url": "2023-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This may be the only time I have ever regretted not becoming a Congressman. This weekend, the House Ways and Means Committee <a href=\"https://www.voanews.com/a/lawmakers-stage-war-game-conflict-with-china-hoping-to-deter-real-one-/7062420.html\">played a wargame</a> simulating a US-China war over Taiwan.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It’s April 22, 2027, and 72 hours into a first-strike Chinese attack on Taiwan and the U.S. military response. Already, the toll on all sides is staggering.</p><p>It was a war game, but one with a serious purpose and high-profile players: members of the House select committee on China. The conflict unfolded on Risk board game-style tabletop maps and markers under a giant gold chandelier in the House Ways and Means Committee room.</p><p>The exercise explored American diplomatic, economic and military options if the United States and China were to reach the brink of war over Taiwan, a self-ruled island that Beijing claims as its own. The exercise played out one night last week and was observed by The Associated Press. It was part of the committee’s in-depth review of U.S. policies toward China as lawmakers, especially in the Republican-led House, focus on tensions with President Xi Jinping’s government.</p><p>In the war game, Beijing’s missiles and rockets cascade down on Taiwan and on U.S. forces as far away as Japan and Guam. Initial casualties include hundreds, possibly thousands, of U.S. troops. Taiwan’s and China’s losses are even higher.</p><p>Discouragingly for Washington, alarmed and alienated allies in the war game leave Americans to fight almost entirely alone in support of Taiwan.</p><p>In the war game, lawmakers played the blue team, in the role of National Security Council advisers. Their directive from their (imaginary) president: Deter a Chinese takeover of Taiwan if possible, defeat it if not. Experts for the Center for a New American Security think tank, whose research includes war-gaming possible conflicts using realistic scenarios and unclassified information, played the red team.</p><p>In the exercise, it all kicks off with opposition lawmakers in Taiwan talking about independence.</p><p>With the think tank’s defense program director Stacie Pettyjohn narrating, angry Chinese officials respond by heaping unacceptable demands on Taiwan. Meanwhile, China’s military moves invasion-capable forces into position. Steps such as bringing in blood supplies for treating troops suggest this is no ordinary military exercise.</p><p>Ultimately, China imposes a de facto blockade on Taiwan, intolerable for an island that produces more than 60% of the world’s semiconductors, as well as other high-tech gear.</p></blockquote><p>One hopes that the wargame’s designers made it real enough to teach the politicians that a war with China over Taiwan is actually less winnable than Ukraine. The basic concept of a “regional power” necessarily entails not interfering with that power in its region-of-control.</p><p>The fact that the wargame <a href=\"https://freebeacon.com/national-security/united-states-fails-to-stop-chinese-invasion-of-taiwan-in-congressional-war-simulation/\">did not culminate in a US victory</a>, unlike <a href=\"https://www.csis.org/analysis/first-battle-next-war-wargaming-chinese-invasion-taiwan\">the previous wargames</a> by the Center for Strategic and International Studies, is a good sign that it had at least some connection to the actual situation. But the fact that one of the lessons they took from the exercise concerned “diplomacy” and “the lack of direct, immediate leader-to-leader crisis communication” is dangerous, because a) there is no amount of diplomacy or talk-talk that is going to dissuade the Chinese and b) it means the politicians are still hoping to find some sort of painless Smart Boy solution that does not exist.</p><p>China fully expects reunification by 2030. I would not be surprised if it takes place sooner than that, and more or less peacefully, given <a href=\"https://www.globaltimes.cn/page/202304/1289630.shtml\">the absolute lunacy of Clown World’s latest ideas</a> for trying to deter the Chinese from their top strategic priority.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The latest remarks by the EU’s top diplomat Josep Borrell, who called for European navies to patrol the Taiwan Straits, caused huge controversy on Sunday as some Chinese observers said the comments are “extremely dangerous” and signal “a retrogression” of the EU’s stance on the Taiwan question following the recent G7 meeting during which the US tried to pressure its allies to take a tougher position on the matter.</p><p>European navies should patrol the disputed Taiwan Straits, Borrell wrote in an article published in the French newspaper <em>Journal Du Dimanche</em>, saying that the Chinese island concerns the EU economically, commercially and technologically, according to media reports on Sunday. He called for European navies to patrol the Taiwan Straits to “show Europe’s commitment to freedom of navigation” in this crucial area.</p> <cite>Call of top EU diplomat for European navies to patrol the Taiwan Straits ‘very dangerous’, Global Times</cite></blockquote><p>I really don’t think a resort to European gunboat diplomacy is a wise idea when China is actively seeking vengeance for its “Century of Humiliation”. Whom the gods would destroy, they first make mad.</p><p><em><a href=\"https://social.infogalactic.com/micropost/829d965b-7571-4184-9d98-2927d33b245b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This may be the only time I have ever regretted not becoming a Congressman. This weekend, the House Ways and Means Committee\nplayed a wargame\nsimulating a US-China war over Taiwan.\nIt’s April 22, 2027, and 72 hours into a first-strike Chinese attack on Taiwan and the U.S. military response. Already, the toll on all sides is staggering.\nIt was a war game, but one with a serious purpose and high-profile players: members of the House select committee on China. The conflict unfolded on Risk board game-style tabletop maps and markers under a giant gold chandelier in the House Ways and Means Committee room.\nThe exercise explored American diplomatic, economic and military options if the United States and China were to reach the brink of war over Taiwan, a self-ruled island that Beijing claims as its own. The exercise played out one night last week and was observed by The Associated Press. It was part of the committee’s in-depth review of U.S. policies toward China as lawmakers, especially in the Republican-led House, focus on tensions with President Xi Jinping’s government.\nIn the war game, Beijing’s missiles and rockets cascade down on Taiwan and on U.S. forces as far away as Japan and Guam. Initial casualties include hundreds, possibly thousands, of U.S. troops. Taiwan’s and China’s losses are even higher.\nDiscouragingly for Washington, alarmed and alienated allies in the war game leave Americans to fight almost entirely alone in support of Taiwan.\nIn the war game, lawmakers played the blue team, in the role of National Security Council advisers. Their directive from their (imaginary) president: Deter a Chinese takeover of Taiwan if possible, defeat it if not. Experts for the Center for a New American Security think tank, whose research includes war-gaming possible conflicts using realistic scenarios and unclassified information, played the red team.\nIn the exercise, it all kicks off with opposition lawmakers in Taiwan talking about independence.\nWith the think tank’s defense program director Stacie Pettyjohn narrating, angry Chinese officials respond by heaping unacceptable demands on Taiwan. Meanwhile, China’s military moves invasion-capable forces into position. Steps such as bringing in blood supplies for treating troops suggest this is no ordinary military exercise.\nUltimately, China imposes a de facto blockade on Taiwan, intolerable for an island that produces more than 60% of the world’s semiconductors, as well as other high-tech gear.\nOne hopes that the wargame’s designers made it real enough to teach the politicians that a war with China over Taiwan is actually less winnable than Ukraine. The basic concept of a “regional power” necessarily entails not interfering with that power in its region-of-control.\nThe fact that the wargame\ndid not culminate in a US victory\n, unlike\nthe previous wargames\nby the Center for Strategic and International Studies, is a good sign that it had at least some connection to the actual situation. But the fact that one of the lessons they took from the exercise concerned “diplomacy” and “the lack of direct, immediate leader-to-leader crisis communication” is dangerous, because a) there is no amount of diplomacy or talk-talk that is going to dissuade the Chinese and b) it means the politicians are still hoping to find some sort of painless Smart Boy solution that does not exist.\nChina fully expects reunification by 2030. I would not be surprised if it takes place sooner than that, and more or less peacefully, given\nthe absolute lunacy of Clown World’s latest ideas\nfor trying to deter the Chinese from their top strategic priority.\nThe latest remarks by the EU’s top diplomat Josep Borrell, who called for European navies to patrol the Taiwan Straits, caused huge controversy on Sunday as some Chinese observers said the comments are “extremely dangerous” and signal “a retrogression” of the EU’s stance on the Taiwan question following the recent G7 meeting during which the US tried to pressure its allies to take a tougher position on the matter.\nEuropean navies should patrol the disputed Taiwan Straits, Borrell wrote in an article published in the French newspaper\nJournal Du Dimanche\n, saying that the Chinese island concerns the EU economically, commercially and technologically, according to media reports on Sunday. He called for European navies to patrol the Taiwan Straits to “show Europe’s commitment to freedom of navigation” in this crucial area.\nCall of top EU diplomat for European navies to patrol the Taiwan Straits ‘very dangerous’, Global Times\nI really don’t think a resort to European gunboat diplomacy is a wise idea when China is actively seeking vengeance for its “Century of Humiliation”. Whom the gods would destroy, they first make mad.\nDISCUSS ON SG",
  "tags": [
    "China",
    "EU",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-24T10:18:42+00:00"
}