{
  "url": "https://voxday.net/2023/04/01/castalia-history-series/",
  "scraped_at": "2026-01-08T13:52:36.541719",
  "title": "Castalia History Series",
  "date_display": "April 1, 2023",
  "date_iso": "2023-04-01T10:59:30+00:00",
  "date_from_url": "2023-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Castalia House is delighted to present its second leather book series, <a href=\"https://arkhavencomics.com/product/castalia-history-subscription/\">the Castalia History subscription</a>. Join the Castalia History Book Club and you will receive a deluxe leatherbound book published by Castalia Library four times per year. Subscribers will also receive significant discounts on non-subscription Castalia History books.</p><p>The first History Book Club book (April-May-June, #1) is THE LANDMARK THUCYDIDES edited by Robert B. Strassler. It is the comprehensive guide to the Peloponnesian War between Athens and Sparta and is correctly considered to be one of the first and most important classics of history. Both <a href=\"https://arkhavencomics.com/product/castalia-history-subscription/\">monthly</a> and <a href=\"https://arkhavencomics.com/product/castalia-history-annual-subscription/\">annual</a> subscriptions are available.</p><p>Castalia Library subscribers should note that they will be able to purchase Castalia History books at the subscriber’s price if there are any books remaining after the History subscribers receive their books.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>THE HISTORY OF THE PELOPONNESIAN WAR</strong><br/>By Thucydides, 431 BC</p><p>The city of Epidamnus stands on the right of the entrance of the Ionic Gulf. Its vicinity is inhabited by the Taulantians, an Illyrian people. The place is a colony from Corcyra, founded by Phalius, son of Eratocleides, of the family of the Heraclids, who had according to ancient usage been summoned for the purpose from Corinth, the mother country. The colonists were joined by some Corinthians, and others of the Dorian race. Now, as time went on, the city of Epidamnus became great and populous; but falling a prey to factions arising, it is said, from a war with her neighbours the barbarians, she became much enfeebled, and lost a considerable amount of her power. The last act before the war was the expulsion of the nobles by the people. The exiled party joined the barbarians, and proceeded to plunder those in the city by sea and land; and the Epidamnians, finding themselves hard pressed, sent ambassadors to Corcyra beseeching their mother country not to allow them to perish, but to make up matters between them and the exiles, and to rid them of the war with the barbarians. The ambassadors seated themselves in the temple of Hera as suppliants, and made the above requests to the Corcyraeans. But the Corcyraeans refused to accept their supplication, and they were dismissed without having effected anything.</p><p>When the Epidamnians found that no help could be expected from Corcyra, they were in a strait what to do next. So they sent to Delphi and inquired of the God whether they should deliver their city to the Corinthians and endeavour to obtain some assistance from their founders. The answer he gave them was to deliver the city and place themselves under Corinthian protection. So the Epidamnians went to Corinth and delivered over the colony in obedience to the commands of the oracle. They showed that their founder came from Corinth, and revealed the answer of the god; and they begged them not to allow them to perish, but to assist them. This the Corinthians consented to do. Believing the colony to belong as much to themselves as to the Corcyraeans, they felt it to be a kind of duty to undertake their protection. Besides, they hated the Corcyraeans for their contempt of the mother country. Instead of meeting with the usual honours accorded to the parent city by every other colony at public assemblies, such as precedence at sacrifices, Corinth found herself treated with contempt by a power which in point of wealth could stand comparison with any even of the richest communities in Hellas, which possessed great military strength, and which sometimes could not repress a pride in the high naval position of an island whose nautical renown dated from the days of its old inhabitants, the Phaeacians. This was one reason of the care that they lavished on their fleet, which became very efficient; indeed they began the war with a force of a hundred and twenty galleys.</p><p>All these grievances made Corinth eager to send the promised aid to Epidamnus. Advertisement was made for volunteer settlers, and a force of Ambraciots, Leucadians, and Corinthians was dispatched. They marched by land to Apollonia, a Corinthian colony, the route by sea being avoided from fear of Corcyraean interruption. When the Corcyraeans heard of the arrival of the settlers and troops in Epidamnus, and the surrender of the colony to Corinth, they took fire. Instantly putting to sea with five-and-twenty ships, which were quickly followed by others, they insolently commanded the Epidamnians to receive back the banished nobles—(it must be premised that the Epidamnian exiles had come to Corcyra and, pointing to the sepulchres of their ancestors, had appealed to their kindred to restore them)—and to dismiss the Corinthian garrison and settlers. But to all this the Epidamnians turned a deaf ear. Upon this the Corcyraeans commenced operations against them with a fleet of forty sail. They took with them the exiles, with a view to their restoration, and also secured the services of the Illyrians. Sitting down before the city, they issued a proclamation to the effect that any of the natives that chose, and the foreigners, might depart unharmed, with the alternative of being treated as enemies. On their refusal the Corcyraeans proceeded to besiege the city, which stands on an isthmus; and the Corinthians, receiving intelligence of the investment of Epidamnus, got together an armament and proclaimed a colony to Epidamnus, perfect political equality being guaranteed to all who chose to go. Any who were not prepared to sail at once might, by paying down the sum of fifty Corinthian drachmae, have a share in the colony without leaving Corinth. Great numbers took advantage of this proclamation, some being ready to start directly, others paying the requisite forfeit. In case of their passage being disputed by the Corcyraeans, several cities were asked to lend them a convoy. Megara prepared to accompany them with eight ships, Pale in Cephallonia with four; Epidaurus furnished five, Hermione one, Troezen two, Leucas ten, and Ambracia eight. The Thebans and Phliasians were asked for money, the Eleans for hulls as well; while Corinth herself furnished thirty ships and three thousand heavy infantry.</p><p>When the Corcyraeans heard of their preparations they came to Corinth with envoys from Lacedaemon and Sicyon, whom they persuaded to accompany them, and bade her recall the garrison and settlers, as she had nothing to do with Epidamnus. If, however, she had any claims to make, they were willing to submit the matter to the arbitration of such of the cities in Peloponnese as should be chosen by mutual agreement, and that the colony should remain with the city to whom the arbitrators might assign it. They were also willing to refer the matter to the oracle at Delphi. If, in defiance of their protestations, war was appealed to, they should be themselves compelled by this violence to seek friends in quarters where they had no desire to seek them, and to make even old ties give way to the necessity of assistance. The answer they got from Corinth was that, if they would withdraw their fleet and the barbarians from Epidamnus, negotiation might be possible; but, while the town was still being besieged, going before arbitrators was out of the question. The Corcyraeans retorted that if Corinth would withdraw her troops from Epidamnus they would withdraw theirs, or they were ready to let both parties remain in statu quo, an armistice being concluded till judgment could be given.</p><p>Turning a deaf ear to all these proposals, when their ships were manned and their allies had come in, the Corinthians sent a herald before them to declare war and, getting under way with seventy-five ships and two thousand heavy infantry, sailed for Epidamnus to give battle to the Corcyraeans. The fleet was under the command of Aristeus, son of Pellichas, Callicrates, son of Callias, and Timanor, son of Timanthes; the troops under that of Archetimus, son of Eurytimus, and Isarchidas, son of Isarchus. When they had reached Actium in the territory of Anactorium, at the mouth of the mouth of the Gulf of Ambracia, where the temple of Apollo stands, the Corcyraeans sent on a herald in a light boat to warn them not to sail against them. Meanwhile they proceeded to man their ships, all of which had been equipped for action, the old vessels being undergirded to make them seaworthy. On the return of the herald without any peaceful answer from the Corinthians, their ships being now manned, they put out to sea to meet the enemy with a fleet of eighty sail (forty were engaged in the siege of Epidamnus), formed line, and went into action, and gained a decisive victory, and destroyed fifteen of the Corinthian vessels. The same day had seen Epidamnus compelled by its besiegers to capitulate; the conditions being that the foreigners should be sold, and the Corinthians kept as prisoners of war, till their fate should be otherwise decided.</p><p>After the engagement the Corcyraeans set up a trophy on Leukimme, a headland of Corcyra, and slew all their captives except the Corinthians, whom they kept as prisoners of war. Defeated at sea, the Corinthians and their allies repaired home, and left the Corcyraeans masters of all the sea about those parts. Sailing to Leucas, a Corinthian colony, they ravaged their territory, and burnt Cyllene, the harbour of the Eleans, because they had furnished ships and money to Corinth. For almost the whole of the period that followed the battle they remained masters of the sea, and the allies of Corinth were harassed by Corcyraean cruisers. At last Corinth, roused by the sufferings of her allies, sent out ships and troops in the fall of the summer, who formed an encampment at Actium and about Chimerium, in Thesprotis, for the protection of Leucas and the rest of the friendly cities. The Corcyraeans on their part formed a similar station on Leukimme. Neither party made any movement, but they remained confronting each other till the end of the summer, and winter was at hand before either of them returned home.</p><p>Corinth, exasperated by the war with the Corcyraeans, spent the whole of the year after the engagement and that succeeding it in building ships, and in straining every nerve to form an efficient fleet; rowers being drawn from Peloponnese and the rest of Hellas by the inducement of large bounties. The Corcyraeans, alarmed at the news of their preparations, being without a single ally in Hellas (for they had not enrolled themselves either in the Athenian or in the Lacedaemonian confederacy), decided to repair to Athens in order to enter into alliance and to endeavour to procure support from her. Corinth also, hearing of their intentions, sent an embassy to Athens to prevent the Corcyraean navy being joined by the Athenian, and her prospect of ordering the war according to her wishes being thus impeded.</p></blockquote><p>And no, this is not an April Fool’s joke. This is something that has been in the making for more than 18 months. If you have any questions, please pose them on SG at the following link.</p><p><em><a href=\"https://social.infogalactic.com/micropost/ff470940-adce-4e43-a318-a01fff2384c6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Castalia House is delighted to present its second leather book series,\nthe Castalia History subscription\n. Join the Castalia History Book Club and you will receive a deluxe leatherbound book published by Castalia Library four times per year. Subscribers will also receive significant discounts on non-subscription Castalia History books.\nThe first History Book Club book (April-May-June, #1) is THE LANDMARK THUCYDIDES edited by Robert B. Strassler. It is the comprehensive guide to the Peloponnesian War between Athens and Sparta and is correctly considered to be one of the first and most important classics of history. Both\nmonthly\nand\nannual\nsubscriptions are available.\nCastalia Library subscribers should note that they will be able to purchase Castalia History books at the subscriber’s price if there are any books remaining after the History subscribers receive their books.\nTHE HISTORY OF THE PELOPONNESIAN WAR\nBy Thucydides, 431 BC\nThe city of Epidamnus stands on the right of the entrance of the Ionic Gulf. Its vicinity is inhabited by the Taulantians, an Illyrian people. The place is a colony from Corcyra, founded by Phalius, son of Eratocleides, of the family of the Heraclids, who had according to ancient usage been summoned for the purpose from Corinth, the mother country. The colonists were joined by some Corinthians, and others of the Dorian race. Now, as time went on, the city of Epidamnus became great and populous; but falling a prey to factions arising, it is said, from a war with her neighbours the barbarians, she became much enfeebled, and lost a considerable amount of her power. The last act before the war was the expulsion of the nobles by the people. The exiled party joined the barbarians, and proceeded to plunder those in the city by sea and land; and the Epidamnians, finding themselves hard pressed, sent ambassadors to Corcyra beseeching their mother country not to allow them to perish, but to make up matters between them and the exiles, and to rid them of the war with the barbarians. The ambassadors seated themselves in the temple of Hera as suppliants, and made the above requests to the Corcyraeans. But the Corcyraeans refused to accept their supplication, and they were dismissed without having effected anything.\nWhen the Epidamnians found that no help could be expected from Corcyra, they were in a strait what to do next. So they sent to Delphi and inquired of the God whether they should deliver their city to the Corinthians and endeavour to obtain some assistance from their founders. The answer he gave them was to deliver the city and place themselves under Corinthian protection. So the Epidamnians went to Corinth and delivered over the colony in obedience to the commands of the oracle. They showed that their founder came from Corinth, and revealed the answer of the god; and they begged them not to allow them to perish, but to assist them. This the Corinthians consented to do. Believing the colony to belong as much to themselves as to the Corcyraeans, they felt it to be a kind of duty to undertake their protection. Besides, they hated the Corcyraeans for their contempt of the mother country. Instead of meeting with the usual honours accorded to the parent city by every other colony at public assemblies, such as precedence at sacrifices, Corinth found herself treated with contempt by a power which in point of wealth could stand comparison with any even of the richest communities in Hellas, which possessed great military strength, and which sometimes could not repress a pride in the high naval position of an island whose nautical renown dated from the days of its old inhabitants, the Phaeacians. This was one reason of the care that they lavished on their fleet, which became very efficient; indeed they began the war with a force of a hundred and twenty galleys.\nAll these grievances made Corinth eager to send the promised aid to Epidamnus. Advertisement was made for volunteer settlers, and a force of Ambraciots, Leucadians, and Corinthians was dispatched. They marched by land to Apollonia, a Corinthian colony, the route by sea being avoided from fear of Corcyraean interruption. When the Corcyraeans heard of the arrival of the settlers and troops in Epidamnus, and the surrender of the colony to Corinth, they took fire. Instantly putting to sea with five-and-twenty ships, which were quickly followed by others, they insolently commanded the Epidamnians to receive back the banished nobles—(it must be premised that the Epidamnian exiles had come to Corcyra and, pointing to the sepulchres of their ancestors, had appealed to their kindred to restore them)—and to dismiss the Corinthian garrison and settlers. But to all this the Epidamnians turned a deaf ear. Upon this the Corcyraeans commenced operations against them with a fleet of forty sail. They took with them the exiles, with a view to their restoration, and also secured the services of the Illyrians. Sitting down before the city, they issued a proclamation to the effect that any of the natives that chose, and the foreigners, might depart unharmed, with the alternative of being treated as enemies. On their refusal the Corcyraeans proceeded to besiege the city, which stands on an isthmus; and the Corinthians, receiving intelligence of the investment of Epidamnus, got together an armament and proclaimed a colony to Epidamnus, perfect political equality being guaranteed to all who chose to go. Any who were not prepared to sail at once might, by paying down the sum of fifty Corinthian drachmae, have a share in the colony without leaving Corinth. Great numbers took advantage of this proclamation, some being ready to start directly, others paying the requisite forfeit. In case of their passage being disputed by the Corcyraeans, several cities were asked to lend them a convoy. Megara prepared to accompany them with eight ships, Pale in Cephallonia with four; Epidaurus furnished five, Hermione one, Troezen two, Leucas ten, and Ambracia eight. The Thebans and Phliasians were asked for money, the Eleans for hulls as well; while Corinth herself furnished thirty ships and three thousand heavy infantry.\nWhen the Corcyraeans heard of their preparations they came to Corinth with envoys from Lacedaemon and Sicyon, whom they persuaded to accompany them, and bade her recall the garrison and settlers, as she had nothing to do with Epidamnus. If, however, she had any claims to make, they were willing to submit the matter to the arbitration of such of the cities in Peloponnese as should be chosen by mutual agreement, and that the colony should remain with the city to whom the arbitrators might assign it. They were also willing to refer the matter to the oracle at Delphi. If, in defiance of their protestations, war was appealed to, they should be themselves compelled by this violence to seek friends in quarters where they had no desire to seek them, and to make even old ties give way to the necessity of assistance. The answer they got from Corinth was that, if they would withdraw their fleet and the barbarians from Epidamnus, negotiation might be possible; but, while the town was still being besieged, going before arbitrators was out of the question. The Corcyraeans retorted that if Corinth would withdraw her troops from Epidamnus they would withdraw theirs, or they were ready to let both parties remain in statu quo, an armistice being concluded till judgment could be given.\nTurning a deaf ear to all these proposals, when their ships were manned and their allies had come in, the Corinthians sent a herald before them to declare war and, getting under way with seventy-five ships and two thousand heavy infantry, sailed for Epidamnus to give battle to the Corcyraeans. The fleet was under the command of Aristeus, son of Pellichas, Callicrates, son of Callias, and Timanor, son of Timanthes; the troops under that of Archetimus, son of Eurytimus, and Isarchidas, son of Isarchus. When they had reached Actium in the territory of Anactorium, at the mouth of the mouth of the Gulf of Ambracia, where the temple of Apollo stands, the Corcyraeans sent on a herald in a light boat to warn them not to sail against them. Meanwhile they proceeded to man their ships, all of which had been equipped for action, the old vessels being undergirded to make them seaworthy. On the return of the herald without any peaceful answer from the Corinthians, their ships being now manned, they put out to sea to meet the enemy with a fleet of eighty sail (forty were engaged in the siege of Epidamnus), formed line, and went into action, and gained a decisive victory, and destroyed fifteen of the Corinthian vessels. The same day had seen Epidamnus compelled by its besiegers to capitulate; the conditions being that the foreigners should be sold, and the Corinthians kept as prisoners of war, till their fate should be otherwise decided.\nAfter the engagement the Corcyraeans set up a trophy on Leukimme, a headland of Corcyra, and slew all their captives except the Corinthians, whom they kept as prisoners of war. Defeated at sea, the Corinthians and their allies repaired home, and left the Corcyraeans masters of all the sea about those parts. Sailing to Leucas, a Corinthian colony, they ravaged their territory, and burnt Cyllene, the harbour of the Eleans, because they had furnished ships and money to Corinth. For almost the whole of the period that followed the battle they remained masters of the sea, and the allies of Corinth were harassed by Corcyraean cruisers. At last Corinth, roused by the sufferings of her allies, sent out ships and troops in the fall of the summer, who formed an encampment at Actium and about Chimerium, in Thesprotis, for the protection of Leucas and the rest of the friendly cities. The Corcyraeans on their part formed a similar station on Leukimme. Neither party made any movement, but they remained confronting each other till the end of the summer, and winter was at hand before either of them returned home.\nCorinth, exasperated by the war with the Corcyraeans, spent the whole of the year after the engagement and that succeeding it in building ships, and in straining every nerve to form an efficient fleet; rowers being drawn from Peloponnese and the rest of Hellas by the inducement of large bounties. The Corcyraeans, alarmed at the news of their preparations, being without a single ally in Hellas (for they had not enrolled themselves either in the Athenian or in the Lacedaemonian confederacy), decided to repair to Athens in order to enter into alliance and to endeavour to procure support from her. Corinth also, hearing of their intentions, sent an embassy to Athens to prevent the Corcyraean navy being joined by the Athenian, and her prospect of ordering the war according to her wishes being thus impeded.\nAnd no, this is not an April Fool’s joke. This is something that has been in the making for more than 18 months. If you have any questions, please pose them on SG at the following link.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-01T10:59:32+00:00"
}