{
  "url": "https://voxday.net/2023/04/18/les-idees-se-repandent/",
  "scraped_at": "2026-01-08T13:54:04.655044",
  "title": "Les Idées Se Répandent",
  "date_display": "April 18, 2023",
  "date_iso": "2023-04-18T10:41:25+00:00",
  "date_from_url": "2023-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A French writer <a href=\"http://stanislasberton.com/index.php/2019/11/03/du-wokisme-dentreprise/\">introduces the concepts</a> of convergence and corporate cancer to the francophonic world.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“The highest form of the art of war is not to fight but to corrupt everything of value in your enemy’s country until the perception of your enemy is so distorted that he doesn’t even perceive you as an enemy anymore.”</em> – Yuri Bezmenov</p><p>In April 2023, the famous American beer brand “Bud Light”, owned by the Anheuser Busch Inbev group, launched an advertising campaign featuring transgender influencer Dylan Mulvaney. A week later, the company’s market capitalization was down $6 billion as sales plummeted. Between 2005 and 2016, NASCAR, the most popular motor sport in the United States had seen an equally dramatic decline in its spectators after having taken the turn of “inclusiveness”, its president Mike Helton going so far as to declare in 2006 that: “we are convinced that the redneck heritage of the southern United States on which this sport was based no longer exists. But we also realize that we have to make an effort to help other people understand it.”</p><p>In his book <em>Corporate Cancer</em> published in 2019, author and editor Vox Day revealed the factors that lead successful, well-established and sometimes growing companies to scuttle themselves by launching communication campaigns. disastrous and alienating their most loyal customers. Day’s explanation of this phenomenon is the gradual takeover and destruction of a company by progressive ideology, a process he called “convergence.” According to Day, the progression of this ideology within a company can be compared to a cancer whose evolution would correspond to the following phases…</p><p>This analysis grid helps to understand why the spread of “progressivism” within a company quickly leads to its ruin. In his book, Day gives very concrete examples of the explosion of costs induced by the convergence of a company and estimates that once the process has started the loss of turnover can reach up to 20% in the space of a year. Day nevertheless takes pains to point out that “light” signs of convergence should not lead to overreaction from management and that there is a real difference between a converged company and a mere marketing rhetoric aimed at satisfy a specific market segment.</p><p>It is worth pointing out that, in theory, a market economy should lead to the rapid elimination of a company that is dysfunctional or unable to meet the demands of its customers. However, as the author of “Corporate Cancer” rightly points out, the pursuit of these disastrous strategies or positions both for the image of companies and for their balance sheets prove that what is at stake here goes beyond the simple question economy and demonstrates the reality of a system whose avowed objective is now to “change society and change mentalities”.</p></blockquote><p>In the age of Clown World, convergence is one of the most important concepts for any individual with any responsibility in an organization to understand. Without it, the individual finds himself operating in the dark while beset by invisible enemies whose actions appear insensible and whose motivations he cannot possibly understand.</p><p>And so, it’s good to see that people from other cultures are beginning to grasp it, because their societies are under assault too, as the chief aim of Clown World is to converge the entire planet.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9a40a124-8e02-414d-a39f-43abf13526f6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A French writer\nintroduces the concepts\nof convergence and corporate cancer to the francophonic world.\n“The highest form of the art of war is not to fight but to corrupt everything of value in your enemy’s country until the perception of your enemy is so distorted that he doesn’t even perceive you as an enemy anymore.”\n– Yuri Bezmenov\nIn April 2023, the famous American beer brand “Bud Light”, owned by the Anheuser Busch Inbev group, launched an advertising campaign featuring transgender influencer Dylan Mulvaney. A week later, the company’s market capitalization was down $6 billion as sales plummeted. Between 2005 and 2016, NASCAR, the most popular motor sport in the United States had seen an equally dramatic decline in its spectators after having taken the turn of “inclusiveness”, its president Mike Helton going so far as to declare in 2006 that: “we are convinced that the redneck heritage of the southern United States on which this sport was based no longer exists. But we also realize that we have to make an effort to help other people understand it.”\nIn his book\nCorporate Cancer\npublished in 2019, author and editor Vox Day revealed the factors that lead successful, well-established and sometimes growing companies to scuttle themselves by launching communication campaigns. disastrous and alienating their most loyal customers. Day’s explanation of this phenomenon is the gradual takeover and destruction of a company by progressive ideology, a process he called “convergence.” According to Day, the progression of this ideology within a company can be compared to a cancer whose evolution would correspond to the following phases…\nThis analysis grid helps to understand why the spread of “progressivism” within a company quickly leads to its ruin. In his book, Day gives very concrete examples of the explosion of costs induced by the convergence of a company and estimates that once the process has started the loss of turnover can reach up to 20% in the space of a year. Day nevertheless takes pains to point out that “light” signs of convergence should not lead to overreaction from management and that there is a real difference between a converged company and a mere marketing rhetoric aimed at satisfy a specific market segment.\nIt is worth pointing out that, in theory, a market economy should lead to the rapid elimination of a company that is dysfunctional or unable to meet the demands of its customers. However, as the author of “Corporate Cancer” rightly points out, the pursuit of these disastrous strategies or positions both for the image of companies and for their balance sheets prove that what is at stake here goes beyond the simple question economy and demonstrates the reality of a system whose avowed objective is now to “change society and change mentalities”.\nIn the age of Clown World, convergence is one of the most important concepts for any individual with any responsibility in an organization to understand. Without it, the individual finds himself operating in the dark while beset by invisible enemies whose actions appear insensible and whose motivations he cannot possibly understand.\nAnd so, it’s good to see that people from other cultures are beginning to grasp it, because their societies are under assault too, as the chief aim of Clown World is to converge the entire planet.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-18T10:41:27+00:00"
}