{
  "url": "https://voxday.net/2023/04/19/losing-their-free-trade-religion/",
  "scraped_at": "2026-01-08T13:54:13.540273",
  "title": "Losing Their Free Trade Religion",
  "date_display": "April 19, 2023",
  "date_iso": "2023-04-19T22:19:24+00:00",
  "date_from_url": "2023-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Tree of Woe <a href=\"https://treeofwoe.substack.com/p/against-free-trade\">contemplates the fallacies</a> of free trade:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Fletcher’s assault on Fortress Free Trade consists of five interlocking theoretical arguments and one empirical argument. He begins by undermining the assumptions at the foundation of Ricardian free trade theory.</p><p><strong>Labor and Capital are Mobile.</strong> Go back and re-read the examples above. Did you notice what was excluded from the hypothetical? The movement of capital and labor. That’s because Ricardian free trade theory simply assumes as given that labor and capital are immobile. All competition is via industry or product.</p><p>But this is not the case nowadays. Nowadays both labor and capital can move. The result of that is that investment capital and labor pursue absolute, rather than comparative, advantage. And with capital and labor mobility, absolute advantage trumps and gains from trade evaporate.</p><p>Let’s imagine that the advantage that accrues to British labor is due to better capital investment: each man-hour of labor is more productive in Britain because it has better factories. Let’s also imagine that Britain and Portugal have foolishly agreed to enter some sort of “union” which allowed their workers to work and live in either country. Labor is now mobile so each worker can move where the best jobs are available. Since labor wages tend to increase when productivity increases, the Portuguese workers will realize they can earn more and tend to move to Britain. The outcome is not happy Portuguese vineyard workers, but Portuguese immigrants trying to get jobs in British wool and wine factories.2</p><p>Now let’s imagine that the advantage that accrues to British labor is due to the fact that hourly wages are lower and working hours longer than in Portugal. The factories are equally the same, but you can get 60 hours of British labor for the cost of 35 hours of Portuguese labor. Let’s also imagine that Britain and Portugal have deepened their union such that financial investments can flow freely between the countries. Obviously, what happens is that the Portuguese investors invest their capital in Great Britain, where they can take advantage of the cheap labor. Many high-paying Portuguese jobs vanish as the capital flight causes the factories to shutter. This is, of course, exactly what has happened between the US and China.</p><p><strong>Capital is Not Fungible. </strong>Go back and re-read the examples again. Did you notice that I said “each has enough factories to let 500 workers work in each industry” initially, but that when they began trading, “each specialize in the area where they have absolute advantage, changing their factories to the new type they need.” I didn’t allocate any cost to this switch — there was no depreciation of the old factories, no loss of investment, no scrap metal yards filled with wool-spinning machines the Portuguese no longer need, etc. Ricardian free trade theory just assumes that capital is fungible – an investment into wool factories is convertible into an investment into wine factories.</p><p>In the real world, we know this is not true. If it were true, the entire globe wouldn’t be fixated on Taiwan’s chip manufacturing factories. Capital is very much not fungible. To the extent that capital is not fungible, it means there are deadweight costs to free trade, in the form of shuttered factories, depreciated machines, and so on, that Ricardian theory does not take into account.</p><p>An orthodox Ricardian will reply to this criticism by asserting that in the long run capital is fungible and that the long term gains from trade will more than make up for the short-run costs. This argument will be accompanied by a complex econometric paper that uses 10 pages of math written in Greek symbols that says exactly the same thing as I just said in one sentence.</p><p>Not so fast, mathemagicians. Fletcher has another howitzer to fire at Fortress Free Trade, and it demonstrates why the infungibility of capital is a much bigger deal than the orthodoxy wants to admit.</p></blockquote><p>Read the whole thing, particularly if you don’t fully understand why free trade doesn’t work. My Free Trade Efficiency and Labor Mobility critique is mentioned, but nothing more since it isn’t actually relevant to Fletcher’s critique of David Ricardo’s theory of comparative advantage. However, I do think it would be easier for people to understand if someone else were to explain it, as most people don’t appear to understand the real consequences if free trade were to actually work as advertised.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b6e208f0-9885-4457-81a1-37a7fbd811ef\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Tree of Woe\ncontemplates the fallacies\nof free trade:\nFletcher’s assault on Fortress Free Trade consists of five interlocking theoretical arguments and one empirical argument. He begins by undermining the assumptions at the foundation of Ricardian free trade theory.\nLabor and Capital are Mobile.\nGo back and re-read the examples above. Did you notice what was excluded from the hypothetical? The movement of capital and labor. That’s because Ricardian free trade theory simply assumes as given that labor and capital are immobile. All competition is via industry or product.\nBut this is not the case nowadays. Nowadays both labor and capital can move. The result of that is that investment capital and labor pursue absolute, rather than comparative, advantage. And with capital and labor mobility, absolute advantage trumps and gains from trade evaporate.\nLet’s imagine that the advantage that accrues to British labor is due to better capital investment: each man-hour of labor is more productive in Britain because it has better factories. Let’s also imagine that Britain and Portugal have foolishly agreed to enter some sort of “union” which allowed their workers to work and live in either country. Labor is now mobile so each worker can move where the best jobs are available. Since labor wages tend to increase when productivity increases, the Portuguese workers will realize they can earn more and tend to move to Britain. The outcome is not happy Portuguese vineyard workers, but Portuguese immigrants trying to get jobs in British wool and wine factories.2\nNow let’s imagine that the advantage that accrues to British labor is due to the fact that hourly wages are lower and working hours longer than in Portugal. The factories are equally the same, but you can get 60 hours of British labor for the cost of 35 hours of Portuguese labor. Let’s also imagine that Britain and Portugal have deepened their union such that financial investments can flow freely between the countries. Obviously, what happens is that the Portuguese investors invest their capital in Great Britain, where they can take advantage of the cheap labor. Many high-paying Portuguese jobs vanish as the capital flight causes the factories to shutter. This is, of course, exactly what has happened between the US and China.\nCapital is Not Fungible.\nGo back and re-read the examples again. Did you notice that I said “each has enough factories to let 500 workers work in each industry” initially, but that when they began trading, “each specialize in the area where they have absolute advantage, changing their factories to the new type they need.” I didn’t allocate any cost to this switch — there was no depreciation of the old factories, no loss of investment, no scrap metal yards filled with wool-spinning machines the Portuguese no longer need, etc. Ricardian free trade theory just assumes that capital is fungible – an investment into wool factories is convertible into an investment into wine factories.\nIn the real world, we know this is not true. If it were true, the entire globe wouldn’t be fixated on Taiwan’s chip manufacturing factories. Capital is very much not fungible. To the extent that capital is not fungible, it means there are deadweight costs to free trade, in the form of shuttered factories, depreciated machines, and so on, that Ricardian theory does not take into account.\nAn orthodox Ricardian will reply to this criticism by asserting that in the long run capital is fungible and that the long term gains from trade will more than make up for the short-run costs. This argument will be accompanied by a complex econometric paper that uses 10 pages of math written in Greek symbols that says exactly the same thing as I just said in one sentence.\nNot so fast, mathemagicians. Fletcher has another howitzer to fire at Fortress Free Trade, and it demonstrates why the infungibility of capital is a much bigger deal than the orthodoxy wants to admit.\nRead the whole thing, particularly if you don’t fully understand why free trade doesn’t work. My Free Trade Efficiency and Labor Mobility critique is mentioned, but nothing more since it isn’t actually relevant to Fletcher’s critique of David Ricardo’s theory of comparative advantage. However, I do think it would be easier for people to understand if someone else were to explain it, as most people don’t appear to understand the real consequences if free trade were to actually work as advertised.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-19T22:19:26+00:00"
}