{
  "url": "https://voxday.net/2023/04/02/never-trust-the-science-3/",
  "scraped_at": "2026-01-08T13:52:38.029454",
  "title": "Never Trust the Science",
  "date_display": "April 2, 2023",
  "date_iso": "2023-04-02T09:55:41+00:00",
  "date_from_url": "2023-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’d literally be better off just flipping a coin at this point. And that’s a conclusion based on statements by some of the most reputable scientists in history of the United States.</p><ul class=\"wp-block-list\"><li><em>The case against science is straightforward: much of the scientific literature, perhaps half, may simply be untrue. Afflicted by studies with small sample sizes, tiny effects, invalid exploratory analyses, and flagrant conflicts of interest, together with an obsession for pursuing fashionable trends of dubious importance, science has taken a turn towards darkness.</em> —Dr. Richard Horton, editor-in-chief of <em>The Lancet</em></li><li><em>lt is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgment of trusted physicians or authoritative medical guidelines. I take no pleasure in this conclusion, which I reached slowly and reluctantly over my two decades as an editor of The New England Journal of Medicine.</em> —Dr. Marcia Angell, physician and editor-in-chief of <em>The New England Journal of Medicine</em></li><li><em>The medical profession is being bought by the pharmaceutical industry, not only in terms of the practice of medicine, but also in terms of teaching and research. The academic institutions of this country are allowing themselves to be the paid agents of the pharmaceutical industry. I think it’s disgraceful. </em>—Arnold Seymour Reiman (died 2014), Professor of Medicine at Harvard University and former editor-in-chief of The New England Journal of Medicine</li><li><em>Everyone should know that most cancer research is largely a fraud, and that the major cancer research organisations are derelict in their duties to the people who support them.</em> —Dr. Linus Pauling, (died 1994), two-time Nobel Prize winner in chemistry</li></ul><p>Remember this when people tell you to “trust the science”. You cannot. You simply cannot trust a profession that is filled with liars, grifters, and propagandists, in addition to many otherwise honest men and women whose careers are being held hostage by the interests that control their scientific field with an iron fist.</p><p>The New Atheists could not have gotten it more wrong. Not only is science not inherently in opposition to Christianity, science requires Christianity in order to operate freely, honestly, and openly. And it is the construction of a false concept of intrinsic conflict between Revealed Truth and Reliable Falsification that has permitted science to be corrupted and rendered unreliable.</p><p>Let reason be silent when observation and history directly contradict its theoretical conclusions constructed in the complete absence of relevant information.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9982c1a9-cf74-4ba3-a68c-bbf0923e5e9a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "You’d literally be better off just flipping a coin at this point. And that’s a conclusion based on statements by some of the most reputable scientists in history of the United States.\nThe case against science is straightforward: much of the scientific literature, perhaps half, may simply be untrue. Afflicted by studies with small sample sizes, tiny effects, invalid exploratory analyses, and flagrant conflicts of interest, together with an obsession for pursuing fashionable trends of dubious importance, science has taken a turn towards darkness.\n—Dr. Richard Horton, editor-in-chief of\nThe Lancet\nlt is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgment of trusted physicians or authoritative medical guidelines. I take no pleasure in this conclusion, which I reached slowly and reluctantly over my two decades as an editor of The New England Journal of Medicine.\n—Dr. Marcia Angell, physician and editor-in-chief of\nThe New England Journal of Medicine\nThe medical profession is being bought by the pharmaceutical industry, not only in terms of the practice of medicine, but also in terms of teaching and research. The academic institutions of this country are allowing themselves to be the paid agents of the pharmaceutical industry. I think it’s disgraceful.\n—Arnold Seymour Reiman (died 2014), Professor of Medicine at Harvard University and former editor-in-chief of The New England Journal of Medicine\nEveryone should know that most cancer research is largely a fraud, and that the major cancer research organisations are derelict in their duties to the people who support them.\n—Dr. Linus Pauling, (died 1994), two-time Nobel Prize winner in chemistry\nRemember this when people tell you to “trust the science”. You cannot. You simply cannot trust a profession that is filled with liars, grifters, and propagandists, in addition to many otherwise honest men and women whose careers are being held hostage by the interests that control their scientific field with an iron fist.\nThe New Atheists could not have gotten it more wrong. Not only is science not inherently in opposition to Christianity, science requires Christianity in order to operate freely, honestly, and openly. And it is the construction of a false concept of intrinsic conflict between Revealed Truth and Reliable Falsification that has permitted science to be corrupted and rendered unreliable.\nLet reason be silent when observation and history directly contradict its theoretical conclusions constructed in the complete absence of relevant information.\nDISCUSS ON SG",
  "tags": [
    "atheism",
    "history",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-02T09:55:44+00:00"
}