{
  "url": "https://voxday.net/2023/04/11/no-point-in-talking/",
  "scraped_at": "2026-01-08T13:53:29.552144",
  "title": "No Point in Talking",
  "date_display": "April 11, 2023",
  "date_iso": "2023-04-11T11:29:42+00:00",
  "date_from_url": "2023-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>China has realized that Russia is correct and there is <a href=\"https://www.politico.com/news/2023/04/05/china-contact-united-states-00090495\">absolutely no point in communicating</a> with an enemy party that is agreement-incapable.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Beijing’s current aversion to sustained high-level engagement underscores the particularly fraught nature of U.S.-Chinese relations over the past few months. What was a two-sided desire to stabilize an increasingly volatile relationship is becoming much more about Washington reaching out and the Chinese government demurring.</p><p>Beijing is increasingly resentful about U.S. arms sales to Taiwan and official contacts that China says encourage Taiwan’s pro-independence elements.</p><p>There’s always a certain degree of diplomatic theater to the canceling of high-level meetings between the United States and China. But ensuring stable communications with major adversaries like China and Russia has long been a U.S. preference. Some U.S. officials worry Beijing’s thin-skinned diplomacy is hampering crucial communication between the rivals in a way that could have global fallout in a major crisis.</p><p>“The Chinese have been reluctant to engage in discussions around confidence building or crisis communications or hotlines,” National Security Council Indo-Pacific coordinator Kurt Campbell said at a Center for a New American Security event last week. “Given the fact that our forces operate in proximity, we’re going to have increasing challenges.”</p></blockquote><p>If one reads the English-language Chinese media, such as <em>Global Times</em> and <em>CGTN</em>, it quickly becomes apparent that China neither fears the US military nor respects the US government anymore. While the Chinese are still wary of the power of the US military, particularly the sea power of the US Navy, it is evident that the Chinese are aware of the way in which US diplomacy is no longer in line with actual US military capabilities, as well as the fact that no agreement with the USA is worth the paper on which it is written.</p><p>No doubt this serious concerns those whose influence rests on their ability to confound others with their word-spells. But you can’t bamboozle those who won’t even talk to you. <em>Russia Today</em> notes the recent Chinese indifference to US diplomacy with <a href=\"https://www.rt.com/news/574487-us-china-relationship-diplomacy/\">a noticeable degree of satisfaction</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>China has demonstrated immense diplomatic patience towards the US over the past few years, even as Washington has been venting relentless hostility towards Beijing, including, but not limited to:</p><ul class=\"wp-block-list\"><li>accusations of genocide;</li><li>blacklisting numerous technology companies;</li><li>attempting to crush China’s technological development;</li><li>backtracking on its commitment to the One-China policy;</li><li>spreading conspiracy theories over the Covid-19 pandemic’s origins;</li><li>building new military alliances such as AUKUS, with the intention of containing China;</li><li>coercing third-party countries into blocking and rejecting key Chinese investments;</li><li>forcing other countries to take sides in an attempt to create a Cold-War-like climate;</li><li>whipping up anti-Chinese paranoia and vilification of China in US domestic politics.</li></ul><p>The list is not exhaustive, yet once upon a time, China genuinely believed that these hostile policies were a ‘glitch’ of the Trump administration, and sought to engage Biden positively to try and establish a course correction. It was wrong, it was very wrong. The Biden administration has not only embraced the foreign policy consensus which former President Donald Trump created, but has doubled down on it uncritically and made things even worse. This has empowered hawks in Beijing, including President Xi Jinping himself, who has now directly called out the US, to arrive at the conclusion that the relationship with the US is beyond saving. The domestic political climate within the US is so toxic that is questionable the Biden administration even controls its foreign policy at all. </p></blockquote><p>World War III has already begun. And the imperial USA is going to lose that war.</p><p><em><a href=\"https://social.infogalactic.com/micropost/25239f43-c293-4544-ad7b-9786ef38916f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "China has realized that Russia is correct and there is\nabsolutely no point in communicating\nwith an enemy party that is agreement-incapable.\nBeijing’s current aversion to sustained high-level engagement underscores the particularly fraught nature of U.S.-Chinese relations over the past few months. What was a two-sided desire to stabilize an increasingly volatile relationship is becoming much more about Washington reaching out and the Chinese government demurring.\nBeijing is increasingly resentful about U.S. arms sales to Taiwan and official contacts that China says encourage Taiwan’s pro-independence elements.\nThere’s always a certain degree of diplomatic theater to the canceling of high-level meetings between the United States and China. But ensuring stable communications with major adversaries like China and Russia has long been a U.S. preference. Some U.S. officials worry Beijing’s thin-skinned diplomacy is hampering crucial communication between the rivals in a way that could have global fallout in a major crisis.\n“The Chinese have been reluctant to engage in discussions around confidence building or crisis communications or hotlines,” National Security Council Indo-Pacific coordinator Kurt Campbell said at a Center for a New American Security event last week. “Given the fact that our forces operate in proximity, we’re going to have increasing challenges.”\nIf one reads the English-language Chinese media, such as\nGlobal Times\nand\nCGTN\n, it quickly becomes apparent that China neither fears the US military nor respects the US government anymore. While the Chinese are still wary of the power of the US military, particularly the sea power of the US Navy, it is evident that the Chinese are aware of the way in which US diplomacy is no longer in line with actual US military capabilities, as well as the fact that no agreement with the USA is worth the paper on which it is written.\nNo doubt this serious concerns those whose influence rests on their ability to confound others with their word-spells. But you can’t bamboozle those who won’t even talk to you.\nRussia Today\nnotes the recent Chinese indifference to US diplomacy with\na noticeable degree of satisfaction\n.\nChina has demonstrated immense diplomatic patience towards the US over the past few years, even as Washington has been venting relentless hostility towards Beijing, including, but not limited to:\naccusations of genocide;\nblacklisting numerous technology companies;\nattempting to crush China’s technological development;\nbacktracking on its commitment to the One-China policy;\nspreading conspiracy theories over the Covid-19 pandemic’s origins;\nbuilding new military alliances such as AUKUS, with the intention of containing China;\ncoercing third-party countries into blocking and rejecting key Chinese investments;\nforcing other countries to take sides in an attempt to create a Cold-War-like climate;\nwhipping up anti-Chinese paranoia and vilification of China in US domestic politics.\nThe list is not exhaustive, yet once upon a time, China genuinely believed that these hostile policies were a ‘glitch’ of the Trump administration, and sought to engage Biden positively to try and establish a course correction. It was wrong, it was very wrong. The Biden administration has not only embraced the foreign policy consensus which former President Donald Trump created, but has doubled down on it uncritically and made things even worse. This has empowered hawks in Beijing, including President Xi Jinping himself, who has now directly called out the US, to arrive at the conclusion that the relationship with the US is beyond saving. The domestic political climate within the US is so toxic that is questionable the Biden administration even controls its foreign policy at all.\nWorld War III has already begun. And the imperial USA is going to lose that war.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-11T11:40:12+00:00"
}