{
  "url": "https://voxday.net/2023/04/11/pfizer-pfaked-the-clinical-trials/",
  "scraped_at": "2026-01-08T13:53:31.007965",
  "title": "Pfizer Pfaked the Clinical Trials",
  "date_display": "April 11, 2023",
  "date_iso": "2023-04-11T14:10:33+00:00",
  "date_from_url": "2023-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we learn why science in the absence of Christianity or some other external standard imposing honesty on the process and the profession is doomed to inaccuracy and <a href=\"https://stevekirsch.substack.com/p/surprise-the-covid-vaccines-were\">being used as a basis for bad policy</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There were 31.2% higher deaths in the “gold standard” Pfizer Phase 3 clinical trials.</p><p>There is only one way to know whether or not the vaccine caused any of the deaths in the 21 vaccinated patients who died: proper histopathology.</p><p>Pfizer never did it and the FDA never asked for it.</p><p>This was the biggest mistake in the pandemic and nobody has acknowledged that or lifted a finger to correct it. Had they done the proper testing on the 21 deaths, the vaccine would never have been approved.</p><p>In lieu of the proper tests, there were assurances from Pfizer that nobody died from the vaccine. That’s absurd. We need the tests, not assurances. The tests are cheap and dispositive.</p><p>We can fix this in a New York minute, but nobody wants to know the answer.</p><p>Today, only Ryan Cole is doing the proper histopathology and in 100% of the cases he’s been asked to look at, he can attribute the deaths to the vaccine.</p></blockquote><p>In other words, the scientists did the trials, a number of people died, but the scientists falsely attributed the deaths to some other factor than the vaccine being tested.</p><p>We knew it. We absolutely <span style=\"text-decoration: underline;\">KNEW</span> it, but we didn’t have the conclusive evidence to prove it. Now we do. The vaxxes were never safe nor effective. And for many, it was a fatal mistake to trust the science.</p><p>Scientody is not only <span style=\"text-decoration: underline;\">not</span> a reliable mechanism for determining truth, in its corrupt modern form, the scientific method is absolutely guaranteed to be abused and used to mislead and deceive those who are foolish enough to trust the scientists.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8554dc14-2ea9-4680-b745-450e7d43457f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In which we learn why science in the absence of Christianity or some other external standard imposing honesty on the process and the profession is doomed to inaccuracy and\nbeing used as a basis for bad policy\n:\nThere were 31.2% higher deaths in the “gold standard” Pfizer Phase 3 clinical trials.\nThere is only one way to know whether or not the vaccine caused any of the deaths in the 21 vaccinated patients who died: proper histopathology.\nPfizer never did it and the FDA never asked for it.\nThis was the biggest mistake in the pandemic and nobody has acknowledged that or lifted a finger to correct it. Had they done the proper testing on the 21 deaths, the vaccine would never have been approved.\nIn lieu of the proper tests, there were assurances from Pfizer that nobody died from the vaccine. That’s absurd. We need the tests, not assurances. The tests are cheap and dispositive.\nWe can fix this in a New York minute, but nobody wants to know the answer.\nToday, only Ryan Cole is doing the proper histopathology and in 100% of the cases he’s been asked to look at, he can attribute the deaths to the vaccine.\nIn other words, the scientists did the trials, a number of people died, but the scientists falsely attributed the deaths to some other factor than the vaccine being tested.\nWe knew it. We absolutely\nKNEW\nit, but we didn’t have the conclusive evidence to prove it. Now we do. The vaxxes were never safe nor effective. And for many, it was a fatal mistake to trust the science.\nScientody is not only\nnot\na reliable mechanism for determining truth, in its corrupt modern form, the scientific method is absolutely guaranteed to be abused and used to mislead and deceive those who are foolish enough to trust the scientists.\nDISCUSS ON SG",
  "tags": [
    "health care",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-11T14:20:33+00:00"
}