{
  "url": "https://voxday.net/2023/04/23/the-false-history-of-constantinople/",
  "scraped_at": "2026-01-08T13:54:34.933342",
  "title": "The False History of Constantinople",
  "date_display": "April 23, 2023",
  "date_iso": "2023-04-23T09:44:36+00:00",
  "date_from_url": "2023-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The chronological revisionist historian Gunnar Heinsohn died in February. Among his intriguing theories is that the foundation of Constantinople by the Emperor Constantine <a href=\"https://www.unz.com/article/a-short-history-of-civilization/\">is a temporal exaggeration </a>constructed to provide additional support the historical primacy of the Bishop of Rome in line with the fictitious Donation of Constantine.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Eusebius’s <em>Life of Constantine</em> appears to be part of the popes’ industry of counterfeit history. The centerpiece of that program was the Donation of Constantine. As I wrote in my latest article, “it is no exaggeration to say that European history was, to a large extent, shaped—and doomed—by this single papal forgery.” This false Donation was the keystone of a great historical hoax by which Rome claimed universal supremacy over Constantinople. Significantly it was not until the mid-15th century, when Constantinople fell to the Ottomans, that the Donation was recognized as a forgery. As I argued in “A Byzantine View of Russia and Europe,” it is important for the future of Christendom that we in the West recognize that our point of view on this centuries-old rivalry has been shaped by papal propaganda.</p><p>The deception, I came to suspect, has been so thorough and systematic that it has tampered with the chronology—the ADN of history, so to speak—, resulting in a historical sequence of events from Rome to Constantinople which has never ceased to puzzle historians. Consider for example that, according to Ferdinand Lot, a respected pioneer in the study of Late Antiquity, “the foundation of Constantinople is a political enigma,” for which Lot finds no other explanation than: “Constantinople was born from the whim of a despot in the grip of an intense religious exaltation.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>New Rome, in his mind, was to be all Roman. He transported part of the Senate there and had palaces built for the old families he attracted there. The laws were all Roman. The language of the Court, of the offices was Latin. … And here is what happened: Constantinople became a Greek city again. Two centuries after its foundation, the descendants of the Romans transplanted into the pars Orientis had forgotten the language of their fathers, no longer knew anything of Latin literature, considered Italy and the West as a half-barbaric region. By changing their language they had changed their soul. Constantine thought he was regenerating the Roman Empire. Without suspecting it, he founded the Empire so aptly called “Byzantine”.[13]Ferdinand Lot, La Fin du monde antique (1927), Albin Michel, 1989, p. 49-50.</p></blockquote><p>My suspicion that this scenario is unrealistic has kept growing as I learned, among many other things listed here, that Constantine was a native of the Balkans who had never set foot in Rome before he conquered it from Maxentius. Nor had his predecessor Diocletian, who was also from the Balkans and resided in Nicodemia, on the east shore of the Bosphorus, at a time when Rome was “a dead city.”[14]Ibid., p. 2. (Ferdinand Lot, La Fin du monde antique (1927), Albin Michel, 1989, p. 49-50.) And isn’t it awkward that that Romans saw themselves as descendants of immigrants from Asia Minor, a belief illustrated by Virgil’s Aeneid and by the very name of Rome (Romos is a Greek word meaning “strong”). One source I hadn’t mentioned is the Latin historian Herodian (c. 170-240), who tells a revealing story about the Romans’ attachment to the goddess Cybelle, “mother of the gods”, and their sense of kinship to the Phrygians from Anatolia:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When Roman affairs prospered, they say that an oracle prophesied that the empire would endure and soar to greater heights if the goddess were brought from Pessinus to Rome. The Romans therefore sent an embassy to Phrygia and asked for the statue; they easily got it by reminding the Phrygians of their kinship and by recalling to them that Aeneas the Phrygian was the ancestor of the Romans. (Book 1, chapter 10)</p></blockquote><p>One of the most puzzling issue is the enduring controversy about the use of the term “Romans” (Rhomaioi) by which the “Byzantines” named themselves, and this controversy is symptomatic of a deeper cognitive dissonance. Let me illustrate this with a recent book by Greek-American historian Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium (2019). The author takes issue with the habit among Byzantinist scholars to underestimate the significance of the Byzantines’ self-identity as “Romans”. In reaction to one typical statement by those he calls “denialists” that, despite their “shrunken circumstances,” the Byzantines “found it difficult to abandon their sense of being Rhomaioi, ‘Romans’,”[15]Andrew Louth, Greek East and Latin West: The Church AD 681-1071, St Vladimir’s Seminary Press, 2007, p. 20. Kaldellis writes: “This sounds instead like a displaced metaphor for what is going on in modern scholarship: We would like to abandon the term Roman in dealing with the Byzantines, but we cannot quite do so, because it is written all over the sources.”[16]Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .</p><p>Kaldellis shows that the Byzantines understood their Romanness in an ethnic sense: in Constantinople and in its surrounding provinces lived a majority of “Romans” together with minorities such as Slavs, Rus’, Jews, Armenians, Persians, Arabs, Franks, Bulgars, Goths, who were citizens of the Empire, but were not regarded as “Romans”. Having convincingly established that “the Romans of Byzantium saw themselves as an ethnic group or nation,” Kaldellis asks:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Did the Byzantine Romans believe that they were collectively descended from the ancient Romans too? / This is harder to document. It probably formed only a vague aspect of Romanness in Byzantium; I doubt many people thought about it in explicit terms. But it was presupposed in many discursive practices. Merely by calling themselves Romans they asserted a continuity between themselves and the ancient Romans, whose default, unreflexive mode in traditional societies was generic.[17]Ibid., l. 1489.<br/>(Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)</p></blockquote><p>Kaldellis’ insistence that Byzantines were implicitly referring to their ancestors from Italy when calling themselves “Romans”, coupled with his inability to give any evidence of it, shows that it is an unsubstantiated presupposition. A mong the eight “snapshots” Kaldellis provides to “highlight the ethnic aspects of Romanness in Byzantium,” none of them indicate that Byzantines thought they descended from Italian or even Western immigrants, and three of them indicate the exact opposite:</p><ul class=\"wp-block-list\"><li>In a story from the Miracles of Saint Demetrios of Thessalonike, we hear about people captured in the Balkans by the Avars and resettled in Pannonia, on the south bank to the Danube. Although they married local women, sixty years later, “each child received from his father the ancestral traditions of the Romans and the impulse of their genos,” and “this large people longed to return to its ancestral cities.” By their ancestral cities, these “Romans” meant the Greek-speaking Balkans.[18]Ibid., l. 217-229. (Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)</li><li>In 1246, the population of Melnik wanted to be ruled by the Roman basileus rather that the Bulgarian tsar because, they said, “we all originate in Philippopolis and we are pure Romans when it comes to our genos.” Philippopolis is a Greek city founded by Philip II of Macedon, about 200 miles west of Constantinople, in today’s Bulgaria.[19]Ibid., l. 288. (Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)</li><li>Basileios I (867-886) settled people from Herakleia in his newly founded city of Kallipolis (Gallipoli) on the coast of southern Italy. A twelfth-century addition to the history of Ioannes Skylitzes comments: “This explains why that city still uses Roman customs and dress and a thoroughly Roman social order, down to this day.” Herakleia, or Heraclea Pontica, is a Greek city on the Black Sea coast, about 200 miles east of Constantinople.[20]Ibid., l. 883. (Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)</li></ul><p>In the first two instances, we have people equating their being Roman to their origin in the Balkans, not in Italy. In the third instance, we have people living in Italy calling themselves Romans specifically because they originate from Asia Minor—and presumably regarding their Italian neighbors as non-Romans.</p><p>So Kaldellis reads in his sources the exact opposite of what they say, because he takes as an unquestionable postulate that “Roman” means “from Rome, Italy”, or in a vaguer sense, of Western descent. If he had been consistent and unprejudiced in his quest for the ethnicity of the Byzantine Romans, he would have noticed that they referred to Italians not as Romans, but as Latins. (He should also have taken note that even the inhabitants of today’s Greece, from Late Antiquity throughout the Middle Ages, called themselves either “Romans” or “Hellenes”, never “Greeks”.[21]https://en.wikipedia.org/wiki/Name_of_Greece)</p><p>Kaldellis himself documents that the Byzantines not only called themselves Romans, but called their Greek language Romaic: “for most of their history the Byzantines did not think that their language made them Greek; to the contrary, their ethnicity as Romans made their language ‘Roman,’ or Romaic.” Still, Kaldellis accepts the premise that “they were Romans who had lost touch with the Latin tradition,” and concludes, “The Byzantines had two Roman languages, one the language of their ancestors (Latin) and another their language in the present (Romaic),” without even trying to solve the mystery of how they forsook their ancestors’ language, despite their strong ethnic sense of identity.[22]Kaldellis, Romanland, op. cit., l. 2136-2226. Kaldellis, in l. 2088, adopts the dubious claim, made by Carolina Cupane, that when Byzantines mention “the language of the Romans”, they sometimes meant Latin rather than Greek, but then he only provides evidence to the contrary.</p><p>These embarrassing facts, and many more mentioned in previous articles, point to a very fundamental misunderstanding which can easily be traced back to a sleight of hand by the medieval papacy, who tried to copyright the name “Roman” by erasing its eastern origin, and, with a fabricated legend of saint Peter, usurp Constantinople’s prestige as being the cradle and the capital of Christian civilization. The mystery of the original “Romans” ties up with some other historical mysteries such as the real ethnic origin of the Goths, or with a possibly related occultation of the historical role of the Slavs in Western civilization, theories which have been brought up in interesting comments under my previous articles, but about which I have yet to get a sufficient grasp.</p><p>Sticking to the controversy of who were the original Romans, I was more than intrigued when I learned that, based on stratigraphy alone, Heinsohn argued that the chronological sequence between Rome and Constantinople has been falsified. (Anatoly Fomenko makes the same claim based on a different and questionable method of investigation, arguing for a “Roman-Byzantine shift” of 333/360 years.) This is illustrated by the sequence of construction—from bottom to top—of the so-called Arch of Constantine in Rome, which is so inconsistent with the standard chronology that scholars assume that the three top stages were fitted with reliefs looted from earlier but unknown imperial buildings. This illustration, reproduced by Heinsohn in his very last article, “Constantine the Great in 1st Century AD Stratigraphy,” dated February 2023, is from the Wikipedia page. The temporal paradox is also illustrated by the aqueduct built by Hadrian (117-138 AD) in Byzantium. “This is considered a mystery,” Heinsohn notes, “because Byzantium’s actual founder, Constantine the Great (305-337 AD), did not expand the city until 200 years later.” In Heinsohn’s corrected chronology, “Hadrian’s aqueduct carries water to a flourishing city 100 years after Constantine, and not to a supposed wasteland centuries earlier. The mystery disappears. When Justinian renovates the great Basilica Cistern, which gathers water from Hadrian’s aqueduct, he does so not 400 years, but less than 100 years after it was built.”</p></blockquote><p>I don’t know enough to have an opinion on this particular chronological revisionism, but given what I know about the Nicene Creed vs the Niceno-Constanipolitan Creed and my opinion that Daniel Rohl’s New Egyptian Chronology (despite its obvious flaws) is at least a step in the right direction, it wouldn’t surprise me in the least if it turned out that the establishment of the Byzantine Empire turns out to be rather more complicated than it is presently described.</p><p>It certainly strikes me as very unlikely that such an obvious strategic location would be essentially unsettled prior to the Roman Emperor’s inexplicable decision to move his capitol city.</p><p>And I am very, very dubious about the “new” empires that have appeared in precisely the same place, albeit a different time, than the “missing” empires of the historical past. After all, if there is one thing we have absolutely had burned into our minds these last few years, it is that the knowledge of the current experts is not necessarily to be trusted over the traditional wisdom of the past.</p><p><em><a href=\"https://social.infogalactic.com/micropost/20bc85b5-f3aa-4c48-a5d8-e863496a7cd6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The chronological revisionist historian Gunnar Heinsohn died in February. Among his intriguing theories is that the foundation of Constantinople by the Emperor Constantine\nis a temporal exaggeration\nconstructed to provide additional support the historical primacy of the Bishop of Rome in line with the fictitious Donation of Constantine.\nEusebius’s\nLife of Constantine\nappears to be part of the popes’ industry of counterfeit history. The centerpiece of that program was the Donation of Constantine. As I wrote in my latest article, “it is no exaggeration to say that European history was, to a large extent, shaped—and doomed—by this single papal forgery.” This false Donation was the keystone of a great historical hoax by which Rome claimed universal supremacy over Constantinople. Significantly it was not until the mid-15th century, when Constantinople fell to the Ottomans, that the Donation was recognized as a forgery. As I argued in “A Byzantine View of Russia and Europe,” it is important for the future of Christendom that we in the West recognize that our point of view on this centuries-old rivalry has been shaped by papal propaganda.\nThe deception, I came to suspect, has been so thorough and systematic that it has tampered with the chronology—the ADN of history, so to speak—, resulting in a historical sequence of events from Rome to Constantinople which has never ceased to puzzle historians. Consider for example that, according to Ferdinand Lot, a respected pioneer in the study of Late Antiquity, “the foundation of Constantinople is a political enigma,” for which Lot finds no other explanation than: “Constantinople was born from the whim of a despot in the grip of an intense religious exaltation.\nNew Rome, in his mind, was to be all Roman. He transported part of the Senate there and had palaces built for the old families he attracted there. The laws were all Roman. The language of the Court, of the offices was Latin. … And here is what happened: Constantinople became a Greek city again. Two centuries after its foundation, the descendants of the Romans transplanted into the pars Orientis had forgotten the language of their fathers, no longer knew anything of Latin literature, considered Italy and the West as a half-barbaric region. By changing their language they had changed their soul. Constantine thought he was regenerating the Roman Empire. Without suspecting it, he founded the Empire so aptly called “Byzantine”.[13]Ferdinand Lot, La Fin du monde antique (1927), Albin Michel, 1989, p. 49-50.\nMy suspicion that this scenario is unrealistic has kept growing as I learned, among many other things listed here, that Constantine was a native of the Balkans who had never set foot in Rome before he conquered it from Maxentius. Nor had his predecessor Diocletian, who was also from the Balkans and resided in Nicodemia, on the east shore of the Bosphorus, at a time when Rome was “a dead city.”[14]Ibid., p. 2. (Ferdinand Lot, La Fin du monde antique (1927), Albin Michel, 1989, p. 49-50.) And isn’t it awkward that that Romans saw themselves as descendants of immigrants from Asia Minor, a belief illustrated by Virgil’s Aeneid and by the very name of Rome (Romos is a Greek word meaning “strong”). One source I hadn’t mentioned is the Latin historian Herodian (c. 170-240), who tells a revealing story about the Romans’ attachment to the goddess Cybelle, “mother of the gods”, and their sense of kinship to the Phrygians from Anatolia:\nWhen Roman affairs prospered, they say that an oracle prophesied that the empire would endure and soar to greater heights if the goddess were brought from Pessinus to Rome. The Romans therefore sent an embassy to Phrygia and asked for the statue; they easily got it by reminding the Phrygians of their kinship and by recalling to them that Aeneas the Phrygian was the ancestor of the Romans. (Book 1, chapter 10)\nOne of the most puzzling issue is the enduring controversy about the use of the term “Romans” (Rhomaioi) by which the “Byzantines” named themselves, and this controversy is symptomatic of a deeper cognitive dissonance. Let me illustrate this with a recent book by Greek-American historian Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium (2019). The author takes issue with the habit among Byzantinist scholars to underestimate the significance of the Byzantines’ self-identity as “Romans”. In reaction to one typical statement by those he calls “denialists” that, despite their “shrunken circumstances,” the Byzantines “found it difficult to abandon their sense of being Rhomaioi, ‘Romans’,”[15]Andrew Louth, Greek East and Latin West: The Church AD 681-1071, St Vladimir’s Seminary Press, 2007, p. 20. Kaldellis writes: “This sounds instead like a displaced metaphor for what is going on in modern scholarship: We would like to abandon the term Roman in dealing with the Byzantines, but we cannot quite do so, because it is written all over the sources.”[16]Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .\nKaldellis shows that the Byzantines understood their Romanness in an ethnic sense: in Constantinople and in its surrounding provinces lived a majority of “Romans” together with minorities such as Slavs, Rus’, Jews, Armenians, Persians, Arabs, Franks, Bulgars, Goths, who were citizens of the Empire, but were not regarded as “Romans”. Having convincingly established that “the Romans of Byzantium saw themselves as an ethnic group or nation,” Kaldellis asks:\nDid the Byzantine Romans believe that they were collectively descended from the ancient Romans too? / This is harder to document. It probably formed only a vague aspect of Romanness in Byzantium; I doubt many people thought about it in explicit terms. But it was presupposed in many discursive practices. Merely by calling themselves Romans they asserted a continuity between themselves and the ancient Romans, whose default, unreflexive mode in traditional societies was generic.[17]Ibid., l. 1489.\n(Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)\nKaldellis’ insistence that Byzantines were implicitly referring to their ancestors from Italy when calling themselves “Romans”, coupled with his inability to give any evidence of it, shows that it is an unsubstantiated presupposition. A mong the eight “snapshots” Kaldellis provides to “highlight the ethnic aspects of Romanness in Byzantium,” none of them indicate that Byzantines thought they descended from Italian or even Western immigrants, and three of them indicate the exact opposite:\nIn a story from the Miracles of Saint Demetrios of Thessalonike, we hear about people captured in the Balkans by the Avars and resettled in Pannonia, on the south bank to the Danube. Although they married local women, sixty years later, “each child received from his father the ancestral traditions of the Romans and the impulse of their genos,” and “this large people longed to return to its ancestral cities.” By their ancestral cities, these “Romans” meant the Greek-speaking Balkans.[18]Ibid., l. 217-229. (Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)\nIn 1246, the population of Melnik wanted to be ruled by the Roman basileus rather that the Bulgarian tsar because, they said, “we all originate in Philippopolis and we are pure Romans when it comes to our genos.” Philippopolis is a Greek city founded by Philip II of Macedon, about 200 miles west of Constantinople, in today’s Bulgaria.[19]Ibid., l. 288. (Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)\nBasileios I (867-886) settled people from Herakleia in his newly founded city of Kallipolis (Gallipoli) on the coast of southern Italy. A twelfth-century addition to the history of Ioannes Skylitzes comments: “This explains why that city still uses Roman customs and dress and a thoroughly Roman social order, down to this day.” Herakleia, or Heraclea Pontica, is a Greek city on the Black Sea coast, about 200 miles east of Constantinople.[20]Ibid., l. 883. (Anthony Kaldellis, Romanland: Ethnicity and Empire in Byzantium, Belknap Press, 2019, kindle l. 629-641 .)\nIn the first two instances, we have people equating their being Roman to their origin in the Balkans, not in Italy. In the third instance, we have people living in Italy calling themselves Romans specifically because they originate from Asia Minor—and presumably regarding their Italian neighbors as non-Romans.\nSo Kaldellis reads in his sources the exact opposite of what they say, because he takes as an unquestionable postulate that “Roman” means “from Rome, Italy”, or in a vaguer sense, of Western descent. If he had been consistent and unprejudiced in his quest for the ethnicity of the Byzantine Romans, he would have noticed that they referred to Italians not as Romans, but as Latins. (He should also have taken note that even the inhabitants of today’s Greece, from Late Antiquity throughout the Middle Ages, called themselves either “Romans” or “Hellenes”, never “Greeks”.[21]https://en.wikipedia.org/wiki/Name_of_Greece)\nKaldellis himself documents that the Byzantines not only called themselves Romans, but called their Greek language Romaic: “for most of their history the Byzantines did not think that their language made them Greek; to the contrary, their ethnicity as Romans made their language ‘Roman,’ or Romaic.” Still, Kaldellis accepts the premise that “they were Romans who had lost touch with the Latin tradition,” and concludes, “The Byzantines had two Roman languages, one the language of their ancestors (Latin) and another their language in the present (Romaic),” without even trying to solve the mystery of how they forsook their ancestors’ language, despite their strong ethnic sense of identity.[22]Kaldellis, Romanland, op. cit., l. 2136-2226. Kaldellis, in l. 2088, adopts the dubious claim, made by Carolina Cupane, that when Byzantines mention “the language of the Romans”, they sometimes meant Latin rather than Greek, but then he only provides evidence to the contrary.\nThese embarrassing facts, and many more mentioned in previous articles, point to a very fundamental misunderstanding which can easily be traced back to a sleight of hand by the medieval papacy, who tried to copyright the name “Roman” by erasing its eastern origin, and, with a fabricated legend of saint Peter, usurp Constantinople’s prestige as being the cradle and the capital of Christian civilization. The mystery of the original “Romans” ties up with some other historical mysteries such as the real ethnic origin of the Goths, or with a possibly related occultation of the historical role of the Slavs in Western civilization, theories which have been brought up in interesting comments under my previous articles, but about which I have yet to get a sufficient grasp.\nSticking to the controversy of who were the original Romans, I was more than intrigued when I learned that, based on stratigraphy alone, Heinsohn argued that the chronological sequence between Rome and Constantinople has been falsified. (Anatoly Fomenko makes the same claim based on a different and questionable method of investigation, arguing for a “Roman-Byzantine shift” of 333/360 years.) This is illustrated by the sequence of construction—from bottom to top—of the so-called Arch of Constantine in Rome, which is so inconsistent with the standard chronology that scholars assume that the three top stages were fitted with reliefs looted from earlier but unknown imperial buildings. This illustration, reproduced by Heinsohn in his very last article, “Constantine the Great in 1st Century AD Stratigraphy,” dated February 2023, is from the Wikipedia page. The temporal paradox is also illustrated by the aqueduct built by Hadrian (117-138 AD) in Byzantium. “This is considered a mystery,” Heinsohn notes, “because Byzantium’s actual founder, Constantine the Great (305-337 AD), did not expand the city until 200 years later.” In Heinsohn’s corrected chronology, “Hadrian’s aqueduct carries water to a flourishing city 100 years after Constantine, and not to a supposed wasteland centuries earlier. The mystery disappears. When Justinian renovates the great Basilica Cistern, which gathers water from Hadrian’s aqueduct, he does so not 400 years, but less than 100 years after it was built.”\nI don’t know enough to have an opinion on this particular chronological revisionism, but given what I know about the Nicene Creed vs the Niceno-Constanipolitan Creed and my opinion that Daniel Rohl’s New Egyptian Chronology (despite its obvious flaws) is at least a step in the right direction, it wouldn’t surprise me in the least if it turned out that the establishment of the Byzantine Empire turns out to be rather more complicated than it is presently described.\nIt certainly strikes me as very unlikely that such an obvious strategic location would be essentially unsettled prior to the Roman Emperor’s inexplicable decision to move his capitol city.\nAnd I am very, very dubious about the “new” empires that have appeared in precisely the same place, albeit a different time, than the “missing” empires of the historical past. After all, if there is one thing we have absolutely had burned into our minds these last few years, it is that the knowledge of the current experts is not necessarily to be trusted over the traditional wisdom of the past.\nDISCUSS ON SG",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-23T10:07:08+00:00"
}