{
  "url": "https://voxday.net/2023/04/12/they-may-not-be-there/",
  "scraped_at": "2026-01-08T13:53:41.333686",
  "title": "They May Not Be There",
  "date_display": "April 12, 2023",
  "date_iso": "2023-04-12T09:41:10+00:00",
  "date_from_url": "2023-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amazon follows up its closure of Book Depository by announcing that <a href=\"https://soundadvicenews.com/2023/03/31/the-best-soundbars-for-surround-sound-goodbye-to-dpreview-week-13-2023/\">it is shutting down Digital Photography Review</a> as well. Given the observable pattern here, it’s really not looking good for GoodReads.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The demise of <em>Digital Photography Review</em>: I have written this column for over 20 continuous years and this is the saddest news I have ever had to report. <a href=\"https://www.dpreview.com/\">Digital Photography Review</a> is closing down and as of April 10, 2023 the site will be locked and no new content will be added. More ominously, the site states “The site will be available in read-only mode for a limited period afterwards.” That is a businesslike way of saying the site and all its content will soon disappear for good.</p><p>Amazon is responsible for this. They purchased the site in 2007 and now that it does not fit in their business plans, they are going to erase it. This is despicable given the cost of keeping the site available in static form is infinitesimal to a company Amazon’s size.</p><p>Surely Amazon can be a good corporate citizen and keep the site up in read-only mode, for the good of everyone? It would be wonderful if a white knight came in and saved DPReview, but that is looking less and less likely. Online commentators are calling the upcoming site deletion “cultural vandalism” and “book burning.” I am with them and in terms of book burning, in the realm of photography it is like burning The Library of Alexandria. The significance of dpreview.com to the industry and photographers everywhere cannot be overstated. There are in-depth camera reviews going back to 1998 along with a comparator that allows you to compare test scene images from almost every camera they have ever tested. There are also forums with sample images and discussions containing millions of pages of content. Despite only being around 25 years old it is probably the most important and comprehensive photographic resource that ever existed.</p><p>If these is a takeaway from all of this, it is about big companies taking things away. That is a lot easier for them to do today than in years past when we relied on physical books, magazines and packaged media for reading and entertainment. While I enjoy streaming and it has a place and a purpose for those who enjoys television, movies and music, I have long been a proponent of physical media for the image and sound quality as well as its immutable nature. I have more to say about this and will continue the discussion in a future column. In the meantime, be warned and if there are movies, TV shows, and music that is near and dear to your heart, get yourself a hard copy. It may not be there for you tomorrow.</p></blockquote><p>This is precisely why it is so important to subscribe to <a href=\"https://arkhavencomics.com/product/castalia-library-subscription/\">Castalia Library</a> and <a href=\"https://arkhavencomics.com/product/castalia-history-subscription/\">Castalia History</a>. Remember, I’m not the one pointing this out, this is some random audio expert to whom I have no connection who is observing Amazon’s recent actions and reaching the same conclusions I reached when Amazon first launched Kindle Unlimited and I did the math concerning the huge reduction of ebook compensation for the authors and publishers.</p><p>The observation that this is about the corpocracy “taking things away” is very astute. This is the complete erasure of a knowledge base, and if the author’s opinion about the importance of the site is correct, the erasure of a significant one. While Amazon has apparently backtracked from its original intention of erasing the site due to the backlash <a href=\"https://www.dpreview.com/news/0507902613/dpreview-closure-an-update\">and now intends to archive it</a>, there cannot be much doubt that the company will eventually eliminate the archive as soon as it feels that it can get away with doing so.</p><p>This is why the new Castalia Library site upon which we are now working is intended to include a free digital library that will be funded by the Library operations, beginning with the Library and History books we are publishing, rights-permitting. Look for more announcements on that front in future Castalia newsletters.</p><p>I anticipate that we will eventually need to launch a book review site to which only subscribers will be permitted to contribute, similar to the design concept I produced for a hypothetical book award that was subsequently proved necessary by the convergence of the Dragon Awards. While it may be too soon for the West to need physical monasteries to preserve the knowledge of the past, it is not too soon to begin building them.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7fc93207-d47b-4ce0-8158-cc7a3d6577be\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Amazon follows up its closure of Book Depository by announcing that\nit is shutting down Digital Photography Review\nas well. Given the observable pattern here, it’s really not looking good for GoodReads.\nThe demise of\nDigital Photography Review\n: I have written this column for over 20 continuous years and this is the saddest news I have ever had to report.\nDigital Photography Review\nis closing down and as of April 10, 2023 the site will be locked and no new content will be added. More ominously, the site states “The site will be available in read-only mode for a limited period afterwards.” That is a businesslike way of saying the site and all its content will soon disappear for good.\nAmazon is responsible for this. They purchased the site in 2007 and now that it does not fit in their business plans, they are going to erase it. This is despicable given the cost of keeping the site available in static form is infinitesimal to a company Amazon’s size.\nSurely Amazon can be a good corporate citizen and keep the site up in read-only mode, for the good of everyone? It would be wonderful if a white knight came in and saved DPReview, but that is looking less and less likely. Online commentators are calling the upcoming site deletion “cultural vandalism” and “book burning.” I am with them and in terms of book burning, in the realm of photography it is like burning The Library of Alexandria. The significance of dpreview.com to the industry and photographers everywhere cannot be overstated. There are in-depth camera reviews going back to 1998 along with a comparator that allows you to compare test scene images from almost every camera they have ever tested. There are also forums with sample images and discussions containing millions of pages of content. Despite only being around 25 years old it is probably the most important and comprehensive photographic resource that ever existed.\nIf these is a takeaway from all of this, it is about big companies taking things away. That is a lot easier for them to do today than in years past when we relied on physical books, magazines and packaged media for reading and entertainment. While I enjoy streaming and it has a place and a purpose for those who enjoys television, movies and music, I have long been a proponent of physical media for the image and sound quality as well as its immutable nature. I have more to say about this and will continue the discussion in a future column. In the meantime, be warned and if there are movies, TV shows, and music that is near and dear to your heart, get yourself a hard copy. It may not be there for you tomorrow.\nThis is precisely why it is so important to subscribe to\nCastalia Library\nand\nCastalia History\n. Remember, I’m not the one pointing this out, this is some random audio expert to whom I have no connection who is observing Amazon’s recent actions and reaching the same conclusions I reached when Amazon first launched Kindle Unlimited and I did the math concerning the huge reduction of ebook compensation for the authors and publishers.\nThe observation that this is about the corpocracy “taking things away” is very astute. This is the complete erasure of a knowledge base, and if the author’s opinion about the importance of the site is correct, the erasure of a significant one. While Amazon has apparently backtracked from its original intention of erasing the site due to the backlash\nand now intends to archive it\n, there cannot be much doubt that the company will eventually eliminate the archive as soon as it feels that it can get away with doing so.\nThis is why the new Castalia Library site upon which we are now working is intended to include a free digital library that will be funded by the Library operations, beginning with the Library and History books we are publishing, rights-permitting. Look for more announcements on that front in future Castalia newsletters.\nI anticipate that we will eventually need to launch a book review site to which only subscribers will be permitted to contribute, similar to the design concept I produced for a hypothetical book award that was subsequently proved necessary by the convergence of the Dragon Awards. While it may be too soon for the West to need physical monasteries to preserve the knowledge of the past, it is not too soon to begin building them.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-04-12T22:01:54+00:00"
}