{
  "url": "https://voxday.net/2014/10/27/a-movement-in-multiple-denia/",
  "scraped_at": "2025-12-16T12:32:32.875967",
  "title": "4GW and failed narratives",
  "date_display": "October 27, 2014",
  "date_iso": "2014-10-27T08:32:00+00:00",
  "date_from_url": "2014-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>#GamerHate is just chock full of “gamers”. A bunch of anti-GamerGater’s predictably responded poorly to this assertion:<br> <b><i>If you are anti-#GamerGate, you are no longer a gamer. You may play games, but you are not a part of gaming culture. You have rejected it.</i></b></br></p><blockquote class=\"tr_bq\"><p> Zaid Jilani ‏@ZaidJilani<br> @voxday i will 1v1 u in any game of your choosing while quoting statistics on the dwindling white population of america</br></p><p>Vox Day ‏@voxday 9m9 minutes ago<br> ASL live on VASL. We can record it for posterity. You choose scenario, I choose side.</br></p><p>Zaid Jilani ‏@ZaidJilani<br> wtf is asl and vasl</br></p><p>Vox Day ‏@voxday <br> ASL = Advanced Squad Leader. VASL = Virtual Advanced Squad Leader. So, what scenario shall we play?</br></p><p>Zaid Jilani ‏@ZaidJilani<br> what the f is this crap you dont have starcraft?</br></p></blockquote><p>Yeah, those #GamerHate guys are simply <i>hardcore </i>gamers-4-life. The same assertion prompted Chris Kluwe aka @chriswarcraft aka Sparklepunter to decide that it would be a good idea to attempt to DISQUALIFY me.</p><blockquote class=\"tr_bq\"><p> ChrisKluwe @ChrisWarcraft<br> Hey #Gamergate’rs, you cool with letting a self admitted white supremacist speak for your movement? Just curious.</br></p><p>Vox Day ‏@voxday <br> @ChrisWarcraft I’m an Indian, Sparklepunter. Feather, not dot, complete with tribe. With one-quarter Mexican heritage to boot.</br></p></blockquote><p>I do find it amusing how the pinkshirts just can’t stop walking right into their own racist assumptions. Especially how they will deny the undeniable rather than question their own belief that the magic red people can’t possibly disagree with their petty white fascism. They’re not only attempting to deny my Native American heritage, some are even trying to deny my Mexican heritage, which would certainly surprise my great-grandfather, the Mexican revolutionary, and my great-uncle, the well-known Mexican-American artist.</p><p>It is also interesting to observe Kluwe’s foolish resort to the self-admitted lie. I’ve never admitted any such thing. NK Jemisin told precisely the same sort of lie, although she lied about me being a “a self-described<br> misogynist, racist, anti-Semite, and a few other flavors of asshole” rather than being “a self admitted white supremacist”. Again, I have never described myself as any of those things. Of course, if we know one thing about the pinkshirts, it is that they have a problematic relationship with the truth.</br></p><p>In any event, what Sparklepunter is trying to do is to “fix-and-freeze” the opposition, in order to DISQUALIFY me, and through me, #GamerGate. But not only is his attempt to do so inept, but the very fact that he made it at all demonstrates how the gamerhating pinkshirts are overmatched. It’s an intrinsically 2GW way of thinking, to make contact, then call in for fire support. But even if he did manage to somehow completely disqualify me – a dubious proposition in light of more than 10 years of failed attempts that have only seen my site numbers grow – it wouldn’t matter any more than a USAF drone strike killing yet another “al-Qaeda Number Two”.</p><p>In this regard, #GamerGate and the response to it has been a fascinating illustration of 2GW vs 4GW. And it is an illuminating lesson concerning the truth of William S. Lind’s statement, <i><i>“</i>almost always, the state is losing.” </i>In this case, applied 4GW marks the end of the media’s ability to control the narrative.</p></div>",
  "content_text": "#GamerHate is just chock full of “gamers”. A bunch of anti-GamerGater’s predictably responded poorly to this assertion:\nIf you are anti-#GamerGate, you are no longer a gamer. You may play games, but you are not a part of gaming culture. You have rejected it.\nZaid Jilani ‏@ZaidJilani\n@voxday i will 1v1 u in any game of your choosing while quoting statistics on the dwindling white population of america\nVox Day ‏@voxday 9m9 minutes ago\nASL live on VASL. We can record it for posterity. You choose scenario, I choose side.\nZaid Jilani ‏@ZaidJilani\nwtf is asl and vasl\nVox Day ‏@voxday\nASL = Advanced Squad Leader. VASL = Virtual Advanced Squad Leader. So, what scenario shall we play?\nZaid Jilani ‏@ZaidJilani\nwhat the f is this crap you dont have starcraft?\nYeah, those #GamerHate guys are simply\nhardcore\ngamers-4-life. The same assertion prompted Chris Kluwe aka @chriswarcraft aka Sparklepunter to decide that it would be a good idea to attempt to DISQUALIFY me.\nChrisKluwe @ChrisWarcraft\nHey #Gamergate’rs, you cool with letting a self admitted white supremacist speak for your movement? Just curious.\nVox Day ‏@voxday\n@ChrisWarcraft I’m an Indian, Sparklepunter. Feather, not dot, complete with tribe. With one-quarter Mexican heritage to boot.\nI do find it amusing how the pinkshirts just can’t stop walking right into their own racist assumptions. Especially how they will deny the undeniable rather than question their own belief that the magic red people can’t possibly disagree with their petty white fascism. They’re not only attempting to deny my Native American heritage, some are even trying to deny my Mexican heritage, which would certainly surprise my great-grandfather, the Mexican revolutionary, and my great-uncle, the well-known Mexican-American artist.\nIt is also interesting to observe Kluwe’s foolish resort to the self-admitted lie. I’ve never admitted any such thing. NK Jemisin told precisely the same sort of lie, although she lied about me being a “a self-described\nmisogynist, racist, anti-Semite, and a few other flavors of asshole” rather than being “a self admitted white supremacist”. Again, I have never described myself as any of those things. Of course, if we know one thing about the pinkshirts, it is that they have a problematic relationship with the truth.\nIn any event, what Sparklepunter is trying to do is to “fix-and-freeze” the opposition, in order to DISQUALIFY me, and through me, #GamerGate. But not only is his attempt to do so inept, but the very fact that he made it at all demonstrates how the gamerhating pinkshirts are overmatched. It’s an intrinsically 2GW way of thinking, to make contact, then call in for fire support. But even if he did manage to somehow completely disqualify me – a dubious proposition in light of more than 10 years of failed attempts that have only seen my site numbers grow – it wouldn’t matter any more than a USAF drone strike killing yet another “al-Qaeda Number Two”.\nIn this regard, #GamerGate and the response to it has been a fascinating illustration of 2GW vs 4GW. And it is an illuminating lesson concerning the truth of William S. Lind’s statement,\n“\nalmost always, the state is losing.”\nIn this case, applied 4GW marks the end of the media’s ability to control the narrative.",
  "tags": [
    "games",
    "Red Card"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-27T08:32:00+00:00"
}