{
  "url": "https://voxday.net/2014/10/11/a-new-projec/",
  "scraped_at": "2025-12-16T12:30:40.992676",
  "title": "A new project",
  "date_display": "October 11, 2014",
  "date_iso": "2014-10-11T10:08:00+00:00",
  "date_from_url": "2014-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few weeks ago, I had an idea for a general review site with certain specific features that all the various review sites are lacking. Then, at a recent technology conference, I saw a French guy presenting a cross-platform review system that rather cleverly combined a scraping technology with a Twitter-like interface. I realized that he’d already done 75 percent of the work my idea would require, found him later, and told him that I thought we should work together, to which he quite naturally responded: “who are you?”</p><p>After I explained my ideas, we had lunch, discovered that our visions were entirely compatible. So, instead of another game design, I’m dabbling in technology design again, and I have to say that this is considerably easier than trying to figure out how to manufacture 18-button mice in China. Of course, it’s all just interface in the end, and there are more similarities between game design and this sort of app design than you might think.</p><p>The system is called <a href=\"http://re.co/\">Recommend</a>. The site and iPhone app is live already, you can see it at re.co or via the App Store. There you can also see my first 12+ recommendations, which range from an AWESOME for Advanced Squad Leader to DISAPPOINTING for Disturbed’s Asylum. I will also soon be one of their Experts in the Game and Book categories. It’s a very clever system that automatically adds a picture scooped from the Internet, and it only takes two or three minutes to create and write-up a complete recommendation.</p><p>The reason the system is of great interest to experts and influencers is that it permits the linking back to whatever link the reco-writer wishes. So, for example, <a href=\"http://re.co/r/4EB85138\">my reco</a> (as they call it) of John Wright’s THE GOLDEN AGE links to <a href=\"http://www.castaliahouse.com/review-the-golden-age-by-john-c-wright/\">Scooter’s review</a> of the book on the Castalia House blog. There will eventually be considerably more to the system than this, as I am presently designing a gamefication system that will allow Recommend users to build up their influence as the first of at least three new systems that will help turn Recommend into something considerably more advanced and useful than Yelp. Note that it is very much in development at the moment, but even in its early state, it is already informative and useful.</p><p>I would love to see a hundred or more Dread Ilk become influential via this system, so if you’d like to help out, there are two ways you can do so right now. The first is very simple. Just go to <a href=\"http://re.co/\">Recommend</a>, sign up, follow me, and start creating your own recos. I’ll follow you in return and soon we’ll have a dynamic intra-Ilk recommendation system in operation. Right now they only have four ratings, from Horrible to Awesome, but that will be increased to six in the near future. And if you happen to like one of the things I’m recommending, click on the Recommend box to co-recommend it.</p><p>The second way to help is a little more complex. One of the things I’ve been asked to do is to find and vet bona fide experts in various fields. So, if you happen to be a legitimate expert in something and are willing to commit to doing 20 recos per month, sign up, write a reco or three as an example and to see how much work in involved, then shoot me an email with EXPERT in the subject. I’ll check them out and then get in touch with you. The field can be literally anything, from astrophysics to video production, and you can recommend anything, from audio software to zoos.</p><p>And simply because someone will ask the question, no, this does not change anything at all with regards to Alpenwolf and Castalia House. I usually have between 4 and 5 projects going at once, and since I recently finished two other projects, this is only number three at present. I seldom talk about those other projects, but in this case, since it is a social media project which the Ilk can most certainly assist, it makes sense to do so.</p></div>",
  "content_text": "A few weeks ago, I had an idea for a general review site with certain specific features that all the various review sites are lacking. Then, at a recent technology conference, I saw a French guy presenting a cross-platform review system that rather cleverly combined a scraping technology with a Twitter-like interface. I realized that he’d already done 75 percent of the work my idea would require, found him later, and told him that I thought we should work together, to which he quite naturally responded: “who are you?”\nAfter I explained my ideas, we had lunch, discovered that our visions were entirely compatible. So, instead of another game design, I’m dabbling in technology design again, and I have to say that this is considerably easier than trying to figure out how to manufacture 18-button mice in China. Of course, it’s all just interface in the end, and there are more similarities between game design and this sort of app design than you might think.\nThe system is called\nRecommend\n. The site and iPhone app is live already, you can see it at re.co or via the App Store. There you can also see my first 12+ recommendations, which range from an AWESOME for Advanced Squad Leader to DISAPPOINTING for Disturbed’s Asylum. I will also soon be one of their Experts in the Game and Book categories. It’s a very clever system that automatically adds a picture scooped from the Internet, and it only takes two or three minutes to create and write-up a complete recommendation.\nThe reason the system is of great interest to experts and influencers is that it permits the linking back to whatever link the reco-writer wishes. So, for example,\nmy reco\n(as they call it) of John Wright’s THE GOLDEN AGE links to\nScooter’s review\nof the book on the Castalia House blog. There will eventually be considerably more to the system than this, as I am presently designing a gamefication system that will allow Recommend users to build up their influence as the first of at least three new systems that will help turn Recommend into something considerably more advanced and useful than Yelp. Note that it is very much in development at the moment, but even in its early state, it is already informative and useful.\nI would love to see a hundred or more Dread Ilk become influential via this system, so if you’d like to help out, there are two ways you can do so right now. The first is very simple. Just go to\nRecommend\n, sign up, follow me, and start creating your own recos. I’ll follow you in return and soon we’ll have a dynamic intra-Ilk recommendation system in operation. Right now they only have four ratings, from Horrible to Awesome, but that will be increased to six in the near future. And if you happen to like one of the things I’m recommending, click on the Recommend box to co-recommend it.\nThe second way to help is a little more complex. One of the things I’ve been asked to do is to find and vet bona fide experts in various fields. So, if you happen to be a legitimate expert in something and are willing to commit to doing 20 recos per month, sign up, write a reco or three as an example and to see how much work in involved, then shoot me an email with EXPERT in the subject. I’ll check them out and then get in touch with you. The field can be literally anything, from astrophysics to video production, and you can recommend anything, from audio software to zoos.\nAnd simply because someone will ask the question, no, this does not change anything at all with regards to Alpenwolf and Castalia House. I usually have between 4 and 5 projects going at once, and since I recently finished two other projects, this is only number three at present. I seldom talk about those other projects, but in this case, since it is a social media project which the Ilk can most certainly assist, it makes sense to do so.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-11T09:08:00+00:00"
}