{
  "url": "https://voxday.net/2014/10/02/a-new-spin-on-homeschool-or-die/",
  "scraped_at": "2025-12-16T12:29:46.981460",
  "title": "A new spin on “Homeschool or Die”",
  "date_display": "October 2, 2014",
  "date_iso": "2014-10-02T07:28:00+00:00",
  "date_from_url": "2014-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dallas parents are <a href=\"http://www.star-telegram.com/2014/10/01/6165611/officials-say-only-one-ebola-case.html\">pulling their kids out of school</a> rather than risk further exposure to Ebola:</p><blockquote class=\"tr_bq\"><p> Parents rushed to get their children from school Wednesday after<br> learning that five students may have had contact with the Ebola patient<br> in a Dallas hospital, as Gov. Rick Perry and other leaders reassured the<br> public that there is no cause for alarm. The patient, identified<br> by The Associated Press as Thomas Eric Duncan of Liberia, arrived in<br> the U.S. on Sept. 20 to visit family. Dallas County Health and Human<br> Services Director Zachary Thompson said county officials suspect that 12<br> to 18 people may have had contact with Duncan.</br></br></br></br></br></br></br></p><p>“Right now, the<br> base number is 18 people, and that could increase,” he said. Thompson<br> said more details are expected by Thursday afternoon. The number<br> includes five students at four schools, Dallas school district<br> Superintendent Mike Miles said.</br></br></br></br></p><p>“This case is serious,” Perry said<br> during a news conference at Texas Health Presbyterian Hospital Dallas,<br> where Duncan is being treated. “Rest assured that our system is working<br> as it should. Professionals on every level on the chain of command know<br> what to do to minimize this potential risk to the people of Texas and of<br> this country.”</br></br></br></br></br></p></blockquote><p>They’ve already permitted foreigners from a land where the virus is out of control to not only enter the state, but mingle freely with a) sick people at a hospital and b) schoolchildren, but everyone is supposed to trust that they know what to do?</p><p>I don’t think so.</p><p>Liberians could see their family members if their family members were repatriated. Wasn’t the whole idea of Liberia to send Africans back to Africa? Why is the USA reimporting Africans in the first place?</p><p>The fury of the American public if white schoolchildren start dying of Ebola is not going to be pretty. Perhaps there is no cause for alarm, one hopes there is no caue for alarm, but so far, the noises out of the politicians smack more of frightened people worried about the public’s reaction if it knew the truth of the situation than of people in control of the situation. I expect we’ll find out soon enough.</p><p>Regardless, all travel from West Africa needs to be halted now. It should have been halted six weeks ago. Air France, British Airways, and Emirates stopped all flights to Liberia and Sierra Leone back in early August. Congressman Alan Grayson called for a travel ban from Liberia and other infected countries <i>in July</i>! So, why is anyone from West Africa still being permitted to enter the USA?</p><p>From <a href=\"http://www.zerohedge.com/news/2014-10-01/how-bad-could-it-get-us-government-order-160000-hazmat-suits-gives-clue\">ZEROHEDGE</a>: <i>Now that Ebola is officially in the US on an<br> uncontrolled basis, the  two questions on everyone’s lips are i) who<br> will get sick next and ii)  how bad could it get? We don’t know the<br> answer to question #1  just yet, but when it comes to the second one, a<br> press release three  weeks ago from Lakeland Industries, a manufacturer<br> and seller of a  “comprehensive line of safety garments and accessories<br> for the  industrial protective clothing market” may provide some insight<br> into  just how bad the US State Department thinks it may get. Because<br> when the  US government buys 160,000 hazmat suits specifically designed<br> against  Ebola, just ahead of the worst Ebola epidemic in history making<br> US  landfall, one wonders: <b>what do they know that we don’t?</b></br></br></br></br></br></br></br></br></br></br></i></p><p>And then there is this <a href=\"http://pjmedia.com/instapundit/195978/\">from the CDC</a>:<i> “</i><i>Because we still do not know exactly how people are infected with Ebola,<br> few primary prevention measures have been established and no vaccine<br> exists.” </br></br></i></p><p>UPDATE: The magic of diversity and geographical translocation <a href=\"http://www.thegatewaypundit.com/2014/10/breaking-dallas-ebola-patient-vomited-wildly-outside-his-apartment/\">in action</a>.</p><blockquote class=\"tr_bq\"><p> Two days after he was sent home from a Dallas hospital, the man who is the first person to be diagnosed with Ebola in the United States was seen vomiting on the ground outside an apartment complex as he was bundled into an ambulance. “His whole family was screaming. He got outside and he was throwing up all over the place,” resident Mesud Osmanovic, 21, said on Wednesday, describing the chaotic scene before the man was admitted to Texas Health Presbyterian Hospital on Sunday where he is in serious condition. </p></blockquote><p>UPDATE 2: “<strong>TEXAS HEALTH OFFICIALS INCREASE NUMBER OF POSSIBLE CONTACTS OF EBOLA VICTIM TO 100″</strong></p><p>That’s up from 12…. </p></div>",
  "content_text": "Dallas parents are\npulling their kids out of school\nrather than risk further exposure to Ebola:\nParents rushed to get their children from school Wednesday after\nlearning that five students may have had contact with the Ebola patient\nin a Dallas hospital, as Gov. Rick Perry and other leaders reassured the\npublic that there is no cause for alarm. The patient, identified\nby The Associated Press as Thomas Eric Duncan of Liberia, arrived in\nthe U.S. on Sept. 20 to visit family. Dallas County Health and Human\nServices Director Zachary Thompson said county officials suspect that 12\nto 18 people may have had contact with Duncan.\n“Right now, the\nbase number is 18 people, and that could increase,” he said. Thompson\nsaid more details are expected by Thursday afternoon. The number\nincludes five students at four schools, Dallas school district\nSuperintendent Mike Miles said.\n“This case is serious,” Perry said\nduring a news conference at Texas Health Presbyterian Hospital Dallas,\nwhere Duncan is being treated. “Rest assured that our system is working\nas it should. Professionals on every level on the chain of command know\nwhat to do to minimize this potential risk to the people of Texas and of\nthis country.”\nThey’ve already permitted foreigners from a land where the virus is out of control to not only enter the state, but mingle freely with a) sick people at a hospital and b) schoolchildren, but everyone is supposed to trust that they know what to do?\nI don’t think so.\nLiberians could see their family members if their family members were repatriated. Wasn’t the whole idea of Liberia to send Africans back to Africa? Why is the USA reimporting Africans in the first place?\nThe fury of the American public if white schoolchildren start dying of Ebola is not going to be pretty. Perhaps there is no cause for alarm, one hopes there is no caue for alarm, but so far, the noises out of the politicians smack more of frightened people worried about the public’s reaction if it knew the truth of the situation than of people in control of the situation. I expect we’ll find out soon enough.\nRegardless, all travel from West Africa needs to be halted now. It should have been halted six weeks ago. Air France, British Airways, and Emirates stopped all flights to Liberia and Sierra Leone back in early August. Congressman Alan Grayson called for a travel ban from Liberia and other infected countries\nin July\n! So, why is anyone from West Africa still being permitted to enter the USA?\nFrom\nZEROHEDGE\n:\nNow that Ebola is officially in the US on an\nuncontrolled basis, the  two questions on everyone’s lips are i) who\nwill get sick next and ii)  how bad could it get? We don’t know the\nanswer to question #1  just yet, but when it comes to the second one, a\npress release three  weeks ago from Lakeland Industries, a manufacturer\nand seller of a  “comprehensive line of safety garments and accessories\nfor the  industrial protective clothing market” may provide some insight\ninto  just how bad the US State Department thinks it may get. Because\nwhen the  US government buys 160,000 hazmat suits specifically designed\nagainst  Ebola, just ahead of the worst Ebola epidemic in history making\nUS  landfall, one wonders:\nwhat do they know that we don’t?\nAnd then there is this\nfrom the CDC\n:\n“\nBecause we still do not know exactly how people are infected with Ebola,\nfew primary prevention measures have been established and no vaccine\nexists.”\nUPDATE: The magic of diversity and geographical translocation\nin action\n.\nTwo days after he was sent home from a Dallas hospital, the man who is the first person to be diagnosed with Ebola in the United States was seen vomiting on the ground outside an apartment complex as he was bundled into an ambulance. “His whole family was screaming. He got outside and he was throwing up all over the place,” resident Mesud Osmanovic, 21, said on Wednesday, describing the chaotic scene before the man was admitted to Texas Health Presbyterian Hospital on Sunday where he is in serious condition.\nUPDATE 2: “\nTEXAS HEALTH OFFICIALS INCREASE NUMBER OF POSSIBLE CONTACTS OF EBOLA VICTIM TO 100″\nThat’s up from 12….",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-02T06:28:00+00:00"
}