{
  "url": "https://voxday.net/2014/10/12/about-six-years/",
  "scraped_at": "2025-12-16T12:30:49.777903",
  "title": "About six years",
  "date_display": "October 12, 2014",
  "date_iso": "2014-10-12T13:00:00+00:00",
  "date_from_url": "2014-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s how much time the American can-kicking in Iraq bought. Of course, it is readily apparent that this was rather like going buying time in order to go from the frying pan into the blast furnace.  Another prescient selection from William S. Lind’s forthcoming <i>ON WAR</i>:</p><blockquote class=\"tr_bq\"><p> A piece in the December 27, 2007 <i>Cleveland Plain Dealer</i>, “Vote on fate of Kirkuk postponed,” by Tina Susman and Asso Ahmed of the L.A. Times, reported that:<i> “Kurdish lawmakers agreed Wednesday to a six-month delay in a referendum on whether the oil-rich city of Kirkuk should join the semi-autonomous region of Kurdistan or remain under Iraqi central government control….Also Wednesday, the head of the Iraqi parliament’s constitutional review committee, Humam Hamoudi, said he would request a three-month delay in rewriting the national constitution. That would mark the fourth time the target date…has been put off.”</i></p><p>As the Iraqis kick the can down the road, so do the Americans. The American-funded Sunni militia, aka the Concerned Local Citizens or the Awakening, has grown to 72,000 volunteers in nearly 300 communities in Iraq. They have been credited with reducing violence in some of Iraq’s most violent areas. But many people, including some Sunnis, worry that the groups could destabilize Iraq.</p><p>The concern is a valid one. With our usual charming naiveté, we seem to think the Sunnis have become our friends. But they are merely using us to help them get ready for the next round with the Shiites and, in the case of Kirkuk, the Kurds.</p></blockquote><p>They were indeed, as “destabilize” is a mild way of putting it. That American-funded Sunni militia, aka the Concerned Local Citizens aka the Awakening aka the Islamic State, is now engaged in successfully fighting that anticipated next round with both the Shiites and the Kurds. They’ve not only taken Kirkuk and are pressing the Kurds hard in the north, but are also threatening to besiege a Baghdad ruled by a crumbling Shiite US-puppet government.</p><p>As in the case of al Qaeda, the Islamic State was directly subsidized by the American government. If this sort of repetitive blowback does not suffice to convince you that expansionist imperialism abroad is a fool’s game, then one can only conclude that you are one of those Aristotle characterized as impervious to information. We don’t always have to do something, especially when that something has the predictable probability of making matters worse.</p></div>",
  "content_text": "That’s how much time the American can-kicking in Iraq bought. Of course, it is readily apparent that this was rather like going buying time in order to go from the frying pan into the blast furnace.  Another prescient selection from William S. Lind’s forthcoming\nON WAR\n:\nA piece in the December 27, 2007\nCleveland Plain Dealer\n, “Vote on fate of Kirkuk postponed,” by Tina Susman and Asso Ahmed of the L.A. Times, reported that:\n“Kurdish lawmakers agreed Wednesday to a six-month delay in a referendum on whether the oil-rich city of Kirkuk should join the semi-autonomous region of Kurdistan or remain under Iraqi central government control….Also Wednesday, the head of the Iraqi parliament’s constitutional review committee, Humam Hamoudi, said he would request a three-month delay in rewriting the national constitution. That would mark the fourth time the target date…has been put off.”\nAs the Iraqis kick the can down the road, so do the Americans. The American-funded Sunni militia, aka the Concerned Local Citizens or the Awakening, has grown to 72,000 volunteers in nearly 300 communities in Iraq. They have been credited with reducing violence in some of Iraq’s most violent areas. But many people, including some Sunnis, worry that the groups could destabilize Iraq.\nThe concern is a valid one. With our usual charming naiveté, we seem to think the Sunnis have become our friends. But they are merely using us to help them get ready for the next round with the Shiites and, in the case of Kirkuk, the Kurds.\nThey were indeed, as “destabilize” is a mild way of putting it. That American-funded Sunni militia, aka the Concerned Local Citizens aka the Awakening aka the Islamic State, is now engaged in successfully fighting that anticipated next round with both the Shiites and the Kurds. They’ve not only taken Kirkuk and are pressing the Kurds hard in the north, but are also threatening to besiege a Baghdad ruled by a crumbling Shiite US-puppet government.\nAs in the case of al Qaeda, the Islamic State was directly subsidized by the American government. If this sort of repetitive blowback does not suffice to convince you that expansionist imperialism abroad is a fool’s game, then one can only conclude that you are one of those Aristotle characterized as impervious to information. We don’t always have to do something, especially when that something has the predictable probability of making matters worse.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-12T12:00:00+00:00"
}