{
  "url": "https://voxday.net/2014/10/20/an-unmoored-state/",
  "scraped_at": "2025-12-16T12:31:48.099460",
  "title": "An unmoored state",
  "date_display": "October 20, 2014",
  "date_iso": "2014-10-20T16:00:00+00:00",
  "date_from_url": "2014-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright drops <a href=\"http://www.scifiwright.com/2014/10/snap-out-of-it/\">a daisycutter of law and logic</a> on the celebrants of the ur-legalization of sodogamy:</p><blockquote class=\"tr_bq\"><p> The proponents of what is called (with unintentional hilarity) gay marriage express the gaiety for which they are named by crowing and gamboling with delight that the Supreme Court has declined to do its core Constitutional mission of interpreting the law, and chastise and check the abuses of activist judges overruling the sovereign votes of the decent and sober majority.</p><p>They should perhaps rein in their gay celebrations: gay marriage cannot be justified either in law or logic. This means the law has just departed from the environs of law and logic.</p><p>The gay partisans should instead recoil with dread, for the thing, by being given into their hands, is effectively destroyed. Whatever meaning or sanction the pairs of homosexuals are seeking out of the pretense of marriage is destroyed by the very fact that it is a pretense, not a marriage.</p><p>I am not speaking about an abstraction, but as a matter of law. The way law works, for those of you who are unfamiliar with the basic principle, is that once a precedent is established, until and unless it is definitively overruled, it has controlling authority over every case standing on similar facts, and the degree of similarity is the core of what all legal arguments are about.</p><p>This ruling, now left to stand, will and must create more havoc with family law, with testaments and estates, divorce laws, property laws, far more than if the government simply decreed marriage to be a private contract. No matter what the desires and tastes of the reformers, and no matter their promises, once set in motion, the law operates by a logic and by an inertia of its own.</p></blockquote><p>I have been pointing out the increasing U.S. abandonment of law (and, for that matter Law) for nearly a decade now. I first noticed it back in the 1990s, when a petty legal case to which I was the only witness was settled, in the courtroom, by the judge literally flipping a coin. At the time, this was shocking to me. These days, I think the average man would consider himself lucky if he managed to get fifty-fifty odds of genuine justice being done.</p><p>What we are witnessing here in the Supreme Court’s cowardly decision to permit the widespread implementation of sodogamy through inaction is precisely what Wright describes, the abandonment of law and logic. I’m not even remotely surprised by the Court’s decision to punt; the reason they did so was expressly because they did NOT wish to set a precedent, any precedent, in either direction. On the one hand, they did not wish to “turn the clock back” in favor of traditional, actual marriage because they wish to curry favor with the global elite that are actively seeking to destroy marriage. On the other, they did not wish to set an actual legal precedent because there are no solid legal or logical grounds that would permit them to demolish the concept of marriage consisting of the union of one man with one woman that would be limited to only changing the “man/woman” element; every argument that can be made for sodogamy can also be made every bit as effectively for polygamy and for unions with non-human entities. Regardless of whether you are anti-sodogamy or pro-marriage equality, this abandonment of jurisprudence should not be celebrated.</p><p>The continued abandonment of law and morality is inevitable at this point, to the extent it hasn’t already happened. It is part and parcel of a civilization in the latter stages of decline, and our responsibility is not to try to prevent its fall, but rather, to continue to uphold each petty traditional <i>schwerkpunkt </i>represented by the families and institutions that have not succumbed to the cultural rot. Human societies are cyclical entities, and one can no more fight the cycle than gravity. This is not, however, a counsel of despair, but rather, one of hope. “Progress” is neither linear nor inevitable. What we are seeing has happened before, and will happen again. Our fathers and grandfathers may have failed to sustain the civilization they inherited, but we cannot be held responsible for that. What we can, and will be responsible, is if we fail to keep the seeds of that civilization alive to pass on to future generations.</p><p>We are the bases of tomorrow’s civilization. We are the foundation of tomorrow’s societies that will rise from the swirling barbarism. Don’t forget that.</p></div>",
  "content_text": "John C. Wright drops\na daisycutter of law and logic\non the celebrants of the ur-legalization of sodogamy:\nThe proponents of what is called (with unintentional hilarity) gay marriage express the gaiety for which they are named by crowing and gamboling with delight that the Supreme Court has declined to do its core Constitutional mission of interpreting the law, and chastise and check the abuses of activist judges overruling the sovereign votes of the decent and sober majority.\nThey should perhaps rein in their gay celebrations: gay marriage cannot be justified either in law or logic. This means the law has just departed from the environs of law and logic.\nThe gay partisans should instead recoil with dread, for the thing, by being given into their hands, is effectively destroyed. Whatever meaning or sanction the pairs of homosexuals are seeking out of the pretense of marriage is destroyed by the very fact that it is a pretense, not a marriage.\nI am not speaking about an abstraction, but as a matter of law. The way law works, for those of you who are unfamiliar with the basic principle, is that once a precedent is established, until and unless it is definitively overruled, it has controlling authority over every case standing on similar facts, and the degree of similarity is the core of what all legal arguments are about.\nThis ruling, now left to stand, will and must create more havoc with family law, with testaments and estates, divorce laws, property laws, far more than if the government simply decreed marriage to be a private contract. No matter what the desires and tastes of the reformers, and no matter their promises, once set in motion, the law operates by a logic and by an inertia of its own.\nI have been pointing out the increasing U.S. abandonment of law (and, for that matter Law) for nearly a decade now. I first noticed it back in the 1990s, when a petty legal case to which I was the only witness was settled, in the courtroom, by the judge literally flipping a coin. At the time, this was shocking to me. These days, I think the average man would consider himself lucky if he managed to get fifty-fifty odds of genuine justice being done.\nWhat we are witnessing here in the Supreme Court’s cowardly decision to permit the widespread implementation of sodogamy through inaction is precisely what Wright describes, the abandonment of law and logic. I’m not even remotely surprised by the Court’s decision to punt; the reason they did so was expressly because they did NOT wish to set a precedent, any precedent, in either direction. On the one hand, they did not wish to “turn the clock back” in favor of traditional, actual marriage because they wish to curry favor with the global elite that are actively seeking to destroy marriage. On the other, they did not wish to set an actual legal precedent because there are no solid legal or logical grounds that would permit them to demolish the concept of marriage consisting of the union of one man with one woman that would be limited to only changing the “man/woman” element; every argument that can be made for sodogamy can also be made every bit as effectively for polygamy and for unions with non-human entities. Regardless of whether you are anti-sodogamy or pro-marriage equality, this abandonment of jurisprudence should not be celebrated.\nThe continued abandonment of law and morality is inevitable at this point, to the extent it hasn’t already happened. It is part and parcel of a civilization in the latter stages of decline, and our responsibility is not to try to prevent its fall, but rather, to continue to uphold each petty traditional\nschwerkpunkt\nrepresented by the families and institutions that have not succumbed to the cultural rot. Human societies are cyclical entities, and one can no more fight the cycle than gravity. This is not, however, a counsel of despair, but rather, one of hope. “Progress” is neither linear nor inevitable. What we are seeing has happened before, and will happen again. Our fathers and grandfathers may have failed to sustain the civilization they inherited, but we cannot be held responsible for that. What we can, and will be responsible, is if we fail to keep the seeds of that civilization alive to pass on to future generations.\nWe are the bases of tomorrow’s civilization. We are the foundation of tomorrow’s societies that will rise from the swirling barbarism. Don’t forget that.",
  "tags": [
    "decline and fall",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-20T15:00:00+00:00"
}