{
  "url": "https://voxday.net/2014/10/30/brad-wardell-sets-record-straig/",
  "scraped_at": "2025-12-16T12:33:00.800317",
  "title": "Brad Wardell sets the record straight",
  "date_display": "October 30, 2014",
  "date_iso": "2014-10-30T12:58:00+00:00",
  "date_from_url": "2014-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.littletinyfrogs.com/article/458579/The_long_lasting_effects_of_dishonest_reporting\">response to a multi-faceted attempt at character assassination</a> is one of the reasons it is so important to support #GamerGate even if you are not a hardcore gamer:</p><blockquote class=\"tr_bq\"><p> Recently game designer Damion Schubert wrote a blog criticizing some recent reporting by Breibart regarding <a href=\"http://www.breitbart.com/Breitbart-London/2014/09/23/How-sloppy-biased-video-games-reporting-almost-destroyed-a-CEO\">how sloppy reporting had hurt my career</a>. In his criticism, Damion had used a hit piece Kotaku had published on me as evidence that the reporting done on me had been reasonable.  In response, I went through his blog to point out the various factual errors the Kotaku article had made by relying on only a single, biased source along with carefully selected court documents to create a narrative that had nothing to do with reality.</p><p>Damion and I got talking after my post and in which I was able to show him more material that demonstrated how ridiculous the original Kotaku article had been.  In the 2 years since the Kotaku article, no one who has gotten to see some of the actual details of the frivolous lawsuit that had been filed against us has not been convinced that the original case and the reporting of it was a travesty.</p><p>Damion has followed up with <a href=\"http://www.zenofdesign.com/in-which-i-acknowledge-and-apologize/\">this post retracting his original blog</a>.</p><p>Out of respect for Damion, I’m going to update this article to be a more generic response to those who continue to harass me or my employer regarding the unsavory lawsuit that was inaccurately reported on back in 2012.</p><p>A brief recap</p><p>Stardock is a consumer software company that was founded over 20 years ago.  For 20 years we’ve made award winning games and software used by millions of people.  I incorporated the company in 1993 as a college student to help pay for school. Eventually, it succeeded beyond my wildest dreams and became my full time career.  Today, it is possibly the oldest independent game company with more than 50 employees.</p><p>In 2012, I was best known for things like:</p><p>    Gamer’s Bill of Rights<br>     Designer of Galactic Civilizations<br>     The publisher of Sins of a Solar Empire<br>     The CEO who had promised (and delivered)  the sequel and its expansion to Elemental because we were disappointed that a Stardock game was released in a poor state. <br>     The designer of programs like Start8, ObjectDock, WindowBlinds, DesktopX, ModernMix, etc.</br></br></br></br></p><p>In short I had a good reputation.</p></blockquote><p>At this point, #GamerGate is about more than games now. It is a <i>Schwerpunkt </i>in the ongoing cultural war for the West. And the gamers of #GamerGate are the only defenders of freedom and Western civilization who are counterattacking and causing enemy casualties. That is why it is more than important, it is vital to see non-gamers joining the cause rather than sneering from the sidelines.</p><p>Because if the pinkshirts haven’t come after you and yours yet, they assuredly will so long as you have not submitted to them. Consider these tweets from Chris “Sparklepunter” Kluwe in which he announces a personal boycott and tries to threaten Brad Wardell’s employment due to his support of #GamerGate:</p><blockquote class=\"tr_bq\"><p> I will no longer be purchasing anything from Stardock due to their CEO @draginol’s stance on #Gamergate and “SJW”s.</p><p>Which is a shame, because I REALLY like Sins of a Solar Empire. Sorry,<br> Stardock. Get a CEO who understands empathy, and we’ll be friends.</br></p></blockquote><p>As a longtime game reviewer, I already have copies of Sins of a Solar Empire as well as Galactic Civilizations, but I will commit to buying Sorceror Kings when it becomes available. If you are a gamer, I would encourage you to <a href=\"https://store.stardock.com/\">buy a Stardock game</a> today. I can attest that they are good, solid strategy games.</p></div>",
  "content_text": "This\nresponse to a multi-faceted attempt at character assassination\nis one of the reasons it is so important to support #GamerGate even if you are not a hardcore gamer:\nRecently game designer Damion Schubert wrote a blog criticizing some recent reporting by Breibart regarding\nhow sloppy reporting had hurt my career\n. In his criticism, Damion had used a hit piece Kotaku had published on me as evidence that the reporting done on me had been reasonable.  In response, I went through his blog to point out the various factual errors the Kotaku article had made by relying on only a single, biased source along with carefully selected court documents to create a narrative that had nothing to do with reality.\nDamion and I got talking after my post and in which I was able to show him more material that demonstrated how ridiculous the original Kotaku article had been.  In the 2 years since the Kotaku article, no one who has gotten to see some of the actual details of the frivolous lawsuit that had been filed against us has not been convinced that the original case and the reporting of it was a travesty.\nDamion has followed up with\nthis post retracting his original blog\n.\nOut of respect for Damion, I’m going to update this article to be a more generic response to those who continue to harass me or my employer regarding the unsavory lawsuit that was inaccurately reported on back in 2012.\nA brief recap\nStardock is a consumer software company that was founded over 20 years ago.  For 20 years we’ve made award winning games and software used by millions of people.  I incorporated the company in 1993 as a college student to help pay for school. Eventually, it succeeded beyond my wildest dreams and became my full time career.  Today, it is possibly the oldest independent game company with more than 50 employees.\nIn 2012, I was best known for things like:\nGamer’s Bill of Rights\nDesigner of Galactic Civilizations\nThe publisher of Sins of a Solar Empire\nThe CEO who had promised (and delivered)  the sequel and its expansion to Elemental because we were disappointed that a Stardock game was released in a poor state.\nThe designer of programs like Start8, ObjectDock, WindowBlinds, DesktopX, ModernMix, etc.\nIn short I had a good reputation.\nAt this point, #GamerGate is about more than games now. It is a\nSchwerpunkt\nin the ongoing cultural war for the West. And the gamers of #GamerGate are the only defenders of freedom and Western civilization who are counterattacking and causing enemy casualties. That is why it is more than important, it is vital to see non-gamers joining the cause rather than sneering from the sidelines.\nBecause if the pinkshirts haven’t come after you and yours yet, they assuredly will so long as you have not submitted to them. Consider these tweets from Chris “Sparklepunter” Kluwe in which he announces a personal boycott and tries to threaten Brad Wardell’s employment due to his support of #GamerGate:\nI will no longer be purchasing anything from Stardock due to their CEO @draginol’s stance on #Gamergate and “SJW”s.\nWhich is a shame, because I REALLY like Sins of a Solar Empire. Sorry,\nStardock. Get a CEO who understands empathy, and we’ll be friends.\nAs a longtime game reviewer, I already have copies of Sins of a Solar Empire as well as Galactic Civilizations, but I will commit to buying Sorceror Kings when it becomes available. If you are a gamer, I would encourage you to\nbuy a Stardock game\ntoday. I can attest that they are good, solid strategy games.",
  "tags": [
    "Clash of Civilizations",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-30T12:58:00+00:00"
}