{
  "url": "https://voxday.net/2014/10/25/choose-this-day/",
  "scraped_at": "2025-12-16T12:32:20.670569",
  "title": "Choose this day",
  "date_display": "October 25, 2014",
  "date_iso": "2014-10-25T10:55:00+00:00",
  "date_from_url": "2014-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To paraphrase Joshua, choose this day with whom you will stand. Clark at PopeHat has <a href=\"http://www.popehat.com/2014/10/21/gamer-gate-three-stages-to-obit/\">an intelligent and analytical piece</a> that contains an important section on the way pinkshirts invade and take over organizations and institutions, but I can’t agree with his quasi-neutral position. In any case, consider this very good description of what he calls entryism:</p><blockquote class=\"tr_bq\"><p> The entryism is of the usual type: people with blue/pink ideals join red / gray groups and try to achieve social status with in those groups, then use that social status to push for the admission of – and promotion of – more blue/pink members. Once the blue/pink members achieve a majority they then change the rules of admission to create a lock on their new conquest (in the case of academia, for example, even blue researchers in the Netherlands of all places, were shocked by how blatant the process was).</p><p>The status shaming is also of the usual type: high status blue / pinks follow Alinksy’s battle plan.</p><p>First, they pick a low-status target (rule 12). This target is usually a pale, bespectacled Aspergers-ish nerd) for a transgression against the norms they wish to universalize. The high social status pinks paint themselves as victims of a power imbalance, then they use their superior popularity to out-speak the target and push their version of the narrative. Pink allies in the media join in to keep the pressure on (rule 8). This is easy to do, because the act of social shaming is not only fun, but it’s click-bait, so everyone involved not only has lolz, they has cheeseburger (rule 6). The toxic nature of the allegations is usually sufficient to make sure that the target of the attack does not get much, if any, sympathetic press (rule 12, again: “Cut off the support network and isolate the target from sympathy. Go after people and not institutions; people hurt faster than institutions”.)</p><p>In computer gaming the attempt at entry came by first establishing a few pinks inside the community (not a problem, because the world of gamer development did not think of itself as politicized), and then using these pink resources to promote, give good reviews to, and bestow awards on pink developers and pink games, even when the games in question are not “games” by the normal definition.</p></blockquote><p>Excellent observations. I would add that what I call Blues (and Clark calls red/gray) do not join Pink organizations, both because they have no desire to do so and because pink groups actively police their ranks at all times. Look at how rapidly I was purged from SFWA, in a clear violation of  by people who did not even qualify to join it for years after I became a member. The old school writers, who made a living publishing science fiction, didn’t care what anyone else thought about anything. The new school pretenders, many of whom are primarily activists of one sort or another and have not even published a single novel, care about little else.</p><p>That is why it is so difficult for organizations to recover once penetrated by entryist pinkshirts. The result is no more surprising than when one country invades another that has not bothered to field an army. Once the organization is occupied, it is easier to simply leave than to organize resistance among the stunned and demoralized membership. And those who don’t leave of their own volition will be pushed out, even for so small an “infraction” as <a href=\"http://sports.yahoo.com/blogs/golf-devil-ball-golf/pga-of-america-president-ted-bishop-ousted-for-sexist-remarks-235343870.html\">referring to someone as “li’l girl”</a>. Notice that the PGA President was fired in the name of the same “inclusivity” that the pinkshirts are now attempting to force on the gaming industry. “Inclusivity” must be rejected as strongly and as firmly as “equality”, “fairness”, and ever other pinkshirt slogan.</p><p>What Clark’s analysis unfortunately leaves out of the equation is that pinkshirts are intrinsically parasitical. For all that they preen about being “creative”, they do not create anything and they are incapable of building anything that is not political in nature. They are, for the most part, women and feminized men; it is not an accident that many of the “women” who are actually doing something in the game industry – for all his flaws and histrionics, Brianna Wu is a legitimate game developer – are actually men.</p><p>It’s important to remember that the pinks are not the political Left per se. They are a radical subset of it. There are certainly genuine left-wing creators, but the fact that they are genuine creators means that they have no need to interfere with other creators in any way. The more you see someone aggressively speaking out about the need to interfere with the creations of others, the more you can be certain that they have no ability to create anything themselves.</p><p>The single biggest problem that the Blue side has is the stubborn determination of many who do not sign onto the Pink program to remain on the fence until something affects them personally. I remember the cynical laughter of my father when a longtime friend, who had scoffed at my father’s concerns about the growing anti-business bureaucracy in Minnesota for more than 15 years, was suddenly galvanized into political action when the grasping tentacles finally reached into his own medical practice. It was, of course, far too late at that point.</p><p>That’s why it is important for those who don’t sign onto the pinkshirts’ program to actively oppose it. Yes, they will call you names. Yes, they will actively attempt to harm you and your career. But here is the secret: they are going to do it anyhow and buying time is only going to ensure that you will face them when they are stronger and more able to harm you.</p><p>What #GamerGate has shown is that we have the ability to strike back. We have the ability to harm them the way they are constantly seeking to harm us. Standing up to them works. Look at how their attempt to isolate me completely imploded; not only has this blog now reliably seeing nearly 3x the daily traffic as the one-time leading blog in SF/F, but Thursday marked its single most-trafficked day ever without any media coverage or even any links from a bigger site like Instapundit.</p><p>And speaking of Instapundit, look at the way more and more people have no tolerance for the pinkshirts. The mere polite mention of receiving a Scalzi book in the mail was enough to provoke anger; the most liked comment was this one from David in Virginia: <i>“Not one penny to Scalzi from me. You can pump his stuff till hell<br> freezes over, Professor, and he still won’t get one red cent from me.”</br></i></p><p>I’m not addressing the Dread Ilk here. You guys have been PHENOMENAL. I can’t even thank you when you get my back from time to time because you guys always there. You’ve made Castalia House, which originally was just supposed to be a way of getting my books out there after Marcher Lord was bought, a going concern in which my books are practically a minor afterthought, so much so that successful, mainstream-published authors have been contacting us to discuss the possibility of working with us. I may not be the sort to need emotional support, (as Jonah Goldberg once said, I feed on the Dark Side of the Force) but it’s good to know that it is there nevertheless.</p><p>No, I’m addressing the Grays, the fence-sitters, the people who are hoping against hope that this will pass them by and the situation will magically improve. It won’t, so long as you and others like you are afraid. But I’m telling you, as someone who has been targeted unmercilessly by everyone from CAIR to the SFWA, there is no reason for fear. Standing up to them won’t kill you and it will make you stronger, more confident, and more capable. You’ll lose battles, sure, but you will win the war.</p><p>So get off the fence. Choose your side. Do something. Support the Blues. Stand with them instead of distancing yourself from them as if it will save you. (It won’t.) Attack the pinkshirts at their various points of weakness. Here is my pledge to you. If you do something, whether it is starting a game journo site, developing a card game, making a VASSAL module, reviewing books, or launching an email campaign against SyFy, I will support it somehow. Maybe via a personal endorsement (or a timely critique, if that would be more helpful), maybe a blog post, most often just a tweet. I simply can’t do much more than I’m already doing; as it stands, I’m already up until close to dawn working on my various game, book, and technology projects. But I can, and will, support you in yours.</p></div>",
  "content_text": "To paraphrase Joshua, choose this day with whom you will stand. Clark at PopeHat has\nan intelligent and analytical piece\nthat contains an important section on the way pinkshirts invade and take over organizations and institutions, but I can’t agree with his quasi-neutral position. In any case, consider this very good description of what he calls entryism:\nThe entryism is of the usual type: people with blue/pink ideals join red / gray groups and try to achieve social status with in those groups, then use that social status to push for the admission of – and promotion of – more blue/pink members. Once the blue/pink members achieve a majority they then change the rules of admission to create a lock on their new conquest (in the case of academia, for example, even blue researchers in the Netherlands of all places, were shocked by how blatant the process was).\nThe status shaming is also of the usual type: high status blue / pinks follow Alinksy’s battle plan.\nFirst, they pick a low-status target (rule 12). This target is usually a pale, bespectacled Aspergers-ish nerd) for a transgression against the norms they wish to universalize. The high social status pinks paint themselves as victims of a power imbalance, then they use their superior popularity to out-speak the target and push their version of the narrative. Pink allies in the media join in to keep the pressure on (rule 8). This is easy to do, because the act of social shaming is not only fun, but it’s click-bait, so everyone involved not only has lolz, they has cheeseburger (rule 6). The toxic nature of the allegations is usually sufficient to make sure that the target of the attack does not get much, if any, sympathetic press (rule 12, again: “Cut off the support network and isolate the target from sympathy. Go after people and not institutions; people hurt faster than institutions”.)\nIn computer gaming the attempt at entry came by first establishing a few pinks inside the community (not a problem, because the world of gamer development did not think of itself as politicized), and then using these pink resources to promote, give good reviews to, and bestow awards on pink developers and pink games, even when the games in question are not “games” by the normal definition.\nExcellent observations. I would add that what I call Blues (and Clark calls red/gray) do not join Pink organizations, both because they have no desire to do so and because pink groups actively police their ranks at all times. Look at how rapidly I was purged from SFWA, in a clear violation of  by people who did not even qualify to join it for years after I became a member. The old school writers, who made a living publishing science fiction, didn’t care what anyone else thought about anything. The new school pretenders, many of whom are primarily activists of one sort or another and have not even published a single novel, care about little else.\nThat is why it is so difficult for organizations to recover once penetrated by entryist pinkshirts. The result is no more surprising than when one country invades another that has not bothered to field an army. Once the organization is occupied, it is easier to simply leave than to organize resistance among the stunned and demoralized membership. And those who don’t leave of their own volition will be pushed out, even for so small an “infraction” as\nreferring to someone as “li’l girl”\n. Notice that the PGA President was fired in the name of the same “inclusivity” that the pinkshirts are now attempting to force on the gaming industry. “Inclusivity” must be rejected as strongly and as firmly as “equality”, “fairness”, and ever other pinkshirt slogan.\nWhat Clark’s analysis unfortunately leaves out of the equation is that pinkshirts are intrinsically parasitical. For all that they preen about being “creative”, they do not create anything and they are incapable of building anything that is not political in nature. They are, for the most part, women and feminized men; it is not an accident that many of the “women” who are actually doing something in the game industry – for all his flaws and histrionics, Brianna Wu is a legitimate game developer – are actually men.\nIt’s important to remember that the pinks are not the political Left per se. They are a radical subset of it. There are certainly genuine left-wing creators, but the fact that they are genuine creators means that they have no need to interfere with other creators in any way. The more you see someone aggressively speaking out about the need to interfere with the creations of others, the more you can be certain that they have no ability to create anything themselves.\nThe single biggest problem that the Blue side has is the stubborn determination of many who do not sign onto the Pink program to remain on the fence until something affects them personally. I remember the cynical laughter of my father when a longtime friend, who had scoffed at my father’s concerns about the growing anti-business bureaucracy in Minnesota for more than 15 years, was suddenly galvanized into political action when the grasping tentacles finally reached into his own medical practice. It was, of course, far too late at that point.\nThat’s why it is important for those who don’t sign onto the pinkshirts’ program to actively oppose it. Yes, they will call you names. Yes, they will actively attempt to harm you and your career. But here is the secret: they are going to do it anyhow and buying time is only going to ensure that you will face them when they are stronger and more able to harm you.\nWhat #GamerGate has shown is that we have the ability to strike back. We have the ability to harm them the way they are constantly seeking to harm us. Standing up to them works. Look at how their attempt to isolate me completely imploded; not only has this blog now reliably seeing nearly 3x the daily traffic as the one-time leading blog in SF/F, but Thursday marked its single most-trafficked day ever without any media coverage or even any links from a bigger site like Instapundit.\nAnd speaking of Instapundit, look at the way more and more people have no tolerance for the pinkshirts. The mere polite mention of receiving a Scalzi book in the mail was enough to provoke anger; the most liked comment was this one from David in Virginia:\n“Not one penny to Scalzi from me. You can pump his stuff till hell\nfreezes over, Professor, and he still won’t get one red cent from me.”\nI’m not addressing the Dread Ilk here. You guys have been PHENOMENAL. I can’t even thank you when you get my back from time to time because you guys always there. You’ve made Castalia House, which originally was just supposed to be a way of getting my books out there after Marcher Lord was bought, a going concern in which my books are practically a minor afterthought, so much so that successful, mainstream-published authors have been contacting us to discuss the possibility of working with us. I may not be the sort to need emotional support, (as Jonah Goldberg once said, I feed on the Dark Side of the Force) but it’s good to know that it is there nevertheless.\nNo, I’m addressing the Grays, the fence-sitters, the people who are hoping against hope that this will pass them by and the situation will magically improve. It won’t, so long as you and others like you are afraid. But I’m telling you, as someone who has been targeted unmercilessly by everyone from CAIR to the SFWA, there is no reason for fear. Standing up to them won’t kill you and it will make you stronger, more confident, and more capable. You’ll lose battles, sure, but you will win the war.\nSo get off the fence. Choose your side. Do something. Support the Blues. Stand with them instead of distancing yourself from them as if it will save you. (It won’t.) Attack the pinkshirts at their various points of weakness. Here is my pledge to you. If you do something, whether it is starting a game journo site, developing a card game, making a VASSAL module, reviewing books, or launching an email campaign against SyFy, I will support it somehow. Maybe via a personal endorsement (or a timely critique, if that would be more helpful), maybe a blog post, most often just a tweet. I simply can’t do much more than I’m already doing; as it stands, I’m already up until close to dawn working on my various game, book, and technology projects. But I can, and will, support you in yours.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-25T09:55:00+00:00"
}