{
  "url": "https://voxday.net/2014/10/14/crushing-tes/",
  "scraped_at": "2025-12-16T12:31:03.014022",
  "title": "Crushing the test?",
  "date_display": "October 14, 2014",
  "date_iso": "2014-10-14T06:47:00+00:00",
  "date_from_url": "2014-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do you remember when McRapey was bragging about how he crushed standardized tests? The guy didn’t even <a href=\"https://twitter.com/scalzi/status/521847303758708736\">break 700</a> on the SAT’s Math section:</p><blockquote class=\"tr_bq\"><p> Seriously, I took three years of post-algebra math in high school and got 690 math SAT score and yet still REMEMBER NOTHING.</p></blockquote><p>Now, 690 is a very good score. It’s a great score. If his verbal score was similar, he would have just been able to squeak into Mensa. Of course, since the great self-inflator never talks about that, we can probably assume that his overall score was 1330 or below, which would indicate a verbal score of around 640 and an IQ between 130 and 134. That would make him a high midwit, which is exactly what one observes of his behavior.</p><p>In any event, Johnny would like everyone to know that it’s not absolutely necessary to tell him that you’re no longer interested in buying the work of a chubby chinless SJW. Because <a href=\"https://twitter.com/scalzi/status/521857210163658752\">he totes doesn’t care</a>.</p><blockquote class=\"tr_bq\"><p> Dudes, if you’ve decided that you’re never going to buy my work again,<br> you don’t HAVE to tell me. I don’t actually care. Just don’t buy it.</br></p></blockquote><p>After all, he doesn’t need you, not when he’s got Tor to do the bulk-buying for him. And isn’t it remarkable how he cares about nothing? It’s like the man is a stone. A stone made out of Zen. Anyhow, I’m not buying his work today, just like every other day prior.</p></div>",
  "content_text": "Do you remember when McRapey was bragging about how he crushed standardized tests? The guy didn’t even\nbreak 700\non the SAT’s Math section:\nSeriously, I took three years of post-algebra math in high school and got 690 math SAT score and yet still REMEMBER NOTHING.\nNow, 690 is a very good score. It’s a great score. If his verbal score was similar, he would have just been able to squeak into Mensa. Of course, since the great self-inflator never talks about that, we can probably assume that his overall score was 1330 or below, which would indicate a verbal score of around 640 and an IQ between 130 and 134. That would make him a high midwit, which is exactly what one observes of his behavior.\nIn any event, Johnny would like everyone to know that it’s not absolutely necessary to tell him that you’re no longer interested in buying the work of a chubby chinless SJW. Because\nhe totes doesn’t care\n.\nDudes, if you’ve decided that you’re never going to buy my work again,\nyou don’t HAVE to tell me. I don’t actually care. Just don’t buy it.\nAfter all, he doesn’t need you, not when he’s got Tor to do the bulk-buying for him. And isn’t it remarkable how he cares about nothing? It’s like the man is a stone. A stone made out of Zen. Anyhow, I’m not buying his work today, just like every other day prior.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-14T05:47:00+00:00"
}