{
  "url": "https://voxday.net/2014/10/28/disclose-and-disqualify/",
  "scraped_at": "2025-12-16T12:32:45.170430",
  "title": "Disclose and DISQUALIFY",
  "date_display": "October 28, 2014",
  "date_iso": "2014-10-28T17:14:00+00:00",
  "date_from_url": "2014-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>runsonmagic <a href=\"http://www.returnofkings.com/45789/people-oppose-anonymity-because-they-cant-think-for-themselves?utm_source=dlvr.it&amp;utm_medium=twitter\">explains the reason</a> behind the growing pressure to eliminate online anonymity:</p><blockquote class=\"tr_bq\"><p> Anonymity forces you to evaluate a writer only on their work, which is precisely why so many oppose it. The people against online anonymity are intellectually lazy. They want to be able to tell what they think of an idea based on who is telling them to think that way. They want to nod when a minority, “alpha male,” or person who looks like them tells them something. Knowing an author only by their words forces readers to think abstractly, to think for themselves, and they hate it.</p><p>Social justice warriors and feminists hate anonymity because they do not believe in objective truth. They believe it matters more who makes a certain statement than what is being said. The same words that are okay for a black lesbian to say, might be offensive if a white heterosexual male says them. This is precisely why social justice warriors hate Anne Gus and #notyoursheild….</p><p>The real reason many social justice warriors are against anonymity is<br> because it prevents them from harassing writers and getting them fired<br> from jobs. It prevents tech companies from collecting accurate data on<br> public forums. Even in the manosphere, anonymity prevents internet<br> marketers from slandering their competition by claiming they are “not a<br> real alpha male” without photographic evidence. Like most things, the<br> push against online anonymity comes back to money and power.</br></br></br></br></br></br></p></blockquote><p>I can’t tell you how many times pinkshirts and other lefties have tried to out me. They assume that simply because one has a pen name, they must be trying to hide something. (Never mind that all it did was demonstrate their insufficient level of intelligence and classical education.) In fact, their deliberate choice of addressing me by my given name is always a dead giveaway that they are an ideological enemy.</p><p>The whole point of forcing disclosure is to DISQUALIFY, which is the only form of argument that the sub-intellects of the Left are ever capable of making. Which, of course, is why it is pointless to even attempt to engage in rational dialectic with them. Relentless scorn and dismissive rhetoric is the most reliable means of routing them, but it is a tactic that requires confidence and a combative nature.</p><p>But anonymity is an absolute necessity for every non-combatant who dares to stand in the way of the pinkshirts, which of course is why they are desperate to eliminate it in the belief that everyone will cower obediently before them once they are stripped naked and forced to choose between submission and being unable to make a living. They don’t realize that there are millions who will embrace the ISIS model before submitting to them. Their triumphalism is not merely foolish, it is insanely suicidal.</p><p>Look at how panicky they sound when a few advertisers simply withdraw advertising and show their vulnerability. And then imagine if we were truly the monsters they claim us to be. My strong suspicion is that they have limited imaginations and are simply incapable of realizing that the status quo is not built upon a foundation of stone, history does not progress inevitably in one direction, and civilization is considerably more fragile than they understand.</p></div>",
  "content_text": "runsonmagic\nexplains the reason\nbehind the growing pressure to eliminate online anonymity:\nAnonymity forces you to evaluate a writer only on their work, which is precisely why so many oppose it. The people against online anonymity are intellectually lazy. They want to be able to tell what they think of an idea based on who is telling them to think that way. They want to nod when a minority, “alpha male,” or person who looks like them tells them something. Knowing an author only by their words forces readers to think abstractly, to think for themselves, and they hate it.\nSocial justice warriors and feminists hate anonymity because they do not believe in objective truth. They believe it matters more who makes a certain statement than what is being said. The same words that are okay for a black lesbian to say, might be offensive if a white heterosexual male says them. This is precisely why social justice warriors hate Anne Gus and #notyoursheild….\nThe real reason many social justice warriors are against anonymity is\nbecause it prevents them from harassing writers and getting them fired\nfrom jobs. It prevents tech companies from collecting accurate data on\npublic forums. Even in the manosphere, anonymity prevents internet\nmarketers from slandering their competition by claiming they are “not a\nreal alpha male” without photographic evidence. Like most things, the\npush against online anonymity comes back to money and power.\nI can’t tell you how many times pinkshirts and other lefties have tried to out me. They assume that simply because one has a pen name, they must be trying to hide something. (Never mind that all it did was demonstrate their insufficient level of intelligence and classical education.) In fact, their deliberate choice of addressing me by my given name is always a dead giveaway that they are an ideological enemy.\nThe whole point of forcing disclosure is to DISQUALIFY, which is the only form of argument that the sub-intellects of the Left are ever capable of making. Which, of course, is why it is pointless to even attempt to engage in rational dialectic with them. Relentless scorn and dismissive rhetoric is the most reliable means of routing them, but it is a tactic that requires confidence and a combative nature.\nBut anonymity is an absolute necessity for every non-combatant who dares to stand in the way of the pinkshirts, which of course is why they are desperate to eliminate it in the belief that everyone will cower obediently before them once they are stripped naked and forced to choose between submission and being unable to make a living. They don’t realize that there are millions who will embrace the ISIS model before submitting to them. Their triumphalism is not merely foolish, it is insanely suicidal.\nLook at how panicky they sound when a few advertisers simply withdraw advertising and show their vulnerability. And then imagine if we were truly the monsters they claim us to be. My strong suspicion is that they have limited imaginations and are simply incapable of realizing that the status quo is not built upon a foundation of stone, history does not progress inevitably in one direction, and civilization is considerably more fragile than they understand.",
  "tags": [
    "corpocracy",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-28T17:14:00+00:00"
}