{
  "url": "https://voxday.net/2014/10/23/dishonest-pinkshirt-doubles-down/",
  "scraped_at": "2025-12-16T12:32:04.938778",
  "title": "Dishonest pinkshirt doubles down",
  "date_display": "October 23, 2014",
  "date_iso": "2014-10-23T08:40:00+00:00",
  "date_from_url": "2014-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gawker’s Max Read makes it clear that #GamerGate is winning in writing what may have been <a href=\"http://gawker.com/how-we-got-rolled-by-the-dishonest-fascists-of-gamergat-1649496579\">the dumbest, most self-destructive opinion piece</a> ever written:</p><blockquote class=\"tr_bq\"><p> On October 1, the computing giant Intel pulled its ads from Gamasutra, a trade website for game developers, over an essay called “‘Gamers’ don’t have to be your audience. ‘Gamers’ are over” by a journalist named Leigh Alexander. Intel had been successfully harassed by a small, contemptible crusade called “Gamergate”—a campaign of dedicated anti-feminist internet trolls using an ill-informed mob of alienated and resentful video game-playing teenagers and young men to harass and intimidate female activists, journalists, and critics.</p><p>Unable to run Alexander out of game writing, as they had with the writer Jenn Frank, or force her from her home, as they did to the developer Brianna Wu, or threaten her from public engagements, as they did the following week to the critic and activist Anita Sarkeesian, Gamergate went after her publisher. And, in an unbelievable and embarrassing act of ignorance and cowardice, Intel capitulated. The company’s laughable “apology,” released late on that Friday afternoon, didn’t cover up the fact of Gamergate’s victory: Intel was not replacing its ads.</p><p>Failing to adequately cover this act of spinelessness was the first big fuck-up we at Gawker committed. Intel surrendered to the worst kind of dishonesty, and we allowed it to do so without ever calling it out. So let’s say it now: Intel is run by craven idiots. It employs pusillanimous morons. It lacks integrity. It folded to misogynists and bigots who objected to a woman who had done nothing more than write a piece claiming a place in the world of video games. And even when confronted with its own thoughtlessness and irresponsibility, it could not properly right its wrongs.</p><p>Last week, a Gawker writer tweeted “bring back bullying.” He, and later I, made the tactical mistake of publicly treating Gamergate with the contempt and flippancy that it deserves. As a consequence, our advertisers were quickly inundated with the same kinds of emails that spooked Intel. Gamergaters were passing around a sample letter and list of advertiser contacts to coordinate the campaign; the Washington Post’s Caitlin Dewey wrote an excellent breakdown of the efficient mechanism by which the relatively small group of Gamergaters was able to make itself immediately annoying to advertisers:</p><p><i>    Step 4: Plug all of your choices into one of the many form e-mails that leaders of Disrespectful Nod have helpfully written already. […]</i></p><p>    Step 5: Keep it up, even when you get no response, and be — to quote the operation’s guide! — “an annoying little s—.” A representative for a high-profile communications company that advertises on Polygon confirmed that he’d received “dozens” of e-mails from Gamergate supporters over a period of several weeks.</p><p>    Operation Disrespectful Nod also encourages Gamergaters to reach out to the bosses and managers of journalists who have written “negative” stories, demanding the reporter in question be fired or asked to resign. Topping their most-wanted list, at present, is Gawker Media’s Biddle, who tweeted a string of jokes about Gamergate on Thursday. In context, at least, the jokes were an obvious — if tongue-in-cheek — commentary on the movement’s well-documented, often hateful, idiocy. Critics construed them as an endorsement for bullying. (Biddle later apologized for the tweets.)</p><p>Transparent and documented though it was, the obsessive campaign worked. Mercedes-Benz—listed on the site as a former partner, and therefore a target—briefly paused its ads on a network that serves ads to Gawker. I’ve been told that we’ve lost thousands of dollars already, and could potentially lose thousands more, if not millions. Consequently, the editorial director of Gawker Media, Joel Johnson, took to the front page of Gawker to clarify that Sam Biddle does not want to bully anyone, and that Gawker Media as a company and institution is not pro-bullying. (Let’s note here that the admitted goal of our Gamergate trolls is not to eke an apology out of Sam, or the company, but to literally put us out of business entirely.)</p><p>If this seems bizarre to you, you’re not alone. I feel like I went to sleep in the regular world and woke up in an insane new one where “bullying” is something that it’s possible to be seriously and sincerely “for.” Yesterday, Adobe wrote to one Gamergater on Twitter that it had asked Gawker to remove its logo from the advertising site because it did not support bullying; a few confused hours later, Adobe was forced to clarify to the world:</p><p>    We are vehemently opposed to bullying of any kind and would never support any group that bullies.<br>     — Adobe (@Adobe) October 22, 2014</br></p><p>Brands like Adobe and Intel, willing to distance themselves from independent publishers over the spurious claims of a limited but dedicated group of misogynists and trolls, share an important core value with Gamergate: Misogyny. Kidding! Kidding. The value that defines both Gamergate and brand response is cynicism. A brand that honestly believes it needs to clarify that it is “vehemently opposed to bullying of any kind”—as though there are or have ever been genuine corporate supporters of bullying, and as though anyone was ever in danger of thinking the makers of Photoshop might be among their number—passes on to its adult customers the same corroding cynicism that the opportunistic reactionaries running Gamergate imbue in their maladjusted teenage followers. Releasing into the world a statement as vacuous as Adobe’s tweet, or as inane as Intel’s “apology,” demonstrates not that those brands stand against something (how else can anyone possibly feel about bullying?) but that they stand for nothing.</p><p>Maybe that’s too much to expect from a brand. But it seems like the bare minimum to expect from ourselves. Gawker is rarely perfect, but it strives to be honest and fearless. For us to have apologized for a joke—to have even clarified—in the face of such breathtaking cynicism and dishonesty, from both “ad partners” and the enemies who leverage those brands’ fearfulness to silence opposing voices, feels like an utter abdication of those responsibilities. Frankly, that sucks. If anyone is owed an apology, it’s our readers. So: Sorry.</p></blockquote><p>I’ll be very surprised if Gawker Media keeps this lunatic loose cannon around much longer. Despite all his lies, misrepresentations, and ad hominem attacks, the piece is very interesting for what it admits.</p><ol><li>GamerGate is clearly winning. Advertisers correctly understand that GamerGate is a broad-spectrum movement of gamers who do not trust the games media and oppose the interference of the SJWs attempting to, in LW1’s words, “make gaming more diverse and inclusive.” Intel’s reaction is particularly important because they are much more keenly attuned to the gaming market than most big corporations, because they depend upon it more heavily than most people realize. I worked closely with them on the release of their MMX chips in 1996 and 1997 – I was one of 12 CEOs (and with Ubisoft and Epic, one of three game dev CEOs) brought in to spend a day consulting with Andy Grove concerning Intel’s marketing of the MMX prior to its release – and they will never, ever blow off gamers. And they also understand that the games media is not to be confused with the gaming community itself.</li><li>Neither Biddle nor Read feel any remorse for their actions. They are only sorry that they PUBLICLY treated “Gamergate with the contempt and flippancy that it deserves”. They have learned nothing.</li><li>GamerGate’s is correctly focused on the media’s Achilles Heel, its advertisers. The games media is so foolish and arrogant that they don’t care what their readers think, but they do care greatly about their advertisers. That is their corporate lifesblood, and that is the place that GamerGate should continue to target its efforts.</li><li>The pinkshirts still don’t understand that the numbers are not on their side. They don’t grasp that the fact that all the media organizations are on their side means nothing concerning the actual numbers of gamers who support one side or the other. Most gamers support GamerGate, to the extent they lean one way or another (they are mostly uninterested in the whole thing) the developers oppose any interference with how they design and develop their games, and the people responsible for selling products into both communities understand this.</li><li>The “bullying” is simply a proxy. It could have been anything, but that happens to be the hammer that the anti-Gamergaters handed GamerGate, and so it is the hammer with which GamerGate is going to repeatedly hit them. The real issue is that the gaming media is now not only attacking its readers, it is attacking its advertisers as well.</li><li>Max Read is very, very stupid. <i>“So let’s say it now: Intel is run by craven idiots. It employs pusillanimous morons. It lacks integrity.” </i>I suspect he’s going to bitterly regret those words soon, if he doesn’t already. If Gawker doesn’t fire him and Biddle, and promptly kowtow before GamerGate and announce its love of games, gamers, and game developers who do whatever they want to do, they’re going to see their advertising revenue continue to decline.</li><li>Max Read is projecting. The only “dishonest fascists” here are the pinkshirts opposed to GamerGate.</li><li>In case it isn’t clear yet, GamerGate will never quit. Because making the games we want to make and playing the games that we want to play is part of who we are.</li><li>The pinkshirts don’t give even the smallest damn about “death threats” or “harassment. I’ve been getting angry emails and death threats from the Left for 13 years now and no one pretending to be so terribly concerned about the “death threats” aimed at LW1, LW2 or LWu has ever said one single word to denounce them. Here are just two examples from this year that were posted in public:</li></ol><blockquote class=\"tr_bq\"><p> <i>In better days, people were easily thrown out of the city and the gates were locked behind them, let them starve. We need a system like that today, people like Vox Day need to die on the vine. Anyone who holds such opinions should not be allowed in society, it doesn’t matter what the quality of their “art” is. I’m sure that there were many people who thought Hitler was a good painter.</i> – Blackadder Apr 23, 2014 at 9:38 pm</p><p><i>Oh dear sweet Cthulu, I think a little part of my soul just died…  Frankly, Vox is a great big steaming pile of human garbage. He’s an absolute piece of shit. This isn’t his first set of fuckery in the SFF community, either. He ran for President of the Science Fiction and Fantasy Writers of America, and part of his platform was that he’d ban all women from writing any hard sci-fi or fantasy and only allow them to write paranormal romance (I believe wereseals were specified as the only thing women should be allowed to write about. The fucking jackass doesn’t even know they’re called selkies, but that’s irrelevant). That’s the sort of shit this guy is…. Seriously, vox is an absolute piece of shit. I want him to die a slow and agonising death. </i>– LJP · April 25, 2014</p></blockquote><p>And speaking of pinkshirts doubling down, here is John Scalzi:</p><blockquote class=\"tr_bq\"><p> “If you’re still pro-GamerGate at this point, you’re a shitty human, or a shitty human’s useful idiot.” – John Scalzi</p></blockquote><p>I tweeted that to @torbooks. Because while Mr. Scalzi has repeatedly announced that he doesn’t care who reads his books and as well as his hatred for GamerGate, it is possible that Tor Books, which sells considerably more HALO and other game tie-in books than it sells John Scalzi books, may feel differently.</p><p>I have written to Joel Johnson, the editorial director at Gawker Media, asking him to request Max Read’s resignation due to Mr. Read’s open disregard for the gaming community and one of its leading corporate supporters. If you wish to do likewise, Mr. Johnson’s contact information is available <a href=\"http://joeljohnson.com/\">at his personal site</a>.</p><p>UPDATE: Nero has a piece on the same Max Read article <a href=\"http://www.breitbart.com/Breitbart-London/2014/10/23/Gawker-dishonest-fascists-of-GamerGate-could-cost-us-millions\">up on Breitbart</a>.</p><blockquote class=\"tr_bq\"><p> The irony of Gawker’s career-destroying, far-left authoritarians squealing about fascism and bullying will not be lost on observers. “I’ve been told that we’ve lost thousands of dollars already, and could potentially lose thousands more, if not millions,” wrote Gawker’s Read last night.</p></blockquote><p>UPDATE 2: On a related note, here is the posted <a href=\"http://www.reddit.com/r/KotakuInAction/comments/2ji8ji/the_full_list_of_gawkers_advertisers_as_well_as/\">list of Gawker’s advertisers</a>, with contact information.</p><ol></ol></div>",
  "content_text": "Gawker’s Max Read makes it clear that #GamerGate is winning in writing what may have been\nthe dumbest, most self-destructive opinion piece\never written:\nOn October 1, the computing giant Intel pulled its ads from Gamasutra, a trade website for game developers, over an essay called “‘Gamers’ don’t have to be your audience. ‘Gamers’ are over” by a journalist named Leigh Alexander. Intel had been successfully harassed by a small, contemptible crusade called “Gamergate”—a campaign of dedicated anti-feminist internet trolls using an ill-informed mob of alienated and resentful video game-playing teenagers and young men to harass and intimidate female activists, journalists, and critics.\nUnable to run Alexander out of game writing, as they had with the writer Jenn Frank, or force her from her home, as they did to the developer Brianna Wu, or threaten her from public engagements, as they did the following week to the critic and activist Anita Sarkeesian, Gamergate went after her publisher. And, in an unbelievable and embarrassing act of ignorance and cowardice, Intel capitulated. The company’s laughable “apology,” released late on that Friday afternoon, didn’t cover up the fact of Gamergate’s victory: Intel was not replacing its ads.\nFailing to adequately cover this act of spinelessness was the first big fuck-up we at Gawker committed. Intel surrendered to the worst kind of dishonesty, and we allowed it to do so without ever calling it out. So let’s say it now: Intel is run by craven idiots. It employs pusillanimous morons. It lacks integrity. It folded to misogynists and bigots who objected to a woman who had done nothing more than write a piece claiming a place in the world of video games. And even when confronted with its own thoughtlessness and irresponsibility, it could not properly right its wrongs.\nLast week, a Gawker writer tweeted “bring back bullying.” He, and later I, made the tactical mistake of publicly treating Gamergate with the contempt and flippancy that it deserves. As a consequence, our advertisers were quickly inundated with the same kinds of emails that spooked Intel. Gamergaters were passing around a sample letter and list of advertiser contacts to coordinate the campaign; the Washington Post’s Caitlin Dewey wrote an excellent breakdown of the efficient mechanism by which the relatively small group of Gamergaters was able to make itself immediately annoying to advertisers:\nStep 4: Plug all of your choices into one of the many form e-mails that leaders of Disrespectful Nod have helpfully written already. […]\nStep 5: Keep it up, even when you get no response, and be — to quote the operation’s guide! — “an annoying little s—.” A representative for a high-profile communications company that advertises on Polygon confirmed that he’d received “dozens” of e-mails from Gamergate supporters over a period of several weeks.\nOperation Disrespectful Nod also encourages Gamergaters to reach out to the bosses and managers of journalists who have written “negative” stories, demanding the reporter in question be fired or asked to resign. Topping their most-wanted list, at present, is Gawker Media’s Biddle, who tweeted a string of jokes about Gamergate on Thursday. In context, at least, the jokes were an obvious — if tongue-in-cheek — commentary on the movement’s well-documented, often hateful, idiocy. Critics construed them as an endorsement for bullying. (Biddle later apologized for the tweets.)\nTransparent and documented though it was, the obsessive campaign worked. Mercedes-Benz—listed on the site as a former partner, and therefore a target—briefly paused its ads on a network that serves ads to Gawker. I’ve been told that we’ve lost thousands of dollars already, and could potentially lose thousands more, if not millions. Consequently, the editorial director of Gawker Media, Joel Johnson, took to the front page of Gawker to clarify that Sam Biddle does not want to bully anyone, and that Gawker Media as a company and institution is not pro-bullying. (Let’s note here that the admitted goal of our Gamergate trolls is not to eke an apology out of Sam, or the company, but to literally put us out of business entirely.)\nIf this seems bizarre to you, you’re not alone. I feel like I went to sleep in the regular world and woke up in an insane new one where “bullying” is something that it’s possible to be seriously and sincerely “for.” Yesterday, Adobe wrote to one Gamergater on Twitter that it had asked Gawker to remove its logo from the advertising site because it did not support bullying; a few confused hours later, Adobe was forced to clarify to the world:\nWe are vehemently opposed to bullying of any kind and would never support any group that bullies.\n— Adobe (@Adobe) October 22, 2014\nBrands like Adobe and Intel, willing to distance themselves from independent publishers over the spurious claims of a limited but dedicated group of misogynists and trolls, share an important core value with Gamergate: Misogyny. Kidding! Kidding. The value that defines both Gamergate and brand response is cynicism. A brand that honestly believes it needs to clarify that it is “vehemently opposed to bullying of any kind”—as though there are or have ever been genuine corporate supporters of bullying, and as though anyone was ever in danger of thinking the makers of Photoshop might be among their number—passes on to its adult customers the same corroding cynicism that the opportunistic reactionaries running Gamergate imbue in their maladjusted teenage followers. Releasing into the world a statement as vacuous as Adobe’s tweet, or as inane as Intel’s “apology,” demonstrates not that those brands stand against something (how else can anyone possibly feel about bullying?) but that they stand for nothing.\nMaybe that’s too much to expect from a brand. But it seems like the bare minimum to expect from ourselves. Gawker is rarely perfect, but it strives to be honest and fearless. For us to have apologized for a joke—to have even clarified—in the face of such breathtaking cynicism and dishonesty, from both “ad partners” and the enemies who leverage those brands’ fearfulness to silence opposing voices, feels like an utter abdication of those responsibilities. Frankly, that sucks. If anyone is owed an apology, it’s our readers. So: Sorry.\nI’ll be very surprised if Gawker Media keeps this lunatic loose cannon around much longer. Despite all his lies, misrepresentations, and ad hominem attacks, the piece is very interesting for what it admits.\nGamerGate is clearly winning. Advertisers correctly understand that GamerGate is a broad-spectrum movement of gamers who do not trust the games media and oppose the interference of the SJWs attempting to, in LW1’s words, “make gaming more diverse and inclusive.” Intel’s reaction is particularly important because they are much more keenly attuned to the gaming market than most big corporations, because they depend upon it more heavily than most people realize. I worked closely with them on the release of their MMX chips in 1996 and 1997 – I was one of 12 CEOs (and with Ubisoft and Epic, one of three game dev CEOs) brought in to spend a day consulting with Andy Grove concerning Intel’s marketing of the MMX prior to its release – and they will never, ever blow off gamers. And they also understand that the games media is not to be confused with the gaming community itself.\nNeither Biddle nor Read feel any remorse for their actions. They are only sorry that they PUBLICLY treated “Gamergate with the contempt and flippancy that it deserves”. They have learned nothing.\nGamerGate’s is correctly focused on the media’s Achilles Heel, its advertisers. The games media is so foolish and arrogant that they don’t care what their readers think, but they do care greatly about their advertisers. That is their corporate lifesblood, and that is the place that GamerGate should continue to target its efforts.\nThe pinkshirts still don’t understand that the numbers are not on their side. They don’t grasp that the fact that all the media organizations are on their side means nothing concerning the actual numbers of gamers who support one side or the other. Most gamers support GamerGate, to the extent they lean one way or another (they are mostly uninterested in the whole thing) the developers oppose any interference with how they design and develop their games, and the people responsible for selling products into both communities understand this.\nThe “bullying” is simply a proxy. It could have been anything, but that happens to be the hammer that the anti-Gamergaters handed GamerGate, and so it is the hammer with which GamerGate is going to repeatedly hit them. The real issue is that the gaming media is now not only attacking its readers, it is attacking its advertisers as well.\nMax Read is very, very stupid.\n“So let’s say it now: Intel is run by craven idiots. It employs pusillanimous morons. It lacks integrity.”\nI suspect he’s going to bitterly regret those words soon, if he doesn’t already. If Gawker doesn’t fire him and Biddle, and promptly kowtow before GamerGate and announce its love of games, gamers, and game developers who do whatever they want to do, they’re going to see their advertising revenue continue to decline.\nMax Read is projecting. The only “dishonest fascists” here are the pinkshirts opposed to GamerGate.\nIn case it isn’t clear yet, GamerGate will never quit. Because making the games we want to make and playing the games that we want to play is part of who we are.\nThe pinkshirts don’t give even the smallest damn about “death threats” or “harassment. I’ve been getting angry emails and death threats from the Left for 13 years now and no one pretending to be so terribly concerned about the “death threats” aimed at LW1, LW2 or LWu has ever said one single word to denounce them. Here are just two examples from this year that were posted in public:\nIn better days, people were easily thrown out of the city and the gates were locked behind them, let them starve. We need a system like that today, people like Vox Day need to die on the vine. Anyone who holds such opinions should not be allowed in society, it doesn’t matter what the quality of their “art” is. I’m sure that there were many people who thought Hitler was a good painter.\n– Blackadder Apr 23, 2014 at 9:38 pm\nOh dear sweet Cthulu, I think a little part of my soul just died…  Frankly, Vox is a great big steaming pile of human garbage. He’s an absolute piece of shit. This isn’t his first set of fuckery in the SFF community, either. He ran for President of the Science Fiction and Fantasy Writers of America, and part of his platform was that he’d ban all women from writing any hard sci-fi or fantasy and only allow them to write paranormal romance (I believe wereseals were specified as the only thing women should be allowed to write about. The fucking jackass doesn’t even know they’re called selkies, but that’s irrelevant). That’s the sort of shit this guy is…. Seriously, vox is an absolute piece of shit. I want him to die a slow and agonising death.\n– LJP · April 25, 2014\nAnd speaking of pinkshirts doubling down, here is John Scalzi:\n“If you’re still pro-GamerGate at this point, you’re a shitty human, or a shitty human’s useful idiot.” – John Scalzi\nI tweeted that to @torbooks. Because while Mr. Scalzi has repeatedly announced that he doesn’t care who reads his books and as well as his hatred for GamerGate, it is possible that Tor Books, which sells considerably more HALO and other game tie-in books than it sells John Scalzi books, may feel differently.\nI have written to Joel Johnson, the editorial director at Gawker Media, asking him to request Max Read’s resignation due to Mr. Read’s open disregard for the gaming community and one of its leading corporate supporters. If you wish to do likewise, Mr. Johnson’s contact information is available\nat his personal site\n.\nUPDATE: Nero has a piece on the same Max Read article\nup on Breitbart\n.\nThe irony of Gawker’s career-destroying, far-left authoritarians squealing about fascism and bullying will not be lost on observers. “I’ve been told that we’ve lost thousands of dollars already, and could potentially lose thousands more, if not millions,” wrote Gawker’s Read last night.\nUPDATE 2: On a related note, here is the posted\nlist of Gawker’s advertisers\n, with contact information.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-23T07:40:00+00:00"
}