{
  "url": "https://voxday.net/2014/10/09/disqualify-is-not-discourse/",
  "scraped_at": "2025-12-16T12:30:31.875402",
  "title": "DISQUALIFY! is not discourse",
  "date_display": "October 9, 2014",
  "date_iso": "2014-10-09T20:00:00+00:00",
  "date_from_url": "2014-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m adding a new reason for insta-spamming, as this shameless and ill-informed attempt to disqualify the military expert and Castalia House author William S. Lind should suffice to demonstrate:</p><blockquote class=\"tr_bq\"><p> DISQUALIFART: <i>I think I’ll take my advice on military affairs from someone slightly less fucked up in the head.</i></p><p>VD: The more fool you. Lind is highly respected by Marines with extensive combat experience from lieutenants to Commandants.</p><p>DISQUALIFART: <i>Spend much time among Marines, do you? Let’s be honest. The chances that a marine knows who this lunatic is, is somewhere next to zero. Tell them what he believes (“We ought to have a king in America and darn it those blacks would be better off as slaves) and you’ll get a really sense of what marines think of such a Cau Cau. </i></p><p>VD: I have spoken to two former members of the Joint Chiefs of Staff in the last week alone who are not only personally familiar with Mr. Lind, who was lecturing at Quantico this weekend, but think very well of him. The co-author of one of Mr. Lind’s forthcoming books is an active-duty LtCol in the USMC. You know literally nothing about this subject.</p><p>STILICHO: Yep, and I are one too!  Lind has been well known and respected in the<br> Corps for decades.  I certainly knew of him in the late 80’s and I<br> understand he was a regular lecturer/consultant at Quantico well before<br> that.  Al Gray was well known as an admirer of Lind’s theoretical work.</br></br></br></p></blockquote><p>Al Gray, of course, being the former Commandant of the Marine Corps. In addition to being the foremost among the fathers of 4th Generation Warfare, Mr. Lind is also the author of the <i>Maneuver Warfare Handbook</i>, which formalizes and explicates John Boyd’s theory that has been incorporated into formal USMC and British Army warfighting doctrine.</p><p>But none of that matters to a left-liberal troll who is hellbent on DISQUALIFY despite not only being in complete ignorance of the relevant facts, but continuing to attempt to do so after being warned of his ignorance.</p><p>No discourse is possible with people this ignorant and shameless. From now on, any attempt to DISQUALIFY is going to be met with instant spamming. There is absolutely nothing wrong with disagreeing. There is absolutely nothing wrong with criticizing. There is absolutely nothing wrong with attempting to demonstrate why your position is superior to another one.</p><p>But DISQUALIFY is the singular tactic of the stupid and the shameless. It is what they reliably resort to because they cannot successfully make a rational case for their own positions or construct a rational critique of the positions presented by others. This is no place for them and I have no intention of suffering such fools in any way at all.</p></div>",
  "content_text": "I’m adding a new reason for insta-spamming, as this shameless and ill-informed attempt to disqualify the military expert and Castalia House author William S. Lind should suffice to demonstrate:\nDISQUALIFART:\nI think I’ll take my advice on military affairs from someone slightly less fucked up in the head.\nVD: The more fool you. Lind is highly respected by Marines with extensive combat experience from lieutenants to Commandants.\nDISQUALIFART:\nSpend much time among Marines, do you? Let’s be honest. The chances that a marine knows who this lunatic is, is somewhere next to zero. Tell them what he believes (“We ought to have a king in America and darn it those blacks would be better off as slaves) and you’ll get a really sense of what marines think of such a Cau Cau.\nVD: I have spoken to two former members of the Joint Chiefs of Staff in the last week alone who are not only personally familiar with Mr. Lind, who was lecturing at Quantico this weekend, but think very well of him. The co-author of one of Mr. Lind’s forthcoming books is an active-duty LtCol in the USMC. You know literally nothing about this subject.\nSTILICHO: Yep, and I are one too!  Lind has been well known and respected in the\nCorps for decades.  I certainly knew of him in the late 80’s and I\nunderstand he was a regular lecturer/consultant at Quantico well before\nthat.  Al Gray was well known as an admirer of Lind’s theoretical work.\nAl Gray, of course, being the former Commandant of the Marine Corps. In addition to being the foremost among the fathers of 4th Generation Warfare, Mr. Lind is also the author of the\nManeuver Warfare Handbook\n, which formalizes and explicates John Boyd’s theory that has been incorporated into formal USMC and British Army warfighting doctrine.\nBut none of that matters to a left-liberal troll who is hellbent on DISQUALIFY despite not only being in complete ignorance of the relevant facts, but continuing to attempt to do so after being warned of his ignorance.\nNo discourse is possible with people this ignorant and shameless. From now on, any attempt to DISQUALIFY is going to be met with instant spamming. There is absolutely nothing wrong with disagreeing. There is absolutely nothing wrong with criticizing. There is absolutely nothing wrong with attempting to demonstrate why your position is superior to another one.\nBut DISQUALIFY is the singular tactic of the stupid and the shameless. It is what they reliably resort to because they cannot successfully make a rational case for their own positions or construct a rational critique of the positions presented by others. This is no place for them and I have no intention of suffering such fools in any way at all.",
  "tags": [
    "debate",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-09T19:00:00+00:00"
}