{
  "url": "https://voxday.net/2014/10/30/fifth-frontier-war-prelude/",
  "scraped_at": "2025-12-16T12:33:06.302071",
  "title": "Fifth Frontier War prelude",
  "date_display": "October 30, 2014",
  "date_iso": "2014-10-30T21:19:00+00:00",
  "date_from_url": "2014-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ender is finally satisfied with his modifications to my VASSAL module so we commenced with the setup and are ready to begin. I’m the Imperium, in red, and Ender is the Zhodani, in blue. Ender was openly contemptuous of my setup, but his confidence was a little shaken after my observation concerning the way in which my ASL style has more than a little in common with the approach recommended by the <i>Maneuver Warfare Handbook</i>, namely these two points from Chapter One:</p><div style=\"line-height: 100%; margin-bottom: 0.08in;\"><div style=\"line-height: 100%; margin-bottom: 0.08in;\"> Maneuver<br> warfare means you will not only accept confusion and disorder and<br> operate successfully within it, through decentralization, you will<br> also generate confusion and disorder. The “reconnaissance pull”<br> (see Chapters II and III) tactics of the German Blitzkrieg were<br> inherently disorderly. Higher headquarters could neither direct nor<br> predict the exact path of the advance. But the multitude of German<br> reconnaissance thrusts generated massive confusion among the French<br> in 1940. Each was reported as a new attack. The Germans seemed to be<br> everywhere, and the French, whose system demanded certainty before<br> making any decisions, were paralyzed…..</br></br></br></br></br></br></br></br></br></br></div></div><div style=\"line-height: 100%; margin-bottom: 0.08in;\"><div style=\"line-height: 100%; margin-bottom: 0.08in;\"> Instead<br> of a checklist or a cookbook, maneuver warfare requires commanders<br> who can sense more than they can see, who understand the opponent’s<br> strengths and weaknesses and their own, and who can find the enemy’s<br> critical weaknesses in a specific situation (which is seldom easy).<br> They must be able to create multiple threats and keep the enemy<br> uncertain as to which is real. They must be able to see their options<br> in the situation before them, constantly create new options, and<br> shift rapidly among options as the situation develops.</br></br></br></br></br></br></br></br></div></div><p> Anyhow, this setup should definitely keep the enemy uncertain and cause an amount of confusion, because beyond setting up a doomed Schwerpunkt at Jewell and fortifying Regina, I don’t even have a plan. No matter what he guesses, he’ll be wrong!</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/10/FFW_01.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"448\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/10/FFW_01.jpg\" width=\"640\"/></a></div><p> However, unlike the generals firmly stuck in 2GW, Ender has an open mind. When I mentioned the similarity between my style and 3GW (he’s read ON WAR so he is up on the post-Westphalian generations), he commented: “Yeah, when you set up you just throw your counters all over the place and I have no idea what you’re even trying to do. Then they run around like their pants are on fire until you spot a problem and go after it. Maybe that’s why I’ve lost about the last 15 games.”</p><div style=\"line-height: 100%; margin-bottom: 0.08in;\"> This quote, in a nutshell, essentially summarizes my tactical perspective, in both wargames and life: <i>“The defense thus assumed a very aggressive and potentially offensive character.”</i></div></div>",
  "content_text": "Ender is finally satisfied with his modifications to my VASSAL module so we commenced with the setup and are ready to begin. I’m the Imperium, in red, and Ender is the Zhodani, in blue. Ender was openly contemptuous of my setup, but his confidence was a little shaken after my observation concerning the way in which my ASL style has more than a little in common with the approach recommended by the\nManeuver Warfare Handbook\n, namely these two points from Chapter One:\nManeuver\nwarfare means you will not only accept confusion and disorder and\noperate successfully within it, through decentralization, you will\nalso generate confusion and disorder. The “reconnaissance pull”\n(see Chapters II and III) tactics of the German Blitzkrieg were\ninherently disorderly. Higher headquarters could neither direct nor\npredict the exact path of the advance. But the multitude of German\nreconnaissance thrusts generated massive confusion among the French\nin 1940. Each was reported as a new attack. The Germans seemed to be\neverywhere, and the French, whose system demanded certainty before\nmaking any decisions, were paralyzed…..\nInstead\nof a checklist or a cookbook, maneuver warfare requires commanders\nwho can sense more than they can see, who understand the opponent’s\nstrengths and weaknesses and their own, and who can find the enemy’s\ncritical weaknesses in a specific situation (which is seldom easy).\nThey must be able to create multiple threats and keep the enemy\nuncertain as to which is real. They must be able to see their options\nin the situation before them, constantly create new options, and\nshift rapidly among options as the situation develops.\nAnyhow, this setup should definitely keep the enemy uncertain and cause an amount of confusion, because beyond setting up a doomed Schwerpunkt at Jewell and fortifying Regina, I don’t even have a plan. No matter what he guesses, he’ll be wrong!\nHowever, unlike the generals firmly stuck in 2GW, Ender has an open mind. When I mentioned the similarity between my style and 3GW (he’s read ON WAR so he is up on the post-Westphalian generations), he commented: “Yeah, when you set up you just throw your counters all over the place and I have no idea what you’re even trying to do. Then they run around like their pants are on fire until you spot a problem and go after it. Maybe that’s why I’ve lost about the last 15 games.”\nThis quote, in a nutshell, essentially summarizes my tactical perspective, in both wargames and life:\n“The defense thus assumed a very aggressive and potentially offensive character.”",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-30T21:19:00+00:00"
}