{
  "url": "https://voxday.net/2014/10/24/gamergate-open-letter/",
  "scraped_at": "2025-12-16T12:32:12.050923",
  "title": "#Gamergate: an open letter",
  "date_display": "October 24, 2014",
  "date_iso": "2014-10-24T09:52:00+00:00",
  "date_from_url": "2014-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joel Johnson<br> <a href=\"http://joeljohnson.com/\">Editorial Director</a><br> Gawker Media</br></br></p><p>Dear Mr. Johnson,</p><p>As a professional game reviewer, game developer, and game designer with 22 years of experience in the game industry who has worked<br> closely with Intel in the past, I would like to request that you<br> immediately ask Max Read to resign from Gawker Media for the blatant<br> disregard he has shown for the gaming community as well as one of<br> its most important corporate supporters. Mr. Read wrote:</br></br></br></br></p><ol><li>“So let’s say it now: Intel is run by craven idiots. It<br> employs pusillanimous morons. It lacks integrity.”</br></li><li>He dishonestly described GamerGate as “dishonest fascists” and<br> “an ill-informed mob of alienated and resentful video<br> game-playing teenagers and young men</br></br></li><li>“He, and later I, made the tactical mistake of<br> publicly treating Gamergate with the contempt and flippancy that<br> it deserves.”</br></br></li></ol><p>Mr. Johnson, GamerGate does not consist of fascists. It is not an<br> ill-informed mob. It is not limited to teenagers, to men, or to<br> white people. It does not deserve to be treated with contempt and<br> flippancy. GamerGate is a broad spectrum of the gaming community,<br> including players and developers, and consists of men and women of<br> all ages who wish nothing more than to simply continue to design,<br> develop, and play the games that we wish to design, develop, and<br> play without being attacked by professional political activists,<br> corrupt game journalists, and publicity-seeking independent game<br> developers.</br></br></br></br></br></br></br></br></br></p><p>And speaking as one who has worked with upper level executives at<br> Intel, including Andy Grove, I can personally testify that Intel<br> is most definitely not run by idiots.</br></br></p><p>Mr. Johnson, I think you will recognize that both the game and<br> mainstream medias have exhibited considerable bias with regards to<br> the issue of GamerGate and have failed to cover it in a manner<br> that can be described as either fair or objective. While there has<br> obviously been some problematic behavior on both sides, I do not<br> see how it can possibly be in Gawker Media’s interest to continue<br> attacking both its readers and its advertisers alike. I hope you<br> will see fit to remove those employees and contributors who have<br> been inclined to do so, beginning with Mr. Read.</br></br></br></br></br></br></br></br></p><p>Thank you,<br> Vox Day</br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://s3.amazonaws.com/teepublicuploadsproduction/designs/81703/T-Shirt/m/191919/display.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"200\" src=\"https://s3.amazonaws.com/teepublicuploadsproduction/designs/81703/T-Shirt/m/191919/display.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://s3.amazonaws.com/teepublicuploadsproduction/designs/81703/T-Shirt/m/191919/display.jpg\" decoding=\"async\" height=\"200\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%20200%22%3E%3C/svg%3E\" width=\"200\"/></a></div><p>In other #GamerGate-related news, Castalia House has posted <a href=\"http://www.castaliahouse.com/on-gamergate/\">its statement on the matter</a> which features insightful quotes from Popehat’s Clark as well as Castalia author William S. Lind. And Teepublic has <a href=\"https://www.teepublic.com/t-shirt/81703-highscoregate\">a #GamerGate shirt</a> out that is very retro and is all but guaranteed to set the usual suspects to frothing at the mouth on sight.</p><p>And Nero has another great article on #GamerGate, entitled: <a href=\"http://www.breitbart.com/Breitbart-London/2014/10/21/Incredibly-GamerGate-is-winning-but-you-won-t-read-that-anywhere-in-the-terrified-liberal-media\">“Incredibly, GamerGate Is Winning – But You Won’t Read that Anywhere In the Terrified Liberal Media”</a>:</p><blockquote class=\"tr_bq\"><p> Perhaps it won’t surprise you to learn that microchip manufacturers<br> and car companies are pretty sympathetic to the concerns of male<br> consumers. But some of the things said to me–all, sadly, on condition<br> of anonymity–have been nothing short of remarkable.</br></br></br></p><p>There’s the Intel vice president who told me via email that GamerGate<br> was “doing great work” and that he was “sick of slander and<br> self-loathing from the press”. He was talking about male journalists who<br> do misandrist feminists’ work for them.<br> “I am pressing that team, it’s not mine, but I am exerting influence<br> when I can, to stop spending money with people who hate themselves and<br> hate our clients,” he added by phone later.</br></br></br></br></br></br></p><p>Then consider the product manager, who was happy to be identified as<br> “senior management at a German car manufacturer”, who told me that, “the<br> violence against women is unacceptable and we cannot support it, but we<br> will not financially support people who insult our customers either”. The manager told me: “We would prefer not to make headlines like<br> Intel. But you should expect to see strategic changes in how we spend in<br> coming years. It is very much an open question inside the company and<br> we are watching closely.”</br></br></br></br></br></br></p><p>Finally, the executive at a household name video game developer who<br> said: “Opinion is sharply divided within the company. But that’s<br> remarkable in itself, given how totally the media has slammed and lied<br> about gamers. We’re split straight down the middle. One thing I can tell you, though, is that when claims about gamers<br> being woman-hating or abusive start to unravel, because journalists<br> didn’t check them properly before running these ‘bleeding heart’<br> editorials, it’s very difficult to win people back from there. So God<br> help Kotaku and Polygon if any of these women are shown to be making<br> stuff up.”</br></br></br></br></br></br></br></br></p></blockquote><p>How fortunate for the anti-GamerGate crowd that women (and, presumably, men wearing dresses) never lie about <strike>rape</strike>death threats….</p></div>",
  "content_text": "Joel Johnson\nEditorial Director\nGawker Media\nDear Mr. Johnson,\nAs a professional game reviewer, game developer, and game designer with 22 years of experience in the game industry who has worked\nclosely with Intel in the past, I would like to request that you\nimmediately ask Max Read to resign from Gawker Media for the blatant\ndisregard he has shown for the gaming community as well as one of\nits most important corporate supporters. Mr. Read wrote:\n“So let’s say it now: Intel is run by craven idiots. It\nemploys pusillanimous morons. It lacks integrity.”\nHe dishonestly described GamerGate as “dishonest fascists” and\n“an ill-informed mob of alienated and resentful video\ngame-playing teenagers and young men\n“He, and later I, made the tactical mistake of\npublicly treating Gamergate with the contempt and flippancy that\nit deserves.”\nMr. Johnson, GamerGate does not consist of fascists. It is not an\nill-informed mob. It is not limited to teenagers, to men, or to\nwhite people. It does not deserve to be treated with contempt and\nflippancy. GamerGate is a broad spectrum of the gaming community,\nincluding players and developers, and consists of men and women of\nall ages who wish nothing more than to simply continue to design,\ndevelop, and play the games that we wish to design, develop, and\nplay without being attacked by professional political activists,\ncorrupt game journalists, and publicity-seeking independent game\ndevelopers.\nAnd speaking as one who has worked with upper level executives at\nIntel, including Andy Grove, I can personally testify that Intel\nis most definitely not run by idiots.\nMr. Johnson, I think you will recognize that both the game and\nmainstream medias have exhibited considerable bias with regards to\nthe issue of GamerGate and have failed to cover it in a manner\nthat can be described as either fair or objective. While there has\nobviously been some problematic behavior on both sides, I do not\nsee how it can possibly be in Gawker Media’s interest to continue\nattacking both its readers and its advertisers alike. I hope you\nwill see fit to remove those employees and contributors who have\nbeen inclined to do so, beginning with Mr. Read.\nThank you,\nVox Day\nIn other #GamerGate-related news, Castalia House has posted\nits statement on the matter\nwhich features insightful quotes from Popehat’s Clark as well as Castalia author William S. Lind. And Teepublic has\na #GamerGate shirt\nout that is very retro and is all but guaranteed to set the usual suspects to frothing at the mouth on sight.\nAnd Nero has another great article on #GamerGate, entitled:\n“Incredibly, GamerGate Is Winning – But You Won’t Read that Anywhere In the Terrified Liberal Media”\n:\nPerhaps it won’t surprise you to learn that microchip manufacturers\nand car companies are pretty sympathetic to the concerns of male\nconsumers. But some of the things said to me–all, sadly, on condition\nof anonymity–have been nothing short of remarkable.\nThere’s the Intel vice president who told me via email that GamerGate\nwas “doing great work” and that he was “sick of slander and\nself-loathing from the press”. He was talking about male journalists who\ndo misandrist feminists’ work for them.\n“I am pressing that team, it’s not mine, but I am exerting influence\nwhen I can, to stop spending money with people who hate themselves and\nhate our clients,” he added by phone later.\nThen consider the product manager, who was happy to be identified as\n“senior management at a German car manufacturer”, who told me that, “the\nviolence against women is unacceptable and we cannot support it, but we\nwill not financially support people who insult our customers either”. The manager told me: “We would prefer not to make headlines like\nIntel. But you should expect to see strategic changes in how we spend in\ncoming years. It is very much an open question inside the company and\nwe are watching closely.”\nFinally, the executive at a household name video game developer who\nsaid: “Opinion is sharply divided within the company. But that’s\nremarkable in itself, given how totally the media has slammed and lied\nabout gamers. We’re split straight down the middle. One thing I can tell you, though, is that when claims about gamers\nbeing woman-hating or abusive start to unravel, because journalists\ndidn’t check them properly before running these ‘bleeding heart’\neditorials, it’s very difficult to win people back from there. So God\nhelp Kotaku and Polygon if any of these women are shown to be making\nstuff up.”\nHow fortunate for the anti-GamerGate crowd that women (and, presumably, men wearing dresses) never lie about\nrape\ndeath threats….",
  "tags": [
    "games",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-24T08:52:00+00:00"
}