{
  "url": "https://voxday.net/2014/10/30/in-defense-of-civilian-military/",
  "scraped_at": "2025-12-16T12:32:58.957493",
  "title": "In defense of civilian military theorists",
  "date_display": "October 30, 2014",
  "date_iso": "2014-10-30T11:10:00+00:00",
  "date_from_url": "2014-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is long and documented history of military veterans being dubious about the wisdom of listening to so-called military experts who personally lack military experience. It brings one to mind of the famous incident of Machiavelli’s visit to a mercenary camp:</p><blockquote class=\"tr_bq\"><p> While in Piacenza [Machiavelli] spent some time in the camp of the famous mercenary Giovanni delle Bande Nere, whose small army was the one truly capable fighting force in the anti-imperial league. According to the writer Matteo Bandello, who claims to have been there, the battle-tested general thought it might be amusing to teach the author of The Art of War a lesson. Opening Machiavelli’s book to the chapter on infantry drills, Giovanni asked him to attempt to put into practice what he’d written by marching his three thousand men about the parade ground. Machiavelli gamely took up the challenge but, not surprisingly, proved hopelessly out of his depth. The troops were soon milling about in confusion and could only be disentangled by the prompt intervention of their captain.</p><p>“How great the difference is,” Bandello sneered, “between womeone who knows and who has not set in operation what he knows and someone who, as well as knowing, has often rolled up his sleeves and… has derived his thoughts and mental view from outward deeds.”<br> – <i>Machiavelli: A Biography</i>, Miles J. Unger, p. 324</br></p></blockquote><p>There is, therefore, good reason to be initially skeptical of any intellectual whose ideas are both untested and rejected by those with practical experience. If nothing else, 80 years of failure to successfully manage the economy with Keynesian, Neo-Keynesian, and Ur-Keynesian theories should suffice to justify a considerable quantity of skepticism in this regard.</p><p>But skepticism is not always justified, particularly when there are more than a few experienced practitioners who recognize the intrinsic value in the theory, when the theory is successfully implemented, and when it is used as the basis of accurate predictive models. A Marine recently sent me a copy of William S. Lind’s <i>Maneuver Warfare Handbook</i> and I was somewhat amused to read the Foreword by Colonel John C. Studt, USMC (Ret), written nearly 30 year ago, in light of the fact that some critics of maneuver warfare doctrine, to say nothing of 4GW theory, are still attempting to DISQUALIFY Mr. Lind’s ideas on the grounds of his lack of military service.</p><blockquote class=\"tr_bq\"><p> The author of this book has never served a day of active military duty, and he has never been shot at, although there are no doubt some senior officers who would like to remedy that latter deficiency. Yet he demonstrates an amazing understanding of the art of war, as have only a small handful of military thinkers I have come across in my career.</p><p>I served over 31 years active duty with the Marine Corps, saw combat in both Korea and Vietnam, and attended service schools from The Basic School to the National War College. Yet only toward the end of my military career did I realize how little I really understood the art of war. Even as a Pfc in Korea, after being med-evaced along with most of my platoon after a fruitless frontal assault against superior North Korean forces, it seemed to me there had to be a better way to wage war. Seventeen years later, commanding a battalion at Khe Sanh, I was resolved that none of my Marines would die for lack of superior combat power.</p><p>But we were still relying on the concentration of superior firepower to win—–essentially still practicing Grant’s attrition warfare. And we were still doing frontal assaults!</p><p>When I first heard Bill Lind speak, I must confess I resented a mere civilian expressing criticism of the way our beloved Corps did things. After all, he was not one of us, he had not shed blood with us in battle, he was not a brother. And I had strong suspicions that he would have difficulty passing the PFT. But what he said made sense! For the first time I was personally hearing someone advocate an approach to war that was based on intellectual innovation rather than sheer material superiority: mission-type orders, surfaces and gaps, and <i>Schwerpunkt</i>, instead of the rigid formulas and checklists that we normally associate with our training and doctrine. It was a stimulating experience!</p><p>Through Lind’s articulation, years of my own reading of military history began to make a lot more sense. But why all this from a civilian instead of a professional soldier? In fact, the entire movement for military reform is driven largely by civilian intellectuals, not military officers–one notable exception being retired Air Force Colonel John Boyd.</p><p>When you think about it, this is not surprising. We have never institutionalized a system that encourages innovative ideas or criticism from subordinates. Proposing significant change is frequently viewed as criticism of superiors, since they are responsible for the way things are, and borders on disloyalty if not insubordination. So it is not surprising that the movement for reform comes from outside the military establishment….</p><p>B. H. Liddell Hart once remarked that “The only thing harder than getting a new idea into the military mind is to get an old one out.” In 1925, when he was expounding such heretical theories as the “indirect approach,” the American General Service Schools’ “Review of Current Military Literature” dismissed one of Liddell Hart’s major works as: “Of negative value to the instructors at these schools.” I expect Marine Corps schools to receive this publication with similar enthusiasm. But I cannot believe a professional military officer would not benefit by reading it.</p></blockquote><p>Never mind that a 31-year veteran of two wars declares that the ideas will be beneficial to any professional military officer. Never mind the fact that attempting to disqualify an idea on the basis of its genesis is to commit the basic logical fallacy known as the Genetic Fallacy. If one simply recalls the famous Clausewitzian aphorism that “War is the continuation of Politics by other means”, then it should not be even remotely surprising, much less controversial, that an intellectual with a deep background in Politics might have something insightful to say about War.</p></div>",
  "content_text": "There is long and documented history of military veterans being dubious about the wisdom of listening to so-called military experts who personally lack military experience. It brings one to mind of the famous incident of Machiavelli’s visit to a mercenary camp:\nWhile in Piacenza [Machiavelli] spent some time in the camp of the famous mercenary Giovanni delle Bande Nere, whose small army was the one truly capable fighting force in the anti-imperial league. According to the writer Matteo Bandello, who claims to have been there, the battle-tested general thought it might be amusing to teach the author of The Art of War a lesson. Opening Machiavelli’s book to the chapter on infantry drills, Giovanni asked him to attempt to put into practice what he’d written by marching his three thousand men about the parade ground. Machiavelli gamely took up the challenge but, not surprisingly, proved hopelessly out of his depth. The troops were soon milling about in confusion and could only be disentangled by the prompt intervention of their captain.\n“How great the difference is,” Bandello sneered, “between womeone who knows and who has not set in operation what he knows and someone who, as well as knowing, has often rolled up his sleeves and… has derived his thoughts and mental view from outward deeds.”\n–\nMachiavelli: A Biography\n, Miles J. Unger, p. 324\nThere is, therefore, good reason to be initially skeptical of any intellectual whose ideas are both untested and rejected by those with practical experience. If nothing else, 80 years of failure to successfully manage the economy with Keynesian, Neo-Keynesian, and Ur-Keynesian theories should suffice to justify a considerable quantity of skepticism in this regard.\nBut skepticism is not always justified, particularly when there are more than a few experienced practitioners who recognize the intrinsic value in the theory, when the theory is successfully implemented, and when it is used as the basis of accurate predictive models. A Marine recently sent me a copy of William S. Lind’s\nManeuver Warfare Handbook\nand I was somewhat amused to read the Foreword by Colonel John C. Studt, USMC (Ret), written nearly 30 year ago, in light of the fact that some critics of maneuver warfare doctrine, to say nothing of 4GW theory, are still attempting to DISQUALIFY Mr. Lind’s ideas on the grounds of his lack of military service.\nThe author of this book has never served a day of active military duty, and he has never been shot at, although there are no doubt some senior officers who would like to remedy that latter deficiency. Yet he demonstrates an amazing understanding of the art of war, as have only a small handful of military thinkers I have come across in my career.\nI served over 31 years active duty with the Marine Corps, saw combat in both Korea and Vietnam, and attended service schools from The Basic School to the National War College. Yet only toward the end of my military career did I realize how little I really understood the art of war. Even as a Pfc in Korea, after being med-evaced along with most of my platoon after a fruitless frontal assault against superior North Korean forces, it seemed to me there had to be a better way to wage war. Seventeen years later, commanding a battalion at Khe Sanh, I was resolved that none of my Marines would die for lack of superior combat power.\nBut we were still relying on the concentration of superior firepower to win—–essentially still practicing Grant’s attrition warfare. And we were still doing frontal assaults!\nWhen I first heard Bill Lind speak, I must confess I resented a mere civilian expressing criticism of the way our beloved Corps did things. After all, he was not one of us, he had not shed blood with us in battle, he was not a brother. And I had strong suspicions that he would have difficulty passing the PFT. But what he said made sense! For the first time I was personally hearing someone advocate an approach to war that was based on intellectual innovation rather than sheer material superiority: mission-type orders, surfaces and gaps, and\nSchwerpunkt\n, instead of the rigid formulas and checklists that we normally associate with our training and doctrine. It was a stimulating experience!\nThrough Lind’s articulation, years of my own reading of military history began to make a lot more sense. But why all this from a civilian instead of a professional soldier? In fact, the entire movement for military reform is driven largely by civilian intellectuals, not military officers–one notable exception being retired Air Force Colonel John Boyd.\nWhen you think about it, this is not surprising. We have never institutionalized a system that encourages innovative ideas or criticism from subordinates. Proposing significant change is frequently viewed as criticism of superiors, since they are responsible for the way things are, and borders on disloyalty if not insubordination. So it is not surprising that the movement for reform comes from outside the military establishment….\nB. H. Liddell Hart once remarked that “The only thing harder than getting a new idea into the military mind is to get an old one out.” In 1925, when he was expounding such heretical theories as the “indirect approach,” the American General Service Schools’ “Review of Current Military Literature” dismissed one of Liddell Hart’s major works as: “Of negative value to the instructors at these schools.” I expect Marine Corps schools to receive this publication with similar enthusiasm. But I cannot believe a professional military officer would not benefit by reading it.\nNever mind that a 31-year veteran of two wars declares that the ideas will be beneficial to any professional military officer. Never mind the fact that attempting to disqualify an idea on the basis of its genesis is to commit the basic logical fallacy known as the Genetic Fallacy. If one simply recalls the famous Clausewitzian aphorism that “War is the continuation of Politics by other means”, then it should not be even remotely surprising, much less controversial, that an intellectual with a deep background in Politics might have something insightful to say about War.",
  "tags": [
    "books",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-30T11:10:00+00:00"
}