{
  "url": "https://voxday.net/2014/10/03/mailvox-more-curricula-wanted/",
  "scraped_at": "2025-12-16T12:29:54.268283",
  "title": "Mailvox: more curricula wanted",
  "date_display": "October 3, 2014",
  "date_iso": "2014-10-03T09:22:00+00:00",
  "date_from_url": "2014-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rabbi B is interested in our future plans for more material for homeschooling and personal intellectual development:</p><blockquote class=\"tr_bq\"><p> I recently acquired <a href=\"http://www.castaliahouse.com/downloads/astronomy-homeschool-bundle/\">the astronomy materials</a> from Castalia House a few weeks ago, and from just a cursory review it is evident that the material is going to be rigorous, demanding, and a lot of fun.  I was wondering if you had any plans top expand this area of Castalia House in the future?</p><p>I thought it might be nice to make more material of comparable quality available.  It may be possible that more specialized subjects such as writing, rhetoric, Latin, logic, and economics would prove appealing.  In my experience, many home schoolers tend to be relatively weak in these areas, most especially writing and rhetoric.  The material wouldn’t have to be added all at once, but could be introduced gradually to assess interest and receptivity.  Perhaps there would be a way to gauge what topics would be of interest and provide material accordingly.</p><p>Even if materials couldn’t be made available, suggested reading lists for a variety of disciplines (literature, history, mathematics, sciences, philosophy, etc) and for different age groups could be posted, not unlike the reading lists on the VP site.  Obviously, you have a better grasp of what is marketable and worth your time and effort, but I for one would love to see more educational materials of comparable quality made available.</p></blockquote><p>We do indeed intend to produce more material for the Castalia Homeschool line. At present, we are working on three curricula: Newtonian Physics, Military History, and Economics. The latter begins thus:</p><blockquote class=\"tr_bq\"><p> Economics is an intellectual discipline, a field of study, and a body of knowledge. It is not, however, a science, despite the best efforts of economists to establish it as one. While it has historically been called “the Dismal Science”, the truth is that economics could be more accurately described as “the Grand Illusion”.</p><p>Science is a process that requires testing, repetition, and the production of reliable, predictable, and testable results. But due to its dynamic complexity and its enormous scale, economics does not readily lend itself to either testing in a lab or repetition outside one. And because of the tremendous complications of all the human preferences and decisions necessarily involved, the predictions generated by economic models seldom prove to be even remotely reliable. Even on the rare occasions that they appear to be initially correct, economic theories often cease to hold up well over time.</p><p>Does this mean that economics is without value or that it is a waste of time to study it? Not in the least. Economics only provides us with a very limited ability to understand the chaotic complexities of human interaction, but even a faint glimmer of light is precious in a room that is otherwise pitch-black.</p></blockquote><p>We actually hoped to have Physics and Economics out this fall, but events and ambitions conspired to thwart us. The problem is that Stickwick and I are both, in addition to being rather busy, more than a little iconoclastic. Which means that we’re not entirely comfortable with any of the basic textbooks available and therefore feel the need to write our own. Fortunately for me, Tom Woods has a fairly solid Austrian textbook which was released under a license that is essentially open source and will permit me to remix it to stress what I feel is important as well as to incorporate some additional elements, such as the important and groundbreaking work of Robert Prechter on social mood, Steve Keen on supply and demand, and Ian Fletcher on free trade.</p><p>Most of the homeschool curricula presently available rely upon works that were written more than fifty years ago and fail to take into account any of the lessons we have learned in recent decades about the effects of globalization, mass immigration, and credit bubbles. And the intrinsic problem of relying upon a book called <i>Whatever Happened to Penny Candy</i> should not be difficult to understand when even those of us who are middle-aged cannot remember a time when candy cost only one penny.</p><p>I don’t know exactly what Stickwick’s issue with the physics textbooks were, but I trust her judgment entirely in such matters and was quite happy to accept a delay in the release of the Physics curriciulum in exchange for an original textbook. It will, I am entirely certain, only improve the end result.</p><p>The Military History curriculum is being written by Dr. James Perry. A first look at the quality of his work can be seen in the forthcoming RIDING THE RED HORSE, as he has contributed a lengthy piece on Soviet strategy in Asia called “Make the Tigers Fight”. I was very impressed with the work that Dr. Perry did on the reasoning behind the strategies of WWII in the Pacific, as he pointed out some aspects that had previously eluded me despite my being a lifelong WWII enthusiast, and I am confident that his curriculum will be a solid one. Tom Kratman is an advisor on it, so I shall be very disappointed if there isn’t at least one lesson devoted to military occupations and the utility of crucifixion in pacifying defeated populations.</p><p>On the subject of Castalia House, we have <a href=\"http://www.castaliahouse.com/new-author-announcement/\">a new author announcement</a> today.</p></div>",
  "content_text": "Rabbi B is interested in our future plans for more material for homeschooling and personal intellectual development:\nI recently acquired\nthe astronomy materials\nfrom Castalia House a few weeks ago, and from just a cursory review it is evident that the material is going to be rigorous, demanding, and a lot of fun.  I was wondering if you had any plans top expand this area of Castalia House in the future?\nI thought it might be nice to make more material of comparable quality available.  It may be possible that more specialized subjects such as writing, rhetoric, Latin, logic, and economics would prove appealing.  In my experience, many home schoolers tend to be relatively weak in these areas, most especially writing and rhetoric.  The material wouldn’t have to be added all at once, but could be introduced gradually to assess interest and receptivity.  Perhaps there would be a way to gauge what topics would be of interest and provide material accordingly.\nEven if materials couldn’t be made available, suggested reading lists for a variety of disciplines (literature, history, mathematics, sciences, philosophy, etc) and for different age groups could be posted, not unlike the reading lists on the VP site.  Obviously, you have a better grasp of what is marketable and worth your time and effort, but I for one would love to see more educational materials of comparable quality made available.\nWe do indeed intend to produce more material for the Castalia Homeschool line. At present, we are working on three curricula: Newtonian Physics, Military History, and Economics. The latter begins thus:\nEconomics is an intellectual discipline, a field of study, and a body of knowledge. It is not, however, a science, despite the best efforts of economists to establish it as one. While it has historically been called “the Dismal Science”, the truth is that economics could be more accurately described as “the Grand Illusion”.\nScience is a process that requires testing, repetition, and the production of reliable, predictable, and testable results. But due to its dynamic complexity and its enormous scale, economics does not readily lend itself to either testing in a lab or repetition outside one. And because of the tremendous complications of all the human preferences and decisions necessarily involved, the predictions generated by economic models seldom prove to be even remotely reliable. Even on the rare occasions that they appear to be initially correct, economic theories often cease to hold up well over time.\nDoes this mean that economics is without value or that it is a waste of time to study it? Not in the least. Economics only provides us with a very limited ability to understand the chaotic complexities of human interaction, but even a faint glimmer of light is precious in a room that is otherwise pitch-black.\nWe actually hoped to have Physics and Economics out this fall, but events and ambitions conspired to thwart us. The problem is that Stickwick and I are both, in addition to being rather busy, more than a little iconoclastic. Which means that we’re not entirely comfortable with any of the basic textbooks available and therefore feel the need to write our own. Fortunately for me, Tom Woods has a fairly solid Austrian textbook which was released under a license that is essentially open source and will permit me to remix it to stress what I feel is important as well as to incorporate some additional elements, such as the important and groundbreaking work of Robert Prechter on social mood, Steve Keen on supply and demand, and Ian Fletcher on free trade.\nMost of the homeschool curricula presently available rely upon works that were written more than fifty years ago and fail to take into account any of the lessons we have learned in recent decades about the effects of globalization, mass immigration, and credit bubbles. And the intrinsic problem of relying upon a book called\nWhatever Happened to Penny Candy\nshould not be difficult to understand when even those of us who are middle-aged cannot remember a time when candy cost only one penny.\nI don’t know exactly what Stickwick’s issue with the physics textbooks were, but I trust her judgment entirely in such matters and was quite happy to accept a delay in the release of the Physics curriciulum in exchange for an original textbook. It will, I am entirely certain, only improve the end result.\nThe Military History curriculum is being written by Dr. James Perry. A first look at the quality of his work can be seen in the forthcoming RIDING THE RED HORSE, as he has contributed a lengthy piece on Soviet strategy in Asia called “Make the Tigers Fight”. I was very impressed with the work that Dr. Perry did on the reasoning behind the strategies of WWII in the Pacific, as he pointed out some aspects that had previously eluded me despite my being a lifelong WWII enthusiast, and I am confident that his curriculum will be a solid one. Tom Kratman is an advisor on it, so I shall be very disappointed if there isn’t at least one lesson devoted to military occupations and the utility of crucifixion in pacifying defeated populations.\nOn the subject of Castalia House, we have\na new author announcement\ntoday.",
  "tags": [
    "Castalia House",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-03T08:22:00+00:00"
}