{
  "url": "https://voxday.net/2014/10/15/mailvox-which-squad-leader/",
  "scraped_at": "2025-12-16T12:31:14.180506",
  "title": "Mailvox: which Squad Leader?",
  "date_display": "October 15, 2014",
  "date_iso": "2014-10-15T18:43:00+00:00",
  "date_from_url": "2014-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JS is curious about ASL:</p><blockquote class=\"tr_bq\"><p> Read about this game (again) in a GamerGate post today… Which set do you play?  I’m intrigued…I’d like to buy a kit and start playing. Time for a post for us inspiring ASL newbies! I like turn-based games (I own Supremacy, and even ported the board to Java…Very handy to have a seamless scroll when you control Siberia and Alaska!), but haven’t played detailed military rules since high school.</p></blockquote><p>I own two sets of Squad Leader and two sets of Advanced Squad Leader as a consequence of the Hasbro acquisition panic of 1999 and Ender has a complete set of the Advanced Squad Leader Starter Kit. Right now, I mostly play ASLSK because we are methodically playing our way through that. I myself started with the ASL11 Defiance on Hill 30 scenario from Paratrooper, followed by ASL14 Silence that Gun. While I’d owned Squad Leader, Cross of Iron, and Crescendo of Doom since I was 10, I’d never actually played against an actual opponent because I didn’t know anyone willing to learn the rules.</p><p>Since then, I’ve played a Red Barricades campaign and took part in an eight-man game of <a href=\"http://www.milobookclub.com/2004/06/04/june-6th-1944/\">Gold Beach</a>, which was one of the better gaming experiences of my life. Ender was actually given his nickname by Big Chilly as a result of ASL, as <a href=\"http://www.milobookclub.com/2010/03/02/enders-scenario/\">he managed to beat me</a>, fair and square, (albeit with the help of a 1 in 36 shot) in one of the first ASLSK scenarios he ever played. I usually win, as he’s too conservative in attack and doesn’t have the experience to deal with my 3GW tactics, but he’s learned that I tend to have trouble maintaining my focus once the game is well in hand and has taken advantage of that to steal a victory or two at the wire.</p><p>It’s a wonderful game, and if you take the Journals and Annuals into account, makes for great reading material; Chapter H alone is a comprehensive education in World War II fighting vehicles. Start with ASLSK #1, play through it, and then move on to #2 and #3 if you enjoy it. Then you’ll be ready to move up to the big league and the ASLRB.</p></div>",
  "content_text": "JS is curious about ASL:\nRead about this game (again) in a GamerGate post today… Which set do you play?  I’m intrigued…I’d like to buy a kit and start playing. Time for a post for us inspiring ASL newbies! I like turn-based games (I own Supremacy, and even ported the board to Java…Very handy to have a seamless scroll when you control Siberia and Alaska!), but haven’t played detailed military rules since high school.\nI own two sets of Squad Leader and two sets of Advanced Squad Leader as a consequence of the Hasbro acquisition panic of 1999 and Ender has a complete set of the Advanced Squad Leader Starter Kit. Right now, I mostly play ASLSK because we are methodically playing our way through that. I myself started with the ASL11 Defiance on Hill 30 scenario from Paratrooper, followed by ASL14 Silence that Gun. While I’d owned Squad Leader, Cross of Iron, and Crescendo of Doom since I was 10, I’d never actually played against an actual opponent because I didn’t know anyone willing to learn the rules.\nSince then, I’ve played a Red Barricades campaign and took part in an eight-man game of\nGold Beach\n, which was one of the better gaming experiences of my life. Ender was actually given his nickname by Big Chilly as a result of ASL, as\nhe managed to beat me\n, fair and square, (albeit with the help of a 1 in 36 shot) in one of the first ASLSK scenarios he ever played. I usually win, as he’s too conservative in attack and doesn’t have the experience to deal with my 3GW tactics, but he’s learned that I tend to have trouble maintaining my focus once the game is well in hand and has taken advantage of that to steal a victory or two at the wire.\nIt’s a wonderful game, and if you take the Journals and Annuals into account, makes for great reading material; Chapter H alone is a comprehensive education in World War II fighting vehicles. Start with ASLSK #1, play through it, and then move on to #2 and #3 if you enjoy it. Then you’ll be ready to move up to the big league and the ASLRB.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-15T17:43:00+00:00"
}