{
  "url": "https://voxday.net/2014/10/13/on-evidence/",
  "scraped_at": "2025-12-16T12:31:01.194233",
  "title": "On evidence",
  "date_display": "October 13, 2014",
  "date_iso": "2014-10-13T23:28:00+00:00",
  "date_from_url": "2014-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the usual anklebiters attempted to claim that there is no evidence I was ever a successful game producer. Now, I don’t talk about most of my designs these days, for obvious reasons, but since the review is out there, here is the take on RMR from <i>Computer Gaming World</i>, written by Loyd Case, who was their most technical writer at the time:</p><blockquote class=\"tr_bq\"><p> There is an old aphorism that’s often said about weddings – something old, something new. You need a bit of each for good luck. REBEL MOON RISING is a 3D shooter that is a mix of the old and the new – both in terms of gameplay and technology….</p><p>Another new technology feature [after mentioning our first use of 16-bit color -VD] is voice recognition. One early Windows 95 game, ACES OF THE DEEP, used speech recognition, but the implementation was very limited. In REBEL MOON RISING, the list of usable words is quite large. While you can actually give orders to AI squad mates in a limited way, it’s mostly used to communicate with other players in multiplayer games…. Where REBEL MOON RISING doesn’t break new ground is in graphics. Although it does use 16-bit color, the style is still 2/12D, in the style of DUKE NUKEM 3D….</p><p> “Where Rebel Moon Rising does<br> break new ground in 3D-action shooters is in mission design (as opposed<br> to level design). There are a couple of missions in which you defend a location. You can either choose to run around frantically, trying to defend against multiple attackers as they teleport in, or you can find the switch that will bring in reinforcements. The reinforcements are about as dumb as the AI opponents, but they do help buffer the target against the opposing forces. The two best missions in the game are ones where<br> you escort prisoners – in one case, alien babies – to a hand-off point.<br> The suspense gets pretty intense as you move with your charge and try to<br> keep enemies from picking them off. It’s also somehow more personal<br> than similar missions in flight sims. When one of the alien babies was<br> killed, I felt a very real sense of outrage and emptied most of a<br> magazine into the enemy that had killed it. Some of the other missions<br> which involve searching for and destroying a specific set of objectives<br> are more creative than the “if it moves, shoot it” philosophy in most<br> 3D-action games.  All of this takes place in the context of a relatively<br> interesting story.” </br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>So, I was publicly recognized by the leading industry magazine as the<br> first game designer to do mission design in 3D shooters, introduce 16-bit color, and feature AI squad mates to whom you could actually talk to using speech recognition, in a game that did over 6<br> million units. It did well enough that a strategy book was released for it. This is failure?</br></br></p><p>Case was absolutely correct. The game wasn’t outstanding. It had some production flaws and my decision to set it on the Moon was egregiously stupid. (Way to show off the color, sport!) But “it has an interesting story and some highly creative missions” is hardly indicative of “a crappy game”.</p></div>",
  "content_text": "One of the usual anklebiters attempted to claim that there is no evidence I was ever a successful game producer. Now, I don’t talk about most of my designs these days, for obvious reasons, but since the review is out there, here is the take on RMR from\nComputer Gaming World\n, written by Loyd Case, who was their most technical writer at the time:\nThere is an old aphorism that’s often said about weddings – something old, something new. You need a bit of each for good luck. REBEL MOON RISING is a 3D shooter that is a mix of the old and the new – both in terms of gameplay and technology….\nAnother new technology feature [after mentioning our first use of 16-bit color -VD] is voice recognition. One early Windows 95 game, ACES OF THE DEEP, used speech recognition, but the implementation was very limited. In REBEL MOON RISING, the list of usable words is quite large. While you can actually give orders to AI squad mates in a limited way, it’s mostly used to communicate with other players in multiplayer games…. Where REBEL MOON RISING doesn’t break new ground is in graphics. Although it does use 16-bit color, the style is still 2/12D, in the style of DUKE NUKEM 3D….\n“Where Rebel Moon Rising does\nbreak new ground in 3D-action shooters is in mission design (as opposed\nto level design). There are a couple of missions in which you defend a location. You can either choose to run around frantically, trying to defend against multiple attackers as they teleport in, or you can find the switch that will bring in reinforcements. The reinforcements are about as dumb as the AI opponents, but they do help buffer the target against the opposing forces. The two best missions in the game are ones where\nyou escort prisoners – in one case, alien babies – to a hand-off point.\nThe suspense gets pretty intense as you move with your charge and try to\nkeep enemies from picking them off. It’s also somehow more personal\nthan similar missions in flight sims. When one of the alien babies was\nkilled, I felt a very real sense of outrage and emptied most of a\nmagazine into the enemy that had killed it. Some of the other missions\nwhich involve searching for and destroying a specific set of objectives\nare more creative than the “if it moves, shoot it” philosophy in most\n3D-action games.  All of this takes place in the context of a relatively\ninteresting story.”\nSo, I was publicly recognized by the leading industry magazine as the\nfirst game designer to do mission design in 3D shooters, introduce 16-bit color, and feature AI squad mates to whom you could actually talk to using speech recognition, in a game that did over 6\nmillion units. It did well enough that a strategy book was released for it. This is failure?\nCase was absolutely correct. The game wasn’t outstanding. It had some production flaws and my decision to set it on the Moon was egregiously stupid. (Way to show off the color, sport!) But “it has an interesting story and some highly creative missions” is hardly indicative of “a crappy game”.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-13T22:28:00+00:00"
}