{
  "url": "https://voxday.net/2014/10/22/our-underoos-are-not-magic/",
  "scraped_at": "2025-12-16T12:32:01.631388",
  "title": "Our underoos are not magic!",
  "date_display": "October 22, 2014",
  "date_iso": "2014-10-22T15:39:00+00:00",
  "date_from_url": "2014-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"firstPar\"> This announcement betrays an almost shocking naivete <a href=\"http://www.telegraph.co.uk/news/worldnews/northamerica/usa/11178873/Mormons-say-Our-underwear-is-not-magic.html\">concerning human nature</a>:<blockquote class=\"tr_bq\"><p> The Church of Jesus Christ of Latter-day Saints has declared that it is<br> offended by ridicule about the undergarments worn by its faithful and<br> references to them as “magical underwear”.</br></br></p><p>A video released by the church on YouTube compared the underwear, known as “temple<br> garments”, to nuns habits, priests’ cassocks, Jewish prayer shawls,<br> Muslim skull caps, and the robes of Buddhist monks.</br></br></p><p>It said: “Some people incorrectly refer to temple garments as magical, or<br> magic underwear. These words are not only inaccurate but offensive to<br> members of the church. There is nothing mystical or magical about temple garments and church<br> members ask for the same degree of respect and sensitivity that would be<br> afforded to any other faith by people of good will.”</br></br></br></br></p></blockquote><p>Look, I have zero problem with Mormons. They are, by and large, good people. Numerous readers here are Mormon. Larry Correia, Brad Torgersen, and Orson Scott Card are all Mormons. They may harbor a few strange beliefs, but then, so do I. But look, you simply cannot wear special, funny-looking underwear and expect people to find no amusement in it. You just can’t! And then informing the pulic your underwear stirs “the deepest feelings of<br> the soul” is just asking, nay, demanding amusement at your expense.</br></p><p>The Church would do much better to grin and bear it than try to play the offense card on that basis. Because, like it or not, underwear is intrinsically funny to most people and “magic underwear” is downright off the charts.</p><p>UPDATE: Josh has a better solution:</p><p><i>Honestly…the best way for them to handle this would be to say: “Because of our masculinity and virility, we Mormons require undergarments that offer more support for our massive penises.” </i></p></div></div>",
  "content_text": "This announcement betrays an almost shocking naivete\nconcerning human nature\n:\nThe Church of Jesus Christ of Latter-day Saints has declared that it is\noffended by ridicule about the undergarments worn by its faithful and\nreferences to them as “magical underwear”.\nA video released by the church on YouTube compared the underwear, known as “temple\ngarments”, to nuns habits, priests’ cassocks, Jewish prayer shawls,\nMuslim skull caps, and the robes of Buddhist monks.\nIt said: “Some people incorrectly refer to temple garments as magical, or\nmagic underwear. These words are not only inaccurate but offensive to\nmembers of the church. There is nothing mystical or magical about temple garments and church\nmembers ask for the same degree of respect and sensitivity that would be\nafforded to any other faith by people of good will.”\nLook, I have zero problem with Mormons. They are, by and large, good people. Numerous readers here are Mormon. Larry Correia, Brad Torgersen, and Orson Scott Card are all Mormons. They may harbor a few strange beliefs, but then, so do I. But look, you simply cannot wear special, funny-looking underwear and expect people to find no amusement in it. You just can’t! And then informing the pulic your underwear stirs “the deepest feelings of\nthe soul” is just asking, nay, demanding amusement at your expense.\nThe Church would do much better to grin and bear it than try to play the offense card on that basis. Because, like it or not, underwear is intrinsically funny to most people and “magic underwear” is downright off the charts.\nUPDATE: Josh has a better solution:\nHonestly…the best way for them to handle this would be to say: “Because of our masculinity and virility, we Mormons require undergarments that offer more support for our massive penises.”",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-22T14:39:00+00:00"
}