{
  "url": "https://voxday.net/2014/10/03/patient-2/",
  "scraped_at": "2025-12-16T12:29:59.809966",
  "title": "Patient #2?",
  "date_display": "October 3, 2014",
  "date_iso": "2014-10-03T18:45:00+00:00",
  "date_from_url": "2014-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A possible case of Ebola <a href=\"http://www.nbcwashington.com/news/local/Patient-With-Ebola-Like-Symptoms-Being-Treated-at-Howard-University-Hospital-278025181.html\">in Washington DC</a>:</p><blockquote class=\"tr_bq\"><p> A patient with Ebola-like symptoms is being treated at Howard University Hospital in Washington, D.C., a hospital spokesperson confirmed late Friday morning. The patient had traveled to Nigeria recently. That person has been admitted to the hospital in stable condition, and is being isolated. The medical team is working with the CDC and other authorities to monitor the patient’s condition.</p></blockquote><p>Shut down air travel from Africa. Now. It’s a good thing this possible case is in DC, as perhaps the disease in the near vicinity will sufficiently alarm Congress to force <strike>Obola</strike>Obama to finally take action.</p><p>And if the CDC wants to avoid panicking the public, perhaps they should stop making statements that make them look <a href=\"http://www.politico.com/story/2014/10/ebola-us-border-111581.html\">like completely incompetent idiots</a>.</p><blockquote class=\"tr_bq\"><p> Tom Frieden, director of the Centers for Disease Control and Prevention,<br> on Friday said restricting travel between the U.S. and West Africa<br> would likely “backfire” and put Americans more at risk of contracting<br> Ebola…. “Even if we tried to close the border, it wouldn’t work,” the top health official added. “People have a right to return. People transiting through could come in. And it would backfire, because by isolating these countries, it’ll make it harder to help them, it will spread more there and we’d be more likely to be exposed here.”</br></br></br></p></blockquote><p>That’s complete horseshit. The moron may as well have painted a target in his back in the event Americans start dying from a disease that he could have, and should have, prevented from entering the country.</p></div>",
  "content_text": "A possible case of Ebola\nin Washington DC\n:\nA patient with Ebola-like symptoms is being treated at Howard University Hospital in Washington, D.C., a hospital spokesperson confirmed late Friday morning. The patient had traveled to Nigeria recently. That person has been admitted to the hospital in stable condition, and is being isolated. The medical team is working with the CDC and other authorities to monitor the patient’s condition.\nShut down air travel from Africa. Now. It’s a good thing this possible case is in DC, as perhaps the disease in the near vicinity will sufficiently alarm Congress to force\nObola\nObama to finally take action.\nAnd if the CDC wants to avoid panicking the public, perhaps they should stop making statements that make them look\nlike completely incompetent idiots\n.\nTom Frieden, director of the Centers for Disease Control and Prevention,\non Friday said restricting travel between the U.S. and West Africa\nwould likely “backfire” and put Americans more at risk of contracting\nEbola…. “Even if we tried to close the border, it wouldn’t work,” the top health official added. “People have a right to return. People transiting through could come in. And it would backfire, because by isolating these countries, it’ll make it harder to help them, it will spread more there and we’d be more likely to be exposed here.”\nThat’s complete horseshit. The moron may as well have painted a target in his back in the event Americans start dying from a disease that he could have, and should have, prevented from entering the country.",
  "tags": [
    "free trade",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-03T17:45:00+00:00"
}