{
  "url": "https://voxday.net/2014/10/25/pinkshirts-at-play/",
  "scraped_at": "2025-12-16T12:32:24.350969",
  "title": "Pinkshirts at play",
  "date_display": "October 25, 2014",
  "date_iso": "2014-10-25T18:00:00+00:00",
  "date_from_url": "2014-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, recall that we’re supposed to be concerned that the mainstream media is against #GamerGate. John Scalzi was crowing to Sparklepunter that. But do they seriously think we don’t notice when the greater portion of the media establishment is simply pinkshirts doing exactly what Clark described at Popehat: <i>“using these pink resources to promote, give good reviews to, and bestow awards on pink developers and pink games….”</i> In this vein, consider the New York Times <a href=\"http://www.nytimes.com/2014/10/26/books/review/robert-jackson-bennetts-city-of-stairs-and-more.html\">review of science fiction and fantasy</a> today:</p><blockquote class=\"tr_bq\"><p> “Ancillary Justice,” the first novel in Ann Leckie’s far-future posthuman space opera series, recently became the first novel to win the “triple crown” of the genre (the Hugo, Nebula and Arthur C. Clarke awards), but not without controversy. The central question is whether the story’s structural gimmick — the protagonist’s tendency to refer to all people as “she” regardless of actual gender or even humanity — is sufficiently mind-blowing as to merit all the accolades. It isn’t a gimmick, though; it’s a coup. Rather than seriously entertain the endless, if stupid, debate on whether women have a place in stories of the future, Leckie’s book does the literary equivalent of rolling its eyes and walking out of the room. Her refusal to waste energy on stupidity forces her audience to do the same: A few pages into the first novel, the reader gives up trying to guess each character’s actual gender, and just accepts that this will be a story full of interesting women doing awesome things.</p></blockquote><p>Notice that the reviewer dismisses the controversy around whether an eminently forgettable debut novel truly merits being the most highly-awarded SF/F novel of all time. As if there was every any doubt that a book written by a female pinkshirt was going to be full of women doing things. Prediction: the recently-released sequel to this vaunted SF novel ever is going to fall <i>considerably </i>short of expectations. Now, care to guess who wrote the review?</p><p>Why, none other than the educated, but ignorant half-savage herself, NK Jemisin! But we’re supposed to be duly impressed by the fact that the supposedly objective mainstream media praises “a story full of interesting women doing awesome things”, which I note could be used to describe practically any female-written novel from <i>The Pillow Book</i> to <i>50 Shades of Grey</i>.</p><p>Like most pinkshirt victories, this one is hollow and bordering on pyrrhic, because the primary accomplishment is to cause the reader to realize that there is no point reading the NYT’s book reviews anymore. Assuming, of course, that one didn’t already figure that out about 20 years ago. Either way, it represents a once-formidable gatekeeper continuing its spiral downward into irrelevance.</p></div>",
  "content_text": "Now, recall that we’re supposed to be concerned that the mainstream media is against #GamerGate. John Scalzi was crowing to Sparklepunter that. But do they seriously think we don’t notice when the greater portion of the media establishment is simply pinkshirts doing exactly what Clark described at Popehat:\n“using these pink resources to promote, give good reviews to, and bestow awards on pink developers and pink games….”\nIn this vein, consider the New York Times\nreview of science fiction and fantasy\ntoday:\n“Ancillary Justice,” the first novel in Ann Leckie’s far-future posthuman space opera series, recently became the first novel to win the “triple crown” of the genre (the Hugo, Nebula and Arthur C. Clarke awards), but not without controversy. The central question is whether the story’s structural gimmick — the protagonist’s tendency to refer to all people as “she” regardless of actual gender or even humanity — is sufficiently mind-blowing as to merit all the accolades. It isn’t a gimmick, though; it’s a coup. Rather than seriously entertain the endless, if stupid, debate on whether women have a place in stories of the future, Leckie’s book does the literary equivalent of rolling its eyes and walking out of the room. Her refusal to waste energy on stupidity forces her audience to do the same: A few pages into the first novel, the reader gives up trying to guess each character’s actual gender, and just accepts that this will be a story full of interesting women doing awesome things.\nNotice that the reviewer dismisses the controversy around whether an eminently forgettable debut novel truly merits being the most highly-awarded SF/F novel of all time. As if there was every any doubt that a book written by a female pinkshirt was going to be full of women doing things. Prediction: the recently-released sequel to this vaunted SF novel ever is going to fall\nconsiderably\nshort of expectations. Now, care to guess who wrote the review?\nWhy, none other than the educated, but ignorant half-savage herself, NK Jemisin! But we’re supposed to be duly impressed by the fact that the supposedly objective mainstream media praises “a story full of interesting women doing awesome things”, which I note could be used to describe practically any female-written novel from\nThe Pillow Book\nto\n50 Shades of Grey\n.\nLike most pinkshirt victories, this one is hollow and bordering on pyrrhic, because the primary accomplishment is to cause the reader to realize that there is no point reading the NYT’s book reviews anymore. Assuming, of course, that one didn’t already figure that out about 20 years ago. Either way, it represents a once-formidable gatekeeper continuing its spiral downward into irrelevance.",
  "tags": [
    "books",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-25T17:00:00+00:00"
}