{
  "url": "https://voxday.net/2014/10/31/probing-for-weakness/",
  "scraped_at": "2025-12-16T12:33:11.436463",
  "title": "Probing for weakness",
  "date_display": "October 31, 2014",
  "date_iso": "2014-10-31T13:30:00+00:00",
  "date_from_url": "2014-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is a good example of an SJW sally on Twitter. Notice that it is absolutely rife with dishonesty, false pretenses, and attempts to DISQUALIFY from start to finish:</p><blockquote class=\"tr_bq\"><p> Brosephus Aurelius @Brobuntu<br> but what the fuck is a pink shirt</br></p><p>Vox Day<br> A subset of SJWs. (link to Roosh’s article)</br></p><p>Brosephus Aurelius<br> wait isnt Roosh that PUA sex tourist guide guy that offended a good chunk of europe with his books?</br></p><p>Vox Day<br> Straight to DISQUALIFY. Textbook SJW. Well done.</br></p><p>Brosephus Aurelius<br> I’m not disqualifying his opinion, just checking if you knew his past public exposure before linking. I’m still reading the link</br></p><p>Vox Day<br> Roosh has not offended most of us who live here in Europe. I know exactly who he is. And I don’t subscribe to the Genetic Fallacy.</br></p><p>Brosephus Aurelius<br> hey there’s not a single mention of pink anything in that link, so I’m confused as to how it ties into my question</br></p><p>Vox Day<br> Perhaps this will help you: (link to my response to Roosh’s article.)</br></p><p>Brosephus Aurelius<br> wait so you personally made up this word and it’s definition, then expect everyone to keep up with it by default?</br></p><p>Vox Day<br> I don’t have any expectation of you at all. I don’t care what you do, say, or think. Accept or reject, as you see fit.</br></p><p>Brosephus Aurelius<br> well this is a pretty vast conspiracy put forth, I’m going to need somewhat of a more rigorous source than a few people’s blog posts</br></p><p>Brosephus Aurelius<br> especially when you’re making an implicit appeal to ethos without any visible standing in that regard, as you’re anonymous</br></p><p>Vox Day<br> My “visible standing” is 1.5 million monthly pageviews. Accept or reject, as you see fit. Not my concern.</br></p></blockquote><p>The object, obviously, is to create a rift between us that he can exploit; the rabbit is dangling the opportunity for me to win his approval by denouncing Roosh, which he will then immediately turn into a weapon to use against Roosh. This is the “Divide and Denounce” tactic. My favorite part is where he attempts to deny that he’s trying to disqualify Roosh and claims he’s merely “checking if you knew his past public exposure before linking”. As you do, I suppose. But his language gives him away even in the denial; he says “I’m not disqualifying” rather than “I’m not trying to disqualify”, which tells us that he assumes that his opinion is sufficient to disqualify someone. This is a key SJW trait.</p><p>The correct response to “Divide and Denounce” is to refuse to denounce or otherwise separate yourself from the target they are attempting to isolate, no matter who the target is or what they are supposed to have done. (#GamerGate, in general, has done a stellar job of this, it is one of the things that makes it antifragile.) So, it’s no surprise that when I refuse to rise to the bait, he then proceeds to attempt to disqualify BOTH Roosh and me, because he’s going to need “somewhat of a more rigorous source” than our blog posts. <i>Quelle surprise!</i> This is the “Pose as a Moderate Who Finds the Evidence Unconvincing” tactic, which is, of course, simply a variant of their primary tactic, DISQUALIFY.  We see it utilized every election season with all those fake “Republicans who have always voted for Republicans in the past, but this year, Romney/McCain/Bush/Dole is simply too extreme”.</p><p>And notice how when I simply kept answering him in a straightforward manner that clearly indicated I did not care what he did, thought, or said, he dropped the moderate pose and retreated to snarking about Roosh’s article. (It’s remarkable how SJWs are always “laughing”. They must be very jolly people indeed.) If, on the other hand, I had showed any weakness, taken the bait to separate myself from Roosh, or accepted him as a legitimate judge as to my standing as a source, he would have immediately pressed that point.</p><p>One reason for SJW success is that they operate on a mixed 2GW/3GW model, 2GW firepower/attrition on the larger scale combined with 3GW maneuver by their fanatics. But, as we know, 4GW trumps both. In any event, the mention of Roosh led another SJW to leap in and attempt to DISQUALIFY him, at which point a modest degree of hilarity ensued.</p><blockquote class=\"tr_bq\"><p> James Mathurin @jameswiseson <br> @Brobuntu @voxday Don’t forget he’s also an admitted rapist.</br></p><p>Vox Day<br> No, that’s John “I’m a rapist” @scalzi. You can even hear him admit it here: (link to MP3)</br></p><p>James Mathurin<br> Nah, it’s Roosh.</br></p><p>Vox Day<br> That’s a direct quote from 25 October 2012. You literally can’t get any more “self-admitted rapist” than that.</br></p><p>James Mathurin<br> At some point, will you explain why you think I care? I was talking about Roosh V being an admitted rapist.</br></p><p>Vox Day<br> You’ve provided no evidence at all. I’ve provided conclusive proof that John Scalzi is a self-admitted rapist.</br></p><p>Vox Day<br> So, you are actually saying that you don’t care that John Scalzi is a self-admitted rapist. Wow just wow.</br></p><p>Brosephus Aurelius<br> 11/10 wizard tier trolling</br></p></blockquote><p>This is another point to notice. SJWs are <i>shameless </i>hypocrites. They will completely ignore the very same charges that they hurl – in this case, a knowingly false charge against Roosh for “violating” a U.S. state’s age of consent law in a country with a lower age of consent – against their targets if those charges are directed at them or someone they consider to be on their side. While you can easily expose their hypocrisy in the eyes of others, being exposed won’t even slow them down, so don’t hang your hat on it.</p><p>Notice that I am expected to care about his undocumented claim that someone he is attacking is “an admitted rapist”, but he is not expected to care about my documented proof that someone else is a “self-admitted rapist”, which is exactly what Roosh describes in the article the SJWs are trying to DISQUALIFY: <i>“SJW’s do not believe in objectivity. Instead, speech and ideas must be<br> viewed relatively depending on the source and its intended audience…. SJW’s have started labeling men as rapists based on anonymous internet<br> allegations, even when the supposed victims never reported the crime to<br> police.” </br></br></br></i></p><p>You have to admit, he certainly called that one correctly.<i> </i></p></div>",
  "content_text": "Here is a good example of an SJW sally on Twitter. Notice that it is absolutely rife with dishonesty, false pretenses, and attempts to DISQUALIFY from start to finish:\nBrosephus Aurelius @Brobuntu\nbut what the fuck is a pink shirt\nVox Day\nA subset of SJWs. (link to Roosh’s article)\nBrosephus Aurelius\nwait isnt Roosh that PUA sex tourist guide guy that offended a good chunk of europe with his books?\nVox Day\nStraight to DISQUALIFY. Textbook SJW. Well done.\nBrosephus Aurelius\nI’m not disqualifying his opinion, just checking if you knew his past public exposure before linking. I’m still reading the link\nVox Day\nRoosh has not offended most of us who live here in Europe. I know exactly who he is. And I don’t subscribe to the Genetic Fallacy.\nBrosephus Aurelius\nhey there’s not a single mention of pink anything in that link, so I’m confused as to how it ties into my question\nVox Day\nPerhaps this will help you: (link to my response to Roosh’s article.)\nBrosephus Aurelius\nwait so you personally made up this word and it’s definition, then expect everyone to keep up with it by default?\nVox Day\nI don’t have any expectation of you at all. I don’t care what you do, say, or think. Accept or reject, as you see fit.\nBrosephus Aurelius\nwell this is a pretty vast conspiracy put forth, I’m going to need somewhat of a more rigorous source than a few people’s blog posts\nBrosephus Aurelius\nespecially when you’re making an implicit appeal to ethos without any visible standing in that regard, as you’re anonymous\nVox Day\nMy “visible standing” is 1.5 million monthly pageviews. Accept or reject, as you see fit. Not my concern.\nThe object, obviously, is to create a rift between us that he can exploit; the rabbit is dangling the opportunity for me to win his approval by denouncing Roosh, which he will then immediately turn into a weapon to use against Roosh. This is the “Divide and Denounce” tactic. My favorite part is where he attempts to deny that he’s trying to disqualify Roosh and claims he’s merely “checking if you knew his past public exposure before linking”. As you do, I suppose. But his language gives him away even in the denial; he says “I’m not disqualifying” rather than “I’m not trying to disqualify”, which tells us that he assumes that his opinion is sufficient to disqualify someone. This is a key SJW trait.\nThe correct response to “Divide and Denounce” is to refuse to denounce or otherwise separate yourself from the target they are attempting to isolate, no matter who the target is or what they are supposed to have done. (#GamerGate, in general, has done a stellar job of this, it is one of the things that makes it antifragile.) So, it’s no surprise that when I refuse to rise to the bait, he then proceeds to attempt to disqualify BOTH Roosh and me, because he’s going to need “somewhat of a more rigorous source” than our blog posts.\nQuelle surprise!\nThis is the “Pose as a Moderate Who Finds the Evidence Unconvincing” tactic, which is, of course, simply a variant of their primary tactic, DISQUALIFY.  We see it utilized every election season with all those fake “Republicans who have always voted for Republicans in the past, but this year, Romney/McCain/Bush/Dole is simply too extreme”.\nAnd notice how when I simply kept answering him in a straightforward manner that clearly indicated I did not care what he did, thought, or said, he dropped the moderate pose and retreated to snarking about Roosh’s article. (It’s remarkable how SJWs are always “laughing”. They must be very jolly people indeed.) If, on the other hand, I had showed any weakness, taken the bait to separate myself from Roosh, or accepted him as a legitimate judge as to my standing as a source, he would have immediately pressed that point.\nOne reason for SJW success is that they operate on a mixed 2GW/3GW model, 2GW firepower/attrition on the larger scale combined with 3GW maneuver by their fanatics. But, as we know, 4GW trumps both. In any event, the mention of Roosh led another SJW to leap in and attempt to DISQUALIFY him, at which point a modest degree of hilarity ensued.\nJames Mathurin @jameswiseson\n@Brobuntu @voxday Don’t forget he’s also an admitted rapist.\nVox Day\nNo, that’s John “I’m a rapist” @scalzi. You can even hear him admit it here: (link to MP3)\nJames Mathurin\nNah, it’s Roosh.\nVox Day\nThat’s a direct quote from 25 October 2012. You literally can’t get any more “self-admitted rapist” than that.\nJames Mathurin\nAt some point, will you explain why you think I care? I was talking about Roosh V being an admitted rapist.\nVox Day\nYou’ve provided no evidence at all. I’ve provided conclusive proof that John Scalzi is a self-admitted rapist.\nVox Day\nSo, you are actually saying that you don’t care that John Scalzi is a self-admitted rapist. Wow just wow.\nBrosephus Aurelius\n11/10 wizard tier trolling\nThis is another point to notice. SJWs are\nshameless\nhypocrites. They will completely ignore the very same charges that they hurl – in this case, a knowingly false charge against Roosh for “violating” a U.S. state’s age of consent law in a country with a lower age of consent – against their targets if those charges are directed at them or someone they consider to be on their side. While you can easily expose their hypocrisy in the eyes of others, being exposed won’t even slow them down, so don’t hang your hat on it.\nNotice that I am expected to care about his undocumented claim that someone he is attacking is “an admitted rapist”, but he is not expected to care about my documented proof that someone else is a “self-admitted rapist”, which is exactly what Roosh describes in the article the SJWs are trying to DISQUALIFY:\n“SJW’s do not believe in objectivity. Instead, speech and ideas must be\nviewed relatively depending on the source and its intended audience…. SJW’s have started labeling men as rapists based on anonymous internet\nallegations, even when the supposed victims never reported the crime to\npolice.”\nYou have to admit, he certainly called that one correctly.",
  "tags": [
    "debate",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-31T13:30:00+00:00"
}