{
  "url": "https://voxday.net/2014/10/17/recommending-books/",
  "scraped_at": "2025-12-16T12:31:23.038328",
  "title": "Recommending books",
  "date_display": "October 17, 2014",
  "date_iso": "2014-10-17T12:00:00+00:00",
  "date_from_url": "2014-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First of all, thanks to the nearly 100 Ilk who went to <a href=\"http://re.co/\">Recommend </a>and set up accounts there. I’ve already personally found it to be useful, as I picked up a copy of <i>Battle Academy 2</i> on Kool Moe Dee’s strong recommendation of <i>The Campaign Series</i> from Matrix Games. It was also nice to see the strong recommendations for <i>A Throne of Bones</i> by David Jirovec and even for this blog by Aquila Aquilonis.</p><p>One reason you may be interested <a href=\"http://re.co/users/A6CA467C/#/\">in following along</a>, even if you’re not initially interested in recommending anything yourself, is that I am methodically working my way through my reading list and making recommendations on the various books I have read this year. So, if you’d like to know my actual opinion of those books, you can join up and read them there. Here are four examples of my recently posted book recos:<br> <i><br/></i><br> <b>FAIR: </b><i>The Elephant Vanishes and Other Stories</i> by Haruki Murakami occasionally shows the award-winning author at his diffident best. Not all the stories will be new to the longtime reader; the original version of <i>The Wind-Up Bird</i> is here, and frankly, it is more appealing in many ways than the novel it subsequently turned into. The title story is arguably the most interesting, as who but a Murakami character would become fascinated with an aged elephant and his equally decrepit keeper? But the most insightful and most troubling is probably the story of a woman who loses the ability to sleep, and in doing so, also loses her connection to her humanity. As is often the case with his longer works, Murakami seldom provides the answers to his mysteries, but then, it is the journey rather than the destination that is to be most savored here.</br></br></p><p><b>DISAPPOINTING:</b> Although Eco is easily my favorite writer and he demonstrates both his<br> esoteric expertise and his customary attention to detail in this book,<br> <i>The Prague Cemetery </i>simply isn’t very absorbing. It’s an origin story<br> for “The Protocols of the Learned Elders of Zion”, but the mercenary<br> protagonist is neither sympathetic nor interesting, a strange identity<br> device is utilized that is neither relevant nor even remotely<br> convincing, and the extended detour into the Risorgimento seems forced.<br> Still worth reading, because, after all, even a lesser Eco book is<br> better than most books by other authors, but it’s not Eco at his best.</br></br></br></br></br></br></br></br></p><p><b>BAD:</b>  Despite the title, the religious need not fear this book. <i>A Manual for Creating Atheists</i>,<br> by Peter Boghossian, is far less likely to turn theists into atheists<br> than it is to turn atheists into agnostics out of sheer intellectual<br> embarrassment. A more accurate title would have been <i>Atheism: Begging the Question</i>.<br> Boghossian’s entire manual can be reduced to three simple steps: 1. Beg<br> the question. 2. Redefine any commonly understood dictionary term to<br> mean something completely different. 3. Declare victory. There are<br> perfectly rational arguments for atheism to be made, but none of them<br> are to be found in this particular book. Peter Boghossian would very<br> much like to replace the late Christopher Hitchens as the Fourth<br> Horseman of Atheism, but it is no wonder that Messrs. Dawkins, Dennett,<br> and Harris are disinclined to admit him to their ranks.</br></br></br></br></br></br></br></br></br></br></br></p><p><b>AWESOME: </b><i>Gaudy Night</i>, by Dorothy Sayers, is a Lord Peter Wimsey mystery, and as such, is a good book worth reading. But it is more than that. By setting it at the site of her old academic haunts, Sayers also presents us with a vivid portrait of bygone times. The portrayal of female academics at Oxford in the early 20th century is keenly historical, for all that it is fiction, written by a literary master who was actually there at the time. The mystery itself is almost secondary to the fascinating interplay of old rivalries and lingering jealousies that remain active among a group of exceptional women. Sayers always had unusual insight into the human condition, and Gaudy Night is perhaps her novel that most clearly demonstrates this.</p><p>If you think “Awesome” is a bit much for the Sayer’s novel, you’re absolutely correct. The four-rating system is a little limiting and Recommend will go to the six-rating system that I personally prefer in November. Two negative ratings, HORRIBLE and DISAPPOINTING, will go with FAIR, GOOD, EXCELLENT, and AWESOME. The idea is that the EXCELLENT rating should be sufficiently superlative to encourage users to actually distinguish between something that is legitimately AWESOME, such as <i>The Lord of the Rings</i>, and something that is more reasonably described as EXCELLENT, such as <i>Gaudy Night</i> or <i>A Game of Thrones</i>. And, of course, I will bump up <i>The Elephant Vanishes</i> to GOOD once the new system is active.</p></div>",
  "content_text": "First of all, thanks to the nearly 100 Ilk who went to\nRecommend\nand set up accounts there. I’ve already personally found it to be useful, as I picked up a copy of\nBattle Academy 2\non Kool Moe Dee’s strong recommendation of\nThe Campaign Series\nfrom Matrix Games. It was also nice to see the strong recommendations for\nA Throne of Bones\nby David Jirovec and even for this blog by Aquila Aquilonis.\nOne reason you may be interested\nin following along\n, even if you’re not initially interested in recommending anything yourself, is that I am methodically working my way through my reading list and making recommendations on the various books I have read this year. So, if you’d like to know my actual opinion of those books, you can join up and read them there. Here are four examples of my recently posted book recos:\nFAIR:\nThe Elephant Vanishes and Other Stories\nby Haruki Murakami occasionally shows the award-winning author at his diffident best. Not all the stories will be new to the longtime reader; the original version of\nThe Wind-Up Bird\nis here, and frankly, it is more appealing in many ways than the novel it subsequently turned into. The title story is arguably the most interesting, as who but a Murakami character would become fascinated with an aged elephant and his equally decrepit keeper? But the most insightful and most troubling is probably the story of a woman who loses the ability to sleep, and in doing so, also loses her connection to her humanity. As is often the case with his longer works, Murakami seldom provides the answers to his mysteries, but then, it is the journey rather than the destination that is to be most savored here.\nDISAPPOINTING:\nAlthough Eco is easily my favorite writer and he demonstrates both his\nesoteric expertise and his customary attention to detail in this book,\nThe Prague Cemetery\nsimply isn’t very absorbing. It’s an origin story\nfor “The Protocols of the Learned Elders of Zion”, but the mercenary\nprotagonist is neither sympathetic nor interesting, a strange identity\ndevice is utilized that is neither relevant nor even remotely\nconvincing, and the extended detour into the Risorgimento seems forced.\nStill worth reading, because, after all, even a lesser Eco book is\nbetter than most books by other authors, but it’s not Eco at his best.\nBAD:\nDespite the title, the religious need not fear this book.\nA Manual for Creating Atheists\n,\nby Peter Boghossian, is far less likely to turn theists into atheists\nthan it is to turn atheists into agnostics out of sheer intellectual\nembarrassment. A more accurate title would have been\nAtheism: Begging the Question\n.\nBoghossian’s entire manual can be reduced to three simple steps: 1. Beg\nthe question. 2. Redefine any commonly understood dictionary term to\nmean something completely different. 3. Declare victory. There are\nperfectly rational arguments for atheism to be made, but none of them\nare to be found in this particular book. Peter Boghossian would very\nmuch like to replace the late Christopher Hitchens as the Fourth\nHorseman of Atheism, but it is no wonder that Messrs. Dawkins, Dennett,\nand Harris are disinclined to admit him to their ranks.\nAWESOME:\nGaudy Night\n, by Dorothy Sayers, is a Lord Peter Wimsey mystery, and as such, is a good book worth reading. But it is more than that. By setting it at the site of her old academic haunts, Sayers also presents us with a vivid portrait of bygone times. The portrayal of female academics at Oxford in the early 20th century is keenly historical, for all that it is fiction, written by a literary master who was actually there at the time. The mystery itself is almost secondary to the fascinating interplay of old rivalries and lingering jealousies that remain active among a group of exceptional women. Sayers always had unusual insight into the human condition, and Gaudy Night is perhaps her novel that most clearly demonstrates this.\nIf you think “Awesome” is a bit much for the Sayer’s novel, you’re absolutely correct. The four-rating system is a little limiting and Recommend will go to the six-rating system that I personally prefer in November. Two negative ratings, HORRIBLE and DISAPPOINTING, will go with FAIR, GOOD, EXCELLENT, and AWESOME. The idea is that the EXCELLENT rating should be sufficiently superlative to encourage users to actually distinguish between something that is legitimately AWESOME, such as\nThe Lord of the Rings\n, and something that is more reasonably described as EXCELLENT, such as\nGaudy Night\nor\nA Game of Thrones\n. And, of course, I will bump up\nThe Elephant Vanishes\nto GOOD once the new system is active.",
  "tags": [
    "books",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-17T11:00:00+00:00"
}