{
  "url": "https://voxday.net/2014/10/13/sam-harris-is-still-genocidal-maniac/",
  "scraped_at": "2025-12-16T12:30:56.430520",
  "title": "Sam Harris: genocidal maniac or suicidal logician?",
  "date_display": "October 13, 2014",
  "date_iso": "2014-10-13T10:44:00+00:00",
  "date_from_url": "2014-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> <a href=\"http://www.samharris.org/images/uploads/Aslan_Greenwald_copy.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"281\" src=\"http://www.samharris.org/images/uploads/Aslan_Greenwald_copy.jpg\" width=\"400\"/></a><a href=\"http://www.samharris.org/blog/item/on-the-mechanics-of-defamation\">Sam Harris is whining</a> about the fact that people are still actively holding him accountable for the clear and obvious meaning of his written words, and he is still attempting to shade the truth while doing so.<br> <i><br/></i><br> <i>“I know one thing to a moral certainty, however: Both Greenwald and Aslan know<br> that those words do not mean what they appear to mean. Given the amount<br> of correspondence we’ve had on these topics, and given that I have<br> repeatedly bored audiences by clarifying that statement (in response to<br> this kind of treatment), the chance that either writer thinks he is<br> exposing the truth about my views—or that I’m really a “genocidal<br> fascist maniac”—is zero. Aslan and Greenwald—a famous “scholar” and a<br> famous “journalist”—are engaged in a campaign of pure defamation. They<br> are consciously misleading their readers and increasing my security<br> concerns in the process.”</br></br></br></br></br></br></br></br></br></i></br></br></p><p>What a load of utter codswollop. Sam Harris clearly and openly and unmistakably wrote that it MAY be ethical to kill people for believing dangerous beliefs. Not for doing anything, not for harming anyone, but for simply BELIEVING CERTAIN BELIEFS. His repeated “clarifications” and obfuscations don’t change that established fact and he has never recanted his statement. Nor, I note, has he ever come right out and declared specifically WHAT beliefs are so dangerous that it is ethical to kill people for nothing more than holding them.</p><p>There is absolutely no reference to ACTION, only to BELIEF, in his statement. Don’t forget, his entire thesis in <i>THE END OF FAITH</i> is the intrinsic danger that  stems from the mere possession of faith.  Harris can’t complain about “selective quoting”, as the entire context actually makes it worse. He wrote: <i>“Certain beliefs place their adherents beyond the reach of every peaceful<br> means of persuasion, while inspiring them to commit acts of<br> extraordinary violence against others. There is, in fact, no talking to<br> some people. If they cannot be captured, and they often cannot,<br> otherwise tolerant people may be justified in killing them in<br> self-defense.”</br></br></br></br></br></i></p><p>And then he compounds his justification of genocide with more deceit about his own behavior: <i>“I have never knowingly distorted the positions I criticize, whether they<br> are the doctrines of a religion or the personal beliefs of Francis<br> Collins, Eben Alexander, Deepak Chopra, Reza Aslan, Glenn Greenwald, or<br> any other writer or public figure with whom I’ve collided.”</br></br></br></i></p><p>In other words, he’s pleading ignorance in the vast panoply of untruths he has told about Christianity, history, and other matters. In TIA, I showed what a sloppy and careless thinker Harris is; it is no surprise that his carelessness with words is still coming back to haunt him. I mean, look at his idiotic trainwreck of a defense here:</p><p><i>“Aslan and Greenwald know that nowhere in my work do I suggest that we kill harmless people for thought crimes.”</i></p><p>No, Sam, you expressly justify killing DANGEROUS people for thought crimes. And just who will decide who is dangerous and who is harmless? You? Roger Goodell? The Learned Elders of Zion? The Pope? Ironically enough, it is Harris’s own logic that would clearly justify killing Sam Harris. Look, I think Sam Harris is actually a likeable, well-meaning individual who isn’t quite a smart as his fans believe him to be. But Harris desperately needs to stop trying to defend the indefensible, admit that he fucked up on this <a href=\"http://www.milobookclub.com/2008/03/11/sam-harris-responds/\">as he did with both the “religion causes war” and “Red State” arguments</a>, own up to his mistakes, and recant his lunatic justification for thought-based genocide.</p><p>He should simply say: “I was wrong. It is not ethical to kill people for their beliefs, no matter how dangerous those beliefs may be.” Or, if he can’t honestly do that, he should be forthright and say: “It is ethical to kill people for excessively dangerous beliefs, and those beliefs are: X, Y, and Z.” If he won’t do either, he will fully merit the criticism and contempt that will continue to flow his way.</p></div>",
  "content_text": "Sam Harris is whining\nabout the fact that people are still actively holding him accountable for the clear and obvious meaning of his written words, and he is still attempting to shade the truth while doing so.\n“I know one thing to a moral certainty, however: Both Greenwald and Aslan know\nthat those words do not mean what they appear to mean. Given the amount\nof correspondence we’ve had on these topics, and given that I have\nrepeatedly bored audiences by clarifying that statement (in response to\nthis kind of treatment), the chance that either writer thinks he is\nexposing the truth about my views—or that I’m really a “genocidal\nfascist maniac”—is zero. Aslan and Greenwald—a famous “scholar” and a\nfamous “journalist”—are engaged in a campaign of pure defamation. They\nare consciously misleading their readers and increasing my security\nconcerns in the process.”\nWhat a load of utter codswollop. Sam Harris clearly and openly and unmistakably wrote that it MAY be ethical to kill people for believing dangerous beliefs. Not for doing anything, not for harming anyone, but for simply BELIEVING CERTAIN BELIEFS. His repeated “clarifications” and obfuscations don’t change that established fact and he has never recanted his statement. Nor, I note, has he ever come right out and declared specifically WHAT beliefs are so dangerous that it is ethical to kill people for nothing more than holding them.\nThere is absolutely no reference to ACTION, only to BELIEF, in his statement. Don’t forget, his entire thesis in\nTHE END OF FAITH\nis the intrinsic danger that  stems from the mere possession of faith.  Harris can’t complain about “selective quoting”, as the entire context actually makes it worse. He wrote:\n“Certain beliefs place their adherents beyond the reach of every peaceful\nmeans of persuasion, while inspiring them to commit acts of\nextraordinary violence against others. There is, in fact, no talking to\nsome people. If they cannot be captured, and they often cannot,\notherwise tolerant people may be justified in killing them in\nself-defense.”\nAnd then he compounds his justification of genocide with more deceit about his own behavior:\n“I have never knowingly distorted the positions I criticize, whether they\nare the doctrines of a religion or the personal beliefs of Francis\nCollins, Eben Alexander, Deepak Chopra, Reza Aslan, Glenn Greenwald, or\nany other writer or public figure with whom I’ve collided.”\nIn other words, he’s pleading ignorance in the vast panoply of untruths he has told about Christianity, history, and other matters. In TIA, I showed what a sloppy and careless thinker Harris is; it is no surprise that his carelessness with words is still coming back to haunt him. I mean, look at his idiotic trainwreck of a defense here:\n“Aslan and Greenwald know that nowhere in my work do I suggest that we kill harmless people for thought crimes.”\nNo, Sam, you expressly justify killing DANGEROUS people for thought crimes. And just who will decide who is dangerous and who is harmless? You? Roger Goodell? The Learned Elders of Zion? The Pope? Ironically enough, it is Harris’s own logic that would clearly justify killing Sam Harris. Look, I think Sam Harris is actually a likeable, well-meaning individual who isn’t quite a smart as his fans believe him to be. But Harris desperately needs to stop trying to defend the indefensible, admit that he fucked up on this\nas he did with both the “religion causes war” and “Red State” arguments\n, own up to his mistakes, and recant his lunatic justification for thought-based genocide.\nHe should simply say: “I was wrong. It is not ethical to kill people for their beliefs, no matter how dangerous those beliefs may be.” Or, if he can’t honestly do that, he should be forthright and say: “It is ethical to kill people for excessively dangerous beliefs, and those beliefs are: X, Y, and Z.” If he won’t do either, he will fully merit the criticism and contempt that will continue to flow his way.",
  "tags": [
    "atheism",
    "TIA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-13T09:44:00+00:00"
}