{
  "url": "https://voxday.net/2014/10/04/sex-is-choice-and-age-is-just-number/",
  "scraped_at": "2025-12-16T12:30:01.273603",
  "title": "Sex is a choice and age is just a number",
  "date_display": "October 4, 2014",
  "date_iso": "2014-10-04T08:55:00+00:00",
  "date_from_url": "2014-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If they think they’ve got problems now, just wait until the transagist freaks get into the act:</p><blockquote class=\"tr_bq\"><p> It had been a relatively quiet policy debate until the full-page ad appeared in the local newspaper. “A male wants to shower beside your 14-year-old daughter,” it said. “Are you OK with that?”</p><p>The ad, placed by a socially conservative group in Minnesota, was meant to snap attention to a proposal to allow transgender students to play on teams based on their preferred gender rather than the sex assigned to them at birth.</p><p>It appears to have worked. More than 100 community members flooded a meeting this week near Minneapolis, and thousands more sent e-mails. In response, the quasi-public body governing high school sports in Minnesota decided to delay a vote on a new policy covering sports participation by transgender students. Members of the board of directors said they needed more time to study the issue.</p><p>The policy, which they now plan to vote on in December, was an attempt to grapple with a question that has bedeviled many states: How do you deal with the growing number of children identifying as transgender who want to participate in the highly gender-specific worlds of high school sports and extracurricular activities?</p></blockquote><p>The whole debate is blitheringly idiotic. There is no such thing as “transgender”. There are male psychological freaks pretending to be women and female psychological ruins pretending to be men. That’s it. <i>Punto</i>.</p><p>And to anyone who wants to argue otherwise, I will simply point out that I feel that I am 16 years old and fully eligible to play high school sports, and anyone who argues otherwise is transagist. After all, it should be obvious that the year of birth recorded on one’s birth certificate means no more than one’s sex recorded there, and “age” is nothing more than a social construct.</p><p>I know it’s hard to understand and there is a lot of controversy around<br> this, but to be misaged as a middle-aged man when you are actually a teenage boy<br> is incredibly offensive.</br></br></p><p>Other transaged feel that they are 65 and therefore legally eligible to collect Social Security. It would be outrageous to deny them their right to do so. The amusing thing about the Left is that they subscribe to all this ludicrous anti-definitional nonsense, and then turn around and call themselves “the reality-based community”. The truth is that their only connection to reality is their mass rejection of it combined with an enthusiastic embrace of perversion.</p></div>",
  "content_text": "If they think they’ve got problems now, just wait until the transagist freaks get into the act:\nIt had been a relatively quiet policy debate until the full-page ad appeared in the local newspaper. “A male wants to shower beside your 14-year-old daughter,” it said. “Are you OK with that?”\nThe ad, placed by a socially conservative group in Minnesota, was meant to snap attention to a proposal to allow transgender students to play on teams based on their preferred gender rather than the sex assigned to them at birth.\nIt appears to have worked. More than 100 community members flooded a meeting this week near Minneapolis, and thousands more sent e-mails. In response, the quasi-public body governing high school sports in Minnesota decided to delay a vote on a new policy covering sports participation by transgender students. Members of the board of directors said they needed more time to study the issue.\nThe policy, which they now plan to vote on in December, was an attempt to grapple with a question that has bedeviled many states: How do you deal with the growing number of children identifying as transgender who want to participate in the highly gender-specific worlds of high school sports and extracurricular activities?\nThe whole debate is blitheringly idiotic. There is no such thing as “transgender”. There are male psychological freaks pretending to be women and female psychological ruins pretending to be men. That’s it.\nPunto\n.\nAnd to anyone who wants to argue otherwise, I will simply point out that I feel that I am 16 years old and fully eligible to play high school sports, and anyone who argues otherwise is transagist. After all, it should be obvious that the year of birth recorded on one’s birth certificate means no more than one’s sex recorded there, and “age” is nothing more than a social construct.\nI know it’s hard to understand and there is a lot of controversy around\nthis, but to be misaged as a middle-aged man when you are actually a teenage boy\nis incredibly offensive.\nOther transaged feel that they are 65 and therefore legally eligible to collect Social Security. It would be outrageous to deny them their right to do so. The amusing thing about the Left is that they subscribe to all this ludicrous anti-definitional nonsense, and then turn around and call themselves “the reality-based community”. The truth is that their only connection to reality is their mass rejection of it combined with an enthusiastic embrace of perversion.",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-04T07:55:00+00:00"
}