{
  "url": "https://voxday.net/2014/10/22/the-18-year-delta/",
  "scraped_at": "2025-12-16T12:31:58.682171",
  "title": "The 18-year delta",
  "date_display": "October 22, 2014",
  "date_iso": "2014-10-22T09:37:00+00:00",
  "date_from_url": "2014-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ender was excited last night because, with his B team season at an end, the first team had extended an open invitation to the B team players to practice with them. It’s a chance for the coaches to see which young men are ready to play with the men, and who the eventual up-and-comers are. The first team practices at the same time my veteran’s team does, so we drove over to the clubhouse together despite a howling wind and a black sky that threatened some serious rain.</p><p>It’s getting near the end of our season too, three-quarters of my teammates are banged up, and I discovered when I got there that a) the veteran’s practice had been canceled, and b) the first team was missing half its players due to vacations and whatnot. But I know several of the first team players and coaches fairly well because we’re permitted to field two players below 32, but over 25, and some of them play with us when they have an evening free. So, I asked one of the guys I know if they needed an extra player – thinking that they were just going to scrimmage – and he suggested that I stick around and join the practice. So, I changed, put on my cleats, and joined them in the middle of the field.</p><p>There were about eight of Ender’s teammates there, huddled together against the cold rain that had begun to fall and vaguely intimidated by the first team players. They know who I am, of course, and were visibly startled by my presence there – let’s face it, no one is more contemptuous of a middle-aged dad than an elite teenage athlete – and were further taken aback when the player-coach leading the practice greeted me with an enthusiastic handshake-hug. What they didn’t know is that I’ve played several games up front with Stefan and we are <i>molto sympatico</i> on the field despite him being much better than I am. We’ve both given assists on each other’s goals, and like most stellar strikers, he prefers having a strike partner who looks to feed him the ball rather than shoot.</p><p>However, Stefan had a full practice in mind, not a scrimmage. It wasn’t brutal, but it was strenuous, enough so that he came over twice during the repeated agility drills to make sure I wasn’t about to keel over. His concern wasn’t entirely unjustified, as I’m beyond old by first team standards; the oldest player on the team is 28. I would have been insulted, especially given the fact that I was pretty much keeping up with the tall B team defender in front of me in the line, were it not for the fact that I was fairly certain two more run-throughs would have resulted in vomiting. Ender and the midfielders were having no problem, but some of the defenders looked to be mildly in shock at doing 2.5x more repetitions, and doing them at faster speed, than they’d ever done before. Fortunately, we moved on to the team keep-away drill next, which is fast-paced, but gives you a chance to catch your breath if need be. Which was, in fact, the case.</p><p>The bad thing about being a sprinter is that you quickly run out of steam. The good thing about being a sprinter is that you bounce back just as fast. So, by the time we were doing the final drill, which involved a 20-meter sprint to a cone, turning around to receive the ball and firing a one-touch shot on goal, most of the B team kids had slowed to a jog, but I was still running. I even managed to put a few past Ender, who was alternating with the first team keeper in net. Ender acquitted himself well, making some diving saves and drawing praise from the first-team guys, which pleased him immensely.</p><p>I was more than a little pleased myself when, back in the clubhouse, Stefan clapped me on the shoulder and said, “hey, why don’t you come to the next one too?” Which, I have decided, I am absolutely going to do. It’s not that I will ever play for the first team, but I suspect he may find me to be useful in goading the younger players. None of them will have any excuse for falling behind, given that I’m literally three decades older than most of them. The best compliment, however, came from Ender, when I asked him if he’d found it embarrassing to have his old man running around the field.</p><p>“Actually, Dad, I didn’t even notice except for when you were the one shooting at me.”</p><p>I’ll take it. It’s a rare pleasure to be able to play sports with one’s son on an equal footing, so I will enjoy it, however long it lasts.</p></div>",
  "content_text": "Ender was excited last night because, with his B team season at an end, the first team had extended an open invitation to the B team players to practice with them. It’s a chance for the coaches to see which young men are ready to play with the men, and who the eventual up-and-comers are. The first team practices at the same time my veteran’s team does, so we drove over to the clubhouse together despite a howling wind and a black sky that threatened some serious rain.\nIt’s getting near the end of our season too, three-quarters of my teammates are banged up, and I discovered when I got there that a) the veteran’s practice had been canceled, and b) the first team was missing half its players due to vacations and whatnot. But I know several of the first team players and coaches fairly well because we’re permitted to field two players below 32, but over 25, and some of them play with us when they have an evening free. So, I asked one of the guys I know if they needed an extra player – thinking that they were just going to scrimmage – and he suggested that I stick around and join the practice. So, I changed, put on my cleats, and joined them in the middle of the field.\nThere were about eight of Ender’s teammates there, huddled together against the cold rain that had begun to fall and vaguely intimidated by the first team players. They know who I am, of course, and were visibly startled by my presence there – let’s face it, no one is more contemptuous of a middle-aged dad than an elite teenage athlete – and were further taken aback when the player-coach leading the practice greeted me with an enthusiastic handshake-hug. What they didn’t know is that I’ve played several games up front with Stefan and we are\nmolto sympatico\non the field despite him being much better than I am. We’ve both given assists on each other’s goals, and like most stellar strikers, he prefers having a strike partner who looks to feed him the ball rather than shoot.\nHowever, Stefan had a full practice in mind, not a scrimmage. It wasn’t brutal, but it was strenuous, enough so that he came over twice during the repeated agility drills to make sure I wasn’t about to keel over. His concern wasn’t entirely unjustified, as I’m beyond old by first team standards; the oldest player on the team is 28. I would have been insulted, especially given the fact that I was pretty much keeping up with the tall B team defender in front of me in the line, were it not for the fact that I was fairly certain two more run-throughs would have resulted in vomiting. Ender and the midfielders were having no problem, but some of the defenders looked to be mildly in shock at doing 2.5x more repetitions, and doing them at faster speed, than they’d ever done before. Fortunately, we moved on to the team keep-away drill next, which is fast-paced, but gives you a chance to catch your breath if need be. Which was, in fact, the case.\nThe bad thing about being a sprinter is that you quickly run out of steam. The good thing about being a sprinter is that you bounce back just as fast. So, by the time we were doing the final drill, which involved a 20-meter sprint to a cone, turning around to receive the ball and firing a one-touch shot on goal, most of the B team kids had slowed to a jog, but I was still running. I even managed to put a few past Ender, who was alternating with the first team keeper in net. Ender acquitted himself well, making some diving saves and drawing praise from the first-team guys, which pleased him immensely.\nI was more than a little pleased myself when, back in the clubhouse, Stefan clapped me on the shoulder and said, “hey, why don’t you come to the next one too?” Which, I have decided, I am absolutely going to do. It’s not that I will ever play for the first team, but I suspect he may find me to be useful in goading the younger players. None of them will have any excuse for falling behind, given that I’m literally three decades older than most of them. The best compliment, however, came from Ender, when I asked him if he’d found it embarrassing to have his old man running around the field.\n“Actually, Dad, I didn’t even notice except for when you were the one shooting at me.”\nI’ll take it. It’s a rare pleasure to be able to play sports with one’s son on an equal footing, so I will enjoy it, however long it lasts.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-22T08:37:00+00:00"
}