{
  "url": "https://voxday.net/2014/10/08/the-state-is-losing/",
  "scraped_at": "2025-12-16T12:30:21.257743",
  "title": "The State is losing",
  "date_display": "October 8, 2014",
  "date_iso": "2014-10-08T07:34:00+00:00",
  "date_from_url": "2014-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William Lind presciently anticipated which side would have the advantage back in 2006:</p><blockquote class=\"tr_bq\"><p> Among the critics and reinterpreters of Fourth Generation war, the bad is most powerfully represented by Thomas Barnett’s two books The Pentagon’s New Map and Blueprint for Action. Barnett divides the world into two parts, the Functioning Core and the Non-Integrating Gap. This is parallel to what I call centers of order and centers or sources of disorder, and I agree that this will be the fundamental fault line of the 21st Century. Barnett’s error is that he assumes the Functioning Core will be the stronger party, able to restore order in places where it has broken down. In fact, the forces of disorder will be stronger, because they are driven by a factor Barnett dismisses, the spreading crisis of legitimacy of the state. By ignoring Martin van Creveld’s work on the rise and decline of the state, Barnett’s books end up anchoring their foundations on sand.</p></blockquote><p>The implications go far beyond the obvious regions of the Middle East and Ukraine. What we’re seeing in Spain, in Belgium, and in Scotland are the early phases of crises of the State which will likely result, eventually, in either a) a different, more decentralized order or b) disorder.<br> And the increasingly rapid growth of diversity in the USA is a distinct sign of incipient crisis of State legitimacy and eventual disorder.</br></p></div>",
  "content_text": "William Lind presciently anticipated which side would have the advantage back in 2006:\nAmong the critics and reinterpreters of Fourth Generation war, the bad is most powerfully represented by Thomas Barnett’s two books The Pentagon’s New Map and Blueprint for Action. Barnett divides the world into two parts, the Functioning Core and the Non-Integrating Gap. This is parallel to what I call centers of order and centers or sources of disorder, and I agree that this will be the fundamental fault line of the 21st Century. Barnett’s error is that he assumes the Functioning Core will be the stronger party, able to restore order in places where it has broken down. In fact, the forces of disorder will be stronger, because they are driven by a factor Barnett dismisses, the spreading crisis of legitimacy of the state. By ignoring Martin van Creveld’s work on the rise and decline of the state, Barnett’s books end up anchoring their foundations on sand.\nThe implications go far beyond the obvious regions of the Middle East and Ukraine. What we’re seeing in Spain, in Belgium, and in Scotland are the early phases of crises of the State which will likely result, eventually, in either a) a different, more decentralized order or b) disorder.\nAnd the increasingly rapid growth of diversity in the USA is a distinct sign of incipient crisis of State legitimacy and eventual disorder.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-08T06:34:00+00:00"
}