{
  "url": "https://voxday.net/2014/10/26/the-impotence-of-mind-police/",
  "scraped_at": "2025-12-16T12:32:26.164290",
  "title": "The impotence of the mind police",
  "date_display": "October 26, 2014",
  "date_iso": "2014-10-26T12:11:00+00:00",
  "date_from_url": "2014-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sparklepunter (Chris Kluwe) and McRapey (John Scalzi) were chortling on Twitter the other day about how the “idiots” of #GamerGate had “no clue” what they were in for. And then, the pinkshirts pulled out the most fearsome artillery in the mainstream media….</p><p><i>That’s right! A NEW YORK TIMES article! <strike>So what do you think about THAT, bitches?</strike></i><br> (Um, wait, isn’t that sexist?)<br> (SHIT! DELETE TWEET, DELETE TWEET DAMMIT!”)<br> <i>What do you think about that, evil gamerhate death threaters!</i><br> (That’s better.)<br> <i>That’s right, a NEW YORK TIMES article entitled <a href=\"http://www.nytimes.com/2014/10/26/opinion/sunday/the-disheartening-gamergate-campaign.html?_r=0\">“Can Video Games Survive? The Disheartening GamerGate Campaign”:</a></i></br></br></br></br></br></p><blockquote class=\"tr_bq\"><div class=\"story-body-text story-content\" data-para-count=\"273\" data-total-count=\"273\" id=\"story-continues-1\" itemprop=\"articleBody\"> FOR<br> more than five years, almost every word that I’ve written<br> professionally has been about video games. I used to cover things like<br> presidential campaigns and prison reform. But at some point, video games<br> began to seem as consequential as those subjects, if not more so.</br></br></br></br></div><div class=\"story-body-text story-content\" data-para-count=\"273\" data-total-count=\"273\" id=\"story-continues-1\" itemprop=\"articleBody\"></div><div class=\"story-body-text story-content\" data-para-count=\"648\" data-total-count=\"921\" itemprop=\"articleBody\"> As<br> they became more popular, more profitable and, most important, more<br> powerful as a means of creative expression, video games started to feel<br> to me like the Internet had in 1999: a technology on the verge of<br> washing over our culture and reshaping it wholesale. Millions of people<br> of all ages were playing games. These were boom times, and thanks not<br> just to the mega-studios that produce things like the Call of Duty<br> series, but to countless small, independent developers as well. Game<br> design began to be taught in art schools alongside theater and<br> sculpture. The interactive age had arrived, and video games were its<br> most promising entertainment.</br></br></br></br></br></br></br></br></br></br></div></blockquote><p>Translation: newbie journalist discovers games market, reviews some games, and now thinks he’s an expert. Also believes that all the johnny-come-latelies attempting to make a buck off the huge and growing gamer population are indicative of more than trivial parasitism. Speaking as someone who has professionally lectured on game development and game design at a technical institute in Europe, those game design degrees from art schools are completely worthless. (Something I point out in my lectures, by the way.) They are almost always taught by people with virtually no experience in the industry and none professionally designing games.</p><blockquote class=\"tr_bq\"><p> And then came GamerGate. Over the past few weeks, as this inchoate but<br> effective online movement has gathered momentum, I’ve begun to wonder if<br> I’ve made a horrible mistake.</br></br></p></blockquote><p>He did. He chose… poorly. He lined up with the pinkshirts against the players. If you are anti-GamerGate, you are no longer a gamer. Period. You may play games, but you are not a part of gaming culture. You have rejected it.</p><blockquote class=\"tr_bq\"><p> It’s the players who enjoy this culture, even as they distinguish themselves from the worst of the GamerGate trolls, who truly worry me. If all the recent experimentation and progress in video games — they’re in the permanent collection at MoMA now — turns out to be just a plaster on an ugly sore, then the medium’s long journey into the mainstream could be halted or even reversed.</p></blockquote><p>Given what the mainstream presently represents – ideological domination by SJWs, thought-policing by pinkshirts, kowtowing before feminists and sexual freaks, and relentless parasitism – that sounds like a very desirable result indeed. Who gives the smallest fleck of a fly’s shit about video games being “in the permanent collection at MoMA”. So fucking what?</p><blockquote class=\"tr_bq\"><p> Other game designers, journalists and cultural critics have been threatened, or have faced hacking attempts on their online accounts, from email to social media to banking. Video games are unquestionably poorer than they were two months ago when this strange and disheartening series of events began. Talented people are quitting. If this continues, the medium I love could go backward into its roots as a pastime for children.</p></blockquote><p>The game industry didn’t need those no-talent ideological parasites before. It doesn’t need them now. And the game industry could do a lot worse than go back to its roots, which happened to produce some of the legendary classic games that are just as fun to play today as they were two decades ago.</p><blockquote class=\"tr_bq\"><p> To me, these anti-intellectual players, who want games to be “just games” and want criticism of them to be devoid of things like political and social context, are almost as worrisome as the horrifying, and criminal, actions of the harassers.</p></blockquote><p>Of course it is worrisome to him. Games that are just games have no need of parasites like him trying to make a living about talking about them. Given his endorsement of inept pinkshirt-games, he’s clearly incapable of expressing an opinion about gameplay that any gamer will feel any burning need to know.</p><blockquote class=\"tr_bq\"><p> She’s [Leigh Alexander] more discouraged by her peers at websites that took two months to denounce GamerGate. Others have yet to make a statement at all. Some of the participants in the community of intelligent writers and designers who think and talk about video games in print and online, on websites and social media networks and podcasts, are being cowed into silence. In particular, if the large companies that make video games remain quiet, they risk allowing GamerGate to win the debate over whether diversity — of people, of ideas, of games themselves — has a place in their culture.</p></blockquote><p>If the large companies that make video games are dumb enough to attack their core market, they will die. Intel and other companies are withdrawing their money from anti-GamerGate media companies like Gawker because they would like to continue selling their products to gamers. This is all the more true for the big game companies, which would also face an internal rebellion because many, if not most, of their employees are GamerGaters or at least sympathetic towards GamerGate.</p><p>(Let’s not forget, Leigh Alexander is not only the person who declared games to be dead, but also told an indie game developer: <i>“Be careful with me. I am a megaphone, I am much less kind than Rami and I won’t mind making an example out of you.” </i>For the record.)</p><p>@Nero commented that the people at one big company are “split right down the middle” on the issue. I’ve spoken to a few high-level people in the industry myself, including two “name-on-the-box” designers and one CEO, and they are definitely NOT anti-GamerGate. I would say that the most common opinion is one of indifference, mostly because the mainstream media’s opinion is totally irrelevant to them. But they do recognize one thing. #GamerGate is the gamers. Anti-#GamerGate is not. And at the end of the day, If you are anti-#GamerGate, you are no longer a gamer. You may play games, but you are not a part of gaming culture. You have rejected it and you are no longer a part of it.</p><p>Anti-#GamerGate is #GamerHate.</p></div>",
  "content_text": "Sparklepunter (Chris Kluwe) and McRapey (John Scalzi) were chortling on Twitter the other day about how the “idiots” of #GamerGate had “no clue” what they were in for. And then, the pinkshirts pulled out the most fearsome artillery in the mainstream media….\nThat’s right! A NEW YORK TIMES article!\nSo what do you think about THAT, bitches?\n(Um, wait, isn’t that sexist?)\n(SHIT! DELETE TWEET, DELETE TWEET DAMMIT!”)\nWhat do you think about that, evil gamerhate death threaters!\n(That’s better.)\nThat’s right, a NEW YORK TIMES article entitled\n“Can Video Games Survive? The Disheartening GamerGate Campaign”:\nFOR\nmore than five years, almost every word that I’ve written\nprofessionally has been about video games. I used to cover things like\npresidential campaigns and prison reform. But at some point, video games\nbegan to seem as consequential as those subjects, if not more so.\nAs\nthey became more popular, more profitable and, most important, more\npowerful as a means of creative expression, video games started to feel\nto me like the Internet had in 1999: a technology on the verge of\nwashing over our culture and reshaping it wholesale. Millions of people\nof all ages were playing games. These were boom times, and thanks not\njust to the mega-studios that produce things like the Call of Duty\nseries, but to countless small, independent developers as well. Game\ndesign began to be taught in art schools alongside theater and\nsculpture. The interactive age had arrived, and video games were its\nmost promising entertainment.\nTranslation: newbie journalist discovers games market, reviews some games, and now thinks he’s an expert. Also believes that all the johnny-come-latelies attempting to make a buck off the huge and growing gamer population are indicative of more than trivial parasitism. Speaking as someone who has professionally lectured on game development and game design at a technical institute in Europe, those game design degrees from art schools are completely worthless. (Something I point out in my lectures, by the way.) They are almost always taught by people with virtually no experience in the industry and none professionally designing games.\nAnd then came GamerGate. Over the past few weeks, as this inchoate but\neffective online movement has gathered momentum, I’ve begun to wonder if\nI’ve made a horrible mistake.\nHe did. He chose… poorly. He lined up with the pinkshirts against the players. If you are anti-GamerGate, you are no longer a gamer. Period. You may play games, but you are not a part of gaming culture. You have rejected it.\nIt’s the players who enjoy this culture, even as they distinguish themselves from the worst of the GamerGate trolls, who truly worry me. If all the recent experimentation and progress in video games — they’re in the permanent collection at MoMA now — turns out to be just a plaster on an ugly sore, then the medium’s long journey into the mainstream could be halted or even reversed.\nGiven what the mainstream presently represents – ideological domination by SJWs, thought-policing by pinkshirts, kowtowing before feminists and sexual freaks, and relentless parasitism – that sounds like a very desirable result indeed. Who gives the smallest fleck of a fly’s shit about video games being “in the permanent collection at MoMA”. So fucking what?\nOther game designers, journalists and cultural critics have been threatened, or have faced hacking attempts on their online accounts, from email to social media to banking. Video games are unquestionably poorer than they were two months ago when this strange and disheartening series of events began. Talented people are quitting. If this continues, the medium I love could go backward into its roots as a pastime for children.\nThe game industry didn’t need those no-talent ideological parasites before. It doesn’t need them now. And the game industry could do a lot worse than go back to its roots, which happened to produce some of the legendary classic games that are just as fun to play today as they were two decades ago.\nTo me, these anti-intellectual players, who want games to be “just games” and want criticism of them to be devoid of things like political and social context, are almost as worrisome as the horrifying, and criminal, actions of the harassers.\nOf course it is worrisome to him. Games that are just games have no need of parasites like him trying to make a living about talking about them. Given his endorsement of inept pinkshirt-games, he’s clearly incapable of expressing an opinion about gameplay that any gamer will feel any burning need to know.\nShe’s [Leigh Alexander] more discouraged by her peers at websites that took two months to denounce GamerGate. Others have yet to make a statement at all. Some of the participants in the community of intelligent writers and designers who think and talk about video games in print and online, on websites and social media networks and podcasts, are being cowed into silence. In particular, if the large companies that make video games remain quiet, they risk allowing GamerGate to win the debate over whether diversity — of people, of ideas, of games themselves — has a place in their culture.\nIf the large companies that make video games are dumb enough to attack their core market, they will die. Intel and other companies are withdrawing their money from anti-GamerGate media companies like Gawker because they would like to continue selling their products to gamers. This is all the more true for the big game companies, which would also face an internal rebellion because many, if not most, of their employees are GamerGaters or at least sympathetic towards GamerGate.\n(Let’s not forget, Leigh Alexander is not only the person who declared games to be dead, but also told an indie game developer:\n“Be careful with me. I am a megaphone, I am much less kind than Rami and I won’t mind making an example out of you.”\nFor the record.)\n@Nero commented that the people at one big company are “split right down the middle” on the issue. I’ve spoken to a few high-level people in the industry myself, including two “name-on-the-box” designers and one CEO, and they are definitely NOT anti-GamerGate. I would say that the most common opinion is one of indifference, mostly because the mainstream media’s opinion is totally irrelevant to them. But they do recognize one thing. #GamerGate is the gamers. Anti-#GamerGate is not. And at the end of the day, If you are anti-#GamerGate, you are no longer a gamer. You may play games, but you are not a part of gaming culture. You have rejected it and you are no longer a part of it.\nAnti-#GamerGate is #GamerHate.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-26T12:11:00+00:00"
}