{
  "url": "https://voxday.net/2014/10/26/the-vanishing-borders/",
  "scraped_at": "2025-12-16T12:32:28.001344",
  "title": "The vanishing borders",
  "date_display": "October 26, 2014",
  "date_iso": "2014-10-26T15:48:00+00:00",
  "date_from_url": "2014-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Post-WWI borders <a href=\"http://www.the-american-interest.com/blog/2014/10/25/the-imaginary-borders-of-the-middle-east/\">are dissolving</a>, and not in the way that the globalists were anticipating:</p><blockquote><p> Israeli Defense Minister Moshe Ya’alon gave a wide-ranging and<br> provocative interview to NPR earlier this week. Of particular interest<br> was his recognition that the national borders that were created after<br> World War I are dissolving:</br></br></br></p><p><i><br> The borders of many Arab states were drawn up by Westerners a century ago, and wars in recent years show that a number of them are doomed to break apart, according to Ya’alon, a career soldier who became Israel’s defense minister last year. “We have to distinguish between countries like Egypt, with their history. Egypt will stay Egypt,” Ya’alon, who is on a visit to Washington, tells Morning Edition’s Steve Inskeep.<br> In contrast, Ya’alon says, “Libya was a new creation, a Western creation as a result of World War I. Syria, Iraq, the same — artificial nation-states — and what we see now is a collapse of this Western idea.” Asked if Middle Eastern borders are likely to change in the coming years, Ya’alon says: “Yes, absolutely. It has been changed already. Can you unify Syria? [President] Bashar al-Assad is controlling only 25 percent of the Syrian territory. We have to deal with it.”<br> </br></br></br></i></p><p>Ya’alon is right. As our own Adam Garfinkle concluded in June about<br> Iraq: “The Iraqi state in its historic territorial configuration is<br> gone—solid gone, and it ain’t coming back.” The region’s other<br> “artificial nation-states” aren’t going to return to the status quo ante<br> bellum either. Whatever comes out of the current war, it won’t look<br> like the old landscape, and we shouldn’t imagine that there are natural<br> nations waiting to be created out of the ethno-tribal-religious anarchy<br> that the Middle East is witnessing.</br></br></br></br></br></br></br></p></blockquote><p>However, it isn’t merely in the Middle East that the dissolving borders issue can be observed, as anyone who lives in the southwestern United States will know. As William Lind, author of the Castalia House book <a href=\"http://www.castaliahouse.com/downloads/on-war-the-collected-columns-of-william-s-lind-2003-200\"><i><b>ON WAR</b></i></a> (which will be officially released tomorrow) pointed out in “The Canon and the Four Generations”:</p><p><i>4th Generation war is the greatest change since the Peace of Westphalia, because it marks the end of the state’s monopoly on war. Once again, as before 1648, many different entities, not states, are fighting war. They use many different means, including terrorism and immigration, not just formal armies. Differences between cultures, not just states, become paramount,and other cultures will not fight the way we fight. All over the world, state militaries are fighting non-state opponents, and almost always, the state is losing. State militaries were designed to fight other state militaries like themselves, and against nonstate enemies most of their equipment, tactics and training are useless or counterproductive</i>.</p><p>The effects of 4GW can already be seen in the Middle East. But the same forces are actively at work right here in the United States, and, to a lesser extent, in Europe as well.</p></div>",
  "content_text": "Post-WWI borders\nare dissolving\n, and not in the way that the globalists were anticipating:\nIsraeli Defense Minister Moshe Ya’alon gave a wide-ranging and\nprovocative interview to NPR earlier this week. Of particular interest\nwas his recognition that the national borders that were created after\nWorld War I are dissolving:\nThe borders of many Arab states were drawn up by Westerners a century ago, and wars in recent years show that a number of them are doomed to break apart, according to Ya’alon, a career soldier who became Israel’s defense minister last year. “We have to distinguish between countries like Egypt, with their history. Egypt will stay Egypt,” Ya’alon, who is on a visit to Washington, tells Morning Edition’s Steve Inskeep.\nIn contrast, Ya’alon says, “Libya was a new creation, a Western creation as a result of World War I. Syria, Iraq, the same — artificial nation-states — and what we see now is a collapse of this Western idea.” Asked if Middle Eastern borders are likely to change in the coming years, Ya’alon says: “Yes, absolutely. It has been changed already. Can you unify Syria? [President] Bashar al-Assad is controlling only 25 percent of the Syrian territory. We have to deal with it.”\nYa’alon is right. As our own Adam Garfinkle concluded in June about\nIraq: “The Iraqi state in its historic territorial configuration is\ngone—solid gone, and it ain’t coming back.” The region’s other\n“artificial nation-states” aren’t going to return to the status quo ante\nbellum either. Whatever comes out of the current war, it won’t look\nlike the old landscape, and we shouldn’t imagine that there are natural\nnations waiting to be created out of the ethno-tribal-religious anarchy\nthat the Middle East is witnessing.\nHowever, it isn’t merely in the Middle East that the dissolving borders issue can be observed, as anyone who lives in the southwestern United States will know. As William Lind, author of the Castalia House book\nON WAR\n(which will be officially released tomorrow) pointed out in “The Canon and the Four Generations”:\n4th Generation war is the greatest change since the Peace of Westphalia, because it marks the end of the state’s monopoly on war. Once again, as before 1648, many different entities, not states, are fighting war. They use many different means, including terrorism and immigration, not just formal armies. Differences between cultures, not just states, become paramount,and other cultures will not fight the way we fight. All over the world, state militaries are fighting non-state opponents, and almost always, the state is losing. State militaries were designed to fight other state militaries like themselves, and against nonstate enemies most of their equipment, tactics and training are useless or counterproductive\n.\nThe effects of 4GW can already be seen in the Middle East. But the same forces are actively at work right here in the United States, and, to a lesser extent, in Europe as well.",
  "tags": [
    "Castalia House",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-26T15:48:00+00:00"
}