{
  "url": "https://voxday.net/2014/10/06/the-truth-about-free-trade/",
  "scraped_at": "2025-12-16T12:30:17.599319",
  "title": "The truth about free trade",
  "date_display": "October 6, 2014",
  "date_iso": "2014-10-06T17:00:00+00:00",
  "date_from_url": "2014-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Free trade advocates are very often dishonest and attempt to claim that while they support the free movement of capital and goods, they do not support the free movement of people. But this is nonsense, because the free movement of people is intrinsically necessary for free trade in both labor and services. Furthermore, observe that <a href=\"http://blogs.telegraph.co.uk/finance/andrewlilico/100028209/david-cameron-promises-to-withdraw-britain-from-the-european-union-yes-i-mean-it/\">the European Union’s “Four Freedoms” are explicit </a>on this point:</p><blockquote class=\"tr_bq\"><p> One of the “Four Freedoms” of the Single Market is free movement of persons – along with free movement of capital, goods and services. Having a Single Market means having free movement of products (goods and services) and factors of production (capital and labour). Saying the UK wants to restrict free movement of persons but stay in the Single Market makes precisely as much/little sense (and for precisely the same reasons) as would saying “The UK wants to impose tariffs on imports from Germany and France but remain in the Single Market” or “The UK wants to impose capital controls on investment into Italy but remain in the Single Market”. Restricting free movement would, in substance, be withdrawing from the Single Market and hence in substance withdrawing from the EU. The substantive question is unambiguous. The only thing left to consider is the semantic question – whether withdrawing from free movement would be called “withdrawing from the EU” or not. Since the EU is the zone of EU citizenship and EU citizenship means free movement, the answer must be “Yes – the UK would not be in the EU”, though we might perhaps still be in some other form of “Europe”.</p><p>The second reason it is not mere word games is that many schemes for “withdrawing from the European Union” involve continuing to participate in some other form of “Europe” – e.g. the “Norway option” of continuing to be in the European Economic Area. “Out” hasn’t normally meant “no Europe”, merely “exiting the European Union”. But exiting the European Union is precisely what any form of restriction on the free movement of persons entails, by definition.</p></blockquote><p>Past generations can be forgiven for not grasping that free trade meant the end of national sovereignty and the end of the very concept of “the nation”. They did not understand how inexpensive and easy travel would eventually become. But now we know better. And this is the real reason that “nationalism” has been attacked as  an intrinsic and dangerous evil; it is the strong point around which resistance to the universal pillaging of the global elite’s attempt to construct its vision of Eine Welt, Eine Art, Eine Ordnung.</p></div>",
  "content_text": "Free trade advocates are very often dishonest and attempt to claim that while they support the free movement of capital and goods, they do not support the free movement of people. But this is nonsense, because the free movement of people is intrinsically necessary for free trade in both labor and services. Furthermore, observe that\nthe European Union’s “Four Freedoms” are explicit\non this point:\nOne of the “Four Freedoms” of the Single Market is free movement of persons – along with free movement of capital, goods and services. Having a Single Market means having free movement of products (goods and services) and factors of production (capital and labour). Saying the UK wants to restrict free movement of persons but stay in the Single Market makes precisely as much/little sense (and for precisely the same reasons) as would saying “The UK wants to impose tariffs on imports from Germany and France but remain in the Single Market” or “The UK wants to impose capital controls on investment into Italy but remain in the Single Market”. Restricting free movement would, in substance, be withdrawing from the Single Market and hence in substance withdrawing from the EU. The substantive question is unambiguous. The only thing left to consider is the semantic question – whether withdrawing from free movement would be called “withdrawing from the EU” or not. Since the EU is the zone of EU citizenship and EU citizenship means free movement, the answer must be “Yes – the UK would not be in the EU”, though we might perhaps still be in some other form of “Europe”.\nThe second reason it is not mere word games is that many schemes for “withdrawing from the European Union” involve continuing to participate in some other form of “Europe” – e.g. the “Norway option” of continuing to be in the European Economic Area. “Out” hasn’t normally meant “no Europe”, merely “exiting the European Union”. But exiting the European Union is precisely what any form of restriction on the free movement of persons entails, by definition.\nPast generations can be forgiven for not grasping that free trade meant the end of national sovereignty and the end of the very concept of “the nation”. They did not understand how inexpensive and easy travel would eventually become. But now we know better. And this is the real reason that “nationalism” has been attacked as  an intrinsic and dangerous evil; it is the strong point around which resistance to the universal pillaging of the global elite’s attempt to construct its vision of Eine Welt, Eine Art, Eine Ordnung.",
  "tags": [
    "EU",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-06T16:00:00+00:00"
}