{
  "url": "https://voxday.net/2014/10/08/they-dont-get-i/",
  "scraped_at": "2025-12-16T12:30:23.091301",
  "title": "They don’t get it",
  "date_display": "October 8, 2014",
  "date_iso": "2014-10-08T13:00:00+00:00",
  "date_from_url": "2014-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>White Americans around the country are startled to discover that no amount of liberal happy talk and income redistribution is sufficient to make African-Americans want to be like them or even consider them to be part of the same tribe.</p><blockquote><p> Alice Singen had always seen her home town as an integrated, harmonious place. Like many other white residents, she prided herself on staying here even when others began to leave.<br> But since the death of an unarmed black teenager at the hands of a white police officer, some African Americans are calling it segregated and racist. Now Singen has found herself talking in terms of “us” and “them,” “we” and “they.”<br> “I didn’t have any problems with anybody or any color, and all of a sudden it feels like we are being held responsible for something that’s not our fault,” Singen, 70, said as she left Faraci Pizza, a 46-year-old Ferguson business that has become a focal point of racial tension. “I don’t get it.”</br></br></p></blockquote><p>Just because you don’t have any problem with them doesn’t mean that they don’t have any problem with you…. How fortunate it is that no one but white people living in Republican states who fail to parrot the latest SJW dogma can be racist!</p></div>",
  "content_text": "White Americans around the country are startled to discover that no amount of liberal happy talk and income redistribution is sufficient to make African-Americans want to be like them or even consider them to be part of the same tribe.\nAlice Singen had always seen her home town as an integrated, harmonious place. Like many other white residents, she prided herself on staying here even when others began to leave.\nBut since the death of an unarmed black teenager at the hands of a white police officer, some African Americans are calling it segregated and racist. Now Singen has found herself talking in terms of “us” and “them,” “we” and “they.”\n“I didn’t have any problems with anybody or any color, and all of a sudden it feels like we are being held responsible for something that’s not our fault,” Singen, 70, said as she left Faraci Pizza, a 46-year-old Ferguson business that has become a focal point of racial tension. “I don’t get it.”\nJust because you don’t have any problem with them doesn’t mean that they don’t have any problem with you…. How fortunate it is that no one but white people living in Republican states who fail to parrot the latest SJW dogma can be racist!",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-08T12:00:00+00:00"
}