{
  "url": "https://voxday.net/2014/10/31/this-is-how-you-do-i/",
  "scraped_at": "2025-12-16T12:33:18.109071",
  "title": "This is how you do it.",
  "date_display": "October 31, 2014",
  "date_iso": "2014-10-31T21:04:00+00:00",
  "date_from_url": "2014-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we’ve been talking about #GamerGate all day today, I thought we ought to actually talk about games too, which makes this the perfect time to post this article about one of the great, and massively underrated game designers, <a href=\"http://www.polygon.com/features/2013/11/6/4864296/puzzle-quest-steve-fawkner\">Steve Fawkner</a>.</p><blockquote class=\"tr_bq\"><p> Fawkner released his first full game, <em>Quest for the Holy Grail</em>,<br> for the Sinclair Spectrum in 1983. “I didn’t know about publishing or<br> about how to get a game to the store,” he says. “So what I would do is<br> go to a gaming convention and take some copies of <em>Quest for the Holy Grail</em> in a snap-lock bag, with some instructions just printed out.”</br></br></br></p><p>He gave them away to attendees, free of charge, with a message at the<br> start and end of the game requesting players send $5 to fund the next<br> one. He didn’t expect to earn a penny, but Fawkner got 32 checks —<br> earning $160.</br></br></br></p><p>Encouraged by this unexpected success, he developed more games,<br> building up a mailing list of people who liked his work. He’d send them<br> games through the mail, and they’d pay another $5 for each title they<br> enjoyed. “It was extremely, extremely primitive, but it was kind of<br> pizza and beer money when I was a teen.”</br></br></br></br></p><p>Then one day in early 1989 he finished a game that seemed too good to<br> give away, either in snap-lock bags or through snail mail to his small<br> list of previous customers. <em>Warlords</em> combined two games Fawkner had been playing at the time: a strategy video game called <em>Empire</em>,<br> by White Wolf Productions co-founder and former Space Shuttle Program<br> flight designer Mark Baldwin, and a board game by TSR called <em>Dragons of Glory</em>.<br> A turn-based affair, it put you in charge of one or more clans — each<br> possessing heroes and citadels and soldiers — and asked you conquer at<br> least two-thirds of the map.</br></br></br></br></br></br></br></p><p>Fawkner thought maybe he could sell <em>Warlords</em> commercially.<br> “I sent it around to a few publishers,” he says, “and just got told no.<br> They weren’t interested in a game that was 90 percent finished by<br> someone they’d never heard of.” He also sent it to distributors, unaware<br> of the difference between the two. “They certainly weren’t interested<br> in something that didn’t come shrink-wrapped in a box.”</br></br></br></br></br></p><p>Almost ready to give up, Fawkner chased one last lead: Strategic<br> Studies Group (SSG) in Sydney. “They do strategy games,” he remembers a<br> friend saying. “OK, they’re tanks and planes and military kind of<br> strategy, but why don’t you send it to them?” Fawkner shipped a copy<br> off, and initially heard no response.</br></br></br></br></p><p>“Six weeks later, I got a phone call,” he recalls. SSG co-founder Ian<br> Trout confessed that his company had thrown the game out because it had<br> knights and dragons in it, but they gave it another look after his son,<br> Alex Shore, found the <em>Warlords</em> disk and dug in. “I owe Alex a<br> huge debt of gratitude for actually finding my game in the garbage and<br> playing it,” Fawkner says. “Because SSG published it. It reviewed really<br> well, sold I think tens or hundreds of thousands of units and did very<br> nicely.”</br></br></br></br></br></br></br></p></blockquote><p>Steve’s a modest man. <i>Warlords </i>was also CGW’s 1991 Game of the Year. It’s still such a good game that Ender still plays it from time to time when he isn’t playing <i>Fantasy General</i> or <i>Civ5</i>. <i>Warlords 2</i> was even better, although I thought 3 and 4 lost a bit of the plot, being too influenced by the newfound popularity of the RTS genre.</p><p>But then to come back with <i>Puzzle Quest</i>, which started the whole Puzzle RPG craze, was simply amazing. Anyhow, notice that not only did no one ever welcome to the industry with encouragement and snuggles, but despite the massive respect with which he is regarded by veterans throughout the industry, he still has to scratch and claw to find the money to make the games he wants to make.</p><p>I still have my original boxes, manuals, and disks for <i>Warlords</i> here in my library, an honor I convey on only the very best classic games.</p></div>",
  "content_text": "Since we’ve been talking about #GamerGate all day today, I thought we ought to actually talk about games too, which makes this the perfect time to post this article about one of the great, and massively underrated game designers,\nSteve Fawkner\n.\nFawkner released his first full game,\nQuest for the Holy Grail\n,\nfor the Sinclair Spectrum in 1983. “I didn’t know about publishing or\nabout how to get a game to the store,” he says. “So what I would do is\ngo to a gaming convention and take some copies of\nQuest for the Holy Grail\nin a snap-lock bag, with some instructions just printed out.”\nHe gave them away to attendees, free of charge, with a message at the\nstart and end of the game requesting players send $5 to fund the next\none. He didn’t expect to earn a penny, but Fawkner got 32 checks —\nearning $160.\nEncouraged by this unexpected success, he developed more games,\nbuilding up a mailing list of people who liked his work. He’d send them\ngames through the mail, and they’d pay another $5 for each title they\nenjoyed. “It was extremely, extremely primitive, but it was kind of\npizza and beer money when I was a teen.”\nThen one day in early 1989 he finished a game that seemed too good to\ngive away, either in snap-lock bags or through snail mail to his small\nlist of previous customers.\nWarlords\ncombined two games Fawkner had been playing at the time: a strategy video game called\nEmpire\n,\nby White Wolf Productions co-founder and former Space Shuttle Program\nflight designer Mark Baldwin, and a board game by TSR called\nDragons of Glory\n.\nA turn-based affair, it put you in charge of one or more clans — each\npossessing heroes and citadels and soldiers — and asked you conquer at\nleast two-thirds of the map.\nFawkner thought maybe he could sell\nWarlords\ncommercially.\n“I sent it around to a few publishers,” he says, “and just got told no.\nThey weren’t interested in a game that was 90 percent finished by\nsomeone they’d never heard of.” He also sent it to distributors, unaware\nof the difference between the two. “They certainly weren’t interested\nin something that didn’t come shrink-wrapped in a box.”\nAlmost ready to give up, Fawkner chased one last lead: Strategic\nStudies Group (SSG) in Sydney. “They do strategy games,” he remembers a\nfriend saying. “OK, they’re tanks and planes and military kind of\nstrategy, but why don’t you send it to them?” Fawkner shipped a copy\noff, and initially heard no response.\n“Six weeks later, I got a phone call,” he recalls. SSG co-founder Ian\nTrout confessed that his company had thrown the game out because it had\nknights and dragons in it, but they gave it another look after his son,\nAlex Shore, found the\nWarlords\ndisk and dug in. “I owe Alex a\nhuge debt of gratitude for actually finding my game in the garbage and\nplaying it,” Fawkner says. “Because SSG published it. It reviewed really\nwell, sold I think tens or hundreds of thousands of units and did very\nnicely.”\nSteve’s a modest man.\nWarlords\nwas also CGW’s 1991 Game of the Year. It’s still such a good game that Ender still plays it from time to time when he isn’t playing\nFantasy General\nor\nCiv5\n.\nWarlords 2\nwas even better, although I thought 3 and 4 lost a bit of the plot, being too influenced by the newfound popularity of the RTS genre.\nBut then to come back with\nPuzzle Quest\n, which started the whole Puzzle RPG craze, was simply amazing. Anyhow, notice that not only did no one ever welcome to the industry with encouragement and snuggles, but despite the massive respect with which he is regarded by veterans throughout the industry, he still has to scratch and claw to find the money to make the games he wants to make.\nI still have my original boxes, manuals, and disks for\nWarlords\nhere in my library, an honor I convey on only the very best classic games.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-31T21:04:00+00:00"
}