{
  "url": "https://voxday.net/2014/10/17/time-to-get-hardcore/",
  "scraped_at": "2025-12-16T12:31:28.636897",
  "title": "Time to get hardcore",
  "date_display": "October 17, 2014",
  "date_iso": "2014-10-17T23:40:00+00:00",
  "date_from_url": "2014-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Random idea. Ender is nearly done with his rework of my original <i><a href=\"http://www.vassalengine.org/wiki/Module:Fifth_Frontier_War\">Fifth Frontier War</a></i> module and we’re gearing up to play it. Now, I’m wondering if there is anyone here besides the game’s designer who has significant experience of it and would care to serve as a rules catcher, given that the chances we are going to get a few things wrong on this second attempt are all but guaranteed. (The first one went down in flames when we wanted to use the table for ASL after getting things mostly set up.)</p><p>As a general rule, we never try to fix rules that we miss, but instead seek to play properly from the point at which the mistake is noticed. I’m going to post the turns here for the edification of the three or four readers who are actually interested, and I figure that we may as well take advantage of any real FFW experience. Corrections are welcome, so long as it’s kept in mind that this is a first playing.</p><p>Big Chilly and I set the game up several times when we were in high school, but we never got beyond plotting the initial turn because it took so long to setup and we always ran out of weekend. That’s one of the things Ender has improved in the module; the standard setups are already in place when you start. The other nice thing about having it on the computer, of course, is that it means we can use the projector….</p><p>Sure, there is Ebola and mass immigration and the general decline and fall of Western civilization to take into account, but the simple fact is that this is occasionally an awesome time in which to be alive. <i>Fifth Frontier War</i> on a five-meter wide board on the wall… and no need to clean up a game in progress? And to think I once thought that playing <i>Wing Commander</i> on a 50-inch screen was the pinnacle of techno-civilization!</p></div>",
  "content_text": "Random idea. Ender is nearly done with his rework of my original\nFifth Frontier War\nmodule and we’re gearing up to play it. Now, I’m wondering if there is anyone here besides the game’s designer who has significant experience of it and would care to serve as a rules catcher, given that the chances we are going to get a few things wrong on this second attempt are all but guaranteed. (The first one went down in flames when we wanted to use the table for ASL after getting things mostly set up.)\nAs a general rule, we never try to fix rules that we miss, but instead seek to play properly from the point at which the mistake is noticed. I’m going to post the turns here for the edification of the three or four readers who are actually interested, and I figure that we may as well take advantage of any real FFW experience. Corrections are welcome, so long as it’s kept in mind that this is a first playing.\nBig Chilly and I set the game up several times when we were in high school, but we never got beyond plotting the initial turn because it took so long to setup and we always ran out of weekend. That’s one of the things Ender has improved in the module; the standard setups are already in place when you start. The other nice thing about having it on the computer, of course, is that it means we can use the projector….\nSure, there is Ebola and mass immigration and the general decline and fall of Western civilization to take into account, but the simple fact is that this is occasionally an awesome time in which to be alive.\nFifth Frontier War\non a five-meter wide board on the wall… and no need to clean up a game in progress? And to think I once thought that playing\nWing Commander\non a 50-inch screen was the pinnacle of techno-civilization!",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-17T22:40:00+00:00"
}