{
  "url": "https://voxday.net/2014/10/19/trolls-beware/",
  "scraped_at": "2025-12-16T12:31:37.467235",
  "title": "Trolls beware",
  "date_display": "October 19, 2014",
  "date_iso": "2014-10-19T09:13:00+00:00",
  "date_from_url": "2014-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andrew Marston, among others, would appear to be heading for some serious jail time <a href=\"http://www.telegraph.co.uk/news/celebritynews/11172231/Internet-trolls-to-face-two-years-in-jail.html\">if he doesn’t change his ways</a>:</p><blockquote class=\"tr_bq\"><p> Internet trolls will face up to two years in jail under tough new laws proposed by Justice Secretary Chris Grayling following a number of high profile cases. The sentence for internet abuse is presently six months but under the plans Mr Grayling is proposing to take a hard stance and quadruple it.</p></blockquote><p>As Spacebunny pointed out, although this law is nominally intended to protect women, the reality is that it’s going to affect a lot more women than anyone suspects. I would encourage every black knight to be sure to log and report all harassment from female trolls. Because they expect men to be unwilling to hold them accountable for their actions, they’ll set themselves up for prosecution more readily than their male counterparts.</p><p>Speaking of trolls, I already have large collections of Andrew’s comments as well as smaller ones belonging to Phoenician and Tad. Trolls never seem to realize that once you have as few as three examples of their posting, all one has to do is to call their ISP, or alternatively, Google, to correctly identify them. Call yourself whatever you want, hide your IP address with Tor, it makes no difference. As long as Point A and Point Z are known, everything else in between is irrelevant.</p><p>I also find it a bit ironic that some people have tried to label me a troll in the past when I have never trolled anyone anywhere. I have no need to do so. If I wish to express my opinion about someone, I will do so here, in the open, where everyone can see it.</p><p>On what one hopes is a completely unrelated note, you can now access <a href=\"http://re.co/voxday/books\">my book recos</a> on Recommend without registering or signing in. I’ve also added a link on the left sidebar, under Voxology, if you wish to keep up with it. I’ll be adding one or two books from my 2014 reading list every day, then I’ll probably start in on the 2013 books. If you’re on Recommend, note that you can create a list and then designate it for public view in Edit/Settings. It’s a new feature, so it’s not exactly user-friendly yet, but as you can see, it is functional.</p></div>",
  "content_text": "Andrew Marston, among others, would appear to be heading for some serious jail time\nif he doesn’t change his ways\n:\nInternet trolls will face up to two years in jail under tough new laws proposed by Justice Secretary Chris Grayling following a number of high profile cases. The sentence for internet abuse is presently six months but under the plans Mr Grayling is proposing to take a hard stance and quadruple it.\nAs Spacebunny pointed out, although this law is nominally intended to protect women, the reality is that it’s going to affect a lot more women than anyone suspects. I would encourage every black knight to be sure to log and report all harassment from female trolls. Because they expect men to be unwilling to hold them accountable for their actions, they’ll set themselves up for prosecution more readily than their male counterparts.\nSpeaking of trolls, I already have large collections of Andrew’s comments as well as smaller ones belonging to Phoenician and Tad. Trolls never seem to realize that once you have as few as three examples of their posting, all one has to do is to call their ISP, or alternatively, Google, to correctly identify them. Call yourself whatever you want, hide your IP address with Tor, it makes no difference. As long as Point A and Point Z are known, everything else in between is irrelevant.\nI also find it a bit ironic that some people have tried to label me a troll in the past when I have never trolled anyone anywhere. I have no need to do so. If I wish to express my opinion about someone, I will do so here, in the open, where everyone can see it.\nOn what one hopes is a completely unrelated note, you can now access\nmy book recos\non Recommend without registering or signing in. I’ve also added a link on the left sidebar, under Voxology, if you wish to keep up with it. I’ll be adding one or two books from my 2014 reading list every day, then I’ll probably start in on the 2013 books. If you’re on Recommend, note that you can create a list and then designate it for public view in Edit/Settings. It’s a new feature, so it’s not exactly user-friendly yet, but as you can see, it is functional.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-19T08:13:00+00:00"
}