{
  "url": "https://voxday.net/2014/10/27/what-cultural-marxism-is-and-isn/",
  "scraped_at": "2025-12-16T12:32:34.687942",
  "title": "What “Cultural Marxism” is and isn’t",
  "date_display": "October 27, 2014",
  "date_iso": "2014-10-27T12:54:00+00:00",
  "date_from_url": "2014-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is very relevant today, since it is not only an excerpt from <a href=\"http://www.castaliahouse.com/downloads/on-war-the-collected-columns-of-william-s-lind-2003-2009/\">William S. Lind’s <b><i>ON WAR</i></b></a>, which is being officially released later today by Castalia House, but a topic that has been the subject of some debate among GamerGaters opposed to the pinkshirts’ attempts to transform the game industry in a conventionally cultural marxist manner.</p><p>Most people wrongly understand cultural Marxism to mean: “cultural efforts to establish an actual global Marxist<br> system”. This is not correct. Marxism is a political and economic system that has been repeatedly refined since Karl Marx laid down his pen. It might be a little less confusing to describe it as “cultural Marxianism”, but that’s being excessively pedantic. The matter is readily clarified by the essay entitled “What is Political Correctness”, as the father of 4th Generation War theory explains the historical roots of political correctness in cultural Marxism:</br></p><blockquote class=\"tr_bq\"><p> Political Correctness is cultural Marxism, Marxism translated from economic into cultural terms. Its history goes back not to the 1960s but to World War I. Before 1914, Marxist theory said that if a major war broke out in Europe, the workers of every country would join together in a revolution to overthrow capitalism and replace it with international socialism. But when war came, that did not happen. What had gone wrong?</p><p>Two Marxist theorists, Antonio Gramsci in Italy and Georg Lukacs in Hungary, independently came up with the same answer. They said that Western culture and the Christian religion had so blinded the working class to its true Marxian class interests that Communism was impossible in the West until traditional culture and Christianity were destroyed. When Lukacs became Deputy Commissar for Culture in the short-lived Bela Kun Bolshevik government in Hungary in 1919, one of his first acts was introducing sex education into the Hungarian schools. He knew that destroying traditional sexual morals would be a major step toward destroying Western culture itself.</p><p>Lukacs became a major influence on a Marxist think tank established in 1923 at Frankfurt University in Germany, the Institute for Social Research, commonly known as the Frankfurt School. When Max Horkheimer took over as director of the Frankfurt School in 1930, he set about in earnest to do Lukacs’ bidding by translating Marxism from economic into cultural terms. Other Frankfurt School members devoted to this intellectually difficult task were Theodor Adorno, Eric Fromm, Wilhelm Reich and Herbert Marcuse. Theirs was not the Marxism of the Soviet Union—Moscow considered them heretics—but it was Marxism nonetheless.</p><p>The Frankfurt School’s key to success was crossing Marx with Freud. They argued that just as under capitalism everyone lived in a state of economic oppression, so under Western culture people lived under psychological repression. From psychology they also drew the technique of psychological conditioning. Want to “normalize” homosexuality? Just show television program after television program where the only normal-seeming white male is homosexual.</p><p>In 1933 the Frankfurt School moved from Germany to New York City. There, its products included “critical theory,” which demands constant, destructive criticism of every traditional social institution, starting with the family. It also created a series of “studies in prejudice,” culminating in Adorno’s immensely influential book, <i>The Authoritarian Personality,</i> which argued that anyone who defends traditional culture is a “fascist” and also mentally ill. That is why anyone who now dares defy PC gets sent to sensitivity training, which is psychological conditioning designed to produce submission.</p></blockquote><p>In other words, it is not a tool used to establish Marxism, but rather a perversion of Marxism aimed at the culture rather than the political economy. Anyone attempting to understand the pinkshirts of #GamerHate must first understand that cultural Marxism is real and that it is the underlying basis for the SJWs’ current attack on the game industry. And it is worth pointing out that any #GamerGaters attempting to defeat them would do very well to understand that they are presently engaging in a 4GW struggle, and that in that struggle, they are the insurgents.</p></div>",
  "content_text": "This is very relevant today, since it is not only an excerpt from\nWilliam S. Lind’s\nON WAR\n, which is being officially released later today by Castalia House, but a topic that has been the subject of some debate among GamerGaters opposed to the pinkshirts’ attempts to transform the game industry in a conventionally cultural marxist manner.\nMost people wrongly understand cultural Marxism to mean: “cultural efforts to establish an actual global Marxist\nsystem”. This is not correct. Marxism is a political and economic system that has been repeatedly refined since Karl Marx laid down his pen. It might be a little less confusing to describe it as “cultural Marxianism”, but that’s being excessively pedantic. The matter is readily clarified by the essay entitled “What is Political Correctness”, as the father of 4th Generation War theory explains the historical roots of political correctness in cultural Marxism:\nPolitical Correctness is cultural Marxism, Marxism translated from economic into cultural terms. Its history goes back not to the 1960s but to World War I. Before 1914, Marxist theory said that if a major war broke out in Europe, the workers of every country would join together in a revolution to overthrow capitalism and replace it with international socialism. But when war came, that did not happen. What had gone wrong?\nTwo Marxist theorists, Antonio Gramsci in Italy and Georg Lukacs in Hungary, independently came up with the same answer. They said that Western culture and the Christian religion had so blinded the working class to its true Marxian class interests that Communism was impossible in the West until traditional culture and Christianity were destroyed. When Lukacs became Deputy Commissar for Culture in the short-lived Bela Kun Bolshevik government in Hungary in 1919, one of his first acts was introducing sex education into the Hungarian schools. He knew that destroying traditional sexual morals would be a major step toward destroying Western culture itself.\nLukacs became a major influence on a Marxist think tank established in 1923 at Frankfurt University in Germany, the Institute for Social Research, commonly known as the Frankfurt School. When Max Horkheimer took over as director of the Frankfurt School in 1930, he set about in earnest to do Lukacs’ bidding by translating Marxism from economic into cultural terms. Other Frankfurt School members devoted to this intellectually difficult task were Theodor Adorno, Eric Fromm, Wilhelm Reich and Herbert Marcuse. Theirs was not the Marxism of the Soviet Union—Moscow considered them heretics—but it was Marxism nonetheless.\nThe Frankfurt School’s key to success was crossing Marx with Freud. They argued that just as under capitalism everyone lived in a state of economic oppression, so under Western culture people lived under psychological repression. From psychology they also drew the technique of psychological conditioning. Want to “normalize” homosexuality? Just show television program after television program where the only normal-seeming white male is homosexual.\nIn 1933 the Frankfurt School moved from Germany to New York City. There, its products included “critical theory,” which demands constant, destructive criticism of every traditional social institution, starting with the family. It also created a series of “studies in prejudice,” culminating in Adorno’s immensely influential book,\nThe Authoritarian Personality,\nwhich argued that anyone who defends traditional culture is a “fascist” and also mentally ill. That is why anyone who now dares defy PC gets sent to sensitivity training, which is psychological conditioning designed to produce submission.\nIn other words, it is not a tool used to establish Marxism, but rather a perversion of Marxism aimed at the culture rather than the political economy. Anyone attempting to understand the pinkshirts of #GamerHate must first understand that cultural Marxism is real and that it is the underlying basis for the SJWs’ current attack on the game industry. And it is worth pointing out that any #GamerGaters attempting to defeat them would do very well to understand that they are presently engaging in a 4GW struggle, and that in that struggle, they are the insurgents.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-10-27T12:54:00+00:00"
}