{
  "url": "https://voxday.net/2014/10/13/women-in-game-industry/",
  "scraped_at": "2025-12-16T12:30:58.260311",
  "title": "Women in the game industry",
  "date_display": "October 13, 2014",
  "date_iso": "2014-10-13T15:09:00+00:00",
  "date_from_url": "2014-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A civil exchange with a genuinely curious #GamerGate moderate who asks questions rather than flings accusations:</p><blockquote class=\"tr_bq\"><p> Vox Day ‏@voxday<br> As the game media grows, the probability of it being co-opted by women who want to make it all about their vaginas approaches 1. #GamerGate</br></p><p>René Dreadsteves ‏@robobeau 2h2 hours ago<br> I understand where you’re coming from, but that’s still a bit of a harsh generalization.</br></p><p>Vox Day ‏@voxday<br> Harsh or not, it is observably true. Most have zero interest in games, they just want to run the “insufficient vaginas” routine.</br></p><p>René Dreadsteves ‏@robobeau<br> A lot definitely do, but a lot simply want better representation, so I think it’s harsh to lump them all together.</br></p><p>Vox Day ‏@voxday<br> What is “better representation”? Precisely how would more vaginas being represented in Call of Duty or WOW improve them?</br></p><p>René Dreadsteves ‏@robobeau<br> More support for female developers, which is way harder than it sounds given the AAA game industry</br></p><p>Vox Day ‏@voxday<br> What “support” means is “someone to do the work for me”. Never happening. Game dev is too lean, especially at the entry points.</br></p><p>René Dreadsteves ‏@robobeau<br> Let me ask this: In your experience in game development, do you feel females have been treated equally in terms of opportunities?</br></p><p>Vox Day ‏@voxday<br> Yes. In fact, I’ve seen game companies bend over backward to recruit them. They seldom apply and usually can’t take the hours.</br></p><p>René Dreadsteves ‏@robobeau<br> Except female game designers are genuinely trying to stand as equals in the game industry.</br></p><p>Vox Day ‏@voxday<br> No, they’re not. They’re crying that no one wants to play their games. Roberta Williams just designed great games.</br></p><p>René Dreadsteves ‏@robobeau<br> Thanks for the reply. From an outsider’s perspective it’s really hard to tell one way or another.</br></p></blockquote><p>I should add that when I was running a game development house, with multiple million+ development contracts with companies including Intel and Sega, the grand total of female responses to our various ads over a period of five years was one. That was an artist who responded to an ad for 2D/3D artists at MCAD and we did not even consider hiring her after interviewing her, viewing her portfolio, and learning that she was primarily interested in abstract art.</p><p>The reality is that the game industry is absolutely desperate for talent. But it requires real talent and an ability to deliver quickly and reliably, it is no place for anyone who is even slightly inclined to lean on others to help them do their job. There are women who can hack it. Roberta Williams was, and is, very well-respected as a game designer, for example. Scorpia was the single most respected RPG reviewer in the industry for years. Charlotte Panther was the News Editor at CGW; she was cute but she was also competent. <a href=\"http://www.gamasutra.com/blogs/ArinnDembo/20100812/87847/Gamazon_Seven_Questions_for_Scorpia.php\">Consider Scorpia’s opinion</a> on the matter:</p><p><i>Question: Do you feel you have experienced significant discrimination as a female professional in the reviewing business?</i></p><p><b>Answer: None whatsoever. After considerable thought, I can’t come up with any incident of discrimination.</b></p></div>",
  "content_text": "A civil exchange with a genuinely curious #GamerGate moderate who asks questions rather than flings accusations:\nVox Day ‏@voxday\nAs the game media grows, the probability of it being co-opted by women who want to make it all about their vaginas approaches 1. #GamerGate\nRené Dreadsteves ‏@robobeau 2h2 hours ago\nI understand where you’re coming from, but that’s still a bit of a harsh generalization.\nVox Day ‏@voxday\nHarsh or not, it is observably true. Most have zero interest in games, they just want to run the “insufficient vaginas” routine.\nRené Dreadsteves ‏@robobeau\nA lot definitely do, but a lot simply want better representation, so I think it’s harsh to lump them all together.\nVox Day ‏@voxday\nWhat is “better representation”? Precisely how would more vaginas being represented in Call of Duty or WOW improve them?\nRené Dreadsteves ‏@robobeau\nMore support for female developers, which is way harder than it sounds given the AAA game industry\nVox Day ‏@voxday\nWhat “support” means is “someone to do the work for me”. Never happening. Game dev is too lean, especially at the entry points.\nRené Dreadsteves ‏@robobeau\nLet me ask this: In your experience in game development, do you feel females have been treated equally in terms of opportunities?\nVox Day ‏@voxday\nYes. In fact, I’ve seen game companies bend over backward to recruit them. They seldom apply and usually can’t take the hours.\nRené Dreadsteves ‏@robobeau\nExcept female game designers are genuinely trying to stand as equals in the game industry.\nVox Day ‏@voxday\nNo, they’re not. They’re crying that no one wants to play their games. Roberta Williams just designed great games.\nRené Dreadsteves ‏@robobeau\nThanks for the reply. From an outsider’s perspective it’s really hard to tell one way or another.\nI should add that when I was running a game development house, with multiple million+ development contracts with companies including Intel and Sega, the grand total of female responses to our various ads over a period of five years was one. That was an artist who responded to an ad for 2D/3D artists at MCAD and we did not even consider hiring her after interviewing her, viewing her portfolio, and learning that she was primarily interested in abstract art.\nThe reality is that the game industry is absolutely desperate for talent. But it requires real talent and an ability to deliver quickly and reliably, it is no place for anyone who is even slightly inclined to lean on others to help them do their job. There are women who can hack it. Roberta Williams was, and is, very well-respected as a game designer, for example. Scorpia was the single most respected RPG reviewer in the industry for years. Charlotte Panther was the News Editor at CGW; she was cute but she was also competent.\nConsider Scorpia’s opinion\non the matter:\nQuestion: Do you feel you have experienced significant discrimination as a female professional in the reviewing business?\nAnswer: None whatsoever. After considerable thought, I can’t come up with any incident of discrimination.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-10-13T14:09:00+00:00"
}