{
  "url": "https://voxday.net/2024/11/20/albert-einstein-plagiarist-and-fraud/",
  "scraped_at": "2026-01-08T19:30:11.606401",
  "title": "Albert Einstein, Plagiarist and Fraud",
  "date_display": "November 20, 2024",
  "date_iso": "2024-11-20T15:00:00+00:00",
  "date_from_url": "2024-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Physicist Hans Schantz begins his methodical demolition of the Einstein myth with by demonstrating that <a href=\"https://aetherczar.substack.com/p/521-origins-of-relativity\">Albert Einstein was an incompetent plagiarist</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There were many milestones along the road to E = mc², and I’ve merely presented a summary of those I thought most important. Who first suggested matter-energy equivalence? Preston in 1875. Or the relativistic nature of energy? Newcomb in 1889. A correctly derived result in a limited case? Poincaré in 1900. The actual formula? De Pretto in 1903. The correct result in a different limited case and arguing it should be generalized outside the context of electromagnetic energy? Einstein in 1905. The correct result rigorously proven to be generally applicable? That was von Laue in 1911. Einstein’s work was an important milestone but it was neither the only one nor the final conclusive one. <em>And Einstein cited none of these predecessors.</em> As Ohanian notes, “Oddly, even today von Laue’s general proof of the E = mc² relation is not widely known, and it is rarely mentioned in physics textbooks, which mostly content themselves with some handwaving arguments about E = mc² and some version of Einstein’s defective proofs” [[xxx]].</p><p>A postscript, courtesy of Ohanian [[xxxi]]: in 1912, Einstein adapted von Laue’s proof for an omnibus volume on recent advances in physics. The war delayed publication until 1924. Einstein’s contribution was not included, because he refused the publisher’s request to update it. Einstein reused his submission in a 1914 paper and in his Princeton lectures in 1921, published later that year as The Meaning of Relativity. Nowhere did he acknowledge von Laue. What’s more, Einstein’s paraphrase of von Laue included what Ohanian characterized as “the zaniest mistake in his entire oeuvre, an absolutely nonsensical mistake.”</p><p>We have a word for Einstein’s pattern of behavior. That word is “plagiarism.” Christopher Jon Bjerknes (1965– ) expounds at length upon the misdeeds of “the incorrigible plagiarist” [[xxxii]]. By passing off the work of others as his own and without acknowledgement, Einstein enhanced his own reputation for genius while denigrating the contributions of his colleagues.</p></blockquote><p>Perhaps the most amusing thing in that passage is the revelation that Einstein was not only a plagiarist, but that he didn’t even understand what he was plagiarizing. I wouldn’t be surprised if it was eventually discovered that Einstein wasn’t even Mensa material. Although it’s absolutely no surprise that Einstein wasn’t anywhere nearly as intelligent as he is commonly supposed to have been, since his purported intelligence is one of the more significant pillars in <a href=\"https://voxday.net/2018/04/29/the-myth-of-jewish-intelligence/\">the specious myth of Jewish high intelligence</a>.</p><p><em><a href=\"https://socialgalactic.com/micropost/7e667bc7-86db-485a-bd69-9a6f71148776\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Physicist Hans Schantz begins his methodical demolition of the Einstein myth with by demonstrating that\nAlbert Einstein was an incompetent plagiarist\n.\nThere were many milestones along the road to E = mc², and I’ve merely presented a summary of those I thought most important. Who first suggested matter-energy equivalence? Preston in 1875. Or the relativistic nature of energy? Newcomb in 1889. A correctly derived result in a limited case? Poincaré in 1900. The actual formula? De Pretto in 1903. The correct result in a different limited case and arguing it should be generalized outside the context of electromagnetic energy? Einstein in 1905. The correct result rigorously proven to be generally applicable? That was von Laue in 1911. Einstein’s work was an important milestone but it was neither the only one nor the final conclusive one.\nAnd Einstein cited none of these predecessors.\nAs Ohanian notes, “Oddly, even today von Laue’s general proof of the E = mc² relation is not widely known, and it is rarely mentioned in physics textbooks, which mostly content themselves with some handwaving arguments about E = mc² and some version of Einstein’s defective proofs” [[xxx]].\nA postscript, courtesy of Ohanian [[xxxi]]: in 1912, Einstein adapted von Laue’s proof for an omnibus volume on recent advances in physics. The war delayed publication until 1924. Einstein’s contribution was not included, because he refused the publisher’s request to update it. Einstein reused his submission in a 1914 paper and in his Princeton lectures in 1921, published later that year as The Meaning of Relativity. Nowhere did he acknowledge von Laue. What’s more, Einstein’s paraphrase of von Laue included what Ohanian characterized as “the zaniest mistake in his entire oeuvre, an absolutely nonsensical mistake.”\nWe have a word for Einstein’s pattern of behavior. That word is “plagiarism.” Christopher Jon Bjerknes (1965– ) expounds at length upon the misdeeds of “the incorrigible plagiarist” [[xxxii]]. By passing off the work of others as his own and without acknowledgement, Einstein enhanced his own reputation for genius while denigrating the contributions of his colleagues.\nPerhaps the most amusing thing in that passage is the revelation that Einstein was not only a plagiarist, but that he didn’t even understand what he was plagiarizing. I wouldn’t be surprised if it was eventually discovered that Einstein wasn’t even Mensa material. Although it’s absolutely no surprise that Einstein wasn’t anywhere nearly as intelligent as he is commonly supposed to have been, since his purported intelligence is one of the more significant pillars in\nthe specious myth of Jewish high intelligence\n.\nDISCUSS ON SG",
  "tags": [
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-20T15:00:00+00:00"
}