{
  "url": "https://voxday.net/2024/11/24/complete-detachment-from-reality/",
  "scraped_at": "2026-01-08T19:30:34.317676",
  "title": "Complete Detachment From Reality",
  "date_display": "November 24, 2024",
  "date_iso": "2024-11-24T11:59:42+00:00",
  "date_from_url": "2024-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A French regulator has ruled that since unborn children are not “living beings” <a href=\"https://europeanconservative.com/articles/news/french-tv-channel-fined-for-calling-abortion-the-worlds-leading-cause-of-death/\">it is forbidden to state that abortion can be a cause of death</a> on the airwaves. Even though abortion is observably the world’s leading cause of death among <em>homo sapiens sapiens</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The French media regulator has fined the conservative channel CNews €100,000 for, during a Catholic programme, saying that abortion is the world’s leading cause of death. The episode reveals the extent to which the debate on abortion is deadlocked in France.</p><p>In February 2024, presenter Aymeric Pourbaix, during the Catholic programme “En quête d’esprit,” broadcast every Sunday on the conservative channel CNews, showed an infographic on the causes of death, ranking abortion as the leading cause, with 73 million deaths each year worldwide. That translates to 52% of annual deaths, far ahead of cancer (10 million) and smoking (6.2 million).</p><p>The journalist’s comments sparked a wave of indignation in the mainstream press, on the grounds that abortion cannot be considered a “cause of death” because the foetus should not be considered a living being… In the weekly magazine <em>Valeurs Actuelle</em>s, Jean-Marie Le Méné, head of the<em> Fondation Jérôme Lejeune</em>, denounced the totalitarian nature of this decision, which proves the denial of reality that surrounds the practice of abortion in France:</p><p>Arcom writes: “Abortion cannot be presented as a cause of death.” Equating an aborted child with a dead person would make abortion a homicidal act. So that abortion can be carried out with a clear conscience, it is forbidden to say that abortion takes away life. Otherwise the keystone of the system collapses. But who believes this fiction?</p><p>He adds: “Abortion, the leading cause of death in the world, is unfortunately a fact, not an opinion.”</p></blockquote><p>This decision demonstrates Clown World’s complete detachment from science, medicine, law, and reality. If unborn children were not “living beings” then no doctor would ever tell a woman that her pre-natal child had died in the womb. In fact, it would be impossible for any baby to die in the womb if the pre-natal baby was not a living being.</p><p>Never buy into the false dichotomy of something being EITHER evil or stupid. In most cases, evil is stupid, because it is intrinsically detached from, and actively opposed to, God, Nature, scientage, logic, reason, and observable reality.</p><p>The fact that abortion is undeniably the current leading cause of death for human beings is why I describe feminism as one of the very worst ideologies in human history, worse than Communism, worse than fascism, and worse than National Socialism. Those who have supported feminism in any way should reflect about the fact that future generations will regard them as having been more evil, and more horrifically stupid, than they now regard those who supported the historical Communists, fascists, and Nazis.</p><p><em><a href=\"https://socialgalactic.com/micropost/e0cade70-280e-4cd6-a2e7-9633fc807e42\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A French regulator has ruled that since unborn children are not “living beings”\nit is forbidden to state that abortion can be a cause of death\non the airwaves. Even though abortion is observably the world’s leading cause of death among\nhomo sapiens sapiens\n.\nThe French media regulator has fined the conservative channel CNews €100,000 for, during a Catholic programme, saying that abortion is the world’s leading cause of death. The episode reveals the extent to which the debate on abortion is deadlocked in France.\nIn February 2024, presenter Aymeric Pourbaix, during the Catholic programme “En quête d’esprit,” broadcast every Sunday on the conservative channel CNews, showed an infographic on the causes of death, ranking abortion as the leading cause, with 73 million deaths each year worldwide. That translates to 52% of annual deaths, far ahead of cancer (10 million) and smoking (6.2 million).\nThe journalist’s comments sparked a wave of indignation in the mainstream press, on the grounds that abortion cannot be considered a “cause of death” because the foetus should not be considered a living being… In the weekly magazine\nValeurs Actuelle\ns, Jean-Marie Le Méné, head of the\nFondation Jérôme Lejeune\n, denounced the totalitarian nature of this decision, which proves the denial of reality that surrounds the practice of abortion in France:\nArcom writes: “Abortion cannot be presented as a cause of death.” Equating an aborted child with a dead person would make abortion a homicidal act. So that abortion can be carried out with a clear conscience, it is forbidden to say that abortion takes away life. Otherwise the keystone of the system collapses. But who believes this fiction?\nHe adds: “Abortion, the leading cause of death in the world, is unfortunately a fact, not an opinion.”\nThis decision demonstrates Clown World’s complete detachment from science, medicine, law, and reality. If unborn children were not “living beings” then no doctor would ever tell a woman that her pre-natal child had died in the womb. In fact, it would be impossible for any baby to die in the womb if the pre-natal baby was not a living being.\nNever buy into the false dichotomy of something being EITHER evil or stupid. In most cases, evil is stupid, because it is intrinsically detached from, and actively opposed to, God, Nature, scientage, logic, reason, and observable reality.\nThe fact that abortion is undeniably the current leading cause of death for human beings is why I describe feminism as one of the very worst ideologies in human history, worse than Communism, worse than fascism, and worse than National Socialism. Those who have supported feminism in any way should reflect about the fact that future generations will regard them as having been more evil, and more horrifically stupid, than they now regard those who supported the historical Communists, fascists, and Nazis.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "EU",
    "media",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-24T11:59:47+00:00"
}