{
  "url": "https://voxday.net/2024/11/19/cylons-are-real/",
  "scraped_at": "2026-01-08T19:30:06.053971",
  "title": "Cylons are Real",
  "date_display": "November 19, 2024",
  "date_iso": "2024-11-19T10:52:50+00:00",
  "date_from_url": "2024-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently UFOs are neither aliens nor demons as so many people have theorized. They’re robots.</p><p><em>Canada has unveiled the first-ever image of the UFO downed during a joint US-Canada mission in February 2023. The grainy photo shows a circular, white object shot by a US Air Force F-22 fighter jet.</em></p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-65378\" decoding=\"async\" fetchpriority=\"high\" height=\"360\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/11/image-33.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/11/image-33.png 512w, https://voxday.net/wp-content/uploads/2024/11/image-33-300x211.png 300w\" width=\"512\"/></figure></div><p>I’ve seen enough of the original <em>Battlestar Galactica</em> to know what that is. And that’s a Cylon fighter. And it’s not just a weather balloon, because weather balloons don’t move the way the former Advanced Aerospace Threat Identification Program director, Luis Elizondo, <a href=\"https://www.outkick.com/culture/unidentified-anomalous-phenomena-exposing-the-truth-hearing-nuclear-sites\">describes</a>.</p><p><em>“Comparison, our best technology, the F-16, which is one… It’s an older platform, but one of our most highly maneuverable aircraft, manned aircraft made by General Dynamics, can perform about 17 or 18 G-forces before you start having structural failure, meaning that the airframe begins to disintegrate while you’re flying. The vehicles we’re talking about are performing in excess of 1000, 2000, 3000 Gs.”</em></p><p>Since we know for certain that evolution by natural selection didn’t happen because <a href=\"https://voxday.net/2019/02/07/maximal-mutations/\">it mathematically couldn’t happen</a>, that means that all of the historical anomalies both architectural and genetic are necessarily indicative of human history being far more complicated, and involving interaction with far more technologically advanced beings from either a) this planet, b) other planets, c) other dimensions, or d) all of the above. I consider (d) to be the most likely option, since we already know that The Empire of Lies is inhuman, evil, and spiritual in nature.</p><p>Note that the attempt to assume a false dichotomy between aliens and demons is nothing more than the intrinsic limitations of binary thinkers struggling to grasp the full scope of possibilities. And far from disproving or casting any doubt on Christianity, it supports the details of the Bible that specifically describes multiple material interactions between Adamic humanity and other creatures; the idea that spiritual creatures could successfully breed with humanity and produce the Nephilim entirely contradicts the materialist concept of evolution by natural selection or anything else, and should have been our first clue that Darwinian and neo-Darwinian theories were complete non-starters.</p><p><em><a href=\"https://socialgalactic.com/micropost/d2a892a4-4c32-4202-a976-fc5cc3f54716\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Apparently UFOs are neither aliens nor demons as so many people have theorized. They’re robots.\nCanada has unveiled the first-ever image of the UFO downed during a joint US-Canada mission in February 2023. The grainy photo shows a circular, white object shot by a US Air Force F-22 fighter jet.\nI’ve seen enough of the original\nBattlestar Galactica\nto know what that is. And that’s a Cylon fighter. And it’s not just a weather balloon, because weather balloons don’t move the way the former Advanced Aerospace Threat Identification Program director, Luis Elizondo,\ndescribes\n.\n“Comparison, our best technology, the F-16, which is one… It’s an older platform, but one of our most highly maneuverable aircraft, manned aircraft made by General Dynamics, can perform about 17 or 18 G-forces before you start having structural failure, meaning that the airframe begins to disintegrate while you’re flying. The vehicles we’re talking about are performing in excess of 1000, 2000, 3000 Gs.”\nSince we know for certain that evolution by natural selection didn’t happen because\nit mathematically couldn’t happen\n, that means that all of the historical anomalies both architectural and genetic are necessarily indicative of human history being far more complicated, and involving interaction with far more technologically advanced beings from either a) this planet, b) other planets, c) other dimensions, or d) all of the above. I consider (d) to be the most likely option, since we already know that The Empire of Lies is inhuman, evil, and spiritual in nature.\nNote that the attempt to assume a false dichotomy between aliens and demons is nothing more than the intrinsic limitations of binary thinkers struggling to grasp the full scope of possibilities. And far from disproving or casting any doubt on Christianity, it supports the details of the Bible that specifically describes multiple material interactions between Adamic humanity and other creatures; the idea that spiritual creatures could successfully breed with humanity and produce the Nephilim entirely contradicts the materialist concept of evolution by natural selection or anything else, and should have been our first clue that Darwinian and neo-Darwinian theories were complete non-starters.\nDISCUSS ON SG",
  "tags": [
    "science",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-19T11:00:35+00:00"
}