{
  "url": "https://voxday.net/2024/11/06/just-go-away-little-nicky/",
  "scraped_at": "2026-01-08T19:28:41.918268",
  "title": "Just Go Away, Little Nicky",
  "date_display": "November 6, 2024",
  "date_iso": "2024-11-06T11:49:27+00:00",
  "date_from_url": "2024-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pathetic. There is no “we” in this regard. The little gay famewhore openly denounced Donald Trump and endorsed Kamala Harris when he thought she was going to win. Now he’s demonstrating what a shameless little opportunist he is.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-65173\" decoding=\"async\" fetchpriority=\"high\" height=\"805\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/11/image-5.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/11/image-5.png 512w, https://voxday.net/wp-content/uploads/2024/11/image-5-191x300.png 191w\" width=\"512\"/></figure></div><p>No one is going to be fooled by this shameless revisionism. First of all, there is no “we”. Nick Fuentes has never been on anyone’s side but his own. Second, it’s not the public commentators, but the behind-the-scenes men who won the recent presidential election; they prevented Harris from benefiting from the late deliveries of millions of fake votes that led to the fake Presidency of the Six Bidens.</p><ul class=\"wp-block-list\"><li>2024: Harris: 68,340,558, Trump 72,978,296 (updated)</li><li>2020: Biden: 81,268,924, Trump: 74,216,154</li><li>2016: Clinton: 62,985,106 Trump: 65,853,625</li></ul><p>Trump should end up with at least 312 electoral college votes, more than the 306 he won in 2016 and the 303 that the Six Bidens supposedly “won” in 2020. <strong>UPDATED: </strong><em>This also turned out to be correct.</em></p><p>Now, do you notice the obvious outlier in the popular votes? How does Harris, as an effective incumbent, get <em>13 million fewer votes</em> than Biden, especially when Trump will end up with around the same number of votes as he did in 2020, and eight million more than he did in winning the 2016 election? What are we supposed to believe, that 20 million US voters died of the not-vaxx? Hindsight has proven what what we skeptics pointed out at the time was correct: the 2020 election was obviously fraudulent.</p><p>Nick Fuentes is similar to Richard Armitage from the Tea Party days. He’s the same sort of repulsive self-promoter who can’t see a parade passing by without leaping to the front of it and pretending to lead it. One hopes that the young men who were foolish enough to follow Fuentes in the past will see through his ridiculous act. It’s time for Fuentes to go and dance away his real life in a Miami disco; time is up on this particular acting gig. He should leave the political commentary to the professionals who are, at the very least, capable of correctly predicting the obvious.</p><p><em>Never in the history of politics has someone talked such a huge fucking game and been so brutally exposed as ignorant, impotent, and irrelevant.</em><br/>– Milo</p><p>There is nothing wrong with having been disappointed by President Trump’s past failings, whether it be his horrific personnel decisions, his insane Israel First statements, his endorsement of the vaxx, his pro-immigrant rhetoric, or his failure to cross the Rubicon in 2020. My past enthusiasm for him was significantly reduced for him as a result of those obvious and undeniable failures. Even so, Donald Trump was still the best US President since Andrew Jackson and he did keep the USA out of war, two very important achievements that I have never forgotten nor failed to point out even when I am criticizing him.</p><p>But there is neither room nor respect in any community for a treacherous, self-serving turncoat of the sort that Little Nicky has now demonstrated himself to be.</p><p>And speaking of people who can just go away now, we also say a well-deserved sayonara to Allan Lichtman and his always-overrated <em>Thirteen Keys to the White House</em>, which have now proven to be no more predictive than the wishful-thinking of the media’s polls.</p><p>Regardless, we can certainly hope that Donald Trump will show himself to be the decisive and uncompromising leader that the more shrill and terrified Blue Staters fear him to be. Making America Great Again requires far more than the art of the deal, it needs the full manifestation of the God-Emperor exercising the full potential of his powers. Few men are blessed with second chances; let us pray that President Trump wastes no time in making the most of his.</p><p><em><a href=\"https://socialgalactic.com/micropost/d5941e4e-6b5d-4fe4-bd97-457c2cafa7b7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Pathetic. There is no “we” in this regard. The little gay famewhore openly denounced Donald Trump and endorsed Kamala Harris when he thought she was going to win. Now he’s demonstrating what a shameless little opportunist he is.\nNo one is going to be fooled by this shameless revisionism. First of all, there is no “we”. Nick Fuentes has never been on anyone’s side but his own. Second, it’s not the public commentators, but the behind-the-scenes men who won the recent presidential election; they prevented Harris from benefiting from the late deliveries of millions of fake votes that led to the fake Presidency of the Six Bidens.\n2024: Harris: 68,340,558, Trump 72,978,296 (updated)\n2020: Biden: 81,268,924, Trump: 74,216,154\n2016: Clinton: 62,985,106 Trump: 65,853,625\nTrump should end up with at least 312 electoral college votes, more than the 306 he won in 2016 and the 303 that the Six Bidens supposedly “won” in 2020.\nUPDATED:\nThis also turned out to be correct.\nNow, do you notice the obvious outlier in the popular votes? How does Harris, as an effective incumbent, get\n13 million fewer votes\nthan Biden, especially when Trump will end up with around the same number of votes as he did in 2020, and eight million more than he did in winning the 2016 election? What are we supposed to believe, that 20 million US voters died of the not-vaxx? Hindsight has proven what what we skeptics pointed out at the time was correct: the 2020 election was obviously fraudulent.\nNick Fuentes is similar to Richard Armitage from the Tea Party days. He’s the same sort of repulsive self-promoter who can’t see a parade passing by without leaping to the front of it and pretending to lead it. One hopes that the young men who were foolish enough to follow Fuentes in the past will see through his ridiculous act. It’s time for Fuentes to go and dance away his real life in a Miami disco; time is up on this particular acting gig. He should leave the political commentary to the professionals who are, at the very least, capable of correctly predicting the obvious.\nNever in the history of politics has someone talked such a huge fucking game and been so brutally exposed as ignorant, impotent, and irrelevant.\n– Milo\nThere is nothing wrong with having been disappointed by President Trump’s past failings, whether it be his horrific personnel decisions, his insane Israel First statements, his endorsement of the vaxx, his pro-immigrant rhetoric, or his failure to cross the Rubicon in 2020. My past enthusiasm for him was significantly reduced for him as a result of those obvious and undeniable failures. Even so, Donald Trump was still the best US President since Andrew Jackson and he did keep the USA out of war, two very important achievements that I have never forgotten nor failed to point out even when I am criticizing him.\nBut there is neither room nor respect in any community for a treacherous, self-serving turncoat of the sort that Little Nicky has now demonstrated himself to be.\nAnd speaking of people who can just go away now, we also say a well-deserved sayonara to Allan Lichtman and his always-overrated\nThirteen Keys to the White House\n, which have now proven to be no more predictive than the wishful-thinking of the media’s polls.\nRegardless, we can certainly hope that Donald Trump will show himself to be the decisive and uncompromising leader that the more shrill and terrified Blue Staters fear him to be. Making America Great Again requires far more than the art of the deal, it needs the full manifestation of the God-Emperor exercising the full potential of his powers. Few men are blessed with second chances; let us pray that President Trump wastes no time in making the most of his.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-07T10:03:40+00:00"
}