{
  "url": "https://voxday.net/2024/11/15/no-childhood-vaccine-is-tested/",
  "scraped_at": "2026-01-08T19:29:39.736454",
  "title": "No Childhood Vaccine is Tested",
  "date_display": "November 15, 2024",
  "date_iso": "2024-11-15T16:30:42+00:00",
  "date_from_url": "2024-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t trust the scientists, trust the HISTORY of science. Which, by the way, very few scientists actually know.</p><p><em>“My position on vaccines… is that vaccines should be tested, like other medicines. Of the 72 vaccine doses now mandated… for American children, none of them—not one—has ever been subject to a pre-licensing, placebo-controlled trial. Other medicines are required to do that, and we should have to do that for vaccines. If I’m wrong, show me the test. Show me the study. You won’t be able to, because there are none. That means that we don’t know what the long-term risks are.”</em><br/>– RFK Jr.</p><p>I’ve been pointing this out for years, very nearly <em>decades</em> now. Forget the Covid-19 vaxx. There are no vaccines, ZERO, which have been demonstrated to be either safe or effective by a proper application of the scientific method. It’s all statistics and hand-waving and blustering and hiding the adverse effects. There is more scientific and statistical evidence that vaccines cause autism, however flawed it might be, than there is providing evidence that any childhood vaccine is safe for children. RFK Jr. established this via the legal process when he sued Anthony Fauci for calling him a liar for stating that simple fact. After a year of trying to stay out of court, Fauci’s lawyers finally admitted on their client’s behalf that RFK Jr. had been telling the truth.</p><p><em><em>“There’s no downstream liability, there’s no front-end safety testing… and there’s no marketing and advertising costs, because the federal government is ordering 78 million school kids to take that vaccine every year. What better product could you have? And so there was a gold rush to add all these new vaccines to the schedule… because if you get onto that schedule, it’s a billion dollars a year for your company. So we got all of these new vaccines, 72 shots, 16 vaccines… And that year, 1989, we saw an explosion in chronic disease in American children… ADHD, sleep disorders, language delays, ASD, autism, Tourette’s syndrome, ticks, narcolepsy. Autism went from one in 10,000 in my generation… to one in every 34 kids today.”</em></em><br/>– RFK Jr.</p><p>And now he’s the government official in charge of these matters. You wouldn’t want to DENY what the government is telling you about vaccines would you? You wouldn’t want to be a VACCINE SCIENCE DENIER!</p><p><strong>UPDATE: </strong>A once-skeptical reader admits that he was unable to disprove any of the historical facts about vaccines, their irrelevance to public health, and the nonexistence of vaccine safety science despite a serious effort to do so.</p><p><em>Following your RFK post today, I wanted to thank you for inspiring me years ago. Long before COVID, you were talking about the issues and lack of information on vaccines; as a naive college kid, I decided to look up everything I could to prove you wrong. I found what you said I would: layers of rhetoric and misdirection on top of shockingly poor official data. It’s primed me to look deeper into things, and that has kept me and my family safe from many things. It’s also trained me to seek expertise rather than experts, which has helped sift through the clown nonsense.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/53d09c44-a999-4889-b45e-5ef3de398f03\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Don’t trust the scientists, trust the HISTORY of science. Which, by the way, very few scientists actually know.\n“My position on vaccines… is that vaccines should be tested, like other medicines. Of the 72 vaccine doses now mandated… for American children, none of them—not one—has ever been subject to a pre-licensing, placebo-controlled trial. Other medicines are required to do that, and we should have to do that for vaccines. If I’m wrong, show me the test. Show me the study. You won’t be able to, because there are none. That means that we don’t know what the long-term risks are.”\n– RFK Jr.\nI’ve been pointing this out for years, very nearly\ndecades\nnow. Forget the Covid-19 vaxx. There are no vaccines, ZERO, which have been demonstrated to be either safe or effective by a proper application of the scientific method. It’s all statistics and hand-waving and blustering and hiding the adverse effects. There is more scientific and statistical evidence that vaccines cause autism, however flawed it might be, than there is providing evidence that any childhood vaccine is safe for children. RFK Jr. established this via the legal process when he sued Anthony Fauci for calling him a liar for stating that simple fact. After a year of trying to stay out of court, Fauci’s lawyers finally admitted on their client’s behalf that RFK Jr. had been telling the truth.\n“There’s no downstream liability, there’s no front-end safety testing… and there’s no marketing and advertising costs, because the federal government is ordering 78 million school kids to take that vaccine every year. What better product could you have? And so there was a gold rush to add all these new vaccines to the schedule… because if you get onto that schedule, it’s a billion dollars a year for your company. So we got all of these new vaccines, 72 shots, 16 vaccines… And that year, 1989, we saw an explosion in chronic disease in American children… ADHD, sleep disorders, language delays, ASD, autism, Tourette’s syndrome, ticks, narcolepsy. Autism went from one in 10,000 in my generation… to one in every 34 kids today.”\n– RFK Jr.\nAnd now he’s the government official in charge of these matters. You wouldn’t want to DENY what the government is telling you about vaccines would you? You wouldn’t want to be a VACCINE SCIENCE DENIER!\nUPDATE:\nA once-skeptical reader admits that he was unable to disprove any of the historical facts about vaccines, their irrelevance to public health, and the nonexistence of vaccine safety science despite a serious effort to do so.\nFollowing your RFK post today, I wanted to thank you for inspiring me years ago. Long before COVID, you were talking about the issues and lack of information on vaccines; as a naive college kid, I decided to look up everything I could to prove you wrong. I found what you said I would: layers of rhetoric and misdirection on top of shockingly poor official data. It’s primed me to look deeper into things, and that has kept me and my family safe from many things. It’s also trained me to seek expertise rather than experts, which has helped sift through the clown nonsense.\nDISCUSS ON SG",
  "tags": [
    "law",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-15T19:36:11+00:00"
}