{
  "url": "https://voxday.net/2024/11/22/the-rhetoric-of-london-larry/",
  "scraped_at": "2026-01-08T19:30:24.481384",
  "title": "The Rhetoric of London Larry",
  "date_display": "November 22, 2024",
  "date_iso": "2024-11-22T11:11:35+00:00",
  "date_from_url": "2024-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The British are gradually beginning to realize that they have bitten off far more than they can possibly chew, and that their time-honored method of providing the decisive force to help one side or the other have the advantage in the conflict <a href=\"https://www.dailymail.co.uk/debate/article-14112463/EDWARD-LUCAS-defend-against-Putin-missile-strike.html\">is not going to work</a> in the current situation:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Putin’s aim is not to defeat us in military combat: he knows he cannot – for now – win against the combined might of Nato, while Beijing remains unlikely to commit its millions of troops to his cause.</p><p>His aim instead is to instil cowardice in the general population – to cause ordinary Britons to turn their backs on Ukraine, and demand that their own government stop supporting the defenders.</p><p>Why support Ukraine, these siren voices will sing, when the price is misery at home?</p><p>Why do we maintain and expense a ‘tripwire’ force in Estonia?</p><p>What is the point of Nato now that an isolationist Trump is heading back to the White House?</p><p>Surely it is better to pull out of these entanglements and concentrate on our own problems?</p><p>Yet if we allow Russia to conquer Ukraine, the result will not be perfect peace. Instead, the seeds will be sown for a future conflict, one in which Britain will be in a far more parlous position.</p><p>Instead of kowtowing to our foes, we should rekindle the spirit that won previous epic contests — the world wars against Germany and its allies, and the cold war against Soviet Communism.</p><p>We need, too, a new arsenal of crafty, painful counter-measures – for example seizing the frozen £250billion assets of Russia’s central bank and using it to arm and rebuild Ukraine.</p><p>So long as our enemies believe they can attack us with impunity, they will not cease from doing so. That is why we must continue to support the Ukrainians – and show Putin that we will not back down.</p></blockquote><p>Let’s count the errors:</p><ol class=\"wp-block-list\"><li>Putin’s aim is not to defeat Britain in military combat. His aim is to remove a structural threat to Russia that has spread from the middle of Germany to his borders, a threat that the USA created unnecessarily by breaking its promises to not expand NATO in return for Russia abandoning its occupation of East Germany.</li><li>Beijing will absolutely stand by Russia, and has no need to send troops to Europe in order to provide decisive military aid the Russians. It can quickly and easily remove more than half the military forces capable of being brought to bear in Europe by simply pursuing its own objectives. That’s how military alliances work when properly conceived. Forget Taiwan. Just one move aimed at South Korea or Japan would be sufficient to cause the US military to abandon all support for Europe.</li><li>Russia can defeat “the combined might of NATO”. It has already done so. If Putin wanted to go all the way to Normandy, he could. Russia has lost 70,000 soldiers, one-quarter of one percent of the number of Russians it lost in WWII, while inflicting casualties at a rate that exceeds that of the historical delta in favor of the IDF in the Arab-Israeli wars.</li><li>The British public already wants their government to stop spending money on Ukraine. There are already mass demonstrations against the Labour government’s rapacious new tax schemes. That’s not cowardice, that’s putting the British national interest ahead of Clown World’s interest in Ukraine.</li><li>Russia has frozen an equivalent amount of European assets. Stealing the frozen Russian assets and giving them to Ukraine will be counterbalanced by the Russians liquidating those European assets and utilizing them. This is an obviously futile threat.</li><li>It is not within the British power to “allow” Russia to conquer Ukraine. Russia has already defeated both Ukraine and NATO in Ukraine; if Ukraine is not permitted to surrender, Ukraine will be conquered and occupied.</li><li>There will be no rekindling “the spirit that won previous contests” because the multiracial, multicultural morass of New Britain is not inhabited by the same British people who contributed to the victory of the Allies in WWII. Furthermore, it was the Russian people who won the war; the British population would have been 60 percent smaller if they had suffered the same number of fatalities that the Russians did.</li></ol><p>This is just rhetorical bluster, no different than the “mother of all battles” posturing we became accustomed to hearing from Baghdad Bob. London Larry is no more convincing, and every bit as deluded about the military prospects for the British military, as Baghdad Bob was about those formidable forces of the Iraqi army under Saddam Hussein.</p><p><strong>UPDATE: </strong>Clown World’s most-likely replacement for Zelensky, Valery Zaluzhny, points out that North Korea, Iran, and China are already fully allied and aligned with Russia. Not only that, but they are much more likely to stand by Russia than the USA, the UK, or the European nations are to continue “supporting” Ukraine once either a) Russia decides to cross the Dnieper, b) Russia drops the hammer on the UK or a European state, or c) the next front goes hot.</p><p><em>Ukraine’s former military chief has warned that World War Three is already underway – with Vladimir Putin’s autocratic allies, North Korea, Iran and China, openly supporting his forces on the battlefield. Valery Zaluzhny, who is now Ukraine’s envoy to the United Kingdom, told the UP100 award ceremony in Kyiv: ‘I believe that in 2024 we can absolutely believe that the Third World War has begun.’ The General said that as of this year, ‘Ukraine is no longer facing Russia. Soldiers from North Korea are standing in front of Ukraine.’</em></p><p><strong>UPDATE: </strong>Uncle John calls a scripted bluff.</p><p><em>Note incongruities. Beast media is running two incompatible nonsense narratives. A) crumbling Putin’s impotent rage and B) OMG nuclear war. It’s not which is right. It’s sowing chaos. Chaff. Put down a marker. No one will be using “nukes”.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/56108e95-1ea9-4884-b0fa-9fb62640457d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The British are gradually beginning to realize that they have bitten off far more than they can possibly chew, and that their time-honored method of providing the decisive force to help one side or the other have the advantage in the conflict\nis not going to work\nin the current situation:\nPutin’s aim is not to defeat us in military combat: he knows he cannot – for now – win against the combined might of Nato, while Beijing remains unlikely to commit its millions of troops to his cause.\nHis aim instead is to instil cowardice in the general population – to cause ordinary Britons to turn their backs on Ukraine, and demand that their own government stop supporting the defenders.\nWhy support Ukraine, these siren voices will sing, when the price is misery at home?\nWhy do we maintain and expense a ‘tripwire’ force in Estonia?\nWhat is the point of Nato now that an isolationist Trump is heading back to the White House?\nSurely it is better to pull out of these entanglements and concentrate on our own problems?\nYet if we allow Russia to conquer Ukraine, the result will not be perfect peace. Instead, the seeds will be sown for a future conflict, one in which Britain will be in a far more parlous position.\nInstead of kowtowing to our foes, we should rekindle the spirit that won previous epic contests — the world wars against Germany and its allies, and the cold war against Soviet Communism.\nWe need, too, a new arsenal of crafty, painful counter-measures – for example seizing the frozen £250billion assets of Russia’s central bank and using it to arm and rebuild Ukraine.\nSo long as our enemies believe they can attack us with impunity, they will not cease from doing so. That is why we must continue to support the Ukrainians – and show Putin that we will not back down.\nLet’s count the errors:\nPutin’s aim is not to defeat Britain in military combat. His aim is to remove a structural threat to Russia that has spread from the middle of Germany to his borders, a threat that the USA created unnecessarily by breaking its promises to not expand NATO in return for Russia abandoning its occupation of East Germany.\nBeijing will absolutely stand by Russia, and has no need to send troops to Europe in order to provide decisive military aid the Russians. It can quickly and easily remove more than half the military forces capable of being brought to bear in Europe by simply pursuing its own objectives. That’s how military alliances work when properly conceived. Forget Taiwan. Just one move aimed at South Korea or Japan would be sufficient to cause the US military to abandon all support for Europe.\nRussia can defeat “the combined might of NATO”. It has already done so. If Putin wanted to go all the way to Normandy, he could. Russia has lost 70,000 soldiers, one-quarter of one percent of the number of Russians it lost in WWII, while inflicting casualties at a rate that exceeds that of the historical delta in favor of the IDF in the Arab-Israeli wars.\nThe British public already wants their government to stop spending money on Ukraine. There are already mass demonstrations against the Labour government’s rapacious new tax schemes. That’s not cowardice, that’s putting the British national interest ahead of Clown World’s interest in Ukraine.\nRussia has frozen an equivalent amount of European assets. Stealing the frozen Russian assets and giving them to Ukraine will be counterbalanced by the Russians liquidating those European assets and utilizing them. This is an obviously futile threat.\nIt is not within the British power to “allow” Russia to conquer Ukraine. Russia has already defeated both Ukraine and NATO in Ukraine; if Ukraine is not permitted to surrender, Ukraine will be conquered and occupied.\nThere will be no rekindling “the spirit that won previous contests” because the multiracial, multicultural morass of New Britain is not inhabited by the same British people who contributed to the victory of the Allies in WWII. Furthermore, it was the Russian people who won the war; the British population would have been 60 percent smaller if they had suffered the same number of fatalities that the Russians did.\nThis is just rhetorical bluster, no different than the “mother of all battles” posturing we became accustomed to hearing from Baghdad Bob. London Larry is no more convincing, and every bit as deluded about the military prospects for the British military, as Baghdad Bob was about those formidable forces of the Iraqi army under Saddam Hussein.\nUPDATE:\nClown World’s most-likely replacement for Zelensky, Valery Zaluzhny, points out that North Korea, Iran, and China are already fully allied and aligned with Russia. Not only that, but they are much more likely to stand by Russia than the USA, the UK, or the European nations are to continue “supporting” Ukraine once either a) Russia decides to cross the Dnieper, b) Russia drops the hammer on the UK or a European state, or c) the next front goes hot.\nUkraine’s former military chief has warned that World War Three is already underway – with Vladimir Putin’s autocratic allies, North Korea, Iran and China, openly supporting his forces on the battlefield. Valery Zaluzhny, who is now Ukraine’s envoy to the United Kingdom, told the UP100 award ceremony in Kyiv: ‘I believe that in 2024 we can absolutely believe that the Third World War has begun.’ The General said that as of this year, ‘Ukraine is no longer facing Russia. Soldiers from North Korea are standing in front of Ukraine.’\nUPDATE:\nUncle John calls a scripted bluff.\nNote incongruities. Beast media is running two incompatible nonsense narratives. A) crumbling Putin’s impotent rage and B) OMG nuclear war. It’s not which is right. It’s sowing chaos. Chaff. Put down a marker. No one will be using “nukes”.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "UK",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-22T14:59:46+00:00"
}