{
  "url": "https://voxday.net/2024/11/02/the-theft-of-kola-coca/",
  "scraped_at": "2026-01-08T19:28:15.850095",
  "title": "The Theft of Kola Coca",
  "date_display": "November 2, 2024",
  "date_iso": "2024-11-02T13:58:22+00:00",
  "date_from_url": "2024-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Coca-Cola is not an American invention. It’s just another <a href=\"https://www.unz.com/lromanoff/a-few-historical-frauds/\">fraudulent story of fake history</a> meant to cover the theft of intellectual property by 19th century US citizens.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Coca-Cola, originally called Kola Coca, was invented more than 140 years ago in a small town in Spain, the creators of the formula for the world’s best-selling soft drink having been cheated of its ownership and billions of dollars. The process was a well-kept secret at the time and quickly became a world-famous product, winning dozens of international gold medals and other awards. Unfortunately, Bautista Aparici, one of the company’s founders, attended a trade fair in Philadelphia and made the mistake of giving a sample and a brief description of the process to an American he happened to meet, and a short time later US pharmacist John Pemberton changed the name to Coca-Cola and patented the product and process, the US government refusing to recognise the original Spanish patent.</p><p>The official story is that this drink was “invented by Dr. John Smith Pemberton on May 8, 1886, at Atlanta, Georgia”, in the USA, and was named Coca-Cola because at that time it contained extracts of Coca leaves and Kola nuts, and that the company’s book-keeper renamed the drink because he thought the two ‘C’s’ would look better in advertising. None of that is true. The drink was indeed made from kola nuts and coca leaves, but the new name was a cheap attempt to differentiate itself after Pemberton stole and patented the original formula. All the stories about Pemberton inventing Coke’s secret formula in his laboratory are fabricated nonsense, with the company’s website cleverly designed to airbrush out the drink’s early history and avoid the truth becoming known. <em>Beverage World</em> magazine produced a special issue to commemorate the one-hundredth (American) anniversary of Coca-Cola, claiming Coke was:</p><p><em>“A totally American product born of a solid idea, nurtured throughout the past century with creative thinking and bold decision-making, and always plenty of good old-fashioned hard work. That is as it should be; it is the American way”.</em></p><p>Not by a long shot. Coca-Cola is just one of hundreds of products the Americans have stolen and patented with the full protection of their courts operating under the peculiarly American definition of ‘rule of law’. It isn’t widely-known, though well-documented, that for decades surrounding the turn of the last century, the US government offered between $20,000 and $50,000 to anyone who could steal a foreign patent or product, that amount representing a lifetime’s earnings for an average person.</p><p>To add insult to injury, Coca-Cola moved into Spain in 1953, sued the original Spanish owners, then bullied, extorted and bought the rights for a pittance, permitting the firm to continue producing only a single alcoholic beverage under their name. USA Today reported on this without even a hint of regret or shame about the rule of law or fair play or the evils of IP theft. Their only comment: “The Spanish factory has just four employees left and probably won’t last another generation.” Even more insultingly, ABC News dismisses this story as “The Spanish firm that inspired Coke”, although they do state correctly the claim: “Locals believe that the Spanish town of Aielo de Malferit is where Coca-Cola originated — and that the factory which developed the formula that inspired the world’s best-selling soda has been cheated of its rightful place in history. Not to mention profits.”</p></blockquote><p>At this point, given the number of proven frauds that are an integral part of “American history”, it is absolutely logical to conclude that the Moon landings never happened, and even in the unlikely event that they did take place, it wasn’t Neil Armstrong and Buzz Aldrin who actually landed on the Moon first.</p><p>As for what this says about other significant historical myths perpetuated by The Narrative, well, we wouldn’t want to violate any laws by practicing our nonexistent “right” to free speech. So, we’ll just continue to not talk about things that never happened.</p><p>The more we learn to separate fact from fiction, the more we discover that the USA has been part of The Empire That Never Ended, also known as The Empire of Lies, from its inception.</p><p><em><a href=\"https://socialgalactic.com/micropost/ac933087-4e68-4abd-a1c0-438321191eea\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Coca-Cola is not an American invention. It’s just another\nfraudulent story of fake history\nmeant to cover the theft of intellectual property by 19th century US citizens.\nCoca-Cola, originally called Kola Coca, was invented more than 140 years ago in a small town in Spain, the creators of the formula for the world’s best-selling soft drink having been cheated of its ownership and billions of dollars. The process was a well-kept secret at the time and quickly became a world-famous product, winning dozens of international gold medals and other awards. Unfortunately, Bautista Aparici, one of the company’s founders, attended a trade fair in Philadelphia and made the mistake of giving a sample and a brief description of the process to an American he happened to meet, and a short time later US pharmacist John Pemberton changed the name to Coca-Cola and patented the product and process, the US government refusing to recognise the original Spanish patent.\nThe official story is that this drink was “invented by Dr. John Smith Pemberton on May 8, 1886, at Atlanta, Georgia”, in the USA, and was named Coca-Cola because at that time it contained extracts of Coca leaves and Kola nuts, and that the company’s book-keeper renamed the drink because he thought the two ‘C’s’ would look better in advertising. None of that is true. The drink was indeed made from kola nuts and coca leaves, but the new name was a cheap attempt to differentiate itself after Pemberton stole and patented the original formula. All the stories about Pemberton inventing Coke’s secret formula in his laboratory are fabricated nonsense, with the company’s website cleverly designed to airbrush out the drink’s early history and avoid the truth becoming known.\nBeverage World\nmagazine produced a special issue to commemorate the one-hundredth (American) anniversary of Coca-Cola, claiming Coke was:\n“A totally American product born of a solid idea, nurtured throughout the past century with creative thinking and bold decision-making, and always plenty of good old-fashioned hard work. That is as it should be; it is the American way”.\nNot by a long shot. Coca-Cola is just one of hundreds of products the Americans have stolen and patented with the full protection of their courts operating under the peculiarly American definition of ‘rule of law’. It isn’t widely-known, though well-documented, that for decades surrounding the turn of the last century, the US government offered between $20,000 and $50,000 to anyone who could steal a foreign patent or product, that amount representing a lifetime’s earnings for an average person.\nTo add insult to injury, Coca-Cola moved into Spain in 1953, sued the original Spanish owners, then bullied, extorted and bought the rights for a pittance, permitting the firm to continue producing only a single alcoholic beverage under their name. USA Today reported on this without even a hint of regret or shame about the rule of law or fair play or the evils of IP theft. Their only comment: “The Spanish factory has just four employees left and probably won’t last another generation.” Even more insultingly, ABC News dismisses this story as “The Spanish firm that inspired Coke”, although they do state correctly the claim: “Locals believe that the Spanish town of Aielo de Malferit is where Coca-Cola originated — and that the factory which developed the formula that inspired the world’s best-selling soda has been cheated of its rightful place in history. Not to mention profits.”\nAt this point, given the number of proven frauds that are an integral part of “American history”, it is absolutely logical to conclude that the Moon landings never happened, and even in the unlikely event that they did take place, it wasn’t Neil Armstrong and Buzz Aldrin who actually landed on the Moon first.\nAs for what this says about other significant historical myths perpetuated by The Narrative, well, we wouldn’t want to violate any laws by practicing our nonexistent “right” to free speech. So, we’ll just continue to not talk about things that never happened.\nThe more we learn to separate fact from fiction, the more we discover that the USA has been part of The Empire That Never Ended, also known as The Empire of Lies, from its inception.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2024-11-02T13:58:22+00:00"
}