{
  "url": "https://voxday.net/2024/11/23/the-next-russian-target/",
  "scraped_at": "2026-01-08T19:30:32.461322",
  "title": "The Next Russian Target",
  "date_display": "November 23, 2024",
  "date_iso": "2024-11-23T13:48:01+00:00",
  "date_from_url": "2024-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russia has publicly warned Poland and the USA that it intends <a href=\"https://www.thegatewaypundit.com/2024/11/breaking-russia-threatens-attack-us-base-poland-video/\">to strike a US military base in Poland</a> soon:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Russia is now warning about a new attack on a US base in Poland with “advanced weapons,” only hours after they reportedly launched intercontinental missiles inside Ukraine in response to Ukraine sending US-made ballistic missiles into Russia. According to the New York Times, America’s “President” Joe Biden gave Ukraine permission to launch the missiles, which was a major shift in US policy.</p><p>The US base at Redzikowo, which opened Nov. 13, is part of a broader NATO missile shield — known as “Aegis Ashore” — that can intercept short- to intermediate-range ballistic missiles, according to the alliance.</p><p>Russian Foreign Ministry spokesperson Maria Zakharova made the announcement today: <em>“This long-term America’s and NATO’s construction, which lasted for almost a decade and totally neglected Russia’s security concerns, has been the focus of our attention from the standpoint of compensating countermeasures. Given the nature and level of threats posed by such Western military facilities, the missile defense base in Poland has long been added to the list of priority targets for potential destruction, which, if necessary, can be executed with a wide range of advanced weapons.”</em></p></blockquote><p>Rumor has it that three “TOPOL-M” ICBMS have been observed on the move with their launchers. However, I very much doubt Russia would strike using the 1 megaton nuclear warheads that the missiles usually carry, since a) nukes may not actually exist and b) a conventional strike would suffice to deliver the warning without escalating to the nuclear level.</p><p>Since NATO is already at war with Russia and has launched long-range missile strikes inside Russia, there is no reason Russia should not proceed to methodically destroy every US base located in all the countries on its borders. NATO already escalated, and if the Russians have learned one thing from their experience with NATO, it is that even if one doesn’t give it an inch, it will take hundreds of miles.</p><p>If the Russians do destroy the base in Poland, it’s going to be interesting to see the response of the people who have hitherto believed the claims that all of the Russian missiles targeting Ukraine, and all of the Iranian missiles targeting Israel, have been shot down.</p><p><em><a href=\"https://socialgalactic.com/micropost/1c9f6ac3-c7d9-4680-ab2a-3f3e3e5f551b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Russia has publicly warned Poland and the USA that it intends\nto strike a US military base in Poland\nsoon:\nRussia is now warning about a new attack on a US base in Poland with “advanced weapons,” only hours after they reportedly launched intercontinental missiles inside Ukraine in response to Ukraine sending US-made ballistic missiles into Russia. According to the New York Times, America’s “President” Joe Biden gave Ukraine permission to launch the missiles, which was a major shift in US policy.\nThe US base at Redzikowo, which opened Nov. 13, is part of a broader NATO missile shield — known as “Aegis Ashore” — that can intercept short- to intermediate-range ballistic missiles, according to the alliance.\nRussian Foreign Ministry spokesperson Maria Zakharova made the announcement today:\n“This long-term America’s and NATO’s construction, which lasted for almost a decade and totally neglected Russia’s security concerns, has been the focus of our attention from the standpoint of compensating countermeasures. Given the nature and level of threats posed by such Western military facilities, the missile defense base in Poland has long been added to the list of priority targets for potential destruction, which, if necessary, can be executed with a wide range of advanced weapons.”\nRumor has it that three “TOPOL-M” ICBMS have been observed on the move with their launchers. However, I very much doubt Russia would strike using the 1 megaton nuclear warheads that the missiles usually carry, since a) nukes may not actually exist and b) a conventional strike would suffice to deliver the warning without escalating to the nuclear level.\nSince NATO is already at war with Russia and has launched long-range missile strikes inside Russia, there is no reason Russia should not proceed to methodically destroy every US base located in all the countries on its borders. NATO already escalated, and if the Russians have learned one thing from their experience with NATO, it is that even if one doesn’t give it an inch, it will take hundreds of miles.\nIf the Russians do destroy the base in Poland, it’s going to be interesting to see the response of the people who have hitherto believed the claims that all of the Russian missiles targeting Ukraine, and all of the Iranian missiles targeting Israel, have been shot down.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-23T13:48:04+00:00"
}