{
  "url": "https://voxday.net/2024/11/25/the-babylon-bee-is-babylonian/",
  "scraped_at": "2026-01-08T19:30:39.859950",
  "title": "The Babylon Bee is… Babylonian",
  "date_display": "November 25, 2024",
  "date_iso": "2024-11-25T10:05:04+00:00",
  "date_from_url": "2024-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s funny, sure, but I don’t read <em>the Babylon Bee</em> because <a href=\"https://nitter.poast.org/JoelWBerry/status/1859221344874881101\">it is no more on the side of the truth</a> than CNN or <em>the Onion</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’m not against a certain kind of nationalism that takes culture, beliefs, and character into account. America should be for Americans, and we should start defining exactly what that means because right now things are a mess.</p><p>What I’m against is white nationalism. I think skin color is a stupid thing to base “ethnos” on. And because I believe skin color is irrelevant, Auron will straw-man me and say that must mean I believe America is just an “economic zone” or “tax farm” or slander me as a multiculturalist.</p><p>Assuming he isn’t stupid, the reason he presents a false choice between racial “purity” and multiculturalism is because he believes culture is inextricably linked to race, or as many of his followers always tell me on here, “culture is downstream from race.” I disagree with that statement. I think it’s not only wrong scientifically, I think it is a godless error of materialism that denies the Imago Dei and reduces men to products of their DNA.</p><p>America as a creedal nation is a great idea I truly believe in. The problem is we haven’t taught, passed down, enforced, or required allegiance to the creed—and that needs to change.</p></blockquote><p>He’s not against “a certain kind of nationalism” that isn’t nationalism at all. There is no such thing as “a creedal nation”. Civic nationalism is a modern deconstruction of nationalism; it was articulated by Hans Kohn in his book <em>The Idea of Nationalism: A Study in Its Origins and Background</em> published in 1944. It’s an entirely false and intrinsically subversive concept that was utilized to first subvert the USA and is now being used to subvert and destroy nations from Scandinavia and Great Britain to Japan. No one who subscribes to such an obvious falsehood is in line with either a) the Bible, b) the Founding Fathers, c) the U.S. Constitution, or d) science.</p><p>All creatures are products of their DNA. And here we see the intrinsic snakery revealed, as he attempts to derive the nonexistence of nationalism – literally, natalism or blood kinship – from the existence of the Imago Dei, or the “image of God”. This is not the act of one who is misguided, but rather, one who seeks to mislead. And as always, anytime anyone mentions the word “god”, one can assume nothing until one learns to which god the other person is referring.</p><p><em><a href=\"https://socialgalactic.com/micropost/d826bcac-c1d4-42e0-9b30-f7d362d72fd0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s funny, sure, but I don’t read\nthe Babylon Bee\nbecause\nit is no more on the side of the truth\nthan CNN or\nthe Onion\n.\nI’m not against a certain kind of nationalism that takes culture, beliefs, and character into account. America should be for Americans, and we should start defining exactly what that means because right now things are a mess.\nWhat I’m against is white nationalism. I think skin color is a stupid thing to base “ethnos” on. And because I believe skin color is irrelevant, Auron will straw-man me and say that must mean I believe America is just an “economic zone” or “tax farm” or slander me as a multiculturalist.\nAssuming he isn’t stupid, the reason he presents a false choice between racial “purity” and multiculturalism is because he believes culture is inextricably linked to race, or as many of his followers always tell me on here, “culture is downstream from race.” I disagree with that statement. I think it’s not only wrong scientifically, I think it is a godless error of materialism that denies the Imago Dei and reduces men to products of their DNA.\nAmerica as a creedal nation is a great idea I truly believe in. The problem is we haven’t taught, passed down, enforced, or required allegiance to the creed—and that needs to change.\nHe’s not against “a certain kind of nationalism” that isn’t nationalism at all. There is no such thing as “a creedal nation”. Civic nationalism is a modern deconstruction of nationalism; it was articulated by Hans Kohn in his book\nThe Idea of Nationalism: A Study in Its Origins and Background\npublished in 1944. It’s an entirely false and intrinsically subversive concept that was utilized to first subvert the USA and is now being used to subvert and destroy nations from Scandinavia and Great Britain to Japan. No one who subscribes to such an obvious falsehood is in line with either a) the Bible, b) the Founding Fathers, c) the U.S. Constitution, or d) science.\nAll creatures are products of their DNA. And here we see the intrinsic snakery revealed, as he attempts to derive the nonexistence of nationalism – literally, natalism or blood kinship – from the existence of the Imago Dei, or the “image of God”. This is not the act of one who is misguided, but rather, one who seeks to mislead. And as always, anytime anyone mentions the word “god”, one can assume nothing until one learns to which god the other person is referring.\nDISCUSS ON SG",
  "tags": [
    "history",
    "judeo-christianity",
    "media",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-25T10:58:52+00:00"
}