{
  "url": "https://voxday.net/2024/11/13/the-new-secdef/",
  "scraped_at": "2026-01-08T19:29:22.932770",
  "title": "The New SecDef",
  "date_display": "November 13, 2024",
  "date_iso": "2024-11-13T13:47:39+00:00",
  "date_from_url": "2024-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The good news is that Pete Hegseth, the incoming Secretary of Defense is an “extremist” with a Deus Vult tattoo whom the Pentagon hates. <a href=\"https://x.com/Kronykal/status/1856513582982164570\">He knows the US military, its capabilities, and its limitations</a>. The bad news is that he neither knows nor understands the Middle Kingdom, and would appear to buy into the retarded neocon myth that China seeks “global domination”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Pentagon, the past X number of years, 10, 12, 15, the Pentagon has a perfect record in all of its wargames against China. We lose every time inside the Pentagon wargames. We know what our real capabilities are. We didn’t even get into this part of The War on Warriors. The way we train for conflicts, the way we procure weapons systems, the way our system works, the way our bureaucratic system works, the way the speed of weapons procurement works, we’re always a decade behind and fighting the last war.</p><p>Whereas China – what did Rumsfeld say, you go to war with the army you have – China is building an army specifically dedicated to defeating the United States of America. That is their strategic outset. Take hypersonic missiles. Our whole power-projection plaform is our aircraft carriers and our ability to project power that way, strategically around the globe. And yeah, we have a nuclear triad and all that, but that’s a big part of it.</p><p>And if 15 hypersonic missiles can take out our ten aircraft carriers in the first 20 minutes of a conflict, what does that look like? If they’ve already got us by the balls economically, which you pointed out very well, with our grid. Culturally, there’s plenty of elite capture going on around the globe. Microchips and everything, why do they want Taiwan? They want to corner the market completely on the technological future. We can’t even drive our cars without the stuff we need out of China these days. They have a full-spectrum, long-term view of not just regional, but global domination.</p><p>And we have our heads up our asses.</p></blockquote><p>I’m not going to lie. I like this man. He has clearly read Turchin, Qiao Liang and Wang Xiangsui, as well as a number of relevant sources that provide him with a far more realistic perspective on global military realities than the warmongering diasporans who just want to sow bloodshed and chaos everywhere around the world as long as they can use the US military to do so. And I suspect, unlike the neocons and their servants, that Hegseth is capable of learning from people who actually know China, and understand that all of China’s efforts are not focused on global imperialism, but rather, conclusively putting an end to their “century of humiliation” and making sure that no power on Earth is capable of subjecting the Chinese people ever again.</p><p>As Jeffrey Sachs pointed out, in more than 2,500 years of history, China has engaged in all of two foreign military actions, and both times were in response to Vietnamese aggression in the region. It is the Vietnamese, and not the Chinese, who were, and are still, feared throughout the region. Whereas the USA has been the second-most aggressive military power the world has ever seen; neither the Roman Empire nor the Ummayad Caliphate engaged in foreign military actions as often as the USA has. Only the Mongol empire was more aggressive as a percentage of their extant years.</p><p><em>“If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle.”</em><br/>– Sun Tzu</p><p>But one can only regards the dismay of the Deep State as a good sign.</p><p><em>“There is reason for concern that this is not a person who is a serious enough policymaker, serious enough policy implementer, to do a successful job,” said Rep. Adam Smith of Washington, the ranking Democrat on the House Armed Services Committee.</em></p><p>If he’s not what Washington considers “serious” then he’s not a ticket-taker. So Pete Hegseth appears to be an excellent appointment of the sort that Donald Trump completely failed to make the previous time around. We can still remain optimistic, <a href=\"https://unauthorized.tv/video/702d7f/\">that as the song says</a>, this time he’ll do it right and appoint Ron Paul to be Secretary of the Treasury. I’ll definitely have to read his book. In the meantime, enjoy <a href=\"https://unauthorized.tv/video/702d7f/\">the Lightning Rave mix</a> introduced on the Darkstream last night.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://unauthorized.tv/video/702d7f/\"><img alt=\"\" class=\"wp-image-65278\" decoding=\"async\" fetchpriority=\"high\" height=\"288\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/11/image-20.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/11/image-20.png 512w, https://voxday.net/wp-content/uploads/2024/11/image-20-300x169.png 300w\" width=\"512\"/></a></figure></div><p><strong>UPDATE: </strong>While Hedgseth is clearly a Zionist, he doesn’t appear to support the neocons’ plans for war with Iran. In his role, his personal ideological preferences are far less important than his grasp of what the US military can and cannot do.</p><p><em><a href=\"https://socialgalactic.com/micropost/68def2b5-0650-489e-912d-695b47c8d162\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The good news is that Pete Hegseth, the incoming Secretary of Defense is an “extremist” with a Deus Vult tattoo whom the Pentagon hates.\nHe knows the US military, its capabilities, and its limitations\n. The bad news is that he neither knows nor understands the Middle Kingdom, and would appear to buy into the retarded neocon myth that China seeks “global domination”.\nThe Pentagon, the past X number of years, 10, 12, 15, the Pentagon has a perfect record in all of its wargames against China. We lose every time inside the Pentagon wargames. We know what our real capabilities are. We didn’t even get into this part of The War on Warriors. The way we train for conflicts, the way we procure weapons systems, the way our system works, the way our bureaucratic system works, the way the speed of weapons procurement works, we’re always a decade behind and fighting the last war.\nWhereas China – what did Rumsfeld say, you go to war with the army you have – China is building an army specifically dedicated to defeating the United States of America. That is their strategic outset. Take hypersonic missiles. Our whole power-projection plaform is our aircraft carriers and our ability to project power that way, strategically around the globe. And yeah, we have a nuclear triad and all that, but that’s a big part of it.\nAnd if 15 hypersonic missiles can take out our ten aircraft carriers in the first 20 minutes of a conflict, what does that look like? If they’ve already got us by the balls economically, which you pointed out very well, with our grid. Culturally, there’s plenty of elite capture going on around the globe. Microchips and everything, why do they want Taiwan? They want to corner the market completely on the technological future. We can’t even drive our cars without the stuff we need out of China these days. They have a full-spectrum, long-term view of not just regional, but global domination.\nAnd we have our heads up our asses.\nI’m not going to lie. I like this man. He has clearly read Turchin, Qiao Liang and Wang Xiangsui, as well as a number of relevant sources that provide him with a far more realistic perspective on global military realities than the warmongering diasporans who just want to sow bloodshed and chaos everywhere around the world as long as they can use the US military to do so. And I suspect, unlike the neocons and their servants, that Hegseth is capable of learning from people who actually know China, and understand that all of China’s efforts are not focused on global imperialism, but rather, conclusively putting an end to their “century of humiliation” and making sure that no power on Earth is capable of subjecting the Chinese people ever again.\nAs Jeffrey Sachs pointed out, in more than 2,500 years of history, China has engaged in all of two foreign military actions, and both times were in response to Vietnamese aggression in the region. It is the Vietnamese, and not the Chinese, who were, and are still, feared throughout the region. Whereas the USA has been the second-most aggressive military power the world has ever seen; neither the Roman Empire nor the Ummayad Caliphate engaged in foreign military actions as often as the USA has. Only the Mongol empire was more aggressive as a percentage of their extant years.\n“If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle.”\n– Sun Tzu\nBut one can only regards the dismay of the Deep State as a good sign.\n“There is reason for concern that this is not a person who is a serious enough policymaker, serious enough policy implementer, to do a successful job,” said Rep. Adam Smith of Washington, the ranking Democrat on the House Armed Services Committee.\nIf he’s not what Washington considers “serious” then he’s not a ticket-taker. So Pete Hegseth appears to be an excellent appointment of the sort that Donald Trump completely failed to make the previous time around. We can still remain optimistic,\nthat as the song says\n, this time he’ll do it right and appoint Ron Paul to be Secretary of the Treasury. I’ll definitely have to read his book. In the meantime, enjoy\nthe Lightning Rave mix\nintroduced on the Darkstream last night.\nUPDATE:\nWhile Hedgseth is clearly a Zionist, he doesn’t appear to support the neocons’ plans for war with Iran. In his role, his personal ideological preferences are far less important than his grasp of what the US military can and cannot do.\nDISCUSS ON SG",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-13T18:07:32+00:00"
}