{
  "url": "https://voxday.net/2024/11/07/this-bodes-darkly/",
  "scraped_at": "2026-01-08T19:28:43.742105",
  "title": "This Bodes Darkly",
  "date_display": "November 7, 2024",
  "date_iso": "2024-11-07T10:17:31+00:00",
  "date_from_url": "2024-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>President Trump’s biggest weakness has always been his personnel decisions. Like many a failed executive, he tends to base his hiring decisions upon whomever is willing to flatter him and agree with him most enthusiastically. And while <a href=\"https://www.crazydaysandnights.net/2024/11/blind-item-7_6.html\">this is just a CDAN blind item</a>, which could easily have been planted by the opposition, it does merit keeping a wary eye on the situation.</p><p><em>The designs have already been set into motion. They were there before but now it’s go time. There’s even a code language. The second in charge and his funder are preparing to take out the winner and have the second in charge replace him. It has to be a health issue, which makes the plot all the darker. Es tu?</em></p><p>This blind obviously refers to JD Vance and Peter Thiel. But Trump has already been betrayed by one vice-president, so it would be surprising if he allowed it to happen again.</p><p><em><a href=\"https://socialgalactic.com/micropost/80ec71c0-22b1-46f8-833d-61ab07db00f6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "President Trump’s biggest weakness has always been his personnel decisions. Like many a failed executive, he tends to base his hiring decisions upon whomever is willing to flatter him and agree with him most enthusiastically. And while\nthis is just a CDAN blind item\n, which could easily have been planted by the opposition, it does merit keeping a wary eye on the situation.\nThe designs have already been set into motion. They were there before but now it’s go time. There’s even a code language. The second in charge and his funder are preparing to take out the winner and have the second in charge replace him. It has to be a health issue, which makes the plot all the darker. Es tu?\nThis blind obviously refers to JD Vance and Peter Thiel. But Trump has already been betrayed by one vice-president, so it would be surprising if he allowed it to happen again.\nDISCUSS ON SG",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-07T10:17:33+00:00"
}