{
  "url": "https://voxday.net/2024/11/29/too-egregious-for-employment/",
  "scraped_at": "2026-01-08T19:31:07.723432",
  "title": "Too Egregious for Employment",
  "date_display": "November 29, 2024",
  "date_iso": "2024-11-29T18:28:58+00:00",
  "date_from_url": "2024-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Chicago Bears uncharacteristically, but quite rightly, fire their head coach in the middle of the season:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>After yesterday’s debacle, the Bears have done what they had to do. Chicago has fired head coach Matt Eberflus, according to multiple reports. He ends his tenure as Bears coach 14-32, including a 4-8 record in 2024. This is the first time in franchise history that the Bears made an in-season coaching change. But after what happened on Thursday, unprecedented action was warranted.</p></blockquote><p>After I watched what had to be some of the worst clock management in history, I was not even remotely surprised that Eberflus was fired. It was so bad that I suspected the league had ordered the Lions to let the Bears back into the game after halftime, with the assurance that the Bears would flop at the end. Which flop Eberflus duly provided; he was a dead coach walking anyhow, so perhaps he was just being a good league soldier rather than exhibiting dyschronometria.</p><p>In a league where a good quarterback can get a team in field goal position with only 13 seconds and no timeouts, failing to even get within field goal range when you’ve got 1 and 10 on the 50 with two minutes left and two time outs is terrible. And to run out of time on fourth down without snapping the ball <em>when you’ve still got a time out</em> is absolutely inexcusable. In the last 30 seasons, there have been 1500 games when a team is at or inside the opponent’s 30 with a time out at the end of the game. This was the only one of those 1500 games where neither the special teams unit came on to the field nor was a time out called. To put that in perspective, you’re 45 percent more likely to die by drowning in the next 30 years than to see that happen again.</p><p>“That guy is so fired,” was my immediate response yesterday after watching the debacle play out. And I’m a little disappointed that I was correct, since I would have preferred to see him coaching the Bears for the next 20 years. The NFC North is already difficult enough with LaFleur and Campbell in the division.</p><p><em><a href=\"https://socialgalactic.com/micropost/07a9f8b8-ddea-4132-a101-58b737df06db\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Chicago Bears uncharacteristically, but quite rightly, fire their head coach in the middle of the season:\nAfter yesterday’s debacle, the Bears have done what they had to do. Chicago has fired head coach Matt Eberflus, according to multiple reports. He ends his tenure as Bears coach 14-32, including a 4-8 record in 2024. This is the first time in franchise history that the Bears made an in-season coaching change. But after what happened on Thursday, unprecedented action was warranted.\nAfter I watched what had to be some of the worst clock management in history, I was not even remotely surprised that Eberflus was fired. It was so bad that I suspected the league had ordered the Lions to let the Bears back into the game after halftime, with the assurance that the Bears would flop at the end. Which flop Eberflus duly provided; he was a dead coach walking anyhow, so perhaps he was just being a good league soldier rather than exhibiting dyschronometria.\nIn a league where a good quarterback can get a team in field goal position with only 13 seconds and no timeouts, failing to even get within field goal range when you’ve got 1 and 10 on the 50 with two minutes left and two time outs is terrible. And to run out of time on fourth down without snapping the ball\nwhen you’ve still got a time out\nis absolutely inexcusable. In the last 30 seasons, there have been 1500 games when a team is at or inside the opponent’s 30 with a time out at the end of the game. This was the only one of those 1500 games where neither the special teams unit came on to the field nor was a time out called. To put that in perspective, you’re 45 percent more likely to die by drowning in the next 30 years than to see that happen again.\n“That guy is so fired,” was my immediate response yesterday after watching the debacle play out. And I’m a little disappointed that I was correct, since I would have preferred to see him coaching the Bears for the next 20 years. The NFC North is already difficult enough with LaFleur and Campbell in the division.\nDISCUSS ON SG",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-29T18:32:39+00:00"
}