{
  "url": "https://voxday.net/2024/11/16/you-cant-beat-father-time/",
  "scraped_at": "2026-01-08T19:29:44.005749",
  "title": "You Can’t Beat Father Time",
  "date_display": "November 16, 2024",
  "date_iso": "2024-11-16T12:45:27+00:00",
  "date_from_url": "2024-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not even Iron Mike Tyson. He had two rounds to put Jake Paul away, and when he didn’t, the outcome became inevitable. Still, it’s good to see the younger generation showing due respect to their elders, even when they’ve passed them by. Jake Paul may have won a unanimous decision, but he also knows greatness when he sees it.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-65332\" decoding=\"async\" fetchpriority=\"high\" height=\"350\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/11/image-26.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/11/image-26.png 512w, https://voxday.net/wp-content/uploads/2024/11/image-26-300x205.png 300w\" width=\"512\"/></figure></div><p>It took a fair amount of courage for Mike Tyson to get back in the ring, even against a show pony fighter like Jake Paul. Paul, like it or not, is a legitimate boxer now. He’s put in the time, he’s put in the training, and if he’s not about to take on a top-ranked fighter, well, he’s first and foremost an entertainer. But that doesn’t make him any less legitimate or dangerous. He’s got knockout power. And in the ring, <em>anyone </em>can hurt you; there are no guarantees and people get injured even in sparring. I’ve seen ankles broken, noses broken, and was even knocked out myself once in training.</p><p>I’m only two years younger than Iron Mike, so I know exactly how much he has slowed down over time. On the soccer field, I’ve been dealing with my inability to reach balls I would have easily gotten to first for the last 23 years; I remember the very practice at which my top gear, upon which I’d always relied, simply vanished. It just wasn’t there anymore. It doesn’t matter how well I keep myself in shape or how smart I play, I’m just a role player now. I don’t worry about scoring goals or providing assists anymore, I just try to keep my wing in order and protect my defender; it’s up to the younger players to win the game now and all I can really expect to do is prevent us from losing it via my side.</p><p>It’s certainly painful to watch our youthful sports heroes “embarrass” themselves by showing their age and how their greatness has departed them. But they’ve earned their right to go out there and compete with their successors, and to confirm what they already suspect about their decline. And as Jake Paul demonstrated with his obvious respect for the former world champion, what a thrill it is for the younger men to test themselves, even against the faded shadows of their great elders.</p><p><em><a href=\"https://socialgalactic.com/micropost/36fc8840-f8d3-4cc5-840b-c6a22d4de832\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Not even Iron Mike Tyson. He had two rounds to put Jake Paul away, and when he didn’t, the outcome became inevitable. Still, it’s good to see the younger generation showing due respect to their elders, even when they’ve passed them by. Jake Paul may have won a unanimous decision, but he also knows greatness when he sees it.\nIt took a fair amount of courage for Mike Tyson to get back in the ring, even against a show pony fighter like Jake Paul. Paul, like it or not, is a legitimate boxer now. He’s put in the time, he’s put in the training, and if he’s not about to take on a top-ranked fighter, well, he’s first and foremost an entertainer. But that doesn’t make him any less legitimate or dangerous. He’s got knockout power. And in the ring,\nanyone\ncan hurt you; there are no guarantees and people get injured even in sparring. I’ve seen ankles broken, noses broken, and was even knocked out myself once in training.\nI’m only two years younger than Iron Mike, so I know exactly how much he has slowed down over time. On the soccer field, I’ve been dealing with my inability to reach balls I would have easily gotten to first for the last 23 years; I remember the very practice at which my top gear, upon which I’d always relied, simply vanished. It just wasn’t there anymore. It doesn’t matter how well I keep myself in shape or how smart I play, I’m just a role player now. I don’t worry about scoring goals or providing assists anymore, I just try to keep my wing in order and protect my defender; it’s up to the younger players to win the game now and all I can really expect to do is prevent us from losing it via my side.\nIt’s certainly painful to watch our youthful sports heroes “embarrass” themselves by showing their age and how their greatness has departed them. But they’ve earned their right to go out there and compete with their successors, and to confirm what they already suspect about their decline. And as Jake Paul demonstrated with his obvious respect for the former world champion, what a thrill it is for the younger men to test themselves, even against the faded shadows of their great elders.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-16T12:45:28+00:00"
}