{
  "url": "https://voxday.net/2014/12/25/a-lesson-for-non-celebrants/",
  "scraped_at": "2025-12-16T12:39:30.320026",
  "title": "A lesson for the non-celebrants",
  "date_display": "December 25, 2014",
  "date_iso": "2014-12-25T15:40:00+00:00",
  "date_from_url": "2014-12-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://nypost.com/2014/12/25/plane-passenger-tossed-after-angry-reaction-to-merry-christmas/\">not how you respond</a> to holiday well-wishers:</p><blockquote class=\"tr_bq\"><p> A passenger was tossed off a plane at La Guardia Airport on Tuesday after flipping out — because airline workers wished him a merry Christmas.</p><p>The man was waiting to board American Airlines Flight 1140 to Dallas when a cheerful gate agent began welcoming everyone with the Yuletide greeting while checking boarding passes. The grumpy passenger, who appeared to be traveling alone, barked at the woman, “You shouldn’t say that because not everyone celebrates Christmas.”</p><p>The agent replied, “Well, what should I say then?”</p><p>“Don’t say, ‘Merry Christmas!’ ” the man shouted before brushing past her.</p><p>Once on the plane, he was warmly greeted by a flight attendant who also wished him a “merry Christmas.” That was the last straw.</p><p>“Don’t say, ‘Merry Christmas!’ ” the man raged before lecturing the attendants and the pilot about their faux pas.</p></blockquote><p>I have to admit, I not only don’t celebrate them, but I don’t even know what half the festivals represented <i>are </i>when people wish me “buona festa” over the course of the year. During certain summer months nary a week goes by that everyone isn’t off work for some Catholic feast or Communist-created celebration of the working class. And it has never once occurred to me to respond by explaining that I do not celebrate the Feast of the Immaculate Conception, Labor Day, or <i>la Festa della Repubblica</i> to anyone.</p><p>My usual response on such occasions is the same as that of my Jewish friend, who smiles and says “thank you, you too” whenever he is wished a Merry Christmas. If nothing else, it’s nice to see people who are in a good mood while out and about.</p><p>That’s the practical aspect. From philosophical perspective, it must be admitted that whether one celebrates a holiday or not, it indubitably and materially <i>exists</i>. One would assume that any genuinely <i>rational </i>atheist would understand that.</p></div>",
  "content_text": "This is\nnot how you respond\nto holiday well-wishers:\nA passenger was tossed off a plane at La Guardia Airport on Tuesday after flipping out — because airline workers wished him a merry Christmas.\nThe man was waiting to board American Airlines Flight 1140 to Dallas when a cheerful gate agent began welcoming everyone with the Yuletide greeting while checking boarding passes. The grumpy passenger, who appeared to be traveling alone, barked at the woman, “You shouldn’t say that because not everyone celebrates Christmas.”\nThe agent replied, “Well, what should I say then?”\n“Don’t say, ‘Merry Christmas!’ ” the man shouted before brushing past her.\nOnce on the plane, he was warmly greeted by a flight attendant who also wished him a “merry Christmas.” That was the last straw.\n“Don’t say, ‘Merry Christmas!’ ” the man raged before lecturing the attendants and the pilot about their faux pas.\nI have to admit, I not only don’t celebrate them, but I don’t even know what half the festivals represented\nare\nwhen people wish me “buona festa” over the course of the year. During certain summer months nary a week goes by that everyone isn’t off work for some Catholic feast or Communist-created celebration of the working class. And it has never once occurred to me to respond by explaining that I do not celebrate the Feast of the Immaculate Conception, Labor Day, or\nla Festa della Repubblica\nto anyone.\nMy usual response on such occasions is the same as that of my Jewish friend, who smiles and says “thank you, you too” whenever he is wished a Merry Christmas. If nothing else, it’s nice to see people who are in a good mood while out and about.\nThat’s the practical aspect. From philosophical perspective, it must be admitted that whether one celebrates a holiday or not, it indubitably and materially\nexists\n. One would assume that any genuinely\nrational\natheist would understand that.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-25T15:40:00+00:00"
}