{
  "url": "https://voxday.net/2014/12/12/ac-explains-why-misery-loves-company/",
  "scraped_at": "2025-12-16T12:37:59.842813",
  "title": "AC explains why misery loves company",
  "date_display": "December 12, 2014",
  "date_iso": "2014-12-12T11:28:00+00:00",
  "date_from_url": "2014-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://www.anonymousconservative.com/blog/rabbits-acclimatization-to-free-resources-and-the-drive-to-foment-unrest/\">an interesting, even ingenious explanation</a> for what strikes so many of us who are sane as inexplicable: why are the rabbits always so hell-bent on attacking those who have nothing to do with them and are not harming them in any way?</p><blockquote class=\"tr_bq\"><p> As things get worse, the stimulus required to irritate them to action<br> will grow ever less. Since the rabbit is too cowardly to attack their<br> enemy themselves, their go-to strategy will be to <a href=\"http://sanfrancisco.cbslocal.com/2014/12/08/woman-reportedly-goes-into-labor-while-stuck-in-traffic-after-protesters-shut-down-i-80-in-berkeley/\" title=\"Rabbits block traffic to protest Ferguson\">try and make everyone they see unhappy</a>, and turn any threat they can find in our populace upon the successful.</br></br></p><p>This strategy is an outgrowth of something innate to the undeveloped amygdalae – a fundamental, penetrating sense of helplessness. If your amygdala is developed, it has been developed through experience. When it encounters adversity, it scans your brain for a solution, finds it stored in memories of prior experiences, and it will then drive behaviors to address your adversity. As a self-sufficient non-rabbit, your amygdala will drive you to fix your own problems.</p><p>If, however your amygdala is not acclimated to adversity, then you will not be able to find a solution stored in your amygdala, and you will feel helpless. Once you are helpless, and your amygdala is applying aversive stimulus to drive you to take action, your focus will direct itself to making others solve your problems for you. Then, rather than fixing your problems yourself, you will focus on making everyone else miserable, in the hopes that to alleviate their misery they will solve your problem for you. Suddenly you are laying down in the middle of a freeway, basically telling other people that unless they fight your enemies for you and fix your problems on your behalf, you will stop traffic, and prevent them from getting home.</p></blockquote><p>One can observe signs of this even in their customary language. “This is a problem.” “Don’t you see how that is a problem?” “I find it troublesome.” “That is problematic.” “I have a real problem with that.” What they are really saying is “I have a problem: I am scared and unhappy. I want you to fix it for me.”</p><p>But because they are entirely irrational and less than entirely sane by any reasonable measure, the very last thing they are going to do is listen to you or permit you to address their actual problem. Instead, they’re going to try to control you, so that you will obey their inept direction in fixing what they perceive, wrongly, to be the problem. And even if the problem doesn’t get fixed – and it won’t – at least they get the satisfying relief of feeling that they are no longer helpless, because they are ordering you around.</p></div>",
  "content_text": "This is\nan interesting, even ingenious explanation\nfor what strikes so many of us who are sane as inexplicable: why are the rabbits always so hell-bent on attacking those who have nothing to do with them and are not harming them in any way?\nAs things get worse, the stimulus required to irritate them to action\nwill grow ever less. Since the rabbit is too cowardly to attack their\nenemy themselves, their go-to strategy will be to\ntry and make everyone they see unhappy\n, and turn any threat they can find in our populace upon the successful.\nThis strategy is an outgrowth of something innate to the undeveloped amygdalae – a fundamental, penetrating sense of helplessness. If your amygdala is developed, it has been developed through experience. When it encounters adversity, it scans your brain for a solution, finds it stored in memories of prior experiences, and it will then drive behaviors to address your adversity. As a self-sufficient non-rabbit, your amygdala will drive you to fix your own problems.\nIf, however your amygdala is not acclimated to adversity, then you will not be able to find a solution stored in your amygdala, and you will feel helpless. Once you are helpless, and your amygdala is applying aversive stimulus to drive you to take action, your focus will direct itself to making others solve your problems for you. Then, rather than fixing your problems yourself, you will focus on making everyone else miserable, in the hopes that to alleviate their misery they will solve your problem for you. Suddenly you are laying down in the middle of a freeway, basically telling other people that unless they fight your enemies for you and fix your problems on your behalf, you will stop traffic, and prevent them from getting home.\nOne can observe signs of this even in their customary language. “This is a problem.” “Don’t you see how that is a problem?” “I find it troublesome.” “That is problematic.” “I have a real problem with that.” What they are really saying is “I have a problem: I am scared and unhappy. I want you to fix it for me.”\nBut because they are entirely irrational and less than entirely sane by any reasonable measure, the very last thing they are going to do is listen to you or permit you to address their actual problem. Instead, they’re going to try to control you, so that you will obey their inept direction in fixing what they perceive, wrongly, to be the problem. And even if the problem doesn’t get fixed – and it won’t – at least they get the satisfying relief of feeling that they are no longer helpless, because they are ordering you around.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-12T11:28:00+00:00"
}