{
  "url": "https://voxday.net/2014/12/22/amazing-stories-reviews-john-c-wrig/",
  "scraped_at": "2025-12-16T12:39:16.288677",
  "title": "Amazing Stories reviews John C. Wright",
  "date_display": "December 22, 2014",
  "date_iso": "2014-12-22T17:30:00+00:00",
  "date_from_url": "2014-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Specifically, <em>The Book of Feasts &amp; Seasons</em>. You’ll want to <a href=\"http://amazingstoriesmag.com/2014/12/small-press-book-review-book-feasts-seasons-john-c-wright/\">read the whole thing</a>:</p><blockquote class=\"tr_bq\"><p> This week I’m reviewing a title that’s seasonal in nature, although<br> the seasons it deals with occur across an entire year rather than a<br> small part of the year. I’ve not read much of Mr. Wright’s work, but<br> what I have has been better written and more original than much of<br> what’s currently being published.</br></br></br></br></p><p>The same is true here. These stories have a great deal of depth, both<br> in the characters they’re about and the concepts with which they deal….Wright is an author who isn’t afraid to delve into deep topics. Some<br> of the themes here dealt with the nature of God, forgiveness, kindness,<br> racism, sacrifice, and second chances. A number of authors these days<br> try to deal with serious themes and issues in their fiction. Few are as<br> accomplished or as entertaining as Mr. Wright.</br></br></br></br></br></p><p><em>The Book of Feasts &amp; Seasons</em> is one of the best and most thought provoking books I’ve read in the past year. I highly recommend it.</p></blockquote><p>It’s perhaps worth noting that Mr. Wright’s <em><a href=\"http://www.amazon.com/Book-Feasts-Seasons-John-Wright-ebook/dp/B00QEDGIQW\"><b>The Book of Feasts &amp; Seasons</b></a> </em>has a 4.9/5 rating. But I find it a little surprising that of the six stories the reviewer deemed worthy of mention, none of them were the one I consider to be the best, namely, “The Parliament of Beasts and Birds”.</p></div>",
  "content_text": "Specifically,\nThe Book of Feasts & Seasons\n. You’ll want to\nread the whole thing\n:\nThis week I’m reviewing a title that’s seasonal in nature, although\nthe seasons it deals with occur across an entire year rather than a\nsmall part of the year. I’ve not read much of Mr. Wright’s work, but\nwhat I have has been better written and more original than much of\nwhat’s currently being published.\nThe same is true here. These stories have a great deal of depth, both\nin the characters they’re about and the concepts with which they deal….Wright is an author who isn’t afraid to delve into deep topics. Some\nof the themes here dealt with the nature of God, forgiveness, kindness,\nracism, sacrifice, and second chances. A number of authors these days\ntry to deal with serious themes and issues in their fiction. Few are as\naccomplished or as entertaining as Mr. Wright.\nThe Book of Feasts & Seasons\nis one of the best and most thought provoking books I’ve read in the past year. I highly recommend it.\nIt’s perhaps worth noting that Mr. Wright’s\nThe Book of Feasts & Seasons\nhas a 4.9/5 rating. But I find it a little surprising that of the six stories the reviewer deemed worthy of mention, none of them were the one I consider to be the best, namely, “The Parliament of Beasts and Birds”.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-22T17:30:00+00:00"
}