{
  "url": "https://voxday.net/2014/12/10/another-republican-cave-in/",
  "scraped_at": "2025-12-16T12:37:52.858661",
  "title": "Another Republican cave-in",
  "date_display": "December 10, 2014",
  "date_iso": "2014-12-10T23:46:00+00:00",
  "date_from_url": "2014-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point, can anyone even pretend to be surprised?</p><blockquote class=\"tr_bq\"><p> IMMIGRATION:<br> The bill only funds the Department of Homeland Security, which oversees most immigration policy, until February. But negotiators gave new money for immigration programs at other federal agencies. There’s $948 million for the Department of Health and Human Service’s unaccompanied children program — an $80 million increase. The program provides health and education services to the young migrants. The department also gets $14 million to help school districts absorbing new immigrant students. And the State Department would get $260 million to assist Central American countries from where of the immigrant children are coming.</br></p><div class=\"subhead\"> AFFORDABLE CARE ACT:</div><p>The law is still<br> funded, but there’s no new money for it. There’s also no new ACA-related<br> funding for the Internal Revenue Service and the Centers for Medicare<br> and Medicaid Services, the two agencies most responsible for<br> implementing the law. The bill also would cut the budget of the<br> Independent Payment Advisory Board — what Republicans have called “the<br> death panel” — by $10 million.</br></br></br></br></br></br></p><div class=\"subhead\"> OVERSEAS MILITARY OPERATIONS:</div><p>There’s $1.3<br> billion for a new Counterterrorism Partnership Fund; $5 billion for<br> military operations to combat the Islamic State, including $1.6 billion<br> to train Iraqi and Kurdish forces; $500 million for a Pentagon-led<br> program to train and equip vetted Syrian opposition fighters; $810<br> million for ongoing military operations in Europe, including<br> requirements that at least $175 million is spent in support of Ukraine<br> and Baltic nation</br></br></br></br></br></br></br></p><div class=\"subhead\"> SEXUAL ASSAULT IN THE MILITARY:</div><p>There’s<br> $257 million for the Pentagon’s Sexual Assault Prevention and Response<br> programs, including $25 million more to expand the Sexual Assault<br> Victims’ Counsel program. But Democrats, led by Sen. Kirsten Gillibrand<br> (D-N.Y.), are expected to make a final push to expand the program this<br> week.</br></br></br></br></br></p></blockquote><p>As Drudge puts it: “REPUBLICAN BETRAYAL: OBAMACARE FULLY FUNDED AMNESTY TOO!”</p><p>But no doubt Republican lawmakers will hasten to point out that there is no ADDITIONAL money for Obamacare. By Washington standards, that counts as a severe budget cut.</p></div>",
  "content_text": "At this point, can anyone even pretend to be surprised?\nIMMIGRATION:\nThe bill only funds the Department of Homeland Security, which oversees most immigration policy, until February. But negotiators gave new money for immigration programs at other federal agencies. There’s $948 million for the Department of Health and Human Service’s unaccompanied children program — an $80 million increase. The program provides health and education services to the young migrants. The department also gets $14 million to help school districts absorbing new immigrant students. And the State Department would get $260 million to assist Central American countries from where of the immigrant children are coming.\nAFFORDABLE CARE ACT:\nThe law is still\nfunded, but there’s no new money for it. There’s also no new ACA-related\nfunding for the Internal Revenue Service and the Centers for Medicare\nand Medicaid Services, the two agencies most responsible for\nimplementing the law. The bill also would cut the budget of the\nIndependent Payment Advisory Board — what Republicans have called “the\ndeath panel” — by $10 million.\nOVERSEAS MILITARY OPERATIONS:\nThere’s $1.3\nbillion for a new Counterterrorism Partnership Fund; $5 billion for\nmilitary operations to combat the Islamic State, including $1.6 billion\nto train Iraqi and Kurdish forces; $500 million for a Pentagon-led\nprogram to train and equip vetted Syrian opposition fighters; $810\nmillion for ongoing military operations in Europe, including\nrequirements that at least $175 million is spent in support of Ukraine\nand Baltic nation\nSEXUAL ASSAULT IN THE MILITARY:\nThere’s\n$257 million for the Pentagon’s Sexual Assault Prevention and Response\nprograms, including $25 million more to expand the Sexual Assault\nVictims’ Counsel program. But Democrats, led by Sen. Kirsten Gillibrand\n(D-N.Y.), are expected to make a final push to expand the program this\nweek.\nAs Drudge puts it: “REPUBLICAN BETRAYAL: OBAMACARE FULLY FUNDED AMNESTY TOO!”\nBut no doubt Republican lawmakers will hasten to point out that there is no ADDITIONAL money for Obamacare. By Washington standards, that counts as a severe budget cut.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-10T23:46:00+00:00"
}