{
  "url": "https://voxday.net/2014/12/19/art-by-andrews-friends/",
  "scraped_at": "2025-12-16T12:38:59.490934",
  "title": "Art by Andrew’s friends",
  "date_display": "December 19, 2014",
  "date_iso": "2014-12-19T20:27:00+00:00",
  "date_from_url": "2014-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"//www.youtube.com/embed/7b9Vce5roOc?feature=player_detailpage\" width=\"512\"></iframe></p><p>Great stuff! And perhaps I can help clarify something: <i>“Markku from Vox Popoli is proud because he can figure out my exact age<br> based on this statement. I don’t know what he plans to do with it, nor<br> why he decided to gather such information in the most roundabout way<br> possible.”</br></br></br></i></p><p>Well, the first thing that comes to mind is that knowing the exact age is useful when looking up arrest records, birth certificates, and social security numbers. <i>“H is for Home town: I was born in Newton.”</i> Especially when someone is openly announcing their intention of stalking someone and vandalizing their property.<br> <i><br/></i><br> <i>“Colorado is basically a rectangle and I know nothing about it and never plan to go there. Except to egg Dan Simmons’ house.”</i></br></br></p><p>But I suppose we should spare some sympathy for him. After all, we are reliably informed that he is <a href=\"http://yamamanama.livejournal.com/2014/01/25/\">motivated by lovesickness</a>.<br> <i> </i><br> <i>I finally talked to Adara (you’ll have to go back as far as “brains, a<br> heart, a ride in a balloon” in October of 2008; there was a whole series<br> of entries about it but that never really went anywhere, maybe because I<br> was asking all the wrong people, and that’s what the title refers to,<br> I’m not going anywhere*). It was a briefer and more pleasant<br> conversation than I ever expected. I asked her to comment here, the<br> decision is hers to make, and I haven’t gotten a response to that yet…. I<br> had this thought lingering for a while, but I didn’t want to say<br> anything for fear that it would come back to bite me in the ass: I asked<br> Xpander to try contacting Miyomi, and then I was wondering if Miyomi<br> was on to me, or perhaps he didn’t ask and was going to shrug his<br> shoulders and say “she’s not in contact with her” some time in 2016, and<br> I figure if you’re going to lie about something like that, you should<br> wait a week tops. </br></br></br></br></br></br></br></br></br></br></br></br></br></i></br></br></p></div>",
  "content_text": "Great stuff! And perhaps I can help clarify something:\n“Markku from Vox Popoli is proud because he can figure out my exact age\nbased on this statement. I don’t know what he plans to do with it, nor\nwhy he decided to gather such information in the most roundabout way\npossible.”\nWell, the first thing that comes to mind is that knowing the exact age is useful when looking up arrest records, birth certificates, and social security numbers.\n“H is for Home town: I was born in Newton.”\nEspecially when someone is openly announcing their intention of stalking someone and vandalizing their property.\n“Colorado is basically a rectangle and I know nothing about it and never plan to go there. Except to egg Dan Simmons’ house.”\nBut I suppose we should spare some sympathy for him. After all, we are reliably informed that he is\nmotivated by lovesickness\n.\nI finally talked to Adara (you’ll have to go back as far as “brains, a\nheart, a ride in a balloon” in October of 2008; there was a whole series\nof entries about it but that never really went anywhere, maybe because I\nwas asking all the wrong people, and that’s what the title refers to,\nI’m not going anywhere*). It was a briefer and more pleasant\nconversation than I ever expected. I asked her to comment here, the\ndecision is hers to make, and I haven’t gotten a response to that yet…. I\nhad this thought lingering for a while, but I didn’t want to say\nanything for fear that it would come back to bite me in the ass: I asked\nXpander to try contacting Miyomi, and then I was wondering if Miyomi\nwas on to me, or perhaps he didn’t ask and was going to shrug his\nshoulders and say “she’s not in contact with her” some time in 2016, and\nI figure if you’re going to lie about something like that, you should\nwait a week tops.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-19T20:27:00+00:00"
}