{
  "url": "https://voxday.net/2014/12/22/art-and-trolls-acquaintance/",
  "scraped_at": "2025-12-16T12:39:14.832803",
  "title": "Art and the troll’s acquaintance",
  "date_display": "December 22, 2014",
  "date_iso": "2014-12-22T13:30:00+00:00",
  "date_from_url": "2014-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://36.media.tumblr.com/a3642ea09f40e5eadca76bc27645cf72/tumblr_mgxy45h3K51s3agflo1_1280.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"372\" src=\"http://36.media.tumblr.com/a3642ea09f40e5eadca76bc27645cf72/tumblr_mgxy45h3K51s3agflo1_1280.jpg\" width=\"400\"/></a></div><p> @Pure, Impure thought this piece of art was worth noting. I’m not sure why, but then, I am not a visual artist. But I always find it worthwhile to discover what the would-be critic finds  praiseworthy before either dismissing his criticism or taking it seriously. And while I am not a visual artist, I thought the self-portrait looked familiar. I was, in fact, correct.</p><p>The amusing thing was that when I contacted the artist to confirm Pure, Impure’s identity, she initially pretended not to know of him. She even commented that he sounded like “a real dick”. Unfortunately, it was not possible to simply take her at her word given that one arrives at the same artist’s Tumblr account by following a) Yama’s <a href=\"http://yamamanama.livejournal.com/230610.html\">LiveJournal</a>, b) @pure, impure’s <a href=\"https://twitter.com/pure_impure/status/360235073888452609\">Twitter account</a>, or c) her own LinkedIn account.</p><p>It appears, however, that she is a mere acquaintance of the individual in question, and not an actual friend. And she did appear to have been previously unfamiliar with his online activities.</p><p>In any event, several other individuals have already agreed to provide affadavits concerning their cyberstalking by the individual known variously as: Yamamanama, Dan Picaro, Andthestarshine, Kasa the Wicked, Nikola, Alauda, Arachnothera, Beardsley McTurbanhead, Chokley Carmichael, Clamps, Comrade Questions, Daphis, Daphnis, Freddy Foreshadowing, Luscinia, Luscinia Hafez, Starshine, Sunlight, Will, Will Le Fey, Yama, Yama the Space Fish, <strike>Gobbler</strike>, Count Bullets-ula, N.T.A., <strike>Hazel-Jeu</strike>, Lilacanddatura, Phoenixwing667, Darkprophet667, and @Pure, Impure.</p><p>If you have been cyberstalked by the individual using any of the above names and would like to see it stopped, please email me for instructions. And for those who ask why I am bothering to address this matter, the answer is that 56 months is a sufficiently long time to have put up with this criminal harassment and it takes me considerably less time to place a few calls and do a little research than it does to delete the stalker’s comments almost every single day.  Also, it is considerably more entertaining.</p><p>And to Yama himself, this:</p><p>I’m now giving you the opportunity to turn yourself in, admit your<br> crimes, and ask for leniency. If you do, I will speak up for you on your behalf and welcome you here in your true identity. If you do not, no mercy will be shown to you<br> from those you have harassed for the last 11 years. Do not think I’m the<br> only one involved here. I have contacted many of those you have harassed in the<br> past, and several of them are quite willing to swear out affadavits<br> against you.</br></br></br></br></br></p><p>I’m not bluffing, Yama. This is really happening. I<br> don’t know what the eventual consequences for you will be, but I<br> strongly encourage you to repent and turn from the path you are on<br> before you make matters any worse for yourself. You are only thirty years old, there is still plenty of time for you to turn your life around and make something meaningful of yourself. You are not happy. You are miserable. You are lonely and full of hate. That is not the result of what has been done to you by the evil and rejection of men, it is the result of the path you are walking, which leads inevitably to destruction.</br></br></br></p><p>And what has it ever done for you that you should cling to it in such a determined fashion?</p></div>",
  "content_text": "@Pure, Impure thought this piece of art was worth noting. I’m not sure why, but then, I am not a visual artist. But I always find it worthwhile to discover what the would-be critic finds  praiseworthy before either dismissing his criticism or taking it seriously. And while I am not a visual artist, I thought the self-portrait looked familiar. I was, in fact, correct.\nThe amusing thing was that when I contacted the artist to confirm Pure, Impure’s identity, she initially pretended not to know of him. She even commented that he sounded like “a real dick”. Unfortunately, it was not possible to simply take her at her word given that one arrives at the same artist’s Tumblr account by following a) Yama’s\nLiveJournal\n, b) @pure, impure’s\nTwitter account\n, or c) her own LinkedIn account.\nIt appears, however, that she is a mere acquaintance of the individual in question, and not an actual friend. And she did appear to have been previously unfamiliar with his online activities.\nIn any event, several other individuals have already agreed to provide affadavits concerning their cyberstalking by the individual known variously as: Yamamanama, Dan Picaro, Andthestarshine, Kasa the Wicked, Nikola, Alauda, Arachnothera, Beardsley McTurbanhead, Chokley Carmichael, Clamps, Comrade Questions, Daphis, Daphnis, Freddy Foreshadowing, Luscinia, Luscinia Hafez, Starshine, Sunlight, Will, Will Le Fey, Yama, Yama the Space Fish,\nGobbler\n, Count Bullets-ula, N.T.A.,\nHazel-Jeu\n, Lilacanddatura, Phoenixwing667, Darkprophet667, and @Pure, Impure.\nIf you have been cyberstalked by the individual using any of the above names and would like to see it stopped, please email me for instructions. And for those who ask why I am bothering to address this matter, the answer is that 56 months is a sufficiently long time to have put up with this criminal harassment and it takes me considerably less time to place a few calls and do a little research than it does to delete the stalker’s comments almost every single day.  Also, it is considerably more entertaining.\nAnd to Yama himself, this:\nI’m now giving you the opportunity to turn yourself in, admit your\ncrimes, and ask for leniency. If you do, I will speak up for you on your behalf and welcome you here in your true identity. If you do not, no mercy will be shown to you\nfrom those you have harassed for the last 11 years. Do not think I’m the\nonly one involved here. I have contacted many of those you have harassed in the\npast, and several of them are quite willing to swear out affadavits\nagainst you.\nI’m not bluffing, Yama. This is really happening. I\ndon’t know what the eventual consequences for you will be, but I\nstrongly encourage you to repent and turn from the path you are on\nbefore you make matters any worse for yourself. You are only thirty years old, there is still plenty of time for you to turn your life around and make something meaningful of yourself. You are not happy. You are miserable. You are lonely and full of hate. That is not the result of what has been done to you by the evil and rejection of men, it is the result of the path you are walking, which leads inevitably to destruction.\nAnd what has it ever done for you that you should cling to it in such a determined fashion?",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-22T13:30:00+00:00"
}