{
  "url": "https://voxday.net/2014/12/17/correia-on-guns-etc/",
  "scraped_at": "2025-12-16T12:38:41.490372",
  "title": "Correia on guns, etc",
  "date_display": "December 17, 2014",
  "date_iso": "2014-12-17T11:47:00+00:00",
  "date_from_url": "2014-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An interview on <a href=\"http://ryanlanz.com/2014/12/13/guns-in-fiction-with-larry-correia/\">guns in fiction</a>:</p><blockquote class=\"tr_bq\"><p> <b>Ryan:</b> What are the common pitfalls in fiction where it’s clear that the author has never held or fired a modern firearm?</p><p><b>Larry:</b> It isn’t just guns, but any topic where the<br> reader is an expert and the author is clueless. The problem is that when<br> you write something that the reader knows is terribly wrong, it kicks<br> them right out of the story and ruins the experience for them. Guns are<br> especially hard because they are super common in fiction, and there are<br> tons of readers who know about them.</br></br></br></br></br></p><p>Most of these really glaring errors can be taken care of with a<br> little bit of cursory research. Technical things can be taken care of by<br> a few minutes on the manufacturer’s webpage, which will keep your<br> characters from dramatically flipping off the safety on a gun that<br> doesn’t have one.</br></br></br></br></p><p>Beyond that, however, is the actual use of the gun. The character<br> using it should have a realistic amount of knowledge based on their<br> skill, knowledge, ability, and training. If you are gong to be writing<br> about a character who is a professional gunslinger, then you need to do<br> some research to make sure that person does what a professional<br> gunslinger would do.</br></br></br></br></br></p></blockquote><p>And speaking of Larry Correia, Daniel somehow manages to abuse a writer at the Atlantic even more comprehensively than Larry’s customary prison-raping of various Guardian contributors in <a href=\"http://www.castaliahouse.com/the-wrong-corpse-and-the-highbrow-coroner/\">The Wrong Corpse and the Highbrow Coroner</a>:</p><blockquote class=\"tr_bq\"><p> Noah Berlatsky at <i>The Atlantic </i>declares science fiction dead of terminal nostalgia:</p><p>    <i>Poor George Orwell wants his panopticon back.</i></p><p>He also quotes an important fresh voice in science fiction that:</p><p><i>“we will be wanting the voices of writers who can see alternatives to how we live now and can see through our fear-stricken society and its obsessive technologies to other ways of being, and even imagine some real grounds for hope.”</i></p><p>Then he spends the rest of the article writing about Marvel comic books and their related movies.</p><p>The thesis, that science fiction has lost its way in a retrospective swamp of camp nostalgia for Star Wars, Star Trek and comic books is a bait-and-switch, however:</p><p><i>    Science fiction is everywhere in popular culture, and it seems like it’s managed to be everywhere in the present by largely jettisoning the future.</i></p><p>Berlatsky has switched terms on the reader. He isn’t talking about science fiction as a genre, he’s complaining about pop culture, as if that has anything to do with the core idea factory of science fiction, which, and always has been, books.</p><p>It does not.</p><p>If the reader needs any more confirmation, the critic’s only example of a “current” science fiction writer whose ideas run counter to the prison of pop culture is…Octavia Butler, a prog-writer who has been dead for nearly a decade, and whose most prominent work is more than thirty years past its publication date.</p></blockquote><p>The ironic thing is that Berlatsky may well have a credible defense in resorting to the example chosen. The corpse of the late Octavia Butler, as it rots and feeds the worms, is arguably producing more interesting, less noxious output than are the Pink SF writers giving each other awards these days.</p></div>",
  "content_text": "An interview on\nguns in fiction\n:\nRyan:\nWhat are the common pitfalls in fiction where it’s clear that the author has never held or fired a modern firearm?\nLarry:\nIt isn’t just guns, but any topic where the\nreader is an expert and the author is clueless. The problem is that when\nyou write something that the reader knows is terribly wrong, it kicks\nthem right out of the story and ruins the experience for them. Guns are\nespecially hard because they are super common in fiction, and there are\ntons of readers who know about them.\nMost of these really glaring errors can be taken care of with a\nlittle bit of cursory research. Technical things can be taken care of by\na few minutes on the manufacturer’s webpage, which will keep your\ncharacters from dramatically flipping off the safety on a gun that\ndoesn’t have one.\nBeyond that, however, is the actual use of the gun. The character\nusing it should have a realistic amount of knowledge based on their\nskill, knowledge, ability, and training. If you are gong to be writing\nabout a character who is a professional gunslinger, then you need to do\nsome research to make sure that person does what a professional\ngunslinger would do.\nAnd speaking of Larry Correia, Daniel somehow manages to abuse a writer at the Atlantic even more comprehensively than Larry’s customary prison-raping of various Guardian contributors in\nThe Wrong Corpse and the Highbrow Coroner\n:\nNoah Berlatsky at\nThe Atlantic\ndeclares science fiction dead of terminal nostalgia:\nPoor George Orwell wants his panopticon back.\nHe also quotes an important fresh voice in science fiction that:\n“we will be wanting the voices of writers who can see alternatives to how we live now and can see through our fear-stricken society and its obsessive technologies to other ways of being, and even imagine some real grounds for hope.”\nThen he spends the rest of the article writing about Marvel comic books and their related movies.\nThe thesis, that science fiction has lost its way in a retrospective swamp of camp nostalgia for Star Wars, Star Trek and comic books is a bait-and-switch, however:\nScience fiction is everywhere in popular culture, and it seems like it’s managed to be everywhere in the present by largely jettisoning the future.\nBerlatsky has switched terms on the reader. He isn’t talking about science fiction as a genre, he’s complaining about pop culture, as if that has anything to do with the core idea factory of science fiction, which, and always has been, books.\nIt does not.\nIf the reader needs any more confirmation, the critic’s only example of a “current” science fiction writer whose ideas run counter to the prison of pop culture is…Octavia Butler, a prog-writer who has been dead for nearly a decade, and whose most prominent work is more than thirty years past its publication date.\nThe ironic thing is that Berlatsky may well have a credible defense in resorting to the example chosen. The corpse of the late Octavia Butler, as it rots and feeds the worms, is arguably producing more interesting, less noxious output than are the Pink SF writers giving each other awards these days.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-17T11:47:00+00:00"
}