{
  "url": "https://voxday.net/2014/12/20/female-intelligence/",
  "scraped_at": "2025-12-16T12:39:03.122587",
  "title": "Female intelligence",
  "date_display": "December 20, 2014",
  "date_iso": "2014-12-20T14:00:00+00:00",
  "date_from_url": "2014-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> It appears the Female Imperative now takes precedence <a href=\"http://www.newyorker.com/news/news-desk/unidentified-queen-torture\">over national security</a>:</p><blockquote class=\"tr_bq\"><p> For the past eight months, there has<br> been a furious battle raging behind closed doors at the White House,<br> the C.I.A., and in Congress. The question has been whether the Senate<br> Select Committee on Intelligence would be allowed to use pseudonyms as a<br> means of identifying characters in the <a href=\"http://www.newyorker.com/magazine/2014/12/22/torture-truth\">devastating report</a><br> it released last week on the C.I.A.’s abusive interrogation and<br> detention program. Ultimately, the committee was not allowed to, and now<br> we know one reason why.</br></br></br></br></br></br></br></p><p>The NBC News investigative reporter Matthew Cole has pieced together a <a href=\"http://www.nbcnews.com/news/investigations/bin-laden-expert-accused-shaping-cia-deception-torture-program-n269551\" rel=\"noopener\" target=\"_blank\">remarkable story</a><br> revealing that a single senior officer, who is still in a position of<br> high authority over counterterrorism at the C.I.A.—a woman who he does<br> not name—appears to have been a source of years’ worth of terrible<br> judgment, with tragic consequences for the United States. Her story runs<br> through the entire report. She dropped the ball when the C.I.A. was<br> given information that might very well have prevented the 9/11 attacks;<br> she gleefully participated in torture sessions afterward; she<br> misinterpreted intelligence in such a way that it sent the C.I.A. on an<br> absurd chase for Al Qaeda sleeper cells in Montana. And then she falsely<br> told congressional overseers that the torture worked.</br></br></br></br></br></br></br></br></br></br></p><p>Had the Senate Intelligence Committee been permitted to use pseudonyms for<br> the central characters in its report, as all previous congressional<br> studies of intelligence failures, including the widely heralded Church<br> Committee report in 1975, have done, it might not have taken a<br> painstaking, and still somewhat cryptic, investigation after the fact in<br> order for the American public to hold this senior official accountable.<br> Many people who have worked with her over the years expressed shock to<br> NBC that she has been entrusted with so much power. A former<br> intelligence officer who worked directly with her is quoted by NBC, on<br> background, as saying that she bears so much responsibility for so many<br> intelligence failures that “she should be put on trial and put in jail<br> for what she has done.”</br></br></br></br></br></br></br></br></br></br></br></p><p>Instead, however, she has<br> been promoted to the rank of a general in the military, most recently<br> working as the head of the C.I.A.’s global-jihad unit. In that perch,<br> she oversees the targeting of terror suspects around the world. (She was<br> also, in part, the model for the lead character in “Zero Dark Thirty.”)</br></br></br></br></p></blockquote><p>This is an example of another reason not to permit women in the military. Women are not considered to be fully accountable in modern American society, and soldiers who are unaccountable to civilian leadership are not desirable in anything that still pretends to be a free society.</p></div>",
  "content_text": "It appears the Female Imperative now takes precedence\nover national security\n:\nFor the past eight months, there has\nbeen a furious battle raging behind closed doors at the White House,\nthe C.I.A., and in Congress. The question has been whether the Senate\nSelect Committee on Intelligence would be allowed to use pseudonyms as a\nmeans of identifying characters in the\ndevastating report\nit released last week on the C.I.A.’s abusive interrogation and\ndetention program. Ultimately, the committee was not allowed to, and now\nwe know one reason why.\nThe NBC News investigative reporter Matthew Cole has pieced together a\nremarkable story\nrevealing that a single senior officer, who is still in a position of\nhigh authority over counterterrorism at the C.I.A.—a woman who he does\nnot name—appears to have been a source of years’ worth of terrible\njudgment, with tragic consequences for the United States. Her story runs\nthrough the entire report. She dropped the ball when the C.I.A. was\ngiven information that might very well have prevented the 9/11 attacks;\nshe gleefully participated in torture sessions afterward; she\nmisinterpreted intelligence in such a way that it sent the C.I.A. on an\nabsurd chase for Al Qaeda sleeper cells in Montana. And then she falsely\ntold congressional overseers that the torture worked.\nHad the Senate Intelligence Committee been permitted to use pseudonyms for\nthe central characters in its report, as all previous congressional\nstudies of intelligence failures, including the widely heralded Church\nCommittee report in 1975, have done, it might not have taken a\npainstaking, and still somewhat cryptic, investigation after the fact in\norder for the American public to hold this senior official accountable.\nMany people who have worked with her over the years expressed shock to\nNBC that she has been entrusted with so much power. A former\nintelligence officer who worked directly with her is quoted by NBC, on\nbackground, as saying that she bears so much responsibility for so many\nintelligence failures that “she should be put on trial and put in jail\nfor what she has done.”\nInstead, however, she has\nbeen promoted to the rank of a general in the military, most recently\nworking as the head of the C.I.A.’s global-jihad unit. In that perch,\nshe oversees the targeting of terror suspects around the world. (She was\nalso, in part, the model for the lead character in “Zero Dark Thirty.”)\nThis is an example of another reason not to permit women in the military. Women are not considered to be fully accountable in modern American society, and soldiers who are unaccountable to civilian leadership are not desirable in anything that still pretends to be a free society.",
  "tags": [
    "decline and fall",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-20T14:00:00+00:00"
}