{
  "url": "https://voxday.net/2014/12/12/gamergate-crushed-gawker/",
  "scraped_at": "2025-12-16T12:38:05.333262",
  "title": "#GamerGate crushed Gawker",
  "date_display": "December 12, 2014",
  "date_iso": "2014-12-12T19:51:00+00:00",
  "date_from_url": "2014-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nero reports on <a href=\"http://www.breitbart.com/Breitbart-London/2014/12/11/GamerGate-Anti-Bullying-Campaign-cost-Gawker-over-a-Million-Dollars\">the costs to Gawker</a> of attacking #GamerGate:</p><blockquote class=\"tr_bq\"><p> The cost to Gawker Media of its ridicule and viciousness toward video gamers was “seven figures” in lost advertising revenue, according to the company’s head of advertising, Andrew Gorenstein. In addition, founder Nick Denton has stepped down as president and editorial director Joel Johnson has been removed from his post and will probably leave the company, reports Capital New York….</p></blockquote><p>And now here is a chance to kick the SJW while he’s down. An Ilk suggests action:<br> A few of us were inspired by that stupid Change.org petition that got GTA5 banned to try to use the same tactic against Gawker’s biggest revenue sources. I figure it may be especially effective to kick them when they’re already reeling from the previous damage we’ve done, while Hulk Hogan’s suit and their insurance company threaten to bleed them further. The petition is here: <a href=\"https://www.change.org/p/amazon-com-get-google-and-amazon-to-stop-advertising-on-gawker-media?just_created=true\">Get Google and Amazon to stop advertising on Gawker Media</a>.</br></p><p>We’d<br> like to spread this around and get the signature count up before<br> posting it in the usual GamerGate avenues (ie our Twitter accounts,<br> 8chan, KotakuInAction), so that anti-GamerGate won’t know it’s happening,<br> and won’t realize that it’s coming from us or be able to respond to it until it’s too late for them to do anything about it.</br></br></br></br></p><p>They’re down. Kick them hard and keep them there.</p></div>",
  "content_text": "Nero reports on\nthe costs to Gawker\nof attacking #GamerGate:\nThe cost to Gawker Media of its ridicule and viciousness toward video gamers was “seven figures” in lost advertising revenue, according to the company’s head of advertising, Andrew Gorenstein. In addition, founder Nick Denton has stepped down as president and editorial director Joel Johnson has been removed from his post and will probably leave the company, reports Capital New York….\nAnd now here is a chance to kick the SJW while he’s down. An Ilk suggests action:\nA few of us were inspired by that stupid Change.org petition that got GTA5 banned to try to use the same tactic against Gawker’s biggest revenue sources. I figure it may be especially effective to kick them when they’re already reeling from the previous damage we’ve done, while Hulk Hogan’s suit and their insurance company threaten to bleed them further. The petition is here:\nGet Google and Amazon to stop advertising on Gawker Media\n.\nWe’d\nlike to spread this around and get the signature count up before\nposting it in the usual GamerGate avenues (ie our Twitter accounts,\n8chan, KotakuInAction), so that anti-GamerGate won’t know it’s happening,\nand won’t realize that it’s coming from us or be able to respond to it until it’s too late for them to do anything about it.\nThey’re down. Kick them hard and keep them there.",
  "tags": [
    "games",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-12T19:51:00+00:00"
}