{
  "url": "https://voxday.net/2014/12/13/honor-martyrs/",
  "scraped_at": "2025-12-16T12:38:07.177906",
  "title": "Honor the martyrs",
  "date_display": "December 13, 2014",
  "date_iso": "2014-12-13T10:35:00+00:00",
  "date_from_url": "2014-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christianity <a href=\"http://www.dailymail.co.uk/news/article-2871508/Four-young-Christians-brutally-beheaded-ISIS-Iraq-refusing-convert-Islam-says-Vicar-Baghdad-Canon-Andrew-White.html\">is being eradicated in the Middle East</a> by the religion of the sword:</p><blockquote class=\"tr_bq\"><p> Four young Christians were brutally beheaded by ISIS in Iraq for refusing to convert to Islam, according to a British reverend forced to flee the country. Canon Andrew White, known as the Vicar of Baghdad, told the horrifying story how of the youths, all under 15, were murdered for standing up to the jihadists.</p><p>The vicar of the city’s St George’s Church, the only Anglican church in the whole of Iraq, has had to leave the country for Israel amid constant threats on his life by Islamic State. In a harrowing interview with the Orthodox Christian Network, he said ISIS had killed ‘huge numbers’ of believers in Jesus.</p><p>‘Islamic State turned up and said to the children, “you say the words that you will follow Mohammad”’, he said, his voice cracking with emotion.</p><p>‘The children, all under 15, four of them, said “no, we love Yesua; we have always loved Yesua; we have always followed Yesua; Yesua has always been with us”.</p><p>‘They [ISIS] said, “Say the words.” They [the children] said, “No, we can’t”.</p><p>‘They chopped all their heads off. How do you respond to that? You just cry. They are my children. That is what we have been going through and that is what we are going through.’</p></blockquote><p>Honor the faith of the four young martyrs by reaffirming your own. And note this: <i>“Iraq had 1.5 million Christians before the US-led invasion in 2003, but now all that are left are 250,000 who have been displaced from their homes in the north of the country by the advance of ISIS.” </i></p><p>Eventually, there will be those who can do more than cry. I suspect it will not be more than 20 years before the new Martel appears and the Reconquista 2.0 begins. The Tenth Crusade will be fought in the West, in both Europe and America, and it will last decades.</p><p>The Norwegians are already taking action. The Swedes are waking up. The French are actively voting. And the Germans are rising. Slowly but surely, they are waking up. <i>“The latest PEGIDA march on Monday drew up to 10,000 people.”  </i>PEGIDA stands for Patriotische Europäer Gegen die Islamisierung des Abendlandes.<i> </i>Patriotic Europeans Against the Islamicization of the West<i>.</i></p><p>And soon the Saxon will begin to hate. That is when the anti-Western politicians will be removed from power. That is when the Western nations will rise. And that is when <a href=\"http://www.telegraph.co.uk/comment/3643826/Enoch-Powells-Rivers-of-Blood-speech.html\">Enoch Powell’s long-predicted Rivers of Blood</a> will begin to flow.</p><blockquote class=\"tr_bq\"><p> The supreme function of statesmanship is to provide against preventable evils. In seeking to do so, it encounters obstacles which are deeply rooted in human nature.</p><p>One is that by the very order of things such evils are not demonstrable until they have occurred: at each stage in their onset there is room for doubt and for dispute whether they be real or imaginary. By the same token, they attract little attention in comparison with current troubles, which are both indisputable and pressing: whence the besetting temptation of all politics to concern itself with the immediate present at the expense of the future.</p><p>Above all, people are disposed to mistake predicting troubles for causing troubles and even for desiring troubles…. As I look ahead, I am filled with foreboding; like the Roman, I seem to see “the River Tiber foaming with much blood.”<br> That tragic and intractable phenomenon which we watch with<br> horror on the other side of the Atlantic but which there is interwoven<br> with the history and existence of the States itself, is coming upon us<br> here by our own volition and our own neglect. Indeed, it has all but<br> come.</br></br></br></br></br></p></blockquote><p>Now it has come. The statesmen of the West have failed. The preventable evils were not prevented. Now they must play out, as history shows that they have always played out.</p></div>",
  "content_text": "Christianity\nis being eradicated in the Middle East\nby the religion of the sword:\nFour young Christians were brutally beheaded by ISIS in Iraq for refusing to convert to Islam, according to a British reverend forced to flee the country. Canon Andrew White, known as the Vicar of Baghdad, told the horrifying story how of the youths, all under 15, were murdered for standing up to the jihadists.\nThe vicar of the city’s St George’s Church, the only Anglican church in the whole of Iraq, has had to leave the country for Israel amid constant threats on his life by Islamic State. In a harrowing interview with the Orthodox Christian Network, he said ISIS had killed ‘huge numbers’ of believers in Jesus.\n‘Islamic State turned up and said to the children, “you say the words that you will follow Mohammad”’, he said, his voice cracking with emotion.\n‘The children, all under 15, four of them, said “no, we love Yesua; we have always loved Yesua; we have always followed Yesua; Yesua has always been with us”.\n‘They [ISIS] said, “Say the words.” They [the children] said, “No, we can’t”.\n‘They chopped all their heads off. How do you respond to that? You just cry. They are my children. That is what we have been going through and that is what we are going through.’\nHonor the faith of the four young martyrs by reaffirming your own. And note this:\n“Iraq had 1.5 million Christians before the US-led invasion in 2003, but now all that are left are 250,000 who have been displaced from their homes in the north of the country by the advance of ISIS.”\nEventually, there will be those who can do more than cry. I suspect it will not be more than 20 years before the new Martel appears and the Reconquista 2.0 begins. The Tenth Crusade will be fought in the West, in both Europe and America, and it will last decades.\nThe Norwegians are already taking action. The Swedes are waking up. The French are actively voting. And the Germans are rising. Slowly but surely, they are waking up.\n“The latest PEGIDA march on Monday drew up to 10,000 people.”\nPEGIDA stands for Patriotische Europäer Gegen die Islamisierung des Abendlandes.\nPatriotic Europeans Against the Islamicization of the West\n.\nAnd soon the Saxon will begin to hate. That is when the anti-Western politicians will be removed from power. That is when the Western nations will rise. And that is when\nEnoch Powell’s long-predicted Rivers of Blood\nwill begin to flow.\nThe supreme function of statesmanship is to provide against preventable evils. In seeking to do so, it encounters obstacles which are deeply rooted in human nature.\nOne is that by the very order of things such evils are not demonstrable until they have occurred: at each stage in their onset there is room for doubt and for dispute whether they be real or imaginary. By the same token, they attract little attention in comparison with current troubles, which are both indisputable and pressing: whence the besetting temptation of all politics to concern itself with the immediate present at the expense of the future.\nAbove all, people are disposed to mistake predicting troubles for causing troubles and even for desiring troubles…. As I look ahead, I am filled with foreboding; like the Roman, I seem to see “the River Tiber foaming with much blood.”\nThat tragic and intractable phenomenon which we watch with\nhorror on the other side of the Atlantic but which there is interwoven\nwith the history and existence of the States itself, is coming upon us\nhere by our own volition and our own neglect. Indeed, it has all but\ncome.\nNow it has come. The statesmen of the West have failed. The preventable evils were not prevented. Now they must play out, as history shows that they have always played out.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-13T10:35:00+00:00"
}