{
  "url": "https://voxday.net/2014/12/15/hostages-taken-in-sydney/",
  "scraped_at": "2025-12-16T12:38:19.778303",
  "title": "Hostages (13) taken in Sydney",
  "date_display": "December 15, 2014",
  "date_iso": "2014-12-15T00:54:00+00:00",
  "date_from_url": "2014-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.zerohedge.com/news/2014-12-14/13-hostages-taken-sydney-coffee-shop-jihadists-suspected-live-feed\">Zerohedge</a>: Only weeks after Australia broke up a plan by ISIS to publicly behead a member of public, reports suggest 2 gunmen are holding 13 hostages at a Lindt coffee-shop in Sydney, Australia. The terrorists have shown a black jihadist flag – which is not an IS flag – and has paraded the hostages at the windows. The coffee shop is directly across the street from the Reserve Bank of Australia.</p><p>    *LINDT AUSTRALIA CEO STEVE LOANE SPOKE BY PHONE<br>     *LINDT AUSTRALIA: PROBABLY ABOUT 30 CUSTOMERS IN SYDNEY CAFE<br>     *LINDT AUSTRALIA: ABOUT 10 STAFF WORKING IN SYDNEY CAFE TODAY</br></br></p><p>So, how about those hard-working Muslim immigrants, doing the jobs Australians won’t do!</p></div>",
  "content_text": "Zerohedge\n: Only weeks after Australia broke up a plan by ISIS to publicly behead a member of public, reports suggest 2 gunmen are holding 13 hostages at a Lindt coffee-shop in Sydney, Australia. The terrorists have shown a black jihadist flag – which is not an IS flag – and has paraded the hostages at the windows. The coffee shop is directly across the street from the Reserve Bank of Australia.\n*LINDT AUSTRALIA CEO STEVE LOANE SPOKE BY PHONE\n*LINDT AUSTRALIA: PROBABLY ABOUT 30 CUSTOMERS IN SYDNEY CAFE\n*LINDT AUSTRALIA: ABOUT 10 STAFF WORKING IN SYDNEY CAFE TODAY\nSo, how about those hard-working Muslim immigrants, doing the jobs Australians won’t do!",
  "tags": [
    "Clash of Civilizations",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-15T00:54:00+00:00"
}