{
  "url": "https://voxday.net/2014/12/18/how-to-lose-to-sjws/",
  "scraped_at": "2025-12-16T12:38:50.319291",
  "title": "How to lose to SJWs",
  "date_display": "December 18, 2014",
  "date_iso": "2014-12-18T13:30:00+00:00",
  "date_from_url": "2014-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is an example of someone who is on the right side, but doesn’t understand that you never win <a href=\"http://ninetofivegamer.wordpress.com/2014/12/17/the-culture-of-infallibility-that-surrounds-anita-sarkeesian/\">by spurning your allies</a>:</p><blockquote class=\"tr_bq\"><p> I felt like talking about this topic because I’ve noticed the ease of which people will dismiss you, especially if you happen to be on the other side of the Anita Sarkeesian/GamerGate argument and you’re not a woman-hating bastard.</p><p>Honestly it feels like I’m supposed to just keep my trap shut sometimes.</p><p>Now let me get one thing straight. By “Other side,” I don’t include the sexists, the woman haters and those who argue in bad faith. I mean people who have valid critiques of Anita Sarkeesian and others like her. What I noticed from my petition post was the willingness of the people arguing for Anita to not even bother to ask what my own opinion on her were. Instead my post was met with “ugh” and Feminist Frequency videos. Not once was I asked, “Well why are you against Anita? Is there any particular reason why you don’t want her working on Mirrors Edge 2?” These questions weren’t even asked until I pointed out the fact that they were willing to automatically go in on the attack before even knowing what my reasoning was.</p></blockquote><p>What he and other would-be moderates fail to realize is that the anti-GamerGate, pro-Sarkeesian, SJW side is not reasonable and is never going to be convinced by sweet reason. They have no interest in it and little capacity for it.</p><p>This is the same divide between dialectic and rhetoric that I keep pointing out to everyone. You do NOT fight a rhetorical battle with dialectic; in a rhetorical battle the only use for dialectic is in a rhetorical manner; it can be used to explode pseudo-dialectic poses, but that is the extent of its effectiveness. It is an intrinsically defensive weapon <i>on the rhetorical level</i>. This means you cannot win with it.</p><p>The primary difference between the Left and the Right is that the Left instinctively defends its extremists and the Right instinctively runs from them and leaves them out to dry. The latter is an appeasement strategy, and it works about as well as the infamous failures of appeasement we all know from history.</p><p>All appeasement does is signal to the SJW what buttons he needs to push in order to force an opponent to retreat. When you dutifully point out that “you don’t agree with everything X says” or “don’t include the sexists, the woman haters and those who argue in bad faith”, what you are accomplishing is not the inoculation of your argument from their extremist taint, you are telling the SJW exactly how he can rhetorically defeat you by painting you as the very sort of extremist you disavow. And remember, rhetorical victory is the entirety of their objective!</p><p>Embrace the extremists. Defend them. Refuse to permit them to be cut off and isolated. Allow them to play their role as the intellectual shock troops they are. That is how you win. Because if they’re not taking the incoming fire, you are. And the shock troops are much better equipped psychologically to take it and survive than the average self-styled moderate.</p></div>",
  "content_text": "Here is an example of someone who is on the right side, but doesn’t understand that you never win\nby spurning your allies\n:\nI felt like talking about this topic because I’ve noticed the ease of which people will dismiss you, especially if you happen to be on the other side of the Anita Sarkeesian/GamerGate argument and you’re not a woman-hating bastard.\nHonestly it feels like I’m supposed to just keep my trap shut sometimes.\nNow let me get one thing straight. By “Other side,” I don’t include the sexists, the woman haters and those who argue in bad faith. I mean people who have valid critiques of Anita Sarkeesian and others like her. What I noticed from my petition post was the willingness of the people arguing for Anita to not even bother to ask what my own opinion on her were. Instead my post was met with “ugh” and Feminist Frequency videos. Not once was I asked, “Well why are you against Anita? Is there any particular reason why you don’t want her working on Mirrors Edge 2?” These questions weren’t even asked until I pointed out the fact that they were willing to automatically go in on the attack before even knowing what my reasoning was.\nWhat he and other would-be moderates fail to realize is that the anti-GamerGate, pro-Sarkeesian, SJW side is not reasonable and is never going to be convinced by sweet reason. They have no interest in it and little capacity for it.\nThis is the same divide between dialectic and rhetoric that I keep pointing out to everyone. You do NOT fight a rhetorical battle with dialectic; in a rhetorical battle the only use for dialectic is in a rhetorical manner; it can be used to explode pseudo-dialectic poses, but that is the extent of its effectiveness. It is an intrinsically defensive weapon\non the rhetorical level\n. This means you cannot win with it.\nThe primary difference between the Left and the Right is that the Left instinctively defends its extremists and the Right instinctively runs from them and leaves them out to dry. The latter is an appeasement strategy, and it works about as well as the infamous failures of appeasement we all know from history.\nAll appeasement does is signal to the SJW what buttons he needs to push in order to force an opponent to retreat. When you dutifully point out that “you don’t agree with everything X says” or “don’t include the sexists, the woman haters and those who argue in bad faith”, what you are accomplishing is not the inoculation of your argument from their extremist taint, you are telling the SJW exactly how he can rhetorically defeat you by painting you as the very sort of extremist you disavow. And remember, rhetorical victory is the entirety of their objective!\nEmbrace the extremists. Defend them. Refuse to permit them to be cut off and isolated. Allow them to play their role as the intellectual shock troops they are. That is how you win. Because if they’re not taking the incoming fire, you are. And the shock troops are much better equipped psychologically to take it and survive than the average self-styled moderate.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-18T13:30:00+00:00"
}