{
  "url": "https://voxday.net/2014/12/07/iq-is-real-and-reliable/",
  "scraped_at": "2025-12-16T12:37:32.208221",
  "title": "IQ is real and reliable",
  "date_display": "December 7, 2014",
  "date_iso": "2014-12-07T16:00:00+00:00",
  "date_from_url": "2014-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jerry Pournelle talks about a past predictive program that was terminated <a href=\"http://www.jerrypournelle.com/chaosmanor/iq-and-education-resources/\">because it worked</a>:</p><blockquote class=\"tr_bq\"><p> I have a number of letters from people who try to account for differences in mean IQ among races – a phenomenon found and confirmed so often that it must be assumed to be true – by various factors, the most common of which is culture. A number of competent differential psychologists who would have wished to find that all those differences can be truly accounted for by cultural (and thus changeable) factors have devoted a great deal of effort to trying to prove that, and to eliminate all cultural factors from IQ tests, but they have not been able to do so….</p><p>There is no single item in any IQ test that identifies the race of<br> the person taking that test. Any such item, if there ever were any, has<br> long since been eliminated. You may look at IQ tests until you are blue<br> in the face and you won’t find the “racial code” items, because they are<br> not there. A lot of very smart people have worked hard to see to that. But IQ tests do predict academic success. And the University of<br> Washington developed a Grade Prediction Program that did much more. I<br> worked on it as a graduate student. The experiment was paid for by Navy<br> Research.</br></br></br></br></br></br></br></p><p>Basically, for all incoming freshmen, we took measures of almost<br> anything you can think of that might affect academic grades, and<br> recorded the grades those students achieved in four years of instruction<br> at the University of Washington. We recorded high school class rank,<br> and grades in high school subject areas. We gave batteries of tests to<br> the incoming freshmen. We took ratings and estimates from counselors<br> (which were not easy to get because counselors are not accustomed to<br> making numerical estimates, and sure enough, they weren’t much use in<br> the final predictions). We even threw in height and weight. We did not<br> record race, religion, national origin, or socio-economic status.</br></br></br></br></br></br></br></br></br></p><p>All this stuff went into a huge matrix, one line of a couple of dozen<br> predictors for each student. Then over time we built another matrix,<br> one line of grade results for each person. This whole thing then went<br> into a huge program to find the correlation of each item in the<br> predictors with each item in the results. This would be a number from 0<br> to 0.99; actually I think the highest predictor item was about 0.8,<br> which was IQ. Many of the predictors were near enough to zero that it<br> could reasonably be concluded that they could be eliminated. There were<br> one or two predictors that correlated highly with some fields of study<br> and not at all with others; the formula was adjusted for that so these<br> predictors were only used in prediction of relevant academic areas.</br></br></br></br></br></br></br></br></br></br></p><p>And lo! After a few years of taking results and honing the prediction<br> equations, every incoming freshman was given a grade prediction for a<br> number of academic area. Be a math major and you will be an A student,<br> but you will flunk out of biology. Actually, of course, that would be a<br> rare result: people who were predicted to be A students in any area were<br> likely to have higher predictions for other areas. An A prediction in<br> engineering would very likely to be accompanied by an A prediction as an<br> education major. Of course an prediction of an A average in Education<br> was not necessarily accompanied by the prediction of an A in anything<br> else.</br></br></br></br></br></br></br></br></br></p><p>The program was successful, but it is no longer used, because the<br> average grades predicted for Black and Hispanic students was lower than<br> the average grades predicted for White students. There was no single<br> item in any test that identified the race of the student, but those who<br> set out to prove this thesis managed to find that out.</br></br></br></br></p></blockquote><p>The beauty of science is that it eventually calls one’s assumptions and ideologies to account. At this point, one can only laugh at those who claim that human intelligence doesn’t exist, that IQ doesn’t measure anything, that neither IQ nor intelligence has no any link to race, and so forth. IQ is a very powerful predictive model of human intelligence, in fact, it is one of the more reliable predictive models that we have. It may not be fine-grained, it may not account for the full range of human accomplishment, and it may not be deterministic, but so what?</p><p>A metric’s failure to be absolutely perfect in every regard does not render it useless.  In fact, conservatives should take note that one of the most useful things about IQ is that it completely undermines the entire equalitarian program and renders it intellectually hors de combat.</p><p>If, in the interest of maintaining your belief in unicorns, leprechauns, and human equality, you are still trying to claim that whites are intellectually identical to Asians are intellectually the same as Africans, or asserting that it makes no difference whether someone scores +2SD or -2SD on an IQ test, you are worse than an idiot. You are being intentionally and willfully dishonest with yourself; you are <i>deceiving </i>yourself. And self-deceit is not a sound foundation from which to determine the truth about anything.</p></div>",
  "content_text": "Jerry Pournelle talks about a past predictive program that was terminated\nbecause it worked\n:\nI have a number of letters from people who try to account for differences in mean IQ among races – a phenomenon found and confirmed so often that it must be assumed to be true – by various factors, the most common of which is culture. A number of competent differential psychologists who would have wished to find that all those differences can be truly accounted for by cultural (and thus changeable) factors have devoted a great deal of effort to trying to prove that, and to eliminate all cultural factors from IQ tests, but they have not been able to do so….\nThere is no single item in any IQ test that identifies the race of\nthe person taking that test. Any such item, if there ever were any, has\nlong since been eliminated. You may look at IQ tests until you are blue\nin the face and you won’t find the “racial code” items, because they are\nnot there. A lot of very smart people have worked hard to see to that. But IQ tests do predict academic success. And the University of\nWashington developed a Grade Prediction Program that did much more. I\nworked on it as a graduate student. The experiment was paid for by Navy\nResearch.\nBasically, for all incoming freshmen, we took measures of almost\nanything you can think of that might affect academic grades, and\nrecorded the grades those students achieved in four years of instruction\nat the University of Washington. We recorded high school class rank,\nand grades in high school subject areas. We gave batteries of tests to\nthe incoming freshmen. We took ratings and estimates from counselors\n(which were not easy to get because counselors are not accustomed to\nmaking numerical estimates, and sure enough, they weren’t much use in\nthe final predictions). We even threw in height and weight. We did not\nrecord race, religion, national origin, or socio-economic status.\nAll this stuff went into a huge matrix, one line of a couple of dozen\npredictors for each student. Then over time we built another matrix,\none line of grade results for each person. This whole thing then went\ninto a huge program to find the correlation of each item in the\npredictors with each item in the results. This would be a number from 0\nto 0.99; actually I think the highest predictor item was about 0.8,\nwhich was IQ. Many of the predictors were near enough to zero that it\ncould reasonably be concluded that they could be eliminated. There were\none or two predictors that correlated highly with some fields of study\nand not at all with others; the formula was adjusted for that so these\npredictors were only used in prediction of relevant academic areas.\nAnd lo! After a few years of taking results and honing the prediction\nequations, every incoming freshman was given a grade prediction for a\nnumber of academic area. Be a math major and you will be an A student,\nbut you will flunk out of biology. Actually, of course, that would be a\nrare result: people who were predicted to be A students in any area were\nlikely to have higher predictions for other areas. An A prediction in\nengineering would very likely to be accompanied by an A prediction as an\neducation major. Of course an prediction of an A average in Education\nwas not necessarily accompanied by the prediction of an A in anything\nelse.\nThe program was successful, but it is no longer used, because the\naverage grades predicted for Black and Hispanic students was lower than\nthe average grades predicted for White students. There was no single\nitem in any test that identified the race of the student, but those who\nset out to prove this thesis managed to find that out.\nThe beauty of science is that it eventually calls one’s assumptions and ideologies to account. At this point, one can only laugh at those who claim that human intelligence doesn’t exist, that IQ doesn’t measure anything, that neither IQ nor intelligence has no any link to race, and so forth. IQ is a very powerful predictive model of human intelligence, in fact, it is one of the more reliable predictive models that we have. It may not be fine-grained, it may not account for the full range of human accomplishment, and it may not be deterministic, but so what?\nA metric’s failure to be absolutely perfect in every regard does not render it useless.  In fact, conservatives should take note that one of the most useful things about IQ is that it completely undermines the entire equalitarian program and renders it intellectually hors de combat.\nIf, in the interest of maintaining your belief in unicorns, leprechauns, and human equality, you are still trying to claim that whites are intellectually identical to Asians are intellectually the same as Africans, or asserting that it makes no difference whether someone scores +2SD or -2SD on an IQ test, you are worse than an idiot. You are being intentionally and willfully dishonest with yourself; you are\ndeceiving\nyourself. And self-deceit is not a sound foundation from which to determine the truth about anything.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-07T16:00:00+00:00"
}