{
  "url": "https://voxday.net/2014/12/27/its-small-small-sjw-world/",
  "scraped_at": "2025-12-16T12:39:39.556262",
  "title": "It’s a small, small SJW world",
  "date_display": "December 27, 2014",
  "date_iso": "2014-12-27T14:46:00+00:00",
  "date_from_url": "2014-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yama the cyberstalker is rightly getting worried about the net that is slowly being drawn in around him. And he’s been running to everyone from David Futrelle to anti-#GamerGate in a desperate attempt to find someone who will protect him from a confrontation with the big bad wolf. But while they may not be fans of mine, it doesn’t appear they’re dumb enough to sign up for his “Operation Infiltrate” either.</p><blockquote class=\"tr_bq\"><p> @SuperSpacedadHolly Jolly Spacedad <br> @pure_impure I’m not sure what they’re on about over you – what do they think you said? I don’t trust anything GG says BTW.</br></p><p>@pure_impure<br> I wrote a scathing plot summary of one of Vox Day’s novels and Vox is pissed off.</br></p><p>Space Bunny ‏@Spacebunnyday <br> Yes, dear. It has nothing to do with 56 months of harassment of him and others, not to mention CP</br></p><p>Liselle ‏@queenereshkigal <br> That’s a serious claim. If u @Spacebunnyday can’t provide evidence of CP @twitter @support needs to ban u.</br></p><p>pure, impure ‏@pure_impure<br> There is no evidence. Vox and cronies made up the whole thing.</br></p><p>Space Bunny ‏@Spacebunnyday<br> Wishful thinking on Andrew’s part, or an outright lie… The police know the truth</br></p><p>Vox Day ‏@voxday<br> You’re lying, Yama. We are getting multiple affidavits from those who saw it.</br></p><p>Solstice Post-it ‏@post_it_51 <br> The false-flag shit-poster is defending the harasser? Small SJW world</br></p></blockquote><p>If the name @SuperSpaceDad sounded familiar, <a href=\"http://www.milobookclub.com/2014/12/24/astroturfing-101/\">this is why</a>. I have to laugh at the idea of Yama being cross-examined at some point, as he can’t even maintain the smallest degree of consistency. How on EARTH could I possibly have “made up the whole thing” when there are numerous references to <a href=\"http://www.milobookclub.com/2014/12/17/pity-poor-tro/\">his pornographic stalking</a> of the Gaede girls and Micetrap Records more than FIVE YEARS BEFORE he began cyberstalking me?</p><p>If you’re looking for allies, Yama, I would suggest you contact John Scalzi, the Nielsen Haydens, Jim Hines, and Chris Kluwe. Perhaps they would not have a problem with your past predilection for porn-spamming minors.</p></div>",
  "content_text": "Yama the cyberstalker is rightly getting worried about the net that is slowly being drawn in around him. And he’s been running to everyone from David Futrelle to anti-#GamerGate in a desperate attempt to find someone who will protect him from a confrontation with the big bad wolf. But while they may not be fans of mine, it doesn’t appear they’re dumb enough to sign up for his “Operation Infiltrate” either.\n@SuperSpacedadHolly Jolly Spacedad\n@pure_impure I’m not sure what they’re on about over you – what do they think you said? I don’t trust anything GG says BTW.\n@pure_impure\nI wrote a scathing plot summary of one of Vox Day’s novels and Vox is pissed off.\nSpace Bunny ‏@Spacebunnyday\nYes, dear. It has nothing to do with 56 months of harassment of him and others, not to mention CP\nLiselle ‏@queenereshkigal\nThat’s a serious claim. If u @Spacebunnyday can’t provide evidence of CP @twitter @support needs to ban u.\npure, impure ‏@pure_impure\nThere is no evidence. Vox and cronies made up the whole thing.\nSpace Bunny ‏@Spacebunnyday\nWishful thinking on Andrew’s part, or an outright lie… The police know the truth\nVox Day ‏@voxday\nYou’re lying, Yama. We are getting multiple affidavits from those who saw it.\nSolstice Post-it ‏@post_it_51\nThe false-flag shit-poster is defending the harasser? Small SJW world\nIf the name @SuperSpaceDad sounded familiar,\nthis is why\n. I have to laugh at the idea of Yama being cross-examined at some point, as he can’t even maintain the smallest degree of consistency. How on EARTH could I possibly have “made up the whole thing” when there are numerous references to\nhis pornographic stalking\nof the Gaede girls and Micetrap Records more than FIVE YEARS BEFORE he began cyberstalking me?\nIf you’re looking for allies, Yama, I would suggest you contact John Scalzi, the Nielsen Haydens, Jim Hines, and Chris Kluwe. Perhaps they would not have a problem with your past predilection for porn-spamming minors.",
  "tags": [
    "rabbitology",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-27T14:46:00+00:00"
}