{
  "url": "https://voxday.net/2014/12/14/john-c-wright-explains-gatekeepers/",
  "scraped_at": "2025-12-16T12:38:14.618399",
  "title": "John C. Wright explains the gatekeepers",
  "date_display": "December 14, 2014",
  "date_iso": "2014-12-14T13:30:00+00:00",
  "date_from_url": "2014-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It probably didn’t surprise you to see that the SJWs at Amazon claimed the best books of 2014 included an incestuous child molester’s chronicle of a nonexistent rape and a biography of a celebrity that contained no reference to the biggest scandal of the celebrity’s life, or that their list was topped by a derivative, paint-by-numbers, race-based lamentation of life in America by a female minority. (The irony involved in calling a member of the most populous race and nationality on the planet a “minority” does not escape me, but this is the parlous state to which our language has been reduced in 2014.)</p><p>John C. Wright <a href=\"http://www.scifiwright.com/2014/12/supermanity-and-dehumanity-complete\">explains this bizarre inverting of literary quality</a>, where excellent books are ignored and the literary equivalent of finger-painting with one’s urine, excrement, and menstrual blood is praised as being not only exceptional, but the very best on offer:</p><blockquote class=\"tr_bq\"><p> Democracy also has a drawback: our liberty allows for such license, that no accomplishment is needed ere one is called accomplished. Eve our elitism is democratic: Anyone can be a snob!</p><p>All you have to do to achieve the paramount of the modern Decalogue is dishonor your father and mother; to be the modern version Horatio, all you need do is betray the ashes of your fathers and the altars of your gods. Hegelian evolution says that whatever comes later is better, right? Well, you come after your forefathers, and you are younger than your teachers, so you must know more.</p><p>To be a snob in the Old World you had to be born to a high family, or in the New, to earn a high place. But all you have to do to be a snob in the world of no-fault modern snobbery is look down on the giants who founded and fought for this nation.</p><p>The only way to look down on a giant is to turn your soul upside down, can call evil a type of good (tolerance, diversity, choice) and good a type of evil (intolerance, divisiveness, bigotry). And all you need to do to switch the labels on things, change the definitions so that the north arrow of the moral compass reads south, is to be a damned liar.</p><p>Yes, I do mean damned. So picture the modern Progressive as a dwarfish figure, head firmly wedged into a chamber pot, who looks down (what we call up) sees the clouds and stars underfoot, and sun and moon, and proudly imagines he is trampling heaven. And when he seeks to soar to higher places, overhead is a blank and cold earth, merely a roof of matter, impenetrable to his wit; and when he dreams of spiritual things his thoughts ascend to hell. The harder he tries to live up to what he thinks are higher ideals, the lower toward the central fire he sinks.</p><p>The short answer is that the elite of our culture are not a high elite at all, but the low dregs.</p><p>They do not sneer at us as their inferiors despite their embarrassing retardation in experiential, intellectual, philosophical and theological matters, not to mention their bad manners and sexual perversions: they sneer at us as their inferiors BECAUSE of their retardation.</p></blockquote><p>Instead of the books recommended by Amazon, let me recommend a very good and seasonal book you may wish to consider in their stead, indeed, one by the very critic cited. But don’t take my word for it, consider what some of the readers of Mr. Wright’s <a href=\"http://www.amazon.com/Book-Feasts-Seasons-John-Wright-ebook/dp/B00QEDGIQW\"><b><i>The Book of Feasts &amp; Seasons</i></b></a> have had to say about it.</p><ul><li> There is really no way to rate this book with Amazon stars; Amazon does<br> not have a way to indicate books which point to eternal truths and<br> transcendent beauty. Speaking solely in terms of composition, the book<br> has its flaws; shifting from more or less pure sci-fi with wit and much<br> satire at the beginning to a conclusion full of sacred and solemn joy – while leaving in the sci-fi elements – and successfully carrying off<br> each step without occasionally having your normally divergent themes try<br> to separate like oil and water might be impossible anyway. That Mr.<br> Wright on the whole pulls off this balancing act is a testament to his<br> skill as a writer. I am giving it 5 stars because most of the stories within deserve 5<br> stars, because several of them are the closest thing I have ever read to<br> a 21st century G.K.Chesterton, and also because that is the most<br> emphatic way I can recommend this volume to your attention.</br></br></br></br></br></br></br></br></br></br></br></li><li> I have read many of Mr. Wright’s other works and in many of them, he hides his Christianity in parable. A parable is a tale that tells of Truth, but is veiled in a way that only those who know the author’s intent can discern its deeper meaning. In THE BOOK OF FEASTS &amp; SEASONS, Mr. Wright alternately dons and throws off the disguising cloak of parable and allegory, writing as plainly as an honest man is able and with an elegance that only a master of prose can manage.</li><li>This is a marvelous collection of John C. Wright’s seasonal short<br> fiction. Especially notable stories are “Pale Realms of Shade,” a ghost<br> story with a noir sensibility and a very satisfying twist (for Easter),<br> “The Ideal Machine” for the Ascension, “Eve of All Saints’ Day”<br> for–well, you know what holiday that one is for! Finally, the two<br> Christmas-themed stories, “Nativity” and “Yes, Virginia, There Is a<br> Santa Claus,” are also especially good. At their best, these stories<br> remind me of G. K. Chesterton.</br></br></br></br></br></br></br></li><li>A brilliant collection of mind-bending short stories. I liked all of<br> them, loved three of them, and one of the three I loved stands as one of<br> the best short stories I think the esteemed Mr. Wright has written<br> (That’s “Pale Realms of Shade”, by the way). “The Meaning of Life” was<br> hysterical. “The Parliament of Beasts and Birds” was an extremely clever<br> parable story, something I very rarely see</br></br></br></br></br></li></ul><p>I feel, on the other hand, that “The Parliament of Beasts and Birds” is the best short story that Mr. Wright has yet written, although there is one story that will be published in a collection next year that may surpass it. For me, it is a remarkable tale that combines the very best of Tanith Lee with CS Lewis in his Narnia mode. </p></div>",
  "content_text": "It probably didn’t surprise you to see that the SJWs at Amazon claimed the best books of 2014 included an incestuous child molester’s chronicle of a nonexistent rape and a biography of a celebrity that contained no reference to the biggest scandal of the celebrity’s life, or that their list was topped by a derivative, paint-by-numbers, race-based lamentation of life in America by a female minority. (The irony involved in calling a member of the most populous race and nationality on the planet a “minority” does not escape me, but this is the parlous state to which our language has been reduced in 2014.)\nJohn C. Wright\nexplains this bizarre inverting of literary quality\n, where excellent books are ignored and the literary equivalent of finger-painting with one’s urine, excrement, and menstrual blood is praised as being not only exceptional, but the very best on offer:\nDemocracy also has a drawback: our liberty allows for such license, that no accomplishment is needed ere one is called accomplished. Eve our elitism is democratic: Anyone can be a snob!\nAll you have to do to achieve the paramount of the modern Decalogue is dishonor your father and mother; to be the modern version Horatio, all you need do is betray the ashes of your fathers and the altars of your gods. Hegelian evolution says that whatever comes later is better, right? Well, you come after your forefathers, and you are younger than your teachers, so you must know more.\nTo be a snob in the Old World you had to be born to a high family, or in the New, to earn a high place. But all you have to do to be a snob in the world of no-fault modern snobbery is look down on the giants who founded and fought for this nation.\nThe only way to look down on a giant is to turn your soul upside down, can call evil a type of good (tolerance, diversity, choice) and good a type of evil (intolerance, divisiveness, bigotry). And all you need to do to switch the labels on things, change the definitions so that the north arrow of the moral compass reads south, is to be a damned liar.\nYes, I do mean damned. So picture the modern Progressive as a dwarfish figure, head firmly wedged into a chamber pot, who looks down (what we call up) sees the clouds and stars underfoot, and sun and moon, and proudly imagines he is trampling heaven. And when he seeks to soar to higher places, overhead is a blank and cold earth, merely a roof of matter, impenetrable to his wit; and when he dreams of spiritual things his thoughts ascend to hell. The harder he tries to live up to what he thinks are higher ideals, the lower toward the central fire he sinks.\nThe short answer is that the elite of our culture are not a high elite at all, but the low dregs.\nThey do not sneer at us as their inferiors despite their embarrassing retardation in experiential, intellectual, philosophical and theological matters, not to mention their bad manners and sexual perversions: they sneer at us as their inferiors BECAUSE of their retardation.\nInstead of the books recommended by Amazon, let me recommend a very good and seasonal book you may wish to consider in their stead, indeed, one by the very critic cited. But don’t take my word for it, consider what some of the readers of Mr. Wright’s\nThe Book of Feasts & Seasons\nhave had to say about it.\nThere is really no way to rate this book with Amazon stars; Amazon does\nnot have a way to indicate books which point to eternal truths and\ntranscendent beauty. Speaking solely in terms of composition, the book\nhas its flaws; shifting from more or less pure sci-fi with wit and much\nsatire at the beginning to a conclusion full of sacred and solemn joy – while leaving in the sci-fi elements – and successfully carrying off\neach step without occasionally having your normally divergent themes try\nto separate like oil and water might be impossible anyway. That Mr.\nWright on the whole pulls off this balancing act is a testament to his\nskill as a writer. I am giving it 5 stars because most of the stories within deserve 5\nstars, because several of them are the closest thing I have ever read to\na 21st century G.K.Chesterton, and also because that is the most\nemphatic way I can recommend this volume to your attention.\nI have read many of Mr. Wright’s other works and in many of them, he hides his Christianity in parable. A parable is a tale that tells of Truth, but is veiled in a way that only those who know the author’s intent can discern its deeper meaning. In THE BOOK OF FEASTS & SEASONS, Mr. Wright alternately dons and throws off the disguising cloak of parable and allegory, writing as plainly as an honest man is able and with an elegance that only a master of prose can manage.\nThis is a marvelous collection of John C. Wright’s seasonal short\nfiction. Especially notable stories are “Pale Realms of Shade,” a ghost\nstory with a noir sensibility and a very satisfying twist (for Easter),\n“The Ideal Machine” for the Ascension, “Eve of All Saints’ Day”\nfor–well, you know what holiday that one is for! Finally, the two\nChristmas-themed stories, “Nativity” and “Yes, Virginia, There Is a\nSanta Claus,” are also especially good. At their best, these stories\nremind me of G. K. Chesterton.\nA brilliant collection of mind-bending short stories. I liked all of\nthem, loved three of them, and one of the three I loved stands as one of\nthe best short stories I think the esteemed Mr. Wright has written\n(That’s “Pale Realms of Shade”, by the way). “The Meaning of Life” was\nhysterical. “The Parliament of Beasts and Birds” was an extremely clever\nparable story, something I very rarely see\nI feel, on the other hand, that “The Parliament of Beasts and Birds” is the best short story that Mr. Wright has yet written, although there is one story that will be published in a collection next year that may surpass it. For me, it is a remarkable tale that combines the very best of Tanith Lee with CS Lewis in his Narnia mode.",
  "tags": [
    "Castalia House",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-14T13:30:00+00:00"
}