{
  "url": "https://voxday.net/2014/12/01/kickstarter-rewards/",
  "scraped_at": "2025-12-16T12:36:46.092468",
  "title": "Kickstarter rewards",
  "date_display": "December 1, 2014",
  "date_iso": "2014-12-01T00:49:00+00:00",
  "date_from_url": "2014-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, here’s a thought. We’re looking at doing a Kickstarter for a game, quite possibly in coordination with another gaming organization, which will likely be of considerable interest to wargamers of various genres. This is not <i>First Sword</i> or any other combat management game, just to be clear.</p><p>Having looked at various game kickstarts, successful and unsuccessful, I haven’t been terribly impressed with most of the rewards. I’ve got a few ideas, but since this is one of the communities that would be most likely to harbor a supporter or two, I’m interested in knowing what sort of rewards might be of interest to you.</p><p>We’re just brainstorming here, so go ahead and throw them out. I won’t say anything more about the game, except that it will be multiplatform.</p></div>",
  "content_text": "So, here’s a thought. We’re looking at doing a Kickstarter for a game, quite possibly in coordination with another gaming organization, which will likely be of considerable interest to wargamers of various genres. This is not\nFirst Sword\nor any other combat management game, just to be clear.\nHaving looked at various game kickstarts, successful and unsuccessful, I haven’t been terribly impressed with most of the rewards. I’ve got a few ideas, but since this is one of the communities that would be most likely to harbor a supporter or two, I’m interested in knowing what sort of rewards might be of interest to you.\nWe’re just brainstorming here, so go ahead and throw them out. I won’t say anything more about the game, except that it will be multiplatform.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-01T00:49:00+00:00"
}