{
  "url": "https://voxday.net/2014/12/28/mailvox-is-war-in-decline/",
  "scraped_at": "2025-12-16T12:39:46.766492",
  "title": "Mailvox: is war in decline?",
  "date_display": "December 28, 2014",
  "date_iso": "2014-12-28T14:30:00+00:00",
  "date_from_url": "2014-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CED asks about <i>The Remnants of War</i> and the idea that war is in decline:</p><blockquote class=\"tr_bq\"><p> Are you aware of the book <i>The Remnants of War</i> by John Mueller? It was published back in 2004, with a paperback edition in 2007. The book argues that contrary to popular belief, war is on its way out, and the only people still engaging in it are opportunistic criminals easily scared off by competent, disciplined troops from developed countries.</p><p>Its main thrust is that developed countries, which used to get into frequent wars with each other, no longer did due to the harrowing experience of World War I, and that World War II was an aberration caused by Hitler’s personal charisma. The book states that changing cultural attitudes toward organized violence, not trade links or new military technologies like nukes, ended war as a possibility among developed states.</p><p>Furthermore, even in undeveloped states, much of the “war” is caused by roving yet cowardly criminal gangs that seek easy targets, not disciplined soldiers or even guerrillas (he emphasizes the Yugoslav wars as Exhibit A) — and that this is the main form of warfare that remains. According to Mueller, this form of war can only be handled by competent native governments with disciplined police and military forces. Once this is done, war, like slavery and dueling before it, will recede as a human institution. A related point he makes is that ethnic conflict need not explode into civil war if there is a competent government in place.</p><p>Now, it has been a long time since this book was published. I see a few problems with his thesis:</p><p><b>Chinese saber-rattling.</b> In the South and East China Sea, China has been building up its navy in preparation for a war. This has driven countries like Vietnam closer to the US and forced Japan to begin its own military buildup. Of course, there’s also Taiwan. While Mueller is careful to say that war between disciplined, developed states is still possible, it cuts against another claim he makes — that the Cold War’s losers see the world the same way as the winners and thus don’t want to upset the international order.<br> <b><br>Russia’s interference in Ukraine</br></b>. Russia was the principal loser in the Cold War, and there is very little evidence that they see the world the “same way” as the US and the EU. The interference in the Ukraine, as well as the sanctions imposed in response, to say nothing of Putin’s domestic policies that are at odds with Western promotion of homosexuality and godlessness, show fundamental differences. The only reason there has been no war is because it would inevitably go nuclear.</br></p><p><b>The Iraq debacle.</b> Take note of when <i>The Remnants of War </i>was published — 2004, a mere one year after the Iraq invasion. Disciplined US troops displaced Saddam’s government and occupied the country, policing it to get rid of opportunistic predators that wanted to profit from the social chaos. Things still looked hopeful for the occupation at the time. Eleven years later, The US has withdrawn and the Islamic State has risen. Either the Muslim fundamentalists have proven more disciplined, or war isn’t declining as much as Mueller would have us believe. In his schema, something like the Islamic State shouldn’t even be possible.</p><p><b>Fourth-generation war.</b> To Mueller, “war” is a battle between disciplined armies for control of a government or territory, or between a government and disciplined guerrilla forces. He waves off notions of 4GW (though he never uses the term) by saying that war has been reduced to its dregs — mere predation by criminal packs in areas without effective governments. To Mueller, what appears to be a “new form of war” is just the death rattle of war, and once those areas could be competently policed, even criminal “war” will disappear. In contrast, William S. Lind says that 4GW is the wave of the future and has been defeating the state wherever it has arisen. This complicates Mueller’s conclusions about the inevitable end of war, though he does mention that a government has to be effective to end war. Lind also says that 4GW comes from a state’s crisis of legitimacy, so maybe both Mueller and Lind are making the same point in a different way.</p><p>Anyway, do you have any thoughts on John Mueller’s idea that war is on the decline and soon to disappear as a human institution?</p></blockquote><p>I was not aware of the book, but if CED has fairly represented Mueller’s views, I think his core idea is conventional, outdated, short-sighted, and ahistorical, and temporally biased. There have always been periods of relative peace. During such periods, it is common for the more foolish sort of thinkers to believe that those periods have somehow magically become established as the permanent human norm. Considering that the world has been in one of the longer periods of economic growth, technological advancement, and population growth since 1950, and it should be no surprise that even after 9/11 and the dot com crash, there were still those who thought that this time, it would be different.</p><p>I’ve been reading <i>World Order</i> by Henry Kissinger, and it is clear that one reason the global elite is attempting to tighten its grasp these days is because it fears the world declining into the sort of disorder that makes it difficult to milk. But it will fail, order will decline into disorder, and low-grade war will cover most of the planet because the centers of order are no longer homogenous and stable.</p><p>The one genuinely mitigating factor is the way in which nuclear weapons tend to prevent the major state militaries from engaging each other. But this too creates problems, as it forces them to fight on the 4GW non-battlefield where their every action tends to foster more of the very disorder they are attempting to destroy.</p><p>We are fortunate to have lived in such peaceful times. It is unlikely that our children and our grandchildren will be similarly fortunate. So, my answer is no. War is not in decline. As I wrote in the preface to <i><b><a href=\"http://www.amazon.com/Riding-Red-Horse-Christopher-Nuttall-ebook/dp/B00QZD9H5K\">RIDING THE RED HORSE</a></b></i>:</p><p><i>[T]he end of the Pax Americana is rapidly approaching and it is readily apparent to every well-informed observer that War is preparing to mount his steed, and he will soon be once more riding that terrible red horse over the nations of men. </i></p><p>It is no accident that the <b><i>THERE WILL BE WAR</i></b> series came to an end in 1989, in harmony with the end of the Cold War. Nor is it an accident that there is an increased interest for military fiction, or that we launched <i><b>RIDING THE RED HORSE</b></i> this month.</p><p>Henry Kissinger writes in <i>World Order</i>:</p><blockquote class=\"tr_bq\"><p> In the world of geopolitics, the order established and proclaimed as universal by the Western countries stands at a turning point. Its nostrums are understood globally, but there is no consensus about their application; indeed, concepts such as democracy, human rights, and international law are given such divergent interpretations that warring parties regularly invoke them against each other as battle cries. The system’s rules have been promulgated but have proven ineffective absent active enforcement. The pledge of partnership and community has in some regions been replaced, or at least accompanied, by a harder-edged testing of limits.</p><p>A quarter century of political and economic crises perceived as produced, or at least abetted, by Western admonitions and practices—along with imploding regional orders, sectarian bloodbaths, terrorism, and wars ended on terms short of victory—has thrown into question the optimistic assumptions of the immediate post–Cold War era: that the spread of democracy and free markets would automatically create a just, peaceful, and inclusive world.</p></blockquote><p>Translation: don’t count on the end of history. And mark this: “A struggle between regions could be even more debilitating than the struggle between nations has been.”</p></div>",
  "content_text": "CED asks about\nThe Remnants of War\nand the idea that war is in decline:\nAre you aware of the book\nThe Remnants of War\nby John Mueller? It was published back in 2004, with a paperback edition in 2007. The book argues that contrary to popular belief, war is on its way out, and the only people still engaging in it are opportunistic criminals easily scared off by competent, disciplined troops from developed countries.\nIts main thrust is that developed countries, which used to get into frequent wars with each other, no longer did due to the harrowing experience of World War I, and that World War II was an aberration caused by Hitler’s personal charisma. The book states that changing cultural attitudes toward organized violence, not trade links or new military technologies like nukes, ended war as a possibility among developed states.\nFurthermore, even in undeveloped states, much of the “war” is caused by roving yet cowardly criminal gangs that seek easy targets, not disciplined soldiers or even guerrillas (he emphasizes the Yugoslav wars as Exhibit A) — and that this is the main form of warfare that remains. According to Mueller, this form of war can only be handled by competent native governments with disciplined police and military forces. Once this is done, war, like slavery and dueling before it, will recede as a human institution. A related point he makes is that ethnic conflict need not explode into civil war if there is a competent government in place.\nNow, it has been a long time since this book was published. I see a few problems with his thesis:\nChinese saber-rattling.\nIn the South and East China Sea, China has been building up its navy in preparation for a war. This has driven countries like Vietnam closer to the US and forced Japan to begin its own military buildup. Of course, there’s also Taiwan. While Mueller is careful to say that war between disciplined, developed states is still possible, it cuts against another claim he makes — that the Cold War’s losers see the world the same way as the winners and thus don’t want to upset the international order.\nRussia’s interference in Ukraine\n. Russia was the principal loser in the Cold War, and there is very little evidence that they see the world the “same way” as the US and the EU. The interference in the Ukraine, as well as the sanctions imposed in response, to say nothing of Putin’s domestic policies that are at odds with Western promotion of homosexuality and godlessness, show fundamental differences. The only reason there has been no war is because it would inevitably go nuclear.\nThe Iraq debacle.\nTake note of when\nThe Remnants of War\nwas published — 2004, a mere one year after the Iraq invasion. Disciplined US troops displaced Saddam’s government and occupied the country, policing it to get rid of opportunistic predators that wanted to profit from the social chaos. Things still looked hopeful for the occupation at the time. Eleven years later, The US has withdrawn and the Islamic State has risen. Either the Muslim fundamentalists have proven more disciplined, or war isn’t declining as much as Mueller would have us believe. In his schema, something like the Islamic State shouldn’t even be possible.\nFourth-generation war.\nTo Mueller, “war” is a battle between disciplined armies for control of a government or territory, or between a government and disciplined guerrilla forces. He waves off notions of 4GW (though he never uses the term) by saying that war has been reduced to its dregs — mere predation by criminal packs in areas without effective governments. To Mueller, what appears to be a “new form of war” is just the death rattle of war, and once those areas could be competently policed, even criminal “war” will disappear. In contrast, William S. Lind says that 4GW is the wave of the future and has been defeating the state wherever it has arisen. This complicates Mueller’s conclusions about the inevitable end of war, though he does mention that a government has to be effective to end war. Lind also says that 4GW comes from a state’s crisis of legitimacy, so maybe both Mueller and Lind are making the same point in a different way.\nAnyway, do you have any thoughts on John Mueller’s idea that war is on the decline and soon to disappear as a human institution?\nI was not aware of the book, but if CED has fairly represented Mueller’s views, I think his core idea is conventional, outdated, short-sighted, and ahistorical, and temporally biased. There have always been periods of relative peace. During such periods, it is common for the more foolish sort of thinkers to believe that those periods have somehow magically become established as the permanent human norm. Considering that the world has been in one of the longer periods of economic growth, technological advancement, and population growth since 1950, and it should be no surprise that even after 9/11 and the dot com crash, there were still those who thought that this time, it would be different.\nI’ve been reading\nWorld Order\nby Henry Kissinger, and it is clear that one reason the global elite is attempting to tighten its grasp these days is because it fears the world declining into the sort of disorder that makes it difficult to milk. But it will fail, order will decline into disorder, and low-grade war will cover most of the planet because the centers of order are no longer homogenous and stable.\nThe one genuinely mitigating factor is the way in which nuclear weapons tend to prevent the major state militaries from engaging each other. But this too creates problems, as it forces them to fight on the 4GW non-battlefield where their every action tends to foster more of the very disorder they are attempting to destroy.\nWe are fortunate to have lived in such peaceful times. It is unlikely that our children and our grandchildren will be similarly fortunate. So, my answer is no. War is not in decline. As I wrote in the preface to\nRIDING THE RED HORSE\n:\n[T]he end of the Pax Americana is rapidly approaching and it is readily apparent to every well-informed observer that War is preparing to mount his steed, and he will soon be once more riding that terrible red horse over the nations of men.\nIt is no accident that the\nTHERE WILL BE WAR\nseries came to an end in 1989, in harmony with the end of the Cold War. Nor is it an accident that there is an increased interest for military fiction, or that we launched\nRIDING THE RED HORSE\nthis month.\nHenry Kissinger writes in\nWorld Order\n:\nIn the world of geopolitics, the order established and proclaimed as universal by the Western countries stands at a turning point. Its nostrums are understood globally, but there is no consensus about their application; indeed, concepts such as democracy, human rights, and international law are given such divergent interpretations that warring parties regularly invoke them against each other as battle cries. The system’s rules have been promulgated but have proven ineffective absent active enforcement. The pledge of partnership and community has in some regions been replaced, or at least accompanied, by a harder-edged testing of limits.\nA quarter century of political and economic crises perceived as produced, or at least abetted, by Western admonitions and practices—along with imploding regional orders, sectarian bloodbaths, terrorism, and wars ended on terms short of victory—has thrown into question the optimistic assumptions of the immediate post–Cold War era: that the spread of democracy and free markets would automatically create a just, peaceful, and inclusive world.\nTranslation: don’t count on the end of history. And mark this: “A struggle between regions could be even more debilitating than the struggle between nations has been.”",
  "tags": [
    "mailvox",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-28T14:30:00+00:00"
}