{
  "url": "https://voxday.net/2014/12/18/negative-interest-rates/",
  "scraped_at": "2025-12-16T12:38:52.147881",
  "title": "Negative interest rates",
  "date_display": "December 18, 2014",
  "date_iso": "2014-12-18T17:00:00+00:00",
  "date_from_url": "2014-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One more check in the ICE box. Zerohedge cites Goldman Sachs concerning <a href=\"http://www.zerohedge.com/news/2014-12-18/swiss-central-bank-scrambles-against-russian-capital-flight-joins-ecb-sending-deposi\">the surprise announcement of NIRP</a> from the Swiss:</p><blockquote class=\"tr_bq\"><p> The Governing Board of the SNB surprisingly announced this morning that it will introduce a negative rate of -0.25% on sight deposit account balances at the SNB. The SNB’s target range for the three-month Libor was also widened from 0.0% – +0.25% to -0.75% – +0.25%. In our view, today’s rate decision simply underlines the determination of the SNB to enforce the minimum exchange rate target for the CHF against the Euro.</p><p>1. This morning, the SNB surprisingly announced that, on January 22, it will introduce a negative interest rate of -25bp on reserve holdings from banks at the SNB, above a threshold of 20 times the minimum reserve requirement. The SNB’s target range for the three-month Libor was also widened from 0.0% – +0.25% to -0.75% – +0.25%. Over the last couple of days, the CHF has traded very close to the 1.20 level on the back of rising market volatility. The subsequent demand for safe investments attracted large capital inflows into Switzerland, eventually prompting the SNB to react.</p><p>2. According to the SNB, the measure is aimed at making investments into CHF less attractive. Although it is only banks that will have to pay the negative deposit rate, banks will pass on, to some extent at least, the negative rates to customers. It is noteworthy in that respect that some German banks – in response to the ECB’s negative rates – have also started charging some clients negative deposit rates.</p><p>3. It remains to be seen how effective this measure will be and the SNB will continue to rely on FX interventions to defend the minimum exchange rate. But the measure in any case shows the determination of the SNB to maintain the lower bound for the CHF against the Euro.</p></blockquote><p>When currencies are getting too strong and interest rates are going negative, this is a sign that the central banks are fighting against deflationary pressures. To fight inflation, you raise the interest rate, thereby encouraging people to save. To fight deflation, you lower it, thereby encouraging people to borrow and spend. Or, in this case, since the negative interest rate is only being applied to banks, it is to encourage them to lend. That points to the fundamental difference between fiat money and credit money. <i>You can print paper, but you can’t print borrowers.</i></p><p>The Swiss are trying to weaken their currency, which is strong against the Euro and the dollar, so they are trying to make it less attractive to investors in order to protect their domestic exporters. Russia, on the other hand, isn’t trying to export, but is instead attempting to bring in capital that is frustrated at earning so little interest in the low-interest Western economies.</p><p>Widespread NIRP will dictate the eventual end of the credit money system as well as the banks. If you’re being charged to save your credit money, you might as well pay someone to securely hold something more tangible.</p></div>",
  "content_text": "One more check in the ICE box. Zerohedge cites Goldman Sachs concerning\nthe surprise announcement of NIRP\nfrom the Swiss:\nThe Governing Board of the SNB surprisingly announced this morning that it will introduce a negative rate of -0.25% on sight deposit account balances at the SNB. The SNB’s target range for the three-month Libor was also widened from 0.0% – +0.25% to -0.75% – +0.25%. In our view, today’s rate decision simply underlines the determination of the SNB to enforce the minimum exchange rate target for the CHF against the Euro.\n1. This morning, the SNB surprisingly announced that, on January 22, it will introduce a negative interest rate of -25bp on reserve holdings from banks at the SNB, above a threshold of 20 times the minimum reserve requirement. The SNB’s target range for the three-month Libor was also widened from 0.0% – +0.25% to -0.75% – +0.25%. Over the last couple of days, the CHF has traded very close to the 1.20 level on the back of rising market volatility. The subsequent demand for safe investments attracted large capital inflows into Switzerland, eventually prompting the SNB to react.\n2. According to the SNB, the measure is aimed at making investments into CHF less attractive. Although it is only banks that will have to pay the negative deposit rate, banks will pass on, to some extent at least, the negative rates to customers. It is noteworthy in that respect that some German banks – in response to the ECB’s negative rates – have also started charging some clients negative deposit rates.\n3. It remains to be seen how effective this measure will be and the SNB will continue to rely on FX interventions to defend the minimum exchange rate. But the measure in any case shows the determination of the SNB to maintain the lower bound for the CHF against the Euro.\nWhen currencies are getting too strong and interest rates are going negative, this is a sign that the central banks are fighting against deflationary pressures. To fight inflation, you raise the interest rate, thereby encouraging people to save. To fight deflation, you lower it, thereby encouraging people to borrow and spend. Or, in this case, since the negative interest rate is only being applied to banks, it is to encourage them to lend. That points to the fundamental difference between fiat money and credit money.\nYou can print paper, but you can’t print borrowers.\nThe Swiss are trying to weaken their currency, which is strong against the Euro and the dollar, so they are trying to make it less attractive to investors in order to protect their domestic exporters. Russia, on the other hand, isn’t trying to export, but is instead attempting to bring in capital that is frustrated at earning so little interest in the low-interest Western economies.\nWidespread NIRP will dictate the eventual end of the credit money system as well as the banks. If you’re being charged to save your credit money, you might as well pay someone to securely hold something more tangible.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-18T17:00:00+00:00"
}