{
  "url": "https://voxday.net/2014/12/28/new-castalia-blogger-morgan/",
  "scraped_at": "2025-12-16T12:39:49.686823",
  "title": "New Castalia blogger: Morgan",
  "date_display": "December 28, 2014",
  "date_iso": "2014-12-28T21:00:00+00:00",
  "date_from_url": "2014-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re pleased to welcome the first of FOUR new Castalia House bloggers today, as Morgan makes his debut with a post on what he describes as <a href=\"http://www.castaliahouse.com/the-mid-1980s-paperback-sword-and-sorcery-extinction-event/\">the Sword &amp; Sorcery Extinction Event</a>:</p><blockquote class=\"tr_bq\"><p> In the early 1980s, if you were new to the sword and sorcery genre, you<br> could go to your local chain bookstore, generally B. Dalton or Walden<br> Books and get the core library in short order. Robert E. Howard’s Conan,<br> Fritz Leiber’s Fafhrd and the Gray Mouser, Michael Moorcock’s Elric<br> were all there. There was a period around 1983 that you could get Karl<br> Edward Wagner’s Kane books, C. L. Moore’s Jirel of Joiry, and Timescape<br> editions of Clark Ashton Smith. Sword and sorcery in paperback form went<br> back to 1966 with the Lancer editions of Conan. There was a post-Conan<br> sword and sorcery boom in the late 1960s where you had Brak, Thongor,<br> Kothar with eye catching covers painted by Frank Frazetta or Jeff Jones.<br> That died out around 1971.</br></br></br></br></br></br></br></br></br></br></p><p>There was a second boom in the late 1970s<br> fueled by Zebra Books reissues of Robert E. Howard non-Conan material<br> and Berkley Medallion issuing of nine collections and one novel and<br> another six reissues of previous Zebra paperbacks with new covers. All this created a coat tails effect with new sword and sorcery novels<br> and anthologies published. Many of them were bad. Some of the books were<br> really science fiction disguised to look like sword and sorcery. The<br> minor publishers such as Manor, Zebra, and Tower were looking for<br> anything to slap a barbarian with a sword on the cover. Those publishers<br> were gone in the early 80s leaving Ace, D.A.W., Bantam, Del Rey, and<br> the new Tor Books as the main publishers.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Morgan will be blogging on Sundays; we’ll be introducing the other new bloggers in the coming weeks.</p></div>",
  "content_text": "We’re pleased to welcome the first of FOUR new Castalia House bloggers today, as Morgan makes his debut with a post on what he describes as\nthe Sword & Sorcery Extinction Event\n:\nIn the early 1980s, if you were new to the sword and sorcery genre, you\ncould go to your local chain bookstore, generally B. Dalton or Walden\nBooks and get the core library in short order. Robert E. Howard’s Conan,\nFritz Leiber’s Fafhrd and the Gray Mouser, Michael Moorcock’s Elric\nwere all there. There was a period around 1983 that you could get Karl\nEdward Wagner’s Kane books, C. L. Moore’s Jirel of Joiry, and Timescape\neditions of Clark Ashton Smith. Sword and sorcery in paperback form went\nback to 1966 with the Lancer editions of Conan. There was a post-Conan\nsword and sorcery boom in the late 1960s where you had Brak, Thongor,\nKothar with eye catching covers painted by Frank Frazetta or Jeff Jones.\nThat died out around 1971.\nThere was a second boom in the late 1970s\nfueled by Zebra Books reissues of Robert E. Howard non-Conan material\nand Berkley Medallion issuing of nine collections and one novel and\nanother six reissues of previous Zebra paperbacks with new covers. All this created a coat tails effect with new sword and sorcery novels\nand anthologies published. Many of them were bad. Some of the books were\nreally science fiction disguised to look like sword and sorcery. The\nminor publishers such as Manor, Zebra, and Tower were looking for\nanything to slap a barbarian with a sword on the cover. Those publishers\nwere gone in the early 80s leaving Ace, D.A.W., Bantam, Del Rey, and\nthe new Tor Books as the main publishers.\nMorgan will be blogging on Sundays; we’ll be introducing the other new bloggers in the coming weeks.",
  "tags": [
    "books",
    "Castalia"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-28T21:00:00+00:00"
}