{
  "url": "https://voxday.net/2014/12/31/no-heroes-in-new-york-city/",
  "scraped_at": "2025-12-16T12:40:06.975496",
  "title": "No heroes in New York City",
  "date_display": "December 31, 2014",
  "date_iso": "2014-12-31T13:30:00+00:00",
  "date_from_url": "2014-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The police are under no legal obligation to protect and serve you. And apparently, if they do not feel sufficiently lionized by the public, <a href=\"http://nypost.com/2014/12/29/arrests-plummet-following-execution-of-two-cops/\">they will not even do their jobs</a>.</p><blockquote class=\"tr_bq\"><p> Arrests plummet 66% with NYPD in virtual work stoppage. It’s not a slowdown — it’s a virtual work stoppage. NYPD traffic tickets and summonses for minor offenses have dropped off by a staggering 94 percent following the execution of two cops — as officers feel betrayed by the mayor and fear for their safety, The Post has learned.</p><p>The dramatic drop comes as Police Commissioner Bill Bratton and Mayor Bill de Blasio plan to hold an emergency summit on Tuesday with the heads of the five police unions to try to close the widening rift between cops and the administration.</p><p>It has helped contribute to a nose dive in low-level policing, with<br> overall arrests down 66 percent for the week starting Dec. 22 compared<br> with the same period in 2013, stats show. Citations for traffic violations fell by 94 percent, from 10,069 to 587, during that time frame. Summonses for low-level offenses like public drinking and urination also plunged 94 percent — from 4,831 to 300.</br></br></p><p>Even parking violations are way down, dropping by 92 percent, from 14,699 to 1,241. Drug arrests by cops assigned to the NYPD’s Organized Crime Control<br> Bureau — which are part of the overall number — dropped by 84 percent,<br> from 382 to 63.</br></br></p></blockquote><p>If you still weren’t convinced that the corrupt and militarized modern police of America are little more than a badge gang, I should think this obnoxious, irresponsible reaction by the police should suffice to convince you, at least concerning the feckless nature of the NYPD.</p><p>Recall that police work is not even among the ten most dangerous jobs in America; if it were, women would not pursue it. Remember that most officers never draw their gun nor fire it in the course of their career. And keep in mind that police departments intentionally screen to keep out the excessively intelligent and the insufficiently aggressive.</p><p>The petulance of the NYPD made me recall the Tom Simon essay in Sci Phi Journal #2, which concerned, among other things, Tolkien’s definition of heroism.</p><blockquote class=\"tr_bq\"><p> In his essay “Ofermod,” Tolkien writes:<br> <i><br>For this ‘northern heroic spirit’ is never quite pure; it is of gold and an alloy. Unalloyed it would direct a man to endure even death unflinching, when necessary: that is when death may help the achievement of some object of will, or when life can only be purchased by denial of what one stands for. But since such conduct is held admirable, the alloy of personal good name was never wholly absent.</br></i></br></p><p>These words describe Boromir exactly. To him, as to his father, the idea of the Good is limited to “the good of Gondor”; ultimately, to the good reputation of the Stewards and their house. Because Gondor, too, has much in it that is intrinsically good – there, too, folk spend much of their time growing food and eating it, and doing various kinds of service to one another – this remains a noble pursuit; but it is fatally flawed, for it mistakes the secondary good (the reputation of the guardians) for the primary.</p><p>Tolkien’s most direct criticism of this defective idea of virtue is put in the mouth of Faramir. He does not denigrate Boromir’s character directly, but he implicitly recognizes his flaws by making the distinction that Boromir missed, preferring the primary to the secondary good:</p><p><i>‘I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend.’<u><br/></u></i></p></blockquote><p>The NYPD have made it clear that they love only themselves. They do not love that which they claim to protect and serve. Their idea of virtue is defective. They want to be regarded as heroes, but it is their very hunger for heroic status that renders genuine heroism forever beyond their reach.</p></div>",
  "content_text": "The police are under no legal obligation to protect and serve you. And apparently, if they do not feel sufficiently lionized by the public,\nthey will not even do their jobs\n.\nArrests plummet 66% with NYPD in virtual work stoppage. It’s not a slowdown — it’s a virtual work stoppage. NYPD traffic tickets and summonses for minor offenses have dropped off by a staggering 94 percent following the execution of two cops — as officers feel betrayed by the mayor and fear for their safety, The Post has learned.\nThe dramatic drop comes as Police Commissioner Bill Bratton and Mayor Bill de Blasio plan to hold an emergency summit on Tuesday with the heads of the five police unions to try to close the widening rift between cops and the administration.\nIt has helped contribute to a nose dive in low-level policing, with\noverall arrests down 66 percent for the week starting Dec. 22 compared\nwith the same period in 2013, stats show. Citations for traffic violations fell by 94 percent, from 10,069 to 587, during that time frame. Summonses for low-level offenses like public drinking and urination also plunged 94 percent — from 4,831 to 300.\nEven parking violations are way down, dropping by 92 percent, from 14,699 to 1,241. Drug arrests by cops assigned to the NYPD’s Organized Crime Control\nBureau — which are part of the overall number — dropped by 84 percent,\nfrom 382 to 63.\nIf you still weren’t convinced that the corrupt and militarized modern police of America are little more than a badge gang, I should think this obnoxious, irresponsible reaction by the police should suffice to convince you, at least concerning the feckless nature of the NYPD.\nRecall that police work is not even among the ten most dangerous jobs in America; if it were, women would not pursue it. Remember that most officers never draw their gun nor fire it in the course of their career. And keep in mind that police departments intentionally screen to keep out the excessively intelligent and the insufficiently aggressive.\nThe petulance of the NYPD made me recall the Tom Simon essay in Sci Phi Journal #2, which concerned, among other things, Tolkien’s definition of heroism.\nIn his essay “Ofermod,” Tolkien writes:\nFor this ‘northern heroic spirit’ is never quite pure; it is of gold and an alloy. Unalloyed it would direct a man to endure even death unflinching, when necessary: that is when death may help the achievement of some object of will, or when life can only be purchased by denial of what one stands for. But since such conduct is held admirable, the alloy of personal good name was never wholly absent.\nThese words describe Boromir exactly. To him, as to his father, the idea of the Good is limited to “the good of Gondor”; ultimately, to the good reputation of the Stewards and their house. Because Gondor, too, has much in it that is intrinsically good – there, too, folk spend much of their time growing food and eating it, and doing various kinds of service to one another – this remains a noble pursuit; but it is fatally flawed, for it mistakes the secondary good (the reputation of the guardians) for the primary.\nTolkien’s most direct criticism of this defective idea of virtue is put in the mouth of Faramir. He does not denigrate Boromir’s character directly, but he implicitly recognizes his flaws by making the distinction that Boromir missed, preferring the primary to the secondary good:\n‘I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend.’\nThe NYPD have made it clear that they love only themselves. They do not love that which they claim to protect and serve. Their idea of virtue is defective. They want to be regarded as heroes, but it is their very hunger for heroic status that renders genuine heroism forever beyond their reach.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-31T13:30:00+00:00"
}