{
  "url": "https://voxday.net/2014/12/17/of-books-and-games/",
  "scraped_at": "2025-12-16T12:38:46.986355",
  "title": "Of books and games",
  "date_display": "December 17, 2014",
  "date_iso": "2014-12-17T20:50:00+00:00",
  "date_from_url": "2014-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ken Burnside of Ad Astra Games <a href=\"http://www.adastragames.com/news/2014/12/16/riding-the-red-horse\">chimes in</a>:</p><blockquote class=\"tr_bq\"><p> So, one of my other gigs – beyond making Cool Space Combat Games, is<br> being a science checker for SF writers for Baen.  I got asked by Vox Day<br> to write a science article for their new anthology series “Riding the<br> Red Horse” – which released yesterday. In its first day of<br> release, it’s done impressively – it’s climbing up the paid Kindle<br> listings and is a category leader in Military SF and SF in general.</br></br></br></br></br></p></blockquote><p>Ken’s “The Hot Equations: Thermodynamics and Military Science Fiction” is a must-read for any science fiction author. And check this out… Ad Astra is about to come out with the Traveller version of Squadron Strike!</p><p>From the most recent review of <a href=\"http://www.amazon.com/Riding-Red-Horse-Christopher-Nuttall-ebook/dp/B00QZD9H5K\"><i><b>RIDING THE RED HORSE</b></i></a>: <i>“I thoroughly enjoyed this collection of mil sci-fi short stories and essays on war. Each<br> story left me wanting more of the universe in which it takes place (my<br> favourite of the shorts was the last one: “Turncoat” by Steve Rzasa,),<br> and each essay made me marvel at the genius of the respective author. I<br> wouldn’t consider myself a military theory buff, but the essays in this<br> collections certainly awakened a hunger in me to find out more and<br> explore the world of war-gaming.”</br></br></br></br></br></br></i></p></div>",
  "content_text": "Ken Burnside of Ad Astra Games\nchimes in\n:\nSo, one of my other gigs – beyond making Cool Space Combat Games, is\nbeing a science checker for SF writers for Baen.  I got asked by Vox Day\nto write a science article for their new anthology series “Riding the\nRed Horse” – which released yesterday. In its first day of\nrelease, it’s done impressively – it’s climbing up the paid Kindle\nlistings and is a category leader in Military SF and SF in general.\nKen’s “The Hot Equations: Thermodynamics and Military Science Fiction” is a must-read for any science fiction author. And check this out… Ad Astra is about to come out with the Traveller version of Squadron Strike!\nFrom the most recent review of\nRIDING THE RED HORSE\n:\n“I thoroughly enjoyed this collection of mil sci-fi short stories and essays on war. Each\nstory left me wanting more of the universe in which it takes place (my\nfavourite of the shorts was the last one: “Turncoat” by Steve Rzasa,),\nand each essay made me marvel at the genius of the respective author. I\nwouldn’t consider myself a military theory buff, but the essays in this\ncollections certainly awakened a hunger in me to find out more and\nexplore the world of war-gaming.”",
  "tags": [
    "Castalia",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-17T20:50:00+00:00"
}