{
  "url": "https://voxday.net/2014/12/23/on-periphery-of-pink-sf/",
  "scraped_at": "2025-12-16T12:39:18.102876",
  "title": "On the periphery of Pink SF",
  "date_display": "December 23, 2014",
  "date_iso": "2014-12-23T12:26:00+00:00",
  "date_from_url": "2014-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTCjzFKjraCzMM_EFIKvbirWwp-xluDqZRxfJPlSp29DaiWtyRpkmkZsMYS\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTCjzFKjraCzMM_EFIKvbirWwp-xluDqZRxfJPlSp29DaiWtyRpkmkZsMYS\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTCjzFKjraCzMM_EFIKvbirWwp-xluDqZRxfJPlSp29DaiWtyRpkmkZsMYS\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>I have been a fan of William Gibson ever since reading how Johnny was a very <i>technical </i>boy. Even as his novels have gotten more literary, and less coherent, I’ve always enjoyed reading them. So, I was quite pleased when <i>The Peripheral </i>came out recently; a new William Gibson novel is always something to be celebrated in my book.</p><p>And it’s good. The novel well-written, the plot is intricate, the sensibilities are cool (if perhaps indicative of being influenced by Hollywood’s new fascination with the rural American South), and, as always, Gibson presents a vision of the future that is somehow more plausible than the average science fiction writer’s. His skill, I think, is to present something between dystopia and the present; perhaps one might describe his perspective as <i>dystrendic</i>. Or in this case, dystrendic to catastrophically dystrendic, as the book spans a small spectrum of futures for reasons I would find difficult to describe even if it wasn’t a spoiler of sorts.</p><p>Gibson’s style, never florid, has become increasingly sparse as his disinclination to provide detailed description has now stripped down his dialogue. While this has the effect of making the conversations flow more realistically, the combination of the two frequently leaves the reader slightly confused as to what is going on. It’s very important to pay attention to even small details, because that’s all you’re going to get; he’s not going to go back and explain things for you. And while I rather like this approach, it’s perhaps not optimal for a book with a plot that would already be challenging to follow.</p><p>The story is about a young woman who witnesses a real murder while in a virtual environment. The story expands considerably from there, and since there is no way to reasonably do it justice in less than two or three pages, I won’t even try. As is often his wont, Gibson bring in elements of technology, art, and shadowy corporations in a sophisticated manner.</p><p>However, after a year of confronting the growing divide between Pink SF and Blue SF, it is readily apparent that Gibson is of the Pink school, and to his detriment. He is among the best of the Pink school, to be sure, but <i>The Peripheral</i> wind up being shortchanged by Gibson’s resort to several Pink SF conventions.</p><p>Chief among them is a mostly non-portrayal of religion that is retarded to the point of being embarrassing. We are supposed to believe that the complete collection of rural Southerners, including a number of military veterans, are as completely and utterly irreligious as wealthy elite Brits on the future arts scene. Moreover, there isn’t a single mention of football… in the American South of the 2030s. The only nominally religious individuals are the fictional version of the Westboro Baptist Church, although to Gibson’s credit, he recognizes their lawyerly activism for the financial scam it is.</p><p>However, even their nominal Christianity leads to an unfortunate demonstration of Gibson’s moral vacuity, as he literally equates silent, public, and entirely legal protest that takes a judgmental position with gassing a large group of people with lethal psychotropic drugs. Because doing the latter would make them “assholes” like the former. This was, to put it mildly, an astonishing ethical metric.</p><p>The worst aspect of the book, however, is the phoned-in characters. He gets the military aspects more or less correct, but completely fails on the Southern ones. And the female protagonist doesn’t even rise to the usual level of a man with breasts, she is little more than the book’s Macguffin, a character sans agency to whom things happen, and things more incredible than Cinderella. She is often praised for possessing attributes that she doesn’t show in any way; it’s almost Mary-Sueish at times. Throw in the fact that all the bad guys die instantly whenever shot at by the female superagent, who eventually shows up to absolutely no reader’s surprise and outperforms even the Marine veterans, and the reader occasionally finds himself dismissively rolling his eyes.</p><p>I also have to note that happy ending is so prodigiously stupid with regards to the characters that it boggles the mind. It gives absolutely nothing of interest away to note that the entire mixed-sex group, none of whom have shown ANY sexual interest in each other throughout the entire book, abruptly pair up and live happily ever after. Ye cats.</p><p>It is a pity that Gibson appears to be unable to turn his keen eye for observation towards the points where his ideological assumptions depart from reality, as it would have made for an objectively better book. if he had been able to do so <i>The Peripheral </i>isn’t a bad science fiction read, but it will be quickly forgotten, and William Gibson could be, and should be, better than that.</p></div>",
  "content_text": "I have been a fan of William Gibson ever since reading how Johnny was a very\ntechnical\nboy. Even as his novels have gotten more literary, and less coherent, I’ve always enjoyed reading them. So, I was quite pleased when\nThe Peripheral\ncame out recently; a new William Gibson novel is always something to be celebrated in my book.\nAnd it’s good. The novel well-written, the plot is intricate, the sensibilities are cool (if perhaps indicative of being influenced by Hollywood’s new fascination with the rural American South), and, as always, Gibson presents a vision of the future that is somehow more plausible than the average science fiction writer’s. His skill, I think, is to present something between dystopia and the present; perhaps one might describe his perspective as\ndystrendic\n. Or in this case, dystrendic to catastrophically dystrendic, as the book spans a small spectrum of futures for reasons I would find difficult to describe even if it wasn’t a spoiler of sorts.\nGibson’s style, never florid, has become increasingly sparse as his disinclination to provide detailed description has now stripped down his dialogue. While this has the effect of making the conversations flow more realistically, the combination of the two frequently leaves the reader slightly confused as to what is going on. It’s very important to pay attention to even small details, because that’s all you’re going to get; he’s not going to go back and explain things for you. And while I rather like this approach, it’s perhaps not optimal for a book with a plot that would already be challenging to follow.\nThe story is about a young woman who witnesses a real murder while in a virtual environment. The story expands considerably from there, and since there is no way to reasonably do it justice in less than two or three pages, I won’t even try. As is often his wont, Gibson bring in elements of technology, art, and shadowy corporations in a sophisticated manner.\nHowever, after a year of confronting the growing divide between Pink SF and Blue SF, it is readily apparent that Gibson is of the Pink school, and to his detriment. He is among the best of the Pink school, to be sure, but\nThe Peripheral\nwind up being shortchanged by Gibson’s resort to several Pink SF conventions.\nChief among them is a mostly non-portrayal of religion that is retarded to the point of being embarrassing. We are supposed to believe that the complete collection of rural Southerners, including a number of military veterans, are as completely and utterly irreligious as wealthy elite Brits on the future arts scene. Moreover, there isn’t a single mention of football… in the American South of the 2030s. The only nominally religious individuals are the fictional version of the Westboro Baptist Church, although to Gibson’s credit, he recognizes their lawyerly activism for the financial scam it is.\nHowever, even their nominal Christianity leads to an unfortunate demonstration of Gibson’s moral vacuity, as he literally equates silent, public, and entirely legal protest that takes a judgmental position with gassing a large group of people with lethal psychotropic drugs. Because doing the latter would make them “assholes” like the former. This was, to put it mildly, an astonishing ethical metric.\nThe worst aspect of the book, however, is the phoned-in characters. He gets the military aspects more or less correct, but completely fails on the Southern ones. And the female protagonist doesn’t even rise to the usual level of a man with breasts, she is little more than the book’s Macguffin, a character sans agency to whom things happen, and things more incredible than Cinderella. She is often praised for possessing attributes that she doesn’t show in any way; it’s almost Mary-Sueish at times. Throw in the fact that all the bad guys die instantly whenever shot at by the female superagent, who eventually shows up to absolutely no reader’s surprise and outperforms even the Marine veterans, and the reader occasionally finds himself dismissively rolling his eyes.\nI also have to note that happy ending is so prodigiously stupid with regards to the characters that it boggles the mind. It gives absolutely nothing of interest away to note that the entire mixed-sex group, none of whom have shown ANY sexual interest in each other throughout the entire book, abruptly pair up and live happily ever after. Ye cats.\nIt is a pity that Gibson appears to be unable to turn his keen eye for observation towards the points where his ideological assumptions depart from reality, as it would have made for an objectively better book. if he had been able to do so\nThe Peripheral\nisn’t a bad science fiction read, but it will be quickly forgotten, and William Gibson could be, and should be, better than that.",
  "tags": [
    "Book Review",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-23T12:26:00+00:00"
}