{
  "url": "https://voxday.net/2014/12/17/pity-poor-tro/",
  "scraped_at": "2025-12-16T12:38:37.785363",
  "title": "Pity the poor troll",
  "date_display": "December 17, 2014",
  "date_iso": "2014-12-17T00:42:00+00:00",
  "date_from_url": "2014-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Poor Andrew Marston is sad that his trolling has rendered him <a href=\"http://yamamanama.livejournal.com/294529.html\">unable to post things by people he likes</a>, for fear that they’ll be treated the way he treats others.</p><blockquote class=\"tr_bq\"><p> I actually thought about linking to a video of Emma singing and playing<br> guitar. Don’t get me wrong, this has little to do with the elections, in<br> fact, I actually considered posting it the day after the election, but<br> then I found out Larry Correia and his poo-flingers are searching for<br> and conjecturing upon my posts elsewhere on the internet, and since<br> linking to a video of Emma by Emma could put us in a situation where<br> Correia or Vox could do a lot of damage, I am not linking to it.</br></br></br></br></br></br></p></blockquote><p>Of course, there are a lot of things we could do. For one, we could let them know about how Andrew <a href=\"http://eyzwydopensblog.blogspot.com.au/2005/04/internets-premier-deviate-clown-prince.html\">publicly bragged about posting pornography</a> on the site of two underage girls:</p><blockquote class=\"tr_bq\"><p> <i>If you had to confess to the most evil thing you have ever done, what would it be?</i></p><p>Yamamanama–I bet April Gaede knows the answer to that one… heh, heh… Oh yeah, Prussian Blue is on SomethingAwful. Lynx and Lamb’s diary was hacked or something, because it was overloaded with porn. Gay porn. Gay porn involving old people. Gay porn involving old white people. In response, April Gaede only allowed one character (!?) in the guestbook. In response to that, people made 42 posts with one character each.</p><p>Yamamanama–Child porn? Yeah, OK. I actually posted some examples of the stuff I spammed Micetrap Records with in that thread about Who Is White? </p><p><i>He also goes by the name of yama the space fish. The guy is a certified nut case who posts porn all over the internet. I saw a few examples of his work on some WP sights before the mods had a chance to pull it off. He is one sick bastard. He posted a picture of children having sex on one sight,and another one of two elderly men having gay sex on another one. Then after they were removed he tried to say they were just pictures of a chineese girl in a bathing suit.</i></p></blockquote><p>Andrew quite clearly doesn’t understand how “irritating people who can afford to pay for private detectives” works. Or that “annoying people with high-level connections at various Internet technology companies” is probably not a good idea. Or that all of that is completely irrelevant when he’s already posted so many names on his own site…. Andrew doesn’t really seem to understand how the Internet works. Now here is the punchline:</p><blockquote class=\"tr_bq\"><p> Andrew Marston aka Beardsley McTurbanhead <br> The fact that Blogspot turns a blind eye to your many harassment campaigns is sickening.</br></p><p>I’m sure it’s a coincidence that comments on Silence Without have all<br> disappeared now that Steve Sailer, Vox Day, and Andrew Bolt have linked<br> to it.</br></br></p></blockquote><p>You’re projecting there, Andrew. I’m not harassing anyone. One single link to a blog site in the news that specifically mentions me by name doesn’t qualify as harassment or trolling in anyone’s book. You, on the other hand, were known for harassing many people for years before you ever discovered this blog. Now, perhaps you have forgotten, but I am literally publishing the book on 4GW,  and as you should have learned from the example of McRapey, I may be slow to start, but once I get rolling, I never, ever stop.</p><p>Burning question: Who’s going to have a lot of explaining to do after I get off the phone with the police department? Child porn is not a joke to them.</p><p>A partial list of names: Alauda*, Arachnothera, Beardsley McTurbanhead, Chokley Carmichael,<br> Clamps*, Comrade Questions, Daphis, Daphnis*, Freddy Foreshadowing,<br> Luscinia*, Luscinia Hafez, Starshine, Sunlight, Will Le Fey*, Yama*,<br> Yamamanama*, Yama the Space Fish.</br></br></br></p></div>",
  "content_text": "Poor Andrew Marston is sad that his trolling has rendered him\nunable to post things by people he likes\n, for fear that they’ll be treated the way he treats others.\nI actually thought about linking to a video of Emma singing and playing\nguitar. Don’t get me wrong, this has little to do with the elections, in\nfact, I actually considered posting it the day after the election, but\nthen I found out Larry Correia and his poo-flingers are searching for\nand conjecturing upon my posts elsewhere on the internet, and since\nlinking to a video of Emma by Emma could put us in a situation where\nCorreia or Vox could do a lot of damage, I am not linking to it.\nOf course, there are a lot of things we could do. For one, we could let them know about how Andrew\npublicly bragged about posting pornography\non the site of two underage girls:\nIf you had to confess to the most evil thing you have ever done, what would it be?\nYamamanama–I bet April Gaede knows the answer to that one… heh, heh… Oh yeah, Prussian Blue is on SomethingAwful. Lynx and Lamb’s diary was hacked or something, because it was overloaded with porn. Gay porn. Gay porn involving old people. Gay porn involving old white people. In response, April Gaede only allowed one character (!?) in the guestbook. In response to that, people made 42 posts with one character each.\nYamamanama–Child porn? Yeah, OK. I actually posted some examples of the stuff I spammed Micetrap Records with in that thread about Who Is White?\nHe also goes by the name of yama the space fish. The guy is a certified nut case who posts porn all over the internet. I saw a few examples of his work on some WP sights before the mods had a chance to pull it off. He is one sick bastard. He posted a picture of children having sex on one sight,and another one of two elderly men having gay sex on another one. Then after they were removed he tried to say they were just pictures of a chineese girl in a bathing suit.\nAndrew quite clearly doesn’t understand how “irritating people who can afford to pay for private detectives” works. Or that “annoying people with high-level connections at various Internet technology companies” is probably not a good idea. Or that all of that is completely irrelevant when he’s already posted so many names on his own site…. Andrew doesn’t really seem to understand how the Internet works. Now here is the punchline:\nAndrew Marston aka Beardsley McTurbanhead\nThe fact that Blogspot turns a blind eye to your many harassment campaigns is sickening.\nI’m sure it’s a coincidence that comments on Silence Without have all\ndisappeared now that Steve Sailer, Vox Day, and Andrew Bolt have linked\nto it.\nYou’re projecting there, Andrew. I’m not harassing anyone. One single link to a blog site in the news that specifically mentions me by name doesn’t qualify as harassment or trolling in anyone’s book. You, on the other hand, were known for harassing many people for years before you ever discovered this blog. Now, perhaps you have forgotten, but I am literally publishing the book on 4GW,  and as you should have learned from the example of McRapey, I may be slow to start, but once I get rolling, I never, ever stop.\nBurning question: Who’s going to have a lot of explaining to do after I get off the phone with the police department? Child porn is not a joke to them.\nA partial list of names: Alauda*, Arachnothera, Beardsley McTurbanhead, Chokley Carmichael,\nClamps*, Comrade Questions, Daphis, Daphnis*, Freddy Foreshadowing,\nLuscinia*, Luscinia Hafez, Starshine, Sunlight, Will Le Fey*, Yama*,\nYamamanama*, Yama the Space Fish.",
  "tags": [
    "freakshow",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-17T00:42:00+00:00"
}