{
  "url": "https://voxday.net/2014/12/20/pity-poor-troll-2/",
  "scraped_at": "2025-12-16T12:39:07.064412",
  "title": "Pity the poor troll 2",
  "date_display": "December 20, 2014",
  "date_iso": "2014-12-20T22:33:00+00:00",
  "date_from_url": "2014-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andrew aka Yamanamama aka @pure, impure on Twitter, is whining about attention being paid to what he and his friends are posting online:</p><blockquote class=\"tr_bq\"><p> Mike Cernovich ‏@PlayDangerously <br> SJWs have tried having me disbarred, thrown into jail, and killed (Swatted) for my speech. SJWs are terrorists. #TheInterviewMovie</br></p><p>pure, impure ‏@pure_impure<br>But when Vox Day does it to his critics and their friends, it’s fine, right?</br></p><p>Mike Cernovich ‏@PlayDangerously<br> If you people are stupid enough to pick a fight with Vox Day, don’t come crying to me.</br></p></blockquote><p>Now, I warned Andrew. Repeatedly. He has spent literally <i>years </i>trolling this blog, Larry’s blog, Eric’s blog, Sarah’s blog, Tom Mays’s blog, and numerous others. Ignoring him didn’t work. Banning him didn’t work. Very well, that simply means the time has come for more proactive measures. He apparently doesn’t understand that for perhaps the first time, he has run into someone who is more ruthless and relentless than him. He is only beginning to experience the consequences of his actions over the last two years.</p><p>But let’s be very clear on this. He is the known troll. He is the confirmed stalker. And, I suspect, he’s the criminal whose every action will be investigated by professionals.</p><p>It should be fascinating to find out what we learn about the little coward. As with the SFWA, everything will be posted here. I’ve already got Verizon, the police, and a private investigator looking into him. And there will be other parties doing so in the new year.</p><p><i>You are blocked from following @pure_impure and viewing @pure_impure’s Tweets.</i></p><p>He hasn’t posted on his journal <a href=\"http://yamamanama.livejournal.com/300301.html\">since December 15th</a>. But no matter where he posts, if he so much as mentions me, or Larry, or Dan Simmons, or the Mad Genius Club, we will find him.</p></div>",
  "content_text": "Andrew aka Yamanamama aka @pure, impure on Twitter, is whining about attention being paid to what he and his friends are posting online:\nMike Cernovich ‏@PlayDangerously\nSJWs have tried having me disbarred, thrown into jail, and killed (Swatted) for my speech. SJWs are terrorists. #TheInterviewMovie\npure, impure ‏@pure_impure\nBut when Vox Day does it to his critics and their friends, it’s fine, right?\nMike Cernovich ‏@PlayDangerously\nIf you people are stupid enough to pick a fight with Vox Day, don’t come crying to me.\nNow, I warned Andrew. Repeatedly. He has spent literally\nyears\ntrolling this blog, Larry’s blog, Eric’s blog, Sarah’s blog, Tom Mays’s blog, and numerous others. Ignoring him didn’t work. Banning him didn’t work. Very well, that simply means the time has come for more proactive measures. He apparently doesn’t understand that for perhaps the first time, he has run into someone who is more ruthless and relentless than him. He is only beginning to experience the consequences of his actions over the last two years.\nBut let’s be very clear on this. He is the known troll. He is the confirmed stalker. And, I suspect, he’s the criminal whose every action will be investigated by professionals.\nIt should be fascinating to find out what we learn about the little coward. As with the SFWA, everything will be posted here. I’ve already got Verizon, the police, and a private investigator looking into him. And there will be other parties doing so in the new year.\nYou are blocked from following @pure_impure and viewing @pure_impure’s Tweets.\nHe hasn’t posted on his journal\nsince December 15th\n. But no matter where he posts, if he so much as mentions me, or Larry, or Dan Simmons, or the Mad Genius Club, we will find him.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-20T22:33:00+00:00"
}