{
  "url": "https://voxday.net/2014/12/30/propaganda-and-illusion-of-defea/",
  "scraped_at": "2025-12-16T12:39:56.268330",
  "title": "Propaganda and the illusion of defeat",
  "date_display": "December 30, 2014",
  "date_iso": "2014-12-30T10:17:00+00:00",
  "date_from_url": "2014-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright is, to put it mildly, <a href=\"http://www.scifiwright.com/2014/12/the-perversion-of-a-legend/\">less than entirely enamored</a> of the decision of a children’s cartoon to close with a climax celebrating aberrant sexual orientation while simultaneously subverting the traditional hero’s journey:</p><blockquote class=\"tr_bq\"><p> I do not count the judgment of people whose sole qualification to make a judgment is their loud and repeated insistence that they will ignore evidence, suspend their rational faculties, award the verdict to the party they know to be guilty, and condemn the party they know to be innocent.</p><p>This, in fact, is what the Leftists hold to be their qualifications to make a moral judgment. Ask any of them. They will tell you repeatedly, so vehemently that one cannot get in a word edgewise, that they make no moral judgments, that making judgments is wrong, and that to make a judgment even in one’s thought is wrong — they call this bigotry, because they call everything by the word that means the opposite of what they really mean.</p><p>The people not upset about this are not fans of the show, because to be a fan means to use one’s judgment to judge the show as being well crafted and the story well told. The decision was poor story telling, and that would be obvious – no matter what one’s opinion about the morality or desirability or corrosive effect on society of sexual perversion.</p><p>What is the lesson here for little boys and girls watching the show? That every friend of yours, male or female, secretly craves sexual congress with you? That to be a policeman means you can neither have the magical girl nor the attractive rich girl, but you are a big loser, and they go off with each other? That family means nothing, that sex is entertainment and means nothing, that life means nothing, that ergo young women should act like bigmouthed jerks? That a woman in a leadership role is not a princess, prophetess nor priestess but is instead a pervertess?</p></blockquote><p>This perversion is what is at the heart of Pink SF/F. This is what we founded Castalia House to explicitly reject. Perhaps in reading <a href=\"http://www.castaliahouse.com/defending-ambiguity-against-the-cannons-of-the-brave-new-world/\">how the Brave New World propaganda has been celebrated</a>, in seeing the praise for “challenging expectations and bravely exploring content outside the scope of children’s television” those who have found the concept difficult to grasp will better understand the correct definition of Pink SF/F.</p><p><b><i>Pink SF/F is a Left-wing literary subgenre written as racial, sexual, and ideological propaganda in order to subvert traditional literature, religion, and society. </i></b></p><p>Substitute “cartoon” or whatever relevant medium for “literature” as you see fit. It should be readily apparent that the media praise for Team Avatar is an open confession that what the team was selling was neither art nor children’s entertainment, but propaganda intended to “change the world” in the guise of the former. And the world they intend to change is yours and your children’s.</p><p>But we don’t have to accept this. On Twitter yesterday, someone lamented that our explicit recognition of the Blue/Pink SF divide was the further Fox-ification of science fiction. And they are correct. That is happening. Here is the good news: in this analogy, we are Fox.</p><p>Notice that the Pink SF/Fers have media support in the Guardian (in the form of precisely two outside contributors), which they rely upon to make it appear that they are the more numerous and powerful side. So observe these newly audited figures from the UK media:</p><p>Daily Mail: 1,660,100<br> Telegraph: 498,484<br> Guardian: 177,000</br></br></p><p>Not only that, but the Guardian is down more than 10 percent year-on-year and has a circulation that is less than half what it was ten years ago.</p><p>What is necessary for evil to triumph is for good men to believe the illusion that evil has already won. But it hasn’t, even if sometimes it feels as if it has. But here is the important point to keep in mind: Team Avatar <i>had to wait until the very end</i> to spring their retrofitted Pink Cartoon propaganda on its fans, because otherwise those fans <i>would not have existed in the first place</i>.</p></div>",
  "content_text": "John C. Wright is, to put it mildly,\nless than entirely enamored\nof the decision of a children’s cartoon to close with a climax celebrating aberrant sexual orientation while simultaneously subverting the traditional hero’s journey:\nI do not count the judgment of people whose sole qualification to make a judgment is their loud and repeated insistence that they will ignore evidence, suspend their rational faculties, award the verdict to the party they know to be guilty, and condemn the party they know to be innocent.\nThis, in fact, is what the Leftists hold to be their qualifications to make a moral judgment. Ask any of them. They will tell you repeatedly, so vehemently that one cannot get in a word edgewise, that they make no moral judgments, that making judgments is wrong, and that to make a judgment even in one’s thought is wrong — they call this bigotry, because they call everything by the word that means the opposite of what they really mean.\nThe people not upset about this are not fans of the show, because to be a fan means to use one’s judgment to judge the show as being well crafted and the story well told. The decision was poor story telling, and that would be obvious – no matter what one’s opinion about the morality or desirability or corrosive effect on society of sexual perversion.\nWhat is the lesson here for little boys and girls watching the show? That every friend of yours, male or female, secretly craves sexual congress with you? That to be a policeman means you can neither have the magical girl nor the attractive rich girl, but you are a big loser, and they go off with each other? That family means nothing, that sex is entertainment and means nothing, that life means nothing, that ergo young women should act like bigmouthed jerks? That a woman in a leadership role is not a princess, prophetess nor priestess but is instead a pervertess?\nThis perversion is what is at the heart of Pink SF/F. This is what we founded Castalia House to explicitly reject. Perhaps in reading\nhow the Brave New World propaganda has been celebrated\n, in seeing the praise for “challenging expectations and bravely exploring content outside the scope of children’s television” those who have found the concept difficult to grasp will better understand the correct definition of Pink SF/F.\nPink SF/F is a Left-wing literary subgenre written as racial, sexual, and ideological propaganda in order to subvert traditional literature, religion, and society.\nSubstitute “cartoon” or whatever relevant medium for “literature” as you see fit. It should be readily apparent that the media praise for Team Avatar is an open confession that what the team was selling was neither art nor children’s entertainment, but propaganda intended to “change the world” in the guise of the former. And the world they intend to change is yours and your children’s.\nBut we don’t have to accept this. On Twitter yesterday, someone lamented that our explicit recognition of the Blue/Pink SF divide was the further Fox-ification of science fiction. And they are correct. That is happening. Here is the good news: in this analogy, we are Fox.\nNotice that the Pink SF/Fers have media support in the Guardian (in the form of precisely two outside contributors), which they rely upon to make it appear that they are the more numerous and powerful side. So observe these newly audited figures from the UK media:\nDaily Mail: 1,660,100\nTelegraph: 498,484\nGuardian: 177,000\nNot only that, but the Guardian is down more than 10 percent year-on-year and has a circulation that is less than half what it was ten years ago.\nWhat is necessary for evil to triumph is for good men to believe the illusion that evil has already won. But it hasn’t, even if sometimes it feels as if it has. But here is the important point to keep in mind: Team Avatar\nhad to wait until the very end\nto spring their retrofitted Pink Cartoon propaganda on its fans, because otherwise those fans\nwould not have existed in the first place\n.",
  "tags": [
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-30T10:17:00+00:00"
}