{
  "url": "https://voxday.net/2014/12/14/rhetorical-discourse-with-sjw/",
  "scraped_at": "2025-12-16T12:38:17.924062",
  "title": "Rhetorical discourse with an SJW",
  "date_display": "December 14, 2014",
  "date_iso": "2014-12-14T20:43:00+00:00",
  "date_from_url": "2014-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A dialogue on Twitter, prompted by my tweeting a paraphrase of a quote from Ayn Rand’s <i>The Fountainhead</i>, specifically her explanation of how destroying men’s values is the first step in exerting control over them:</p><blockquote class=\"tr_bq\"><p> Vox Day ‏@voxday<br> Build up John Scalzi and you’ve destroyed SF. Hail Anita S. and you’ve destroyed game review. Glorify Lena Dunham and you’ve destroyed TV.</br></p><p>Sam Fredericks ‏@Wyldawen<br> How are any of these things destroyed by differing perspectives? Are they that fragile?</br></p><p>Vox Day ‏@voxday<br> Yes, that difficult and fragile. Kill Man’s sense of values and you kill his capacity to recognize greatness or to achieve it.</br></p><p>Sam Fredericks ‏@Wyldawen<br> If a man’s sense of values of killed by a single differing opinion, either his values or weak or the man who holds them is.</br></p><p>Vox Day ‏@voxday<br> You’re totally missing the point. It’s about the STANDARDS. Fuzz the definition of “inch” and no one knows how tall anything is.</br></p><p>Sam Fredericks ‏@Wyldawen<br> That sounds very rigid and a self-defeating philosophy if one is interested in expanding knowledge.</br></p><p>Vox Day ‏@voxday<br> You don’t seek to expand knowledge. You’re just a deceiver who seeks to tear down and DISQUALIFY. You’re not fooling anyone.</br></p><p>Sam Fredericks ‏@Wyldawen<br> You clutch your brittle twig and I’ll ride the waves lifting us higher.</br></p><p>Vox Day ‏@voxday <br> Look at how many lies you’ve tried already. 1) false dichotomy, 2) “single opinion”, 3) “self-defeating”, 4) “expanding knowledge”</br></p><p>Vox Day ‏@voxday <br> And wrapping it all up with a false accusation and an appeal to progress. You are classic SJW scum.</br></p><p>Sam Fredericks ‏@Wyldawen<br> Do you love life?</br></p><p>Vox Day ‏@voxday <br> Don’t try to retreat to false dialectic after that racist rhetorical performance. It doesn’t suit you.</br></p><p>Sam Fredericks ‏@Wyldawen<br> racist?</br></p><p>Vox Day ‏@voxday<br> Yes, obviously.</br></p><p>Sam Fredericks ‏@Wyldawen<br> How?</br></p><p>Vox Day ‏@voxday<br> First you’ll have to explain how completely redefining standards and awarding mediocrity is “a single differing opinion”.</br></p></blockquote><p>You probably won’t be surprised to learn that Mr. Fredericks promptly disappeared after that. You can learn a lot from this dialogue, a lot that is useful for future engagements with SJWs and other rhetorically minded individuals.</p><p>First, notice how he begins with a question, and a dishonest, passive-aggressive question at that. That is how I immediately knew he was not an honest interlocutor, even though I answered his question in the same manner as if assuming he was. You always want to draw the SJW in deeper and force him to commit, even when you know, beyond any shadow of a reasonable doubt, what he is.</p><p>Second, he tries another passive-aggressive dig, this time in falsely characterizing the subject and setting up a false dichotomy. Remember, SJWs always attack; they don’t know how to defend their own positions due to the contradictory and oft indefensible nature of them. They HAVE to stay on the attack if they are going to come out on top and they know it.</p><p>Third, after I point out how he has failed to understand the point, he doesn’t back off, but immediately switches to another attack, this time one that involves him claiming the philosophically superior position. What he wants is for me to defend myself, instead I point out, for the first time, that he is lying. Notice how he doesn’t even defend himself against his lack of interest in “expanding knowledge”, which is a non sequitur anyhow, but doubles-down, this time implicitly appealing to a nebulous, yet inevitable progress that is superior to the “brittle twig” of having traditional standards.</p><p>Observe that at no point has he made any attempt to actually make a coherent, rational case. It’s all pure rhetoric, all meant to put him on a higher plane that permits him to pronounce judgment on me.</p><p>After I openly call him out, he suddenly retreats, realizing that I am aware of his game. He tries another approach, this one prosecutorial, despite it being a non sequitur even more egregious than the first. Then, I drop the r-bomb on him. Notice that he can’t ignore this one. He doesn’t mind being called a liar, he doesn’t mind being called out as SJW scum, he doesn’t even mind it being pointed out that his argument is incoherent rhetoric, but he can’t ignore the r-word. It’s magic, you see. Magic rhetoric.</p><p>Suddenly, for the first time, he needs to ask questions and have things defined. And that’s when I kick him in the teeth, pointing out that he’ll have to start defining all of his many rhetorical claims before I define my single rhetorical claim. There was no need for me to define any of the other assertions I made, because they are all coherent and explicable. But the racist charge makes no sense, which tells him that I not only recognize the game he is playing, but understand it and can play it better than him.</p><p>Which is why he throws in the towel and vanishes. After which, Aquila Aquilonis ‏comments in his stead: <i>And that is how a Native American takes a scalp on Twitter. #DreadIlk</i></p></div>",
  "content_text": "A dialogue on Twitter, prompted by my tweeting a paraphrase of a quote from Ayn Rand’s\nThe Fountainhead\n, specifically her explanation of how destroying men’s values is the first step in exerting control over them:\nVox Day ‏@voxday\nBuild up John Scalzi and you’ve destroyed SF. Hail Anita S. and you’ve destroyed game review. Glorify Lena Dunham and you’ve destroyed TV.\nSam Fredericks ‏@Wyldawen\nHow are any of these things destroyed by differing perspectives? Are they that fragile?\nVox Day ‏@voxday\nYes, that difficult and fragile. Kill Man’s sense of values and you kill his capacity to recognize greatness or to achieve it.\nSam Fredericks ‏@Wyldawen\nIf a man’s sense of values of killed by a single differing opinion, either his values or weak or the man who holds them is.\nVox Day ‏@voxday\nYou’re totally missing the point. It’s about the STANDARDS. Fuzz the definition of “inch” and no one knows how tall anything is.\nSam Fredericks ‏@Wyldawen\nThat sounds very rigid and a self-defeating philosophy if one is interested in expanding knowledge.\nVox Day ‏@voxday\nYou don’t seek to expand knowledge. You’re just a deceiver who seeks to tear down and DISQUALIFY. You’re not fooling anyone.\nSam Fredericks ‏@Wyldawen\nYou clutch your brittle twig and I’ll ride the waves lifting us higher.\nVox Day ‏@voxday\nLook at how many lies you’ve tried already. 1) false dichotomy, 2) “single opinion”, 3) “self-defeating”, 4) “expanding knowledge”\nVox Day ‏@voxday\nAnd wrapping it all up with a false accusation and an appeal to progress. You are classic SJW scum.\nSam Fredericks ‏@Wyldawen\nDo you love life?\nVox Day ‏@voxday\nDon’t try to retreat to false dialectic after that racist rhetorical performance. It doesn’t suit you.\nSam Fredericks ‏@Wyldawen\nracist?\nVox Day ‏@voxday\nYes, obviously.\nSam Fredericks ‏@Wyldawen\nHow?\nVox Day ‏@voxday\nFirst you’ll have to explain how completely redefining standards and awarding mediocrity is “a single differing opinion”.\nYou probably won’t be surprised to learn that Mr. Fredericks promptly disappeared after that. You can learn a lot from this dialogue, a lot that is useful for future engagements with SJWs and other rhetorically minded individuals.\nFirst, notice how he begins with a question, and a dishonest, passive-aggressive question at that. That is how I immediately knew he was not an honest interlocutor, even though I answered his question in the same manner as if assuming he was. You always want to draw the SJW in deeper and force him to commit, even when you know, beyond any shadow of a reasonable doubt, what he is.\nSecond, he tries another passive-aggressive dig, this time in falsely characterizing the subject and setting up a false dichotomy. Remember, SJWs always attack; they don’t know how to defend their own positions due to the contradictory and oft indefensible nature of them. They HAVE to stay on the attack if they are going to come out on top and they know it.\nThird, after I point out how he has failed to understand the point, he doesn’t back off, but immediately switches to another attack, this time one that involves him claiming the philosophically superior position. What he wants is for me to defend myself, instead I point out, for the first time, that he is lying. Notice how he doesn’t even defend himself against his lack of interest in “expanding knowledge”, which is a non sequitur anyhow, but doubles-down, this time implicitly appealing to a nebulous, yet inevitable progress that is superior to the “brittle twig” of having traditional standards.\nObserve that at no point has he made any attempt to actually make a coherent, rational case. It’s all pure rhetoric, all meant to put him on a higher plane that permits him to pronounce judgment on me.\nAfter I openly call him out, he suddenly retreats, realizing that I am aware of his game. He tries another approach, this one prosecutorial, despite it being a non sequitur even more egregious than the first. Then, I drop the r-bomb on him. Notice that he can’t ignore this one. He doesn’t mind being called a liar, he doesn’t mind being called out as SJW scum, he doesn’t even mind it being pointed out that his argument is incoherent rhetoric, but he can’t ignore the r-word. It’s magic, you see. Magic rhetoric.\nSuddenly, for the first time, he needs to ask questions and have things defined. And that’s when I kick him in the teeth, pointing out that he’ll have to start defining all of his many rhetorical claims before I define my single rhetorical claim. There was no need for me to define any of the other assertions I made, because they are all coherent and explicable. But the racist charge makes no sense, which tells him that I not only recognize the game he is playing, but understand it and can play it better than him.\nWhich is why he throws in the towel and vanishes. After which, Aquila Aquilonis ‏comments in his stead:\nAnd that is how a Native American takes a scalp on Twitter. #DreadIlk",
  "tags": [
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-14T20:43:00+00:00"
}