{
  "url": "https://voxday.net/2014/12/01/shut-up-boys-they-explained/",
  "scraped_at": "2025-12-16T12:36:47.942248",
  "title": "“Shut up, boys,” they explained",
  "date_display": "December 1, 2014",
  "date_iso": "2014-12-01T10:36:00+00:00",
  "date_from_url": "2014-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The St. Louis police <a href=\"http://www.ksdk.com/story/news/local/2014/11/30/stl-police-officers-association-condemns-rams-display/19721979/?hootPostID=56e4d621f410c5ee1ef0c0b0696f34f8\">appear to have been underwhelmed</a> by the Black Power-style Ferguson gesture made by five of the St. Louis Rams at yesterday’s game:</p><blockquote class=\"tr_bq\"><p> “The St. Louis Police Officers Association is profoundly disappointed with the members of the St. Louis Rams football team who chose to ignore the mountains of evidence released from the St. Louis County Grand Jury this week and engage in a display that police officers around the nation found tasteless, offensive and inflammatory.</p><p>“All week long, the Rams and the NFL were on the phone with the St. Louis Police Department asking for assurances that the players and the fans would be kept safe from the violent protesters who had rioted, looted, and burned buildings in Ferguson. Our officers have been working 12-hour shifts for over a week, they had days off including Thanksgiving cancelled so that they could defend this community from those on the streets that perpetuate this myth that Michael Brown was executed by a brother police officer and then, as the players and their fans sit safely in their dome under the watchful protection of hundreds of St. Louis’s finest, they take to the turf to call a now-exonerated officer a murderer, that is way out-of-bounds, to put it in football parlance.</p><p>“I know that there are those that will say that these players are simply exercising their First Amendment rights. Well, I’ve got news for people who think that way, cops have first amendment rights too, and we plan to exercise ours.  I’d remind the NFL and their players that it is not the violent thugs burning down buildings that buy their advertiser’s products.  It’s cops and the good people of St. Louis and other NFL towns that do.”</p></blockquote><p>It was a remarkably stupid gesture. But young men are foolish, and spoiled young black male athletes are more foolish than most. It signifies nothing. What I find more interesting about their gesture was the public reaction to it. It tends to support the notion that blacks have lost the average white American’s inclination towards sympathy. The 60’s-instilled white guilt over slavery and white enthusiasm for the civil rights charade is rapidly dissipating in a considerably less white country where tens of millions of Hispanics, Asians, and Arabs simply don’t give a quantumn of a damn about blacks or their historical sob story.</p><p>“Oh, lawsy, mah great-great-great grandpappy wuz a slave!”</p><p>“<i>Qué chingados, cabron.</i> I just got here five minutes ago. What the fuck do I care about your <i>pendejo </i>grandpappy?” </p><p>This mass indifference quite naturally causes many whites to wonder why they are expected to feel guilty about the continued inability of Africans to behave, or even to want to behave, like 18th century Englishmen. Not that there aren’t plenty of white SJWs who will salute the five players for their “courage” and “inclusivity” and spew all the customary buzzwords, but the anger and contempt most fans felt for the anti-police gesture was palpable on a number of sports-related sites. I also suspect that the half-hearted nature of the riots may have been in part due to blacks correctly sensing that there are an increasing number of whites who would welcome the race war that blacks have been threatening for fifty years.</p><p>It’s easy to be magnanimous and optimistic about the prospects for a permanent state of kumbaya when everything is going well economically and the majority population doesn’t feel threatened. It’s when the economy goes south and the majority is in the process of becoming a minority itself that race relations, class relations, and ideological relations tend to disintegrate.</p><p>Remember, majorities exist in almost every human society for a reason. And where they don’t exist naturally, they usually create themselves, often through less than entirely peaceful means. Fred <a href=\"http://www.fredoneverything.net/Ferguson.shtml\">points out the observable reality</a>:</p><blockquote class=\"tr_bq\"><p> We need to realize, but will not, that blacks are a separate people, self-aware and cohesive. They have their own dialect, music, and modes of dress, which they value. They name their kids LaToya and Keeshawn instead of Robert and Carol because they want to maintain a distance from whites.</p><p>The races spring from utterly different cultures. Compulsory integration is thus a form of social imperialism in which whites try to force blacks to conform to European norms. Blacks have no historical connection at all to Greece, Rome, the Old Testament Hebrews, Christianity, the Middle Ages, the Enlightenment, Industrial Revolution, to Newton, LaGrange, or Galois, to the philosophic tradition of Thales, Aquinas, Schopenhauer, or Hegel. Nor do Eurowhites have roots in Africa. No commonality exists.</p></blockquote><p>Postracialism isn’t merely one of the many equalitarian unicorns, it is intrinsically opposed to black self-determination. <i>They don’t want to be white.</i> They have their own identity, their own pride, and their own culture. And there is nothing wrong with that, except for the fact that it has been forcibly intertwined with white American culture.</p></div>",
  "content_text": "The St. Louis police\nappear to have been underwhelmed\nby the Black Power-style Ferguson gesture made by five of the St. Louis Rams at yesterday’s game:\n“The St. Louis Police Officers Association is profoundly disappointed with the members of the St. Louis Rams football team who chose to ignore the mountains of evidence released from the St. Louis County Grand Jury this week and engage in a display that police officers around the nation found tasteless, offensive and inflammatory.\n“All week long, the Rams and the NFL were on the phone with the St. Louis Police Department asking for assurances that the players and the fans would be kept safe from the violent protesters who had rioted, looted, and burned buildings in Ferguson. Our officers have been working 12-hour shifts for over a week, they had days off including Thanksgiving cancelled so that they could defend this community from those on the streets that perpetuate this myth that Michael Brown was executed by a brother police officer and then, as the players and their fans sit safely in their dome under the watchful protection of hundreds of St. Louis’s finest, they take to the turf to call a now-exonerated officer a murderer, that is way out-of-bounds, to put it in football parlance.\n“I know that there are those that will say that these players are simply exercising their First Amendment rights. Well, I’ve got news for people who think that way, cops have first amendment rights too, and we plan to exercise ours.  I’d remind the NFL and their players that it is not the violent thugs burning down buildings that buy their advertiser’s products.  It’s cops and the good people of St. Louis and other NFL towns that do.”\nIt was a remarkably stupid gesture. But young men are foolish, and spoiled young black male athletes are more foolish than most. It signifies nothing. What I find more interesting about their gesture was the public reaction to it. It tends to support the notion that blacks have lost the average white American’s inclination towards sympathy. The 60’s-instilled white guilt over slavery and white enthusiasm for the civil rights charade is rapidly dissipating in a considerably less white country where tens of millions of Hispanics, Asians, and Arabs simply don’t give a quantumn of a damn about blacks or their historical sob story.\n“Oh, lawsy, mah great-great-great grandpappy wuz a slave!”\n“\nQué chingados, cabron.\nI just got here five minutes ago. What the fuck do I care about your\npendejo\ngrandpappy?”\nThis mass indifference quite naturally causes many whites to wonder why they are expected to feel guilty about the continued inability of Africans to behave, or even to want to behave, like 18th century Englishmen. Not that there aren’t plenty of white SJWs who will salute the five players for their “courage” and “inclusivity” and spew all the customary buzzwords, but the anger and contempt most fans felt for the anti-police gesture was palpable on a number of sports-related sites. I also suspect that the half-hearted nature of the riots may have been in part due to blacks correctly sensing that there are an increasing number of whites who would welcome the race war that blacks have been threatening for fifty years.\nIt’s easy to be magnanimous and optimistic about the prospects for a permanent state of kumbaya when everything is going well economically and the majority population doesn’t feel threatened. It’s when the economy goes south and the majority is in the process of becoming a minority itself that race relations, class relations, and ideological relations tend to disintegrate.\nRemember, majorities exist in almost every human society for a reason. And where they don’t exist naturally, they usually create themselves, often through less than entirely peaceful means. Fred\npoints out the observable reality\n:\nWe need to realize, but will not, that blacks are a separate people, self-aware and cohesive. They have their own dialect, music, and modes of dress, which they value. They name their kids LaToya and Keeshawn instead of Robert and Carol because they want to maintain a distance from whites.\nThe races spring from utterly different cultures. Compulsory integration is thus a form of social imperialism in which whites try to force blacks to conform to European norms. Blacks have no historical connection at all to Greece, Rome, the Old Testament Hebrews, Christianity, the Middle Ages, the Enlightenment, Industrial Revolution, to Newton, LaGrange, or Galois, to the philosophic tradition of Thales, Aquinas, Schopenhauer, or Hegel. Nor do Eurowhites have roots in Africa. No commonality exists.\nPostracialism isn’t merely one of the many equalitarian unicorns, it is intrinsically opposed to black self-determination.\nThey don’t want to be white.\nThey have their own identity, their own pride, and their own culture. And there is nothing wrong with that, except for the fact that it has been forcibly intertwined with white American culture.",
  "tags": [
    "sports",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-01T10:36:00+00:00"
}