{
  "url": "https://voxday.net/2014/12/04/sic-semper-ccus/",
  "scraped_at": "2025-12-16T12:37:11.267008",
  "title": "Sic semper cæcis",
  "date_display": "December 4, 2014",
  "date_iso": "2014-12-04T07:00:00+00:00",
  "date_from_url": "2014-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you don’t feel even the smallest touch of schadenfreude <a href=\"http://www.americanthinker.com/articles/2014/12/black_crime_claims_life_of_apologist_for_black_crime.html\">about this man’s alleged murder</a>, you’re either a saint or a self-deluded SJW:</p><blockquote class=\"tr_bq\"><p> David Ruenzel knew, better than most, about the white privilege that killed him. As a writer for the Southern Poverty Law Center, one of his favorite topics was rooting out racism. And how white racism is permanent. White racism is everywhere. And white racism explains everything.</p><p>This mantra of the Critical Race Theory and the Southern Poverty Law Center applied to all white people because, even if they were not personally cracking the whips, or breaking the skulls, white people benefited from a racist system that did all that — and a lot more.</p><p>Ruenzel was writing about white privilege for the Southern Poverty Law Center as far back as 1997 — long before it became the rage at college campuses, newsrooms, churches, high schools and even grade schools.</p><p>By the time of his death, Ruenzel had accumulated many of the trappings of the white privilege he exposed: The job. The home. The intact family. And most importantly in his case, white privilege endowed Ruenzel with an expectation of safety in the Oakland neighborhood where last week two black people are suspected of killing him.</p></blockquote><p>One would like to imagine that the progressive white equalitarians would wake up before they get themselves, and large quantities of other people, killed, but <a href=\"http://abc7news.com/news/police-offer-reward-in-oakland-hills-park-death/415669/\">the lesson of David Ruenzel</a> informs us that we shouldn’t count on it. It’s rather like the aid worker who was raped in Haiti; not even a callous denial of her appeal to racial brotherhood and subsequent rape was enough to convince her that black skin does not render one morally unaccountable.</p><p>Listening to the equalitarians and taking them seriously is a very good way to get yourself beaten, raped, or killed. Because eventually, objective reality asserts itself, and it asserts itself all the more cruelly to those who willfully pay it no heed.</p><p>Speaking of cruelty, granted, it may be the artist in me, but I rather like to think that before he was gunned down, David Ruenzel explained to his killers, a little indignantly, that he was a writer for the Southern Poverty Law Center and that what they needed to understand that he was <i>on their side</i>. Of course, what he didn’t understand, and now will never have the chance to understand, is that <i>it doesn’t matter</i>.</p><p>Ironically, the only way David Ruenzel’s death will have any meaning at all is if people reject his foolish philosophy as a result of it.</p></div>",
  "content_text": "If you don’t feel even the smallest touch of schadenfreude\nabout this man’s alleged murder\n, you’re either a saint or a self-deluded SJW:\nDavid Ruenzel knew, better than most, about the white privilege that killed him. As a writer for the Southern Poverty Law Center, one of his favorite topics was rooting out racism. And how white racism is permanent. White racism is everywhere. And white racism explains everything.\nThis mantra of the Critical Race Theory and the Southern Poverty Law Center applied to all white people because, even if they were not personally cracking the whips, or breaking the skulls, white people benefited from a racist system that did all that — and a lot more.\nRuenzel was writing about white privilege for the Southern Poverty Law Center as far back as 1997 — long before it became the rage at college campuses, newsrooms, churches, high schools and even grade schools.\nBy the time of his death, Ruenzel had accumulated many of the trappings of the white privilege he exposed: The job. The home. The intact family. And most importantly in his case, white privilege endowed Ruenzel with an expectation of safety in the Oakland neighborhood where last week two black people are suspected of killing him.\nOne would like to imagine that the progressive white equalitarians would wake up before they get themselves, and large quantities of other people, killed, but\nthe lesson of David Ruenzel\ninforms us that we shouldn’t count on it. It’s rather like the aid worker who was raped in Haiti; not even a callous denial of her appeal to racial brotherhood and subsequent rape was enough to convince her that black skin does not render one morally unaccountable.\nListening to the equalitarians and taking them seriously is a very good way to get yourself beaten, raped, or killed. Because eventually, objective reality asserts itself, and it asserts itself all the more cruelly to those who willfully pay it no heed.\nSpeaking of cruelty, granted, it may be the artist in me, but I rather like to think that before he was gunned down, David Ruenzel explained to his killers, a little indignantly, that he was a writer for the Southern Poverty Law Center and that what they needed to understand that he was\non their side\n. Of course, what he didn’t understand, and now will never have the chance to understand, is that\nit doesn’t matter\n.\nIronically, the only way David Ruenzel’s death will have any meaning at all is if people reject his foolish philosophy as a result of it.",
  "tags": [
    "SJW",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-04T07:00:00+00:00"
}