{
  "url": "https://voxday.net/2014/12/09/sie-sind-das-volk/",
  "scraped_at": "2025-12-16T12:37:42.189012",
  "title": "Sie sind das Volk",
  "date_display": "December 9, 2014",
  "date_iso": "2014-12-09T11:33:00+00:00",
  "date_from_url": "2014-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"firstPar\"> I’m fairly certain the Germans want to preserve Germany’s Western Christian culture, not any nonexistent “Judeo-Christian Culture”. But <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/germany/11281103/Germans-take-to-the-streets-to-protest-against-Islamisation.html\">in this timely piece</a>, notice the interesting use of the term “migrant” rather than “immigrant”.<blockquote class=\"tr_bq\"><p> A new type of anti-immigration protest is sweeping across Germany, as<br> thousands take to the streets against what they say is the growing<br> “Islamisation” of the country.</br></br></p><p>The new protests, which began in the city of Dresden in the former East<br> Germany, feature no neo-Nazi slogans and have nothing to do with the<br> traditional far right. Instead the demonstrators have adopted the old rallying call of the protests<br> against the East German communist regime that brought down the Berlin Wall<br> 25 years ago, “Wir sind das Volk”, or “We are the people”. They say they<br> want to preserve Germany’s Judeo-Christian Western culture.</br></br></br></br></br></p><p>The protests come as Bavaria’s ruling Christian Social Union (CSU) is seeking<br> to distance itself from a draft proposal for its party conference which said<br> that immigrants should speak German not only in public, but at home as well. Germany is now the second most popular destination in the world for migrants,<br> after the US, and the country is struggling to cope with an unprecedented<br> influx of asylum-seekers.</br></br></br></br></p></blockquote><p>You know, it strikes me that if you don’t want to see a revival of National Socialism around the world in general, and in Germany in particular, encouraging the invasion of various European and European-descended countries by non-Europeans is probably an astonishingly bad idea.</p><p>As always, diversity first breeds discomfort, then anger, then hatred, and finally, bloodshed. Most Germans had no opinion at all about Islam 30 years ago. In another 30 years, they’ll be dispassionately and efficiently slaughtering large quantities of Turks and Arabs, and the world will be wringing its hands and wondering how this could ever happen again.</p><p>I’ve asked it before and I’m sure I’ll have to ask it again: Where the HELL do you think all those ethnically homogenous nations came from in the first place?</p><p>Israel for the Jews. Germany for the Germans. France for the French. England for the English. Nationalism and respect for national borders is the world’s only hope for a reasonable facsimile of peace. If segregation is not accomplished peacefully, it will be accomplished violently. If the entire written record of human history is any guide, it will be accomplished one way or another.</p></div></div>",
  "content_text": "I’m fairly certain the Germans want to preserve Germany’s Western Christian culture, not any nonexistent “Judeo-Christian Culture”. But\nin this timely piece\n, notice the interesting use of the term “migrant” rather than “immigrant”.\nA new type of anti-immigration protest is sweeping across Germany, as\nthousands take to the streets against what they say is the growing\n“Islamisation” of the country.\nThe new protests, which began in the city of Dresden in the former East\nGermany, feature no neo-Nazi slogans and have nothing to do with the\ntraditional far right. Instead the demonstrators have adopted the old rallying call of the protests\nagainst the East German communist regime that brought down the Berlin Wall\n25 years ago, “Wir sind das Volk”, or “We are the people”. They say they\nwant to preserve Germany’s Judeo-Christian Western culture.\nThe protests come as Bavaria’s ruling Christian Social Union (CSU) is seeking\nto distance itself from a draft proposal for its party conference which said\nthat immigrants should speak German not only in public, but at home as well. Germany is now the second most popular destination in the world for migrants,\nafter the US, and the country is struggling to cope with an unprecedented\ninflux of asylum-seekers.\nYou know, it strikes me that if you don’t want to see a revival of National Socialism around the world in general, and in Germany in particular, encouraging the invasion of various European and European-descended countries by non-Europeans is probably an astonishingly bad idea.\nAs always, diversity first breeds discomfort, then anger, then hatred, and finally, bloodshed. Most Germans had no opinion at all about Islam 30 years ago. In another 30 years, they’ll be dispassionately and efficiently slaughtering large quantities of Turks and Arabs, and the world will be wringing its hands and wondering how this could ever happen again.\nI’ve asked it before and I’m sure I’ll have to ask it again: Where the HELL do you think all those ethnically homogenous nations came from in the first place?\nIsrael for the Jews. Germany for the Germans. France for the French. England for the English. Nationalism and respect for national borders is the world’s only hope for a reasonable facsimile of peace. If segregation is not accomplished peacefully, it will be accomplished violently. If the entire written record of human history is any guide, it will be accomplished one way or another.",
  "tags": [
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-09T11:33:00+00:00"
}