{
  "url": "https://voxday.net/2014/12/31/sjw-england/",
  "scraped_at": "2025-12-16T12:40:05.509615",
  "title": "SJW England",
  "date_display": "December 31, 2014",
  "date_iso": "2014-12-31T09:31:00+00:00",
  "date_from_url": "2014-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Notice anything missing from <a href=\"http://www.dailymail.co.uk/news/article-2891623/Thought-provoking-biased-Mixed-reaction-Lenny-Henry-s-guest-editing-Radio-4-s-Today-programme.html\">this BBC Radio lineup</a>?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.dailymail.co.uk/i/pix/2014/12/30/24556FBC00000578-2891623-image-a-17_1419967431483.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://i.dailymail.co.uk/i/pix/2014/12/30/24556FBC00000578-2891623-image-a-17_1419967431483.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://i.dailymail.co.uk/i/pix/2014/12/30/24556FBC00000578-2891623-image-a-17_1419967431483.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Notice that they are celebrating the fact that there are no white people. None. That is the SJW vision for England and for the West, the complete elimination of the European race in addition to the complete elimination of Christianity. Even ISIS is more moderate.</p><p>There can be <u>no</u> compromise with the SJWs. To tolerate them is to tolerate the intentional destruction of you, your children, and your grandchildren. The fact that you don’t wish to play a zero-sum game doesn’t mean that they aren’t. The cultural war is real.</p><p>Anti-racism is intrinsically anti-white. It is intrinsically anti-European. And before you claim their objective is impossible, or that I am exaggerating, or even just engaging in rhetorical hyperbole, do recall that I am a Native American, a person of a certain color whose people have been driven to the brink of near extinction.</p><p>In 2014, more people began to wake up and choose their side. It’s not too late, not at all. Demographics are destiny, but demographic <i>trends </i>are far from immutable and contra the doomsayers, there are more Europeans on the planet than ever before in history. War and ethnic clashes are coming, to be sure, but the situation is considerably less desperate than it was in the days of Tvrđava Klis, Salamis, Tours, and Vienna.</p><p>In 2015, choose your side and stand up for it. Because, <a href=\"http://thefederalist.com/2014/12/23/confessions-of-a-reluctant-culture-warrior/\">as this writer has discovered</a>, whether you are Christian or atheist or agnostic, whether you are white or red or brown or yellow or black, you are not going to be permitted to sit safely on the fence, pretending to be above it all, because the totalitarian Left is not going to allow it.</p><blockquote class=\"tr_bq\"><p> For most of my career as a writer, I have been reluctant to join in the “culture wars,” mostly because I don’t fit into either of the two opposing camps. As an atheist, I’m not longing for a return to traditional religious morality, but as an individualist, I’ve never supported the weird victim-group crusades of the left.</p><p>I have mostly dedicated myself to making the case for smaller government, pointing out the failure of the welfare state, and keeping the environmentalists from shutting down industrial civilization—little things like that. Oh, and also war—not the “culture war,” but war war, the kind where people are actually trying to kill us.</p><p>So for the most part, my position on an issue like gay marriage could be summed up as: “Can we please talk about something else now?”</p><p>Partly, this comes from my small-government outlook, which holds that some things—indeed, most things, and virtually all of the really important things—should be outside the realm of politics. That definitely includes other people’s sex lives, about which I would like to know a good deal less than is fashionable at the moment.</p><p>But this year, I discovered that while I might not be interested in the culture war, the culture war is interested in me. It’s interested in all of us. This is the year when we were served noticed that we won’t be allowed to stand on the sidelines, because we will not be allowed to think differently from the left.</p></blockquote><p>Being moderate and tolerant and neutral and uninterested didn’t save the Jews in Germany. It didn’t save the peasants in China or the farmers in the Soviet Union. And it won’t save you in the 21st century West. When the SJWs say there is “no place” for various forms of thought, belief, and expression, they mean there is no place for you.</p></div>",
  "content_text": "Notice anything missing from\nthis BBC Radio lineup\n?\nNotice that they are celebrating the fact that there are no white people. None. That is the SJW vision for England and for the West, the complete elimination of the European race in addition to the complete elimination of Christianity. Even ISIS is more moderate.\nThere can be\nno\ncompromise with the SJWs. To tolerate them is to tolerate the intentional destruction of you, your children, and your grandchildren. The fact that you don’t wish to play a zero-sum game doesn’t mean that they aren’t. The cultural war is real.\nAnti-racism is intrinsically anti-white. It is intrinsically anti-European. And before you claim their objective is impossible, or that I am exaggerating, or even just engaging in rhetorical hyperbole, do recall that I am a Native American, a person of a certain color whose people have been driven to the brink of near extinction.\nIn 2014, more people began to wake up and choose their side. It’s not too late, not at all. Demographics are destiny, but demographic\ntrends\nare far from immutable and contra the doomsayers, there are more Europeans on the planet than ever before in history. War and ethnic clashes are coming, to be sure, but the situation is considerably less desperate than it was in the days of Tvrđava Klis, Salamis, Tours, and Vienna.\nIn 2015, choose your side and stand up for it. Because,\nas this writer has discovered\n, whether you are Christian or atheist or agnostic, whether you are white or red or brown or yellow or black, you are not going to be permitted to sit safely on the fence, pretending to be above it all, because the totalitarian Left is not going to allow it.\nFor most of my career as a writer, I have been reluctant to join in the “culture wars,” mostly because I don’t fit into either of the two opposing camps. As an atheist, I’m not longing for a return to traditional religious morality, but as an individualist, I’ve never supported the weird victim-group crusades of the left.\nI have mostly dedicated myself to making the case for smaller government, pointing out the failure of the welfare state, and keeping the environmentalists from shutting down industrial civilization—little things like that. Oh, and also war—not the “culture war,” but war war, the kind where people are actually trying to kill us.\nSo for the most part, my position on an issue like gay marriage could be summed up as: “Can we please talk about something else now?”\nPartly, this comes from my small-government outlook, which holds that some things—indeed, most things, and virtually all of the really important things—should be outside the realm of politics. That definitely includes other people’s sex lives, about which I would like to know a good deal less than is fashionable at the moment.\nBut this year, I discovered that while I might not be interested in the culture war, the culture war is interested in me. It’s interested in all of us. This is the year when we were served noticed that we won’t be allowed to stand on the sidelines, because we will not be allowed to think differently from the left.\nBeing moderate and tolerant and neutral and uninterested didn’t save the Jews in Germany. It didn’t save the peasants in China or the farmers in the Soviet Union. And it won’t save you in the 21st century West. When the SJWs say there is “no place” for various forms of thought, belief, and expression, they mean there is no place for you.",
  "tags": [
    "Clash of Civilizations",
    "Red Card",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-31T09:31:00+00:00"
}