{
  "url": "https://voxday.net/2014/12/13/sjws-at-amazon/",
  "scraped_at": "2025-12-16T12:38:09.095610",
  "title": "SJWs at Amazon",
  "date_display": "December 13, 2014",
  "date_iso": "2014-12-13T13:30:00+00:00",
  "date_from_url": "2014-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the description of the Amazon editors’ choice for the best book of 2014:</p><blockquote class=\"tr_bq\"><p> Lydia is dead. From the first sentence of Celeste Ng’s stunning debut, we know that the oldest daughter of the Chinese-American Lee family has died. What follows is a novel that explores alienation, achievement, race, gender, family….</p></blockquote><p>Do you even need to read <i>Everything I Never Told You: A Novel </i>to know how the book is likely to proceed? Notice how the battle we observe in Pink SF/F vs Blue SF/F is playing out in mainstream literature too. This is not merely the best novel of the year, it is supposedly the VERY BEST BOOK of 2014, yet at 4.2, it has a lower average rating than most of my books, let alone John C. Wright’s.</p><p>Why? One guess. Style and SJW politics over story, of course. Compare the two most helpful reviews, one complimentary from a guy who got the book free, and one critical from a woman who actually paid money for it. Exhibit A:</p><blockquote class=\"tr_bq\"><p> How is it possible that this is a first novel? It is so exquisite, so marvelously perfect, so regally quiet and elegant that surely, it must come from the hands of a old soul author. But no. This is Celeste Ng’s first novel, and in it, she has painted such a deeply felt, original story. This book shall remain with me for the rest of my days.</p><p>Everything I Never Told You is a story of secrets, of love, of longing, of lies, of race, of identity, and knowledge. The story begins with the death of Lydia, daughter of Marilyn and James, which is told in the first sentence and slowly revealed through the book. Why she did it drives the narrative, and yet, this story is bigger, grander than this central mystery. Marilyn wanted to defy society’s narrow vision of her life and become a doctor, while James is trying to overcome humble beginnings and a society judging him based on his race. Together, they conventions, marry and create a family. Nathan, oldest son on his way to Harvard, Lydia, the middle sister and favorite one, and Hannah, truly growing up invisible. Together, Ng has created a complex, complicated family that rings so true on every page. There isn’t a false note in the story.</p></blockquote><p>Classic. Pretentious language. Overpraise for a debut – you know there is a non-zero chance we’ll never hear about this writer again – defying society, ringing true, overwrought claims about how the book will live on in his heart forever and ever after, and to top it all off, the literary SJWs favorite praise: “There isn’t a false note in the story.”</p><p>Translation: this book is utter SJW bullshit and is full of false notes from start to finish, without ceasing. Remember, <i>SJWs always lie</i>.</p><p>And now, exhibit B:</p><blockquote class=\"tr_bq\"><p> Celeste Ng seems like a talented writer. Her style of writing is fluid and lyrical. For that reason, I really wanted to like this book. Unfortunately, I just couldn’t, primarily because nearly all the characters are so overwhelmingly awful.</p><p>I know characters don’t need to be good or even likeable to be compelling, but there has to be something to draw you in and make you care about them. That wasn’t the case here for me at all. In fact, the adult protagonists are so awful I almost wanted to stop reading at times. The main couple comprises the most self-absorbed, selfish, emotionally abusive parents I’ve ever encountered. Before the death of beloved Lydia, they turn her into a proxy of themselves and basically ignore their other children. Post-mortem, they become even more entrenched in themselves and their needs and issues and continue their neglect of their children or even take their anger out on them. Toward the end, which hints at happier times for the parents, I didn’t even care anymore. They didn’t deserve anything better.</p><p>My other issue with this novel was its treatment of race. I understand that Ng wanted this to be a treatise on racial differences and the impact prejudice can have on people, but the way she chose to do this was not effective. She was both heavy-handed and uninspiring. She made it seem as if every single person this family encountered had never seen a Chinese person and was prejudiced against them. I find this hard to believe even back in the 1970’s.</p></blockquote><p>As I said, lies from start to finish. Not merely lies, but blatant and unconvincing lies. SJWs not only swim in shit, they want you to swim in it too, which is why they incessantly try to convince you that it’s the purest, cleanest water you’ll ever taste.</p><p>To conclude my case against buying into the ludicrous propaganda of Amazon’s SJWs, note that two of the other 100 best books of the year are: <i>Not That Kind of Girl: A Young Woman Tells You What She’s “Learned”</i> by the Dunham Horror and <i>Cosby: His Life and Times</i> by Mark Whitaker, who somehow managed to avoid discovering anything about Mr. Cosby’s reported pasttime of drugging and raping women in the process of writing his biography.</p></div>",
  "content_text": "This is the description of the Amazon editors’ choice for the best book of 2014:\nLydia is dead. From the first sentence of Celeste Ng’s stunning debut, we know that the oldest daughter of the Chinese-American Lee family has died. What follows is a novel that explores alienation, achievement, race, gender, family….\nDo you even need to read\nEverything I Never Told You: A Novel\nto know how the book is likely to proceed? Notice how the battle we observe in Pink SF/F vs Blue SF/F is playing out in mainstream literature too. This is not merely the best novel of the year, it is supposedly the VERY BEST BOOK of 2014, yet at 4.2, it has a lower average rating than most of my books, let alone John C. Wright’s.\nWhy? One guess. Style and SJW politics over story, of course. Compare the two most helpful reviews, one complimentary from a guy who got the book free, and one critical from a woman who actually paid money for it. Exhibit A:\nHow is it possible that this is a first novel? It is so exquisite, so marvelously perfect, so regally quiet and elegant that surely, it must come from the hands of a old soul author. But no. This is Celeste Ng’s first novel, and in it, she has painted such a deeply felt, original story. This book shall remain with me for the rest of my days.\nEverything I Never Told You is a story of secrets, of love, of longing, of lies, of race, of identity, and knowledge. The story begins with the death of Lydia, daughter of Marilyn and James, which is told in the first sentence and slowly revealed through the book. Why she did it drives the narrative, and yet, this story is bigger, grander than this central mystery. Marilyn wanted to defy society’s narrow vision of her life and become a doctor, while James is trying to overcome humble beginnings and a society judging him based on his race. Together, they conventions, marry and create a family. Nathan, oldest son on his way to Harvard, Lydia, the middle sister and favorite one, and Hannah, truly growing up invisible. Together, Ng has created a complex, complicated family that rings so true on every page. There isn’t a false note in the story.\nClassic. Pretentious language. Overpraise for a debut – you know there is a non-zero chance we’ll never hear about this writer again – defying society, ringing true, overwrought claims about how the book will live on in his heart forever and ever after, and to top it all off, the literary SJWs favorite praise: “There isn’t a false note in the story.”\nTranslation: this book is utter SJW bullshit and is full of false notes from start to finish, without ceasing. Remember,\nSJWs always lie\n.\nAnd now, exhibit B:\nCeleste Ng seems like a talented writer. Her style of writing is fluid and lyrical. For that reason, I really wanted to like this book. Unfortunately, I just couldn’t, primarily because nearly all the characters are so overwhelmingly awful.\nI know characters don’t need to be good or even likeable to be compelling, but there has to be something to draw you in and make you care about them. That wasn’t the case here for me at all. In fact, the adult protagonists are so awful I almost wanted to stop reading at times. The main couple comprises the most self-absorbed, selfish, emotionally abusive parents I’ve ever encountered. Before the death of beloved Lydia, they turn her into a proxy of themselves and basically ignore their other children. Post-mortem, they become even more entrenched in themselves and their needs and issues and continue their neglect of their children or even take their anger out on them. Toward the end, which hints at happier times for the parents, I didn’t even care anymore. They didn’t deserve anything better.\nMy other issue with this novel was its treatment of race. I understand that Ng wanted this to be a treatise on racial differences and the impact prejudice can have on people, but the way she chose to do this was not effective. She was both heavy-handed and uninspiring. She made it seem as if every single person this family encountered had never seen a Chinese person and was prejudiced against them. I find this hard to believe even back in the 1970’s.\nAs I said, lies from start to finish. Not merely lies, but blatant and unconvincing lies. SJWs not only swim in shit, they want you to swim in it too, which is why they incessantly try to convince you that it’s the purest, cleanest water you’ll ever taste.\nTo conclude my case against buying into the ludicrous propaganda of Amazon’s SJWs, note that two of the other 100 best books of the year are:\nNot That Kind of Girl: A Young Woman Tells You What She’s “Learned”\nby the Dunham Horror and\nCosby: His Life and Times\nby Mark Whitaker, who somehow managed to avoid discovering anything about Mr. Cosby’s reported pasttime of drugging and raping women in the process of writing his biography.",
  "tags": [
    "books",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-13T13:30:00+00:00"
}