{
  "url": "https://voxday.net/2014/12/04/something-is-wrong-with-these-people/",
  "scraped_at": "2025-12-16T12:37:16.835233",
  "title": "Something is wrong with these people",
  "date_display": "December 4, 2014",
  "date_iso": "2014-12-04T21:23:00+00:00",
  "date_from_url": "2014-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VERY wrong. PZ celebrates the decision of a publisher <a href=\"http://freethoughtblogs.com/pharyngula/2014/12/04/some-girls-would-like-to-be-entomologists-too/\">to stop marketing books to boys</a>, as are his few remaining readers:</p><ul><li>Holy crap. Somebody did the right thing for a change. I am blown away.</li><li>What do I think Lego should do? I think they should make half of all<br> their future minifigs women. Construction set? Half the construction<br> workers are women. Airplane set? Make one of the pilots a woman and one<br> of the flight attendants a man. Police set? Not just a token woman, half<br> women. Half the crooks, half the cops, half the bystanders. How hard is<br> that?</br></br></br></br></br></li><li>Best news I’ve read all week.</li><li>This was enough to draw tears from me today.</li><li>My hubby the engineer bought electronics kits for our kids, and it was the oldest daughter who loved them. She happily joined him on any science project while her siblings ran off to do other things. She’s 37 now, and holds degrees in engineering, computational neuroscience and neurobiology. She’s been working for the NSF on a project to interest more women and minorities in STEM.</li></ul><p>That last comment is my favorite. She has three degrees, but instead of actually doing any science, engineering, or biology, she’s using them to work in marketing. And what do you bet she hasn’t given her parents any grandchildren?</p><p>SJWs are much worse than useless. They are active participants in the ongoing implosion of civilization.</p></div>",
  "content_text": "VERY wrong. PZ celebrates the decision of a publisher\nto stop marketing books to boys\n, as are his few remaining readers:\nHoly crap. Somebody did the right thing for a change. I am blown away.\nWhat do I think Lego should do? I think they should make half of all\ntheir future minifigs women. Construction set? Half the construction\nworkers are women. Airplane set? Make one of the pilots a woman and one\nof the flight attendants a man. Police set? Not just a token woman, half\nwomen. Half the crooks, half the cops, half the bystanders. How hard is\nthat?\nBest news I’ve read all week.\nThis was enough to draw tears from me today.\nMy hubby the engineer bought electronics kits for our kids, and it was the oldest daughter who loved them. She happily joined him on any science project while her siblings ran off to do other things. She’s 37 now, and holds degrees in engineering, computational neuroscience and neurobiology. She’s been working for the NSF on a project to interest more women and minorities in STEM.\nThat last comment is my favorite. She has three degrees, but instead of actually doing any science, engineering, or biology, she’s using them to work in marketing. And what do you bet she hasn’t given her parents any grandchildren?\nSJWs are much worse than useless. They are active participants in the ongoing implosion of civilization.",
  "tags": [
    "decline and fall",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-04T21:23:00+00:00"
}