{
  "url": "https://voxday.net/2014/12/03/speed-bumps/",
  "scraped_at": "2025-12-16T12:37:04.251111",
  "title": "Speed bumps",
  "date_display": "December 3, 2014",
  "date_iso": "2014-12-03T10:40:00+00:00",
  "date_from_url": "2014-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently the USA learned nothing <a href=\"http://www.military.com/daily-news/2014/12/01/us-army-plans-to-send-abrams-tanks-and-bradleys-eastern-europe.html\">from the Cold War</a>:</p><blockquote class=\"tr_bq\"><p> The new Army commander in Europe plans to bolster the U.S. armored presence in Poland and the Baltic states and keep rotations of U.S. troops there through next year and possibly beyond to counter Russia. Lt. Gen. Frederick “Ben” Hodges, who replaced Lt. Gen. Donald M. Campbell  earlier this month as commander of U.S. Army Europe, said the Army was looking to add about 100 Abrams tanks and Bradley Fighting Vehicles to the forces in Eastern Europe.</p><p>Since taking command, Hodges has made  clear his concerns about<br> Russia, which annexed Crimea last March and has  supported the<br> separatists in eastern Ukraine. U.S. Army Europe, which had  280,000<br> troops at the height of the Cold War, now has 31,000.</br></br></br></p><p>The rotations of U.S. troops on  training missions in Eastern Europe<br> would provide “deterrence against Russian  aggression,” Hodges said. “I don’t think that Russia has any  intention of some sort of a<br> conventional attack into NATO territory because  they know that would<br> generate an Article 5 response.”</br></br></br></p></blockquote><p>Translation: We know from the old Fulda Gap that 100 tanks won’t actually do anything militarily except provide a speed bump, but having ground troops there would provide the US with an excuse to get further involved if the Russians elect to follow the US lead in Ukraine and arrange for a “regime change” in Poland or the Baltic states.</p><p>One thing many Americans don’t understand is that <i>they are the bad guys</i> in Ukraine. The USA is the evil aggressor that overthrew a flawed but democratically elected government and installed a puppet leadership against which a portion of the country is literally up in arms. This, in addition to the failed US-supported “Arab Spring”, is another reason why anti-Americanism is on the rise in Europe and Asia.</p><p>To put it in perspective, imagine if Russia orchestrated the overthrow of the Mexican government (which is every bit as corrupt and shady as the former Ukrainian government was) and installed a pro-Russian puppet who promptly sent all of Mexico’s gold reserves to Moscow and placed Russians on the corporate boards of its oil companies? Do you think the USA would respond in as limited a fashion as Russia has?</p><p>Remember, Putin does not have to be a good guy in order for Obama to be the bad guy. The recent warning about ISIS targeting US soldiers in America is apt, as the increase in the amount and extent of US interventions abroad is infuriating more and more people around the world. If the USA won’t leave other sovereign countries alone, it seems likely that sooner or later, someone is going to return the favor.</p></div>",
  "content_text": "Apparently the USA learned nothing\nfrom the Cold War\n:\nThe new Army commander in Europe plans to bolster the U.S. armored presence in Poland and the Baltic states and keep rotations of U.S. troops there through next year and possibly beyond to counter Russia. Lt. Gen. Frederick “Ben” Hodges, who replaced Lt. Gen. Donald M. Campbell  earlier this month as commander of U.S. Army Europe, said the Army was looking to add about 100 Abrams tanks and Bradley Fighting Vehicles to the forces in Eastern Europe.\nSince taking command, Hodges has made  clear his concerns about\nRussia, which annexed Crimea last March and has  supported the\nseparatists in eastern Ukraine. U.S. Army Europe, which had  280,000\ntroops at the height of the Cold War, now has 31,000.\nThe rotations of U.S. troops on  training missions in Eastern Europe\nwould provide “deterrence against Russian  aggression,” Hodges said. “I don’t think that Russia has any  intention of some sort of a\nconventional attack into NATO territory because  they know that would\ngenerate an Article 5 response.”\nTranslation: We know from the old Fulda Gap that 100 tanks won’t actually do anything militarily except provide a speed bump, but having ground troops there would provide the US with an excuse to get further involved if the Russians elect to follow the US lead in Ukraine and arrange for a “regime change” in Poland or the Baltic states.\nOne thing many Americans don’t understand is that\nthey are the bad guys\nin Ukraine. The USA is the evil aggressor that overthrew a flawed but democratically elected government and installed a puppet leadership against which a portion of the country is literally up in arms. This, in addition to the failed US-supported “Arab Spring”, is another reason why anti-Americanism is on the rise in Europe and Asia.\nTo put it in perspective, imagine if Russia orchestrated the overthrow of the Mexican government (which is every bit as corrupt and shady as the former Ukrainian government was) and installed a pro-Russian puppet who promptly sent all of Mexico’s gold reserves to Moscow and placed Russians on the corporate boards of its oil companies? Do you think the USA would respond in as limited a fashion as Russia has?\nRemember, Putin does not have to be a good guy in order for Obama to be the bad guy. The recent warning about ISIS targeting US soldiers in America is apt, as the increase in the amount and extent of US interventions abroad is infuriating more and more people around the world. If the USA won’t leave other sovereign countries alone, it seems likely that sooner or later, someone is going to return the favor.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-03T10:40:00+00:00"
}