{
  "url": "https://voxday.net/2014/12/20/the-hope-for-world-order/",
  "scraped_at": "2025-12-16T12:39:01.300736",
  "title": "The hope for world order",
  "date_display": "December 20, 2014",
  "date_iso": "2014-12-20T11:13:00+00:00",
  "date_from_url": "2014-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re having trouble seeing things from the globalist perspective and wondering how they can possibly justify their ruthless attacks on national and individual sovereignty, it can be helpful to read their doctrines. Henry Kissinger puts forth his global vision in <i>World Order</i>:</p><blockquote class=\"tr_bq\"><p> The issue of peace in the Middle East has, in recent years, focused on the highly technical subject of nuclear weapons in Iran. There is no shortcut around the imperative of preventing their appearance. But it is well to recall periods when other seemingly intractable crises in the Middle East were given a new dimension by fortitude and vision.</p><p>Between 1967 and 1973, there had been two Arab-Israeli wars, two American military alerts, an invasion of Jordan by Syria, a massive American airlift into a war zone, multiple hijackings of airliners, and the breaking of diplomatic relations with the United States by most Arab countries. Yet it was followed by a peace process that yielded three Egyptian-Israeli agreements (culminating in a peace treaty in 1979); a disengagement agreement with Syria in 1974 (which has lasted four decades, despite the Syrian civil war); the Madrid Conference in 1991, which restarted the peace process; the Oslo agreement between the PLO and Israel in 1993; and a peace treaty between Jordan and Israel in 1994.</p><p>These goals were reached because three conditions were met: an active American policy; the thwarting of designs seeking to establish a regional order by imposing universalist principles through violence; and the emergence of leaders with a vision of peace…. Once again, doctrines of violent intimidation challenge the hopes for world order. But when they are thwarted—and nothing less will do—there may come a moment similar to what led to the breakthroughs recounted here, when vision overcame reality.</p></blockquote><p>Kissinger is a clear and lucid writer. His historical knowledge is deep and impressive. But he makes no case for his vision, he simply assumes the reader will share it; and it is easy to understand why America finds itself caught up in a convoluted web of international intrigue given the political influence of the author. The arrogance and hypocrisy in that <strike>open </strike>tacit claim that “nothing less will do” than the imposition of universalist principles through violence by leaders with a vision of peace is astonishing. And more than a little ironic in light of Kissinger’s criticism of the “remarkable arrogance” of the European colonial powers.</p><blockquote class=\"tr_bq\"><p> The pamphlets and treatises of the colonial powers from the dawn of the twentieth century reveal a remarkable arrogance, to the effect that they were entitled to shape a world order by their maxims. Accounts of China or India condescendingly defined a European mission to educate traditional cultures to higher levels of civilization.</p></blockquote><p>What is truly remarkable is the complete lack of self-awareness demonstrated here. The globalists are doing EXACTLY the same thing they complain about the colonial powers having done, and what Kissinger correctly observes the Iranians to be doing: asserting their entitlement to shape a world order by their maxims. But precisely how is Kissinger’s “vision of peace” any more rationally justified or globally authoritative than Mahmound Ahmadinejad’s publicly proclaimed “promise of God”?</p><p>And what is the globalist hope for world order if not a doctrine of violent intimidation?</p></div>",
  "content_text": "If you’re having trouble seeing things from the globalist perspective and wondering how they can possibly justify their ruthless attacks on national and individual sovereignty, it can be helpful to read their doctrines. Henry Kissinger puts forth his global vision in\nWorld Order\n:\nThe issue of peace in the Middle East has, in recent years, focused on the highly technical subject of nuclear weapons in Iran. There is no shortcut around the imperative of preventing their appearance. But it is well to recall periods when other seemingly intractable crises in the Middle East were given a new dimension by fortitude and vision.\nBetween 1967 and 1973, there had been two Arab-Israeli wars, two American military alerts, an invasion of Jordan by Syria, a massive American airlift into a war zone, multiple hijackings of airliners, and the breaking of diplomatic relations with the United States by most Arab countries. Yet it was followed by a peace process that yielded three Egyptian-Israeli agreements (culminating in a peace treaty in 1979); a disengagement agreement with Syria in 1974 (which has lasted four decades, despite the Syrian civil war); the Madrid Conference in 1991, which restarted the peace process; the Oslo agreement between the PLO and Israel in 1993; and a peace treaty between Jordan and Israel in 1994.\nThese goals were reached because three conditions were met: an active American policy; the thwarting of designs seeking to establish a regional order by imposing universalist principles through violence; and the emergence of leaders with a vision of peace…. Once again, doctrines of violent intimidation challenge the hopes for world order. But when they are thwarted—and nothing less will do—there may come a moment similar to what led to the breakthroughs recounted here, when vision overcame reality.\nKissinger is a clear and lucid writer. His historical knowledge is deep and impressive. But he makes no case for his vision, he simply assumes the reader will share it; and it is easy to understand why America finds itself caught up in a convoluted web of international intrigue given the political influence of the author. The arrogance and hypocrisy in that\nopen\ntacit claim that “nothing less will do” than the imposition of universalist principles through violence by leaders with a vision of peace is astonishing. And more than a little ironic in light of Kissinger’s criticism of the “remarkable arrogance” of the European colonial powers.\nThe pamphlets and treatises of the colonial powers from the dawn of the twentieth century reveal a remarkable arrogance, to the effect that they were entitled to shape a world order by their maxims. Accounts of China or India condescendingly defined a European mission to educate traditional cultures to higher levels of civilization.\nWhat is truly remarkable is the complete lack of self-awareness demonstrated here. The globalists are doing EXACTLY the same thing they complain about the colonial powers having done, and what Kissinger correctly observes the Iranians to be doing: asserting their entitlement to shape a world order by their maxims. But precisely how is Kissinger’s “vision of peace” any more rationally justified or globally authoritative than Mahmound Ahmadinejad’s publicly proclaimed “promise of God”?\nAnd what is the globalist hope for world order if not a doctrine of violent intimidation?",
  "tags": [
    "conspiracy",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-20T11:13:00+00:00"
}