{
  "url": "https://voxday.net/2014/12/26/the-serfs-revo/",
  "scraped_at": "2025-12-16T12:39:35.856837",
  "title": "The serfs revolt",
  "date_display": "December 26, 2014",
  "date_iso": "2014-12-26T21:17:00+00:00",
  "date_from_url": "2014-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The British Labour Party <a href=\"http://www.telegraph.co.uk/news/politics/ed-miliband/11294984/Labours-crucial-ethnic-minority-vote-set-to-collapse.html\">is learning the same lesson</a> as Hillary Clinton and the DFL representatives in Minneapolis. Those useful, politically subservient minorities imported to undermine the opposition cease to be useful or subservient once they start outnumbering the former majority in the party that depended upon them:</p><blockquote class=\"tr_bq\"><p> Labour have seen a collapse in their crucial ethnic minority vote since 2010<br> in a blow for Ed Miliband with three quarters of Indian voters abandoning<br> the party. Influential pollsters say that Labour are mistaken in their belief they are “sitting<br> pretty” with the ethnic minority vote and Indian, Pakistani and African<br> voters are turning away from the party in huge numbers.</br></br></br></br></p><p>The number of Indian voters identifying with the Labour party has fallen from<br> 77 per cent in 1997 to just 18 per cent in 2014 – a fall of over three<br> quarters, according to the figures from the British Election Study.</br></br></p><p>Pakistani support has fallen from 77 to 57 per cent, a fall of 27 per cent.<br> Meanwhile Carribean support has dropped 14 per cent from 78 to 67 per cent. Support from the African community has dropped by 20 per cent, from 79 to 63<br> per cent, the research shows.</br></br></p><p>The survey will be difficult reading for Mr Miliband as his party sees loyal<br> support among ethnic minority voters disappear just as the numbers of ethnic<br> minority voters in Britain increase. </br></br></p></blockquote><div class=\"fifthPar\"> Ethnic politics are a two-edged sword for the white politicians of the Left. The Republican Party is merely a generation away from becoming the White Party. Already, both the Labour Party and the Democratic Party are headed by non-white nationals; it will be interesting to see how long both parties tolerate white leaders, if in fact they accept them at all.</div></div>",
  "content_text": "The British Labour Party\nis learning the same lesson\nas Hillary Clinton and the DFL representatives in Minneapolis. Those useful, politically subservient minorities imported to undermine the opposition cease to be useful or subservient once they start outnumbering the former majority in the party that depended upon them:\nLabour have seen a collapse in their crucial ethnic minority vote since 2010\nin a blow for Ed Miliband with three quarters of Indian voters abandoning\nthe party. Influential pollsters say that Labour are mistaken in their belief they are “sitting\npretty” with the ethnic minority vote and Indian, Pakistani and African\nvoters are turning away from the party in huge numbers.\nThe number of Indian voters identifying with the Labour party has fallen from\n77 per cent in 1997 to just 18 per cent in 2014 – a fall of over three\nquarters, according to the figures from the British Election Study.\nPakistani support has fallen from 77 to 57 per cent, a fall of 27 per cent.\nMeanwhile Carribean support has dropped 14 per cent from 78 to 67 per cent. Support from the African community has dropped by 20 per cent, from 79 to 63\nper cent, the research shows.\nThe survey will be difficult reading for Mr Miliband as his party sees loyal\nsupport among ethnic minority voters disappear just as the numbers of ethnic\nminority voters in Britain increase.\nEthnic politics are a two-edged sword for the white politicians of the Left. The Republican Party is merely a generation away from becoming the White Party. Already, both the Labour Party and the Democratic Party are headed by non-white nationals; it will be interesting to see how long both parties tolerate white leaders, if in fact they accept them at all.",
  "tags": [
    "politics",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-26T21:17:00+00:00"
}