{
  "url": "https://voxday.net/2014/12/09/the-media-turns-on-dunham-horror/",
  "scraped_at": "2025-12-16T12:37:43.656629",
  "title": "The media turns on the Dunham Horror",
  "date_display": "December 9, 2014",
  "date_iso": "2014-12-09T13:30:00+00:00",
  "date_from_url": "2014-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All right, granted, it’s Volokh and not some scion of the Post’s left-wing elite, but it’s still remarkable to see an institution of the liberal Left finally turn on the self-admitted child molester, Lena Dunham, due to her publisher belatedly <a href=\"http://www.washingtonpost.com/news/volokh-conspiracy/wp/2014/12/08/lena-dunhams-publisher-says-her-alleged-rapist-barry-wasnt-actually-named-barry/\">admitting that her parts of her “memoir” are fictitious</a>:</p><blockquote class=\"tr_bq\"><p> Appalling. The book wasn’t a novel; it was a memoir, offered to readers as such. The copyright page, which I suspect few people read, does say that “Some names and identifying details have been changed,” but it certainly doesn’t tell people which ones.</p><p>Indeed, early in the book, when she mentions a boyfriend of hers and labels him Jonah, she adds a footnote: “Name changed to protect the truly innocent.” Reasonable readers, it seems to me, reading the rest of the memoir, would assume that “Barry” — whose name wasn’t accompanied with any such footnote — was actually named Barry. Even if not all readers would so conclude, many would, and quite understandably so.</p><p>How could Dunham and Random House do this? How could an author and a publisher — again, of a self-described memoir, not a work of fiction — describe a supposed rape by a person, give a (relatively rare) first name and enough identifying details that readers could easily track the person down, and not even mention that “Barry” wasn’t this person’s real name?</p><p>Say even that Dunham had forgotten that there really was a prominent Oberlin conservative named Barry back then. Surely it was obviously possible that, if one makes up a first name, someone real, who matches the other easily Google-findable characteristics, might have that name. Given the gravity of the charge, how can one possibly rely on a statement on the copyright page as the only hint that this particular item in the memoir is inaccurate?</p></blockquote><p>The most amusing part is the addendum: “Folks, I think Lena Dunham acted badly here — but some commenters’ view<br> that she’s ugly or too fat or what have you seems to me to have little<br> to do with the merits of the matter.”</br></br></p><p>Actually, it has almost everything to do with them. Let’s face it, if the Dunham Horror wasn’t a creature being aggressively pushed on America by the media because she is fat, ugly, Jewish, and of the ideological Left, no one would have paid any attention to her rape fantasies in the first place. She is what a small, but influential group within the media wanted Americans to take for “the voice of her generation”.</p><p>And America collectively said: “yeah, not so much.”</p></div>",
  "content_text": "All right, granted, it’s Volokh and not some scion of the Post’s left-wing elite, but it’s still remarkable to see an institution of the liberal Left finally turn on the self-admitted child molester, Lena Dunham, due to her publisher belatedly\nadmitting that her parts of her “memoir” are fictitious\n:\nAppalling. The book wasn’t a novel; it was a memoir, offered to readers as such. The copyright page, which I suspect few people read, does say that “Some names and identifying details have been changed,” but it certainly doesn’t tell people which ones.\nIndeed, early in the book, when she mentions a boyfriend of hers and labels him Jonah, she adds a footnote: “Name changed to protect the truly innocent.” Reasonable readers, it seems to me, reading the rest of the memoir, would assume that “Barry” — whose name wasn’t accompanied with any such footnote — was actually named Barry. Even if not all readers would so conclude, many would, and quite understandably so.\nHow could Dunham and Random House do this? How could an author and a publisher — again, of a self-described memoir, not a work of fiction — describe a supposed rape by a person, give a (relatively rare) first name and enough identifying details that readers could easily track the person down, and not even mention that “Barry” wasn’t this person’s real name?\nSay even that Dunham had forgotten that there really was a prominent Oberlin conservative named Barry back then. Surely it was obviously possible that, if one makes up a first name, someone real, who matches the other easily Google-findable characteristics, might have that name. Given the gravity of the charge, how can one possibly rely on a statement on the copyright page as the only hint that this particular item in the memoir is inaccurate?\nThe most amusing part is the addendum: “Folks, I think Lena Dunham acted badly here — but some commenters’ view\nthat she’s ugly or too fat or what have you seems to me to have little\nto do with the merits of the matter.”\nActually, it has almost everything to do with them. Let’s face it, if the Dunham Horror wasn’t a creature being aggressively pushed on America by the media because she is fat, ugly, Jewish, and of the ideological Left, no one would have paid any attention to her rape fantasies in the first place. She is what a small, but influential group within the media wanted Americans to take for “the voice of her generation”.\nAnd America collectively said: “yeah, not so much.”",
  "tags": [
    "freakshow",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-09T13:30:00+00:00"
}