{
  "url": "https://voxday.net/2014/12/15/the-red-horse-rides/",
  "scraped_at": "2025-12-16T12:38:21.612432",
  "title": "The RED HORSE rides",
  "date_display": "December 15, 2014",
  "date_iso": "2014-12-15T08:00:00+00:00",
  "date_from_url": "2014-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/12/RH1_900.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/12/RH1_900.jpg\" width=\"247\"/></a></div><p>I’m not sure there are the superlatives to describe how pleased I am to be able to introduce to you Castalia’s new anthology of military science fiction and military fact, <i><b><a href=\"http://www.castaliahouse.com/downloads/riding-the-red-horse/\">RIDING THE RED HORSE</a></b></i>. Tom and I have been working on this all year, and between us, we somehow managed to recruit a very strong roster of contributors on both the fiction and non-fiction sides. It’s now available from <a href=\"http://www.amazon.com/Riding-Red-Horse-Tom-Kratman-ebook/dp/B00QZD9H5K\">Amazon</a> as well as from <a href=\"http://www.castaliahouse.com/downloads/riding-the-red-horse/\">Castalia House</a>.</p><p>As the editing was a collaborative effort, so too was the cover. JartStar was unhappy with his initial attempt, but he liked the concept, so he brought in Jeremiah, who did the covers for <i>The Altar of Hate</i> and <i>The Book of Feasts &amp; Seasons</i>, and together they managed to bring it to life. Historically keen eyes will probably recognize the cover to which it is a thematic homage of sorts.  But as much as I enjoy working on covers, let’s face it, it’s really what is inside the book that matters. The contributors, and the pieces they contributed, are as follows, in the order they appear in the book. Many, if not most, of these names will be readily recognizable.</p><ul><li>Eric S. Raymond: “Sucker Punch” and “Battlefield Lasers”</li><li>William S. Lind: “Understanding 4th Generation Warfare”</li><li>Chris Kennedy: “Thieves in the Night”</li><li>Vox Day: “A Reliable Source”</li><li>James F. Dunnigan: “Murphy’s Law” and “Red Waves in the South China Sea”</li><li>Jerry Pournelle: “His Truth Goes Marching On” and “Simulating the Art of War”</li><li>Ken Burnside: “The Hot Equations: Thermodynamics and Military SF”</li><li>Christopher G. Nuttall: “A Piece of Cake”</li><li>Rolf Nelson: “Shakedown Cruise”</li><li>Steve Rzasa and Vox Day: “Tell it to the Dead”</li><li>Harry Kitchener: “The Limits of Intelligence”</li><li>Giuseppe Filotto: “Red Space”</li><li>John F. Carr and Wolfgang Diehr: “Galzar’s Hall”</li><li>Thomas Mays: “Within This Horizon”</li><li>Benjamin Chea: “War Crimes”</li><li>James Perry: “Make the Tigers Fight”</li><li>Brad Torgersen: “The General’s Guard”</li><li>Tedd Roberts: “They Also Serve”</li><li>Tom Kratman: “Learning to Ride the Red Horse: The Principles of War”</li><li>Steve Rzasa: Turncoat</li></ul><p>I should probably go ahead and point out that both “Tell it to the Dead” and “Turncoat” are set in the Quantum Mortis universe. And despite being one of the editors, as a longtime fan of military science fiction and a lifelong student of the art of war, I won’t hesitate to tell you that this collection is one that you simply will not want to miss if you are even remotely interested in either. I hope you will find RIDING THE RED HORSE to be a worthy successor to the excellent anthology series that inspired it, THERE WILL BE WAR.</p><p>The initial reviews are in. Some selections:</p><ul><li>RIDING THE RED HORSE features both military sci-fi short stories and nonfiction articles regarding the future or history of warfare. For those readers that don’t recognize it; the title is a reference to the second horseman of the apocalypse from the Bible’s Book of Revelation; the Horseman of War who rides a red horse. Some of the stories, “Sucker Punch”, “Thieves in the Night” and “A Reliable Source”, “Red Space”’ for example, are more Tom Clancy-ish techno-thrillers than outright military sci-fi. Others are more traditional military sci-fi, like “A Piece of Cake”, “Shakedown Cruise” and “Turncoat”, to name just three stories that feature high-tech space battles in the middle distant future. Other stories are more Earthbound, but just as high tech, or discuss war against highly modified “trans-humans, to name just two examples. The story quality is uniformly very good; two outstanding examples are “Shakedown Cruise” and “Turncoat”…. RIDING THE RED HORSE is a well done military sci-fi and military studies anthology, and frankly at $4.99 it is a helluva good value for your entertainment (and education) dollar.</li><li>Easy 5 stars on this one. An impressive collection of fun and<br> well-written military fiction interposed with essays by military<br> thinkers/historians. I was both entertained and informed throughout…. The essays are not navel-gazing; when their writers challenge<br> conventional thinking on various topics, they do so with the voice of<br> insight and experience. Their credentials are helpfully explained by an<br> editor’s introduction at the beginning of each entry, for both the<br> essays and the fiction. That was helpful both to establish the authority<br> of the essay writers to speak on their subjects, and also in helping me<br> to become aware of some newer authors I hadn’t heard of but whose work I<br> enjoyed in this collection. The fiction entries are mostly<br> military sci-fi to varying degrees of “hardness,” with a couple<br> Roman/Medieval fantasy type stories thrown in as well, but all deal with<br> questions of tactics, strategy, and the human element in combat…. Highly recommended.</br></br></br></br></br></br></br></br></br></br></br></br></li><li>This is a first-rate collection, but more for the non-fiction than the<br> fiction. The non-fiction essays by practitioners of various kinds can<br> range from enlightening to quite frightening. ESR and Pournelle are<br> excellent technically and Kitchener on the limits of intelligence was a<br> masterly summary. For the non-fiction alone, I would recommend the book<br> as a buy. However little you may agree with them, they will provoke real<br> thought in you. On the fiction side, the stories are consistently serviceable, and occasionally exceptional.</br></br></br></br></br></br></li></ul><p>RIDING THE RED HORSE is 443 pages and retails for $4.99. It is available in DRM-free EPUB and MOBI for Kindle format <a href=\"http://www.castaliahouse.com/downloads/riding-the-red-horse/\">from the Castalia Store</a> and <a href=\"http://www.amazon.com/Riding-Red-Horse-Tom-Kratman-ebook/dp/B00QZD9H5K\">from Amazon</a>.</p></div>",
  "content_text": "I’m not sure there are the superlatives to describe how pleased I am to be able to introduce to you Castalia’s new anthology of military science fiction and military fact,\nRIDING THE RED HORSE\n. Tom and I have been working on this all year, and between us, we somehow managed to recruit a very strong roster of contributors on both the fiction and non-fiction sides. It’s now available from\nAmazon\nas well as from\nCastalia House\n.\nAs the editing was a collaborative effort, so too was the cover. JartStar was unhappy with his initial attempt, but he liked the concept, so he brought in Jeremiah, who did the covers for\nThe Altar of Hate\nand\nThe Book of Feasts & Seasons\n, and together they managed to bring it to life. Historically keen eyes will probably recognize the cover to which it is a thematic homage of sorts.  But as much as I enjoy working on covers, let’s face it, it’s really what is inside the book that matters. The contributors, and the pieces they contributed, are as follows, in the order they appear in the book. Many, if not most, of these names will be readily recognizable.\nEric S. Raymond: “Sucker Punch” and “Battlefield Lasers”\nWilliam S. Lind: “Understanding 4th Generation Warfare”\nChris Kennedy: “Thieves in the Night”\nVox Day: “A Reliable Source”\nJames F. Dunnigan: “Murphy’s Law” and “Red Waves in the South China Sea”\nJerry Pournelle: “His Truth Goes Marching On” and “Simulating the Art of War”\nKen Burnside: “The Hot Equations: Thermodynamics and Military SF”\nChristopher G. Nuttall: “A Piece of Cake”\nRolf Nelson: “Shakedown Cruise”\nSteve Rzasa and Vox Day: “Tell it to the Dead”\nHarry Kitchener: “The Limits of Intelligence”\nGiuseppe Filotto: “Red Space”\nJohn F. Carr and Wolfgang Diehr: “Galzar’s Hall”\nThomas Mays: “Within This Horizon”\nBenjamin Chea: “War Crimes”\nJames Perry: “Make the Tigers Fight”\nBrad Torgersen: “The General’s Guard”\nTedd Roberts: “They Also Serve”\nTom Kratman: “Learning to Ride the Red Horse: The Principles of War”\nSteve Rzasa: Turncoat\nI should probably go ahead and point out that both “Tell it to the Dead” and “Turncoat” are set in the Quantum Mortis universe. And despite being one of the editors, as a longtime fan of military science fiction and a lifelong student of the art of war, I won’t hesitate to tell you that this collection is one that you simply will not want to miss if you are even remotely interested in either. I hope you will find RIDING THE RED HORSE to be a worthy successor to the excellent anthology series that inspired it, THERE WILL BE WAR.\nThe initial reviews are in. Some selections:\nRIDING THE RED HORSE features both military sci-fi short stories and nonfiction articles regarding the future or history of warfare. For those readers that don’t recognize it; the title is a reference to the second horseman of the apocalypse from the Bible’s Book of Revelation; the Horseman of War who rides a red horse. Some of the stories, “Sucker Punch”, “Thieves in the Night” and “A Reliable Source”, “Red Space”’ for example, are more Tom Clancy-ish techno-thrillers than outright military sci-fi. Others are more traditional military sci-fi, like “A Piece of Cake”, “Shakedown Cruise” and “Turncoat”, to name just three stories that feature high-tech space battles in the middle distant future. Other stories are more Earthbound, but just as high tech, or discuss war against highly modified “trans-humans, to name just two examples. The story quality is uniformly very good; two outstanding examples are “Shakedown Cruise” and “Turncoat”…. RIDING THE RED HORSE is a well done military sci-fi and military studies anthology, and frankly at $4.99 it is a helluva good value for your entertainment (and education) dollar.\nEasy 5 stars on this one. An impressive collection of fun and\nwell-written military fiction interposed with essays by military\nthinkers/historians. I was both entertained and informed throughout…. The essays are not navel-gazing; when their writers challenge\nconventional thinking on various topics, they do so with the voice of\ninsight and experience. Their credentials are helpfully explained by an\neditor’s introduction at the beginning of each entry, for both the\nessays and the fiction. That was helpful both to establish the authority\nof the essay writers to speak on their subjects, and also in helping me\nto become aware of some newer authors I hadn’t heard of but whose work I\nenjoyed in this collection. The fiction entries are mostly\nmilitary sci-fi to varying degrees of “hardness,” with a couple\nRoman/Medieval fantasy type stories thrown in as well, but all deal with\nquestions of tactics, strategy, and the human element in combat…. Highly recommended.\nThis is a first-rate collection, but more for the non-fiction than the\nfiction. The non-fiction essays by practitioners of various kinds can\nrange from enlightening to quite frightening. ESR and Pournelle are\nexcellent technically and Kitchener on the limits of intelligence was a\nmasterly summary. For the non-fiction alone, I would recommend the book\nas a buy. However little you may agree with them, they will provoke real\nthought in you. On the fiction side, the stories are consistently serviceable, and occasionally exceptional.\nRIDING THE RED HORSE is 443 pages and retails for $4.99. It is available in DRM-free EPUB and MOBI for Kindle format\nfrom the Castalia Store\nand\nfrom Amazon\n.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-15T08:00:00+00:00"
}