{
  "url": "https://voxday.net/2014/12/06/the-top-gaming-blogs/",
  "scraped_at": "2025-12-16T12:37:23.751740",
  "title": "The Top Gaming Blogs",
  "date_display": "December 6, 2014",
  "date_iso": "2014-12-06T11:27:00+00:00",
  "date_from_url": "2014-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As one of their Game and Book experts, one of the things Recommend has asked me to do is to identify and vett various other experts, particularly in fields I am qualified to do so. One of the first experts I recruited was the indefatigable Jeffro Johnson of <a href=\"http://jeffro.wordpress.com/\">Jeffro’s Space Gaming Blog</a>, who is also one of the two star bloggers at Castalia House, because there are very, very few people who know as much about role-playing games as he does.</p><p>Jeffro immediately grasped the utility of the Recommend system, so much so that I have already had to urge him to slow down and pace himself. But among the score of recos he has already posted, he has created an interesting list entitled <a href=\"http://re.co/#/list/2A536663/1811FE34\">The Top Gaming Blogs of 2014</a>, which is well worth reading for anyone with an interest in games. Lewis Pulsipher is on there, of course, but there are a number of other sites with which I was previously unfamiliar.</p><p>The other new Recommend expert is less known for his excellent game design than for the fact that he is Archon of <a href=\"http://www.escapistmagazine.com/\">The Escapist</a>, but regardless, he qualifies as a Game Expert twice over. He’s got his first reco up and it’s a good one on the classic <a href=\"http://re.co/r/ECE71BAC\">X-Com: UFO Defense</a>.</p><p>If you’re not on Recommend yet, or if you’re on it but haven’t really started using it yet, I’d encourage you to give it a go. They haven’t even officially “come to America” yet; but have already achieved pretty solid penetration in their native France. I don’t know if it is going to grow into something Twitter-big once they enter the US next year, but it is going to be significant. They’ve now got the five-rating system in place, which was a needed improvement, and they’ll have the Android app out in the near future. And, in due time, a proper game-style Achievements and Leveling system.</p><p>They’re also working on the expansion of the categories; there will be gun categories, among others, and I will be looking for experts in a variety of new categories soon. But we’re only looking for serious and proven expertise, not merely serious interest. For example, Jeffro, Archon, and I are all able to rapidly post recos because we have large quantities of our own previous writings on the subject from which we can draw. But that’s merely an indicator, it’s not an absolute requirement. In any case, if you think you’ve got that kind of expertise in something, then by all means, make your case in the comments here.</p><p>Jeffro demonstrates his depth of knowledge in this post, in which he wonders why so many of today’s gamers and game designers are not merely ignorant, but <a href=\"http://jeffro.wordpress.com/2014/11/11/random-thoughts-outside-the-rules-structure-an-eclectic-fiction-diet-watershed-moments-lenin-artiness-and-chronicles-of-riddick/\">don’t even know they’re ignorant</a>:</p><blockquote class=\"tr_bq\"><p> Why is it that Gygax had a diet of fiction that spanned more than half a century, but the designers that followed him and the younger generation of gamers that played his stuff did not for the most part? What kinds of things do we fail to see simply because we’ve never bothered to survey the past…? And what the heck happened during the seventies to turn everything upside down? Something happened. The fact of it doesn’t require a conspiracy theory to explain it, but it does make me wonder about what all’s gone on since.</p><p>Remember: people that haven’t read from the Appendix N list tend to assume that Gary Gygax was a weirdo for using the term “Fighting-Men” instead of something like “Warrior.” They will even go so far as to say that the reasons for his word choice there are unknowable. It’s a small thing, sure… but it’s just the tip of the iceberg. These people are not only ignorant, but they don’t even know they are ignorant. They are simply not equipped to make an intelligent critique of classic D&amp;D, much less assess Gygax’s contribution to gaming.</p><p>That “Wisconsin Shoe Salesmen” precipitated a watershed moment in gaming history. His influence is not confined to tabletop games, but spills over into computer gaming and fantasy in general. While many tropes of classic D&amp;D have by now become ubiquitous, the literature that inspired them has since dropped into obscurity. This is interesting and bears further investigation. </p></blockquote></div>",
  "content_text": "As one of their Game and Book experts, one of the things Recommend has asked me to do is to identify and vett various other experts, particularly in fields I am qualified to do so. One of the first experts I recruited was the indefatigable Jeffro Johnson of\nJeffro’s Space Gaming Blog\n, who is also one of the two star bloggers at Castalia House, because there are very, very few people who know as much about role-playing games as he does.\nJeffro immediately grasped the utility of the Recommend system, so much so that I have already had to urge him to slow down and pace himself. But among the score of recos he has already posted, he has created an interesting list entitled\nThe Top Gaming Blogs of 2014\n, which is well worth reading for anyone with an interest in games. Lewis Pulsipher is on there, of course, but there are a number of other sites with which I was previously unfamiliar.\nThe other new Recommend expert is less known for his excellent game design than for the fact that he is Archon of\nThe Escapist\n, but regardless, he qualifies as a Game Expert twice over. He’s got his first reco up and it’s a good one on the classic\nX-Com: UFO Defense\n.\nIf you’re not on Recommend yet, or if you’re on it but haven’t really started using it yet, I’d encourage you to give it a go. They haven’t even officially “come to America” yet; but have already achieved pretty solid penetration in their native France. I don’t know if it is going to grow into something Twitter-big once they enter the US next year, but it is going to be significant. They’ve now got the five-rating system in place, which was a needed improvement, and they’ll have the Android app out in the near future. And, in due time, a proper game-style Achievements and Leveling system.\nThey’re also working on the expansion of the categories; there will be gun categories, among others, and I will be looking for experts in a variety of new categories soon. But we’re only looking for serious and proven expertise, not merely serious interest. For example, Jeffro, Archon, and I are all able to rapidly post recos because we have large quantities of our own previous writings on the subject from which we can draw. But that’s merely an indicator, it’s not an absolute requirement. In any case, if you think you’ve got that kind of expertise in something, then by all means, make your case in the comments here.\nJeffro demonstrates his depth of knowledge in this post, in which he wonders why so many of today’s gamers and game designers are not merely ignorant, but\ndon’t even know they’re ignorant\n:\nWhy is it that Gygax had a diet of fiction that spanned more than half a century, but the designers that followed him and the younger generation of gamers that played his stuff did not for the most part? What kinds of things do we fail to see simply because we’ve never bothered to survey the past…? And what the heck happened during the seventies to turn everything upside down? Something happened. The fact of it doesn’t require a conspiracy theory to explain it, but it does make me wonder about what all’s gone on since.\nRemember: people that haven’t read from the Appendix N list tend to assume that Gary Gygax was a weirdo for using the term “Fighting-Men” instead of something like “Warrior.” They will even go so far as to say that the reasons for his word choice there are unknowable. It’s a small thing, sure… but it’s just the tip of the iceberg. These people are not only ignorant, but they don’t even know they are ignorant. They are simply not equipped to make an intelligent critique of classic D&D, much less assess Gygax’s contribution to gaming.\nThat “Wisconsin Shoe Salesmen” precipitated a watershed moment in gaming history. His influence is not confined to tabletop games, but spills over into computer gaming and fantasy in general. While many tropes of classic D&D have by now become ubiquitous, the literature that inspired them has since dropped into obscurity. This is interesting and bears further investigation.",
  "tags": [
    "games",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-06T11:27:00+00:00"
}