{
  "url": "https://voxday.net/2014/12/02/the-cultural-collapse-progression/",
  "scraped_at": "2025-12-16T12:37:00.550540",
  "title": "The Cultural Collapse Progression",
  "date_display": "December 2, 2014",
  "date_iso": "2014-12-02T15:30:00+00:00",
  "date_from_url": "2014-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roosh has written a truly insightful article concerning the way in which <a href=\"http://www.returnofkings.com/49185/cultural-collapse-theory-the-7-steps-that-lead-to-a-complete-culture-decline?utm_source=dlvr.it&amp;utm_medium=twitter\">a cultural collapse proceeds</a>:</p><blockquote class=\"tr_bq\"><p> The Cultural Collapse Progression</p><p>1. Removal of religious narrative from people’s lives, replaced by a treadmill of scientific and technological “progress.”</p><p>2. Elimination of traditional sex roles through feminism, gender equality, political correctness, cultural Marxism, and socialism.</p><p>3. Delay or abstainment of family formation by women to pursue careerist lifestyles while men wait in confused limbo.</p><p>4. Decreasing birth rate among native population.</p><p>5. Government enactment of open immigration policies to prevent economic collapse.</p><p>6. Immigrant refusal to fully acclimate, forcing host culture to adopt external rituals and beliefs while being out-reproduced.</p><p>7. Natives becoming marginalized in their own country.</p></blockquote><p>It’s particularly interesting how he traces it back to the removal of the religious narrative, given that he is not, to the best of my knowledge, a religious man.</p><p>He writes: <i>“Cultural collapse is the decline, decay, or disappearance of a native<br> population’s rituals, habits, interpersonal communication,<br> relationships, art, and language. It coincides with a relative decline<br> of population compared to outside groups. National identity and group<br> identification will be lost while revisionist history will be applied to<br> demonize or find fault with the native population. Cultural collapse is<br> not to be confused with economic or state collapse. A nation that<br> suffers from a cultural collapse can still be economically productive<br> and have a working government.”</br></br></br></br></br></br></br></br></i></p><p>However, I would note that conomic and state collapse are very likely to follow as a consequence of the cultural collapse, particularly if the marginalized natives were historically more economically productive than their replacements.</p></div>",
  "content_text": "Roosh has written a truly insightful article concerning the way in which\na cultural collapse proceeds\n:\nThe Cultural Collapse Progression\n1. Removal of religious narrative from people’s lives, replaced by a treadmill of scientific and technological “progress.”\n2. Elimination of traditional sex roles through feminism, gender equality, political correctness, cultural Marxism, and socialism.\n3. Delay or abstainment of family formation by women to pursue careerist lifestyles while men wait in confused limbo.\n4. Decreasing birth rate among native population.\n5. Government enactment of open immigration policies to prevent economic collapse.\n6. Immigrant refusal to fully acclimate, forcing host culture to adopt external rituals and beliefs while being out-reproduced.\n7. Natives becoming marginalized in their own country.\nIt’s particularly interesting how he traces it back to the removal of the religious narrative, given that he is not, to the best of my knowledge, a religious man.\nHe writes:\n“Cultural collapse is the decline, decay, or disappearance of a native\npopulation’s rituals, habits, interpersonal communication,\nrelationships, art, and language. It coincides with a relative decline\nof population compared to outside groups. National identity and group\nidentification will be lost while revisionist history will be applied to\ndemonize or find fault with the native population. Cultural collapse is\nnot to be confused with economic or state collapse. A nation that\nsuffers from a cultural collapse can still be economically productive\nand have a working government.”\nHowever, I would note that conomic and state collapse are very likely to follow as a consequence of the cultural collapse, particularly if the marginalized natives were historically more economically productive than their replacements.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-02T15:30:00+00:00"
}