{
  "url": "https://voxday.net/2014/12/31/the-blog-star/",
  "scraped_at": "2025-12-16T12:40:08.440800",
  "title": "The blog star",
  "date_display": "December 31, 2014",
  "date_iso": "2014-12-31T17:00:00+00:00",
  "date_from_url": "2014-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no slight to Daniel, Scooter, Mascaro, or me to say that Jeffro, of the Space Gaming Blog, has been the star of the Castalia House blog this year. He makes everyone up their game by starting each week off with an intriguing, in-depth post, and gives our four new bloggers a high level of excellence to aim for. And fortunately for everyone, <a href=\"http://jeffro.wordpress.com/2014/12/29/my-games-writing-at-castalia-house/\">he appears to enjoy blogging there</a>:</p><blockquote class=\"tr_bq\"><p> I am not shy about pointing out how happy I am with how this is shaping up. I cover the full range gaming topics: vintage stuff, current releases, role-playing games, wargames, everything! I write in such a way that you can get something out of a post even if you don’t buy or play the game in question. I put things into the wider context of gaming history and touch on the literary antecedents of the games we play. And yeah, I occasionally get esoteric, but I try to stay readable and comprehensible to people that aren’t gamers. No matter what, though, I never stray from the voice of someone that actually knows how to articulate how these things work in actual play… and that just freakin’ loves to play the heck out of these things.</p><p>I have complained about how games are covered in magazine articles and so forth in the past. I am just so rarely satisfied with how “journalists” and commentators portray games and gaming in general. Voicing that sort of concern almost invariably summons a smarty pants type that sneers back, “oh, you’re just complaining; the best answer to this sort of thing is to go out show us the right way to do it.” Well listen here, bucko… I’ve done it now.</p></blockquote><p>If you’ve enjoyed Jeffro’s exploration of Chapter N this year, don’t be shy about going to his blog and letting him know. What I particularly enjoy about his posts is the way he dives deeply into the game mechanical aspects as well as the experience; he represents the perfect blend of SF/F literature and gaming that is of particular interest to a game designer who occasionally dabbles in fiction.</p></div>",
  "content_text": "It’s no slight to Daniel, Scooter, Mascaro, or me to say that Jeffro, of the Space Gaming Blog, has been the star of the Castalia House blog this year. He makes everyone up their game by starting each week off with an intriguing, in-depth post, and gives our four new bloggers a high level of excellence to aim for. And fortunately for everyone,\nhe appears to enjoy blogging there\n:\nI am not shy about pointing out how happy I am with how this is shaping up. I cover the full range gaming topics: vintage stuff, current releases, role-playing games, wargames, everything! I write in such a way that you can get something out of a post even if you don’t buy or play the game in question. I put things into the wider context of gaming history and touch on the literary antecedents of the games we play. And yeah, I occasionally get esoteric, but I try to stay readable and comprehensible to people that aren’t gamers. No matter what, though, I never stray from the voice of someone that actually knows how to articulate how these things work in actual play… and that just freakin’ loves to play the heck out of these things.\nI have complained about how games are covered in magazine articles and so forth in the past. I am just so rarely satisfied with how “journalists” and commentators portray games and gaming in general. Voicing that sort of concern almost invariably summons a smarty pants type that sneers back, “oh, you’re just complaining; the best answer to this sort of thing is to go out show us the right way to do it.” Well listen here, bucko… I’ve done it now.\nIf you’ve enjoyed Jeffro’s exploration of Chapter N this year, don’t be shy about going to his blog and letting him know. What I particularly enjoy about his posts is the way he dives deeply into the game mechanical aspects as well as the experience; he represents the perfect blend of SF/F literature and gaming that is of particular interest to a game designer who occasionally dabbles in fiction.",
  "tags": [
    "Castalia House",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-31T17:00:00+00:00"
}