{
  "url": "https://voxday.net/2014/12/28/the-internet-is-forever/",
  "scraped_at": "2025-12-16T12:39:43.445381",
  "title": "The Internet is forever",
  "date_display": "December 28, 2014",
  "date_iso": "2014-12-28T00:53:00+00:00",
  "date_from_url": "2014-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, let me say that I absolutely welcome any judgment between John Scalzi and me concerning who is more reliably truthful, in a court of law or anywhere else. I believe it will be considerably easier for me to prove I am not a “racist, sexist, homophobic dipshit”, or a “troll”, than it will be for John Scalzi to prove he is not a rapist or a liar, especially in light of his known associations with the likes of Ed Kramer, Samuel Delaney, Jim Hines, and Jian Gomeshi in addition to his known propensity to make false and self-serving claims.</p><blockquote class=\"tr_bq\"><p> Got a concerned email this morning from someone who saw online an assertion that I was a “self-confessed rapist.”…</p><p>I don’t intend to do anything about Beale continuing to assert I have<br> confessed to being a rapist. I could bring a libel suit against him, on<br> the idea that accusing me of confessing to rape is defamation, it’s an<br> untrue assertion, and Beale knows it’s untrue and continues to assert it<br> anyway, for malicious purposes (the latter being important as I am<br> likely to be considered a public individual at this point). However, I<br> would also need to show that Beale’s actions have caused me harm,<br> economically and/or emotionally. Aside from annoyance, which does not<br> rise to actionable levels, I’m not seeing the harm to me personally.<br> Essentially, Beale escapes punishment here because he’s failed to be<br> important enough to be harmful.</br></br></br></br></br></br></br></br></br></br></p><p>I assume that for the foreseeable future, Beale will continue to lie<br> about me confessing to be a rapist, for his own purposes. Again,<br> annoying. On the other hand, useful. If Beale is perfectly happy to lie<br> so baldly and obviously about this particular thing, perhaps that should<br> be considered the baseline for the truth value of any other assertion<br> that he might choose to make, particularly about people. Likewise,<br> consider what sort of person you’d have to be to intentionally lie about<br> someone confessing to rape, and to continue to offer up that lie for<br> two years straight, despite knowing otherwise. Consider whether this<br> person is worth your time at all, or your belief. </br></br></br></br></br></br></br></br></br></p></blockquote><p>Of course he’s not going to do anything at all. The very last thing John Scalzi wants is to place himself in the position of having a judge deciding who defamed and damaged whom here. As for his latest claims, let’s juxtapose two public statements by Mr. Scalzi, separated by two years and two months.</p><ol><li>“No, I have not raped or sexually assaulted anyone. No, I have not<i> </i>admitted to raping or sexually assaulting anyone.” – John Scalzi, 27 December, 2014</li><li>“I’m a rapist. I’m one of those men who likes to force myself on women<br> without their consent or desire and then batter them sexually.” – John Scalzi, 25 October 2012</br></li></ol><p>Now, tell me, which statement do I know is untrue? Which statement do <i>you </i>know is untrue? As it happens, I don’t know <i>anything at all</i> about Mr. Scalzi’s sexual practices or sexual history, except for what he has stated in public. Do you? Did you also know it wasn’t true that Jian Gomeshi sexually assaults women? Or that the late Marion Zimmer Bradley assaulted children? For crying out loud, Scalzi is observably lying <i>again</i> when he falsely states: “Beale knows it’s untrue”.</p><p>I repeat: I don’t know <i>anything at all</i> about Mr. Scalzi’s sexual practices or sexual history, except for what he has stated in public. As to which of those contradictory statements are true, I have no information at all.</p><p>The demonstrable facts are simple. John Scalzi has publicly admitted to being a rapist. He has openly admitted to sexually battering women. Whether he in fact committed the acts he admits to is irrelevant. Retroactively claiming his statements were “satire” doesn’t change what he wrote or what he admitted to doing, and it is absolutely and utterly ridiculous to claim that I am somehow in possession of his entire sexual history.</p><p>In this vein, it is important to recall that John Scalzi is known to be deceitful and prone to repeatedly telling easily disprovable falsehoods:</p><blockquote class=\"tr_bq\"><p> John Scalzi @scalzi <a href=\"https://twitter.com/scalzi/status/275967789947318272\">6:20 AM – 4 Dec 12</a><br> Hey, authors of non-traditionally published books! Promote your book to my 50K daily blog readers TODAY</br></p><p>John Scalzi ‏@scalzi <a href=\"https://twitter.com/scalzi/status/366326368717385730\">3:33 PM – 10 Aug 13</a><br> @gregpak I think if people like the content they will keep coming in regardless. I mean, my site gets 50K readers a day</br></p><p>“Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.”<br> – Lightspeed Magazine, <a href=\"http://www.lightspeedmagazine.com/nonfiction/interview-john-scalzi/\">September 2010 interview</a></br></p></blockquote><p>All three of those statements are false. I happen to be in possession of John Scalzi’s traffic records, and the fact is that at the time he made that last claim, Whatever averaged 12,860 pageviews per day, five times LESS than the 64,516 daily pageviews he was claiming. Nor did he have “over 45,000 unique visitors daily”.</p><p>Keep in mind too that Scalzi has repeatedly made false claims about me, and that he is actively and professionally associated with those who have publicly made false claims that I am “a self-described misogynist, racist, anti-Semite, and a few other flavors of asshole”, a “white supremacist”, and who have gone so far as to deny the scientific evidence of my Native American ancestry.</p><p>John Scalzi is a proven liar. I am, on the other hand, known to be rigidly truthful, less for any personal qualities than for the obvious reason that as a nationally syndicated political columnist, I have long been accustomed to having my every word closely scrutinized by political opponents seeking to disqualify me. So, by all means, please judge between us concerning who is truthful and who is not. Notice too who permits comments on these posts and who does not.</p><p>Perhaps those concerned individuals should ask John Scalzi why it is that I continue to expose his lies and hoist him on his own petard. They might wish to ask him if he refused to pay his dues to SFWA and threatened to leave if I was not purged from the organization. They could ask him if he had any discussions with Tor editor Patrick Nielsen Hayden about it, and if he knew that Mr. Nielsen Hayden was also refusing to pay his dues until I was purged. And finally, they should also ask precisely who was attacking whom, and why, in 2005.</p></div>",
  "content_text": "First, let me say that I absolutely welcome any judgment between John Scalzi and me concerning who is more reliably truthful, in a court of law or anywhere else. I believe it will be considerably easier for me to prove I am not a “racist, sexist, homophobic dipshit”, or a “troll”, than it will be for John Scalzi to prove he is not a rapist or a liar, especially in light of his known associations with the likes of Ed Kramer, Samuel Delaney, Jim Hines, and Jian Gomeshi in addition to his known propensity to make false and self-serving claims.\nGot a concerned email this morning from someone who saw online an assertion that I was a “self-confessed rapist.”…\nI don’t intend to do anything about Beale continuing to assert I have\nconfessed to being a rapist. I could bring a libel suit against him, on\nthe idea that accusing me of confessing to rape is defamation, it’s an\nuntrue assertion, and Beale knows it’s untrue and continues to assert it\nanyway, for malicious purposes (the latter being important as I am\nlikely to be considered a public individual at this point). However, I\nwould also need to show that Beale’s actions have caused me harm,\neconomically and/or emotionally. Aside from annoyance, which does not\nrise to actionable levels, I’m not seeing the harm to me personally.\nEssentially, Beale escapes punishment here because he’s failed to be\nimportant enough to be harmful.\nI assume that for the foreseeable future, Beale will continue to lie\nabout me confessing to be a rapist, for his own purposes. Again,\nannoying. On the other hand, useful. If Beale is perfectly happy to lie\nso baldly and obviously about this particular thing, perhaps that should\nbe considered the baseline for the truth value of any other assertion\nthat he might choose to make, particularly about people. Likewise,\nconsider what sort of person you’d have to be to intentionally lie about\nsomeone confessing to rape, and to continue to offer up that lie for\ntwo years straight, despite knowing otherwise. Consider whether this\nperson is worth your time at all, or your belief.\nOf course he’s not going to do anything at all. The very last thing John Scalzi wants is to place himself in the position of having a judge deciding who defamed and damaged whom here. As for his latest claims, let’s juxtapose two public statements by Mr. Scalzi, separated by two years and two months.\n“No, I have not raped or sexually assaulted anyone. No, I have not\nadmitted to raping or sexually assaulting anyone.” – John Scalzi, 27 December, 2014\n“I’m a rapist. I’m one of those men who likes to force myself on women\nwithout their consent or desire and then batter them sexually.” – John Scalzi, 25 October 2012\nNow, tell me, which statement do I know is untrue? Which statement do\nyou\nknow is untrue? As it happens, I don’t know\nanything at all\nabout Mr. Scalzi’s sexual practices or sexual history, except for what he has stated in public. Do you? Did you also know it wasn’t true that Jian Gomeshi sexually assaults women? Or that the late Marion Zimmer Bradley assaulted children? For crying out loud, Scalzi is observably lying\nagain\nwhen he falsely states: “Beale knows it’s untrue”.\nI repeat: I don’t know\nanything at all\nabout Mr. Scalzi’s sexual practices or sexual history, except for what he has stated in public. As to which of those contradictory statements are true, I have no information at all.\nThe demonstrable facts are simple. John Scalzi has publicly admitted to being a rapist. He has openly admitted to sexually battering women. Whether he in fact committed the acts he admits to is irrelevant. Retroactively claiming his statements were “satire” doesn’t change what he wrote or what he admitted to doing, and it is absolutely and utterly ridiculous to claim that I am somehow in possession of his entire sexual history.\nIn this vein, it is important to recall that John Scalzi is known to be deceitful and prone to repeatedly telling easily disprovable falsehoods:\nJohn Scalzi @scalzi\n6:20 AM – 4 Dec 12\nHey, authors of non-traditionally published books! Promote your book to my 50K daily blog readers TODAY\nJohn Scalzi ‏@scalzi\n3:33 PM – 10 Aug 13\n@gregpak I think if people like the content they will keep coming in regardless. I mean, my site gets 50K readers a day\n“Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.”\n– Lightspeed Magazine,\nSeptember 2010 interview\nAll three of those statements are false. I happen to be in possession of John Scalzi’s traffic records, and the fact is that at the time he made that last claim, Whatever averaged 12,860 pageviews per day, five times LESS than the 64,516 daily pageviews he was claiming. Nor did he have “over 45,000 unique visitors daily”.\nKeep in mind too that Scalzi has repeatedly made false claims about me, and that he is actively and professionally associated with those who have publicly made false claims that I am “a self-described misogynist, racist, anti-Semite, and a few other flavors of asshole”, a “white supremacist”, and who have gone so far as to deny the scientific evidence of my Native American ancestry.\nJohn Scalzi is a proven liar. I am, on the other hand, known to be rigidly truthful, less for any personal qualities than for the obvious reason that as a nationally syndicated political columnist, I have long been accustomed to having my every word closely scrutinized by political opponents seeking to disqualify me. So, by all means, please judge between us concerning who is truthful and who is not. Notice too who permits comments on these posts and who does not.\nPerhaps those concerned individuals should ask John Scalzi why it is that I continue to expose his lies and hoist him on his own petard. They might wish to ask him if he refused to pay his dues to SFWA and threatened to leave if I was not purged from the organization. They could ask him if he had any discussions with Tor editor Patrick Nielsen Hayden about it, and if he knew that Mr. Nielsen Hayden was also refusing to pay his dues until I was purged. And finally, they should also ask precisely who was attacking whom, and why, in 2005.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-28T00:53:00+00:00"
}