{
  "url": "https://voxday.net/2014/12/01/the-book-of-feasts-seasons/",
  "scraped_at": "2025-12-16T12:36:51.595925",
  "title": "The Book of Feasts & Seasons",
  "date_display": "December 1, 2014",
  "date_iso": "2014-12-01T17:00:00+00:00",
  "date_from_url": "2014-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/12/seasons_900.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/12/seasons_900.jpg\" width=\"249\"/></a></div><p>It being December 1st, we are now properly in the Christmas season and so this seems a propitious time to announce the newest John C. Wright book from Castalia House, a collection of 10 holiday-inspired science fiction stories collectively known as <a href=\"http://www.amazon.com/Book-Feasts-Seasons-John-Wright-ebook/dp/B00QEDGIQW\"><i><b>THE BOOK OF FEASTS &amp; SEASONS</b></i></a>. This is not your average cup of Christmas tea, as a look at the story titles alone will tell you. Over the course of the year, from January to December, the science fiction grandmaster takes<br> his inspiration from ten different holidays and explores their meanings<br> in a series of stories of marvelous imagination. The book begins with<br> New Year’s Day and “The Meaning of Life as Told Me by an Inebriated<br> Science Fiction Writer in New Jersey.” The Feast of the Annunciation of<br> the Blessed Virgin is represented by “A Random World of Delta Capricorni<br> Aa, Called Scheddi”, while “The Parliament of Beasts and Birds” represents the Feast of Pentecost. The calendar, and the anthology,<br> culminate on Christmas Eve with “Yes, Virginia, There is a Santa Claus”.</br></br></br></br></br></br></br></p><p>My personal favorite is “The Parliament of Beasts and Birds”, which rather reminds me of one of Tanith Lee’s best works, “The Tale of the Cat”, and is, in my opinion, a serious contender for the best thing that Mr. Wright has ever written.</p><p><i>The animals gathered, one by one, outside the final city of Man, furtive, curious, and afraid.</i><br> <i><br>All was dark. In the west was a blood-red sunset, and in the east a blood-red moonrise of a waning moon. No lamps shined in the towers and minarets, and all the widows of the palaces, mansions, and fanes were empty as the eyes of skulls.</br></i></br></p><p><i>All about the walls of the city were the fields and houses that were empty and still, and all the gates and doors lay open.</i><br> <i><br>Above the fortresses and barracks, black pillars upheld statues of golden eagles, beaks open, unmoving and still. Above the coliseum and circus, where athletes strove and acrobats danced and slaves fought and criminals were fed alive to wild beasts for the diversion of the crowds, and the noise of screams and cries rose up like incense toward heaven, statues of heroes and demigods stood on white pillars, glaring blindly down.</br></i><br> <i><br>Within other walls were gardens whose trees were naked in the wind, and the silence was broken only by the rustle of the carpet of fallen leaves wallowing along the marble paths and pleasances.</br></i><br> <i><br>Above the boulevards and paved squares where merchants once bought and sold ivory and incense and purple and gold, or costly fabrics of silks from the east, or ambergris from the seas beyond the Fortunate Isles, and auction houses adorned and painted stood where singing birds and dancing girls were sold to the highest bidder or given to the haughtiest peer. And here were gambling houses where princes and nobles once used gems as counters for cities and walled towns, and the fate of nations might depend upon the turn of a card. And there were pleasure houses where harlots plied their trade, and houses of healing where physicians explained which venereal disease had no cures and arranged for painless suicides, and houses of morticians where disease-raddled bodies were burnt in private, without any ceremony that might attract attention and be bad for business.</br></i><br> <i><br>And higher on the high hill in the center of the city were the libraries of the learned and the palaces of the emperors adored as gods. But no history was read in the halls of learning and no laws were debated in the halls of power.</br></i><br> <i><br>Not far outside the city was a mountain that had been cut in two, crown to root, by some great supernatural force. On the slopes of the dark mountain, in a dell overgrown and wild, two dark creatures met, peering cautiously toward the empty city.</br></i></br></br></br></br></br></p><p><i>A black wolf addressed a black raven sitting in a thorn-bush. “What is the news, eater of carrion? Did you fly over the city and spy out where the corpses are?” </i></p><p>As you will have noticed from the text sample, <a href=\"http://www.castaliahouse.com/downloads/the-book-of-feasts-seasons/\"><b><i>THE BOOK OF FEASTS &amp; SEASONS</i></b></a> is not the traditional light-hearted seasonal fare, but is as deep and as dark, as full of grief and joy, as the true story of St. Nicholas, Wonderworker, Defender of Orthodoxy, Holy Hierarch, and Bishop of Myra, himself. It is available <a href=\"http://www.castaliahouse.com/downloads/the-book-of-feasts-seasons/\">from Castalia House</a> as well as <a href=\"http://www.amazon.com/Book-Feasts-Seasons-John-Wright-ebook/dp/B00QEDGIQW\">on Amazon</a>.</p></div>",
  "content_text": "It being December 1st, we are now properly in the Christmas season and so this seems a propitious time to announce the newest John C. Wright book from Castalia House, a collection of 10 holiday-inspired science fiction stories collectively known as\nTHE BOOK OF FEASTS & SEASONS\n. This is not your average cup of Christmas tea, as a look at the story titles alone will tell you. Over the course of the year, from January to December, the science fiction grandmaster takes\nhis inspiration from ten different holidays and explores their meanings\nin a series of stories of marvelous imagination. The book begins with\nNew Year’s Day and “The Meaning of Life as Told Me by an Inebriated\nScience Fiction Writer in New Jersey.” The Feast of the Annunciation of\nthe Blessed Virgin is represented by “A Random World of Delta Capricorni\nAa, Called Scheddi”, while “The Parliament of Beasts and Birds” represents the Feast of Pentecost. The calendar, and the anthology,\nculminate on Christmas Eve with “Yes, Virginia, There is a Santa Claus”.\nMy personal favorite is “The Parliament of Beasts and Birds”, which rather reminds me of one of Tanith Lee’s best works, “The Tale of the Cat”, and is, in my opinion, a serious contender for the best thing that Mr. Wright has ever written.\nThe animals gathered, one by one, outside the final city of Man, furtive, curious, and afraid.\nAll was dark. In the west was a blood-red sunset, and in the east a blood-red moonrise of a waning moon. No lamps shined in the towers and minarets, and all the widows of the palaces, mansions, and fanes were empty as the eyes of skulls.\nAll about the walls of the city were the fields and houses that were empty and still, and all the gates and doors lay open.\nAbove the fortresses and barracks, black pillars upheld statues of golden eagles, beaks open, unmoving and still. Above the coliseum and circus, where athletes strove and acrobats danced and slaves fought and criminals were fed alive to wild beasts for the diversion of the crowds, and the noise of screams and cries rose up like incense toward heaven, statues of heroes and demigods stood on white pillars, glaring blindly down.\nWithin other walls were gardens whose trees were naked in the wind, and the silence was broken only by the rustle of the carpet of fallen leaves wallowing along the marble paths and pleasances.\nAbove the boulevards and paved squares where merchants once bought and sold ivory and incense and purple and gold, or costly fabrics of silks from the east, or ambergris from the seas beyond the Fortunate Isles, and auction houses adorned and painted stood where singing birds and dancing girls were sold to the highest bidder or given to the haughtiest peer. And here were gambling houses where princes and nobles once used gems as counters for cities and walled towns, and the fate of nations might depend upon the turn of a card. And there were pleasure houses where harlots plied their trade, and houses of healing where physicians explained which venereal disease had no cures and arranged for painless suicides, and houses of morticians where disease-raddled bodies were burnt in private, without any ceremony that might attract attention and be bad for business.\nAnd higher on the high hill in the center of the city were the libraries of the learned and the palaces of the emperors adored as gods. But no history was read in the halls of learning and no laws were debated in the halls of power.\nNot far outside the city was a mountain that had been cut in two, crown to root, by some great supernatural force. On the slopes of the dark mountain, in a dell overgrown and wild, two dark creatures met, peering cautiously toward the empty city.\nA black wolf addressed a black raven sitting in a thorn-bush. “What is the news, eater of carrion? Did you fly over the city and spy out where the corpses are?”\nAs you will have noticed from the text sample,\nTHE BOOK OF FEASTS & SEASONS\nis not the traditional light-hearted seasonal fare, but is as deep and as dark, as full of grief and joy, as the true story of St. Nicholas, Wonderworker, Defender of Orthodoxy, Holy Hierarch, and Bishop of Myra, himself. It is available\nfrom Castalia House\nas well as\non Amazon\n.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-01T17:00:00+00:00"
}