{
  "url": "https://voxday.net/2014/12/13/women-have-no-idea/",
  "scraped_at": "2025-12-16T12:38:10.915711",
  "title": "“Women have no idea”",
  "date_display": "December 13, 2014",
  "date_iso": "2014-12-13T18:30:00+00:00",
  "date_from_url": "2014-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And here I thought we’d be more productive with women in the workforce. Tapping into that vast pool of hitherto untapped talent and all. And yet, Dr. Helen <a href=\"http://pjmedia.com/drhelen/2014/12/13/at-least-women-have-a-job/\">is unimpressed with her sex</a>, nominally at work:</p><blockquote class=\"tr_bq\"><p> Apparently, rather than focusing on their own jobs, men are supposed to spend their time playing therapist to how women think and feel. And of course the author has no understanding of how hard it is for men to even interact with women at work, given all the rules and regulations. One “tip” in the article tells men not to be afraid of tears:</p><p><i>    When Paul Gotti of Cardinal Health gave performance reviews, he says that, without even realizing it, he was easier on female directors: “I didn’t want them to cry, to feel bad.” He recognizes now that this was no favor. They should have the feedback “so that they can grow too.”</i></p><p>    Ms. Flynn of Flynn Heath Holt says that her firm has found that men aren’t only afraid of tears but of getting in trouble with “the diversity police” for speaking harshly, or of women being “too high maintenance, or [that] she’ll ask a million questions.” As a result, “men are scared to death to give us feedback…. They’ll let women run astray and off course and be fired before they’ll take the chance to give them feedback.”</p><p>    Her advice: Be honest. That doesn’t mean you have to be blunt, adds Mr. Schwartz of the Energy Project, which is more than 60% female: “I’ve learned it’s a balance between honesty and empathy. Honesty without empathy is cruelty.”</p><p>Women have no idea what men in the workplace are dealing with when they<br> work with women. And men, despite what the author thinks,  are not there<br> to babysit women by telling them to ask for raises, brushing away tears<br> and “twisting” women’s arms to ask for <em>her</em> own promotion.</br></br></br></p></blockquote><p>I suggest learning to refer to “equality” and to say “look, you’re a strong, independent woman who doesn’t need any help from a man to do her job” will be vital for many men in the corporate environment. Black knighting and ruthless compliance with all workplace regulations is the optimal way to circumvent the lunacy.</p></div>",
  "content_text": "And here I thought we’d be more productive with women in the workforce. Tapping into that vast pool of hitherto untapped talent and all. And yet, Dr. Helen\nis unimpressed with her sex\n, nominally at work:\nApparently, rather than focusing on their own jobs, men are supposed to spend their time playing therapist to how women think and feel. And of course the author has no understanding of how hard it is for men to even interact with women at work, given all the rules and regulations. One “tip” in the article tells men not to be afraid of tears:\nWhen Paul Gotti of Cardinal Health gave performance reviews, he says that, without even realizing it, he was easier on female directors: “I didn’t want them to cry, to feel bad.” He recognizes now that this was no favor. They should have the feedback “so that they can grow too.”\nMs. Flynn of Flynn Heath Holt says that her firm has found that men aren’t only afraid of tears but of getting in trouble with “the diversity police” for speaking harshly, or of women being “too high maintenance, or [that] she’ll ask a million questions.” As a result, “men are scared to death to give us feedback…. They’ll let women run astray and off course and be fired before they’ll take the chance to give them feedback.”\nHer advice: Be honest. That doesn’t mean you have to be blunt, adds Mr. Schwartz of the Energy Project, which is more than 60% female: “I’ve learned it’s a balance between honesty and empathy. Honesty without empathy is cruelty.”\nWomen have no idea what men in the workplace are dealing with when they\nwork with women. And men, despite what the author thinks,  are not there\nto babysit women by telling them to ask for raises, brushing away tears\nand “twisting” women’s arms to ask for\nher\nown promotion.\nI suggest learning to refer to “equality” and to say “look, you’re a strong, independent woman who doesn’t need any help from a man to do her job” will be vital for many men in the corporate environment. Black knighting and ruthless compliance with all workplace regulations is the optimal way to circumvent the lunacy.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-13T18:30:00+00:00"
}