{
  "url": "https://voxday.net/2014/12/06/youve-got-your-gay-culture-in-my/",
  "scraped_at": "2025-12-16T12:37:27.421714",
  "title": "You got your gay technoculture in my propaganda!",
  "date_display": "December 6, 2014",
  "date_iso": "2014-12-06T19:13:00+00:00",
  "date_from_url": "2014-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.politico.com/blogs/media/2014/12/new-republic-staffers-resign-en-masse-199595.html\">The displacement of liberal New York Jews by liberal Silicon Valley gays</a> is probably a positive sign if it truly indicates that the post-WWII left-wing Jewish establishment is on the decline.</p><blockquote class=\"tr_bq\"><p> The majority of The New Republic’s masthead resigned en masse on Friday following the owner’s decision to force out the editorial leadership, move the magazine to New York, and rebrand the venerable, century-old publication as a “digital media company.”</p><p>Nine of the magazine’s twelve senior editors submitted letters of resignation to owner Chris Hughes and chief executive Guy Vidra, as did two executive editors, the digital media editor, the legislative affairs editor, and two arts editors. At least twenty of the magazine’s contributing editors also requested that their names be removed from the magazine’s masthead.</p><p>The mass departure came one day after a shakeup that saw the resignation of top editor Franklin Foer and veteran literary editor Leon Wieseltier, both of whom resigned due to differences of vision with Hughes, a 31-year-old Facebook co-founder who bought the magazine in 2012. Foer announced his resignation on Thursday after discovering that Hughes had already hired his replacement, Gabriel Snyder, a Bloomberg Media editor who formerly ran The Atlantic Wire blog….</p><p>Those who resigned are senior editors Jonathan Cohn, Isaac Chotiner, Julia Ioffe, John Judis, Adam Kirsch, Alec MacGillis, Noam Scheiber, Judith Shulevitz and Jason Zengerle; executive editors Rachel Morris and Greg Veis; digital media editor Hillary Kelly (who resigned from her honeymoon in Africa); legal affairs editor Jeffrey Rosen; and poetry editor Henri Cole and dance editor Jennifer Homans. Contributing editors Anne Applebaum, Paul Berman, Christopher Benfey, Jonathan Chait, William Deresiewicz, Justin Driver, TA Frank, Ruth Franklin, Jack Goldsmith, Anthony Grafton, David Grann, David Greenberg, Robert Kagan, Enrique Krauze, Damon Linker, Ryan Lizza, John McWhorter, Sacha Z. Scoblic, Cass Sunstein, Alan Taylor, Helen Vendler and Sean Wilentz.</p><p>Many of those who resigned on Friday believe that Hughes and Vidra now intend to turn TNR into a click-focused digital media company, at the expense of the magazine’s strong editorial traditions and venerable brand, according to sources who attended the gathering at Foer’s house.</p></blockquote><p>Whatever will Americans do without this landmark of the neocon establishment telling them what to think and which wars to wage? And wherever will we go for our poetry and dance criticism? It’s good to see some of these old propaganda centers being disrupted and demolished; it’s absolutely ridiculous how much political influence <i>The New Republic</i> had considering that it only had 50,000 subscribers.</p><p>The antiwar site Mondoweiss notes: “This is a landmark in the era of the Jewish establishment. It’s petering out in an elite generation of far greater diversity.” Given that Holocaustianity and Hollywood are much more influential in the USA than in Europe, my guess is that it will take at least one more generation before America’s Jews begin following the lead of French Jewry, of whom more than one percent of the total population are expected to have moved to Israel by the end of 2014. What is interesting is the way these developmens indicate that six decades of diligent work to break down European and American homogenuity has gone somewhat agley; it appears that a constant power struggle of all against all may not actually be safer than a single well-disposed majority ruling over diverse minorities with benign disregard.</p><p>Having recently read Martin van Creveld’s <i>The Land of Blood and Honey</i>, I suspect there will be some fairly serious cultural clashes in the future between American Jews, who believe they are the center of the Jewish world, and the Israelis, who understandably feel very differently. Those who see “Israeli” and “Jew” as being entirely synonymous really don’t know what they’re talking about; the amusing thing is that Israelis tend to speak more dismissively of American Jews than most Americans would dare.</p><p>One important difference that I see is that Israelis are heading rapidly towards a homogenous ethno-cultural state, while American Jews are terrified of Israeli people’s “heartbreaking” embrace of nationalism because they know they are no more a part of the American ethno-cultural state than Israel’s Arab citizens are part of Israel’s, and they have no more desire to move to Israel than the average Israeli Arab has in moving to Egypt or Syria. But their “national homogeneity for me, but not for thee” argument is unlikely to hold water with anyone.</p></div>",
  "content_text": "The displacement of liberal New York Jews by liberal Silicon Valley gays\nis probably a positive sign if it truly indicates that the post-WWII left-wing Jewish establishment is on the decline.\nThe majority of The New Republic’s masthead resigned en masse on Friday following the owner’s decision to force out the editorial leadership, move the magazine to New York, and rebrand the venerable, century-old publication as a “digital media company.”\nNine of the magazine’s twelve senior editors submitted letters of resignation to owner Chris Hughes and chief executive Guy Vidra, as did two executive editors, the digital media editor, the legislative affairs editor, and two arts editors. At least twenty of the magazine’s contributing editors also requested that their names be removed from the magazine’s masthead.\nThe mass departure came one day after a shakeup that saw the resignation of top editor Franklin Foer and veteran literary editor Leon Wieseltier, both of whom resigned due to differences of vision with Hughes, a 31-year-old Facebook co-founder who bought the magazine in 2012. Foer announced his resignation on Thursday after discovering that Hughes had already hired his replacement, Gabriel Snyder, a Bloomberg Media editor who formerly ran The Atlantic Wire blog….\nThose who resigned are senior editors Jonathan Cohn, Isaac Chotiner, Julia Ioffe, John Judis, Adam Kirsch, Alec MacGillis, Noam Scheiber, Judith Shulevitz and Jason Zengerle; executive editors Rachel Morris and Greg Veis; digital media editor Hillary Kelly (who resigned from her honeymoon in Africa); legal affairs editor Jeffrey Rosen; and poetry editor Henri Cole and dance editor Jennifer Homans. Contributing editors Anne Applebaum, Paul Berman, Christopher Benfey, Jonathan Chait, William Deresiewicz, Justin Driver, TA Frank, Ruth Franklin, Jack Goldsmith, Anthony Grafton, David Grann, David Greenberg, Robert Kagan, Enrique Krauze, Damon Linker, Ryan Lizza, John McWhorter, Sacha Z. Scoblic, Cass Sunstein, Alan Taylor, Helen Vendler and Sean Wilentz.\nMany of those who resigned on Friday believe that Hughes and Vidra now intend to turn TNR into a click-focused digital media company, at the expense of the magazine’s strong editorial traditions and venerable brand, according to sources who attended the gathering at Foer’s house.\nWhatever will Americans do without this landmark of the neocon establishment telling them what to think and which wars to wage? And wherever will we go for our poetry and dance criticism? It’s good to see some of these old propaganda centers being disrupted and demolished; it’s absolutely ridiculous how much political influence\nThe New Republic\nhad considering that it only had 50,000 subscribers.\nThe antiwar site Mondoweiss notes: “This is a landmark in the era of the Jewish establishment. It’s petering out in an elite generation of far greater diversity.” Given that Holocaustianity and Hollywood are much more influential in the USA than in Europe, my guess is that it will take at least one more generation before America’s Jews begin following the lead of French Jewry, of whom more than one percent of the total population are expected to have moved to Israel by the end of 2014. What is interesting is the way these developmens indicate that six decades of diligent work to break down European and American homogenuity has gone somewhat agley; it appears that a constant power struggle of all against all may not actually be safer than a single well-disposed majority ruling over diverse minorities with benign disregard.\nHaving recently read Martin van Creveld’s\nThe Land of Blood and Honey\n, I suspect there will be some fairly serious cultural clashes in the future between American Jews, who believe they are the center of the Jewish world, and the Israelis, who understandably feel very differently. Those who see “Israeli” and “Jew” as being entirely synonymous really don’t know what they’re talking about; the amusing thing is that Israelis tend to speak more dismissively of American Jews than most Americans would dare.\nOne important difference that I see is that Israelis are heading rapidly towards a homogenous ethno-cultural state, while American Jews are terrified of Israeli people’s “heartbreaking” embrace of nationalism because they know they are no more a part of the American ethno-cultural state than Israel’s Arab citizens are part of Israel’s, and they have no more desire to move to Israel than the average Israeli Arab has in moving to Egypt or Syria. But their “national homogeneity for me, but not for thee” argument is unlikely to hold water with anyone.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-12-06T19:13:00+00:00"
}