{
  "url": "https://voxday.net/2004/05/13/american-amazons/",
  "scraped_at": "2025-12-19T20:27:26.364480",
  "title": "American Amazons",
  "date_display": "May 13, 2004",
  "date_iso": "2004-05-13T13:50:00+00:00",
  "date_from_url": "2004-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Shocking shots of sexcapades involving Pfc. Lynndie England were among the <a href=\"http://www.nypost.com/news/nationalnews/20802.htm\">hundreds of X-rated photos and videos</a> from the Abu Ghraib prison scandal shown to lawmakers in a top-secret Capitol conference room yesterday. “She was having sex with numerous partners. It appeared to be consensual,” said a lawmaker who saw the photos. And, videos showed the disgraced soldier – made notorious in a photo showing her holding a leash looped around an Iraqi prisoner’s neck – engaged in graphic sex acts with other soldiers in front of Iraqi prisoners, Pentagon officials told NBC Nightly News.</p><p>“Almost everybody was naked all the time,” another lawmaker said. Many members of Congress left the 45-minute viewing session early, thereby missing the porno performance by England, but there were enough other images of torture, humiliation and intimidation to sicken anyone. “It was pretty disgusting, not what you’d expect from Americans,” said Sen. Norm Coleman (R-Minn.). “There was lots of sexual stuff – not of the Iraqis, but of our troops.”</p><p>Not what you’d expect from Americans?  In what country does Norm live?  We invented the Internet, for Pete’s sake!  If we’re going to continue with this idiotic policy of allowing women in the military, why not just go all the way and name Jenna Jameson to the Joint Chiefs of Staff?  At least then we’d be putting our best pornographic foot forward.</p><p>These latest revelations should shut up all those see-no-evil Pentagon defenders who have been arguing that the whole Abu Ghraib situation was a cunning plan to intimidate the Arabs.  There was quite likely some MI involvement in the abuse, but the overall theme, from the beginning, has been one of idiotic and unprofessional behavior by a bunch of reservists “commanded” by a terrible woman general.  If Rumsfeld is going to resign for anything, it should be for continuing to allow women in the military to destroy discipline in the armed forces.</p></div>",
  "content_text": "Shocking shots of sexcapades involving Pfc. Lynndie England were among the\nhundreds of X-rated photos and videos\nfrom the Abu Ghraib prison scandal shown to lawmakers in a top-secret Capitol conference room yesterday. “She was having sex with numerous partners. It appeared to be consensual,” said a lawmaker who saw the photos. And, videos showed the disgraced soldier – made notorious in a photo showing her holding a leash looped around an Iraqi prisoner’s neck – engaged in graphic sex acts with other soldiers in front of Iraqi prisoners, Pentagon officials told NBC Nightly News.\n“Almost everybody was naked all the time,” another lawmaker said. Many members of Congress left the 45-minute viewing session early, thereby missing the porno performance by England, but there were enough other images of torture, humiliation and intimidation to sicken anyone. “It was pretty disgusting, not what you’d expect from Americans,” said Sen. Norm Coleman (R-Minn.). “There was lots of sexual stuff – not of the Iraqis, but of our troops.”\nNot what you’d expect from Americans?  In what country does Norm live?  We invented the Internet, for Pete’s sake!  If we’re going to continue with this idiotic policy of allowing women in the military, why not just go all the way and name Jenna Jameson to the Joint Chiefs of Staff?  At least then we’d be putting our best pornographic foot forward.\nThese latest revelations should shut up all those see-no-evil Pentagon defenders who have been arguing that the whole Abu Ghraib situation was a cunning plan to intimidate the Arabs.  There was quite likely some MI involvement in the abuse, but the overall theme, from the beginning, has been one of idiotic and unprofessional behavior by a bunch of reservists “commanded” by a terrible woman general.  If Rumsfeld is going to resign for anything, it should be for continuing to allow women in the military to destroy discipline in the armed forces.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-13T12:50:00+00:00"
}