{
  "url": "https://voxday.net/2004/05/10/and-his-vorpal-blade-went-snicker/",
  "scraped_at": "2025-12-19T10:52:03.063391",
  "title": "And his vorpal blade went snicker-snack",
  "date_display": "May 10, 2004",
  "date_iso": "2004-05-10T14:04:00+00:00",
  "date_from_url": "2004-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But conservative policy experts and a number of former Bush administration officials say there are more systemic reasons for <a href=\"http://www.washingtonpost.com/ac2/wp-dyn/A13027-2004May9?language=printer\">the policy sclerosis</a>. For three years, the president pushed policies conceived during his 2000 campaign for the White House, but with most of those ideas either enacted or stalled, policymaking has run out of steam, they said.</p><p>I’m pretty happy if the Bush administration is running out of policy ideas.  Considering how much they’ve been trying to out-Dem the Democrats, a respite is in order.  Now, if they need some fresh ideas, I’d be more than pleased to supply a few.  I’d just make sure that the president had a Mont Blanc or two for all the executive orders he’d be signing.</p><p>After a cappucino or two, we’d get rocking.  Department of Education – gone!  Housing and Urban Development – gone!  Fannie Mae and Freddie Mac subsidies – gone!  Break for lunch.  National Endowment for the Arts – gone!  Federal gun laws – gone!  UN ambassador – fired!  UN membership – paper shredder, paper strips burnt and ashes flushed down the toilet.  Set up a meeting with Alan Greenspan for tomorrow morning and call it a day.  A frabjous day, indeed!</p></div>",
  "content_text": "But conservative policy experts and a number of former Bush administration officials say there are more systemic reasons for\nthe policy sclerosis\n. For three years, the president pushed policies conceived during his 2000 campaign for the White House, but with most of those ideas either enacted or stalled, policymaking has run out of steam, they said.\nI’m pretty happy if the Bush administration is running out of policy ideas.  Considering how much they’ve been trying to out-Dem the Democrats, a respite is in order.  Now, if they need some fresh ideas, I’d be more than pleased to supply a few.  I’d just make sure that the president had a Mont Blanc or two for all the executive orders he’d be signing.\nAfter a cappucino or two, we’d get rocking.  Department of Education – gone!  Housing and Urban Development – gone!  Fannie Mae and Freddie Mac subsidies – gone!  Break for lunch.  National Endowment for the Arts – gone!  Federal gun laws – gone!  UN ambassador – fired!  UN membership – paper shredder, paper strips burnt and ashes flushed down the toilet.  Set up a meeting with Alan Greenspan for tomorrow morning and call it a day.  A frabjous day, indeed!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-10T13:04:00+00:00"
}