{
  "url": "https://voxday.net/2004/05/17/author-unrepentan/",
  "scraped_at": "2025-12-19T20:28:04.653963",
  "title": "The author, unrepentant",
  "date_display": "May 17, 2004",
  "date_iso": "2004-05-17T10:09:00+00:00",
  "date_from_url": "2004-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mary Gentle writes:  This is why, when I say that there are jokes in Rats and Gargoyles that only three people in the world will understand (and one of them is dead), <a href=\"http://www.philm.demon.co.uk/Baroquon/MaryGentleArticle.html\">this is not an apology</a>. This is why, in Left to His Own Devices, the story of what is really going on is written in iambic pentameter and attributed to an Artificial Unconscious versifying as the 16th century playwright Kit Marlowe.  You’re not smart enough to keep up? Get over it. Get used to it. Get up off your ass! I don’t care if you have to try hard — try harder.</p><p>I like this lady.  GOLDEN WITCHBREED was quite good, while I thought GRUNTS was carrying what should have been a short story on too far, but this wonderful manifesto of contemptuous authorial self-justification definitely encourages me to check out her other books.</p></div>",
  "content_text": "Mary Gentle writes:  This is why, when I say that there are jokes in Rats and Gargoyles that only three people in the world will understand (and one of them is dead),\nthis is not an apology\n. This is why, in Left to His Own Devices, the story of what is really going on is written in iambic pentameter and attributed to an Artificial Unconscious versifying as the 16th century playwright Kit Marlowe.  You’re not smart enough to keep up? Get over it. Get used to it. Get up off your ass! I don’t care if you have to try hard — try harder.\nI like this lady.  GOLDEN WITCHBREED was quite good, while I thought GRUNTS was carrying what should have been a short story on too far, but this wonderful manifesto of contemptuous authorial self-justification definitely encourages me to check out her other books.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-17T09:09:00+00:00"
}