{
  "url": "https://voxday.net/2004/05/19/caveman-economics/",
  "scraped_at": "2025-12-19T20:28:30.351018",
  "title": "Caveman economics",
  "date_display": "May 19, 2004",
  "date_iso": "2004-05-19T08:45:00+00:00",
  "date_from_url": "2004-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am frequently asked why I am so utterly dismissive of socialist economics.  The reason is that its foremost variant – Marxian socialism – is constructed upon a foundation that is completely out of date.  This foundation is the Labor Theory of Value, presented by Marx and Engels in Das Kapital.</p><p>The question of value is one of the most important in economics, as it lies at the heart of all supply and demand.  The value inherent in a given object was, in the nineteenth century, generally considered to consist of its cost.  This cost was comprised of the capital that had gone into the means of production plus the labor required to put the object together.  This seemed fairly obvious, as something that demanded a great deal of material and a lot of labor, such as a palace, was of much greater cost, and presumably, value, than something that required little capital and little labor, such as a loaf of bread.</p><p>Marx’s clever sleight-of-mind was to posit that capital was nothing more than what had previously been skimmed off underpaid workers.  If a baker underpaid his employees, then used that “surplus value” to buy a new oven, what looked like capital was really labor.  Therefore, if value was capital + labor, and all capital was expropriated labor, value was labor.  Or, to put it another way, value is abstract labor time.</p><p>Now, the flaw in this is immediately obvious.  Value is not objective.  A glass of water is essentially worthless to a man who lives by a lake, but is more precious than diamonds to man dying of thirst in the desert.  Furthermore, it is quite clear that labor cannot be used as a viable means of determining value even when one examines a product that is nothing but pure labor.  Is a musical work on which a team of five musicians have labored for two years of inherently more value than a little piece that a single man dashed off in an hour?  By the labor theory of value, the answer is yes.  Few who have listened to Mozart or Bach would agree.</p><p>The labor theory looks particularly outdated in the information age.  When digital bits are worth more than physical objects, when robots are constructing billions of dollars worth of automobiles, it becomes hard to imagine that all that value is being expropriated from the mass of clerical workers who are doing little but moving information from one place to another.  Either we are all expropriating the value of those few Atlasas who are still engaged in what Marx would recognize as labor, or the theory is absurd.</p><p>The reason that socialists cling, however unknowingly, to the labor theory, is that accepting any notion of subjective value is tantamount to utterly destroying the entire basis for distributionism – a philosophy of which socialism is only a subset.  Mises explicated the impossibility of socialist calcluation* in 1920, predicting the very shortages of goods and services that have been seen in every historical socialist society**.  Central planners face a tremendous challenge in simply replacing known capitalist market mechanisms, but adding to that the concept of capricious value determinations on every single product by every single actor makes the task utterly impossible, <em>since there is no way of knowing these independent valuations</em>, much less taking them into account.</p><p>Furthermore, if the laborers are not having their surplus value expropriated by the capitalists, there is no need to expropriate from the expropriators, and no need for a vanguard to establish a more equitable system of distribution.</p><p>A few years after graduating from college with a degree in economics, I called my old history professor and asked him how my old Marxian professors were handling the increasingly obvious fact that the labor theory of value had no relevance to modern economics.  “They’re in denial”, he said, chuckling.  Then he added “But really, what choice do they have?”</p><p>*”The paradox of “planning” is that it cannot plan, because of the absence of economic calculation. What is called a planned economy is no economy at all. It is just a system of groping about in the dark. There is no question of a rational choice of means for the best possible attainment of the ultimate ends sought. What is called conscious planning is precisely the elimination of conscious purposive action.” – Von Mises, HUMAN ACTION</p><p>**”Not one of the 170 essential sectors has fulfilled the objectives of the Plan a single time over the last 20 years … this has brought about a chain reaction of hardship and imbalance which has led to ‘planned anarchy'” – Pravda, May 1988</p></div>",
  "content_text": "I am frequently asked why I am so utterly dismissive of socialist economics.  The reason is that its foremost variant – Marxian socialism – is constructed upon a foundation that is completely out of date.  This foundation is the Labor Theory of Value, presented by Marx and Engels in Das Kapital.\nThe question of value is one of the most important in economics, as it lies at the heart of all supply and demand.  The value inherent in a given object was, in the nineteenth century, generally considered to consist of its cost.  This cost was comprised of the capital that had gone into the means of production plus the labor required to put the object together.  This seemed fairly obvious, as something that demanded a great deal of material and a lot of labor, such as a palace, was of much greater cost, and presumably, value, than something that required little capital and little labor, such as a loaf of bread.\nMarx’s clever sleight-of-mind was to posit that capital was nothing more than what had previously been skimmed off underpaid workers.  If a baker underpaid his employees, then used that “surplus value” to buy a new oven, what looked like capital was really labor.  Therefore, if value was capital + labor, and all capital was expropriated labor, value was labor.  Or, to put it another way, value is abstract labor time.\nNow, the flaw in this is immediately obvious.  Value is not objective.  A glass of water is essentially worthless to a man who lives by a lake, but is more precious than diamonds to man dying of thirst in the desert.  Furthermore, it is quite clear that labor cannot be used as a viable means of determining value even when one examines a product that is nothing but pure labor.  Is a musical work on which a team of five musicians have labored for two years of inherently more value than a little piece that a single man dashed off in an hour?  By the labor theory of value, the answer is yes.  Few who have listened to Mozart or Bach would agree.\nThe labor theory looks particularly outdated in the information age.  When digital bits are worth more than physical objects, when robots are constructing billions of dollars worth of automobiles, it becomes hard to imagine that all that value is being expropriated from the mass of clerical workers who are doing little but moving information from one place to another.  Either we are all expropriating the value of those few Atlasas who are still engaged in what Marx would recognize as labor, or the theory is absurd.\nThe reason that socialists cling, however unknowingly, to the labor theory, is that accepting any notion of subjective value is tantamount to utterly destroying the entire basis for distributionism – a philosophy of which socialism is only a subset.  Mises explicated the impossibility of socialist calcluation* in 1920, predicting the very shortages of goods and services that have been seen in every historical socialist society**.  Central planners face a tremendous challenge in simply replacing known capitalist market mechanisms, but adding to that the concept of capricious value determinations on every single product by every single actor makes the task utterly impossible,\nsince there is no way of knowing these independent valuations\n, much less taking them into account.\nFurthermore, if the laborers are not having their surplus value expropriated by the capitalists, there is no need to expropriate from the expropriators, and no need for a vanguard to establish a more equitable system of distribution.\nA few years after graduating from college with a degree in economics, I called my old history professor and asked him how my old Marxian professors were handling the increasingly obvious fact that the labor theory of value had no relevance to modern economics.  “They’re in denial”, he said, chuckling.  Then he added “But really, what choice do they have?”\n*”The paradox of “planning” is that it cannot plan, because of the absence of economic calculation. What is called a planned economy is no economy at all. It is just a system of groping about in the dark. There is no question of a rational choice of means for the best possible attainment of the ultimate ends sought. What is called conscious planning is precisely the elimination of conscious purposive action.” – Von Mises, HUMAN ACTION\n**”Not one of the 170 essential sectors has fulfilled the objectives of the Plan a single time over the last 20 years … this has brought about a chain reaction of hardship and imbalance which has led to ‘planned anarchy'” – Pravda, May 1988",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-19T07:45:00+00:00"
}