{
  "url": "https://voxday.net/2004/05/23/eventually-youll-accept-that-i/",
  "scraped_at": "2025-12-19T20:28:52.450849",
  "title": "Eventually you’ll accept that I’m usually right",
  "date_display": "May 23, 2004",
  "date_iso": "2004-05-23T11:21:00+00:00",
  "date_from_url": "2004-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Ledeen, one of the war-on-method’s foremost neocon proponents, <a href=\"http://www.nationalreview.com/ledeen/ledeen200405211643.asp\">writes</a>: Second, our defeat in Fallujah. I had hoped that the tactic of enlisting Sunni leaders to assist in the defeat of the jihadis would accelerate the terrorists’ defeat and enable us to round them up and clean out the city. But it turns out that it wasn’t a tactic at all; it was a strategic retreat. Today, throughout the region, everybody knows that the bad guys outlasted us. We were forced out. The Sunni generals (the first of which, unforgivably, was one of Saddam’s henchmen) just told everyone to cool it for a while, and the bad guys are now reorganizing for the next assault. Instead of smashing the terrorists, we set ourselves up for more casualties.</p><p>Worse yet, some of the crackpot realists in our military and their exhausted civilian commanders in State and Defense, have convinced themselves that this is the way to go, and they are now whispering to one another that we should adopt “the Fallujah model” in future engagements. If that holds, then we have lost. Because it means that we have surrendered the initiative to the terrorists and will not destroy them in future engagements. That adds up to actively encouraging the enemy to attack us.</p><p>Defeat in Fallujah.  How veddy interesting.  And here the administration sycophants had been talking about how the retreat from Fallujah was really just a demonstration of a clever new strategy.  Furthermore, it’s becoming increasingly apparent that the Abu Ghraib hijinks were not any part of a systematic intelligence-gathering program, but a short period of undisciplined craziness.</p><p>Keep this in mind as I continue to write about the impossibility of nation-building, and the sycophants continue to vociferously support it, right up until the time that President Bush declares Mission Accomplished II.  Hopefully, this time he’ll have the wisdom to bring the troops home.  I note that even hard core nuke-them-all ass-kickers like Bane have come around to my way of thinking vis-a-vis the administration’s martial prowess.</p><p>Ledeen continues: All of this is the inevitable result of the fundamental misunderstanding of the war against the terror masters. It is a regional war, not a war limited to a single country. Since we refuse to admit this, we are unable to design an effective strategy to win.</p><p>Ledeen’s only error here is that he, like the adminstration, refuses to admit to the global scale of the clash of civilizations.  But otherwise, he might well be echoing my article of Clauswitzian criticism of the war effort.</p><p>Michael Rubin adds: The situation in Iraq today is dire. Bremer has embarked on a policy which is as damaging in the region as the Abu Ghraib scandal. Across the region, Arabs and Iranians point to the raid on Chalabi’s house to show that friendship with America is futile; the United States cannot be an ally and should never be trusted. Democracy is not about crushing peaceful dissent. Across the region, Iraqis and Arabs juxtapose Bush rhetoric and implementation.</p><p>Want one more reason that the Iraqi Occupation will fail miserably?  Bremer is not only no MacArthur, he is yet <a href=\"http://www.nationalreview.com/rubin/rubin200405210849.asp\">another State Department disaster</a>.  He’s not really a disaster, though.  It only looks that way if you make the mistaking of assuming that State is on America’s side, and not the UN’s, as is more accurately the case.  As for a juxtaposition of Bushian rhetoric and implementation, those disappointed Iraqis and Arabs might have done well to consult with conservative Republicans as to the wisdom of putting faith in the president’s words.</p></div>",
  "content_text": "Michael Ledeen, one of the war-on-method’s foremost neocon proponents,\nwrites\n: Second, our defeat in Fallujah. I had hoped that the tactic of enlisting Sunni leaders to assist in the defeat of the jihadis would accelerate the terrorists’ defeat and enable us to round them up and clean out the city. But it turns out that it wasn’t a tactic at all; it was a strategic retreat. Today, throughout the region, everybody knows that the bad guys outlasted us. We were forced out. The Sunni generals (the first of which, unforgivably, was one of Saddam’s henchmen) just told everyone to cool it for a while, and the bad guys are now reorganizing for the next assault. Instead of smashing the terrorists, we set ourselves up for more casualties.\nWorse yet, some of the crackpot realists in our military and their exhausted civilian commanders in State and Defense, have convinced themselves that this is the way to go, and they are now whispering to one another that we should adopt “the Fallujah model” in future engagements. If that holds, then we have lost. Because it means that we have surrendered the initiative to the terrorists and will not destroy them in future engagements. That adds up to actively encouraging the enemy to attack us.\nDefeat in Fallujah.  How veddy interesting.  And here the administration sycophants had been talking about how the retreat from Fallujah was really just a demonstration of a clever new strategy.  Furthermore, it’s becoming increasingly apparent that the Abu Ghraib hijinks were not any part of a systematic intelligence-gathering program, but a short period of undisciplined craziness.\nKeep this in mind as I continue to write about the impossibility of nation-building, and the sycophants continue to vociferously support it, right up until the time that President Bush declares Mission Accomplished II.  Hopefully, this time he’ll have the wisdom to bring the troops home.  I note that even hard core nuke-them-all ass-kickers like Bane have come around to my way of thinking vis-a-vis the administration’s martial prowess.\nLedeen continues: All of this is the inevitable result of the fundamental misunderstanding of the war against the terror masters. It is a regional war, not a war limited to a single country. Since we refuse to admit this, we are unable to design an effective strategy to win.\nLedeen’s only error here is that he, like the adminstration, refuses to admit to the global scale of the clash of civilizations.  But otherwise, he might well be echoing my article of Clauswitzian criticism of the war effort.\nMichael Rubin adds: The situation in Iraq today is dire. Bremer has embarked on a policy which is as damaging in the region as the Abu Ghraib scandal. Across the region, Arabs and Iranians point to the raid on Chalabi’s house to show that friendship with America is futile; the United States cannot be an ally and should never be trusted. Democracy is not about crushing peaceful dissent. Across the region, Iraqis and Arabs juxtapose Bush rhetoric and implementation.\nWant one more reason that the Iraqi Occupation will fail miserably?  Bremer is not only no MacArthur, he is yet\nanother State Department disaster\n.  He’s not really a disaster, though.  It only looks that way if you make the mistaking of assuming that State is on America’s side, and not the UN’s, as is more accurately the case.  As for a juxtaposition of Bushian rhetoric and implementation, those disappointed Iraqis and Arabs might have done well to consult with conservative Republicans as to the wisdom of putting faith in the president’s words.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-23T10:21:00+00:00"
}