{
  "url": "https://voxday.net/2004/05/27/fat-and-freedo/",
  "scraped_at": "2025-12-19T20:29:24.940345",
  "title": "Fat and freedom",
  "date_display": "May 27, 2004",
  "date_iso": "2004-05-27T08:59:00+00:00",
  "date_from_url": "2004-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Matt Drudge has a link to a British story about a three-year old child who died of heart failure due to her obesity.  Meanwhile, today’s Star and Sickle covers the ongoing debate in St. Paul to ban smoking from restaurants, bars and night clubs – all in the name of health.</p><p>It seems to me that if health trumps everything, it’s time to shut down the fast food restaurants of America and start arresting everyone who is more than ten pounds overweight.  Why should smoking – which isn’t anywhere nearly as bad for you as being fat – be quasi-banned while people walk around openly double-fisting Dunkin Donuts?</p><p>Now St. Paul officials are saying that a state-wide ban is needed because St. Paul will be at a competitive disadvantage as people will go elsewhere to eat and smoke, drink and smoke and dance and smoke. <em>Non e’ merde, signor Holmes</em>.  I despise totalitarians of all stripes, but the sanctimonious health fascists are particularly annoying.</p><p>Why do people so despise freedom?  Freedom necessarily involves the ability to make stupid and short-sighted choices too.</p></div>",
  "content_text": "Matt Drudge has a link to a British story about a three-year old child who died of heart failure due to her obesity.  Meanwhile, today’s Star and Sickle covers the ongoing debate in St. Paul to ban smoking from restaurants, bars and night clubs – all in the name of health.\nIt seems to me that if health trumps everything, it’s time to shut down the fast food restaurants of America and start arresting everyone who is more than ten pounds overweight.  Why should smoking – which isn’t anywhere nearly as bad for you as being fat – be quasi-banned while people walk around openly double-fisting Dunkin Donuts?\nNow St. Paul officials are saying that a state-wide ban is needed because St. Paul will be at a competitive disadvantage as people will go elsewhere to eat and smoke, drink and smoke and dance and smoke.\nNon e’ merde, signor Holmes\n.  I despise totalitarians of all stripes, but the sanctimonious health fascists are particularly annoying.\nWhy do people so despise freedom?  Freedom necessarily involves the ability to make stupid and short-sighted choices too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-27T07:59:00+00:00"
}