{
  "url": "https://voxday.net/2004/05/11/how-i-do-hope-so/",
  "scraped_at": "2025-12-19T10:52:10.416904",
  "title": "How I do hope so",
  "date_display": "May 11, 2004",
  "date_iso": "2004-05-11T15:39:00+00:00",
  "date_from_url": "2004-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Cannon <a href=\"http://www.nationalreview.com/comment/cannon200405110857.asp\">writes on NRO</a>: The reason behind Clinton’s shift in strategy is hidden to all but the most ardent supporters and opponents of socialized medicine.  The recently enacted Medicare prescription-drug law contains a deceptively small provision allowing personal, tax-free health-savings accounts. Health-savings accounts mark a fundamental shift federal health-care policy. Health-savings accounts treat an individual’s medical expenditures and savings on a par with tax-free employer expenditures. As a result, they empower individuals to become stewards of their own health-care dollars rather than force people to depend on their employer to spend those dollars wisely…For the first time, advocates of socialized medicine are on the run. This ought to be good.</p><p>I’m not sure that this will be a big deal or not, but anything that staves off the dual menace of the Lizard Queen and her socialized health care plan is desirable.  Visit a hospital in Canada or Britain if you feel even the slightest urge to buy into that disastrous notion.  You won’t for long.</p></div>",
  "content_text": "Michael Cannon\nwrites on NRO\n: The reason behind Clinton’s shift in strategy is hidden to all but the most ardent supporters and opponents of socialized medicine.  The recently enacted Medicare prescription-drug law contains a deceptively small provision allowing personal, tax-free health-savings accounts. Health-savings accounts mark a fundamental shift federal health-care policy. Health-savings accounts treat an individual’s medical expenditures and savings on a par with tax-free employer expenditures. As a result, they empower individuals to become stewards of their own health-care dollars rather than force people to depend on their employer to spend those dollars wisely…For the first time, advocates of socialized medicine are on the run. This ought to be good.\nI’m not sure that this will be a big deal or not, but anything that staves off the dual menace of the Lizard Queen and her socialized health care plan is desirable.  Visit a hospital in Canada or Britain if you feel even the slightest urge to buy into that disastrous notion.  You won’t for long.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-11T14:39:00+00:00"
}