{
  "url": "https://voxday.net/2004/05/07/its-not-all-womans-fau/",
  "scraped_at": "2025-12-19T10:51:44.326687",
  "title": "It’s not all the woman’s fault",
  "date_display": "May 7, 2004",
  "date_iso": "2004-05-07T10:06:00+00:00",
  "date_from_url": "2004-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The infamous Gargler was exploring the bitter roots of feminism, and while it’s undeniably true that many women are raised from birth to be bitches, the sad reality is that many men mistakenly believe that they are interested in subjecting themselves to this sort of punishment.</p><p>My blood ran cold when one of my friends described a girl he was seeing as “spunky” and how much fun they had “giving each other a hard time”.  Because it was “all in fun” of course.  Fortunately, he stopped seeing her before it became too serious, but what a disaster in the making that was!  Think about it, guys.  Sure, it may be fun crossing wits with a girl and hearing her snappy retorts for a while, but it’s not going to be that fun when she decides to up the ante.  It will be even less fun when the barbs are laced with genuine venom.  It won’t be fun at all when you are not allowed to respond in kind, or eventually, at all, without her going nuclear on you at the least hint of criticism.</p><p>Do NOT encourage this sort of behavior in a young girl, or in any woman either.  Men, only you are responsible for the <em>merde</em> you elect to take.  If a woman’s behavior is out of bounds, you must call them on it just as you would a man.  Okay, perhaps not just as you would a man.  Society tends to frown somewhat on the whole punch-in-the-mouth thing.</p></div>",
  "content_text": "The infamous Gargler was exploring the bitter roots of feminism, and while it’s undeniably true that many women are raised from birth to be bitches, the sad reality is that many men mistakenly believe that they are interested in subjecting themselves to this sort of punishment.\nMy blood ran cold when one of my friends described a girl he was seeing as “spunky” and how much fun they had “giving each other a hard time”.  Because it was “all in fun” of course.  Fortunately, he stopped seeing her before it became too serious, but what a disaster in the making that was!  Think about it, guys.  Sure, it may be fun crossing wits with a girl and hearing her snappy retorts for a while, but it’s not going to be that fun when she decides to up the ante.  It will be even less fun when the barbs are laced with genuine venom.  It won’t be fun at all when you are not allowed to respond in kind, or eventually, at all, without her going nuclear on you at the least hint of criticism.\nDo NOT encourage this sort of behavior in a young girl, or in any woman either.  Men, only you are responsible for the\nmerde\nyou elect to take.  If a woman’s behavior is out of bounds, you must call them on it just as you would a man.  Okay, perhaps not just as you would a man.  Society tends to frown somewhat on the whole punch-in-the-mouth thing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-07T09:06:00+00:00"
}