{
  "url": "https://voxday.net/2004/05/14/mailvox-equivalence-is-beside-poin/",
  "scraped_at": "2025-12-19T20:27:33.688485",
  "title": "Mailvox: equivalence is beside the point",
  "date_display": "May 14, 2004",
  "date_iso": "2004-05-14T11:18:00+00:00",
  "date_from_url": "2004-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GS writes: You are the only person with half a brain that may understand what I am trying to say.  I submit to you that nothing, nothing, is as important as the ongoing debate about the abuses in Iraq and the fight against terrorism.  We are at a turning point, and although I find your pontification about the intellectual ineptitude of the media, clever and entertaining, if not repetitive; I ask that you turn your vituperative abilities to clarifying the inequities of the moral equivalencies propounded upon us by the left.</p><p>If that’s a compliment, I shudder to think at what GS would come up with were he in the mood to sling insults.  However, I will have to disappoint him as this is one of the rare cases where the left, in its focus on the apalling breakdown of military discipline at Abu Ghraib, is correct.  Not, of course, for the reasons it thinks it is correct, but only because its mindless, kneejerk opposition to the Bush administration happens to have landed it, accidentally, in synchronicity with the truth.</p><p>Any attempt to defend the American abuse of prisoners on a basis of comparison with Arab atrocities is short-sighted.  It is correct, to be sure, as very little of the abuse rose to the level of torture, much less the wholesale massacre of the innocent in which Arab terrorists revel.  Nick Berg’s death was disgusting, even more outrageous was the murder of the pregnant Israeli woman and her little girls.  But being better cannot be equated with being harmless.</p><p>For what these myopic American cheerleaders forget is that success in Iraq, as defined by the President and the administration, depends entirely on convincing the Iraqi people that the American way is desirable.  In this cause, the non-abusive pornographic behavior of the troops is as problematic as the abuse itself.  The President and the Secretary of Defense realize this, which is why they were so quick to apologize for the actions of the troops.  It was not a Clintonian exercise in self-flagellation, but an attempt to defang a massive PR debacle.  Needless to say, it failed, but their attempt to do so was a sign of perspicuity, not weakness.</p><p>Because the administration has chosen not to fight the clash-of-civilizations war, (a legitimate choice, if one that does little but buy time), it is engaged in what is essentially a public relations war between Islamic-fascist culture and secular Western culture.  The significance of Abu Ghraib is huge due solely to the symbolic nature of the war.  If we were fighting the clash-of-civilizations war, Abu Ghraib would be an insignificant issue; the very fact that it is a big deal indicates that this is, <em>sopratutto</em>, a war of semiotics, not soldiers.</p><p>The American media’s impact is not terribly important in the Arab world.  In that fever-swamp of Zionist-haunted imaginations, the fake porn pictures are a bigger outrage than the pictorial record of the real abuse.  For all my contempt of the mainstream media, I believe it has unwittingly done the American people a real service in drawing attention to the daunting, if not impossible, challenge presented by the administration’s arrogant Wilsonian goal of nation-building.  And remember, that previous attempt at nation-building made the subsequent round of conflict much worse, not better.</p><p>This phase of the battle against the global jihad was lost the moment that the president declared that Saudi Arabia was our friend and that Islam is a religion of peace.  What happens in Iraq now, one way or the other, is almost irrelevant, which is why I have been arguing that the troops should have been brought home after the fall of Bagdad and the capture of Saddam Hussein.  The wise general does not enter a battlefield on which he cannot win.</p><p>The good news, however, is that the war is not lost, indeed, like John Paul Jones, we have not yet even begun to fight.</p></div>",
  "content_text": "GS writes: You are the only person with half a brain that may understand what I am trying to say.  I submit to you that nothing, nothing, is as important as the ongoing debate about the abuses in Iraq and the fight against terrorism.  We are at a turning point, and although I find your pontification about the intellectual ineptitude of the media, clever and entertaining, if not repetitive; I ask that you turn your vituperative abilities to clarifying the inequities of the moral equivalencies propounded upon us by the left.\nIf that’s a compliment, I shudder to think at what GS would come up with were he in the mood to sling insults.  However, I will have to disappoint him as this is one of the rare cases where the left, in its focus on the apalling breakdown of military discipline at Abu Ghraib, is correct.  Not, of course, for the reasons it thinks it is correct, but only because its mindless, kneejerk opposition to the Bush administration happens to have landed it, accidentally, in synchronicity with the truth.\nAny attempt to defend the American abuse of prisoners on a basis of comparison with Arab atrocities is short-sighted.  It is correct, to be sure, as very little of the abuse rose to the level of torture, much less the wholesale massacre of the innocent in which Arab terrorists revel.  Nick Berg’s death was disgusting, even more outrageous was the murder of the pregnant Israeli woman and her little girls.  But being better cannot be equated with being harmless.\nFor what these myopic American cheerleaders forget is that success in Iraq, as defined by the President and the administration, depends entirely on convincing the Iraqi people that the American way is desirable.  In this cause, the non-abusive pornographic behavior of the troops is as problematic as the abuse itself.  The President and the Secretary of Defense realize this, which is why they were so quick to apologize for the actions of the troops.  It was not a Clintonian exercise in self-flagellation, but an attempt to defang a massive PR debacle.  Needless to say, it failed, but their attempt to do so was a sign of perspicuity, not weakness.\nBecause the administration has chosen not to fight the clash-of-civilizations war, (a legitimate choice, if one that does little but buy time), it is engaged in what is essentially a public relations war between Islamic-fascist culture and secular Western culture.  The significance of Abu Ghraib is huge due solely to the symbolic nature of the war.  If we were fighting the clash-of-civilizations war, Abu Ghraib would be an insignificant issue; the very fact that it is a big deal indicates that this is,\nsopratutto\n, a war of semiotics, not soldiers.\nThe American media’s impact is not terribly important in the Arab world.  In that fever-swamp of Zionist-haunted imaginations, the fake porn pictures are a bigger outrage than the pictorial record of the real abuse.  For all my contempt of the mainstream media, I believe it has unwittingly done the American people a real service in drawing attention to the daunting, if not impossible, challenge presented by the administration’s arrogant Wilsonian goal of nation-building.  And remember, that previous attempt at nation-building made the subsequent round of conflict much worse, not better.\nThis phase of the battle against the global jihad was lost the moment that the president declared that Saudi Arabia was our friend and that Islam is a religion of peace.  What happens in Iraq now, one way or the other, is almost irrelevant, which is why I have been arguing that the troops should have been brought home after the fall of Bagdad and the capture of Saddam Hussein.  The wise general does not enter a battlefield on which he cannot win.\nThe good news, however, is that the war is not lost, indeed, like John Paul Jones, we have not yet even begun to fight.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-14T10:18:00+00:00"
}