{
  "url": "https://voxday.net/2004/05/31/mailvox-wishful-thinking/",
  "scraped_at": "2025-12-19T20:29:50.599071",
  "title": "Mailvox: Wishful thinking",
  "date_display": "May 31, 2004",
  "date_iso": "2004-05-31T06:44:00+00:00",
  "date_from_url": "2004-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AbleArt writes:  Contrary to the predictions of Vox, and many other conservative (even if they think they’re not conservatives) blog pundits, Air America is suddenly getting good ratings in its markets. See here. File this in the “failed predictions” along with Kerry’s immanent demise.</p><p><em>“Even by the chaotic standards of a new media company, Air America Radio’s first two months of broadcasting have been convulsive. The fledgling talk-radio network has replaced five top executives, been taken off the air in two of its top three markets and lost several crucial producers. By late April, current and former executives said last week, <a href=\"http://www.nytimes.com/2004/05/31/business/media/31air.html?ei=5062&amp;en=707bcb9a3dc0e5f9&amp;ex=1086580800&amp;partner=GOOGLE&amp;pagewanted=print&amp;position=\">the company was perilously close to running out of money</a>. It has since received an infusion of cash, though it has not disclosed how much or from whom.</em></p><p>The roiling in Air America’s front office has undercut its continuing assurances that it has the financing and leadership to survive past the presidential election in November, in pursuit of its goal of establishing a permanent liberal counterpart to Rush Limbaugh and his radio cohort on the right. In a sign that the privately held company’s financial woes have not fully abated, Al Franken, the network’s best-known star, said in an interview last week that he had agreed not to draw a salary, however temporarily, making him “an involuntary investor.”</p><p>Speaking of trifectas, Able hits one here.  1) I’m still not conservative.  2) I never said Kerry’s demise would be imminent, I said he’d lose in November.  3) I’m quite satisfied with my prediction of Air America’s failure.  They supposedly had funding to last them years, and already they can’t pay their personnel.<br/></p></div>",
  "content_text": "AbleArt writes:  Contrary to the predictions of Vox, and many other conservative (even if they think they’re not conservatives) blog pundits, Air America is suddenly getting good ratings in its markets. See here. File this in the “failed predictions” along with Kerry’s immanent demise.\n“Even by the chaotic standards of a new media company, Air America Radio’s first two months of broadcasting have been convulsive. The fledgling talk-radio network has replaced five top executives, been taken off the air in two of its top three markets and lost several crucial producers. By late April, current and former executives said last week,\nthe company was perilously close to running out of money\n. It has since received an infusion of cash, though it has not disclosed how much or from whom.\nThe roiling in Air America’s front office has undercut its continuing assurances that it has the financing and leadership to survive past the presidential election in November, in pursuit of its goal of establishing a permanent liberal counterpart to Rush Limbaugh and his radio cohort on the right. In a sign that the privately held company’s financial woes have not fully abated, Al Franken, the network’s best-known star, said in an interview last week that he had agreed not to draw a salary, however temporarily, making him “an involuntary investor.”\nSpeaking of trifectas, Able hits one here.  1) I’m still not conservative.  2) I never said Kerry’s demise would be imminent, I said he’d lose in November.  3) I’m quite satisfied with my prediction of Air America’s failure.  They supposedly had funding to last them years, and already they can’t pay their personnel.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-31T05:44:00+00:00"
}