{
  "url": "https://voxday.net/2004/05/12/mark-cuban-on-stocks/",
  "scraped_at": "2025-12-19T10:52:19.644435",
  "title": "Mark Cuban on stocks",
  "date_display": "May 12, 2004",
  "date_iso": "2004-05-12T17:12:00+00:00",
  "date_from_url": "2004-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.blogmaverick.com/entry/9817136470302336\">What gets me even worse </a>are the big name guys who come on like all they have is an honest opinion to share. I remember sitting next to Mario Gabelli. I brought up my position that the “investment theme” of buy and hold is nothing more than a sales pitch and the best way for sales reps and brokers to get upset customers off the phone. “I know the fund is down 12 pct Mr. Doe, but that happens in a buy and hold strategy. Over the last 80 years…” What nonsense.</p><p>I have to agree with him.  The lies are even worse when they try to use an index – which changes from between once a year (Nasdaq-100) and every five years (the Dow) – to justify buying individual stocks.  Over time, stocks generally pace inflation on the average.  We’ve had a great run until 2000, we’ve had what looks like a nice counter-trend second-wave up, and now we’re getting rolling on wave three down.  If the Fed had more bullets, I have no doubt they’d cut rates again, and they may try it yet.</p><p>Oh, but the economics statistics are so wonderful, you say?  I am a fiction writer.  I know fiction when I see it.  Cuban’s blog is great – no wonder the Dallas fans love him.</p></div>",
  "content_text": "What gets me even worse\nare the big name guys who come on like all they have is an honest opinion to share. I remember sitting next to Mario Gabelli. I brought up my position that the “investment theme” of buy and hold is nothing more than a sales pitch and the best way for sales reps and brokers to get upset customers off the phone. “I know the fund is down 12 pct Mr. Doe, but that happens in a buy and hold strategy. Over the last 80 years…” What nonsense.\nI have to agree with him.  The lies are even worse when they try to use an index – which changes from between once a year (Nasdaq-100) and every five years (the Dow) – to justify buying individual stocks.  Over time, stocks generally pace inflation on the average.  We’ve had a great run until 2000, we’ve had what looks like a nice counter-trend second-wave up, and now we’re getting rolling on wave three down.  If the Fed had more bullets, I have no doubt they’d cut rates again, and they may try it yet.\nOh, but the economics statistics are so wonderful, you say?  I am a fiction writer.  I know fiction when I see it.  Cuban’s blog is great – no wonder the Dallas fans love him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-12T16:12:00+00:00"
}