{
  "url": "https://voxday.net/2004/05/31/michael-badnarik-for-presiden/",
  "scraped_at": "2025-12-19T20:29:56.079319",
  "title": "Michael Badnarik for President",
  "date_display": "May 31, 2004",
  "date_iso": "2004-05-31T11:21:00+00:00",
  "date_from_url": "2004-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In a debate on May 29 at <a href=\"http://www.lp.org/lpnews/0407/debate.html\">the Libertarian Party’s national convention</a> in Atlanta, the top three candidates for the party’s presidential nomination squared off in front of more than 800 delegates, striving one last time to earn votes before the Sunday election. The contestants — constitutional scholar <a href=\"http://www.badnarik.org/issues/lneilsmith.html\">Michael Badnarik</a>, longtime radio host Gary Nolan and movie producer Aaron Russo — delivered few barbs at each other in the debate, choosing instead to target the Republicans and Democrats.  After being beaten in the polls and primaries by the other two leading candidates, apparent underdog Badnarik used the debate to regain the attention of many delegates who had been apt to overlook him, one Russo supporter said later that night, asking not to be identified.</p><p>And that delegate was not alone in his new-found regard for Badnarik: Many were surprised by his presence and composure, as well his responses during the debate. A random sampling of delegates following the event indicated that an overwhelming majority considered Badnarik the winner. One delegate noted: “Russo has passion. Nolan is very polished. But I really think Badnarik was the big winner tonight. The man’s intellect is remarkable, and tonight he really rallied. “I don’t think anyone expected the audience reaction to Badnarik’s comments, myself included. If we could have the intellect of Badnarik, the polish of Nolan and the fire of Russo, we’d have the perfect candidate.”</p><p>Apparently Michael Badnarik’s performance at the debate was solid enough to make a real impact on the delegates, as he won the Libertarian nomination when Gary Nolan endorsed him after several rounds of voting split three ways.  Kudos to CSPAN for staying with the party’s nomination process, even preempting programming when the voting went into extra time.</p><p>I’ll be interviewing both Michael Badnarik as well as <a href=\"http://www.peroutka2004.com/\">Michael Peroutka</a> of the Constitution Party in the coming weeks.  I’ll be supporting Badnarik, but if the Libertarians are too much for you, I’d recommend a close look at Peroutka.  Here’s hoping both men can get into the national debates; I have little doubt that Badnarik would easily crush the tongue-tied George Delano as well as the unpredictable junior senator from the People’s Republic of Massachusetts, Monsieur Flip-Flop himself.</p><p>An interesting point for libertarian-friendly Republicans to keep in mind is that the Libertarian Party has nominated an openly pro-life presidential candidate.  After first correctly noting that abortion is properly a state matter, his statement on the issue concludes: <em>Michael used to be “pro-choice” based on the presumption that a woman owns her own body. Neither government agents nor he has any authority to mandate what she does or does not do with her body. More recently Michael came to the logical conclusion that the baby must eventually claim ownership of ITS own body, as well. The abortion debate exists because of a disagreement about precisely when that happens. At this point in time, because there is no scientific consensus, Michael chooses to error in favor of the baby, and now holds that abortion is a violation of the baby’s right to life.</em></p><p>I disagree with Badnarik’s position on homogamy, but this is tempered by my belief that he would have no problem whatsoever with getting the state and federal government out of the marriage business altogether.  If the federal government is going to be involved, then there is no intellectually coherent reason to prevent same-sex or plural relationships from being recognized by it.  Since marriage is the bedrock of society, this is all the more reason to keep government out of it.  I must also note that his position on prisons is a little strange.</p></div>",
  "content_text": "In a debate on May 29 at\nthe Libertarian Party’s national convention\nin Atlanta, the top three candidates for the party’s presidential nomination squared off in front of more than 800 delegates, striving one last time to earn votes before the Sunday election. The contestants — constitutional scholar\nMichael Badnarik\n, longtime radio host Gary Nolan and movie producer Aaron Russo — delivered few barbs at each other in the debate, choosing instead to target the Republicans and Democrats.  After being beaten in the polls and primaries by the other two leading candidates, apparent underdog Badnarik used the debate to regain the attention of many delegates who had been apt to overlook him, one Russo supporter said later that night, asking not to be identified.\nAnd that delegate was not alone in his new-found regard for Badnarik: Many were surprised by his presence and composure, as well his responses during the debate. A random sampling of delegates following the event indicated that an overwhelming majority considered Badnarik the winner. One delegate noted: “Russo has passion. Nolan is very polished. But I really think Badnarik was the big winner tonight. The man’s intellect is remarkable, and tonight he really rallied. “I don’t think anyone expected the audience reaction to Badnarik’s comments, myself included. If we could have the intellect of Badnarik, the polish of Nolan and the fire of Russo, we’d have the perfect candidate.”\nApparently Michael Badnarik’s performance at the debate was solid enough to make a real impact on the delegates, as he won the Libertarian nomination when Gary Nolan endorsed him after several rounds of voting split three ways.  Kudos to CSPAN for staying with the party’s nomination process, even preempting programming when the voting went into extra time.\nI’ll be interviewing both Michael Badnarik as well as\nMichael Peroutka\nof the Constitution Party in the coming weeks.  I’ll be supporting Badnarik, but if the Libertarians are too much for you, I’d recommend a close look at Peroutka.  Here’s hoping both men can get into the national debates; I have little doubt that Badnarik would easily crush the tongue-tied George Delano as well as the unpredictable junior senator from the People’s Republic of Massachusetts, Monsieur Flip-Flop himself.\nAn interesting point for libertarian-friendly Republicans to keep in mind is that the Libertarian Party has nominated an openly pro-life presidential candidate.  After first correctly noting that abortion is properly a state matter, his statement on the issue concludes:\nMichael used to be “pro-choice” based on the presumption that a woman owns her own body. Neither government agents nor he has any authority to mandate what she does or does not do with her body. More recently Michael came to the logical conclusion that the baby must eventually claim ownership of ITS own body, as well. The abortion debate exists because of a disagreement about precisely when that happens. At this point in time, because there is no scientific consensus, Michael chooses to error in favor of the baby, and now holds that abortion is a violation of the baby’s right to life.\nI disagree with Badnarik’s position on homogamy, but this is tempered by my belief that he would have no problem whatsoever with getting the state and federal government out of the marriage business altogether.  If the federal government is going to be involved, then there is no intellectually coherent reason to prevent same-sex or plural relationships from being recognized by it.  Since marriage is the bedrock of society, this is all the more reason to keep government out of it.  I must also note that his position on prisons is a little strange.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-31T10:21:00+00:00"
}