{
  "url": "https://voxday.net/2004/05/11/murdered-american/",
  "scraped_at": "2025-12-19T10:52:12.255661",
  "title": "Murdered American",
  "date_display": "May 11, 2004",
  "date_iso": "2004-05-11T19:32:00+00:00",
  "date_from_url": "2004-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The reports are that a 26-year old American, Nick Berg, was murdered in a particularly violent manner in response for the abuse of prisoners at Abu Ghraib.  That’s not true, of course, considering that Daniel Pearl was killed in precisely the same way.  I believe that the truth must be freely released and the perpetrators, up to and including General Lapinsky, must be disciplined firmly and appropriately.</p><p>But I scoff at the notion that the abuse causes Arabs to hate us any more than they do.  Those who hate Americans have hated us for decades.  What are they going to do, hate us infinity plus one?  Arab terrorists have been killing hostages for thirty years, yet we still haven’t taken out the father of Arab terrorism.  I’d like to see the administration do something about that before they start posturing about how they’re going to wreak havoc on Nick Berg’s murderers.</p><p>Make a list, check it twice and hunt them down.  This doesn’t require occupying an entire country, but as long as they’re doing that already, they might as well make use of it.</p><p>However, this sort of comment is just crazy.  Republican Senator James Inhofe said: “I’m probably not the only one up at this table that is more outraged by the outrage than we are by the treatment. These prisoners, you know they’re not there for traffic violations,” Inhofe said. “If they’re in cellblock 1-A or 1-B, these prisoners, they’re murderers, they’re terrorists, they’re insurgents. Many of them probably have American blood on their hands and here we’re so concerned about the treatment of those individuals.”</p><p>Right, because no one ever gets arrested by mistake.  And when did Iraqis become terrorists?  Sure, there are foreign fighters there, who are certainly jihadi terrorists, but most of the reports were of <em>Iraqis</em> being mistreated.  If you are a foreign invader, you can’t expect the entire population to welcome you with open arms even if you are invading them in their best interest.  What a stupid, stupid thing to say.  If you’re going to play Russians-in-Chechnya, you play by one set of rules.  But if you’re going to try to win hearts and minds, you have to play by another, more civilized one.</p></div>",
  "content_text": "The reports are that a 26-year old American, Nick Berg, was murdered in a particularly violent manner in response for the abuse of prisoners at Abu Ghraib.  That’s not true, of course, considering that Daniel Pearl was killed in precisely the same way.  I believe that the truth must be freely released and the perpetrators, up to and including General Lapinsky, must be disciplined firmly and appropriately.\nBut I scoff at the notion that the abuse causes Arabs to hate us any more than they do.  Those who hate Americans have hated us for decades.  What are they going to do, hate us infinity plus one?  Arab terrorists have been killing hostages for thirty years, yet we still haven’t taken out the father of Arab terrorism.  I’d like to see the administration do something about that before they start posturing about how they’re going to wreak havoc on Nick Berg’s murderers.\nMake a list, check it twice and hunt them down.  This doesn’t require occupying an entire country, but as long as they’re doing that already, they might as well make use of it.\nHowever, this sort of comment is just crazy.  Republican Senator James Inhofe said: “I’m probably not the only one up at this table that is more outraged by the outrage than we are by the treatment. These prisoners, you know they’re not there for traffic violations,” Inhofe said. “If they’re in cellblock 1-A or 1-B, these prisoners, they’re murderers, they’re terrorists, they’re insurgents. Many of them probably have American blood on their hands and here we’re so concerned about the treatment of those individuals.”\nRight, because no one ever gets arrested by mistake.  And when did Iraqis become terrorists?  Sure, there are foreign fighters there, who are certainly jihadi terrorists, but most of the reports were of\nIraqis\nbeing mistreated.  If you are a foreign invader, you can’t expect the entire population to welcome you with open arms even if you are invading them in their best interest.  What a stupid, stupid thing to say.  If you’re going to play Russians-in-Chechnya, you play by one set of rules.  But if you’re going to try to win hearts and minds, you have to play by another, more civilized one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-11T18:32:00+00:00"
}