{
  "url": "https://voxday.net/2004/05/12/not-huge-surprise/",
  "scraped_at": "2025-12-19T20:27:20.858927",
  "title": "Not a huge surprise",
  "date_display": "May 12, 2004",
  "date_iso": "2004-05-12T22:17:00+00:00",
  "date_from_url": "2004-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Fraters Libertas’ <a href=\"http://www.fraterslibertas.com/2004_05_01_archive.html#108437699798863532\">discuss media Jeopardy</a>:On Monday Tucker Carlson staged a late rally to pass Peggy Noonan and win the day. According to Shawn, Bob Woodward was doing his best Mark Dayton impersonation. Here’s Shawn’s recap of Tuesday’s show: <em>Maria Bartiromo: A doorknob. Holy crap. I don’t think that she just has a slow thumb. I was giving her the benefit of the doubt (slow thumb, or using the marker as a signaling button) until she answered “Computer worm” where “Earth Worm” was the right question. And it was obvious, the answer was about moles, digging, eating these types of worms or something. She was like a supermodel, or Jessica Simpson. Lots to look at, nothing between the ears.</em></p><p>Keep that in mind when she’s touting stocks and rosy economic growth stats.  As some of you may recall what I wrote a few weeks ago, it’s hardly an accident that the journalists can’t keep pace with the commentators.  I don’t know how I’d do on Jeopardy, as my pop cultural knowledge has some pretty serious holes in it, but I daresay I wouldn’t sweat much about taking on any reporter.  However, I have a terrible habit of looking for trick questions that might trip me up in this sort of thing.  Sure would have loved to take on Alice, though.</p></div>",
  "content_text": "The Fraters Libertas’\ndiscuss media Jeopardy\n:On Monday Tucker Carlson staged a late rally to pass Peggy Noonan and win the day. According to Shawn, Bob Woodward was doing his best Mark Dayton impersonation. Here’s Shawn’s recap of Tuesday’s show:\nMaria Bartiromo: A doorknob. Holy crap. I don’t think that she just has a slow thumb. I was giving her the benefit of the doubt (slow thumb, or using the marker as a signaling button) until she answered “Computer worm” where “Earth Worm” was the right question. And it was obvious, the answer was about moles, digging, eating these types of worms or something. She was like a supermodel, or Jessica Simpson. Lots to look at, nothing between the ears.\nKeep that in mind when she’s touting stocks and rosy economic growth stats.  As some of you may recall what I wrote a few weeks ago, it’s hardly an accident that the journalists can’t keep pace with the commentators.  I don’t know how I’d do on Jeopardy, as my pop cultural knowledge has some pretty serious holes in it, but I daresay I wouldn’t sweat much about taking on any reporter.  However, I have a terrible habit of looking for trick questions that might trip me up in this sort of thing.  Sure would have loved to take on Alice, though.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-12T21:17:00+00:00"
}