{
  "url": "https://voxday.net/2004/05/10/not-christian-god/",
  "scraped_at": "2025-12-19T10:52:01.597783",
  "title": "Not the Christian God",
  "date_display": "May 10, 2004",
  "date_iso": "2004-05-10T10:25:00+00:00",
  "date_from_url": "2004-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The historic Christ Church in Alexandria, which draws 800 to 1,200 people on Sunday mornings, lost a $900,000 donation to a building fund because of the Robinson consecration. In recent months, 10 families have left the church, 104 persons have not renewed their annual financial pledge and two parishioners say they have been told giving is down 20 percent.  The Rev. Pierce Klemmt, rector of Christ Church, said people are giving less because they fear “the future” on sexuality.  “<a href=\"http://www.washingtontimes.com/national/20040510-122709-2617r.htm\">Homosexuality is not a sin</a>,” he said. “It is a gift from God, and I see this issue on the same issue as civil rights. Our brothers and sisters with the homosexual orientation should be supported and celebrated as any person should be.”</p><p>Civil rights is, by definition, not a Christian matter.  And homosexuality is not a “gift* from God”, children are.  Furthermore, a future based on homosexuality is a sterile one indeed.  I don’t know which pagan god Mr. Klemmt worships, but it isn’t the Christian God of the Bible.  Christianity is not about tolerance, it is precisely the opposite.  Jesus preached parable after parable talking about exclusion, separation and division.</p><p>Christians are told not to judge non-Christians – that is for God alone – but have a duty to judge and discipline fellow Christians.  As for the wolves in sheep’s clothing, it’s getting easier and easier to spot them.  There are two choices.  Kick them out, or allow them to destroy the church.  Any other response is simply dithering.</p><p>* it is remotely possible, albeit unlikely, that Mr. Klemmt, whose name does sound suspiciously Teutonic, was playing with the unsuspecting reporter by making a bilingual pun, as “gift” in German translates as “poison”.</p></div>",
  "content_text": "The historic Christ Church in Alexandria, which draws 800 to 1,200 people on Sunday mornings, lost a $900,000 donation to a building fund because of the Robinson consecration. In recent months, 10 families have left the church, 104 persons have not renewed their annual financial pledge and two parishioners say they have been told giving is down 20 percent.  The Rev. Pierce Klemmt, rector of Christ Church, said people are giving less because they fear “the future” on sexuality.  “\nHomosexuality is not a sin\n,” he said. “It is a gift from God, and I see this issue on the same issue as civil rights. Our brothers and sisters with the homosexual orientation should be supported and celebrated as any person should be.”\nCivil rights is, by definition, not a Christian matter.  And homosexuality is not a “gift* from God”, children are.  Furthermore, a future based on homosexuality is a sterile one indeed.  I don’t know which pagan god Mr. Klemmt worships, but it isn’t the Christian God of the Bible.  Christianity is not about tolerance, it is precisely the opposite.  Jesus preached parable after parable talking about exclusion, separation and division.\nChristians are told not to judge non-Christians – that is for God alone – but have a duty to judge and discipline fellow Christians.  As for the wolves in sheep’s clothing, it’s getting easier and easier to spot them.  There are two choices.  Kick them out, or allow them to destroy the church.  Any other response is simply dithering.\n* it is remotely possible, albeit unlikely, that Mr. Klemmt, whose name does sound suspiciously Teutonic, was playing with the unsuspecting reporter by making a bilingual pun, as “gift” in German translates as “poison”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-10T09:25:00+00:00"
}