{
  "url": "https://voxday.net/2004/05/23/on-family-courts/",
  "scraped_at": "2025-12-19T20:28:56.197028",
  "title": "On the family courts",
  "date_display": "May 23, 2004",
  "date_iso": "2004-05-23T13:58:00+00:00",
  "date_from_url": "2004-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Their existence, and virtually every problem they address-–divorce, custody, child abuse, child-support enforcement, even juvenile crime—revolve around one overriding principle: <a href=\"http://www.newswithviews.com/Baskerville/stephen.htm\">removing the father from the family</a>. If fathers remained with their families, family courts would have little reason to exist, since the problems that they handle seldom appear in intact families. While mothers also fall afoul of family court judges, it is fathers against whom their enmity is largely directed, because fathers are their principal rivals.</p><p>The judges’ contempt for both fathers and constitutional rights was openly expressed by New Jersey municipal court judge Richard Russell. Speaking to his colleagues during a training seminar in 1994, he said: “Your job is not to become concerned about the constitutional rights of the man that you’re violating. Throw him out on the street, give him the clothes on his back and tell him, “See ya around.” . . .We don’t have to worry about their rights.”</p><p>Why are men so restrained about this obscenity?  With all the unemployed Russian and Colombian gangsters willing to knock off judges for less than $500, I’m surprised there’s a family court judge in the country willing to rule against a father whose wife has unilaterally decided to split the family.</p><p>“Gee, honey, I sure am sorry to hear they have to reschedule and find a new judge again….”</p></div>",
  "content_text": "Their existence, and virtually every problem they address-–divorce, custody, child abuse, child-support enforcement, even juvenile crime—revolve around one overriding principle:\nremoving the father from the family\n. If fathers remained with their families, family courts would have little reason to exist, since the problems that they handle seldom appear in intact families. While mothers also fall afoul of family court judges, it is fathers against whom their enmity is largely directed, because fathers are their principal rivals.\nThe judges’ contempt for both fathers and constitutional rights was openly expressed by New Jersey municipal court judge Richard Russell. Speaking to his colleagues during a training seminar in 1994, he said: “Your job is not to become concerned about the constitutional rights of the man that you’re violating. Throw him out on the street, give him the clothes on his back and tell him, “See ya around.” . . .We don’t have to worry about their rights.”\nWhy are men so restrained about this obscenity?  With all the unemployed Russian and Colombian gangsters willing to knock off judges for less than $500, I’m surprised there’s a family court judge in the country willing to rule against a father whose wife has unilaterally decided to split the family.\n“Gee, honey, I sure am sorry to hear they have to reschedule and find a new judge again….”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-23T12:58:00+00:00"
}