{
  "url": "https://voxday.net/2004/05/14/on-rumsfeld/",
  "scraped_at": "2025-12-19T20:27:39.189298",
  "title": "On Rumsfeld",
  "date_display": "May 14, 2004",
  "date_iso": "2004-05-14T15:06:00+00:00",
  "date_from_url": "2004-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I agree with <a href=\"http://www.nationalreview.com/hanson/hanson200405140838.asp\">VDH</a>.  The notion that Rumsfeld should resign over Abu Ghraib is absolutely absurd.  I think that the Secretary of Defense has done yeoman’s work in what I consider to be an impossible task, and although I believe the Iraqi occupation is doomed to ultimate failure, I have not forgotten the brilliant campaigns that conquered Afghanistan and Iraq in an amazingly short period of time.</p><p>Where Rumsfeld has been weak is in the areas not historically central to his responsibilities.  As he admitted, he hasn’t “been focused on the war of ideas, to be honest with you.”  That single comment reveals why he has not recognized the impossibility of the task he and the administration are undertaking.  The secretary is an intelligent man, and as it becomes increasingly clear that semiotics count more than soldiers in this particular conflict, he will adjust his thinking accordingly.</p><p>The occupation will fail, but it will fail less disastrously and with less cost to the United States in prestige and blood if Donald Rumsfeld is in charge.  If nothing else, I suspect he is a man who will recognize when the situation becomes impossible and have the courage to change course.</p></div>",
  "content_text": "I agree with\nVDH\n.  The notion that Rumsfeld should resign over Abu Ghraib is absolutely absurd.  I think that the Secretary of Defense has done yeoman’s work in what I consider to be an impossible task, and although I believe the Iraqi occupation is doomed to ultimate failure, I have not forgotten the brilliant campaigns that conquered Afghanistan and Iraq in an amazingly short period of time.\nWhere Rumsfeld has been weak is in the areas not historically central to his responsibilities.  As he admitted, he hasn’t “been focused on the war of ideas, to be honest with you.”  That single comment reveals why he has not recognized the impossibility of the task he and the administration are undertaking.  The secretary is an intelligent man, and as it becomes increasingly clear that semiotics count more than soldiers in this particular conflict, he will adjust his thinking accordingly.\nThe occupation will fail, but it will fail less disastrously and with less cost to the United States in prestige and blood if Donald Rumsfeld is in charge.  If nothing else, I suspect he is a man who will recognize when the situation becomes impossible and have the courage to change course.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-14T14:06:00+00:00"
}