{
  "url": "https://voxday.net/2004/05/02/or-perhaps-its-all-trick/",
  "scraped_at": "2025-12-19T10:50:49.467734",
  "title": "Or perhaps it’s all a trick",
  "date_display": "May 2, 2004",
  "date_iso": "2004-05-02T16:24:00+00:00",
  "date_from_url": "2004-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bane forwards this response: “<a href=\"http://belmontclub.blogspot.com/2004_05_01_belmontclub_archive.html#108339754451957995\">A military iniative of the American Marines</a>“. Chalabi and Mahdi are worried about this bootless force not so much for what it is, but what it portends. Indeed, they might be forgiven for thinking that the sudden appearance of this Brigade is some kind of American trick, a reminder that Washington too can play the game of divide and conquer by dealing directly with local political figures and arming factions independent of the new Iraqi Army. The process being used to settle the parallel problem of Sadr’s Mahdi Army is an eerily similar combination of force and political negotiation.</p><p>Perhaps this game-playing will be more successful than the tactics that cost nearly as many fatalities in a month of occupation as were taken in the actual conquest itself.  I certainly hope so.  But if it is wrong to compare the Iraqi situation with Vietnam, it is equally wrong to attempt to equate it with the German or Japanese occupations.  I am quite sure that we would have either withdrawn or nuked either of the two defeated Axis nations had we taken as many casualties in the post-WWII occupation as we did in the conquest.</p><p>The American public is already disenchanted with the nation-building concept, and rightly so.  They signed on to take out Hussein and make sure there were no WMDs pointing in their direction.  Iraq is the responsibility of the Iraqi people, not the American people.  If they are going to simply fall into another dictatorship, so be it.  America itself is moving in that direction; I’d feel more optimistic if the same people promising freedom and liberty to Iraq were not working against it at home.</p></div>",
  "content_text": "Bane forwards this response: “\nA military iniative of the American Marines\n“. Chalabi and Mahdi are worried about this bootless force not so much for what it is, but what it portends. Indeed, they might be forgiven for thinking that the sudden appearance of this Brigade is some kind of American trick, a reminder that Washington too can play the game of divide and conquer by dealing directly with local political figures and arming factions independent of the new Iraqi Army. The process being used to settle the parallel problem of Sadr’s Mahdi Army is an eerily similar combination of force and political negotiation.\nPerhaps this game-playing will be more successful than the tactics that cost nearly as many fatalities in a month of occupation as were taken in the actual conquest itself.  I certainly hope so.  But if it is wrong to compare the Iraqi situation with Vietnam, it is equally wrong to attempt to equate it with the German or Japanese occupations.  I am quite sure that we would have either withdrawn or nuked either of the two defeated Axis nations had we taken as many casualties in the post-WWII occupation as we did in the conquest.\nThe American public is already disenchanted with the nation-building concept, and rightly so.  They signed on to take out Hussein and make sure there were no WMDs pointing in their direction.  Iraq is the responsibility of the Iraqi people, not the American people.  If they are going to simply fall into another dictatorship, so be it.  America itself is moving in that direction; I’d feel more optimistic if the same people promising freedom and liberty to Iraq were not working against it at home.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-02T15:24:00+00:00"
}