{
  "url": "https://voxday.net/2004/05/10/pointing-fingers/",
  "scraped_at": "2025-12-19T10:51:57.949289",
  "title": "Pointing fingers",
  "date_display": "May 10, 2004",
  "date_iso": "2004-05-10T07:23:00+00:00",
  "date_from_url": "2004-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“All over the country there are offices that look like newsrooms and there are people in those offices that look for all the world just like journalists, but <a href=\"http://www.dailyemerald.com/vnews/display.v/ART/2004/05/07/409bbfc0d5b00\">they are not practicing journalism</a>,” he said. “They regard the audience with a cold cynicism. They are practicing something I call a pseudo-journalism, and they view their audience as something to be manipulated.”  In a scathing critique of Fox News and some talk show hosts, such as Bill O’Reilly, Carroll said they were a “different breed of journalists” who misled their audience while claiming to inform them. He said they did not fit into the long legacy of journalists who got their facts right and respected and cared for their audiences.</p><p>One thing you can always count on is for the mainstream media to blame absolutely everyone and everything else for their declining quality and popularity except themselves.  Not one journalist in a hundred has any serious respect for his audience.  One editor at a major newspaper even came right out and told my syndicate that my column wouldn’t work in his paper because it would go over the head of his readership.  Please.  I wonder if that’s the message the paper’s sales staff is giving its advertisers?</p></div>",
  "content_text": "“All over the country there are offices that look like newsrooms and there are people in those offices that look for all the world just like journalists, but\nthey are not practicing journalism\n,” he said. “They regard the audience with a cold cynicism. They are practicing something I call a pseudo-journalism, and they view their audience as something to be manipulated.”  In a scathing critique of Fox News and some talk show hosts, such as Bill O’Reilly, Carroll said they were a “different breed of journalists” who misled their audience while claiming to inform them. He said they did not fit into the long legacy of journalists who got their facts right and respected and cared for their audiences.\nOne thing you can always count on is for the mainstream media to blame absolutely everyone and everything else for their declining quality and popularity except themselves.  Not one journalist in a hundred has any serious respect for his audience.  One editor at a major newspaper even came right out and told my syndicate that my column wouldn’t work in his paper because it would go over the head of his readership.  Please.  I wonder if that’s the message the paper’s sales staff is giving its advertisers?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-10T06:23:00+00:00"
}