{
  "url": "https://voxday.net/2004/05/04/post-mortem-assassination/",
  "scraped_at": "2025-12-19T10:51:13.200784",
  "title": "Post-mortem assassination",
  "date_display": "May 4, 2004",
  "date_iso": "2004-05-04T11:43:00+00:00",
  "date_from_url": "2004-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ted Rall, (also syndicated by UPS), has covered himself with slime <a href=\"http://www.evangelicaloutpost.com/archives/000605.html\">in impugning the reputation and memory of Pat Tillman</a>.  Even if all the points that Rall conjectures were true, this does not mean that the acting man should not be judged for the reasons he, and he alone, assigned to them.  Ted Rall may not believe that Pat Tillman was defending his country against terrorism, but Pat Tillman did, and so he died a hero.</p><p>I myself question the wisdom of the WWII tactic of island hopping – once naval superiority was established, why not bypass the garrisons and starve them out?  But this in no way lessens the incredible bravery of the US Marines, my grandfather among them, who stormed the beaches of Tarawa, Saipan and Iwo Jima.</p><p>Rall has always been an idiot sans talent.  He has now revealed himself to be a talentless and tasteless idiot, and one lacking in human decency.</p></div>",
  "content_text": "Ted Rall, (also syndicated by UPS), has covered himself with slime\nin impugning the reputation and memory of Pat Tillman\n.  Even if all the points that Rall conjectures were true, this does not mean that the acting man should not be judged for the reasons he, and he alone, assigned to them.  Ted Rall may not believe that Pat Tillman was defending his country against terrorism, but Pat Tillman did, and so he died a hero.\nI myself question the wisdom of the WWII tactic of island hopping – once naval superiority was established, why not bypass the garrisons and starve them out?  But this in no way lessens the incredible bravery of the US Marines, my grandfather among them, who stormed the beaches of Tarawa, Saipan and Iwo Jima.\nRall has always been an idiot sans talent.  He has now revealed himself to be a talentless and tasteless idiot, and one lacking in human decency.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-04T10:43:00+00:00"
}