{
  "url": "https://voxday.net/2004/05/08/profession-of-puffery/",
  "scraped_at": "2025-12-19T10:51:49.849602",
  "title": "The profession of puffery",
  "date_display": "May 8, 2004",
  "date_iso": "2004-05-08T11:29:00+00:00",
  "date_from_url": "2004-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> The [Gallup] poll suggests that only 21 percent of Americans believe journalists have high ethical standards, ranking them below auto mechanics but tied with members of Congress.  More precisely, the poll notes that <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=38398\">only one in four people believe what they read in the newspapers</a>. Chicago Tribune Editor Charles M. Madigan may have put it best when he offered this advice: “If you are a journalist, you should probably just assume that you come across as a liar.”</p><p>A 2004 study by the Project for Excellence in Journalism, part of Columbia University’s storied Graduate School of Journalism, underscores Madigan’s observation. “Since 1985, believability of the daily newspaper has fallen by a quarter, from 80 percent in 1985 to 59 percent in 2002,” notes the study, which includes data gathered by the Pew Research Center to form its conclusions. The study also points out that there has been a rapid decline in newspaper readership since the 1980s, with slightly more than half of Americans, 54 percent, reading a newspaper during the week. “The three television network news divisions and local news also saw significant drops from 1985, when they were all above 80 percent for believability,” the study reveals.</p><p>Why should anyone believe what they read in a newspaper or see in the news?  I’ve been part of ten or twelve news stories at the local level, both television and newspaper, and on every single occasion, there were significant errors of fact.  In the more recent cases, this happened in spite of my attempting to keep the details simple and straightforward.  Once, I counted five errors in a little three sentence blurb.</p><p>Journalism too often combines ignorance with arrogance.  It is a lethal combination, especially where the truth is concerned.  If the details do not fit the reporter’s preconception’s, all too often he’ll simply ignore them or attempt to spin them in a manner that makes no sense.  Journalism is not a profession, it is public relations for government and the two major political parties.  The people I knew who wanted to pursue journalism as a career were far more interested in getting their faces on television than they were in any romantic notions of truth or world-saving.  This is why I vehemently object to ever being described as a journalist instead of a writer.  I consider it an insult.</p><p>I’m not a journalist and I never will be.  As a technology entrepeneur, I work in the real world, more or less.  Writing an opinions column is just something I do for pleasure.  It’s not rocket science, and the fact that I’ve had any success at all only goes to show that Fred Reed was correct in stating that, for the most part, journalists are simply not all that bright.</p><p>Perhaps if newspapers would put the slightest attempt into making sure their journalists had even a vague clue regarding the subjects they’re covering, and removed people from writing about areas in which they’ve repeatedly demonstrated incompetence, those of us in the real world might take them more seriously.  Don’t hold your breath.</p></div>",
  "content_text": "The [Gallup] poll suggests that only 21 percent of Americans believe journalists have high ethical standards, ranking them below auto mechanics but tied with members of Congress.  More precisely, the poll notes that\nonly one in four people believe what they read in the newspapers\n. Chicago Tribune Editor Charles M. Madigan may have put it best when he offered this advice: “If you are a journalist, you should probably just assume that you come across as a liar.”\nA 2004 study by the Project for Excellence in Journalism, part of Columbia University’s storied Graduate School of Journalism, underscores Madigan’s observation. “Since 1985, believability of the daily newspaper has fallen by a quarter, from 80 percent in 1985 to 59 percent in 2002,” notes the study, which includes data gathered by the Pew Research Center to form its conclusions. The study also points out that there has been a rapid decline in newspaper readership since the 1980s, with slightly more than half of Americans, 54 percent, reading a newspaper during the week. “The three television network news divisions and local news also saw significant drops from 1985, when they were all above 80 percent for believability,” the study reveals.\nWhy should anyone believe what they read in a newspaper or see in the news?  I’ve been part of ten or twelve news stories at the local level, both television and newspaper, and on every single occasion, there were significant errors of fact.  In the more recent cases, this happened in spite of my attempting to keep the details simple and straightforward.  Once, I counted five errors in a little three sentence blurb.\nJournalism too often combines ignorance with arrogance.  It is a lethal combination, especially where the truth is concerned.  If the details do not fit the reporter’s preconception’s, all too often he’ll simply ignore them or attempt to spin them in a manner that makes no sense.  Journalism is not a profession, it is public relations for government and the two major political parties.  The people I knew who wanted to pursue journalism as a career were far more interested in getting their faces on television than they were in any romantic notions of truth or world-saving.  This is why I vehemently object to ever being described as a journalist instead of a writer.  I consider it an insult.\nI’m not a journalist and I never will be.  As a technology entrepeneur, I work in the real world, more or less.  Writing an opinions column is just something I do for pleasure.  It’s not rocket science, and the fact that I’ve had any success at all only goes to show that Fred Reed was correct in stating that, for the most part, journalists are simply not all that bright.\nPerhaps if newspapers would put the slightest attempt into making sure their journalists had even a vague clue regarding the subjects they’re covering, and removed people from writing about areas in which they’ve repeatedly demonstrated incompetence, those of us in the real world might take them more seriously.  Don’t hold your breath.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-08T10:29:00+00:00"
}