{
  "url": "https://voxday.net/2004/05/19/thats-what-happens-when-you-trus/",
  "scraped_at": "2025-12-19T20:28:28.477550",
  "title": "That’s what happens when you trust the state",
  "date_display": "May 19, 2004",
  "date_iso": "2004-05-19T06:57:00+00:00",
  "date_from_url": "2004-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Elsewhere in Massachusetts, a newborn baby recently was left on the doorstep of a Catholic church in Boston. The priest took in the baby girl, and immediately thought of a childless married couple in the church who were desperate to adopt. But when the priest called the social-services agency, the baby was shipped off to two homosexual men in the western part of the state. <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=38559\">By design</a>, this girl will never know a mother’s love.</p><p>I blame the priest.  This demonstrates precisely the problem of a crippled mentality conditioned to turn to the state for help.  He had the baby, he knew the couple, so, naturally, he called social services.  Stupid.  It’s like when you have ten dollars in your pocket, you see someone in need holding out his hand, and you proudly remind yourself that you’ve paid your taxes so you’ve done your part.</p><p>Never, ever expect the government to do the right thing.  It occasionally may, but the odds aren’t high.  If something needs doing, do it yourself.  Let the bureaucrats pick up the pieces and clean up the mess later, that’s all they’re capable of anyhow.</p></div>",
  "content_text": "Elsewhere in Massachusetts, a newborn baby recently was left on the doorstep of a Catholic church in Boston. The priest took in the baby girl, and immediately thought of a childless married couple in the church who were desperate to adopt. But when the priest called the social-services agency, the baby was shipped off to two homosexual men in the western part of the state.\nBy design\n, this girl will never know a mother’s love.\nI blame the priest.  This demonstrates precisely the problem of a crippled mentality conditioned to turn to the state for help.  He had the baby, he knew the couple, so, naturally, he called social services.  Stupid.  It’s like when you have ten dollars in your pocket, you see someone in need holding out his hand, and you proudly remind yourself that you’ve paid your taxes so you’ve done your part.\nNever, ever expect the government to do the right thing.  It occasionally may, but the odds aren’t high.  If something needs doing, do it yourself.  Let the bureaucrats pick up the pieces and clean up the mess later, that’s all they’re capable of anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-19T05:57:00+00:00"
}