{
  "url": "https://voxday.net/2004/05/05/this-is-good-news-2/",
  "scraped_at": "2025-12-19T10:51:20.594032",
  "title": "This is good news",
  "date_display": "May 5, 2004",
  "date_iso": "2004-05-05T12:47:00+00:00",
  "date_from_url": "2004-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=38320\">NOW, THEREFORE, BE IT RESOLVED</a> that the 2004 Annual Meeting of the Southern Baptist Convention encourages all officers and members of the Southern Baptist Convention and the churches associated with it to remove their children from the government schools and see to it that they receive a thoroughly Christian education, for the glory of God, the good of Christ’s church, and the strength of their own commitment to Jesus</p><p>I am so pleased to see that my church is making news, not for departures from Scripture and enthusiastic embrace of open sin, but for taking a powerful stand against the secular indoctrination and intellectual lobotomization of its children.  I enthusiastically support this resolution, and very few things would please me more than to see every child who belong to a family attending a Southern Baptist church leave the government school system.  This sends a powerful message to the would-be social architects of our society that the Christian church is not, in fact, dead, and that it will relentlessly oppose the pagan masters of empire, just as it did in the days of old Rome.</p><p>For indeed, “it is foolish for Christians to give their children to be trained in schools run by the enemies of God”.  This resolution may not pass on the first attempt, or even on the one-hundredth.  Even if it does, the extent of its impact will not be known for some time.  But it is good for freedom-lovers of all beliefs to know that a powerful organization is in the process of setting its face against one of the chief pillars of totalitarianism  In this, at least, there are signs that the tide may be beginning to turn.</p></div>",
  "content_text": "NOW, THEREFORE, BE IT RESOLVED\nthat the 2004 Annual Meeting of the Southern Baptist Convention encourages all officers and members of the Southern Baptist Convention and the churches associated with it to remove their children from the government schools and see to it that they receive a thoroughly Christian education, for the glory of God, the good of Christ’s church, and the strength of their own commitment to Jesus\nI am so pleased to see that my church is making news, not for departures from Scripture and enthusiastic embrace of open sin, but for taking a powerful stand against the secular indoctrination and intellectual lobotomization of its children.  I enthusiastically support this resolution, and very few things would please me more than to see every child who belong to a family attending a Southern Baptist church leave the government school system.  This sends a powerful message to the would-be social architects of our society that the Christian church is not, in fact, dead, and that it will relentlessly oppose the pagan masters of empire, just as it did in the days of old Rome.\nFor indeed, “it is foolish for Christians to give their children to be trained in schools run by the enemies of God”.  This resolution may not pass on the first attempt, or even on the one-hundredth.  Even if it does, the extent of its impact will not be known for some time.  But it is good for freedom-lovers of all beliefs to know that a powerful organization is in the process of setting its face against one of the chief pillars of totalitarianism  In this, at least, there are signs that the tide may be beginning to turn.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-05T11:47:00+00:00"
}