{
  "url": "https://voxday.net/2004/05/31/those-law-abiding-republicans/",
  "scraped_at": "2025-12-19T20:29:54.263687",
  "title": "Those law-abiding Republicans",
  "date_display": "May 31, 2004",
  "date_iso": "2004-05-31T10:43:00+00:00",
  "date_from_url": "2004-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Current [Illinois] law requires the Illinois Board of Elections to certify the names that will appear on the general election ballot 67 days before the election. This year that deadline is Aug. 27. But Bush will not be nominated until Sept. 1, when the GOP holds its national convention in New York City. Therefore, his name cannot legally appear on the ballot as a Republican unless the law is changed….</p><p>The proper solution, he [the executive director of the IL Libertarian Party] says, is for the board to insist that Bush’s name appear as an independent — as the law allows — or to ease ballot access for all political parties, not just the Republicans. Instead <a href=\"http://www.lp.org/lpnews/0405/illinois-ballot-access.html\">Republicans and Democrats are collaborating</a> to enact a new law that would carve out an exception only for Bush, which is “nothing less than favoritism and a mockery of the principles of democracy,” Trigg said. On March 25, the state Senate unanimously approved SB 2123, which would allow only Republicans and Democrats to be nominated after the deadline, while leaving the requirements the same for all other candidates.</p><p>Republicans and Democrats colluding?  Republicans ignoring the principle of equality before the law?  Will wonders never cease?  People, we will never, ever get Constitutional government by supporting individuals who are willing to commit these sort of shenanigans in the pursuit of political power.  Watch their actions before you give credence to their words.  One party with two factions is still a one-party system.</p></div>",
  "content_text": "Current [Illinois] law requires the Illinois Board of Elections to certify the names that will appear on the general election ballot 67 days before the election. This year that deadline is Aug. 27. But Bush will not be nominated until Sept. 1, when the GOP holds its national convention in New York City. Therefore, his name cannot legally appear on the ballot as a Republican unless the law is changed….\nThe proper solution, he [the executive director of the IL Libertarian Party] says, is for the board to insist that Bush’s name appear as an independent — as the law allows — or to ease ballot access for all political parties, not just the Republicans. Instead\nRepublicans and Democrats are collaborating\nto enact a new law that would carve out an exception only for Bush, which is “nothing less than favoritism and a mockery of the principles of democracy,” Trigg said. On March 25, the state Senate unanimously approved SB 2123, which would allow only Republicans and Democrats to be nominated after the deadline, while leaving the requirements the same for all other candidates.\nRepublicans and Democrats colluding?  Republicans ignoring the principle of equality before the law?  Will wonders never cease?  People, we will never, ever get Constitutional government by supporting individuals who are willing to commit these sort of shenanigans in the pursuit of political power.  Watch their actions before you give credence to their words.  One party with two factions is still a one-party system.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-31T09:43:00+00:00"
}