{
  "url": "https://voxday.net/2004/05/24/whatever-theyre-bringing-it-isn/",
  "scraped_at": "2025-12-19T20:29:04.760872",
  "title": "Whatever they’re bringing, it isn’t freedom",
  "date_display": "May 24, 2004",
  "date_iso": "2004-05-24T07:31:00+00:00",
  "date_from_url": "2004-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joseph Farah <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=38617\">writes on WND</a>: For more than 200 years, Americans have operated under the constitutionally protected principle that citizens have the right to defend themselves by bearing arms. Yet, right now, the United States is leading an effort to disarm the Iraqi populace – leaving them at the mercy of groups and individuals who will never willingly give up their guns or a future government that will rule over the people by force.</p><p>If we are trying to bring freedom to the Iraqi people, why are we attempting to disarm the populace and establish a strong central government?  How are they supposed to defend themselves against a future Hussein or Iranian invasion if they are helpless?  And if it’s such a good idea there, conservatives, do you support doing the same here as well?</p></div>",
  "content_text": "Joseph Farah\nwrites on WND\n: For more than 200 years, Americans have operated under the constitutionally protected principle that citizens have the right to defend themselves by bearing arms. Yet, right now, the United States is leading an effort to disarm the Iraqi populace – leaving them at the mercy of groups and individuals who will never willingly give up their guns or a future government that will rule over the people by force.\nIf we are trying to bring freedom to the Iraqi people, why are we attempting to disarm the populace and establish a strong central government?  How are they supposed to defend themselves against a future Hussein or Iranian invasion if they are helpless?  And if it’s such a good idea there, conservatives, do you support doing the same here as well?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-05-24T06:31:00+00:00"
}