{
  "url": "https://voxday.net/2019/08/27/a-change-to-the-caligan-campaign/",
  "scraped_at": "2025-12-21T02:55:56.648152",
  "title": "A change to the Caligan campaign",
  "date_display": "August 27, 2019",
  "date_iso": "2019-08-27T11:28:29+00:00",
  "date_from_url": "2019-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of the changes in the ebook market and our retreat from the Kindle Unlimited space, we’ve been making some strategic changes at Arkhaven and Castalia House. Now that we’ve successfully entered the video space, we’re concentrating our efforts on our strongest fiction and non-fiction properties, primarily because we don’t have the bandwidth to devote to everything.</p><p>This is why we’ve returned the publishing rights to their books to a number of our authors, although we continue to support them and their self-publishing efforts, and why we have methodically reduced the number of books that we are publishing. Our sales remain strong, which tends to indicate that our revised approach is a viable one.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://images-na.ssl-images-amazon.com/images/I/514qIRfX7eL.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"500\" data-original-width=\"334\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://images-na.ssl-images-amazon.com/images/I/514qIRfX7eL.jpg\" width=\"213\"/></a></div><p>The reason I’m explaining this is that we have decided to make a change to the comics being delivered to the backers of the Caligan campaign. Instead of six black-and-white issues of <i>The Stars Came Back</i>, we are going to publish six full-color digital issues of <i>Arts of Dark and Light</i>, a Selenoth-based comic, as well as the related paperback and hardcover omnibuses. We have not yet decided if we’ll be using one of the novellas, such as <i>The Wardog’s Coin</i> or a selection from <i>A Throne of Bones</i>, as the source.</p><p>I’ve already spoken to Rolf about this, and as those who know him will not be surprised to hear, he was entirely understanding of what we’re doing and why we’re doing it. We like Rolf and his work, and Castalia will continue to publish his print editions going forward.</p><p>Obviously, we will offer a refund to any backer who does not support this change of the third comic. Also, since the change from black-and-white to color will leave the overall project in the red, we will be offering presales of the paperback and the hardcover once we have completed the first digital issue and delivered it to the backers. Please note that any campaign backer who wishes a refund as a result of this announcement can simply email me with the backer number and the word REFUND in the subject.</p><p>And for those who don’t object to the change, feel free to discuss which of the various Selenoth stories you’d most like to see in graphic format here. If we decide upon a selection from <i>A Throne of Bones</i>, it will probably be the battle between Legio XVII and the goblin tribes.</p></div>",
  "content_text": "In light of the changes in the ebook market and our retreat from the Kindle Unlimited space, we’ve been making some strategic changes at Arkhaven and Castalia House. Now that we’ve successfully entered the video space, we’re concentrating our efforts on our strongest fiction and non-fiction properties, primarily because we don’t have the bandwidth to devote to everything.\nThis is why we’ve returned the publishing rights to their books to a number of our authors, although we continue to support them and their self-publishing efforts, and why we have methodically reduced the number of books that we are publishing. Our sales remain strong, which tends to indicate that our revised approach is a viable one.\nThe reason I’m explaining this is that we have decided to make a change to the comics being delivered to the backers of the Caligan campaign. Instead of six black-and-white issues of\nThe Stars Came Back\n, we are going to publish six full-color digital issues of\nArts of Dark and Light\n, a Selenoth-based comic, as well as the related paperback and hardcover omnibuses. We have not yet decided if we’ll be using one of the novellas, such as\nThe Wardog’s Coin\nor a selection from\nA Throne of Bones\n, as the source.\nI’ve already spoken to Rolf about this, and as those who know him will not be surprised to hear, he was entirely understanding of what we’re doing and why we’re doing it. We like Rolf and his work, and Castalia will continue to publish his print editions going forward.\nObviously, we will offer a refund to any backer who does not support this change of the third comic. Also, since the change from black-and-white to color will leave the overall project in the red, we will be offering presales of the paperback and the hardcover once we have completed the first digital issue and delivered it to the backers. Please note that any campaign backer who wishes a refund as a result of this announcement can simply email me with the backer number and the word REFUND in the subject.\nAnd for those who don’t object to the change, feel free to discuss which of the various Selenoth stories you’d most like to see in graphic format here. If we decide upon a selection from\nA Throne of Bones\n, it will probably be the battle between Legio XVII and the goblin tribes.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-27T10:28:29+00:00"
}