{
  "url": "https://voxday.net/2019/08/30/a-tradition-of-sex-trafficking/",
  "scraped_at": "2025-12-21T02:56:21.641403",
  "title": "A tradition of sex trafficking",
  "date_display": "August 30, 2019",
  "date_iso": "2019-08-30T12:00:04+00:00",
  "date_from_url": "2019-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Epstein revelations are not exactly the first time a large-scale sex trafficking operation that involved high-ranking officials has operated for more than a decade, <a href=\"http://www.unz.com/gatzmon/jeffrey-zwi-epstein-migdal/\">as evidenced by a massive sex trafficking ring</a> that ran for eighty years until WWII:</p><blockquote><p>The Zwi Migdal organization operated from the 1860s to 1939. In its heyday, after the First World War, it had four hundred members in Argentina alone. Its annual turnover was fifty million dollars in the early 1900s.</p><p>Unlike Epstein and Maxwell who allegedly recruited non-Jewish underage women, the Zwi Migdal specialised in trafficking Jewish women. “Most of the Jewish women and children who were kidnapped were taken from impoverished shtetls (Jewish small towns) and brought to Buenos Aires.”</p><p>The recently released documents related to the Jeffrey Epstein affair suggest that Epstein and Maxwell were to be charged with child sex trafficking, and as the alleged procurer of underage girls. It seems none of that is really novel in the Jewish world: “The Zwi Migdal Society lured decent girls and young women from Europe in many inventive and deceitful ways. A very well-mannered and elegant-looking man would appear in a poor Jewish village in places such as Poland or Russia. He would advertise his search for young women to work in the homes of wealthy Jews in Argentina by posting an ad in the local synagogue. Fearful of pogroms and often in desperate economic circumstances, the trusting parents would send their naïve daughters away with these men, hoping to give them a fresh start.”</p><p>Many commentators on the Epstein affair are amazed by the incapacity of America’s law enforcement, legal system and federal agencies to bring justice to Epstein’s victims and its failure to lock him away. Once again, that is not new. The JCACA writes of the Zwi Migdal criminality: “These activities went on undisturbed because they were frequented by government officials, judges, and reporters. City officials, politicians, and police officers were paid off. The pimps had powerful connections everywhere.”</p></blockquote><p>Now that Muslims have entered the West, we’re seeing the same pattern playing out repeatedly across the UK, and almost certainly, the USA. And it’s often done through organizations disguised as those nominally intended <a href=\"https://m.theepochtimes.com/a-failure-of-trust-child-molestation-in-the-contra-costa-cps_3058888.html\">to help the very victims being preyed upon</a>:</p><blockquote><p>The Contra Costa County Department of Children and Family Services (CFS, or CPS) in California appears to have a problem with the sexual abuse of children.</p><p>The Epoch Times interviewed whistleblower parents, children, and a mental health professional in the county who say children are being sexually abused within a system that is meant to protect them.</p><p>In July, a father–son duo, Simon Mendoza Chavez, 64, and Simon Magana Chavez, 31, in the Contra Costa County city of Antioch were arrested on charges of committing multiple crimes during their years-long tenure as foster parents, according to a little-publicized police department release.</p><p>“On 6-13-19, members of the Antioch Police Department began investigating an extensive sexual abuse case. The abuse involved several minors that were victimized by a father and son who provided foster care for the children from 2011 through 2017,” the Antioch police department stated in the release.</p></blockquote></div>",
  "content_text": "The Epstein revelations are not exactly the first time a large-scale sex trafficking operation that involved high-ranking officials has operated for more than a decade,\nas evidenced by a massive sex trafficking ring\nthat ran for eighty years until WWII:\nThe Zwi Migdal organization operated from the 1860s to 1939. In its heyday, after the First World War, it had four hundred members in Argentina alone. Its annual turnover was fifty million dollars in the early 1900s.\nUnlike Epstein and Maxwell who allegedly recruited non-Jewish underage women, the Zwi Migdal specialised in trafficking Jewish women. “Most of the Jewish women and children who were kidnapped were taken from impoverished shtetls (Jewish small towns) and brought to Buenos Aires.”\nThe recently released documents related to the Jeffrey Epstein affair suggest that Epstein and Maxwell were to be charged with child sex trafficking, and as the alleged procurer of underage girls. It seems none of that is really novel in the Jewish world: “The Zwi Migdal Society lured decent girls and young women from Europe in many inventive and deceitful ways. A very well-mannered and elegant-looking man would appear in a poor Jewish village in places such as Poland or Russia. He would advertise his search for young women to work in the homes of wealthy Jews in Argentina by posting an ad in the local synagogue. Fearful of pogroms and often in desperate economic circumstances, the trusting parents would send their naïve daughters away with these men, hoping to give them a fresh start.”\nMany commentators on the Epstein affair are amazed by the incapacity of America’s law enforcement, legal system and federal agencies to bring justice to Epstein’s victims and its failure to lock him away. Once again, that is not new. The JCACA writes of the Zwi Migdal criminality: “These activities went on undisturbed because they were frequented by government officials, judges, and reporters. City officials, politicians, and police officers were paid off. The pimps had powerful connections everywhere.”\nNow that Muslims have entered the West, we’re seeing the same pattern playing out repeatedly across the UK, and almost certainly, the USA. And it’s often done through organizations disguised as those nominally intended\nto help the very victims being preyed upon\n:\nThe Contra Costa County Department of Children and Family Services (CFS, or CPS) in California appears to have a problem with the sexual abuse of children.\nThe Epoch Times interviewed whistleblower parents, children, and a mental health professional in the county who say children are being sexually abused within a system that is meant to protect them.\nIn July, a father–son duo, Simon Mendoza Chavez, 64, and Simon Magana Chavez, 31, in the Contra Costa County city of Antioch were arrested on charges of committing multiple crimes during their years-long tenure as foster parents, according to a little-publicized police department release.\n“On 6-13-19, members of the Antioch Police Department began investigating an extensive sexual abuse case. The abuse involved several minors that were victimized by a father and son who provided foster care for the children from 2011 through 2017,” the Antioch police department stated in the release.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-30T11:00:04+00:00"
}