{
  "url": "https://voxday.net/2019/08/28/boris-drops-a-bomb-on-parliament/",
  "scraped_at": "2025-12-21T02:56:09.197262",
  "title": "Boris drops a bomb on Parliament",
  "date_display": "August 28, 2019",
  "date_iso": "2019-08-28T18:12:31+00:00",
  "date_from_url": "2019-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s rather rich seeing the Remainers who have exploited every technical loophole and invented a few from scratch complaining about Prime Minister Boris Johnson <a href=\"https://www.dailymail.co.uk/news/article-7402153/Boris-Johnson-today-ask-Queen-suspend-Parliament.html\">utilizing a time-hallowed one</a> to ensure Brexit is not delayed a second time:</p><blockquote><p>‘As I said on the steps of Downing Street, we are not going to wait until October 31 before getting on with our plans to take this country forward.</p><p>‘And this is a new Government with a very exciting agenda to make our streets safer – it’s very important we bring violent crime down;we need to invest in our fantastic NHS; we need to level up education funding across the country; we need to invest in the infrastructure that’s going to take this country forward for decades; and we need to deal with the cost of living, moving to a high-wage, high-productivity economy, which is, I think, what this country needs to be.</p><p>‘And to do that, we need new legislation, we’ve got to be bringing forward new and important Bills, and that’s why we are going to have a Queen’s Speech and we’re going to do it on October 14 and we’ve got to move ahead now with a new legislative programme.’</p><p>When it was put to Mr Johnson that his critics will say proroguing Parliament is an insult to democracy and a way to deny MPs’ time to stop a chaotic split from the EU on October 31, the Prime Minister said: ‘That is completely untrue. If you look at what we’re doing, we’re bringing forward a new legislative programme on crime, on hospitals, and making sure that we have the education funding that we need.</p><p>‘And there will be ample time on both sides of that crucial October 17 summit, ample time in Parliament for MPs to debate the EU, to debate Brexit, and all the other issues. Ample time.’</p><p>Asked whether he was planning a general election before the end of the year, Mr Johnson said: ‘No. What you should take from this is we’re doing exactly what I said on the steps of Downing Street, which is that we must get on now with our legislative domestic agenda.</p><p>‘People will expect… I need to… we need to get on with the stuff that Parliament needs to approve on tackling crime, on building the infrastructure we need, on technology, on levelling up our education, and reducing the cost of living.</p><p>‘That is why we need a Queen’s Speech, and we’re going to get on with it.’</p><p>Asked what he would say to members of the public who may be concerned, the PM said: ‘We need to get on with our domestic agenda and that’s why we’re announcing a Queen’s Speech for October 14.’</p></blockquote><p>Despite all their whining about democracy, the Remainers are loathe to take the obvious tactic that remains to them, which is a no-confidence vote that would trigger a new election. They don’t dare utilize it because they know that a pro-Brexit Parliament would replace them. Their dilemma is that they have neither the spirit nor the letter of the law on their side.</p><p>All they’ve got is the media. And it’s worth noting that the current Parliamentary session is the longest in British history, so proroguing it is arguably overdue. And note that the Prime Minister’s action is a response to the other parties publicly embracing a plan that <i>requires </i>the Commons Speaker to break the rules of the Parliament.</p><p><b>UPDATE: </b>The Queen AGREES to suspend Parliament</p></div>",
  "content_text": "It’s rather rich seeing the Remainers who have exploited every technical loophole and invented a few from scratch complaining about Prime Minister Boris Johnson\nutilizing a time-hallowed one\nto ensure Brexit is not delayed a second time:\n‘As I said on the steps of Downing Street, we are not going to wait until October 31 before getting on with our plans to take this country forward.\n‘And this is a new Government with a very exciting agenda to make our streets safer – it’s very important we bring violent crime down;we need to invest in our fantastic NHS; we need to level up education funding across the country; we need to invest in the infrastructure that’s going to take this country forward for decades; and we need to deal with the cost of living, moving to a high-wage, high-productivity economy, which is, I think, what this country needs to be.\n‘And to do that, we need new legislation, we’ve got to be bringing forward new and important Bills, and that’s why we are going to have a Queen’s Speech and we’re going to do it on October 14 and we’ve got to move ahead now with a new legislative programme.’\nWhen it was put to Mr Johnson that his critics will say proroguing Parliament is an insult to democracy and a way to deny MPs’ time to stop a chaotic split from the EU on October 31, the Prime Minister said: ‘That is completely untrue. If you look at what we’re doing, we’re bringing forward a new legislative programme on crime, on hospitals, and making sure that we have the education funding that we need.\n‘And there will be ample time on both sides of that crucial October 17 summit, ample time in Parliament for MPs to debate the EU, to debate Brexit, and all the other issues. Ample time.’\nAsked whether he was planning a general election before the end of the year, Mr Johnson said: ‘No. What you should take from this is we’re doing exactly what I said on the steps of Downing Street, which is that we must get on now with our legislative domestic agenda.\n‘People will expect… I need to… we need to get on with the stuff that Parliament needs to approve on tackling crime, on building the infrastructure we need, on technology, on levelling up our education, and reducing the cost of living.\n‘That is why we need a Queen’s Speech, and we’re going to get on with it.’\nAsked what he would say to members of the public who may be concerned, the PM said: ‘We need to get on with our domestic agenda and that’s why we’re announcing a Queen’s Speech for October 14.’\nDespite all their whining about democracy, the Remainers are loathe to take the obvious tactic that remains to them, which is a no-confidence vote that would trigger a new election. They don’t dare utilize it because they know that a pro-Brexit Parliament would replace them. Their dilemma is that they have neither the spirit nor the letter of the law on their side.\nAll they’ve got is the media. And it’s worth noting that the current Parliamentary session is the longest in British history, so proroguing it is arguably overdue. And note that the Prime Minister’s action is a response to the other parties publicly embracing a plan that\nrequires\nthe Commons Speaker to break the rules of the Parliament.\nUPDATE:\nThe Queen AGREES to suspend Parliament",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-28T17:12:31+00:00"
}