{
  "url": "https://voxday.net/2019/08/24/declaring-a-war-that-is-already-lost/",
  "scraped_at": "2025-12-21T02:55:38.687090",
  "title": "Declaring a war that is already lost",
  "date_display": "August 24, 2019",
  "date_iso": "2019-08-24T12:39:16+00:00",
  "date_from_url": "2019-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jeff Goldstein is not only a liar, he’s an utterly inept one at that. And he has been <a href=\"https://thefederalist.com/2016/09/06/alt-right-mirror-image-new-left/\">for years</a>.</p><blockquote class=\"tr_bq\"><p>Vox Day says the alt-right is conservative. It’s actually an identity movement on par with Black Lives Matter, La Raza, the Council on American-Islamic Relations, and other products of cultural Marxism.</p></blockquote><p>Notice that Goldstein falsely claims I said <i>the precise opposite</i> of what I actually wrote in the very first two points of the manifesto to which he refers. Also, recall that identity politics are a superset of cultural Marxism, and that they long predate Marx, Gramsci, and the Frankfurt School.</p><ol><li><i>The Alt Right is of the political right in both the American and the European sense of the term. Socialists are not Alt Right. Progressives are not Alt Right. Liberals are not Alt Right. Communists, Marxists, Marxians, cultural Marxists, and neocons are not Alt Right. National Socialists are not Alt Right.</i></li><li><i>The Alt Right is an ALTERNATIVE to the mainstream conservative movement in the USA that is nominally encapsulated by Russel Kirk’s 10 Conservative Principles, but in reality has devolved towards progressivism. It is also an alternative to libertarianism.</i></li></ol><p>There is nothing conservative about the Alt Right, or as we more accurately describe it now in response to the authorized media’s successful attempts to redefine and delegitimize the term, <b>the Nationalist Right</b>. Conservativism is nothing more than a defeatist posture of continual retreat, and the Nationalist Right is a coherent political philosophy that entirely rejects both conservatism and conservatives.</p><p>Indeed, the neoclowns even had to coin a brand new term, “National Conservatives”, in order to present a defeatist skinsuit identity that could potentially pass for the real thing. But we reject National Conservatives just as we reject all conservatives and conservatisms. And as for me, I have <u>NEVER</u> been a conservative and <a href=\"http://voxday.blogspot.com/2016/06/still-not-conservative.html\">I have always been very clear about that</a>.</p><p><b>April 12, 2006</b><br>I am not a conservative and have not been for many years, but I don’t think anyone, on the Right or Left, would deny that I am a hard-core right winger.</br></p><p><b>September 24, 2007</b><br>Because I’m not a conservative, I don’t fit what the conservative media are selling, so they stick to their tried-and-true formulas even though my columns repeatedly prove more popular than the usual grist for the mill.</br></p><p><b>September 30, 2010</b><br>I am not a conservative. I am a Christian libertarian technodemocrat. But if this is what is actually supposed to pass for conservative opinion leadership at a leading conservative publication, it’s no wonder that the Tea Partiers are abandoning both the Republican Party and the conservative media.</br></p><p><b>January 30, 2013</b><br>I am not a phony conservative, or indeed, a conservative of any kind.</br></p><p><b>June 9, 2016</b><br>I am not a conservative and I have long had to correct those who mistakenly believed I was.</br></p><p>Anyhow, three years later, Goldstein <a href=\"https://proteinwisdom.com/?p=58664\">is still doubling down</a> on his false and outdated perspective:</p><blockquote><p>3 yrs ago, writing in The Federalist, I noted how the left’s embrace — and political deployment — of identity politics had given rise to, and a perverse justification for (in its own hive mind), white supremacy, a blunt rejection of the collective call by the left and academia to demonize whiteness.</p><p>I pored over &amp; unpacked the “alt-right manifesto” of an influential “thought leader” of the movement and found what was easily recognizable: a progressive strain placing it on par with La Raza, BLM, CAIR, and Occupy (now Antifa). Essentially, Farrakhanism in a bed sheet.</p><p>The El Paso shooter, if we believe his manifesto, is for all intents and purposes, a confused National Socialist. He trafficked in identity and grievance politics while supporting much of the Green New Deal. He railed against capitalism and jobs lost to automation. He’s a leftist — as were the Nazis — who found himself part of an unprotected class; the Dayton shooter supported, in addition to Elizabeth Warren and Bernie Sanders, Antifa, which may have actually provided him gun tips in advance of his eventual spree killing. He, too, was a leftist.</p><p>Which is why conservatives should deplore all identity and grievance politics, regardless of the color it takes. Intersectionality, however, is the left’s stock and trade, from the academy to the media to Hollywood. Until that is marginalized, you won’t kill white supremacy, despite pleadings by the editors at National Review.</p><p>And here’s why: Many of the motivations of the white supremacist movement, which Vox Day couched as “alt-right” in his alt-right “manifesto,” were predictable and — again, however perversely — understandable: in a political and cultural ethos wherein white straight Christian males have become one of the last “identity groups” eligible for collective hostility and scapegoating, there was bound to be defensive push-back. In my piece I commiserated with some of the alt-right’s concerns while rejecting its underlying philosophy; I counseled the rejection of all identity politics and intersectionality, suggesting instead a return to founding principals: constitutionalism, federalism, republicanism, the rule of law, assimilation, and — most crucially —individualism and individual rights and autonomy….</p><p>We are a country of individuals. We need to act like it. It’s time to declare war on identity politics.</p></blockquote><p>Let conservatives reject identity politics if they like. Who cares what conservatives do, say, or think anymore? They didn’t conserve America. They didn’t conserve the ladies room. <i>They couldn’t even conserve the two human sexes!</i> And they won’t be able to conserve indoor plumbing either. As for declaring war on identity politics, in 2019 that is like declaring war on gravity, or more to the point, declaring war on Alexander the Great on behalf of King Darius III of the Achaemenid Empire.</p><p>That war is already over. That war is already lost.</p><p>Counseling American Christians to return to principles that literally none of their rival identity groups accept is not merely idiotic, it is completely irrelevant. The literally satanic ideology of the individual is now as dead as the Whig Party and the Yangtze River dolphin, and no one is going to be able to revive it in a time when material identity has replaced abstract ideology.</p><p><b>Conservatives:</b> I will not risk open identity politics.</p><p><b>Nationalists: </b>Identity politics is upon you whether you would risk it or not.</p><p>Conservatives had better come to terms with accepting the reality of identity politics very, very soon, because what comes next is what Clausewitz would have called identity politics by other means.</p></div>",
  "content_text": "Jeff Goldstein is not only a liar, he’s an utterly inept one at that. And he has been\nfor years\n.\nVox Day says the alt-right is conservative. It’s actually an identity movement on par with Black Lives Matter, La Raza, the Council on American-Islamic Relations, and other products of cultural Marxism.\nNotice that Goldstein falsely claims I said\nthe precise opposite\nof what I actually wrote in the very first two points of the manifesto to which he refers. Also, recall that identity politics are a superset of cultural Marxism, and that they long predate Marx, Gramsci, and the Frankfurt School.\nThe Alt Right is of the political right in both the American and the European sense of the term. Socialists are not Alt Right. Progressives are not Alt Right. Liberals are not Alt Right. Communists, Marxists, Marxians, cultural Marxists, and neocons are not Alt Right. National Socialists are not Alt Right.\nThe Alt Right is an ALTERNATIVE to the mainstream conservative movement in the USA that is nominally encapsulated by Russel Kirk’s 10 Conservative Principles, but in reality has devolved towards progressivism. It is also an alternative to libertarianism.\nThere is nothing conservative about the Alt Right, or as we more accurately describe it now in response to the authorized media’s successful attempts to redefine and delegitimize the term,\nthe Nationalist Right\n. Conservativism is nothing more than a defeatist posture of continual retreat, and the Nationalist Right is a coherent political philosophy that entirely rejects both conservatism and conservatives.\nIndeed, the neoclowns even had to coin a brand new term, “National Conservatives”, in order to present a defeatist skinsuit identity that could potentially pass for the real thing. But we reject National Conservatives just as we reject all conservatives and conservatisms. And as for me, I have\nNEVER\nbeen a conservative and\nI have always been very clear about that\n.\nApril 12, 2006\nI am not a conservative and have not been for many years, but I don’t think anyone, on the Right or Left, would deny that I am a hard-core right winger.\nSeptember 24, 2007\nBecause I’m not a conservative, I don’t fit what the conservative media are selling, so they stick to their tried-and-true formulas even though my columns repeatedly prove more popular than the usual grist for the mill.\nSeptember 30, 2010\nI am not a conservative. I am a Christian libertarian technodemocrat. But if this is what is actually supposed to pass for conservative opinion leadership at a leading conservative publication, it’s no wonder that the Tea Partiers are abandoning both the Republican Party and the conservative media.\nJanuary 30, 2013\nI am not a phony conservative, or indeed, a conservative of any kind.\nJune 9, 2016\nI am not a conservative and I have long had to correct those who mistakenly believed I was.\nAnyhow, three years later, Goldstein\nis still doubling down\non his false and outdated perspective:\n3 yrs ago, writing in The Federalist, I noted how the left’s embrace — and political deployment — of identity politics had given rise to, and a perverse justification for (in its own hive mind), white supremacy, a blunt rejection of the collective call by the left and academia to demonize whiteness.\nI pored over & unpacked the “alt-right manifesto” of an influential “thought leader” of the movement and found what was easily recognizable: a progressive strain placing it on par with La Raza, BLM, CAIR, and Occupy (now Antifa). Essentially, Farrakhanism in a bed sheet.\nThe El Paso shooter, if we believe his manifesto, is for all intents and purposes, a confused National Socialist. He trafficked in identity and grievance politics while supporting much of the Green New Deal. He railed against capitalism and jobs lost to automation. He’s a leftist — as were the Nazis — who found himself part of an unprotected class; the Dayton shooter supported, in addition to Elizabeth Warren and Bernie Sanders, Antifa, which may have actually provided him gun tips in advance of his eventual spree killing. He, too, was a leftist.\nWhich is why conservatives should deplore all identity and grievance politics, regardless of the color it takes. Intersectionality, however, is the left’s stock and trade, from the academy to the media to Hollywood. Until that is marginalized, you won’t kill white supremacy, despite pleadings by the editors at National Review.\nAnd here’s why: Many of the motivations of the white supremacist movement, which Vox Day couched as “alt-right” in his alt-right “manifesto,” were predictable and — again, however perversely — understandable: in a political and cultural ethos wherein white straight Christian males have become one of the last “identity groups” eligible for collective hostility and scapegoating, there was bound to be defensive push-back. In my piece I commiserated with some of the alt-right’s concerns while rejecting its underlying philosophy; I counseled the rejection of all identity politics and intersectionality, suggesting instead a return to founding principals: constitutionalism, federalism, republicanism, the rule of law, assimilation, and — most crucially —individualism and individual rights and autonomy….\nWe are a country of individuals. We need to act like it. It’s time to declare war on identity politics.\nLet conservatives reject identity politics if they like. Who cares what conservatives do, say, or think anymore? They didn’t conserve America. They didn’t conserve the ladies room.\nThey couldn’t even conserve the two human sexes!\nAnd they won’t be able to conserve indoor plumbing either. As for declaring war on identity politics, in 2019 that is like declaring war on gravity, or more to the point, declaring war on Alexander the Great on behalf of King Darius III of the Achaemenid Empire.\nThat war is already over. That war is already lost.\nCounseling American Christians to return to principles that literally none of their rival identity groups accept is not merely idiotic, it is completely irrelevant. The literally satanic ideology of the individual is now as dead as the Whig Party and the Yangtze River dolphin, and no one is going to be able to revive it in a time when material identity has replaced abstract ideology.\nConservatives:\nI will not risk open identity politics.\nNationalists:\nIdentity politics is upon you whether you would risk it or not.\nConservatives had better come to terms with accepting the reality of identity politics very, very soon, because what comes next is what Clausewitz would have called identity politics by other means.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-24T11:39:16+00:00"
}