{
  "url": "https://voxday.net/2019/08/12/imagine-what-we-could-do/",
  "scraped_at": "2025-12-21T02:54:08.565279",
  "title": "Imagine what we could do",
  "date_display": "August 12, 2019",
  "date_iso": "2019-08-12T12:10:24+00:00",
  "date_from_url": "2019-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I did the math. And if you want to win the culture war, here is one way to go about doing just that, given <a href=\"https://variety.com/2017/tv/news/tv-series-budgets-costs-rising-peak-tv-1202570158/\">the inflated price</a> of Hollywood content.</p><blockquote><p>The estimates on the cost of content that emerged from these interviews peg the typical range of the production budget for high-end cable and streaming dramas at $5 million-$7 million an hour, while single-camera half hours on broadcast and cable run from $1.5 million to more than $3 million. With the exception of HBO, which made its mark with lavish productions, that’s a significant increase, during just the past five years, over what had been $3 million-$4 million for cable dramas and around $1 million-$1.5 million for single-camera half hours.</p><p>And Netflix often exceeds the new, higher averages. The first season of its supernatural sensation “Stranger Things” was shot to look like a 1980s Steven Spielberg movie and came with a price tag of $6 million an episode for season one, rising to $8 million in season two. Netflix’s sumptuous period drama “The Crown” cost an estimated $10 million an episode.</p><p>Bigger, bolder production values aren’t the only expense; talent also costs a pretty penny.</p><p>Netflix raised eyebrows with a $2 million-per-episode guarantee to lure David Letterman back to TV for a six-episode interview series that’s expected to bow next year.</p><p><i>Clockwise from left: “The Get Down” – $11m per episode; “Legion” – $4m per episode; “Timeless” – $4.5m per episode.</i></p><p>There’s a pervasive fear among traditional TV players that Netflix’s spending binge on content is an effort to vacuum up market share and put a lot of old-school competitors out of business. That, industry veterans say, is the only explanation for the streaming giant paying $20 million to Chris Rock and Ellen DeGeneres for comedy specials — fees that are more than double the high end for that programming on HBO just a few years ago.</p><p>But Netflix is far from alone in its aggressive spending. All the streaming services are ponying up bigger upfront commitments and budgets, raising floor prices for all networks. Amazon is laying out $8 million on action drama “Jack Ryan” and $5 million per half hour for “The Tick,” the superhero comedy with lots of visual-effects shots that also films largely on location in pricey New York. Robert De Niro is getting approximately $775,000 an episode to star in a David O. Russell crime drama for Amazon.</p><p>Cable networks are stretching their wallets too. HBO’s VFX-heavy “Westworld” is in the same lofty budgetary stratum as “The Crown.” Season one of Starz’s “American Gods” came in at more than $8 million per episode. TNT’s one-and-done period drama “Will” required $5 million-$6 million an episode, even though it was shot in Wales with mostly up-and-coming actors. FX usually spends about $3.5 million-$4 million per hour on its dramas. Ryan Murphy’s “American Crime Story” franchise is closer to $6 million.<br>For broadcast networks, the high end is roughly $4.5 million (with most shows coming in about $1 million below that).</br></p></blockquote><p>That’s about $3.4 million more per episode than is actually necessary in most cases.</p><p>Now consider this. Owen regularly gets 50,000 views per livestream. I regularly get 12,000 views per livestream. Even if we assume that fully half my views are Bears, that gives us 56,000 viewers. Next, imagine that all of those 56,000 viewers were willing to subscribe to a Basic subscription on Unauthorized. That’s the price of two Caramel Frappuccino Ventis at Starbucks <i>per month</i>.</p><p>That would be over $500,000 per month we could spend on producing original content for everyone. We estimate that we could do a <i>Little House on the Prairie</i>-caliber television show, a comedy starring Owen as one half of an urban couple who moves to the country, for about $50k per episode. In other words, if we can get five thousand more Basic subscribers before the end of 2019, we will create a high-quality half-hour television show that does not hate you or seek to destroy your faith, your family, and your country. We will create something that will not only entertain, but inspire, you and your family.</p><p>We can do it. Seriously. In fact, we’re currently putting together a professionally filmed comedy special that will be considerably funnier than Chris Rock’s – or Ellen’s, although that was obvious – for approximately <i>one-tenth of one percent </i>of their budgets. So, think about it. And then <a href=\"https://www.unauthorized.tv/join\">join Unauthorized</a>.</p></div>",
  "content_text": "I did the math. And if you want to win the culture war, here is one way to go about doing just that, given\nthe inflated price\nof Hollywood content.\nThe estimates on the cost of content that emerged from these interviews peg the typical range of the production budget for high-end cable and streaming dramas at $5 million-$7 million an hour, while single-camera half hours on broadcast and cable run from $1.5 million to more than $3 million. With the exception of HBO, which made its mark with lavish productions, that’s a significant increase, during just the past five years, over what had been $3 million-$4 million for cable dramas and around $1 million-$1.5 million for single-camera half hours.\nAnd Netflix often exceeds the new, higher averages. The first season of its supernatural sensation “Stranger Things” was shot to look like a 1980s Steven Spielberg movie and came with a price tag of $6 million an episode for season one, rising to $8 million in season two. Netflix’s sumptuous period drama “The Crown” cost an estimated $10 million an episode.\nBigger, bolder production values aren’t the only expense; talent also costs a pretty penny.\nNetflix raised eyebrows with a $2 million-per-episode guarantee to lure David Letterman back to TV for a six-episode interview series that’s expected to bow next year.\nClockwise from left: “The Get Down” – $11m per episode; “Legion” – $4m per episode; “Timeless” – $4.5m per episode.\nThere’s a pervasive fear among traditional TV players that Netflix’s spending binge on content is an effort to vacuum up market share and put a lot of old-school competitors out of business. That, industry veterans say, is the only explanation for the streaming giant paying $20 million to Chris Rock and Ellen DeGeneres for comedy specials — fees that are more than double the high end for that programming on HBO just a few years ago.\nBut Netflix is far from alone in its aggressive spending. All the streaming services are ponying up bigger upfront commitments and budgets, raising floor prices for all networks. Amazon is laying out $8 million on action drama “Jack Ryan” and $5 million per half hour for “The Tick,” the superhero comedy with lots of visual-effects shots that also films largely on location in pricey New York. Robert De Niro is getting approximately $775,000 an episode to star in a David O. Russell crime drama for Amazon.\nCable networks are stretching their wallets too. HBO’s VFX-heavy “Westworld” is in the same lofty budgetary stratum as “The Crown.” Season one of Starz’s “American Gods” came in at more than $8 million per episode. TNT’s one-and-done period drama “Will” required $5 million-$6 million an episode, even though it was shot in Wales with mostly up-and-coming actors. FX usually spends about $3.5 million-$4 million per hour on its dramas. Ryan Murphy’s “American Crime Story” franchise is closer to $6 million.\nFor broadcast networks, the high end is roughly $4.5 million (with most shows coming in about $1 million below that).\nThat’s about $3.4 million more per episode than is actually necessary in most cases.\nNow consider this. Owen regularly gets 50,000 views per livestream. I regularly get 12,000 views per livestream. Even if we assume that fully half my views are Bears, that gives us 56,000 viewers. Next, imagine that all of those 56,000 viewers were willing to subscribe to a Basic subscription on Unauthorized. That’s the price of two Caramel Frappuccino Ventis at Starbucks\nper month\n.\nThat would be over $500,000 per month we could spend on producing original content for everyone. We estimate that we could do a\nLittle House on the Prairie\n-caliber television show, a comedy starring Owen as one half of an urban couple who moves to the country, for about $50k per episode. In other words, if we can get five thousand more Basic subscribers before the end of 2019, we will create a high-quality half-hour television show that does not hate you or seek to destroy your faith, your family, and your country. We will create something that will not only entertain, but inspire, you and your family.\nWe can do it. Seriously. In fact, we’re currently putting together a professionally filmed comedy special that will be considerably funnier than Chris Rock’s – or Ellen’s, although that was obvious – for approximately\none-tenth of one percent\nof their budgets. So, think about it. And then\njoin Unauthorized\n.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-12T11:10:24+00:00"
}