{
  "url": "https://voxday.net/2019/08/20/mailvox-team-sports-and-omegas/",
  "scraped_at": "2025-12-21T02:55:12.421014",
  "title": "Mailvox: team sports and omegas",
  "date_display": "August 20, 2019",
  "date_iso": "2019-08-20T17:00:02+00:00",
  "date_from_url": "2019-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An omega writes of his experience with team sports and group activities:</p><blockquote><p>You’re right about team sports: as an omega teenager, I was lucky enough to play hockey and football/soccer. I endured the bullying, but I didn’t know why until I read your post.</p><p>I was also in the school’s marching band, which was made up of mostly the school’s best jocks with tiny number of lesser boys like me. Getting beaten with a mace by the leader or forced to run with your instrument above your head does kill fear and teach coordination through team-work. In no other context could an omega like me work alongside boys this high up the socio-sexual hierarchy. I hated it at the time but your post made me realise how lucky I was.</p><p>Unsurprisingly, the initiations were brutal. I was praised for taking it so well when other boys freaked out and sobbed, so respect can be earned, even as an omega. <b>An important lesson</b>.</p><p>I punched the aforementioned leader in the face once, but he let it go instead of ordering the band to tunnel me. The rest of the band followed suit and never brought it up again. A few in the band were younger alpha males, and as he was the oldest and the biggest, they obeyed.</p><p>I didn’t leave and they didn’t kick me out. <b>Another important lesson: keep trying hard, and people higher up the socio-sexual rank will admire the effort.</b> They won’t give up on you. When I eventually became good at an arbitrary physical activity then even bullies would spread the word. As you said in one DarkStream, being good at something physical is important, even if it’s just one small thing.</p><p>Thanks to your post, I now see that these experiences are why I relate well to other men – except gammas; they openly despise me – and alpha males instead of hating them. It made it easier to accept my station in life as well as some success with women.</p></blockquote><p>This guy gets it. Accept your place, accept the hazing with equanimity, demonstrate your merit through actions instead of words, prove your loyalty, and you will find yourself rising in every male social hierarchy no matter how low you are on the totem pole at the beginning.</p><p>Men genuinely like underdogs, even the ugly ones. But an underdog absolutely has to show that he has fight if other men are going to cheer for him and stand by him.</p></div>",
  "content_text": "An omega writes of his experience with team sports and group activities:\nYou’re right about team sports: as an omega teenager, I was lucky enough to play hockey and football/soccer. I endured the bullying, but I didn’t know why until I read your post.\nI was also in the school’s marching band, which was made up of mostly the school’s best jocks with tiny number of lesser boys like me. Getting beaten with a mace by the leader or forced to run with your instrument above your head does kill fear and teach coordination through team-work. In no other context could an omega like me work alongside boys this high up the socio-sexual hierarchy. I hated it at the time but your post made me realise how lucky I was.\nUnsurprisingly, the initiations were brutal. I was praised for taking it so well when other boys freaked out and sobbed, so respect can be earned, even as an omega.\nAn important lesson\n.\nI punched the aforementioned leader in the face once, but he let it go instead of ordering the band to tunnel me. The rest of the band followed suit and never brought it up again. A few in the band were younger alpha males, and as he was the oldest and the biggest, they obeyed.\nI didn’t leave and they didn’t kick me out.\nAnother important lesson: keep trying hard, and people higher up the socio-sexual rank will admire the effort.\nThey won’t give up on you. When I eventually became good at an arbitrary physical activity then even bullies would spread the word. As you said in one DarkStream, being good at something physical is important, even if it’s just one small thing.\nThanks to your post, I now see that these experiences are why I relate well to other men – except gammas; they openly despise me – and alpha males instead of hating them. It made it easier to accept my station in life as well as some success with women.\nThis guy gets it. Accept your place, accept the hazing with equanimity, demonstrate your merit through actions instead of words, prove your loyalty, and you will find yourself rising in every male social hierarchy no matter how low you are on the totem pole at the beginning.\nMen genuinely like underdogs, even the ugly ones. But an underdog absolutely has to show that he has fight if other men are going to cheer for him and stand by him.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-20T16:00:02+00:00"
}