{
  "url": "https://voxday.net/2019/08/22/philosophy-as-tactical-manual/",
  "scraped_at": "2025-12-21T02:55:26.847677",
  "title": "Philosophy as tactical manual",
  "date_display": "August 22, 2019",
  "date_iso": "2019-08-22T14:25:54+00:00",
  "date_from_url": "2019-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A book recommendation <a href=\"https://youtu.be/9X-nGNUPLac?t=791\">from ex-Google whistleblower Zach Vorhies</a>:</p><blockquote><p>ZV: I actually want to recommend a book called <a href=\"http://arkhavencomics.com/product/sjwal-audiobook/\"><i>SJWS ALWAYS LIE</i> by Vox Day</a>. That’s the only book that I would recommend that someone would read.</p><p>AJ: We do sell it in our store. That’s one of the few books I’ve read the last year, I’ve been so busy. Yeah, they always lie!</p><p>ZV: They always lie, and the thing is is that people that aren’t familiar with the tactics, you know, because this is weaponized. They don’t understand what’s going on and so they’re likely to make a bunch of mistakes they think that they just capitulate and like apologize then it’s just gonna go away.</p><p>AJ: Oh no! A few years ago I’m like well I’m not really saying that about Sandy Hook but if you say I’m hurting you and sending people to your house, I never did that but I apologize, that’s when they just full-metal attacked!</p><p>ZV: Yeah they double down and the thing is is that they’re gonna parade your apology around and say well, you know, he admits to this and that, he’s like X, Y, or Z bad person and then they’re gonna use that and they’re gonna parade it around. And this is not something that people understand intuitively and so the thing is, get this book, <i>SJWS ALWAYS LIE</i> by Vox Day and read it. It’s a fascinating read and it goes by really quickly, and it’s kind of a funny title but</p><p>AJ: The point is stop capitulating, stop kissing their ass.</p><p>ZV: Yes, exactly. Exactly…. So I followed this book, basically, as a tactical operation manual on how I was going to leak this information.</p></blockquote><p>That is arguably the best review SJWAL has received yet. I’ll be talking with Zach on Alex’s show today at 2 PM EST.</p></div>",
  "content_text": "A book recommendation\nfrom ex-Google whistleblower Zach Vorhies\n:\nZV: I actually want to recommend a book called\nSJWS ALWAYS LIE\nby Vox Day\n. That’s the only book that I would recommend that someone would read.\nAJ: We do sell it in our store. That’s one of the few books I’ve read the last year, I’ve been so busy. Yeah, they always lie!\nZV: They always lie, and the thing is is that people that aren’t familiar with the tactics, you know, because this is weaponized. They don’t understand what’s going on and so they’re likely to make a bunch of mistakes they think that they just capitulate and like apologize then it’s just gonna go away.\nAJ: Oh no! A few years ago I’m like well I’m not really saying that about Sandy Hook but if you say I’m hurting you and sending people to your house, I never did that but I apologize, that’s when they just full-metal attacked!\nZV: Yeah they double down and the thing is is that they’re gonna parade your apology around and say well, you know, he admits to this and that, he’s like X, Y, or Z bad person and then they’re gonna use that and they’re gonna parade it around. And this is not something that people understand intuitively and so the thing is, get this book,\nSJWS ALWAYS LIE\nby Vox Day and read it. It’s a fascinating read and it goes by really quickly, and it’s kind of a funny title but\nAJ: The point is stop capitulating, stop kissing their ass.\nZV: Yes, exactly. Exactly…. So I followed this book, basically, as a tactical operation manual on how I was going to leak this information.\nThat is arguably the best review SJWAL has received yet. I’ll be talking with Zach on Alex’s show today at 2 PM EST.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-22T13:25:54+00:00"
}