{
  "url": "https://voxday.net/2019/08/07/police-your-organization/",
  "scraped_at": "2025-12-21T02:53:31.332641",
  "title": "Police your organization",
  "date_display": "August 7, 2019",
  "date_iso": "2019-08-07T09:28:25+00:00",
  "date_from_url": "2019-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or <a href=\"https://time.com/5645097/boy-scouts-sex-abuse-lawsuit/\">it will be infiltrated by evil</a> and it will be destroyed:</p><blockquote><p>A lawsuit announced Tuesday against the Boy Scouts of America alleges a former Scout was sexually abused as a young boy in the organization for years. The unnamed plaintiff is the latest in a long line of men who say they were raped and assaulted by pedophiles whose actions were ignored or covered up by the Boy Scouts.</p><p>More than 800 men have joined a movement called “Abused in Scouting,” started by a group of lawyers who worried that the Boy Scouts of America were planning to file for bankruptcy, cutting short the timeline for victims to bring sex abuse claims against the organization in court. Those attorneys filed a lawsuit Monday on behalf of one ex-Scout identified as “S.D.,” who said he was assaulted hundreds of times as a Boy Scout in Pennsylvania in the 1970s. The suit demands $50,000 in damages from both the Boy Scouts organization and the alleged abuser.</p><p>The extent of the Boy Scouts’ sex abuse problem first surfaced in 2010 when a judge ordered the organization to release its so-called “Perversion Files,” which listed complaints of abuse in the Scouts. In January, a child abuse expert hired by the Boy Scouts to analyze the files testified that she found 12,254 boys had reported experiencing sexual abuse at the hands of at least 7,800 alleged assailants between 1944 and 2016.</p><p>Now, hundreds more men are claiming they were abused by men who do not appear in the published “Perversion Files.” “It’s the largest pedophile ring on earth,” Tim Kosnoff, one of the lawyers representing alleged victims, said during a press conference on Tuesday. “The numbers we’re talking about now dwarf what we’ve seen in the Catholic Church cases.”</p><p>“The recipe is there for an abuser to take advantage of boys alone out in the woods at night, at their homes, at their apartments,” added another of the lawyers, Stewart Eisenberg. “Many of the boys have reported drugs and alcohol being given to them when they were minors. This abuse is baked into the culture.”</p><p>The nearly 800 members of the Abused in Scouting campaign, who hail from across the country and range in age from 14 to 88, have given their attorneys the names of 350 men who never appeared in the Boy Scouts’ internal files. The lawyers said they’d done their best to verify each of the alleged victim’s claims, based on records of their participation in the Boy Scouts and other evidence the accusers have been able to provide. But they decided to not make public names of all the newly accused men until law enforcement can confirm the legitimacy of the allegations.</p></blockquote><p>This is why Christian organizations need to keep out those who are unrepentant and take pride in their sins. It’s particularly important for organizations that have child members, because predators always go where the prey is.</p><p>I was a Boy Scout for a number of years and reached the rank of Star Scout before dropping out at the age of 15, being more interested in sports and chasing girls. It was a very good experience for me and I learned a lot of useful skills; I even first encountered Tolkien in the form of <i>The Two Towers</i> at a Boy Scout overnight. I was fortunate and never experienced or witnessed even the slightest form of abuse myself, but it’s not hard to see how easily an infiltrating predator could have taken advantage of the boys entrusted to him.</p><p>Sadly, the BSA is now a fully converged organization, so the sooner it dies, the better. And the more pedos that are exposed and held accountable for their crimes, the better.</p></div>",
  "content_text": "Or\nit will be infiltrated by evil\nand it will be destroyed:\nA lawsuit announced Tuesday against the Boy Scouts of America alleges a former Scout was sexually abused as a young boy in the organization for years. The unnamed plaintiff is the latest in a long line of men who say they were raped and assaulted by pedophiles whose actions were ignored or covered up by the Boy Scouts.\nMore than 800 men have joined a movement called “Abused in Scouting,” started by a group of lawyers who worried that the Boy Scouts of America were planning to file for bankruptcy, cutting short the timeline for victims to bring sex abuse claims against the organization in court. Those attorneys filed a lawsuit Monday on behalf of one ex-Scout identified as “S.D.,” who said he was assaulted hundreds of times as a Boy Scout in Pennsylvania in the 1970s. The suit demands $50,000 in damages from both the Boy Scouts organization and the alleged abuser.\nThe extent of the Boy Scouts’ sex abuse problem first surfaced in 2010 when a judge ordered the organization to release its so-called “Perversion Files,” which listed complaints of abuse in the Scouts. In January, a child abuse expert hired by the Boy Scouts to analyze the files testified that she found 12,254 boys had reported experiencing sexual abuse at the hands of at least 7,800 alleged assailants between 1944 and 2016.\nNow, hundreds more men are claiming they were abused by men who do not appear in the published “Perversion Files.” “It’s the largest pedophile ring on earth,” Tim Kosnoff, one of the lawyers representing alleged victims, said during a press conference on Tuesday. “The numbers we’re talking about now dwarf what we’ve seen in the Catholic Church cases.”\n“The recipe is there for an abuser to take advantage of boys alone out in the woods at night, at their homes, at their apartments,” added another of the lawyers, Stewart Eisenberg. “Many of the boys have reported drugs and alcohol being given to them when they were minors. This abuse is baked into the culture.”\nThe nearly 800 members of the Abused in Scouting campaign, who hail from across the country and range in age from 14 to 88, have given their attorneys the names of 350 men who never appeared in the Boy Scouts’ internal files. The lawyers said they’d done their best to verify each of the alleged victim’s claims, based on records of their participation in the Boy Scouts and other evidence the accusers have been able to provide. But they decided to not make public names of all the newly accused men until law enforcement can confirm the legitimacy of the allegations.\nThis is why Christian organizations need to keep out those who are unrepentant and take pride in their sins. It’s particularly important for organizations that have child members, because predators always go where the prey is.\nI was a Boy Scout for a number of years and reached the rank of Star Scout before dropping out at the age of 15, being more interested in sports and chasing girls. It was a very good experience for me and I learned a lot of useful skills; I even first encountered Tolkien in the form of\nThe Two Towers\nat a Boy Scout overnight. I was fortunate and never experienced or witnessed even the slightest form of abuse myself, but it’s not hard to see how easily an infiltrating predator could have taken advantage of the boys entrusted to him.\nSadly, the BSA is now a fully converged organization, so the sooner it dies, the better. And the more pedos that are exposed and held accountable for their crimes, the better.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-07T08:28:25+00:00"
}