{
  "url": "https://voxday.net/2019/08/02/self-destruction-is-the-aim/",
  "scraped_at": "2025-12-21T02:52:54.339122",
  "title": "Self-destruction is the aim",
  "date_display": "August 2, 2019",
  "date_iso": "2019-08-02T12:00:03+00:00",
  "date_from_url": "2019-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the midst of an epic discussion of the SJW murder of Marvel’s god of thunder, John C. Wright pens <a href=\"http://www.scifiwright.com/2019/07/none-escape-the-pestilence/#comment-4560653417\">an appropriately thunderous anathema</a>:</p><blockquote><p>If self destruction were not the aim, it is certainly an odd coincidence that the Left just so happens to destroy everything and create nothing.</p><p>They promote sexual perversion, they promote male athletes pretending to be female compeating in women’s sports, human feces heaped on the sidewalks in San Francisco while (at the same time) claiming it is racist to use hoses to clean the sidewalks, on the grounds that hoses were used against black protesters during the Civil Rigths march.</p><p>They side with terrrorists over the Jews, jihadists over homosexuals, and with the CIA and big business when and only when those organizations are acting in a corrupt and illegal fashion, but not when they fuction as designed.</p><p>When Russia was soviet, they all rushed to defend it. Not that is it not, they denounce it as the greatest of threats.</p><p>They are against nuclear energy but also against fossil fuels.</p><p>They favor infanticide, divorse, contraception, and euthanasia, but they hate the traditional family.</p><p>The hang toilets in modern art museums, cans of human feces, and paintings of the Virgin covered in dung.</p><p>They favor Newspeak over English, or, in other words, they are against language except when it is corrupt.</p><p>They adore and laud pervert pride parades, but then scream with bugeyed hysteria at a Fourth of July parade.</p><p>They hate cops.</p><p>And the list goes on and on and on. In not a single case is their any evidence of them building up anything after destroying what came before.</p><p>There is no new form of family, no new form of modern art, no new form of gender-free English, no new form of law enforcement, no new form of government, and no new rules of courtesy and politeness. There is nothing but continued condemnation of the old forms as unjust.</p><p>Imagine a man who aims and misses the mark but hits his rich uncle through a distant bedroom window over and over and over again. The claim that his true goal is to hit the mark cannot be believed after the hundredth shaft shot unerringly into the old man’s corpse.</p><p>Deliberate? Uncle Screwtape’s deceit of them might be deliberate. I am not sure if the word deliberate has any meaning when dealing with minds unable and unwilling to deliberate anything.</p></blockquote><p>Self-destruction is always and ever the aim of Satandom. This is because the god of this world hates humanity, and he hates all that is Good, that is Beautiful, and that is True. Whether you prefer to call his servitors the Left, SJWs, the Chantry Guild, or the Synagogue of Satan, the single most important thing to understand is that their actions are never coincidental or ironic or mistaken, they are always <i>purposeful</i>.</p><p>Their entire purpose, their only objective, is to destroy. That is why no amount of appeals to reason, to capitalism, or to profit motive will ever prevail. That is why creators and builders must always remain awake and on guard against their blandishments, their appeals, and their offers.</p></div>",
  "content_text": "In the midst of an epic discussion of the SJW murder of Marvel’s god of thunder, John C. Wright pens\nan appropriately thunderous anathema\n:\nIf self destruction were not the aim, it is certainly an odd coincidence that the Left just so happens to destroy everything and create nothing.\nThey promote sexual perversion, they promote male athletes pretending to be female compeating in women’s sports, human feces heaped on the sidewalks in San Francisco while (at the same time) claiming it is racist to use hoses to clean the sidewalks, on the grounds that hoses were used against black protesters during the Civil Rigths march.\nThey side with terrrorists over the Jews, jihadists over homosexuals, and with the CIA and big business when and only when those organizations are acting in a corrupt and illegal fashion, but not when they fuction as designed.\nWhen Russia was soviet, they all rushed to defend it. Not that is it not, they denounce it as the greatest of threats.\nThey are against nuclear energy but also against fossil fuels.\nThey favor infanticide, divorse, contraception, and euthanasia, but they hate the traditional family.\nThe hang toilets in modern art museums, cans of human feces, and paintings of the Virgin covered in dung.\nThey favor Newspeak over English, or, in other words, they are against language except when it is corrupt.\nThey adore and laud pervert pride parades, but then scream with bugeyed hysteria at a Fourth of July parade.\nThey hate cops.\nAnd the list goes on and on and on. In not a single case is their any evidence of them building up anything after destroying what came before.\nThere is no new form of family, no new form of modern art, no new form of gender-free English, no new form of law enforcement, no new form of government, and no new rules of courtesy and politeness. There is nothing but continued condemnation of the old forms as unjust.\nImagine a man who aims and misses the mark but hits his rich uncle through a distant bedroom window over and over and over again. The claim that his true goal is to hit the mark cannot be believed after the hundredth shaft shot unerringly into the old man’s corpse.\nDeliberate? Uncle Screwtape’s deceit of them might be deliberate. I am not sure if the word deliberate has any meaning when dealing with minds unable and unwilling to deliberate anything.\nSelf-destruction is always and ever the aim of Satandom. This is because the god of this world hates humanity, and he hates all that is Good, that is Beautiful, and that is True. Whether you prefer to call his servitors the Left, SJWs, the Chantry Guild, or the Synagogue of Satan, the single most important thing to understand is that their actions are never coincidental or ironic or mistaken, they are always\npurposeful\n.\nTheir entire purpose, their only objective, is to destroy. That is why no amount of appeals to reason, to capitalism, or to profit motive will ever prevail. That is why creators and builders must always remain awake and on guard against their blandishments, their appeals, and their offers.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-02T11:00:03+00:00"
}