{
  "url": "https://voxday.net/2019/08/13/so-islamophobic/",
  "scraped_at": "2025-12-21T02:54:23.217264",
  "title": "So Islamophobic",
  "date_display": "August 13, 2019",
  "date_iso": "2019-08-13T19:16:17+00:00",
  "date_from_url": "2019-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am literally shaking at the lack of respect shown for the Muslim readers of this blog and their time-honored Islamic traditions by Wired author Nitasha Tiku in <a href=\"https://www.wired.com/story/inside-google-three-years-misery-happiest-company-tech/\">her most recent attempt to rewrite history</a> and defend a small group of IQ-challenged SJWs employed by Google:</p><blockquote><p>By Saturday, a full copy of Damore’s document had leaked to Gizmodo. While Googlers waited for an official response from the top, managers who wanted to signal their support for women loudly condemned the memo’s ideas on internal Google+ posts.</p><p>To Liz Fong-Jones, a site reliability engineer at Google, the memo’s arguments were especially familiar. Google’s engineers are not unionized, but inside Google, Fong-Jones essentially performed the function of a union rep, translating employee concerns to managers on everything from product decisions to inclusion practices. She had acquired this informal role around the time the company released Google+ to the public in 2011; before launch, she warned executives against requiring people to use their real names on the platform, arguing that anonymity was important for vulnerable groups. When public uproar played out much as Fong-Jones had predicted, she sat across from executives to negotiate a new policy—then explained the necessary compromises to irate employees. After that, managers and employees started coming to her to mediate internal tensions of all sorts.</p><p>As part of this internal advocacy work, Fong-Jones had become attuned to the way discussions about diversity on internal forums were beset by men like Cernekee, Damore, and other coworkers who were “just asking questions.” To her mind, Google’s management had allowed these dynamics to fester for too long, and now it was time for executives to take a stand. In an internal Google+ post, she wrote that “the only way to deal with all the heads of the medusa is to no-platform all of them.”</p><p>A few hours later, Google’s internal networks received a shock to the system. A screenshot of Fong-Jones’ “Medusa” comment appeared on Vox Popoli, a blog run by the alt-right instigator Theodore Beale, along with her full name and profile photo. The comments section quickly filled with racial and sexual slurs fixated personally on Fong-Jones, who is trans. “They should pitch all those sexual freaks off of rooftops,” one anonymous Vox Popoli commenter wrote.</p></blockquote><p>I’m not sure what is more offensive, the fact that Ms Tiku failed to note Fong-Jones’s graecophobic failure to distinguish between the Hydra and the Medusa or her own blatant failure to respect the traditional Muslim way of addressing sexual deviancy. And I note that it’s been nearly 20 months and Ms Tiku is <u>still</u> trying to establish the Narrative and falsely portray the Google freaks who have been bullying everyone inside the company, from the CEO on down to the lowliest crypto-conservative, as the victims.</p><p>And if anyone at Google is under the impression that they received a shock to the system back then, they can be deeply and profoundly grateful that they didn’t take Fong-Jones’s advice at the time. Oh, and by the way, Ms Tiku, as long as <i>Wired </i>is fixated on the shenanigans of sexual deviants at Google, you should probably ask Mr. Brin and Mr. Schmidt exactly what they were doing <a href=\"http://toresays.com/2019/07/07/exclusive-photos-epstein-who-was-blocking-the-unsealing/\">in Jeffrey Epstein’s company</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-dDfljcwvHGk/Wm2o5zsKpjI/AAAAAAAAC68/e-BPqRh34EMegZAFVmpuWxoLWkg5i_FlwCEwYBhgL/s1600/medusa.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"300\" data-original-width=\"512\" decoding=\"async\" src=\"https://1.bp.blogspot.com/-dDfljcwvHGk/Wm2o5zsKpjI/AAAAAAAAC68/e-BPqRh34EMegZAFVmpuWxoLWkg5i_FlwCEwYBhgL/s1600/medusa.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"300\" data-original-width=\"512\" data-src=\"https://1.bp.blogspot.com/-dDfljcwvHGk/Wm2o5zsKpjI/AAAAAAAAC68/e-BPqRh34EMegZAFVmpuWxoLWkg5i_FlwCEwYBhgL/s1600/medusa.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20300%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "I am literally shaking at the lack of respect shown for the Muslim readers of this blog and their time-honored Islamic traditions by Wired author Nitasha Tiku in\nher most recent attempt to rewrite history\nand defend a small group of IQ-challenged SJWs employed by Google:\nBy Saturday, a full copy of Damore’s document had leaked to Gizmodo. While Googlers waited for an official response from the top, managers who wanted to signal their support for women loudly condemned the memo’s ideas on internal Google+ posts.\nTo Liz Fong-Jones, a site reliability engineer at Google, the memo’s arguments were especially familiar. Google’s engineers are not unionized, but inside Google, Fong-Jones essentially performed the function of a union rep, translating employee concerns to managers on everything from product decisions to inclusion practices. She had acquired this informal role around the time the company released Google+ to the public in 2011; before launch, she warned executives against requiring people to use their real names on the platform, arguing that anonymity was important for vulnerable groups. When public uproar played out much as Fong-Jones had predicted, she sat across from executives to negotiate a new policy—then explained the necessary compromises to irate employees. After that, managers and employees started coming to her to mediate internal tensions of all sorts.\nAs part of this internal advocacy work, Fong-Jones had become attuned to the way discussions about diversity on internal forums were beset by men like Cernekee, Damore, and other coworkers who were “just asking questions.” To her mind, Google’s management had allowed these dynamics to fester for too long, and now it was time for executives to take a stand. In an internal Google+ post, she wrote that “the only way to deal with all the heads of the medusa is to no-platform all of them.”\nA few hours later, Google’s internal networks received a shock to the system. A screenshot of Fong-Jones’ “Medusa” comment appeared on Vox Popoli, a blog run by the alt-right instigator Theodore Beale, along with her full name and profile photo. The comments section quickly filled with racial and sexual slurs fixated personally on Fong-Jones, who is trans. “They should pitch all those sexual freaks off of rooftops,” one anonymous Vox Popoli commenter wrote.\nI’m not sure what is more offensive, the fact that Ms Tiku failed to note Fong-Jones’s graecophobic failure to distinguish between the Hydra and the Medusa or her own blatant failure to respect the traditional Muslim way of addressing sexual deviancy. And I note that it’s been nearly 20 months and Ms Tiku is\nstill\ntrying to establish the Narrative and falsely portray the Google freaks who have been bullying everyone inside the company, from the CEO on down to the lowliest crypto-conservative, as the victims.\nAnd if anyone at Google is under the impression that they received a shock to the system back then, they can be deeply and profoundly grateful that they didn’t take Fong-Jones’s advice at the time. Oh, and by the way, Ms Tiku, as long as\nWired\nis fixated on the shenanigans of sexual deviants at Google, you should probably ask Mr. Brin and Mr. Schmidt exactly what they were doing\nin Jeffrey Epstein’s company\n.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-13T18:16:17+00:00"
}