{
  "url": "https://voxday.net/2019/08/24/statistical-analysis-is-not-intelligent-design/",
  "scraped_at": "2025-12-21T02:55:40.519913",
  "title": "Statistical analysis is not Intelligent Design",
  "date_display": "August 24, 2019",
  "date_iso": "2019-08-24T15:06:05+00:00",
  "date_from_url": "2019-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reading the Z-man can be mildly frustrating at times, because he not infrequently starts off on the right path, but then fails to make the <a href=\"http://thezman.com/wordpress/?p=18398\">vital distinctions that are necessary</a> in order to reach the correct conclusions.</p><blockquote class=\"tr_bq\"><p>Whenever the subject of Intelligent Design turns up, it is always in the context of believers in ID attacking evolutionary biology. The ID’ers have a list of claims about “Darwinism” that they insist make evolution impossible. A popular one now, for example, is that there is not enough time for natural selection to produce enough gene mutations to explain the fossil record. </p></blockquote><p>This is incorrect on two levels. First, the popular idea is something that I first articulated some time ago before more recently making my case in detail concerning the time required to account for the fixed genetic mutations that have been observed, and it is not necessarily related to the fossil record. In fact, the fossil record is now almost entirely irrelevant to the TENS debate, in which genetic science is rapidly demolishing the last credible vestiges of Neo-Darwinism.</p><p>Second, this specific event-based criticism of Neo-Darwinism is not Intelligent Design and has nothing whatsoever to do with Intelligent Design. I pay no attention to Creationists or Intelligent Design advocates. Their meanderings are of little interest to me. I am but a humble game designer with an educational background in economics, which combination tends to alert me to various statistical anomalies and mathematical improbabilities and impossibilities when I happen to come across them for one reason or another.</p><p>Since scientists and political commentators alike seem to struggle with the basic concept, I will attempt to put it into terms simple enough for even a sportsball player to follow.</p><p>If we are told that a sportsball team has gained 1,500 yards on the ground and that it averages three yards per rushing play, and we know that the maximum number of offensive plays per game is 84, then we know, <i>beyond any shadow of a doubt</i>, that the yards reported were not gained in a single 60-minute game. They could not have been. It is impossible.</p><p>The math is inexorable. The maximum number of yards that could have been gained on the ground in a single game is 252. It does not matter if a desperate proponent of Neo-Schembechlerism proposes the idea that perhaps the team ran a hurry-up wishbone offense, or that the quarterback was a dual-threat as a runner, or that the team played in a league known for its terrible run defenses, or that one of the halfbacks once ripped off a 99-yard gain, or that NCAA teams have been known to play up to seven overtime periods, or that perhaps five different players touched the ball on the same play. The math is inexorable. The assertion that a sportsball team which averages three yards per carry gained 1,500 yards on the ground in a single game is flat-out impossible. We can say with certainty that it never happened.</p><p>In like manner, the number of fixed mutations that are presently observed to distinguish two species, whether we contemplate Man and the Chimpanzee–Human last common ancestor (CHLCA) or the dog and one of the therapsids, are considerably – CONSIDERABLY – in excess of the maximum amount of time that could have passed since the speciation process is believed to have begun. There is only one defense against this straightforward mathematical observation, and that is the idea that enough parallel mutations happened very, very quickly to significantly reduce the average time per fixed mutation to permit it to happen in the intervening time period.</p><p>The problem here, of course, is that the numerical gap that needs to be filled is so large that if that were the case, then these mutations would be have to be happening so rapidly, and fixing in parallel so quickly, that we could observe evolution by natural selection happening <i>in real time all the time</i>. Except we don’t, so the Neo-Darwinian is forced to retreat to the absurd scientific equivalent of claiming that he does too have a girlfriend, it’s just that she lives in Canada, and you wouldn’t know her anyhow.</p><p>This is not a defense of intelligent design. It is a defense of math and logic, both of which have to be abandoned if one is still to take Neo-Darwinism or the theory of evolution by natural selection seriously.</p></div>",
  "content_text": "Reading the Z-man can be mildly frustrating at times, because he not infrequently starts off on the right path, but then fails to make the\nvital distinctions that are necessary\nin order to reach the correct conclusions.\nWhenever the subject of Intelligent Design turns up, it is always in the context of believers in ID attacking evolutionary biology. The ID’ers have a list of claims about “Darwinism” that they insist make evolution impossible. A popular one now, for example, is that there is not enough time for natural selection to produce enough gene mutations to explain the fossil record.\nThis is incorrect on two levels. First, the popular idea is something that I first articulated some time ago before more recently making my case in detail concerning the time required to account for the fixed genetic mutations that have been observed, and it is not necessarily related to the fossil record. In fact, the fossil record is now almost entirely irrelevant to the TENS debate, in which genetic science is rapidly demolishing the last credible vestiges of Neo-Darwinism.\nSecond, this specific event-based criticism of Neo-Darwinism is not Intelligent Design and has nothing whatsoever to do with Intelligent Design. I pay no attention to Creationists or Intelligent Design advocates. Their meanderings are of little interest to me. I am but a humble game designer with an educational background in economics, which combination tends to alert me to various statistical anomalies and mathematical improbabilities and impossibilities when I happen to come across them for one reason or another.\nSince scientists and political commentators alike seem to struggle with the basic concept, I will attempt to put it into terms simple enough for even a sportsball player to follow.\nIf we are told that a sportsball team has gained 1,500 yards on the ground and that it averages three yards per rushing play, and we know that the maximum number of offensive plays per game is 84, then we know,\nbeyond any shadow of a doubt\n, that the yards reported were not gained in a single 60-minute game. They could not have been. It is impossible.\nThe math is inexorable. The maximum number of yards that could have been gained on the ground in a single game is 252. It does not matter if a desperate proponent of Neo-Schembechlerism proposes the idea that perhaps the team ran a hurry-up wishbone offense, or that the quarterback was a dual-threat as a runner, or that the team played in a league known for its terrible run defenses, or that one of the halfbacks once ripped off a 99-yard gain, or that NCAA teams have been known to play up to seven overtime periods, or that perhaps five different players touched the ball on the same play. The math is inexorable. The assertion that a sportsball team which averages three yards per carry gained 1,500 yards on the ground in a single game is flat-out impossible. We can say with certainty that it never happened.\nIn like manner, the number of fixed mutations that are presently observed to distinguish two species, whether we contemplate Man and the Chimpanzee–Human last common ancestor (CHLCA) or the dog and one of the therapsids, are considerably – CONSIDERABLY – in excess of the maximum amount of time that could have passed since the speciation process is believed to have begun. There is only one defense against this straightforward mathematical observation, and that is the idea that enough parallel mutations happened very, very quickly to significantly reduce the average time per fixed mutation to permit it to happen in the intervening time period.\nThe problem here, of course, is that the numerical gap that needs to be filled is so large that if that were the case, then these mutations would be have to be happening so rapidly, and fixing in parallel so quickly, that we could observe evolution by natural selection happening\nin real time all the time\n. Except we don’t, so the Neo-Darwinian is forced to retreat to the absurd scientific equivalent of claiming that he does too have a girlfriend, it’s just that she lives in Canada, and you wouldn’t know her anyhow.\nThis is not a defense of intelligent design. It is a defense of math and logic, both of which have to be abandoned if one is still to take Neo-Darwinism or the theory of evolution by natural selection seriously.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-24T14:06:05+00:00"
}