{
  "url": "https://voxday.net/2019/08/01/tinder-meet-the-sparks/",
  "scraped_at": "2025-12-21T02:52:47.049160",
  "title": "Tinder, meet the sparks",
  "date_display": "August 1, 2019",
  "date_iso": "2019-08-01T15:00:03+00:00",
  "date_from_url": "2019-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Snyder notes <a href=\"https://www.zerohedge.com/news/2019-07-31/turkey-threatens-reignite-european-migrant-crisis\">three very dangerous developments</a> that have the potential to lead to significant large-scale conflict on Zerohedge.</p><ul><li><i>Israel has been striking Iranian military targets inside Syria for months, but now the rules of engagement have apparently changed, because in recent days the IDF has started conducting airstrikes against Iranian targets inside Iraq. The reason this is being called “an unprecedented move” is because this is the very first time since 1981 that we have seen Israeli airstrikes inside Iraq. Needless to say, these latest airstrikes have absolutely enraged the Iranians.  It looks like the Israeli government has determined that any Iranian military targets outside of Iran itself are fair game, and it is probably only a matter of time before Iran strikes back in a major way.</i></li><li><i>The political protests that have made global headlines in Hong Kong in recent weeks have greatly angered the Chinese government.  They were probably hoping that the protests would quickly subside and soon be forgotten, but that hasn’t happened. So now China is faced with a decision.  If such protests were happening elsewhere in China, they would be brutally crushed, but Hong Kong is a special case. If the Chinese are too harsh with the protesters in Hong Kong, that could turn world opinion against them, but if they do nothing that could encourage protests to start happening in other area of the country. In the end, the Chinese will probably do what they always do, and that means crushing the opposition.</i></li><li><i>North Korea just fired two more missiles into the ocean. The North Koreans are greatly alarmed by the joint military drills that the U.S. and South Korea will soon be conducting, and whenever they get greatly upset about something they seem to express that displeasure by firing off more missiles.</i></li></ul><p>Of the three, I think the Hong Kong situation is the most delicate and the North Korean one the most trivial. North Korea has carried out more than 80 strategic missile tests since Kim Jong-On became Supreme Leader in 2011, so what do two more signify? However, there is also <a href=\"https://www.zerohedge.com/news/2019-07-31/turkey-threatens-reignite-european-migrant-crisis\">a fourth major development</a> that is probably as dangerous as all three of those situations combined, but is little noted in the USA as yet because it doesn’t involve Israel or China or nukes.</p><blockquote><p>Turkey has threatened to re-open the floodgates of mass migration to Europe unless Turkish nationals are granted visa-free travel to the European Union. The EU agreed to visa liberalization in a March 2016 EU-Turkey migrant deal in which Ankara pledged to stem the flow of migrants to Europe. In an interview with Turkish television channel <i>TGRT Haber</i> on July 22, Turkish Foreign Minister Mevlut Çavuşoğlu said that Turkey was backing out of the migrant deal because the EU had failed to honor its pledge to grant Turkish passport holders visa-free access to 26 European countries.</p><p>“We have suspended the readmission agreement,” he said. “We will not wait at the EU’s door.”</p><p>A day earlier, Turkish Interior Minister Süleyman Soylu accused European countries of leaving Turkey alone to deal with the migration issue. In comments published by the state news agency <i>Anadolu Agency</i>, he warned:</p><p><i>“We are facing the biggest wave of migration in history. If we open the floodgates, no European government will be able to survive for more than six months. We advise them not to try our patience.”</i></p><p>The migration deal, which entered into force on June 1, 2016, was hastily negotiated by European leaders desperate to gain control over a crisis in which more than one million migrants poured into Europe in 2015.</p><p>Under the agreement, the EU pledged to pay Turkey €6 billion, grant visa-free travel to Europe for Turkey’s 82 million citizens, and restart accession talks for Turkey to join the EU. In exchange, Turkey agreed to stop the flow of migrants to Europe as well as to take back all migrants and refugees who illegally reach Greece from Turkey.</p><p>Turkey currently hosts an estimated 3.5 million migrants and refugees — mainly Syrians, Iraqis and Afghans. Many of these people presumably would migrate to Europe if given the opportunity to do so….If the EU approves the visa waiver, tens of millions of Turks will gain immediate and unimpeded access to Europe’s passport-free zone. Critics of visa liberalization fear that millions of Turkish nationals may end up migrating to Europe. The Austrian newsmagazine, <i>Wochenblick</i>, reported that 11 million Turks are living in poverty and “many of them are dreaming of moving to central Europe.”</p></blockquote><p>Not every European government will fall if the migration spigot is turned on again – those countries already fortunate enough to have solid anti-migration parties in government will see the strength of those parties skyrocket – but the German and French governments will most certainly fall and the collapse of the Berlin-Paris axis would suffice to account for the European Union as well.</p></div>",
  "content_text": "Michael Snyder notes\nthree very dangerous developments\nthat have the potential to lead to significant large-scale conflict on Zerohedge.\nIsrael has been striking Iranian military targets inside Syria for months, but now the rules of engagement have apparently changed, because in recent days the IDF has started conducting airstrikes against Iranian targets inside Iraq. The reason this is being called “an unprecedented move” is because this is the very first time since 1981 that we have seen Israeli airstrikes inside Iraq. Needless to say, these latest airstrikes have absolutely enraged the Iranians.  It looks like the Israeli government has determined that any Iranian military targets outside of Iran itself are fair game, and it is probably only a matter of time before Iran strikes back in a major way.\nThe political protests that have made global headlines in Hong Kong in recent weeks have greatly angered the Chinese government.  They were probably hoping that the protests would quickly subside and soon be forgotten, but that hasn’t happened. So now China is faced with a decision.  If such protests were happening elsewhere in China, they would be brutally crushed, but Hong Kong is a special case. If the Chinese are too harsh with the protesters in Hong Kong, that could turn world opinion against them, but if they do nothing that could encourage protests to start happening in other area of the country. In the end, the Chinese will probably do what they always do, and that means crushing the opposition.\nNorth Korea just fired two more missiles into the ocean. The North Koreans are greatly alarmed by the joint military drills that the U.S. and South Korea will soon be conducting, and whenever they get greatly upset about something they seem to express that displeasure by firing off more missiles.\nOf the three, I think the Hong Kong situation is the most delicate and the North Korean one the most trivial. North Korea has carried out more than 80 strategic missile tests since Kim Jong-On became Supreme Leader in 2011, so what do two more signify? However, there is also\na fourth major development\nthat is probably as dangerous as all three of those situations combined, but is little noted in the USA as yet because it doesn’t involve Israel or China or nukes.\nTurkey has threatened to re-open the floodgates of mass migration to Europe unless Turkish nationals are granted visa-free travel to the European Union. The EU agreed to visa liberalization in a March 2016 EU-Turkey migrant deal in which Ankara pledged to stem the flow of migrants to Europe. In an interview with Turkish television channel\nTGRT Haber\non July 22, Turkish Foreign Minister Mevlut Çavuşoğlu said that Turkey was backing out of the migrant deal because the EU had failed to honor its pledge to grant Turkish passport holders visa-free access to 26 European countries.\n“We have suspended the readmission agreement,” he said. “We will not wait at the EU’s door.”\nA day earlier, Turkish Interior Minister Süleyman Soylu accused European countries of leaving Turkey alone to deal with the migration issue. In comments published by the state news agency\nAnadolu Agency\n, he warned:\n“We are facing the biggest wave of migration in history. If we open the floodgates, no European government will be able to survive for more than six months. We advise them not to try our patience.”\nThe migration deal, which entered into force on June 1, 2016, was hastily negotiated by European leaders desperate to gain control over a crisis in which more than one million migrants poured into Europe in 2015.\nUnder the agreement, the EU pledged to pay Turkey €6 billion, grant visa-free travel to Europe for Turkey’s 82 million citizens, and restart accession talks for Turkey to join the EU. In exchange, Turkey agreed to stop the flow of migrants to Europe as well as to take back all migrants and refugees who illegally reach Greece from Turkey.\nTurkey currently hosts an estimated 3.5 million migrants and refugees — mainly Syrians, Iraqis and Afghans. Many of these people presumably would migrate to Europe if given the opportunity to do so….If the EU approves the visa waiver, tens of millions of Turks will gain immediate and unimpeded access to Europe’s passport-free zone. Critics of visa liberalization fear that millions of Turkish nationals may end up migrating to Europe. The Austrian newsmagazine,\nWochenblick\n, reported that 11 million Turks are living in poverty and “many of them are dreaming of moving to central Europe.”\nNot every European government will fall if the migration spigot is turned on again – those countries already fortunate enough to have solid anti-migration parties in government will see the strength of those parties skyrocket – but the German and French governments will most certainly fall and the collapse of the Berlin-Paris axis would suffice to account for the European Union as well.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-08-01T14:00:03+00:00"
}