{
  "url": "https://voxday.net/2020/03/18/2020-is-2008/",
  "scraped_at": "2025-12-21T12:48:16.871369",
  "title": "2020 is 2008",
  "date_display": "March 18, 2020",
  "date_iso": "2020-03-18T09:52:11+00:00",
  "date_from_url": "2020-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another financial crash will likely begin later this year, <a href=\"https://finance.yahoo.com/news/banks-raising-credit-card-limits-110000952.html\">and for much the same reason</a> as 2008</p><blockquote><p>It might sound like a risky strategy at a time when millions of Americans are drowning in debt: keep raising the limit on people’s credit cards, even if they don’t ask. But that’s exactly what big banks have been doing lately to turbocharge their profits, leaving customers with the potential to rack up even bigger monthly bills.</p><p>For years after the financial crisis, Capital One Financial Corp. resisted that step for customers who looked vulnerable to getting in over their heads. In internal conversations, Chief Executive Officer Richard Fairbank characterized the restraint as a radical theology, in part because it went beyond post-crisis requirements, according to a person with direct knowledge of the discussions.</p><p>But then Capital One — known for its “What’s in Your Wallet?” slogan — reversed course in 2018, after the bank came under pressure to keep revenue growing. The company’s revenue reached a record last year.</p><p>The same reversal is playing out across U.S. banking, as more customers get unsolicited access to additional credit, in what’s becoming a new golden age of plastic. The goal: to get consumers to borrow more. The question, just like in the heady 2000s, is how it will end for lenders and borrowers alike. Research shows many consumers turn higher limits into debt. And the greater the debt, the harder it is to dig out…. Outstanding card borrowing has surpassed its pre-crisis peak, reaching a record of $880 billion at the end of September, according to the latest data from the New York Fed’s consumer credit panel. </p></blockquote><p>Unfortunately, it’s not possible to correctly compare the amount of total debt to the situation in 2008, because the series that dated back to WWII and proved so informative was significantly modified and rendered considerably less useful by serious revisions to the state and local government sector.</p><p>Even so, the modified version shows that total credit market debt outstanding is now <a href=\"https://fred.stlouisfed.org/series/TCMDODFS\">at the same level</a> that it was in the third quarter of 2007. The intervening 12 years have been a period of debt disinflation, essentially a period of treading water with debt growing too slowly to artificially grow the economy but also not being cleared. For the inflationistas, this was the attempt to print their way out of the situation.</p><p>As I said back in 2008, it didn’t work because it can’t work. You can print paper, but you cannot print debtors or debt. Sooner or later, a lot of the debt will be written off, because mathematics dictates that the interest payments will eventually become unsupportable.</p></div>",
  "content_text": "Another financial crash will likely begin later this year,\nand for much the same reason\nas 2008\nIt might sound like a risky strategy at a time when millions of Americans are drowning in debt: keep raising the limit on people’s credit cards, even if they don’t ask. But that’s exactly what big banks have been doing lately to turbocharge their profits, leaving customers with the potential to rack up even bigger monthly bills.\nFor years after the financial crisis, Capital One Financial Corp. resisted that step for customers who looked vulnerable to getting in over their heads. In internal conversations, Chief Executive Officer Richard Fairbank characterized the restraint as a radical theology, in part because it went beyond post-crisis requirements, according to a person with direct knowledge of the discussions.\nBut then Capital One — known for its “What’s in Your Wallet?” slogan — reversed course in 2018, after the bank came under pressure to keep revenue growing. The company’s revenue reached a record last year.\nThe same reversal is playing out across U.S. banking, as more customers get unsolicited access to additional credit, in what’s becoming a new golden age of plastic. The goal: to get consumers to borrow more. The question, just like in the heady 2000s, is how it will end for lenders and borrowers alike. Research shows many consumers turn higher limits into debt. And the greater the debt, the harder it is to dig out…. Outstanding card borrowing has surpassed its pre-crisis peak, reaching a record of $880 billion at the end of September, according to the latest data from the New York Fed’s consumer credit panel.\nUnfortunately, it’s not possible to correctly compare the amount of total debt to the situation in 2008, because the series that dated back to WWII and proved so informative was significantly modified and rendered considerably less useful by serious revisions to the state and local government sector.\nEven so, the modified version shows that total credit market debt outstanding is now\nat the same level\nthat it was in the third quarter of 2007. The intervening 12 years have been a period of debt disinflation, essentially a period of treading water with debt growing too slowly to artificially grow the economy but also not being cleared. For the inflationistas, this was the attempt to print their way out of the situation.\nAs I said back in 2008, it didn’t work because it can’t work. You can print paper, but you cannot print debtors or debt. Sooner or later, a lot of the debt will be written off, because mathematics dictates that the interest payments will eventually become unsupportable.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-18T09:52:11+00:00"
}