{
  "url": "https://voxday.net/2020/03/09/a-very-old-religion/",
  "scraped_at": "2025-12-21T12:47:21.680500",
  "title": "A very old religion",
  "date_display": "March 9, 2020",
  "date_iso": "2020-03-09T18:00:16+00:00",
  "date_from_url": "2020-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>St. Iraneus addressed the beliefs of at least some of today’s glowies in <i>Against Heresies</i>. Notice that, as with the Enlightenment elites, the ancient Cainites held “knowledge” to be supreme and were arrogant about their self-declared superiority to the humble truths of Christianity.</p><p><b>Doctrines of the Cainites.</b></p><p>Others again declare that Cain derived his being from the Power above, and acknowledge that Esau, Korah, the Sodomites, and all such persons, are related to themselves. On this account, they add, they have been assailed by the Creator, yet no one of them has suffered injury. For Sophia was in the habit of carrying off that which belonged to her from them to herself. They declare that Judas the traitor was thoroughly acquainted with these things, and that he alone, knowing the truth as no others did, accomplished the mystery of the betrayal; by him all things, both earthly and heavenly, were thus thrown into confusion. They produce a fictitious history of this kind, which they style the Gospel of Judas.</p><p>I have also made a collection of their writings in which they advocate the abolition of the doings of Hystera. Moreover, they call this Hystera the creator of heaven and earth. They also hold, like Carpocrates, that men cannot be saved until they have gone through all kinds of experience. An angel, they maintain, attends them in every one of their sinful and abominable actions, and urges them to venture on audacity and incur pollution. Whatever may be the nature of the action, they declare that they do it in the name of the angel, saying, <i>O you angel, I use your work; O you power, I accomplish your operation!</i> And they maintain that this is <i>perfect knowledge</i>, without shrinking to rush into such actions as it is not lawful even to name.</p><p>It was necessary clearly to prove, that, as their very opinions and regulations exhibit them, those who are of the school of Valentinus derive their origin from such mothers, fathers, and ancestors, and also to bring forward their doctrines, with the hope that perchance some of them, exercising repentance and returning to the only Creator, and God the Former of the universe, may obtain salvation, and that others may not henceforth be drawn away by their wicked, although plausible, persuasions, imagining that they will obtain from them the knowledge of some greater and more sublime mysteries. But let them rather, learning to good effect from us the wicked tenets of these men, look with contempt upon their doctrines, while at the same time they pity those who, still cleaving to these miserable and baseless fables, have reached such a pitch of arrogance as to reckon themselves superior to all others on account of such knowledge, or, as it should rather be called, ignorance.</p></div>",
  "content_text": "St. Iraneus addressed the beliefs of at least some of today’s glowies in\nAgainst Heresies\n. Notice that, as with the Enlightenment elites, the ancient Cainites held “knowledge” to be supreme and were arrogant about their self-declared superiority to the humble truths of Christianity.\nDoctrines of the Cainites.\nOthers again declare that Cain derived his being from the Power above, and acknowledge that Esau, Korah, the Sodomites, and all such persons, are related to themselves. On this account, they add, they have been assailed by the Creator, yet no one of them has suffered injury. For Sophia was in the habit of carrying off that which belonged to her from them to herself. They declare that Judas the traitor was thoroughly acquainted with these things, and that he alone, knowing the truth as no others did, accomplished the mystery of the betrayal; by him all things, both earthly and heavenly, were thus thrown into confusion. They produce a fictitious history of this kind, which they style the Gospel of Judas.\nI have also made a collection of their writings in which they advocate the abolition of the doings of Hystera. Moreover, they call this Hystera the creator of heaven and earth. They also hold, like Carpocrates, that men cannot be saved until they have gone through all kinds of experience. An angel, they maintain, attends them in every one of their sinful and abominable actions, and urges them to venture on audacity and incur pollution. Whatever may be the nature of the action, they declare that they do it in the name of the angel, saying,\nO you angel, I use your work; O you power, I accomplish your operation!\nAnd they maintain that this is\nperfect knowledge\n, without shrinking to rush into such actions as it is not lawful even to name.\nIt was necessary clearly to prove, that, as their very opinions and regulations exhibit them, those who are of the school of Valentinus derive their origin from such mothers, fathers, and ancestors, and also to bring forward their doctrines, with the hope that perchance some of them, exercising repentance and returning to the only Creator, and God the Former of the universe, may obtain salvation, and that others may not henceforth be drawn away by their wicked, although plausible, persuasions, imagining that they will obtain from them the knowledge of some greater and more sublime mysteries. But let them rather, learning to good effect from us the wicked tenets of these men, look with contempt upon their doctrines, while at the same time they pity those who, still cleaving to these miserable and baseless fables, have reached such a pitch of arrogance as to reckon themselves superior to all others on account of such knowledge, or, as it should rather be called, ignorance.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-09T18:00:16+00:00"
}