{
  "url": "https://voxday.net/2020/03/05/castalia-library-update/",
  "scraped_at": "2025-12-21T12:46:59.677308",
  "title": "Castalia Library update",
  "date_display": "March 5, 2020",
  "date_iso": "2020-03-05T14:57:11+00:00",
  "date_from_url": "2020-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Book 01 (NOV/DEC) THE MISSIONARIES by Owen Stanley is being bound. The books are anticipated to be shipped the week of March 23-27. The Library print run is 500.</p><p>Book 02 (JAN/FEB) THE MEDITATIONS by Marcus Aurelius is being printed. The books are anticipated to be shipped in April. The Library print run is 650.</p><p>Book 03 (MAR/APR) AWAKE IN THE NIGHT LAND by John C. Wright is being laid out and the interior illustrations are being prepared. The print run is undetermined.</p><p>Book 04 (MAY/JUN) is being selected. It will either be the first volume of PLUTARCH’S LIVES or INFERNO by Dante.</p><p>For future reference, please check the Arkhaven blog for regular updates concerning Castalia Library and the fulfillment of the various crowdfunding projects.</p><p><b>CLARIFICATION: </b>Because, apparently, it is not entirely obvious from the observable evidence, if you do not subscribe to SOMETHING for more than $5 per month that does not involve substantial built-in costs in its own right, (translation: Hero of the Revolution), you are not eligible for a SocialGalactic subscription. If you are involved in one-off flat-free projects such as a crowdfunding campaign, that is recognized in the SG world by the relevant badge and can receive an invitation by subscribing to either <a href=\"https://www.unauthorized.tv/join\">UATV</a> or <a href=\"https://arkhavencomics.com/product/sg-bronze/\">directly to SocialGalactic</a>.</p><p>I am, after all, an economist by training, and therefore not inclined to make the obvious mistake of putting SG in a position of taking on unlimited expenses on the basis of fixed revenues.</p></div>",
  "content_text": "Book 01 (NOV/DEC) THE MISSIONARIES by Owen Stanley is being bound. The books are anticipated to be shipped the week of March 23-27. The Library print run is 500.\nBook 02 (JAN/FEB) THE MEDITATIONS by Marcus Aurelius is being printed. The books are anticipated to be shipped in April. The Library print run is 650.\nBook 03 (MAR/APR) AWAKE IN THE NIGHT LAND by John C. Wright is being laid out and the interior illustrations are being prepared. The print run is undetermined.\nBook 04 (MAY/JUN) is being selected. It will either be the first volume of PLUTARCH’S LIVES or INFERNO by Dante.\nFor future reference, please check the Arkhaven blog for regular updates concerning Castalia Library and the fulfillment of the various crowdfunding projects.\nCLARIFICATION:\nBecause, apparently, it is not entirely obvious from the observable evidence, if you do not subscribe to SOMETHING for more than $5 per month that does not involve substantial built-in costs in its own right, (translation: Hero of the Revolution), you are not eligible for a SocialGalactic subscription. If you are involved in one-off flat-free projects such as a crowdfunding campaign, that is recognized in the SG world by the relevant badge and can receive an invitation by subscribing to either\nUATV\nor\ndirectly to SocialGalactic\n.\nI am, after all, an economist by training, and therefore not inclined to make the obvious mistake of putting SG in a position of taking on unlimited expenses on the basis of fixed revenues.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-05T14:57:11+00:00"
}