{
  "url": "https://voxday.net/2020/03/28/despair-will-not-be-tolerated/",
  "scraped_at": "2025-12-21T12:49:20.258474",
  "title": "Despair will not be tolerated",
  "date_display": "March 28, 2020",
  "date_iso": "2020-03-28T12:56:19+00:00",
  "date_from_url": "2020-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been instructive to see how banning the blackpillers and pessimists not only improves the tone of the discourse, but boosts everyone’s morale. So, it is time to speak forthrightly on the subject. I will no longer tolerate those commenters given to negativity and despair. They will be banned without hesitation.</p><p>Hope, whether it is based on a sound foundation of truth and reason or not, is to be vastly preferred to the incessant pessimism of those who are afraid to hope because they fear being disappointed more than they fear being defeated. Those who always ask of every possible positive interpretation “but could it be a trap?” are narcissistic cravens driven primarily by fear and self-absorption.</p><p>Things may not always turn out as well as we hope. They almost certainly will not do so. The world is fallen, after all, it is ruled by an immortal and malignant narcissist, and our vision of the future is very far from perfect. But the one and only way to absolutely ensure defeat is to refuse to enter the ring. It is better, by far, to enter the ring full of false confidence and go down fighting than to refuse to enter it at all for fear of being beaten.</p><p>So, this is fair warning being given to those who are inclined towards pessimism, defeatism, and despair: this is not a place for you. You may be right, in the end, but I don’t care in the slightest. If we ride to doom, in any case<i>, we will ride</i>. You are welcome to cringe and hide and attempt to be the last one devoured by the flames of Surtyr. But if that is your goal, then this is not the place for you and you will never be one of us.</p></div>",
  "content_text": "It’s been instructive to see how banning the blackpillers and pessimists not only improves the tone of the discourse, but boosts everyone’s morale. So, it is time to speak forthrightly on the subject. I will no longer tolerate those commenters given to negativity and despair. They will be banned without hesitation.\nHope, whether it is based on a sound foundation of truth and reason or not, is to be vastly preferred to the incessant pessimism of those who are afraid to hope because they fear being disappointed more than they fear being defeated. Those who always ask of every possible positive interpretation “but could it be a trap?” are narcissistic cravens driven primarily by fear and self-absorption.\nThings may not always turn out as well as we hope. They almost certainly will not do so. The world is fallen, after all, it is ruled by an immortal and malignant narcissist, and our vision of the future is very far from perfect. But the one and only way to absolutely ensure defeat is to refuse to enter the ring. It is better, by far, to enter the ring full of false confidence and go down fighting than to refuse to enter it at all for fear of being beaten.\nSo, this is fair warning being given to those who are inclined towards pessimism, defeatism, and despair: this is not a place for you. You may be right, in the end, but I don’t care in the slightest. If we ride to doom, in any case\n, we will ride\n. You are welcome to cringe and hide and attempt to be the last one devoured by the flames of Surtyr. But if that is your goal, then this is not the place for you and you will never be one of us.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-28T12:56:19+00:00"
}