{
  "url": "https://voxday.net/2020/03/16/easter-means-resurrection/",
  "scraped_at": "2025-12-21T12:47:58.197434",
  "title": "“Easter” means “Resurrection”",
  "date_display": "March 16, 2020",
  "date_iso": "2020-03-16T11:03:30+00:00",
  "date_from_url": "2020-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A poster asked about Easter on SocialGalactic:</p><blockquote class=\"tr_bq\"><p>Why do churches say Easter? Isn’t Easter a pagan holiday? I’ve started to say Resurrection Sunday at church and ppl ignore me.</p></blockquote><p>Easter is not a pagan holiday. That’s atheist nonsense that requires an almost-complete ignorance of literally every foreign language but one. While there is a possible etymological link to the name of an Anglo-Saxon goddess named Eostre <a href=\"https://steadfastlutherans.org/2014/04/redeeming-holy-days-from-pagan-lies-easter-2-2/\">for whom there is absolutely no evidence</a> outside of the writings of the venerable, but inventive Bede, but since the Germans use “Easter” too and English is partially derived from German, the word is much more likely linked to the old German word for resurrection, which is <i>Erstehen</i>.</p><p>One of the earliest appearances of “Easter” in English is in the Tyndale Bible, which actually refers to <i>Ester</i>. Remember, the conventional accusation about Easter being a pagan holiday concerned Ishtar, an Akkadian goddess of love and war, but that was never a viable explanation because none of the other European languages have any possible etymological link to a pagan holiday. Their Paschae, Pasqua, Pâques, Pascua, etc. all trace back to Passover.</p><p>So, the usual suspects dug around the history books and came up with Eostre, who was not a German goddess and for whom there is no evidence in the German linguistic record. But they did posit – or to put more clearly, made up – a nonexistent precursor goddess to a probably-invented goddess, whose nonexistent holiday could theoretically have been coopted by English and German Christians in the Sixteenth Century while celebrating the <i>Erstehen </i>on <i>Paschae</i>.</p><p>Needless to say, this makes absolutely no sense to anyone who is capable of understanding the conventional ordering of cause and effect. Note in particular that the first and only known reference to Eostre is in 725 AD, and the first known references to Ester and Passover, both of which are English neologisms popularized, if not necessarily coined by Tyndale, were in 1526 AD, centuries after <i style=\"background-color: white; color: #222222; font-family: sans-serif; font-size: 14px;\">Paskha</i><span style=\"background-color: white; color: #222222; font-family: sans-serif; font-size: 14px;\"> (</span><span lang=\"grc\" style=\"background-color: white; color: #222222; font-family: sans-serif; font-size: 14px;\"><a class=\"extiw\" href=\"https://en.wiktionary.org/wiki/{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}CF{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}80{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}CE{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}AC{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}CF{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}83{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}CF{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}87{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}CE{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}B1#Ancient_Greek\" style=\"background: none; color: #663366; text-decoration-line: none;\" title=\"wikt:πάσχα\">πάσχα</a></span><span style=\"background-color: white; color: #222222; font-family: sans-serif; font-size: 14px;\">) </span>was first celebrated by Christians.</p><p>From Infogalactic’s Eostre page: <i>a Proto-Indo-European goddess of the dawn is supported both by the evidence of cognate names and the similarity of mythic representation of the dawn goddess among various Indo-European groups… all of this evidence permits us to posit a Proto-Indo-European *haéusōs ‘goddess of dawn’ who was characterized as a “reluctant” bringer of light for which she is punished.</i></p><p>Since Easter most likely means Resurrection, it is unnecessary, redundant, and more than a little spergish to make a point of trying to force “Resurrection Sunday” on others.</p></div>",
  "content_text": "A poster asked about Easter on SocialGalactic:\nWhy do churches say Easter? Isn’t Easter a pagan holiday? I’ve started to say Resurrection Sunday at church and ppl ignore me.\nEaster is not a pagan holiday. That’s atheist nonsense that requires an almost-complete ignorance of literally every foreign language but one. While there is a possible etymological link to the name of an Anglo-Saxon goddess named Eostre\nfor whom there is absolutely no evidence\noutside of the writings of the venerable, but inventive Bede, but since the Germans use “Easter” too and English is partially derived from German, the word is much more likely linked to the old German word for resurrection, which is\nErstehen\n.\nOne of the earliest appearances of “Easter” in English is in the Tyndale Bible, which actually refers to\nEster\n. Remember, the conventional accusation about Easter being a pagan holiday concerned Ishtar, an Akkadian goddess of love and war, but that was never a viable explanation because none of the other European languages have any possible etymological link to a pagan holiday. Their Paschae, Pasqua, Pâques, Pascua, etc. all trace back to Passover.\nSo, the usual suspects dug around the history books and came up with Eostre, who was not a German goddess and for whom there is no evidence in the German linguistic record. But they did posit – or to put more clearly, made up – a nonexistent precursor goddess to a probably-invented goddess, whose nonexistent holiday could theoretically have been coopted by English and German Christians in the Sixteenth Century while celebrating the\nErstehen\non\nPaschae\n.\nNeedless to say, this makes absolutely no sense to anyone who is capable of understanding the conventional ordering of cause and effect. Note in particular that the first and only known reference to Eostre is in 725 AD, and the first known references to Ester and Passover, both of which are English neologisms popularized, if not necessarily coined by Tyndale, were in 1526 AD, centuries after\nPaskha\n(\nπάσχα\n)\nwas first celebrated by Christians.\nFrom Infogalactic’s Eostre page:\na Proto-Indo-European goddess of the dawn is supported both by the evidence of cognate names and the similarity of mythic representation of the dawn goddess among various Indo-European groups… all of this evidence permits us to posit a Proto-Indo-European *haéusōs ‘goddess of dawn’ who was characterized as a “reluctant” bringer of light for which she is punished.\nSince Easter most likely means Resurrection, it is unnecessary, redundant, and more than a little spergish to make a point of trying to force “Resurrection Sunday” on others.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-16T11:03:30+00:00"
}