{
  "url": "https://voxday.net/2020/03/29/gamma-guaranteed/",
  "scraped_at": "2025-12-21T12:49:23.943277",
  "title": "Gamma, guaranteed",
  "date_display": "March 29, 2020",
  "date_iso": "2020-03-29T10:33:47+00:00",
  "date_from_url": "2020-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Then again, it was a moment that was beautiful <a href=\"https://www.theamericanmirror.com/2020/03/video-quarantined-new-yorker-tries-to-recreate-italy-magic-by-singing-out-window-but-is-told-to-shut-the-fk-up/\">in its own way</a>:</p><blockquote><p>Italy has been through hell and that moment was magical and raw and so very human.</p><p>However, the reason it was all of those beautiful things is that it happened organically, it came from the heart at a moment of desperation and maybe even some hopelessness. Those moments that come from such raw emotions are hard to recreate, even when the circumstances are similar.</p><p>A quarantined man in New York City discovered that the hard way when he tried to recreate that very magical moment by singing out his window.</p><p>However, instead of inspiring others to sing along, he was told to “shut the f*ck up!”</p></blockquote><p>That New Yorker is like the little kid at the wedding who goes up to the microphone and repeats the same thing that someone else just said that got a laugh. Neither the kid nor the New Yorker has any understanding of why his predecessors inspired a response, he just sees the opportunity to try to make himself the center of attention.</p><p>It may sound strange to higher-ranking individuals, but gammas are <i>constantly </i>thinking about how they can somehow impress everyone, when they’re not plotting revenge on those who inadvertently humiliated them in junior high, or stole the heart of their soul mate du jour, or called them out on YouTube, or…. you get the picture.</p></div>",
  "content_text": "Then again, it was a moment that was beautiful\nin its own way\n:\nItaly has been through hell and that moment was magical and raw and so very human.\nHowever, the reason it was all of those beautiful things is that it happened organically, it came from the heart at a moment of desperation and maybe even some hopelessness. Those moments that come from such raw emotions are hard to recreate, even when the circumstances are similar.\nA quarantined man in New York City discovered that the hard way when he tried to recreate that very magical moment by singing out his window.\nHowever, instead of inspiring others to sing along, he was told to “shut the f*ck up!”\nThat New Yorker is like the little kid at the wedding who goes up to the microphone and repeats the same thing that someone else just said that got a laugh. Neither the kid nor the New Yorker has any understanding of why his predecessors inspired a response, he just sees the opportunity to try to make himself the center of attention.\nIt may sound strange to higher-ranking individuals, but gammas are\nconstantly\nthinking about how they can somehow impress everyone, when they’re not plotting revenge on those who inadvertently humiliated them in junior high, or stole the heart of their soul mate du jour, or called them out on YouTube, or…. you get the picture.",
  "tags": [
    "Gamma"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-29T09:33:47+00:00"
}