{
  "url": "https://voxday.net/2020/03/21/hate-isnt-just-a-human-right/",
  "scraped_at": "2025-12-21T12:48:32.745474",
  "title": "Hate isn’t just a human right",
  "date_display": "March 21, 2020",
  "date_iso": "2020-03-21T14:09:40+00:00",
  "date_from_url": "2020-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hate is good for your health. Especially racial hate, if this Italian virologist <a href=\"https://summit.news/2020/03/20/italian-virologist-says-concerns-over-racism-crippled-italys-coronavirus-response/\">is to be believed</a>:</p><blockquote><p>An Italian virologist says that the country’s attempt not to appear “racist” in the early says of the coronavirus outbreak crippled the ability to properly respond to the pandemic. Professor of Virology and Microbiology at the University of Padova Dr. Giorgio Palù told CNN that measures imposing travel restrictions and border controls were taken too late due to fears over political correctness.</p><p>“There was a proposal to isolate people coming from the epicenter, coming from China,” Palù told CNN. “Then it became seen as racist, but they were people coming from the outbreak.”</p><p>Italy is now the hardest hit country in the world in terms of coronavirus deaths, with 3,405 people losing their lives.</p><p>The need to minimize potential “racism” and “stigmatization” in response to the coronavirus was a policy endorsed by the World Health Organization itself on numerous occasions and adopted by the left-wing Italian government.</p><p>As we previously highlighted, the Mayor of Florence launched a nationwide campaign at the start of February encouraging Italians to hug Chinese people on the street to “stem the hatred.”</p></blockquote><p>That Florentine campaign certainly didn’t age well. And if you weren’t already convinced that anti-racism is immoral, at least you should now be able to grasp that it is both unhygenic and anti-public health. President Trump’s “racist” action in shutting down travel from China earlier than the experts advised almost certainly saved many American lives.</p><p>Now contemplate how many more lives will be saved when similar “anti-racist” policies are abandoned. Imagine a return to crime-free shopping malls and safe neighborhoods where no one even needs to lock their doors. Regardless of what you believe about “racism”, do you genuinely believe it is worse than rape, murder, and the plague? Do you seriously believe it is worse than all of them <i>combined</i>?</p></div>",
  "content_text": "Hate is good for your health. Especially racial hate, if this Italian virologist\nis to be believed\n:\nAn Italian virologist says that the country’s attempt not to appear “racist” in the early says of the coronavirus outbreak crippled the ability to properly respond to the pandemic. Professor of Virology and Microbiology at the University of Padova Dr. Giorgio Palù told CNN that measures imposing travel restrictions and border controls were taken too late due to fears over political correctness.\n“There was a proposal to isolate people coming from the epicenter, coming from China,” Palù told CNN. “Then it became seen as racist, but they were people coming from the outbreak.”\nItaly is now the hardest hit country in the world in terms of coronavirus deaths, with 3,405 people losing their lives.\nThe need to minimize potential “racism” and “stigmatization” in response to the coronavirus was a policy endorsed by the World Health Organization itself on numerous occasions and adopted by the left-wing Italian government.\nAs we previously highlighted, the Mayor of Florence launched a nationwide campaign at the start of February encouraging Italians to hug Chinese people on the street to “stem the hatred.”\nThat Florentine campaign certainly didn’t age well. And if you weren’t already convinced that anti-racism is immoral, at least you should now be able to grasp that it is both unhygenic and anti-public health. President Trump’s “racist” action in shutting down travel from China earlier than the experts advised almost certainly saved many American lives.\nNow contemplate how many more lives will be saved when similar “anti-racist” policies are abandoned. Imagine a return to crime-free shopping malls and safe neighborhoods where no one even needs to lock their doors. Regardless of what you believe about “racism”, do you genuinely believe it is worse than rape, murder, and the plague? Do you seriously believe it is worse than all of them\ncombined\n?",
  "tags": [
    "healthcare"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-21T14:09:40+00:00"
}