{
  "url": "https://voxday.net/2020/03/09/how-not-to-do-customer-service/",
  "scraped_at": "2025-12-21T12:47:17.996700",
  "title": "How not to do customer service",
  "date_display": "March 9, 2020",
  "date_iso": "2020-03-09T11:27:59+00:00",
  "date_from_url": "2020-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s also interesting to see how incompetence permeates through every aspect of an organization. From Peter King’s weekly NFL column, to which I’m not going to bother to link because it is very long and mostly unrelated to the excerpted section:</p><blockquote class=\"tr_bq\"><p>Spike Lee has been a season ticket holder to Knicks games for about 30 years. He is America’s Sporting Masochist. He has evidently been entering Madison Square Garden through the media entrance for a while, and the Knicks wanted him to enter through the VIP entry gate instead. The Knicks picked last Monday night, when Lee was on a crowded elevator, to enforce the rule that he should be entering through the VIP entrance. According to Spike, he was asked to leave the building and re-enter through the proper gate. Lee said no. Which led to a fight, and Lee going on ESPN to lay waste to the Knicks, and the Knicks issuing a press release to rip Spike. As only it could, the New York Post hilariously labeled the brouhaha “Gategate.”</p></blockquote><p>Now, I am definitely not a subscriber to “the customer is always right” theory. Some customers are morons. Some are a massive pain in the posterior, so much so that one is better off without them as customers. As our valued supporters of <a href=\"https://www.patreon.com/castalia\">the Replatforming</a> know, I tend to prefer the “just RTFM, please” approach. But this sort of thing is stupid because it is so pointless and unnecessary. It obviously isn’t an actual problem, it’s just some autistic gamma in the organization sperging out about the fact that a category is being misapplied.</p><p>The correct thing to do is fire the autistic gamma for failure to be human, not publicly attack your best customer because his broken perspective of the world was offended.</p></div>",
  "content_text": "It’s also interesting to see how incompetence permeates through every aspect of an organization. From Peter King’s weekly NFL column, to which I’m not going to bother to link because it is very long and mostly unrelated to the excerpted section:\nSpike Lee has been a season ticket holder to Knicks games for about 30 years. He is America’s Sporting Masochist. He has evidently been entering Madison Square Garden through the media entrance for a while, and the Knicks wanted him to enter through the VIP entry gate instead. The Knicks picked last Monday night, when Lee was on a crowded elevator, to enforce the rule that he should be entering through the VIP entrance. According to Spike, he was asked to leave the building and re-enter through the proper gate. Lee said no. Which led to a fight, and Lee going on ESPN to lay waste to the Knicks, and the Knicks issuing a press release to rip Spike. As only it could, the New York Post hilariously labeled the brouhaha “Gategate.”\nNow, I am definitely not a subscriber to “the customer is always right” theory. Some customers are morons. Some are a massive pain in the posterior, so much so that one is better off without them as customers. As our valued supporters of\nthe Replatforming\nknow, I tend to prefer the “just RTFM, please” approach. But this sort of thing is stupid because it is so pointless and unnecessary. It obviously isn’t an actual problem, it’s just some autistic gamma in the organization sperging out about the fact that a category is being misapplied.\nThe correct thing to do is fire the autistic gamma for failure to be human, not publicly attack your best customer because his broken perspective of the world was offended.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-09T11:27:59+00:00"
}