{
  "url": "https://voxday.net/2020/03/16/mailvox-deal-with-it-boomer/",
  "scraped_at": "2025-12-21T12:47:56.359614",
  "title": "Mailvox: deal with it, Boomer",
  "date_display": "March 16, 2020",
  "date_iso": "2020-03-16T01:47:23+00:00",
  "date_from_url": "2020-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I am a boomer and an ER physician and I agree completely with your prioritizing younger people over older people when resources are limited and given that all other factors are equal. Unfortunately, they almost never are.</i></p><p>Except, of course, they already are now in many countries, and if events follow the expected course, they will be in the USA too. There are 5,000 respirators in the UK available to serve as many as 7.9 million cases. The Italians are already adopting triage practices and other European nations are anticipating the need to do so.</p><p><i>And frankly, this relentless boomer bashing and treating the worst of my generation as exemplary gets really annoying.</i><br><i><br/></i>This sensitivity is downright amusing. My generation has found the relentless Boomer boomering to be really annoying for as long as we can remember. You Boomers were annoying when you were getting divorced and our friends were returning to elementary school in the fall with haunted expressions and new last names. You were annoying when Led Zeppelin’s <i>Stairway to Heaven</i> was named the #1 most-requested song on the main rock station for the 25th year in a row. You were annoying when you first proclaimed 40 the new 30, then 50 the new 30, then 70 the new 50.</br></p><p>And Boomers are still every bit as annoying today. I recently saw a grotesque television commercial that literally showed incontinent old Boomer women rolling around in their underwear, with the tagline OUR BODIES CHANGE, BUT WHY SHOULD WE? The name of the commercial? Of course, it’s <a href=\"https://www.youtube.com/watch?v=F5yPmIckIjo\">AGELESS</a>. Companies wouldn’t still be marketing to the Boomer’s trademark generational narcissism if it didn’t continue to work for them.</p><p>The Boomers haven’t changed. They don’t want to change. They are still proud of who and what they are. And that is why the younger generations, particularly Generation X and the Zoomers, will continue to relentlessly despise them. The thing is, <i>we’ve been doing it all along</i>, they were just too self-absorbed to even notice. But now that the media culture no longer caters solely to them, they’re shocked to discover that they weren’t considered cool, they aren’t admired, and no one else wants to be like them.</p></div>",
  "content_text": "I am a boomer and an ER physician and I agree completely with your prioritizing younger people over older people when resources are limited and given that all other factors are equal. Unfortunately, they almost never are.\nExcept, of course, they already are now in many countries, and if events follow the expected course, they will be in the USA too. There are 5,000 respirators in the UK available to serve as many as 7.9 million cases. The Italians are already adopting triage practices and other European nations are anticipating the need to do so.\nAnd frankly, this relentless boomer bashing and treating the worst of my generation as exemplary gets really annoying.\nThis sensitivity is downright amusing. My generation has found the relentless Boomer boomering to be really annoying for as long as we can remember. You Boomers were annoying when you were getting divorced and our friends were returning to elementary school in the fall with haunted expressions and new last names. You were annoying when Led Zeppelin’s\nStairway to Heaven\nwas named the #1 most-requested song on the main rock station for the 25th year in a row. You were annoying when you first proclaimed 40 the new 30, then 50 the new 30, then 70 the new 50.\nAnd Boomers are still every bit as annoying today. I recently saw a grotesque television commercial that literally showed incontinent old Boomer women rolling around in their underwear, with the tagline OUR BODIES CHANGE, BUT WHY SHOULD WE? The name of the commercial? Of course, it’s\nAGELESS\n. Companies wouldn’t still be marketing to the Boomer’s trademark generational narcissism if it didn’t continue to work for them.\nThe Boomers haven’t changed. They don’t want to change. They are still proud of who and what they are. And that is why the younger generations, particularly Generation X and the Zoomers, will continue to relentlessly despise them. The thing is,\nwe’ve been doing it all along\n, they were just too self-absorbed to even notice. But now that the media culture no longer caters solely to them, they’re shocked to discover that they weren’t considered cool, they aren’t admired, and no one else wants to be like them.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-16T01:47:23+00:00"
}