{
  "url": "https://voxday.net/2020/03/07/mailvox-maybe-i-do-have-a-point/",
  "scraped_at": "2025-12-21T12:47:10.654130",
  "title": "Mailvox: maybe I do have a point",
  "date_display": "March 7, 2020",
  "date_iso": "2020-03-07T13:00:08+00:00",
  "date_from_url": "2020-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A critic apologizes for assuming my nonexistent heresy:</p><blockquote class=\"tr_bq\"><p>I wrote you a letter concerning the trinity of God and I want to apologize for scolding you. I have come to understand the revelation of The Bible better these past few days and I admit I jumped the gun in criticizing your argument about the trinity. There are apparent contradictions between The Bible and the teaching about The Trinity like many believe it. I think this stems from the wrong interpretation that the catholic church presents about God. I also went over your argument again and admit that there is a contradiction between The Word of God and this belief in The Trinity as it is many times taught in different circles.</p></blockquote><p>Accepted. As I frequently point out, any time an argument is reliant upon an observable falsehood or deception, it is usually being made in defense of a false position. The mere fact that I am frequently and erroneously criticized for not subscribing to “the Nicene Creed” when I am in fact the one subscribing to <a href=\"https://infogalactic.com/info/Nicene_Creed#Original_Nicene_Creed_of_325\">the actual Nicene Creed</a> of 325 as opposed to <a href=\"https://infogalactic.com/info/Nicene_Creed#Niceno-Constantinopolitan_Creed\">the Niceno-Constantinopolitan Creed</a> of 381 that most Christians wrongly believe to be “the Nicene Creed” should be sufficient to give the average critic pause.</p><p>It is also worth noting that the third Ecumenical Council of 431 reaffirmed the original 325 version of the Nicene Creed and rejected the later pseudo-Nicene version. And finally, you may wish to consider the fact that Sir Isaac Newton independently came to the same conclusion that I did. As for me, I could not care less if all the modern theologians from all the modern sects and churches and denominations declare otherwise. Given their assertions on various other theological matters, I tend to rather like our odds of being the party more in line with the truth.</p></div>",
  "content_text": "A critic apologizes for assuming my nonexistent heresy:\nI wrote you a letter concerning the trinity of God and I want to apologize for scolding you. I have come to understand the revelation of The Bible better these past few days and I admit I jumped the gun in criticizing your argument about the trinity. There are apparent contradictions between The Bible and the teaching about The Trinity like many believe it. I think this stems from the wrong interpretation that the catholic church presents about God. I also went over your argument again and admit that there is a contradiction between The Word of God and this belief in The Trinity as it is many times taught in different circles.\nAccepted. As I frequently point out, any time an argument is reliant upon an observable falsehood or deception, it is usually being made in defense of a false position. The mere fact that I am frequently and erroneously criticized for not subscribing to “the Nicene Creed” when I am in fact the one subscribing to\nthe actual Nicene Creed\nof 325 as opposed to\nthe Niceno-Constantinopolitan Creed\nof 381 that most Christians wrongly believe to be “the Nicene Creed” should be sufficient to give the average critic pause.\nIt is also worth noting that the third Ecumenical Council of 431 reaffirmed the original 325 version of the Nicene Creed and rejected the later pseudo-Nicene version. And finally, you may wish to consider the fact that Sir Isaac Newton independently came to the same conclusion that I did. As for me, I could not care less if all the modern theologians from all the modern sects and churches and denominations declare otherwise. Given their assertions on various other theological matters, I tend to rather like our odds of being the party more in line with the truth.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-07T13:00:08+00:00"
}