{
  "url": "https://voxday.net/2020/03/31/mailvox-the-king-of-all-secret-kings/",
  "scraped_at": "2025-12-21T12:49:36.052765",
  "title": "Mailvox: the king of all secret kings",
  "date_display": "March 31, 2020",
  "date_iso": "2020-03-31T15:00:03+00:00",
  "date_from_url": "2020-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BB believes he has discovered the King of all Secret Kings of fiction:</p><blockquote><p>I believe I’ve found the most Gamma book in existence. It’s called <i>Ready Player One</i>. It’s about a guy who has to play retro games and recite lines of dialogue from movies to win a fortune. In one scene it describes him perfectly reciting every line from Monty Python’s <i>The Holy Grail</i>, and how the people listening to him were cracking up and bursting into uncontrollable laughter as he did so.</p><p>The conversations between the protagonist and their friends are some of the worst examples of gamma behaviour I’ve ever seen unwittingly put on paper. Every scene displays the worst aspects of a Gamma.</p></blockquote><p>I find it very hard to believe this character could top Kvoth from <i>The Name of the Wind</i>, but he definitely sounds like a serious candidate. And note that both of these books were successful and very warmly received by the tattered remnants of SF fandom.</p><p>Of course, the characters tell us so much more about the authors than we ever wanted to know….</p></div>",
  "content_text": "BB believes he has discovered the King of all Secret Kings of fiction:\nI believe I’ve found the most Gamma book in existence. It’s called\nReady Player One\n. It’s about a guy who has to play retro games and recite lines of dialogue from movies to win a fortune. In one scene it describes him perfectly reciting every line from Monty Python’s\nThe Holy Grail\n, and how the people listening to him were cracking up and bursting into uncontrollable laughter as he did so.\nThe conversations between the protagonist and their friends are some of the worst examples of gamma behaviour I’ve ever seen unwittingly put on paper. Every scene displays the worst aspects of a Gamma.\nI find it very hard to believe this character could top Kvoth from\nThe Name of the Wind\n, but he definitely sounds like a serious candidate. And note that both of these books were successful and very warmly received by the tattered remnants of SF fandom.\nOf course, the characters tell us so much more about the authors than we ever wanted to know….",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-31T14:00:03+00:00"
}