{
  "url": "https://voxday.net/2020/03/22/mailvox-leaving-a-converged-company/",
  "scraped_at": "2025-12-21T12:48:39.176002",
  "title": "Mailvox: leaving a converged company",
  "date_display": "March 22, 2020",
  "date_iso": "2020-03-22T10:37:47+00:00",
  "date_from_url": "2020-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A reader writes about leaving his job. He’s doing the right thing, because he has correctly assessed the situation and that place is going to go out of business with or without the assistance of Corona-chan.</i></p><p>Today I handed in my resignation at my current work, after the situation the last few months has turned from bad to intolerable.</p><p>I am currently reading <i>Corporate Cancer</i>, and it has become quite obvious that I myself am working in a converged company. In this case it is the HR department that is leading the convergence. Interestingly, they are not going against the wish of the customers, but rather their own employees, more specifically the most valuable ones. I guess they are too difficult to work with because they have an opinion of their own?</p><p>This is a very new company without any revenue yet, but here are some examples of the HR-led convergence craziness:</p><ul><li>They are now doing all the hiring, even though none in HR knows anything about the industry</li><li>One colleague went from pre-HR employee of the year to “Drama King” within a few months, and was subsequently forced to quit. All because a young women at work that was in love with him repeatedly made complaints about him to HR because he did not reciprocate her feelings.</li><li>The same young woman, with no prior work experience – except for one year where she did less than what was required, spending most of her time complaining that her job was boring – was promoted to [a junior executive position].</li><li>They required that we should have transgender bathrooms, which resulted in unisex bathrooms instead, to the dismay of all the women.</li></ul><p>In the last four months four key employees have resigned, but they do not seem to understand the problem, or even be willing to see that there is one.</p><p><i>In general, however, I recommend always finding a new job before leaving the old one. But regardless of the ideal sequence, the point is to understand that a company’s convergence is a flashing red sign to start looking for work elsewhere.</i></p></div>",
  "content_text": "A reader writes about leaving his job. He’s doing the right thing, because he has correctly assessed the situation and that place is going to go out of business with or without the assistance of Corona-chan.\nToday I handed in my resignation at my current work, after the situation the last few months has turned from bad to intolerable.\nI am currently reading\nCorporate Cancer\n, and it has become quite obvious that I myself am working in a converged company. In this case it is the HR department that is leading the convergence. Interestingly, they are not going against the wish of the customers, but rather their own employees, more specifically the most valuable ones. I guess they are too difficult to work with because they have an opinion of their own?\nThis is a very new company without any revenue yet, but here are some examples of the HR-led convergence craziness:\nThey are now doing all the hiring, even though none in HR knows anything about the industry\nOne colleague went from pre-HR employee of the year to “Drama King” within a few months, and was subsequently forced to quit. All because a young women at work that was in love with him repeatedly made complaints about him to HR because he did not reciprocate her feelings.\nThe same young woman, with no prior work experience – except for one year where she did less than what was required, spending most of her time complaining that her job was boring – was promoted to [a junior executive position].\nThey required that we should have transgender bathrooms, which resulted in unisex bathrooms instead, to the dismay of all the women.\nIn the last four months four key employees have resigned, but they do not seem to understand the problem, or even be willing to see that there is one.\nIn general, however, I recommend always finding a new job before leaving the old one. But regardless of the ideal sequence, the point is to understand that a company’s convergence is a flashing red sign to start looking for work elsewhere.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-22T10:37:47+00:00"
}