{
  "url": "https://voxday.net/2020/03/14/mailvox-but-you-will-age-too/",
  "scraped_at": "2025-12-21T12:47:47.534539",
  "title": "Mailvox: but you will age too!",
  "date_display": "March 14, 2020",
  "date_iso": "2020-03-14T16:36:45+00:00",
  "date_from_url": "2020-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This email tends to demonstrate, as if it was necessary, the utter inability of Boomers to imagine that everyone else isn’t as relentlessly narcissistic as they are:</p><blockquote><p>After reading the “boomers need to be left to die” post I was reminded of something. Logan’s Run seemed to advance this basic strategy. Now though, facing another of the inevitable crises that blindside everyones cool plans, age has been upped to about 65+.</p><p>Allow me to exaggerate:</p><p>Sure sounds neat if you are younger. Because all the points you make are largely true. What you and the bulk of the responses put forth as the logical solution seems incredibly dangerous.</p><p>On one hand, if you really believe this, the consequences of the consequences may well roll right over you once it becomes the culture. Perhaps you could volunteer to self extinct upon achieving that benchmark age, because that is at the bottom of the slope you are promoting.</p><p>Second, when you successfully implement this “boomers must die” program, the message is: Now that you have spent your life paying and paying not only for your own family, but every unproductive fellow citizen the state could force upon you, just die already, now you are useless and unfortunately expensive.</p><p>Please, explain to me why anyone witnessing this regime would feel eager to work to support it, as any contribution in the positive you have made is deemed worthless at the cut off age.</p><p>This isn’t some butt hurt defense of being older. This crisis isn’t some Titanic sinking unexpectedly, this is simply life being random and deciding your new and better form of socialism is kill the old. How old is too old? When the bottom really drops out, is 65 too old? How about 40?  30?</p><p>Triage is fine, and necessary in short term disasters with small populations of a common culture and will obviously be employed until resources are found to save the remainder. Once you cast aside the elderly, you define life not worth living. Pick a demographic, demonize it. Replay Zimbabwe. $$$$$$$</p><p>And yes, boomers are not your friends and yes they have created a lousy situation. Many generations do. Are you promising your way is better? Because that is clearly what they thought.</p></blockquote><p>First, we know perfectly well that we will experience the consequences. So what? We don’t care! We have known we weren’t going to be collecting much, if anything, in the way of social security since literally the very first day we paid into it. We have known that our selfish, self-centered predecessors weren’t going to leave us any inheritances since we first started saving money. Our only mistake was to believe that they would at least leave us a functioning society. The Boomer’s very questions reveal his total ignorance of the generation that follows him, let alone the subsequent generations.</p><p> Second, this isn’t The Day of the Pillow. This isn’t a “Boomers must die” program. This is merely the time-honored, eucivilizational concept of “child-bearing women and children first”. Only a Boomer could possibly assume that not being prioritized is tantamount to a death sentence.</p><p>Third, the Boomer again reveals his narcissism. Who would work to support such a regime? The very same sort of men who have planted the acorns for the mighty oaks under whose shade they never sat for generation after generation. The fact that this is not only an alien concept, but one that is actually perceived <i>as a negative</i> one is something that damns the Boomer far more comprehensively than anything I can possibly say.</p><p>Fourth, we’re not those who “cast aside the elderly”. We loved our grandparents. We prioritize our children. The Boomers are those who adopted the twin philosophies of “never trusting anyone over thirty” and “he who dies with the most toys wins”. Yes, I promise that our way is better, because our way is the old way, the way of our ancestors, the way that you Boomers proudly rejected.</p><p>And fifth, whether what I have put forth as a logical solution is dangerous or not is irrelevant, because it is <i>inevitable</i>. The math doesn’t lie.</p><p>You made your beds. Now die in them, preferably with some dignity if you can muster it for the first time in your cursed dyscivilizational existences.</p></div>",
  "content_text": "This email tends to demonstrate, as if it was necessary, the utter inability of Boomers to imagine that everyone else isn’t as relentlessly narcissistic as they are:\nAfter reading the “boomers need to be left to die” post I was reminded of something. Logan’s Run seemed to advance this basic strategy. Now though, facing another of the inevitable crises that blindside everyones cool plans, age has been upped to about 65+.\nAllow me to exaggerate:\nSure sounds neat if you are younger. Because all the points you make are largely true. What you and the bulk of the responses put forth as the logical solution seems incredibly dangerous.\nOn one hand, if you really believe this, the consequences of the consequences may well roll right over you once it becomes the culture. Perhaps you could volunteer to self extinct upon achieving that benchmark age, because that is at the bottom of the slope you are promoting.\nSecond, when you successfully implement this “boomers must die” program, the message is: Now that you have spent your life paying and paying not only for your own family, but every unproductive fellow citizen the state could force upon you, just die already, now you are useless and unfortunately expensive.\nPlease, explain to me why anyone witnessing this regime would feel eager to work to support it, as any contribution in the positive you have made is deemed worthless at the cut off age.\nThis isn’t some butt hurt defense of being older. This crisis isn’t some Titanic sinking unexpectedly, this is simply life being random and deciding your new and better form of socialism is kill the old. How old is too old? When the bottom really drops out, is 65 too old? How about 40?  30?\nTriage is fine, and necessary in short term disasters with small populations of a common culture and will obviously be employed until resources are found to save the remainder. Once you cast aside the elderly, you define life not worth living. Pick a demographic, demonize it. Replay Zimbabwe. $$$$$$$\nAnd yes, boomers are not your friends and yes they have created a lousy situation. Many generations do. Are you promising your way is better? Because that is clearly what they thought.\nFirst, we know perfectly well that we will experience the consequences. So what? We don’t care! We have known we weren’t going to be collecting much, if anything, in the way of social security since literally the very first day we paid into it. We have known that our selfish, self-centered predecessors weren’t going to leave us any inheritances since we first started saving money. Our only mistake was to believe that they would at least leave us a functioning society. The Boomer’s very questions reveal his total ignorance of the generation that follows him, let alone the subsequent generations.\nSecond, this isn’t The Day of the Pillow. This isn’t a “Boomers must die” program. This is merely the time-honored, eucivilizational concept of “child-bearing women and children first”. Only a Boomer could possibly assume that not being prioritized is tantamount to a death sentence.\nThird, the Boomer again reveals his narcissism. Who would work to support such a regime? The very same sort of men who have planted the acorns for the mighty oaks under whose shade they never sat for generation after generation. The fact that this is not only an alien concept, but one that is actually perceived\nas a negative\none is something that damns the Boomer far more comprehensively than anything I can possibly say.\nFourth, we’re not those who “cast aside the elderly”. We loved our grandparents. We prioritize our children. The Boomers are those who adopted the twin philosophies of “never trusting anyone over thirty” and “he who dies with the most toys wins”. Yes, I promise that our way is better, because our way is the old way, the way of our ancestors, the way that you Boomers proudly rejected.\nAnd fifth, whether what I have put forth as a logical solution is dangerous or not is irrelevant, because it is\ninevitable\n. The math doesn’t lie.\nYou made your beds. Now die in them, preferably with some dignity if you can muster it for the first time in your cursed dyscivilizational existences.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-14T16:36:45+00:00"
}