{
  "url": "https://voxday.net/2020/03/18/qspiracy-goes-international/",
  "scraped_at": "2025-12-21T12:48:18.725425",
  "title": "Qspiracy goes international",
  "date_display": "March 18, 2020",
  "date_iso": "2020-03-18T14:57:49+00:00",
  "date_from_url": "2020-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting that rumors have progressed to the point that the celebrities are being forced <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-8124811/Oprah-Winfrey-debunks-fake-news-arrested-sex-trafficking.html\">to publicly deny their arrests</a> on sex trafficking charges:</p><blockquote><p>Media mogul Oprah Winfrey was a trending topic on Tuesday night, as a conspiracy theory stemming from QAnon went viral, but Winfrey herself debunked it. Numerous bogus reports claimed that Winfrey’s home in Boca Raton, Florida was raided and that she was under arrest on sex trafficking charges.</p><p>After being a top trending topic for several hours, the 66-year-old Winfrey was informed that she was trending, and made it clear the rumors were not true.</p><p>‘Just got a phone call that my name is trending. And being trolled for some awful FAKE thing. It’s NOT TRUE,’ Winfrey began.</p><p>‘Haven’t been raided, or arrested. Just sanitizing and self distancing with the rest of the world. Stay safe everybody,’ she concluded from her verified Twitter account.</p><p>There were also reports of raids on her home, and that she was just one of many celebrities arrested, including Tom Hanks, whose Coronavirus infection was supposedly a ‘cover’ for his arrest. The next supposed celebrity arrests for ‘pedophilia’ are Celine Dion, Madonna, Charley Barkley and Kevin Spacey who will all claim to have the Coronavirus.</p></blockquote><p>The net appears to be closing in upon the bad actors. Remember, it wasn’t all that long ago that the conspiracy theories and rumors about Epstein and Weinstein were declared to be NOT TRUE as well. That doesn’t meant that these specific people are genuinely the culpable parties or that there is anything more to the most recent rumors than trolling from the chans, but it does tend to suggest that there is enough activity taking place to convince an increasing number of people that there is more fire to be found beneath all the smoke.</p><p><b>UPDATE: </b>Speaking of fire, Homeland Security is now circulating plans concerning martial law, interstate travel bans, and evening curfews. This is from multiple law enforcement sources in different states. It doesn’t mean that the plans will be implemented, necessarily, but this activity is a precursor to any such actions being taken once the decisions are made.</p><p>Don’t despair. This could all be very good news in the end.</p></div>",
  "content_text": "It’s interesting that rumors have progressed to the point that the celebrities are being forced\nto publicly deny their arrests\non sex trafficking charges:\nMedia mogul Oprah Winfrey was a trending topic on Tuesday night, as a conspiracy theory stemming from QAnon went viral, but Winfrey herself debunked it. Numerous bogus reports claimed that Winfrey’s home in Boca Raton, Florida was raided and that she was under arrest on sex trafficking charges.\nAfter being a top trending topic for several hours, the 66-year-old Winfrey was informed that she was trending, and made it clear the rumors were not true.\n‘Just got a phone call that my name is trending. And being trolled for some awful FAKE thing. It’s NOT TRUE,’ Winfrey began.\n‘Haven’t been raided, or arrested. Just sanitizing and self distancing with the rest of the world. Stay safe everybody,’ she concluded from her verified Twitter account.\nThere were also reports of raids on her home, and that she was just one of many celebrities arrested, including Tom Hanks, whose Coronavirus infection was supposedly a ‘cover’ for his arrest. The next supposed celebrity arrests for ‘pedophilia’ are Celine Dion, Madonna, Charley Barkley and Kevin Spacey who will all claim to have the Coronavirus.\nThe net appears to be closing in upon the bad actors. Remember, it wasn’t all that long ago that the conspiracy theories and rumors about Epstein and Weinstein were declared to be NOT TRUE as well. That doesn’t meant that these specific people are genuinely the culpable parties or that there is anything more to the most recent rumors than trolling from the chans, but it does tend to suggest that there is enough activity taking place to convince an increasing number of people that there is more fire to be found beneath all the smoke.\nUPDATE:\nSpeaking of fire, Homeland Security is now circulating plans concerning martial law, interstate travel bans, and evening curfews. This is from multiple law enforcement sources in different states. It doesn’t mean that the plans will be implemented, necessarily, but this activity is a precursor to any such actions being taken once the decisions are made.\nDon’t despair. This could all be very good news in the end.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-18T14:57:49+00:00"
}