{
  "url": "https://voxday.net/2020/03/27/the-ticket-sale/",
  "scraped_at": "2025-12-21T12:49:11.061319",
  "title": "The ticket sale",
  "date_display": "March 27, 2020",
  "date_iso": "2020-03-27T13:20:28+00:00",
  "date_from_url": "2020-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tanith Lee, the late, great dark fantasy writer, rather succinctly describes the putative appeal of the ticket to those who take it in <i>Le Livre Safran</i>:</p><p><i>“It is Lucifer, Lord Satan, who rules the world,” said the priest. “To survive here, we’re bound to worship him.”</i><br><i><br/></i><i>He showed them a drawing on parchment, a rose transfixed by a dagger.</i><br><i><br/></i><i>“Remember this sign. We meet here, under the old church. You will be obliged to render passwords. In time, who knows what riches and power we shall accumulate, through the favour of our Master. I myself,” he said, “survived the plague. That was his sign to me. God smote me, but Satan raised me to do his work and glorify him. You’re an artist of the City. Who spoke to you of this secret society?”</i><br><i><br/></i><i>“Several,” said the young man. “But Motius the Artisan was once my tutor.”</i><br><i><br/></i><i>“The magician? Yes. His house was burned up and flaming fiends carried him to Hell. You understand, there’s no escape at last. It ends in fire.”</i><br><i><br/></i><i>“Hah. Yes.” The young man smiled.</i><br><i><br/></i><i>“But meanwhile, a life of wishes fulfilled. His servants he never cheats. All the joys of the flesh, full dominion over others. The end is horror, but you may have three hundred years of pleasures before that payment comes due.”</i></br></br></br></br></br></br></p><p>Of course, even when the prince of this world purports to be telling the truth, he deceives. He ALWAYS cheats his servants; indeed, they are the only souls over whom he has total power to use and abuse as he sees fit. And when a servant ceases to be useful, he is, like Hawkins in <i>The Dark is Rising</i> or Harvey Weinstein in Hollywood, hurled from the Black Rider’s high horse to break upon the ground.</p><p>This is the primary danger of atheism and nihilism. These false philosophies render one susceptible to the illusion that one trades nothing for something of value when one is offered the ticket. But the reverse is considerably more close to being true.</p></div>",
  "content_text": "Tanith Lee, the late, great dark fantasy writer, rather succinctly describes the putative appeal of the ticket to those who take it in\nLe Livre Safran\n:\n“It is Lucifer, Lord Satan, who rules the world,” said the priest. “To survive here, we’re bound to worship him.”\nHe showed them a drawing on parchment, a rose transfixed by a dagger.\n“Remember this sign. We meet here, under the old church. You will be obliged to render passwords. In time, who knows what riches and power we shall accumulate, through the favour of our Master. I myself,” he said, “survived the plague. That was his sign to me. God smote me, but Satan raised me to do his work and glorify him. You’re an artist of the City. Who spoke to you of this secret society?”\n“Several,” said the young man. “But Motius the Artisan was once my tutor.”\n“The magician? Yes. His house was burned up and flaming fiends carried him to Hell. You understand, there’s no escape at last. It ends in fire.”\n“Hah. Yes.” The young man smiled.\n“But meanwhile, a life of wishes fulfilled. His servants he never cheats. All the joys of the flesh, full dominion over others. The end is horror, but you may have three hundred years of pleasures before that payment comes due.”\nOf course, even when the prince of this world purports to be telling the truth, he deceives. He ALWAYS cheats his servants; indeed, they are the only souls over whom he has total power to use and abuse as he sees fit. And when a servant ceases to be useful, he is, like Hawkins in\nThe Dark is Rising\nor Harvey Weinstein in Hollywood, hurled from the Black Rider’s high horse to break upon the ground.\nThis is the primary danger of atheism and nihilism. These false philosophies render one susceptible to the illusion that one trades nothing for something of value when one is offered the ticket. But the reverse is considerably more close to being true.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-27T13:20:28+00:00"
}