{
  "url": "https://voxday.net/2020/03/24/the-need-for-a-debt-jubilee/",
  "scraped_at": "2025-12-21T12:48:50.229739",
  "title": "The need for a debt jubilee",
  "date_display": "March 24, 2020",
  "date_iso": "2020-03-24T12:44:24+00:00",
  "date_from_url": "2020-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not often that I agree with socialist economics, but in this case, my only disagreement with Michael Hudson’s argument is that we are quite obviously already in a depression. It’s too late to avoid it, but <a href=\"https://www.unz.com/mhudson/a-debt-jubilee-is-the-only-way-to-avoid-a-depression/\">a debt jubilee</a> – as commanded by the Bible – is both a way to end the depression and free the productive classes from the chains of a relentlessly rapacious and entirely anti-productive financial elite:</p><blockquote><p>Even before the coronavirus appeared, many American families were falling behind on student loans, auto loans, credit card balances and other payments. America’s debt overhead was pricing its labor and industry out of world markets. A debt crisis was inevitable eventually, but covid-19 has made it immediate.</p><p>Massive social distancing, with its accompanying job losses, stock dives, and huge bailouts to debt-strapped corporations, raises the threat of a depression. But it doesn’t have to be this way. History offers us another alternative in such situations: a debt jubilee. This slate-cleaning, balance-restoring step recognizes the fundamental truth that when debts grow too large to be paid without reducing debtors to poverty, the way to hold society together and restore balance is simply to cancel the bad debts.</p><p>The word Jubilee comes from the Hebrew word for trumpet — yobel. In Mosaic Law, it was blown every fifty years to signal the Year of the Lord, in which personal debts were to be cancelled. The alternative, the prophet Isaiah warned, was for smallholders to forfeit their lands to creditors: “Woe to you who add house to house and join field to field till no space is left and you live alone in the land.” When Jesus delivered his first sermon, the Gospel of Luke describes him as unrolling the scroll of Isaiah and announcing that he had come to proclaim the Year of the Lord, the Jubilee Year.</p><p>Until recently, historians doubted that such a debt jubilee would have been possible in practice, or that such proclamations could have been enforced. But Assyriologists have found that from the beginning of recorded history in the Near East, it was normal for new rulers to proclaim a debt amnesty upon taking the throne. Instead of blowing a trumpet, the ruler “raised the sacred torch” to signal the amnesty.</p><p>It is now understood that these rulers were not being utopian or idealistic in forgiving debts. The alternative would have been for debtors to fall into bondage. Kingdoms would have lost their labor force, since so many would be working off debts to their creditors. Many debtors would have run away (much as Greeks emigrated en masse after their recent debt crisis) and communities would have been prone to attack from without.</p><p>The parallels to the current moment are notable. The U.S. economy has polarized sharply since the 2008 financial crisis. For far too many, the debts in place leave little income available for spending on goods and services or in the national interest. In a crashing economy, any demand that newly massive debts be paid to a financial class that has already absorbed most of the wealth gained since 2008 can only further split our society.</p><p>The way to restore normalcy today is a debt writedown. The debts in deepest arrears, and most likely to default, are student debts, medical debts, general consumer debts and purely speculative debts. They block spending on goods and services, shrinking the “real” economy. A debt writedown would be pragmatic, not merely a moral sympathy with the less affluent.</p></blockquote><p>Financialization does not help the economy by making it more efficient. To the contrary, it makes the economy far more fragile while destroying the underlying society for the benefit of a few foreign invaders.</p></div>",
  "content_text": "It’s not often that I agree with socialist economics, but in this case, my only disagreement with Michael Hudson’s argument is that we are quite obviously already in a depression. It’s too late to avoid it, but\na debt jubilee\n– as commanded by the Bible – is both a way to end the depression and free the productive classes from the chains of a relentlessly rapacious and entirely anti-productive financial elite:\nEven before the coronavirus appeared, many American families were falling behind on student loans, auto loans, credit card balances and other payments. America’s debt overhead was pricing its labor and industry out of world markets. A debt crisis was inevitable eventually, but covid-19 has made it immediate.\nMassive social distancing, with its accompanying job losses, stock dives, and huge bailouts to debt-strapped corporations, raises the threat of a depression. But it doesn’t have to be this way. History offers us another alternative in such situations: a debt jubilee. This slate-cleaning, balance-restoring step recognizes the fundamental truth that when debts grow too large to be paid without reducing debtors to poverty, the way to hold society together and restore balance is simply to cancel the bad debts.\nThe word Jubilee comes from the Hebrew word for trumpet — yobel. In Mosaic Law, it was blown every fifty years to signal the Year of the Lord, in which personal debts were to be cancelled. The alternative, the prophet Isaiah warned, was for smallholders to forfeit their lands to creditors: “Woe to you who add house to house and join field to field till no space is left and you live alone in the land.” When Jesus delivered his first sermon, the Gospel of Luke describes him as unrolling the scroll of Isaiah and announcing that he had come to proclaim the Year of the Lord, the Jubilee Year.\nUntil recently, historians doubted that such a debt jubilee would have been possible in practice, or that such proclamations could have been enforced. But Assyriologists have found that from the beginning of recorded history in the Near East, it was normal for new rulers to proclaim a debt amnesty upon taking the throne. Instead of blowing a trumpet, the ruler “raised the sacred torch” to signal the amnesty.\nIt is now understood that these rulers were not being utopian or idealistic in forgiving debts. The alternative would have been for debtors to fall into bondage. Kingdoms would have lost their labor force, since so many would be working off debts to their creditors. Many debtors would have run away (much as Greeks emigrated en masse after their recent debt crisis) and communities would have been prone to attack from without.\nThe parallels to the current moment are notable. The U.S. economy has polarized sharply since the 2008 financial crisis. For far too many, the debts in place leave little income available for spending on goods and services or in the national interest. In a crashing economy, any demand that newly massive debts be paid to a financial class that has already absorbed most of the wealth gained since 2008 can only further split our society.\nThe way to restore normalcy today is a debt writedown. The debts in deepest arrears, and most likely to default, are student debts, medical debts, general consumer debts and purely speculative debts. They block spending on goods and services, shrinking the “real” economy. A debt writedown would be pragmatic, not merely a moral sympathy with the less affluent.\nFinancialization does not help the economy by making it more efficient. To the contrary, it makes the economy far more fragile while destroying the underlying society for the benefit of a few foreign invaders.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-03-24T12:44:24+00:00"
}