{
  "url": "https://voxday.net/2020/09/21/castalia-library-donation/",
  "scraped_at": "2025-12-21T13:08:37.222090",
  "title": "Castalia Library donation",
  "date_display": "September 21, 2020",
  "date_iso": "2020-09-21T23:31:01+00:00",
  "date_from_url": "2020-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\">First, I would like to thank the extremely generous – and by their own preference, anonymous – donors</div><p> who very graciously donated an entire YEAR of Castalia Library to <b style=\"text-decoration-line: line-through;\">SIX</b><b>  <i>SEVEN </i></b>families. The families will be alerted by email tonight. As I mentioned when the offer was made, Castalia will be adding <i>LIVES Vol. I</i> by Plutarch to the donations, so each of the six families selected will receive seven deluxe books bound in topgrain cowhide. I am truly amazed by the generousness of this community and the ready willingness shown by those who with more resources to help those with less, as well as the depth of the concern demonstrated for the future generations.</p><p>These donors will never sit in the shade of the trees they are planting, but they have gone out of their way to plant intellectual acorns nevertheless. Let us hope they turn out to be mighty oaks indeed.</p><p>As subscribers know, one of these seven books will be <i>Summa Elvetica </i>by yours truly, Book 7 in the Library subscription and Book I in the Library/Libraria sets of <i>Arts of Dark and Light</i>. I’m taking this opportunity to introduce the cover of <a href=\"https://arkhavencomics.com/product/summa-library/\" rel=\"noopener noreferrer\" target=\"_blank\">the Library edition</a>, seen below, and to announce that it will be a) a signed edition that is b) available as a one-off purchase to non-subscribers. We’re cutting the retail price from $150 to $115 due to the high level of interest in the book, and subscribers should note that they will receive a new discount code soon in the event they wish to purchase additional copies.</p><p>We won’t know what the print run will be until the end of December, but we will keep it under 2500.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://arkhavencomics.com/wp-content/uploads/2020/09/Library07_960.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"800\" data-original-width=\"500\" decoding=\"async\" height=\"320\" loading=\"lazy\" src=\"https://arkhavencomics.com/wp-content/uploads/2020/09/Library07_960.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"800\" data-original-width=\"500\" data-src=\"https://arkhavencomics.com/wp-content/uploads/2020/09/Library07_960.jpg\" decoding=\"async\" height=\"320\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20500%20800%22%3E%3C/svg%3E\" width=\"200\"/></a></div></div>",
  "content_text": "First, I would like to thank the extremely generous – and by their own preference, anonymous – donors\nwho very graciously donated an entire YEAR of Castalia Library to\nSIX\nSEVEN\nfamilies. The families will be alerted by email tonight. As I mentioned when the offer was made, Castalia will be adding\nLIVES Vol. I\nby Plutarch to the donations, so each of the six families selected will receive seven deluxe books bound in topgrain cowhide. I am truly amazed by the generousness of this community and the ready willingness shown by those who with more resources to help those with less, as well as the depth of the concern demonstrated for the future generations.\nThese donors will never sit in the shade of the trees they are planting, but they have gone out of their way to plant intellectual acorns nevertheless. Let us hope they turn out to be mighty oaks indeed.\nAs subscribers know, one of these seven books will be\nSumma Elvetica\nby yours truly, Book 7 in the Library subscription and Book I in the Library/Libraria sets of\nArts of Dark and Light\n. I’m taking this opportunity to introduce the cover of\nthe Library edition\n, seen below, and to announce that it will be a) a signed edition that is b) available as a one-off purchase to non-subscribers. We’re cutting the retail price from $150 to $115 due to the high level of interest in the book, and subscribers should note that they will receive a new discount code soon in the event they wish to purchase additional copies.\nWe won’t know what the print run will be until the end of December, but we will keep it under 2500.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-21T22:31:01+00:00"
}