{
  "url": "https://voxday.net/2020/09/14/conspiracy-history/",
  "scraped_at": "2025-12-21T13:07:44.894039",
  "title": "Conspiracy History",
  "date_display": "September 14, 2020",
  "date_iso": "2020-09-14T12:16:41+00:00",
  "date_from_url": "2020-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Conspiracy is not theory, it is history. In Machiavelli’s <i>History of Florence</i>, he records literally dozens of conspiracies aimed at controlling the government of a single city. Whether it is the conspiracy to assassinate Giuliano and Lorenzo de’ Medici or the conspiracy of the Duke of Milan with the Canneschi family to dislodge the Bentivogli family from its position of primacy in Bologna in order to disrupt that city’s alliance with Venice and Florence, his history of the Italian peninsula is literally full of documented conspiracies in every single chapter.</p><p>And there is evidence – copious evidence – of the Promethean conspiracy to rule the entire world dating back centuries, <a href=\"https://twitter.com/SeekerOTL/status/1121568398285127680\" rel=\"noopener noreferrer\" target=\"_blank\">with more being uncovered</a> all the time.</p><blockquote><p>THE MYSTERIOUS HOTEL AT THE CENTER OF SPYGATE</p><p>Hotels play an important role in the story of the Deep State conspiracy against the President who, aptly, made his fortune building hotels. One hotel, however, stands out from the rest. Andaz</p><p>The site where the Andaz hotel stands today in the City of London was originally occupied by the Bethlem Royal Hospital. </p><p>The hospital was founded in 1247 by the Italian Bishop of Bethlehem, Goffredo de Prefetti, to care for those deemed insane. By the 1600’s, the institution had become synonymous with madness itself. The locals called it ‘bedlam,’ the word has since entered the English language to mean chaos and disorder.</p><p>Due to the cruel and inhumane treatment received by patients, the hospital  closed and moved to another site.</p><p>In 1884, the Liverpool Street Hotel (later changed to the Great Eastern Hotel) was built on the former site of the hospital. The architectural giants, Charles and Edward Barry, were the designers. In Bram Stoker’s classic horror novel, Dracula, the vampire hunter Van Helsing stays at the Great Eastern Hotel on a visit to London.</p><p>In the 1990’s, as the hotel was in the process of being refurbished, engineers noticed discrepancies in the blueprints. Upon further investigation, they discovered a majestic Masonic temple hidden behind false walls.</p></blockquote><p>But it’s all just <i>conspiracy theory</i>, right?  I mean, how crazy would it sound to insist that a famous hotel has a secret Masonic temple hidden inside it? And who, one wonders, was taking part in the occult rituals being performed there? At some point, you are going to have to admit that your blindness to the increasingly apparent reality of the spiritual war surrounding you is an intentional choice on your part.</p><p>Hanlon’s Razor is an aphorism designed to mislead the midwitted. “Never attribute to malice that which is adequately explained by stupidity” is simply false. It would be far more accurate to say: “Never attribute to stupidity that which could be motivated by evil.” This is because evil, being intrinsically subject to falsehood, is inevitably going to look stupid at times to anyone who possesses even a modicum of the relevant truth.</p></div>",
  "content_text": "Conspiracy is not theory, it is history. In Machiavelli’s\nHistory of Florence\n, he records literally dozens of conspiracies aimed at controlling the government of a single city. Whether it is the conspiracy to assassinate Giuliano and Lorenzo de’ Medici or the conspiracy of the Duke of Milan with the Canneschi family to dislodge the Bentivogli family from its position of primacy in Bologna in order to disrupt that city’s alliance with Venice and Florence, his history of the Italian peninsula is literally full of documented conspiracies in every single chapter.\nAnd there is evidence – copious evidence – of the Promethean conspiracy to rule the entire world dating back centuries,\nwith more being uncovered\nall the time.\nTHE MYSTERIOUS HOTEL AT THE CENTER OF SPYGATE\nHotels play an important role in the story of the Deep State conspiracy against the President who, aptly, made his fortune building hotels. One hotel, however, stands out from the rest. Andaz\nThe site where the Andaz hotel stands today in the City of London was originally occupied by the Bethlem Royal Hospital.\nThe hospital was founded in 1247 by the Italian Bishop of Bethlehem, Goffredo de Prefetti, to care for those deemed insane. By the 1600’s, the institution had become synonymous with madness itself. The locals called it ‘bedlam,’ the word has since entered the English language to mean chaos and disorder.\nDue to the cruel and inhumane treatment received by patients, the hospital  closed and moved to another site.\nIn 1884, the Liverpool Street Hotel (later changed to the Great Eastern Hotel) was built on the former site of the hospital. The architectural giants, Charles and Edward Barry, were the designers. In Bram Stoker’s classic horror novel, Dracula, the vampire hunter Van Helsing stays at the Great Eastern Hotel on a visit to London.\nIn the 1990’s, as the hotel was in the process of being refurbished, engineers noticed discrepancies in the blueprints. Upon further investigation, they discovered a majestic Masonic temple hidden behind false walls.\nBut it’s all just\nconspiracy theory\n, right?  I mean, how crazy would it sound to insist that a famous hotel has a secret Masonic temple hidden inside it? And who, one wonders, was taking part in the occult rituals being performed there? At some point, you are going to have to admit that your blindness to the increasingly apparent reality of the spiritual war surrounding you is an intentional choice on your part.\nHanlon’s Razor is an aphorism designed to mislead the midwitted. “Never attribute to malice that which is adequately explained by stupidity” is simply false. It would be far more accurate to say: “Never attribute to stupidity that which could be motivated by evil.” This is because evil, being intrinsically subject to falsehood, is inevitably going to look stupid at times to anyone who possesses even a modicum of the relevant truth.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-14T11:16:41+00:00"
}