{
  "url": "https://voxday.net/2020/09/12/doomed-to-repeat-history/",
  "scraped_at": "2025-12-21T13:07:33.421890",
  "title": "Doomed to repeat history",
  "date_display": "September 12, 2020",
  "date_iso": "2020-09-12T12:59:27+00:00",
  "date_from_url": "2020-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The reason I stress the importance of developing a regular habit of reading history, especially those histories that are not on the A-list of classics recommended by generation after generation of historians, is that it is the only way to develop a sense of pattern recognition for large-scale events taking place over an extended period of time. Notice how the growing chaos we are witnessing in the United States and elsewhere across the invaded West would not be lost on Machiavelli. He would have immediately recognized the situation as being the inevitable consequence of a republic being overrun by people with different customs, modes of living, religions, and languages, and would also have been able to predict the eventual consequences for that republic, as this selection from his <b>History of Florence and of the Affairs of Italy</b> demonstrates.</i></p><p>For surely if any times were truly miserable for Italy and the provinces overrun by the barbarians, they were those which occurred from Arcadius and Honorius to Theodoric. If we only consider the evils which arise to a republic or a kingdom by a change of prince or of government; not by foreign interference, but by civil discord (in which we may see how even slight variations suffice to ruin the most powerful kingdoms or states), we may then easily imagine how much Italy and the other Roman provinces suffered, when they not only changed their forms of government and their princes, but also their laws, customs, modes of living, religion, language, and name. Any one of such changes, by itself, without being united with others, might, with thinking of it, to say nothing of the seeing and suffering, infuse terror into the strongest minds.</p><p>From these causes proceeded the ruin as well as the origin and extension of many cities. Among those which were ruined were Aquileia, Luni, Chiusi, Popolonia, Fiesole, and many others. The new cities were Venice, Sienna, Ferrara, Aquila, with many towns and castles which for brevity we omit. Those which became extended were Florence, Genoa, Pisa, Milan, Naples, and Bologna; to all of which may be added, the ruin and restoration of Rome, and of many other cities not previously mentioned.</p><p>From this devastation and new population arose new languages, as we see in the different dialects of France, Spain and Italy; which, partaking of the native idiom of the new people and of the old Roman, formed a new manner of discourse. Besides, not only were the names of provinces changed, but also of lakes, rivers, seas, and men; for France, Spain, and Italy are full of fresh names, wholly different from the ancient; as, omitting many others, we see that the Po, the Garda, the Archipelago, are names quite different from those which the ancients used; while instead of Cæsar and Pompey we have Peter, Matthew, John, etc.</p><p>Among so many variations, that of religion was not of little importance; for, while combating the customs of the ancient faith with the miracles of the new, very serious troubles and discords were created among men. And if the Christians had been united in one faith, fewer disorders would have followed; but the contentions among themselves, of the churches of Rome, Greece, and Ravenna, joined to those of the heretic sects with the Catholics, served in many ways to render the world miserable. Africa is a proof of this; having suffered more horrors from the Arian sect, whose doctrines were believed by the Vandals, than from any avarice or natural cruelty of the people themselves. Living amid so many persecutions, the countenances of men bore witness of the terrible impressions upon their minds; for besides the evils they suffered from the disordered state of the world, they scarcely could have recourse to the help of God, in whom the unhappy hope for relief; for the greater part of them, being uncertain what divinity they ought to address, died miserably, without help and without hope.</p></div>",
  "content_text": "The reason I stress the importance of developing a regular habit of reading history, especially those histories that are not on the A-list of classics recommended by generation after generation of historians, is that it is the only way to develop a sense of pattern recognition for large-scale events taking place over an extended period of time. Notice how the growing chaos we are witnessing in the United States and elsewhere across the invaded West would not be lost on Machiavelli. He would have immediately recognized the situation as being the inevitable consequence of a republic being overrun by people with different customs, modes of living, religions, and languages, and would also have been able to predict the eventual consequences for that republic, as this selection from his\nHistory of Florence and of the Affairs of Italy\ndemonstrates.\nFor surely if any times were truly miserable for Italy and the provinces overrun by the barbarians, they were those which occurred from Arcadius and Honorius to Theodoric. If we only consider the evils which arise to a republic or a kingdom by a change of prince or of government; not by foreign interference, but by civil discord (in which we may see how even slight variations suffice to ruin the most powerful kingdoms or states), we may then easily imagine how much Italy and the other Roman provinces suffered, when they not only changed their forms of government and their princes, but also their laws, customs, modes of living, religion, language, and name. Any one of such changes, by itself, without being united with others, might, with thinking of it, to say nothing of the seeing and suffering, infuse terror into the strongest minds.\nFrom these causes proceeded the ruin as well as the origin and extension of many cities. Among those which were ruined were Aquileia, Luni, Chiusi, Popolonia, Fiesole, and many others. The new cities were Venice, Sienna, Ferrara, Aquila, with many towns and castles which for brevity we omit. Those which became extended were Florence, Genoa, Pisa, Milan, Naples, and Bologna; to all of which may be added, the ruin and restoration of Rome, and of many other cities not previously mentioned.\nFrom this devastation and new population arose new languages, as we see in the different dialects of France, Spain and Italy; which, partaking of the native idiom of the new people and of the old Roman, formed a new manner of discourse. Besides, not only were the names of provinces changed, but also of lakes, rivers, seas, and men; for France, Spain, and Italy are full of fresh names, wholly different from the ancient; as, omitting many others, we see that the Po, the Garda, the Archipelago, are names quite different from those which the ancients used; while instead of Cæsar and Pompey we have Peter, Matthew, John, etc.\nAmong so many variations, that of religion was not of little importance; for, while combating the customs of the ancient faith with the miracles of the new, very serious troubles and discords were created among men. And if the Christians had been united in one faith, fewer disorders would have followed; but the contentions among themselves, of the churches of Rome, Greece, and Ravenna, joined to those of the heretic sects with the Catholics, served in many ways to render the world miserable. Africa is a proof of this; having suffered more horrors from the Arian sect, whose doctrines were believed by the Vandals, than from any avarice or natural cruelty of the people themselves. Living amid so many persecutions, the countenances of men bore witness of the terrible impressions upon their minds; for besides the evils they suffered from the disordered state of the world, they scarcely could have recourse to the help of God, in whom the unhappy hope for relief; for the greater part of them, being uncertain what divinity they ought to address, died miserably, without help and without hope.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-12T11:59:27+00:00"
}