{
  "url": "https://voxday.net/2020/09/12/learn-to-spot-the-lie/",
  "scraped_at": "2025-12-21T13:07:31.963321",
  "title": "Learn to spot the lie",
  "date_display": "September 12, 2020",
  "date_iso": "2020-09-12T10:49:16+00:00",
  "date_from_url": "2020-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not that anyone with even half a brain trusts the FBI anymore, but <a href=\"https://twitter.com/FBIPortland/status/1304485033210769409\">the Portland office has now confirmed</a> that the Bureau is loyal to the Color Revolution, not the American people:</p><blockquote><p>Reports that extremists are setting wildfires in Oregon are untrue. Help us stop the spread of misinformation by only sharing information from trusted, official sources.</p><p>FBI Portland and local law enforcement agencies have been receiving reports that extremists are responsible for setting wildfires in Oregon. With our state and local partners, the FBI has investigated several such reports and found them to be <u>untrue</u>.</p><p>Special Agent In Charge Loren Cannon, Federal Bureau of Investigation</p></blockquote><p>Remember, the children of the Devil always deceive through misdirection and redefinition. The key word here is “extremists”. Sure, various <i>individuals </i>are confirmed to have been observed and arrested for starting fires <a href=\"https://www.yaktrinews.com/eastern-washington-woman-arrested-for-starting-fires-while-crews-worked-to-fix-fallen-power-lines/\">in Washington</a>, <a href=\"https://kion546.com/news/2020/09/07/woman-accused-of-intentionally-starting-fires-on-highway-101-arrested/\">in California</a>, and <a href=\"https://nbc16.com/news/local/man-seen-starting-fires-at-oregon-state-park-local-fire-chief-says\">in Oregon</a>, and have even been <a href=\"https://www.anonymousconservative.com/blog/wp-content/uploads/2020/09/Qa3.jpg\">caught red-handed with matches</a> by armed property owners. But the FBI has investigated these reports and determined that none of them were committed by <i>extremists</i>. Therefore, Antifa has nothing to do with it, so stop paying attention and <u>definitely</u> don’t blame the death and destruction on the people who are fanning the flames, both literally and metaphorically. That would be antisemitic. And racist. And homophobic. And conspiracy theory misinformation crimethink. <u>Definitely</u> not meth.</p><p><i>Oregon officials are noting that no antifa members have been arrested in connection with the fires, but there have been some arsonists connected with some of the blazes.</i></p><p>This is why it is important to understand that the USA is presently experiencing an attempted Color Revolution of which Antifa is merely one collection of anti-government stormtroopers. BLM is another. NeverTrump is a third. Notice that mere “official sources” are not enough to avoid being deemed misinformation. Those “official sources” must also be “trusted”, which means “controlled by the Color Revolution.”</p><p>The West Coast wildfires are clearly being magnified by the arson attacks. The CoRevs are attempting to hide these attacks under the cover of the natural events, but their hand has already been exposed. And the attacks should serve as a warning to the Patriot community that has retreated from the cities and suburbs that even distance will not suffice to assure they will be left alone.</p></div>",
  "content_text": "Not that anyone with even half a brain trusts the FBI anymore, but\nthe Portland office has now confirmed\nthat the Bureau is loyal to the Color Revolution, not the American people:\nReports that extremists are setting wildfires in Oregon are untrue. Help us stop the spread of misinformation by only sharing information from trusted, official sources.\nFBI Portland and local law enforcement agencies have been receiving reports that extremists are responsible for setting wildfires in Oregon. With our state and local partners, the FBI has investigated several such reports and found them to be\nuntrue\n.\nSpecial Agent In Charge Loren Cannon, Federal Bureau of Investigation\nRemember, the children of the Devil always deceive through misdirection and redefinition. The key word here is “extremists”. Sure, various\nindividuals\nare confirmed to have been observed and arrested for starting fires\nin Washington\n,\nin California\n, and\nin Oregon\n, and have even been\ncaught red-handed with matches\nby armed property owners. But the FBI has investigated these reports and determined that none of them were committed by\nextremists\n. Therefore, Antifa has nothing to do with it, so stop paying attention and\ndefinitely\ndon’t blame the death and destruction on the people who are fanning the flames, both literally and metaphorically. That would be antisemitic. And racist. And homophobic. And conspiracy theory misinformation crimethink.\nDefinitely\nnot meth.\nOregon officials are noting that no antifa members have been arrested in connection with the fires, but there have been some arsonists connected with some of the blazes.\nThis is why it is important to understand that the USA is presently experiencing an attempted Color Revolution of which Antifa is merely one collection of anti-government stormtroopers. BLM is another. NeverTrump is a third. Notice that mere “official sources” are not enough to avoid being deemed misinformation. Those “official sources” must also be “trusted”, which means “controlled by the Color Revolution.”\nThe West Coast wildfires are clearly being magnified by the arson attacks. The CoRevs are attempting to hide these attacks under the cover of the natural events, but their hand has already been exposed. And the attacks should serve as a warning to the Patriot community that has retreated from the cities and suburbs that even distance will not suffice to assure they will be left alone.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-12T09:49:16+00:00"
}