{
  "url": "https://voxday.net/2020/09/10/mailvox-those-arent-chickens/",
  "scraped_at": "2025-12-21T13:07:22.518168",
  "title": "Mailvox: those aren’t chickens…",
  "date_display": "September 10, 2020",
  "date_iso": "2020-09-10T15:46:16+00:00",
  "date_from_url": "2020-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i> An observant reader notes the source of the Color Revolution currently taking place in the USA.</i></p><p>You probably already know this, but if not, Michael McFaul has surfaced again. He’s the Stanford professor who was Obama’s ambassador to Russia and the creator of that idiotic “reset” policy, but before that, he was considered an expert on revolution, especially the Color Revolutions. <a href=\"https://www.journalofdemocracy.org/articles/transitions-from-postcommunism\">According to McFaul</a>, the seven factors necessary for a successful revolution are:</p><ul style=\"text-align: left;\"><li>    A semi-autocratic rather that fully autocratic regime</li><li>    An unpopular incumbent</li><li>    A united and organized opposition</li><li>    An ability to quickly drive home the point that voting results were falsified</li><li>    Enough independent media to inform citizens about the falsified vote</li><li>    A political opposition capable of mobilizing tens of thousands or more demonstrators to protest electoral fraud</li><li>    Divisions among the regime’s coercive forces</li></ul><p>What I didn’t know is that the State Department under Hillary Clinton turned these factors into a program and exported it, using it to destabilize and overthrow governments all over the Arab and former-Soviet world, <a href=\"https://noqreport.com/2019/11/20/what-color-sky-your-world/\">especially in Ukraine</a>.</p><p>Hench Ukraine’s interest in keeping an eye on McFaul’s activities. <a href=\"https://www.theamericanconservative.com/articles/how-reset-man-mcfaul-helped-torpedo-u-s-russia-relations/\">Better still</a>:</p><blockquote><p>“But it was McFaul’s role in the U.S. interference in the Russian 2012 election that put in motion everything that followed. Perception makes its own reality, and the Russian perception is that McFaul and the Obama administration purposefully put their thumb on the scale of Russia’s presidential election to keep Putin from winning. McFaul has been banned from traveling to Russia, and in 2018 Putin approached Trump for permission to have Russian intelligence officers question McFaul about alleged illegal activities conducted while he was ambassador. While the Russian claims are unsubstantiated allegations, and their request facially absurd, the fact remains that when it comes to apportioning blame for the sorry state of U.S.-Russian relations today, one need look no further than Michael McFaul and his decades-long effort to create Russian “democracy” from whole cloth as laying the foundation for failure.”</p></blockquote><p>In 2014, having made a thorough botch of trying to install American-style democracy all over the Arab and post-Soviet world, McFaul resigned and slunk back to Stanford, to resume teaching… until this past weekend, when he reemerged as a quotable expert on foreign relations: <i>“Trump has lost the Intelligence Community. He has lost the State Department. He has lost the military. How can he continue to serve as our Commander in Chief?”</i></p><p>I keep thinking about McFaul’s seven prerequisites for a successful revolution. It looks to me as if we’re in Step 7 of the plan now: creating divisions among the regime’s coercive forces, to make it impossible for them to present a coordinated response to the riots in the streets. Having failed to install democracy everywhere else in the world, it looks as if McFaul and his ilk have decided to bring the revolution back home.</p><p>Is it just me, or do you hear it too? It sounds like … chickens … coming home to roost.</p><p><i>Not that the situation isn’t serious, but I can’t help being amused by the appropriate nature of the man’s name. McFoul indeed. What we’re seeing here is not about “liberals” or “the Left”, it’s actually the neocon’s World Trotskyite Revolution attempting to reestablish their control over the USA now that they’ve lost Russia.</i></p></div>",
  "content_text": "An observant reader notes the source of the Color Revolution currently taking place in the USA.\nYou probably already know this, but if not, Michael McFaul has surfaced again. He’s the Stanford professor who was Obama’s ambassador to Russia and the creator of that idiotic “reset” policy, but before that, he was considered an expert on revolution, especially the Color Revolutions.\nAccording to McFaul\n, the seven factors necessary for a successful revolution are:\nA semi-autocratic rather that fully autocratic regime\nAn unpopular incumbent\nA united and organized opposition\nAn ability to quickly drive home the point that voting results were falsified\nEnough independent media to inform citizens about the falsified vote\nA political opposition capable of mobilizing tens of thousands or more demonstrators to protest electoral fraud\nDivisions among the regime’s coercive forces\nWhat I didn’t know is that the State Department under Hillary Clinton turned these factors into a program and exported it, using it to destabilize and overthrow governments all over the Arab and former-Soviet world,\nespecially in Ukraine\n.\nHench Ukraine’s interest in keeping an eye on McFaul’s activities.\nBetter still\n:\n“But it was McFaul’s role in the U.S. interference in the Russian 2012 election that put in motion everything that followed. Perception makes its own reality, and the Russian perception is that McFaul and the Obama administration purposefully put their thumb on the scale of Russia’s presidential election to keep Putin from winning. McFaul has been banned from traveling to Russia, and in 2018 Putin approached Trump for permission to have Russian intelligence officers question McFaul about alleged illegal activities conducted while he was ambassador. While the Russian claims are unsubstantiated allegations, and their request facially absurd, the fact remains that when it comes to apportioning blame for the sorry state of U.S.-Russian relations today, one need look no further than Michael McFaul and his decades-long effort to create Russian “democracy” from whole cloth as laying the foundation for failure.”\nIn 2014, having made a thorough botch of trying to install American-style democracy all over the Arab and post-Soviet world, McFaul resigned and slunk back to Stanford, to resume teaching… until this past weekend, when he reemerged as a quotable expert on foreign relations:\n“Trump has lost the Intelligence Community. He has lost the State Department. He has lost the military. How can he continue to serve as our Commander in Chief?”\nI keep thinking about McFaul’s seven prerequisites for a successful revolution. It looks to me as if we’re in Step 7 of the plan now: creating divisions among the regime’s coercive forces, to make it impossible for them to present a coordinated response to the riots in the streets. Having failed to install democracy everywhere else in the world, it looks as if McFaul and his ilk have decided to bring the revolution back home.\nIs it just me, or do you hear it too? It sounds like … chickens … coming home to roost.\nNot that the situation isn’t serious, but I can’t help being amused by the appropriate nature of the man’s name. McFoul indeed. What we’re seeing here is not about “liberals” or “the Left”, it’s actually the neocon’s World Trotskyite Revolution attempting to reestablish their control over the USA now that they’ve lost Russia.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-10T14:46:16+00:00"
}