{
  "url": "https://voxday.net/2020/09/09/officially-out/",
  "scraped_at": "2025-12-21T13:07:13.354497",
  "title": "Officially out",
  "date_display": "September 9, 2020",
  "date_iso": "2020-09-09T00:05:55+00:00",
  "date_from_url": "2020-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday, for the first time in 30 years, my fantasy football league drafted without me. They also drafted without the reigning league champion. 20 percent of the fantasy league left because we simply aren’t watching enough NFL football or paying enough attention to the rosters to be able to reasonably compete in the league anymore. Last year, I dropped my NFL GamePass subscription. This year, I don’t even know if I will watch a single game from start to finish because the politics have finally gotten too much for me to stand. And I am very, very far from alone in this regard.</p><p>The BLM cheerleaders in the sports media are talking bravely, as they usually do before the reports of declining ratings begin to appear. Mike Florio of ProFootballTalk in particular is trying to talk himself into the idea that the NFL and BLM can stand up to President Trump and the widespread disapproval on the part of white football fans.</p><blockquote><p>The NFL can’t simply wander into this crowded minefield without a plan for handling the inevitable explosions. Frankly, the plan needs to be to fight back. Supporting the players means more than simply saying, “We support the players.” Supporting the players means standing up to anyone and everyone who will try to bully or attack them.</p><p>At a time when some owners are trying to thread the needle regarding support for player protests while also hoping that they choose to stand for the anthem, the more awkward needle to be threaded with a big, fat camel relates to the broader notion of having their players’ backs while simultaneously cramming money into the President’s front pockets. The latest Trump (son) tweet reconfirms that support for players and support for the President cannot be reconciled.</p><p>If the NFL once again stands silent in the fact of a torrent of tweets and other attacks, the disconnect will become even more glaring.</p></blockquote><p>Of course, despite the posturing, Florio appears to have a pretty good idea that NFL Week One is going to be a catastrophe. He shut down his comments on that post after only six had been posted. The NBA’s TV ratings are currently down 40 percent from just two years ago, so it’s not at all impossible that the NFL will soon find itself on a similar downward trajectory. In <i>Corporate Cancer </i>I noted that 2/20 and 10/50 appear to be the year/percent ratio pattern once an organization becomes fully converged.</p><p>Now, I have no sympathies for, and nothing in common with, the clumsy gammas who hate all “sportsball” because it reminds them of their low social status. It’s not at all good that America’s sports have been stolen from the very nation that created them; this is a sign of cultural defeat. But submission to and acceptance of that defeat is even worse, which is why it will be encouraging to see more and more NFL fans refusing to accept the SJW-NFL wearing the skinsuit of the sport that it once was.</p><p>To paraphrase Ronald Reagan, I didn’t leave the NFL, the NFL left me.</p><p>UPDATE: It could be worse than anyone imagines, as this letter to Outkick indicates:</p><blockquote><p>I’ve been part of a fantasy football league for the past 20 years with the same 9 guys. Fantasy Draft Day is the most fun day of the year – we all get together, away from the wives, drink, eat, and re-live the glory days. Needless to say, we’re all huge NFL fans. I recently sent an email, like I do each year, alerting the guys to the date and time of the upcoming fantasy draft. Much to my surprise, 7 of the guys are dropping out of the league and all of them cited the SAME reason – they’re tired of the NFL’s embrace of politics.</p></blockquote><p>If you’re driving away 70 percent of your most hardcore fans, you’re in serious trouble. </p></div>",
  "content_text": "Yesterday, for the first time in 30 years, my fantasy football league drafted without me. They also drafted without the reigning league champion. 20 percent of the fantasy league left because we simply aren’t watching enough NFL football or paying enough attention to the rosters to be able to reasonably compete in the league anymore. Last year, I dropped my NFL GamePass subscription. This year, I don’t even know if I will watch a single game from start to finish because the politics have finally gotten too much for me to stand. And I am very, very far from alone in this regard.\nThe BLM cheerleaders in the sports media are talking bravely, as they usually do before the reports of declining ratings begin to appear. Mike Florio of ProFootballTalk in particular is trying to talk himself into the idea that the NFL and BLM can stand up to President Trump and the widespread disapproval on the part of white football fans.\nThe NFL can’t simply wander into this crowded minefield without a plan for handling the inevitable explosions. Frankly, the plan needs to be to fight back. Supporting the players means more than simply saying, “We support the players.” Supporting the players means standing up to anyone and everyone who will try to bully or attack them.\nAt a time when some owners are trying to thread the needle regarding support for player protests while also hoping that they choose to stand for the anthem, the more awkward needle to be threaded with a big, fat camel relates to the broader notion of having their players’ backs while simultaneously cramming money into the President’s front pockets. The latest Trump (son) tweet reconfirms that support for players and support for the President cannot be reconciled.\nIf the NFL once again stands silent in the fact of a torrent of tweets and other attacks, the disconnect will become even more glaring.\nOf course, despite the posturing, Florio appears to have a pretty good idea that NFL Week One is going to be a catastrophe. He shut down his comments on that post after only six had been posted. The NBA’s TV ratings are currently down 40 percent from just two years ago, so it’s not at all impossible that the NFL will soon find itself on a similar downward trajectory. In\nCorporate Cancer\nI noted that 2/20 and 10/50 appear to be the year/percent ratio pattern once an organization becomes fully converged.\nNow, I have no sympathies for, and nothing in common with, the clumsy gammas who hate all “sportsball” because it reminds them of their low social status. It’s not at all good that America’s sports have been stolen from the very nation that created them; this is a sign of cultural defeat. But submission to and acceptance of that defeat is even worse, which is why it will be encouraging to see more and more NFL fans refusing to accept the SJW-NFL wearing the skinsuit of the sport that it once was.\nTo paraphrase Ronald Reagan, I didn’t leave the NFL, the NFL left me.\nUPDATE: It could be worse than anyone imagines, as this letter to Outkick indicates:\nI’ve been part of a fantasy football league for the past 20 years with the same 9 guys. Fantasy Draft Day is the most fun day of the year – we all get together, away from the wives, drink, eat, and re-live the glory days. Needless to say, we’re all huge NFL fans. I recently sent an email, like I do each year, alerting the guys to the date and time of the upcoming fantasy draft. Much to my surprise, 7 of the guys are dropping out of the league and all of them cited the SAME reason – they’re tired of the NFL’s embrace of politics.\nIf you’re driving away 70 percent of your most hardcore fans, you’re in serious trouble.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-08T23:05:55+00:00"
}