{
  "url": "https://voxday.net/2020/09/26/preserving-the-us-empire/",
  "scraped_at": "2025-12-21T13:09:10.037544",
  "title": "Preserving the US empire",
  "date_display": "September 26, 2020",
  "date_iso": "2020-09-26T09:17:05+00:00",
  "date_from_url": "2020-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, Donald Trump is going to win the election. No question. But it’s important to understand what is at stake, because at present, the God-Emperor is literally the one and only thing preventing the imperial USA from collapsing rapidly. To give just one example, the Saker points out how ridiculous the current globalist beating of the war drums <a href=\"https://www.unz.com/tsaker/the-world-has-gone-absolutely-insane/\" rel=\"noopener noreferrer\" target=\"_blank\">over the color revolution in Belarus</a> is, considering the relative state of the Russian and NATO militaries.</p><blockquote><p>There is a popular expression in Russia which, I submit, beautifully sums up the current US/NATO doctrine: пугать ежа голой задницей, which can be translated as “trying to scare a hedgehog with your naked bottom”.</p><p>The truth is that NATO military forces currently are all in very bad shape – all of them, including the US – and that their only advantage over Russia is in numbers. But as soon as you factor in training, command and control, the ability to operate with severely degraded C3I capabilities, the average age of military hardware or morale – the Russian armed forces are far ahead of the West.</p><p>Does anybody sincerely believe that a few B-52s and a few thousand soldiers from different countries playing war in Poland will really scare the Russian generals?</p><p>But if not – why the threats?</p><p>My explanation is simple: the rulers of the Empire simply hope that the people in the West will never find out how bad their current military posture really is, and they also know that Russia will never attack first – so they simply pretend like they are still big, mighty and relevant. This is made even easier by the fact that the Russians always downplay their real capabilities (in sharp contrast to the West which always brags about “the best XYZ in the world”). That, and the fact that nobody in the Western ruling classes wants to admit that the game is over and that the Empire has collapsed.</p></blockquote><p>If the civilian leadership permits the US military to go into action against Russia or China, or to invade either Iran or North Korea, the US military is going to be exposed as the paper tiger it has become. And that will cause the rapid collapse of the global empire that presently has 800 bases in 70 countries around the world. The President is trying to downsize the empire without triggering a complete collapse while the neocons are attempting to use the US military while it could still be potentially useful for them.</p><p>The only reason the US isn’t losing wars is because the President is preventing the US military from fighting them.</p></div>",
  "content_text": "Now, Donald Trump is going to win the election. No question. But it’s important to understand what is at stake, because at present, the God-Emperor is literally the one and only thing preventing the imperial USA from collapsing rapidly. To give just one example, the Saker points out how ridiculous the current globalist beating of the war drums\nover the color revolution in Belarus\nis, considering the relative state of the Russian and NATO militaries.\nThere is a popular expression in Russia which, I submit, beautifully sums up the current US/NATO doctrine: пугать ежа голой задницей, which can be translated as “trying to scare a hedgehog with your naked bottom”.\nThe truth is that NATO military forces currently are all in very bad shape – all of them, including the US – and that their only advantage over Russia is in numbers. But as soon as you factor in training, command and control, the ability to operate with severely degraded C3I capabilities, the average age of military hardware or morale – the Russian armed forces are far ahead of the West.\nDoes anybody sincerely believe that a few B-52s and a few thousand soldiers from different countries playing war in Poland will really scare the Russian generals?\nBut if not – why the threats?\nMy explanation is simple: the rulers of the Empire simply hope that the people in the West will never find out how bad their current military posture really is, and they also know that Russia will never attack first – so they simply pretend like they are still big, mighty and relevant. This is made even easier by the fact that the Russians always downplay their real capabilities (in sharp contrast to the West which always brags about “the best XYZ in the world”). That, and the fact that nobody in the Western ruling classes wants to admit that the game is over and that the Empire has collapsed.\nIf the civilian leadership permits the US military to go into action against Russia or China, or to invade either Iran or North Korea, the US military is going to be exposed as the paper tiger it has become. And that will cause the rapid collapse of the global empire that presently has 800 bases in 70 countries around the world. The President is trying to downsize the empire without triggering a complete collapse while the neocons are attempting to use the US military while it could still be potentially useful for them.\nThe only reason the US isn’t losing wars is because the President is preventing the US military from fighting them.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-26T08:17:05+00:00"
}