{
  "url": "https://voxday.net/2020/09/28/the-importance-of-discernment/",
  "scraped_at": "2025-12-21T13:09:22.868307",
  "title": "The importance of discernment",
  "date_display": "September 28, 2020",
  "date_iso": "2020-09-28T11:12:52+00:00",
  "date_from_url": "2020-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wouldn’t go as far as Bruce Charlton <a href=\"https://charltonteaching.blogspot.com/2020/09/failure-of-discernment-of-evil-is-it.html?m=1\" rel=\"noopener noreferrer\" target=\"_blank\">in calling a lack of discernment a sin</a>, but then, there is a qualitative difference in being <i>unable </i>to discern evil and being <i>unwilling </i>to do so:</p><blockquote><p>I suspect that the discernment of evil is maybe the most important thing to do about evil; much more important than (supposedly) ‘fighting’ evil. We absolutely need to identify, and correctly, what and who is on the side of evil: who are evil-allied. And these evil-allied may well turn-out to be almost-everything, and almost-everybody – we should be prepared for that possibility. </p><p>If I am right, this widespread and determined self-blinding to evil, the refusal to identify and acknowledge evil; may be one of the most prevalent and significant of our many modern sins. </p></blockquote><p>He is correct, however, to observe that the <i>refusal </i>to identify, acknowledge, and oppose evil is both prevalent and significant in society today. I have no patience or respect for those who insist on blathering about “stupidity” or how the Left “just doesn’t understand”. At this point, the inability to discern evil looks a lot more like a refusal to accept the reality of evil. Because rich and powerful individuals are not abusing children and offering them up to demons out of stupidity.</p><p>He’s also right to point out that you have to spot the target before you can FFE on it.</p></div>",
  "content_text": "I wouldn’t go as far as Bruce Charlton\nin calling a lack of discernment a sin\n, but then, there is a qualitative difference in being\nunable\nto discern evil and being\nunwilling\nto do so:\nI suspect that the discernment of evil is maybe the most important thing to do about evil; much more important than (supposedly) ‘fighting’ evil. We absolutely need to identify, and correctly, what and who is on the side of evil: who are evil-allied. And these evil-allied may well turn-out to be almost-everything, and almost-everybody – we should be prepared for that possibility.\nIf I am right, this widespread and determined self-blinding to evil, the refusal to identify and acknowledge evil; may be one of the most prevalent and significant of our many modern sins.\nHe is correct, however, to observe that the\nrefusal\nto identify, acknowledge, and oppose evil is both prevalent and significant in society today. I have no patience or respect for those who insist on blathering about “stupidity” or how the Left “just doesn’t understand”. At this point, the inability to discern evil looks a lot more like a refusal to accept the reality of evil. Because rich and powerful individuals are not abusing children and offering them up to demons out of stupidity.\nHe’s also right to point out that you have to spot the target before you can FFE on it.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-28T10:12:52+00:00"
}