{
  "url": "https://voxday.net/2020/09/07/this-really-isnt-that-hard-2/",
  "scraped_at": "2025-12-21T13:07:04.427146",
  "title": "This really isn’t that hard",
  "date_display": "September 7, 2020",
  "date_iso": "2020-09-07T12:56:22+00:00",
  "date_from_url": "2020-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not that the usual morons will pay any heed to this, but simply because it will permit me to tell them in the future that I already pointed this out, I would like everyone to please note that <b><i><u>all comments are moderated</u></i></b> here. This is necessary because there are literally hundreds of spam comments that spammers attempt to post here every day due to the 100k daily pageview traffic. If moderation was not in effect, the comments would be entirely unreadable.</p><p>THIS MEANS THAT IF YOUR COMMENT DOES NOT APPEAR RIGHT AWAY, DO <u><b>NOT</b></u> TRY TO POST IT A SECOND TIME. THIS MEANS <i>YOU</i>, YOU MORON. </p><p><b>UPDATE: </b>ALSO AND ESPECIALLY <b><u>YOU</u></b>, BOOMER.</p><p>Literally nothing that anyone has to say is so urgent that it necessitates a second, or third, or even fourth attempt to post it. If you’re worried that your Very Important Comment may have been lost, then for the love of all that is Good, Beautiful, and True, accept with equanimity that possibility as The Decretive Will of God, An Act of Nature, An Unfortunate Accident, or even The Insidious Work of the Father of Lies, whatever may happen to best suit your particular philosophical perspective. FFS, this isn’t a difficult concept!</p><p>Let me repeat for those of you who are too stupid to grasp the readily apparent: DO NOT TRY TO COMMENT A SECOND TIME WHEN YOUR INITIAL COMMENT DOES NOT IMMEDIATELY APPEAR.</p><p>Furthermore, please note that adding an “OT” to your off-topic comment does not make it acceptable. It is still off-topic. If you feel the need to share your Very Important Opinion or some Very Important News, then feel free to do so on your own site. Do not do it here. All that adding “OT” to your off-topic comment accomplishes is to make it clear that you know you’re a jackass and you’re going to try to hijack the mic even though you know you’re not supposed to. Furthermore, if your Very Important Breaking News is a link to Drudge, Twitter, Instapundit, or the AP News Wire, then there is absolutely no need to “alert” anyone to anything. </p><p>This may come as shocking news to the solipsistic, but <i>everyone else reads those sites too</i>.</p><p><b>UPDATE: </b>If you’re a Boomer who doesn’t understand why everyone Gen X and younger can’t stand you and your g-g-generation, allow me to point out that one of the regular Boomers here has ALREADY tried to post the same comment on this post TWICE, presumably because he didn’t see the first one appear immediately. The Day of the Pillow cannot arrive soon enough.</p></div>",
  "content_text": "Not that the usual morons will pay any heed to this, but simply because it will permit me to tell them in the future that I already pointed this out, I would like everyone to please note that\nall comments are moderated\nhere. This is necessary because there are literally hundreds of spam comments that spammers attempt to post here every day due to the 100k daily pageview traffic. If moderation was not in effect, the comments would be entirely unreadable.\nTHIS MEANS THAT IF YOUR COMMENT DOES NOT APPEAR RIGHT AWAY, DO\nNOT\nTRY TO POST IT A SECOND TIME. THIS MEANS\nYOU\n, YOU MORON.\nUPDATE:\nALSO AND ESPECIALLY\nYOU\n, BOOMER.\nLiterally nothing that anyone has to say is so urgent that it necessitates a second, or third, or even fourth attempt to post it. If you’re worried that your Very Important Comment may have been lost, then for the love of all that is Good, Beautiful, and True, accept with equanimity that possibility as The Decretive Will of God, An Act of Nature, An Unfortunate Accident, or even The Insidious Work of the Father of Lies, whatever may happen to best suit your particular philosophical perspective. FFS, this isn’t a difficult concept!\nLet me repeat for those of you who are too stupid to grasp the readily apparent: DO NOT TRY TO COMMENT A SECOND TIME WHEN YOUR INITIAL COMMENT DOES NOT IMMEDIATELY APPEAR.\nFurthermore, please note that adding an “OT” to your off-topic comment does not make it acceptable. It is still off-topic. If you feel the need to share your Very Important Opinion or some Very Important News, then feel free to do so on your own site. Do not do it here. All that adding “OT” to your off-topic comment accomplishes is to make it clear that you know you’re a jackass and you’re going to try to hijack the mic even though you know you’re not supposed to. Furthermore, if your Very Important Breaking News is a link to Drudge, Twitter, Instapundit, or the AP News Wire, then there is absolutely no need to “alert” anyone to anything.\nThis may come as shocking news to the solipsistic, but\neveryone else reads those sites too\n.\nUPDATE:\nIf you’re a Boomer who doesn’t understand why everyone Gen X and younger can’t stand you and your g-g-generation, allow me to point out that one of the regular Boomers here has ALREADY tried to post the same comment on this post TWICE, presumably because he didn’t see the first one appear immediately. The Day of the Pillow cannot arrive soon enough.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-07T11:56:22+00:00"
}