{
  "url": "https://voxday.net/2020/09/27/tinkerbell-is-black-too/",
  "scraped_at": "2025-12-21T13:09:21.028564",
  "title": "Tinkerbell is black too",
  "date_display": "September 27, 2020",
  "date_iso": "2020-09-27T17:00:03+00:00",
  "date_from_url": "2020-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To precisely no one’s surprise, blackwashing Ariel the Little Mermaid proved to be insufficient, because the SJW appetite can never be sated. At least this way, when the Devil Mouse movie inevitably flops, they will have the excuse of <a href=\"https://news.yahoo.com/yara-shahidi-1st-black-woman-174025495.html\" rel=\"noopener noreferrer\" target=\"_blank\">blaming racist audiences</a>:</p><blockquote><p>Yara Shahidi is getting her wings.</p><p>The actor is set to play Tinkerbell in Disney’s “Peter Pan and Wendy,” the studio’s latest live-action adaptation. Shahidi joins a cast that features Jude Law as Captain Hook, with Alexander Molony as Peter Pan and newcomer Ever Anderson as Wendy.</p><p>“Pete’s Dragon” director David Lowery is on board to direct and co-wrote the script with Toby Halbrooks. Jim Whitaker is producing.</p><p>Though there have been many adaptations of the Peter Pan story, Shahidi will be the first Black woman to take on the role on screen. The decision follows recent moves by Disney to diversify their casting. </p></blockquote><p>I’ll call it now. Disney is going to go bankrupt. Not today, not tomorrow, and not next year, but it is now apparent that their convergence has reached a point that the corporate cancer simply cannot be excised. It’s really rather remarkable that in the face of all the various complicated challenges that the Devil Mouse is presently facing, they have concluded the answer is <i>moar negroes</i>.</p><p>And they are certainly creating opportunities in the wake of their death spiral.</p></div>",
  "content_text": "To precisely no one’s surprise, blackwashing Ariel the Little Mermaid proved to be insufficient, because the SJW appetite can never be sated. At least this way, when the Devil Mouse movie inevitably flops, they will have the excuse of\nblaming racist audiences\n:\nYara Shahidi is getting her wings.\nThe actor is set to play Tinkerbell in Disney’s “Peter Pan and Wendy,” the studio’s latest live-action adaptation. Shahidi joins a cast that features Jude Law as Captain Hook, with Alexander Molony as Peter Pan and newcomer Ever Anderson as Wendy.\n“Pete’s Dragon” director David Lowery is on board to direct and co-wrote the script with Toby Halbrooks. Jim Whitaker is producing.\nThough there have been many adaptations of the Peter Pan story, Shahidi will be the first Black woman to take on the role on screen. The decision follows recent moves by Disney to diversify their casting.\nI’ll call it now. Disney is going to go bankrupt. Not today, not tomorrow, and not next year, but it is now apparent that their convergence has reached a point that the corporate cancer simply cannot be excised. It’s really rather remarkable that in the face of all the various complicated challenges that the Devil Mouse is presently facing, they have concluded the answer is\nmoar negroes\n.\nAnd they are certainly creating opportunities in the wake of their death spiral.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-27T16:00:03+00:00"
}