{
  "url": "https://voxday.net/2020/09/13/we-are-being-lied-to/",
  "scraped_at": "2025-12-21T13:07:36.380899",
  "title": "We ARE being lied to",
  "date_display": "September 13, 2020",
  "date_iso": "2020-09-13T12:51:13+00:00",
  "date_from_url": "2020-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The global media’s <a href=\"https://thehill.com/policy/technology/516102-qanon-spreads-across-globe-shadowing-covid-19\" rel=\"noopener noreferrer\" target=\"_blank\">anti-Q campaign</a> is doomed to fail because, at its most basic core, Q is obviously telling the truth, or at least considerably more truth than the media or the Big Tech Cartel permit. There is a vast globalist conspiracy, although it is so open and documented and observable that it barely qualifies for the name of “conspiracy”. That globalist conspiracy is anti-Christian, anti-Western civilization, anti-American, and anti-Trump. There are elements of the conspiracy that are confirmed to prey upon children. And the deeper elements of the conspiracy do appear to subscribe to religious beliefs that can be reasonably described as Satanist or Luciferian.</p><blockquote><p>The QAnon movement is spreading around the world, turning an outlandish conspiracy theory revolving around President Trump into one of the nation’s most dangerous exports.</p><p>Flags and banners brandishing one of the conspiracy’s mottos — “WWG1WGA,” an acronym for “where we go one, we go all” — dotted the crowd at a rally against lockdowns in Germany last month.</p><p>And when Trump visited Japan in 2019, he was greeted by cardboard cutouts of the letter Q.</p><p>These aren’t just isolated instances either. Researchers have found large QAnon communities in more than 70 countries. </p><p>The original conspiracy theory was tightly focused on an alleged cabal of deep state figures and Hollywood elites running child trafficking rings that Trump was working with the military to expose. But it has since evolved into a meta-conspiracy theory that pushes its anti-institution and anti-Semitic strains more explicitly.</p><p>Experts who spoke with The Hill about the theory’s spread said it has become worse because of the coronavirus, which itself is the subject of many conspiracy theories. This helped create a perfect storm fostering distrust in established government and public health institutions.</p><p>“Pandemics fuel a lot of questions and make people very skeptical, especially in cases when what we would consider to be credible and trustworthy institutions all of a sudden themselves don’t seem to have the right answers or are not aligned on how to manage the situation,” Anna-Sophie Harling, head of media evaluation startup NewsGuard’s Europe team, said in an interview.</p><p>“Conspiracies are rooted in the idea that we’re all being lied to by some greater authority or voice and QAnon perfectly ties into that.”</p></blockquote><p>So, ask yourself this question. If “the QAnon movement” is dangerous, <i>to whom</i> is it dangerous? And if it is dangerous to the enemies of Jesus Christ, Western Civilization, America, and President Trump, then shouldn’t you already be on board with it?</p><p>The problem that the Prometheans have is that most people have memories. So, when they first proclaim that X is disinformation, then are forced by events to admit that X is true, their ability to proclaim the truth as disinformation and their own propaganda as the truth is degraded.</p></div>",
  "content_text": "The global media’s\nanti-Q campaign\nis doomed to fail because, at its most basic core, Q is obviously telling the truth, or at least considerably more truth than the media or the Big Tech Cartel permit. There is a vast globalist conspiracy, although it is so open and documented and observable that it barely qualifies for the name of “conspiracy”. That globalist conspiracy is anti-Christian, anti-Western civilization, anti-American, and anti-Trump. There are elements of the conspiracy that are confirmed to prey upon children. And the deeper elements of the conspiracy do appear to subscribe to religious beliefs that can be reasonably described as Satanist or Luciferian.\nThe QAnon movement is spreading around the world, turning an outlandish conspiracy theory revolving around President Trump into one of the nation’s most dangerous exports.\nFlags and banners brandishing one of the conspiracy’s mottos — “WWG1WGA,” an acronym for “where we go one, we go all” — dotted the crowd at a rally against lockdowns in Germany last month.\nAnd when Trump visited Japan in 2019, he was greeted by cardboard cutouts of the letter Q.\nThese aren’t just isolated instances either. Researchers have found large QAnon communities in more than 70 countries.\nThe original conspiracy theory was tightly focused on an alleged cabal of deep state figures and Hollywood elites running child trafficking rings that Trump was working with the military to expose. But it has since evolved into a meta-conspiracy theory that pushes its anti-institution and anti-Semitic strains more explicitly.\nExperts who spoke with The Hill about the theory’s spread said it has become worse because of the coronavirus, which itself is the subject of many conspiracy theories. This helped create a perfect storm fostering distrust in established government and public health institutions.\n“Pandemics fuel a lot of questions and make people very skeptical, especially in cases when what we would consider to be credible and trustworthy institutions all of a sudden themselves don’t seem to have the right answers or are not aligned on how to manage the situation,” Anna-Sophie Harling, head of media evaluation startup NewsGuard’s Europe team, said in an interview.\n“Conspiracies are rooted in the idea that we’re all being lied to by some greater authority or voice and QAnon perfectly ties into that.”\nSo, ask yourself this question. If “the QAnon movement” is dangerous,\nto whom\nis it dangerous? And if it is dangerous to the enemies of Jesus Christ, Western Civilization, America, and President Trump, then shouldn’t you already be on board with it?\nThe problem that the Prometheans have is that most people have memories. So, when they first proclaim that X is disinformation, then are forced by events to admit that X is true, their ability to proclaim the truth as disinformation and their own propaganda as the truth is degraded.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-13T11:51:13+00:00"
}