{
  "url": "https://voxday.net/2020/09/13/why-logos-matters/",
  "scraped_at": "2025-12-21T13:07:37.845791",
  "title": "Why Logos matters",
  "date_display": "September 13, 2020",
  "date_iso": "2020-09-13T13:27:12+00:00",
  "date_from_url": "2020-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Professor Rachel Fulton Brown <a href=\"https://unauthorized.tv/watch/why-logos-matters-interview-with-e-michael-e9917b/\" rel=\"noopener noreferrer\" target=\"_blank\">interviews E. Michael Jones</a> on Unauthorized.</p><p>Professor Rachel Fulton Brown sits down with Dr. E. Michael Jones to ask some hard questions about his new book <i>Logos Rising: A History of Ultimate Reality</i> (Fidelity Press, 2020). What is Logos, why is it necessary, how do we discover it, and why is it anathema to the current cultural debate? What is our best evidence that Logos is rising, and where does the Virgin Mary fit in the story?</p><p>In other Unauthorized news, we’re now caught up on <a href=\"https://unauthorized.tv/channel/wranglerstar/\" rel=\"noopener noreferrer\" target=\"_blank\">Wranglerstar</a>, with 40 more of his videos now available on the site. Don’t miss those about his experiences fighting the Antifa fires. And Barcelona Life is back, with yet another <a href=\"https://unauthorized.tv/watch/cocina-quarantina-pan-seared-scallops-943522/\" rel=\"noopener noreferrer\" target=\"_blank\">Cocina Quarantina special</a> you’re going to want to try!</p><p>Unauthorized now features 1,348 videos that comprise 1,426 hours of viewing time. This includes the two latest from WRANGLERSTAR as he battles the Oregon wildfires: “How We Survived the Oregon Wildland Fires” and “How To Protect Yourself From Wildfire Smoke” as well as The Legend Chuck Dixon <a href=\"https://unauthorized.tv/watch/what-will-kevin-do--c7ff63/\" rel=\"noopener noreferrer\" target=\"_blank\">contemplating the four options</a> presently facing Marvel boss Kevin Feige.</p><p>It would take you two straight months just to watch all! One subscriber says: <i>Every one of those videos is worth watching. Not one of those videos promotes the evil, the ugly, or the false.</i> So, if you haven’t subscribed yet, what are you waiting for?</p></div>",
  "content_text": "Professor Rachel Fulton Brown\ninterviews E. Michael Jones\non Unauthorized.\nProfessor Rachel Fulton Brown sits down with Dr. E. Michael Jones to ask some hard questions about his new book\nLogos Rising: A History of Ultimate Reality\n(Fidelity Press, 2020). What is Logos, why is it necessary, how do we discover it, and why is it anathema to the current cultural debate? What is our best evidence that Logos is rising, and where does the Virgin Mary fit in the story?\nIn other Unauthorized news, we’re now caught up on\nWranglerstar\n, with 40 more of his videos now available on the site. Don’t miss those about his experiences fighting the Antifa fires. And Barcelona Life is back, with yet another\nCocina Quarantina special\nyou’re going to want to try!\nUnauthorized now features 1,348 videos that comprise 1,426 hours of viewing time. This includes the two latest from WRANGLERSTAR as he battles the Oregon wildfires: “How We Survived the Oregon Wildland Fires” and “How To Protect Yourself From Wildfire Smoke” as well as The Legend Chuck Dixon\ncontemplating the four options\npresently facing Marvel boss Kevin Feige.\nIt would take you two straight months just to watch all! One subscriber says:\nEvery one of those videos is worth watching. Not one of those videos promotes the evil, the ugly, or the false.\nSo, if you haven’t subscribed yet, what are you waiting for?",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-09-13T12:27:12+00:00"
}