{
  "url": "https://voxday.net/2007/12/30/16-0/",
  "scraped_at": "2026-01-08T22:05:36.367763",
  "title": "16-0",
  "date_display": "December 30, 2007",
  "date_iso": "2007-12-30T12:26:00+00:00",
  "date_from_url": "2007-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Say what you will about Bill Belichick and the New England Patriots, however flawed they may be as individuals, they represent as close to perfection in coaching, execution and teamwork as exists in sports today.  Last night’s game was excellent, as the Giants rose to the occasion and acquitted themselves far better than anyone expected, but were still unable to defeat the Patriot machine over a full 60 minutes.</p><p>The Patriots do have an impressive collection of talent, but as we’ve seen many times in the past, from Madrid to Miami, mere talent is no guarantee of victory.  Belichick’s statement about there being 53 leaders on the team is nonsense, of course, but there is a kernel of truth in the statement as he clearly demands the same level of hypercompetitive commitment and effort from the weakest link as he does from Tom Brady.  Whether they’re in front or behind, they never stop competing and that’s what makes them not only impressive, but downright inspiring.</p><p>All you need to really understand the Patriot mentality is to watch Wes Welker and the other wide receivers crushing linebackers and even defensive linemen when they need a yard or two on the ground.</p><p>The OC, on the other hand, has a rather different perspective: <i>“Why, it’s as if the cheating scandal last September never even happened…  Kind of like the way the massive voter fraud in every presidential election is magically erased from our collective memories every four years, and our election system starts all over again as a sacred process run by unimpeachable snow-white virgins.”</i></p></div>",
  "content_text": "Say what you will about Bill Belichick and the New England Patriots, however flawed they may be as individuals, they represent as close to perfection in coaching, execution and teamwork as exists in sports today.  Last night’s game was excellent, as the Giants rose to the occasion and acquitted themselves far better than anyone expected, but were still unable to defeat the Patriot machine over a full 60 minutes.\nThe Patriots do have an impressive collection of talent, but as we’ve seen many times in the past, from Madrid to Miami, mere talent is no guarantee of victory.  Belichick’s statement about there being 53 leaders on the team is nonsense, of course, but there is a kernel of truth in the statement as he clearly demands the same level of hypercompetitive commitment and effort from the weakest link as he does from Tom Brady.  Whether they’re in front or behind, they never stop competing and that’s what makes them not only impressive, but downright inspiring.\nAll you need to really understand the Patriot mentality is to watch Wes Welker and the other wide receivers crushing linebackers and even defensive linemen when they need a yard or two on the ground.\nThe OC, on the other hand, has a rather different perspective:\n“Why, it’s as if the cheating scandal last September never even happened…  Kind of like the way the massive voter fraud in every presidential election is magically erased from our collective memories every four years, and our election system starts all over again as a sacred process run by unimpeachable snow-white virgins.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-30T12:26:00+00:00"
}