{
  "url": "https://voxday.net/2007/12/12/and-atheists-dance/",
  "scraped_at": "2026-01-08T22:03:26.811644",
  "title": "And the atheists dance",
  "date_display": "December 12, 2007",
  "date_iso": "2007-12-12T09:40:00+00:00",
  "date_from_url": "2007-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I realize that people sometimes think I invent critical strawmen because it’s so easy to disprove what my critics are saying, but these quotes are all taken directly from the comments on a previous post.  By the way, lately I’ve noticed a trend of people providing links in apparent ignorance of what is actually on the other end; if you’re going to provide a link in an attempt to support what you’re saying, I highly recommend reading it all the way through:</p><blockquote><p>Looks like the killer was a fundagelical scorned. And let the VD spin begin:  Oh that’s right he wasn’t a xtian cos no real xtian would have done that. So he must have converted from his wish to be a missionary to being a life long anti-xtian. Yup it was a hidden thing I guess.<br>– DC</br></p><p>Read <a href=\"http://allspinzone.com/wp/2007/1...-his-own-words/\">the rest of the shooter’s quotes</a>.  He still believed in Jesus:  He carries on about how his hatred for Christians is the pentecostal ones at the church, and that his belief in god is different. But he still believes.  Not an atheist.<br>– MB</br></p><p>There’s nothing about holding the position of atheism that entails anything other than a disbelief in god….  Not only was he not an atheist, he appeared to have been raised and influenced by christians. <br>– WCAW</br></p></blockquote><p>A few points:</p><p>1.  Murray was raised and influenced by Christians.  So was Richard Dawkins, Christopher Hitchens, and apparently Daniel Dennett.  Unless one believes all three of these atheist icons are currently Christians, one cannot claim that Murray is a Christian on that basis.  He was not a “fundagelical scorned”, he scorned fundagelicals.</p><p>2.  Look at the link MB provides.  He appears to be operating under the impression that any mention of Jesus equates to belief in him.  But this is the sum total of references to Jesus in the link:  a) Murray (rightly) states that Jesus’s words do not support Dominionism, b) Murray (rightly) rejects the view that a chosen generation will take dominion until Jesus’s return, c) he states that he got tired of hearing “Jesus loves you!”, d) he remembers being afraid as a child that Jesus would return while he was sinning and being left behind, e) he writes a poem saying that Jesus has ordered a child to obey a parent’s desire to molest him.</p><p>3. If atheism is merely, as WCAW insists, a disbelief in god, then no amount of references to Hell, an afterlife or various supernatural concepts precludes atheism.</p><p>4.  Now consider <a href=\"http://p223.ezboard.com/No-more-abuse-to-me-Christian-or-otherwise/fexpentecostalforumsfrm60.showMessage?topicID=6.topic\">more of Murray’s actual words</a>:</p><blockquote><p><i><br>Well, I got all fed up with the insanity, hypocrisy, conflicting doctrines, the and lack of absolute answers in regards to “salvation,” heaven and hell and other theological issues, the child abuse, brainwashing, lies, gossip, scandals, threats and fear mongering. I got tired of always hearing “oooohh, you’re saved by grace, not by works!” “Everybody loves you! Jesus loves you!” only to hear about how I was going to hell for watching “The simpsons” or could lose my salvation and could never be certain if 30 years from now I might lose it due to some odd sin and die in an accident and end up in this eternal hell preached to us day and night.  Me, I found a new Law to live by and I realized……I don’t have to be abused nor submit to these liars and their lies nor do I have to be afraid of this make-believe hell and false theory of salvation which no fundamentalist Christian could ever give solid answers on.</br></i></p><p>Me and many others are waking up. We will rise up above and against these abuses against humanity. Men will no longer be ruled by fear and superstition, oppressed by bigotry and tyranny….</p><p>I’m full of hate and I love it! I hate people and they better @#%$ fear me if they know what’s good for them. Yes I hate, I’m headed to Hell and I guess I want others to know it. “Moral Values” people like Christians bring it on themselves….preaching all their bullshit and trying to take over the world with their Nightmare religion…… “what would Jesus do” and all their ten commandments bullshit…me…..I will do MY Will and I will kill those who try to thwart my will…Do what thou wilt shall be the whole of the Law….</p></blockquote><p>Murray is very closely echoes three strains of thought here.  The first is the Enlightenment philosophy of the secular humanists.  The second is the nihilistic egotism of Nietzsche and Mao Tse-Tung.  The third is Aleister Crowley.  Either one can reject Christianity or one cannot do so.  Atheists cannot have it both ways, claiming that their own rejection of Christianity is legitimate but pretending that Murray’s is not.</p><p>And as I have already noted, Murray’s references to Hell cannot serve to disprove his atheism even if WCAW’s definition is ignored; half of all self-described atheists believe in Heaven and Hell.  One need only visit Pharyngula, American Atheists or any militant atheist site to recognize that at its core, atheism entails the <b>rejection</b> of God and the denial of the supernatural, a mere lack of belief in God is more agnostic than atheistic.</p><p>Murray possessed the passionate hate of the militant atheist, the arrogance of the entitled and the nihilistic rage of the social outcast.  It is the combination of those three things with youth and testosterone that make a killer.  I should note that it doesn’t surprise me at all that Murray was influenced by Klebold and Harris, as I wrote in <i>The World in Shadow</i>, the Columbine killers are and will continue to be genuine heroes to the hated and unhappy of the world.  If Christians do not reach out to them in love, then we cannot be surprised when the void in their hearts is filled by the prince of this world.</p><p>Nevertheless, I do see Murray as a failure of the Christians around him.  Like Murray, I too was sickened by the shallowness and stupidity of the Christians around me from the time I was a child.  Like Murray, I too am disgusted with the Dominionists, the paranoia that sees demons at work in every paper cut, and the hubris that proclaims false prophecies and visions in the wide-eyed congregations.  It wasn’t until I was in my late twenties that I understood that nearly everyone, of every creed, is shallow and stupid, and that one cannot reasonably judge the true essence of a belief on the basis of the believers.  Murray’s atheism does not absolve Christians of his violent end; it condemns them more completely than if he were merely a mentally ill parishioner in good standing.</p><p>UPDATE: at least one atheist hasn’t been paying attention to the atheist hymnbook and is out of tune with the godless chorus singing sweet songs of innocence and light.  TA writes:</p><blockquote><p>All I can say is thank you. Thank you to the shooter for taking out some of the most hate-filled control freaks on the planet. Thank you for finally bring the publics attention to the cult like brainwashing that is forced upon these kids at such an early age. Thank you for exposing the cult like ways of YWAM.</p><p>America needs more heroes like him. And I expect more incidents like this as victims throw off the shackles of their imprisoners and implode from the years of systematic brainwashing.</p></blockquote><p>Throw off the shackles of oppression and start with the killing.  Gee, that’s a new one.  So many atheists are incredibly obsessed with this idea; whether they call themselves <i>sans-culottes</i>, scientific socialists or New Atheists, they always seem to end up there eventually.</p></div>",
  "content_text": "I realize that people sometimes think I invent critical strawmen because it’s so easy to disprove what my critics are saying, but these quotes are all taken directly from the comments on a previous post.  By the way, lately I’ve noticed a trend of people providing links in apparent ignorance of what is actually on the other end; if you’re going to provide a link in an attempt to support what you’re saying, I highly recommend reading it all the way through:\nLooks like the killer was a fundagelical scorned. And let the VD spin begin:  Oh that’s right he wasn’t a xtian cos no real xtian would have done that. So he must have converted from his wish to be a missionary to being a life long anti-xtian. Yup it was a hidden thing I guess.\n– DC\nRead\nthe rest of the shooter’s quotes\n.  He still believed in Jesus:  He carries on about how his hatred for Christians is the pentecostal ones at the church, and that his belief in god is different. But he still believes.  Not an atheist.\n– MB\nThere’s nothing about holding the position of atheism that entails anything other than a disbelief in god….  Not only was he not an atheist, he appeared to have been raised and influenced by christians.\n– WCAW\nA few points:\n1.  Murray was raised and influenced by Christians.  So was Richard Dawkins, Christopher Hitchens, and apparently Daniel Dennett.  Unless one believes all three of these atheist icons are currently Christians, one cannot claim that Murray is a Christian on that basis.  He was not a “fundagelical scorned”, he scorned fundagelicals.\n2.  Look at the link MB provides.  He appears to be operating under the impression that any mention of Jesus equates to belief in him.  But this is the sum total of references to Jesus in the link:  a) Murray (rightly) states that Jesus’s words do not support Dominionism, b) Murray (rightly) rejects the view that a chosen generation will take dominion until Jesus’s return, c) he states that he got tired of hearing “Jesus loves you!”, d) he remembers being afraid as a child that Jesus would return while he was sinning and being left behind, e) he writes a poem saying that Jesus has ordered a child to obey a parent’s desire to molest him.\n3. If atheism is merely, as WCAW insists, a disbelief in god, then no amount of references to Hell, an afterlife or various supernatural concepts precludes atheism.\n4.  Now consider\nmore of Murray’s actual words\n:\nWell, I got all fed up with the insanity, hypocrisy, conflicting doctrines, the and lack of absolute answers in regards to “salvation,” heaven and hell and other theological issues, the child abuse, brainwashing, lies, gossip, scandals, threats and fear mongering. I got tired of always hearing “oooohh, you’re saved by grace, not by works!” “Everybody loves you! Jesus loves you!” only to hear about how I was going to hell for watching “The simpsons” or could lose my salvation and could never be certain if 30 years from now I might lose it due to some odd sin and die in an accident and end up in this eternal hell preached to us day and night.  Me, I found a new Law to live by and I realized……I don’t have to be abused nor submit to these liars and their lies nor do I have to be afraid of this make-believe hell and false theory of salvation which no fundamentalist Christian could ever give solid answers on.\nMe and many others are waking up. We will rise up above and against these abuses against humanity. Men will no longer be ruled by fear and superstition, oppressed by bigotry and tyranny….\nI’m full of hate and I love it! I hate people and they better @#%$ fear me if they know what’s good for them. Yes I hate, I’m headed to Hell and I guess I want others to know it. “Moral Values” people like Christians bring it on themselves….preaching all their bullshit and trying to take over the world with their Nightmare religion…… “what would Jesus do” and all their ten commandments bullshit…me…..I will do MY Will and I will kill those who try to thwart my will…Do what thou wilt shall be the whole of the Law….\nMurray is very closely echoes three strains of thought here.  The first is the Enlightenment philosophy of the secular humanists.  The second is the nihilistic egotism of Nietzsche and Mao Tse-Tung.  The third is Aleister Crowley.  Either one can reject Christianity or one cannot do so.  Atheists cannot have it both ways, claiming that their own rejection of Christianity is legitimate but pretending that Murray’s is not.\nAnd as I have already noted, Murray’s references to Hell cannot serve to disprove his atheism even if WCAW’s definition is ignored; half of all self-described atheists believe in Heaven and Hell.  One need only visit Pharyngula, American Atheists or any militant atheist site to recognize that at its core, atheism entails the\nrejection\nof God and the denial of the supernatural, a mere lack of belief in God is more agnostic than atheistic.\nMurray possessed the passionate hate of the militant atheist, the arrogance of the entitled and the nihilistic rage of the social outcast.  It is the combination of those three things with youth and testosterone that make a killer.  I should note that it doesn’t surprise me at all that Murray was influenced by Klebold and Harris, as I wrote in\nThe World in Shadow\n, the Columbine killers are and will continue to be genuine heroes to the hated and unhappy of the world.  If Christians do not reach out to them in love, then we cannot be surprised when the void in their hearts is filled by the prince of this world.\nNevertheless, I do see Murray as a failure of the Christians around him.  Like Murray, I too was sickened by the shallowness and stupidity of the Christians around me from the time I was a child.  Like Murray, I too am disgusted with the Dominionists, the paranoia that sees demons at work in every paper cut, and the hubris that proclaims false prophecies and visions in the wide-eyed congregations.  It wasn’t until I was in my late twenties that I understood that nearly everyone, of every creed, is shallow and stupid, and that one cannot reasonably judge the true essence of a belief on the basis of the believers.  Murray’s atheism does not absolve Christians of his violent end; it condemns them more completely than if he were merely a mentally ill parishioner in good standing.\nUPDATE: at least one atheist hasn’t been paying attention to the atheist hymnbook and is out of tune with the godless chorus singing sweet songs of innocence and light.  TA writes:\nAll I can say is thank you. Thank you to the shooter for taking out some of the most hate-filled control freaks on the planet. Thank you for finally bring the publics attention to the cult like brainwashing that is forced upon these kids at such an early age. Thank you for exposing the cult like ways of YWAM.\nAmerica needs more heroes like him. And I expect more incidents like this as victims throw off the shackles of their imprisoners and implode from the years of systematic brainwashing.\nThrow off the shackles of oppression and start with the killing.  Gee, that’s a new one.  So many atheists are incredibly obsessed with this idea; whether they call themselves\nsans-culottes\n, scientific socialists or New Atheists, they always seem to end up there eventually.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-12T09:40:00+00:00"
}