{
  "url": "https://voxday.net/2007/12/11/atheist-killers/",
  "scraped_at": "2026-01-08T22:03:19.913612",
  "title": "Atheist killers",
  "date_display": "December 11, 2007",
  "date_iso": "2007-12-11T00:23:00+00:00",
  "date_from_url": "2007-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My, my, what a coincidence.  As expected, yet another shooter turns out to be <a href=\"http://www.homelandsecurityus.com/churchesCo\">a militant anti-theist</a>:</p><blockquote><p>According to a law enforcement source, the man professed to “hate all Christians,” and reportedly left a note or letter that he intended to murder as many Christians as possible.</p></blockquote><p>Large-scale murder or small-scale slaughter, it’s simply amazing how often these killers turn out to be self-identified atheists, especially given the fact that this group is such a small percentage of the population.  Correlation may not be causation, but when this sort of statistical improbability regarding the behavior of a tiny minority becomes not only reliable, but downright predictable, that just may be the first clue the relationship is causal.</p><p>What I find most interesting is the inevitably defensive reaction of their fellow atheists.  Instead of taking a scientific approach by examining the available evidence and then formulating a testable hypothesis to explain it, too many atheists take a philosophical approach similar to that of the medieval philosophers in attempting to ignore the evidence and focusing on the abstract logic of the matter.  The relevant question isn’t why WOULD atheists possess a predilection for committing murder, but rather why DO avowed atheists commit mass murder at a much higher rate than agnostics, other non-believers and theists.</p><p>In light of the recent discussion which involved atheists crowing over converting the younger generation away from Christianity, it appears that the killer was just such an example of such a conversion to faithlessness: “The gunman was identified as Matthew Murray, 24, who was home-schooled in what a friend said was a deeply religious Christian household.”</p><p>Isn’t it interesting that the media feels the need to mention the fact that the man was home-schooled <i>a quarter of his life</i> ago?  Of course, it’s inevitable that some will try to claim he was a Christian, on the same familial basis that applies to Richard Dawkins, Christopher Hitchens and Daniel Dennett.</p><p>On a tangential note, it’s definitely worth noting that <a href=\"http://www.thedenverchannel.com/news/14817480/detail.html\">this female parishioner showed far more courage</a> than did the cowardly cops at Columbine.  She was certainly not given a spirit of fear.  Nor are any of us:</p><blockquote><p>Jeanne Assam appeared before the news media for the first time Monday and said she “did not think for a minute to run away” when a gunman entered the New Life Church in Colorado Springs and started shooting….”I saw him coming through the doors” and took cover, Assam said. “I came out of cover and identified myself and engaged him and took him down.”</p><p>Assam had several years of experience in law enforcement and is licensed to carry a weapon. She attends one of the morning services and then volunteers as a guard during another service.  “I give credit to God,” Assam said. “God was with me. I didn’t think for a minute to run away.”</p></blockquote><p>When the time came, she stood in the gap <a href=\"http://www.denverpost.com/news/ci_7683781\">when others failed</a>.  There is no higher praise.</p><p>UPDATE – After reading through the link above, one thing stands out to me.  In these situations, stalk-and-shoot applies.  Don’t issue any warnings, just take the guy out.</p><p>UPDATE II – Yes, my dear defensive atheists, the shooter does really appear to have been one of you.  It’s hard to argue that I’m making a No True Christian argument considering the evidence about the end of Murray’s faith.  If one can never abandon one’s faith, then what in the name of Charles Darwin is the point of all this New Atheist evangelism?</p><blockquote><p>“You Christians brought this on yourselves,” Murray wrote on a Web site for people who have left Pentecostal and fundamentalist religious organizations.  “I’m coming for EVERYONE soon and I WILL be armed to the @#%$ teeth and I WILL shoot to kill. …God, I can’t wait till I can kill you people. Feel no remorse, no sense of shame, I don’t care if I live or die in the shoot-out. All I want to do is kill and injure as many of you … as I can especially Christians who are to blame for most of the problems in the world.”</p></blockquote><p>Sounds familiar, doesn’t it.  Like previous atheist converts from Stalin to Dawkins and Hitchens, Murray rejected Jesus Christ and found nihilistic hate in his atheism.  I would think Murray might be regarded as an atheist hero, considering common atheist beliefs such as “religion poisons everything” and Christians “are to blame for most of the problems in the world….”</p><p>My point not that Christians cannot and do not do evil things.  They can and do, and the mere fact of evil-doing is not sufficient to deny an individual’s Christianity; if that is the metric then there are no Christians on this planet.  As I previously wrote, these church shootings could have been a divorce gone bad, a jealous boyfriend or a delusional individual operating under the belief that he was the Angel of Death sent on a mission by God.  But the probability is that a shooter is an atheist is nearly as high as the likelihood that he is young and male.  It’s obviously a relevant factor.</p></div>",
  "content_text": "My, my, what a coincidence.  As expected, yet another shooter turns out to be\na militant anti-theist\n:\nAccording to a law enforcement source, the man professed to “hate all Christians,” and reportedly left a note or letter that he intended to murder as many Christians as possible.\nLarge-scale murder or small-scale slaughter, it’s simply amazing how often these killers turn out to be self-identified atheists, especially given the fact that this group is such a small percentage of the population.  Correlation may not be causation, but when this sort of statistical improbability regarding the behavior of a tiny minority becomes not only reliable, but downright predictable, that just may be the first clue the relationship is causal.\nWhat I find most interesting is the inevitably defensive reaction of their fellow atheists.  Instead of taking a scientific approach by examining the available evidence and then formulating a testable hypothesis to explain it, too many atheists take a philosophical approach similar to that of the medieval philosophers in attempting to ignore the evidence and focusing on the abstract logic of the matter.  The relevant question isn’t why WOULD atheists possess a predilection for committing murder, but rather why DO avowed atheists commit mass murder at a much higher rate than agnostics, other non-believers and theists.\nIn light of the recent discussion which involved atheists crowing over converting the younger generation away from Christianity, it appears that the killer was just such an example of such a conversion to faithlessness: “The gunman was identified as Matthew Murray, 24, who was home-schooled in what a friend said was a deeply religious Christian household.”\nIsn’t it interesting that the media feels the need to mention the fact that the man was home-schooled\na quarter of his life\nago?  Of course, it’s inevitable that some will try to claim he was a Christian, on the same familial basis that applies to Richard Dawkins, Christopher Hitchens and Daniel Dennett.\nOn a tangential note, it’s definitely worth noting that\nthis female parishioner showed far more courage\nthan did the cowardly cops at Columbine.  She was certainly not given a spirit of fear.  Nor are any of us:\nJeanne Assam appeared before the news media for the first time Monday and said she “did not think for a minute to run away” when a gunman entered the New Life Church in Colorado Springs and started shooting….”I saw him coming through the doors” and took cover, Assam said. “I came out of cover and identified myself and engaged him and took him down.”\nAssam had several years of experience in law enforcement and is licensed to carry a weapon. She attends one of the morning services and then volunteers as a guard during another service.  “I give credit to God,” Assam said. “God was with me. I didn’t think for a minute to run away.”\nWhen the time came, she stood in the gap\nwhen others failed\n.  There is no higher praise.\nUPDATE – After reading through the link above, one thing stands out to me.  In these situations, stalk-and-shoot applies.  Don’t issue any warnings, just take the guy out.\nUPDATE II – Yes, my dear defensive atheists, the shooter does really appear to have been one of you.  It’s hard to argue that I’m making a No True Christian argument considering the evidence about the end of Murray’s faith.  If one can never abandon one’s faith, then what in the name of Charles Darwin is the point of all this New Atheist evangelism?\n“You Christians brought this on yourselves,” Murray wrote on a Web site for people who have left Pentecostal and fundamentalist religious organizations.  “I’m coming for EVERYONE soon and I WILL be armed to the @#%$ teeth and I WILL shoot to kill. …God, I can’t wait till I can kill you people. Feel no remorse, no sense of shame, I don’t care if I live or die in the shoot-out. All I want to do is kill and injure as many of you … as I can especially Christians who are to blame for most of the problems in the world.”\nSounds familiar, doesn’t it.  Like previous atheist converts from Stalin to Dawkins and Hitchens, Murray rejected Jesus Christ and found nihilistic hate in his atheism.  I would think Murray might be regarded as an atheist hero, considering common atheist beliefs such as “religion poisons everything” and Christians “are to blame for most of the problems in the world….”\nMy point not that Christians cannot and do not do evil things.  They can and do, and the mere fact of evil-doing is not sufficient to deny an individual’s Christianity; if that is the metric then there are no Christians on this planet.  As I previously wrote, these church shootings could have been a divorce gone bad, a jealous boyfriend or a delusional individual operating under the belief that he was the Angel of Death sent on a mission by God.  But the probability is that a shooter is an atheist is nearly as high as the likelihood that he is young and male.  It’s obviously a relevant factor.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-11T00:23:00+00:00"
}