{
  "url": "https://voxday.net/2007/12/19/atheist-santa/",
  "scraped_at": "2026-01-08T22:04:17.127499",
  "title": "Atheist Santa",
  "date_display": "December 19, 2007",
  "date_iso": "2007-12-19T17:55:00+00:00",
  "date_from_url": "2007-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Objectivist and Pagan Santas <a href=\"http://www.wired.com/culture/lifestyle/commentary/alttext/2007/12/alttext_1219\">are pretty good too</a>:</p><blockquote><p>Who’s that coming down the chimney? Nobody — that’s ridiculous. Atheist Santa shows up in a gray Toyota Corolla and knocks on your door. Once you let him in and he has cookies and milk — come on, even atheists love cookies and milk — he will explain to your child that Santa may love all the children of the world, but he has never submitted his claims of flying reindeer and magical present delivery to James Randi, who would gladly pay a million dollars if presented with irrefutable proof of his wild claims. However, as a gesture of goodwill, Atheist Santa will leave your child with a set of wooden periodic-table blocks and a scale model of archaeopteryx.</p></blockquote><p>It’s funny, but let me anticipate PZ Myers and <a href=\"http://www.brentrasmussen.com/log/\">Brent Rasmussen</a> by pointing out that it’s a totally unfair characterization of atheists, who not only love cookies and milk but also have morals and ethics and love their children, (or would, anyhow, if they ever happened to find a woman willing to civil-union them who didn’t later prefer an abortion to giving up her career in applied Women’s Studies), and even celebrate Winterval with various traditions including but not limited to the pagan customs later shamelessly stolen by evil Christians.  Because Atheist Santa would never drive a gray Toyota Carolla, he’d drive an old gray diesel Volvo with a pine-scented air freshener.</p></div>",
  "content_text": "The Objectivist and Pagan Santas\nare pretty good too\n:\nWho’s that coming down the chimney? Nobody — that’s ridiculous. Atheist Santa shows up in a gray Toyota Corolla and knocks on your door. Once you let him in and he has cookies and milk — come on, even atheists love cookies and milk — he will explain to your child that Santa may love all the children of the world, but he has never submitted his claims of flying reindeer and magical present delivery to James Randi, who would gladly pay a million dollars if presented with irrefutable proof of his wild claims. However, as a gesture of goodwill, Atheist Santa will leave your child with a set of wooden periodic-table blocks and a scale model of archaeopteryx.\nIt’s funny, but let me anticipate PZ Myers and\nBrent Rasmussen\nby pointing out that it’s a totally unfair characterization of atheists, who not only love cookies and milk but also have morals and ethics and love their children, (or would, anyhow, if they ever happened to find a woman willing to civil-union them who didn’t later prefer an abortion to giving up her career in applied Women’s Studies), and even celebrate Winterval with various traditions including but not limited to the pagan customs later shamelessly stolen by evil Christians.  Because Atheist Santa would never drive a gray Toyota Carolla, he’d drive an old gray diesel Volvo with a pine-scented air freshener.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-19T17:55:00+00:00"
}