{
  "url": "https://voxday.net/2007/12/27/bhutto-bombing/",
  "scraped_at": "2026-01-08T22:05:10.967051",
  "title": "Bhutto bombing",
  "date_display": "December 27, 2007",
  "date_iso": "2007-12-27T13:51:00+00:00",
  "date_from_url": "2007-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This time, <a href=\"http://news.yahoo.com/s/ap/20071227/ap_on_re_as/pakistan\">they got her</a>.  Are we actually supposed to be surprised by this?  To me, it was inevitable and the only real question is who got her?  It might have been the jihadists, or as some of her supporters obviously believe, it could have been the current military regime which was basically handed carte blanche to get rid of a rival while blaming it on the jihadists after her return to Pakistan.</p><p>Shrieking headlines notwithstanding, I don’t see it being of much global significance one way or another as she wasn’t popular enough to return to power anyhow.  Unless the neocons were seriously thinking of invading Pakistan and installing her as a puppet like Hamid Karzai – and let’s face it, they’re crazy enough to have considered it – I don’t see this as being either unexpected or internationally problematic.</p><p>UPDATE – I haven’t been paying any attention whatsoever to Pakistan, so it’s interesting to learn that <a href=\"http://corner.nationalreview.com/post/?q=YTYyZDM1ZTJiYTEzMzM2ZDZjNTAxZWQ3MzMzODBmOTg=\">according to Bhutto’s former neighbor</a>, Mark Steyn, (!?!), the postulated neocon craziness I mentioned was, apparently, part of the grand plan for World Democratic Revolution:</p><blockquote><p>The State Department geniuses thought they had it all figured out. They’d arranged a shotgun marriage between the Bhutto and Sharif factions as a “united” “democratic” “movement” and were pushing Musharraf to reach a deal with them.</p></blockquote></div>",
  "content_text": "This time,\nthey got her\n.  Are we actually supposed to be surprised by this?  To me, it was inevitable and the only real question is who got her?  It might have been the jihadists, or as some of her supporters obviously believe, it could have been the current military regime which was basically handed carte blanche to get rid of a rival while blaming it on the jihadists after her return to Pakistan.\nShrieking headlines notwithstanding, I don’t see it being of much global significance one way or another as she wasn’t popular enough to return to power anyhow.  Unless the neocons were seriously thinking of invading Pakistan and installing her as a puppet like Hamid Karzai – and let’s face it, they’re crazy enough to have considered it – I don’t see this as being either unexpected or internationally problematic.\nUPDATE – I haven’t been paying any attention whatsoever to Pakistan, so it’s interesting to learn that\naccording to Bhutto’s former neighbor\n, Mark Steyn, (!?!), the postulated neocon craziness I mentioned was, apparently, part of the grand plan for World Democratic Revolution:\nThe State Department geniuses thought they had it all figured out. They’d arranged a shotgun marriage between the Bhutto and Sharif factions as a “united” “democratic” “movement” and were pushing Musharraf to reach a deal with them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-27T13:51:00+00:00"
}