{
  "url": "https://voxday.net/2007/12/03/biblical-evidence-2/",
  "scraped_at": "2026-01-08T22:02:36.452026",
  "title": "Biblical evidence",
  "date_display": "December 3, 2007",
  "date_iso": "2007-12-03T13:08:00+00:00",
  "date_from_url": "2007-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an interesting point to demonstrate that the Bible indeed has a legitimate claim to inventing the scientific method.  I should be interested to know if there is an older one; there may well be.  But the evidence of Daniel 1:1-16 demonstrates that <a href=\"http://scienceblogs.com/omnibrain/2007/11/first_recorded_experiment_dani.php\">use of the scientific method </a>long pre-dates the scientific era and professional scientists:</p><blockquote><p>1:10 And the prince of the eunuchs said unto Daniel, I fear my lord the king, who hath appointed your meat and your drink: for why should he see your faces worse liking than the children which are of your sort? then shall ye make me endanger my head to the king.<br>1:11 Then said Daniel to Melzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,<br>1:12 Prove thy servants, I beseech thee, ten days; and let them give us pulse to eat, and water to drink.<br>1:13 Then let our countenances be looked upon before thee, and the countenance of the children that eat of the portion of the king’s meat: and as thou seest, deal with thy servants.<br>1:14 So he consented to them in this matter, and proved them ten days.<br>1:15 And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the king’s meat.<br>1:16 Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse.</br></br></br></br></br></br></p></blockquote><p>The most interesting thing about the greater part of the atheist case against religion is how reliably <i>unscientific</i> it is, in absolutely every single way.  There is a massive cornucopia of evidence to demonstrate that atheists rely primarily on philosophical logic for both their attacks on religion as well as their defenses of atheism’s historical evils.</p><p>That being said, I’d prefer to stick with the meat and wine myself.  It’s interesting to note that several thousand years before nutritional science and the FDA managed to get it straight, the prophet Daniel had already proven that it’s carbohydrates, not protein and fat, that fattens one flesh.  Yet another point for religion over science.</p></div>",
  "content_text": "This is an interesting point to demonstrate that the Bible indeed has a legitimate claim to inventing the scientific method.  I should be interested to know if there is an older one; there may well be.  But the evidence of Daniel 1:1-16 demonstrates that\nuse of the scientific method\nlong pre-dates the scientific era and professional scientists:\n1:10 And the prince of the eunuchs said unto Daniel, I fear my lord the king, who hath appointed your meat and your drink: for why should he see your faces worse liking than the children which are of your sort? then shall ye make me endanger my head to the king.\n1:11 Then said Daniel to Melzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,\n1:12 Prove thy servants, I beseech thee, ten days; and let them give us pulse to eat, and water to drink.\n1:13 Then let our countenances be looked upon before thee, and the countenance of the children that eat of the portion of the king’s meat: and as thou seest, deal with thy servants.\n1:14 So he consented to them in this matter, and proved them ten days.\n1:15 And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the king’s meat.\n1:16 Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse.\nThe most interesting thing about the greater part of the atheist case against religion is how reliably\nunscientific\nit is, in absolutely every single way.  There is a massive cornucopia of evidence to demonstrate that atheists rely primarily on philosophical logic for both their attacks on religion as well as their defenses of atheism’s historical evils.\nThat being said, I’d prefer to stick with the meat and wine myself.  It’s interesting to note that several thousand years before nutritional science and the FDA managed to get it straight, the prophet Daniel had already proven that it’s carbohydrates, not protein and fat, that fattens one flesh.  Yet another point for religion over science.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-03T13:08:00+00:00"
}