{
  "url": "https://voxday.net/2007/12/28/counting-conservative-sheep/",
  "scraped_at": "2026-01-08T22:05:20.194959",
  "title": "Counting conservative sheep",
  "date_display": "December 28, 2007",
  "date_iso": "2007-12-28T10:29:00+00:00",
  "date_from_url": "2007-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joe Carter notes that it can be a bit of a shock to finally recognize that many Republicans and so-called “conservatives” <a href=\"http://www.evangelicaloutpost.com/archives/004151.html\">are every bit the mindless herd animals</a> that their Democratic and so-called “liberals” regularly demonstrate themselves to be:</p><blockquote><p>I have to confess that I’d always associated sheeplishness with the Left. Liberals, according to my stereotype, are more prone to collectivism and–despite what they might claim–invariably not a part of the “reality-based community.” Conservatives, I foolishly believed, were different. We relied on facts and based our opinions on sound arguments. We did our own homework and didn’t rely on other people to do our thinking for us.</p><p>I know, I know, it’s a silly delusion. Had I given it even a moment’s thought I’d have recognized the fallacy of my own bias. But until recently, I didn’t give it much thought. It was only after the pundits started repeating erroneous claims about a topic I knew something about that I realized that they really were, as their liberal critics often claimed, regurgitating the same talking points.</p></blockquote><p>Most pundits are deeply clueless.  You have to keep in mind that they are the sort of people who think they know all about Europe from a semester in London plus a two-week trip to Rome five years ago.  Interviewing a general makes them experts in all things military and having once heard of something means they “know” about it.  They’re NEVER held to account for being wrong; one thing I’d like to do someday is start a Pundit Prediction Percentage site tracking predictions and providing accuracy ratings for every significant commentator.  Todd Seavey’s little summary of our new friend <a href=\"http://toddseavey.com/2007/12/23/book-selection-of-the-month-liberal-fascism-by-jonah-golderg-plus-war-and-globalism/\">David Frum’s prophetic acumen</a> indicates why such a site would be not only desirable, but downright useful.</p><p><i>…while Frum is very smart and writes well, if you take his advice on how to rebuild the GOP, you’re taking advice from the same guy who declared Bush The Right Man in 2003, ten years after he pronounced the conservative movement electorally dead in his 1993 book Dead Right — one year before the GOP took over Congress)</i></p><p>If history is any guide, Frum’s new book <i>Comeback</i> should represent the final nail in the GOP’s coffin for a generation.  Anyhow, if this is a concept that happens to interest you, email me with PPP in the subject and tell me which pundit you’d be interested in tracking.  I haven’t worked out the precise formula yet, but the inevitable New Year’s predictions coming up should prove to be somewhat useful.</p></div>",
  "content_text": "Joe Carter notes that it can be a bit of a shock to finally recognize that many Republicans and so-called “conservatives”\nare every bit the mindless herd animals\nthat their Democratic and so-called “liberals” regularly demonstrate themselves to be:\nI have to confess that I’d always associated sheeplishness with the Left. Liberals, according to my stereotype, are more prone to collectivism and–despite what they might claim–invariably not a part of the “reality-based community.” Conservatives, I foolishly believed, were different. We relied on facts and based our opinions on sound arguments. We did our own homework and didn’t rely on other people to do our thinking for us.\nI know, I know, it’s a silly delusion. Had I given it even a moment’s thought I’d have recognized the fallacy of my own bias. But until recently, I didn’t give it much thought. It was only after the pundits started repeating erroneous claims about a topic I knew something about that I realized that they really were, as their liberal critics often claimed, regurgitating the same talking points.\nMost pundits are deeply clueless.  You have to keep in mind that they are the sort of people who think they know all about Europe from a semester in London plus a two-week trip to Rome five years ago.  Interviewing a general makes them experts in all things military and having once heard of something means they “know” about it.  They’re NEVER held to account for being wrong; one thing I’d like to do someday is start a Pundit Prediction Percentage site tracking predictions and providing accuracy ratings for every significant commentator.  Todd Seavey’s little summary of our new friend\nDavid Frum’s prophetic acumen\nindicates why such a site would be not only desirable, but downright useful.\n…while Frum is very smart and writes well, if you take his advice on how to rebuild the GOP, you’re taking advice from the same guy who declared Bush The Right Man in 2003, ten years after he pronounced the conservative movement electorally dead in his 1993 book Dead Right — one year before the GOP took over Congress)\nIf history is any guide, Frum’s new book\nComeback\nshould represent the final nail in the GOP’s coffin for a generation.  Anyhow, if this is a concept that happens to interest you, email me with PPP in the subject and tell me which pundit you’d be interested in tracking.  I haven’t worked out the precise formula yet, but the inevitable New Year’s predictions coming up should prove to be somewhat useful.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-28T10:29:00+00:00"
}