{
  "url": "https://voxday.net/2007/12/13/culturally-christian-atheis/",
  "scraped_at": "2026-01-08T22:03:39.644093",
  "title": "The “culturally christian” atheist",
  "date_display": "December 13, 2007",
  "date_iso": "2007-12-13T21:26:00+00:00",
  "date_from_url": "2007-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins <a href=\"http://www.christiantoday.com/article/atheist.dawkins.calls.himself.a.cultural.christian/15475.htm\">is not wrong</a>, in fact, it appears he hasn’t entirely grasped the full extent of Christianity’s influence on his thinking:</p><blockquote><p>Staunch atheist Richard Dawkins recently denied wanting to stop Christian traditions, instead labelling himself a “cultural Christian”.</p><p>“This is historically a Christian country. I’m a cultural Christian in the same way many of my friends call themselves cultural Jews or cultural Muslims,” Oxford biologist Dawkins said on BBC’s recent “Have Your Say” programme on Sunday.</p></blockquote><p>Where Dawkins falls short is that he is mostly a “moral Christian” as well.  This is why the vehemently atheist Michel Onfray criticizes him and his fellow secular humanists in <i>In Defense of Atheism</i>, stating “many individuals who consider themselves atheists profess – without noticing it – an ethic, a way of thinking, a vision of the world saturated in Judeo-Christianity….  The Western body (including that of atheists, Muslims, deists and agnostics raised in the geographic and ideological Judeo-Christian zone) is Christian.”</p><p>Dawkins’s atheism, like most Western atheists, is inherently Christian in its very framework.  This is why Onfray rejects “Christian atheism” and calls for a post-Christian “atheist atheism”.  He writes: “The immanent ordering of the world distinguishes the Christian atheist from the Christian believer.  But not their values, which remain identical….  Their concerns are charity, temperance, compassion, mercy and humility, but also love of one’s neighbor and the forgiveness of offenses…. Most of the time, this Christian atheism dismisses the Pauline hatred of the body, its rejection of desires, pleasures, drives and passions.”</p><p>Note that Onfray is saying exactly what I have been saying, that the New Atheism is an attempt to cling to Christianity without Jesus Christ, less the concept of sexual sin.  Dawkins, those who have read <i>The God Delusion</i> may recall, does not reject the Ten Commandments in their entirety, he merely wishes to replace <s>three</s>four of them.  This moral parasitism is not undesirable in practice, but it is rationally indefensible.</p></div>",
  "content_text": "Richard Dawkins\nis not wrong\n, in fact, it appears he hasn’t entirely grasped the full extent of Christianity’s influence on his thinking:\nStaunch atheist Richard Dawkins recently denied wanting to stop Christian traditions, instead labelling himself a “cultural Christian”.\n“This is historically a Christian country. I’m a cultural Christian in the same way many of my friends call themselves cultural Jews or cultural Muslims,” Oxford biologist Dawkins said on BBC’s recent “Have Your Say” programme on Sunday.\nWhere Dawkins falls short is that he is mostly a “moral Christian” as well.  This is why the vehemently atheist Michel Onfray criticizes him and his fellow secular humanists in\nIn Defense of Atheism\n, stating “many individuals who consider themselves atheists profess – without noticing it – an ethic, a way of thinking, a vision of the world saturated in Judeo-Christianity….  The Western body (including that of atheists, Muslims, deists and agnostics raised in the geographic and ideological Judeo-Christian zone) is Christian.”\nDawkins’s atheism, like most Western atheists, is inherently Christian in its very framework.  This is why Onfray rejects “Christian atheism” and calls for a post-Christian “atheist atheism”.  He writes: “The immanent ordering of the world distinguishes the Christian atheist from the Christian believer.  But not their values, which remain identical….  Their concerns are charity, temperance, compassion, mercy and humility, but also love of one’s neighbor and the forgiveness of offenses…. Most of the time, this Christian atheism dismisses the Pauline hatred of the body, its rejection of desires, pleasures, drives and passions.”\nNote that Onfray is saying exactly what I have been saying, that the New Atheism is an attempt to cling to Christianity without Jesus Christ, less the concept of sexual sin.  Dawkins, those who have read\nThe God Delusion\nmay recall, does not reject the Ten Commandments in their entirety, he merely wishes to replace\nthree\nfour of them.  This moral parasitism is not undesirable in practice, but it is rationally indefensible.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-13T21:26:00+00:00"
}