{
  "url": "https://voxday.net/2007/12/06/dramatis-personae/",
  "scraped_at": "2026-01-08T22:02:56.710585",
  "title": "Dramatis Personae",
  "date_display": "December 6, 2007",
  "date_iso": "2007-12-06T21:23:00+00:00",
  "date_from_url": "2007-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In order to help the various new readers who are likely to stumble upon this place once the book comes out, I thought it might be helpful to provide a basic cast of characters to serve as a reference work.  If there’s someone you think should definitely be on it, please nominate them in the comments here along with a short description, two sentences max.  They can be past or present regulars, who knows, perhaps some old friends will come back to visit.</p><p>For example, one might consider <b>Nate</b> aka Der Hausfrauhrer.  Cowboy, motorcycle aficionado and Keeper of the Harem.  Likes: motorcycles, women, the Tennessee Titans.  Dislikes: Yankees, damn Yankees and bringing up the rear in the VPFL.  Red Flags:  The War of Northern Aggression. Or <b>Bane</b>, aka The Reaper’s Hairball.  Ex-soldier, full-time sociopath and dedicated admirer of peasant women.  Likes: guns, women, Red Alert.  Dislikes: people.  Red Flags: Yes.</p><p>Only Voxologisti require AKA, as this will be a link to their blog.  Nominate away and don’t nominate yourself.</p></div>",
  "content_text": "In order to help the various new readers who are likely to stumble upon this place once the book comes out, I thought it might be helpful to provide a basic cast of characters to serve as a reference work.  If there’s someone you think should definitely be on it, please nominate them in the comments here along with a short description, two sentences max.  They can be past or present regulars, who knows, perhaps some old friends will come back to visit.\nFor example, one might consider\nNate\naka Der Hausfrauhrer.  Cowboy, motorcycle aficionado and Keeper of the Harem.  Likes: motorcycles, women, the Tennessee Titans.  Dislikes: Yankees, damn Yankees and bringing up the rear in the VPFL.  Red Flags:  The War of Northern Aggression. Or\nBane\n, aka The Reaper’s Hairball.  Ex-soldier, full-time sociopath and dedicated admirer of peasant women.  Likes: guns, women, Red Alert.  Dislikes: people.  Red Flags: Yes.\nOnly Voxologisti require AKA, as this will be a link to their blog.  Nominate away and don’t nominate yourself.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-06T21:23:00+00:00"
}