{
  "url": "https://voxday.net/2007/12/20/econ-is-hard/",
  "scraped_at": "2026-01-08T22:04:26.263051",
  "title": "Econ is hard",
  "date_display": "December 20, 2007",
  "date_iso": "2007-12-20T17:27:00+00:00",
  "date_from_url": "2007-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is Megan McArdle related to David Frum?  I am somewhat puzzled at these obvious economic illiterates <a href=\"http://meganmcardle.theatlantic.com/archives/2007/12/did_ron_paul_school_ben_bernan.php\">attempting to criticize Ron Paul on the subject of the monetary policy</a>:</p><blockquote><p>Ron Paul’s supporters see the might of his common sense slashing through the doubletalk of the financial solons. I see a really, really smart economist responding to Ron Paul the same way you react to Cousin Mildred when she corners you after Christmas dinner to complain about the flouridation of the water supply. What Congressman Dr. Paul is saying doesn’t make any particular sense; American consumers are not particularly suffering because of the decline of the dollar, the dollar is not declining because of Fed policy, and the Federal Reserve has nothing to do with a relative scarcity of oil and food, which is what is driving the CPI increases he complains about. If we were on the gold standard, oil and food would still be getting more expensive, and people on fixed incomes would still be feeling the pinch.</p></blockquote><p>So, the dollar isn’t declining because of its increasing supply… forget macro, McArdle obviously doesn’t even know Econ 101.  She also seems unaware that gold has gone from 275 to 800, which is a pretty good indication that oil and food would NOT be getting anywhere nearly as expensive on a gold standard.</p><p>To put things in an international perspective, Britain’s fifth-largest mortgage bank is being propped-up to keep it from failing and Switzerland’s largest bank needed to sell 10.6 percent of its stock to Singapore and a unknown Arab investor in order to secure its capital base, which was short the CHF 23 billion it managed to lose in the US housing market <i>in only two quarters</i>.  (Notice that this meltdown is being called the “subprime crisis” in order to avoid scaring ignorant homeowners who have no idea what it means.)  It’s worth noting that the head of Switzerland’s Federal Banking Commission told NZZ am Sonntag this week that the danger to financial institutions was far from over, as “The subprime crisis could spread to other credit markets, such as in the fields of credit cards, consumer credit, car financing, student loans or commercial credit.”</p><p>Translation from the translation of the original Cherman: “It ain’t over yet.”</p><p>I’m sure none of that could possibly affect the American consumer, who can’t possibly be suffering because the official statistics indicate solid economic growth and low inflation.  What does the top Swiss banker know, in comparison with brilliant economic minds like McArdle and Frum?</p><p>In case you’re not absolutely certain that she’s a clueless economic illiterate with an unhealthy interest in the dismal science, Miss McArdle goes on <a href=\"http://meganmcardle.theatlantic.com/archives/2007/12/but_gas_costs_so_much_at_the_p.php\">to post this gem</a>:</p><blockquote><p>To a first approximation, zero. Oil is priced in dollars in the international market. The falling dollar has no effect on the price of oil. And inflation is a tiny contributor to the huge increase in gasoline prices.</p></blockquote><p>Right, because the Fed-increased supply of dollars has only caused its value to fall against gold, the euro, the yen and the franc, <i>but not oil</i>.  A commenter bitch-slaps her so hard that she must have done a full Linda Blair, as <a href=\"http://www.dallasfed.org/research/swe/2004/swe0403c.html\">he quotes the Dallas Fed</a>: <i>“Research shows that a 10 percent reduction in the value of the dollar against the currencies of other oil-consuming countries leads to a 7.5 percent increase in the dollar price of oil.”</i></p><p>75 percent is “tiny”, right?  I’d say this girl is borderline retarded, but then, as a plastic philosopher has informed us, math is hard for girls.</p></div>",
  "content_text": "Is Megan McArdle related to David Frum?  I am somewhat puzzled at these obvious economic illiterates\nattempting to criticize Ron Paul on the subject of the monetary policy\n:\nRon Paul’s supporters see the might of his common sense slashing through the doubletalk of the financial solons. I see a really, really smart economist responding to Ron Paul the same way you react to Cousin Mildred when she corners you after Christmas dinner to complain about the flouridation of the water supply. What Congressman Dr. Paul is saying doesn’t make any particular sense; American consumers are not particularly suffering because of the decline of the dollar, the dollar is not declining because of Fed policy, and the Federal Reserve has nothing to do with a relative scarcity of oil and food, which is what is driving the CPI increases he complains about. If we were on the gold standard, oil and food would still be getting more expensive, and people on fixed incomes would still be feeling the pinch.\nSo, the dollar isn’t declining because of its increasing supply… forget macro, McArdle obviously doesn’t even know Econ 101.  She also seems unaware that gold has gone from 275 to 800, which is a pretty good indication that oil and food would NOT be getting anywhere nearly as expensive on a gold standard.\nTo put things in an international perspective, Britain’s fifth-largest mortgage bank is being propped-up to keep it from failing and Switzerland’s largest bank needed to sell 10.6 percent of its stock to Singapore and a unknown Arab investor in order to secure its capital base, which was short the CHF 23 billion it managed to lose in the US housing market\nin only two quarters\n.  (Notice that this meltdown is being called the “subprime crisis” in order to avoid scaring ignorant homeowners who have no idea what it means.)  It’s worth noting that the head of Switzerland’s Federal Banking Commission told NZZ am Sonntag this week that the danger to financial institutions was far from over, as “The subprime crisis could spread to other credit markets, such as in the fields of credit cards, consumer credit, car financing, student loans or commercial credit.”\nTranslation from the translation of the original Cherman: “It ain’t over yet.”\nI’m sure none of that could possibly affect the American consumer, who can’t possibly be suffering because the official statistics indicate solid economic growth and low inflation.  What does the top Swiss banker know, in comparison with brilliant economic minds like McArdle and Frum?\nIn case you’re not absolutely certain that she’s a clueless economic illiterate with an unhealthy interest in the dismal science, Miss McArdle goes on\nto post this gem\n:\nTo a first approximation, zero. Oil is priced in dollars in the international market. The falling dollar has no effect on the price of oil. And inflation is a tiny contributor to the huge increase in gasoline prices.\nRight, because the Fed-increased supply of dollars has only caused its value to fall against gold, the euro, the yen and the franc,\nbut not oil\n.  A commenter bitch-slaps her so hard that she must have done a full Linda Blair, as\nhe quotes the Dallas Fed\n:\n“Research shows that a 10 percent reduction in the value of the dollar against the currencies of other oil-consuming countries leads to a 7.5 percent increase in the dollar price of oil.”\n75 percent is “tiny”, right?  I’d say this girl is borderline retarded, but then, as a plastic philosopher has informed us, math is hard for girls.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-20T17:27:00+00:00"
}