{
  "url": "https://voxday.net/2007/12/27/feckless-outdoes-himself/",
  "scraped_at": "2026-01-08T22:05:12.783900",
  "title": "Feckless outdoes himself",
  "date_display": "December 27, 2007",
  "date_iso": "2007-12-27T17:13:00+00:00",
  "date_from_url": "2007-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Can you find the factual errors?  There are four objective ones – plus an additional five if you’re willing to get subjective, but reasonable – <a href=\"http://shakespearessister.blogspot.com/2007/12/i-must-be-slipping-in-my-old-age.html\">in this one paragraph alone</a>:</p><blockquote><p>Many of you are doubtless unfamiliar with Ted “Theodore” Beale, better known as completely insane person Vox Day. Foxy Voxy is a Christian Dominionist libertarian, a pairing that makes no earthly sense, as it’s impossible to force people to worship Jesus while still preserving personal liberty. Vox has written some horrible, horrible works of fiction, and his dad is a notorious tax cheat who fled the country rather than go to jail for tax evasion. But Vox is most famous for his personal blog and his column at WorldNetDaily (purchased, I must note, by his father, who was one of the principal founders of the site). In that blog, Vox generally attacks women and minorities, and both if he has his mojo working. But Vox doesn’t just attack women — he despises them. Vox makes MRAs move away, slowly, while muttering about his needing to calm down about the ladies. Vox, in short, is just a cavalcade of evil, and I’ve been tracking him off and on for some time now.</p></blockquote><p>Good times, good times.  The comments are particularly amusing; the level of mental acumen of the women there, unsurprisingly, is such that they actually think the above passage constitutes a “takedown”.  Hey, this one’s new: <i>It boggles my mind that any self-respecting (or not!) woman would sleep with this guy.</i>.  Of course no “self-respecting” woman would, since the proper translation of the feminist term “self-respecting” is “fat, ugly, and unpleasant”.  I prefer my women to be hot, slender and blonde, as God intended them to be.</p><p>I particularly enjoyed the irony of how one woman claims I “stalked” her – I have no idea who she is but apparently I linked to her post about one of MY columns – in light of Feckles statement about “tracking” me.  I hate to disappoint dear Mr. Fecke, but I’m afraid he’ll have to battle Michael Medved for my favors.</p></div>",
  "content_text": "Can you find the factual errors?  There are four objective ones – plus an additional five if you’re willing to get subjective, but reasonable –\nin this one paragraph alone\n:\nMany of you are doubtless unfamiliar with Ted “Theodore” Beale, better known as completely insane person Vox Day. Foxy Voxy is a Christian Dominionist libertarian, a pairing that makes no earthly sense, as it’s impossible to force people to worship Jesus while still preserving personal liberty. Vox has written some horrible, horrible works of fiction, and his dad is a notorious tax cheat who fled the country rather than go to jail for tax evasion. But Vox is most famous for his personal blog and his column at WorldNetDaily (purchased, I must note, by his father, who was one of the principal founders of the site). In that blog, Vox generally attacks women and minorities, and both if he has his mojo working. But Vox doesn’t just attack women — he despises them. Vox makes MRAs move away, slowly, while muttering about his needing to calm down about the ladies. Vox, in short, is just a cavalcade of evil, and I’ve been tracking him off and on for some time now.\nGood times, good times.  The comments are particularly amusing; the level of mental acumen of the women there, unsurprisingly, is such that they actually think the above passage constitutes a “takedown”.  Hey, this one’s new:\nIt boggles my mind that any self-respecting (or not!) woman would sleep with this guy.\n.  Of course no “self-respecting” woman would, since the proper translation of the feminist term “self-respecting” is “fat, ugly, and unpleasant”.  I prefer my women to be hot, slender and blonde, as God intended them to be.\nI particularly enjoyed the irony of how one woman claims I “stalked” her – I have no idea who she is but apparently I linked to her post about one of MY columns – in light of Feckles statement about “tracking” me.  I hate to disappoint dear Mr. Fecke, but I’m afraid he’ll have to battle Michael Medved for my favors.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-27T17:13:00+00:00"
}