{
  "url": "https://voxday.net/2007/12/07/for-children-2/",
  "scraped_at": "2026-01-08T22:02:58.169424",
  "title": "For the children",
  "date_display": "December 7, 2007",
  "date_iso": "2007-12-07T08:37:00+00:00",
  "date_from_url": "2007-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d like to say that I’m shocked that a left-wing ex-priest with a radio show in San Francisco would be <a href=\"http://www.examiner.com/a-1090907~Talk_show_host_indicted_for_child_porn.html\">indicted on child porn charges</a>.  I’m not shocked, but I am a little surprised, since a more natural association with the words “liberal”, “ex-priest”, “San Francisco” and “indictment” would be “child molester”.  Although, I suppose this fails to take into account the fact that the man is a talk show host, not a teacher:</p><blockquote><p>In a shocking development from San Francisco, longtime liberal talk show host Bernie Ward has apparently been indicted on charges related to child pornography.</p></blockquote><p>I’m not sure that his lawyer’s proposed “writing a book” defense is likely to be all that effective, though.  If it is, publishers will soon be inundated by a tidal wave of book proposals about selling cocaine for the Medellin cartel.</p></div>",
  "content_text": "I’d like to say that I’m shocked that a left-wing ex-priest with a radio show in San Francisco would be\nindicted on child porn charges\n.  I’m not shocked, but I am a little surprised, since a more natural association with the words “liberal”, “ex-priest”, “San Francisco” and “indictment” would be “child molester”.  Although, I suppose this fails to take into account the fact that the man is a talk show host, not a teacher:\nIn a shocking development from San Francisco, longtime liberal talk show host Bernie Ward has apparently been indicted on charges related to child pornography.\nI’m not sure that his lawyer’s proposed “writing a book” defense is likely to be all that effective, though.  If it is, publishers will soon be inundated by a tidal wave of book proposals about selling cocaine for the Medellin cartel.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-07T08:37:00+00:00"
}