{
  "url": "https://voxday.net/2007/12/26/illustrating-fundamental-absurdity/",
  "scraped_at": "2026-01-08T22:05:01.913616",
  "title": "Illustrating the fundamental absurdity",
  "date_display": "December 26, 2007",
  "date_iso": "2007-12-26T09:39:00+00:00",
  "date_from_url": "2007-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of <a href=\"http://afp.google.com/article/ALeqM5hGhJUxebdPsEOUZ3O5S8f_6VhHww\">Imaginary Property</a>:</p><blockquote><p>In a potential blow to themed resorts from Vegas to Tokyo, Egypt is to pass a law requiring payment of royalties whenever its ancient monuments, from the pyramids to the sphinx, are reproduced.  Zahi Hawass, the charismatic and controversial head of Egypt’s Supreme Council of Antiquities, told AFP on Tuesday that the move was necessary to pay for the upkeep of the country’s thousands of pharaonic sites.</p><p>“The new law will completely prohibit the duplication of historic Egyptian monuments which the Supreme Council of Antiquities considers 100-percent copies,” he said.  “If the law is passed then it will be applied in all countries of the world so that we can protect our interests,” Hawass said.</p></blockquote><p>What a brilliant idea!  After all, if copyright can be extended from the life of the creator to 70 years after the life of the creator, there’s no logical reason not to extend it to 10,000 years after the life of the creator.</p><p>I’ve been an enthusiastic pirate all my life, as despite being a content creator myself, I’ve always understood that “IP” is nothing more than a variety of state-sanctioned theft.  What passes for the main “defense” of IP is simply a lie; most of man’s greatest works were created before the existence of IP.</p><p>Fortunately for we IP-atheists who refuse to bow down before the idol of Imaginary Property, it’s not only the technology curve that’s on our side, but <a href=\"http://pogue.blogs.nytimes.com/2007/12/20/the-generational-divide-in-copyright-morality/\">the generational one as well</a>.  That overwhelming majority of college students are not amoral, they’re merely recognizing the undeniable fact that if you had one apple before and you’ve still got one apple now even though I am happily crunching away something that is a perfect replica of your apple, then no one has taken anything away from you.  No theft has taken place.  But using the government to force me to pay you <i>for the apple you still possess</i> is theft.</p><p>Information not only wants to be free, information WILL be free.  And before you do anything so blatantly stupid and obvious as try to label me some sort of hypocrite, do stop and remind yourself exactly with whom you’re dealing.</p></div>",
  "content_text": "Of\nImaginary Property\n:\nIn a potential blow to themed resorts from Vegas to Tokyo, Egypt is to pass a law requiring payment of royalties whenever its ancient monuments, from the pyramids to the sphinx, are reproduced.  Zahi Hawass, the charismatic and controversial head of Egypt’s Supreme Council of Antiquities, told AFP on Tuesday that the move was necessary to pay for the upkeep of the country’s thousands of pharaonic sites.\n“The new law will completely prohibit the duplication of historic Egyptian monuments which the Supreme Council of Antiquities considers 100-percent copies,” he said.  “If the law is passed then it will be applied in all countries of the world so that we can protect our interests,” Hawass said.\nWhat a brilliant idea!  After all, if copyright can be extended from the life of the creator to 70 years after the life of the creator, there’s no logical reason not to extend it to 10,000 years after the life of the creator.\nI’ve been an enthusiastic pirate all my life, as despite being a content creator myself, I’ve always understood that “IP” is nothing more than a variety of state-sanctioned theft.  What passes for the main “defense” of IP is simply a lie; most of man’s greatest works were created before the existence of IP.\nFortunately for we IP-atheists who refuse to bow down before the idol of Imaginary Property, it’s not only the technology curve that’s on our side, but\nthe generational one as well\n.  That overwhelming majority of college students are not amoral, they’re merely recognizing the undeniable fact that if you had one apple before and you’ve still got one apple now even though I am happily crunching away something that is a perfect replica of your apple, then no one has taken anything away from you.  No theft has taken place.  But using the government to force me to pay you\nfor the apple you still possess\nis theft.\nInformation not only wants to be free, information WILL be free.  And before you do anything so blatantly stupid and obvious as try to label me some sort of hypocrite, do stop and remind yourself exactly with whom you’re dealing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-26T09:39:00+00:00"
}