{
  "url": "https://voxday.net/2007/12/05/imminent-divorcee-take-3/",
  "scraped_at": "2026-01-08T22:02:45.643372",
  "title": "The imminent divorcee, take 3",
  "date_display": "December 5, 2007",
  "date_iso": "2007-12-05T13:25:00+00:00",
  "date_from_url": "2007-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins attempts <a href=\"http://richarddawkins.net/article,1926,Banishing-the-Green-Eyed-Monster,Richard-Dawkins-On-Faith\">to demonstrate the superiority of atheist morality</a> by defending adultery.  Considering the historical evidence, it appears to be a subject about which he is not only passionate, but personally well-informed:</p><blockquote><p>No, of course sex outside marriage is not a public matter, and yes, of course it is forgivable. Only a person infected by the sort of sanctimonious self-righteousness that religion uniquely inspires would apply the meaningless word ‘sin’ to private sexual behavior.  It is the mark of the religious mind that it cares more about private than public morality.</p></blockquote><p>Just what, precisely, is the difference between “private” and “public” morality?  It seems to me that they’re exactly the same thing, an individual’s standard of right and wrong, but applied in different social spheres.  Is Dawkins seriously attempting to suggest that a single individual can possess different MORALITIES that apply depending on the environment in which that person happens to find himself at the moment?</p><blockquote><p>The underlying presumption — that a human being has some kind of property rights over another human being’s body — is unspoken because it is assumed to be obvious. But with what justification?  In one of the most disgusting stories to hit the British newspapers last year, the wife of a well-known television personality, Chris Tarrant, hired a private detective to spy on him. The detective reported evidence of adultery and Tarrant’s wife divorced him, in unusually vicious style. But what shocked me was the way public opinion sided with Tarrant’s horrible wife.</p></blockquote><p>Presumably the same justification that exists in any other contractual relationship into which one voluntarily enters. <a href=\"http://corner.nationalreview.com/post/?q=MGQ3YjNiMzkwOWEwZWY4OGUyOTUxODdkY2ZkOWJhOTU=\">As John O’Sullivan surmises</a>, it sounds very much as if Richard Dawkins is heading fast toward his third divorce.  At this point, he appears to have a real shot at surpassing fellow atheist icon Bertrand Russell, who only managed three divorces and four wives before clocking out.</p><p>I think there are perfectly reasonable societal and Biblical cases to be made for polygyny.  Richard Dawkins’s defense of his apparent desire to cheat on his wife is not coming close to any of them.  Perhaps he should consider converting to Islam, which would allow him to indulge in his favorite hobbies of attacking Christianity and collecting wives without being so easily dismissed as a typically amoral atheist.</p><p>UPDATE – It’s so hard when one’s idols are tarnished:</p><blockquote><p>“My first thought was that RD doth protest too much. Perhaps he got busted for cheating on his significant other at some point and is still miffed. RD IS still human after all. I certainly agree with RD’s views on religion and, there’s no question, on the truth of evolution…but RD’s position on the Tarrant situation was quite shocking to me.”</p><p>“Sadly, it is a common cry of theists that atheism leads to a lack of morality and, as a “spokesman for atheists”, I think RD has done us a disservice here.”</p></blockquote><p>Actually, the atheists who were capable of understanding <i>The God Delusion</i> know that he did them a disservice there too.</p></div>",
  "content_text": "Richard Dawkins attempts\nto demonstrate the superiority of atheist morality\nby defending adultery.  Considering the historical evidence, it appears to be a subject about which he is not only passionate, but personally well-informed:\nNo, of course sex outside marriage is not a public matter, and yes, of course it is forgivable. Only a person infected by the sort of sanctimonious self-righteousness that religion uniquely inspires would apply the meaningless word ‘sin’ to private sexual behavior.  It is the mark of the religious mind that it cares more about private than public morality.\nJust what, precisely, is the difference between “private” and “public” morality?  It seems to me that they’re exactly the same thing, an individual’s standard of right and wrong, but applied in different social spheres.  Is Dawkins seriously attempting to suggest that a single individual can possess different MORALITIES that apply depending on the environment in which that person happens to find himself at the moment?\nThe underlying presumption — that a human being has some kind of property rights over another human being’s body — is unspoken because it is assumed to be obvious. But with what justification?  In one of the most disgusting stories to hit the British newspapers last year, the wife of a well-known television personality, Chris Tarrant, hired a private detective to spy on him. The detective reported evidence of adultery and Tarrant’s wife divorced him, in unusually vicious style. But what shocked me was the way public opinion sided with Tarrant’s horrible wife.\nPresumably the same justification that exists in any other contractual relationship into which one voluntarily enters.\nAs John O’Sullivan surmises\n, it sounds very much as if Richard Dawkins is heading fast toward his third divorce.  At this point, he appears to have a real shot at surpassing fellow atheist icon Bertrand Russell, who only managed three divorces and four wives before clocking out.\nI think there are perfectly reasonable societal and Biblical cases to be made for polygyny.  Richard Dawkins’s defense of his apparent desire to cheat on his wife is not coming close to any of them.  Perhaps he should consider converting to Islam, which would allow him to indulge in his favorite hobbies of attacking Christianity and collecting wives without being so easily dismissed as a typically amoral atheist.\nUPDATE – It’s so hard when one’s idols are tarnished:\n“My first thought was that RD doth protest too much. Perhaps he got busted for cheating on his significant other at some point and is still miffed. RD IS still human after all. I certainly agree with RD’s views on religion and, there’s no question, on the truth of evolution…but RD’s position on the Tarrant situation was quite shocking to me.”\n“Sadly, it is a common cry of theists that atheism leads to a lack of morality and, as a “spokesman for atheists”, I think RD has done us a disservice here.”\nActually, the atheists who were capable of understanding\nThe God Delusion\nknow that he did them a disservice there too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-05T13:25:00+00:00"
}