{
  "url": "https://voxday.net/2007/12/19/kabuki-plays-ou/",
  "scraped_at": "2026-01-08T22:04:15.281284",
  "title": "The kabuki plays out",
  "date_display": "December 19, 2007",
  "date_iso": "2007-12-19T16:04:00+00:00",
  "date_from_url": "2007-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nationalenquirer.com/john_edwards_love_child/celebrity/64426\">One down, one to go</a> for the Lizard Queen’s hit squad:</p><blockquote><p>The ENQUIRER has learned exclusively that Rielle Hunter, a woman linked to Edwards in a cheating scandal earlier this year, is more than six months pregnant – and she’s told a close confidante that Edwards is the father of her baby!  The ENQUIRER’s political bombshell comes just weeks after Edwards emphatically denied having an affair with Rielle, who formerly worked on his campaign and told another close pal that she was romantically involved with the married ex-Senator….</p><p>In The ENQUIRER’s Oct. 22 issue, we revealed that Edwards, 54, was involved in a mistress scandal and the shocking allegations – if proven true – could devastate the Democratic hopeful’s campaign. At the time, we withheld Rielle’s name, but reported that an insider told The ENQUIRER that she claimed that she began the affair some 18 months earlier. She talked about her relationship in phone calls and e-mails.  After our story was published, several political bloggers correctly identified “the other woman” as Rielle, a self-described filmmaker whose company was hired by a pro-Edwards group called One American Committee and paid $114,000 to produce videos for Edwards’ campaign.</p></blockquote><p>The key to understanding the way the system works is realizing that most of the approved candidates are inherently broken.  It’s like traffic laws, you’re <i>supposed</i> to be in violation of something at all times so there’s always an excuse to pull you over.  Since all the major candidates have an Achilles heel, they can be removed from the process at any time should they start to believe in their own press or if a lesser candidate accidentally turn out to be more popular with the electorate than the anointed one.</p></div>",
  "content_text": "One down, one to go\nfor the Lizard Queen’s hit squad:\nThe ENQUIRER has learned exclusively that Rielle Hunter, a woman linked to Edwards in a cheating scandal earlier this year, is more than six months pregnant – and she’s told a close confidante that Edwards is the father of her baby!  The ENQUIRER’s political bombshell comes just weeks after Edwards emphatically denied having an affair with Rielle, who formerly worked on his campaign and told another close pal that she was romantically involved with the married ex-Senator….\nIn The ENQUIRER’s Oct. 22 issue, we revealed that Edwards, 54, was involved in a mistress scandal and the shocking allegations – if proven true – could devastate the Democratic hopeful’s campaign. At the time, we withheld Rielle’s name, but reported that an insider told The ENQUIRER that she claimed that she began the affair some 18 months earlier. She talked about her relationship in phone calls and e-mails.  After our story was published, several political bloggers correctly identified “the other woman” as Rielle, a self-described filmmaker whose company was hired by a pro-Edwards group called One American Committee and paid $114,000 to produce videos for Edwards’ campaign.\nThe key to understanding the way the system works is realizing that most of the approved candidates are inherently broken.  It’s like traffic laws, you’re\nsupposed\nto be in violation of something at all times so there’s always an excuse to pull you over.  Since all the major candidates have an Achilles heel, they can be removed from the process at any time should they start to believe in their own press or if a lesser candidate accidentally turn out to be more popular with the electorate than the anointed one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-19T16:04:00+00:00"
}