{
  "url": "https://voxday.net/2007/12/12/leaping-lamnidae/",
  "scraped_at": "2026-01-08T22:03:30.505445",
  "title": "Derb joins the Revolution",
  "date_display": "December 12, 2007",
  "date_iso": "2007-12-12T14:38:00+00:00",
  "date_from_url": "2007-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As NRO leaps the <i>Lamnidae</i>:</p><blockquote><p>I have pretty much decided for Ron Paul myself. I am sympathetic to many of the reservations you have posted, but every piece of serious policy analysis I read confirms to me that our country has gone too far down a wrong path—a path that leads to nothing I recognize as conservatism.</p></blockquote><p>Meanwhile, Joe Carter may be supporting the Huckster, but that doesn’t mean he can’t put a cogent point together about how <a href=\"http://www.evangelicaloutpost.com/archives/004124.html\">the Manhattan Conservatives of NRO</a> are increasingly out of touch with the Republican base:</p><blockquote><p>Has National Review jumped the shark?</p><p>I don’t mean to be glib or facetious in raising the question for I love the magazine dearly. NR was a formative influence on my political philosophy and continues to shape my thinking. It introduced me to conservative ideas, policies, statesmen, and writers. Indeed, three of my favorite conservatives—Ramesh Ponnuru, Ross Douthat, and Byron York—still write for the august publication.</p><p>But over the past few years (at least that is the time that I began noticing) there has been a shift to what I call “Manhattan Conservatism.” Because almost all of the NR staff lives and works in New York City, their concerns and values tend to reflect a NYC/DC-centric urban cosmopolitism. They’ve adopted a watered-down form of big-tent fusionism in which embracing any non-liberal ideas are enough to earn you the label of “conservative” (a Manhattan Conservative can have the same views on abortion and gay marriage as the liberal intelligentsia so long as they embrace supply-side economics or torturing terrorists)….</p><p>Now to be fair, Romney is not an unacceptable candidate if the criteria is simply to endorse a Republican. But to pass over true conservatives for a moderate is a slap in the face to the magazine’s dedicated readers.</p></blockquote><p>And that’s exactly why I let my subscription to NR Digital lapse about eighteen months ago.  NR is more Rockefeller Republican than Reagan Republican these days, <a href=\"http://article.nationalreview.com/?q=YmMxYTUyYzA1YTk2YzE5NGVmNjc0OGFjYWJmNzMzNjI=&amp;p=1\">that they would nominate Captain Underoos</a> and do so with a straight face tells you all you need to know about their continued relevance.  Romney gives off signals of High Weirdness even if one leaves his religious peculiarities out of the equation.  (And before any Mormon readers get in a lather, please note that I’d cheerfully endorse a one-legged gay atheist crack whore if he genuinely supported small government, valued human liberty, and honored the U.S. Constitution.)  Religion is not synonymous with ideology in many cases.</p><p>Joe’s take on the matter may help illustrate why I laugh when people attempt to mock me for choosing to write for WorldNetDaily instead of a more “reputable” publication.  WND has grown from three million monthly readers to eight million since I’ve been writing for it, over the same timeframe, most media publications have seen significant drops in readership.  The fact that Ron Paul and Mike Huckabee have both improved their poll standings since Ilana Mercer and I started writing about Paul and Chuck Norris came out for Huckabee may be a complete coincidence – I imagine the latter’s speech to the Council on Foreign Relations was rather more important – but it would be a big mistake to assume that everyone across the right wing takes NRO more seriously than WND simply because the New York Times and Fox News do.</p><p>UPDATE: David Fredosso joins the Ron Paul Revolution too:</p><blockquote><p>Now (I think) I can vote in what will be my first presidential primary election ever. I will not be voting for Huckabee, but for Ron Paul — but I still like to think I’ve helped the cause of Freedom and Democracy by helping Huck get on the ballot.</p></blockquote><p>HT: <a href=\"http://www.rightnation.us/forums/blog/mr__naron/index.php?showentry=2200\">Catkiller spotted these interesting developments</a> first.  It will be interesting to see where the rest of the NROniks go if Romney drops out after NH… and how many would go for Hillary over Paul.</p></div>",
  "content_text": "As NRO leaps the\nLamnidae\n:\nI have pretty much decided for Ron Paul myself. I am sympathetic to many of the reservations you have posted, but every piece of serious policy analysis I read confirms to me that our country has gone too far down a wrong path—a path that leads to nothing I recognize as conservatism.\nMeanwhile, Joe Carter may be supporting the Huckster, but that doesn’t mean he can’t put a cogent point together about how\nthe Manhattan Conservatives of NRO\nare increasingly out of touch with the Republican base:\nHas National Review jumped the shark?\nI don’t mean to be glib or facetious in raising the question for I love the magazine dearly. NR was a formative influence on my political philosophy and continues to shape my thinking. It introduced me to conservative ideas, policies, statesmen, and writers. Indeed, three of my favorite conservatives—Ramesh Ponnuru, Ross Douthat, and Byron York—still write for the august publication.\nBut over the past few years (at least that is the time that I began noticing) there has been a shift to what I call “Manhattan Conservatism.” Because almost all of the NR staff lives and works in New York City, their concerns and values tend to reflect a NYC/DC-centric urban cosmopolitism. They’ve adopted a watered-down form of big-tent fusionism in which embracing any non-liberal ideas are enough to earn you the label of “conservative” (a Manhattan Conservative can have the same views on abortion and gay marriage as the liberal intelligentsia so long as they embrace supply-side economics or torturing terrorists)….\nNow to be fair, Romney is not an unacceptable candidate if the criteria is simply to endorse a Republican. But to pass over true conservatives for a moderate is a slap in the face to the magazine’s dedicated readers.\nAnd that’s exactly why I let my subscription to NR Digital lapse about eighteen months ago.  NR is more Rockefeller Republican than Reagan Republican these days,\nthat they would nominate Captain Underoos\nand do so with a straight face tells you all you need to know about their continued relevance.  Romney gives off signals of High Weirdness even if one leaves his religious peculiarities out of the equation.  (And before any Mormon readers get in a lather, please note that I’d cheerfully endorse a one-legged gay atheist crack whore if he genuinely supported small government, valued human liberty, and honored the U.S. Constitution.)  Religion is not synonymous with ideology in many cases.\nJoe’s take on the matter may help illustrate why I laugh when people attempt to mock me for choosing to write for WorldNetDaily instead of a more “reputable” publication.  WND has grown from three million monthly readers to eight million since I’ve been writing for it, over the same timeframe, most media publications have seen significant drops in readership.  The fact that Ron Paul and Mike Huckabee have both improved their poll standings since Ilana Mercer and I started writing about Paul and Chuck Norris came out for Huckabee may be a complete coincidence – I imagine the latter’s speech to the Council on Foreign Relations was rather more important – but it would be a big mistake to assume that everyone across the right wing takes NRO more seriously than WND simply because the New York Times and Fox News do.\nUPDATE: David Fredosso joins the Ron Paul Revolution too:\nNow (I think) I can vote in what will be my first presidential primary election ever. I will not be voting for Huckabee, but for Ron Paul — but I still like to think I’ve helped the cause of Freedom and Democracy by helping Huck get on the ballot.\nHT:\nCatkiller spotted these interesting developments\nfirst.  It will be interesting to see where the rest of the NROniks go if Romney drops out after NH… and how many would go for Hillary over Paul.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-12T14:38:00+00:00"
}