{
  "url": "https://voxday.net/2007/12/31/liberal-fascism-review/",
  "scraped_at": "2026-01-08T22:05:43.690536",
  "title": "About theLiberal Fascismreview",
  "date_display": "December 31, 2007",
  "date_iso": "2007-12-31T10:15:00+00:00",
  "date_from_url": "2007-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I wrote in my column today, I was <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59446\">pleasantly surprised by Jonah Goldberg’s new book</a>, which was of particular interest to me because it was a topic that I had once considered addressing myself.  Goldberg utilized a very different approach than I would have, as those who read both LF and TIA will probably recognize, but his might be the more effective approach in dealing with a reading public that is almost completely ignorant of matters historical.</p><p>The bizarre thing about much of the foolish criticism that is being directed Goldberg’s way – the greater part of it by people who haven’t read the book and know literally nothing about Italian Fascism, American progressivism, the Social Gospel or “the politics of meaning” – is the confidence with which these critics proudly stand on an intellectual foundation of absolutely nothing.  My atheist critics look like heterodox theological experts by comparison.</p><p>For example, I read <i>Fascisti: Gli italiani di Mussolini, il regime degli italiani</i> by Giordano Bruno Guerri earlier this year, and while the Italian historian’s focus is, understandably, entirely on Italian Fascism proper, his conclusions are often very similar to Goldberg’s.  Guerri finds great significance in the religious aspect of Fascism, repeatedly referring to its “liturgies”, “myths” and “rites”, and describes how the sacralization of the State was not only a central aspect of Italian Fascism, but also Russian Communism and German National Socialism. Guerri even notes that Fascism was the first deliberate attempt to create a new secular religion – shades of both Jean Meslier and Michel Onfray – since the French Revolution.</p><p>Since I haven’t hesitated to flame the superficial and evanescent books put out by syndicated columnists such as Michelle “what is this ‘research’ of which you speak?” Malkin, David “Nostrawrongus” Frum, and Ben “water is wet” Shapiro, (to say nothing of the lightweight polemics written by the likes of Al Franken and Michael Moore), it only seems fair to put down the flamethrower and give credit on the rare occasion when credit is rightfully due.  I should probably mention that I did not rate or review Dinesh D’Souza’s <i>What’s So Great About Christianity</i> but rather contented myself with an interview with the author because its subject matter has a fair amount in common with my own forthcoming book.</p><p>I am admittedly a harsh reviewer, but if you’d waded through as much sewage as I have in three years of sitting on one SFWA jury or another, I suspect you’d have a limited capacity for enduring literary drivel too.  By the way, I’m interested in knowing what the Cavalcade of Evil aka the Dread Vox Ilk think of these interview/review columns, do you want more of them or are they likely to get tedious more than once every six months or so?  My own experience tends to lead me to think that there’s a need for such things, but then, perhaps the reason there are fewer in-depth book discussions than books out there is because no one really wants to read them.</p></div>",
  "content_text": "As I wrote in my column today, I was\npleasantly surprised by Jonah Goldberg’s new book\n, which was of particular interest to me because it was a topic that I had once considered addressing myself.  Goldberg utilized a very different approach than I would have, as those who read both LF and TIA will probably recognize, but his might be the more effective approach in dealing with a reading public that is almost completely ignorant of matters historical.\nThe bizarre thing about much of the foolish criticism that is being directed Goldberg’s way – the greater part of it by people who haven’t read the book and know literally nothing about Italian Fascism, American progressivism, the Social Gospel or “the politics of meaning” – is the confidence with which these critics proudly stand on an intellectual foundation of absolutely nothing.  My atheist critics look like heterodox theological experts by comparison.\nFor example, I read\nFascisti: Gli italiani di Mussolini, il regime degli italiani\nby Giordano Bruno Guerri earlier this year, and while the Italian historian’s focus is, understandably, entirely on Italian Fascism proper, his conclusions are often very similar to Goldberg’s.  Guerri finds great significance in the religious aspect of Fascism, repeatedly referring to its “liturgies”, “myths” and “rites”, and describes how the sacralization of the State was not only a central aspect of Italian Fascism, but also Russian Communism and German National Socialism. Guerri even notes that Fascism was the first deliberate attempt to create a new secular religion – shades of both Jean Meslier and Michel Onfray – since the French Revolution.\nSince I haven’t hesitated to flame the superficial and evanescent books put out by syndicated columnists such as Michelle “what is this ‘research’ of which you speak?” Malkin, David “Nostrawrongus” Frum, and Ben “water is wet” Shapiro, (to say nothing of the lightweight polemics written by the likes of Al Franken and Michael Moore), it only seems fair to put down the flamethrower and give credit on the rare occasion when credit is rightfully due.  I should probably mention that I did not rate or review Dinesh D’Souza’s\nWhat’s So Great About Christianity\nbut rather contented myself with an interview with the author because its subject matter has a fair amount in common with my own forthcoming book.\nI am admittedly a harsh reviewer, but if you’d waded through as much sewage as I have in three years of sitting on one SFWA jury or another, I suspect you’d have a limited capacity for enduring literary drivel too.  By the way, I’m interested in knowing what the Cavalcade of Evil aka the Dread Vox Ilk think of these interview/review columns, do you want more of them or are they likely to get tedious more than once every six months or so?  My own experience tends to lead me to think that there’s a need for such things, but then, perhaps the reason there are fewer in-depth book discussions than books out there is because no one really wants to read them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-31T10:15:00+00:00"
}