{
  "url": "https://voxday.net/2007/12/29/mailvox-jew-neocon/",
  "scraped_at": "2026-01-08T22:05:29.025149",
  "title": "Mailvox: Jew != neocon",
  "date_display": "December 29, 2007",
  "date_iso": "2007-12-29T15:35:00+00:00",
  "date_from_url": "2007-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kidist raises a point worth underlining:</p><blockquote><p>[D]isproportionate number of Jewish columnists in one newspaper, which I agree happens to be neocon, doesn’t mean that Jews are the sole proprietors of neocon philosophy.</p></blockquote><p>Of course they’re not.  Neocons come in various shapes, sizes, colors and creeds.  But it’s important to keep in mind that it is the neocons, of all persuasions, <a href=\"http://www.voxday.net/archive/2004/010504.html\">who have attempted to argue that Jew = neocon</a> in order to render their revolutionary political philosophy immune from criticism.  This reached absurd proportions back when Joel Mowbray was calling General Anthony Zinni a “ninny” while complaining about the “anti-semitism” of his attack on a number of neocons, <i>precisely none of whom were Jewish</i>.</p><p>Now, there is a lot of anti-semitism around the world, in fact, there is far more anti-semitism in Europe today than there has  ever been in the USA, but no one realizes this since Jews are not overrepresented in the European press the way they are in the US media, both mainstream and conservative.  So, we have the bizarre situation of Jews in the American media constantly complaining about nonexistent anti-semitism in the USA while no one ever says anything about actual anti-semitism in the very place where it has historically been most viciously exhibited.</p><p>I could not care less who the New York Times hires.  If they want to establish a Jews-only policy for its editorial page, that’s their business and it should be – though I suppose under current labor law, it isn’t – their right. I’ve never read the NYT regularly and I’ve also never had any more desire to write for it than for Pravda or the Rénmín Rìbào.  But you can bet that there are an awful lot of non-Jewish writers, especially on the left, who aspire to that kind of high-profile position and are going to harbor an awful lot of resentment about the Kristol hiring.  And unlike me, they’re never going to utter a word in public about it.</p><p>This is one way the seed of anti-semitism is planted.  As Thomas Sowell has chronicled across numerous cultures, preferential treatment for a minority tends to create hatred for that minority on the part of the majority.  This effect occurs regardless of who the minority or the majority happen to be.</p></div>",
  "content_text": "Kidist raises a point worth underlining:\n[D]isproportionate number of Jewish columnists in one newspaper, which I agree happens to be neocon, doesn’t mean that Jews are the sole proprietors of neocon philosophy.\nOf course they’re not.  Neocons come in various shapes, sizes, colors and creeds.  But it’s important to keep in mind that it is the neocons, of all persuasions,\nwho have attempted to argue that Jew = neocon\nin order to render their revolutionary political philosophy immune from criticism.  This reached absurd proportions back when Joel Mowbray was calling General Anthony Zinni a “ninny” while complaining about the “anti-semitism” of his attack on a number of neocons,\nprecisely none of whom were Jewish\n.\nNow, there is a lot of anti-semitism around the world, in fact, there is far more anti-semitism in Europe today than there has  ever been in the USA, but no one realizes this since Jews are not overrepresented in the European press the way they are in the US media, both mainstream and conservative.  So, we have the bizarre situation of Jews in the American media constantly complaining about nonexistent anti-semitism in the USA while no one ever says anything about actual anti-semitism in the very place where it has historically been most viciously exhibited.\nI could not care less who the New York Times hires.  If they want to establish a Jews-only policy for its editorial page, that’s their business and it should be – though I suppose under current labor law, it isn’t – their right. I’ve never read the NYT regularly and I’ve also never had any more desire to write for it than for Pravda or the Rénmín Rìbào.  But you can bet that there are an awful lot of non-Jewish writers, especially on the left, who aspire to that kind of high-profile position and are going to harbor an awful lot of resentment about the Kristol hiring.  And unlike me, they’re never going to utter a word in public about it.\nThis is one way the seed of anti-semitism is planted.  As Thomas Sowell has chronicled across numerous cultures, preferential treatment for a minority tends to create hatred for that minority on the part of the majority.  This effect occurs regardless of who the minority or the majority happen to be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-29T15:35:00+00:00"
}