{
  "url": "https://voxday.net/2007/12/09/narnia-1-compass-0/",
  "scraped_at": "2026-01-08T22:03:08.892991",
  "title": "Narnia 1, Compass 0",
  "date_display": "December 9, 2007",
  "date_iso": "2007-12-09T13:28:00+00:00",
  "date_from_url": "2007-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Actually, Rotten Tomatoes has it Narnia 76, Compass 43.  I can’t say that I’m surprised that <i>The Golden Compass</i> is failing at the box office.  One can’t expect any more from a third-rate Lewis rip-off, its muted anti-Christian theme notwithstanding.  I only wish they had done it as the openly hate-filled propaganda vehicle it was originally conceived to be.</p><p>Nor am I saddened at the disaster that was the feeble attempt to put <i>The Dark is Rising</i> on film.  (RT: 13!) All you had to know that it would bomb was that the director moved the story to America; when will filmmakers learn that “relevance” to the modern movie-goer is completely beside the point?  People go to movies to ESCAPE their daily lives, not to relive them.</p><p>There’s so many great stories out there, it’s such a pity that Hollywood is so determined to ruin them by putting them through its peculiar filter.  The only rule of success in entertainment is this: no one actually knows anything.  But sticking with the story that made the movie possible in the first place instead of having an incompetent writer rewrite it does make for a pretty good guideline.</p><p>That being said, I’m rather looking forward to seeing Prince Caspian.  Judging by the trailer, it looks like the combat will be more reflective of LOTR than The Lion, The Witch and the Wardrobe.</p></div>",
  "content_text": "Actually, Rotten Tomatoes has it Narnia 76, Compass 43.  I can’t say that I’m surprised that\nThe Golden Compass\nis failing at the box office.  One can’t expect any more from a third-rate Lewis rip-off, its muted anti-Christian theme notwithstanding.  I only wish they had done it as the openly hate-filled propaganda vehicle it was originally conceived to be.\nNor am I saddened at the disaster that was the feeble attempt to put\nThe Dark is Rising\non film.  (RT: 13!) All you had to know that it would bomb was that the director moved the story to America; when will filmmakers learn that “relevance” to the modern movie-goer is completely beside the point?  People go to movies to ESCAPE their daily lives, not to relive them.\nThere’s so many great stories out there, it’s such a pity that Hollywood is so determined to ruin them by putting them through its peculiar filter.  The only rule of success in entertainment is this: no one actually knows anything.  But sticking with the story that made the movie possible in the first place instead of having an incompetent writer rewrite it does make for a pretty good guideline.\nThat being said, I’m rather looking forward to seeing Prince Caspian.  Judging by the trailer, it looks like the combat will be more reflective of LOTR than The Lion, The Witch and the Wardrobe.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-09T13:28:00+00:00"
}