{
  "url": "https://voxday.net/2007/12/19/never-her-fau/",
  "scraped_at": "2026-01-08T22:04:11.603764",
  "title": "Never her fault",
  "date_display": "December 19, 2007",
  "date_iso": "2007-12-19T11:43:00+00:00",
  "date_from_url": "2007-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The ability of feminists <a href=\"http://jezebel.com/gossip/limp-dicks/if-your-mans-not-in-the-mood-its-probably-all-your-fault-334927.php\">to bend themselves in pretzels</a> on any position in defense of some women’s behavior is simply incredible:</p><blockquote><p>Sexless marriages have typically been blamed on frigid wives, since it’s assumed that men want sex all the time. But it turns out that men are just as likely to stop giving it up in the sack when in a longt-erm relationship. And guess what?! Those assholes are still blaming women for their limp dicks.</p></blockquote><p>Except, of course, having an affair, or, to paraphrase Trent Reznor, maintaining a rigorous porn addiction tends to indicate that the equipment is not exactly out of order and the general interest is still there.  A lot of women are boring in bed and since many women are forthright about how they view sex as a chore, it should be no surprise that men eventually find this to be a turnoff.  (Key word: eventually.)  This doesn’t justify breaking marriage vows or trying to complete the Internet set, but it’s not hard to understand why ESPN or WoW might prove more compelling than a woman doing a plausible imitation of a blow-up doll or the always popular impression Dead Fish on a Beach.</p><p>Sure, some guys very much like that, but they’re the creepy sort who would also like you to hold your breath, and, if possible, take an ice bath first.  Or at least a cold shower.</p><p>Men aren’t robots.  There’s only so many times you can reasonably expect a man to hear “no” before he loses interest in bothering to ask the question.  And if you think this is a problem now, just wait until the game industry and the adult entertainment industry get together.  I had a hilarious conversation with a friend who is a Logitech executive a few months ago; they’re not going down this route yet, but there’s little question that they eventually will.</p><p>And if you’re too fat to be attractive, as was the reason given in more than a third of the men’s responses, how can it be anyone’s fault but your own?  It’s also funny to read the responses insisting that women are just as interested in sex and just as visually-oriented as men… no doubt that’s why the male romance novel industry is so omnipresent.  This woman’s comment was probably my favorite: <i>“This is a pretty stupid survey. I do have to say, though, that I can’t say I don’t know any married couples where a few years later the man looks about the same, while the woman has gained a bunch of weight, has a frumpy mom haircut, and nags the shit out of her husband.”</i></p></div>",
  "content_text": "The ability of feminists\nto bend themselves in pretzels\non any position in defense of some women’s behavior is simply incredible:\nSexless marriages have typically been blamed on frigid wives, since it’s assumed that men want sex all the time. But it turns out that men are just as likely to stop giving it up in the sack when in a longt-erm relationship. And guess what?! Those assholes are still blaming women for their limp dicks.\nExcept, of course, having an affair, or, to paraphrase Trent Reznor, maintaining a rigorous porn addiction tends to indicate that the equipment is not exactly out of order and the general interest is still there.  A lot of women are boring in bed and since many women are forthright about how they view sex as a chore, it should be no surprise that men eventually find this to be a turnoff.  (Key word: eventually.)  This doesn’t justify breaking marriage vows or trying to complete the Internet set, but it’s not hard to understand why ESPN or WoW might prove more compelling than a woman doing a plausible imitation of a blow-up doll or the always popular impression Dead Fish on a Beach.\nSure, some guys very much like that, but they’re the creepy sort who would also like you to hold your breath, and, if possible, take an ice bath first.  Or at least a cold shower.\nMen aren’t robots.  There’s only so many times you can reasonably expect a man to hear “no” before he loses interest in bothering to ask the question.  And if you think this is a problem now, just wait until the game industry and the adult entertainment industry get together.  I had a hilarious conversation with a friend who is a Logitech executive a few months ago; they’re not going down this route yet, but there’s little question that they eventually will.\nAnd if you’re too fat to be attractive, as was the reason given in more than a third of the men’s responses, how can it be anyone’s fault but your own?  It’s also funny to read the responses insisting that women are just as interested in sex and just as visually-oriented as men… no doubt that’s why the male romance novel industry is so omnipresent.  This woman’s comment was probably my favorite:\n“This is a pretty stupid survey. I do have to say, though, that I can’t say I don’t know any married couples where a few years later the man looks about the same, while the woman has gained a bunch of weight, has a frumpy mom haircut, and nags the shit out of her husband.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-19T11:43:00+00:00"
}