{
  "url": "https://voxday.net/2007/12/30/now-this-is-book-review-2/",
  "scraped_at": "2026-01-08T22:05:34.556664",
  "title": "Now THIS is a book review!",
  "date_display": "December 30, 2007",
  "date_iso": "2007-12-30T01:12:00+00:00",
  "date_from_url": "2007-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PJ O’Rourke, <a href=\"http://www.weeklystandard.com/Content/Public/Articles/000/000/014/507nhvlr.asp\">at his cruel best</a>, reviews Arthur Schlesinger’s <i>Journals</i>:</p><blockquote><p> <i>Journals</i> is so much more than gush. Its pages also crack open a hellgate to give us a peek at the eternally consuming fires of egotistic solipsism to which the soul of a liberal is forever condemned. Not even the undying love that Arthur Schlesinger felt for Kennedy money, power, and prestige could redeem poor Art from the perdition that awaits the <i>bien pensant</i>. His is the sin of pride, such that produces the New Deal, the Fair Deal, the New Frontier, the Great Society. It manifests itself in the deeds of the mighty. Or in the case of Arthur Schlesinger, it manifests itself in mighty bad taste.</p></blockquote><p> Sometimes I love PJ O’Rourke so much that it makes Umberto Eco’s mad passion for Charles Schultz look like a mere passing flirtation.  This is one of those times.</p></div>",
  "content_text": "PJ O’Rourke,\nat his cruel best\n, reviews Arthur Schlesinger’s\nJournals\n:\nJournals\nis so much more than gush. Its pages also crack open a hellgate to give us a peek at the eternally consuming fires of egotistic solipsism to which the soul of a liberal is forever condemned. Not even the undying love that Arthur Schlesinger felt for Kennedy money, power, and prestige could redeem poor Art from the perdition that awaits the\nbien pensant\n. His is the sin of pride, such that produces the New Deal, the Fair Deal, the New Frontier, the Great Society. It manifests itself in the deeds of the mighty. Or in the case of Arthur Schlesinger, it manifests itself in mighty bad taste.\nSometimes I love PJ O’Rourke so much that it makes Umberto Eco’s mad passion for Charles Schultz look like a mere passing flirtation.  This is one of those times.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2007-12-30T01:12:00+00:00"
}