{
  "url": "https://voxday.net/2007/12/22/of-flying-rodents-posteriors/",
  "scraped_at": "2026-01-08T22:04:39.002825",
  "title": "Of flying rodent’s posteriors",
  "date_display": "December 22, 2007",
  "date_iso": "2007-12-22T16:34:00+00:00",
  "date_from_url": "2007-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And my interest therein.  Yukonyon writes:</p><blockquote><p>I always appreciate your criticism of Mitt, because I don’t like the guy, but your mockery of his underwear is borderline inappropriate; there are a lot of secrets that Catholics will never release, albeit they are keeping potential doctrine from being made available to the public, yet no mention is ever made about any politician’s avowed Catholicism. Your comments about john 3:16 is a non-sequiter in attempting to establish that there is no way that Jesus and Satan were both created by God, and therefore couldn’t be brothers in some sort of context. And equivocating this to something Clintonian makes you appear disingenuous, because frankly, I can’t see the comparison. You’re beginning to appear less and less like the cool, dispassionate rationalist, while making you appear more and more like an anti-Mormon hack….  This is just advice; you can take what you want, and throw out the rest, because it is your funeral.</p></blockquote><p>Ah, so it’s <i>Mormon</i> tushies that we’re supposed to be kissing now to further our media careers.  Got it… good think I don’t want one.  But let me get this straight… you seriously think a national politician can get away with wearing holy underoos and NOT get mocked for it?  If Hillary suddenly starts wearing a sacred snakeskin thong in public due to whatever bizarre reptilian religion she secretly practices, is everyone really expected to quietly respect that?  Here’s the reality.  If you do something, you don’t get to be the judge of whether it is weird or not.  I consider myself to be the epicenter of normality; there appear to be in excess of six billion people who disagree.  That’s fine, I deal.  I’m not telling you not to wear your underwear on your head or whatever, I’m just telling you not to be shocked when people laugh at you.  And they will.</p><p>Now, what is this “borderline inappropriate” concept of which you speak?</p><p>The idea that I’m an “anti-Mormon hack” is downright amusing, as I am demonstrably not a hack, (at least in the professional sense), and I don’t care enough about Mormonism one way or another to be anti-Mormon.  One might as reasonably suggest that I’m anti-Scientologist or anti-Nzambi Mpunguist.  Mormonism is totally irrelevant, in my opinion, except that it happily provides a fitting appellation for the ridiculous Mr. Romney.  A snug, tight-fitting appellation, one might even say….</p><p>I suggest that even though he doesn’t support Romney, Yukonyon’s instinctive desire to defend his religion may be blinding him to the way Romney revealed his fundamentally dishonest character in this little incident, in much the same way NRO’s endorsement and Hugh Hewitt’s unrequited man-love has.  Romney was already known to be a horrendous flip-flopper and serial stretcher of the truth; what could easily pass for an innnocent and unintended exaggeration in the mouth of another candidate is simply not credible coming from him.  Does Yukonyon also think my denigration of Romney’s literary taste stems from anti-Mormonism,* or is it possible that <i>Battlefield Earth</i> is the worst science fiction novel ever to see a bestseller’s list?</p><p>Considering that even the English papers see Romney’s attempted grammatical contortions as Clintonian, either there are a lot of political observers who are just as “disingenuous” about Romney as I am, or Yukonyon’s view of the matter is incorrect.  The thing is, there’s no need for anyone to be disingenuous about it anyhow, as in my opinion, Romney has already fatally wounded himself with his own words.  It will be interesting to see if the polls reflect this or not.</p><p>*<i>It may amuse some of you to note that after I wrote my opinion of Romney’s favorite book, one scientologist emailed to complain of my obvious bias against Scientology.</i></p></div>",
  "content_text": "And my interest therein.  Yukonyon writes:\nI always appreciate your criticism of Mitt, because I don’t like the guy, but your mockery of his underwear is borderline inappropriate; there are a lot of secrets that Catholics will never release, albeit they are keeping potential doctrine from being made available to the public, yet no mention is ever made about any politician’s avowed Catholicism. Your comments about john 3:16 is a non-sequiter in attempting to establish that there is no way that Jesus and Satan were both created by God, and therefore couldn’t be brothers in some sort of context. And equivocating this to something Clintonian makes you appear disingenuous, because frankly, I can’t see the comparison. You’re beginning to appear less and less like the cool, dispassionate rationalist, while making you appear more and more like an anti-Mormon hack….  This is just advice; you can take what you want, and throw out the rest, because it is your funeral.\nAh, so it’s\nMormon\ntushies that we’re supposed to be kissing now to further our media careers.  Got it… good think I don’t want one.  But let me get this straight… you seriously think a national politician can get away with wearing holy underoos and NOT get mocked for it?  If Hillary suddenly starts wearing a sacred snakeskin thong in public due to whatever bizarre reptilian religion she secretly practices, is everyone really expected to quietly respect that?  Here’s the reality.  If you do something, you don’t get to be the judge of whether it is weird or not.  I consider myself to be the epicenter of normality; there appear to be in excess of six billion people who disagree.  That’s fine, I deal.  I’m not telling you not to wear your underwear on your head or whatever, I’m just telling you not to be shocked when people laugh at you.  And they will.\nNow, what is this “borderline inappropriate” concept of which you speak?\nThe idea that I’m an “anti-Mormon hack” is downright amusing, as I am demonstrably not a hack, (at least in the professional sense), and I don’t care enough about Mormonism one way or another to be anti-Mormon.  One might as reasonably suggest that I’m anti-Scientologist or anti-Nzambi Mpunguist.  Mormonism is totally irrelevant, in my opinion, except that it happily provides a fitting appellation for the ridiculous Mr. Romney.  A snug, tight-fitting appellation, one might even say….\nI suggest that even though he doesn’t support Romney, Yukonyon’s instinctive desire to defend his religion may be blinding him to the way Romney revealed his fundamentally dishonest character in this little incident, in much the same way NRO’s endorsement and Hugh Hewitt’s unrequited man-love has.  Romney was already known to be a horrendous flip-flopper and serial stretcher of the truth; what could easily pass for an innnocent and unintended exaggeration in the mouth of another candidate is simply not credible coming from him.  Does Yukonyon also think my denigration of Romney’s literary taste stems from anti-Mormonism,* or is it possible that\nBattlefield Earth\nis the worst science fiction novel ever to see a bestseller’s list?\nConsidering that even the English papers see Romney’s attempted grammatical contortions as Clintonian, either there are a lot of political observers who are just as “disingenuous” about Romney as I am, or Yukonyon’s view of the matter is incorrect.  The thing is, there’s no need for anyone to be disingenuous about it anyhow, as in my opinion, Romney has already fatally wounded himself with his own words.  It will be interesting to see if the polls reflect this or not.\n*\nIt may amuse some of you to note that after I wrote my opinion of Romney’s favorite book, one scientologist emailed to complain of my obvious bias against Scientology.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-22T16:34:00+00:00"
}