{
  "url": "https://voxday.net/2007/12/04/on-evidence-dialogue/",
  "scraped_at": "2026-01-08T22:02:40.091016",
  "title": "On Evidence: a dialogue",
  "date_display": "December 4, 2007",
  "date_iso": "2007-12-04T09:42:00+00:00",
  "date_from_url": "2007-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>In which we all learn something, <a href=\"http://scienceblogs.com/pharyngula/2007/12/maybe_this_is_our_problem.php\">even your humble host</a>.  An act in one part</i>:</p><p>Atheist Science Supporter:  God simply doesn’t exist!  There is no evidence for God’s existence!</p><p>Vox Day, intrepid forensic ideologist: Erroneous!  There’s loads of evidence for it.</p><p>ASS: What?  There is not!  Prove it.</p><p>VOX: Okay.  Which type of evidence would you like?  Testimonial evidence, real evidence, documentary evidence, demonstrative evidence or scientific evidence?</p><p>ASS: Say what?</p><p>VOX: Technically, scientific evidence falls under demonstrative evidence.  From a legal perspective, it’s actually less inherently admissible than a guy who testifies that God appeared to him and spoke to him in the form of a burning bush.</p><p>ASS: Well, okay, so there may be evidence, but it’s not very good evidence. It’s not the kind that would stand up in court, because the fact that it’s spectral evidence or hearsay is relevant.</p><p>VOX: Spectral evidence refers only to dreams and visions, not eyewitness testimony, and you apparently don’t know what “hearsay” means.  If I testify that you told me God appeared to you, that is hearsay evidence which is perfectly admissible in court, although it is admittedly less likely to stand up, especially if you deny it.  However, that’s not what we’re talking about with regards to testimonial evidence; every competent individual who believes they have had a personal encounter of one sort or another with God is a legitimate provider of testimonial evidence.</p><p>ASS: Well, what about the other kinds of evidence?</p><p>VOX: The Bible is documentary evidence, just as Arrian’s manuscript written on the basis of non-existent texts is documentary evidence for the existence of Alexander the Great and <i>Commentarii de Bello Civili</i> is documentary evidence for the existence of Julius Caesar.  Rainbows and the Jewish people are real evidence of God’s existence, as, theoretically, is the Cohen gene.  “The Passion of the Christ” is demonstrative evidence, as would be a three-dimensional chart explicating the improbabilities posed by the Anthropic Principle.</p><p>ASS: I don’t find any of that convincing.  Not even taken in the entirety.</p><p>VOX: You don’t have to.  But your subjective opinion of the value of the evidence doesn’t change the fact that it is evidence and it undeniably exists.  You cannot honestly say that evidence for the existence of God does not exist, you can only say that you do not find the evidence for the existence of God to be convincing. You see, the scientific method is not the only generator of evidence.</p><p>ASS: Ah, but here you are confused.  Science isn’t a “generator” of evidence, it’s an evaluator of evidence from a pragmatic standpoint. The scientific method generates DATA, which is then used to reject hypotheses ABOUT a particular observation. If unable to reject based on the data gathered, the hypothesis is tentatively supported until more or different data are gathered that end up rejecting the hypothesis or not.</p><p>VOX: I stand corrected.  Is there then no such thing as scientific evidence?</p><p>ASS: No, there is, but it’s not what was generated by the application of the scientific method. Data was what was generated. The labelling of that data as “evidence” afterwards is subjective.</p><p>VOX: You’re saying that scientific evidence is subjective, then?</p><p>ASS: Er… yeah.  But a lot of smart people are in agreement on it.  For example the “evidence” in support of the Theory of Evolution by Natural Selection is gathered from literally tens of thousands of lab and field studies that generated similar data in response to similar hypotheses, all based on variations of Darwin’s original hypothesis of natural selection. Those studies didn’t generate evidence, they generated data, which is then interpreted AS evidence.</p><p>VOX: A lot of people interpret that data?</p><p>ASS: Yep.</p><p>VOX: More than the 2.1 billion Christians on the planet?</p><p>ASS: Ah, no.</p><p>VOX: More than the 1.5 billion Muslims?</p><p>ASS: Well, no.  But see, the method, it’s really effective.  It produces reliable data.  It works!</p><p>VOX: I have no doubt it produces data very effectively.  The relevant question regards the validity of the subjective interpretations required to transform the data into evidence.  But regardless, when you talk about “scientific ‘evidence'”, you actually mean “the subjective interpretation of data”, right?</p><p>ASS: “The subjective interpretation of data produced by the scientific method”, actually.</p><p>VOX: All right.  So when one says “there is no scientific evidence for the existence of God”, one is actually saying “there is no subjective interpretation of data produced by the scientific method  for the existence of God.”  And this is quite clearly false, as there are tens of thousands of examples to the contrary floating around the Internet.  Therefore, by your own definition, there is not only evidence for the existence of God, there is also <i>scientific</i> evidence for the existence of God.</p><p>ASS: But.. but those subjective interpretations are by total morons, religious nuts, not professional scientists!</p><p>VOX: And at last we reach the inevitable Atheist Science Supporter’s Appeal to Authority!  I do so enjoy the circular irrationality of the self-professed rational materialist.  But I have one more question.  When you say “total morons”, is that a set including the subset of individuals who declare that evidence doesn’t exist, when it quite clearly does, and that subjective interpretations of data don’t exist, when they quite clearly do?</p><p>ASS: [Insert ad hominem here.]  [Insert logically inexplicable and out-of-context reference to past blog post or column here.]</p><p>VOX: Excellent!  If that doesn’t make your case, what could?  Now would you like to try explaining how religion is responsible for all the war and bloodshed in human history?  Or would you rather have a go at making the case for the likelihood of a Japanese invasion of the West Coast in 1942?</p></div>",
  "content_text": "In which we all learn something,\neven your humble host\n.  An act in one part\n:\nAtheist Science Supporter:  God simply doesn’t exist!  There is no evidence for God’s existence!\nVox Day, intrepid forensic ideologist: Erroneous!  There’s loads of evidence for it.\nASS: What?  There is not!  Prove it.\nVOX: Okay.  Which type of evidence would you like?  Testimonial evidence, real evidence, documentary evidence, demonstrative evidence or scientific evidence?\nASS: Say what?\nVOX: Technically, scientific evidence falls under demonstrative evidence.  From a legal perspective, it’s actually less inherently admissible than a guy who testifies that God appeared to him and spoke to him in the form of a burning bush.\nASS: Well, okay, so there may be evidence, but it’s not very good evidence. It’s not the kind that would stand up in court, because the fact that it’s spectral evidence or hearsay is relevant.\nVOX: Spectral evidence refers only to dreams and visions, not eyewitness testimony, and you apparently don’t know what “hearsay” means.  If I testify that you told me God appeared to you, that is hearsay evidence which is perfectly admissible in court, although it is admittedly less likely to stand up, especially if you deny it.  However, that’s not what we’re talking about with regards to testimonial evidence; every competent individual who believes they have had a personal encounter of one sort or another with God is a legitimate provider of testimonial evidence.\nASS: Well, what about the other kinds of evidence?\nVOX: The Bible is documentary evidence, just as Arrian’s manuscript written on the basis of non-existent texts is documentary evidence for the existence of Alexander the Great and\nCommentarii de Bello Civili\nis documentary evidence for the existence of Julius Caesar.  Rainbows and the Jewish people are real evidence of God’s existence, as, theoretically, is the Cohen gene.  “The Passion of the Christ” is demonstrative evidence, as would be a three-dimensional chart explicating the improbabilities posed by the Anthropic Principle.\nASS: I don’t find any of that convincing.  Not even taken in the entirety.\nVOX: You don’t have to.  But your subjective opinion of the value of the evidence doesn’t change the fact that it is evidence and it undeniably exists.  You cannot honestly say that evidence for the existence of God does not exist, you can only say that you do not find the evidence for the existence of God to be convincing. You see, the scientific method is not the only generator of evidence.\nASS: Ah, but here you are confused.  Science isn’t a “generator” of evidence, it’s an evaluator of evidence from a pragmatic standpoint. The scientific method generates DATA, which is then used to reject hypotheses ABOUT a particular observation. If unable to reject based on the data gathered, the hypothesis is tentatively supported until more or different data are gathered that end up rejecting the hypothesis or not.\nVOX: I stand corrected.  Is there then no such thing as scientific evidence?\nASS: No, there is, but it’s not what was generated by the application of the scientific method. Data was what was generated. The labelling of that data as “evidence” afterwards is subjective.\nVOX: You’re saying that scientific evidence is subjective, then?\nASS: Er… yeah.  But a lot of smart people are in agreement on it.  For example the “evidence” in support of the Theory of Evolution by Natural Selection is gathered from literally tens of thousands of lab and field studies that generated similar data in response to similar hypotheses, all based on variations of Darwin’s original hypothesis of natural selection. Those studies didn’t generate evidence, they generated data, which is then interpreted AS evidence.\nVOX: A lot of people interpret that data?\nASS: Yep.\nVOX: More than the 2.1 billion Christians on the planet?\nASS: Ah, no.\nVOX: More than the 1.5 billion Muslims?\nASS: Well, no.  But see, the method, it’s really effective.  It produces reliable data.  It works!\nVOX: I have no doubt it produces data very effectively.  The relevant question regards the validity of the subjective interpretations required to transform the data into evidence.  But regardless, when you talk about “scientific ‘evidence'”, you actually mean “the subjective interpretation of data”, right?\nASS: “The subjective interpretation of data produced by the scientific method”, actually.\nVOX: All right.  So when one says “there is no scientific evidence for the existence of God”, one is actually saying “there is no subjective interpretation of data produced by the scientific method  for the existence of God.”  And this is quite clearly false, as there are tens of thousands of examples to the contrary floating around the Internet.  Therefore, by your own definition, there is not only evidence for the existence of God, there is also\nscientific\nevidence for the existence of God.\nASS: But.. but those subjective interpretations are by total morons, religious nuts, not professional scientists!\nVOX: And at last we reach the inevitable Atheist Science Supporter’s Appeal to Authority!  I do so enjoy the circular irrationality of the self-professed rational materialist.  But I have one more question.  When you say “total morons”, is that a set including the subset of individuals who declare that evidence doesn’t exist, when it quite clearly does, and that subjective interpretations of data don’t exist, when they quite clearly do?\nASS: [Insert ad hominem here.]  [Insert logically inexplicable and out-of-context reference to past blog post or column here.]\nVOX: Excellent!  If that doesn’t make your case, what could?  Now would you like to try explaining how religion is responsible for all the war and bloodshed in human history?  Or would you rather have a go at making the case for the likelihood of a Japanese invasion of the West Coast in 1942?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-04T09:42:00+00:00"
}