{
  "url": "https://voxday.net/2007/12/29/rare-planetary-alignmen/",
  "scraped_at": "2026-01-08T22:05:30.893312",
  "title": "A rare planetary alignment",
  "date_display": "December 29, 2007",
  "date_iso": "2007-12-29T16:11:00+00:00",
  "date_from_url": "2007-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There must be something strange going on in the rotation of the celestial spheres, because I completely agree <a href=\"ttp://scienceblogs.com/pharyngula/2007/12/torture_whats_it_good_for.php#comments\">with PZ Myers on this subject</a>:</p><blockquote><p>Here is all that torture is good for: inspiring fear in a population. If you want it widely known that your ruling regime is utterly ruthless and doesn’t care about individuals, all you have to do is scoop up random people suspected of anti-government activities, hold them for a few weeks, and return them as shattered wrecks with mangled limbs, while treating the monsters who would do such a thing as respected members of the ruling clique, who are immune from legal prosecution. The message gets out fast that one does not cross the government.</p></blockquote><p>It’s worth reminding everyone of Winston Churchill’s statement about the way in which World War I reduced the Allies to near-total barbarism.</p><p><i>All the horrors of all the ages were brought together, and not only armies but whole populations were thrust into the midst of them. The mighty educated States involved conceived — not without reason — that their very existence was at stake. Neither peoples nor rulers drew the line at any deed which they thought could help them to win. Germany, having let hell loose, kept well in the van of terror; but she was followed step by step by the desperate and ultimately avenging nations she had assailed. When it was all over, Torture and Cannibalism were the only two expedients that the civilized, scientific, Christian States had been able to deny themselves: and they were of doubtful utility.</i></p><p>As I pointed out more than a year ago, <a href=\"http://www.voxday.net/archive/2006/091806.html\">the bestial Bush administration</a> has now openly embraced torture, and judging by the barbaric enthusiasm many of its more wild-eyed supporters have shown for this position, if one could make the case for cannibalism helping win the War on Terror, they’d be the first to reach for the barbecue sauce.</p></div>",
  "content_text": "There must be something strange going on in the rotation of the celestial spheres, because I completely agree\nwith PZ Myers on this subject\n:\nHere is all that torture is good for: inspiring fear in a population. If you want it widely known that your ruling regime is utterly ruthless and doesn’t care about individuals, all you have to do is scoop up random people suspected of anti-government activities, hold them for a few weeks, and return them as shattered wrecks with mangled limbs, while treating the monsters who would do such a thing as respected members of the ruling clique, who are immune from legal prosecution. The message gets out fast that one does not cross the government.\nIt’s worth reminding everyone of Winston Churchill’s statement about the way in which World War I reduced the Allies to near-total barbarism.\nAll the horrors of all the ages were brought together, and not only armies but whole populations were thrust into the midst of them. The mighty educated States involved conceived — not without reason — that their very existence was at stake. Neither peoples nor rulers drew the line at any deed which they thought could help them to win. Germany, having let hell loose, kept well in the van of terror; but she was followed step by step by the desperate and ultimately avenging nations she had assailed. When it was all over, Torture and Cannibalism were the only two expedients that the civilized, scientific, Christian States had been able to deny themselves: and they were of doubtful utility.\nAs I pointed out more than a year ago,\nthe bestial Bush administration\nhas now openly embraced torture, and judging by the barbaric enthusiasm many of its more wild-eyed supporters have shown for this position, if one could make the case for cannibalism helping win the War on Terror, they’d be the first to reach for the barbecue sauce.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-29T16:11:00+00:00"
}