{
  "url": "https://voxday.net/2007/12/30/reason-682/",
  "scraped_at": "2026-01-08T22:05:40.060624",
  "title": "Reason 3682",
  "date_display": "December 30, 2007",
  "date_iso": "2007-12-30T23:55:00+00:00",
  "date_from_url": "2007-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Courtesy of <a href=\"http://althouse.blogspot.com/2007/12/what-ones-sin-is-means-its-missing-mark.html\">an Althouse commenter</a>:</p><blockquote><p>Oh you missed the good part when he [Huckabee] spoke so condescendingly about women and abortions and “doing it because of inconvenience” or the like..as if women who choose abortion just go out for a milk shake and some fries afterwards and talk about boys to the girls.</p><p>It was nauseating. My wife, daughter and daughter-in-law and two of their local friends were in the room. He lost 5 votes instantly.</p></blockquote><p>You know, I really don’t care if your average member of the SS-Totenkopfverbände agonized over his specific role in the <i>Endlosung</i> or not.  It is the evil act that condemns one, not whatever difficulty one happens to experience in deciding to commit it or not.  This guy clearly doesn’t realize the irony of the situation he described, because the only reason the five women reacted so negatively to Huckabee – whom, I should add, I do NOT support – is because they wish to be able to murder their offspring for exactly the reason he denigrated.</p><p>It is impossible to discuss any political issue with the average woman for more than five minutes without concluding that women’s suffrage was one of the most significant avoidable disasters of the 20th century.</p></div>",
  "content_text": "Courtesy of\nan Althouse commenter\n:\nOh you missed the good part when he [Huckabee] spoke so condescendingly about women and abortions and “doing it because of inconvenience” or the like..as if women who choose abortion just go out for a milk shake and some fries afterwards and talk about boys to the girls.\nIt was nauseating. My wife, daughter and daughter-in-law and two of their local friends were in the room. He lost 5 votes instantly.\nYou know, I really don’t care if your average member of the SS-Totenkopfverbände agonized over his specific role in the\nEndlosung\nor not.  It is the evil act that condemns one, not whatever difficulty one happens to experience in deciding to commit it or not.  This guy clearly doesn’t realize the irony of the situation he described, because the only reason the five women reacted so negatively to Huckabee – whom, I should add, I do NOT support – is because they wish to be able to murder their offspring for exactly the reason he denigrated.\nIt is impossible to discuss any political issue with the average woman for more than five minutes without concluding that women’s suffrage was one of the most significant avoidable disasters of the 20th century.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-30T23:55:00+00:00"
}