{
  "url": "https://voxday.net/2007/12/30/stick-to-science_30/",
  "scraped_at": "2026-01-08T22:05:38.228536",
  "title": "Stick to science",
  "date_display": "December 30, 2007",
  "date_iso": "2007-12-30T12:40:00+00:00",
  "date_from_url": "2007-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sometimes PZ <a href=\"http://scienceblogs.com/pharyngula/2007/12/why_is_ron_paul_so_popular.php#comments\">doesn’t even try to make sense</a>:</p><blockquote><p>Ron Paul isn’t just a small-government obsessive: he’s a no-government radical. And at the same time he wants every positive function of government to vanish, he wants what amounts to a police state in place to keep the rest of the world out, all out of fear of those strangers with different customs and ideas.</p></blockquote><p>How, pray tell, would one go about running a police state with no government?  PZ needs to travel more.  Living as he does in rural Minnesota, he has absolutely no idea how migration – not immigration – is completely destroying civilized cultures everywhere from Scandinavia to San Antonio.   Like many reactive atheists, he harbors too much hatred for Christianity to think through the massive differences between one theistic culture and another.  If Christianity fades away, you don’t get Happy Happy Scientopia, but rather the slavery, child sacrifice and female chattel of unleashed pagan culture.  If you’re lucky, you might get rule by enlightened jihad.</p><p>Interestingly enough, one Pharyngulan harbors a more sophisticated understanding of the relationship between Christianity and libertarianism than many libertarians and non-libertarian Christians. <i>Libertarianism is philosophically incompatible with atheism, at least the right wing libertarianism tradition Paul comes from. The whole tradition is based around the Lockean arguments about liberty and the state of nature and property, and every single one of these arguments is based on scripture, every one. The liberties of the libertarian have a purely religious basis as does the argument for property.</i></p><p>This is why I’m so amused by ignorant folk like Feckles, who actually believe there is a fundamental dichotomy between evangelical Christianity and libertarianism.  In fact, the primary appeal of libertarianism is that it easily encompasses those of widely diverse creeds, including atheism, so long as they reject the idea of using government force to impose their own creed on others.</p></div>",
  "content_text": "Sometimes PZ\ndoesn’t even try to make sense\n:\nRon Paul isn’t just a small-government obsessive: he’s a no-government radical. And at the same time he wants every positive function of government to vanish, he wants what amounts to a police state in place to keep the rest of the world out, all out of fear of those strangers with different customs and ideas.\nHow, pray tell, would one go about running a police state with no government?  PZ needs to travel more.  Living as he does in rural Minnesota, he has absolutely no idea how migration – not immigration – is completely destroying civilized cultures everywhere from Scandinavia to San Antonio.   Like many reactive atheists, he harbors too much hatred for Christianity to think through the massive differences between one theistic culture and another.  If Christianity fades away, you don’t get Happy Happy Scientopia, but rather the slavery, child sacrifice and female chattel of unleashed pagan culture.  If you’re lucky, you might get rule by enlightened jihad.\nInterestingly enough, one Pharyngulan harbors a more sophisticated understanding of the relationship between Christianity and libertarianism than many libertarians and non-libertarian Christians.\nLibertarianism is philosophically incompatible with atheism, at least the right wing libertarianism tradition Paul comes from. The whole tradition is based around the Lockean arguments about liberty and the state of nature and property, and every single one of these arguments is based on scripture, every one. The liberties of the libertarian have a purely religious basis as does the argument for property.\nThis is why I’m so amused by ignorant folk like Feckles, who actually believe there is a fundamental dichotomy between evangelical Christianity and libertarianism.  In fact, the primary appeal of libertarianism is that it easily encompasses those of widely diverse creeds, including atheism, so long as they reject the idea of using government force to impose their own creed on others.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-30T12:40:00+00:00"
}