{
  "url": "https://voxday.net/2007/12/18/stick-to-science/",
  "scraped_at": "2026-01-08T22:04:06.445311",
  "title": "Stick to science",
  "date_display": "December 18, 2007",
  "date_iso": "2007-12-18T16:24:00+00:00",
  "date_from_url": "2007-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ Myers offers another demonstration of why people <a href=\"http://scienceblogs.com/pharyngula/2007/12/children_of_the_enlightenment.php\">should stick to their areas of expertise</a>:</p><blockquote><p>Religious values are intrinsically autocratic and irrational, relying on ignorance for their propagation, and are therefore anti-democratic.</p></blockquote><p>Like a medieval philosopher, PZ has no interest in the available empirical evidence, preferring instead to rely on his own contorted logic.  The uberdemocratic Swiss <a href=\"http://www.swissinfo.org/eng/front/Religion_remains_important_for_Swiss.html?siteSect=104&amp;sid=8543452&amp;cKey=1197964494000&amp;ty=nd\">are highly religious</a>, meanwhile the Enlightenment secularists of the European Union are not only running roughshod over the democratic will of the British, Dutch and French peoples, but have set up an explicitly anti-democratic and unaccountable ruling oligarchy.</p></div>",
  "content_text": "PZ Myers offers another demonstration of why people\nshould stick to their areas of expertise\n:\nReligious values are intrinsically autocratic and irrational, relying on ignorance for their propagation, and are therefore anti-democratic.\nLike a medieval philosopher, PZ has no interest in the available empirical evidence, preferring instead to rely on his own contorted logic.  The uberdemocratic Swiss\nare highly religious\n, meanwhile the Enlightenment secularists of the European Union are not only running roughshod over the democratic will of the British, Dutch and French peoples, but have set up an explicitly anti-democratic and unaccountable ruling oligarchy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-18T16:24:00+00:00"
}