{
  "url": "https://voxday.net/2007/12/18/this-is-vox-day/",
  "scraped_at": "2026-01-08T22:04:04.969959",
  "title": "This is Vox Day",
  "date_display": "December 18, 2007",
  "date_iso": "2007-12-18T11:14:00+00:00",
  "date_from_url": "2007-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday, David Frum asked “Who is Vox Day?”  The answer is: “The guy who is going to metaphorically kick your impolitic and economically ignorant ass, my dear sir.”  It’s nothing personal, of course, that’s just how we roll.</p><p>Frum has no economics training and it shows, as his charge that Ron Paul is “too lazy and arrogant” to understand the economic questions and “does not have the faintest idea of what [he is] talking about” is based on outdated stats-based Keynesian macroeconomic theory that has taken a backseat to the praxeological Austrian theory that Paul astutely espouses.  One notes that the more economically aware individuals at National Review, gentlemen such as Donald Luskin or Larry Kudlow, would never describe Paul’s grasp of economics in such insulting terms, as <a href=\"http://video.aol.com/video-detail/cnbc-kudlow-and-company-ron-paul-support-from-don-luskin/3617626708\">Luskin’s endorsement of Ron Paul</a> or <a href=\"http://electronpaul2008.wordpress.com/2007/11/10/larry-kudlow-interviews-ron-paul/\">Larry Kudlow’s  interview with Paul</a> should suffice to prove.</p><p>In a subsequent post <a href=\"http://frum.nationalreview.com/post/?q=NWQyYjc1ZjNjZTc5ZTcxODM1NDQ5ZDhhODZjZTU5YmQ=\">defending his attack on Paul’s economic knowledge</a>, Frum attempts to justify himself by arguing that a) one means of rebalancing the USA’s external accounts without recession involves devaluing the dollar, b) this devaluing will be both “equitable” and “surprisingly painless”, c) the nation’s monetary stock should be determined by central bankers, not by miners, and d) stating that “to treat the gold standard as a live option is to utterly misunderstand modern finance. It can never be restored.”</p><p>(a) is reasonable enough, although Frum cites no evidence to support his previous claim that Paul is unaware of this, much less too lazy or arrogant to understand it.  And it’s easy to demonstrate that Frum’s accusation is completely wrong, as <a href=\"http://www.house.gov/paul/congrec/congrec2006/cr021506.htm\">this 2006 speech by Ron Paul</a> on the end of dollar hegemony shows:</p><p><b>“In the short run, the issuer of a fiat reserve currency can accrue great economic benefits.  In the long run, it poses a threat to the country issuing the world currency. In this case that’s the United States.  As long as foreign countries take our dollars in return for real goods, we come out ahead.  This is a benefit many in Congress fail to recognize, as they bash China for maintaining a positive trade balance with us.  But this leads to a loss of manufacturing jobs to overseas markets, as we become more dependent on others and less self-sufficient.  Foreign countries accumulate our dollars due to their high savings rates, and graciously loan them back to us at low interest rates to finance our excessive consumption.  It sounds like a great deal for everyone, except the time will come when our dollars– due to their depreciation– will be received less enthusiastically or even be rejected by foreign countries.  That could create a whole new ballgame and force us to pay a price for living beyond our means and our production.  The shift in sentiment regarding the dollar has already started, but the worst is yet to come.”</b></p><p>Coincidentally, I had dinner last night with a friend who is an important European technology financier.  One of the topics he was most interested in discussing was what China’s response was likely to be once the decline in value of their dollar holdings became intolerable.  This is an area of much concern in financial circles, especially with one of the top five English mortgage banks on the verge of failure and the largest Swiss bank losing CHF 23 billion in the last two quarters alone.  Frum isn’t concerned about any of this because he thinks the central bankers can sort it out – and simultaneously avoid recession – whereas both Ron Paul and those professional money experts who actually understand the situation are deeply worried.</p><p>(Which reminds me, I have another friend who is the CEO of a massive multinational corporation.  A few years ago, after getting back from a trip in which he visited with the British central bankers, he told me that he was genuinely terrified at the influence possessed by men he described as “unbelievable idiots”.  Not more than a month or two later, Gordon Brown, the current British prime minister, sold off 300 tonnes of gold at $275 an ounce.  It’s now around $800.)</p><p>Frum’s claim in (b) that monetary devaluation is equitable is downright amusing.  He writes: <i>“All holders of dollar assets lose some of their wealth – but the burden falls most heavily on those with the most wealth to lose, who also happen to be the people who enjoyed the biggest gains during the previous increase in the value of the dollar. The burden falls least heavily on those with nothing to sell but their labor.”</i></p><p>That would certainly be true, so long as those who have the most wealth are unable to hire anyone capable of advising them to move into Euros, pounds, the yen, or gold.  As usual, the wealthy profit from both long and short sides of the equation while those whose wealth is tied up in the stock market or wish to purchase any imported goods suffer.   It’s not as if those who have nothing to sell but their labor ever buy Japanese cars, Chinese clothes, Taiwanese computers or gasoline for the daily commute, right?  Keynes might well have been describing Frum when he wrote in his <i>Tract on Monetary Reform</i> <b>“It is common to speak as though, when a Government pays its way by inflation, the people of the country avoid taxation. We have seen that this is not so. What is raised by printing notes is just as much taken from the public as is a beer-duty or an income-tax. What a Government spends the public pay for. There is no such thing as an uncovered deficit.”</b></p><p>Now for (c).  When Frum advocates rebalancing through devaluation, he’s simply calling for variant on the same trick of escaping debt through inflation that has endangered the U.S. credit markets, the U.S. housing market and all of the individuals who are invested in them.  It will be neither equitable nor painless when the credit crunch is in full E-F-F-E-C-T otherwise known as effect.  And when it comes to the nation’s money stock, miners are to be preferred to bankers as they are VASTLY more trustworthy.</p><p>It is astounding that Frum seriously advocates trusting the central bankers to control the growth of the money supply, or, in less flattering terms, inflation.  (Yes, that would be the very same clever fellows who sold off their gold at record low prices.)  But according to the Inflation Calculator, the value of one U.S. dollar increased 59 percent from 1819 to 1913 on the gold standard, whereas it lost 95 percent of its value from 1913 to 2006.  And during that deflationary 19th century period, real U.S. Gross Domestic Product grew more than twice as fast as it did during the inflationary 20th, 43x to 21x, even using the Fed’s official inflation statistics which every economically literate individual knows are significantly understated.  After all, it’s not as if anyone ever buys any of those volatile food and energy products that are conveniently omitted from the “core rate”.  The modern era has a slight edge in real GDP growth per capita, but it’s small enough that it would probably be wiped out by a more realistic measure of inflation.</p><p>Finally, (d) is demonstrably false.  A return to the gold standard is far from inconceivable or unworkable.  Not only was the Swiss economy fully on the gold standard until 1999, but the franc is still 50 percent backed by gold.  And Frum’s own National Review colleage, Donald Luskin, explained that for more than 10 years under Greenspan, <a href=\"http://www.capmag.com/article.asp?ID=2929\">the U.S. economy was on a virtual gold standard</a>: <b>“For almost ten years the funds rate tracked the gold price with astonishing precision. Who can really know what was going on in Greenspan’s mind — bu<br> t by all appearances, he was conducting monetary policy on a “virtual gold standard” or “price rule.” The chart suggests that he was withdrawing liquidity by raising the funds rate when a rising gold price signaled inflationary pressures, and adding liquidity by lowering the funds rate when a falling gold price signaled deflationary pressures.</br></b></p><p>Greenspan himself explained that a return to the gold standard was, although not without complications, entirely workable, writing: <b>“Even some of those who conclude a return to gold is infeasible remain deeply disturbed by the current alternatives. For example, William Fellner of the American Enterprise Institute in a forthcoming publication remarks “…I find it difficult not to be greatly impressed by the very large damage done to the economies of the industrialized world… by the monetary management that has followed the era of (gold) convertibility… It has placed the Western economies in acute danger….”  Yet even those of us who are attracted to the prospect of gold convertibility are confronted with a seemingly impossible obstacle: the latest claims to gold represented by the huge world overhang of fiat currency, many dollars.  The immediate problem of restoring a GOLD STANDARD is fixing a gold price that is consistent with market forces….  Those who advocate a return to a GOLD STANDARD should be aware that returning our monetary system to gold convertibility is no mere technical, financial restructuring. It is a basic change in our economic processes. However, considering where the policies of the last 50 years have eventually led us, perhaps there are lessons to be learned from our more distant GOLD STANDARD past.</b></p><p>In light of Luskin’s notion that Greenspan was running a virtual gold standard, it appears that he was attempting to do just what he was describing in the essay quoted above, <a href=\"http://www.gold-eagle.com/greenspan011098.html\">Can the U.S. Return to a Gold Standard?</a> Unfortunately, he ultimately gave into the temptation of Frum-style thinking, and in attempting to avoid recession, created the probability of depression.</p><p>We shall have to wait to see precisely how future events unfold, but this should all suffice to demonstrate that Ron Paul’s economic understanding is far ahead of David Frum’s, so far ahead, in fact, that Paul can even explain the real reason why Frum, a neocon war enthusiast, hates the gold standard.</p><p><b>“If every American taxpayer had to submit an extra five or ten thousand dollars to the IRS this April to pay for the war, I’m quite certain it would end very quickly. The problem is that government finances war by borrowing and printing money, rather than presenting a bill directly in the form of higher taxes. When the costs are obscured, the question of whether any war is worth it becomes distorted.  Congress and the Federal Reserve Bank have a cozy, unspoken arrangement that makes war easier to finance. Congress has an insatiable appetite for new spending, but raising taxes is politically unpopular. The Federal Reserve, however, is happy to accommodate deficit spending by creating new money through the Treasury Department. In exchange, Congress leaves the Fed alone to operate free of pesky oversight and free of political scrutiny. Monetary policy is utterly ignored in Washington, even though the Federal Reserve system is a creation of Congress.</b></p><p>Economist Lawrence Parks has explained how the creation of the Federal Reserve Bank in 1913 made possible our involvement in World War I. Without the ability to create new money, the federal government never could have afforded the enormous mobilization of men and material. Prior to that, American wars were financed through taxes and borrowing, both of which have limits. But government printing presses, at least in theory, have no limits. That’s why the money supply has nearly tripled just since 1990.”</p><p>And now we don’t even know how fast it is growing, since the Fed no longer reports M3 to the public for fear that it will panic.  But the leap in gold prices to nominal all-time highs and emergency rate-cutting suggests that the value of the currency is falling faster than ever.  What, Frum asks, will keep future politicians from simply abandoning a future gold standard should it ever be adopted?  The answer is simple: the pain of the coming global recession and probable depression caused by the Federal Reserve’s inflationary monetary policy will be such that anyone who advocates going off it will be liable to be torn to pieces by an angry mob of survivors.</p><p>Mr. Frum is a very good wordsmith who should probably stick to doing what he does best, banging the war drum, nominating the various Hitlers of the month and talking up Republican sacrificial lambs like Giuliani.  And speaking of lambs, seeing Frum attack Ron Paul on economic grounds is rather like watching a newborn lamb standing on four wobbly legs, trying to headbutt a lion.</p><p>UPDATE: Mr. Frum was kind enough to email me and inform me that in his opinion, there’s nothing here that he didn’t anticipate and answer in his prior post, except for the ad hominem attacks.  Which, if nothing else, proves that he truly hadn’t heard of me before.  He reminds me of Sam Harris and Me-So Michelle, neither of whom understand the difference between anticipating and answering a response and anticipating and <i>successfully</i> answering a response.  There won’t be any further response from him, he’s a candyass <a href=\"http://www.nationalpost.com/opinion/story.html?id=169952\">who can only dish it out</a>; he can’t take it.</p><p>By the way, he thinks you all are “dubious”.  I’m not sure, but that may well be the nicest thing anyone has ever said about the Dread Ilk!</p></div>",
  "content_text": "Yesterday, David Frum asked “Who is Vox Day?”  The answer is: “The guy who is going to metaphorically kick your impolitic and economically ignorant ass, my dear sir.”  It’s nothing personal, of course, that’s just how we roll.\nFrum has no economics training and it shows, as his charge that Ron Paul is “too lazy and arrogant” to understand the economic questions and “does not have the faintest idea of what [he is] talking about” is based on outdated stats-based Keynesian macroeconomic theory that has taken a backseat to the praxeological Austrian theory that Paul astutely espouses.  One notes that the more economically aware individuals at National Review, gentlemen such as Donald Luskin or Larry Kudlow, would never describe Paul’s grasp of economics in such insulting terms, as\nLuskin’s endorsement of Ron Paul\nor\nLarry Kudlow’s  interview with Paul\nshould suffice to prove.\nIn a subsequent post\ndefending his attack on Paul’s economic knowledge\n, Frum attempts to justify himself by arguing that a) one means of rebalancing the USA’s external accounts without recession involves devaluing the dollar, b) this devaluing will be both “equitable” and “surprisingly painless”, c) the nation’s monetary stock should be determined by central bankers, not by miners, and d) stating that “to treat the gold standard as a live option is to utterly misunderstand modern finance. It can never be restored.”\n(a) is reasonable enough, although Frum cites no evidence to support his previous claim that Paul is unaware of this, much less too lazy or arrogant to understand it.  And it’s easy to demonstrate that Frum’s accusation is completely wrong, as\nthis 2006 speech by Ron Paul\non the end of dollar hegemony shows:\n“In the short run, the issuer of a fiat reserve currency can accrue great economic benefits.  In the long run, it poses a threat to the country issuing the world currency. In this case that’s the United States.  As long as foreign countries take our dollars in return for real goods, we come out ahead.  This is a benefit many in Congress fail to recognize, as they bash China for maintaining a positive trade balance with us.  But this leads to a loss of manufacturing jobs to overseas markets, as we become more dependent on others and less self-sufficient.  Foreign countries accumulate our dollars due to their high savings rates, and graciously loan them back to us at low interest rates to finance our excessive consumption.  It sounds like a great deal for everyone, except the time will come when our dollars– due to their depreciation– will be received less enthusiastically or even be rejected by foreign countries.  That could create a whole new ballgame and force us to pay a price for living beyond our means and our production.  The shift in sentiment regarding the dollar has already started, but the worst is yet to come.”\nCoincidentally, I had dinner last night with a friend who is an important European technology financier.  One of the topics he was most interested in discussing was what China’s response was likely to be once the decline in value of their dollar holdings became intolerable.  This is an area of much concern in financial circles, especially with one of the top five English mortgage banks on the verge of failure and the largest Swiss bank losing CHF 23 billion in the last two quarters alone.  Frum isn’t concerned about any of this because he thinks the central bankers can sort it out – and simultaneously avoid recession – whereas both Ron Paul and those professional money experts who actually understand the situation are deeply worried.\n(Which reminds me, I have another friend who is the CEO of a massive multinational corporation.  A few years ago, after getting back from a trip in which he visited with the British central bankers, he told me that he was genuinely terrified at the influence possessed by men he described as “unbelievable idiots”.  Not more than a month or two later, Gordon Brown, the current British prime minister, sold off 300 tonnes of gold at $275 an ounce.  It’s now around $800.)\nFrum’s claim in (b) that monetary devaluation is equitable is downright amusing.  He writes:\n“All holders of dollar assets lose some of their wealth – but the burden falls most heavily on those with the most wealth to lose, who also happen to be the people who enjoyed the biggest gains during the previous increase in the value of the dollar. The burden falls least heavily on those with nothing to sell but their labor.”\nThat would certainly be true, so long as those who have the most wealth are unable to hire anyone capable of advising them to move into Euros, pounds, the yen, or gold.  As usual, the wealthy profit from both long and short sides of the equation while those whose wealth is tied up in the stock market or wish to purchase any imported goods suffer.   It’s not as if those who have nothing to sell but their labor ever buy Japanese cars, Chinese clothes, Taiwanese computers or gasoline for the daily commute, right?  Keynes might well have been describing Frum when he wrote in his\nTract on Monetary Reform\n“It is common to speak as though, when a Government pays its way by inflation, the people of the country avoid taxation. We have seen that this is not so. What is raised by printing notes is just as much taken from the public as is a beer-duty or an income-tax. What a Government spends the public pay for. There is no such thing as an uncovered deficit.”\nNow for (c).  When Frum advocates rebalancing through devaluation, he’s simply calling for variant on the same trick of escaping debt through inflation that has endangered the U.S. credit markets, the U.S. housing market and all of the individuals who are invested in them.  It will be neither equitable nor painless when the credit crunch is in full E-F-F-E-C-T otherwise known as effect.  And when it comes to the nation’s money stock, miners are to be preferred to bankers as they are VASTLY more trustworthy.\nIt is astounding that Frum seriously advocates trusting the central bankers to control the growth of the money supply, or, in less flattering terms, inflation.  (Yes, that would be the very same clever fellows who sold off their gold at record low prices.)  But according to the Inflation Calculator, the value of one U.S. dollar increased 59 percent from 1819 to 1913 on the gold standard, whereas it lost 95 percent of its value from 1913 to 2006.  And during that deflationary 19th century period, real U.S. Gross Domestic Product grew more than twice as fast as it did during the inflationary 20th, 43x to 21x, even using the Fed’s official inflation statistics which every economically literate individual knows are significantly understated.  After all, it’s not as if anyone ever buys any of those volatile food and energy products that are conveniently omitted from the “core rate”.  The modern era has a slight edge in real GDP growth per capita, but it’s small enough that it would probably be wiped out by a more realistic measure of inflation.\nFinally, (d) is demonstrably false.  A return to the gold standard is far from inconceivable or unworkable.  Not only was the Swiss economy fully on the gold standard until 1999, but the franc is still 50 percent backed by gold.  And Frum’s own National Review colleage, Donald Luskin, explained that for more than 10 years under Greenspan,\nthe U.S. economy was on a virtual gold standard\n:\n“For almost ten years the funds rate tracked the gold price with astonishing precision. Who can really know what was going on in Greenspan’s mind — bu\nt by all appearances, he was conducting monetary policy on a “virtual gold standard” or “price rule.” The chart suggests that he was withdrawing liquidity by raising the funds rate when a rising gold price signaled inflationary pressures, and adding liquidity by lowering the funds rate when a falling gold price signaled deflationary pressures.\nGreenspan himself explained that a return to the gold standard was, although not without complications, entirely workable, writing:\n“Even some of those who conclude a return to gold is infeasible remain deeply disturbed by the current alternatives. For example, William Fellner of the American Enterprise Institute in a forthcoming publication remarks “…I find it difficult not to be greatly impressed by the very large damage done to the economies of the industrialized world… by the monetary management that has followed the era of (gold) convertibility… It has placed the Western economies in acute danger….”  Yet even those of us who are attracted to the prospect of gold convertibility are confronted with a seemingly impossible obstacle: the latest claims to gold represented by the huge world overhang of fiat currency, many dollars.  The immediate problem of restoring a GOLD STANDARD is fixing a gold price that is consistent with market forces….  Those who advocate a return to a GOLD STANDARD should be aware that returning our monetary system to gold convertibility is no mere technical, financial restructuring. It is a basic change in our economic processes. However, considering where the policies of the last 50 years have eventually led us, perhaps there are lessons to be learned from our more distant GOLD STANDARD past.\nIn light of Luskin’s notion that Greenspan was running a virtual gold standard, it appears that he was attempting to do just what he was describing in the essay quoted above,\nCan the U.S. Return to a Gold Standard?\nUnfortunately, he ultimately gave into the temptation of Frum-style thinking, and in attempting to avoid recession, created the probability of depression.\nWe shall have to wait to see precisely how future events unfold, but this should all suffice to demonstrate that Ron Paul’s economic understanding is far ahead of David Frum’s, so far ahead, in fact, that Paul can even explain the real reason why Frum, a neocon war enthusiast, hates the gold standard.\n“If every American taxpayer had to submit an extra five or ten thousand dollars to the IRS this April to pay for the war, I’m quite certain it would end very quickly. The problem is that government finances war by borrowing and printing money, rather than presenting a bill directly in the form of higher taxes. When the costs are obscured, the question of whether any war is worth it becomes distorted.  Congress and the Federal Reserve Bank have a cozy, unspoken arrangement that makes war easier to finance. Congress has an insatiable appetite for new spending, but raising taxes is politically unpopular. The Federal Reserve, however, is happy to accommodate deficit spending by creating new money through the Treasury Department. In exchange, Congress leaves the Fed alone to operate free of pesky oversight and free of political scrutiny. Monetary policy is utterly ignored in Washington, even though the Federal Reserve system is a creation of Congress.\nEconomist Lawrence Parks has explained how the creation of the Federal Reserve Bank in 1913 made possible our involvement in World War I. Without the ability to create new money, the federal government never could have afforded the enormous mobilization of men and material. Prior to that, American wars were financed through taxes and borrowing, both of which have limits. But government printing presses, at least in theory, have no limits. That’s why the money supply has nearly tripled just since 1990.”\nAnd now we don’t even know how fast it is growing, since the Fed no longer reports M3 to the public for fear that it will panic.  But the leap in gold prices to nominal all-time highs and emergency rate-cutting suggests that the value of the currency is falling faster than ever.  What, Frum asks, will keep future politicians from simply abandoning a future gold standard should it ever be adopted?  The answer is simple: the pain of the coming global recession and probable depression caused by the Federal Reserve’s inflationary monetary policy will be such that anyone who advocates going off it will be liable to be torn to pieces by an angry mob of survivors.\nMr. Frum is a very good wordsmith who should probably stick to doing what he does best, banging the war drum, nominating the various Hitlers of the month and talking up Republican sacrificial lambs like Giuliani.  And speaking of lambs, seeing Frum attack Ron Paul on economic grounds is rather like watching a newborn lamb standing on four wobbly legs, trying to headbutt a lion.\nUPDATE: Mr. Frum was kind enough to email me and inform me that in his opinion, there’s nothing here that he didn’t anticipate and answer in his prior post, except for the ad hominem attacks.  Which, if nothing else, proves that he truly hadn’t heard of me before.  He reminds me of Sam Harris and Me-So Michelle, neither of whom understand the difference between anticipating and answering a response and anticipating and\nsuccessfully\nanswering a response.  There won’t be any further response from him, he’s a candyass\nwho can only dish it out\n; he can’t take it.\nBy the way, he thinks you all are “dubious”.  I’m not sure, but that may well be the nicest thing anyone has ever said about the Dread Ilk!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-18T11:14:00+00:00"
}