{
  "url": "https://voxday.net/2007/12/21/tramp-appea/",
  "scraped_at": "2026-01-08T22:04:28.092306",
  "title": "Tramp appeal",
  "date_display": "December 21, 2007",
  "date_iso": "2007-12-21T09:41:00+00:00",
  "date_from_url": "2007-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As the Evangelical Outpost points out, Whit Stilman appears to understand <a href=\"http://www.evangelicaloutpost.com/archives/004141.html#more\">the way young women’s minds work</a>:</p><p><i>Rick Von Slonecker is tall, rich, good looking, stupid, dishonest, conceited, a bully, liar, drunk and thief, an egomaniac, and probably psychotic. In short, highly attractive to women.</i></p><p><i>[Tramp is] a self-confessed chicken thief; an all around sleaze ball. What’s the function of a film of this kind? Essentially it’s a primer about love and marriage directed at very young people, imprinting on their little psyches that smooth-talking delinquents recently escaped from the local pound are a good match for nice girls in sheltered homes. When in ten years the icky human version of Tramp shows up around the house their hormones will be racing and no one will understand why.</i></p><p>That is fiction, of course.  But there’s no shortage of evidence of this sort of behavior in the real world, as JW relates in an email about his former life as a girl’s best friend:</p><blockquote><p>Your blog about “what happened to the nice guys” hilariously reminded me of my last week as a woman’s best friend.  It went something like this:</p><p>Friday: Female best friend, 38 and pretty, leaves town for a wedding.  Takes 28-year old unemployed loser to keep her company.  He tells her he brought no money after he orders dinner.  Annoyed, she pays for everything and bangs him.</p><p>Saturday:  He acts like he doesn’t know her at the wedding reception, spending all his time dancing and phone number swapping with someone younger and hotter.  Annoyed, she bangs him at the hotel later.</p><p>Sunday:  She drops him at home and calls him a few hours later.  His roommate makes fun of her for the way she serviced him in bed all weekend.</p><p>Monday: I listen to her cry about his not bringing money, ignoring her at the wedding, and cutting up about her sexually to his roommate.  She just can’t find a good guy (as if any of the employed and decent men in her fan club would have ever been invited.)</p><p>Tuesday:  I play cards and I’m not home when she calls (and calls).</p><p>Wednesday: I return her call and she doesn’t have time to talk because she needs to get showered before bad boy gets there to “talk” about his behavior over the weekend.</p><p>Thursday:  She calls me and I tell her it burns me to listen to her non-stop whining about this asshole’s behavior, since she’ll just bang him again (and she didn’t deny that happening).  She yells at me not to call him an asshole since he was there for her, which is more than she could say for me on Tuesday when I knew she was hurting.  I hung up on her and have barely spoken to her since.</p><p>It is amazing how hard this woman, who never seemed to have the time before, would try to get me on the phone once I didn’t want to talk to her anymore. I was 34, and I was admittedly a little pathetic when it came to her.  Got married at 35 to someone better.</p></blockquote><p>The lesson is this: unless you’re a committed voyeur, don’t be a woman’s best friend if you’re attracted to her.  The main secret of the successful man is simple: pay no attention to what a woman says.  Most of the time, she has already forgotten whatever it was that happened to come out of her mouth while the gamma male is still performing an exegesis on the precise meaning of the text.</p><p>Spacebunny was never my “girlfriend”.  We never had a talk about our “relationship” and if we had, I wouldn’t have paid attention to anything she said anyhow.  Her actions sufficed to convey her opinion on the subject.  Now, it may sound a little strange to cite Ludwig von Mises in connection with male-female relations, but as he writes in the first chapter of <i>Human Action</i>, it is only an individual’s actions that are relevant, not his words.</p><p><i>To express wishes and hopes and to announce planned action may be forms of action in so far as they aim in themselves at the realization of a certain purpose. But they must not be confused with the actions to which they refer. They are not identical with the actions they announce, recommend, or reject. Action is a real thing. What counts is a man’s total behavior, and not his talk about planned but not realized acts. </i></p></div>",
  "content_text": "As the Evangelical Outpost points out, Whit Stilman appears to understand\nthe way young women’s minds work\n:\nRick Von Slonecker is tall, rich, good looking, stupid, dishonest, conceited, a bully, liar, drunk and thief, an egomaniac, and probably psychotic. In short, highly attractive to women.\n[Tramp is] a self-confessed chicken thief; an all around sleaze ball. What’s the function of a film of this kind? Essentially it’s a primer about love and marriage directed at very young people, imprinting on their little psyches that smooth-talking delinquents recently escaped from the local pound are a good match for nice girls in sheltered homes. When in ten years the icky human version of Tramp shows up around the house their hormones will be racing and no one will understand why.\nThat is fiction, of course.  But there’s no shortage of evidence of this sort of behavior in the real world, as JW relates in an email about his former life as a girl’s best friend:\nYour blog about “what happened to the nice guys” hilariously reminded me of my last week as a woman’s best friend.  It went something like this:\nFriday: Female best friend, 38 and pretty, leaves town for a wedding.  Takes 28-year old unemployed loser to keep her company.  He tells her he brought no money after he orders dinner.  Annoyed, she pays for everything and bangs him.\nSaturday:  He acts like he doesn’t know her at the wedding reception, spending all his time dancing and phone number swapping with someone younger and hotter.  Annoyed, she bangs him at the hotel later.\nSunday:  She drops him at home and calls him a few hours later.  His roommate makes fun of her for the way she serviced him in bed all weekend.\nMonday: I listen to her cry about his not bringing money, ignoring her at the wedding, and cutting up about her sexually to his roommate.  She just can’t find a good guy (as if any of the employed and decent men in her fan club would have ever been invited.)\nTuesday:  I play cards and I’m not home when she calls (and calls).\nWednesday: I return her call and she doesn’t have time to talk because she needs to get showered before bad boy gets there to “talk” about his behavior over the weekend.\nThursday:  She calls me and I tell her it burns me to listen to her non-stop whining about this asshole’s behavior, since she’ll just bang him again (and she didn’t deny that happening).  She yells at me not to call him an asshole since he was there for her, which is more than she could say for me on Tuesday when I knew she was hurting.  I hung up on her and have barely spoken to her since.\nIt is amazing how hard this woman, who never seemed to have the time before, would try to get me on the phone once I didn’t want to talk to her anymore. I was 34, and I was admittedly a little pathetic when it came to her.  Got married at 35 to someone better.\nThe lesson is this: unless you’re a committed voyeur, don’t be a woman’s best friend if you’re attracted to her.  The main secret of the successful man is simple: pay no attention to what a woman says.  Most of the time, she has already forgotten whatever it was that happened to come out of her mouth while the gamma male is still performing an exegesis on the precise meaning of the text.\nSpacebunny was never my “girlfriend”.  We never had a talk about our “relationship” and if we had, I wouldn’t have paid attention to anything she said anyhow.  Her actions sufficed to convey her opinion on the subject.  Now, it may sound a little strange to cite Ludwig von Mises in connection with male-female relations, but as he writes in the first chapter of\nHuman Action\n, it is only an individual’s actions that are relevant, not his words.\nTo express wishes and hopes and to announce planned action may be forms of action in so far as they aim in themselves at the realization of a certain purpose. But they must not be confused with the actions to which they refer. They are not identical with the actions they announce, recommend, or reject. Action is a real thing. What counts is a man’s total behavior, and not his talk about planned but not realized acts.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-21T09:41:00+00:00"
}