{
  "url": "https://voxday.net/2007/12/03/triumph-of-athies/",
  "scraped_at": "2026-01-08T22:02:38.273478",
  "title": "The triumph of Athiesm",
  "date_display": "December 3, 2007",
  "date_iso": "2007-12-03T18:10:00+00:00",
  "date_from_url": "2007-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are few things more amusing than atheist intellectual arrogance.  Excuse me, I mean <a href=\"http://scienceblogs.com/pharyngula/2007/12/maybe_this_is_our_problem.php\">Athiest</a>, of course.</p><p>The other thing I noticed here is that the quote sounds remarkably more like a modern atheist argument and not at all like one that would have been made by a pre-Christian philosopher living in a polytheistic society.  I’m no expert on Epicurus, but I suspect that the quote is a fake as I’m always suspicious of any quote that is frequently quoted without any reference to the work in which it first appeared.  But if the quote is genuine, than it demonstrates quite clearly how atheist-thinking has not progressed at all despite having more than two thousand years of human history upon which to draw.  Anyhow, I’m quite curious, as no source was provided on the first five sites I checked and the statement doesn’t appear in any of the following texts: <i>Principal Doctrines</i>, <i>Vatican Sayings</i>, <i>Letter to Menoeceus</i>, <i>Letter to Herodotus</i>, <i>Letter to Pythocles</i>, <i>Letter to Idomeneus</i>, or <i>Last Will</i>.</p><p>A genuine quote from Epicurus that few atheists will appreciate is #51 from the <i>Vatican Sayings</i>: “I understand from you that your natural disposition is too much inclined toward sexual passion. Follow your inclination as you will, provided only that you neither violate the laws, disturb well-established customs, harm any one of your neighbors, injure your own body, nor waste your possessions. That you be not checked by one or more of these provisos is impossible; for a man never gets any good from sexual passion, and he is fortunate if he does not receive harm.”</p><p>I like #58 even better: “We must free ourselves from the prison of public education….”</p><p>To give another amusing example, one will <i>still</i> hear atheists natter on and on about the terrible Dark Ages, that awful period of Church oppression during the Medieval era that, according to the historical consensus of the last 70 years, never actually existed.</p></div>",
  "content_text": "There are few things more amusing than atheist intellectual arrogance.  Excuse me, I mean\nAthiest\n, of course.\nThe other thing I noticed here is that the quote sounds remarkably more like a modern atheist argument and not at all like one that would have been made by a pre-Christian philosopher living in a polytheistic society.  I’m no expert on Epicurus, but I suspect that the quote is a fake as I’m always suspicious of any quote that is frequently quoted without any reference to the work in which it first appeared.  But if the quote is genuine, than it demonstrates quite clearly how atheist-thinking has not progressed at all despite having more than two thousand years of human history upon which to draw.  Anyhow, I’m quite curious, as no source was provided on the first five sites I checked and the statement doesn’t appear in any of the following texts:\nPrincipal Doctrines\n,\nVatican Sayings\n,\nLetter to Menoeceus\n,\nLetter to Herodotus\n,\nLetter to Pythocles\n,\nLetter to Idomeneus\n, or\nLast Will\n.\nA genuine quote from Epicurus that few atheists will appreciate is #51 from the\nVatican Sayings\n: “I understand from you that your natural disposition is too much inclined toward sexual passion. Follow your inclination as you will, provided only that you neither violate the laws, disturb well-established customs, harm any one of your neighbors, injure your own body, nor waste your possessions. That you be not checked by one or more of these provisos is impossible; for a man never gets any good from sexual passion, and he is fortunate if he does not receive harm.”\nI like #58 even better: “We must free ourselves from the prison of public education….”\nTo give another amusing example, one will\nstill\nhear atheists natter on and on about the terrible Dark Ages, that awful period of Church oppression during the Medieval era that, according to the historical consensus of the last 70 years, never actually existed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-03T18:10:00+00:00"
}