{
  "url": "https://voxday.net/2007/12/20/uppity-house-negroes/",
  "scraped_at": "2026-01-08T22:04:24.442778",
  "title": "Uppity house negroes",
  "date_display": "December 20, 2007",
  "date_iso": "2007-12-20T13:58:00+00:00",
  "date_from_url": "2007-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher points out that <a href=\"http://blog.beliefnet.com/crunchycon/2007/12/why-does-the-gop-establishment.html\">turnabout isn’t fair play</a> on the Republican plantation:</p><blockquote><p>It’s funny, but when it looked like Rudy Giuliani, a social liberal, was going to be the nominee, we didn’t see many, if any, establishment Republican opinion leaders freaking out over what kind of danger to the future of the party and the nation he represented….I think it’s fair to say that it was assumed that Giuliani would be a sound representative of the Republican Party, and that the social and religious conservatives would do like they always do and get in line….</p><p>But lo, it turns out that the candidate who’s caught fire comes straight out of the religious/social conservative wing of the coalition, and he is unsound on issues most important to the fiscal wing. It’s not supposed to work that way. Nobody at the elite level seems to expect the economic conservatives to suck it up for the sake of party unity. What does that say about the place of social conservatives in the party all these years?</p></blockquote><p>I don’t support Huckabee nor am I a Republican, but Dreher’s complaint on behalf of social conservatives is eminently justifiable.  The GOP elite can’t be trusted any more than the Dem elite, mostly because they both want pretty much the same thing even if one assumes that they’re NOT one and the same.  There may be a lot more social conservatives in the Republican party than there are blacks in the Democratic party, but the role both groups have played within their parties over the last five decades is essentially the same.  Social conservatives and blacks are supposed to be there to be obedient and mindlessly supportive of the decisions of their betters, they’re not supposed to actually believe that they have any right to an opinion in how massa’s house is run.</p><p>I do look forward to the inventive reasoning presented by Republican establishment “conservatives” as they somehow discover reasons to vote Democrat should Mike Huckabee, or better yet, Ron Paul, win the nomination.</p><p>UPDATE – Dreher and I are not the only non-Huckabee supporters who have noticed this. <a href=\"http://www.redstate.com/stories/archived/f_you_country_boy_jesus_freaks_need_not_apply\">Erick from Red State</a> writes:</p><blockquote><p>You know the most damnably aggravating thing about this campaign season for me? I continue to feel compelled to defend Mike Huckabee and I’m still convinced he’d hurt the party were he the nominee….  The New York-Washington Corridor of Conservative IntelligentsiaTM loves the base when it does as it is told, but let’s not actually let the Jesus Freaks run things directly. You know, we’re all suppose to listen to James Dobson, but God forbid one of his ideological kin actually takes charge.</p></blockquote><p>I especially love the way he quotes Rich Lowry talking about Huckabee’s disbelief in evolution.  Um, Rich, given that <a href=\"http://www.cbsnews.com/stories/2004/11/22/opinion/polls/main657083.shtml\">55 percent of Americans don’t believe in evolution</a> and only 13 percent believe whatever the latest scientific spin on TENS sans God happens to be, Huckabee’s position would be the electorally rational one even if he wasn’t a creationist.</p></div>",
  "content_text": "Rod Dreher points out that\nturnabout isn’t fair play\non the Republican plantation:\nIt’s funny, but when it looked like Rudy Giuliani, a social liberal, was going to be the nominee, we didn’t see many, if any, establishment Republican opinion leaders freaking out over what kind of danger to the future of the party and the nation he represented….I think it’s fair to say that it was assumed that Giuliani would be a sound representative of the Republican Party, and that the social and religious conservatives would do like they always do and get in line….\nBut lo, it turns out that the candidate who’s caught fire comes straight out of the religious/social conservative wing of the coalition, and he is unsound on issues most important to the fiscal wing. It’s not supposed to work that way. Nobody at the elite level seems to expect the economic conservatives to suck it up for the sake of party unity. What does that say about the place of social conservatives in the party all these years?\nI don’t support Huckabee nor am I a Republican, but Dreher’s complaint on behalf of social conservatives is eminently justifiable.  The GOP elite can’t be trusted any more than the Dem elite, mostly because they both want pretty much the same thing even if one assumes that they’re NOT one and the same.  There may be a lot more social conservatives in the Republican party than there are blacks in the Democratic party, but the role both groups have played within their parties over the last five decades is essentially the same.  Social conservatives and blacks are supposed to be there to be obedient and mindlessly supportive of the decisions of their betters, they’re not supposed to actually believe that they have any right to an opinion in how massa’s house is run.\nI do look forward to the inventive reasoning presented by Republican establishment “conservatives” as they somehow discover reasons to vote Democrat should Mike Huckabee, or better yet, Ron Paul, win the nomination.\nUPDATE – Dreher and I are not the only non-Huckabee supporters who have noticed this.\nErick from Red State\nwrites:\nYou know the most damnably aggravating thing about this campaign season for me? I continue to feel compelled to defend Mike Huckabee and I’m still convinced he’d hurt the party were he the nominee….  The New York-Washington Corridor of Conservative IntelligentsiaTM loves the base when it does as it is told, but let’s not actually let the Jesus Freaks run things directly. You know, we’re all suppose to listen to James Dobson, but God forbid one of his ideological kin actually takes charge.\nI especially love the way he quotes Rich Lowry talking about Huckabee’s disbelief in evolution.  Um, Rich, given that\n55 percent of Americans don’t believe in evolution\nand only 13 percent believe whatever the latest scientific spin on TENS sans God happens to be, Huckabee’s position would be the electorally rational one even if he wasn’t a creationist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-20T13:58:00+00:00"
}