{
  "url": "https://voxday.net/2007/12/18/who-is-vox-day/",
  "scraped_at": "2026-01-08T22:04:01.312311",
  "title": "Who is Vox Day?",
  "date_display": "December 18, 2007",
  "date_iso": "2007-12-18T01:17:00+00:00",
  "date_from_url": "2007-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Frum’s question will no doubt amuse some of the objectivists in our midst:</p><blockquote><p>Mr. Frum has just returned my email asking him to recant or debate Vox with the question, “Who is Vox Day?” Did he not receive your email? Or is he just playing dumb?</p></blockquote><p>I have no idea if Mr. Frum received my email or not, but this response should demonstrate that Mr. Frum’s opinion of Ron Paul’s economic acumen is completely irrelevant given his apparent inability to figure out how to use either Google or Wikipedia.  However, given the fact that my forthcoming book was recommended <a href=\"http://article.nationalreview.com/?q=NjI4NGI0ZGI3M2RkOWMxZDZkZmRlOThlOGEwNTgxZDU=\">in NRO’s recent Christmas symposium</a> by John Derbyshire, it is not unreasonable to suspect that Mr. Frum is playing dumb.  He wouldn’t exactly be the first fake conservative to duck a debate with me.</p><p>One of the things I despise about many intellectuals is the way they will only “debate up” against someone who is better known than they are.  As for me, I don’t care who you are or how few people read your blog; if you want to bring it, I’ll take you on.</p><p>That’s never going to change, even if one day I end up outselling Coulter, Dawkins and Franken combined.  If you don’t have the courage to defend your beliefs when you get called out, then you’re nothing but a coward.  Hiding behind the skirts of your prospective opponent’s lack of media prestige is simply not a legitimate excuse for anyone.</p><p>UPDATE – Or not.  Unlike a number of his NRO colleagues, Mr. Frum apparently doesn’t read WND and was previously unaware of my existence; he sent me an email in response to KS’s which made that pretty clear.  That’s fine, as I have no illusions about my small fish status in commentary circles, but I’m a bit surprised that he doesn’t read WND on Mondays in light of the Chuck Norris-inspired Huckaboom.  As I wrote earlier today, it’s no wonder the commentariat has so little idea what’s going on.</p></div>",
  "content_text": "David Frum’s question will no doubt amuse some of the objectivists in our midst:\nMr. Frum has just returned my email asking him to recant or debate Vox with the question, “Who is Vox Day?” Did he not receive your email? Or is he just playing dumb?\nI have no idea if Mr. Frum received my email or not, but this response should demonstrate that Mr. Frum’s opinion of Ron Paul’s economic acumen is completely irrelevant given his apparent inability to figure out how to use either Google or Wikipedia.  However, given the fact that my forthcoming book was recommended\nin NRO’s recent Christmas symposium\nby John Derbyshire, it is not unreasonable to suspect that Mr. Frum is playing dumb.  He wouldn’t exactly be the first fake conservative to duck a debate with me.\nOne of the things I despise about many intellectuals is the way they will only “debate up” against someone who is better known than they are.  As for me, I don’t care who you are or how few people read your blog; if you want to bring it, I’ll take you on.\nThat’s never going to change, even if one day I end up outselling Coulter, Dawkins and Franken combined.  If you don’t have the courage to defend your beliefs when you get called out, then you’re nothing but a coward.  Hiding behind the skirts of your prospective opponent’s lack of media prestige is simply not a legitimate excuse for anyone.\nUPDATE – Or not.  Unlike a number of his NRO colleagues, Mr. Frum apparently doesn’t read WND and was previously unaware of my existence; he sent me an email in response to KS’s which made that pretty clear.  That’s fine, as I have no illusions about my small fish status in commentary circles, but I’m a bit surprised that he doesn’t read WND on Mondays in light of the Chuck Norris-inspired Huckaboom.  As I wrote earlier today, it’s no wonder the commentariat has so little idea what’s going on.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-18T01:17:00+00:00"
}