{
  "url": "https://voxday.net/2007/12/12/yea-embuggerance-indeed/",
  "scraped_at": "2026-01-08T22:03:32.322075",
  "title": "Yea, an embuggerance indeed",
  "date_display": "December 12, 2007",
  "date_iso": "2007-12-12T21:33:00+00:00",
  "date_from_url": "2007-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of fantasy’s best and most entertaining writers, Terry Pratchett, <a href=\"http://www.paulkidby.com/news/index.html\">has been diagnosed with Alzheimer’s</a>:</p><blockquote><p>I would have liked to keep this one quiet for a little while, but because of upcoming conventions and of course the need to keep my publishers informed, it seems to me unfair to withhold the news.  I have been diagnosed with a very rare form of early<br>onset Alzheimer’s, which lay behind this year’s phantom “stroke”.</br></p><p>We are taking it fairly philosophically down here and possibly with a mild optimism.</p></blockquote><p>I came late to Pratchett’s Discworld, but very much appreciate his books and the way he has become a better, more subtle and more amusing writer as his career has progressed.  Here’s wishing him all the best in his battle and I hope he will write many more books in the years to come.</p></div>",
  "content_text": "One of fantasy’s best and most entertaining writers, Terry Pratchett,\nhas been diagnosed with Alzheimer’s\n:\nI would have liked to keep this one quiet for a little while, but because of upcoming conventions and of course the need to keep my publishers informed, it seems to me unfair to withhold the news.  I have been diagnosed with a very rare form of early\nonset Alzheimer’s, which lay behind this year’s phantom “stroke”.\nWe are taking it fairly philosophically down here and possibly with a mild optimism.\nI came late to Pratchett’s Discworld, but very much appreciate his books and the way he has become a better, more subtle and more amusing writer as his career has progressed.  Here’s wishing him all the best in his battle and I hope he will write many more books in the years to come.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-12-12T21:33:00+00:00"
}