{
  "url": "https://voxday.net/2010/06/20/adios-anelka/",
  "scraped_at": "2026-01-08T23:29:54.588962",
  "title": "Adios Anelka",
  "date_display": "June 20, 2010",
  "date_iso": "2010-06-20T08:57:00+00:00",
  "date_from_url": "2010-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I could not figure out what in the name of the 18th Fructidor French manager Raymond Domenech was doing naming Nicolas Anelka to Les Blues, let alone STARTING him.  Anelka isn’t quite as bad as Emile Heskey, (word out of the England camp is that Fabio Capelli has finally given up on starting him), but he’s only scored 14 goals in 64 games for one of Europe’s elite teams.  Contrast that with Andriy Shevchenko’s 45 goals in 94 games for Ukraine, Gabriel Batistuta’s 56 goals in 78 games for Argentina, or more importantly, Thierry Henry’s 51 goals in 122 games for France.</p><p>Given that record of poor performance, one can’t doubt the wisdom of the French Football Federation to kick Anelka off the team and send him home given his behavior during the French loss to Mexico.</p><p><i>“It’s shocking, because if anyone has protected Anelka, it’s Domenech. Domenech has played Anelka throughout the past two years” — vice president of the French Football Federation, Noel le Graet, after taking the decision to send Nicolas Anelka home immediately.</i></p><p>“Go f–k yourself, you dirty son of a b—h” — what Anelka said to Raymond Domenech (shortly after the coach told him to stop moving out of position, and shortly before being subbed off against Mexico) to get himself into hot water.</p><p>For some reason, many soccer managers cannot seem to distinguish between African athletes and African <i>strikers</i>.  The only thing that real strikers like Eto’o, Drogba, and Henry have in common with athletes who happen to be assigned an attacking position like Heskey and Anelka is that they are of African descent.  If a striker cannot maintain at least a 25% scoring rate per game, he should not be starting and probably shouldn’t even be on the team barring the possession of a particular support skill.</p><p>I was a little surprised to see Cameroon lose to Denmark, who was amazingly careless in back.  The Dutch had some trouble with the Japanese discipline, but did enough to win and go through with a game to spare, and Australia would do well to hire a new manager who is capable of explaining the rules of the game to the Socceroos.  Kewell’s handball in the box wasn’t the worst I’ve seen, or the most inexplicable, but it clearly merited the whistle given the tight way this tournament is being called.</p></div>",
  "content_text": "I could not figure out what in the name of the 18th Fructidor French manager Raymond Domenech was doing naming Nicolas Anelka to Les Blues, let alone STARTING him.  Anelka isn’t quite as bad as Emile Heskey, (word out of the England camp is that Fabio Capelli has finally given up on starting him), but he’s only scored 14 goals in 64 games for one of Europe’s elite teams.  Contrast that with Andriy Shevchenko’s 45 goals in 94 games for Ukraine, Gabriel Batistuta’s 56 goals in 78 games for Argentina, or more importantly, Thierry Henry’s 51 goals in 122 games for France.\nGiven that record of poor performance, one can’t doubt the wisdom of the French Football Federation to kick Anelka off the team and send him home given his behavior during the French loss to Mexico.\n“It’s shocking, because if anyone has protected Anelka, it’s Domenech. Domenech has played Anelka throughout the past two years” — vice president of the French Football Federation, Noel le Graet, after taking the decision to send Nicolas Anelka home immediately.\n“Go f–k yourself, you dirty son of a b—h” — what Anelka said to Raymond Domenech (shortly after the coach told him to stop moving out of position, and shortly before being subbed off against Mexico) to get himself into hot water.\nFor some reason, many soccer managers cannot seem to distinguish between African athletes and African\nstrikers\n.  The only thing that real strikers like Eto’o, Drogba, and Henry have in common with athletes who happen to be assigned an attacking position like Heskey and Anelka is that they are of African descent.  If a striker cannot maintain at least a 25% scoring rate per game, he should not be starting and probably shouldn’t even be on the team barring the possession of a particular support skill.\nI was a little surprised to see Cameroon lose to Denmark, who was amazingly careless in back.  The Dutch had some trouble with the Japanese discipline, but did enough to win and go through with a game to spare, and Australia would do well to hire a new manager who is capable of explaining the rules of the game to the Socceroos.  Kewell’s handball in the box wasn’t the worst I’ve seen, or the most inexplicable, but it clearly merited the whistle given the tight way this tournament is being called.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-20T07:57:00+00:00"
}