{
  "url": "https://voxday.net/2010/06/19/atheism-and-action/",
  "scraped_at": "2026-01-08T23:29:50.953787",
  "title": "Atheism and action",
  "date_display": "June 19, 2010",
  "date_iso": "2010-06-19T16:37:00+00:00",
  "date_from_url": "2010-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which the connection between godlessness and the commission of acts of mass violence is explained by Napoleon, as per his personal secretary and biographer, Bourrienne:</p><p><i>During the negotiations with the Holy Father Bonaparte one day said to me, “In every country religion is useful to the Government, and those who govern ought to avail themselves of it to influence mankind. I was a Mahometan in Egypt; I am a Catholic in France. With relation to the police of the religion of a state, it should be entirely in the hands of the sovereign. Many persons have urged me to found a Gallican Church, and make myself its head; but they do not know France. If they did, they would know that the majority of the people would not like a rupture with Rome. Before I can resolve on such a measure the Pope must push matters to an extremity; but I believe he will not do so.”—”You are right, General, and you recall to my memory what Cardinal Consalvi said: ‘The Pope will do all the First Consul desires.'”—”That is the best course for him. Let him not suppose that he has to do with an idiot. What do you think is the point his negotiations put most forward? The salvation of my soul! But with me immortality is the recollection one leaves in the memory of man. That idea prompts to great actions. It would be better for a man never to have lived than to leave behind him no traces of his existence.”</i></p><p>It is those last three sentences that demonstrate the connection between atheism and large-scale tragedy that Richard Dawkins and other historically illiterate atheists have so much trouble recognizing.  It is not atheism itself that is the problem, but as I explained in TIA, atheism <i>combined</i> with a burning ambition to achieve immortality through material ends.  Whether this immortality is achieved through military glory, the creation of a New Man, or the construction of a new society on the ashes of the old one is not important, the point is that the underlying motivation to commit acts of horrific violence involves more than the simple absence of the belief that one will face judgment for one’s actions in this life.</p><p>Those who trouble to actually read the words of the historical individuals will see a striking similarity in the mindset of men as superficially different as Napoleon, Lenin, and Mao.  Again and again, it becomes apparent that the ideology that supposedly drove each of them was merely cover for their burning personal desire to seek immortality through action.  This is the most obvious in the case of Napoleon, who secretly loathed both the liberty and the bloody regicides of the Republic whose armies he led so effectively, because his biographer was privy to his private thoughts long before his actions began to contradict his supposed republicanism.  But, the same concept quite obviously applies to many of the more lethal Communist leaders as well, since most of them were no more genuinely committed to Communism than Napoleon was to liberty, equality, and the French Republic.</p><p>For such men of burning ambition, ideology is nothing more than a means to a self-serving end.  Men have little to fear from an atheist libertarian or a Christian monarch, but they have everything to fear from an ambitious atheist who dreams of great actions and is determined to leave the world with the recollection of his existence.</p></div>",
  "content_text": "In which the connection between godlessness and the commission of acts of mass violence is explained by Napoleon, as per his personal secretary and biographer, Bourrienne:\nDuring the negotiations with the Holy Father Bonaparte one day said to me, “In every country religion is useful to the Government, and those who govern ought to avail themselves of it to influence mankind. I was a Mahometan in Egypt; I am a Catholic in France. With relation to the police of the religion of a state, it should be entirely in the hands of the sovereign. Many persons have urged me to found a Gallican Church, and make myself its head; but they do not know France. If they did, they would know that the majority of the people would not like a rupture with Rome. Before I can resolve on such a measure the Pope must push matters to an extremity; but I believe he will not do so.”—”You are right, General, and you recall to my memory what Cardinal Consalvi said: ‘The Pope will do all the First Consul desires.'”—”That is the best course for him. Let him not suppose that he has to do with an idiot. What do you think is the point his negotiations put most forward? The salvation of my soul! But with me immortality is the recollection one leaves in the memory of man. That idea prompts to great actions. It would be better for a man never to have lived than to leave behind him no traces of his existence.”\nIt is those last three sentences that demonstrate the connection between atheism and large-scale tragedy that Richard Dawkins and other historically illiterate atheists have so much trouble recognizing.  It is not atheism itself that is the problem, but as I explained in TIA, atheism\ncombined\nwith a burning ambition to achieve immortality through material ends.  Whether this immortality is achieved through military glory, the creation of a New Man, or the construction of a new society on the ashes of the old one is not important, the point is that the underlying motivation to commit acts of horrific violence involves more than the simple absence of the belief that one will face judgment for one’s actions in this life.\nThose who trouble to actually read the words of the historical individuals will see a striking similarity in the mindset of men as superficially different as Napoleon, Lenin, and Mao.  Again and again, it becomes apparent that the ideology that supposedly drove each of them was merely cover for their burning personal desire to seek immortality through action.  This is the most obvious in the case of Napoleon, who secretly loathed both the liberty and the bloody regicides of the Republic whose armies he led so effectively, because his biographer was privy to his private thoughts long before his actions began to contradict his supposed republicanism.  But, the same concept quite obviously applies to many of the more lethal Communist leaders as well, since most of them were no more genuinely committed to Communism than Napoleon was to liberty, equality, and the French Republic.\nFor such men of burning ambition, ideology is nothing more than a means to a self-serving end.  Men have little to fear from an atheist libertarian or a Christian monarch, but they have everything to fear from an ambitious atheist who dreams of great actions and is determined to leave the world with the recollection of his existence.",
  "tags": [
    "atheism",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-19T15:37:00+00:00"
}