{
  "url": "https://voxday.net/2010/06/27/atlanta-journalconstitution-of-econ/",
  "scraped_at": "2026-01-08T23:30:29.534031",
  "title": "The Atlanta Journal/Constitution of Econ",
  "date_display": "June 27, 2010",
  "date_iso": "2010-06-27T09:17:00+00:00",
  "date_from_url": "2010-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s illuminating to see what small readerships are possessed by the most popular economics blogs.  Because I read Mike Shedlock and Calculated Risk, I always assumed that a number of the long list of blogs on their blogrolls were similarly well patronized.  But apparently that’s not so much the case, although the omission of sites like Karl Denninger’s Market Ticker indicates that around half of the bigger fish are missing from this survey.  But if EconDirectory’s <a href=\"http://www.gongol.com/lists/bizeconsites/\">list of top economics blogs</a> is to be trusted, then this would appear to be the 11th most trafficked economics-related blog, in between #10 VoxEU’s 12,405 daily pageviews and #11 TaxProfs 8,041.  It’s the same when it comes to visits, although if one adds the 1,400 feed readers – this is one of the few blogs to provide full-text feeds that negate the need to come here to read the posts – that would bump VP up to #9.</p><p>This is both scary and heartening.  It’s scary, because if even the most popular econ blog only attracts 56k daily readers, it’s not hard to understand the level of economic ignorance on the part of the elite and the electorate alike.  And it’s heartening, because this indicates it is feasible to reach a substantial percentage of the people who are sufficiently interested in the subject to follow it.</p><p>While we’re on the subject, it’s interesting to note that the Wall Street Journal has finally begun to wake up to the <a href=\"http://online.wsj.com/article/SB10001424052748703615104575328981319857618.html\">intellectual bankruptcy of the Neo-Keynesian response</a> to the initial stages of the Great Depression 2.0:</p><blockquote><p>Today’s G-20 meeting has been advertised as a showdown between the U.S. and Europe over more spending “stimulus,” and so it is. But the larger story is the end of the neo-Keynesian economic moment, and perhaps the start of a healthier policy turn.  For going on three years, the developed world’s economic policy has been dominated by the revival of the old idea that vast amounts of public spending could prevent deflation, cure a recession, and ignite a new era of government-led prosperity. It hasn’t turned out that way….</p><p>Like many bad ideas, the current Keynesian revival began under George W. Bush. Larry Summers, then a private economist, told Congress that a “timely, targeted and temporary” spending program of $150 billion was urgently needed to boost consumer “demand.” Democrats who had retaken Congress adopted the idea—they love an excuse to spend—and the politically tapped-out Mr. Bush went along with $168 billion in spending and one-time tax rebates.</p><p>The cash did produce a statistical blip in GDP growth in mid-2008, but it didn’t stop the financial panic and second phase of recession. So enter Stimulus II, with Mr. Summers again leading the intellectual charge, this time as President Obama’s adviser and this time suggesting upwards of $500 billion. When Congress was done two months later, in February 2009, the amount was $862 billion. A pair of White House economists famously promised that this spending would keep the unemployment rate below 8%. Seventeen months later, and despite historically easy monetary policy for that entire period, the jobless rate is still 9.7%….</p><p>The response at the White House and among Congressional leaders has been . . . Stimulus III. While talking about the need for “fiscal discipline” some time in the future, President Obama wants more spending today to again boost “demand.” Thirty months after Mr. Summers won his first victory, we are back at the same policy stand.</p></blockquote><p>RGD readers may recall that I predicted not only the failure of Stimulus II, but the failures of Stimuli III and IV as well.  I expect they’ll finally give up on the fruitless endeavor sometime between V and VII.  The problem, which even the new-found Neo-Keynesian skeptics don’t understand, is that these failed stimulus packages not only haven’t worked, but they are going to exacerbate the next phase of the contraction that is even now gathering steam.  Although they appear to have a glimmer of concern in that regard; consider how the WSJ is ineptly attempting to construct an ex post facto cover for its backside.</p><p><i>“With the economy in recession in 2008 and 2009, we argued that some stimulus was justified and an increase in the deficit was understandable and inevitable. However, we also argued that permanent tax cuts aimed at marginal individual and corporate tax rates would have done far more to revive animal spirits, and in our view would have led to a far more robust recovery.”</i></p><p>In other words, the WSJ still subscribes to the very economic idiocy they are describing as a dead end.  It’s not that the magical incantation doesn’t work, it merely wasn’t chanted in precisely the correct manner prescribed in the Keynesian grimoire.  This means that we can confidently expect the decision-making elite to continue digging and making the hole deeper as the situation worsens.  Note that the average weekly leading indicators are now at -6.9, a decline last seen <a href=\"http://1.bp.blogspot.com/_nSTO-vZpSgc/TCTVrMder0I/AAAAAAAAIvg/7qT__TRzWSE/s1600/ECRI+WLI+2010-06-25.png\">in July 2008</a>.</p></div>",
  "content_text": "It’s illuminating to see what small readerships are possessed by the most popular economics blogs.  Because I read Mike Shedlock and Calculated Risk, I always assumed that a number of the long list of blogs on their blogrolls were similarly well patronized.  But apparently that’s not so much the case, although the omission of sites like Karl Denninger’s Market Ticker indicates that around half of the bigger fish are missing from this survey.  But if EconDirectory’s\nlist of top economics blogs\nis to be trusted, then this would appear to be the 11th most trafficked economics-related blog, in between #10 VoxEU’s 12,405 daily pageviews and #11 TaxProfs 8,041.  It’s the same when it comes to visits, although if one adds the 1,400 feed readers – this is one of the few blogs to provide full-text feeds that negate the need to come here to read the posts – that would bump VP up to #9.\nThis is both scary and heartening.  It’s scary, because if even the most popular econ blog only attracts 56k daily readers, it’s not hard to understand the level of economic ignorance on the part of the elite and the electorate alike.  And it’s heartening, because this indicates it is feasible to reach a substantial percentage of the people who are sufficiently interested in the subject to follow it.\nWhile we’re on the subject, it’s interesting to note that the Wall Street Journal has finally begun to wake up to the\nintellectual bankruptcy of the Neo-Keynesian response\nto the initial stages of the Great Depression 2.0:\nToday’s G-20 meeting has been advertised as a showdown between the U.S. and Europe over more spending “stimulus,” and so it is. But the larger story is the end of the neo-Keynesian economic moment, and perhaps the start of a healthier policy turn.  For going on three years, the developed world’s economic policy has been dominated by the revival of the old idea that vast amounts of public spending could prevent deflation, cure a recession, and ignite a new era of government-led prosperity. It hasn’t turned out that way….\nLike many bad ideas, the current Keynesian revival began under George W. Bush. Larry Summers, then a private economist, told Congress that a “timely, targeted and temporary” spending program of $150 billion was urgently needed to boost consumer “demand.” Democrats who had retaken Congress adopted the idea—they love an excuse to spend—and the politically tapped-out Mr. Bush went along with $168 billion in spending and one-time tax rebates.\nThe cash did produce a statistical blip in GDP growth in mid-2008, but it didn’t stop the financial panic and second phase of recession. So enter Stimulus II, with Mr. Summers again leading the intellectual charge, this time as President Obama’s adviser and this time suggesting upwards of $500 billion. When Congress was done two months later, in February 2009, the amount was $862 billion. A pair of White House economists famously promised that this spending would keep the unemployment rate below 8%. Seventeen months later, and despite historically easy monetary policy for that entire period, the jobless rate is still 9.7%….\nThe response at the White House and among Congressional leaders has been . . . Stimulus III. While talking about the need for “fiscal discipline” some time in the future, President Obama wants more spending today to again boost “demand.” Thirty months after Mr. Summers won his first victory, we are back at the same policy stand.\nRGD readers may recall that I predicted not only the failure of Stimulus II, but the failures of Stimuli III and IV as well.  I expect they’ll finally give up on the fruitless endeavor sometime between V and VII.  The problem, which even the new-found Neo-Keynesian skeptics don’t understand, is that these failed stimulus packages not only haven’t worked, but they are going to exacerbate the next phase of the contraction that is even now gathering steam.  Although they appear to have a glimmer of concern in that regard; consider how the WSJ is ineptly attempting to construct an ex post facto cover for its backside.\n“With the economy in recession in 2008 and 2009, we argued that some stimulus was justified and an increase in the deficit was understandable and inevitable. However, we also argued that permanent tax cuts aimed at marginal individual and corporate tax rates would have done far more to revive animal spirits, and in our view would have led to a far more robust recovery.”\nIn other words, the WSJ still subscribes to the very economic idiocy they are describing as a dead end.  It’s not that the magical incantation doesn’t work, it merely wasn’t chanted in precisely the correct manner prescribed in the Keynesian grimoire.  This means that we can confidently expect the decision-making elite to continue digging and making the hole deeper as the situation worsens.  Note that the average weekly leading indicators are now at -6.9, a decline last seen\nin July 2008\n.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-27T08:17:00+00:00"
}