{
  "url": "https://voxday.net/2010/06/08/congress-passes-title-ix-science/",
  "scraped_at": "2026-01-08T23:28:57.677863",
  "title": "Congress passes Title IX: Science Edition",
  "date_display": "June 8, 2010",
  "date_iso": "2010-06-08T17:15:00+00:00",
  "date_from_url": "2010-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Needless to say, all of the Pharyngularons will believe <a href=\"http://www.nytimes.com/2010/06/08/science/08tier.html\">the application of Title X to academic science </a>is a great idea right up to the moment that their program is slashed due to disproportional representation or they are denied a job or a slot in a PhD program on the basis of their incorrect race or sex.  And then, all the wailing and the gnashing of teeth will be a sweet, sweet sound indeed.</p><blockquote><p>Section 201(a) of such Act (15 U.S.C. 5521(a)) is amended—<br> “(2) the National Science Foundation shall use its existing programs, in collaboration with other agencies, as appropriate, to improve the teaching and learning of networking and information technology at all levels of education and to increase participation in networking and information technology fields, including by women and underrepresented minorities;’’.</br></p></blockquote><p>The amusing thing is that despite hundreds of male athletic programs being cut in favor of hapless juggling and basket-weaving teams that can’t get enough women to participate even when offered full scholarships, scientists and science fetishists alike can’t foresee the obvious result of this Congressional action.  If the pattern holds, and given that women are even less interested in science than they are in sports, it will probably even stronger, then up to three times as many male positions will be cut as female positions are added.  Consider what has happened in the recent past.</p><p><i>“It is clear that women’s sports are growing at the expense of male sports.   From 1992 to 1997 approximately 5,800 female athletes have been added to sports teams.  During that same period over 20,000 male athletes were cut (Hoornstra 2002).”</i></p><p>Lest you wonder why I harbor such complete contempt for the intelligence and logical capacity of scientists, note that many of them continue worrying about the hypothetically negative effects on science supposedly caused by creationists and state curriculums as they simultaneously cheer on Congress ordering the science bureaucracy to actively begin managing the sex distribution of academic science.  I strongly suggest those who think favorably of the idea of government by scientific technocracy, or worse yet, genuinely believe that science can define morality, to consider the implications of taking their opinions seriously, let alone govern.</p><p>No doubt they will end up blaming the decline of American science on America’s excess religiosity.  As we have seen again and again and again, history and temporal order is mystery to them.</p></div>",
  "content_text": "Needless to say, all of the Pharyngularons will believe\nthe application of Title X to academic science\nis a great idea right up to the moment that their program is slashed due to disproportional representation or they are denied a job or a slot in a PhD program on the basis of their incorrect race or sex.  And then, all the wailing and the gnashing of teeth will be a sweet, sweet sound indeed.\nSection 201(a) of such Act (15 U.S.C. 5521(a)) is amended—\n“(2) the National Science Foundation shall use its existing programs, in collaboration with other agencies, as appropriate, to improve the teaching and learning of networking and information technology at all levels of education and to increase participation in networking and information technology fields, including by women and underrepresented minorities;’’.\nThe amusing thing is that despite hundreds of male athletic programs being cut in favor of hapless juggling and basket-weaving teams that can’t get enough women to participate even when offered full scholarships, scientists and science fetishists alike can’t foresee the obvious result of this Congressional action.  If the pattern holds, and given that women are even less interested in science than they are in sports, it will probably even stronger, then up to three times as many male positions will be cut as female positions are added.  Consider what has happened in the recent past.\n“It is clear that women’s sports are growing at the expense of male sports.   From 1992 to 1997 approximately 5,800 female athletes have been added to sports teams.  During that same period over 20,000 male athletes were cut (Hoornstra 2002).”\nLest you wonder why I harbor such complete contempt for the intelligence and logical capacity of scientists, note that many of them continue worrying about the hypothetically negative effects on science supposedly caused by creationists and state curriculums as they simultaneously cheer on Congress ordering the science bureaucracy to actively begin managing the sex distribution of academic science.  I strongly suggest those who think favorably of the idea of government by scientific technocracy, or worse yet, genuinely believe that science can define morality, to consider the implications of taking their opinions seriously, let alone govern.\nNo doubt they will end up blaming the decline of American science on America’s excess religiosity.  As we have seen again and again and again, history and temporal order is mystery to them.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-08T16:15:00+00:00"
}