{
  "url": "https://voxday.net/2010/06/22/fire-mcchrysta/",
  "scraped_at": "2026-01-08T23:30:03.791385",
  "title": "Fire McChrystal",
  "date_display": "June 22, 2010",
  "date_iso": "2010-06-22T17:10:00+00:00",
  "date_from_url": "2010-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Then bring the troops home.  Does <a href=\"http://www.washingtonexaminer.com/opinion/blogs/beltway-confidential/mcchrystals-real-offense-96873364.html\">this report</a> give you any reason to believe that the US military is on the verge of achieving victory?</p><blockquote><p>But the bigger problem with McChrystal’s leadership has always been the general’s devotion to unreasonably restrictive rules of engagement that are resulting in the unnecessary deaths of American and coalition forces.  We have had many, many accounts of the rules endangering Americans, and the Rolling Stone article provides more evidence.  In the story, a soldier at Combat Outpost JFM who had earlier met with McChrystal was killed in a house that American officers had asked permission to destroy.</p></blockquote><p>McChrystal’s devotion to restrictive rules of engagement isn’t totally ridiculous; the Coalition is an army of occupation, not conquest, after all.  But, the fact is that Afghanistan isn’t going to be pacified by the mere presence of 100,000 troops over a period of ten years; the incompetence of the US strategy is exhibited by the fact that America’s military leaders <i>had to already know that going in.</i></p><p>If McChrystal wasn’t, like most of the US military’s general class, a politician at heart, he would have resigned, not whined about his Commander-in-Chief to a magazine.  Obama does not personally merit respect, but no soldier who fails to respect the chain of command should be permitted to retain his command unless he has some very, very good reasons for not doing so.</p><p>UPDATE – Looks like Gen. McChrystal did the honorable thing.</p><p><i>According to an unnamed source ‘Gen. McChrystal has submitted his resignation’ – Joe Klein on Rick Sanchez, CNN…</i></p></div>",
  "content_text": "Then bring the troops home.  Does\nthis report\ngive you any reason to believe that the US military is on the verge of achieving victory?\nBut the bigger problem with McChrystal’s leadership has always been the general’s devotion to unreasonably restrictive rules of engagement that are resulting in the unnecessary deaths of American and coalition forces.  We have had many, many accounts of the rules endangering Americans, and the Rolling Stone article provides more evidence.  In the story, a soldier at Combat Outpost JFM who had earlier met with McChrystal was killed in a house that American officers had asked permission to destroy.\nMcChrystal’s devotion to restrictive rules of engagement isn’t totally ridiculous; the Coalition is an army of occupation, not conquest, after all.  But, the fact is that Afghanistan isn’t going to be pacified by the mere presence of 100,000 troops over a period of ten years; the incompetence of the US strategy is exhibited by the fact that America’s military leaders\nhad to already know that going in.\nIf McChrystal wasn’t, like most of the US military’s general class, a politician at heart, he would have resigned, not whined about his Commander-in-Chief to a magazine.  Obama does not personally merit respect, but no soldier who fails to respect the chain of command should be permitted to retain his command unless he has some very, very good reasons for not doing so.\nUPDATE – Looks like Gen. McChrystal did the honorable thing.\nAccording to an unnamed source ‘Gen. McChrystal has submitted his resignation’ – Joe Klein on Rick Sanchez, CNN…",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-22T16:10:00+00:00"
}