{
  "url": "https://voxday.net/2010/06/26/hypergamy-trumps-ideology/",
  "scraped_at": "2026-01-08T23:30:25.880166",
  "title": "Hypergamy trumps ideology",
  "date_display": "June 26, 2010",
  "date_iso": "2010-06-26T09:19:00+00:00",
  "date_from_url": "2010-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even stark raving feminists go on the hunt for gamma providers… once they begin to feel their looks starting to fade.  The perceptive observer will note the Game-predicted pattern at work in Jessica Wakeman’s unexpected <a href=\"http://www.thefrisky.com/post/246-cash-coupling-why-marrying-for-money-isnt-a-totally-bad-idea/\">feminist defense of gold-digging</a>:</p><blockquote><p>Take me, for instance. I’m afraid I’m going to get tarred and feathered as a “bad feminist” for admitting this, but yeah, I do want to marry someone who can financially support both me and our kids….  Right now, I rent an apartment with my boyfriend and a roommate, but personally, I’m still living at the edge of my own means as it is. I don’t make a lot of money as a journalist, I owe lots of money to student loans and unless my future husband or I had a great job prospect someplace else, I don’t want to live very far outside New York City, because that’s where the media capital of the world is right now.</p><p>Maybe this isn’t “feminist,” but logically, I need to marry a guy who makes more money than I do—preferably a lot more money than I do—for us to be able to afford what I want and I hope he will want, too. An apartment big enough for kids, prenatal care, doctors appointments, birthday presents, vacations, summer camp, college, their own car, all that stuff. I know parents can raise children well on much less. But personally, that’s not the lifestyle I grew up with. I want to be able to give my children everything I had—maybe a little less, maybe a little more—because I think my parents did a great job.</p><p>I also would immediately disqualify entering into a sharing-bank-accounts relationship with a man who proved to be irresponsible with his cash. College loan debt is fine (I’ve got it) and a reasonable balance on the credit card debt is understandable (I’ve got that, too). But I couldn’t wrap up my life or my children’s lives around someone who spent or managed money irresponsibly.</p></blockquote><p>So, the woman is <i>living with her current boyfriend</i> while simultaneously seeking some unwitting gamma who will completely fail to see that his only attraction for her is to pay her bills… and of course, her debts.  This fits the classic pattern wherein a woman devotes her prime years to “having fun”, which translates as having as much sex as possible with alphas and unemployed artists while ignoring the nice deltas and gammas who helplessly offer her the promise of a stable relationship.</p><p>Then, once the daunting specter of THIRTY looms on the horizion, she begins to lower her sights and transform her attentions to the provider class of men further down the socio-sexual hierarchy.  And this is why most married sex lives will tend to dry up after a year or two; the woman is no longer required to fake her level of sexual interest in the benefit of the hapless provider and there is nothing he can do about it since she has the full force of the feminized law at her disposal.</p><p>This is why it is a very risky and probably foolish endeavor for men to marry women over the age of 25.  Even an extended “try before you buy” approach is unlikely to improve your odds, as observation suggests that desperation and/or determination to entrap a provider causes women to present a false sexual front for an extended period of time.  And worse, over time her hypergamous nature is going to rise to the forefront and cause her to return to her “happiness-seeking” (read: alpha-seeking) habits.</p><p>There are two ways to address the situation.  One is to marry a genuinely religious or submissive woman, as she will have a strong inherent resistance to her hypergamous instincts.  Remember, instinct is merely an <i>influence</i>, it is not a controlling factor.  The second, of course, is to not marry at all.  But whatever you do, do not even speculate about the possibility of considering the thought of marrying an aging, debt-laden feminist who is scouting about for a long-term delta provider following an extended ride on the thugacious carousel.</p></div>",
  "content_text": "Even stark raving feminists go on the hunt for gamma providers… once they begin to feel their looks starting to fade.  The perceptive observer will note the Game-predicted pattern at work in Jessica Wakeman’s unexpected\nfeminist defense of gold-digging\n:\nTake me, for instance. I’m afraid I’m going to get tarred and feathered as a “bad feminist” for admitting this, but yeah, I do want to marry someone who can financially support both me and our kids….  Right now, I rent an apartment with my boyfriend and a roommate, but personally, I’m still living at the edge of my own means as it is. I don’t make a lot of money as a journalist, I owe lots of money to student loans and unless my future husband or I had a great job prospect someplace else, I don’t want to live very far outside New York City, because that’s where the media capital of the world is right now.\nMaybe this isn’t “feminist,” but logically, I need to marry a guy who makes more money than I do—preferably a lot more money than I do—for us to be able to afford what I want and I hope he will want, too. An apartment big enough for kids, prenatal care, doctors appointments, birthday presents, vacations, summer camp, college, their own car, all that stuff. I know parents can raise children well on much less. But personally, that’s not the lifestyle I grew up with. I want to be able to give my children everything I had—maybe a little less, maybe a little more—because I think my parents did a great job.\nI also would immediately disqualify entering into a sharing-bank-accounts relationship with a man who proved to be irresponsible with his cash. College loan debt is fine (I’ve got it) and a reasonable balance on the credit card debt is understandable (I’ve got that, too). But I couldn’t wrap up my life or my children’s lives around someone who spent or managed money irresponsibly.\nSo, the woman is\nliving with her current boyfriend\nwhile simultaneously seeking some unwitting gamma who will completely fail to see that his only attraction for her is to pay her bills… and of course, her debts.  This fits the classic pattern wherein a woman devotes her prime years to “having fun”, which translates as having as much sex as possible with alphas and unemployed artists while ignoring the nice deltas and gammas who helplessly offer her the promise of a stable relationship.\nThen, once the daunting specter of THIRTY looms on the horizion, she begins to lower her sights and transform her attentions to the provider class of men further down the socio-sexual hierarchy.  And this is why most married sex lives will tend to dry up after a year or two; the woman is no longer required to fake her level of sexual interest in the benefit of the hapless provider and there is nothing he can do about it since she has the full force of the feminized law at her disposal.\nThis is why it is a very risky and probably foolish endeavor for men to marry women over the age of 25.  Even an extended “try before you buy” approach is unlikely to improve your odds, as observation suggests that desperation and/or determination to entrap a provider causes women to present a false sexual front for an extended period of time.  And worse, over time her hypergamous nature is going to rise to the forefront and cause her to return to her “happiness-seeking” (read: alpha-seeking) habits.\nThere are two ways to address the situation.  One is to marry a genuinely religious or submissive woman, as she will have a strong inherent resistance to her hypergamous instincts.  Remember, instinct is merely an\ninfluence\n, it is not a controlling factor.  The second, of course, is to not marry at all.  But whatever you do, do not even speculate about the possibility of considering the thought of marrying an aging, debt-laden feminist who is scouting about for a long-term delta provider following an extended ride on the thugacious carousel.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-26T08:19:00+00:00"
}