{
  "url": "https://voxday.net/2010/06/13/i-got-your-recovery-right-here/",
  "scraped_at": "2026-01-08T23:29:19.693761",
  "title": "I got your “recovery” right here",
  "date_display": "June 13, 2010",
  "date_iso": "2010-06-13T15:33:00+00:00",
  "date_from_url": "2010-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/TBT3u38jJMI/AAAAAAAAAMI/CbxL_TbvjZs/s1600/Debt-sector-Q110.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"247\" src=\"http://www.milobookclub.com/wp-content/uploads/2010/06/Debt-sector-Q110.png\" width=\"400\"/></a></div><p> The Federal Reserve Z1 report came out on Friday and the only surprise was that the decline in Household debt has not kept pace with the decline in Financial debt.  However, the pattern to which I alerted you in RGD has continued; Federal debt has grown an astounding 48% since Q2 2008 while overall debt has fallen by 0.6%.  Since G (government spending) is a primary component of GDP, this proves that there is no private economic growth, there is only a massive amount of government borrowing and spending being used to temporarily prop up the economy. </p><p>Note to inflationistas.  Remember that the formal M2 money supply is only $8 trillion, so the central bank manages about 13% of the debt+M2 money supply in the US debt-money system.  Even with the refusal to recognize tens of thousands of home mortgage defaults, (which is why household sector debt hasn’t declined as much as one would expect), private sector debt has fallen $2.5 trillion.  As Robert Prechter has explained, debt is deflating faster than the  central bank and federal government can inflate.  This is exactly the process described in RGD as the Great Depression 2.0 scenario.</p><p>A few notes.  First, notice that the 2010 Q1 decline in financial sector debt is HUGE.  At -4.4%, it’s more than TWICE the -2.15% average quarterly decline since the sector debt growth turned negative in Q1 2009.  Second, this is even bigger when you realize that 2%+ quarterly debt growth was normal for <i>decades</i>.  Second, the rate of federal debt expansion is slowing.  It was only 6% in the previous quarter, down from nearly 10% the second half of 2008.  As I have repeatedly written, the federal strategy of replacing private debt with public can only work in the very short term; 6% of $8 trillion is less than 4% of $15 trillion.  Third, the WSJ reported last week that the relatively small 1.75% cumulative decline in household debt is ENTIRELY the result of debt defaults, not reductions in the level of debt.  So, we can expect the -0.44% average quarterly decline in that sector to shrink faster in the coming quarters.  Fourth, the inability of state and local governments to even maintain their debt levels at their 2% pre-2008 norm is what prompted <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2010/06/12/AR2010061204152.html\">Obama’s call to provide $50 billion to them</a> today.  So, federal debt isn’t merely supposed to cover the decline in financial and household sector debt, but now has to make up for the lack of growth in state and local government debt too.</p><p>Needless to say, it simply is not going to work.  My guess is that the public perception of the Great Depression 2.0 will take effect when household sector debt declines by more than 2% per quarter.  RGD readers will remember that I expect this to take place in Q4 2010.</p></div>",
  "content_text": "The Federal Reserve Z1 report came out on Friday and the only surprise was that the decline in Household debt has not kept pace with the decline in Financial debt.  However, the pattern to which I alerted you in RGD has continued; Federal debt has grown an astounding 48% since Q2 2008 while overall debt has fallen by 0.6%.  Since G (government spending) is a primary component of GDP, this proves that there is no private economic growth, there is only a massive amount of government borrowing and spending being used to temporarily prop up the economy.\nNote to inflationistas.  Remember that the formal M2 money supply is only $8 trillion, so the central bank manages about 13% of the debt+M2 money supply in the US debt-money system.  Even with the refusal to recognize tens of thousands of home mortgage defaults, (which is why household sector debt hasn’t declined as much as one would expect), private sector debt has fallen $2.5 trillion.  As Robert Prechter has explained, debt is deflating faster than the  central bank and federal government can inflate.  This is exactly the process described in RGD as the Great Depression 2.0 scenario.\nA few notes.  First, notice that the 2010 Q1 decline in financial sector debt is HUGE.  At -4.4%, it’s more than TWICE the -2.15% average quarterly decline since the sector debt growth turned negative in Q1 2009.  Second, this is even bigger when you realize that 2%+ quarterly debt growth was normal for\ndecades\n.  Second, the rate of federal debt expansion is slowing.  It was only 6% in the previous quarter, down from nearly 10% the second half of 2008.  As I have repeatedly written, the federal strategy of replacing private debt with public can only work in the very short term; 6% of $8 trillion is less than 4% of $15 trillion.  Third, the WSJ reported last week that the relatively small 1.75% cumulative decline in household debt is ENTIRELY the result of debt defaults, not reductions in the level of debt.  So, we can expect the -0.44% average quarterly decline in that sector to shrink faster in the coming quarters.  Fourth, the inability of state and local governments to even maintain their debt levels at their 2% pre-2008 norm is what prompted\nObama’s call to provide $50 billion to them\ntoday.  So, federal debt isn’t merely supposed to cover the decline in financial and household sector debt, but now has to make up for the lack of growth in state and local government debt too.\nNeedless to say, it simply is not going to work.  My guess is that the public perception of the Great Depression 2.0 will take effect when household sector debt declines by more than 2% per quarter.  RGD readers will remember that I expect this to take place in Q4 2010.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-13T14:33:00+00:00"
}