{
  "url": "https://voxday.net/2010/06/04/inexcusable-omission/",
  "scraped_at": "2026-01-08T23:28:35.674127",
  "title": "An inexcusable omission",
  "date_display": "June 4, 2010",
  "date_iso": "2010-06-04T00:20:00+00:00",
  "date_from_url": "2010-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>By which Catkiller shockingly demonstrates that his knowledge of metal <a href=\"http://www.rightnation.us/forums/index.php?autocom=blog&amp;blogid=7&amp;showentry=4451\">is far from encylopedic</a>:</p><blockquote><p>Seeing as how it’s Memorial Day Weekend, I figured we’d look at the greatest rock songs with a military or martial theme. I debated in my head whether or not to limit the list to only songs with a patriotic bent, but I think that would be too limiting. But if you want to use that as your own personal criterion, don’t let me stop you. So, to be clear, these aren’t the most patriotic rock songs necessarily.</p></blockquote><p>None of them even begin to compare with <a href=\"http://www.youtube.com/watch?v=uSF2i0rU_Q8\">Disturbed’s INDESTRUCTIBLE</a>.  Not for music and not for lyrical content.  It’s not even close.  The solo isn’t flawless like the solos in STRICKEN and OVERBURDENED, but the the basic guitar line is awesome.  And it is unabashedly, unapologetically, pro-American soldier while simultanously casting a somewhat skeptical eye upon “the powers” that send him to war.</p></div>",
  "content_text": "By which Catkiller shockingly demonstrates that his knowledge of metal\nis far from encylopedic\n:\nSeeing as how it’s Memorial Day Weekend, I figured we’d look at the greatest rock songs with a military or martial theme. I debated in my head whether or not to limit the list to only songs with a patriotic bent, but I think that would be too limiting. But if you want to use that as your own personal criterion, don’t let me stop you. So, to be clear, these aren’t the most patriotic rock songs necessarily.\nNone of them even begin to compare with\nDisturbed’s INDESTRUCTIBLE\n.  Not for music and not for lyrical content.  It’s not even close.  The solo isn’t flawless like the solos in STRICKEN and OVERBURDENED, but the the basic guitar line is awesome.  And it is unabashedly, unapologetically, pro-American soldier while simultanously casting a somewhat skeptical eye upon “the powers” that send him to war.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-03T23:20:00+00:00"
}