{
  "url": "https://voxday.net/2010/06/28/krugman-concedes-only-one-year-late/",
  "scraped_at": "2026-01-08T23:30:36.790324",
  "title": "One year on, Krugman concedes",
  "date_display": "June 28, 2010",
  "date_iso": "2010-06-28T13:20:00+00:00",
  "date_from_url": "2010-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“Due to the sizeable bear market rally that began in March 2009, many, if not most, economic observers are presently convinced that the global economic difficulties of last autumn are largely behind us now, courtesy of the aggressive, expansionary actions of the monetary and political authorities.  They are wrong. It is not over. It has only begun. I believe that what we have witnessed to date is merely the first act in what will eventually be recognized as another Great Depression.”<br> – Vox Day, <a href=\"http://www.amazon.com/Return-Great-Depression-ebook/dp/B002XDPV2Y/ref=tmm_kin_title_0?ie=UTF8&amp;m=APZETQFSWU1YM\">The Return of the Great Depression</a>, June 29, 2009</br></p><p>“We are now, I fear, in the early stages of a third depression. It will probably look more like the Long Depression than the much more severe Great Depression. But the cost — to the world economy and, above all, to the millions of lives blighted by the absence of jobs — will nonetheless be immense.”<br> – Paul Krugman, <a href=\"http://www.nytimes.com/2010/06/28/opinion/28krugman.html?hp\">The Third Depression</a>, June 28, 2010</br></p><p>It looks like my predictions are running a little ahead of schedule again.  RGD readers will recall that I didn’t have the mainstream economists starting to whisper about the possibility of a Great Depression 2.0 until the end of 2010.  This is supposed to be the time for talking Double-Dip and W-shaped Recovery.  But then, Krugman has always been rather more dyspeptic than the rest of his colleagues.  I await with interest for all of those who said that my forecast was incorrect because I dared to contradict a FAMOUS ACADEMIC and NOBEL-PRIZE WINNER to explain this mysterious failure of credentialism.</p><p>Krugman is wrong about the historical use of the term depression, of course, (depression was synonymous with recession until after the Great Depression ended), just as he is wrong about the reason the global economy is sliding further into contraction.  Fame and credentials are no substitute for the knowledge of history combined with a reliable theoretical model.  Longtime readers who are investors may recall that my 2002 recommendation to buy gold and avoid real estate has worked out just a little better than Krugman’s 2002 recommendation to buy real estate and avoid gold.</p></div>",
  "content_text": "“Due to the sizeable bear market rally that began in March 2009, many, if not most, economic observers are presently convinced that the global economic difficulties of last autumn are largely behind us now, courtesy of the aggressive, expansionary actions of the monetary and political authorities.  They are wrong. It is not over. It has only begun. I believe that what we have witnessed to date is merely the first act in what will eventually be recognized as another Great Depression.”\n– Vox Day,\nThe Return of the Great Depression\n, June 29, 2009\n“We are now, I fear, in the early stages of a third depression. It will probably look more like the Long Depression than the much more severe Great Depression. But the cost — to the world economy and, above all, to the millions of lives blighted by the absence of jobs — will nonetheless be immense.”\n– Paul Krugman,\nThe Third Depression\n, June 28, 2010\nIt looks like my predictions are running a little ahead of schedule again.  RGD readers will recall that I didn’t have the mainstream economists starting to whisper about the possibility of a Great Depression 2.0 until the end of 2010.  This is supposed to be the time for talking Double-Dip and W-shaped Recovery.  But then, Krugman has always been rather more dyspeptic than the rest of his colleagues.  I await with interest for all of those who said that my forecast was incorrect because I dared to contradict a FAMOUS ACADEMIC and NOBEL-PRIZE WINNER to explain this mysterious failure of credentialism.\nKrugman is wrong about the historical use of the term depression, of course, (depression was synonymous with recession until after the Great Depression ended), just as he is wrong about the reason the global economy is sliding further into contraction.  Fame and credentials are no substitute for the knowledge of history combined with a reliable theoretical model.  Longtime readers who are investors may recall that my 2002 recommendation to buy gold and avoid real estate has worked out just a little better than Krugman’s 2002 recommendation to buy real estate and avoid gold.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-28T12:20:00+00:00"
}