{
  "url": "https://voxday.net/2010/06/25/lessons-from-greek-history/",
  "scraped_at": "2026-01-08T23:30:20.346117",
  "title": "Lessons from Greek history",
  "date_display": "June 25, 2010",
  "date_iso": "2010-06-25T13:15:00+00:00",
  "date_from_url": "2010-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is neither the first nor fourth time that Greece has faced a serious default situation.  But, <a href=\"http://mpettis.com/2010/06/what-might-history-tell-us-about-the-greek-crisis/\">as Michael Pettis of China Financial Markets explains</a>, because so many different things have happened before, the question is less whether history will prove a guide to the future, but rather which historical example will prove to be the relevant one:</p><blockquote><p>The economic recovery in the countries hit by crisis will not begin until they are recognized as insolvent and receive debt forgiveness from their creditors.  Preceding every sovereign default is the fiction that the creditor country is simply facing a short-term financing problem, and that with a lot of discipline and a little bit of good will it will be able to work its way out of the crisis.  During this period a number of restructuring “solutions” are proposed – all of which involve increasing debt, and often in the most financially destabilising way – which inevitably make the final resolution of the crisis much more difficult and which sharply raise financial distress costs.  The most notorious recent example of these terrible “solutions” was Argentina’s disastrous debt swap in 2001, in which it dramatically increased the country’s total obligations while it desperately tried to maintain the fiction that it could somehow grow its way out of its impossible debt burden.</p><p>Greece, and probably two or three other countries, simply cannot repay their outstanding debt amounts.  Ultimately they are going to default, and then in the restructuring process they will receive enough debt forgiveness that allows them to return to a sound footing and with a reasonable repayment prospect.  But as long as they maintain the pretence that they can and will repay the full outstanding amount, and struggle with the burden, the resulting distortions in the economy will mean that businesses will disinvest and the country will not grow.</p><p>Historical precedence makes it clear that as long as the sovereign borrower is forced to struggle with an unrepayable debt burden, it will not grow.  Eventually, as has happened in nearly every previous case, creditors and borrowers will acknowledge reality and will work out a debt forgiveness plan that will allow the economy to return to growth.  Until then, expect weak growth, high unemployment, and constant battles over debt.</p></blockquote><p>Although most US-based economists are convinced that the special status of the dollar somehow renders the USA impervious to economic laws, the danger of US debt default is nearly as great as it is in Europe.  The fact that the defaults are likely to begin in the next two years with the state and local governments does not mean that they are going to end there.  However, a partial default would be much more likely than a general one, with the USA defaulting on the third of its debt that is presently held by China coming as a prelude to war between the waning superpower and its self-appointed would-be successor.</p><p>Major economic and historical transition points are almost always accompanied by large-scale war.  I see no reason to believe that this will not be the case again in this repetition of the cycle.</p></div>",
  "content_text": "This is neither the first nor fourth time that Greece has faced a serious default situation.  But,\nas Michael Pettis of China Financial Markets explains\n, because so many different things have happened before, the question is less whether history will prove a guide to the future, but rather which historical example will prove to be the relevant one:\nThe economic recovery in the countries hit by crisis will not begin until they are recognized as insolvent and receive debt forgiveness from their creditors.  Preceding every sovereign default is the fiction that the creditor country is simply facing a short-term financing problem, and that with a lot of discipline and a little bit of good will it will be able to work its way out of the crisis.  During this period a number of restructuring “solutions” are proposed – all of which involve increasing debt, and often in the most financially destabilising way – which inevitably make the final resolution of the crisis much more difficult and which sharply raise financial distress costs.  The most notorious recent example of these terrible “solutions” was Argentina’s disastrous debt swap in 2001, in which it dramatically increased the country’s total obligations while it desperately tried to maintain the fiction that it could somehow grow its way out of its impossible debt burden.\nGreece, and probably two or three other countries, simply cannot repay their outstanding debt amounts.  Ultimately they are going to default, and then in the restructuring process they will receive enough debt forgiveness that allows them to return to a sound footing and with a reasonable repayment prospect.  But as long as they maintain the pretence that they can and will repay the full outstanding amount, and struggle with the burden, the resulting distortions in the economy will mean that businesses will disinvest and the country will not grow.\nHistorical precedence makes it clear that as long as the sovereign borrower is forced to struggle with an unrepayable debt burden, it will not grow.  Eventually, as has happened in nearly every previous case, creditors and borrowers will acknowledge reality and will work out a debt forgiveness plan that will allow the economy to return to growth.  Until then, expect weak growth, high unemployment, and constant battles over debt.\nAlthough most US-based economists are convinced that the special status of the dollar somehow renders the USA impervious to economic laws, the danger of US debt default is nearly as great as it is in Europe.  The fact that the defaults are likely to begin in the next two years with the state and local governments does not mean that they are going to end there.  However, a partial default would be much more likely than a general one, with the USA defaulting on the third of its debt that is presently held by China coming as a prelude to war between the waning superpower and its self-appointed would-be successor.\nMajor economic and historical transition points are almost always accompanied by large-scale war.  I see no reason to believe that this will not be the case again in this repetition of the cycle.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-25T12:15:00+00:00"
}