{
  "url": "https://voxday.net/2010/06/29/mailvox-and-yet-they-wonder/",
  "scraped_at": "2026-01-08T23:30:44.176389",
  "title": "Mailvox: And yet they wonder….",
  "date_display": "June 29, 2010",
  "date_iso": "2010-06-29T17:15:00+00:00",
  "date_from_url": "2010-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JH writes what I am apparently supposed to regard as what passes for a rebuttal to yesterday’s WND column.  The amazing thing is that there will be people who genuinely regard this as not only a coherent reply, but a decisive one:</p><blockquote><p>If men are so much more moral than women, why is it that 96% of the people in jail in the U.S. are male?  And are you really suggesting that men self-sacrifice more than women?  Have you ever known a mother?  One last thing:  when I was in the 5th grade, my teacher informed me that “boys are just smarter at math” and that was the reason there were only boys in the accelerated math group in my class.  There was no testing – that would’ve been too fair – she had just picked 3 boys that she thought were “smart at math.”  All of us have to deal with bad attitudes in our lives at some time; it’s not just boys.  Did someone just break up with you?</p></blockquote><p>First, I never claimed that men are more moral than women.  Second, even if I had, JH is confusing legality with morality.  Yes, I really do believe that men are more self-sacrificing than women; how many female Medal of Honor winners are there?  How many women have ever been known to act by the motto “men and children first”?  It pains me to have to point out the obvious, but most women who are mothers <i>very much want to be mothers</i>.  Self-sacrifice is about sacrificing your desires, not fulfilling them, and it is no more inherently self-sacrificing for the average woman to be a mother than it is for the average man who enjoys the clean lines of the unadorned female form to contribute to the college fund of a young, sartorially-challenged woman.</p><p>And since I attempt to make it my habit to answer even the most ridiculous questions, yes, I have been acquainted with the occasional mother.  I did not, as it is often held, spring fully armored from the black helmet of Darth Vader.  But we have to thank JH for not only demonstrating my point about women and logic with her deeply compelling tale of her fifth grade math class which apparently overturns decades of standardized math tests, but also the way in which few women are capable of considering an issue without making it personal.  But no, no one broke up with me, I am not bitter about anything except last season’s NFC championship game, and I am totally indifferent your willingness or unwillingness to perform sexually for me.</p></div>",
  "content_text": "JH writes what I am apparently supposed to regard as what passes for a rebuttal to yesterday’s WND column.  The amazing thing is that there will be people who genuinely regard this as not only a coherent reply, but a decisive one:\nIf men are so much more moral than women, why is it that 96% of the people in jail in the U.S. are male?  And are you really suggesting that men self-sacrifice more than women?  Have you ever known a mother?  One last thing:  when I was in the 5th grade, my teacher informed me that “boys are just smarter at math” and that was the reason there were only boys in the accelerated math group in my class.  There was no testing – that would’ve been too fair – she had just picked 3 boys that she thought were “smart at math.”  All of us have to deal with bad attitudes in our lives at some time; it’s not just boys.  Did someone just break up with you?\nFirst, I never claimed that men are more moral than women.  Second, even if I had, JH is confusing legality with morality.  Yes, I really do believe that men are more self-sacrificing than women; how many female Medal of Honor winners are there?  How many women have ever been known to act by the motto “men and children first”?  It pains me to have to point out the obvious, but most women who are mothers\nvery much want to be mothers\n.  Self-sacrifice is about sacrificing your desires, not fulfilling them, and it is no more inherently self-sacrificing for the average woman to be a mother than it is for the average man who enjoys the clean lines of the unadorned female form to contribute to the college fund of a young, sartorially-challenged woman.\nAnd since I attempt to make it my habit to answer even the most ridiculous questions, yes, I have been acquainted with the occasional mother.  I did not, as it is often held, spring fully armored from the black helmet of Darth Vader.  But we have to thank JH for not only demonstrating my point about women and logic with her deeply compelling tale of her fifth grade math class which apparently overturns decades of standardized math tests, but also the way in which few women are capable of considering an issue without making it personal.  But no, no one broke up with me, I am not bitter about anything except last season’s NFC championship game, and I am totally indifferent your willingness or unwillingness to perform sexually for me.",
  "tags": [
    "mailvox",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-29T16:15:00+00:00"
}