{
  "url": "https://voxday.net/2010/06/30/mailvox-female-counterattack/",
  "scraped_at": "2026-01-08T23:30:47.804833",
  "title": "Mailvox: a female one-two punch",
  "date_display": "June 30, 2010",
  "date_iso": "2010-06-30T11:31:00+00:00",
  "date_from_url": "2010-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AC babbles, as women who are desperate to avoid accurate criticism are wont to do:</p><blockquote><p>Still looking for anyone who has anything good to say about women…(prove me wrong, someone, please!)  What is the most grievous part about this blog? For it being written by a Christian, it does nothing to build up relationships between men and women. It builds men up by destroying the character of women. For someone who writes about the destruction of society, Vox is doing his fair share of it.</p></blockquote><p>This is precisely why so many men find women to be contemptible and do not respect them.  They are CONSTANTLY demanding approval and cannot bear even the slightest criticism.  The merest factual observation is immediately transformed, in the average woman’s fertile imagination, into an unjust prosecution motivated by evil ulterior motives.  Given that the subject is the ongoing female war against men, why on Earth should anyone expect anything good to be said about women in this context?  This absolutely does not mean there is not anything good about women; many women wrote to thank me for <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=55672\">my ode to mothers</a> a few years ago and tell me how it made them cry.  But when Admiral Nimitz was discussing the various weaknesses of the Imperial Japanese Navy with his officers in order to take advantage of them and win the war, I tend to doubt he spent much time praising the snappy Japanese uniforms, the excellent aeronautics of the Mitsubishi Zero, or the Japanese knack for electronics wizardry.</p><p>And it is simply stupid and all too typically female for AC to attempt to turn around my sound demographic, economic, and socio-sexual arguments about the way in which women’s collective and unconscious acceptance of feminist ideology is destroying Western civilization and claiming that I am doing my fair share of destroying society by “destroying the character of women”.  That completely misses the central point!  I am first and foremost observing that modern women have collectively destroyed their own characters and this is to the detriment of society; how can I possibly do to them what they have already done to themselves?</p><p>Women, the point of my criticism is not to make you feel better about yourselves, it is to tell you that you collectively need to change your behavior if you wish to live happy married lives surrounded by children in a reasonably free and wealthy society.  If you’d rather be mounted by a cavalcade of pagan thugs before being abandoned to raise your bastard spawn in grass huts constructed amidst the ruins of a once-great civilization, then by all means feel free to ignore it.  I’m certainly not going to stop you.  But regardless of which fate you prefer, stop whining.  I don’t define reality, I merely observe and comment upon it.</p><p>While MomProf doesn’t grasp the vital point, she is at least wise enough to dip a toe in before leaping to embrace the crocodiles:</p><p><i>I have read VD’s columns for some time now, and I find his economic observations, in particular, to be quite astute.  But this one, I admit, baffles me.</i></p><p>Very well, let’s consider the two primary options here.  Either I have suddenly and uncharacteristically lost my ability to correctly analyze a complex situation, or an intelligent and educated woman is unable to separate her analytical capabilities from her emotions regarding a subject that directly concerns her on multiple levels.  Anyone care to have a whack at factoring the probabilities here?</p><p><i>I share Vox’s loathing of the feminists’ war on everything male, the feminization of men, and the mockery and marginalization of fatherhood. I despise the Left’s worship of abortion, and their rallying cry that it is the high watermark of ‘femaleness’ to destroy your own children. Any number of social pathologies have spun out of this depravity.  But the answer, at least if I understand the arguments made here, is not to “go back” to a time when women were ignorant and dependent, and to remove the procedural and political protections to ensure that they remain that way.</i></p><p>A very bad start, and not one that bodes well for MomProf’s subsequent arguments.  MomProf is seeking to rule an answer out of bounds, which does nothing more than demonstrate her personal biases.  If we are to take her words seriously – and everyone here knows my position on that – she would prefer mass societal depravity to women being ignorant and dependent.  Of course, most regulars already know what my rebuttal will be – do you SERIOUSLY think they are not ignorant and dependent now?  They have simply traded dependence on their husbands and fathers for dependence upon the federal and state governments; given her profession, MomProf’s own job likely, though not necessarily, renders her at least partially dependent upon government largesse.  I fail to see how this is supposed to be an improvement, even in comparison with MomProf’s mythically dystopian past.</p><p><i>I am afraid I must disagree vehemently with the gender-distinctive personality characteristics Vox ascribes to women and men. Yes, I know plenty of frivolous, shallow, petty and gossipy women. But many women are hard-working, virtuous, rational, intelligent, analytical – and yes, good at math and science (for what that’s worth). Taking away (or relinquishing) the right to vote is no panacea, particularly when our country is filled with ignorant, violent, irresponsible, addicted, and stupid men – and THEY’LL vote?</i></p><p>Great, now she’s revealing an inability to understand statistics in favor of her personal experience of women at the highest levels of education and intelligence.  Yes, many women are virtuous and rational and good at math.  The problem is that a lot more of them are not.  Furthermore, men proven to be violent don’t vote in the USA and all men weren’t supposed to be enfranchised anyhow.  Only the top quintile of men proven to be responsible were originally eligible to vote; I am as opposed to the universal male franchise in a democratic republic as I am to female suffrage.  That being said, no doubt my position on democracy will confound MomProf; I only support universal male and female suffrage in a true and direct democracy.  Does she really believe in the will of the people?  Is she willing to do likewise or are we just quibbling over her hourly price?</p><p><i>Just as some women will tend to take advantage of a system that affords them freedom by exploiting it, so men will (and have for millennia) tend to take advantage of a system that affords the women in their lives little freedom. There is far too much proof to believe otherwise.</i></p><p>Yes, that’s precisely why women can’t be permitted to vote in a democratic republic.  They are ALWAYS the core of the electorate that gravitates first to the Napoleons, the Mussolinis, the Hitlers, and the Obamas.  The point is that women are always going to give their rights away to someone, hence the need to restrict suffrage in order to prevent them from giving away their freedom, and everyone else’s, to the sweet-talking monsters for whom history shows they inevitably fall.</p><p><i>The problems in our society are not caused by more freedom, more political power, or more access to education. The problem is the corruption of the educational system, the complete ignorance of the political structures that hold liberty in place, and a culture of licentiousness and complete abdication of personal responsibility.</i></p><p>She’s wrong because she doesn’t grasp the connection.  The latter stems from the former.</p><p><i>All of this blather about “I’d give up my right to vote,” from certain women (who, I hope, are speaking hyperbolically) is nonsense. Will you give up your right to own and inherit property, too? Your right to attend school? Your right to defend yourself in a court of law? Your right to shield yourself and your children from an abusive spouse? (And please, spare me any claims that men are more abusive because they’re angry at our feminized society.) Why not just don the burqa and be done with it?</i></p><p>It is neither blather nor hyperbole.  Sweet Darwin, but it never ceases to amaze me how incredibly stupid people who attempt to use the childish “well, how would YOU feel?” argument against either Spacebunny or me are.  What obvious consequence  of “we left the bloody country more than a decade ago” do you not grasp?  Do foreigners vote in the USA?  It is patently obvious that neither of us give a damn about our personal “right to vote”.  And anyone capable of doing math would understand that any rational, freedom-loving woman should be enthusiastic about giving up her right to vote so long as the portion of the population that invariably inclines towards fascism of one sort or another was likewise disenfranchised.  And it is grotesquely ignorant to claim that the female right to vote is connected in any way to the female right to inherit property or attend school, given that women were doing both long before 1920.  MomProf simply doesn’t understand that the path she is defending is the direct route to the burqah she fears.  Unless a woman is young and pretty, of course, in which case it is the brothel for the first few years.</p><p><i>Our country will not strengthen until its citizens begin to make choices in their personal lives that reflect fiscal responsibility, self-discipline, sexual restraint, the delay of gratification, a willingness to sacrifice for spouse and children – in short when our adults begin to behave like ADULTS and not like spoiled adolescents. But they must do these things because they WISH to, not because they HAVE to.  I don’t know how anyone who calls himself (or herself) a “libertarian” can claim otherwise.</i></p><p>MomProf doesn’t understand the difference between libertarian and libertine.  A common error.</p><p><i>Feminists love to shriek that if conservatives had their way, women would be forced back into lives of ignorance, dependence, and submission. I have always accused them of ridiculous, unwarranted hysteria. Speaking as a conservative (and a wife, and a mother of two children, and a professor of entrepreneurship), reading these posts, now I am not so sure.</i></p><p>I’m not a conservative, so this meandering has nothing to do with me.  But ironically, as I have pointed out on numerous occasions, it is the feminist ideology that has infected the majority of Western women that will ensure the women of the future are forced into lives of greater ignorance, greater dependence, and far more ignominious submission than they have known in the last 400 years in the West.</p></div>",
  "content_text": "AC babbles, as women who are desperate to avoid accurate criticism are wont to do:\nStill looking for anyone who has anything good to say about women…(prove me wrong, someone, please!)  What is the most grievous part about this blog? For it being written by a Christian, it does nothing to build up relationships between men and women. It builds men up by destroying the character of women. For someone who writes about the destruction of society, Vox is doing his fair share of it.\nThis is precisely why so many men find women to be contemptible and do not respect them.  They are CONSTANTLY demanding approval and cannot bear even the slightest criticism.  The merest factual observation is immediately transformed, in the average woman’s fertile imagination, into an unjust prosecution motivated by evil ulterior motives.  Given that the subject is the ongoing female war against men, why on Earth should anyone expect anything good to be said about women in this context?  This absolutely does not mean there is not anything good about women; many women wrote to thank me for\nmy ode to mothers\na few years ago and tell me how it made them cry.  But when Admiral Nimitz was discussing the various weaknesses of the Imperial Japanese Navy with his officers in order to take advantage of them and win the war, I tend to doubt he spent much time praising the snappy Japanese uniforms, the excellent aeronautics of the Mitsubishi Zero, or the Japanese knack for electronics wizardry.\nAnd it is simply stupid and all too typically female for AC to attempt to turn around my sound demographic, economic, and socio-sexual arguments about the way in which women’s collective and unconscious acceptance of feminist ideology is destroying Western civilization and claiming that I am doing my fair share of destroying society by “destroying the character of women”.  That completely misses the central point!  I am first and foremost observing that modern women have collectively destroyed their own characters and this is to the detriment of society; how can I possibly do to them what they have already done to themselves?\nWomen, the point of my criticism is not to make you feel better about yourselves, it is to tell you that you collectively need to change your behavior if you wish to live happy married lives surrounded by children in a reasonably free and wealthy society.  If you’d rather be mounted by a cavalcade of pagan thugs before being abandoned to raise your bastard spawn in grass huts constructed amidst the ruins of a once-great civilization, then by all means feel free to ignore it.  I’m certainly not going to stop you.  But regardless of which fate you prefer, stop whining.  I don’t define reality, I merely observe and comment upon it.\nWhile MomProf doesn’t grasp the vital point, she is at least wise enough to dip a toe in before leaping to embrace the crocodiles:\nI have read VD’s columns for some time now, and I find his economic observations, in particular, to be quite astute.  But this one, I admit, baffles me.\nVery well, let’s consider the two primary options here.  Either I have suddenly and uncharacteristically lost my ability to correctly analyze a complex situation, or an intelligent and educated woman is unable to separate her analytical capabilities from her emotions regarding a subject that directly concerns her on multiple levels.  Anyone care to have a whack at factoring the probabilities here?\nI share Vox’s loathing of the feminists’ war on everything male, the feminization of men, and the mockery and marginalization of fatherhood. I despise the Left’s worship of abortion, and their rallying cry that it is the high watermark of ‘femaleness’ to destroy your own children. Any number of social pathologies have spun out of this depravity.  But the answer, at least if I understand the arguments made here, is not to “go back” to a time when women were ignorant and dependent, and to remove the procedural and political protections to ensure that they remain that way.\nA very bad start, and not one that bodes well for MomProf’s subsequent arguments.  MomProf is seeking to rule an answer out of bounds, which does nothing more than demonstrate her personal biases.  If we are to take her words seriously – and everyone here knows my position on that – she would prefer mass societal depravity to women being ignorant and dependent.  Of course, most regulars already know what my rebuttal will be – do you SERIOUSLY think they are not ignorant and dependent now?  They have simply traded dependence on their husbands and fathers for dependence upon the federal and state governments; given her profession, MomProf’s own job likely, though not necessarily, renders her at least partially dependent upon government largesse.  I fail to see how this is supposed to be an improvement, even in comparison with MomProf’s mythically dystopian past.\nI am afraid I must disagree vehemently with the gender-distinctive personality characteristics Vox ascribes to women and men. Yes, I know plenty of frivolous, shallow, petty and gossipy women. But many women are hard-working, virtuous, rational, intelligent, analytical – and yes, good at math and science (for what that’s worth). Taking away (or relinquishing) the right to vote is no panacea, particularly when our country is filled with ignorant, violent, irresponsible, addicted, and stupid men – and THEY’LL vote?\nGreat, now she’s revealing an inability to understand statistics in favor of her personal experience of women at the highest levels of education and intelligence.  Yes, many women are virtuous and rational and good at math.  The problem is that a lot more of them are not.  Furthermore, men proven to be violent don’t vote in the USA and all men weren’t supposed to be enfranchised anyhow.  Only the top quintile of men proven to be responsible were originally eligible to vote; I am as opposed to the universal male franchise in a democratic republic as I am to female suffrage.  That being said, no doubt my position on democracy will confound MomProf; I only support universal male and female suffrage in a true and direct democracy.  Does she really believe in the will of the people?  Is she willing to do likewise or are we just quibbling over her hourly price?\nJust as some women will tend to take advantage of a system that affords them freedom by exploiting it, so men will (and have for millennia) tend to take advantage of a system that affords the women in their lives little freedom. There is far too much proof to believe otherwise.\nYes, that’s precisely why women can’t be permitted to vote in a democratic republic.  They are ALWAYS the core of the electorate that gravitates first to the Napoleons, the Mussolinis, the Hitlers, and the Obamas.  The point is that women are always going to give their rights away to someone, hence the need to restrict suffrage in order to prevent them from giving away their freedom, and everyone else’s, to the sweet-talking monsters for whom history shows they inevitably fall.\nThe problems in our society are not caused by more freedom, more political power, or more access to education. The problem is the corruption of the educational system, the complete ignorance of the political structures that hold liberty in place, and a culture of licentiousness and complete abdication of personal responsibility.\nShe’s wrong because she doesn’t grasp the connection.  The latter stems from the former.\nAll of this blather about “I’d give up my right to vote,” from certain women (who, I hope, are speaking hyperbolically) is nonsense. Will you give up your right to own and inherit property, too? Your right to attend school? Your right to defend yourself in a court of law? Your right to shield yourself and your children from an abusive spouse? (And please, spare me any claims that men are more abusive because they’re angry at our feminized society.) Why not just don the burqa and be done with it?\nIt is neither blather nor hyperbole.  Sweet Darwin, but it never ceases to amaze me how incredibly stupid people who attempt to use the childish “well, how would YOU feel?” argument against either Spacebunny or me are.  What obvious consequence  of “we left the bloody country more than a decade ago” do you not grasp?  Do foreigners vote in the USA?  It is patently obvious that neither of us give a damn about our personal “right to vote”.  And anyone capable of doing math would understand that any rational, freedom-loving woman should be enthusiastic about giving up her right to vote so long as the portion of the population that invariably inclines towards fascism of one sort or another was likewise disenfranchised.  And it is grotesquely ignorant to claim that the female right to vote is connected in any way to the female right to inherit property or attend school, given that women were doing both long before 1920.  MomProf simply doesn’t understand that the path she is defending is the direct route to the burqah she fears.  Unless a woman is young and pretty, of course, in which case it is the brothel for the first few years.\nOur country will not strengthen until its citizens begin to make choices in their personal lives that reflect fiscal responsibility, self-discipline, sexual restraint, the delay of gratification, a willingness to sacrifice for spouse and children – in short when our adults begin to behave like ADULTS and not like spoiled adolescents. But they must do these things because they WISH to, not because they HAVE to.  I don’t know how anyone who calls himself (or herself) a “libertarian” can claim otherwise.\nMomProf doesn’t understand the difference between libertarian and libertine.  A common error.\nFeminists love to shriek that if conservatives had their way, women would be forced back into lives of ignorance, dependence, and submission. I have always accused them of ridiculous, unwarranted hysteria. Speaking as a conservative (and a wife, and a mother of two children, and a professor of entrepreneurship), reading these posts, now I am not so sure.\nI’m not a conservative, so this meandering has nothing to do with me.  But ironically, as I have pointed out on numerous occasions, it is the feminist ideology that has infected the majority of Western women that will ensure the women of the future are forced into lives of greater ignorance, greater dependence, and far more ignominious submission than they have known in the last 400 years in the West.",
  "tags": [
    "mailvox",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-30T10:31:00+00:00"
}