{
  "url": "https://voxday.net/2010/06/22/mailvox-exiting-omega/",
  "scraped_at": "2026-01-08T23:30:05.644772",
  "title": "Mailvox: exiting Omega",
  "date_display": "June 22, 2010",
  "date_iso": "2010-06-22T19:15:00+00:00",
  "date_from_url": "2010-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DG wonders how to apply Game in his situation:</p><blockquote><p>I need some help.  I’m very new to Game.  I got started on my little adventure into this after a disaster of nuclear proportions with the last girl I was seeing.  A conversation about masculinity, femininity and the roles men and women play in relationships set me on the journey.</p><p>Quick bit on me – in 2008 I took the “red pill” on the world (not women yet) and started questioning everything.  While we may agree or disagree on points, we share similar outlooks in that much of what is conventional is likely a lie perpetrated for someone’s advantage.  I am a Christian currently, former atheist for 16 years and then agnostic in 2009.  I mention this because my faith and adherence to it affects what I can and cannot do.</p><p>I was a beta in HS, became a lesser alpha in college when my body finally decided to step it up (I was a late bloomer, I dropped 20 pounds of fat, put on about 15 pounds of muscle and grew 4 inches in my freshman year).  Suddenly I was looking attractive and compared to the men at my university, I was golden.  But then when I converted, I decided to be “nice.”  Stupid me!  I should have realized you can be an alpha and not be a douche, but my whole game was asshole game and never realized it until now.  I have two major questions/requests.  I’ll try to keep them short and to the point.</p><p>1) Where do you suggest that someone start if they are a complete newb and need to reverse their beta-tude?  No matter what you are shooting for: STR, LTR, marriage, casual dating/sex, whatever, you need to know Game.</p><p>2) I mentioned the disaster that was the last woman.  As Roissy described in an old post about what to do to win and ex back, everything he said not to do, I did.  Oh yes, and then some.  I went from alpha to omega in this girl’s eyes for sure.  While I have no intentions of winning this girl back (it would take a miracle from God, and I’m not counting on getting one on this issue) or being her friend (I don’t keep female friends anymore, utterly useless), I can’t cut her out entirely from my life.  I still need to deal with her and encounter her…at my church of all places.  How do I deal with her when we are in the same room and when I do actually need to speak with her or work with her?  I may not be able to recover my omega status in her eyes, but I certainly do not wish to feed it.</p></blockquote><p>I think the best way to work one’s way out of beta-tude, or as I would refer to it, gammatude, is to stop judging yourself on the basis of what women think.  Here’s how.  Take a good look at the men around you, the men you know well.  Consider what you think of them, of their strengths and weaknesses.  Then compare your opinion to what women think of them.  Are the results similar in any way, shape or form?  I tend to doubt it.</p><p>The main reason that I could not care less what the female collective happen to think about pretty much everything is the result of the extreme dichotomy between what I thought of the men in my social circle at the time and what women thought of them.  With a few notable exceptions, the men that were most highly regarded and sought after by women were the weak and insecure ones, the shallow, treacherous and useless ones.  Once I could no longer take seriously what they thought about other men, it became impossible to care what they thought about me as well because I no longer considered them capable of judging me in a reasonable manner, whether they thought well of me or not. <i>“In a way, I actually judge her for not breaking up with me sooner.”</i> I have far more confidence in the average dog’s ability to distinguish between a good man and a bad man than the average woman’s and I don’t lose any sleep over what the average dog happens to think of my actions.</p><p>Given DG’s familiarity with Game, he can probably guess what developed as a result.  At the superficial and social level, women respond to genuine contempt like catnip, probably because it is one of the more powerful forms of DHV.  Note that I’m not talking about dislike or hate here, only the same sort of well-merited contempt for a ludicrously irrelevant opinion that <a href=\"http://www.independent.co.uk/news/people/profiles/the-mourinho-years-the-turbulent-reign-of-a-selfstyled-special-one-403077.html\">The Special One</a> would demonstrate for a soccer journalist.</p><p>As for Disaster Girl, the right thing to do also happens to be the polite thing to do.  Don’t live in fear of her and don’t give her a moment’s thought when she’s not around you.  Treat her in an entirely polite and civil manner, keep your conversations short and to the point, and make it very clear that what’s done is done and you have no interest in revisiting the past.  Don’t give her any information about your life, if she asks how you are doing, just reply “very well, thank you,” and change the subject if she gets curious and starts probing.  That will probably get her rationalization hamster spinning on its wheel; there is nothing that piques a girl’s curiosity like a former flame who has inexplicably stopped showing interest in her.</p><p>Then be sure to expect the probable test and don’t fail it by promptly dissolving into desperate gamma mode when she pulls a 180 on you and starts telling you how confused she is and how she thinks she might have made a mistake and so forth.  Just remain perfectly polite, decline to pursue every dangling olive branch she offers, and tell her that you’re ever so pleased that after everything that has happened between the two of you, she’s still such a good friend.  Be a Crimson Artist and flip the script on her.</p><p>Of course, if you really want to get out of the Omega box for good, show up at one -and only one- church event with a very pretty and somewhat inappropriately dressed girl with stripper hair.  Don’t act like she’s your girlfriend or behave obnoxiously, just behave normally and let all the little gossips assume whatever they want to assume.  And when asked about her later, just say “well, it’s kind of complicated” and leave it at that.</p><p>The fact is that Christianity inhibits Game for the obvious reason that Man is fallen.  That’s just a reality that the Christian man has to accept and remind himself that pleasing the world and its women is not his mission on Earth.  But the Bible demands male dominance and female submission too, just in a different form.  Jesus Christ was seldom nice and he did not come to assuage anyone’s feelings but rather to make them feel so abysmally bad that they were willing to repent of their sins. The need to abandon asshole game should never be confused with the duty to assume gamma.  Jesus is, after all the ultimate ALPHA as well as the Omega.</p></div>",
  "content_text": "DG wonders how to apply Game in his situation:\nI need some help.  I’m very new to Game.  I got started on my little adventure into this after a disaster of nuclear proportions with the last girl I was seeing.  A conversation about masculinity, femininity and the roles men and women play in relationships set me on the journey.\nQuick bit on me – in 2008 I took the “red pill” on the world (not women yet) and started questioning everything.  While we may agree or disagree on points, we share similar outlooks in that much of what is conventional is likely a lie perpetrated for someone’s advantage.  I am a Christian currently, former atheist for 16 years and then agnostic in 2009.  I mention this because my faith and adherence to it affects what I can and cannot do.\nI was a beta in HS, became a lesser alpha in college when my body finally decided to step it up (I was a late bloomer, I dropped 20 pounds of fat, put on about 15 pounds of muscle and grew 4 inches in my freshman year).  Suddenly I was looking attractive and compared to the men at my university, I was golden.  But then when I converted, I decided to be “nice.”  Stupid me!  I should have realized you can be an alpha and not be a douche, but my whole game was asshole game and never realized it until now.  I have two major questions/requests.  I’ll try to keep them short and to the point.\n1) Where do you suggest that someone start if they are a complete newb and need to reverse their beta-tude?  No matter what you are shooting for: STR, LTR, marriage, casual dating/sex, whatever, you need to know Game.\n2) I mentioned the disaster that was the last woman.  As Roissy described in an old post about what to do to win and ex back, everything he said not to do, I did.  Oh yes, and then some.  I went from alpha to omega in this girl’s eyes for sure.  While I have no intentions of winning this girl back (it would take a miracle from God, and I’m not counting on getting one on this issue) or being her friend (I don’t keep female friends anymore, utterly useless), I can’t cut her out entirely from my life.  I still need to deal with her and encounter her…at my church of all places.  How do I deal with her when we are in the same room and when I do actually need to speak with her or work with her?  I may not be able to recover my omega status in her eyes, but I certainly do not wish to feed it.\nI think the best way to work one’s way out of beta-tude, or as I would refer to it, gammatude, is to stop judging yourself on the basis of what women think.  Here’s how.  Take a good look at the men around you, the men you know well.  Consider what you think of them, of their strengths and weaknesses.  Then compare your opinion to what women think of them.  Are the results similar in any way, shape or form?  I tend to doubt it.\nThe main reason that I could not care less what the female collective happen to think about pretty much everything is the result of the extreme dichotomy between what I thought of the men in my social circle at the time and what women thought of them.  With a few notable exceptions, the men that were most highly regarded and sought after by women were the weak and insecure ones, the shallow, treacherous and useless ones.  Once I could no longer take seriously what they thought about other men, it became impossible to care what they thought about me as well because I no longer considered them capable of judging me in a reasonable manner, whether they thought well of me or not.\n“In a way, I actually judge her for not breaking up with me sooner.”\nI have far more confidence in the average dog’s ability to distinguish between a good man and a bad man than the average woman’s and I don’t lose any sleep over what the average dog happens to think of my actions.\nGiven DG’s familiarity with Game, he can probably guess what developed as a result.  At the superficial and social level, women respond to genuine contempt like catnip, probably because it is one of the more powerful forms of DHV.  Note that I’m not talking about dislike or hate here, only the same sort of well-merited contempt for a ludicrously irrelevant opinion that\nThe Special One\nwould demonstrate for a soccer journalist.\nAs for Disaster Girl, the right thing to do also happens to be the polite thing to do.  Don’t live in fear of her and don’t give her a moment’s thought when she’s not around you.  Treat her in an entirely polite and civil manner, keep your conversations short and to the point, and make it very clear that what’s done is done and you have no interest in revisiting the past.  Don’t give her any information about your life, if she asks how you are doing, just reply “very well, thank you,” and change the subject if she gets curious and starts probing.  That will probably get her rationalization hamster spinning on its wheel; there is nothing that piques a girl’s curiosity like a former flame who has inexplicably stopped showing interest in her.\nThen be sure to expect the probable test and don’t fail it by promptly dissolving into desperate gamma mode when she pulls a 180 on you and starts telling you how confused she is and how she thinks she might have made a mistake and so forth.  Just remain perfectly polite, decline to pursue every dangling olive branch she offers, and tell her that you’re ever so pleased that after everything that has happened between the two of you, she’s still such a good friend.  Be a Crimson Artist and flip the script on her.\nOf course, if you really want to get out of the Omega box for good, show up at one -and only one- church event with a very pretty and somewhat inappropriately dressed girl with stripper hair.  Don’t act like she’s your girlfriend or behave obnoxiously, just behave normally and let all the little gossips assume whatever they want to assume.  And when asked about her later, just say “well, it’s kind of complicated” and leave it at that.\nThe fact is that Christianity inhibits Game for the obvious reason that Man is fallen.  That’s just a reality that the Christian man has to accept and remind himself that pleasing the world and its women is not his mission on Earth.  But the Bible demands male dominance and female submission too, just in a different form.  Jesus Christ was seldom nice and he did not come to assuage anyone’s feelings but rather to make them feel so abysmally bad that they were willing to repent of their sins. The need to abandon asshole game should never be confused with the duty to assume gamma.  Jesus is, after all the ultimate ALPHA as well as the Omega.",
  "tags": [
    "mailvox",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-22T18:15:00+00:00"
}