{
  "url": "https://voxday.net/2010/06/16/pointing-and-laughing/",
  "scraped_at": "2026-01-08T23:29:38.183388",
  "title": "Pointing and laughing",
  "date_display": "June 16, 2010",
  "date_iso": "2010-06-16T20:02:00+00:00",
  "date_from_url": "2010-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard to summon up any sympathy <a href=\"http://balkin.blogspot.com/2010/06/wake-up-fellow-law-professors-to.html\">for unemployed and underemployed lawyers</a> given that it was obvious that there were far too many of the worse-than-useless, anti-productive bastards back when I graduated from college:</p><blockquote><p>Look past the occasional vulgarity and disgusting pictures. Don’t dismiss the posters as whiners. To a person they accept responsibility for their poor decisions. But they make a strong case that something is deeply wrong with law schools.</p><p>Their complaint is that non-elite law schools are selling a fraudulent bill of goods. Law schools advertise deceptively high rates of employment and misleading income figures. Many graduates can’t get jobs. Many graduates end up as temp attorneys working for $15 to $20 dollars an hour on two week gigs, with no benefits. The luckier graduates land jobs in government or small firms for maybe $45,000, with limited prospects for improvement. A handful of lottery winners score big firm jobs.</p><p>And for the opportunity to enter a saturated legal market with long odds against them, the tens of thousands newly minted lawyers who graduate each year from non-elite schools will have paid around $150,000 in tuition and living expenses, and given up three years of income.</p></blockquote><p>How smart can these overeducated and unemployable people be anyhow if they weren’t capable of taking simple supply and demand into account AFTER four years of college?  And if those who insist that education creates societal wealth are correct, then there can’t possibly be a problem here anyhow.</p><p>Never forget that law schools, like every other form of school, exist in order to make money for someone.  The education and degree are merely the means to an end.  Therefore, caveat emptor applies.</p><p>I almost started to feel sorry <a href=\"http://www.notolawschool.com/2010/06/students-pay-so-professors-can-play.html\">for this guy</a>, until I remembered that his intention was to work as a lawyer and enjoy a well-compensated career by diverting money away from the productive classes of the country.  And the most amusing thing in all of this is the failed larval lawyers who fail to see the irony when they hypothesize about those who hold lawyers in contempt will desperately need a lawyer should they find themselves facing an unjust lawsuit….</p><p><i>So in an effort to show you what happens after a law school has robbed a student of $120,000 + and their dream of becoming a practicing attorney, let me show you a day in the life of a Jobless JD. This is what happens after the scam money has been collected and the student leaves without a job in hand:</i></p><p>It starts about 2 AM for me, when I wake up with my heart pounding, wondering what I am going to do. What bill should I pay this month? Electric, gas, rent, all past due. I decide I will pay for gas and electric, go without food, because I still want to lose a few pounds and I have some rice and yogurt left that I can eat this week.</p><p>I get up and stare out the window and wonder for the ten millionth time what the hell I was thinking when I decided to go to law school. I play the would have / could have / should have game (If only I wouldn’t have gone to law school, I could have worked and I wouldn’t have debt, I should have thought this out) That usually gets me to 6 AM.</p><p>I shower and walk (subway is expensive) to a public library that has computers so I can blog. Mine blew up last year and I can’t afford a new one. Next I go to my $10 an hour part time job (all I’ve been able to get a year out of law school) and I try to be sunny and cheerful and pretend that I’m happy to be there so that I can hold on to it.</p><p>That being said, the authors of the Scamblogs are doing noble work indeed by exposing the monstrous scam that is law school.  And since they couldn’t figure out the scam ahead of time, it seems unlikely that they ever thought through the way in which law firms make their money.  So, in the end, we shouldn’t hold their innocent infatuation with legal extortion against them.</p></div>",
  "content_text": "It’s hard to summon up any sympathy\nfor unemployed and underemployed lawyers\ngiven that it was obvious that there were far too many of the worse-than-useless, anti-productive bastards back when I graduated from college:\nLook past the occasional vulgarity and disgusting pictures. Don’t dismiss the posters as whiners. To a person they accept responsibility for their poor decisions. But they make a strong case that something is deeply wrong with law schools.\nTheir complaint is that non-elite law schools are selling a fraudulent bill of goods. Law schools advertise deceptively high rates of employment and misleading income figures. Many graduates can’t get jobs. Many graduates end up as temp attorneys working for $15 to $20 dollars an hour on two week gigs, with no benefits. The luckier graduates land jobs in government or small firms for maybe $45,000, with limited prospects for improvement. A handful of lottery winners score big firm jobs.\nAnd for the opportunity to enter a saturated legal market with long odds against them, the tens of thousands newly minted lawyers who graduate each year from non-elite schools will have paid around $150,000 in tuition and living expenses, and given up three years of income.\nHow smart can these overeducated and unemployable people be anyhow if they weren’t capable of taking simple supply and demand into account AFTER four years of college?  And if those who insist that education creates societal wealth are correct, then there can’t possibly be a problem here anyhow.\nNever forget that law schools, like every other form of school, exist in order to make money for someone.  The education and degree are merely the means to an end.  Therefore, caveat emptor applies.\nI almost started to feel sorry\nfor this guy\n, until I remembered that his intention was to work as a lawyer and enjoy a well-compensated career by diverting money away from the productive classes of the country.  And the most amusing thing in all of this is the failed larval lawyers who fail to see the irony when they hypothesize about those who hold lawyers in contempt will desperately need a lawyer should they find themselves facing an unjust lawsuit….\nSo in an effort to show you what happens after a law school has robbed a student of $120,000 + and their dream of becoming a practicing attorney, let me show you a day in the life of a Jobless JD. This is what happens after the scam money has been collected and the student leaves without a job in hand:\nIt starts about 2 AM for me, when I wake up with my heart pounding, wondering what I am going to do. What bill should I pay this month? Electric, gas, rent, all past due. I decide I will pay for gas and electric, go without food, because I still want to lose a few pounds and I have some rice and yogurt left that I can eat this week.\nI get up and stare out the window and wonder for the ten millionth time what the hell I was thinking when I decided to go to law school. I play the would have / could have / should have game (If only I wouldn’t have gone to law school, I could have worked and I wouldn’t have debt, I should have thought this out) That usually gets me to 6 AM.\nI shower and walk (subway is expensive) to a public library that has computers so I can blog. Mine blew up last year and I can’t afford a new one. Next I go to my $10 an hour part time job (all I’ve been able to get a year out of law school) and I try to be sunny and cheerful and pretend that I’m happy to be there so that I can hold on to it.\nThat being said, the authors of the Scamblogs are doing noble work indeed by exposing the monstrous scam that is law school.  And since they couldn’t figure out the scam ahead of time, it seems unlikely that they ever thought through the way in which law firms make their money.  So, in the end, we shouldn’t hold their innocent infatuation with legal extortion against them.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-16T19:02:00+00:00"
}