{
  "url": "https://voxday.net/2010/06/24/problem-with-american-science/",
  "scraped_at": "2026-01-08T23:30:12.955573",
  "title": "The problem with American science",
  "date_display": "June 24, 2010",
  "date_iso": "2010-06-24T13:22:00+00:00",
  "date_from_url": "2010-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have repeatedly pointed out, none of the various problems facing science <a href=\"http://www.miller-mccune.com/science/the-real-science-gap-16191/\">have anything to do with religion</a>, the baseless assertions of the New Atheists notwithstanding:</p><blockquote><p>America’s schools, it turns out, consistently produce large numbers of world-class science and math students, according to studies by Harold Salzman of the Heldrich Center for Workforce Development at Rutgers University and his co-author, B. Lindsay Lowell, director of policy studies for the Institute for the Study of International Migration at Georgetown University. But the incentives that once reliably delivered many of those high scorers into scientific and technical careers have gone seriously awry.</p><p>If the nation truly wants its ablest students to become scientists, Salzman says, it must undertake reforms — but not of the schools. Instead, it must reconstruct a career structure that will once again provide young Americans the reasonable hope that spending their youth preparing to do science will provide a satisfactory career.  “It’s not an education story, it’s a labor market story,” Salzman says….</p><p>Today, only a handful of young scientists — the few lucky or gifted enough to win famous fellowships or score outstanding publications that identify them early on as “stars” — can look forward to such a future. For the great majority, becoming a scientist now entails a penurious decade or more of graduate school and postdoc positions before joining the multitude vainly vying for the few available faculty-level openings. Earning a doctorate now consumes an average of about seven years. In many fields, up to five more years as a postdoc now constitute, in the words of Trevor Penning, who formerly headed postdoctoral programs at the University of Pennsylvania, the “terminal de facto credential” required for faculty-level posts.</p></blockquote><p>One of the interesting things about the problem with American science is that those reviewing the situation are entirely forthright about the way the best and brightest have avoided pursuing scientific careers for decades now.  To put it simply, the smartest students are not dumb enough to fail to notice the way in which the supply of science degrees considerably outstrips the number of jobs available in the various scientific fields or that there are far more remunerative and intellectually satisfying fields in which to pursue employment.</p><p>And yet, those who weren’t smart enough or aware enough to consider their future employment possibilities are the very individuals who tend to claim that those who were are less intelligent and their opinions about scientific and non-scientific matters alike are less valid <i>because they do not have science degrees</i>.  (Never mind that I do, in fact, have a Bachelor of Science, that’s beside the point.)</p><p>So, this tends to suggest that in addition to whatever structural changes are being proposed by the various parties that are interested in solving the problem, a course or two in logic would not be amiss.  And for a group of people who claim to be better educated and more highly intelligent than the norm, they do tend to expose a shocking ignorance of some very basic economic concepts that were solidly established more than 200 years ago.  The reality is that the problem is simply a variant of the conventional one of malinvestment caused by credit expansion; the huge and unsustainable government allocation of financial resources to the scientific sector in the thirty years from 1940 to 1970 clearly sent a false signal about the market’s demand for scientists to students pursuing science degrees over the subsequent three decades.</p></div>",
  "content_text": "As I have repeatedly pointed out, none of the various problems facing science\nhave anything to do with religion\n, the baseless assertions of the New Atheists notwithstanding:\nAmerica’s schools, it turns out, consistently produce large numbers of world-class science and math students, according to studies by Harold Salzman of the Heldrich Center for Workforce Development at Rutgers University and his co-author, B. Lindsay Lowell, director of policy studies for the Institute for the Study of International Migration at Georgetown University. But the incentives that once reliably delivered many of those high scorers into scientific and technical careers have gone seriously awry.\nIf the nation truly wants its ablest students to become scientists, Salzman says, it must undertake reforms — but not of the schools. Instead, it must reconstruct a career structure that will once again provide young Americans the reasonable hope that spending their youth preparing to do science will provide a satisfactory career.  “It’s not an education story, it’s a labor market story,” Salzman says….\nToday, only a handful of young scientists — the few lucky or gifted enough to win famous fellowships or score outstanding publications that identify them early on as “stars” — can look forward to such a future. For the great majority, becoming a scientist now entails a penurious decade or more of graduate school and postdoc positions before joining the multitude vainly vying for the few available faculty-level openings. Earning a doctorate now consumes an average of about seven years. In many fields, up to five more years as a postdoc now constitute, in the words of Trevor Penning, who formerly headed postdoctoral programs at the University of Pennsylvania, the “terminal de facto credential” required for faculty-level posts.\nOne of the interesting things about the problem with American science is that those reviewing the situation are entirely forthright about the way the best and brightest have avoided pursuing scientific careers for decades now.  To put it simply, the smartest students are not dumb enough to fail to notice the way in which the supply of science degrees considerably outstrips the number of jobs available in the various scientific fields or that there are far more remunerative and intellectually satisfying fields in which to pursue employment.\nAnd yet, those who weren’t smart enough or aware enough to consider their future employment possibilities are the very individuals who tend to claim that those who were are less intelligent and their opinions about scientific and non-scientific matters alike are less valid\nbecause they do not have science degrees\n.  (Never mind that I do, in fact, have a Bachelor of Science, that’s beside the point.)\nSo, this tends to suggest that in addition to whatever structural changes are being proposed by the various parties that are interested in solving the problem, a course or two in logic would not be amiss.  And for a group of people who claim to be better educated and more highly intelligent than the norm, they do tend to expose a shocking ignorance of some very basic economic concepts that were solidly established more than 200 years ago.  The reality is that the problem is simply a variant of the conventional one of malinvestment caused by credit expansion; the huge and unsustainable government allocation of financial resources to the scientific sector in the thirty years from 1940 to 1970 clearly sent a false signal about the market’s demand for scientists to students pursuing science degrees over the subsequent three decades.",
  "tags": [
    "education",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-24T12:22:00+00:00"
}