{
  "url": "https://voxday.net/2010/06/15/strategy-games-for-starters/",
  "scraped_at": "2026-01-08T23:29:30.636501",
  "title": "Strategy games for starters",
  "date_display": "June 15, 2010",
  "date_iso": "2010-06-15T14:20:00+00:00",
  "date_from_url": "2010-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DB asks a reasonable question:</p><blockquote><p>If you have time would you mind recommending a good strategy board game for someone who has only ever played Risk and Axis and Allies.</p><p>Ideally it can be played by only two people but can handle more if needed.  I would like something that doesn’t take days to play, an hour or two, no more than three.  A game whose rules can be easily understood by beginners.  While I could probably pick up complicated rules fairly quickly those I play with may not be as oriented toward such thinking.</p><p>There are so many games out there that I don’t know where to even start looking.</p></blockquote><p>My go to game for beginners is <i>War at Sea</i> by Avalon Hill.  It’s simple, historical, and balanced towards the Allied player so it’s a good game to help a less experienced gamer develop confidence while learning the importance of anticipating an opponent.  It also makes it very easy to understand why the Axis lost WWII.  However, I’m sure others will have alternative suggestions.</p></div>",
  "content_text": "DB asks a reasonable question:\nIf you have time would you mind recommending a good strategy board game for someone who has only ever played Risk and Axis and Allies.\nIdeally it can be played by only two people but can handle more if needed.  I would like something that doesn’t take days to play, an hour or two, no more than three.  A game whose rules can be easily understood by beginners.  While I could probably pick up complicated rules fairly quickly those I play with may not be as oriented toward such thinking.\nThere are so many games out there that I don’t know where to even start looking.\nMy go to game for beginners is\nWar at Sea\nby Avalon Hill.  It’s simple, historical, and balanced towards the Allied player so it’s a good game to help a less experienced gamer develop confidence while learning the importance of anticipating an opponent.  It also makes it very easy to understand why the Axis lost WWII.  However, I’m sure others will have alternative suggestions.",
  "tags": [
    "games",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-15T13:20:00+00:00"
}