{
  "url": "https://voxday.net/2010/06/14/true-but-hes-still-weird/",
  "scraped_at": "2026-01-08T23:29:25.156402",
  "title": "True, but he’s still weird",
  "date_display": "June 14, 2010",
  "date_iso": "2010-06-14T13:15:00+00:00",
  "date_from_url": "2010-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steyn <a href=\"http://article.nationalreview.com/436145/the-very-model-of-a-modern-major-generalist/mark-steyn?page=2\">on Obama</a>:</p><blockquote><p>In recent months, a lot of Americans have said to me that they had no idea the new president would feel so “weird.” But, in fact, he’s not weird. True, he’s not, even in Democratic terms, a political figure — as, say, Clinton or Biden are. Instead, he’s the product of the broader culture: There are millions of people like Barack Obama, the eternal students of a vast lethargic transnational campus for whom global compassion and the multicultural pose are merely the modish gloss on a cult of radical grandiose narcissism. As someone once said, “We are the ones we’ve been waiting for.” When you’ve spent that long waiting in line for yourself, it’s bound to be a disappointment.</p></blockquote><p>Obama isn’t the first black president, he’s the first teen president.  On a tangential note, I have to admit that I find it both irritating and amusing when left-liberal Americans who have never been anywhere outside the borders for more than two weeks, don’t speak anything but English, and have seldom encountered an idea that wasn’t spoon-fed to them by a teacher or professor try to strike the <i>citoyen du monde</i> pose in front of me.</p><p>But I have to disagree with Steyn.  The fact that there are no shortage of other useless and narcissistic weirdos doesn’t make Obama any less weird.  It is surprising to me that more people didn’t observe how psychologically strange Obama has been from the start.  There is something intrinsically wrong with anyone who is still that much of a blank slate after more than a decade in the public eye.  Forget the missing birth certificate, where are the friends and old girlfriend, where are the proud teachers and professors?  And since his inauguration, Obama’s presidency has provided one risible moment after another, and I strongly suspect that the ultimate punch line is going to be a doozy.</p></div>",
  "content_text": "Steyn\non Obama\n:\nIn recent months, a lot of Americans have said to me that they had no idea the new president would feel so “weird.” But, in fact, he’s not weird. True, he’s not, even in Democratic terms, a political figure — as, say, Clinton or Biden are. Instead, he’s the product of the broader culture: There are millions of people like Barack Obama, the eternal students of a vast lethargic transnational campus for whom global compassion and the multicultural pose are merely the modish gloss on a cult of radical grandiose narcissism. As someone once said, “We are the ones we’ve been waiting for.” When you’ve spent that long waiting in line for yourself, it’s bound to be a disappointment.\nObama isn’t the first black president, he’s the first teen president.  On a tangential note, I have to admit that I find it both irritating and amusing when left-liberal Americans who have never been anywhere outside the borders for more than two weeks, don’t speak anything but English, and have seldom encountered an idea that wasn’t spoon-fed to them by a teacher or professor try to strike the\ncitoyen du monde\npose in front of me.\nBut I have to disagree with Steyn.  The fact that there are no shortage of other useless and narcissistic weirdos doesn’t make Obama any less weird.  It is surprising to me that more people didn’t observe how psychologically strange Obama has been from the start.  There is something intrinsically wrong with anyone who is still that much of a blank slate after more than a decade in the public eye.  Forget the missing birth certificate, where are the friends and old girlfriend, where are the proud teachers and professors?  And since his inauguration, Obama’s presidency has provided one risible moment after another, and I strongly suspect that the ultimate punch line is going to be a doozy.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-14T12:15:00+00:00"
}