{
  "url": "https://voxday.net/2010/06/23/twilight-of-damned/",
  "scraped_at": "2026-01-08T23:30:07.450511",
  "title": "The Twilight of the Damned",
  "date_display": "June 23, 2010",
  "date_iso": "2010-06-23T08:12:00+00:00",
  "date_from_url": "2010-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am entirely confident that had vampire porn been around in the first century, <a href=\"http://blogs.canoe.ca/advice/sex/together-at-last-at-twilight-time/\">Twilight bed sheets</a> would have been included along with adultery as legitimate Biblical grounds for divorce.</p><blockquote><p>I am an enthusiastic fan of the Twilight Saga and have recently purchased an Edward Cullen pillowcase and blanket. Here is the problem – I am married and my husband has taken great offense to having these items on our “marital bed”! I have argued that he is a fictional character and that these are just objects…and if he wanted to put Pam Anderson on a pillowcase he could gladly do so. He thinks I am not in touch with reality (which I find offensive) and am not being a considerate wife. I want to make my husband happy but does that mean that I have to compromise my happiness in order to achieve this?</p></blockquote><p>Attention deltas and gammas.  Remember this email the next time you find yourself tempted to take anything a woman says seriously or to place her on a pedestal.  This is not a joke, it is an actual example of the way that a living, breathing, adult <i>married</i> woman thinks.  Now, steel yourself and try to imagine what must be going through the head of the average woman who doesn’t regard herself as being sufficiently grown-up for marriage!</p><p>The mind reels.</p><p>There is so much wrong here that it might seem hard to know where to start, but in fact it is entirely clear.  The bedsheets go and the wife can either decide to grow up or she can go too.  Her immature, self-centered lack of respect for her husband is total and it is hilarious how she “finds offensive” his statement of the completely freaking obvious given her equation of happiness with teenybopper bedsheets.</p><p>The advice given by the fat little complacent gamma was totally predictable of course.  As soon as I saw his picture, I knew his advice would be to ignore the fact that the wife is a complete lunatic and tell the husband to let her have her way.  After all, doing exactly what a woman tells you to do is the way that you may occasionally be permitted to have sex with her, right?  This is the point at which the observer is forced to note that as many as four of the advice columnist’s seven children might actually be his.</p><p>Sure enough: <i>I’ve read those Twilight books, they are pretty romantic. So let your wife enjoy her dreamy fantasy of fangs and foreplay and she may just turn out to be the most considerate wife you could imagine – nudge, nudge, wink, wink.</i></p><p>Did I call that one or what?  Romance novels and romance TV are nothing more or less than female porn.  Most women will furiously deny it, but their very vehemence underlines the reality.  Women get the same buzz off romance porn that men get from Victoria’s Nasty Secret Vol. 37 and the fact that the female variant happens to be more acceptable in public in the West is no more meaningful than the fact that tentacle monsters penetrating spread-eagled teen girls in tattered school uniforms is equally acceptable in public elsewhere.  I’ll never forget being puzzled by the sight of a middle-aged <i>sarariman</i> openly reading a comic book on the train next to me and glancing over his shoulder to see what sort of childish superhero cartoon it was.  Such was my eye-opening introduction to the significant difference between <i>shōnen</i> and <i>seijin</i> manga.</p><p>The point is that while a man should tolerate a woman’s moderate porn habit, if it’s gotten to the point that she’s doing the female equivalent of bringing a Jenna Jameson blow-up doll to bed, she’s out of control and requires reining in.  But this woman is so far gone that there may be no hope for her.  Forget the sexual and sanity implications, I’d leave the poor freakshow solely on the basis of aesthetics.</p></div>",
  "content_text": "I am entirely confident that had vampire porn been around in the first century,\nTwilight bed sheets\nwould have been included along with adultery as legitimate Biblical grounds for divorce.\nI am an enthusiastic fan of the Twilight Saga and have recently purchased an Edward Cullen pillowcase and blanket. Here is the problem – I am married and my husband has taken great offense to having these items on our “marital bed”! I have argued that he is a fictional character and that these are just objects…and if he wanted to put Pam Anderson on a pillowcase he could gladly do so. He thinks I am not in touch with reality (which I find offensive) and am not being a considerate wife. I want to make my husband happy but does that mean that I have to compromise my happiness in order to achieve this?\nAttention deltas and gammas.  Remember this email the next time you find yourself tempted to take anything a woman says seriously or to place her on a pedestal.  This is not a joke, it is an actual example of the way that a living, breathing, adult\nmarried\nwoman thinks.  Now, steel yourself and try to imagine what must be going through the head of the average woman who doesn’t regard herself as being sufficiently grown-up for marriage!\nThe mind reels.\nThere is so much wrong here that it might seem hard to know where to start, but in fact it is entirely clear.  The bedsheets go and the wife can either decide to grow up or she can go too.  Her immature, self-centered lack of respect for her husband is total and it is hilarious how she “finds offensive” his statement of the completely freaking obvious given her equation of happiness with teenybopper bedsheets.\nThe advice given by the fat little complacent gamma was totally predictable of course.  As soon as I saw his picture, I knew his advice would be to ignore the fact that the wife is a complete lunatic and tell the husband to let her have her way.  After all, doing exactly what a woman tells you to do is the way that you may occasionally be permitted to have sex with her, right?  This is the point at which the observer is forced to note that as many as four of the advice columnist’s seven children might actually be his.\nSure enough:\nI’ve read those Twilight books, they are pretty romantic. So let your wife enjoy her dreamy fantasy of fangs and foreplay and she may just turn out to be the most considerate wife you could imagine – nudge, nudge, wink, wink.\nDid I call that one or what?  Romance novels and romance TV are nothing more or less than female porn.  Most women will furiously deny it, but their very vehemence underlines the reality.  Women get the same buzz off romance porn that men get from Victoria’s Nasty Secret Vol. 37 and the fact that the female variant happens to be more acceptable in public in the West is no more meaningful than the fact that tentacle monsters penetrating spread-eagled teen girls in tattered school uniforms is equally acceptable in public elsewhere.  I’ll never forget being puzzled by the sight of a middle-aged\nsarariman\nopenly reading a comic book on the train next to me and glancing over his shoulder to see what sort of childish superhero cartoon it was.  Such was my eye-opening introduction to the significant difference between\nshōnen\nand\nseijin\nmanga.\nThe point is that while a man should tolerate a woman’s moderate porn habit, if it’s gotten to the point that she’s doing the female equivalent of bringing a Jenna Jameson blow-up doll to bed, she’s out of control and requires reining in.  But this woman is so far gone that there may be no hope for her.  Forget the sexual and sanity implications, I’d leave the poor freakshow solely on the basis of aesthetics.",
  "tags": [
    "freakshow",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-23T07:12:00+00:00"
}