{
  "url": "https://voxday.net/2010/06/17/world-cup-days-3-6/",
  "scraped_at": "2026-01-08T23:29:39.997181",
  "title": "World Cup Days 3-6",
  "date_display": "June 17, 2010",
  "date_iso": "2010-06-17T11:49:00+00:00",
  "date_from_url": "2010-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few emailers have chastised me and demanded MORE SOCCER POSTS.  So, how can I deny them.  First, I have to admit that I haven’t watched all of the games, but only the ones that interested me.  So, I have nothing to say about Slovenia-Algeria, New Zealand-Slovakia or Côte d’Ivoire-Portugal.  Here’s what I’ve noticed thus far:</p><p>South Africa is, as I thought in the first game, pretty terrible.  They’re okay technically, but have literally no clue what they’re doing tactically.  France is not a French team, it is an African team in French uniforms and their manager Domenech is dreadful.  It wouldn’t shock me if they lost to Mexico and failed to make the second round.  Uruguay is a decent team, but South Africa made them look better than they are.  If the Mexicans bother to show up this time, they have a good shot at beating France.</p><p>Greece is as boring as ever but now they don’t have a keeper upon whom they can ride to the second round as they did in winning Euro 2004.  Argentina will be dangerous once Messi stops getting cute and starts shooting the ball at the goal instead of trying to nip the corners.  In the meantime, they should be feeding the ball more to Unfrozen Caveman Striker.  It drives me crazy when strikers insist on aiming for the corners, shooting wide, and depriving their team of rebound goals, which make up around one-quarter of all goals scored.  Nigeria isn’t getting talked up as the Great African Hope for once in light of South Africa, but I don’t think they can hope to play with South Korea.  I very much like the way the South Koreans play; they’re aggressive, fit, and disciplined.  They’re not going to beat the Argentines, but they should take second.</p><p>There’s not much to say about Group C.  It’s England, USA, and that’s about it.  Slovenia might surprise one of them with a draw, but I’d expect both teams to win their next two games.  Group D is Germany and the three dwarfs.  The Netherlands are easily the class of their group, as they toyed with the Danes throughout.  I expect the Japanese to finish second in Group E behind the Dutch; their 1-0 game against Cameroon wasn’t as close as the score indicates.</p><p>Both Italy and Brazil looked relatively bad against Paraguay and North Korea, the difference was that the Brazilian strikers are better.  Italy should be starting Camorenesi on the wing; the game turned around when he came in.  Buffon’s injury really hurts the Azzurri, but an Italian team that is counting on its goalie is not an Italian team that is in contention anyhow.  Portugal is a shadow of its former self and I join the rest of the world in hoping for an embarrassing injury to Cristiano Ronaldo.  Irina Shayk may be no little hot, but not even a Sports Illustrated girlfriend can hope to counterbalance that ubercheesy cheeseball, his whining and all those needless stepovers.  Speaking of annoyances, I thought the Brazilians were infuriating; they kept trying to unlock the North Korean defense by passing around the ball outside the box instead of sending it in for crosses against a very short defense.  Like the South Koreans, the North Koreans outperform their talent.  I had the idea that the Brazilians felt sorry for them, Lucio in particular appeared to be going out of his way to pat them on the back or otherwise encourage them.</p><p>And finally, Hop Schwiiz!  The Swiss defeat of Spain wasn’t a big surprise to me because the temperamental, individual-centered Spanish attack is very vulnerable to the Swiss <i>catenaccio</i> strategy.  I fully expect Switzerland to win the group now; the loss of Alexander Frei was never the big deal that everyone appear to have assumed it would be.  In fact, they’re better off without him making their attack overly one-dimensional.  Torres was the only Spanish player who looked consistently dangerous; he’s coming back from injury but should be starting anyhow.  Some notes:</p><p>1.  Ban the vuluzelas.<br> 2.  I find myself fantasizing about watching the games from the stands with a large caliber sniper rifle and picking off midfielders when they a) refuse to make through passes to a waiting striker with 50 yards of empty grass in front of him, b) pull up and dribble the ball in a circle in transition to permit the defense to get set, c) pass up a perfectly reasonable shot in order to get a slightly better shot that only requires beating two, three, or sometimes four defenders.  TAKE THE DAMN SHOT!<br> 3.  I hate most midfielders.  Just in case that wasn’t clear.  If your name isn’t “Zidane”, you are not going to be able to beat more than one international-class defender.  Don’t even try.<br> 4.  Aside from the terrible red card given to the South African goalie, the red that should have been a yellow given to the one Australian who actually knows how to play soccer, and the second yellow not given to Jamie Carragher for clotheslining a US striker, the refs have been surprisingly good.<br> 5. The ball isn’t the problem with the low scores.  They are the result of defense-oriented strategies combined with an extreme reluctance on the part of attackers to shoot the ball if it is more than three meters away from the goal line.  Here is hoping the goals scored by Clint Dempsey and Diego Forlan encourage attacking players to shoot more quickly and more often.<br> 6.  Managers desperately need to lose their fascination with big, fast physical specimens who can’t score.  For example, Emile Heskey has scored 7 goals in 59 games with England.  Why in the name of the third lion is he on the team, let alone starting?  I would expect to score more goals than that in 59 games, especially playing against powerhouse teams like Kazakhstan and the Faroe Islands.</br></br></br></br></br></p><p>And for those of you who hate soccer, the Onion has come through again.</p><p><a href=\"http://www.theonion.com/video/soccer-officially-announces-it-is-gay,17603/\">Soccer Officially Announces It Is Gay</a></p></div>",
  "content_text": "A few emailers have chastised me and demanded MORE SOCCER POSTS.  So, how can I deny them.  First, I have to admit that I haven’t watched all of the games, but only the ones that interested me.  So, I have nothing to say about Slovenia-Algeria, New Zealand-Slovakia or Côte d’Ivoire-Portugal.  Here’s what I’ve noticed thus far:\nSouth Africa is, as I thought in the first game, pretty terrible.  They’re okay technically, but have literally no clue what they’re doing tactically.  France is not a French team, it is an African team in French uniforms and their manager Domenech is dreadful.  It wouldn’t shock me if they lost to Mexico and failed to make the second round.  Uruguay is a decent team, but South Africa made them look better than they are.  If the Mexicans bother to show up this time, they have a good shot at beating France.\nGreece is as boring as ever but now they don’t have a keeper upon whom they can ride to the second round as they did in winning Euro 2004.  Argentina will be dangerous once Messi stops getting cute and starts shooting the ball at the goal instead of trying to nip the corners.  In the meantime, they should be feeding the ball more to Unfrozen Caveman Striker.  It drives me crazy when strikers insist on aiming for the corners, shooting wide, and depriving their team of rebound goals, which make up around one-quarter of all goals scored.  Nigeria isn’t getting talked up as the Great African Hope for once in light of South Africa, but I don’t think they can hope to play with South Korea.  I very much like the way the South Koreans play; they’re aggressive, fit, and disciplined.  They’re not going to beat the Argentines, but they should take second.\nThere’s not much to say about Group C.  It’s England, USA, and that’s about it.  Slovenia might surprise one of them with a draw, but I’d expect both teams to win their next two games.  Group D is Germany and the three dwarfs.  The Netherlands are easily the class of their group, as they toyed with the Danes throughout.  I expect the Japanese to finish second in Group E behind the Dutch; their 1-0 game against Cameroon wasn’t as close as the score indicates.\nBoth Italy and Brazil looked relatively bad against Paraguay and North Korea, the difference was that the Brazilian strikers are better.  Italy should be starting Camorenesi on the wing; the game turned around when he came in.  Buffon’s injury really hurts the Azzurri, but an Italian team that is counting on its goalie is not an Italian team that is in contention anyhow.  Portugal is a shadow of its former self and I join the rest of the world in hoping for an embarrassing injury to Cristiano Ronaldo.  Irina Shayk may be no little hot, but not even a Sports Illustrated girlfriend can hope to counterbalance that ubercheesy cheeseball, his whining and all those needless stepovers.  Speaking of annoyances, I thought the Brazilians were infuriating; they kept trying to unlock the North Korean defense by passing around the ball outside the box instead of sending it in for crosses against a very short defense.  Like the South Koreans, the North Koreans outperform their talent.  I had the idea that the Brazilians felt sorry for them, Lucio in particular appeared to be going out of his way to pat them on the back or otherwise encourage them.\nAnd finally, Hop Schwiiz!  The Swiss defeat of Spain wasn’t a big surprise to me because the temperamental, individual-centered Spanish attack is very vulnerable to the Swiss\ncatenaccio\nstrategy.  I fully expect Switzerland to win the group now; the loss of Alexander Frei was never the big deal that everyone appear to have assumed it would be.  In fact, they’re better off without him making their attack overly one-dimensional.  Torres was the only Spanish player who looked consistently dangerous; he’s coming back from injury but should be starting anyhow.  Some notes:\n1.  Ban the vuluzelas.\n2.  I find myself fantasizing about watching the games from the stands with a large caliber sniper rifle and picking off midfielders when they a) refuse to make through passes to a waiting striker with 50 yards of empty grass in front of him, b) pull up and dribble the ball in a circle in transition to permit the defense to get set, c) pass up a perfectly reasonable shot in order to get a slightly better shot that only requires beating two, three, or sometimes four defenders.  TAKE THE DAMN SHOT!\n3.  I hate most midfielders.  Just in case that wasn’t clear.  If your name isn’t “Zidane”, you are not going to be able to beat more than one international-class defender.  Don’t even try.\n4.  Aside from the terrible red card given to the South African goalie, the red that should have been a yellow given to the one Australian who actually knows how to play soccer, and the second yellow not given to Jamie Carragher for clotheslining a US striker, the refs have been surprisingly good.\n5. The ball isn’t the problem with the low scores.  They are the result of defense-oriented strategies combined with an extreme reluctance on the part of attackers to shoot the ball if it is more than three meters away from the goal line.  Here is hoping the goals scored by Clint Dempsey and Diego Forlan encourage attacking players to shoot more quickly and more often.\n6.  Managers desperately need to lose their fascination with big, fast physical specimens who can’t score.  For example, Emile Heskey has scored 7 goals in 59 games with England.  Why in the name of the third lion is he on the team, let alone starting?  I would expect to score more goals than that in 59 games, especially playing against powerhouse teams like Kazakhstan and the Faroe Islands.\nAnd for those of you who hate soccer, the Onion has come through again.\nSoccer Officially Announces It Is Gay",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-06-17T10:49:00+00:00"
}