{
  "url": "https://voxday.net/2023/06/23/a-word-to-the-fearful/",
  "scraped_at": "2026-01-08T14:00:49.506496",
  "title": "A Word to the Fearful",
  "date_display": "June 23, 2023",
  "date_iso": "2023-06-23T11:53:00+00:00",
  "date_from_url": "2023-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Far too many young men are terrified to get married, but their fears are misplaced. <a href=\"https://alphagameplan.blogspot.com/2015/01/dont-sweat-turning.html\">I wrote this eight years ag</a>o in response to a piece by Rollo, but it’s every bit as relevant today, as it addresses why men have literally nothing to fear from divorce:</em></p><p>You can only control your own behavior. No one else’s. If your wife is unhappy about the choice she made, if her children and friends and family and fun are her priorities and she wants out, then by all means, let her walk! Show her to the door with a smile!</p><p>There is a saying: if you love someone, set them free. You can’t control her actions, much less her desires. You can’t control the legal system. You can’t control your feelings. You can’t control anything except your own actions.</p><p>Ironically, the more willing you are to let her go, the less likely she is to actually continue down that road. With what is she actually threatening you anyhow? Doing whatever you want to do all the time instead of what she wants you to do? Being able to follow up on any indications of interest expressed by women who are half her age whenever you’re so inclined? Do you genuinely think you’re going to be able to spend LESS of your future income on things you want if she only gets HALF of it?</p><p>Do the math. Whether women control 73 percent or 85 percent of the household spending (depending upon which survey you prefer to credit), keeping only half your income amounts to an effective raise between 46 to 70 percent. Effectively tax-free too!</p><p>It suddenly doesn’t sound so awful when you put it that way, does it. Remember, most men come out of the divorces that their wives sought happier and better off than they were before. Being around a miserable person who despises you and blames you for their various disappointments in life isn’t a desirable state of being.</p><p><strong><em>Addendom 2023: </em></strong>While it is surely a terrible shock to the system for a man to be informed that his wife has decided to leave him – it’s happened twice in the last year to men with whom I am acquainted – in <em>every single cas</em>e that I’ve observed over the last 20 years, the abandoned man is a) happier, b) more energized, and c) going on dates with women at least 10 years younger than his ex-wife-to-be within six months of her breaking the news to him.</p><p>And let’s face it. In most cases, a woman’s decision to leave her husband is less than a complete surprise to anyone who is paying attention. Angry, unhappy, dissatisfied middle-aged women aren’t exactly famous for their stoicism or keeping their feelings to themselves. It’s not as if the Karen meme appeared on social media <em>ex nihilo</em>.</p><p>Divorce is also less common than it was during Peak Boomer. From one-half of ALL marriages, it’s now declined to one-third of ALL marriages, which means that a first marriage now has about a five in six chance of not ending in divorce. Throw in the reduced life expectancy of widespread vaccination, and the odds of staying married until death do you part is probably closer to nine in ten now.</p><p>Other than its generally unpleasant nature, the waste of time and money it entails, and the inevitably deleterious effect on the children, divorce really isn’t anything for the average man to fear. So, if you’re a young man who is afraid of marriage due to the perceived dangers of divorce, be aware that you risk missing out on one of the greatest and most important experiences of your life because you’re jumping at shadows.</p><p><em><a href=\"https://social.infogalactic.com/micropost/91f737c4-088b-4139-b088-d05c69497d57\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Far too many young men are terrified to get married, but their fears are misplaced.\nI wrote this eight years ag\no in response to a piece by Rollo, but it’s every bit as relevant today, as it addresses why men have literally nothing to fear from divorce:\nYou can only control your own behavior. No one else’s. If your wife is unhappy about the choice she made, if her children and friends and family and fun are her priorities and she wants out, then by all means, let her walk! Show her to the door with a smile!\nThere is a saying: if you love someone, set them free. You can’t control her actions, much less her desires. You can’t control the legal system. You can’t control your feelings. You can’t control anything except your own actions.\nIronically, the more willing you are to let her go, the less likely she is to actually continue down that road. With what is she actually threatening you anyhow? Doing whatever you want to do all the time instead of what she wants you to do? Being able to follow up on any indications of interest expressed by women who are half her age whenever you’re so inclined? Do you genuinely think you’re going to be able to spend LESS of your future income on things you want if she only gets HALF of it?\nDo the math. Whether women control 73 percent or 85 percent of the household spending (depending upon which survey you prefer to credit), keeping only half your income amounts to an effective raise between 46 to 70 percent. Effectively tax-free too!\nIt suddenly doesn’t sound so awful when you put it that way, does it. Remember, most men come out of the divorces that their wives sought happier and better off than they were before. Being around a miserable person who despises you and blames you for their various disappointments in life isn’t a desirable state of being.\nAddendom 2023:\nWhile it is surely a terrible shock to the system for a man to be informed that his wife has decided to leave him – it’s happened twice in the last year to men with whom I am acquainted – in\nevery single cas\ne that I’ve observed over the last 20 years, the abandoned man is a) happier, b) more energized, and c) going on dates with women at least 10 years younger than his ex-wife-to-be within six months of her breaking the news to him.\nAnd let’s face it. In most cases, a woman’s decision to leave her husband is less than a complete surprise to anyone who is paying attention. Angry, unhappy, dissatisfied middle-aged women aren’t exactly famous for their stoicism or keeping their feelings to themselves. It’s not as if the Karen meme appeared on social media\nex nihilo\n.\nDivorce is also less common than it was during Peak Boomer. From one-half of ALL marriages, it’s now declined to one-third of ALL marriages, which means that a first marriage now has about a five in six chance of not ending in divorce. Throw in the reduced life expectancy of widespread vaccination, and the odds of staying married until death do you part is probably closer to nine in ten now.\nOther than its generally unpleasant nature, the waste of time and money it entails, and the inevitably deleterious effect on the children, divorce really isn’t anything for the average man to fear. So, if you’re a young man who is afraid of marriage due to the perceived dangers of divorce, be aware that you risk missing out on one of the greatest and most important experiences of your life because you’re jumping at shadows.\nDISCUSS ON SG",
  "tags": [
    "SSH",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-23T11:53:00+00:00"
}