{
  "url": "https://voxday.net/2023/06/08/academics-wsj-confirm-pizzagate/",
  "scraped_at": "2026-01-08T13:59:10.176718",
  "title": "Academics, WSJ Confirm Pizzagate",
  "date_display": "June 8, 2023",
  "date_iso": "2023-06-08T12:02:00+00:00",
  "date_from_url": "2023-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sure you’re all very surprised to learn that the media was protesting just a little too much when it claimed Pizzagate had been “debunked” by virtue of an actor theatrically firing a single shot at a computer in a pizza joint. It turns out that there is a vast network of pedos protected by the technocratic elite and permitted to commit their crimes against <a href=\"https://archive.is/ps6fp#selection-285.0-289.289\">with the complicity of the very platforms</a> that ban so-called “hate speech”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Instagram, the popular social-media site owned by Meta Platforms, helps connect and promote a vast network of accounts openly devoted to the commission and purchase of underage-sex content, according to investigations by <em>The Wall Street Journal</em> and researchers at Stanford University and the University of Massachusetts Amherst.</p><p>Pedophiles have long used the internet, but unlike the forums and file-transfer services that cater to people who have interest in illicit content, Instagram doesn’t merely host these activities. Its algorithms promote them. Instagram connects pedophiles and guides them to content sellers via recommendation systems that excel at linking those who share niche interests, the Journal and the academic researchers found.</p><p>Though out of sight for most on the platform, the sexualized accounts on Instagram are brazen about their interest. The researchers found that Instagram enabled people to search explicit hashtags such as #pedowhore and #preteensex and connected them to accounts that used the terms to advertise child-sex material for sale. Such accounts often claim to be run by the children themselves and use overtly sexual handles incorporating words such as “little slut for you.”</p><p>Instagram accounts offering to sell illicit sex material generally don’t publish it openly, instead posting “menus” of content. Certain accounts invite buyers to commission specific acts. Some menus include prices for videos of children harming themselves and “imagery of the minor performing sexual acts with animals,” researchers at the Stanford Internet Observatory found. At the right price, children are available for in-person “meet ups.”</p></blockquote><p>Of course, one could hardly blame Facebook or the technocracy for these sordid, carefully-hidden activities, as a company with only 86,482 employees couldn’t be expected to effectively police its own sites, right?</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Alex Stamos, the head of the Stanford Internet Observatory and Meta’s chief security officer until 2018, said that getting even obvious abuse under control would likely take a sustained effort. “That a team of three academics with limited access could find such a huge network should set off alarms at Meta,” he said, noting that the company has far more effective tools to map its pedophile network than outsiders do. “I hope the company reinvests in human investigators,” he added.</p></blockquote><p>On the basis of the observable evidence, one might not unreasonably advance the hypothesis that the company doesn’t want to get “even obvious abuse under control”. One wonders what would serve to falsify that hypothesis to the media’s satisfaction, perhaps another out-of-work actor throwing a knife at a copy machine?</p><p><em><a href=\"https://social.infogalactic.com/micropost/202872ec-3ee4-4490-bd06-804e73c79d29\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m sure you’re all very surprised to learn that the media was protesting just a little too much when it claimed Pizzagate had been “debunked” by virtue of an actor theatrically firing a single shot at a computer in a pizza joint. It turns out that there is a vast network of pedos protected by the technocratic elite and permitted to commit their crimes against\nwith the complicity of the very platforms\nthat ban so-called “hate speech”.\nInstagram, the popular social-media site owned by Meta Platforms, helps connect and promote a vast network of accounts openly devoted to the commission and purchase of underage-sex content, according to investigations by\nThe Wall Street Journal\nand researchers at Stanford University and the University of Massachusetts Amherst.\nPedophiles have long used the internet, but unlike the forums and file-transfer services that cater to people who have interest in illicit content, Instagram doesn’t merely host these activities. Its algorithms promote them. Instagram connects pedophiles and guides them to content sellers via recommendation systems that excel at linking those who share niche interests, the Journal and the academic researchers found.\nThough out of sight for most on the platform, the sexualized accounts on Instagram are brazen about their interest. The researchers found that Instagram enabled people to search explicit hashtags such as #pedowhore and #preteensex and connected them to accounts that used the terms to advertise child-sex material for sale. Such accounts often claim to be run by the children themselves and use overtly sexual handles incorporating words such as “little slut for you.”\nInstagram accounts offering to sell illicit sex material generally don’t publish it openly, instead posting “menus” of content. Certain accounts invite buyers to commission specific acts. Some menus include prices for videos of children harming themselves and “imagery of the minor performing sexual acts with animals,” researchers at the Stanford Internet Observatory found. At the right price, children are available for in-person “meet ups.”\nOf course, one could hardly blame Facebook or the technocracy for these sordid, carefully-hidden activities, as a company with only 86,482 employees couldn’t be expected to effectively police its own sites, right?\nAlex Stamos, the head of the Stanford Internet Observatory and Meta’s chief security officer until 2018, said that getting even obvious abuse under control would likely take a sustained effort. “That a team of three academics with limited access could find such a huge network should set off alarms at Meta,” he said, noting that the company has far more effective tools to map its pedophile network than outsiders do. “I hope the company reinvests in human investigators,” he added.\nOn the basis of the observable evidence, one might not unreasonably advance the hypothesis that the company doesn’t want to get “even obvious abuse under control”. One wonders what would serve to falsify that hypothesis to the media’s satisfaction, perhaps another out-of-work actor throwing a knife at a copy machine?\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-08T12:02:00+00:00"
}