{
  "url": "https://voxday.net/2023/06/14/africa-in-the-uk/",
  "scraped_at": "2026-01-08T13:59:46.476001",
  "title": "Africa in the UK",
  "date_display": "June 14, 2023",
  "date_iso": "2023-06-14T11:03:54+00:00",
  "date_from_url": "2023-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember when the Sheriff of Nottinham was the portrait of an English bad guy? <a href=\"https://www.dailymail.co.uk/news/article-12193333/Nottingham-triple-murder-suspect-refuses-answer-questions.html\">Three people are murdered in Nottingham</a> and three more are injured by an African for no reason that any European would understand.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A West African migrant accused of the murders of three people in Nottingham yesterday is said to be refusing to answer questions from police – as he was described as having a history of petty drug dealing and mental health problems.</p><p>The 31-year-old, who is believed to have arrived in the country as a teenager and is not thought to be a refugee, is being questioned over the deaths of two students and a man in his 50s – as well as the injuring of three others.</p><p>He was known to police but does not have a criminal record, according to sources. The man, who has settled status, is believed to have lived in the UK for over a decade and was described by neighbours as a ‘very quiet guy’, the Telegraph reported.</p></blockquote><p>The dirt doesn’t define the people. The people define the dirt. If the migration patterns are not reversed, countries like England and France won’t merely be seeing pointless and inexplicable murders, they’ll be seeing cannibalism and <em>mutu </em>as well. Because nations are people, and people never change on the basis of geographic relocation.</p><p>This really isn’t that hard. All the mythic civnattery notwithstanding, neither the Spanish nor the English magically transformed into American Indians upon their geographic relocation to America. Africans don’t magically become Europeans upon geographic relocation to England, France, or Germany either.</p><p><a href=\"https://social.infogalactic.com/micropost/3349b7c4-2aac-4ec7-bf3e-9dac2ce1d83b\">DISCUSS ON SG</a></p></div>",
  "content_text": "Remember when the Sheriff of Nottinham was the portrait of an English bad guy?\nThree people are murdered in Nottingham\nand three more are injured by an African for no reason that any European would understand.\nA West African migrant accused of the murders of three people in Nottingham yesterday is said to be refusing to answer questions from police – as he was described as having a history of petty drug dealing and mental health problems.\nThe 31-year-old, who is believed to have arrived in the country as a teenager and is not thought to be a refugee, is being questioned over the deaths of two students and a man in his 50s – as well as the injuring of three others.\nHe was known to police but does not have a criminal record, according to sources. The man, who has settled status, is believed to have lived in the UK for over a decade and was described by neighbours as a ‘very quiet guy’, the Telegraph reported.\nThe dirt doesn’t define the people. The people define the dirt. If the migration patterns are not reversed, countries like England and France won’t merely be seeing pointless and inexplicable murders, they’ll be seeing cannibalism and\nmutu\nas well. Because nations are people, and people never change on the basis of geographic relocation.\nThis really isn’t that hard. All the mythic civnattery notwithstanding, neither the Spanish nor the English magically transformed into American Indians upon their geographic relocation to America. Africans don’t magically become Europeans upon geographic relocation to England, France, or Germany either.\nDISCUSS ON SG",
  "tags": [
    "immigration",
    "UK",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-14T11:03:57+00:00"
}