{
  "url": "https://voxday.net/2023/06/09/marvel-kills-the-punisher/",
  "scraped_at": "2026-01-08T13:59:20.440355",
  "title": "Marvel Kills The Punisher",
  "date_display": "June 9, 2023",
  "date_iso": "2023-06-09T15:28:03+00:00",
  "date_from_url": "2023-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.zerohedge.com/political/woke-marvel-eliminates-punisher-due-problematic-conservative-fan-base\">The Punisher has been cancelled and killed</a> by Marvel Comics. But fear not. Because Arkhaven is inevitable and The Legend is inexhaustible.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Punisher character (Frank Castle), originally created by writer Gerry Conway in 1974 with artists Ross Andru and John Romita, was a product of a chaotic era; a reaction to the rise of war, stagflation, instability and exploding crime rates in the US. The Punisher’s story is a tragedy of a returning military veteran whose family is killed during what seems to be a gangland hit. With federal agencies doing little to arrest the perpetrators, Castle takes matters into his own hands and begins systematically assassinating the criminals.</p><p>The concept of citizen crime stopping and vigilantism was becoming popular in the cultural zeitgeist in the 70s, with many people living in metropolitan areas dealing with increasing criminal violence and unreliable government protection. City governments in places like New York were actively restricting gun rights for law abiding people, which only made things easier for criminals.</p><p>The same exact conditions are returning to the US today, and debate is boiling once again on vigilantes (just look at the media fury over Kyle Rittenhouse or Daniel Penny). The mainstream left is adamantly opposed to any form of civilian intervention (unless it’s Antifa or BLM), while also being adamantly opposed to any intervention by police. In other words, they want to let criminals run wild and then threaten to prosecute anyone who dares to do anything about it.</p><p>The Punisher as an icon has been highly popular among conservatives, military veterans and law enforcement officers in recent years. The trademark skull symbol can be found everywhere, with patches, gear and flags sporting the image, often as a representation of citizens taking matters into their own hands. The symbol was also seen at the January 6th protests.</p><p>This has made leftists at Marvel Comics livid. They first attempted to make fundamental changes to the character, including a redesign of his popular skull symbol, as well as taking away his guns and giving him swords in 2021. Instead of fighting against criminal organizations, Frank Castle joins with one, violating his fundamental code of ethics.</p><p>This month, though, Marvel officially declared the Punisher persona non grata, eliminating the character as readers know him. Did he go out in a blaze of glory? No, in typical woke fashion Frank Castle is captured by progressive heroes, chained up and forced to go through a struggle session in which he is admonished as a murderer and a terrorist. Marvel even brings the Punisher’s wife back from the dead, only so that she can divorce him and take his money and property, and then inform him that his lifelong crusade against the criminal underworld was all for nothing.</p><p>The character then “dies” from apparent suicide but the story is left open to his return, just not as the gun-toting hero people know and love.</p> <cite>Woke Marvel Eliminates The Punisher Due To “Problematic” Conservative Fan Base, Zerohedge, 9 June 2023</cite></blockquote><p>It’s a timely article. One commenter at Zerohedge was perspicacious indeed.</p><p><em>This will end up being an opportunity for Arkhaven Comics. They have been capitalizing on Marvel’s and DC’s wokeness for a few years now.</em></p><p>And now, a word from the Legend.</p><p><em>“It’s not exactly a secret that the <strong>Punisher </strong>is my favorite character to write. For whatever reason I have an affinity for the guy and the stories came easily. But, if we’re being honest, Frank Castle was never a good fit at Marvel Comics. There were always restrictions when writing about him. Editors waved me off for “going too far.” Now I’m working on <strong>Black Warrant</strong> which is in the same vigilante justice genre except the guardrails, training wheels and safety bumpers have been taken off. I’m allowed to take this genre in places it’s never been taken and having a blast doing it.”</em></p><div class=\"wp-block-image\"><figure class=\"alignleft size-full is-resized\"><img alt=\"\" class=\"wp-image-58387\" decoding=\"async\" fetchpriority=\"high\" height=\"662\" sizes=\"(max-width: 384px) 100vw, 384px\" src=\"https://voxday.net/wp-content/uploads/2023/06/image-7.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/06/image-7.png 512w, https://voxday.net/wp-content/uploads/2023/06/image-7-174x300.png 174w\" width=\"384\"/></figure></div><p>He’s not kidding. I’ve read the first issue and it would not be an exaggeration to describe it as “hard-hitting”. <em>Black Warrant </em>will be the first superhero in a brand new superhero universe from Arkhaven Comics. The first script by the Legend is complete and the illustrating process is already underway. Helix Haze, the excellent illustrator of <em>Alt★Hero</em>: Q, is the illustrator.</p><p><em>Black Warrant</em> will be joined by <em>Red Hornet</em>, created by Vox Day, and another superhero who has been created by a third creator whose name will be very familiar to everyone here. The shared universe will not be part of the <em>Alt★Hero</em> universe, but will harken back to the Silver Age superheroes and will extend in time over a century from the dawn of the 20th Century to today.</p><p>While Arkhaven is 100 percent committed to its flagship comics and the <em>Alt★Hero</em> universe, as well as <em>Midnight’s War </em>and <em>Hypergamouse</em>, the fact that the wheels have completely come off the Big Two and their impending mutual collapse means that the opportunity to provide a more traditional superhero universe was simply too good to pass up. There are also some new developments on the production front which mean that over the course of the next year, we need more content in order to utilize our expanded production capacities, both for Castalia and Arkhaven as well as various independent publishers.</p><p><strong>UPDATE: </strong>Bounding Into Comics <a href=\"https://boundingintocomics.com/2023/06/09/as-marvel-kills-the-punisher-longtime-punisher-creator-chuck-dixon-announces-black-warrant-series/\">covers the announcement</a> of BLACK WARRANT, complete with images from the issue cited. To be honest, it’s already clear that our artwork will be better too.</p><p><em>As Marvel Kills The Punisher, Longtime ‘Punisher’ Creator Chuck Dixon Announces ‘Black Warrant’ Series</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/90acb76e-144b-45ec-8e4d-4c2081b197da\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Punisher has been cancelled and killed\nby Marvel Comics. But fear not. Because Arkhaven is inevitable and The Legend is inexhaustible.\nThe Punisher character (Frank Castle), originally created by writer Gerry Conway in 1974 with artists Ross Andru and John Romita, was a product of a chaotic era; a reaction to the rise of war, stagflation, instability and exploding crime rates in the US. The Punisher’s story is a tragedy of a returning military veteran whose family is killed during what seems to be a gangland hit. With federal agencies doing little to arrest the perpetrators, Castle takes matters into his own hands and begins systematically assassinating the criminals.\nThe concept of citizen crime stopping and vigilantism was becoming popular in the cultural zeitgeist in the 70s, with many people living in metropolitan areas dealing with increasing criminal violence and unreliable government protection. City governments in places like New York were actively restricting gun rights for law abiding people, which only made things easier for criminals.\nThe same exact conditions are returning to the US today, and debate is boiling once again on vigilantes (just look at the media fury over Kyle Rittenhouse or Daniel Penny). The mainstream left is adamantly opposed to any form of civilian intervention (unless it’s Antifa or BLM), while also being adamantly opposed to any intervention by police. In other words, they want to let criminals run wild and then threaten to prosecute anyone who dares to do anything about it.\nThe Punisher as an icon has been highly popular among conservatives, military veterans and law enforcement officers in recent years. The trademark skull symbol can be found everywhere, with patches, gear and flags sporting the image, often as a representation of citizens taking matters into their own hands. The symbol was also seen at the January 6th protests.\nThis has made leftists at Marvel Comics livid. They first attempted to make fundamental changes to the character, including a redesign of his popular skull symbol, as well as taking away his guns and giving him swords in 2021. Instead of fighting against criminal organizations, Frank Castle joins with one, violating his fundamental code of ethics.\nThis month, though, Marvel officially declared the Punisher persona non grata, eliminating the character as readers know him. Did he go out in a blaze of glory? No, in typical woke fashion Frank Castle is captured by progressive heroes, chained up and forced to go through a struggle session in which he is admonished as a murderer and a terrorist. Marvel even brings the Punisher’s wife back from the dead, only so that she can divorce him and take his money and property, and then inform him that his lifelong crusade against the criminal underworld was all for nothing.\nThe character then “dies” from apparent suicide but the story is left open to his return, just not as the gun-toting hero people know and love.\nWoke Marvel Eliminates The Punisher Due To “Problematic” Conservative Fan Base, Zerohedge, 9 June 2023\nIt’s a timely article. One commenter at Zerohedge was perspicacious indeed.\nThis will end up being an opportunity for Arkhaven Comics. They have been capitalizing on Marvel’s and DC’s wokeness for a few years now.\nAnd now, a word from the Legend.\n“It’s not exactly a secret that the\nPunisher\nis my favorite character to write. For whatever reason I have an affinity for the guy and the stories came easily. But, if we’re being honest, Frank Castle was never a good fit at Marvel Comics. There were always restrictions when writing about him. Editors waved me off for “going too far.” Now I’m working on\nBlack Warrant\nwhich is in the same vigilante justice genre except the guardrails, training wheels and safety bumpers have been taken off. I’m allowed to take this genre in places it’s never been taken and having a blast doing it.”\nHe’s not kidding. I’ve read the first issue and it would not be an exaggeration to describe it as “hard-hitting”.\nBlack Warrant\nwill be the first superhero in a brand new superhero universe from Arkhaven Comics. The first script by the Legend is complete and the illustrating process is already underway. Helix Haze, the excellent illustrator of\nAlt★Hero\n: Q, is the illustrator.\nBlack Warrant\nwill be joined by\nRed Hornet\n, created by Vox Day, and another superhero who has been created by a third creator whose name will be very familiar to everyone here. The shared universe will not be part of the\nAlt★Hero\nuniverse, but will harken back to the Silver Age superheroes and will extend in time over a century from the dawn of the 20th Century to today.\nWhile Arkhaven is 100 percent committed to its flagship comics and the\nAlt★Hero\nuniverse, as well as\nMidnight’s War\nand\nHypergamouse\n, the fact that the wheels have completely come off the Big Two and their impending mutual collapse means that the opportunity to provide a more traditional superhero universe was simply too good to pass up. There are also some new developments on the production front which mean that over the course of the next year, we need more content in order to utilize our expanded production capacities, both for Castalia and Arkhaven as well as various independent publishers.\nUPDATE:\nBounding Into Comics\ncovers the announcement\nof BLACK WARRANT, complete with images from the issue cited. To be honest, it’s already clear that our artwork will be better too.\nAs Marvel Kills The Punisher, Longtime ‘Punisher’ Creator Chuck Dixon Announces ‘Black Warrant’ Series\nDISCUSS ON SG",
  "tags": [
    "Arktoons",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-10T09:35:26+00:00"
}