{
  "url": "https://voxday.net/2023/06/17/of-truth-and-truth/",
  "scraped_at": "2026-01-08T14:00:03.813568",
  "title": "Of truth and Truth",
  "date_display": "June 17, 2023",
  "date_iso": "2023-06-17T15:10:14+00:00",
  "date_from_url": "2023-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Liars are very concerned that Christianity appears to make it harder for them to successfully lie to people:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A new study, published in something called the <em>Journal for the Scientific Study of Religion</em>, claims that both Christian nationalism and biblical literalism are independently associated with a greater tendency to believe in conspiracy theories. More to the progressive point, that study purportedly found when people believed in both Christian nationalism and biblical literalism, their distrust of government officials increased significantly. Egad!</p><p>In other words, they were more astute and less naïve.</p><p>Yet leftists believe that the findings provide insight into the socio-cultural factors that contribute to the inexplicable spread and persistence of “misinformation” — among certain groups of people.</p></blockquote><p>The more one is dedicated to discovering the truth, the more one finds oneself led inexorably toward the Way, the Truth, and the Life. It should not be a surprise that the People of the Lie wish to dissuade everyone from even beginning to learn what the truth of their reality is.</p><p><em><a href=\"https://social.infogalactic.com/micropost/843a07e7-ad17-4239-bc57-cd2fbe979621\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Liars are very concerned that Christianity appears to make it harder for them to successfully lie to people:\nA new study, published in something called the\nJournal for the Scientific Study of Religion\n, claims that both Christian nationalism and biblical literalism are independently associated with a greater tendency to believe in conspiracy theories. More to the progressive point, that study purportedly found when people believed in both Christian nationalism and biblical literalism, their distrust of government officials increased significantly. Egad!\nIn other words, they were more astute and less naïve.\nYet leftists believe that the findings provide insight into the socio-cultural factors that contribute to the inexplicable spread and persistence of “misinformation” — among certain groups of people.\nThe more one is dedicated to discovering the truth, the more one finds oneself led inexorably toward the Way, the Truth, and the Life. It should not be a surprise that the People of the Lie wish to dissuade everyone from even beginning to learn what the truth of their reality is.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "conspiracy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-17T15:10:16+00:00"
}