{
  "url": "https://voxday.net/2023/06/08/why-the-media-hated-the-pick-up-artists/",
  "scraped_at": "2026-01-08T13:59:11.993333",
  "title": "Why the Media Hated the Pick-Up Artists",
  "date_display": "June 8, 2023",
  "date_iso": "2023-06-08T09:54:52+00:00",
  "date_from_url": "2023-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because, as it turns out, pick-up artistry proved to be an effective means of penetrating morass of lies in which every young man has been enmeshed for the entirety of his life. <a href=\"https://krauserpua.com/2018/12/31/136-mere-christianity-c-s-lewis-book-review/\">Krauser reviews <em>Mere Christianity</em></a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Having followed atheism for a few decades and lived a highly individualist and pleasure-seeking life I became aware of what Christian moral philosophers have warned for hundreds of years: <span style=\"text-decoration: underline;\">atheism is a dead end</span>. It ends in nihilism. I experienced such nihilism in 2016 and by 2017 I was looking for a better way. So far there’s only been one barrier to my converting to Christianity: my lack of belief in God. Aside from that small obstacle, I agree with the thesis that Christianity is one of the three pillars of Western Civilisation (white nations and the Greco-Roman legacy being the other two) and by removing Christianity from the West we have set ourselves into a rapid decline into nihilism and paganism. It’s a shit show.</p><p>Anyway, I give this preamble to explain why I decided to read <em>Mere Christianity</em>. I realised that every single time that I am an expert on a topic and I compare my knowledge to the media’s, I realise the media isn’t simply wrong. They are deceitfully wrong. They are deliberately hiding the truth in order to advance a false narrative. Whether the topic is global finance, mixed martial arts, Game, or anything else the lesson is the same: the media are liars. So, knowing that the media is virulently anti-Christian, I asked myself the obvious question:</p><p><em>Does the media tell the truth about Christianity?</em></p><p>The chances aren’t high, are they? I don’t mean that the media is atheist and therefore do they support Christianity, but rather can they be trusted to speak accurately of what Christianity actually is, of what Christians actually believe?</p></blockquote><p>The logic is impeccable. And his conclusion is correct:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There is no logical inconsistency at all between the God of the Bible, salvation, and the existence of Evil.</p><p>I’m rather annoyed that I had to wait until I was 43 years old before learning that. I feel like I’ve been seriously lied to. It would’ve been nice if all those Philosophy Of Religion courses had laid out the arguments and let me make my own mind up.</p></blockquote><p>He was lied to. All of us were lied to, repeatedly. The observable existence of Evil is not a disproof of God or Christianity, for what should be the obvious reason that Evil is a necessary element in Christian theology. This pathway from hedonistic truth to spiritual truth may explain why a commenter at AC’s place observes a surprisingly common pattern.</p><p><em>Manosphere –&gt; Krauser / Heartise / Roosh –&gt; Vox –&gt; AC –&gt; Cabal and Evil Aware –&gt; God right down to the mentions in passing that blown the door open to the next stage could be a common pattern. Might explain why there was a never a hit piece on the likes of Krauser. And now Roosh is Christian I doubt they’d even whisper his name.</em></p><p>Remember, the truth always leads, eventually, to the Truth. And just as liars fear the truth, their masters fear the Way, the Truth, and the Life.</p><p>John 14:6.</p><p><em><a href=\"https://social.infogalactic.com/micropost/bdd3f935-2fd8-4a76-81c1-e62b623c5f27\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Because, as it turns out, pick-up artistry proved to be an effective means of penetrating morass of lies in which every young man has been enmeshed for the entirety of his life.\nKrauser reviews\nMere Christianity\n:\nHaving followed atheism for a few decades and lived a highly individualist and pleasure-seeking life I became aware of what Christian moral philosophers have warned for hundreds of years:\natheism is a dead end\n. It ends in nihilism. I experienced such nihilism in 2016 and by 2017 I was looking for a better way. So far there’s only been one barrier to my converting to Christianity: my lack of belief in God. Aside from that small obstacle, I agree with the thesis that Christianity is one of the three pillars of Western Civilisation (white nations and the Greco-Roman legacy being the other two) and by removing Christianity from the West we have set ourselves into a rapid decline into nihilism and paganism. It’s a shit show.\nAnyway, I give this preamble to explain why I decided to read\nMere Christianity\n. I realised that every single time that I am an expert on a topic and I compare my knowledge to the media’s, I realise the media isn’t simply wrong. They are deceitfully wrong. They are deliberately hiding the truth in order to advance a false narrative. Whether the topic is global finance, mixed martial arts, Game, or anything else the lesson is the same: the media are liars. So, knowing that the media is virulently anti-Christian, I asked myself the obvious question:\nDoes the media tell the truth about Christianity?\nThe chances aren’t high, are they? I don’t mean that the media is atheist and therefore do they support Christianity, but rather can they be trusted to speak accurately of what Christianity actually is, of what Christians actually believe?\nThe logic is impeccable. And his conclusion is correct:\nThere is no logical inconsistency at all between the God of the Bible, salvation, and the existence of Evil.\nI’m rather annoyed that I had to wait until I was 43 years old before learning that. I feel like I’ve been seriously lied to. It would’ve been nice if all those Philosophy Of Religion courses had laid out the arguments and let me make my own mind up.\nHe was lied to. All of us were lied to, repeatedly. The observable existence of Evil is not a disproof of God or Christianity, for what should be the obvious reason that Evil is a necessary element in Christian theology. This pathway from hedonistic truth to spiritual truth may explain why a commenter at AC’s place observes a surprisingly common pattern.\nManosphere –> Krauser / Heartise / Roosh –> Vox –> AC –> Cabal and Evil Aware –> God right down to the mentions in passing that blown the door open to the next stage could be a common pattern. Might explain why there was a never a hit piece on the likes of Krauser. And now Roosh is Christian I doubt they’d even whisper his name.\nRemember, the truth always leads, eventually, to the Truth. And just as liars fear the truth, their masters fear the Way, the Truth, and the Life.\nJohn 14:6.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "media",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-08T10:33:27+00:00"
}