{
  "url": "https://voxday.net/2023/06/13/why-clown-world-fears-russia/",
  "scraped_at": "2026-01-08T13:59:39.521994",
  "title": "Why Clown World Fears Russia",
  "date_display": "June 13, 2023",
  "date_iso": "2023-06-13T11:54:08+00:00",
  "date_from_url": "2023-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The piece connecting the war in Ukraine to the Q campaign and the panic across Clown World appears to be the founder of Burisma Holdings, who <a href=\"https://redstate.com/jenvanlaar/2023/06/12/exclusive-burisma-founder-mykola-zlochevsky-who-allegedly-bribed-joe-and-hunter-biden-is-an-svr-asset-n760320\">is now believed to be “an asset</a> of Russia’s Foreign Intelligence Service”:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Burisma Holdings founder Mykola Zlochevsky, who allegedly paid a total of $10 million in bribes to Joe and Hunter Biden in 2015 and 2016 in exchange for then-Vice President Joe Biden’s assistance in getting Ukrainian prosecutor Viktor Shokin fired, is believed to be an asset of Russia’s Foreign Intelligence Service (SVR) by the United States intelligence community, according to a national security source speaking to RedState on condition of anonymity. The official said:</p><p><em>“The US intelligence community has a high degree of confidence in their assessment of Zlochevsky as SVR. This is not a new assessment; the intelligence community under Obama knew this, and Obama was briefed on it. Joe Biden and Victoria Nuland were briefed as well.”</em></p><p>In a June 2021 RedState exclusive story about the defection of Chinese counterintelligence official Dong Jingwei, it was reported that among the “terabytes” of data Jingwei brought with him to the United States was information related to “details of meetings US government officials had (perhaps unwittingly) with Chinese spies and members of Russia’s SVR.”</p><p>It was revealed by Sen. Chuck Grassley (R-IA) on Monday that the “foreign national” mentioned in an FD-1023 form by a confidential human source (CHS) not only claimed to have bribed Hunter and Joe Biden but possessed a total of 17 audio recordings of his conversations with them about the arrangement. He created the recordings as a sort of “insurance policy.” It was not clear whether the FBI had copies of the audio recordings or not.</p><p><em>GRASSLEY: “The foreign national who allegedly bribed Joe and Hunter Biden allegedly has audio recording of his conversation with them. 17 such recordings…15 audio recordings of phone calls between him and Hunter Biden…two audio recordings of phone calls between him and… pic.twitter.com/0QdUMEKhOR</em></p><p>— Townhall.com (@townhallcom) June 12, 2023</p><p>Last week Reps. Marjorie Taylor Greene, Anna Paulina Luna, and Nancy Mace said that the foreign national identified in the FD-1023 form is Zlochevsky.</p></blockquote><p>This is, <a href=\"https://www.anonymousconservative.com/blog/news-briefs-06-13-2023/\">as AC has noted</a>, potentially an extremely big deal. What it may signify is that Russia, and therefore China, have all the information that is necessary to expose and destroy Clown World, root and branch. Everything from the Holocaust and the Moon landings to the legitimacy of the Biden administration appears to be fully documented by Russian intelligence, which would mean that Vladimir Putin can unleash chaos throughout the West and undermine every Western government simply by providing the verifiable truth of post-WWII history to the people of Europe and America.</p><p>I’ve suspected as much since Putin made a very specific reference to “the Empire of Lies” and the neoclowns reacted in much the same way vampires do to the offer of a garlic-infused shower of holy water coming out of a silver waterspout in the shape of a cross. I also suspect that this may be the basis of the post-2015 “Trump-Russia collusion” narrative that has never made any sense whatsoever in the electoral context provided.</p><p>We can only hope and pray that the Russians, and their secret allies, will soon do us the service of telling the rest of us what they already know to be true. All Clown World ever had over Russia was the threat of the US military, and now that threat appears to have been exposed as one that is entirely empty.</p><p><em><a href=\"https://social.infogalactic.com/micropost/34fd3120-af52-47ec-b0c7-8844b10ee8b8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The piece connecting the war in Ukraine to the Q campaign and the panic across Clown World appears to be the founder of Burisma Holdings, who\nis now believed to be “an asset\nof Russia’s Foreign Intelligence Service”:\nBurisma Holdings founder Mykola Zlochevsky, who allegedly paid a total of $10 million in bribes to Joe and Hunter Biden in 2015 and 2016 in exchange for then-Vice President Joe Biden’s assistance in getting Ukrainian prosecutor Viktor Shokin fired, is believed to be an asset of Russia’s Foreign Intelligence Service (SVR) by the United States intelligence community, according to a national security source speaking to RedState on condition of anonymity. The official said:\n“The US intelligence community has a high degree of confidence in their assessment of Zlochevsky as SVR. This is not a new assessment; the intelligence community under Obama knew this, and Obama was briefed on it. Joe Biden and Victoria Nuland were briefed as well.”\nIn a June 2021 RedState exclusive story about the defection of Chinese counterintelligence official Dong Jingwei, it was reported that among the “terabytes” of data Jingwei brought with him to the United States was information related to “details of meetings US government officials had (perhaps unwittingly) with Chinese spies and members of Russia’s SVR.”\nIt was revealed by Sen. Chuck Grassley (R-IA) on Monday that the “foreign national” mentioned in an FD-1023 form by a confidential human source (CHS) not only claimed to have bribed Hunter and Joe Biden but possessed a total of 17 audio recordings of his conversations with them about the arrangement. He created the recordings as a sort of “insurance policy.” It was not clear whether the FBI had copies of the audio recordings or not.\nGRASSLEY: “The foreign national who allegedly bribed Joe and Hunter Biden allegedly has audio recording of his conversation with them. 17 such recordings…15 audio recordings of phone calls between him and Hunter Biden…two audio recordings of phone calls between him and… pic.twitter.com/0QdUMEKhOR\n— Townhall.com (@townhallcom) June 12, 2023\nLast week Reps. Marjorie Taylor Greene, Anna Paulina Luna, and Nancy Mace said that the foreign national identified in the FD-1023 form is Zlochevsky.\nThis is,\nas AC has noted\n, potentially an extremely big deal. What it may signify is that Russia, and therefore China, have all the information that is necessary to expose and destroy Clown World, root and branch. Everything from the Holocaust and the Moon landings to the legitimacy of the Biden administration appears to be fully documented by Russian intelligence, which would mean that Vladimir Putin can unleash chaos throughout the West and undermine every Western government simply by providing the verifiable truth of post-WWII history to the people of Europe and America.\nI’ve suspected as much since Putin made a very specific reference to “the Empire of Lies” and the neoclowns reacted in much the same way vampires do to the offer of a garlic-infused shower of holy water coming out of a silver waterspout in the shape of a cross. I also suspect that this may be the basis of the post-2015 “Trump-Russia collusion” narrative that has never made any sense whatsoever in the electoral context provided.\nWe can only hope and pray that the Russians, and their secret allies, will soon do us the service of telling the rest of us what they already know to be true. All Clown World ever had over Russia was the threat of the US military, and now that threat appears to have been exposed as one that is entirely empty.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "conspiracy",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-06-13T11:54:10+00:00"
}