{
  "url": "https://voxday.net/2018/02/27/a-random-idea/",
  "scraped_at": "2025-12-19T10:45:09.843160",
  "title": "A random idea",
  "date_display": "February 27, 2018",
  "date_iso": "2018-02-27T18:00:17+00:00",
  "date_from_url": "2018-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>What would you ask Jesus? </i>I was thinking about this the other day. Actually, I was thinking about what I would ask Aristotle if I could. What is the single most pressing question to which I would like to know the answer? And then I wondered what other people would do… and I realized that while there weren’t very many people with questions for Aristotle, there were probably an awful lot who would have questions for Jesus. And that made me think about what a singularly fascinating book that might make.</p><p>Anyhow, if you’re interested, send me no more than 500 words about the one single question that you would ask Jesus Christ if you had the chance. All I want to know is your age, your sex, and your religion or lack thereof. Please also explicitly grant me permission to include your question in the book in your email.</p><p>Attachments should be .rtf, .docx, or .odt. Single-spaced, no tabs, no formatting, <u>and no more than 500 words</u>. If I get at least 100 questions and they prove to be sufficiently varied and interesting, I’ll edit them and put them together. I’ll also contact a few well-known individuals and ask them to contribute a question.</p></div>",
  "content_text": "What would you ask Jesus?\nI was thinking about this the other day. Actually, I was thinking about what I would ask Aristotle if I could. What is the single most pressing question to which I would like to know the answer? And then I wondered what other people would do… and I realized that while there weren’t very many people with questions for Aristotle, there were probably an awful lot who would have questions for Jesus. And that made me think about what a singularly fascinating book that might make.\nAnyhow, if you’re interested, send me no more than 500 words about the one single question that you would ask Jesus Christ if you had the chance. All I want to know is your age, your sex, and your religion or lack thereof. Please also explicitly grant me permission to include your question in the book in your email.\nAttachments should be .rtf, .docx, or .odt. Single-spaced, no tabs, no formatting,\nand no more than 500 words\n. If I get at least 100 questions and they prove to be sufficiently varied and interesting, I’ll edit them and put them together. I’ll also contact a few well-known individuals and ask them to contribute a question.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-27T18:00:17+00:00"
}