{
  "url": "https://voxday.net/2018/02/13/aipac-attacks-the-1st-amendment/",
  "scraped_at": "2025-12-19T10:43:17.869730",
  "title": "AIPAC attacks the 1st Amendment",
  "date_display": "February 13, 2018",
  "date_iso": "2018-02-13T13:27:10+00:00",
  "date_from_url": "2018-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I am a supporter of the state of Israel. I believe Israel has the right to exist. It has legitimately settled the land on which the nation presently resides and holds it by right of conquest, twice over. Like the Prime Minister of Israel, I think all Jews should return to their national homeland at their earliest convenience, both for their own sake and for the sake of the nations in which they currently reside. I do not believe the Jews are good for America nor do I believe that attempting to utilize American power for their own ends will prove to be good for the Jews in the long run. The present situation is an obvious lose-lose scenario, no matter what soaring rhetorical appeals anyone tries to make or how grotesquely they attempt to rewrite and misrepresent American history.</p><p>And as a friend of Israel, I will not hesitate to state that the ongoing attempt by AIPAC to directly assault the U.S. Constitution and the 1st Amendment is absolutely disastrous for both Americans and Jews, and is very dangerous for both the USA and for Israel. There is little more that the Jews could do to render themselves more disgusting and abhorrent to the average American, with the sole exception of directly attacking the 2nd Amendment, than supporting <a href=\"http://www.unz.com/pgiraldi/boycotting-israel-is-the-right-thing-to-do/\">the 25 state and federal laws that now attack the right of U.S. citizens to speak against Israel</a>.</p><blockquote><p>Here in the United States, the friends of Israel appear to believe that anyone who is unwilling to do business with Israel or even with the territories that it has illegally occupied should not be allowed to do business in any capacity with federal, state or even local governments. Constitutional guarantees of freedom of association for every American are apparently not valid if one particular highly favored foreign country is involved.</p><p>Twenty-four states now have legislation sanctioning those who criticize or boycott Israel. And one particular pending piece of federal legislation that is also continuing to make its way through the Senate would far exceed what is happening at the state level and would set a new standard for deference to Israeli interests on the part of the national government. It would criminalize any U.S. citizen “engaged in interstate or foreign commerce” who supports a boycott of Israel or who even goes about “requesting the furnishing of information” regarding it, with penalties enforced through amendments of two existing laws, the Export Administration Act of 1979 and the Export-Import Act of 1945, that include potential fines of between $250,000 and $1 million and up to 20 years in prison</p><p>According to the Jewish Telegraph Agency, the Senate bill was drafted with the assistance of AIPAC. The legislation, which would almost certainly be overturned as unconstitutional if it ever does in fact become law, is particularly dangerous and goes well beyond any previous pro-Israeli legislation as it essentially denies free of expression when the subject is Israel.</p><p>Israel is particularly fearful of the Boycott, Divest and Sanctions movement because its non-violence is attractive to college students, including many young Jews, who would not otherwise get involved on the issue. Benjamin Netanyahu and his government clearly understand, correctly, that BDS can do more damage than any number of terrorist attacks, as it challenges the actual legitimacy of the Israeli government and its colonizing activity in Palestine.</p></blockquote><p>I don’t believe in boycotting Israel. I am proud to edit and publish Israel’s greatest military historian, who also happens to be one of the greatest minds in military history; in the late Jerry Pournelle’s words, “a necessary addendum to Clausewitz.” In fact, I am happy to announce that Castalia House will be publishing a special hardcover edition of Martin van Creveld’s <i>Pussycats </i>later this year.</p><p>That being said, the inability of so many Jews to understand that using government power to try to limit the unalienable rights of Americans makes them the enemy of every self-respecting American, regardless of his politics or ideology, only underscores the observable fact that Jews are a separate nation, a distinct nation with their own culture, religion, language, traditions and values, and makes it clear that their ideals are intrinsically incompatible with the ideals of the American nation.</p></div>",
  "content_text": "Now, I am a supporter of the state of Israel. I believe Israel has the right to exist. It has legitimately settled the land on which the nation presently resides and holds it by right of conquest, twice over. Like the Prime Minister of Israel, I think all Jews should return to their national homeland at their earliest convenience, both for their own sake and for the sake of the nations in which they currently reside. I do not believe the Jews are good for America nor do I believe that attempting to utilize American power for their own ends will prove to be good for the Jews in the long run. The present situation is an obvious lose-lose scenario, no matter what soaring rhetorical appeals anyone tries to make or how grotesquely they attempt to rewrite and misrepresent American history.\nAnd as a friend of Israel, I will not hesitate to state that the ongoing attempt by AIPAC to directly assault the U.S. Constitution and the 1st Amendment is absolutely disastrous for both Americans and Jews, and is very dangerous for both the USA and for Israel. There is little more that the Jews could do to render themselves more disgusting and abhorrent to the average American, with the sole exception of directly attacking the 2nd Amendment, than supporting\nthe 25 state and federal laws that now attack the right of U.S. citizens to speak against Israel\n.\nHere in the United States, the friends of Israel appear to believe that anyone who is unwilling to do business with Israel or even with the territories that it has illegally occupied should not be allowed to do business in any capacity with federal, state or even local governments. Constitutional guarantees of freedom of association for every American are apparently not valid if one particular highly favored foreign country is involved.\nTwenty-four states now have legislation sanctioning those who criticize or boycott Israel. And one particular pending piece of federal legislation that is also continuing to make its way through the Senate would far exceed what is happening at the state level and would set a new standard for deference to Israeli interests on the part of the national government. It would criminalize any U.S. citizen “engaged in interstate or foreign commerce” who supports a boycott of Israel or who even goes about “requesting the furnishing of information” regarding it, with penalties enforced through amendments of two existing laws, the Export Administration Act of 1979 and the Export-Import Act of 1945, that include potential fines of between $250,000 and $1 million and up to 20 years in prison\nAccording to the Jewish Telegraph Agency, the Senate bill was drafted with the assistance of AIPAC. The legislation, which would almost certainly be overturned as unconstitutional if it ever does in fact become law, is particularly dangerous and goes well beyond any previous pro-Israeli legislation as it essentially denies free of expression when the subject is Israel.\nIsrael is particularly fearful of the Boycott, Divest and Sanctions movement because its non-violence is attractive to college students, including many young Jews, who would not otherwise get involved on the issue. Benjamin Netanyahu and his government clearly understand, correctly, that BDS can do more damage than any number of terrorist attacks, as it challenges the actual legitimacy of the Israeli government and its colonizing activity in Palestine.\nI don’t believe in boycotting Israel. I am proud to edit and publish Israel’s greatest military historian, who also happens to be one of the greatest minds in military history; in the late Jerry Pournelle’s words, “a necessary addendum to Clausewitz.” In fact, I am happy to announce that Castalia House will be publishing a special hardcover edition of Martin van Creveld’s\nPussycats\nlater this year.\nThat being said, the inability of so many Jews to understand that using government power to try to limit the unalienable rights of Americans makes them the enemy of every self-respecting American, regardless of his politics or ideology, only underscores the observable fact that Jews are a separate nation, a distinct nation with their own culture, religion, language, traditions and values, and makes it clear that their ideals are intrinsically incompatible with the ideals of the American nation.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-13T13:27:10+00:00"
}