{
  "url": "https://voxday.net/2018/02/20/an-alternative-to-suicide/",
  "scraped_at": "2025-12-19T10:44:06.719968",
  "title": "An alternative to suicide",
  "date_display": "February 20, 2018",
  "date_iso": "2018-02-20T10:13:37+00:00",
  "date_from_url": "2018-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AfD passes the Social Democrats <a href=\"https://www.wsj.com/articles/germanys-oldest-party-drops-below-right-wing-upstart-in-poll-1519064013\">in the German polls</a>:</p><blockquote><p>Germany’s main center-left party, the Social Democrats, saw its rating fall below that of the right-wing Alternative for Germany for the first time in an opinion poll published Monday, piling fresh ignominy on the country’s disintegrating center-left.</p><p>The news came on the day German Chancellor Angela Merkel appointed a new secretary general at her Christian Democratic Union, the country’s other big mainstream party, in a move widely interpreted as a first step toward engineering her succession and silencing ever louder critics within her own camp.</p><p>While unrelated, the two developments cast light on the crisis that engulfed Germany’s political center when the two parties that had dominated government here since the end of World War II both scored their worst election results in more than half-a-century late last year, leaving the country without a clear ruling majority.</p><p>The center-left SPD, the country’s oldest party, has suffered the most. It saw its rating drop to 15.5{220a6e635a8cea8828f626b668a05008bdf2fa6127b3db612f604ff4a9b5f0bd} in an INSA Consulere poll for the popular Bild daily published on Monday, the first time it had dropped behind the anti-establishment AfD, which rose one point to 16{220a6e635a8cea8828f626b668a05008bdf2fa6127b3db612f604ff4a9b5f0bd} in a week.</p><p>The phenomenon isn’t confined to Germany—the moderate left has suffered deep setbacks in France, the Czech Republic and the Netherlands in recent years—but it has left pollsters scratching their heads.</p><p>“The SPD is currently falling apart,” said INSA’s Hermann Binkert. “The AfD is currently the only party that’s decisively against everything that people upset about the political establishment.”</p></blockquote><p>The pollsters are either playing disingenuous or they are stupid. The reason the moderate left is being abandoned in Europe is the same reason that Republicans are on the rise in the USA despite the demographics being increasingly against them. Most people of European descent on the Left want to live in a progressive <i>white </i>country and despite their past enthusiasm for foreigners, minorities, and refugees, they have belatedly discovered that they don’t actually want their children to be a minority dominated by a variety of foreign interest groups with different cultures, traditions, and civilizational standards.</p><p>Not only that, but they are seeing their parties align with their decades-old political opponents as both globalized parties unite in a futile attempt to stop the rising nationalists.</p><p>Of course, in the SPD’s case, it doesn’t do much for their appeal that until one week ago, the party was being led by an EU apparatchik who has openly stated,  “For me, the new Germany exists only in order to ensure the existence of the State of Israel and the Jewish people.”</p></div>",
  "content_text": "AfD passes the Social Democrats\nin the German polls\n:\nGermany’s main center-left party, the Social Democrats, saw its rating fall below that of the right-wing Alternative for Germany for the first time in an opinion poll published Monday, piling fresh ignominy on the country’s disintegrating center-left.\nThe news came on the day German Chancellor Angela Merkel appointed a new secretary general at her Christian Democratic Union, the country’s other big mainstream party, in a move widely interpreted as a first step toward engineering her succession and silencing ever louder critics within her own camp.\nWhile unrelated, the two developments cast light on the crisis that engulfed Germany’s political center when the two parties that had dominated government here since the end of World War II both scored their worst election results in more than half-a-century late last year, leaving the country without a clear ruling majority.\nThe center-left SPD, the country’s oldest party, has suffered the most. It saw its rating drop to 15.5{220a6e635a8cea8828f626b668a05008bdf2fa6127b3db612f604ff4a9b5f0bd} in an INSA Consulere poll for the popular Bild daily published on Monday, the first time it had dropped behind the anti-establishment AfD, which rose one point to 16{220a6e635a8cea8828f626b668a05008bdf2fa6127b3db612f604ff4a9b5f0bd} in a week.\nThe phenomenon isn’t confined to Germany—the moderate left has suffered deep setbacks in France, the Czech Republic and the Netherlands in recent years—but it has left pollsters scratching their heads.\n“The SPD is currently falling apart,” said INSA’s Hermann Binkert. “The AfD is currently the only party that’s decisively against everything that people upset about the political establishment.”\nThe pollsters are either playing disingenuous or they are stupid. The reason the moderate left is being abandoned in Europe is the same reason that Republicans are on the rise in the USA despite the demographics being increasingly against them. Most people of European descent on the Left want to live in a progressive\nwhite\ncountry and despite their past enthusiasm for foreigners, minorities, and refugees, they have belatedly discovered that they don’t actually want their children to be a minority dominated by a variety of foreign interest groups with different cultures, traditions, and civilizational standards.\nNot only that, but they are seeing their parties align with their decades-old political opponents as both globalized parties unite in a futile attempt to stop the rising nationalists.\nOf course, in the SPD’s case, it doesn’t do much for their appeal that until one week ago, the party was being led by an EU apparatchik who has openly stated,  “For me, the new Germany exists only in order to ensure the existence of the State of Israel and the Jewish people.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-20T10:13:37+00:00"
}