{
  "url": "https://voxday.net/2018/02/07/anti-sports-are-perma-spammed/",
  "scraped_at": "2025-12-19T10:42:30.695936",
  "title": "Anti-sports are perma-spammed",
  "date_display": "February 7, 2018",
  "date_iso": "2018-02-07T12:12:21+00:00",
  "date_from_url": "2018-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just to be clear, I am no longer permitting any comments by the sports-hating Gamma crowd. Every anti-sports comment will be spammed on sight. Neither I nor anyone else cares why you don’t watch pro football, women’s badminton, men’s beach volleyball, or anything else, and we don’t appreciate your SJW-like attempts to interfere with what we happen to play, watch, and enjoy.</p><p>It was bad enough when the spaghetti-armed soyboys were littering every NFL thread with repetitive explanations of why they didn’t watch sports. (We already knew they didn’t ever <i>play </i>them.) But lately, they’ve been spamming unrelated threads with information about their non-watching habits and revealing far more than anyone ever wanted to know about their bizarre sexual obsessions.</p><p>I don’t care what people like or don’t like. And I am not interested in anyone’s opinions about what they don’t like and what they don’t follow. If you want to preach the gospel of hating sports for one reason or another, that’s fine, but do it on your own platform.</p><p>UPDATE: This was the fifth comment on this post: <i>“Fat Boomers are giving up the NFL but not Vox “True Alt-Right” Day lol”</i> So, I have turned off anonymous commenting on the blog because I have better things to do than clean up after the Fake Right. You will now have to be registered in order to comment here. You can thank the Alt-Retards for that. And they are so socially clueless that they will almost certainly hail this as a victory.</p><p>After all, nothing spells success like convincing people that you can’t be trusted not to shit all over the carpet.</p></div>",
  "content_text": "Just to be clear, I am no longer permitting any comments by the sports-hating Gamma crowd. Every anti-sports comment will be spammed on sight. Neither I nor anyone else cares why you don’t watch pro football, women’s badminton, men’s beach volleyball, or anything else, and we don’t appreciate your SJW-like attempts to interfere with what we happen to play, watch, and enjoy.\nIt was bad enough when the spaghetti-armed soyboys were littering every NFL thread with repetitive explanations of why they didn’t watch sports. (We already knew they didn’t ever\nplay\nthem.) But lately, they’ve been spamming unrelated threads with information about their non-watching habits and revealing far more than anyone ever wanted to know about their bizarre sexual obsessions.\nI don’t care what people like or don’t like. And I am not interested in anyone’s opinions about what they don’t like and what they don’t follow. If you want to preach the gospel of hating sports for one reason or another, that’s fine, but do it on your own platform.\nUPDATE: This was the fifth comment on this post:\n“Fat Boomers are giving up the NFL but not Vox “True Alt-Right” Day lol”\nSo, I have turned off anonymous commenting on the blog because I have better things to do than clean up after the Fake Right. You will now have to be registered in order to comment here. You can thank the Alt-Retards for that. And they are so socially clueless that they will almost certainly hail this as a victory.\nAfter all, nothing spells success like convincing people that you can’t be trusted not to shit all over the carpet.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-07T12:12:21+00:00"
}